#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//   Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
//   Реквизиты - Массив - список имен реквизитов объекта.
//
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("НастройкиПостроителя");
	Реквизиты.Добавить("ХранилищеДерева");
	Реквизиты.Добавить("Удалить_ТекстЗапроса");

	Реквизиты.Добавить("БДДС.ИД");
	
	Реквизиты.Добавить("ЗависимыеОбороты.ИД");
	Реквизиты.Добавить("ЗависимыеОбороты.ИД_Родитель");
	Реквизиты.Добавить("ЗависимыеОбороты.КомментарийРасчета");
	
	Реквизиты.Добавить("НаборыЗначенийДоступа.*");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// Функция подготавливает параметры проведения.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.бит_НазначениеСоответствияАналитик - ссылка на документ.
//  Отказ          - Булево - признак обнаружения ошибки и отказа от дальнейших действий.
//
// Возвращаемое значение:
//  Структура - структура параметров проведения.
//
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.КурсДокумента КАК КурсДокумента,
	|	Реквизиты.КратностьДокумента КАК КратностьДокумента,
	|	Реквизиты.СторнироватьЗависимыеОбороты КАК СторнироватьЗависимыеОбороты,
	|	Реквизиты.СверхБюджета КАК СверхБюджета,
	|	Реквизиты.Сценарий.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария,
	|	Реквизиты.Сценарий.Валюта КАК ВалютаСценария,
	|	Реквизиты.СценарийЭталон КАК СценарийЭталон,
	|	Реквизиты.РежимПринятияКУчету КАК РежимПринятияКУчету,
	|	Реквизиты.СписатьЛимиты КАК СписатьЛимиты
	|ИЗ
	|	Документ.бит_АктуализацияБюджета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить().Выгрузить();
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	
	Если НЕ бит_ОбщегоНазначения.ВалютаУпрУчетаУстановлена(Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;

	КурсыВалют = бит_Бюджетирование.КурсыВалютСценария(Реквизиты.Регистратор, 
											Реквизиты.Дата, Новый Структура("Документ, Регл, Упр, Сценарий"));
	
	Реквизиты.Вставить("КурсыВалют", КурсыВалют);
	
	ПриниматьКУчету = Истина;
	ПроводитьПослеУтверждения = ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения");
	Если ПроводитьПослеУтверждения И Реквизиты.РежимПринятияКУчету = 1 Тогда
		ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(ДокументСсылка);
		Если НЕ Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ТекущийСтатус,
					Перечисления.бит_ТипыСтатусовОбъектов.Утвержден) Тогда
			ПриниматьКУчету = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыПроведения.Вставить("ТаблицаСторноДоИзменения", Новый ТаблицаЗначений);
	ПараметрыПроведения.Вставить("ТаблицаОборотыПоБюджетам", Новый ТаблицаЗначений);
	ПараметрыПроведения.Вставить("ВозвратЛимита", Новый ТаблицаЗначений);
	
	ПараметрыНастройки 		= Новый Структура("ЦФО", Реквизиты.ЦФО);
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(ПараметрыНастройки,Реквизиты.Дата);
		
	Запрос.УстановитьПараметр("НеУчитыватьСверхБюджета", НеУчитыватьСверхБюджета);
	Запрос.УстановитьПараметр("СинонимБДДС", 			 НСтр("ru='Данные бюджета';en='Budget Data'"));
	Запрос.УстановитьПараметр("СинонимЗависимыеОбороты", НСтр("ru='Зависимые обороты';en='Dependent Line-Items'"));
	Запрос.УстановитьПараметр("СинонимДоИзменения", 	 НСтр("ru='До изменения';en='before the change'"));
	Запрос.УстановитьПараметр("Сценарий", 				 Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("СценарийЭталон", 		 Реквизиты.СценарийЭталон);
	Запрос.УстановитьПараметр("Валюта", 				 Реквизиты.ВалютаДокумента);
	
	Если Реквизиты.СценарийЭталон = Реквизиты.Сценарий Тогда
		СценарииСовпадают = Истина;
	Иначе	
		СценарииСовпадают = Ложь;
	КонецЕсли;
	
	ИнициализироватьКлючиАналитик(Реквизиты);
	
	НомераТаблиц = Новый Структура(); 
	ТекстЗапроса = ТекстЗапросаВременнаяТаблицаДокумента(НомераТаблиц)
				 + ТекстЗапросаТаблицыВалютногоПерерасчета(НомераТаблиц)
				 + ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц, СценарииСовпадают)
				 + ТекстЗапросаТаблицаОборотыПоБюджетам(НомераТаблиц, ПриниматьКУчету)
				 + ТекстЗапросаТаблицаСторноДоИзменения(НомераТаблиц, ПриниматьКУчету, СценарииСовпадают);
				 
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла; 	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Если Реквизиты.СторнироватьЗависимыеОбороты И ЗначениеЗаполнено(ПараметрыПроведения.ТаблицаСторноДоИзменения) Тогда
		НаборОбороты = РегистрыНакопления.бит_ОборотыПоБюджетам.СоздатьНаборЗаписей();
		НаборОбороты.Загрузить(ПараметрыПроведения.ТаблицаСторноДоИзменения);
		бит_Бюджетирование.СформироватьЗависимыеОборотыПоНаборуЗаписей(ДокументСсылка, НаборОбороты);
		ПараметрыПроведения.ТаблицаСторноДоИзменения = НаборОбороты.Выгрузить();
	КонецЕсли; 
	
	ПодготовитьТаблицыДокументаРасчетыВВалюте(ПараметрыПроведения, Реквизиты);	
	
	ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ПараметрыПроведения.ИсполнениеБюджета, 
		ПараметрыПроведения.ИсполнениеБюджетаРеквизиты);
		
	ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ПараметрыПроведения.ВозвратЛимита, 
		ПараметрыПроведения.ИсполнениеБюджетаРеквизиты);	
		
	Возврат ПараметрыПроведения;
	
КонецФункции 

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ФормированиеДерева

// Процедура обновляет дерево данных.
//
// Параметры:
//  ПараметрыОбновления	 - Структура - см. НовыеПараметрыОбновеления.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * ТабДок - ТабличныйДокумент - Табличный документ данных бюджета.
//  * ФактическиеДанные - ТаблицаЗначений - Данные для ТЧ ФактическиеДанные.
//  * БДДС - ТаблицаЗначений - Данные для ТЧ БДДС.
//  * ДоИзменения - ТаблицаЗначений - Данные для ТЧ ДоИзменения.
//
Функция ОбновитьДеревоДанных(ПараметрыОбновления) Экспорт
	
	ТабДок				= ПараметрыОбновления.ТабДок;
	НастройкаФормы		= ПараметрыОбновления.НастройкаФормы;
	Настройки			= ПараметрыОбновления.Настройки;
	ТекстЗапроса		= ПараметрыОбновления.ТекстЗапроса;
	Сценарий			= ПараметрыОбновления.Сценарий;
	СценарийЭталон		= ПараметрыОбновления.СценарийЭталон;
	
	Бюджет = Настройки.Бюджет;
	Если ЗначениеЗаполнено(Бюджет) И Справочники.бит_Бюджеты.БюджетЗапрещенВПланировании(Бюджет) Тогда
		ТекстИсключения = НСтр("ru = 'Выполнение операции остановлено.
								|Бюджет настройки формы ввода не должен содержать дубли статей оборотов.';
								|en = 'The operation is stopped.
								|Budget setting entry forms should not contain duplicates revolutions articles.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	МассивОтбор = ВывестиДеревоДанных(ПараметрыОбновления);
	
	ИмяИзмеренияРазворачивать = Настройки.ИмяРазворачивать;
	
	// Получение фактических данных.
	РезультатФакт = ПолучитьФактическиеДанные(МассивОтбор, ИмяИзмеренияРазворачивать, ПараметрыОбновления);
	ФактическиеДанные = РезультатФакт.Выгрузить();
	
	// Получение плановых данных.
	РезультатПлан = ПолучитьПлановыеДанные(МассивОтбор, ИмяИзмеренияРазворачивать, ПараметрыОбновления);
	БДДС = РезультатПлан.Выгрузить();
	
	ДоИзменения = БДДС.СкопироватьКолонки();
	Если СценарийЭталон = Сценарий Тогда
		ДоИзменения = БДДС.Скопировать();
		ДоИзменения.Колонки.Удалить("Сумма");
		ДоИзменения.Колонки.Удалить("Количество");
		
		Переименовать = Новый Структура(); 
		Переименовать.Вставить("КоличествоДоИзменения",		"Количество");
		Переименовать.Вставить("СуммаДоИзменения",			"Сумма");
		Переименовать.Вставить("СуммаРеглДоИзменения",		"СуммаРегл");
		Переименовать.Вставить("СуммаУпрДоИзменения",		"СуммаУпр");
		Переименовать.Вставить("СуммаСценарийДоИзменения",	"СуммаСценарий");
		
		Для каждого Колонки Из Переименовать Цикл
			ДоИзменения.Колонки[Колонки.Ключ].Имя = Колонки.Значение;
		КонецЦикла;
	КонецЕсли; 
	
	БДДС.Колонки.Добавить("ИД", Новый ОписаниеТипов("Строка"));
	Для каждого СтрокаТаблицы Из БДДС Цикл	
		СтрокаТаблицы.ИД = Строка(Новый УникальныйИдентификатор);	
	КонецЦикла; 
	
	// Установка значений в дерево.
	УстановитьЗначенияВДерево(ИмяИзмеренияРазворачивать, БДДС, ФактическиеДанные, ПараметрыОбновления);
	
	Результат = Новый Структура;
	Результат.Вставить("ТабДок",			ПараметрыОбновления.ТабДок);	
	Результат.Вставить("ФактическиеДанные",	ФактическиеДанные);	
	Результат.Вставить("БДДС",				БДДС);
	Результат.Вставить("ДоИзменения",		ДоИзменения);
	
	Возврат Результат;
	
КонецФункции

// Процедура восстанавливает дерево по данным.
//
// Параметры:
//  ПараметрыВосстановления	 - Структура - см. НовыеПараметрыВосстановления.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * ТабДок - ТабличныйДокумент - Табличный документ данных бюджета.
//
Функция ВосстановитьДеревоПоДанным(ПараметрыВосстановления) Экспорт
	
	ТабДок				= ПараметрыВосстановления.ТабДок;
	НастройкаФормы		= ПараметрыВосстановления.НастройкаФормы;
	Настройки			= ПараметрыВосстановления.Настройки;
	ТекстЗапроса		= ПараметрыВосстановления.ТекстЗапроса;
	БДДС				= ПараметрыВосстановления.БДДС;
	ФактическиеДанные	= ПараметрыВосстановления.ФактическиеДанные;
	
	Бюджет = Настройки.Бюджет;
	Если ЗначениеЗаполнено(Бюджет) И Справочники.бит_Бюджеты.БюджетЗапрещенВПланировании(Бюджет) Тогда
		ВызватьИсключение НСтр("ru='Выполнение операции остановлено.
								|Бюджет настройки формы ввода не должен содержать дубли статей оборотов.';
							   	|en='The operation is stopped.
								|Budget setting entry forms should not contain duplicates revolutions articles.'");
	КонецЕсли;
	
	ВывестиДеревоДанных(ПараметрыВосстановления);
	
	// Установка значений в дерево.
	УстановитьЗначенияВДерево(Настройки.ИмяРазворачивать, БДДС, ФактическиеДанные, ПараметрыВосстановления);

	Результат = Новый Структура;
	Результат.Вставить("ТабДок", ПараметрыВосстановления.ТабДок);	
	
	Возврат Результат;
	
КонецФункции

// Процедура выполняет актуализацию.
//
// Параметры:
//  ПараметрыАктуализации	 - Структура - см. НовыеПараметрыАктуализации.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * БДДС - ТаблицаЗначений - Данные для ТЧ БДДС.
//
Функция ВыполнитьАктуализацию(ПараметрыАктуализации) Экспорт
	
	АналитикиБДДСДляПодстановки		= ПараметрыАктуализации.АналитикиБДДСДляПодстановки;
	Настройки						= ПараметрыАктуализации.Настройки;
	Периодичность					= ПараметрыАктуализации.Периодичность;
	ПродолжительностьИнтервала		= ПараметрыАктуализации.ПродолжительностьИнтервала;
	ДатаАктуализации				= ПараметрыАктуализации.ДатаАктуализации;
	ДатаНачалаПланирования			= ПараметрыАктуализации.ДатаНачалаПланирования;
	БДДС							= ПараметрыАктуализации.БДДС;
	ФактическиеДанные				= ПараметрыАктуализации.ФактическиеДанные;
	СпособАктуализации				= ПараметрыАктуализации.СпособАктуализации;
	ПрофильРаспределения			= ПараметрыАктуализации.ПрофильРаспределения;
	НеАктуализироватьФактБольшеПлана= ПараметрыАктуализации.НеАктуализироватьФактБольшеПлана;

	ПериодичностьСтр = бит_ОбщегоНазначения.ПолучитьИмяЗначенияПеречисления(Перечисления.бит_ПериодичностьПланирования,
						Периодичность);
	КоличествоИнтерваловФакт = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(ДатаНачалаПланирования, ДатаАктуализации,
						ПериодичностьСтр);
	КоличествоИнтерваловПлан = ПродолжительностьИнтервала - КоличествоИнтерваловФакт;
	
	ФактическиеДанные.Сортировать("Период");
	БДДС.Сортировать("Период");
	
	// Сформируем сетку дат для дополнения таблицы план.
	ТаблицаПериоды = СформироватьТаблицуПериодов(ДатаНачалаПланирования, Периодичность, ПродолжительностьИнтервала);
	
	Профиль = Новый Соответствие;
	
	Если СпособАктуализации = Перечисления.бит_СпособыАктуализации.ПоПрофилю 
	   И ЗначениеЗаполнено(ПрофильРаспределения) Тогда
		
		// Подготовка коэффициентов по периодам
		Коэффициенты = Справочники.бит_ПрофилиРаспределенияПоПериодам.ПолучитьКоэффициенты(ПрофильРаспределения, "К");
		
		Счетчик = 1;
		Для каждого СтрокаПериод Из ТаблицаПериоды Цикл
			
			Если СтрокаПериод.Период >= ДатаАктуализации Тогда
				// Периоды профиля начинаем отсчитывать с начала актуализации с 1.
				Коэффициент = Коэффициенты[Счетчик];
				Если НЕ ТипЗнч(Коэффициент) = Тип("Число") Тогда
					Коэффициент = 0;
				КонецЕсли; 
				Счетчик = Счетчик + 1;			
			Иначе
				Коэффициент = 0;
			КонецЕсли; 
			
			Профиль.Вставить(СтрокаПериод.Период, Коэффициент);			
			
		КонецЦикла; 
	КонецЕсли; 
	
	Пропорционально = Ложь;
	Если СпособАктуализации = Перечисления.бит_СпособыАктуализации.Пропорционально Тогда
		Пропорционально = Истина;	
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый	МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаФакт",			ФактическиеДанные);
	Запрос.УстановитьПараметр("ТаблицаПлан",			БДДС);
	Запрос.УстановитьПараметр("ТаблицаПериоды",			ТаблицаПериоды);
	Запрос.УстановитьПараметр("ДатаАктуализации"      ,	ДатаАктуализации);
	Запрос.УстановитьПараметр("ДатаНачалаПланирования",	ДатаНачалаПланирования);
	Запрос.УстановитьПараметр("КоличествоИнтервалов",	ПродолжительностьИнтервала);
	Запрос.УстановитьПараметр("Пропорционально",		Пропорционально);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаФакт.Измерение КАК Измерение,
	|	ТаблицаФакт.Сумма КАК Сумма,
	|	ТаблицаФакт.Количество КАК Количество,
	|	ТаблицаФакт.Период КАК Период
	|ПОМЕСТИТЬ Факт
	|ИЗ
	|	&ТаблицаФакт КАК ТаблицаФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПлан.Измерение КАК Измерение,
	|	ТаблицаПлан.Период КАК Период,
	|	ТаблицаПлан.Сумма КАК Сумма,
	|	ТаблицаПлан.Количество КАК Количество,
	|	ТаблицаПлан.Ид КАК Ид
	|ПОМЕСТИТЬ План
	|ИЗ
	|	&ТаблицаПлан КАК ТаблицаПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПериоды.Период КАК Период
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	&ТаблицаПериоды КАК ТаблицаПериоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.Период КАК Период,
	|	План.Измерение КАК Измерение
	|ПОМЕСТИТЬ ПериодИзмерение
	|ИЗ
	|	Периоды КАК Периоды,
	|	План КАК План
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	План.Измерение КАК Измерение,
	|	План.Период КАК Период,
	|	План.Сумма КАК Сумма,
	|	План.Количество КАК Количество,
	|	План.Ид КАК ИД,
	|	1 КАК ЧислоПериодовПлан
	|ПОМЕСТИТЬ ПланПолный
	|ИЗ
	|	План КАК План
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПериодИзмерение.Измерение,
	|	ПериодИзмерение.Период,
	|	0,
	|	0,
	|	-99999999,
	|	ВЫБОР КОГДА &Пропорционально ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
	|ИЗ
	|	ПериодИзмерение КАК ПериодИзмерение
	|		ЛЕВОЕ СОЕДИНЕНИЕ План КАК План
	|		ПО (План.Измерение = ПериодИзмерение.Измерение)
	|			И (План.Период = ПериодИзмерение.Период)
	|ГДЕ
	|	План.Измерение ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Факт.Измерение КАК Измерение,
	|	СУММА(Факт.Сумма) КАК Сумма,
	|	СУММА(Факт.Количество) КАК Количество,
	|	Факт.Период КАК Период
	|ПОМЕСТИТЬ ИтогиПоФактуВПериоде
	|ИЗ
	|	Факт КАК Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	Факт.Измерение,
	|	Факт.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Факт.Измерение КАК Измерение,
	|	СУММА(Факт.Сумма) КАК Сумма,
	|	СУММА(Факт.Количество) КАК Количество
	|ПОМЕСТИТЬ ИтогиПоФакту
	|ИЗ
	|	Факт КАК Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	Факт.Измерение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	План.Измерение КАК Измерение,
	|	План.Период КАК Период,
	|	СУММА(План.Сумма) КАК Сумма,
	|	СУММА(План.Количество) КАК Количество
	|ПОМЕСТИТЬ Запланировано
	|ИЗ
	|	План КАК План
	|
	|СГРУППИРОВАТЬ ПО
	|	План.Измерение,
	|	План.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	План.Измерение КАК Измерение,
	|	СУММА(План.Сумма) КАК Сумма,
	|	СУММА(План.Количество) КАК Количество
	|ПОМЕСТИТЬ Актуализировать
	|ИЗ
	|	План КАК План
	|ГДЕ
	|	План.Период >= &ДатаАктуализации
	|
	|СГРУППИРОВАТЬ ПО
	|	План.Измерение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	План.Измерение КАК Измерение,
	|	СУММА(План.Сумма) КАК Сумма,
	|	СУММА(План.Количество) КАК Количество
	|ПОМЕСТИТЬ ИсполненныйПлан
	|ИЗ
	|	План КАК План
	|ГДЕ
	|	План.Период < &ДатаАктуализации
	|
	|СГРУППИРОВАТЬ ПО
	|	План.Измерение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ИсполненныйПлан.Измерение, ИтогиПоФакту.Измерение) КАК Измерение,
	|	ЕСТЬNULL(ИтогиПоФакту.Сумма, 0) - ЕСТЬNULL(ИсполненныйПлан.Сумма, 0) КАК СуммаАктуализация,
	|	ЕСТЬNULL(ИтогиПоФакту.Количество, 0) - ЕСТЬNULL(ИсполненныйПлан.Количество, 0) КАК КоличествоАктуализация,
	|	РАЗНОСТЬДАТ(&ДатаНачалаПланирования, &ДатаАктуализации, МЕСЯЦ) КАК КоличествоИнтерваловФакт,
	|	&КоличествоИнтервалов - РАЗНОСТЬДАТ(&ДатаНачалаПланирования, &ДатаАктуализации, МЕСЯЦ) КАК КоличествоИнтерваловПлан
	|ПОМЕСТИТЬ СуммыАктуализации
	|ИЗ
	|	ИсполненныйПлан КАК ИсполненныйПлан
	|		ПОЛНОЕ СОЕДИНЕНИЕ ИтогиПоФакту КАК ИтогиПоФакту
	|		ПО ИсполненныйПлан.Измерение = ИтогиПоФакту.Измерение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПолныйПлан.ИД КАК Ид,
	|	ПолныйПлан.Измерение КАК Измерение,
	|	ПолныйПлан.Период КАК Период,
	|	0 КАК КоэффициентПериодСумма,
	|	0 КАК КоэффициентПериодКоличество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Запланировано.Сумма, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ПолныйПлан.Сумма / Запланировано.Сумма
	|	КОНЕЦ КАК КоэффициентСумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Запланировано.Количество, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ПолныйПлан.Количество / Запланировано.Количество
	|	КОНЕЦ КАК КоэффициентКоличество,
	|	ЕСТЬNULL(СуммыАктуализации.СуммаАктуализация, 0) КАК СуммаКАктуализации,
	|	ЕСТЬNULL(СуммыАктуализации.КоличествоАктуализация, 0) КАК КоличествоКАктуализации,
	|	ЕСТЬNULL(Запланировано.Сумма, 0) КАК СуммаИтог,
	|	ЕСТЬNULL(Запланировано.Количество, 0) КАК КоличествоИтог,
	|	ЕСТЬNULL(ИтогиПоФактуВПериоде.Сумма, 0) КАК СуммаФакт,
	|	ЕСТЬNULL(ИтогиПоФактуВПериоде.Количество, 0) КАК КоличествоФакт,
	|	ПолныйПлан.Сумма КАК Сумма,
	|	ПолныйПлан.Количество КАК Количество,
	|	Актуализировать.Сумма КАК СуммаПлан,
	|	Актуализировать.Количество КАК КоличествоПлан,
	|	ЕСТЬNULL(Запланировано.Сумма, 0) КАК СуммаПланИтог,
	|	ЕСТЬNULL(ИтогиПоФактуВПериоде.Сумма, 0) КАК СуммаФактИтог,
	|	ЕСТЬNULL(Запланировано.Количество, 0) КАК КоличествоПланИтог,
	|	ЕСТЬNULL(ИтогиПоФактуВПериоде.Количество, 0) КАК КоличествоФактИтог,
	|	0 КАК К1,
	|	ПолныйПлан.ЧислоПериодовПлан КАК ЧислоПериодовПлан
	|ИЗ
	|	ПланПолный КАК ПолныйПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ Запланировано КАК Запланировано
	|		ПО ПолныйПлан.Измерение = Запланировано.Измерение
	|			И ПолныйПлан.Период = Запланировано.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыАктуализации КАК СуммыАктуализации
	|		ПО ПолныйПлан.Измерение = СуммыАктуализации.Измерение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиПоФактуВПериоде КАК ИтогиПоФактуВПериоде
	|		ПО ПолныйПлан.Измерение = ИтогиПоФактуВПериоде.Измерение
	|			И ПолныйПлан.Период = ИтогиПоФактуВПериоде.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Актуализировать КАК Актуализировать
	|		ПО ПолныйПлан.Измерение = Актуализировать.Измерение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Измерение,
	|	Период,
	|	Ид
	|ИТОГИ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(МАКСИМУМ(СуммаПлан), 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ СУММА(ПолныйПлан.Сумма) / МАКСИМУМ(СуммаПлан)
	|	КОНЕЦ КАК КоэффициентПериодСумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(МАКСИМУМ(КоличествоПлан), 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ СУММА(ПолныйПлан.Количество) / МАКСИМУМ(КоличествоПлан)
	|	КОНЕЦ КАК КоэффициентПериодКоличество,
	|	МАКСИМУМ(СуммаКАктуализации),
	|	МАКСИМУМ(КоличествоКАктуализации),
	|	МАКСИМУМ(СуммаИтог),
	|	МАКСИМУМ(КоличествоИтог),
	|	МАКСИМУМ(СуммаФакт),
	|	МАКСИМУМ(КоличествоФакт),
	|	СУММА(КоличествоПлан),
	|	СУММА(СуммаПланИтог),
	|	СУММА(СуммаФактИтог),
	|	СУММА(КоличествоПланИтог),
	|	СУММА(КоличествоФактИтог),
	|	СУММА(ЧислоПериодовПлан)
	|ПО
	|	Измерение,
	|	Период";				   
	
	Результат = Запрос.Выполнить();
	ДеревоАктуализация = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Подготовка дополнительных параметров для проведения актуализации.
	МассивИменРазворачивать = Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать];
	
	ПараметрыРаспределения = Новый Структура;
	ПараметрыРаспределения.Вставить("ДатаАктуализации");
	ПараметрыРаспределения.Вставить("СпособАктуализации");
	ПараметрыРаспределения.Вставить("НеАктуализироватьФактБольшеПлана");
	ПараметрыРаспределения.Вставить("БДДС");

	ЗаполнитьЗначенияСвойств(ПараметрыРаспределения, ПараметрыАктуализации);
	
	ПараметрыРаспределения.Вставить("ИменаРазворачивать",			МассивИменРазворачивать);
	ПараметрыРаспределения.Вставить("АналитикиБДДСДляПодстановки",	АналитикиБДДСДляПодстановки);
	ПараметрыРаспределения.Вставить("Профиль",						Профиль);
	ПараметрыРаспределения.Вставить("КоличествоИнтерваловПлан",		КоличествоИнтерваловПлан);
	
	// Выполнение актуализации.
	КоличествоИзмерений = ДеревоАктуализация.Строки.Количество();
	Счетчик = 1;
	Для каждого СтрокаИзмерение Из ДеревоАктуализация.Строки Цикл
		
		Если Настройки.УчетСумма Тогда
			Если СтрокаИзмерение.СуммаФактИтог < СтрокаИзмерение.СуммаПланИтог Тогда
				ВыполнитьАктуализациюПоИзмерению(СтрокаИзмерение, "Сумма", ПараметрыРаспределения);
			КонецЕсли; 
		КонецЕсли; 
		
		Если Настройки.УчетКоличество Тогда
			Если СтрокаИзмерение.КоличествоФактИтог < СтрокаИзмерение.КоличествоПланИтог Тогда
				ВыполнитьАктуализациюПоИзмерению(СтрокаИзмерение, "Количество", ПараметрыРаспределения);
			КонецЕсли; 
		КонецЕсли; 
		
		Счетчик = Счетчик+1;	
	КонецЦикла;
	
	СтрОтбор = Новый Структура;
	СтрОтбор.Вставить("Сумма", 0);
	СтрОтбор.Вставить("Количество", 0);
	
	МассивСтрок = БДДС.НайтиСтроки(СтрОтбор);
	
	Для каждого ТекущаяСтрока Из МассивСтрок Цикл
		БДДС.Удалить(ТекущаяСтрока);
	КонецЦикла; 

	Результа = Новый Структура;
	Результа.Вставить("БДДС", БДДС);
	Возврат Результа;
	
КонецФункции

// Параметры для функций обновления данных.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * ТабДок - ТабличныйДокумент - Заготовка под макет.
//  * НастройкаФормы - СправочникСсылка.бит_НастройкиФормВводаБюджета - Выбранная настройка формы ввода бюджета.
//  * Настройки - Структура - Свойства настройки формы ввода бюджета.
//  * ТекстЗапроса - Строка - Текст запроса для актуализации.
//  * Сценарий - СправочникСсылка.СценарииПланирования - Сценарий.
//  * СценарийЭталон - СправочникСсылка.СценарииПланирования - Сценарий эталон.
//  * СценарийФакт - СправочникСсылка.СценарииПланирования - Сценарий факт.
//  * СхемаКомпоновкиСтруктура - СхемаКомпоновкиДанных - Схема компоновки данных.
//  * НастройкиКомпоновщикаСтруктура - НастройкиКомпоновкиДанных - Настройки компоновки данных.
//  * СхемаКомпоновкиДанные - СхемаКомпоновкиДанных - Схема компоновки данных.
//  * НастройкиКомпоновщикаДанные - НастройкиКомпоновкиДанных - Настройки компоновки данных.
//  * Дата - Дата - Дата документа.
//  * Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования - Периодичность планирования.
//  * ДатаНачалаПланирования - Дата - Дата начала планирования.
//  * ДатаОкончанияПланирования - Дата - Дата окончания планирования.
//  * ПродолжительностьИнтервала - Число - Количество интервалов.
//  * ДатаАктуализации - Дата - Дата актуализации.
//  * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
//
Функция НовыеПараметрыОбновеления() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТабДок",							Новый ТабличныйДокумент());
	Параметры.Вставить("НастройкаФормы",					Справочники.бит_НастройкиФормВводаБюджета.ПустаяСсылка());
	Параметры.Вставить("Настройки",							Новый Структура);
	Параметры.Вставить("ТекстЗапроса",						"");
	Параметры.Вставить("Сценарий",							Справочники.СценарииПланирования.ПустаяСсылка());
	Параметры.Вставить("СценарийЭталон",					Справочники.СценарииПланирования.ПустаяСсылка());
	Параметры.Вставить("СценарийФакт",						Справочники.СценарииПланирования.ПустаяСсылка());
	Параметры.Вставить("СхемаКомпоновкиСтруктура",			Новый СхемаКомпоновкиДанных);
	Параметры.Вставить("НастройкиКомпоновщикаСтруктура",	Новый НастройкиКомпоновкиДанных);
	Параметры.Вставить("СхемаКомпоновкиДанные",				Новый СхемаКомпоновкиДанных);
	Параметры.Вставить("НастройкиКомпоновщикаДанные",		Новый НастройкиКомпоновкиДанных);
	Параметры.Вставить("Дата",								Дата(1,1,1));
	Параметры.Вставить("Периодичность",						Перечисления.бит_ПериодичностьПланирования.ПустаяСсылка());
	Параметры.Вставить("ДатаНачалаПланирования",			Дата(1,1,1));
	Параметры.Вставить("ДатаОкончанияПланирования",			Дата(1,1,1));
	Параметры.Вставить("ПродолжительностьИнтервала",		12);
	Параметры.Вставить("ДатаАктуализации",					Дата(1,1,1));
	Параметры.Вставить("ВалютаДокумента",					Справочники.Валюты.ПустаяСсылка());
	
	Возврат Параметры;
	
КонецФункции

// Параметры для функций восстановления данных.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * ТабДок - ТабличныйДокумент - Заготовка под макет.
//  * НастройкаФормы - СправочникСсылка.бит_НастройкиФормВводаБюджета - Выбранная настройка формы ввода бюджета.
//  * Настройки - Структура - Свойства настройки формы ввода бюджета.
//  * ТекстЗапроса - Строка - Текст запроса для актуализации.
//  * СхемаКомпоновкиСтруктура - СхемаКомпоновкиДанных - Схема компоновки данных.
//  * НастройкиКомпоновщикаСтруктура - НастройкиКомпоновкиДанных - Настройки компоновки данных.
//  * Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования - Периодичность планирования.
//  * ДатаНачалаПланирования - Дата - Дата начала планирования.
//  * ДатаОкончанияПланирования - Дата - Дата окончания планирования.
//  * ПродолжительностьИнтервала - Число - Количество интервалов.
//  * ДатаАктуализации - Дата - Дата актуализации.
//  * БДДС - ТаблицаЗначений - Данные ТЧ БДДС.
//  * ФактическиеДанные - ТаблицаЗначений - Данные ТЧ ФактическиеДанные.
//
Функция НовыеПараметрыВосстановления() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТабДок",							Новый ТабличныйДокумент());
	Параметры.Вставить("НастройкаФормы",					Справочники.бит_НастройкиФормВводаБюджета.ПустаяСсылка());
	Параметры.Вставить("Настройки",							Новый Структура);
	Параметры.Вставить("ТекстЗапроса",						"");
	Параметры.Вставить("СхемаКомпоновкиСтруктура",			Новый СхемаКомпоновкиДанных);
	Параметры.Вставить("НастройкиКомпоновщикаСтруктура",	Новый НастройкиКомпоновкиДанных);
	Параметры.Вставить("Периодичность",						Перечисления.бит_ПериодичностьПланирования.ПустаяСсылка());
	Параметры.Вставить("ДатаНачалаПланирования",			Дата(1,1,1));
	Параметры.Вставить("ДатаОкончанияПланирования",			Дата(1,1,1));
	Параметры.Вставить("ПродолжительностьИнтервала",		12);
	Параметры.Вставить("ДатаАктуализации",					Дата(1,1,1));
	Параметры.Вставить("БДДС",								Новый ТаблицаЗначений);
	Параметры.Вставить("ФактическиеДанные",					Новый ТаблицаЗначений);
	
	Возврат Параметры;
	
КонецФункции

// Параметры для функций актуализации данных.
// 
// Возвращаемое значение:
//  Структура - Структура параметров:
//  * АналитикиБДДСДляПодстановки - Структура - Аналитики БДДС для подстановки.
//  * Настройки - Структура - свойства настройки формы ввода бюджета.
//  * Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования - Периодичность планирования.
//  * ПродолжительностьИнтервала - Число - Количество интервалов.
//  * ДатаАктуализации - Дата - Дата актуализации.
//  * ДатаНачалаПланирования - Дата - Дата начала планирования.
//  * СпособАктуализации -  ПеречислениеСсылка.бит_СпособыАктуализации - Способ актуализации.
//  * ПрофильРаспределения - СправочникСсылка.бит_ПрофилиРаспределенияПоПериодам - Профиль распределения.
//  * НеАктуализироватьФактБольшеПлана - Булево - Свойство документа Актуализации.
//  * БДДС - ТаблицаЗначений - Данные ТЧ БДДС, нужны только для восстановления.
//  * ФактическиеДанные - ТаблицаЗначений - Данные ТЧ ФактическиеДанные.
//
Функция НовыеПараметрыАктуализации() Экспорт
	
	Параметры = Новый Структура;
 	Параметры.Вставить("АналитикиБДДСДляПодстановки",		Новый Структура);
	Параметры.Вставить("Настройки",							Новый Структура);
 	Параметры.Вставить("Периодичность",						Перечисления.бит_ПериодичностьПланирования.ПустаяСсылка());
 	Параметры.Вставить("ПродолжительностьИнтервала",		12);
	Параметры.Вставить("ДатаАктуализации",					Дата(1,1,1));
	Параметры.Вставить("ДатаНачалаПланирования",			Дата(1,1,1));
	Параметры.Вставить("СпособАктуализации",				Перечисления.бит_СпособыАктуализации.ПустаяСсылка());
	Параметры.Вставить("ПрофильРаспределения",				Справочники.бит_ПрофилиРаспределенияПоПериодам.ПустаяСсылка());
	Параметры.Вставить("НеАктуализироватьФактБольшеПлана",	Ложь);
	Параметры.Вставить("БДДС",								Новый ТаблицаЗначений);
	Параметры.Вставить("ФактическиеДанные",					Новый ТаблицаЗначений);
	
	Возврат Параметры;
	
КонецФункции

// Параметры для функций актуализации данных.
//
// Параметры:
//  АктуализацияБюджета	 - ДокументСсылка, ДокументОбъект	 - Ссылка или объект документа Актуализация бюджета.
//  Настройки			 - Структура						 - Свойства настройки формы ввода бюджета.
// 
// Возвращаемое значение:
//  Структура - Структура аналитик для подстановки в строки БДДС.
//
Функция АналитикиБДДСДляПодстановки(АктуализацияБюджета, Настройки) Экспорт
	
	Результат  = Новый Структура;
	МетаОбъект = Документы.бит_АктуализацияБюджета.ПустаяСсылка().Метаданные();
	ИменаПоУмолчанию = Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию];
	Для каждого ИмяИзмерения Из Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчаниюРедактирование] Цикл
		ИменаПоУмолчанию.Добавить(ИмяИзмерения);
	КонецЦикла;
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(АктуализацияБюджета) Тогда
		Индекс = ИменаПоУмолчанию.ВГраница();
		Пока Индекс >= 0 Цикл
			ТекЗначение = ИменаПоУмолчанию[Индекс];
			Если НЕ бит_РаботаСМетаданными.ЕстьРеквизит(ТекЗначение, МетаОбъект) 
				ИЛИ НЕ бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти(ТекЗначение, МетаОбъект, "БДДС") Тогда
				ИменаПоУмолчанию.Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
		
		РеквизитыАктуализации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(АктуализацияБюджета, ИменаПоУмолчанию);
		Для каждого Измерение Из РеквизитыАктуализации Цикл
			Если ЗначениеЗаполнено(Измерение.Значение) Тогда
				Результат.Вставить(Измерение.Ключ, Измерение.Значение);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого ТекЗначение Из ИменаПоУмолчанию Цикл
			Если бит_РаботаСМетаданными.ЕстьРеквизит(ТекЗначение, МетаОбъект) 
				И бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти(ТекЗначение, МетаОбъект,"БДДС") 
				И ЗначениеЗаполнено(АктуализацияБюджета[ТекЗначение]) Тогда
				
				Результат.Вставить(ТекЗначение, АктуализацияБюджета[ТекЗначение]);
			КонецЕсли; 
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

Процедура СформироватьДвиженияОборотыПоБюджетам(ДанныеБюджета, Реквизиты, Движения, Отказ) Экспорт 
	
	Для каждого СтрокаТаблицы Из ДанныеБюджета Цикл
		Движение = Движения.бит_ОборотыПоБюджетам.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);
	КонецЦикла; 
	Движения.бит_ОборотыПоБюджетам.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьДвиженияБюджетирование(ДанныеБюджета, Реквизиты, Движения, Отказ) Экспорт 
	
	Если ЗначениеЗаполнено(ДанныеБюджета) Тогда
		бит_Бюджетирование.СформироватьПроводкиБюджетирования(ДанныеБюджета,
			Движения.бит_Бюджетирование, Ложь);
	КонецЕсли;
	Движения.бит_Бюджетирование.Записывать = Истина;
	
КонецПроцедуры

// Инициализирует компоновщик, используемый для фильтрации структуры дерева.
// 
Функция ИнициализироватьКомпоновщикСтруктура(Знач ТекстЗапроса, КомпоновщикСтруктура, УникальныйИдентификатор) Экспорт
	
	АдресКомпоновкиСтруктура = "";
	
	ТекстЗапроса = бит_МеханизмПолученияДанных.АдаптироватьТекстПостроителяДляКомпоновки(ТекстЗапроса);
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		
		// Создаем СКД по запросу
		СКД = бит_МеханизмПолученияДанных.СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса);
		// Параметр Бюджет не должен быть доступен в настройках СКД.
		Если Найти(ТекстЗапроса, "&Бюджет") > 0 Тогда
			ПараметрСКД = СКД.Параметры.Добавить();
			ПараметрСКД.Имя						= "Бюджет";
			ПараметрСКД.Заголовок				= НСтр("ru = 'Бюджет'");
			ПараметрСКД.ТипЗначения				= Новый ОписаниеТипов("СправочникСсылка.бит_Бюджеты");
			ПараметрСКД.ВключатьВДоступныеПоля	= Ложь;
			ПараметрСКД.ОграничениеИспользования= Ложь;
			ПараметрСКД.Значение				= Справочники.бит_Бюджеты.ПустаяСсылка();
		КонецЕсли; 

		АдресКомпоновкиСтруктура = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
		
		// Инициализируем компоновщик
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресКомпоновкиСтруктура);
		Попытка			
			КомпоновщикСтруктура.Инициализировать(ИсточникНастроек);			
		Исключение			
			ТекстСообщения = НСтр("ru='Не удалось инициализировать компоновщик для отбора структуры. Попробуйте обновить текст запроса в настройке формы ввода бюджета.';
								  |en='Failed to initialize builder for the selection of the structure. Try to update the text of the query to set the budget entry form.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		КонецПопытки;
		КомпоновщикСтруктура.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
		
	КонецЕсли; 
	
	Возврат АдресКомпоновкиСтруктура;
	
КонецФункции // ИнициализироватьКомпоновщикСтруктура()

// Функция определяет новый статус объекта.
// Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_ФормаВводаБюджета.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_СтатусыОбъектов - новый статус объекта.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Возврат бит_ВизированиеСервер.НовыйСтатусПоСтандартномуАлгоритму(ТекущийОбъект, ПараметрыУстановкиСтатуса);
	
КонецФункции

Функция ДанныеХранилищДокумента(СсылкаНаДокумент) Экспорт
	
	ДанныеХранилищ = Новый Структура;
	ДанныеХранилищ.Вставить("ТабличныйДокумент");
	ДанныеХранилищ.Вставить("НастройкиПостроителя");
	
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент,
						"ХранилищеДерева, НастройкиПостроителя");
	
	ТабличныйДокумент = Неопределено;
	Если РеквизитыОбъекта.ХранилищеДерева <> Неопределено Тогда
		ТабличныйДокумент = РеквизитыОбъекта.ХранилищеДерева.Получить();
	КонецЕсли;
	Если ТипЗнч(ТабличныйДокумент) <> Тип("ТабличныйДокумент") Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
	КонецЕсли; 
	ДанныеХранилищ.ТабличныйДокумент = ТабличныйДокумент;
	
	НастройкиПостроителя = Неопределено;
	Если РеквизитыОбъекта.НастройкиПостроителя <> Неопределено Тогда
		НастройкиПостроителя = РеквизитыОбъекта.НастройкиПостроителя.Получить();
	КонецЕсли;
	Если ТипЗнч(НастройкиПостроителя) <> Тип("Структура") Тогда
		НастройкиПостроителя = Новый Структура;
	КонецЕсли; 
	ДанныеХранилищ.НастройкиПостроителя = НастройкиПостроителя;
	
	Возврат ДанныеХранилищ;
	
КонецФункции

// Функция получает текст запроса для получения плановых данных.
// 
// Параметры:
//  ИмяИзмерения - Строка.
// 
// Возвращаемое значение:
//  Строка.
// 
Функция ТекстЗапросаПлановыеДанные(ИмяИзмерения) Экспорт

	ТекстПолей = "";
	Для каждого ТекИзмерение Из Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения Цикл		
		
		ИмяИзмеренияПоле = ТекИзмерение.Имя;
		Если ИмяИзмеренияПоле = "Валюта" Или ИмяИзмеренияПоле = "Сценарий" Или ИмяИзмеренияПоле = "ЦФО" Или ИмяИзмеренияПоле = "СтатьяОборотов"  Тогда
			Продолжить;		
		КонецЕсли;
		
		// Поля запроса
		ТекстПолей = ТекстПолей + Символы.ПС + "	бит_ОборотыПоБюджетамОбороты." + ИмяИзмеренияПоле + ",";
				
	КонецЦикла;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ОборотыПоБюджетамОбороты.ПериодМесяц КАК Период,
	|	бит_ОборотыПоБюджетамОбороты." + ИмяИзмерения + " КАК Измерение,
	|	&СценарийАктуализация КАК Сценарий,
	|" + ТекстПолей + "
	|	бит_ОборотыПоБюджетамОбороты.ЦФО,
	|	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов,
	|	бит_ОборотыПоБюджетамОбороты.Валюта,
	|	СУММА(бит_ОборотыПоБюджетамОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(бит_ОборотыПоБюджетамОбороты.КоличествоОборот) КАК КоличествоДоИзменения,
	|	СУММА(бит_ОборотыПоБюджетамОбороты.СуммаОборот) КАК СуммаДоИзменения,
	|	СУММА(бит_ОборотыПоБюджетамОбороты.СуммаРеглОборот) КАК СуммаРеглДоИзменения,
	|	СУММА(бит_ОборотыПоБюджетамОбороты.СуммаУпрОборот) КАК СуммаУпрДоИзменения,
	|	СУММА(бит_ОборотыПоБюджетамОбороты.СуммаСценарийОборот) КАК СуммаСценарийДоИзменения,
	|	СУММА(ВЫБОР
	|			КОГДА бит_ОборотыПоБюджетамОбороты.Сценарий.Валюта <> &ВалютаДокумента
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) <> 0
	|							ТОГДА бит_ОборотыПоБюджетамОбороты.СуммаРеглОборот * ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ бит_ОборотыПоБюджетамОбороты.СуммаСценарийОборот
	|		КОНЕЦ) КАК Сумма,
	|	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
	|	0 КАК НДС
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			Сценарий = &Сценарий
	|				И " + ИмяИзмерения + " В (&МассивСсылок)) КАК бит_ОборотыПоБюджетамОбороты,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаЗапроса, Валюта = &ВалютаДокумента) КАК КурсыВалютСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОборотыПоБюджетамОбороты.ПериодМесяц,
	|	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов,
	|	бит_ОборотыПоБюджетамОбороты.Сценарий,
	|	бит_ОборотыПоБюджетамОбороты.ЦФО,
	|" + ТекстПолей + "
	|	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов.СтавкаНДС,
	|	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов,
	|	бит_ОборотыПоБюджетамОбороты.Валюта
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеДереваСлужебные

// Функция формирует таблицу с сеткой дат, исходя из даты начала и периодичности.
// 
// Параметры:
//  ДатаНачала     - Дата.
//  Периодичность  - ПеречислениеСсылка.бит_ПериодичностьПланирования.
// 
// Возвращаемое значение:
//   ТаблицаПериоды - ТаблицаЗначений.
// 
Функция СформироватьТаблицуПериодов(ДатаНачала,Периодичность,КоличествоИнтервалов)

	ТаблицаПериоды = Новый ТаблицаЗначений;
	ТаблицаПериоды.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	Для Сч = 1 По КоличествоИнтервалов Цикл
		ТекущаяДата = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ДатаНачала, Сч-1, Периодичность);
		НоваяСтрока = ТаблицаПериоды.Добавить();
		НоваяСтрока.Период = ТекущаяДата;
	КонецЦикла;	

    Возврат ТаблицаПериоды;
	
КонецФункции

// Функция получает фактические данные.
// 
// Параметры:
//  МассивСсылок  - Массив ссылок измерения для фильтрации.
//  ИмяИзмерения  - Строка.
// 
// Возвращаемое значение:
//   Результат   - РезультатЗапроса.
// 
Функция ПолучитьФактическиеДанные(МассивСсылок, ИмяИзмерения, Параметры)

	Периодичность				= Параметры.Периодичность;
	Дата						= Параметры.Дата;
	ДатаАктуализации			= Параметры.ДатаАктуализации;
	ДатаНачалаПланирования		= Параметры.ДатаНачалаПланирования;
	ВалютаДокумента				= Параметры.ВалютаДокумента;
	СценарийФакт				= Параметры.СценарийФакт;
	НастройкиКомпоновщикаДанные = Параметры.НастройкиКомпоновщикаДанные;
	
	ТекстПериодичность = бит_РаботаСМетаданными.ПолучитьИмяЗначенияПеречисления(Перечисления.бит_ПериодичностьПланирования,Периодичность, "Месяц");
	
	// Получаем имя справочника Сценарии бюджетирования в зависимости от текущего решения.
	ИмяСправочникаСценарии = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыПоБюджетам.Период,
	|	ОборотыПоБюджетам."+ИмяИзмерения+" КАК Измерение,
	|	СУММА(ОборотыПоБюджетам.КоличествоОборот) КАК Количество,
	|    СУММА(ВЫБОР
	|		КОГДА ОборотыПоБюджетам.Сценарий.Валюта <> &ВалютаДокумента
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) <> 0
	|						ТОГДА ОборотыПоБюджетам.СуммаРеглОборот * ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ОборотыПоБюджетам.СуммаСценарийОборот
	|	 КОНЕЦ) КАК Сумма
	|    ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			" + ТекстПериодичность + ",
	|			Сценарий = &СценарийФакт
	|				И " + ИмяИзмерения + " В (&МассивСсылок)) КАК ОборотыПоБюджетам,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаЗапроса, Валюта = &ВалютаДокумента) КАК КурсыВалютСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыПоБюджетам.Период,
	|	ОборотыПоБюджетам." + ИмяИзмерения;
				   
	
	КонецПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(ДатаАктуализации,Периодичность)-1,Периодичность);
	
	Запрос.УстановитьПараметр("МассивСсылок"   , МассивСсылок);		
	Запрос.УстановитьПараметр("НачалоПериода"  , ДатаНачалаПланирования);
	Запрос.УстановитьПараметр("КонецПериода"   , КонецПериода);
	Запрос.УстановитьПараметр("ДатаЗапроса"    , Дата);
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	
	Если ЗначениеЗаполнено(СценарийФакт) Тогда
		Запрос.УстановитьПараметр("СценарийФакт", СценарийФакт);
		
	Иначе
		ИмяСправочникаСценарии = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();
		Запрос.УстановитьПараметр("СценарийФакт", Справочники[ИмяСправочникаСценарии].ФАКТ);
	КонецЕсли; 
	
	// Применение отбора, настроенного с использованием компоновщика.
	// Отбор устанавливается для запроса на получение плановых данных, 
	// поэтому создадим СКД по запросу для фактических данных.
	// и попробуем скопировать отбор из компоновщика для плановых данных.
	СКД = бит_МеханизмПолученияДанных.СоздатьСхемуКомпоновкиПоЗапросу(Запрос.Текст);
	АдресСКД = ПоместитьВоВременноеХранилище(СКД);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД);
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(ИсточникНастроек);
	Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
	// Копирование отбора.
	Для каждого эоИсточник Из НастройкиКомпоновщикаДанные.Отбор.Элементы Цикл
		ЭлементОтбора = Компоновщик.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(ЭлементОтбора, эоИсточник);
	КонецЦикла; 
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетСКД = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СКД, Компоновщик.ПолучитьНастройки());
	
	// Получаем запрос макета компоновки данных.
	Попытка			
		Запрос.Текст = МакетСКД.НаборыДанных.НаборДанныхОсновной.Запрос;			
	Исключение			
		ТекстСообщения = НСтр("ru='Не удалось установить отбор для получения фактических данных.';
								|en='Failed to set the selection for the actual data.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
	КонецПопытки;
	
	// Устанавливаем параметры запроса.
	ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
	Для каждого ОписаниеПараметраЗапроса Из ОписаниеПараметровЗапроса Цикл
		Если НЕ МакетСКД.ЗначенияПараметров.Найти(ОписаниеПараметраЗапроса.Имя) = Неопределено Тогда
			
			Запрос.УстановитьПараметр(ОписаниеПараметраЗапроса.Имя, МакетСКД.ЗначенияПараметров[ОписаниеПараметраЗапроса.Имя].Значение);
			
		КонецЕсли; 
	КонецЦикла;
	
	Результат = Запрос.Выполнить();
	
    Возврат Результат;
	
КонецФункции

// Функция получает плановые данные по бюджету.
// 
// Параметры:
//  МассивСсылок  - Массив ссылок измерения для фильтрации.
//  ИмяИзмерения  - Строка.
// 
// Возвращаемое значение:
//   Результат   - РезультатЗапроса.
// 
Функция ПолучитьПлановыеДанные(МассивСсылок, ИмяИзмерения, Параметры)
	
	Периодичность				= Параметры.Периодичность;
	Дата						= Параметры.Дата;
	ДатаАктуализации			= Параметры.ДатаАктуализации;
	ДатаНачалаПланирования		= Параметры.ДатаНачалаПланирования;
	ДатаОкончанияПланирования	= Параметры.ДатаОкончанияПланирования;
	ВалютаДокумента				= Параметры.ВалютаДокумента;
	СценарийЭталон				= Параметры.СценарийЭталон;
	Сценарий					= Параметры.Сценарий;
	СхемаКомпоновкиДанные		= Параметры.СхемаКомпоновкиДанные;
	НастройкиКомпоновщикаДанные = Параметры.НастройкиКомпоновщикаДанные;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Документы.бит_АктуализацияБюджета.ТекстЗапросаПлановыеДанные(ИмяИзмерения);
	
	ПараметрыСценария		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сценарий, "бит_Периодичность, ПродолжительностьИнтервала");
	Периодичность			= ПараметрыСценария.бит_Периодичность;
	КоличествоИнтервалов	= ПараметрыСценария.ПродолжительностьИнтервала;
	Если ЗначениеЗаполнено(ДатаОкончанияПланирования) Тогда
		ДатаОкончания = ДатаОкончанияПланирования;
	Иначе	
		ДатаОкончания = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ДатаНачалаПланирования,КоличествоИнтервалов-1,Периодичность);
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("МассивСсылок",			МассивСсылок);		
	Запрос.УстановитьПараметр("НачалоПериода",			ДатаНачалаПланирования);
	Запрос.УстановитьПараметр("КонецПериода",			ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаЗапроса",			Дата);
	Запрос.УстановитьПараметр("ВалютаДокумента",		ВалютаДокумента);
	Запрос.УстановитьПараметр("Сценарий",				СценарийЭталон);
	Запрос.УстановитьПараметр("СценарийАктуализация",	Сценарий);
	
	// Применение отбора, настроенного с использованием компоновщика.
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетСКД = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанные, НастройкиКомпоновщикаДанные);
	
	// Получаем запрос макета компоновки данных.
	Попытка
		Запрос.Текст = МакетСКД.НаборыДанных.НаборДанныхОсновной.Запрос;
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось установить отбор для получения плановых данных.';
								|en='Failed to set the selection for plan data.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	// Устанавливаем параметры запроса.
	ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
	Для каждого ОписаниеПараметраЗапроса Из ОписаниеПараметровЗапроса Цикл
		Если НЕ МакетСКД.ЗначенияПараметров.Найти(ОписаниеПараметраЗапроса.Имя) = Неопределено Тогда
			Запрос.УстановитьПараметр(ОписаниеПараметраЗапроса.Имя, МакетСКД.ЗначенияПараметров[ОписаниеПараметраЗапроса.Имя].Значение);
		КонецЕсли; 
	КонецЦикла;
	
	ТекстПериодичность = бит_ОбщегоНазначения.ПолучитьИмяЗначенияПеречисления(Перечисления.бит_ПериодичностьПланирования, Периодичность);
	Если Периодичность <> Перечисления.бит_ПериодичностьПланирования.Месяц Тогда
		ТекстПериодичность = "бит_ОборотыПоБюджетамОбороты.Период" + ТекстПериодичность;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бит_ОборотыПоБюджетамОбороты.ПериодМесяц", ТекстПериодичность); 
	КонецЕсли;
	Результат = Запрос.Выполнить();
	
    Возврат Результат;
	
КонецФункции

Функция ВывестиДеревоДанных(Параметры)
	
	ТабДок							= Параметры.ТабДок;
	НастройкаФормы					= Параметры.НастройкаФормы;
	Настройки						= Параметры.Настройки;
	ТекстЗапроса					= Параметры.ТекстЗапроса;
	СхемаКомпоновкиСтруктура		= Параметры.СхемаКомпоновкиСтруктура;
	НастройкиКомпоновщикаСтруктура	= Параметры.НастройкиКомпоновщикаСтруктура;
	
	СтрокаСортировки = "";	
	
	МассивОтбор = Новый Массив;
	
	// Инициализация построителя.
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Бюджет", Настройки.Бюджет);
	Попытка		
		Запрос.Текст = ТекстЗапроса;		
	Исключение		
		ТекстСообщения = НСтр("ru='Неверный текст запроса. Описание ошибки: %1.';
							  |en='Invalid query text. Description of error: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецПопытки;
	
	Если НЕ Настройки.ВыводитьКодификатор Тогда
		бит_ОтчетыБФСервер.УдалитьВыбранноеПолеИзВсехНастроекОтчета(НастройкиКомпоновщикаСтруктура, "Кодификатор");
	КонецЕсли;

	Если СхемаКомпоновкиСтруктура.НаборыДанных.Количество() <> 0 Тогда
		
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетСКД = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиСтруктура, НастройкиКомпоновщикаСтруктура);
		
		// Получаем запрос макета компоновки данных.
		Попытка				
			Запрос.Текст = МакетСКД.НаборыДанных.НаборДанныхОсновной.Запрос;				
		Исключение				
			ТекстСообщения = НСтр("ru='Не удалось установить отбор для получения структуры.';
									|en='Failed to set the selection for the structure.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);				
		КонецПопытки;
		
		// Устанавливаем параметры запроса.
		ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
		Для каждого ОписаниеПараметраЗапроса Из ОписаниеПараметровЗапроса Цикл				
			Если МакетСКД.ЗначенияПараметров.Найти(ОписаниеПараметраЗапроса.Имя) <> Неопределено Тогда					
				Запрос.УстановитьПараметр(ОписаниеПараметраЗапроса.Имя, МакетСКД.ЗначенияПараметров[ОписаниеПараметраЗапроса.Имя].Значение);					
			КонецЕсли;				
		КонецЦикла;			
		
	КонецЕсли; 
	
	
	// Формируем строку сортировки.
	СохраненнаяНастройка = Справочники.бит_ЭлементыДанных.ПолучитьНастройкиПостроителя(НастройкаФормы);
	Если СохраненнаяНастройка.Свойство("НастройкиКомпоновщика") 
		И ТипЗнч(СохраненнаяНастройка.НастройкиКомпоновщика) = Тип("НастройкиКомпоновкиДанных")  Тогда
		
		Для каждого ЭлПорядка Из СохраненнаяНастройка.НастройкиКомпоновщика.Порядок.Элементы Цикл
			
			Если ЭлПорядка.Использование = Истина И НЕ Строка(ЭлПорядка.Поле) = "" Тогда
				
				НаправлениеСтр = ?(ЭлПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв, "УБЫВ", "ВОЗР"); 
				СтрокаСортировки = СтрокаСортировки+?(ПустаяСтрока(СтрокаСортировки),"",",")+Строка(ЭлПорядка.Поле)+" "+НаправлениеСтр;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// Установка отбора под владельцу дополнительных аналитик при необходимости.
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");	
	ИзмеренияРазворачивать = Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать];
	Для каждого Имя Из ИзмеренияРазворачивать Цикл
	
		ТекущаяНастройка = НастройкиИзмерений[Имя];
		
		Если НЕ ТекущаяНастройка = Неопределено 
			 И ТекущаяНастройка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.бит_ДополнительныеЗначенияАналитик")) Тогда
		
			 Запрос.УстановитьПараметр(Имя, ТекущаяНастройка.Аналитика);
		
		КонецЕсли; 
	
	КонецЦикла; 	
	
	Попытка		
		Результат = Запрос.Выполнить();		
	Исключение		
		ТекстСообщения = НСтр("ru='Не удалось заполнить дерево данных. Описание ошибки: %1.';
							  |en='Unable to complete the data tree. Description of error: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат МассивОтбор;		
	КонецПопытки;
	
	РезДерево = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЭтоНовыйЗапрос = ?(РезДерево.Колонки.Найти("Ссылка") = Неопределено, Истина, Ложь);
	
	// Получение областей, необходимых для вывода.
	Макет = Документы.бит_АктуализацияБюджета.ПолучитьМакет("Макет");	
	Области = Новый Структура;
	Области.Вставить("Заголовок_Кодификатор",Макет.ПолучитьОбласть("Заголовок|Кодификатор"));
	Области.Вставить("Заголовок_Измерение"  ,Макет.ПолучитьОбласть("Заголовок|Измерение"));
	Области.Вставить("Заголовок_Поле"       ,Макет.ПолучитьОбласть("Заголовок|Поле"));
	Области.Вставить("Заголовок_ПолеДубль"  ,Макет.ПолучитьОбласть("Заголовок|ПолеДубль"));
	Области.Вставить("Строка_Кодификатор"   ,Макет.ПолучитьОбласть("Строка|Кодификатор"));
	Области.Вставить("Строка_Измерение"     ,Макет.ПолучитьОбласть("Строка|Измерение"));
	Области.Вставить("Строка_ПолеКоличество",Макет.ПолучитьОбласть("Строка|ПолеКоличество"));
	Области.Вставить("Строка_ПолеСумма"     ,Макет.ПолучитьОбласть("Строка|ПолеСумма"));
	Области.Вставить("Строка_ПолеДубль"     ,Макет.ПолучитьОбласть("Строка|ПолеДубль"));
	Области.Вставить("СтрокаРасчетная_ПолеКоличество", Макет.ПолучитьОбласть("СтрокаРасчетная|ПолеКоличество"));
	Области.Вставить("СтрокаРасчетная_ПолеСумма"     , Макет.ПолучитьОбласть("СтрокаРасчетная|ПолеСумма"));
	Области.Вставить("СтрокаРасчетная_ПолеДубль", Макет.ПолучитьОбласть("СтрокаРасчетная|ПолеДубль"));
	
	ЭтоНастройкаПоБюджету   = ?(ЗначениеЗаполнено(Настройки.Бюджет), Истина, Ложь);
	ИспользоватьКоэффициенты = ?(ЭтоНастройкаПоБюджету И Настройки.ИспользоватьКоэффициентыСтатейБюджета, Истина, Ложь);
	
	Если ИспользоватьКоэффициенты Тогда
		
		// Если используются коэффициенты статей бюджета необходимо установить специальный формат.
		Область = Области.Строка_ПолеСумма.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.Строка_ПолеКоличество.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.Строка_ПолеДубль.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.Строка_ПолеДубль.Область(1,2,1,2);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		
		Область = Области.СтрокаРасчетная_ПолеСумма.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.СтрокаРасчетная_ПолеКоличество.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.СтрокаРасчетная_ПолеДубль.Область(1,1,1,1);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		Область = Области.СтрокаРасчетная_ПолеДубль.Область(1,2,1,2);
		бит_Бюджетирование.УстановитьФорматОтрицательныхЧисел(Область);
		
	КонецЕсли; 
	
	// Вывод дерева данных.
	Периоды = ВывестиШапку(Области, Параметры);
	
	ТабДок.НачатьАвтогруппировкуСтрок();

	// Сортировка по кодификатору.
	Если ПустаяСтрока(СтрокаСортировки) Тогда
		
		ИзмеренияРазворачивать  = Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать];
		Если ИзмеренияРазворачивать.Количество() > 1 Тогда
			
			ИмяПервого = ИзмеренияРазворачивать[0];
			ИмяКодификатор = СтрШаблон("%1_Кодификатор", ИмяПервого);
			
			Если РезДерево.Колонки.Найти(ИмяКодификатор) <> Неопределено Тогда				
				СтрокаСортировки = СтрШаблон("%1,%2", ИмяКодификатор, ИмяПервого);				
			КонецЕсли; 
			
		КонецЕсли; 	
		
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(СтрокаСортировки) Тогда
		
		Попытка			
			РезДерево.Строки.Сортировать(СтрокаСортировки, Истина);			
		Исключение			
			ТекстСообщения = НСтр("ru='Не удалось выполнить сортировку по настройке: %1. Описание ошибки: %2.';
							 	  |en='Unable to sort by setting: %1. Description of the error: %2.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаСортировки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		КонецПопытки;
		
	КонецЕсли; 

	СтатьиБезИтогов = бит_Бюджетирование.СтатьиБезИтогов(Настройки.Бюджет);
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЭтоНовыйЗапрос",	ЭтоНовыйЗапрос);
	ДопПараметры.Вставить("СтатьиБезИтогов",СтатьиБезИтогов);
	
	ОбойтиДерево(РезДерево, Области, Периоды, 1, Параметры, ДопПараметры);
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.НаправлениеПерехода = ТипНаправленияПереходаТабличногоДокумента.БезПерехода;
	
	ИмяИзмеренияРазворачивать = Настройки.ИмяРазворачивать;
	Если ЭтоНовыйЗапрос Тогда
	   МассивОтбор = Результат.Выгрузить().ВыгрузитьКолонку(ИмяИзмеренияРазворачивать);
	Иначе	
	   МассивОтбор = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
    КонецЕсли; 
    бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивОтбор);	
	
	Возврат МассивОтбор;
	
КонецФункции

// Устанавливает значения в дерево из табличных частей БДДС и Фактические данные. 
// 
Процедура УстановитьЗначенияВДерево(ИмяИзмеренияРазворачивать, БДДС, ФактическиеДанные, Параметры)
	
	ТабДок = Параметры.ТабДок;
	
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	ТабФакт = ФактическиеДанные.Скопировать();
	ТабФакт.Колонки.Добавить("Обработана", ОписаниеБулево);
	ТабДанные = БДДС.Скопировать();
	ТабДанные.Колонки.Добавить("Обработана", ОписаниеБулево);
	
	// Восстанавливаем значения областей по значениям табличной части БДДС.
	Для каждого Обл Из ТабДок.Области Цикл
		
		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Обл.Расшифровка,"РасшифровкаЯчейкиФормыВвода") Тогда
			
			Расшифровка = Обл.Расшифровка;
			Если Расшифровка.Вид = "Значение" Тогда
				
				Если Расшифровка.ПланФакт = "Ф" Тогда
					
					// Факт.
					СтрОтбор = Новый Структура;
					СтрОтбор.Вставить("Период", Расшифровка.Период);
					СтрОтбор.Вставить("Измерение", Расшифровка.Измерения[ИмяИзмеренияРазворачивать]);
					
					МассивСтрок = ТабФакт.НайтиСтроки(СтрОтбор);
					
				Иначе	
					
					// План.
					СтрОтбор = Новый Структура;
					СтрОтбор.Вставить("Период", Расшифровка.Период);
					Для каждого КиЗ Из Расшифровка.Измерения Цикл
						
						СтрОтбор.Вставить(КиЗ.Ключ, КиЗ.Значение);
						
					КонецЦикла; // Обл.Расшифровка.Измерения.
					
					МассивСтрок = ТабДанные.НайтиСтроки(СтрОтбор);
					
				КонецЕсли; // ПланФакт
				
					ИтСумма      = 0;				 
					ИтКоличество = 0;
					Для каждого СтрокаТаблицы Из МассивСтрок Цикл
						
						СтрокаТаблицы.Обработана = Истина;
						ИтСумма      = ИтСумма + СтрокаТаблицы.Сумма;
						ИтКоличество = ИтКоличество + СтрокаТаблицы.Количество;
						
					КонецЦикла; // МассивСтрок
					
					Если Лев(Обл.Имя,1) = "С" Тогда
						
						Обл.Значение = ИтСумма;
						
					КонецЕсли; 
					
					Если Лев(Обл.Имя,1) = "К" Тогда
						
						Обл.Значение = ИтКоличество;
						
					КонецЕсли; 
				
				
			КонецЕсли; // Р.Вид = Значение.
			
		КонецЕсли; // ИмяКласса.
		
	КонецЦикла; // ТабДок.Области.
	
	// Выполнение расчетов по формулам в табличном документе.
	бит_Бюджетирование.ВыполнитьРасчеты(ТабДок);	

КонецПроцедуры

// Осуществляет вывод шапки дерева данных. 
// 
// Параметры:
//  ТабДок - ТабличныйДокумент.
//  Области - Структура - Области макета.
//  НастрФормы - Структура - Настройки формы ввода.
// 
Функция ВывестиШапку(Области, Параметры)
	
	ТабДок						= Параметры.ТабДок;
	Настройки					= Параметры.Настройки;
	Периодичность				= Параметры.Периодичность;
	ПродолжительностьИнтервала	= Параметры.ПродолжительностьИнтервала;
	ДатаНачалаПланирования		= Параметры.ДатаНачалаПланирования;
    ДатаОкончанияПланирования	= Параметры.ДатаОкончанияПланирования;
	
	ВыведеноОбластей = 0;
	// Колонка кодификатор. 
	Если Настройки.ВыводитьКодификатор Тогда
		ТабДок.Вывести(Области.Заголовок_Кодификатор); 
		ВыведеноОбластей = ВыведеноОбластей + 1;
	КонецЕсли;
	
	// Имена измерений.
	Для каждого Имя Из Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать] Цикл
		
		Если Настройки.ИспользоватьНаименованияСтатейБюджета И Настройки.Измерения[Имя].Имя = "СтатьяОборотов" Тогда
			Области.Заголовок_Измерение.Параметры.ИмяИзмерения = НСтр("ru = 'Статьи бюджета'");
		Иначе	
			Области.Заголовок_Измерение.Параметры.ИмяИзмерения = Настройки.Измерения[Имя].Синоним;
		КонецЕсли;
		
		Если ВыведеноОбластей = 0 Тогда
			ТабДок.Вывести(Области.Заголовок_Измерение); 
			ВыведеноОбластей = ВыведеноОбластей + 1;
		Иначе	
			ТабДок.Присоединить(Области.Заголовок_Измерение);
		КонецЕсли;
	
	КонецЦикла; 
	
	// Фиксация области измерений.
	ТабДок.ФиксацияСверху = 2;
	ТабДок.ФиксацияСлева  = Настройки.КоличествоРазворачивать+1;
	
	// Вывод заголовка периодов
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияПланирования) Тогда
		КоличествоИнтервалов = ПродолжительностьИнтервала;
	Иначе
		КоличествоИнтервалов = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(ДатаНачалаПланирования, ДатаОкончанияПланирования, Периодичность)+1;
	КонецЕсли; 
	
	ИмяОбластиПериод = ?(Настройки.УчетКоличество И Настройки.УчетСумма, "Заголовок_ПолеДубль","Заголовок_Поле");
	
	// Проверим, следует ли создавать дополнительные итоговые колонки.
	ПериодыИтогов = Новый Массив;
	Для каждого СтрНастройки Из Настройки.ДополнительныеИтоги Цикл
		Если Перечисления.бит_ПериодичностьПланирования.Индекс(СтрНастройки.Периодичность) > Перечисления.бит_ПериодичностьПланирования.Индекс(Периодичность) Тогда
			  ПериодыИтогов.Добавить(СтрНастройки);
		КонецЕсли; 
	КонецЦикла; 
	
	// Признак того, что нужно обработать выходные дни.
	НужноОбработатьВыходные = ?(Периодичность = Перечисления.бит_ПериодичностьПланирования.День 
	                          И НЕ Настройки.ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.Обычный, Истина, Ложь);
	
							  
    ВыходныеДни = Новый Соответствие;
	Если НужноОбработатьВыходные Тогда
		
		// Получим календарь по которому будем проверять выходные.
		Календарь = бит_НастройкиПрограммы.Календарь(Неопределено, ДатаНачалаПланирования);
		
		Если ЗначениеЗаполнено(Календарь) Тогда
			
			МассивВидов = Новый Массив;
			МассивВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота);
			МассивВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье);
			МассивВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник);
			
			ДатаОкончанияКалендаря = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ДатаНачалаПланирования,КоличествоИнтервалов,Периодичность);
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ПроизводственныйКалендарь",	Календарь);
			Запрос.УстановитьПараметр("ДатаНачала",					ДатаНачалаПланирования);
			Запрос.УстановитьПараметр("ДатаОкончания",				ДатаОкончанияКалендаря);
			Запрос.УстановитьПараметр("МассивВидов",				МассивВидов);
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТабКалендарь.Дата КАК Дата
			|ИЗ
			|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ТабКалендарь
			|ГДЕ
			|	ТабКалендарь.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
			|	И ТабКалендарь.ВидДня В(&МассивВидов)
			|	И ТабКалендарь.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
						   
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл			
				ВыходныеДни.Вставить(Выборка.Дата, Истина);			
			КонецЦикла; 			
			
		Иначе	
			
			НужноОбработатьВыходные = Ложь;
			ТекстСообщения = НСтр("ru='Невозможно определить выходные дни, т.к. не установлен Календарь в настройках программы (БИТ).';
								  |en='It is impossible to define the weekend as Calendar is not set in the program settings (BIT).'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли; 
		
	КонецЕсли;// Обработать выходные.						  
							  
	Периоды = Новый Массив;
	НомИт = 1;
	Для й=1 По КоличествоИнтервалов Цикл
	
		ТекущийПериод = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ДатаНачалаПланирования,й-1,Периодичность);
		Синоним 	  = бит_ОбщегоНазначения.СформироватьПредставлениеПериода(ТекущийПериод,Периодичность);		
		
		ПараметрыОписанияПериода = бит_Бюджетирование.НовыеПараметрыОписаниеПериода();
		ПараметрыОписанияПериода.Период  = ТекущийПериод;
		ПараметрыОписанияПериода.Синоним = Синоним;
		ТекОписаниеПериода = бит_Бюджетирование.ОписаниеПериода(ПараметрыОписанияПериода);
		
		Если НужноОбработатьВыходные Тогда
			Если ВыходныеДни[ТекущийПериод] = Истина Тогда
				Если Настройки.ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.НеОтображать Тогда
					Продолжить;
				КонецЕсли; 
				ТекОписаниеПериода.ЭтоВыходной = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
		
		Периоды.Добавить(ТекОписаниеПериода);
		
		// Добавление дополнительных итоговых колонок по периодам.
		КонецТекПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(ТекущийПериод, Периодичность);		
		Для каждого СтрНастройки Из ПериодыИтогов Цикл
			КонецИтПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(ТекущийПериод, СтрНастройки.Периодичность);
			Если КонецТекПериода = КонецИтПериода Тогда
			
				Синоним = бит_ОбщегоНазначения.СформироватьПредставлениеПериода(ТекущийПериод, СтрНастройки.Периодичность);
				НачалоИтПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(ТекущийПериод, СтрНастройки.Периодичность);
				
				ПараметрыОписанияПериода = бит_Бюджетирование.НовыеПараметрыОписаниеПериода();
				ПараметрыОписанияПериода.Период  			= НачалоИтПериода;
				ПараметрыОписанияПериода.Синоним 			= Синоним;
				ПараметрыОписанияПериода.Имя 	 			= "Ит_"+Формат(НомИт,"ЧГ=");
				ПараметрыОписанияПериода.ЭтоИтог 			= Истина;
				ПараметрыОписанияПериода.ЭтоНарастающийИтог = СтрНастройки.НарастающийИтог;
				ПараметрыОписанияПериода.КонецПериода 		= КонецИтПериода;
				
				ТекОписаниеПериода = бит_Бюджетирование.ОписаниеПериода(ПараметрыОписанияПериода);
		        Периоды.Добавить(ТекОписаниеПериода);				
				
				НомИт = НомИт + 1;
			КонецЕсли; 
		
		КонецЦикла; // ПериодыИтогов.
		
	КонецЦикла; // По интервалам.

	// Колонки итогов
	Если Настройки.ВыводитьОбщиеИтоги Тогда
		ПараметрыОписанияПериода = бит_Бюджетирование.НовыеПараметрыОписаниеПериода();
		ПараметрыОписанияПериода.Период  			= Дата('00010101');
		ПараметрыОписанияПериода.Синоним 			= НСтр("ru='Итого';en='Total'");
		ПараметрыОписанияПериода.Имя 	 			= "Итог";
		ПараметрыОписанияПериода.ЭтоИтог 			= Истина;

		ТекОписаниеПериода = бит_Бюджетирование.ОписаниеПериода(ПараметрыОписанияПериода);
		Периоды.Добавить(ТекОписаниеПериода);
	КонецЕсли;
	
	Для каждого ТекОписание Из Периоды Цикл
		
		ОбластьПериод = Области[ИмяОбластиПериод];
		
		ОбластьПериод.Параметры.ИмяПоля = ТекОписание.Синоним;
		
		Область = ОбластьПериод.Область(1,1,1,1);
		
		Если ТекОписание.ЭтоВыходной 
			 И Настройки.ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.Выделять Тогда
			 Область.ЦветТекста = WebЦвета.Красный;
		Иначе
			 Область.ЦветТекста = WebЦвета.Черный;
		КонецЕсли; 
		
		ТабДок.Присоединить(Области[ИмяОбластиПериод]);
		
	КонецЦикла; 
	
	Возврат Периоды;
	
КонецФункции

// Выводит группировки в дерево данных. 
// 
// Параметры:
//  СтрокаВерх - СтрокаДереваЗначений.
//  Области - Структура.
//  Периоды - Массив.
//  Ном - Число.
//  Параметры - Структура.
//  ДопПараметры - Структура.
// 
Функция ОбойтиДерево(СтрокаВерх, Области, Периоды, Ном, Параметры, ДопПараметры)
	
	ТабДок				= Параметры.ТабДок;
	Настройки			= Параметры.Настройки;
	ДатаАктуализации	= Параметры.ДатаАктуализации;
	
	ИменаЯчеек = Новый Соответствие;
	ИзмеренияРазворачивать  = Настройки.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать];
	КоличествоРазворачивать = Настройки.КоличествоРазворачивать;
	ЭтоНастройкаПоБюджету   = ?(ЗначениеЗаполнено(Настройки.Бюджет), Истина, Ложь);
	ИспользоватьКоэффициенты = ?(ЭтоНастройкаПоБюджету И Настройки.ИспользоватьКоэффициентыСтатейБюджета, Истина, Ложь);
	
	ЦветФактПрошлый = WebЦвета.Белый;
	ЦветНедоступный = WebЦвета.Лимонный;
	
	// Структура для хранения данных, используемых при анализе необходимости объединения ячеек.
	ДанныеВрем = бит_Бюджетирование.КонструкторСтруктурыПроверкиОбъединения(ИзмеренияРазворачивать, Настройки.ВыводитьКодификатор);
	
	Для каждого СтрокаДерева Из СтрокаВерх.Строки Цикл
		
		Уровень = СтрокаДерева.Уровень();
		ЕстьПодчиненныеСтроки = ?(СтрокаДерева.Строки.Количество() > 0, Истина, Ложь);
		// Если настройка не по бюджету, коэффициент всегда 1.
		// Для настройки по бюджету, для групп коэффициент 1, для статей берем указанный в статье.
		Коэффициент = ?(ИспользоватьКоэффициенты, ?(СтрокаДерева.СтатьяБюджета.ЭтоГруппа, 1, СтрокаДерева.СтатьяБюджета.Коэффициент), 1);
		
		// Если нет подчиненных строк - строку, содержащую группы выводить не нужно.
		ЕстьГруппы = Ложь;
		Для каждого Имя Из ИзмеренияРазворачивать Цикл
			Если ДопПараметры.ЭтоНовыйЗапрос Тогда
				// Новый формат запроса может содержать несколько измерений.
				ТекЗначение = СтрокаДерева[Имя];
				Если ЭтоНастройкаПоБюджету И ВРег(Имя) = ВРег("СтатьяОборотов") И НЕ ЗначениеЗаполнено(ТекЗначение) Тогда					
					Если СтрокаДерева.СтатьяБюджета.ЭтоГруппа Тогда
						Если Настройки.ИспользоватьНаименованияСтатейБюджета Тогда
							ТекЗначение = СтрокаДерева.СтатьяБюджета;
						Иначе
							ТекЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДерева.СтатьяБюджета, "СтатьяОборотов");
							Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
								ТекЗначение = СтрокаДерева.СтатьяБюджета;
							КонецЕсли;
						КонецЕсли;
					Иначе	
						ТекЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДерева.СтатьяБюджета, "СтатьяОборотов");
					КонецЕсли; 
				КонецЕсли; 
			Иначе
				// Формат запроса редакции 2.8 содержал, только одно измерение с именем Ссылка.
				ТекЗначение = СтрокаДерева.Ссылка; 
			КонецЕсли; 
			Если ЗначениеЗаполнено(ТекЗначение) И ТекЗначение.ЭтоГруппа Тогда
				ЕстьГруппы = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;  // По именам измерений.
		
		Если ЕстьГруппы И НЕ ЕстьПодчиненныеСтроки Тогда
			Продолжить;
		КонецЕсли; 
		
		// Если в подчиненных строках только группы - выводить не нужно.
		ТолькоГруппы = Истина;
		бит_Бюджетирование.ПроверитьНаличиеПодчиненныхЭлементов(СтрокаДерева, ИзмеренияРазворачивать, ДопПараметры.ЭтоНовыйЗапрос, ТолькоГруппы); 			
        Если ТолькоГруппы Тогда
			Продолжить;
		КонецЕсли; 
		
		// Измерения.
		ЗначенияИзмерений = Новый Структура;
		ИдИзмерений = "";
		ЕстьГруппа = Ложь;
		Сч = 1;
		Для каждого Имя Из ИзмеренияРазворачивать Цикл
			
			Если Сч = 1 И Настройки.ВыводитьКодификатор Тогда
				// Вывод кодификатора для первого измерения.
				Если ДопПараметры.ЭтоНовыйЗапрос Тогда
					Области.Строка_Кодификатор.Параметры.Кодификатор = СтрокаДерева[Имя+"_Кодификатор"];
				Иначе	
					Области.Строка_Кодификатор.Параметры.Кодификатор = СтрокаДерева.Кодификатор;
				КонецЕсли; 
				ТабДок.Вывести(Области.Строка_Кодификатор, Уровень);
			КонецЕсли; 
			
			// Вывод измерений в макет.
			Если ДопПараметры.ЭтоНовыйЗапрос Тогда
				ТекЗначение = СтрокаДерева[Имя];
				Если НЕ ЗначениеЗаполнено(ТекЗначение) И СтрСравнить(Имя, "СтатьяОборотов") = 0 И ЭтоНастройкаПоБюджету Тогда
					Если СтрокаДерева.СтатьяБюджета.ЭтоГруппа Тогда
						Если Настройки.ИспользоватьНаименованияСтатейБюджета Тогда
							ТекЗначение = СтрокаДерева.СтатьяБюджета;
						Иначе
							ТекЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДерева.СтатьяБюджета, "СтатьяОборотов");
							Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
								ТекЗначение = СтрокаДерева.СтатьяБюджета;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 
			Иначе	
				// Формат запроса редакции 2.8 содержал, только одно измерение с именем Ссылка.
				ТекЗначение = СтрокаДерева.Ссылка; 
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ТекЗначение) И ТекЗначение.ЭтоГруппа Тогда
				ЕстьГруппа = Истина;
			КонецЕсли;
			
			Если ЭтоНастройкаПоБюджету И Настройки.ИспользоватьНаименованияСтатейБюджета И СтрСравнить(Имя, "СтатьяОборотов") = 0 Тогда
				Области.Строка_Измерение.Параметры.ЗначениеИзмерения = СтрокаДерева.СтатьяБюджета;
			Иначе
				Области.Строка_Измерение.Параметры.ЗначениеИзмерения = ТекЗначение;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекЗначение) Тогда
			    ЗначенияИзмерений.Вставить(Имя, ТекЗначение);
				ИдИзмерений = ИдИзмерений+?(ПустаяСтрока(ИдИзмерений),"","_")+СтрЗаменить(Строка(ТекЗначение.УникальныйИдентификатор()),"-","");
			КонецЕсли; 
			
			ИмяЯчейки = Имя+"_"+Формат(Ном,"ЧГ=");
			Обл = Области.Строка_Измерение.Область(1,1,1,1);
			Обл.Имя = Имя+"_"+Формат(Ном,"ЧГ=");
			Области.Строка_Измерение.Параметры.р = бит_Бюджетирование.РасшифровкаЯчейки(ИмяЯчейки, 
														Неопределено, '0001-01-01', "Измерение", "", ТекЗначение); 
														
			Если Сч = 1 И НЕ Настройки.ВыводитьКодификатор Тогда
				ТабДок.Вывести(Области.Строка_Измерение, Уровень);
           	Иначе
				ТабДок.Присоединить(Области.Строка_Измерение, Уровень);			
			КонецЕсли;                                                 
			
			// Объединение ограничено 1 разворотом, чтобы избежать смещения в сетке табличного документа.
			Если Настройки.ОбъединятьЯчейки И Сч = 1 И КоличествоРазворачивать > 1 Тогда
				// Объединяем ячейки с повторяющимися значениями аналитик.
				бит_Бюджетирование.ПроверитьВыполнитьОбъединениеЯчеек(ТабДок, ДанныеВрем, Имя, ТекЗначение, ЕстьПодчиненныеСтроки);
			КонецЕсли; 
			Сч = Сч +1;
		КонецЦикла;  // По именам измерений.
		
		// Ячейки данных.
		ИспользуемДваРесурса = (Настройки.УчетСумма И Настройки.УчетКоличество);
		ИмяСтроки  			 = ?(НЕ ЕстьПодчиненныеСтроки И НЕ ЕстьГруппа , "Строка", "СтрокаРасчетная");
		ИмяКолонки 			 = ?(ИспользуемДваРесурса, "ПолеДубль", ?(Настройки.УчетКоличество,"ПолеКоличество","ПолеСумма"));
		ИмяОбласти 			 = ИмяСтроки+"_"+ИмяКолонки;
		ИмяОбластиИтог 		 = "СтрокаРасчетная_"+ИмяКолонки;
		ВидЯчейки  			 = ?(НЕ ЕстьПодчиненныеСтроки И НЕ ЕстьГруппа , "Значение", "Формула");
		
	    Префиксы = Новый Структура;
		Префиксы.Вставить("ИмяСумма","СП");
		Префиксы.Вставить("ИмяСуммаФакт","СФ");
		Префиксы.Вставить("ИмяКоличество","КП");
		Префиксы.Вставить("ИмяКоличествоФакт","КФ");
		
		Аргументы	= Новый Структура;  // Хранит аргументы для формул.
		Имена		= Новый Структура;  // Хранит имена различных типов ячеек.
		Для каждого КиЗ Из Префиксы Цикл
			Аргументы.Вставить(КиЗ.Значение, Новый Массив);
			Имена.Вставить(КиЗ.Значение, "");
		КонецЦикла; 
		
		Для каждого ТекОписание Из Периоды Цикл
			
			// Определение цвета ячейка фактических данных.
			Если НЕ ТекОписание.ЭтоИтог Тогда
				ЦветЯчейкиФакт = ?(ТекОписание.Период < ДатаАктуализации, ЦветФактПрошлый, ЦветНедоступный);
			Иначе	
				ЦветЯчейкиФакт = ?(ТекОписание.КонецПериода < ДатаАктуализации И ЗначениеЗаполнено(ТекОписание.Период), ЦветФактПрошлый, ЦветНедоступный);
			КонецЕсли; 
			
			// Подготовка имен.
			Для каждого КиЗ Из Префиксы Цикл
				
				ТипИмени = КиЗ.Ключ;
				Префикс  = КиЗ.Значение;
				
				ТекИмяБезАналитики = ТекОписание[ТипИмени];
				ТекИмяЯчейки = ТекОписание[ТипИмени]+"_"+ИдИзмерений;
				Имена[Префикс] = ТекИмяЯчейки;
				Если ИменаЯчеек[ТекИмяБезАналитики] = Неопределено Тогда
					ИменаЯчеек[ТекИмяБезАналитики] = Новый Массив;
				КонецЕсли; 
				
				// Проверка статьи бюджета на флаг "НеВключатьВИтоги".
				Если НЕ ЗначениеЗаполнено(Настройки.Бюджет)
					ИЛИ (ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДерева, "СтатьяБюджета")
					И ДопПараметры.СтатьиБезИтогов[СтрокаДерева.СтатьяБюджета] = Неопределено) Тогда
					ИменаЯчеек[ТекИмяБезАналитики].Добавить(Новый Структура("Имя, Коэф", Имена[Префикс], Коэффициент));
				КонецЕсли;
				Если НЕ ТекОписание.ЭтоИтог Тогда
					Аргументы[Префикс].Добавить(Имена[Префикс]);
				КонецЕсли;
			
			КонецЦикла; // Префиксы.
			
			Если ИспользуемДваРесурса Тогда
				
				// Форма с двумя ресурсами.
				
				Если ТекОписание.ЭтоИтог Тогда
					
					// Итоговые колонки.
					Обл = Области[ИмяОбластиИтог];
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = "Формула";
					ПараметрыДоработки.Аргументы 	   = Аргументы.КП;
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = "Формула";
					ПараметрыДоработки.Аргументы 	   = Аргументы.СП;
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = "Формула";
					ПараметрыДоработки.Цвет 		   = ЦветЯчейкиФакт;
					ПараметрыДоработки.Аргументы 	   = Аргументы.КФ;
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = "Формула";
					ПараметрыДоработки.Цвет 		   = ЦветЯчейкиФакт;
					ПараметрыДоработки.Аргументы 	   = Аргументы.СФ;
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);										
					
					ТабДок.Присоединить(Обл);					
				Иначе	
					
					// Колонки для ввода данных.
					Обл = Области[ИмяОбласти];
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);

					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СП;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = Имена.КФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.Цвет 		   = ЦветЯчейкиФакт;
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);					
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 2;
					ПараметрыДоработки.Имя 			   = Имена.СФ;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.Цвет 		   = ЦветЯчейкиФакт;
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);										
					
					ТабДок.Присоединить(Обл);
				КонецЕсли; 
			Иначе	
				
				// Форма с одним ресурсом.
				ИмяЯчейки     = ?(Настройки.УчетКоличество, Имена.КП, Имена.СП);
				ИмяЯчейкиФакт = ?(Настройки.УчетКоличество, Имена.КФ, Имена.СФ);
				Если ТекОписание.ЭтоИтог Тогда
					
					// Итоговая колонка.
					Обл = Области[ИмяОбластиИтог];
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейки;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = "Формула";
					ПараметрыДоработки.Аргументы 	   = ?(Настройки.УчетКоличество, Аргументы.КП, Аргументы.СП);
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейкиФакт;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = "Формула";
					ПараметрыДоработки.Цвет 		   = ЦветЯчейкиФакт;
					ПараметрыДоработки.Аргументы 	   = ?(Настройки.УчетКоличество, Аргументы.КФ, Аргументы.СФ);
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);										
					ТабДок.Присоединить(Обл);
				Иначе	
					
					// Колонка для ввода данных.
					Обл = Области[ИмяОбласти];
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 1;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейки;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);
					
					ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
					ПараметрыДоработки.ТД 			   = Обл;
					ПараметрыДоработки.НомСтроки 	   = 2;
					ПараметрыДоработки.НомСтолбца 	   = 1;
					ПараметрыДоработки.Имя 			   = ИмяЯчейкиФакт;
					ПараметрыДоработки.Измерения 	   = ЗначенияИзмерений;
					ПараметрыДоработки.ОписаниеПериода = ТекОписание;
					ПараметрыДоработки.Вид 			   = ВидЯчейки;
					ПараметрыДоработки.Цвет 		   = ЦветЯчейкиФакт;
					бит_Бюджетирование.ДоработатьЯчейку(ПараметрыДоработки);					
					ТабДок.Присоединить(Обл);
				КонецЕсли; 
			КонецЕсли;  // ФлДваРесурса.
		КонецЦикла; // Периоды.
		
		ТекНом = Ном; // Фиксируем номер строки до входа в рекурсивный вызов.
		Ном = Ном + 1;	
		
		ИменаПодчиненныхЯчеек = ОбойтиДерево(СтрокаДерева, Области, Периоды, Ном, Параметры, ДопПараметры);
		
		// Установим формулы для вычисления итогов по группам.
		Если ИменаПодчиненныхЯчеек.Количество() > 0 Тогда
			// После выхода из подчиненного вызова сбрасываем параметры проверяющие объединение ячеек.
			ДанныеВрем = бит_Бюджетирование.КонструкторСтруктурыПроверкиОбъединения(ИзмеренияРазворачивать, Настройки.ВыводитьКодификатор);
			Для каждого ТекОписание Из Периоды Цикл
				Если Настройки.УчетКоличество Тогда
					 бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ТабДок, ИменаПодчиненныхЯчеек,
					 	ТекОписание.ИмяКоличество, ИдИзмерений);
					 бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ТабДок, ИменаПодчиненныхЯчеек,
					 	ТекОписание.ИмяКоличествоФакт, ИдИзмерений);
				КонецЕсли; 
				Если Настройки.УчетСумма Тогда
					 бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ТабДок, ИменаПодчиненныхЯчеек,
					 	ТекОписание.ИмяСумма, ИдИзмерений);
					 бит_Бюджетирование.УстановитьФормулуИтоговПоГруппе(ТабДок, ИменаПодчиненныхЯчеек,
					 	ТекОписание.ИмяСуммаФакт, ИдИзмерений);
				КонецЕсли; 
			КонецЦикла; // Периоды - установка формул.
		КонецЕсли;
		
	КонецЦикла; // По строкам дерева данного уровня.
	
	Если Настройки.ОбъединятьЯчейки Тогда
		// Вызова процедуры объединения для объединения ячеек в случае завершения группировки.
		Сч = 1;
		Для каждого Имя Из ИзмеренияРазворачивать Цикл
			// Объединение ограничено 1 разворотом, чтобы избежать смещения в сетке табличного документа.
			Если Сч = 1 И КоличествоРазворачивать > 1 Тогда
				// Объединяем ячейки с повторяющимися значениями аналитик.
				ЕстьПодчиненныеСтроки = ?(ТипЗнч(СтрокаВерх) = Тип("ДеревоЗначений"), Истина, Ложь);
				бит_Бюджетирование.ПроверитьВыполнитьОбъединениеЯчеек(ТабДок, ДанныеВрем, Имя, "НереальноеЗначение", ЕстьПодчиненныеСтроки, Истина);
			КонецЕсли; 
			Сч = Сч +1;
		КонецЦикла;  // По именам измерений.
	КонецЕсли; 
	
	Возврат ИменаЯчеек;
	
КонецФункции

// Процедура выполняет актуализацию для указанного измерения.
// 
// Параметры:
//  СтрокаИзмерение          - СтрокаДерева.
//  КоличествоИнтерваловПлан - Число.
//  ИмяРеквизита             - Строка.
// 
Процедура ВыполнитьАктуализациюПоИзмерению(СтрокаИзмерение, ИмяРеквизита, ПараметрыРаспределения)

	// Определим параметры необходимы для выполнения актуализации.
	ТочностьОкругления = ?(ИмяРеквизита = "Сумма", 2, 3);
	ПолеКАктуализации 	   = ИмяРеквизита + "КАктуализации";
	ПолеФакт          	   = ИмяРеквизита + "Факт";
	ПолеФактИтог      	   = ИмяРеквизита + "ФактИтог";	
	ПолеПланИтог      	   = ИмяРеквизита + "ПланИтог";	
	ПолеКоэффициент        = "Коэффициент" + ИмяРеквизита;
	ПолеКоэффициентПериода = "КоэффициентПериод" + ИмяРеквизита;
	
	Профиль								= ПараметрыРаспределения.Профиль;
	МассивИмен							= ПараметрыРаспределения.ИменаРазворачивать;
	ДатаАктуализации					= ПараметрыРаспределения.ДатаАктуализации;
	БДДС								= ПараметрыРаспределения.БДДС;	
	НеАктуализироватьФактБольшеПлана	= ПараметрыРаспределения.НеАктуализироватьФактБольшеПлана;	
    СпособАктуализации					= ПараметрыРаспределения.СпособАктуализации;	
	
	ЧислоНенулевыхИнтервалов = ПараметрыРаспределения.КоличествоИнтерваловПлан;
	Ном = 0;
	Пока Окр(СтрокаИзмерение[ПолеКАктуализации], ТочностьОкругления)<>0 Цикл
		
		// Защита от бесконечных циклов. Если за 10 циклов не актуализировали - выходим.
		Если Ном>10 Тогда
			Возврат;
		КонецЕсли; 
		
		ПоказательКАктуализацииНач    = СтрокаИзмерение[ПолеКАктуализации];
		ПоказательКАктуализацииПериод = ?(ЧислоНенулевыхИнтервалов <> 0,
										СтрокаИзмерение[ПолеКАктуализации]/ЧислоНенулевыхИнтервалов,
										СтрокаИзмерение[ПолеКАктуализации]);
										
		// Подготовка счетчиков периодов и строк. 
		// Чтобы исключить расчет на последней итерации циклов и списывать все что осталось.
		Если СпособАктуализации = Перечисления.бит_СпособыАктуализации.ПоПрофилю Тогда
			КоличествоПериодов = 0;
			ПоследнийПериод    = Дата(1,1,1);
			Для каждого КлючЗначение Из Профиль Цикл
				Если КлючЗначение.Значение <> 0 Тогда
					КоличествоПериодов = КоличествоПериодов + 1;
					Если КлючЗначение.Ключ > ПоследнийПериод Тогда
						ПоследнийПериод = КлючЗначение.Ключ;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла; 
		Иначе
			КоличествоПериодов = СтрокаИзмерение.ЧислоПериодовПлан;
		КонецЕсли; 
		
		Для каждого СтрокаПериод Из СтрокаИзмерение.Строки Цикл  // По периодам
			
			ЧислоСтрок = 0;
			Если СпособАктуализации = Перечисления.бит_СпособыАктуализации.ПоПрофилю Тогда
				
				// Установка коэффициентов по профилю.
				Коэффициент = Профиль[СтрокаПериод.Период];
				Коэффициент = ?(ТипЗнч(Коэффициент) = Тип("Число"), Коэффициент, 0);
				СтрокаПериод.КоэффициентПериодСумма      = Коэффициент;
				СтрокаПериод.КоэффициентПериодКоличество = Коэффициент;

				Если СтрокаПериод.Период = ПоследнийПериод Тогда
					КоличествоПериодов            = 0;
					ПоказательКАктуализацииПериод = СтрокаИзмерение[ПолеКАктуализации];
				Иначе
					ПоказательКАктуализацииПериод = Окр(СтрокаПериод[ПолеКоэффициентПериода] * ПоказательКАктуализацииНач, ТочностьОкругления);
				КонецЕсли;
				Если СтрокаПериод.Период >= ДатаАктуализации Тогда
					Для каждого СтрокаТаблицы Из СтрокаПериод.Строки Цикл
						Если СтрокаТаблицы[ИмяРеквизита] > 0 ИЛИ ПоказательКАктуализацииПериод <= 0  Тогда
							ЧислоСтрок = ЧислоСтрок + 1;
						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли;
				
			ИначеЕсли СпособАктуализации = Перечисления.бит_СпособыАктуализации.Пропорционально Тогда
				ПоказательКАктуализацииПериод = Окр(СтрокаПериод[ПолеКоэффициентПериода] * ПоказательКАктуализацииНач, ТочностьОкругления);
			КонецЕсли; 
			
			Если СпособАктуализации <> Перечисления.бит_СпособыАктуализации.ПоПрофилю Тогда
				Если СтрокаПериод.Период >= ДатаАктуализации Тогда
					КоличествоПериодов = КоличествоПериодов - 1;
					Если КоличествоПериодов = 0 Тогда
						// Последняя итерация по периодам.
						ПоказательКАктуализацииПериод = СтрокаИзмерение[ПолеКАктуализации];
					КонецЕсли; 
					Для каждого СтрокаТаблицы Из СтрокаПериод.Строки Цикл
						Если СтрокаТаблицы[ИмяРеквизита] > 0 ИЛИ ПоказательКАктуализацииПериод <= 0  Тогда
							ЧислоСтрок = ЧислоСтрок + 1;
						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли;	
			КонецЕсли;	
			
			// Если остаток к актуализации мал, не смысла дробить его по периодам.
			// Актуализируем все в текущем периоде.
			Если бит_ОбщегоНазначения.МодульЧисла(СтрокаИзмерение[ПолеКАктуализации]) <= 1 Тогда
				ПоказательКАктуализацииПериод = СтрокаИзмерение[ПолеКАктуализации];
			КонецЕсли; 
			
			// Остаток фактических данных, подлежащий к актуализации.
			ПоказательФактПериод = СтрокаПериод[ПолеФакт];
			
			// Служит для накопления уже актуализированных данных в текущем периоде.
			Итог = 0;
			// Служит для накопления итогов по данным с учетом проведенной актуализации в текущем периоде.
			ИтогДанные = 0;
						
			Для каждого СтрокаДетали Из СтрокаПериод.Строки Цикл // По строкам
				
				СтрокаДанных = БДДС.Найти(СтрокаДетали.Ид,"ИД");
				Если СтрокаДанных = Неопределено Тогда
					
					// Если необходимо добавить данные, и строки в периоде нет, то создаем новую строку.
					Если (СтрокаПериод.Период >= ДатаАктуализации И ПоказательКАктуализацииПериод < 0) 
						  ИЛИ (СтрокаПериод.Период < ДатаАктуализации И ПоказательФактПериод > 0) Тогда
						СтрокаДанных = БДДС.Добавить();
						СтрокаДанных.Период    = СтрокаДетали.Период;
						СтрокаДанных.Измерение = СтрокаДетали.Измерение;
						Для каждого КиЗ Из ПараметрыРаспределения.АналитикиБДДСДляПодстановки Цикл
							СтрокаДанных[КиЗ.Ключ] = КиЗ.Значение;
						КонецЦикла; 
						Если МассивИмен <> Неопределено Тогда
							ИмяРеквизитаИзмерение = МассивИмен[0];
							СтрокаДанных[ИмяРеквизитаИзмерение] = СтрокаДетали.Измерение;
						КонецЕсли;
						СтрокаДанных.ИД = Строка(Новый УникальныйИдентификатор);
						СтрокаДетали.ИД = СтрокаДанных.ИД;
					Иначе	
						Продолжить;
					КонецЕсли; 
					
				КонецЕсли; 
				
				Если СтрокаДетали.Период >= ДатаАктуализации Тогда 
					// Актуализацию выполняем если в строке данных показатель имеет положительное значение.
					// Или ПоказательКАктуализацииПериод отрицательный, т.е. происходит увеличение плановых данных.
					Если СтрокаДанных[ИмяРеквизита] > 0 ИЛИ ПоказательКАктуализацииПериод <= 0 Тогда
						
						ЧислоСтрок = ЧислоСтрок - 1;
						Если ЧислоСтрок = 0 И КоличествоПериодов = 0 Тогда
							// Последняя итерация по строкам. Больше распределений не будет.
							СуммаАктуализации = СтрокаИзмерение[ПолеКАктуализации];
						Иначе
							СуммаАктуализации  = Окр(Мин(СтрокаДетали[ПолеКоэффициент]*ПоказательКАктуализацииПериод,СтрокаДанных[ИмяРеквизита]),ТочностьОкругления);
						КонецЕсли; 
						
						СтрокаДанных[ИмяРеквизита] = СтрокаДанных[ИмяРеквизита]-СуммаАктуализации;
						Итог = Итог+СуммаАктуализации;
						ИтогДанные = ИтогДанные+СтрокаДанных[ИмяРеквизита];
						СтрокаИзмерение[ПолеКАктуализации] = СтрокаИзмерение[ПолеКАктуализации]-СуммаАктуализации;
						// Весь остаток подлежащий актуализации распределили - выходим.
						Если Окр(бит_ОбщегоНазначения.МодульЧисла(СтрокаИзмерение[ПолеКАктуализации]), ТочностьОкругления)<=0 Тогда
							Прервать;
						КонецЕсли; 
					КонецЕсли; 
				Иначе 
					// ФАКТ
					// Фактические данные просто заменяют плановые. 
					// В строках распределяем данные согласно коэффициентов строк.
					// Коэффициенты вычисляется пропорционально вкладам строк в текущем периоде.
					Если ПоказательФактПериод>=0 И Ном = 0 Тогда
						
						Если НеАктуализироватьФактБольшеПлана И СтрокаПериод[ПолеФактИтог] > СтрокаПериод[ПолеПланИтог] Тогда
							// В данном режиме, если факт больше плана, оставляем план как есть.
							// А сумму актуализации уменьшаем.
							Итог = Итог+СтрокаДанных[ИмяРеквизита];	
							ПоказательФактПериод = Итог;
							
						Иначе	
							
							СтрокаДанных[ИмяРеквизита] = СтрокаДетали[ПолеКоэффициент]*ПоказательФактПериод;
							Итог = Итог+СтрокаДанных[ИмяРеквизита];	
							СтрокаПериод[ПолеФакт] = СтрокаПериод[ПолеФакт]-СтрокаДанных[ИмяРеквизита];
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли; 
				
			КонецЦикла; // По строкам.
			
			Если НеАктуализироватьФактБольшеПлана И СтрокаПериод[ПолеФактИтог] > СтрокаПериод[ПолеПланИтог] И Ном = 0 Тогда
				РазностьПланФакт = СтрокаДетали[ПолеФактИтог] - СтрокаДетали[ПолеПланИтог];
				СтрокаИзмерение[ПолеКАктуализации] = СтрокаИзмерение[ПолеКАктуализации] - РазностьПланФакт;
			КонецЕсли;
			
			// Уберем ошибки округления.
			Если СтрокаПериод.Период >= ДатаАктуализации Тогда 
				// АКТУАЛИЗАЦИЯ.
				Разность = Окр(ПоказательКАктуализацииПериод - Итог, ТочностьОкругления);
				Если СтрокаИзмерение[ПолеКАктуализации]>0 Тогда
					Разность = Мин(Разность,СтрокаИзмерение[ПолеКАктуализации]);
				КонецЕсли; 
				Если СтрокаДанных <> Неопределено И Разность <>0 И СтрокаДанных[ИмяРеквизита] > Разность Тогда
					СтрокаДанных[ИмяРеквизита] = СтрокаДанных[ИмяРеквизита]-Разность;
					ИтогДанные = ИтогДанные - Разность;
					СтрокаИзмерение[ПолеКАктуализации] = СтрокаИзмерение[ПолеКАктуализации] - Разность;
				КонецЕсли; 
				
				// Если актуализация обнулила все данные в текущем периоде, изменим количество ненулевых интервалов.
				Если ИтогДанные <= 0 Тогда
					ЧислоНенулевыхИнтервалов = ЧислоНенулевыхИнтервалов - 1;
				КонецЕсли; 
				
			Иначе 
				// ФАКТ.
				Разность = ПоказательФактПериод-Итог;
				Если Разность <>0 И СтрокаДанных <> Неопределено И Ном = 0 Тогда
					Если ПоказательФактПериод >= 0  Тогда
						СтрокаДанных[ИмяРеквизита] = СтрокаДанных[ИмяРеквизита]+Разность;
						СтрокаПериод[ПолеФакт] = СтрокаПериод[ПолеФакт]+Разность;					
					Иначе
						// Если факт отрицательный актуализацию не выполняем, а заменяем план на ноль (замечание 3311).
						СтрокаДанных[ИмяРеквизита] = 0;
						СтрокаПериод[ПолеФакт] = 0;
						СтрокаИзмерение[ПолеКАктуализации] = СтрокаИзмерение[ПолеКАктуализации] - ПоказательФактПериод;						
					КонецЕсли;				
				КонецЕсли; 
			
		  КонецЕсли;
		КонецЦикла;  // По периодам. 
		
		Ном = Ном + 1;	
	КонецЦикла;  // Пока есть что актуализировать.

КонецПроцедуры

#КонецОбласти

Функция ТекстЗапросаВременнаяТаблицаДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", 	 НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаДоИзменения", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""БДДС"" КАК ИмяСписка,
	|	&СинонимБДДС КАК СинонимСписка,
	|	1 КАК НомерТаблицы,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Период КАК Период,
	|	&Сценарий КАК Сценарий,
	|	&Валюта КАК Валюта,
	|	Таблица.ЦФО КАК ЦФО,
	|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
	|	Таблица.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СтатьяОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Сумма КАК Сумма,
	|	0 КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаСценарий,
	|	Таблица.Комментарий КАК Комментарий,
	|	Таблица.Аналитика_1 КАК Аналитика_1,
	|	Таблица.Аналитика_2 КАК Аналитика_2,
	|	Таблица.Аналитика_3 КАК Аналитика_3,
	|	Таблица.Аналитика_4 КАК Аналитика_4,
	|	Таблица.Аналитика_5 КАК Аналитика_5,
	|	Таблица.Аналитика_6 КАК Аналитика_6,
	|	Таблица.Аналитика_7 КАК Аналитика_7,
	|	Таблица.Аналитика_8 КАК Аналитика_8,
	|	Таблица.Аналитика_9 КАК Аналитика_9,
	|	Таблица.Аналитика_10 КАК Аналитика_10,
	|	Таблица.Аналитика_11 КАК Аналитика_11,
	|	Таблица.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ ВременнаяТаблицаДокумента
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.БДДС КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ЗависимыеОбороты"",
	|	&СинонимЗависимыеОбороты,
	|	2,
	|	Таблица.Ссылка,
	|	Таблица.НомерСтроки,
	|	Таблица.Период,
	|	&Сценарий,
	|	&Валюта,
	|	Таблица.ЦФО,
	|	Таблица.СтатьяОборотов,
	|	Таблица.СтатьяОборотов.СтавкаНДС,
	|	Таблица.СтатьяОборотов.ЭтоКоэффициент,
	|	Таблица.Количество,
	|	Таблица.Сумма,
	|	0,
	|	0,
	|	0,
	|	Таблица.Комментарий,
	|	Таблица.Аналитика_1,
	|	Таблица.Аналитика_2,
	|	Таблица.Аналитика_3,
	|	Таблица.Аналитика_4,
	|	Таблица.Аналитика_5,
	|	Таблица.Аналитика_6,
	|	Таблица.Аналитика_7,
	|	Таблица.Аналитика_8,
	|	Таблица.Аналитика_9,
	|	Таблица.Аналитика_10,
	|	Таблица.Аналитика_11,
	|	Таблица.Аналитика_12
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.ЗависимыеОбороты КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ДоИзменения"" КАК ИмяСписка,
	|	&СинонимДоИзменения КАК СинонимСписка,
	|	ТаблицаДанные.Ссылка КАК Ссылка,
	|	ТаблицаДанные.НомерСтроки КАК НомерСтроки,
	|	&Сценарий КАК Сценарий,
	|	&СценарийЭталон КАК СценарийЭталон,
	|	ТаблицаДанные.Валюта КАК Валюта,
	|	ТаблицаДанные.ЦФО КАК ЦФО,
	|	ТаблицаДанные.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДанные.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДанные.Период КАК Период,
	|	ТаблицаДанные.Комментарий КАК Комментарий,
	|	ТаблицаДанные.Количество КАК Количество,
	|	ТаблицаДанные.Сумма КАК Сумма,
	|	ТаблицаДанные.СуммаРегл КАК СуммаРегл,
	|	ТаблицаДанные.СуммаУпр КАК СуммаУпр,
	|	ТаблицаДанные.СуммаСценарий КАК СуммаСценарий,
	|	ТаблицаДанные.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаДанные.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаДанные.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаДанные.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаДанные.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаДанные.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаДанные.Аналитика_7 КАК Аналитика_7,
	|	ТаблицаДанные.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаДанные.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаДанные.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаДанные.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаДанные.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ ВременнаяТаблицаДоИзменения
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.ДоИзменения КАК ТаблицаДанные
	|ГДЕ
	|	ТаблицаДанные.Ссылка = &Ссылка";


	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаТаблицыВалютногоПерерасчета(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВремТаблицаПериодов",НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПериодов",	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Сценарии",			НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДанныеБюджета.Период КАК Период,
	|	ТаблицаДанныеБюджета.Сценарий КАК Сценарий,
	|	ТаблицаДанныеБюджета.Сценарий.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария,
	|	ТаблицаДанныеБюджета.Сценарий.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВремТаблицаПериодов
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ТаблицаДанныеБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТаблицаПериодов.Период КАК Период,
	|	ВремТаблицаПериодов.Сценарий КАК Сценарий,
	|	ВремТаблицаПериодов.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария
	|ИЗ
	|	ВремТаблицаПериодов КАК ВремТаблицаПериодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремТаблицаПериодов.Сценарий КАК Сценарий,
	|	ВремТаблицаПериодов.Валюта КАК Валюта
	|ИЗ
	|	ВремТаблицаПериодов КАК ВремТаблицаПериодов";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаТаблицаОборотыПоБюджетам(НомераТаблиц, ПриниматьКУчету)
	
	Если НЕ ПриниматьКУчету Тогда
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ТаблицаОборотыПоБюджетам", НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДанные.ИмяСписка КАК ИмяСписка,
	|	ТаблицаДанные.СинонимСписка КАК СинонимСписка,
	|	ТаблицаДанные.Ссылка КАК Ссылка,
	|	ТаблицаДанные.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанные.Период КАК Период,
	|	ТаблицаДанные.Сценарий КАК Сценарий,
	|	ТаблицаДанные.Валюта КАК Валюта,
	|	ТаблицаДанные.ЦФО КАК ЦФО,
	|	ТаблицаДанные.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДанные.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДанные.СтатьяОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	ТаблицаДанные.Количество КАК Количество,
	|	ТаблицаДанные.Сумма КАК Сумма,
	|	ТаблицаДанные.СуммаРегл КАК СуммаРегл,
	|	ТаблицаДанные.СуммаУпр КАК СуммаУпр,
	|	ТаблицаДанные.СуммаСценарий КАК СуммаСценарий,
	|	ТаблицаДанные.Комментарий КАК Комментарий,
	|	ТаблицаДанные.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаДанные.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаДанные.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаДанные.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаДанные.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаДанные.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаДанные.Аналитика_7 КАК Аналитика_7,
	|	ТаблицаДанные.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаДанные.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаДанные.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаДанные.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаДанные.Аналитика_12 КАК Аналитика_12,
	|	ЕСТЬNULL(АналитикаСценарийЦФО.КлючАналитики, ЗНАЧЕНИЕ(Справочник.бит_КлючиСценарийЦФО.ПустаяСсылка)) КАК КлючСценарийЦФО
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ТаблицаДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО ТаблицаДанные.ЦФО = АналитикаСценарийЦФО.ЦФО
	|			И ТаблицаДанные.Сценарий = АналитикаСценарийЦФО.Сценарий";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаТаблицаСторноДоИзменения(НомераТаблиц, ПриниматьКУчету, СценарииСовпадают)
	
	Если НЕ ПриниматьКУчету ИЛИ НЕ СценарииСовпадают Тогда
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ТаблицаСторноДоИзменения", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""ДоИзменения"" КАК ИмяСписка,
	|	&СинонимДоИзменения КАК СинонимСписка,
	|	ТаблицаДанные.Ссылка КАК Ссылка,
	|	ТаблицаДанные.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанные.Ссылка.Сценарий КАК Сценарий,
	|	ТаблицаДанные.Ссылка.СценарийЭталон КАК СценарийЭталон,
	|	ТаблицаДанные.Валюта КАК Валюта,
	|	ТаблицаДанные.ЦФО КАК ЦФО,
	|	ТаблицаДанные.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДанные.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДанные.Период КАК Период,
	|	ТаблицаДанные.Комментарий КАК Комментарий,
	|	-ТаблицаДанные.Количество КАК Количество,
	|	-ТаблицаДанные.Сумма КАК Сумма,
	|	-ТаблицаДанные.СуммаРегл КАК СуммаРегл,
	|	-ТаблицаДанные.СуммаУпр КАК СуммаУпр,
	|	-ТаблицаДанные.СуммаСценарий КАК СуммаСценарий,
	|	ТаблицаДанные.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаДанные.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаДанные.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаДанные.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаДанные.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаДанные.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаДанные.Аналитика_7 КАК Аналитика_7,
	|	ТаблицаДанные.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаДанные.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаДанные.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаДанные.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаДанные.Аналитика_12 КАК Аналитика_12,
	|	ЕСТЬNULL(АналитикаСценарийЦФО.КлючАналитики, ЗНАЧЕНИЕ(Справочник.бит_КлючиСценарийЦФО.ПустаяСсылка)) КАК КлючСценарийЦФО
	|ИЗ
	|	ВременнаяТаблицаДоИзменения КАК ТаблицаДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО ТаблицаДанные.ЦФО = АналитикаСценарийЦФО.ЦФО
	|			И ТаблицаДанные.Сценарий = АналитикаСценарийЦФО.Сценарий";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц, СценарииСовпадают)
	
	НомераТаблиц.Вставить("ИсполнениеБюджетаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ИсполнениеБюджета", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.СверхБюджета КАК СверхБюджета,
	|	Реквизиты.КурсДокумента КАК Курс,
	|	Реквизиты.КратностьДокумента КАК Кратность,
	|	Реквизиты.Сценарий.Валюта КАК ВалютаСценария,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.Сценарий КАК СценарийКонтролируемый,
	|	ЗНАЧЕНИЕ(Перечисление.бит_РежимыКонтроляПоБюджету.Бюджет) КАК РежимКонтроля,
	|	ИСТИНА КАК КонтролироватьБюджет,
	|	&НеУчитыватьСверхБюджета КАК НеУчитыватьСверхБюджета,
	|	ЛОЖЬ КАК КонтролироватьВозвратЛимита,
	|	Реквизиты.СписатьЛимиты КАК СписатьЛимиты
	|ИЗ
	|	Документ.бит_АктуализацияБюджета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ИмяСписка КАК ИмяСписка,
	|	ТаблицаДокумента.СинонимСписка КАК СинонимСписка,
	|	ТаблицаДокумента.НомерТаблицы КАК НомерТаблицы,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Сценарий КАК Сценарий,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	ТаблицаДокумента.ЦФО КАК ЦФО,
	|	ТаблицаДокумента.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Сумма КАК КонтролироватьСумму,
	|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Количество КАК КонтролироватьКоличество,
	|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Бюджеты КАК КонтролироватьПоСтатье,
	|	ТаблицаДокумента.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаДокумента.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаДокумента.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаДокумента.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаДокумента.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаДокумента.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаДокумента.Аналитика_7 КАК Аналитика_7,
	|	ТаблицаДокумента.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаДокумента.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаДокумента.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаДокумента.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаДокумента.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкаКонтроляПоСценариям КАК НастройкаКонтроляПоСценариям
	|		ПО (НастройкаКонтроляПоСценариям.Сценарий = &Сценарий)
	|			И ТаблицаДокумента.Период >= НастройкаКонтроляПоСценариям.Период
	|			И (ТаблицаДокумента.Период <= НастройкаКонтроляПоСценариям.ДатаОкончания
	|				ИЛИ НастройкаКонтроляПоСценариям.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТаблицы,
	|	НомерСтроки";
	
	Если СценарииСовпадают Тогда
		
		НомераТаблиц.Вставить("ВозвратЛимита", НомераТаблиц.Количество());
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	ТаблицаДокумента.ИмяСписка КАК ИмяСписка,
		|	ТаблицаДокумента.СинонимСписка КАК СинонимСписка,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Период КАК Период,
		|	ТаблицаДокумента.Сценарий КАК Сценарий,
		|	ТаблицаДокумента.Валюта КАК Валюта,
		|	ТаблицаДокумента.ЦФО КАК ЦФО,
		|	ТаблицаДокумента.СтатьяОборотов КАК СтатьяОборотов,
		|	ТаблицаДокумента.Количество КАК Количество,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Сумма КАК КонтролироватьСумму,
		|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Количество КАК КонтролироватьКоличество,
		|	НЕ ТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Бюджеты КАК КонтролироватьПоСтатье,
		|	ТаблицаДокумента.Аналитика_1 КАК Аналитика_1,
		|	ТаблицаДокумента.Аналитика_2 КАК Аналитика_2,
		|	ТаблицаДокумента.Аналитика_3 КАК Аналитика_3,
		|	ТаблицаДокумента.Аналитика_4 КАК Аналитика_4,
		|	ТаблицаДокумента.Аналитика_5 КАК Аналитика_5,
		|	ТаблицаДокумента.Аналитика_6 КАК Аналитика_6,
		|	ТаблицаДокумента.Аналитика_7 КАК Аналитика_7,
		|	ТаблицаДокумента.Аналитика_8 КАК Аналитика_8,
		|	ТаблицаДокумента.Аналитика_9 КАК Аналитика_9,
		|	ТаблицаДокумента.Аналитика_10 КАК Аналитика_10,
		|	ТаблицаДокумента.Аналитика_11 КАК Аналитика_11,
		|	ТаблицаДокумента.Аналитика_12 КАК Аналитика_12
		|ИЗ
		|	ВременнаяТаблицаДоИзменения КАК ТаблицаДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкаКонтроляПоСценариям КАК НастройкаКонтроляПоСценариям
		|		ПО (НастройкаКонтроляПоСценариям.Сценарий = &Сценарий)
		|			И ТаблицаДокумента.Период >= НастройкаКонтроляПоСценариям.Период
		|			И (ТаблицаДокумента.Период <= НастройкаКонтроляПоСценариям.ДатаОкончания
		|				ИЛИ НастройкаКонтроляПоСценариям.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Процедура ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ИсполнениеБюджета, ИсполнениеБюджетаРеквизиты)

	Если НЕ ЗначениеЗаполнено(ИсполнениеБюджета) ИЛИ НЕ ЗначениеЗаполнено(ИсполнениеБюджетаРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ИсполнениеБюджетаРеквизиты[0];
	
	КурсВалютыДокумента = Новый Структура;
	КурсВалютыДокумента.Вставить("Валюта", 	  Реквизиты.Валюта);
	КурсВалютыДокумента.Вставить("Курс", 	  Реквизиты.Курс);
	КурсВалютыДокумента.Вставить("Кратность", Реквизиты.Кратность);
	
	КурсВалютыСценария = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Реквизиты.ВалютаСценария, Реквизиты.Дата);
	
	Для каждого СтрокаТаблицы Из ИсполнениеБюджета Цикл
		СтрокаТаблицы.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
								СтрокаТаблицы.Сумма, КурсВалютыДокумента, КурсВалютыСценария);
	КонецЦикла;																	

КонецПроцедуры
 
Процедура ПодготовитьТаблицыДокументаРасчетыВВалюте(ПараметрыПроведения, Реквизиты)

	Если ПараметрыПроведения.ТаблицаОборотыПоБюджетам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Сценарии		  = ПараметрыПроведения.Сценарии;
	ТаблицаПериодов	  = ПараметрыПроведения.ТаблицаПериодов;
	ОборотыПоБюджетам = ПараметрыПроведения.ТаблицаОборотыПоБюджетам;
	КурсыПоПериодам	  = Неопределено;
	
	Если ТаблицаПериодов.Количество() >= 1000 Тогда
		ТаблицаПериодов.Индексы.Добавить("Сценарий");
	КонецЕсли; 
	
	Если ОборотыПоБюджетам.Количество() >= 1000 Тогда
		ОборотыПоБюджетам.Индексы.Добавить("Сценарий");
	КонецЕсли;

	Если Реквизиты.ИспользоватьКурсыСценария Тогда
		Для каждого СтрокаТаблицы Из Сценарии Цикл
			
			Отбор	= Новый Структура("Сценарий", СтрокаТаблицы.Сценарий);
			Периоды = ТаблицаПериодов.Скопировать(Отбор);
			Валюты  =  бит_Бюджетирование.ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(СтрокаТаблицы.Сценарий, Реквизиты.ВалютаДокумента);
		
			КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(Периоды, Валюты, СтрокаТаблицы.Сценарий);
			
			НайденныеСтроки = ОборотыПоБюджетам.НайтиСтроки(Отбор);
			бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(НайденныеСтроки, 
								КурсыПоПериодам, Реквизиты.КурсыВалют);

		КонецЦикла; 
	Иначе
		
		бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(ОборотыПоБюджетам, 
								Неопределено, Реквизиты.КурсыВалют);
	КонецЕсли;
							
КонецПроцедуры

Процедура ИнициализироватьКлючиАналитик(Реквизиты)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Реквизиты.Регистратор);
	Запрос.УстановитьПараметр("Сценарий", 	 Реквизиты.Сценарий);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеБюджета.ЦФО КАК ЦФО,
	|	&Сценарий КАК Сценарий
	|ПОМЕСТИТЬ ДанныеБюджета
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.БДДС КАК ДанныеБюджета
	|ГДЕ
	|	ДанныеБюджета.Ссылка = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗависимыеОбороты.ЦФО,
	|	&Сценарий
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.ЗависимыеОбороты КАК ЗависимыеОбороты
	|ГДЕ
	|	ЗависимыеОбороты.Ссылка = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоИзменения.ЦФО,
	|	&Сценарий
	|ИЗ
	|	Документ.бит_АктуализацияБюджета.ДоИзменения КАК ДоИзменения
	|ГДЕ
	|	ДоИзменения.Ссылка = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеБюджета.Сценарий КАК Сценарий,
	|	ДанныеБюджета.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ УникальныеДанныеБюджета
	|ИЗ
	|	ДанныеБюджета КАК ДанныеБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УникальныеДанныеБюджета.Сценарий КАК Сценарий,
	|	УникальныеДанныеБюджета.ЦФО КАК ЦФО,
	|	АналитикаСценарийЦФО.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	УникальныеДанныеБюджета КАК УникальныеДанныеБюджета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО УникальныеДанныеБюджета.Сценарий = АналитикаСценарийЦФО.Сценарий
	|			И УникальныеДанныеБюджета.ЦФО = АналитикаСценарийЦФО.ЦФО
	|ГДЕ
	|	АналитикаСценарийЦФО.КлючАналитики ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Справочники.бит_КлючиСценарийЦФО.КлючиСценарийЦФОДокумента(Выборка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
