
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ЗаполнитьКэшЗначений();
	УстановитьЗаголовокФормыДокумента(ЭтотОбъект);

	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Стандартные действия при создании на сервере
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования);
	
	ЗаполнитьКэшЗначений();
	УстановитьЗаголовокФормыДокумента(ЭтотОбъект);
		
	// Настроим отображение полей доп. аналитик в табличном поле Распределение.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, "ТаблицаПлатежи",
		КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	
	УстановитьОтборПлатежей();
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		 И (ЗначениеЗаполнено(ЗначениеКопирования) 
		    ИЛИ ЗначениеЗаполнено(Объект.ДокументОснование)) Тогда
		
		ПодключитьОбработчикОжидания("ОжиданиеОткрытияФормы", 0.1, Истина);
		
	КонецЕсли; 
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойств
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если КопироватьПозиции Тогда
		СкопироватьПозицииПриЗаписи(ТекущийОбъект.Ссылка, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента(ЭтотОбъект);
	
	УстановитьОтборПлатежей();	
	Элементы.ТаблицаПлатежи.Обновить();
	
	ОбновитьИтоги();
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
    ПодготовитьФормуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьЗаголовокФормыДокумента(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование)
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
	
		Оповестить("бит_ИзмененСтатус");
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатус"
		ИЛИ ИмяСобытия = "бит_ИзмененСтатус" Тогда
		ОбработкаОповещенияИзмененияСтатуса();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	бит_КазначействоКлиент.ОбработкаОповещенияФормыДокумента(ЭтотОбъект, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	Открытьформу("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ФормаОплаты) Тогда
		Объект.ФормаОплаты = ТекущаяФормаОплаты; 
	КонецЕсли; 

	Если ТекущаяФормаОплаты = Объект.ФормаОплаты Тогда
		Возврат;
	КонецЕсли; 

	ТекущаяФормаОплаты = Объект.ФормаОплаты;
    УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	 УстановитьЗаголовокФормыДокумента(ЭтотОбъект);
	 УправлениеФормой(ЭтотОбъект);
	 
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	УстановитьЗаголовокФормыДокумента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПлатежи

&НаКлиенте
Процедура ТаблицаПлатежиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		СтандартнаяОбработка  = Ложь;
		ПредставлениеДействия = НСтр("ru = 'Просмотр и редактирование позиции.'; en = 'View and edit the position.'");
		
		ПредложитьЗаписатьДокумент(ПредставлениеДействия, Новый Структура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНаСогласование(Команда)
	
	Объект.ОтправленНаСогласование = НЕ Объект.ОтправленНаСогласование;
	Отказ = Ложь;
	Попытка
		Записать();
	Исключение
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Не удалось записать документ по причине: %1.'; 
							|en = 'The document could not be recorded due to:'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецПопытки;
	
	Если Отказ Тогда
		Объект.ОтправленНаСогласование = НЕ Объект.ОтправленНаСогласование;
	Иначе
		Если НЕ Объект.ОтправленНаСогласование  Тогда
			ОчиститьВсеВизы();
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДокументыПоступленияДС(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	НовыеДокументы = СформироватьДокументыПоступленияДС();
	
	Для каждого Документ Из НовыеДокументы Цикл
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Документ));
	КонецЦикла;

КонецПроцедуры

// Создает платежные документы на основании документа планирования. 
//
&НаКлиенте
Процедура ВвестиДокументыПоступленияДСВыделенные(Команда)
	
	Если ЭтотОбъект.Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.ТаблицаПлатежи.ВыделенныеСтроки;
	НовыеДокументы   = СоздатьПлатежныеДокументыВыделенные(ВыделенныеСтроки);
	
	Для каждого Документ Из НовыеДокументы Цикл
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Документ));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьПозицию(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаПлатежи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Удалить документ?';en='Delete a document?'");
	Оповещение 	   = Новый ОписаниеОповещения("КомандаУдалитьПозициюЗавершение", ЭтотОбъект); 
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет)
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура КомандаУдалитьПозициюЗавершение(Результат, Дополнительно) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		КомандаУдалитьПозициюНаСервере(Элементы.ТаблицаПлатежи.ТекущаяСтрока);
		ОповеститьОбИзменении(Тип("ДокументСсылка.бит_кзн_ПозицияПоступления"));
		ОбновитьИтоги();
	Исключение
		ПоказатьПредупреждение(, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура СделатьБезРазбиения(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ МожноСделатьБезРазбиения() Тогда
		Возврат;	
	КонецЕсли;	 
	
	Если Модифицированность Тогда
		ПредставлениеДействия = НСтр("ru = 'Переход в режим ""без разбиения""'; 
								|en = 'Switching to the ""no-split"" mode'");
		
		ДополнительныеДанные = Новый Структура("ЗакрытьЭтуФорму", Истина);
		ПредложитьЗаписатьДокумент(ПредставлениеДействия, ДополнительныеДанные);	
	Иначе
		ОткрытьФормуПозиции(Неопределено);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СтандартныеПодсистемыСвойства

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ОбновитьИтоги();
	УправлениеФормой(ЭтотОбъект);
	УстановитьСостояниеДокумента();
	УстановитьОтборПлатежей();
	
КонецПроцедуры

&НаСервере
Функция СоздатьПлатежныеДокументыВыделенные(ВыделенныеСтроки)
	
	ДанныеЗаполнения = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.НовыеПараметрыДокументаСоздатьПлатежныеДокументы(); 
	
	Для каждого Элемент Из ВыделенныеСтроки Цикл
		НоваяСтрока = ДанныеЗаполнения.Позиции.Добавить();
		НоваяСтрока.Позиция = Элемент.Ссылка;
		НоваяСтрока.Сумма	= Элемент.СуммаДокумента;
	КонецЦикла;

	НовыеДокументы = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.СоздатьДокументыНаОсновеВыделенных(
						Объект.Ссылка, ДанныеЗаполнения);

	Возврат НовыеДокументы.ВыгрузитьКолонку("ДокументОплаты");

КонецФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	КэшЗначений = Новый Структура;
	
	КэшЗначений.Вставить("ИзмеренияДоп"      , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним"));
	КэшЗначений.Вставить("НастройкиИзмерений", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	КэшЗначений.Вставить("ВалютаРеглУчета"	  , Константы.ВалютаРегламентированногоУчета.Получить());
		
	
	ТекПользователь	   = Пользователи.ТекущийПользователь();
	РазрешеноПроводить = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(ТекПользователь, 
							ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноПроводитьПланируемыеПоступленияДС);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НомерДата(Ссылка, Номер, Дата)

	НомерДата = "";
	Если ЗначениеЗаполнено(Ссылка) Тогда
		НомерДата = " " + НСтр("ru = '%1 от %2'");
		НомерДата = СтрШаблон(НомерДата, Номер, Дата);
	КонецЕсли;
	
	Возврат НомерДата;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект	 	= Форма.Объект;
	Элементы 	= Форма.Элементы;
	КэшЗначений = Форма.КэшЗначений;
	
	бит_НастройкиДоступностиЭлементовФормКлиентСервер.РазблокироватьЭлементы(Форма);
	
	ЭтоНовый = ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), Истина, Ложь);
	ЭтоПрогноз = ?(Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.Прогноз"), Истина, Ложь);
	
	Элементы.ТаблицаПлатежи.Доступность = НЕ ЭтоНовый;
	
	// Кнопки провести/на согласование.
	Элементы.ФормаПровестиИЗакрыть.Видимость         = Форма.РазрешеноПроводить;
	Элементы.ФормаПровести.Видимость                 = Форма.РазрешеноПроводить;
	Элементы.ФормаПровестиИЗакрыть.КнопкаПоУмолчанию = Форма.РазрешеноПроводить;
	
	ТекстЗаголовка =?(Объект.ОтправленНаСогласование, 
					  НСтр("ru='Отозвать';en='Revoke'"), НСтр("ru='На согласование';en='For Approval'"));
	
	Элементы.ФормаКомандаНаСогласование.Видимость         = НЕ Форма.РазрешеноПроводить;
	Элементы.ФормаКомандаНаСогласование.КнопкаПоУмолчанию = НЕ Форма.РазрешеноПроводить;
	Элементы.ФормаКомандаНаСогласование.Заголовок         = ТекстЗаголовка;
	Элементы.ФормаКомандаНаСогласование.Доступность       = НЕ Объект.Проведен;
	
	Элементы.ДокументОснование.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	// Управление видимостью команд создания платежных документов.
	Если Форма.ТипСтатуса <> ПредопределенноеЗначение("Перечисление.бит_ТипыСтатусовОбъектов.Утвержден")
	   И Форма.ТипСтатуса <> ПредопределенноеЗначение("Перечисление.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен") Тогда
		Элементы.ФормаВвестиДокументыПоступленияДС.Доступность                  = Ложь;
		Элементы.ТаблицаПлатежиВвестиДокументыПоступленияВыделенные.Доступность = Ложь;
		Элементы.ФормаВвестиПланируемоеПоступленияДС.Доступность                = Ложь;
	Иначе
		Элементы.ФормаВвестиДокументыПоступленияДС.Доступность					= НЕ ЭтоПрогноз;
		Элементы.ТаблицаПлатежиВвестиДокументыПоступленияВыделенные.Доступность = НЕ ЭтоПрогноз;
		Элементы.ФормаВвестиПланируемоеПоступленияДС.Доступность 				= НЕ ЭтоПрогноз;
	КонецЕсли;

	бит_НастройкиДоступностиЭлементовФормКлиентСервер.ЗаблокироватьЭлементы(Форма);
	
КонецПроцедуры

// Процедура устанавливает отбор у динамического списка.
//
&НаСервере
Процедура УстановитьОтборПлатежей()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТаблицаПлатежи, "ДокументПланирования", 
		Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,, Истина, 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	СкрытьПомеченныеНаУдаление = НЕ Объект.ПометкаУдаления;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТаблицаПлатежи, "ПометкаУдаления", 
		Ложь, ВидСравненияКомпоновкиДанных.Равно,, СкрытьПомеченныеНаУдаление, 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);

КонецПроцедуры

&НаСервере
Процедура СкопироватьПозицииПриЗаписи(ДокументПланирования, Отказ)
	
	Если НЕ ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		Возврат;
	КонецЕсли;	
		
	РезультатПоиска = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(ЗначениеКопирования);
	
	НачатьТранзакцию();
	Попытка
		Для каждого Позиция Из РезультатПоиска.МассивПозиций Цикл
			ПозицияПриемник = Позиция.Скопировать();
			ПозицияПриемник.ДокументОснование 	 = Неопределено;
			ПозицияПриемник.ДокументПланирования = ДокументПланирования;
			ПозицияПриемник.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
			бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ПозицияПриемник, РежимЗаписиДокумента.Запись, , "Ошибки");
		КонецЦикла; 
		ЗначениеКопирования = Неопределено;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ОчиститьВсеВизы()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		бит_ВизированиеСервер.ОчиститьВсеВизыБезусловно(Объект.Ссылка);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция СформироватьДокументыПоступленияДС()

	НовыеДокументы = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.СоздатьДокументыНаОсновеЗаявки(Объект.Ссылка);

	Если ЗначениеЗаполнено(НовыеДокументы) Тогда
		Результат = НовыеДокументы.ВыгрузитьКолонку("ДокументОплаты");
		Результат = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат);
	Иначе
		Результат = Новый Массив;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ОбновитьИтоги()

	Запрос = Новый Запрос;             
	Запрос.УстановитьПараметр("ДокументПланирования", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПометкаУдаления", 	  Объект.ПометкаУдаления);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(Таблица.СуммаДокумента) КАК Сумма,
	|	СУММА(Таблица.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	Документ.бит_кзн_ПозицияПоступления КАК Таблица
	|ГДЕ
	|	Таблица.ДокументПланирования = &ДокументПланирования
	|	И Таблица.ПометкаУдаления = &ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка); 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПолеДокументОснование()

	Объект.ДокументОснование = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ПустаяСсылка();

КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусНаСервере()

	РезСтруктура = бит_ВизированиеСервер.СтатусыОбъекта(Объект.Ссылка);
	
	Возврат РезСтруктура;
	
КонецФункции // ПолучитьСтатусНаСервере()

&НаСервере
Процедура КомандаУдалитьПозициюНаСервере(Позиция)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезПоиска = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(Объект.Ссылка);
	
	Если РезПоиска.КоличествоПозиций > 1 Тогда
		ПозицияОбъект = Позиция.ПолучитьОбъект();
		ПозицияОбъект.УстановитьПометкуУдаления(Истина); 
	Иначе
		ТекстСообщения = НСтр("ru = 'Единственную позицию нельзя удалить. Закройте документ и установите пометку удаления в списке.';
							  |en = 'A single position cannot be deleted. Close the document and select the delete option in the list.'"); 
		ВызватьИсключение ТекстСообщения;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокФормыДокумента(Форма)
	
	Объект = Форма.Объект;
	
	ПредставлениеОбъекта = "";
	Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.Прогноз") Тогда		
		ПредставлениеОбъекта = НСтр("ru='Прогноз поступления%1';en='Forecast revenue%1'"); 			
	Иначе
		ПредставлениеОбъекта = НСтр("ru='Планируемое поступление средств%1';en='Planned Receipt%1'");
	КонецЕсли; 
	
	ПредставлениеОбъекта = СтрШаблон(ПредставлениеОбъекта, НомерДата(Объект.Ссылка, Объект.Номер, Объект.Дата));

	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , "");
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Объект.Ссылка.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиентСервер.УстановитьЗаголовокФормыДокумента(Форма, СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

&НаКлиенте
Процедура ОжиданиеОткрытияФормы()
		
	Оповещение = Новый ОписаниеОповещения("ОжиданиеОткрытияФормыЗавершение",ЭтотОбъект);
	ТекстВопроса =  НСтр("ru='Выполнить копирование и записать документ?';en='Make a copy and write the document?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Да);

КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте 
Процедура ОжиданиеОткрытияФормыЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	КопироватьПозиции = ?(Ответ = КодВозвратаДиалога.Да, Истина, Ложь);
	
	Если КопироватьПозиции Тогда
		ОчиститьПолеДокументОснование();
		Записать();
		КопироватьПозиции = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаписатьДокумент(ПредставлениеДействия, ДополнительныеДанные)

	ЧастиВопроса = Новый Массив;

	ТекстВопроса = НСтр("ru = 'Данные еще не записаны.'; en = 'The data has not been recorded yet.'");
	ЧастиВопроса.Добавить(ТекстВопроса);
	
	ТекстВопроса = НСтр("ru = 'Выполнение действия ""%1"" возможно только после записи данных.'; 
						|en = 'The ""%1"" action can only be performed after data is written.'");
	ТекстВопроса = СтрШаблон(ТекстВопроса, ПредставлениеДействия);
	ЧастиВопроса.Добавить(ТекстВопроса);
	
	ТекстВопроса = НСтр("ru = 'Записать документ?'; en = 'Write down a document?'");
	ЧастиВопроса.Добавить(ТекстВопроса);
	
	ТекстСообщения = СтрСоединить(ЧастиВопроса, Символы.ПС);
	
	Оповещение = Новый ОписаниеОповещения("ПредложитьЗаписатьДокументЗавершение", ЭтотОбъект, ДополнительныеДанные);

	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет,);

КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПредложитьЗаписатьДокументЗавершение(Результат, ДополнительныеДанные) Экспорт

	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	

	Попытка
		Записать();		
	Исключение
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки; 
	
	ЗакрытьЭтуФорму = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеДанные, "ЗакрытьЭтуФорму", Ложь);

	Ссылка		   = Элементы.ТаблицаПлатежи.ТекущаяСтрока;
	ПараметрыФормы = Новый Структура("Ключ", Ссылка);
	Если ЗакрытьЭтуФорму Тогда
		ОткрытьФормуПозиции(Неопределено);
		Закрыть();
	Иначе	
		ОткрытьФормуПозиции(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция МожноСделатьБезРазбиения()

	МожноСделать = Истина;
	
	РезультатПоиска = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(Объект.Ссылка);
	Если РезультатПоиска.КоличествоПозиций > 1 Тогда
		ТекстСообщения = НСтр("ru = 'Переключение в режим без разбиения невозможно, если в введено более одной позиции поступления.'; 
							|en = 'Switching to the  no-split mode is not possible if more than one entry position is entered.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		МожноСделать = Ложь;
	КонецЕсли;
	
	Возврат МожноСделать;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПозиции(ФормаВладелец)
	
	Ссылка = Элементы.ТаблицаПлатежи.ТекущаяСтрока;
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", Ссылка);
	Если ФормаВладелец <> Неопределено Тогда
		ОткрытьФорму("Документ.бит_кзн_ПозицияПоступления.ФормаОбъекта", ПараметрыФормы, ФормаВладелец, Ссылка);
	Иначе	
		ОткрытьФорму("Документ.бит_кзн_ПозицияПоступления.ФормаОбъекта", ПараметрыФормы,, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

#КонецОбласти