#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область Свойства

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений - с колонками:
//     * Имя           - Строка - Имя набора свойств. Формируется из полного имени объекта
//                       метаданных заменой символа "." на "_".
//                       Например, "Документ_ЗаказПокупателя".
//     * Идентификатор - УникальныйИдентификатор - Идентификатор ссылки предопределенного элемента.
//     * Используется  - Неопределено, Булево - Признак того, что набор свойств используется.
//                       Например, можно использовать для скрытия набора по функциональным опциям.
//                       Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя           = "Справочник_бит_ВнутренниеДокументы";
	Набор.ЭтоГруппа     = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("29702f82-dc81-46c4-b40c-3e0fcd867df5");
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПечати

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
		
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "УправлениеПечатью";
	КомандаПечати.Идентификатор  = "Справочник.бит_ВнутренниеДокументы.ПФ_MXL_ВнутреннийДокумент";
	КомандаПечати.Представление  = НСтр("ru = 'Внутренний документ'");
  
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании,
													Метаданные.Справочники.бит_ВнутренниеДокументы);
КонецФункции

Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводНаОснованииПриемники.Шаблон КАК Шаблон,
	|	ВводНаОснованииПриемники.Ссылка КАК ВидДокумента,
	|	ШаблоныВводаНаОсновании.Наименование КАК ПредставлениеШаблона,
	|	ОбъектыСистемы.ИмяОбъектаПолное КАК ИмяПримника
	|ИЗ
	|	Справочник.бит_ВидыВнутреннихДокументов.ВводНаОснованииПрименики КАК ВводНаОснованииПриемники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ШаблоныВводаНаОсновании КАК ШаблоныВводаНаОсновании
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
	|			ПО ШаблоныВводаНаОсновании.ОбъектПриемник = ОбъектыСистемы.Ссылка
	|		ПО ВводНаОснованииПриемники.Шаблон = ШаблоныВводаНаОсновании.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШаблоныВводаНаОсновании.Наименование
	|ИТОГИ
	|	МАКСИМУМ(ПредставлениеШаблона),
	|	МАКСИМУМ(ИмяПримника)
	|ПО
	|	Шаблон";
	ВыборкаШаблонов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаШаблонов.Следующий() Цикл
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер      = ВыборкаШаблонов.ИмяПримника;
		КомандаСоздатьНаОсновании.Представление = ВыборкаШаблонов.ПредставлениеШаблона;
		КомандаСоздатьНаОсновании.РежимЗаписи   = "Записывать";
		КомандаСоздатьНаОсновании.ДополнительныеПараметры.Вставить("ШаблонВводаНаОсновании", ВыборкаШаблонов.Шаблон);
		
		ВидыДокументов  = Новый СписокЗначений;
		Выборка = ВыборкаШаблонов.Выбрать();
		Пока Выборка.Следующий() Цикл
			ВидыДокументов.Добавить(Выборка.ВидДокумента);
		КонецЦикла;
		
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаСоздатьНаОсновании,
															"ВидДокумента",
															ВидыДокументов,
															ВидСравнения.ВСписке);
	КонецЦикла;
	
КонецПроцедуры

// Определяет новый статус объекта по умолчанию. Может переопределяться пользовательскими алгоритмами.
//
// Параметры:
// 	ТекущийОбъект - СправочникОбъект.бит_ВнутренниеДокументы.
// 	ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
// 	СправочникСсылка.бит_СтатусыОбъектов - новый статус объекта.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Возврат бит_ВизированиеСервер.НовыйСтатусПоСтандартномуАлгоритму(ТекущийОбъект, ПараметрыУстановкиСтатуса);
    
КонецФункции

// Элементы формы, которые не блокируются в зависимости от статуса.
//
// Возвращаемое значение:
// 	СписокЗначений - Список имен элементов.
//
Функция ЭлементыИсключенияНастройкиДоступности() Экспорт
	
	ИсключаемыеЭлементы = Новый СписокЗначений;
	
	Возврат ИсключаемыеЭлементы;
	
КонецФункции

// См. УправлениеПечатью.КомандыПечатиОбъекта.
Процедура ПриПолученииКомандПечати(КомандыПечати, ИмяОбъекта) Экспорт
	
	НазначениеПечатныхФорм = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПечатныеФормыВнутреннихДокументов.Идентификатор КАК Идентификатор,
	|	ПечатныеФормыВнутреннихДокументов.Ссылка КАК ВидДокумента
	|ИЗ
	|	Справочник.бит_ВидыВнутреннихДокументов.ПечатныеФормы КАК ПечатныеФормыВнутреннихДокументов
	|ИТОГИ ПО
	|	Идентификатор";
	ВыборкаИдентификаторов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИдентификаторов.Следующий() Цикл
		ВидыДокументов  = Новый СписокЗначений;
		Выборка = ВыборкаИдентификаторов.Выбрать();
		Пока Выборка.Следующий() Цикл
			ВидыДокументов.Добавить(Выборка.ВидДокумента);
		КонецЦикла;
		НазначениеПечатныхФорм.Вставить(ВыборкаИдентификаторов.Идентификатор, ВидыДокументов);
	КонецЦикла;
	
	Для каждого КомандаПечати Из КомандыПечати Цикл
		ИдентификаторПФ = КомандаПечати.Идентификатор;
		ВидыДокументов  = НазначениеПечатныхФорм.Получить(ИдентификаторПФ);
		Если ВидыДокументов = Неопределено Тогда
			ВидыДокументов = Новый СписокЗначений;
		КонецЕсли;
		УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
															"ВидДокумента",
															ВидыДокументов,
															ВидСравнения.ВСписке);
	КонецЦикла;
		
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецЕсли