&НаСервере
Функция ПолучитьМассивЗначений(ЭлементСправочника, Объект = Неопределено, ТолькоПервое = Ложь) Экспорт
	
	Если ТипЗнч(ЭлементСправочника) = Тип("Строка") Тогда
		ЗначенияСправочника = Справочники.бит_ЗначенияПоУмолчанию[ЭлементСправочника].Значения.ВыгрузитьКолонку("Значение");	
	Иначе	
		ЗначенияСправочника = ЭлементСправочника.Значения.ВыгрузитьКолонку("Значение");
	КонецЕсли;	
		
	Если ЗначенияСправочника.Количество() <> 0 Тогда
		
		Если ТолькоПервое Тогда
			
			Возврат ЗначенияСправочника[0];
							
		Иначе
			
			Возврат ЗначенияСправочника;
			
		КонецЕсли;
		
	Иначе	
		
		Если ТолькоПервое Тогда
			ТекстСообщения = "Не установлено значение по умолчанию для элемента """ + ЭлементСправочника + """ справочника ""(бит) Значения по умолчанию""!";
			
			Если Объект <> Неопределено Тогда
				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = ТекстСообщения;
				СообщениеПользователю.КлючДанных = ЭлементСправочника; 
				СообщениеПользователю.УстановитьДанные(Объект);
				СообщениеПользователю.Сообщить();
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭлементСправочника);
			КонецЕсли;
			
			//Сообщить("Не установлено значение по умолчанию для элемента """ + ЭлементСправочника + """ справочника ""(бит) Значения по умолчанию""!");
			
			Возврат Неопределено;	
			
		Иначе	
			ТекстСообщения = "Не установлены значения по умолчанию для элемента """ + ЭлементСправочника + """ справочника ""(бит) Значения по умолчанию""!";
			Если Объект <> Неопределено Тогда
				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = ТекстСообщения;
				СообщениеПользователю.КлючДанных = ЭлементСправочника;
				СообщениеПользователю.УстановитьДанные(Объект);
				СообщениеПользователю.Сообщить();
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭлементСправочника);
			КонецЕсли;
			//Сообщить("Не установлены значения по умолчанию для элемента """ + ЭлементСправочника + """ справочника ""(бит) Значения по умолчанию""!");
			
			Возврат Новый Массив;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецФункции    

&НаСервере
Функция ЗначениеВходитВМассив(ЭлементСправочника, ИскомоеЗначение) Экспорт

	МассивЗначений = ПолучитьМассивЗначений(ЭлементСправочника, Неопределено);
		
	РезультатПоиска = МассивЗначений.Найти(ИскомоеЗначение);
	
	Возврат ?(РезультатПоиска = Неопределено, Ложь, Истина);
	
КонецФункции