#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает тип проверяемого решения.
// 
// Параметры:
//  Решение     - СправочникСсылка.бит_ВидыРешенийСогласования.
//  КэшПроверок - Соответствие, Неопределено.
// 
// Возвращаемое значение:
//   ПеречислениеСсылка.бит_ТипыРешений
//
Функция ТипРешенияСогласования(Решение, КэшПроверок = Неопределено) Экспорт
	
	Если КэшПроверок <> Неопределено Тогда
		ТипРешения = КэшПроверок.Получить(Решение);
		Если ТипРешения <> Неопределено Тогда
			Возврат ТипРешения;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Решение) Тогда
		ТипРешения = Перечисления.бит_ТипыРешений.ПустаяСсылка();
	Иначе
		ТипРешения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Решение, "ТипРешения");
	КонецЕсли;
	
	Если КэшПроверок <> Неопределено Тогда
		КэшПроверок.Вставить(Решение, ТипРешения);
	КонецЕсли;
	
	Возврат ТипРешения;
	
КонецФункции

// Возвращает все решения указанного типа.
// 
// Параметры:
//  ТипРешения - ПеречислениеСсылка.бит_ТипыРешений.
// 
// Возвращаемое значение:
//	СписокЗначений - Элементы коллекции имеебт тип СправочникСсылка.бит_ВидыРешенийСогласования.
//
Функция ВсеРешенияПоТипу(ТипРешения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыРешений.Ссылка КАК Решение
	|ИЗ
	|	Справочник.бит_ВидыРешенийСогласования КАК ВидыРешений
	|ГДЕ
	|	ВидыРешений.ТипРешения = &ТипРешения";
	Запрос.УстановитьПараметр("ТипРешения", ТипРешения);
	Решения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Решение");
	
	СписокРешений = Новый СписокЗначений;
	СписокРешений.ЗагрузитьЗначения(Решения);
	
	Возврат СписокРешений;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьТипыРешенийПриОбновлении() Экспорт
	
	РешениеСогласовано = Справочники.бит_ВидыРешенийСогласования.Согласовано.ПолучитьОбъект();
	РешениеСогласовано.ТипРешения = Перечисления.бит_ТипыРешений.Согласующее;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РешениеСогласовано);
	
	РешениеОтклонено = Справочники.бит_ВидыРешенийСогласования.Отклонено.ПолучитьОбъект();
	РешениеОтклонено.ТипРешения = Перечисления.бит_ТипыРешений.Отклоняющее;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РешениеОтклонено);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли