
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	бит_РаботаСДиалогамиСервер.ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Подготовим параметры, необходимые для отображения доп. измерений.
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");	
	ИзмеренияДоп = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним");
	
	СоответствиеИмен = Новый Соответствие;
	Для Каждого ТекЭлемент Из ИзмеренияДоп Цикл
		ПараметрыИмени = Новый Структура();
		ПараметрыИмени.Вставить("ИмяПоля" , СтрШаблон("%1_Зависимый", ТекЭлемент.Ключ));
		ПараметрыИмени.Вставить("Префикс" , "");
		ПараметрыИмени.Вставить("Постфикс", Символы.НПП + НСтр("ru = 'зависимый'; en = 'зависимый'"));
		СоответствиеИмен.Вставить(ТекЭлемент.Ключ, ПараметрыИмени);
	КонецЦикла;
	
    // Отобразим дополнительные измерения в табличном поле.
	бит_МеханизмДопИзмерений.ОтобразитьДополнительныеИзмеренияВТабличномПоле_Управляемая(ЭтотОбъект,
							"" , ИзмеренияДоп, НастройкиИзмерений);
																			  
	бит_МеханизмДопИзмерений.ОтобразитьДополнительныеИзмеренияВТабличномПоле_Управляемая(ЭтотОбъект,
							"", ИзмеренияДоп , НастройкиИзмерений, СоответствиеИмен);
																			 
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти
