#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка схемы, загрузка настроек
	СхемаКомпоновкиДанных = ИТК_НастройкиОтбора.СхемаКомпоновкиДанных(Параметры.ИспользуемыеТипы);
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	
	Если ЗначениеЗаполнено(Параметры.Настройки) Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.Настройки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)

	Для Каждого ЭлементОтбор Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл 
		
		Если Не ЗначениеЗаполнено(ЭлементОтбор.ИдентификаторПользовательскойНастройки) Тогда
			
			ЭлементОтбор.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Закрыть(КомпоновщикНастроек.Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастроекНастройкиОтбор

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено 
			ИЛИ ТекущиеДанные.ЛевоеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Поле = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ТекущиеДанные.ЛевоеЗначение);
	Если Поле = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_ФормаКлиент.АктивизацияЗначенияВФорме(Элементы.КомпоновщикНастроекНастройкиОтборПравоеЗначение, ТекущиеДанные.ПравоеЗначение, Поле.ТипЗначения);

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Строка = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные;
	Поле = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Строка.ЛевоеЗначение);
	
	Если Поле = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВводЗначенияЗавершен", ЭтотОбъект, ДополнительныеПараметры);
	
	ЗаголовокФормы = НСтр("ru = 'Настройка отбора';
							|en = 'Настройка отбора2'");
	ИТК_ФормаКлиент.ВводЗначенияСтрокиВФорме(ЗаголовокФормы, Элемент, Строка.ПравоеЗначение, Поле.ТипЗначения, СтандартнаяОбработка, ОписаниеОповещенияЗавершение);

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПравоеЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОчисткаЗначенияСтрокиВФорме(Элемент, СтандартнаяОбработка);
	
	Строка = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные;
	Поле = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Строка.ЛевоеЗначение);
	
	Если Поле = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//рока.ПравоеЗначение = Поле.ТипЗначения.ПривестиЗначение(Неопределено);
	СтандартнаяОбработка = Истина;
	ИТК_ФормаКлиент.АктивизацияЗначенияВФорме(Элемент, Неопределено, Поле.ТипЗначения);

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПравоеЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОбработкаВыбораЗначенияВФорме(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПравоеЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.АвтоПодборЗначенияВФорме(Текст, Элемент, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВводЗначенияЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Строка = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные;
	Поле = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Строка.ЛевоеЗначение);
	
	ЕстьРезультат = ИТК_ФормаКлиент.ОбработкаЗавершенВводЗначенияВФорме(Элементы.КомпоновщикНастроекНастройкиОтборПравоеЗначение, Результат,
																		ДополнительныеПараметры, Неопределено, Поле.ТипЗначения);
																		
	Если ЕстьРезультат Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
