
&НаКлиенте
Процедура Актуализировать(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВариантАктуализации",             ВариантАктуализации);
	СтруктураПараметров.Вставить("Сценарий",                        ФактическийСценарий);
	СтруктураПараметров.Вставить("ДатаАктуализации",                ДатаАктуализации);
	СтруктураПараметров.Вставить("АктуализироватьГрафикНачислений", АктуализироватьГрафикНачислений);
	
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// значения по умолчанию при создании формы
	ДатаАктуализации    = ТекущаяДатаСеанса();
	ВариантАктуализации = Перечисления.бит_ВариантыАктуализации.РавномернаяКорректировка;
	
КонецПроцедуры
