
// Процедура - обработчик команды.
// 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументСсылка", ПараметрКоманды);
	
	Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
		
		ОткрытьФорму("Обработка.бит_РезультатПроведения.Форма"
					,ПараметрыФормы
					,ПараметрыВыполненияКоманды.Источник
					,ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор
					,ПараметрыВыполненияКоманды.Окно);
	Иначе
		
		Форма = ПолучитьФорму("Обработка.бит_РезультатПроведения.Форма"
							 ,ПараметрыФормы
							 ,ПараметрыВыполненияКоманды.Источник 
							 ,ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор
							 ,ПараметрыВыполненияКоманды.Окно);
		Форма.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры
