
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстЗаголовка = НСтр("ru = 'История изменения реквизита ""%1"" для ""%2""'; 
						  |en = 'История изменения реквизита ""%1"" для ""%2""'");
	Заголовок = СтрШаблон(ТекстЗаголовка, ПредставлениеРеквизита, Объект);
		
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Объект"				   , Объект);
	Параметры.Свойство("ИмяРеквизита"		   , ИмяРеквизита);
	Параметры.Свойство("ПредставлениеРеквизита", ПредставлениеРеквизита);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РегистрСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РегистрСписок.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ЭтотОбъект.ВладелецФормы <> Неопределено Тогда
		
		Если ТипЗнч(ЭтотОбъект.ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		 	ОбъектВладелец 		= ЭтотОбъект.ВладелецФормы.Объект;
			ЕстьРеквизитОбъекта = ОбъектВладелец.Свойство(ИмяРеквизита);
		Иначе
			ОбъектВладелец 		= ЭтотОбъект.ВладелецФормы.СправочникОбъект;
			ЕстьРеквизитОбъекта = ОбъектВладелец.Метаданные().Реквизиты.Найти(ИмяРеквизита) <> Неопределено;
		КонецЕсли;
				
		Если ЕстьРеквизитОбъекта Тогда
			ОбъектВладелец[ИмяРеквизита] = ТекущиеДанные.ЗначениеРеквизита;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры // РегистрСписокВыбор()

#КонецОбласти
