#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура заполняет реквизит "ВидОперации" справочника хозяйственных операций. 
// "ВидОперации" заменяет устаревший реквизит "Имя".
Процедура ЗаполнитьВидОперацииПриОбновлении() Экспорт
		
КонецПроцедуры
 
// Процедура заполняет справочник хозяйственных операций по умолчанию из макета. 
//
Процедура ЗаполнитьПоУмолчанию(ВыводитьСообщения = Ложь) Экспорт
	
КонецПроцедуры

//  Процедура для обновления на 3.2.6. 
//
Процедура ИзменениеХозяйственныхОпераций() Экспорт 
	
КонецПроцедуры

//  Процедура для обновления на 3.2.10. 
//
Процедура ИзменениеХозяйственныхОпераций_3_2_10() Экспорт 
	
КонецПроцедуры

//  Процедура для обновления на 3.2.13. 
//
Процедура ИзменениеХозяйственныхОпераций_3_2_13() Экспорт 
		
КонецПроцедуры
 
#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#КонецЕсли
