
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БалансоваяСтоимость = Параметры.БалансоваяСтоимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчитатьСуммуОбесценения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВозмещаемаяСтоимостьПриИзменении(Элемент)
	
	ПересчитатьСуммуОбесценения();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Распределить(Команда)
	
	Если ВозмещаемаяСтоимость > БалансоваяСтоимость Тогда
		ТекстСообщения = НСтр("ru = 'Возмещаемая стоимость не должна превышать балансовую стоимость'; en = 'The recoverable amount must not exceed the carrying amount'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ВозмещаемаяСтоимость");
	Иначе
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВозмещаемаяСтоимость", ВозмещаемаяСтоимость);
		
		Закрыть(СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьСуммуОбесценения()
	Обесценение = БалансоваяСтоимость - ВозмещаемаяСтоимость;
КонецПроцедуры

#КонецОбласти





