
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	
		
	// Вызов механизма защиты
	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// Заполнение
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		
		СтруктураЗаполнения = Параметры.ЗначенияЗаполнения;
		ЗаполнитьЗначенияСвойств(Объект, СтруктураЗаполнения);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти