
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Бот = Параметры.Бот;
	
	ПолучитьЧатыТекущегоБота();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
   ЗаписатьДанные();
   ОповеститьОбИзменении(Тип("СправочникСсылка.бит_ЧатыTelegram"));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьЗакрыть(Команда)
	
   ЗаписатьДанные();
   ОповеститьОбИзменении(Тип("СправочникСсылка.бит_ЧатыTelegram"));	   
   Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьВсе(Команда)
	
	ОбработатьФлаги(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсе(Команда)
	
	ОбработатьФлаги(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ПолучитьЧатыТекущегоБота();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура создает чаты и назначает пользователям.
//
&НаСервере
Процедура ЗаписатьДанные()

	КоличествоЗаписанных = 0;
	
	Для каждого СтрокаТаблицы Из ТаблицаЧаты Цикл
		
		Если НЕ СтрокаТаблицы.Выполнять Тогда
			Продолжить;
		КонецЕсли; 
		
		ДанныеЧата = Справочники.бит_ЧатыTelegram.ДанныеЧатаПоИдентификатору(СтрокаТаблицы.ИД, Бот);
		Если НЕ ЗначениеЗаполнено(ДанныеЧата.Чат) Тогда
			
			НовыйЧат = Справочники.бит_ЧатыTelegram.СоздатьЭлемент();
			НовыйЧат.ИД 			   = СтрокаТаблицы.ИД;
			НовыйЧат.ОсновнойБот 	   = Бот;
			НовыйЧат.Наименование 	   = СтрокаТаблицы.Наименование;
			НовыйЧат.СтатусРегистрации = Перечисления.бит_СтатусРегистрацииТелеграм.ОжидаетРегистрации;
			
			НовыйЧат.УстановитьНовыйКод();
			Если НовыйЧат.ПроверитьЗаполнение() Тогда
				НовыйЧат.Записать();
				КоличествоЗаписанных = КоличествоЗаписанных + 1;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ТекстСообщения = НСтр("ru='Записано %1 чатов.';en='Recorded chats %1.'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, КоличествоЗаписанных);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	ПолучитьЧатыТекущегоБота();
	
КонецПроцедуры // ЗаписатьДанные()

&НаСервере
Процедура ПолучитьЧатыТекущегоБота()
	
	ТаблицаЧаты.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Бот.Токен) Тогда
	
		ТекстСообщения = НСтр("ru='Выберите бота.';en='Select bot.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	КонецЕсли; 
	
	РезДанные = Справочники.бит_БотыTelegram.НайтиЧаты(Бот);
	
	Для каждого МодельСтроки Из РезДанные.Данные Цикл
	
		НоваяСтрока = ТаблицаЧаты.Добавить();
		НоваяСтрока.Выполнять = Истина;
		НоваяСтрока.ИД = МодельСтроки.ИД;
		НоваяСтрока.Наименование = МодельСтроки.Наименование;
	
	КонецЦикла;  		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлаги(ЗначениеФлага)
	
	Для каждого СтрокаТаблицы Из ТаблицаЧаты Цикл
		СтрокаТаблицы.Выполнять = ЗначениеФлага;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти