
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ4.6] [ASHolyavko@1cbit.ru] [29.06.2026] +        
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_НомерКредитногоДоговораКлиента", Тип("ПолеФормы"), Элементы.ГруппаПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НомерКредитногоДоговораКлиента";
	
	// }}ПервыйБИТ ЛистТребований [ЛТ4.6] [ASHolyavko@1cbit.ru] [29.06.2026] -
	
КонецПроцедуры
