
#Область ПрограммныйИнтерфейс

// Возвращает группу где необходимо поместить элемент формы (декорация) со статуом ошибки ГИСНР
// или конфигурация потребитель создает декорацию формы самостоятельно.
// Элемент формы должен иметь имя = ЭлектронноеАктированиеЕИСГИСНРКлиентСервер.ИмяДекорацииФормыСтатусаОШибкиГИСНР.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта
//  ЭлементГруппы - ДекорацияФормы - группа формы которая будет содержать информационное сообщение об ошибке
//                - Неопределено
//
Процедура ПолучитьЭлементФормыДляСтатусаОшибкиГИСНР(Форма, ЭлементГруппы) Экспорт
	
КонецПроцедуры

// Заполняет типы объектов из которых вызывается команда открытия формы ошибки.
// 
// Параметры:
//  ТипыОбъектов - Массив из Тип - типы объектов
//
Процедура ЗаполнитьТипыОбъектовВызоваКомандыОткрытияФормыОшибки(ТипыОбъектов) Экспорт
	
КонецПроцедуры

#КонецОбласти
