&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 +
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("Номенклатура") Тогда
			Запись.бит_Номенклатура = Параметры.Отбор.Номенклатура;
		КонецЕсли;
	КонецЕсли; 
	
	Если Параметры.Свойство("Источник") Тогда
		Запись.бит_Номенклатура = Параметры.Источник;
	КонецЕсли;
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
КонецПроцедуры

&НаКлиенте
Процедура бит_ПризнакПриИзменении(Элемент)
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 +
	бит_ПризнакПриИзмененииНаСервере();
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
КонецПроцедуры 

&НаСервере
Процедура бит_ПризнакПриИзмененииНаСервере()
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 +
	Запись.бит_ПризнакСертификации = Запись.бит_Признак.бит_ПризнакСертификации;
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
КонецПроцедуры
