
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ИспользуетсяСинхронизация = ПолучитьФункциональнуюОпцию("бит_СинхронизироватьПодразделенияРеглЦФО");
	
	Элементы.Список.ИзменятьСоставСтрок 		   = НЕ ИспользуетсяСинхронизация;
	Элементы.ПредупреждениеОбОграничении.Видимость = ИспользуетсяСинхронизация;
	
КонецПроцедуры

#КонецОбласти

