&Перед("ПриСозданииНаСервере") 
&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	Если Элементы.Найти("бит_ГруппаДополнительныеРеквизиты") = Неопределено Тогда
		бит_СоздатьЭлементыБит(); 
	КонецЕсли;
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -  
	
КонецПроцедуры 

&После("ПриСозданииНаСервере") 
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	бит_ГруппаДополнительныеРеквизитыВидимость = Ложь;
	Для Каждого Подчиненные Из Элементы.бит_ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы Цикл
		Если Подчиненные.Видимость = Истина Тогда
			бит_ГруппаДополнительныеРеквизитыВидимость = Истина;
		КонецЕсли;
	КонецЦикла;
	Элементы.бит_ГруппаДополнительныеРеквизиты.Видимость = бит_ГруппаДополнительныеРеквизитыВидимость; 
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 - 
	
	// {{ПервыйБИТ ЛистТребований [ЛТ_БН] [ASHolyavko@1cbit.ru] [28.07.2026] +        
	
	НовыйЭлемент = Элементы.Добавить("бит_ВидРабочегоЦентра", Тип("ПолеФормы"),ЭтаФорма); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВидРабочегоЦентра";
	
	НовыйЭлемент = Элементы.Добавить("бит_Смена", Тип("ПолеФормы"),ЭтаФорма); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Смена";
	
	НовыйЭлемент = Элементы.Добавить("бит_Перемаркировка", Тип("ПолеФормы"),ЭтаФорма); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Перемаркировка";
	
	// }}ПервыйБИТ ЛистТребований [ЛТ_БН] [ASHolyavko@1cbit.ru] [28.07.2026] -
	
КонецПроцедуры

&Перед("ПриЧтенииСозданииНаСервере")
&НаСервере
Процедура бит_ПриЧтенииСозданииНаСервереПеред() 
	
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	Если Элементы.Найти("бит_ГруппаДополнительныеРеквизиты") = Неопределено Тогда  
		бит_СоздатьЭлементыБит();	
	КонецЕсли;
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -
	
КонецПроцедуры

&НаСервере
Процедура бит_СоздатьЭлементыБит()

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	НоваяГруппа  = Элементы.Добавить("бит_ГруппаДополнительныеРеквизиты",Тип("ГруппаФормы"), ЭтаФорма);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Истина; 
	НоваяГруппа.Заголовок = "(бит) Дополнительно";  
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;  
	//НоваяГруппа.Группировка = ГруппировкаКолонок.Вертикальная;
	
	//(бит) № завеса
	НовыйЭлемент = Элементы.Вставить("бит_НомерЗавеса", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НомерЗавеса";

	//(бит) № заказа
	НовыйЭлемент = Элементы.Вставить("бит_НомерЗаказа", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НомерЗаказа";
			
	//(бит) Брутто, кг
	НовыйЭлемент = Элементы.Вставить("бит_Брутто", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Брутто";
	
	//(бит) Тип тары
	НовыйЭлемент = Элементы.Вставить("бит_ТипТары", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ТипТары";
	
	//(бит) Штрихкод
	НовыйЭлемент = Элементы.Вставить("бит_Штрихкод", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Штрихкод";
    // Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 - 

	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [14.11.2025 13:54:29] +        
	НовыйЭлемент = Элементы.Вставить("бит_НормативнаяМасса", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НормативнаяМасса";
	
	НовыйЭлемент = Элементы.Вставить("бит_Эмалировщик", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Эмалировщик";
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [14.11.2025 13:54:29] -  
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:15:45] +        
	НовыйЭлемент = Элементы.Вставить("бит_Завешено", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Завешено";
	
	НовыйЭлемент = Элементы.Вставить("бит_МассаНетто", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_МассаНетто";
	
	НовыйЭлемент = Элементы.Вставить("бит_Весовщик", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Весовщик";
	
	НовыйЭлемент = Элементы.Вставить("бит_СменаВесовщика", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СменаВесовщика";
	
	НовыйЭлемент = Элементы.Вставить("бит_ДатаВремяЗавеса", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ДатаВремяЗавеса";
	
	НовыйЭлемент = Элементы.Вставить("бит_Контроллёр", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Контроллёр";
	// }}ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:15:45] -
КонецПроцедуры