#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиОбновленияИБ

Процедура ПометкаУстаревшегоПраваИспользованияПанелиИндикаторов() Экспорт
	
	// ++ ЕРП.
	// Ссылка на удаленный предопределенный элемент "РазрешеноИспользованиеПанелиИндикаторов".
	Ссылка = ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.ПолучитьСсылку(
				Новый УникальныйИдентификатор("e7a07eda-9360-11e5-8676-5404a66cbdec"));
	// -- ЕРП.
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.бит_ДополнительныеПраваПользователей КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка
		|	И НЕ Таблица.Наименование ПОДОБНО ""%(Не используется)%""";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Наименование = СтрШаблон("(Не используется) %1", Объект.Наименование);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
