&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:12:25] +        
	Если Параметры.Свойство("ДанныеДляЗаполнения") Тогда
		тзВыбранных = ПолучитьИзВременногоХранилища(Параметры.ДанныеДляЗаполнения.АдресВыбранных);   
		АдресПар = Параметры.ДанныеДляЗаполнения.АдресПар;
		Если АдресПар <> Неопределено Тогда
			тзПар = ПолучитьИзВременногоХранилища(АдресПар);
			тзПар.Сортировать("Номенклатура, Характеристика");
			Таблица.Загрузить(тзПар);	
		КонецЕсли; 
		
		стрОтбора = Новый Структура;
		стрОтбора.Вставить("Номенклатура");
		стрОтбора.Вставить("Характеристика");
		Для каждого стр из тзВыбранных Цикл                                                     
			стрОтбора.Номенклатура = стр.Номенклатура;
			стрОтбора.Характеристика = стр.Характеристика;

			СтрокиПоКлючу = Таблица.НайтиСтроки(стрОтбора);
			Если СтрокиПоКлючу.Количество() Тогда
				ЗаполнитьЗначенияСвойств(СтрокиПоКлючу[0], стр);
				СтрокиПоКлючу[0].Выбрано = Истина;					
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:12:25] -
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:10:55] +        
	АдресОтвета = СформироватьОтветДляДокумента();
	Закрыть(АдресОтвета);
	// }}ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:10:55] -
КонецПроцедуры         

&НаСервере
Функция СформироватьОтветДляДокумента()
	// {{ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [26.03.2026 0:29:13] +        
	тз = Таблица.Выгрузить();
	тз.Очистить();
	СтрокиПоКлючу = Таблица.НайтиСтроки(Новый Структура("Выбрано", Истина));
	Для каждого стр из СтрокиПоКлючу Цикл
		нов = тз.Добавить();
		ЗаполнитьЗначенияСвойств(нов, стр);
	КонецЦикла;                               
	
	Возврат ПоместитьВоВременноеХранилище(тз);
	// }}ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [26.03.2026 0:29:13] -
КонецФункции

&НаКлиенте
Процедура ЗакрытьФормуПодбора(Команда)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:11:19] +        
	Закрыть();
	// }}ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:11:19] -
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоличествоПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:25:56] +        
	ТД = Элементы.Таблица.ТекущиеДанные;
	Если ТД.Количество > 0 Тогда 
		ТД.Выбрано = Истина;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:25:56] -
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаПередУдалением(Элемент, Отказ)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 23:41:19] +        
	Отказ = Истина;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 23:41:19] -
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 23:41:19] +        
	Отказ = Истина;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 23:41:19] -
КонецПроцедуры

