
#Область ОписаниеПеременных

&НаКлиенте
Перем мТекТипЗначения; // Хранит текущий выбранный тип значения элемента ПВХ.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мТекТипЗначения = Объект.ТипЗначения;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.Код) Тогда	
		Объект.Код = СтрЗаменить(ТРег(Объект.Наименование)," ","");	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	Объект.Код = СтрЗаменить(Объект.Код," ","");
	Объект.Код = бит_СтрокиКлиент.ПроверитьСпецСимволы(Объект.Код,,"Имя");
	
	Если ПустаяСтрока(Объект.Наименование) Тогда	
		Объект.Наименование = Объект.Код;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	МассивТипов = Объект.ТипЗначения.Типы();
	
	Если МассивТипов.Количество() > 1 Тогда
		
		ТекстСообщения = НСтр("ru = 'Вид объекта адресации не может быть составного типа.';
						  	  |en = 'Вид объекта адресации не может быть составного типа.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		
		Объект.ТипЗначения = мТекТипЗначения; 
		
	ИначеЕсли МассивТипов.Количество() = 1 Тогда	
		
		Если ПустаяСтрока(Объект.Наименование) Тогда
			
			 ТекТип = МассивТипов[0];
			 ЗаполнитьКодНаименование(ТекТип);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	мТекТипЗначения = Объект.ТипЗначения;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость/доступность элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()

	Элементы.Код.ТолькоПросмотр         = Объект.Предопределенный;
	Элементы.ТипЗначения.ТолькоПросмотр = Объект.Предопределенный;

КонецПроцедуры // УстановитьВидимость()

// Процедура заполняет код и наименование элемента по метаданным выбранного типа.
// 
// Параметры:
//  ТекТип - Тип.
// 
&НаСервере
Процедура ЗаполнитьКодНаименование(ТекТип)
	
	МетаОбъект = Метаданные.НайтиПоТипу(ТекТип);
	
	Если МетаОбъект <> Неопределено Тогда
	
		Имя =  СтрЗаменить(МетаОбъект.Имя, "бит_", "");
		Если ВРег(Имя) = ВРег("Организации") Тогда
		
			Имя = "Организация";
			
		ИначеЕсли ВРег(Имя) = ВРег("Проекты") Тогда
			
			Имя = "Проект";
			
		ИначеЕсли ВРег(Имя) = ВРег("Подразделения") Тогда
			
			Имя = "ЦФО";
			
		ИначеЕсли ВРег(Имя) = ВРег("СтатьиОборотов") Тогда
			
			Имя = "СтатьяОборотов";
		
		КонецЕсли; 
		
		Объект.Код          = Имя;
		Объект.Наименование = Имя;
	
	КонецЕсли; 
	
КонецПроцедуры // ЗаполнитьКодНаименование()

#КонецОбласти