#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
// Обработчик обновления версии 3.1.43.
// См. документацию БСП - Отложенное обновление больших архивов данных.
//
// Параметры:
//  Параметры - Структура - содержит необходимый для последующей обработки признак ОбработкаЗавершена.
Процедура УстановитьПризнакПоВсемЦФО(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	бит_ПереоценкаВалютныхДенежныхСтатей.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_ПереоценкаВалютныхДенежныхСтатей КАК бит_ПереоценкаВалютныхДенежныхСтатей
	|ГДЕ
	|	бит_ПереоценкаВалютныхДенежныхСтатей.Проведен
	|	И бит_ПереоценкаВалютныхДенежныхСтатей.ОбъектСистемы.ИмяОбъектаПолное = ""РегистрБухгалтерии.бит_Бюджетирование""
	|	И бит_ПереоценкаВалютныхДенежныхСтатей.ЦФО = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ бит_ПереоценкаВалютныхДенежныхСтатей.ПоВсемЦФО";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	
	ВыборкаПереоценок = РезультатЗапроса.Выбрать();
	Пока ВыборкаПереоценок.Следующий() Цикл
		
		ДокументПереоценки           = ВыборкаПереоценок.Ссылка.ПолучитьОбъект();
		ДокументПереоценки.ПоВсемЦФО = Истина;
		
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументПереоценки);
			ОбъектовОбработано = ОбъектовОбработано + 1;
		Исключение
			// Если не удалось обработать какой-либо набор, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
				
			ТекстСообщения = НСтр("ru = 'Не установить признак ""По всем ЦФО"": %1 по причине: %2';
									|en = 'Do not set the sign ""For all CFD"": %1 due to: %2'"); 	
			ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументПереоценки,
										ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
							УровеньЖурналаРегистрации.Предупреждение,
							Метаданные.Документы.бит_ПереоценкаВалютныхДенежныхСтатей, 
							ДокументПереоценки, 
							ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Процедуре УстановитьПризнакПоВсемЦФО
									|не удалось установить признак ""По всем ЦФО"" для некоторых документов (пропущены): %1';
							  |en = 'The УстановитьПризнакПоВсемЦФО
									|procedure failed to set the sign "" For all CFD"" for some documents (omitted): %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ТекстСообщения = НСтр("ru = 'Процедура УстановитьПризнакПоВсемЦФО
									|обработала очередную порцию документов ""Переоценка валютных денежных статей"": %1';
							  |en = 'The УстановитьПризнакПоВсемЦФО
									|processed the next batch of documents ""Revaluation of Cash and Cash Equivalents in Foreign Currency"": %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Информация,
			Метаданные.Обработки.бит_КонсольОперативногоВизирования,, 
			ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
