
&Вместо("ПрименитьНастройкиВФоне")
Процедура бит_ПрименитьНастройкиВФоне(Параметры, АдресХранилища)

	Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
	"Обработка.ПрайсЛист.МодульМенеджера.ПрименитьНастройкиВФоне");

	СтруктураФормы 		= Параметры[0].СтруктураФормы;
	СтруктураНастроек 	= Параметры[0].СтруктураНастроек;

	ТаблицаНоменклатуры = УстановкаЦенСервер.СоздатьТаблицуНоменклатуры(СтруктураФормы);
	
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [05.07.2024] + 
	Если СтруктураНастроек.бит_ГлубинаОтбора > 0 Тогда
	МассивВидовЦен = СтруктураФормы.ВыбранныеЦены.ВыгрузитьКолонку("Ссылка");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатуры.ХарактеристикаЦО КАК ХарактеристикаЦО,
	               |	ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
	               |	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период,
	               |	ЦеныНоменклатуры.Валюта КАК Валюта
	               |ПОМЕСТИТЬ МакимальныйПериодЦен
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры25 КАК ЦеныНоменклатуры
	               |ГДЕ
	               |	ЦеныНоменклатуры.ВидЦены В (&ВидЦены)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЦеныНоменклатуры.Номенклатура,
	               |	ЦеныНоменклатуры.ХарактеристикаЦО,
	               |	ЦеныНоменклатуры.ВидЦены,
	               |	ЦеныНоменклатуры.Валюта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МакимальныйПериодЦен.Номенклатура КАК Номенклатура,
	               |	МакимальныйПериодЦен.ХарактеристикаЦО КАК ХарактеристикаЦО,
	               |	МакимальныйПериодЦен.ВидЦены КАК ВидЦены,
	               |	МакимальныйПериодЦен.Период КАК Период,
	               |	МакимальныйПериодЦен.Валюта КАК Валюта,
	               |	РАЗНОСТЬДАТ(МакимальныйПериодЦен.Период, &ТекущаяДата, ДЕНЬ) КАК ГлубинаОтбораЦен
	               |ИЗ
	               |	МакимальныйПериодЦен КАК МакимальныйПериодЦен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	МакимальныйПериодЦен.Номенклатура,
	               |	МакимальныйПериодЦен.ХарактеристикаЦО,
	               |	МакимальныйПериодЦен.ВидЦены,
	               |	МакимальныйПериодЦен.Период,
	               |	МакимальныйПериодЦен.Валюта,
	               |	РАЗНОСТЬДАТ(МакимальныйПериодЦен.Период, &ТекущаяДата, ДЕНЬ)
	               |
	               |ИМЕЮЩИЕ
	               |	РАЗНОСТЬДАТ(МакимальныйПериодЦен.Период, &ТекущаяДата, ДЕНЬ) < &ГлубинаОтбора"; 
	Запрос.УстановитьПараметр("ТекущаяДата", СтруктураФормы.Дата); 
	Запрос.УстановитьПараметр("ГлубинаОтбора", СтруктураНастроек.бит_ГлубинаОтбора); 
	Запрос.УстановитьПараметр("ВидЦены", МассивВидовЦен);
	МассивНоменклатур = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [05.07.2024] -
	
	// Загрузка сформированного списка товаров.
	СтруктураРезультата = Обработки.ПодборТоваровПоОтбору.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	Для Каждого СтрокаТЧ Из СтруктураРезультата.ТаблицаТоваров Цикл
		
		// Первыйбит Лист требований [20]  [Совветников Д.Г.] [05.07.2024] +
		Если СтруктураНастроек.бит_ГлубинаОтбора > 0 Тогда
		Индекс = МассивНоменклатур.Найти(СтрокаТЧ.Номенклатура);
		Если Не Индекс <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		КонецЕсли;
		// Первыйбит Лист требований [20]  [Совветников Д.Г.] [05.07.2024] -
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;

		Если СтруктураФормы.ИспользуетсяЦенообразование25 Тогда
			Если СтруктураФормы.ИспользоватьХарактеристикиНоменклатуры Тогда
				НоваяСтрока.ХарактеристикаЦО = СтрокаТЧ.ХарактеристикаЦО;
			КонецЕсли;

			Если СтруктураФормы.ИспользоватьСерииНоменклатуры Тогда
				НоваяСтрока.СерияЦО = СтрокаТЧ.СерияЦО;
			КонецЕсли;

			Если СтруктураФормы.ИспользоватьУпаковкиНоменклатуры Тогда
				НоваяСтрока.УпаковкаЦО = СтрокаТЧ.УпаковкаЦО;
			КонецЕсли;
		Иначе	 
			Если СтруктураФормы.ИспользоватьХарактеристикиНоменклатуры Тогда
				НоваяСтрока.Характеристика   = СтрокаТЧ.Характеристика;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	КэшДанных = УстановкаЦенСервер.ИнициализироватьСтруктуруКэшаДанных();

	ТаблицаНоменклатуры = УстановкаЦенСервер.ДобавитьТовары(СтруктураФормы, ТаблицаНоменклатуры, КэшДанных);
	ТаблицаЗначений = УстановкаЦенСервер.ТаблицаТовары(СтруктураФормы, КэшДанных,,ТаблицаНоменклатуры);

	Если СтруктураФормы.ИспользуетсяЦенообразование25 Тогда
		ЗапрещеннаяКРедактированиюНоменклатура = УстановкаЦенСервер.ПолучитьЗапрещеннуюКРедактированиюНоменклатуру(СтруктураФормы, ТаблицаНоменклатуры);
		УстановкаЦенСервер.ЗагрузитьСтарыеЦеныНоменклатурыПрайсЛист2_5(СтруктураФормы, ТаблицаЗначений, КэшДанных, ЗапрещеннаяКРедактированиюНоменклатура);
	Иначе	
		ЗапрещеннаяКРедактированиюНоменклатура = УстановкаЦенСервер.ПолучитьЗапрещеннуюКРедактированиюНоменклатуру(СтруктураФормы, ТаблицаНоменклатуры);
		УстановкаЦенСервер.ЗагрузитьСтарыеЦеныНоменклатурыПрайсЛист(СтруктураФормы, ТаблицаЗначений, КэшДанных, ЗапрещеннаяКРедактированиюНоменклатура);
	КонецЕсли;

	СтруктураФормы.КоличествоСтрокДереваЦен = ТаблицаНоменклатуры.количество();

	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("СтруктураФормы", СтруктураФормы);

	АдресХранилища = ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);

	КоличествоОбработанныхДанных = ТаблицаЗначений.количество() / 10;
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, КоличествоОбработанныхДанных);

КонецПроцедуры
