
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ВариантИзменения = 1;
	Элементы.ГруппаПроцент.Видимость 			   = Ложь;
	Элементы.ГруппаФиксированноеЗначение.Видимость = Истина;
	
	ПримерЧислоИсходное = Параметры.СуммаПример;
		
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантИзмененияПриИзменении(Элемент)
	
	Если ЭтотОбъект.ВариантИзменения = 1 Тогда
		
		Элементы.ГруппаПроцент.Видимость 			   = Ложь;
		Элементы.ГруппаФиксированноеЗначение.Видимость = Истина;
		
		ПересчитатьСуммуПоЗначению();
	
	ИначеЕсли ЭтотОбъект.ВариантИзменения	= 2 Тогда
		
		Элементы.ГруппаПроцент.Видимость 			   = Истина;
		Элементы.ГруппаФиксированноеЗначение.Видимость = Ложь;
		
		ПересчитатьСуммуПоПроценту();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФиксированноеЗначениеПриИзменении(Элемент)
	
	ПересчитатьСуммуПоЗначению();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентПриИзменении(Элемент)
	
	ПересчитатьСуммуПоПроценту();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуПоЗначению()
	
	ПримерЧислоРезультат = ПримерЧислоИсходное + ФиксированноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуПоПроценту()
	
	ПроцентЧисло = ПримерЧислоИсходное * Процент / 100;
	ПримерЧислоРезультат = ПримерЧислоИсходное + ПроцентЧисло;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураРезультата = Новый Структура;
	
	Если Элементы.ГруппаПроцент.Видимость Тогда
		
		СтруктураРезультата.Вставить("ЭтоПроцент", Истина);
		СтруктураРезультата.Вставить("Значение"  , Процент);
		Закрыть(СтруктураРезультата);
		
	ИначеЕсли Элементы.ГруппаФиксированноеЗначение.Видимость Тогда	
		
		СтруктураРезультата.Вставить("ЭтоПроцент", Ложь);
		СтруктураРезультата.Вставить("Значение"  , ФиксированноеЗначение);
		Закрыть(СтруктураРезультата);
				
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

