
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [09.02.2026] +        
	
	Если Параметры.Свойство("НеТекущееОборудование") Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = Параметры.НеТекущееОборудование;
		ЭлементОтбора.Использование = Истина;
				
	КонецЕсли;
		
	// }}ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [09.02.2026] -
	
КонецПроцедуры
