
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("ДокументОснование", ПараметрКоманды);
	ЗначенияЗаполнения.Вставить("ВидПлана",          ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.План"));
	ЗначенияЗаполнения.Вставить("НДФЛПоВедомостям",  Истина);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.бит_кзн_ПлатежнаяПозиция.ФормаОбъекта", ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
				
КонецПроцедуры

