Процедура ПересчитатьОбеспечениеЭтапаПоСпецификации(ДокументЭтап) Экспорт
// {{ПервыйБИТ ЛистТребований [ЛТ 5.32]  [VUVaynula@1cbit.ru] [05.05.2025 16:44:33] +      
    Произведено = 0;
	Для каждого стр из ДокументЭтап.ВыходныеИзделия Цикл
		Если стр.Произведено Тогда
			Произведено = Произведено + стр.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	бит_КоэфицентыСпецификаций.Номенклатура КАК Номенклатура,
		|	бит_КоэфицентыСпецификаций.РасходСУчетомПотерь * &Произведено КАК Количество,
		|	бит_КоэфицентыСпецификаций.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.бит_КоэфицентыСпецификаций КАК бит_КоэфицентыСпецификаций
		|ГДЕ 
		|	бит_КоэфицентыСпецификаций.РесурснаяСпецификация = &Спецификация
		|");
	Запрос.УстановитьПараметр("Спецификация", ДокументЭтап.Спецификация);
	Запрос.УстановитьПараметр("Произведено", Произведено);
	ТаблицаНорматив = Запрос.Выполнить().Выгрузить();
	Для каждого стр из ДокументЭтап.ОбеспечениеМатериаламиИРаботами Цикл  
		СтрокаНорматив = ТаблицаНорматив.Найти(стр.Номенклатура, "Номенклатура");
		Если СтрокаНорматив <> Неопределено Тогда
			стр.Количество 			= СтрокаНорматив.Количество;
			стр.КоличествоУпаковок 	= СтрокаНорматив.Количество;
			стр.Упаковка 			= СтрокаНорматив.ЕдиницаИзмерения;
		КонецЕсли;
	КонецЦикла; 
	Для каждого стр из ДокументЭтап.РасходМатериаловИРабот Цикл  
		СтрокаНорматив = ТаблицаНорматив.Найти(стр.Номенклатура, "Номенклатура");
		Если СтрокаНорматив <> Неопределено Тогда
			стр.Количество 			= СтрокаНорматив.Количество;
			стр.КоличествоУпаковок 	= СтрокаНорматив.Количество;
			стр.Упаковка 			= СтрокаНорматив.ЕдиницаИзмерения;
		КонецЕсли;
	КонецЦикла;
	ДокументЭтап.ЭкономияМатериалов.Очистить();
	ДокументЭтап.ЭкономияМатериаловСерии.Очистить();
// }}ПервыйБИТ ЛистТребований [ЛТ 5.32]  [VUVaynula@1cbit.ru] [05.05.2025 16:44:33] -
КонецПроцедуры

#Область ВыжимкаИзОбщихМодулейПолучениеКолонкиДоступноПоЭтапуНаПроизводство

&НаСервере
// Параметры:
// - Этап - ДокументСсылка.Этап2_2
// Возвращаемое значение:
// - ТаблицаЗначений: Номенклатура | Количество
//
Функция ПолучитьДоступныеОстаткиПоЭтапу(Этап) Экспорт  
	
	УИД = Новый УникальныйИдентификатор;
	ПараметрыВстраивания = Документы.ЭтапПроизводства2_2.ДоступныеОстаткиПараметрыВстраивания(Этап); 
	ВставитьСлужебныеПараметрыВстраивания(ПараметрыВстраивания, УИД);    
	
	Возврат ДоступныеОстаткиПерезаполнить(Этап, ПараметрыВстраивания);

КонецФункции 

#Область СлужебныеДляПолученияОстатков

Процедура ВставитьСлужебныеПараметрыВстраивания(ПараметрыВстраивания, УникальныйИдентификатор)
	
	СлужебныеПараметры = Новый Структура();
	СлужебныеПараметры.Вставить("НуженОбработчикОбновленияДоступности", Ложь);
	СлужебныеПараметры.Вставить("ОбновлятьКолонкуДоступноПослеРаспределенияЗапасов", Неопределено);
	СлужебныеПараметры.Вставить("ЗаказыДляОбновленияДоступности", Неопределено);
	СлужебныеПараметры.Вставить("ИнтервалЗапускаОбработчика", Неопределено);
	СлужебныеПараметры.Вставить("ГотовКОбеспечению", Ложь);
	СлужебныеПараметры.Вставить("ВариантОбеспеченияДоИзменения");
	СлужебныеПараметры.Вставить("ВариантОбеспеченияВыбранноеЗначение");
	СлужебныеПараметры.Вставить("АдресНоменклатура");
	СлужебныеПараметры.Вставить("ЭтоДокумент", Ложь);
	СлужебныеПараметры.Вставить("ДанныеСтроки", Неопределено);
	СлужебныеПараметры.Вставить("АдресТаблицыДанныхФормы", Неопределено);
	СлужебныеПараметры.Вставить("ТекстЗапросаВременнаяТаблицаДанныхДокумента", Неопределено);
	
	ПараметрыВстраивания.Вставить("СлужебныеПараметры", СлужебныеПараметры);
	
	СлужебныеПараметры.ЭтоДокумент = СтрНайти(ПараметрыВстраивания.ИмяОбъекта, "Документ.") > 0;
	СлужебныеПараметры.ДанныеСтроки = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыВстраивания.ШаблонСериализацииДанныхФормы);
	
	Таблицы = Новый Соответствие();
	ВставитьТаблицы(Таблицы, ПараметрыВстраивания.ШаблонСериализацииДанныхФормы, "");
	ЗаполнитьИменаТаблицВСоотвествии(ПараметрыВстраивания, Таблицы);
	СлужебныеПараметры.АдресТаблицыДанныхФормы = ПоместитьВоВременноеХранилище(Таблицы, УникальныйИдентификатор);
	
	СлужебныеПараметры.ТекстЗапросаВременнаяТаблицаДанныхДокумента = ТекстЗапросаВременнаяТаблицаДанныхДокумента(
		ПараметрыВстраивания,
		Таблицы);
	
КонецПроцедуры

Функция ТекстЗапросаВременнаяТаблицаДанныхДокумента(ПараметрыВстраивания, Таблицы)
	
	ТекстыЗапроса = Новый Массив();
	ТекстЗапроса = ПараметрыВстраивания.ОписаниеПолученияДанныхДокумента;
	ТекстыУничтожения = Новый Массив();
	Замены = Новый ТаблицаЗначений();
	Замены.Колонки.Добавить("ПодстрокаПоиска");
	Замены.Колонки.Добавить("ПодстрокаЗамены");
	
	Для Каждого Элемент Из Таблицы Цикл
		
		Замена = Замены.Добавить();
		Замена.ПодстрокаПоиска = Элемент.Значение.ИмяТаблицыВЗапросе;
		Замена.ПодстрокаЗамены = Элемент.Значение.ИмяВременнойТаблицы;
		
		ТекстЗапросаВременнойТаблицы = ТекстЗапросаВременнойТаблицыПоКолонкамТаблицы(
			Элемент.Значение.ИмяВременнойТаблицы, Элемент.Значение.Таблица);
		ТекстыЗапроса.Добавить(ТекстЗапросаВременнойТаблицы);
		ТекстыУничтожения.Добавить("УНИЧТОЖИТЬ " + Элемент.Значение.ИмяВременнойТаблицы);
		
	КонецЦикла;
	
	Замены.Сортировать("ПодстрокаПоиска Убыв");
	Для Индекс = 0 По Замены.Количество() - 1 Цикл
		Замена = Замены[Индекс];
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Замена.ПодстрокаПоиска, Замена.ПодстрокаЗамены);
	КонецЦикла;
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТекстыЗапроса, ТекстыУничтожения);
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВременнойТаблицыПоКолонкамТаблицы(ИмяВременнойТаблицы, Таблица)
	
	Тексты = Новый Массив();
	Для Каждого Колонка Из Таблица.Колонки Цикл
		
		Тексты.Добавить("Таблица." + Колонка.Имя + " КАК " + Колонка.Имя);
		
	КонецЦикла;
	ПодстановкаПоле = СтрСоединить(Тексты, "," + Символы.ПС);
	Текст =
		"ВЫБРАТЬ
		|	&ПодстановкаПоле
		|ПОМЕСТИТЬ ПодстановкаПоместить
		|ИЗ
		|	&ПодстановкаИмяВременнойТаблицы КАК Таблица";
	Текст = СтрЗаменить(Текст, "&ПодстановкаПоле", ПодстановкаПоле);
	Текст = СтрЗаменить(Текст, "ПодстановкаПоместить", ИмяВременнойТаблицы);
	Текст = СтрЗаменить(Текст, "ПодстановкаИмяВременнойТаблицы", ИмяВременнойТаблицы);
	Возврат Текст;
	
КонецФункции

Процедура ВставитьТаблицы(Таблицы, ЭлементСтруктуры, Префикс)
	
	ТекущаяТаблица = Новый ТаблицаЗначений();
	
	Для Каждого Свойство Из ЭлементСтруктуры Цикл
		
		Если ТипЗнч(Свойство.Значение) = Тип("Структура") Тогда
			
			НовыйПрефикс = ?(Префикс = "", Свойство.Ключ, Префикс + "." + Свойство.Ключ);
			ВставитьТаблицы(Таблицы, Свойство.Значение, НовыйПрефикс);
			
		Иначе
			
			ТекущаяТаблица.Колонки.Добавить(Свойство.Ключ, Свойство.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекущаяТаблица.Колонки.Количество() > 0 Тогда
		
		Таблицы.Вставить(Префикс, Новый Структура("Таблица,ИмяВременнойТаблицы,ИмяТаблицыВЗапросе", ТекущаяТаблица));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИменаТаблицВСоотвествии(ПараметрыВстраивания, Таблицы)
	
	Счетчик = 1;
	Для Каждого Элемент Из Таблицы Цикл
		
		Элемент.Значение.ИмяТаблицыВЗапросе  = ?(ПараметрыВстраивания.СлужебныеПараметры.ЭтоДокумент,
			ПараметрыВстраивания.ИмяОбъекта + Сред(Элемент.Ключ, СтрДлина("Объект") + 1),
			ПараметрыВстраивания.ИмяОбъекта + "." + Элемент.Ключ);
		Элемент.Значение.ИмяВременнойТаблицы = "Вт" + Счетчик + СтрЗаменить(Элемент.Значение.ИмяТаблицыВЗапросе, ".", "");
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДоступныеОстаткиПерезаполнить(Этап, ПараметрыВстраивания)
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.ЗапасыИПотребности) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	ПолучатьОстаткиИзКэша = Ложь;
	
		Таблицы = ПолучитьИзВременногоХранилища(ПараметрыВстраивания.СлужебныеПараметры.АдресТаблицыДанныхФормы);
		ЗаполнитьТаблицыИзДанныхФормы(Таблицы, ПараметрыВстраивания, Этап);
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		ДобавитьВременнуюТаблицуДанныхДокумента(Запрос.МенеджерВременныхТаблиц, Таблицы, ПараметрыВстраивания);
		
	Остатки          = Неопределено;
	
	ТаблицаИзменений = ВыгрузитьТаблицуИзмененийДокумента(Запрос.МенеджерВременныхТаблиц, ПараметрыВстраивания);
		
	СтруктураОстатков = ОстаткиДляТаблицыДокумента(
		Запрос.МенеджерВременныхТаблиц,
		Остатки,
		ТаблицаИзменений);
		КлючЗаказы = "Номенклатура,Характеристика,Склад,Назначение,ЗаказНаОтгрузку,Упаковка";
	КлючТовары = "Номенклатура,Характеристика,Склад,Назначение,Упаковка";
	
	Остатки = Новый Структура();
	Остатки.Вставить("ПоЗаказу",             СтруктураОстатков.ОстаткиПоЗаказу);
	Остатки.Вставить("ПоТовару",             СтруктураОстатков.ОстаткиПоТовару);
	Остатки.Вставить("КорректировкаЗаказов", СтруктураОстатков.КорректировкаЗаказов);
	Остатки.Вставить("КорректировкаТоваров", СтруктураОстатков.КорректировкаТоваров);
	Остатки.Вставить("ИзмененияПоДокументу", ТаблицаИзменений);
	
	Остатки.ПоТовару.Индексы.Добавить(КлючТовары);
	Остатки.ПоЗаказу.Индексы.Добавить(КлючЗаказы);
	Остатки.КорректировкаТоваров.Индексы.Добавить(КлючТовары);
	Остатки.КорректировкаЗаказов.Индексы.Добавить(КлючЗаказы);
	
	Возврат СтруктураОстатков.ОстаткиПоТовару.Скопировать(, "Номенклатура, Количество"); 
	
КонецФункции

Функция ОстаткиДляТаблицыДокумента(МенеджерВременныхТаблиц, КэшОстатков, ТаблицаИзменений)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаИзменений", ТаблицаИзменений);
	ИдентификаторСсылки = Новый УникальныйИдентификатор("9e1b1ca8-ce19-46d8-a7ef-0292f4cd9799");
	Запрос.УстановитьПараметр("НесуществующееНазначение", Справочники.Назначения.ПолучитьСсылку(ИдентификаторСсылки));
	
	Тексты = Новый Массив();
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДокумента.Регистратор     КАК Регистратор,
		|	ТаблицаДокумента.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|	ТаблицаДокумента.Номенклатура    КАК Номенклатура,
		|	ТаблицаДокумента.Характеристика  КАК Характеристика,
		|	ТаблицаДокумента.Упаковка        КАК Упаковка,
		|	
		|	ВЫБОР КОГДА ТаблицаДокумента.Номенклатура.ТипНоменклатуры В(
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
		|				ТаблицаДокумента.Склад
		|			ИНАЧЕ
		|				ТаблицаДокумента.Подразделение
		|		КОНЕЦ КАК Склад,
		|	
		|	ВЫБОР КОГДА ТаблицаДокумента.Обособленно ТОГДА
		|				ВЫБОР КОГДА ТаблицаДокумента.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
		|							&НесуществующееНазначение // чтобы не подбирались свободные остатки, если назначения для документа еще нет в базе.
		|						ИНАЧЕ
		|							ТаблицаДокумента.Назначение
		|					КОНЕЦ
		|			ИНАЧЕ
		|				ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		КОНЕЦ КАК Назначение
		|ПОМЕСТИТЬ ТаблицаЗаказовИРегистраторов
		|ИЗ
		|	ВременнаяТаблицаДанныхДокумента КАК ТаблицаДокумента
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку, Упаковка
		|;
		|
		|/////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задания.Номенклатура КАК Номенклатура,
		|	Задания.Характеристика КАК Характеристика,
		|	Задания.Склад КАК Склад,
		|	Задания.Назначение КАК Назначение,
		|	Задания.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|	Задания.КСнятиюРезерва КАК КСнятиюРезерва
		|ПОМЕСТИТЬ ЗаданияКСнятиюРезерва
		|ИЗ
		|	РегистрСведений.ЗаданияКРаспределениюЗапасов КАК Задания
		|ГДЕ
		|	ИСТИНА В(
		|		ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА КАК ЕстьЗаписи
		|		ИЗ
		|			ТаблицаЗаказовИРегистраторов КАК ТаблицаЗаказов
		|		ГДЕ
		|			ТаблицаЗаказов.Номенклатура = Задания.Номенклатура
		|			И ТаблицаЗаказов.Характеристика = Задания.Характеристика
		|			И ТаблицаЗаказов.Склад = Задания.Склад
		|			И ТаблицаЗаказов.Назначение = Задания.Назначение
		|			И Задания.ЗаказНаОтгрузку В (ТаблицаЗаказов.ЗаказНаОтгрузку, ТаблицаЗаказов.Регистратор))";
	
	Запрос.Выполнить();
	
	Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДокумента.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|	ТаблицаДокумента.Номенклатура    КАК Номенклатура,
		|	ТаблицаДокумента.Характеристика  КАК Характеристика,
		|	ТаблицаДокумента.Упаковка        КАК Упаковка,
		|	ТаблицаДокумента.Склад           КАК Склад,
		|	ТаблицаДокумента.Назначение      КАК Назначение
		|ПОМЕСТИТЬ ТаблицаЗаказов
		|ИЗ
		|	ТаблицаЗаказовИРегистраторов КАК ТаблицаДокумента
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку, Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаЗаказов.Номенклатура   КАК Номенклатура,
		|	ТаблицаЗаказов.Характеристика КАК Характеристика,
		|	ТаблицаЗаказов.Склад          КАК Склад,
		|	ТаблицаЗаказов.Назначение     КАК Назначение,
		|	ТаблицаЗаказов.Упаковка       КАК Упаковка
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	ТаблицаЗаказов КАК ТаблицаЗаказов
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаЗаказов.Номенклатура    КАК Номенклатура,
		|	ТаблицаЗаказов.Характеристика  КАК Характеристика,
		|	ТаблицаЗаказов.Склад           КАК Склад,
		|	ТаблицаЗаказов.Назначение      КАК Назначение,
		|	ТаблицаЗаказов.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку
		|ПОМЕСТИТЬ ТаблицаЗаказовБезУпаковок
		|ИЗ
		|	ТаблицаЗаказов КАК ТаблицаЗаказов
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаТоваров.Номенклатура    КАК Номенклатура,
		|	ТаблицаТоваров.Характеристика  КАК Характеристика,
		|	ТаблицаТоваров.Склад           КАК Склад,
		|	ТаблицаТоваров.Назначение      КАК Назначение
		|ПОМЕСТИТЬ ТаблицаТоваровБезУпаковок
		|ИЗ
		|	ТаблицаТоваров КАК ТаблицаТоваров
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Набор.Номенклатура КАК Номенклатура,
		|	Набор.Характеристика КАК Характеристика,
		|	Набор.Склад КАК Склад,
		|	Набор.Назначение КАК Назначение,
		|	Набор.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|	СУММА(Набор.Зарезервировано) КАК РаспределеноНаСкладеСводно
		|ПОМЕСТИТЬ ОбеспеченНаСкладе
		|ИЗ (
		|	ВЫБРАТЬ
		|		Задания.Номенклатура КАК Номенклатура,
		|		Задания.Характеристика КАК Характеристика,
		|		Задания.Склад КАК Склад,
		|		Задания.Назначение КАК Назначение,
		|		Задания.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|		-Задания.КСнятиюРезерва КАК Зарезервировано
		|	ИЗ
		|		ЗаданияКСнятиюРезерва КАК Задания
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РаспределениеЗапасов.Номенклатура КАК Номенклатура,
		|		РаспределениеЗапасов.Характеристика КАК Характеристика,
		|		РаспределениеЗапасов.Склад КАК Склад,
		|		РаспределениеЗапасов.Назначение КАК Назначение,
		|		РаспределениеЗапасов.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|		РаспределениеЗапасов.Зарезервировано КАК Зарезервировано
		|	ИЗ
		|		РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
		|	ГДЕ
		|		РаспределениеЗапасов.Состояние В(
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе),
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении))
		|		И (РаспределениеЗапасов.Номенклатура,
		|				РаспределениеЗапасов.Характеристика,
		|				РаспределениеЗапасов.Склад,
		|				РаспределениеЗапасов.Назначение,
		|				РаспределениеЗапасов.ЗаказНаОтгрузку) В(
		|			ВЫБРАТЬ
		|				ТаблицаЗаказов.Номенклатура КАК Номенклатура,
		|				ТаблицаЗаказов.Характеристика КАК Характеристика,
		|				ТаблицаЗаказов.Склад КАК Склад,
		|				ТаблицаЗаказов.Назначение КАК Назначение,
		|				ТаблицаЗаказов.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку
		|			ИЗ
		|				ТаблицаЗаказовИРегистраторов КАК ТаблицаЗаказов)
		|	
		// Для незаписанного заказа переработчику Заказ на отгрузку пуст, но есть регистраторы - этапы.
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТаблицаЗаказов.Номенклатура КАК Номенклатура,
		|		ТаблицаЗаказов.Характеристика КАК Характеристика,
		|		ТаблицаЗаказов.Склад КАК Склад,
		|		ТаблицаЗаказов.Назначение КАК Назначение,
		|		ТаблицаЗаказов.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|		РаспределениеЗапасов.Зарезервировано КАК Зарезервировано
		|	ИЗ
		|		ТаблицаЗаказовИРегистраторов КАК ТаблицаЗаказов
		|			
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
		|			ПО РаспределениеЗапасов.Номенклатура    = ТаблицаЗаказов.Номенклатура
		|			 И РаспределениеЗапасов.Характеристика  = ТаблицаЗаказов.Характеристика
		|			 И РаспределениеЗапасов.Склад           = ТаблицаЗаказов.Склад
		|			 И РаспределениеЗапасов.Назначение      = ТаблицаЗаказов.Назначение
		|			 И РаспределениеЗапасов.Состояние В(
		|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе),
		|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении))
		|			 И РаспределениеЗапасов.ЗаказНаОтгрузку = ТаблицаЗаказов.Регистратор
		|			 И ТаблицаЗаказов.ЗаказНаОтгрузку <> ТаблицаЗаказов.Регистратор) КАК Набор
		|	СГРУППИРОВАТЬ ПО
		|		Набор.Номенклатура,
		|		Набор.Характеристика,
		|		Набор.Склад,
		|		Набор.Назначение,
		|		Набор.ЗаказНаОтгрузку
		|ИМЕЮЩИЕ
		|	СУММА(Набор.Зарезервировано) > 0
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку";
	
	Тексты.Добавить(Текст);
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.Выполнить();
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		|	ВЫРАЗИТЬ(Таблица.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры КАК ТипНоменклатуры
		|ПОМЕСТИТЬ ТаблицаТоваровБезУпаковокИБезНазначений
		|ИЗ
		|	ТаблицаТоваровБезУпаковок КАК Таблица
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|/////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		|	НЕ ЕСТЬNULL(НастройкаКонтроляОбеспеченияХарактеристика.КонтролироватьСвободныеОстатки,
		|			ЕСТЬNULL(НастройкаКонтроляОбеспеченияНоменклатура.КонтролироватьСвободныеОстатки,
		|				ЕСТЬNULL(НастройкаКонтроляОбеспечения.КонтролироватьСвободныеОстатки, ЛОЖЬ))) КАК ПерераспределятьСкладскиеЗапасы,
		|	ЕСТЬNULL(НастройкаКонтроляОбеспеченияХарактеристика.КонтролироватьСвободныеОстатки,
		|			ЕСТЬNULL(НастройкаКонтроляОбеспеченияНоменклатура.КонтролироватьСвободныеОстатки,
		|				ЕСТЬNULL(НастройкаКонтроляОбеспечения.КонтролироватьСвободныеОстатки,
		|					Таблица.ТипНоменклатуры В(
		|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|							ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|						И Таблица.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)))) КАК ОтгружатьЕслиДоступно
		|ПОМЕСТИТЬ НастройкиКонтроляОбеспечения
		|ИЗ
		|	ТаблицаТоваровБезУпаковокИБезНазначений КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаКонтроляОбеспеченияХарактеристика
		|		ПО НастройкаКонтроляОбеспеченияХарактеристика.Склад = Таблица.Склад
		|		 И НастройкаКонтроляОбеспеченияХарактеристика.Номенклатура = Таблица.Номенклатура
		|		 И НастройкаКонтроляОбеспеченияХарактеристика.Характеристика = Таблица.Характеристика
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаКонтроляОбеспеченияНоменклатура
		|		ПО НастройкаКонтроляОбеспеченияНоменклатура.Склад = Таблица.Склад
		|		 И НастройкаКонтроляОбеспеченияНоменклатура.Номенклатура = Таблица.Номенклатура
		|		 И НастройкаКонтроляОбеспеченияНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		 И НастройкаКонтроляОбеспеченияХарактеристика.Номенклатура ЕСТЬ NULL
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаКонтроляОбеспечения
		|		ПО НастройкаКонтроляОбеспечения.Склад = Таблица.Склад
		|		 И НастройкаКонтроляОбеспечения.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		 И НастройкаКонтроляОбеспечения.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		 И НастройкаКонтроляОбеспеченияХарактеристика.Номенклатура ЕСТЬ NULL
		|		 И НастройкаКонтроляОбеспеченияНоменклатура.Номенклатура ЕСТЬ NULL
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|УНИЧТОЖИТЬ ТаблицаТоваровБезУпаковокИБезНазначений";
	Запрос.Выполнить();
	Тексты.Очистить();

	Если КэшОстатков = Неопределено Тогда
		
		Текст = ВременнаяТаблицаСвободныеОстатки("ТаблицаТоваровБезУпаковок", "ВременнаяТаблицаОстаток", Истина);
		Тексты.Добавить(Текст);
		
		Текст =
			"ВЫБРАТЬ
			|	Таблица.Номенклатура                                      КАК Номенклатура,
			|	Таблица.Характеристика                                    КАК Характеристика,
			|	Таблица.Склад                                             КАК Склад,
			|	Таблица.Назначение                                        КАК Назначение,
			|	Таблица.ЗаказНаОтгрузку                                   КАК ЗаказНаОтгрузку,
			|	ЕСТЬNULL(ОбеспеченНаСкладе.РаспределеноНаСкладеСводно, 0) КАК РаспределеноНаСкладеСводно
			|ПОМЕСТИТЬ РаспределениеЗапасовОбеспеченНаСкладе
			|ИЗ
			|	ТаблицаЗаказовБезУпаковок КАК Таблица
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ ОбеспеченНаСкладе КАК ОбеспеченНаСкладе
			|		ПО ОбеспеченНаСкладе.Номенклатура    = Таблица.Номенклатура
			|		 И ОбеспеченНаСкладе.Характеристика  = Таблица.Характеристика
			|		 И ОбеспеченНаСкладе.Склад           = Таблица.Склад
			|		 И ОбеспеченНаСкладе.Назначение      = Таблица.Назначение
			|		 И ОбеспеченНаСкладе.ЗаказНаОтгрузку = Таблица.ЗаказНаОтгрузку
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Таблица.Номенклатура                  КАК Номенклатура,
			|	Таблица.Характеристика                КАК Характеристика,
			|	Таблица.Склад                         КАК Склад,
			|	Таблица.Назначение                    КАК Назначение,
			|	ЕСТЬNULL(ОстатокНаСкладе.Количество, 0) КАК Свободно,
			|	НастройкиКонтроляОбеспечения.ПерераспределятьСкладскиеЗапасы КАК ПерераспределятьСкладскиеЗапасы,
			|	НастройкиКонтроляОбеспечения.ОтгружатьЕслиДоступно КАК ОтгружатьЕслиДоступно
			|ПОМЕСТИТЬ РаспределениеЗапасовОстатокНаСкладе
			|ИЗ
			|	ТаблицаТоваровБезУпаковок КАК Таблица
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаток КАК ОстатокНаСкладе
			|		ПО ОстатокНаСкладе.Номенклатура   = Таблица.Номенклатура
			|		 И ОстатокНаСкладе.Характеристика = Таблица.Характеристика
			|		 И ОстатокНаСкладе.Склад          = Таблица.Склад
			|		 И ОстатокНаСкладе.Назначение     = Таблица.Назначение
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиКонтроляОбеспечения КАК НастройкиКонтроляОбеспечения
			|		ПО НастройкиКонтроляОбеспечения.Склад = Таблица.Склад
			|		 И НастройкиКонтроляОбеспечения.Номенклатура = Таблица.Номенклатура
			|		 И НастройкиКонтроляОбеспечения.Характеристика = Таблица.Характеристика
			|		
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение";
		Тексты.Добавить(Текст);
		
	Иначе
		
		Отбор = Новый Структура("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
		Запрос.УстановитьПараметр("ТаблицаЗаказов",   КэшОстатков.ПоЗаказу.Скопировать(Отбор));
		Запрос.УстановитьПараметр("ТаблицаТоваров",   КэшОстатков.ПоТовару.Скопировать(Отбор));
		
		Текст = ВременнаяТаблицаСвободныеОстатки("ТаблицаТоваровБезУпаковок", "ВременнаяТаблицаОстаток", Истина);
		Тексты.Добавить(Текст);
		
		Текст =
			"ВЫБРАТЬ
			|	ТаблицаЗаказов.Номенклатура    КАК Номенклатура,
			|	ТаблицаЗаказов.Характеристика  КАК Характеристика,
			|	ТаблицаЗаказов.Склад           КАК Склад,
			|	ТаблицаЗаказов.Назначение      КАК Назначение,
			|	ТаблицаЗаказов.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|	ТаблицаЗаказов.Количество      КАК РаспределеноНаСкладеСводно
			|ПОМЕСТИТЬ РаспределениеЗапасовОбеспеченНаСкладеКэш
			|ИЗ
			|	&ТаблицаЗаказов КАК ТаблицаЗаказов
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку
			|;
			|
			|/////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаТоваров.Номенклатура                    КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика                  КАК Характеристика,
			|	ТаблицаТоваров.Склад                           КАК Склад,
			|	ТаблицаТоваров.Назначение                      КАК Назначение,
			|	ТаблицаТоваров.Количество                      КАК Свободно,
			|	ТаблицаТоваров.ПерераспределятьСкладскиеЗапасы КАК ПерераспределятьСкладскиеЗапасы,
			|	ТаблицаТоваров.ОтгружатьЕслиДоступно           КАК ОтгружатьЕслиДоступно
			|ПОМЕСТИТЬ РаспределениеЗапасовОстатокНаСкладеКэш
			|	ИЗ
			|		&ТаблицаТоваров КАК ТаблицаТоваров
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение
			|;
			|
			|/////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Таблица.Номенклатура    КАК Номенклатура,
			|	Таблица.Характеристика  КАК Характеристика,
			|	Таблица.Склад           КАК Склад,
			|	Таблица.Назначение      КАК Назначение,
			|	Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
			|	ЕСТЬNULL(ДанныеКэша.РаспределеноНаСкладеСводно,
			|		ЕСТЬNULL(ОбеспеченНаСкладе.РаспределеноНаСкладеСводно, 0)) КАК РаспределеноНаСкладеСводно
			|ПОМЕСТИТЬ РаспределениеЗапасовОбеспеченНаСкладе
			|ИЗ
			|	ТаблицаЗаказовБезУпаковок КАК Таблица
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗапасовОбеспеченНаСкладеКэш КАК ДанныеКэша
			|		ПО ДанныеКэша.Номенклатура    = Таблица.Номенклатура
			|		 И ДанныеКэша.Характеристика  = Таблица.Характеристика
			|		 И ДанныеКэша.Склад           = Таблица.Склад
			|		 И ДанныеКэша.Назначение      = Таблица.Назначение
			|		 И ДанныеКэша.ЗаказНаОтгрузку = Таблица.ЗаказНаОтгрузку
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ ОбеспеченНаСкладе КАК ОбеспеченНаСкладе
			|		ПО ОбеспеченНаСкладе.Номенклатура    = Таблица.Номенклатура
			|		 И ОбеспеченНаСкладе.Характеристика  = Таблица.Характеристика
			|		 И ОбеспеченНаСкладе.Склад           = Таблица.Склад
			|		 И ОбеспеченНаСкладе.Назначение      = Таблица.Назначение
			|		 И ОбеспеченНаСкладе.ЗаказНаОтгрузку = Таблица.ЗаказНаОтгрузку
			|		 И ДанныеКэша.Номенклатура ЕСТЬ NULL
			|		
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку
			|	
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Таблица.Номенклатура   КАК Номенклатура,
			|	Таблица.Характеристика КАК Характеристика,
			|	Таблица.Склад          КАК Склад,
			|	Таблица.Назначение     КАК Назначение,
			|	ЕСТЬNULL(ДанныеКэша.Свободно, ЕСТЬNULL(ОстатокНаСкладе.Количество, 0)) КАК Свободно,
			|	ЕСТЬNULL(ДанныеКэша.ПерераспределятьСкладскиеЗапасы,
			|		НастройкиКонтроляОбеспечения.ПерераспределятьСкладскиеЗапасы) КАК ПерераспределятьСкладскиеЗапасы,
			|	ЕСТЬNULL(ДанныеКэша.ОтгружатьЕслиДоступно,
			|		НастройкиКонтроляОбеспечения.ОтгружатьЕслиДоступно) КАК ОтгружатьЕслиДоступно
			|ПОМЕСТИТЬ РаспределениеЗапасовОстатокНаСкладе
			|ИЗ
			|	ТаблицаТоваровБезУпаковок КАК Таблица
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗапасовОстатокНаСкладеКэш КАК ДанныеКэша
			|		ПО ДанныеКэша.Номенклатура    = Таблица.Номенклатура
			|		 И ДанныеКэша.Характеристика  = Таблица.Характеристика
			|		 И ДанныеКэша.Склад           = Таблица.Склад
			|		 И ДанныеКэша.Назначение      = Таблица.Назначение
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОстаток КАК ОстатокНаСкладе
			|		ПО ОстатокНаСкладе.Номенклатура   = Таблица.Номенклатура
			|		 И ОстатокНаСкладе.Характеристика = Таблица.Характеристика
			|		 И ОстатокНаСкладе.Склад          = Таблица.Склад
			|		 И ОстатокНаСкладе.Назначение     = Таблица.Назначение
			|		 И ДанныеКэша.Номенклатура ЕСТЬ NULL
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиКонтроляОбеспечения КАК НастройкиКонтроляОбеспечения
			|		ПО НастройкиКонтроляОбеспечения.Склад = Таблица.Склад
			|		 И НастройкиКонтроляОбеспечения.Номенклатура = Таблица.Номенклатура
			|		 И НастройкиКонтроляОбеспечения.Характеристика = Таблица.Характеристика
			|		
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение";
		
		Тексты.Добавить(Текст);
	КонецЕсли;
	Тексты.Добавить("УНИЧТОЖИТЬ НастройкиКонтроляОбеспечения");
	
	Текст =
		"ВЫБРАТЬ
		|	Таблица.Номенклатура    КАК Номенклатура,
		|	Таблица.Характеристика  КАК Характеристика,
		|	Таблица.Склад           КАК Склад,
		|	Таблица.Назначение      КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|	Таблица.Отгрузить       КАК Отгрузить,
		|	Таблица.Резервировать   КАК Резервировать
		|ПОМЕСТИТЬ ТаблицаИзменений
		|ИЗ
		|	&ТаблицаИзменений КАК Таблица
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку
		|;
		|
		|//////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Номенклатура    КАК Номенклатура,
		|	Таблица.Характеристика  КАК Характеристика,
		|	Таблица.Склад           КАК Склад,
		|	Таблица.Назначение      КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|	ВЫБОР КОГДА Таблица.РаспределеноНаСкладеСводно > ЕСТЬNULL(ТаблицаИзменений.Отгрузить + ТаблицаИзменений.Резервировать, 0) ТОГДА
		|					- ЕСТЬNULL(ТаблицаИзменений.Отгрузить + ТаблицаИзменений.Резервировать, 0)
		|			ИНАЧЕ
		|				-Таблица.РаспределеноНаСкладеСводно
		|		КОНЕЦ КАК Свободно
		|ПОМЕСТИТЬ КорректировкаЗаказов
		|ИЗ
		|	РаспределениеЗапасовОбеспеченНаСкладе КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзменений КАК ТаблицаИзменений
		|		ПО ТаблицаИзменений.Номенклатура    = Таблица.Номенклатура
		|		 И ТаблицаИзменений.Характеристика  = Таблица.Характеристика
		|		 И ТаблицаИзменений.Склад           = Таблица.Склад
		|		 И ТаблицаИзменений.Назначение      = Таблица.Назначение
		|		 И ТаблицаИзменений.ЗаказНаОтгрузку = Таблица.ЗаказНаОтгрузку
		|		 И ТаблицаИзменений.Отгрузить + ТаблицаИзменений.Резервировать > 0
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, ЗаказНаОтгрузку
		|;
		|
		|//////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Номенклатура   КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад          КАК Склад,
		|	Таблица.Назначение     КАК Назначение,
		|	СУММА(ВЫБОР КОГДА ЕСТЬNULL(ТаблицаИзменений.Отгрузить + ТаблицаИзменений.Резервировать, 0) > 0 ТОГДА
		|			
		|			ВЫБОР КОГДА Таблица.РаспределеноНаСкладеСводно < ЕСТЬNULL(ТаблицаИзменений.Отгрузить + ТаблицаИзменений.Резервировать, 0) ТОГДА
		|						Таблица.РаспределеноНаСкладеСводно - ЕСТЬNULL(ТаблицаИзменений.Отгрузить + ТаблицаИзменений.Резервировать, 0)
		|					ИНАЧЕ
		|						0
		|				КОНЕЦ
		|				
		|			ИНАЧЕ
		|				-ЕСТЬNULL(ТаблицаИзменений.Отгрузить + ТаблицаИзменений.Резервировать, 0)
		|		КОНЕЦ) КАК Свободно
		|ПОМЕСТИТЬ КорректировкаТоваров
		|ИЗ
		|	РаспределениеЗапасовОбеспеченНаСкладе КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИзменений КАК ТаблицаИзменений
		|		ПО ТаблицаИзменений.Номенклатура    = Таблица.Номенклатура
		|		 И ТаблицаИзменений.Характеристика  = Таблица.Характеристика
		|		 И ТаблицаИзменений.Склад           = Таблица.Склад
		|		 И ТаблицаИзменений.Назначение      = Таблица.Назначение
		|		 И ТаблицаИзменений.ЗаказНаОтгрузку = Таблица.ЗаказНаОтгрузку
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Номенклатура,
		|	Таблица.Характеристика,
		|	Таблица.Склад,
		|	Таблица.Назначение
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение";
		
	Тексты.Добавить(Текст);
	
	Текст =
		"// Корректировка заказов.
		|ВЫБРАТЬ
		|	Таблица.Номенклатура                                             КАК Номенклатура,
		|	Таблица.Характеристика                                           КАК Характеристика,
		|	Таблица.Склад                                                    КАК Склад,
		|	Таблица.Назначение                                               КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку                                          КАК ЗаказНаОтгрузку,
		|	Таблица.Упаковка                                                 КАК Упаковка,
		|	КорректировкаЗаказов.Свободно / &ТекстЗапросаКоэффициентУпаковки КАК Количество
		|ИЗ
		|	ТаблицаЗаказов КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаЗаказов КАК КорректировкаЗаказов
		|		ПО КорректировкаЗаказов.Номенклатура    = Таблица.Номенклатура
		|		 И КорректировкаЗаказов.Характеристика  = Таблица.Характеристика
		|		 И КорректировкаЗаказов.Склад           = Таблица.Склад
		|		 И КорректировкаЗаказов.Назначение      = Таблица.Назначение
		|		 И КорректировкаЗаказов.ЗаказНаОтгрузку = Таблица.ЗаказНаОтгрузку
		|ГДЕ
		|	Таблица.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Номенклатура                                       КАК Номенклатура,
		|	Таблица.Характеристика                                     КАК Характеристика,
		|	Таблица.Склад                                              КАК Склад,
		|	Таблица.Назначение                                         КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку                                    КАК ЗаказНаОтгрузку,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
		|	Таблица.Свободно                                           КАК Количество
		|ИЗ
		|	КорректировкаЗаказов КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		|// Корректировка товаров.
		|ВЫБРАТЬ
		|	Таблица.Номенклатура                                             КАК Номенклатура,
		|	Таблица.Характеристика                                           КАК Характеристика,
		|	Таблица.Склад                                                    КАК Склад,
		|	Таблица.Назначение                                               КАК Назначение,
		|	Таблица.Упаковка                                                 КАК Упаковка,
		|	КорректировкаТоваров.Свободно / &ТекстЗапросаКоэффициентУпаковки КАК Количество
		|ИЗ
		|	ТаблицаТоваров КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаТоваров КАК КорректировкаТоваров
		|		ПО КорректировкаТоваров.Номенклатура   = Таблица.Номенклатура
		|		 И КорректировкаТоваров.Характеристика = Таблица.Характеристика
		|		 И КорректировкаТоваров.Склад          = Таблица.Склад
		|		 И КорректировкаТоваров.Назначение     = Таблица.Назначение
		|ГДЕ
		|	Таблица.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Номенклатура                                       КАК Номенклатура,
		|	Таблица.Характеристика                                     КАК Характеристика,
		|	Таблица.Склад                                              КАК Склад,
		|	Таблица.Назначение                                         КАК Назначение,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
		|	Таблица.Свободно                                           КАК Количество
		|ИЗ
		|	КорректировкаТоваров КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		|// Остатки по заказу.
		|ВЫБРАТЬ
		|	Таблица.Номенклатура                                                               КАК Номенклатура,
		|	Таблица.Характеристика                                                             КАК Характеристика,
		|	Таблица.Склад                                                                      КАК Склад,
		|	Таблица.Назначение                                                                 КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку                                                            КАК ЗаказНаОтгрузку,
		|	Таблица.Упаковка                                                                   КАК Упаковка,
		|	РаспределениеЗапасов.РаспределеноНаСкладеСводно / &ТекстЗапросаКоэффициентУпаковки КАК Количество
		|ИЗ
		|	ТаблицаЗаказов КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗапасовОбеспеченНаСкладе КАК РаспределениеЗапасов
		|		ПО РаспределениеЗапасов.Номенклатура    = Таблица.Номенклатура
		|		 И РаспределениеЗапасов.Характеристика  = Таблица.Характеристика
		|		 И РаспределениеЗапасов.Склад           = Таблица.Склад
		|		 И РаспределениеЗапасов.Назначение      = Таблица.Назначение
		|		 И РаспределениеЗапасов.ЗаказНаОтгрузку = Таблица.ЗаказНаОтгрузку
		|ГДЕ
		|	Таблица.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Номенклатура                                       КАК Номенклатура,
		|	Таблица.Характеристика                                     КАК Характеристика,
		|	Таблица.Склад                                              КАК Склад,
		|	Таблица.Назначение                                         КАК Назначение,
		|	Таблица.ЗаказНаОтгрузку                                    КАК ЗаказНаОтгрузку,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
		|	Таблица.РаспределеноНаСкладеСводно                         КАК Количество
		|ИЗ
		|	РаспределениеЗапасовОбеспеченНаСкладе КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		|// Остатки по товару.
		|ВЫБРАТЬ
		|	Таблица.Номенклатура                                             КАК Номенклатура,
		|	Таблица.Характеристика                                           КАК Характеристика,
		|	Таблица.Склад                                                    КАК Склад,
		|	Таблица.Назначение                                               КАК Назначение,
		|	Таблица.Упаковка                                                 КАК Упаковка,
		|	РаспределениеЗапасов.Свободно / &ТекстЗапросаКоэффициентУпаковки КАК Количество,
		|	РаспределениеЗапасов.ПерераспределятьСкладскиеЗапасы             КАК ПерераспределятьСкладскиеЗапасы,
		|	РаспределениеЗапасов.ОтгружатьЕслиДоступно                       КАК ОтгружатьЕслиДоступно
		|ИЗ
		|	ТаблицаТоваров КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗапасовОстатокНаСкладе КАК РаспределениеЗапасов
		|		ПО РаспределениеЗапасов.Номенклатура    = Таблица.Номенклатура
		|		 И РаспределениеЗапасов.Характеристика  = Таблица.Характеристика
		|		 И РаспределениеЗапасов.Склад           = Таблица.Склад
		|		 И РаспределениеЗапасов.Назначение      = Таблица.Назначение
		|ГДЕ
		|	Таблица.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Таблица.Номенклатура                                       КАК Номенклатура,
		|	Таблица.Характеристика                                     КАК Характеристика,
		|	Таблица.Склад                                              КАК Склад,
		|	Таблица.Назначение                                         КАК Назначение,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
		|	Таблица.Свободно                                           КАК Количество,
		|	Таблица.ПерераспределятьСкладскиеЗапасы                    КАК ПерераспределятьСкладскиеЗапасы,
		|	Таблица.ОтгружатьЕслиДоступно                              КАК ОтгружатьЕслиДоступно
		|ИЗ
		|	РаспределениеЗапасовОстатокНаСкладе КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		|// Таблица документа.
		|ВЫБРАТЬ
		|	Таблица.НомерСтроки                             КАК Идентификатор,
		|	ОстатокНаСкладе.ПерераспределятьСкладскиеЗапасы КАК ПерераспределятьЗапасы,
		|	ОстатокНаСкладе.ОтгружатьЕслиДоступно           КАК ОтгружатьЕслиДоступно,
		|	(ОбеспеченНаСкладе.РаспределеноНаСкладеСводно
		|			+ ОстатокНаСкладе.Свободно
		|			+ КорректировкаТоваров.Свободно
		|			+ КорректировкаЗаказов.Свободно)
		|		/ &ТекстЗапросаКоэффициентУпаковки          КАК Доступно
		|ИЗ
		|	ВременнаяТаблицаДанныхДокумента КАК Таблица
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗапасовОбеспеченНаСкладе КАК ОбеспеченНаСкладе
		|		ПО ОбеспеченНаСкладе.Номенклатура    = Таблица.Номенклатура
		|		 И ОбеспеченНаСкладе.Характеристика  = Таблица.Характеристика
		|		 И ОбеспеченНаСкладе.Склад =
		|			ВЫБОР КОГДА Таблица.Номенклатура.ТипНоменклатуры В(
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
		|					Таблица.Склад
		|				ИНАЧЕ
		|					Таблица.Подразделение
		|			КОНЕЦ
		|		 И ОбеспеченНаСкладе.Назначение =
		|			ВЫБОР КОГДА Таблица.Обособленно ТОГДА
		|					ВЫБОР КОГДА Таблица.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
		|								НЕОПРЕДЕЛЕНО
		|							ИНАЧЕ
		|								Таблица.Назначение
		|						КОНЕЦ
		|				ИНАЧЕ
		|					ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			КОНЕЦ
		|		 И ОбеспеченНаСкладе.ЗаказНаОтгрузку = Таблица.ЗаказНаОтгрузку
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗапасовОстатокНаСкладе КАК ОстатокНаСкладе
		|		ПО ОстатокНаСкладе.Номенклатура    = Таблица.Номенклатура
		|		 И ОстатокНаСкладе.Характеристика  = Таблица.Характеристика
		|		 И ОстатокНаСкладе.Склад =
		|			ВЫБОР КОГДА Таблица.Номенклатура.ТипНоменклатуры В(
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
		|					Таблица.Склад
		|				ИНАЧЕ
		|					Таблица.Подразделение
		|			КОНЕЦ
		|		 И ОстатокНаСкладе.Назначение =
		|			ВЫБОР КОГДА Таблица.Обособленно ТОГДА
		|					ВЫБОР КОГДА Таблица.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
		|								НЕОПРЕДЕЛЕНО
		|							ИНАЧЕ
		|								Таблица.Назначение
		|						КОНЕЦ
		|				ИНАЧЕ
		|					ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			КОНЕЦ
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаЗаказов КАК КорректировкаЗаказов
		|		ПО КорректировкаЗаказов.Номенклатура    = Таблица.Номенклатура
		|		 И КорректировкаЗаказов.Характеристика  = Таблица.Характеристика
		|		 И КорректировкаЗаказов.Склад =
		|			ВЫБОР КОГДА Таблица.Номенклатура.ТипНоменклатуры В(
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
		|					Таблица.Склад
		|				ИНАЧЕ
		|					Таблица.Подразделение
		|			КОНЕЦ
		|		 И КорректировкаЗаказов.Назначение =
		|			ВЫБОР КОГДА Таблица.Обособленно ТОГДА
		|					ВЫБОР КОГДА Таблица.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
		|								НЕОПРЕДЕЛЕНО
		|							ИНАЧЕ
		|								Таблица.Назначение
		|						КОНЕЦ
		|				ИНАЧЕ
		|					ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			КОНЕЦ
		|		 И КорректировкаЗаказов.ЗаказНаОтгрузку = Таблица.ЗаказНаОтгрузку
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ КорректировкаТоваров КАК КорректировкаТоваров
		|		ПО КорректировкаТоваров.Номенклатура    = Таблица.Номенклатура
		|		 И КорректировкаТоваров.Характеристика  = Таблица.Характеристика
		|		 И КорректировкаТоваров.Склад =
		|			ВЫБОР КОГДА Таблица.Номенклатура.ТипНоменклатуры В(
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
		|					Таблица.Склад
		|				ИНАЧЕ
		|					Таблица.Подразделение
		|			КОНЕЦ
		|		 И КорректировкаТоваров.Назначение =
		|			ВЫБОР КОГДА Таблица.Обособленно ТОГДА
		|					ВЫБОР КОГДА Таблица.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
		|								НЕОПРЕДЕЛЕНО
		|							ИНАЧЕ
		|								Таблица.Назначение
		|						КОНЕЦ
		|				ИНАЧЕ
		|					ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			КОНЕЦ";
	Тексты.Добавить(Текст);
	
	Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	ТекстЗапросаКоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"Таблица.Упаковка",
		"Таблица.Номенклатура");
	
	Запрос.Текст = СтрЗаменить(Текст, "&ТекстЗапросаКоэффициентУпаковки", СтрШаблон("ЕСТЬNULL(%1, 1)", ТекстЗапросаКоэффициентУпаковки));
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	ВГраница = ПакетРезультатов.ВГраница();
	
	Результат = Новый Структура();
	Результат.Вставить("КорректировкаЗаказов", ПакетРезультатов[ВГраница - 4].Выгрузить());
	Результат.Вставить("КорректировкаТоваров", ПакетРезультатов[ВГраница - 3].Выгрузить());
	Результат.Вставить("ОстаткиПоЗаказу",      ПакетРезультатов[ВГраница - 2].Выгрузить());
	Результат.Вставить("ОстаткиПоТовару",      ПакетРезультатов[ВГраница - 1].Выгрузить());
	Результат.Вставить("ТаблицаДокумента",     ПакетРезультатов[ВГраница].Выгрузить());
	Возврат Результат;
	
КонецФункции

Функция ВременнаяТаблицаСвободныеОстатки(
			ИмяТаблицыФильтра,
			ИмяТаблицыРезультат,
			ПолучатьОтрицательные = Ложь,
			УчитыватьРезервы = Истина) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Склад КАК Склад,
		|	Запасы.Назначение КАК Назначение,
		|	&ПодстановкаЗначения КАК Количество,
		|	Запасы.ВНаличииОстаток
		|		+ Запасы.ПоступитОстаток
		|		- Запасы.РезервироватьНаСкладеОстаток
		|		- Запасы.РезервироватьПоМереПоступленияОстаток КАК КоличествоСУчетомОжидаемыхПоступлений
		|ПОМЕСТИТЬ ИмяТаблицыРезультатПереопределяемый
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
		|		(Номенклатура, Характеристика, Склад, Назначение) В(
		|			ВЫБРАТЬ
		|				Фильтр.Номенклатура КАК Номенклатура,
		|				Фильтр.Характеристика КАК Характеристика,
		|				Фильтр.Склад КАК Склад,
		|				Фильтр.Назначение КАК Назначение
		|			ИЗ
		|				ИмяТаблицыФильтраПереопределяемый КАК Фильтр)) КАК Запасы
		|ГДЕ
		|	&ПодстановкаЗначенияБольшеНуля
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение";
		
	Если УчитыватьРезервы Тогда
		
		Если ПолучатьОтрицательные Тогда
			
			ПодстановкаЗначения =
				"ВЫБОР
				|	КОГДА Запасы.ВНаличииОстаток - Запасы.РезервироватьНаСкладеОстаток < 0
				|		ТОГДА
				|			Запасы.ВНаличииОстаток - Запасы.РезервироватьНаСкладеОстаток
				|	КОГДА Запасы.ВНаличииОстаток - Запасы.РезервироватьНаСкладеОстаток - Запасы.РезервироватьПоМереПоступленияОстаток > 0
				|		ТОГДА
				|			Запасы.ВНаличииОстаток - Запасы.РезервироватьНаСкладеОстаток - Запасы.РезервироватьПоМереПоступленияОстаток
				|	ИНАЧЕ 0
				|КОНЕЦ";
			ПодстановкаЗначенияБольшеНуля = "ИСТИНА";
			
		Иначе
			
			ПодстановкаЗначения =
				"Запасы.ВНаличииОстаток
				|	- Запасы.РезервироватьНаСкладеОстаток
				|	- Запасы.РезервироватьПоМереПоступленияОстаток";
			ПодстановкаЗначенияБольшеНуля =
				"Запасы.ВНаличииОстаток
				|	- Запасы.РезервироватьНаСкладеОстаток
				|	- Запасы.РезервироватьПоМереПоступленияОстаток > 0";
			
		КонецЕсли;
		
	Иначе
		
		Если ПолучатьОтрицательные Тогда
			
			ПодстановкаЗначения = "Запасы.ВНаличииОстаток";
			ПодстановкаЗначенияБольшеНуля = "ИСТИНА";
			
		Иначе
			
			ПодстановкаЗначения = "Запасы.ВНаличииОстаток";
			ПодстановкаЗначенияБольшеНуля = "Запасы.ВНаличииОстаток > 0";
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПодстановкаЗначенияБольшеНуля", ПодстановкаЗначенияБольшеНуля);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПодстановкаЗначения", ПодстановкаЗначения);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыРезультатПереопределяемый", ИмяТаблицыРезультат);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыФильтраПереопределяемый", ИмяТаблицыФильтра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВременнаяТаблицаДвиженийДокумента(ИгнорироватьГотовностьКОбеспечению = Ложь)
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО                  КАК Ссылка,
		|	ТабЧасть.ДатаДокумента        КАК Период,
		|	ТабЧасть.Номенклатура         КАК Номенклатура,
		|	ТабЧасть.Характеристика       КАК Характеристика,
		|	ВЫБОР КОГДА ТабЧасть.Номенклатура.ТипНоменклатуры В(
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
		|				ТабЧасть.Склад
		|			ИНАЧЕ
		|				ТабЧасть.Подразделение
		|		КОНЕЦ КАК Склад,
		|	ВЫБОР КОГДА ТабЧасть.Обособленно ТОГДА
		|			
		|			ВЫБОР КОГДА ТабЧасть.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
		|						&СсылкаНовогоНазначения
		|					ИНАЧЕ
		|						ТабЧасть.Назначение
		|				КОНЕЦ
		|			
		|		ИНАЧЕ
		|			
		|			ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			
		|	КОНЕЦ                         КАК Назначение,
		|	ТабЧасть.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	ВЫБОР
		|		КОГДА ТабЧасть.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
		|			ТОГДА ТабЧасть.ЗаказНаОтгрузку
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЗапланированныйРасходРаспределенногоЗапаса,
		|	ТабЧасть.ВариантОбеспечения   КАК ВариантОбеспечения,
		|	ТабЧасть.Количество           КАК Количество,
		|	ТабЧасть.ГотовКОбеспечению    КАК ГотовКОбеспечению,
		|	ТабЧасть.ГотовКОтгрузке       КАК ГотовКОтгрузке,
		|	ТабЧасть.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки
		|ИЗ
		|	ВременнаяТаблицаДанныхДокумента КАК ТабЧасть
		|ГДЕ
		|	НЕ ТабЧасть.Отменено";
		
		ВложенныйЗапрос = РаспределениеЗапасовДвижения.ТекстЗапросаРаспоряжениеНаОбеспечениеИОтгрузку(ТекстЗапроса,
			ИгнорироватьГотовностьКОбеспечению);
		ВложенныйЗапрос = СтрШаблон("(%1)", ВложенныйЗапрос);
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТабЧасть.Номенклатура КАК Номенклатура,
			|	ТабЧасть.Характеристика КАК Характеристика,
			|	ТабЧасть.Склад КАК Склад,
			|	ТабЧасть.Назначение КАК Назначение,
			|	ТабЧасть.Заказ КАК Заказ,
			|	ТабЧасть.ОтгружаемыйЗаказ КАК ОтгружаемыйЗаказ,
			|	ТабЧасть.Период КАК Период,
			|	ТабЧасть.ДатаСобытия КАК ДатаСобытия,
			|	ТабЧасть.ВидДвижения КАК ВидДвижения,
			|	ТабЧасть.ВНаличии КАК ВНаличии,
			|	ТабЧасть.Поступит КАК Поступит,
			|	ТабЧасть.Заказано КАК Заказано,
			|	ТабЧасть.ОтложитьРезервирование КАК ОтложитьРезервирование,
			|	ТабЧасть.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
			|	ТабЧасть.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
			|	ТабЧасть.КОбеспечению КАК КОбеспечению,
			|	ТабЧасть.НеОбеспечивать КАК НеОбеспечивать
			|ПОМЕСТИТЬ ВременнаяТаблицаДвиженийДокумента
			|ИЗ
			|	ВложенныйЗапрос КАК ТабЧасть";
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВложенныйЗапрос", ВложенныйЗапрос);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВыгрузитьТаблицуИзмененийДокумента(МенеджерВременныхТаблиц, ПараметрыВстраивания)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Тексты = Новый Массив();
	ТекстЗапроса = ВременнаяТаблицаДвиженийДокумента();
	Запрос.УстановитьПараметр("Ссылка", Неопределено);
	Запрос.УстановитьПараметр("СсылкаНовогоНазначения", Справочники.Назначения.ПолучитьСсылку());
	Тексты.Добавить(ТекстЗапроса);
	
	КорректировкаДвижений = Неопределено;
	Если КорректировкаДвижений = Неопределено Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
			|	НЕОПРЕДЕЛЕНО КАК Характеристика,
			|	НЕОПРЕДЕЛЕНО КАК Склад,
			|	НЕОПРЕДЕЛЕНО КАК Назначение,
			|	НЕОПРЕДЕЛЕНО КАК ЗаказНаОтгрузку,
			|	0            КАК Отгрузить,
			|	0            КАК Резервировать
			|ПОМЕСТИТЬ ВременнаяТаблицаКорректировкаДвиженийДокумента
			|ГДЕ
			|	ЛОЖЬ";
		
	Иначе
		Запрос.УстановитьПараметр("КорректировкаДвижений", КорректировкаДвижений.ТаблицаДвижений);
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	Движения.Номенклатура    КАК Номенклатура,
			|	Движения.Характеристика  КАК Характеристика,
			|	Движения.Склад           КАК Склад,
			|	Движения.Назначение      КАК Назначение,
			|	ВЫБОР
			|			КОГДА Движения.ОтгружаемыйЗаказ <> НЕОПРЕДЕЛЕНО
			|				ТОГДА Движения.ОтгружаемыйЗаказ
			|			ИНАЧЕ Движения.Заказ
			|		КОНЕЦ КАК ЗаказНаОтгрузку,
			|	ВЫБОР
			|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|			ТОГДА Движения.ВНаличии
			|		ИНАЧЕ - Движения.ВНаличии
			|	КОНЕЦ КАК Отгрузить,
			|	ВЫБОР
			|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|			ТОГДА Движения.РезервироватьНаСкладе
			|		ИНАЧЕ - Движения.РезервироватьНаСкладе
			|	КОНЕЦ КАК Резервировать
			|ПОМЕСТИТЬ ВременнаяТаблицаКорректировкаДвиженийДокумента
			|ИЗ
			|	&КорректировкаДвижений КАК Движения
			|ГДЕ
			|	Движения.ВНаличии <> 0
			|		ИЛИ Движения.РезервироватьНаСкладе <> 0
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение";
	КонецЕсли;
	Тексты.Добавить(ТекстЗапроса);
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.Номенклатура    КАК Номенклатура,
		|	Таблица.Характеристика  КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(Таблица.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры В(
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|			ТОГДА Таблица.Склад
		|		ИНАЧЕ Таблица.Подразделение
		|	КОНЕЦ КАК Склад,
		|	Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|	ВЫБОР КОГДА Таблица.Обособленно ТОГДА
		|			
		|			Таблица.Назначение
		|			
		|		ИНАЧЕ
		|			
		|			ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			
		|	КОНЕЦ КАК Назначение
		|ПОМЕСТИТЬ ВыделенныеЗаказы
		|ИЗ
		|	ВременнаяТаблицаДанныхДокумента КАК Таблица
		|;
		|
		|//////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заказы.Номенклатура    КАК Номенклатура,
		|	Заказы.Характеристика  КАК Характеристика,
		|	Заказы.Склад           КАК Склад,
		|	Заказы.Назначение      КАК Назначение
		|ПОМЕСТИТЬ ВыделенныеТовары
		|ИЗ
		|	ВыделенныеЗаказы КАК Заказы";
	
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.Выполнить();
	
	Запрос.Текст =
		// Этапы заказа переработчику.
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|	Таблица.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ РегистраторыОтличныеОтЗаказа
		|ИЗ
		|	ВременнаяТаблицаДанныхДокумента КАК Таблица
		|ГДЕ
		|	Таблица.ЗаказНаОтгрузку <> Таблица.Регистратор
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Движения.Номенклатура КАК Номенклатура,
		|	Движения.Характеристика КАК Характеристика,
		|	Движения.Склад КАК Склад,
		|	Движения.Назначение КАК Назначение,
		|	Движения.ВидДвижения КАК ВидДвижения,
		// В непроведенном заказе переработчику в качестве заказа выступет Этап производства, нужно подменить его на Заказ переработчику.
		|	ВЫБОР
		|		КОГДА РегистраторыОтличныеОтЗаказа.Регистратор = Движения.ОтгружаемыйЗаказ
		|			ТОГДА РегистраторыОтличныеОтЗаказа.ЗаказНаОтгрузку
		|		ИНАЧЕ Движения.ОтгружаемыйЗаказ
		|	КОНЕЦ КАК ОтгружаемыйЗаказ,
		|	ВЫБОР
		|		КОГДА РегистраторыОтличныеОтЗаказа.Регистратор = Движения.Заказ
		|			ТОГДА РегистраторыОтличныеОтЗаказа.ЗаказНаОтгрузку
		|		ИНАЧЕ Движения.Заказ
		|	КОНЕЦ КАК Заказ,
		|	Движения.ВНаличии КАК ВНаличии,
		|	Движения.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
		|	Движения.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
		|	Движения.Активность КАК Активность
		|ПОМЕСТИТЬ ДвиженияРегистраторов
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности КАК Движения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистраторыОтличныеОтЗаказа КАК РегистраторыОтличныеОтЗаказа
		|		ПО РегистраторыОтличныеОтЗаказа.Регистратор = Движения.Регистратор
		|ГДЕ
		|	Движения.Регистратор В(
		|		ВЫБРАТЬ
		|			Таблица.Регистратор КАК Регистратор
		|		ИЗ
		|			ВременнаяТаблицаДанныхДокумента КАК Таблица)
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Назначение, Склад, Активность";
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Тексты = Новый Массив();
	Тексты.Добавить(ТекстЗапроса);
	
	ТекстЗапроса =
		// Имитация движений редактируемого документа.
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Корректировка.Номенклатура         КАК Номенклатура,
		|	Корректировка.Характеристика       КАК Характеристика,
		|	Корректировка.Склад                КАК Склад,
		|	Корректировка.Назначение           КАК Назначение,
		|	Корректировка.ЗаказНаОтгрузку      КАК ЗаказНаОтгрузку,
		|	СУММА(Корректировка.Отгрузить)     КАК Отгрузить,
		|	СУММА(Корректировка.Резервировать) КАК Резервировать,
		|	СУММА(Корректировка.РезервироватьПоМереПоступления) > 0
		|		ИЛИ -СУММА(Корректировка.РезервироватьПоМереПоступления)
		|				> СУММА(Корректировка.Отгрузить + Корректировка.Резервировать) КАК ОбновлятьКолонкуДоступноПослеРаспределенияЗапасов
		|ИЗ(
		|	ВЫБРАТЬ
		|		Движения.Номенклатура    КАК Номенклатура,
		|		Движения.Характеристика  КАК Характеристика,
		|		Движения.Склад           КАК Склад,
		|		Движения.Назначение      КАК Назначение,
		|		ВЫБОР
		|			КОГДА Движения.ОтгружаемыйЗаказ <> НЕОПРЕДЕЛЕНО
		|				ТОГДА Движения.ОтгружаемыйЗаказ
		|			ИНАЧЕ Движения.Заказ
		|		КОНЕЦ КАК ЗаказНаОтгрузку,
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -Движения.ВНаличии
		|			ИНАЧЕ Движения.ВНаличии
		|		КОНЕЦ КАК Отгрузить,
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА -Движения.РезервироватьНаСкладе
		|			ИНАЧЕ Движения.РезервироватьНаСкладе
		|		КОНЕЦ КАК Резервировать,
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА -Движения.РезервироватьПоМереПоступления
		|			ИНАЧЕ Движения.РезервироватьПоМереПоступления
		|		КОНЕЦ КАК РезервироватьПоМереПоступления
		|	ИЗ
		|		ВременнаяТаблицаДвиженийДокумента КАК Движения
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		// Таблица корректировки движений документа.
		|	ВЫБРАТЬ
		|		Движения.Номенклатура    КАК Номенклатура,
		|		Движения.Характеристика  КАК Характеристика,
		|		Движения.Склад           КАК Склад,
		|		Движения.Назначение      КАК Назначение,
		|		Движения.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
		|		Движения.Отгрузить       КАК Отгрузить,
		|		Движения.Резервировать   КАК Резервировать,
		|		0 КАК РезервироватьПоМереПоступления
		|	ИЗ
		|		ВыделенныеТовары КАК Товары
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКорректировкаДвиженийДокумента КАК Движения
		|			ПО Движения.Номенклатура   = Товары.Номенклатура
		|			 И Движения.Характеристика = Товары.Характеристика
		|			 И Движения.Назначение     = Товары.Назначение
		|			 И Движения.Склад          = Товары.Склад
		|	ГДЕ
		|		НЕ Движения.Номенклатура ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		// Сторно записанных движений документа.
		|	ВЫБРАТЬ
		|		Движения.Номенклатура    КАК Номенклатура,
		|		Движения.Характеристика  КАК Характеристика,
		|		Движения.Склад           КАК Склад,
		|		Движения.Назначение      КАК Назначение,
		|		ВЫБОР
		|			КОГДА Движения.ОтгружаемыйЗаказ <> НЕОПРЕДЕЛЕНО
		|				ТОГДА Движения.ОтгружаемыйЗаказ
		|			ИНАЧЕ Движения.Заказ
		|		КОНЕЦ КАК ЗаказНаОтгрузку,
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.ВНаличии
		|			ИНАЧЕ -Движения.ВНаличии
		|		КОНЕЦ КАК Отгрузить,
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА Движения.РезервироватьНаСкладе
		|			ИНАЧЕ -Движения.РезервироватьНаСкладе
		|		КОНЕЦ КАК Резервировать,
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА Движения.РезервироватьПоМереПоступления
		|			ИНАЧЕ -Движения.РезервироватьПоМереПоступления
		|		КОНЕЦ КАК РезервироватьПоМереПоступления
		|	ИЗ
		|		ВыделенныеТовары КАК Товары
		|			
		|			ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияРегистраторов КАК Движения
		|			ПО Движения.Номенклатура    = Товары.Номенклатура
		|			 И Движения.Характеристика  = Товары.Характеристика
		|			 И Движения.Назначение      = Товары.Назначение
		|			 И Движения.Склад           = Товары.Склад
		|			 И Движения.Активность
		|	ГДЕ
		|		НЕ Движения.Номенклатура ЕСТЬ NULL) КАК Корректировка
		|СГРУППИРОВАТЬ ПО
		|	Корректировка.Номенклатура,
		|	Корректировка.Характеристика,
		|	Корректировка.Склад,
		|	Корректировка.Назначение,
		|	Корректировка.ЗаказНаОтгрузку
		|ИМЕЮЩИЕ
		|	СУММА(Корректировка.Отгрузить) <> 0
		|		ИЛИ СУММА(Корректировка.Резервировать) <> 0
		// Если в документе уменьшили резервировать по мере, не за счет установки резервировать или отгрузить,
		// то колонку Доступно нужно перезаполнять в форме документа после выполения заданий распределения запасов по заказу,
		// так как оно может уменьшить авторезервы под заказом.
		|		ИЛИ СУММА(Корректировка.РезервироватьПоМереПоступления) > 0
		|		ИЛИ -СУММА(Корректировка.РезервироватьПоМереПоступления)
		|				> СУММА(Корректировка.Отгрузить + Корректировка.Резервировать)";
	
	Тексты.Добавить(ТекстЗапроса);
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	ТаблицаИзменений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаИзменений;
	
КонецФункции

Процедура ДобавитьВременнуюТаблицуДанныхДокумента(МенеджерВременныхТаблиц, Таблицы, ПараметрыВстраивания)
	
	Запрос = Новый Запрос();
	Для Каждого Элемент Из Таблицы Цикл
		
		Запрос.УстановитьПараметр(Элемент.Значение.ИмяВременнойТаблицы, Элемент.Значение.Таблица);
		
	КонецЦикла;
	
	Запрос.Текст = ПараметрыВстраивания.СлужебныеПараметры.ТекстЗапросаВременнаяТаблицаДанныхДокумента;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыИзДанныхФормы(Таблицы, ПараметрыВстраивания, Этап, ИсключитьТаблицуПотребностей = Ложь)
	
	ПутьКТаблице = ПутьКТаблице(ПараметрыВстраивания);
	
	Вариант = Неопределено;
	Для Каждого Элемент Из Таблицы Цикл
		
		Таблица = Элемент.Значение.Таблица; // ТаблицаЗначений
		Таблица.Очистить();
		
		Если Элемент.Ключ = "Объект" Тогда
			ОбъектДанных = Этап;
			Вариант = 1;  
		Иначе  
			Пути = СтрРазделить(Элемент.Ключ, ".", Ложь); 
			ОбъектДанных = Этап[Пути[1]];
			Вариант = 2;
		КонецЕсли;
		
		Если Вариант = 2 Тогда
			
			Для Каждого СтрокаТаблицы Из ОбъектДанных Цикл
				
				НоваяСтрока = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
			КонецЦикла;
			
		Иначе
			
			НоваяСтрока = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбъектДанных);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПутьКТаблице(ПараметрыВстраивания)
	
	ПутьКТаблице = ?(ПараметрыВстраивания.СлужебныеПараметры.ЭтоДокумент,
		СтрЗаменить(ПараметрыВстраивания.ИмяТаблицы, ПараметрыВстраивания.ИмяОбъекта, "Объект"),
		СтрЗаменить(ПараметрыВстраивания.ИмяТаблицы, "Форма.", ""));
		
	Возврат ПутьКТаблице;
	
КонецФункции


#КонецОбласти
#КонецОбласти