
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОборотыПоСтатьям(Команда)
	
	ОткрытьФорму("Отчет.бит_ОборотыПоСтатьям.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоБюджету(Команда)
	
	ОткрытьФорму("Отчет.бит_ОтчетПоБюджету.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоБюджету_ОстаткиПоСчетам(Команда)
	
	ОткрытьФорму("Отчет.бит_ОтчетПоБюджету_ОстаткиПоСчетам.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОтчетовБюджетирование(Команда)
	
	ВариантыОтчетовКлиент.ПоказатьПанельОтчетов("бит_Бюджетирование.Отчеты", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланФактныйАнализ(Команда)
	
	ОткрытьФорму("Отчет.бит_ПланФактныйАнализ.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура ПланФактныйАнализПоБюджету(Команда)
	
	ОткрытьФорму("Отчет.бит_ПланФактныйАнализПоБюджету.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура ПланФактныйАнализПоБюджету_ОстаткиПоСчетам(Команда)
	
	ОткрытьФорму("Отчет.бит_ПланФактныйАнализПоБюджету_ОстаткиПоСчетам.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура ПланФактныйАнализУниверсальный(Команда)
	
	ОткрытьФорму("Отчет.бит_ПланФактныйАнализУниверсальный.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура СценарноеПрогнозирование(Команда)
	
	ОткрытьФорму("Отчет.бит_СценарноеПрогнозирование.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура СверкаВГО_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_СверкаВГО_Бюджетирование.ФормаОбъекта");
	
КонецПроцедуры

#КонецОбласти