
&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	// Первыйбит ЛТ3 ЛапшовГ "GVLapshov@1cbit.ru" 24.03.2025 +
	НовыйЭлемент = Элементы.Вставить("бит_КодВРЦ", Тип("ПолеФормы"), Элементы.СтраницаОсновное, Элементы.Подразделение);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КодВРЦ"; 
	// Первыйбит ЛТ3 ЛапшовГ "GVLapshov@1cbit.ru" 24.03.2025 -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [26.04.2026 13:57:42] +        
	НовыйЭлемент = Элементы.Вставить("бит_ОсновнойХод", Тип("ПолеФормы"), Элементы.СтраницаОсновное, Элементы.Подразделение);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ОсновнойХод";
	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [26.04.2026 13:57:42] -

	// Первыйбит КарповС "svkarpov@1cbit.ru" 14.05.2026 +
	НовыйЭлемент = Элементы.Вставить("бит_КрНоим", Тип("ПолеФормы"), Элементы.СтраницаОсновное, Элементы.Подразделение);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КрНоим"; 
	// Первыйбит КарповС "svkarpov@1cbit.ru" 14.05.2026 -

КонецПроцедуры
