
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем КлючЗаписи;
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
		
	Если Параметры.КонтекстныйВызов Тогда
		Элементы.Организация.ТолькоПросмотр      = Истина;
		Элементы.Организация.КнопкаВыбора        = Ложь;
	КонецЕсли;
	
	ЗначенияЗаполнения = Неопределено;
	Параметры.Свойство("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	АктивныйЭлемент = Неопределено;
	Параметры.Свойство("АктивныйЭлемент", АктивныйЭлемент);
	
	ЭтоНоваяЗапись = Ложь;
	Копирование    = Ложь;
	
	Параметры.Свойство("Ключ", КлючЗаписи);
	
	ЭтоФормаЗаписи = (КлючЗаписи <> Неопределено);
	Если Параметры.РежимНастройки Тогда
		ЭтоФормаЗаписи = Ложь;
	Иначе
		ЭтоФормаЗаписи = Истина;
	КонецЕсли;
	
	Если КлючЗаписи = Неопределено И ЭтоФормаЗаписи Тогда
		ЭтоНоваяЗапись = Истина;
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Копирование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоФормаЗаписи
		И НЕ ЭтоНоваяЗапись Тогда
		Организация = КлючЗаписи.СтруктурноеПодразделение;
		ТекущаяДата = КлючЗаписи.Период;
	Иначе
		
		Если ЭтоНоваяЗапись И ЗначенияЗаполнения <> Неопределено Тогда
			ЗначенияЗаполнения.Свойство("СтруктурноеПодразделение", Организация);
		КонецЕсли;

		ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
		Если  ЗначенияЗаполнения <> Неопределено И ЗначенияЗаполнения.Свойство("Период") Тогда
			ТекущаяДата = ЗначенияЗаполнения.Период;
		КонецЕсли;
			
		Если Копирование Тогда
			ЗаполнитьЗначенияСвойств(НастройкиДоговоровИЗатрат, Параметры.ЗначениеКопирования, "СтруктурноеПодразделение, Период");
			Организация = НастройкиДоговоровИЗатрат.СтруктурноеПодразделение;
			ТекущаяДата = НастройкиДоговоровИЗатрат.Период;
		ИначеЕсли ЭтоНоваяЗапись Тогда
			НастройкиДоговоровИЗатрат.Период = ТекущаяДата;
		КонецЕсли;
		
	КонецЕсли;
	
	ПравоРедактированияНастроек = 
		ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_НастройкиДоговоровИЗатрат);
		
	Если (НЕ ЗначениеЗаполнено(Организация) И Организация <> Неопределено) ИЛИ Параметры.РежимНастройки Тогда
		Если НЕ ЭтоФормаЗаписи Тогда
			УстановитьДоступностьВидимостьНастроек(Ложь);
		Иначе
			ПодготовитьФормуНаСервере(Истина);
		КонецЕсли;
	Иначе
		ЗаполнитьПоУмолчанию = Ложь;
		Если НЕ ЭтоФормаЗаписи Тогда
			ПодготовитьФормуНастройки();
		КонецЕсли;
		Если Копирование Тогда
			СкопироватьУчетнуюПолитику(Параметры.ЗначениеКопирования);
		ИначеЕсли ЭтоНоваяЗапись Тогда
			ЗаполнитьПоУмолчанию = Истина;
		Иначе
			ПрочитатьУчетнуюПолитику();
		КонецЕсли;
		ПодготовитьФормуНаСервере(ЗаполнитьПоУмолчанию);
	КонецЕсли;
	
	УстановитьПодсказкуВводаОрганизации(ЭтотОбъект, НЕ ЭтоФормаЗаписи И Копирование);
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ПустаяСтрока(РезультатБлокировки) Тогда
		ПоказатьПредупреждение( , РезультатБлокировки);
		РезультатБлокировки = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И ЗавершениеРаботы Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЭтоФормаЗаписи И ЭтоНоваяЗапись Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		ВопросСохранитьИзменения("ВопросПередЗакрытиемЗавершение");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
		
	Если Организация = Неопределено Тогда
		НепроверяемыеРеквизиты.Добавить("Организация");	
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область НастройкиДоговоровИЗакупок

&НаКлиенте
Процедура УстанавливатьВДоговорахВысокийПриоритетЗаполненияАналитикПриИзменении(Элемент)
	
	ОтобразитьПериоды();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьГрафикиДоговоровПоБюджетуПриИзменении(Элемент)
	
	ОтобразитьПериоды();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьПревышенияСуммыПоДоговоруПриИзменении(Элемент)
	
	ОтобразитьПериоды();
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ПрименяетсяСОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзмененияНастроекОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Истина;
	
	Если Организация = Неопределено Тогда
		
		МенюОрганизации = Новый СписокЗначений; 
		МенюОрганизации.Добавить(1, НСтр("ru = 'Организации'"));
		МенюОрганизации.Добавить(2, НСтр("ru = 'ЦФО'"));
		МенюОрганизации.Добавить(3, НСтр("ru = 'Группы структурных подразделений'"));
		
		ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ОрганизацияНачалоВыбораЗавершение", ЭтотОбъект),
			МенюОрганизации, Элементы.Организация);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = 1 Тогда
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ИначеЕсли ВыбранныйЭлемент.Значение = 2 Тогда
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.Подразделения");
	ИначеЕсли ВыбранныйЭлемент.Значение = 3 Тогда
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.бит_ГруппыСтруктурныхПодразделений");	
	Иначе
		ОписаниеТипов = Новый ОписаниеТипов;
	КонецЕсли;
	
	Организация = ОписаниеТипов.ПривестиЗначение(Организация);
	Элементы.Организация.ОграничениеТипа = ОписаниеТипов;
	УстановитьПодсказкуВводаОрганизации(ЭтотОбъект);
	
	УстановитьДоступностьВидимостьНастроек(Истина);
	Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницыНастроекОжидание;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Организация = Неопределено;
	Элементы.Организация.ОграничениеТипа = Новый ОписаниеТипов;
	УстановитьПодсказкуВводаОрганизации(ЭтотОбъект);
	
	// Организация сбрасывается в "неопределено". Читаем настройки "для всего предприятия".
	ПриИзмененииОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименяетсяСПриИзменении(Элемент)

	ДатаОкончанияДействия = НайтиДатуОкончанияДействия(НастройкиДоговоровИЗатрат.Период, НастройкиДоговоровИЗатрат.СтруктурноеПодразделение);
	ТекущаяДата = НастройкиДоговоровИЗатрат.Период;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиОрганизацииНаСервере()
	
	Если НЕ ЭтоФормаЗаписи Тогда
		
		Если ЗначениеЗаполнено(Организация) ИЛИ Организация = Неопределено Тогда
			Если Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница <> Элементы.ОбщаяСтраницаНастройки Тогда
				УстановитьДоступностьВидимостьНастроек(Истина);
			КонецЕсли;
		КонецЕсли;
		
		РазблокироватьДанныеДляРедактирования(, УникальныйИдентификатор); // Все разблокируем
		Если ПустаяСтрока(РезультатБлокировки) Тогда
			ПодготовитьФормуНастройки();
		КонецЕсли;
		
		ПрочитатьУчетнуюПолитику();
		
	КонецЕсли;
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Функция МенеджерЗаписиПериодическогоРегистра(ИмяРегистра, КлючЗаписи, ИмяИзмерения = "СтруктурноеПодразделение") Экспорт
	
	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	МенеджерЗаписи[ИмяИзмерения] = КлючЗаписи[ИмяИзмерения];
	МенеджерЗаписи.Период        = КлючЗаписи.Период;
	МенеджерЗаписи.Прочитать();
	
	Возврат МенеджерЗаписи;

КонецФункции

&НаКлиенте
Процедура ПрочитатьНастройкиОрганизации()
	
	ПрочитатьНастройкиОрганизацииНаСервере();
	
	Если Не ПустаяСтрока(РезультатБлокировки) Тогда
		ПоказатьПредупреждение( , РезультатБлокировки);
		РезультатБлокировки = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)

	ЗаписатьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	Отказ = Ложь;
	ЗаписатьИзменения(Истина, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ПослеЗаписиНаКлиенте();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	
	Если НЕ ЗначениеЗаполнено(Организация) И Организация <> Неопределено Тогда
		Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
			Поле = НСтр("ru = 'Организация'");
		ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Подразделения") Тогда	
			Поле = НСтр("ru = 'ЦФО'");
		ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.бит_ГруппыСтруктурныхПодразделений") Тогда
			Поле = НСтр("ru = 'Группа структурных подразделений'");
		КонецЕсли;
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,Поле);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Организация");
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("СтруктурноеПодразделение", Организация);
	ОткрытьФорму("РегистрСведений.бит_НастройкиДоговоровИЗатрат.ФормаСписка", Новый Структура("Отбор", Отбор));
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ОтменитьИзмененияИстории();
	
КонецПроцедуры

&НаКлиенте
Процедура ДляВсегоПредприятия(Команда)
	
	ПриИзмененииОрганизации();
	УстановитьПодсказкуВводаОрганизации(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПоУмолчанию(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДатаИзмененияНастроек) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Период'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ДатаИзмененияНастроек");
		Возврат;
	КонецЕсли;
	
	ПрочитатьУчетнуюПолитику(ТекущаяДата, Истина);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЧтениеНастроекУчета

&НаСервере
Процедура ПрочитатьУчетнуюПолитику(ПериодЗначений = Неопределено, Создавать = Ложь)
	
	Если ПериодЗначений = Неопределено Тогда
		ПериодЗначений = ТекущаяДата;
	КонецЕсли;
	
	КлючЗаписи     = бит_НастройкиПрограммы.КлючЗаписиДействующейУчетнойПолитики("бит_НастройкиДоговоровИЗатрат", Организация, ПериодЗначений);
	Если КлючЗаписи = Неопределено Тогда
		
		Если НЕ Создавать Тогда
			МенеджерЗаписиВыбран = Ложь;
			Возврат;		
		КонецЕсли;
		
		ДанныеЗаполнения = Новый Структура("Период, СтруктурноеПодразделение", ПериодЗначений, Организация);
		
		МенеджерЗаписи = РегистрыСведений.бит_НастройкиДоговоровИЗатрат.СоздатьМенеджерЗаписи();
		РегистрыСведений.бит_НастройкиДоговоровИЗатрат.УстановкаНастроекПоУмолчанию(МенеджерЗаписи, ДанныеЗаполнения);
		МенеджерЗаписи.Записать(Истина);
	Иначе
		МенеджерЗаписи = МенеджерЗаписиПериодическогоРегистра("бит_НастройкиДоговоровИЗатрат", КлючЗаписи);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "НастройкиДоговоровИЗатрат");
	МенеджерЗаписиВыбран = Истина;
	
	ЗаполнитьСвязанныеРеквизиты();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязанныеРеквизиты()
			
	ДатаИзмененияНастроек = ?(ЗначениеЗаполнено(НастройкиДоговоровИЗатрат.Период), НастройкиДоговоровИЗатрат.Период, ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиенте()
	
	Отказ = Ложь;
	ЗаписатьИзменения(Ложь, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ПослеЗаписиНаКлиенте();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменения(Закрытие = Ложь, Отказ = Ложь)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ПередЗаписьюНаСервере();
	
	Если ЭтоФормаЗаписи Тогда
		МенеджерЗаписи = РеквизитФормыВЗначение("НастройкиДоговоровИЗатрат");
	Иначе
		Если ДатаИзмененияНастроек = НастройкиДоговоровИЗатрат.Период Тогда
			МенеджерЗаписи = РеквизитФормыВЗначение("НастройкиДоговоровИЗатрат");
		Иначе
			МенеджерЗаписи = РегистрыСведений.бит_НастройкиДоговоровИЗатрат.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, НастройкиДоговоровИЗатрат,,"Период");
			МенеджерЗаписи.Период = ДатаИзмененияНастроек;
		КонецЕсли;
	КонецЕсли;
	МенеджерЗаписи.Записать(НЕ ЭтоФормаЗаписи);
	Модифицированность = Ложь;
	ЭтоНоваяЗапись     = Ложь;
	
	ПослеЗаписиНаСервере(Закрытие);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	
	ПараметрыЗаписи = Новый Структура();
	// Определим, нужно ли выводить предупреждение после записи.
	ЕстьДвиженияЗаПериодПоОрганизации = Ложь;
	ПредупредитьОНеобходимостиПерепроведенияДокументов = Модифицированность;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(Закрытие)
	
	ОбновитьПовторноИспользуемыеЗначения(); // Записи учетной политики могут быть закешированы без использования функциональных опций
	
	Если НЕ Закрытие Тогда
		Если ЭтоФормаЗаписи Тогда
			ПрочитатьУчетнуюПолитику(ЭтотОбъект.НастройкиДоговоровИЗатрат.Период);
			УправлениеФормой(ЭтотОбъект);
		Иначе
			ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
			ПрочитатьУчетнуюПолитику(ТекущаяДата);
			ПодготовитьФормуНаСервере();
		КонецЕсли;
	КонецЕсли;
	
	Если ПредупредитьОНеобходимостиПерепроведенияДокументов Тогда
		ДатаНач = НачалоДня(НастройкиДоговоровИЗатрат.Период);
		ДатаКон = КонецДня(ДатаОкончанияДействия);
		ЕстьДвиженияЗаПериодПоОрганизации = ЕстьДвиженияЗаПериод(ДатаНач, ДатаКон, НастройкиДоговоровИЗатрат.СтруктурноеПодразделение);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьДвиженияЗаПериод(Знач ДатаНач, Знач ДатаКон, Знач Организация)

	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписиНаКлиенте()
	
	ПараметрыОповещения = Новый Структура("СтруктурноеПодразделение, Период", 
							НастройкиДоговоровИЗатрат.СтруктурноеПодразделение, 
							НастройкиДоговоровИЗатрат.Период);
	Оповестить("ЗаписьНастройкиДоговоровИЗатрат", ПараметрыОповещения);
	ОповеститьОбИзмененииНастроек();
	
	Если ЕстьДвиженияЗаПериодПоОрганизации Тогда
		ДатаНач = НачалоДня(НастройкиДоговоровИЗатрат.Период);
		ДатаКон = КонецДня(ДатаОкончанияДействия);
		ТекстПредупреждения = НСтр("ru = 'Изменены параметры настроек учета договоров и закупок.
                                    |Рекомендуется перепровести документы учета договоров и закупок за период: %1'; 
									|en = 'Changed parameters of settings.
                                    |It is recommended to re-check the for the period: %1'");
		ТекстПредупреждения = СтрШаблон(ТекстПредупреждения, ПредставлениеПериода(ДатаНач, ДатаКон, "ФП = Истина"));
		ВыводитсяПредупреждение = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаписиЗавершение", ЭтотОбъект);
		ПоказатьПредупреждение(ОписаниеОповещения, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ОбработатьПослеЗаписиНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПослеЗаписиНаКлиенте()

	Активизировать();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиЗавершение(Результат) Экспорт
	
	// В данный обработчик мы можем попасть и при выполнении команды "Записать", и при выполнении команды "Записать и закрыть".
	// Необходимо, чтобы обработчик по-разному отрабатывал в этих ситуациях,
	// т.е. нам необходимо понять, нужно ли закрывать форму. 
	// Для этого используется следующий прием:
	// т.к. при выполнении команды "Записать и закрыть" в процедуру ПередЗакрытием мы попадаем раньше, 
	// чем в обработчик оповещения, то мы можем сбрасывать флаг предупреждения в ней, а не в обработчике.
	// А в обработчике по тому, что флаг сброшен, мы понимаем, что отработало ПередЗакрытием и нужно закрыть форму.

	ОбработатьПослеЗаписиНаКлиенте();
	
	Если НЕ ВыводитсяПредупреждение Тогда
		Закрыть();
	Иначе
		ВыводитсяПредупреждение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиДатуОкончанияДействия(Знач ТекПериод, Знач ТекОрганизация)
	
	Возврат бит_НастройкиПрограммы.НайтиДатуОкончанияДействия(ТекПериод, ТекОрганизация, "бит_НастройкиДоговоровИЗатрат");

КонецФункции

&НаСервере
Процедура ОтменитьИзмененияИстории()
	
	Модифицированность = Ложь;
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	ПрочитатьУчетнуюПолитику(ТекущаяДата);
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеРезультатовРаботы

&НаКлиенте
Процедура ВопросСохранитьИзменения(ИмяОповещения)
	
	ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?';
					|en = 'The data was changed. Save changes?'");
	Оповещение = Новый ОписаниеОповещения(ИмяОповещения, ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередСменойОрганизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницыНастроекОжидание;
		ПрочитатьНастройкиОрганизации();
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
		ЗаписатьИзменения(Ложь, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		ОповеститьОбИзмененииНастроек();
		Модифицированность = Ложь;
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницыНастроекОжидание;
		ПрочитатьНастройкиОрганизации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = Ложь;
		Закрыть();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		Отказ = Ложь;
		ЗаписатьИзменения(Истина, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		Модифицированность = Ложь;
		ОповеститьОбИзмененииНастроек();
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриПереходеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		ОтменитьИзмененияИстории();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаписатьНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияИзВладельца() Экспорт
	
	ЗаписатьИзменения(Истина);
	ОповеститьОбИзмененииНастроек();
	
КонецПроцедуры

#КонецОбласти

#Область ОтрисовкаФормы

&НаСервере
Процедура УстановитьДоступностьВидимостьНастроек(ДоступностьВидимость)
	
	Если ОрганизацияНедоступна Тогда
		Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаНедоступная;
		Элементы.СтраницыНастройкиДоговоровИЗатратИстория.Видимость = Ложь;
		Элементы.ГруппаКоманднаяПанель.Видимость                  = Ложь;
		Элементы.ПрименяетсяС.Видимость                           = Ложь;
	Иначе
		
		Если ДоступностьВидимость Тогда
			Если Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница <> Элементы.ОбщаяСтраницаНастройки Тогда
				Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаНастройки;
			КонецЕсли;
		Иначе
			Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаПустая;
			Элементы.СтраницыНастройкиДоговоровИЗатратИстория.Видимость = Ложь;
			Элементы.ГруппаКоманднаяПанель.Видимость                  = Ложь;
			Элементы.ПрименяетсяС.Видимость                           = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ГруппаОрганизация.ЦветФона = ЦветаСтиля.бит_БыстрыеОтборыФонГруппы;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(ЗаполнитьПоУмолчанию = Ложь)
	
	Если НЕ ЭтоФормаЗаписи Тогда
		Элементы.ГруппаОрганизация.ЦветФона = ЦветаСтиля.бит_БыстрыеОтборыФонГруппы;
	Иначе
		Если ЗаполнитьПоУмолчанию Тогда
			ДанныеЗаполнения = Новый Структура("Период, СтруктурноеПодразделение", ТекущаяДата, Организация); 

			РегистрыСведений.бит_НастройкиДоговоровИЗатрат.УстановкаНастроекПоУмолчанию(НастройкиДоговоровИЗатрат, ДанныеЗаполнения);
			МенеджерЗаписиВыбран = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПравоРедактированияНастроек Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
		
		Если ЭтоФормаЗаписи Тогда
			Элементы.Организация.ТолькоПросмотр      = Истина;
			Элементы.Организация.РежимВыбораИзСписка = Ложь;
			Элементы.Организация.КнопкаВыбора        = Ложь;
			Элементы.ПрименяетсяС.ТолькоПросмотр     = Истина;
			Элементы.ГруппаЗаписать.Доступность      = ПравоРедактированияНастроек;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьРеквизитыФормы();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы  = Форма.Элементы;
	
	Если Форма.ЭтоФормаЗаписи Тогда
		Элементы.СтраницыНастройкиДоговоровИЗатратИстория.Видимость = Ложь;
	Иначе	
		Элементы.СтраницыНастройкиДоговоровИЗатратИстория.Видимость = Форма.МенеджерЗаписиВыбран;
	КонецЕсли;
	
	Элементы.ПрименяетсяС.Видимость 		 = Форма.ЭтоФормаЗаписи;
	Элементы.ГруппаКоманднаяПанель.Видимость = Форма.ЭтоФормаЗаписи;

	Элементы.СтраницыНастройкиДоговоровИЗатратИстория.Видимость = НЕ Форма.ЭтоФормаЗаписи;
	Элементы.ПрименяетсяС.Видимость                           = Форма.ЭтоФормаЗаписи;
	
	Элементы.СтраницыНастройкиДоговоровИЗатратИстория.ТекущаяСтраница = Элементы.СтраницаНастройкиДоговоровИЗатратПериоды;
	Если Форма.Модифицированность И НЕ Форма.ЭтоФормаЗаписи Тогда
		Элементы.СтраницыНастройкиДоговоровИЗатратИстория.ТекущаяСтраница = Элементы.СтраницаНастройкиДоговоровИЗатратИзменение;
	КонецЕсли;
	
	Если Форма.МенеджерЗаписиВыбран Тогда
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.Страница_НастройкиДоговоровИЗатрат;
	Иначе
		Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницаНеНайдено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
			
	ДатаОкончанияДействия = НайтиДатуОкончанияДействия(НастройкиДоговоровИЗатрат.Период, НастройкиДоговоровИЗатрат.СтруктурноеПодразделение);
	
	ЗаполнитьСвязанныеРеквизиты();
	
КонецПроцедуры

&НаКлиенте 
Процедура ОтобразитьПериоды()
	
	Если ЭтоФормаЗаписи Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыНастройкиДоговоровИЗатратИстория.ТекущаяСтраница = Элементы.СтраницаНастройкиДоговоровИЗатратИзменение;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура СкопироватьУчетнуюПолитику(Отбор)
	
	МенеджерЗаписи = РегистрыСведений.бит_НастройкиДоговоровИЗатрат.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СтруктурноеПодразделение = Отбор.СтруктурноеПодразделение;
	МенеджерЗаписи.Период      				= Отбор.Период;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписиВыбран = Истина;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект.НастройкиДоговоровИЗатрат, МенеджерЗаписи);
	ЗаполнитьСвязанныеРеквизиты();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Организация");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Организация", ВидСравненияКомпоновкиДанных.Равно, Неопределено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииНастроек()
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.бит_НастройкиДоговоровИЗатрат"));
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНастройки()
	
	Модифицированность = Ложь;

	Если Не ЗначениеЗаполнено(Организация) И Организация <> Неопределено Тогда
		Элементы.СтраницыНастроек.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ПравоРедактированияНастроек Тогда
		Элементы.СтраницыНастроек.ТолькоПросмотр = Истина;
	Иначе
	
		Элементы.СтраницыНастроек.ТолькоПросмотр = Ложь;
		
		// Так как изменяем данные разных записей в одной форме, 
		// то наложим пессимистическую объектную блокировку вручную - 
		// по специальному набору измерений, который никогда не будет записан в регистр.
		
		КлючЗаписи = бит_НастройкиПрограммы.КлючЗаписиДействующейУчетнойПолитики("бит_НастройкиДоговоровИЗатрат", Организация, '2030-01-01');
		Если КлючЗаписи <> Неопределено Тогда
			
			РезультатБлокировки = "";
			Попытка 
				ЗаблокироватьДанныеДляРедактирования(
					КлючЗаписи,
					, // Данные не хранятся в ИБ
					УникальныйИдентификатор); // На все время жизни формы
			Исключение
				Элементы.СтраницыНастроек.ТолькоПросмотр = Истина;
				РезультатБлокировки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОрганизации()

	Если ЭтоФормаЗаписи Тогда
		НастройкиДоговоровИЗатрат.СтруктурноеПодразделение = Организация;
		Модифицированность  = Истина;
		ПрочитатьНастройкиОрганизацииНаСервере();
	Иначе
		Если Модифицированность Тогда
			ВопросСохранитьИзменения("ВопросПередСменойОрганизации");
		Иначе
			Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.СтраницыНастроекОжидание;
			ПрочитатьНастройкиОрганизации();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПодсказкуВводаОрганизации(Форма, ПриСоздании = Ложь)

	Элементы = Форма.Элементы;
	
	ТекстИнформация = НСтр("ru = 'Пожалуйста, подождите ...'");
	Если ПриСоздании Тогда
		Подсказка = НСтр("ru = 'Укажите структурное подразделение'");
	Иначе	
		Если ТипЗнч(Форма.Организация) = Тип("СправочникСсылка.Организации") Тогда
			Подсказка 		= НСтр("ru = 'Укажите организацию'");
			ТекстИнформация = НСтр("ru = 'Ждем указания организации.'"); 
		ИначеЕсли ТипЗнч(Форма.Организация) = Тип("СправочникСсылка.Подразделения") Тогда	
			Подсказка 		= НСтр("ru = 'Укажите ЦФО'");
			ТекстИнформация = НСтр("ru = 'Ждем указания ЦФО.'");
		ИначеЕсли ТипЗнч(Форма.Организация) = Тип("СправочникСсылка.бит_ГруппыСтруктурныхПодразделений") Тогда
			Подсказка = НСтр("ru = 'Укажите группу структурных подразделений'");
			ТекстИнформация = НСтр("ru = 'Ждем указания группы структурных подразделений.'");
		Иначе
			Подсказка = НСтр("ru = 'Для всего предприятия'");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Организация.ПодсказкаВвода = Подсказка;
	Элементы.ТекстИнформация.Заголовок   = ТекстИнформация;
	
КонецПроцедуры
 
#КонецОбласти

#КонецОбласти
