
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТЛТ6.2] [ASHolyavko@1cbit.ru] [02.04.2026] +        
	
	Если Параметры.Ключ.Пустая() Тогда
		
		РеквизитХарактеристикиПризнакЗаказногоИзделия = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений("РеквизитХарактеристикиПризнакЗаказногоИзделия", ЭтаФорма, Истина);
		ЗначениеСтандартногоПризнакаИзделия = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений("ЗначениеСтандартногоПризнакаИзделия", ЭтаФорма, Истина);
		
		СтруктураОтбор = Новый Структура;
		СтруктураОтбор.Вставить("Свойство", РеквизитХарактеристикиПризнакЗаказногоИзделия);
		
		НайденныеСтроки = ТаблицаНастроекРеквизитов.НайтиСтроки(СтруктураОтбор);
		
		Если НайденныеСтроки.Количество() <> 0  Тогда
			
			НайденыйРеквизит = НайденныеСтроки[0].ПутьКДанным;
			
			ЭтотОбъект[НайденыйРеквизит] = ЗначениеСтандартногоПризнакаИзделия;
			
		КонецЕсли;
		
	КонецЕсли;
		
	//Добавим обработчики для доп реквизитов
	//НовыйЭлемент.УстановитьДействие("ПриИзменении", "Товары_бит_РеквизитТаблицыПриИзменении");
	//НачалоВыбора
	
	СтруктураОтбор = Новый Структура;
	СтруктураОтбор.Вставить("ЭтоДопРеквизит", Истина);
	
	НайденныеСтроки = ТаблицаНастроекРеквизитов.НайтиСтроки(СтруктураОтбор);
	
	Для Каждого ДопРеквизит Из НайденныеСтроки Цикл
		
		//ЭтаФорма[ТаблицаНастроекРеквизитов[6].ПутьКДАнным]
		
		Элементы[ДопРеквизит.ПутьКДанным].УстановитьДействие("НачалоВыбора", "допРеквизитыНачалоВыбора");	
		Элементы[ДопРеквизит.ПутьКДанным].ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		Элементы[ДопРеквизит.ПутьКДанным].КнопкаВыпадающегоСписка = Ложь;
		Элементы[ДопРеквизит.ПутьКДанным].ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		//Элементы[].УстановитьДействие("НачалоВыбора", "допРеквизитыНачалоВыбора");
		
	КонецЦикла;		 	
	
	// }}ПервыйБИТ ЛистТребований [ЛТЛТ6.2] [ASHolyavko@1cbit.ru] [02.04.2026] -
	
КонецПроцедуры

&НаКлиенте
Процедура допРеквизитыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] +        
	
	УстановитьОграниченияВыбораХарактеристики(Элемент.Имя); 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] -
		
КонецПроцедуры

&НаСервере
Процедура УстановитьОграниченияВыбораХарактеристики(ИмяДопРеквизита)
		
	// {{ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] +        
	
	ПодготовитьДанныеДляИнтерактиваПередЗаписью(Ложь);
	
	СтруктураОтбор = Новый Структура;
	СтруктураОтбор.Вставить("ПутьКДанным", ИмяДопРеквизита);
	
	НайденныеСтроки = ТаблицаНастроекРеквизитов.НайтиСтроки(СтруктураОтбор);
	НетДействующихПравил = Истина;
	
	Если НайденныеСтроки.Количество() <> 0  Тогда
		
		ДопРеквизит = НайденныеСтроки[0];
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НастройкиВыбораИОграниченияЗначенийПараметров.НаборОграничений КАК НаборОграничений
		|ПОМЕСТИТЬ вт_НаборОграничений
		|ИЗ
		|	РегистрСведений.бит_НастройкиВыбораИОграниченияЗначенийПараметров КАК бит_НастройкиВыбораИОграниченияЗначенийПараметров
		|ГДЕ
		|	бит_НастройкиВыбораИОграниченияЗначенийПараметров.АктивностьНастройки = &АктивностьНастройки
		|	И бит_НастройкиВыбораИОграниченияЗначенийПараметров.ВидНоменклатуры = &ВидНоменклатуры
		|	И бит_НастройкиВыбораИОграниченияЗначенийПараметров.РеквизитХарактеристики = &РеквизитХарактеристики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_НаборыОграниченийИХарактеристикПравилаОграничений.Ссылка КАК Ссылка,
		|	бит_НаборыОграниченийИХарактеристикПравилаОграничений.Наименование КАК Наименование,
		|	бит_НаборыОграниченийИХарактеристикПравилаОграничений.УсловияПрименения КАК УсловияПрименения,
		|	бит_НаборыОграниченийИХарактеристикПравилаОграничений.УсловиеОтбора КАК УсловиеОтбора,
		|	бит_НаборыОграниченийИХарактеристикПравилаОграничений.РежимПроверки КАК РежимПроверки,
		|	бит_НаборыОграниченийИХарактеристикПравилаОграничений.Хранилище_УсловияПрименения КАК Хранилище_УсловияПрименения,
		|	бит_НаборыОграниченийИХарактеристикПравилаОграничений.Хранилище_УсловияОтбора КАК Хранилище_УсловияОтбора,
		|	бит_НаборыОграниченийИХарактеристикПравилаОграничений.Ссылка.РеквизитХарактеристики КАК РеквизитХарактеристики
		|ИЗ
		|	Справочник.бит_НаборыОграниченийИХарактеристик.ПравилаОграничений КАК бит_НаборыОграниченийИХарактеристикПравилаОграничений
		|ГДЕ
		|	бит_НаборыОграниченийИХарактеристикПравилаОграничений.Ссылка В
		|			(ВЫБРАТЬ
		|				вт_НаборОграничений.НаборОграничений КАК НаборОграничений
		|			ИЗ
		|				вт_НаборОграничений КАК вт_НаборОграничений)";
		
		Запрос.УстановитьПараметр("АктивностьНастройки", Истина);
		Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатурыДоИзменения);
		Запрос.УстановитьПараметр("РеквизитХарактеристики", ДопРеквизит.Свойство);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ДоступныеЗначения = Новый Массив;
		НеДоступныеЗначения = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОбъектЗначение = РеквизитФормыВЗначение("Объект");
						
			ПравилоДействует = ПравилоДействует(ОбъектЗначение, ВыборкаДетальныеЗаписи.Хранилище_УсловияПрименения);
			
			Если ПравилоДействует Тогда
				
				НетДействующихПравил = Ложь;
				
				ВыхСхемаКомпоновки = Новый СхемаКомпоновкиДанных;
				Справочники.бит_НаборыОграниченийИХарактеристик.Инициализировать_СхемуКомпоновкиДанныхЗначений(ВыхСхемаКомпоновки, ВыборкаДетальныеЗаписи.РеквизитХарактеристики);
				
				ДобавитьУсловияОтбораЗначенийПараметра(ВыхСхемаКомпоновки, ОбъектЗначение, ВыборкаДетальныеЗаписи.Хранилище_УсловияОтбора);
				
				ТабдицаЗначений = РезультатКомпоновкиВТаблицу(ВыхСхемаКомпоновки, Неопределено);
				
				ВсеЗначенияХарактеристики = ПолучитьВсеЗначенияХарактеристики(ВыборкаДетальныеЗаписи.РеквизитХарактеристики);			
				
				Если ВыборкаДетальныеЗаписи.РежимПроверки = Перечисления.бит_РежимПроверкиСозданияХарактеристик.Разрешить Тогда
					Для Каждого СтрокаТЗ Из ТабдицаЗначений Цикл
						Если (ТипЗнч(СтрокаТЗ.ЗначениеСвойства) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов")
							ИЛИ ТипЗнч(СтрокаТЗ.ЗначениеСвойства) = Тип("СправочникСсылка.Номенклатура"))
							И НЕ СтрокаТЗ.ЗначениеСвойства.ЭтоГруппа Тогда	
							ДоступныеЗначения.Добавить(СтрокаТЗ.ЗначениеСвойства);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.РежимПроверки = Перечисления.бит_РежимПроверкиСозданияХарактеристик.Запретить ТОгда
					Для Каждого ЭлМассива Из ВсеЗначенияХарактеристики Цикл
						Индекс = ТабдицаЗначений.Найти(ЭлМассива);
						Если Индекс = Неопределено Тогда
							ДоступныеЗначения.Добавить(ЭлМассива);
						КонецЕсли;
					КонецЦикла;;
				КонецЕсли;
				
				//Иначе
				//	Для Каждого СтрокаТЗ Из ТабдицаЗначений Цикл
				//		НеДоступныеЗначения.Добавить(СтрокаТЗ.ЗначениеСвойства);	            
				//	КонецЦикла;
				//КонецЕсли;
				//
				//Для Каждого ЭлМассива Из НеДоступныеЗначения Цикл
				//	Индекс = ДоступныеЗначения.Найти(ЭлМассива);
				//	Если Индекс <> Неопределено Тогда
				//		ДоступныеЗначения.Удалить(Индекс);
				//	КонецЕсли;
				//КонецЦикла;
				
				Элементы[ДопРеквизит.ПутьКДанным].РежимВыбораИзСписка = Истина;
				Элементы[ДопРеквизит.ПутьКДанным].КнопкаВыбора = Истина;
				Элементы[ДопРеквизит.ПутьКДанным].ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
				Элементы[ДопРеквизит.ПутьКДанным].СписокВыбора.Очистить();
				Элементы[ДопРеквизит.ПутьКДанным].СписокВыбора.ЗагрузитьЗначения(ДоступныеЗначения);
				
				Сообщить(ВыборкаДетальныеЗаписи.Наименование);
								
			КонецЕсли;
			
		КонецЦикла;		
		
		Если НетДействующихПравил Тогда
			Элементы[ДопРеквизит.ПутьКДанным].РежимВыбораИзСписка = Ложь;	
			Элементы[ДопРеквизит.ПутьКДанным].КнопкаВыбора = Истина;
			Элементы[ДопРеквизит.ПутьКДанным].ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
			Элементы[ДопРеквизит.ПутьКДанным].СписокВыбора.Очистить();
		КонецЕсли;
		
	КонецЕсли; 

	// }}ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] -
		
КонецПроцедуры  

&НаСервере
Функция ПолучитьВсеЗначенияХарактеристики(РеквизитХарактеристики)
	
	Если РеквизитХарактеристики.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Владелец = &Владелец
		|	И НЕ ЗначенияСвойствОбъектов.ЭтоГруппа";
		
		Запрос.УстановитьПараметр("Владелец", РеквизитХарактеристики);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Владелец", РеквизитХарактеристики);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПравилоДействует(ВхВариантИсполнения_Объект, Хранилище_УсловияПрименения)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] +        

	_Хранилище_УсловияПрименения_Отбор = Хранилище_УсловияПрименения.Получить();
	
	Если _Хранилище_УсловияПрименения_Отбор = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	_ПравилоДействует = Истина;
	Для Каждого _Хранилище_ЭлементОтбора Из _Хранилище_УсловияПрименения_Отбор.Элементы Цикл
		
		Если НЕ _Хранилище_ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВхВариантИсполнения_Объект = Неопределено Тогда
			
			_ПроверяемоеЗначение = Неопределено;
			                                                          
		Иначе
			
			список_ПутьКДанным = глСпИзСтроки(_Хранилище_ЭлементОтбора.ЛевоеЗначение, ".");
			Если список_ПутьКДанным.Количество() > 1 Тогда
				список_ПутьКДанным.Удалить(0);
			КонецЕсли;
			
			Если СтрНайти(Строка(_Хранилище_ЭлементОтбора.ЛевоеЗначение), "Номенклатура")<>0 Тогда
				_ПроверяемоеЗначение = ВхВариантИсполнения_Объект.Владелец;
			Иначе
				_ПроверяемоеЗначение = ВхВариантИсполнения_Объект;
			КонецЕсли;                                                     
			
			Для Каждого _ЭлементСписка_ПутьКДанным Из список_ПутьКДанным Цикл
				
				Попытка
					_ПроверяемоеЗначение = _ПроверяемоеЗначение[_ЭлементСписка_ПутьКДанным.Значение];
				Исключение
					
					//Это параметр
								
					_ИмяПараметра = _ЭлементСписка_ПутьКДанным.Значение;
					
					_ИмяПараметра = СтрЗаменить(_ИмяПараметра, "[", "");
					_ИмяПараметра = СтрЗаменить(_ИмяПараметра, "]", "");
					
					_Параметр = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("бит_Представление", _ИмяПараметра,);
					
					Если глПустоеЗначение(_Параметр) 
						И Лев(_ИмяПараметра, 1) = "["
						И Прав(_ИмяПараметра, 1) = "]" Тогда
						
						_ИмяПараметра = Сред(_ИмяПараметра, 2, СтрДлина(_ИмяПараметра)-2);
						_Параметр = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("бит_Представление", _ИмяПараметра);
						
					КонецЕсли;
					
					Если НЕ глПустоеЗначение(_Параметр) Тогда
						_ПроверяемоеЗначение = глПолучитьЗначениеПараметраВИ(_ПроверяемоеЗначение, _Параметр);
					КонецЕсли;
					
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
		
		
		//ПРЯМОЕ СРАВНЕНИЕ
		Если _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
			
			_ПроверяемоеЗначение = ПривестиЗначение(_ПроверяемоеЗначение, ТипЗнч(_Хранилище_ЭлементОтбора.ПравоеЗначение));
			
			_УсловиеВыполнено =  _ПроверяемоеЗначение > _Хранилище_ЭлементОтбора.ПравоеЗначение;
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			
			_ПроверяемоеЗначение = ПривестиЗначение(_ПроверяемоеЗначение, ТипЗнч(_Хранилище_ЭлементОтбора.ПравоеЗначение));
			
			_УсловиеВыполнено =  _ПроверяемоеЗначение >= _Хранилище_ЭлементОтбора.ПравоеЗначение;
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда

			_ПроверяемоеЗначение = ПривестиЗначение(_ПроверяемоеЗначение, ТипЗнч(_Хранилище_ЭлементОтбора.ПравоеЗначение));
			
			_УсловиеВыполнено =  _ПроверяемоеЗначение < _Хранилище_ЭлементОтбора.ПравоеЗначение;
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			
			_ПроверяемоеЗначение = ПривестиЗначение(_ПроверяемоеЗначение, ТипЗнч(_Хранилище_ЭлементОтбора.ПравоеЗначение));
			
			_УсловиеВыполнено =  _ПроверяемоеЗначение <= _Хранилище_ЭлементОтбора.ПравоеЗначение;
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			
			_ПроверяемоеЗначение = ПривестиЗначение(_ПроверяемоеЗначение, ТипЗнч(_Хранилище_ЭлементОтбора.ПравоеЗначение));
			
			_УсловиеВыполнено =  _ПроверяемоеЗначение = _Хранилище_ЭлементОтбора.ПравоеЗначение;
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
			
			_ПроверяемоеЗначение = ПривестиЗначение(_ПроверяемоеЗначение, ТипЗнч(_Хранилище_ЭлементОтбора.ПравоеЗначение));
			
			_УсловиеВыполнено =  НЕ _ПроверяемоеЗначение = _Хранилище_ЭлементОтбора.ПравоеЗначение;
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда	
			
			_УсловиеВыполнено = НЕ ЗначениеЗаполнено(_ПроверяемоеЗначение);
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда	
			
			_УсловиеВыполнено = ЗначениеЗаполнено(_ПроверяемоеЗначение);	
			
			
		//СПИСОК	
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			
			_УсловиеВыполнено =  НЕ _Хранилище_ЭлементОтбора.ПравоеЗначение.НайтиПоЗначению(_ПроверяемоеЗначение) = Неопределено;
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда

			_УсловиеВыполнено =  _Хранилище_ЭлементОтбора.ПравоеЗначение.НайтиПоЗначению(_ПроверяемоеЗначение) = Неопределено;
			
		////ИНТЕРВАЛ
		//
		//ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Интервал Тогда
		//	
		//	_ПроверяемоеЗначение = ПривестиЗначение(_ПроверяемоеЗначение, ТипЗнч(_Хранилище_ЭлементОтбора.Значение));
		//	
		//	_УсловиеВыполнено =  (_ПроверяемоеЗначение > _Хранилище_ЭлементОтбора.ЗначениеС)
		//						И (_ПроверяемоеЗначение < _Хранилище_ЭлементОтбора.ЗначениеПо);
		//	
		//ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ИнтервалВключаяГраницы Тогда

		//	_ПроверяемоеЗначение = ПривестиЗначение(_ПроверяемоеЗначение, ТипЗнч(_Хранилище_ЭлементОтбора.Значение));
		//	
		//	_УсловиеВыполнено =  (_ПроверяемоеЗначение >= _Хранилище_ЭлементОтбора.ЗначениеС)
		//						И (_ПроверяемоеЗначение <= _Хранилище_ЭлементОтбора.ЗначениеПо);
		//	
		//ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ИнтервалВключаяНачало Тогда

		//	_ПроверяемоеЗначение = ПривестиЗначение(_ПроверяемоеЗначение, ТипЗнч(_Хранилище_ЭлементОтбора.Значение));
		//	
		//	_УсловиеВыполнено =  (_ПроверяемоеЗначение >= _Хранилище_ЭлементОтбора.ЗначениеС)
		//						И (_ПроверяемоеЗначение < _Хранилище_ЭлементОтбора.ЗначениеПо);
		//	
		//ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ИнтервалВключаяОкончание Тогда

		//	_ПроверяемоеЗначение = ПривестиЗначение(_ПроверяемоеЗначение, ТипЗнч(_Хранилище_ЭлементОтбора.Значение));
		//	
		//	_УсловиеВыполнено =  (_ПроверяемоеЗначение > _Хранилище_ЭлементОтбора.ЗначениеС)
		//						И (_ПроверяемоеЗначение <= _Хранилище_ЭлементОтбора.ЗначениеПо);
		//	
		//	
		//	
		//ПОДСТРОКА	
			
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит Тогда
			
			_УсловиеВыполнено =  Найти(_ПроверяемоеЗначение,_Хранилище_ЭлементОтбора.ПравоеЗначение) = 0;
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит Тогда

			_УсловиеВыполнено =  Найти(_ПроверяемоеЗначение, _Хранилище_ЭлементОтбора.ПравоеЗначение) > 0;
			
			
			
		//ИЕРАРХИЯ
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии
			ИЛИ _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
			
			Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(_ПроверяемоеЗначение)) Тогда
					
				_ИмяСправочника = _ПроверяемоеЗначение.Метаданные().Имя;
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	НужныйСправочник.Ссылка
				|ИЗ
				|	Справочник.Номенклатура КАК НужныйСправочник
				|ГДЕ
				|	НужныйСправочник.Ссылка = &ПроверяемоеЗначение
				|	И НужныйСправочник.Ссылка В ИЕРАРХИИ (&Группа)"
				;
				
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура", _ИмяСправочника);
				
				Запрос.УстановитьПараметр("ПроверяемоеЗначение", _ПроверяемоеЗначение);
				Запрос.УстановитьПараметр("Группа", _Хранилище_ЭлементОтбора.ПравоеЗначение);
				
				ТаблРезультат = Запрос.Выполнить().Выгрузить();
				_УсловиеВыполнено = ТаблРезультат.Количество() = 1;
			Иначе
				_УсловиеВыполнено = ЛОЖЬ;
			КонецЕсли;
			
			
		ИначеЕсли _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии
			ИЛИ _Хранилище_ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
			
			Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(_ПроверяемоеЗначение)) Тогда
					
				_ИмяСправочника = _ПроверяемоеЗначение.Метаданные().Имя;
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	НужныйСправочник.Ссылка
				|ИЗ
				|	Справочник.Номенклатура КАК НужныйСправочник
				|ГДЕ
				|	НужныйСправочник.Ссылка = &ПроверяемоеЗначение
				|	И НЕ НужныйСправочник.Ссылка В ИЕРАРХИИ (&Группа)"
				;
				
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура", _ИмяСправочника);
				
				Запрос.УстановитьПараметр("ПроверяемоеЗначение", _ПроверяемоеЗначение);
				Запрос.УстановитьПараметр("Группа", _Хранилище_ЭлементОтбора.ПравоеЗначение);
				
				ТаблРезультат = Запрос.Выполнить().Выгрузить();
				_УсловиеВыполнено = ТаблРезультат.Количество() = 1;
			Иначе
				_УсловиеВыполнено = ИСТИНА;
			КонецЕсли;
			
			
		КонецЕсли;
		
		_ПравилоДействует = _ПравилоДействует И _УсловиеВыполнено;
		
	КонецЦикла;
	
	Возврат _ПравилоДействует;

	// }}ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] -
	
КонецФункции

&НаСервере
Процедура ДобавитьУсловияОтбораЗначенийПараметра(ВхПостроительОтчета_ВхСхемаКомпоновки, ВхВариантИсполнения_Объект, Хранилище_УсловияОтбора)
		
	// {{ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] +        
		
	_Хранилище_УсловияОтбора_Отбор = Хранилище_УсловияОтбора.Получить();
	
	Если НЕ _Хранилище_УсловияОтбора_Отбор = Неопределено Тогда
		
		ВхСхемаКомпоновки_Отбор = ВхПостроительОтчета_ВхСхемаКомпоновки.НастройкиПоУмолчанию.Отбор;
		
		Для Каждого _Хранилище_ЭлементОтбора Из _Хранилище_УсловияОтбора_Отбор.Элементы Цикл
			
			Попытка
				
				_ЭлементОтбора = ВхПостроительОтчета_ВхСхемаКомпоновки.НастройкиПоУмолчанию.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(_ЭлементОтбора, _Хранилище_ЭлементОтбора);
				
			Исключение
				//отбор был настроен для другого типа значения параметра
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] -
	
КонецПроцедуры

&НаСервере
Функция РезультатКомпоновкиВТаблицу(ВхСхемаКомпоновки, ВхТабл_ЗначенияПростыхТипов)

	// {{ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] +        

	//////////////////// Получение настроек /////////////////////////////////////////////////////////
	
	//_НастройкиКомпоновки = _СхемаКомпоновки.НастройкиПоУмолчанию;
	
	_КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	_КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ВхСхемаКомпоновки));
	_КомпоновщикНастроек.ЗагрузитьНастройки(ВхСхемаКомпоновки.НастройкиПоУмолчанию);
	
	//================ ЭТОТ КОД ПО ИДЕЕ ПИСАТЬ НЕ НУЖНО, НО БЕЗ НЕГО НЕ РАБОТАЕТ ================================
	
	Для Каждого _ДоступноеПоле Из _КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
		
		Если НЕ _ДоступноеПоле.Папка Тогда
			
			_Поле = _КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			_Поле.Поле 			= _ДоступноеПоле.Поле;
			_Поле.Заголовок     = _ДоступноеПоле.Заголовок;
			_Поле.Использование = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	_Группировка = _КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	_АвтоПоле = _Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	_АвтоПоле.Использование = Истина;	
	
	//=============================================================================================================
	
	_НастройкиКомпоновки = _КомпоновщикНастроек.ПолучитьНастройки();
	
	/////////////////////////////////////////////////////////////////////////////////////////////////
	
	ВнешниеНаборыДанных = Неопределено;
	Если НЕ ВхТабл_ЗначенияПростыхТипов = Неопределено Тогда
		
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("табл_ЗначенияПростыхТипов", ВхТабл_ЗначенияПростыхТипов);
		
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ВхСхемаКомпоновки, _НастройкиКомпоновки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	Если ВнешниеНаборыДанных = Неопределено Тогда
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	Иначе
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
	КонецЕсли;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	табл_Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат табл_Результат;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] -
	
КонецФункции

&НаСервере
Функция ПривестиЗначение(ВхПроверяемоеЗначение, ВхНужныйТипЗначения)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] + 
	
	масс = Новый Массив;
	масс.Добавить(ВхНужныйТипЗначения);
	
	_ОписаниеТипов = Новый ОписаниеТипов(масс);
	
	Возврат _ОписаниеТипов.ПривестиЗначение(ВхПроверяемоеЗначение);
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] -
	
КонецФункции

&НаСервере
Функция глПустоеЗначение(ВхЗначение) Экспорт
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] + 
	
	// Сначала примитивные типы
	Если ВхЗначение = NULL 
		Тогда
		
		Возврат Истина;
		
	КонецЕсли;	

	ТипЗначения = ТипЗнч(ВхЗначение);

	Если ТипЗначения = Тип("Неопределено") Тогда
		
		Возврат ВхЗначение = Неопределено;
		
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		
		Возврат ПустаяСтрока(ВхЗначение);
		
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		
		Возврат ВхЗначение = 0;
		
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		
		Возврат Ложь; // Булево будем считать не пустым
		
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		
		Возврат ВхЗначение = '00010101'
			ИЛИ ВхЗначение = '00010101000000'; 
		
	ИначеЕсли ТипЗначения = Тип("СписокЗначений")
		ИЛИ ТипЗначения = Тип("Массив")
		ИЛИ ТипЗначения = Тип("ТаблицаЗначений")
		ИЛИ ТипЗначения = Тип("Структура")
		Тогда
		
		Возврат ВхЗначение.Количество() = 0;
		
	//Отдельное определение, так как конструкторов данного типа не существует	
	ИначеЕсли ТипЗначения = Тип("РежимПроведенияДокумента") Тогда
	
		Возврат НЕ ВхЗначение = РежимПроведенияДокумента.Неоперативный
				И НЕ ВхЗначение = РежимПроведенияДокумента.Оперативный;
		
	//Отдельное определение, так как конструкторов данного типа не существует	
	ИначеЕсли ТипЗначения = Тип("СтрокаДереваЗначений")
			ИЛИ ТипЗначения = Тип("СтрокаТаблицыЗначений")
			Тогда
			
			Возврат Ложь;
			
	//Отдельное определение, так как конструкторов данного типа не существует	
	ИначеЕсли ТипЗначения = Тип("МоментВремени")
			Тогда
			
			
			Возврат глПустоеЗначение(ВхЗначение.Дата) И глПустоеЗначение(ВхЗначение.Ссылка);
			
	// Для остальных будем считать значение пустым, если оно равно
	// дефолтному значению своего типа
	Иначе
		
		Попытка
			
			Возврат ВхЗначение = Новый(ТипЗначения);
			
		Исключение
			
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЕсли; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] -
	
КонецФункции // глПустоеЗначение()

&НаСервере
Функция глСпИзСтроки(ВхСтрока, ВхРазделитель = ",", ВхОписаниеТипаЗначенийСписка = Неопределено) Экспорт
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] + 
	
	// сформируем список значений
	_СписокЗначений  = Новый СписокЗначений;
	_ОстСтр = СокрЛП(ВхСтрока);

	_ДлинаРазделителя = СтрДлина(ВхРазделитель);
	
	Пока НЕ ПустаяСтрока(_ОстСтр) Цикл
		
		_Поз = Найти(_ОстСтр, ВхРазделитель); 
		Если _Поз = 0 Тогда
			_Элем   = _ОстСтр;
			_ОстСтр = "";
		Иначе
			_Элем   = Лев(_ОстСтр,  _Поз-1);
			_ОстСтр = Сред(_ОстСтр, _Поз + _ДлинаРазделителя);
		КонецЕсли;	
		
		_СписокЗначений.Добавить(СокрЛП(_Элем));
		
	КонецЦикла;
	
	Если ВхОписаниеТипаЗначенийСписка = Неопределено Тогда
	ИначеЕсли Лев(ВхОписаниеТипаЗначенийСписка, 13) = "Перечисление." Тогда
		
		_ИмяПеречисления = Сред(ВхОписаниеТипаЗначенийСписка, 14);
		Для Каждого _Элемент Из _СписокЗначений Цикл
			_Элемент.Значение = Перечисления[_ИмяПеречисления][_Элемент.Значение];
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение("глСпИзСтроки(): неподддерживаемое значение ВхОписаниеТипаЗначенийСписка - <" + ВхОписаниеТипаЗначенийСписка + ">");
		
	КонецЕсли;
	
	Возврат _СписокЗначений;

	// }}ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] -
	
КонецФункции      

&НаСервере
// Получает значение параметра ВИ.
// Вместо варианта исполнения понимает структуры
//   - глПолучитьСтруктуруПараметровВИ()
//   - глПолучитьСтруктуруПараметровВИ()
//
// Параметры:
//  ВхВариантИсп_Объект	 - ВИОбъект, структура	 - 
//  ВхПараметр			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция глПолучитьЗначениеПараметраВИ(ВхВариантИсп_Объект, ВхПараметр) Экспорт
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] + 
	
	Если глПустоеЗначение(ВхВариантИсп_Объект) Тогда
		//_ТекстОшибки = "Не указан ВИ";
		Возврат Неопределено;
	КонецЕсли;
	
	_БазовыйВИ = ВхВариантИсп_Объект;//?(ВхВариантИсп_Объект.ЭтоСлужебныйПолуфабрикат, ВхВариантИсп_Объект.БазовыйВариантИсполнения, ВхВариантИсп_Объект);
	
	Если ТипЗнч(ВхПараметр) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
		
		строка_ТЧПараметры = _БазовыйВИ.ДополнительныеРеквизиты.Найти(ВхПараметр, "Свойство");
		Если строка_ТЧПараметры = Неопределено Тогда
			//_ТекстОшибки = "Параметр отсутствует у ВИ";
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат строка_ТЧПараметры.Значение;
		
	ИначеЕсли ТипЗнч(ВхПараметр) = Тип("Строка") Тогда
		
		Если Лев(ВхПараметр, 8) = "Параметр" Тогда
			
			_Параметр = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду(Сред(ВхПараметр, 9, 3));
			Если _Параметр = Неопределено Тогда
				//_ТекстОшибки = "Ошибка идентификации параметра";
				Возврат Неопределено;
			КонецЕсли;
			
			строка_ТЧПараметры = _БазовыйВИ.ДополнительныеРеквизиты.Найти(_Параметр, "Свойство");
			Если строка_ТЧПараметры = Неопределено Тогда
				//_ТекстОшибки = "Параметр отсутствует у ВИ";
				Возврат Неопределено;
			КонецЕсли;
			
			Возврат строка_ТЧПараметры.Значение;
			
		Иначе
			
			_ИмяПараметра = СокрЛП(ВхПараметр);
			
			Попытка
				
				Возврат _БазовыйВИ[_ИмяПараметра];
				
			Исключение

				Возврат Неопределено;
				
			КонецПопытки
			
		КонецЕсли;
		
	Иначе
		
		//_ТекстОшибки = "Недопустимый тип";
		Возврат Неопределено;
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [03.04.2026] -
	
КонецФункции //
