
#Область СлужебныйПрограммныйИнтерфейс

// Функция получает массив правил трансляции по определенным назначениям, например ПодборСчетов.
// 
// Параметры:
//  Организация      - СправочникСсылка.Организации.
//  ДатаЗапроса      - Дата.
//  Назначения       - Структура.
//  РегистрИсточник  - СправочникСсылка.бит_ОбъектыСистемы.
//  РегистрПриемник  - СправочникСсылка.бит_ОбъектыСистемы.
// 
// Возвращаемое значение:
//   МассивПравил - Массив.
// 
Функция ПолучитьПравилаТрансляцииПоНазначению(Организация, ДатаЗапроса, Назначения, РегистрИсточник, РегистрПриемник)  Экспорт

	МассивНазначений = Новый Массив;
	Для каждого КиЗ Из Назначения Цикл
	
		МассивНазначений.Добавить(КиЗ.Значение);
	
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ДатаЗапроса",ДатаЗапроса);
	Запрос.УстановитьПараметр("ПустаяДата",Дата('00010101'));
	Запрос.УстановитьПараметр("МассивНазначений",МассивНазначений);
	Запрос.УстановитьПараметр("Источник",РегистрИсточник);
	Запрос.УстановитьПараметр("Приемник",РегистрПриемник);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	0 КАК Приоритет,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции КАК ПравилаТрансляции,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Источник КАК Источник,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Приемник КАК Приемник,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.Приоритет КАК ПриоритетПравилаТрансляции
	               |ПОМЕСТИТЬ ТаблицаПравилТрансляции
	               |ИЗ
	               |	РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(
	               |			&ДатаЗапроса,
	               |			(СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |				ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка))
	               |				И (ДатаОкончания > &ДатаЗапроса
	               |					ИЛИ ДатаОкончания = &ПустаяДата)
	               |				И Назначение В (&МассивНазначений)) КАК бит_НазначениеПравилТрансляцииСрезПоследних
	               |ГДЕ
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Источник = &Источник
	               |	И бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Приемник = &Приемник
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	1,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Источник,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Приемник,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.Приоритет
	               |ИЗ
	               |	РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(
	               |			&ДатаЗапроса,
	               |			СтруктурноеПодразделение В
	               |					(ВЫБРАТЬ
	               |						бит_ГруппыСтруктурныхПодразделенийСостав.Ссылка
	               |					ИЗ
	               |						Справочник.бит_ГруппыСтруктурныхПодразделений.Состав КАК бит_ГруппыСтруктурныхПодразделенийСостав
	               |					ГДЕ
	               |						бит_ГруппыСтруктурныхПодразделенийСостав.СтруктурноеПодразделение = &Организация)
	               |				И (ДатаОкончания > &ДатаЗапроса
	               |					ИЛИ ДатаОкончания = &ПустаяДата)
	               |				И Назначение В (&МассивНазначений)) КАК бит_НазначениеПравилТрансляцииСрезПоследних
	               |ГДЕ
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Источник = &Источник
	               |	И бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Приемник = &Приемник
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	2,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Источник,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Приемник,
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.Приоритет
	               |ИЗ
	               |	РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(
	               |			&ДатаЗапроса,
	               |			СтруктурноеПодразделение = &Организация
	               |				И (ДатаОкончания > &ДатаЗапроса
	               |					ИЛИ ДатаОкончания = &ПустаяДата)
	               |				И Назначение В (&МассивНазначений)) КАК бит_НазначениеПравилТрансляцииСрезПоследних
	               |ГДЕ
	               |	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Источник = &Источник
	               |	И бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Приемник = &Приемник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПравилТрансляции.ПравилаТрансляции
	               |ИЗ
	               |	ТаблицаПравилТрансляции КАК ТаблицаПравилТрансляции
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТаблицаПравилТрансляции.Приоритет,
	               |	ТаблицаПравилТрансляции.ПриоритетПравилаТрансляции
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТаблицаПравилТрансляции";


	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	МассивПравил = Новый Массив;
	Пока Выборка.Следующий() Цикл
	
	  МассивПравил.Добавить(Выборка.ПравилаТрансляции);	
	
	КонецЦикла; 
	
	Возврат МассивПравил;
	
КонецФункции // ПолучитьПравилаТрансляцииПоНазначению()

// Функция определяет, является ли контрагент собственным.
// 
// Параметры:
//   Контрагент - СправочникСсылка.Контрагенты.
// 
// Возвращаемое значение:
//  флСобственный - Булево.
// 
Функция ЭтоСобственныйКонтрагент(Контрагент)  Экспорт

	флСобственный = бит_ОбщегоНазначения.СобственныйКонтрагент(Контрагент);

	Возврат флСобственный;
	
КонецФункции // ЭтоСобственныйКонтрагент()

#КонецОбласти