
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СхемаКомпоновкиДанных 		= ТекущийОбъект.СхемаКомпоновкиДанных.Получить();
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	ТекущийИсточникДанных 		= Объект.ИсточникДанных;
	
	ЗагрузитьНастройкиВарианта(ТекущийОбъект.ВариантОтчета.Получить(), Ложь);
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	УстановитьЗаголовокИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СхемаКомпоновкиДанных") Тогда

		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(ВыбранноеЗначение, УникальныйИдентификатор);
		Модифицированность = Истина;
		
		ТекстСообщения = НСтр("ru='Загрузить стандартные настройки?';en='Upload default settings?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВыбораЗавершение", ЭтотОбъект), ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗагрузитьНастройкиВарианта("", Истина);
	Иначе
		ЗагрузитьНастройкиВарианта("", Ложь);
	КонецЕсли; 
 	ПоказатьВариантОтчета();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьСКД();
	
	ТекущийОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных));
	ВариантОтчета = ОбщегоНазначения.ЗначениеВСтрокуXML(КомпоновщикНастроек.ПолучитьНастройки());
	ТекущийОбъект.ВариантОтчета = Новый ХранилищеЗначения(ВариантОтчета, Новый СжатиеДанных(9));	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗагрузитьНастройкиВарианта(ТекущийОбъект.ВариантОтчета.Получить(), Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект, Элемент, Объект, "ИсточникДанных", 
		КэшЗначений.СписокТиповИсточникДанных, СтандартнаяОбработка);
								
КонецПроцедуры // ИсточникДанныхНачалоВыбора()

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	
	УстановитьЗаголовокИсточника();
	
	Если Объект.ИсточникДанных <> ТекущийИсточникДанных Тогда
		АдресСхемыКомпоновкиДанных = "";
		ПолучитьСКД();
	КонецЕсли; 
	
	ТекущийИсточникДанных = Объект.ИсточникДанных;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ИсточникДанных.ВыбиратьТип = Истина;
	
КонецПроцедуры // ИсточникДанныхОчистка()

&НаКлиенте
Процедура ЗаголовокОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработа = Ложь;
	
	ПараметрыФормы = Новый Структура("РедактируемыйТекст", Объект.ЗаголовокОтчета);
	
	Обработчик = Новый ОписаниеОповещения("ЗаголовокОтчетаНачалоВыбораЗавершение", ЭтотОбъект);
    Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
    ОткрытьФорму("ОбщаяФорма.бит_ФормаРедактированияТекстаНаРазныхЯзыках",ПараметрыФормы,,,,, Обработчик, Режим);
	
КонецПроцедуры // ЗаголовокОтчетаНачалоВыбора()

// Процедура обработчик оповещения "ЗаголовокОтчетаНачалоВыбораЗавершение".
// 
// Параметры:
// Результат - Строка.
// Параметры - Структура.
// 
&НаКлиенте
Процедура ЗаголовокОтчетаНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда 	
		Объект.ЗаголовокОтчета = Результат;
		Модифицированность 	   = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастроек(Элемент)
	
	НастройкиТекущейСтрокиИзменены = Истина;
	Модифицированность = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЛокальныеВыбранныеПоляПриИзменении(Элемент)
	
	Если ЛокальныеВыбранныеПоля Тогда
		
		Элементы.СтраницыПолейВыбора.ТекущаяСтраница = Элементы.НастройкиВыбранныхПолей;
			
	Иначе
		
		Элементы.СтраницыПолейВыбора.ТекущаяСтраница = Элементы.ОтключенныеНастройкиВыбранныхПолей;

		ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.Структура.ТекущаяСтрока);
		КомпоновщикНастроек.Настройки.ОчиститьВыборЭлемента(ЭлементСтруктуры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКОтчету(Элемент)
	
	ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.Структура.ТекущаяСтрока);
	НастройкиЭлемента =  КомпоновщикНастроек.Настройки.НастройкиЭлемента(ЭлементСтруктуры);
	Элементы.Структура.ТекущаяСтрока = КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(НастройкиЭлемента);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛокальныйОтборПриИзменении(Элемент)
	
	Если ЛокальныйОтбор Тогда
		
		Элементы.СтраницыОтбора.ТекущаяСтраница = Элементы.НастройкиОтбора;
			
	Иначе
		
		Элементы.СтраницыОтбора.ТекущаяСтраница = Элементы.ОтключенныеНастройкиОтбора;

		ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.Структура.ТекущаяСтрока);
		КомпоновщикНастроек.Настройки.ОчиститьОтборЭлемента(ЭлементСтруктуры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛокальныйПорядокПриИзменении(Элемент)
	
	Если ЛокальныйПорядок Тогда
		
		Элементы.СтраницыПорядка.ТекущаяСтраница = Элементы.НастройкиПорядка;
					
	Иначе
		
		Элементы.СтраницыПорядка.ТекущаяСтраница = Элементы.ОтключенныеНастройкиПорядка;
					
		ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.Структура.ТекущаяСтрока);
		КомпоновщикНастроек.Настройки.ОчиститьПорядокЭлемента(ЭлементСтруктуры);
		
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ЛокальноеУсловноеОформлениеПриИзменении(Элемент)

	Если ЛокальноеУсловноеОформление Тогда
		
		Элементы.СтраницыУсловногоОформления.ТекущаяСтраница = Элементы.НастройкиУсловногоОформления;
					
	Иначе
		
		Элементы.СтраницыУсловногоОформления.ТекущаяСтраница = Элементы.ОтключенныеНастройкиУсловногоОформления;
					
		ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.Структура.ТекущаяСтрока);
		КомпоновщикНастроек.Настройки.ОчиститьУсловноеОформлениеЭлемента(ЭлементСтруктуры);
					
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ЛокальныеПараметрыВыводаПриИзменении(Элемент)
	
	Если ЛокальныеПараметрыВывода Тогда
		
		Элементы.СтраницыПараметровВывода.ТекущаяСтраница = Элементы.НастройкиПараметровВывода;
					
	Иначе
		
		Элементы.СтраницыПараметровВывода.ТекущаяСтраница = Элементы.ОтключенныеНастройкиПараметровВывода;
					
		ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.Структура.ТекущаяСтрока);
		КомпоновщикНастроек.Настройки.ОчиститьПараметрыВыводаЭлемента(ЭлементСтруктуры);
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметры

&НаКлиенте
Процедура ПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		ТекущиеДанные = Элементы.Параметры.ТекущиеДанные;
		ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровПроизвольныхОтчетов.ТекстНаРазныхЯзыках");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработа = Ложь;
	
	ТекущиеДанные = Элементы.Параметры.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура("РедактируемыйТекст", ТекущиеДанные.Значение); 
	
	Обработчик = Новый ОписаниеОповещения("ПараметрыЗначениеНачалоВыбораЗавершение", ЭтотОбъект, ТекущиеДанные);
    Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
    ОткрытьФорму("ОбщаяФорма.бит_ФормаРедактированияТекстаНаРазныхЯзыках",ПараметрыФормы,,,,, Обработчик, Режим);

КонецПроцедуры // ПараметрыЗначениеНачалоВыбора()

// Процедура обработчик оповещения "ПараметрыЗначениеНачалоВыбораЗавершение".
// 
// Параметры:
// Результат - Строка.
// ТекущиеДанные - Текущие данные строки таблицы Параметры.
// 
&НаКлиенте
Процедура ПараметрыЗначениеНачалоВыбораЗавершение(Результат, ТекущиеДанные) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда	
		ТекущиеДанные.Значение = Результат;
		Модифицированность 	   = Истина;
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтруктура

&НаКлиенте
Процедура СтруктураПриАктивизацииСтроки(Элемент)
	
	ЭлементСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.Структура.ТекущаяСтрока);
	ТипЭлемента = ТипЗнч(ЭлементСтруктуры); 
	
	Если ТипЭлемента = Неопределено  
		ИЛИ ТипЭлемента = Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных") 
		ИЛИ ТипЭлемента = Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных") Тогда
		 
		ПоляГруппировкиНедоступны();
		ВыбранныеПоляНедоступны();
		ОтборНедоступен();
		ПорядокНедоступен();
		УсловноеОформлениеНедоступно();
		ПараметрыВыводаНедоступны();
		
	ИначеЕсли ТипЭлемента = Тип("НастройкиКомпоновкиДанных") 
		ИЛИ ТипЭлемента = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		
		ПоляГруппировкиНедоступны();
		
		ЛокальныеВыбранныеПоля = Истина;
		Элементы.ЛокальныеВыбранныеПоля.ТолькоПросмотр = Истина;
		Элементы.СтраницыПолейВыбора.ТекущаяСтраница = Элементы.НастройкиВыбранныхПолей;
		
		ЛокальныйОтбор = Истина;
		Элементы.ЛокальныйОтбор.ТолькоПросмотр = Истина;
		Элементы.СтраницыОтбора.ТекущаяСтраница = Элементы.НастройкиОтбора;
		
		ЛокальныйПорядок = Истина;
		Элементы.ЛокальныйПорядок.ТолькоПросмотр = Истина;
		Элементы.СтраницыПорядка.ТекущаяСтраница = Элементы.НастройкиПорядка;
		
		ЛокальноеУсловноеОформление = Истина;
		Элементы.ЛокальноеУсловноеОформление.ТолькоПросмотр = Истина;
		Элементы.СтраницыУсловногоОформления.ТекущаяСтраница = Элементы.НастройкиУсловногоОформления;
		
		ЛокальныеПараметрыВывода = Истина;
		Элементы.ЛокальныеПараметрыВывода.ТолькоПросмотр = Истина;
		Элементы.СтраницыПараметровВывода.ТекущаяСтраница = Элементы.НастройкиПараметровВывода;
		
	ИначеЕсли ТипЭлемента = Тип("ГруппировкаКомпоновкиДанных") 
		ИЛИ ТипЭлемента = Тип("ГруппировкаТаблицыКомпоновкиДанных") 
		ИЛИ ТипЭлемента = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		 
		Элементы.СтраницыПолейГруппировки.ТекущаяСтраница = Элементы.НастройкиПолейГруппировки;
			
		ВыбранныеПоляДоступны(ЭлементСтруктуры);
		ОтборДоступен(ЭлементСтруктуры);
		ПорядокДоступен(ЭлементСтруктуры);
		УсловноеОформлениеДоступно(ЭлементСтруктуры);
		ПараметрыВыводаДоступны(ЭлементСтруктуры);
		
	ИначеЕсли ТипЭлемента = Тип("ТаблицаКомпоновкиДанных") 
		ИЛИ ТипЭлемента = Тип("ДиаграммаКомпоновкиДанных") Тогда
		
		ПоляГруппировкиНедоступны();
		ВыбранныеПоляДоступны(ЭлементСтруктуры);
		ОтборНедоступен();
		ПорядокНедоступен();
		УсловноеОформлениеДоступно(ЭлементСтруктуры);
		ПараметрыВыводаДоступны(ЭлементСтруктуры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураПриАктивизацииПоля(Элемент)
		
	Перем ВыбраннаяСтраница;
	
	Если Элементы.Структура.ТекущийЭлемент.Имя = "СтруктураНаличиеВыбора" Тогда
		
		ВыбраннаяСтраница = Элементы.СтраницаПолейВыбора;
		
	ИначеЕсли Элементы.Структура.ТекущийЭлемент.Имя = "СтруктураНаличиеОтбора" Тогда
		
		ВыбраннаяСтраница = Элементы.СтраницаОтбора;
		
	ИначеЕсли Элементы.Структура.ТекущийЭлемент.Имя = "СтруктураНаличиеПорядка" Тогда
		
		ВыбраннаяСтраница = Элементы.СтраницаПорядка;
		
	ИначеЕсли Элементы.Структура.ТекущийЭлемент.Имя = "СтруктураНаличиеУсловногоОформления" Тогда
		
		ВыбраннаяСтраница = Элементы.СтраницаУсловногоОформления;
		
	ИначеЕсли Элементы.Структура.ТекущийЭлемент.Имя = "СтруктураНаличиеПараметровВывода" Тогда
		
		ВыбраннаяСтраница = Элементы.СтраницаПараметровВывода;
		
	КонецЕсли;
	
	Если ВыбраннаяСтраница <> Неопределено Тогда
		
		Элементы.СтраницыНастроек.ТекущаяСтраница = ВыбраннаяСтраница;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СхемаКомпоновкиОткрыть(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных;
		ПолучитьСКД();
		Конструктор.УстановитьСхему(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных));
		Конструктор.Редактировать(ЭтотОбъект);
	#Иначе
		ПоказатьПредупреждение(,НСтр("ru='Конструктор схемы компоновки данных можно открыть только в толстом клиенте. В тонком клиенте и веб клиенте редактирование схемы компоновки данных не поддерживается.';
									 |en='Designer pattern layout data can only be opened in the thick client. In a thin client and a web client data editing pattern layout is not supported.'"));
	#КонецЕсли
		
КонецПроцедуры
 
&НаКлиенте
Процедура СхемаКомпоновкиЗаполнитьПлоскаяТаблица(Команда)
	
	Оповещение = Новый ОписаниеОповещения("СхемаКомпоновкиЗаполнитьПлоскаяТаблицаЗавершение", ЭтотОбъект);
	Если ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда
		ТекстВопроса = НСтр("ru='Схема компоновки данных будет обновлена. Продолжить?';
						 	|en='The circuit layout data will be updated. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
			
КонецПроцедуры // СхемаКомпоновкиЗаполнитьПлоскаяТаблица()

// Процедура обработчик оповещения "СхемаКомпоновкиЗаполнитьПлоскаяТаблицаЗавершение".
// 
// Параметры:
// Ответ - КодВозвратаДиалога.
// ДополнительныеПараметры - Структура.
// 
&НаКлиенте
Процедура СхемаКомпоновкиЗаполнитьПлоскаяТаблицаЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПолучитьСКД("ПлоскаяТаблица");
		Модифицированность = Истина;
		ПоказатьВариантОтчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаКомпоновкиЗаполнитьИерархияЭлементовДанных(Команда)
	
	Если ТипЗнч(Объект.ИсточникДанных) <> Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных") Тогда
		ТекстСообщения = НСтр("ru='Иерархический способ заполнения доступен только при использовании компоновки источников данных.';
							  |en='The hierarchical method of filling is only available when using the layout data sources.'");
		ПоказатьПредупреждение(,ТекстСообщения, 15);
	Иначе
		Оповещение = Новый ОписаниеОповещения("СхемаКомпоновкиЗаполнитьИерархияЭлементовДанныхЗавершение", ЭтотОбъект);
		Если ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда
			ТекстВопроса = НСтр("ru='Схема компоновки данных будет обновлена. Продолжить?';
								|en='The circuit layout data will be updated. Continue?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет);
		Иначе
			ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик оповещения "СхемаКомпоновкиЗаполнитьИерархияЭлементовДанныхЗавершение".
// 
// Параметры:
// Ответ - КодВозвратаДиалога.
// ДополнительныеПараметры - Структура.
// 
&НаКлиенте
Процедура СхемаКомпоновкиЗаполнитьИерархияЭлементовДанныхЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПолучитьСКД("ИерархияЭлементовДанных");
		Модифицированность = Истина;
		ПоказатьВариантОтчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаКомпоновкиОчистить(Команда)
	
	АдресСхемыКомпоновкиДанных = "";
	ЗагрузитьНастройкиВарианта("", Ложь);
	
КонецПроцедуры // СхемаКомпоновкиОчистить()

&НаКлиенте
Процедура ЗаполнитьПараметры(Команда)
	
	ЗаполнитьЗаголовкиПолейНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СформироватьУниверсальныйОтчет(Команда)

	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		ПредложитьЗаписатьОбъект(Новый Структура("Команда", Команда));
	Иначе
		СформироватьУниверсальныйОтчет(Команда);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУниверсальныйОтчет(Команда)

	Для каждого СтрокаТаблицы Из КомандыВариантовОтчета Цикл
		Если СтрокаТаблицы.ИмяКоманды = Команда.Имя Тогда
			ПараметрыФормы = Новый Структура("Ключ", СтрокаТаблицы.ВариантОтчета);
			Если СтрокаТаблицы.ПредопределенныйВариант Тогда
				ПараметрыФормы.Вставить("НастройкаОтчета", Объект.Ссылка);
			КонецЕсли;
			ОткрытьФорму("Справочник.ВариантыОтчетов.ФормаОбъекта", ПараметрыФормы,, СтрокаТаблицы.ВариантОтчета);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьВариантОтчета()

	Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.СтраницаВарианта;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСхемуКомпоновкиДанныхВКомпоновщикНастроек(ЗагружатьНастройкиПоУмолчанию)
	
	Если АдресСхемыКомпоновкиДанных <> "" Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	Иначе
		СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
		АдресНовойСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресНовойСхемыКомпоновкиДанных));
	КонецЕсли;
	
	Если ЗагружатьНастройкиПоУмолчанию Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиВарианта(Знач ВариантОтчета, Знач ЗагружатьНастройкиПоУмолчанию)
	
	Если АдресСхемыКомпоновкиДанных <> "" Тогда
		ЗагрузитьСхемуКомпоновкиДанныхВКомпоновщикНастроек(ЗагружатьНастройкиПоУмолчанию);
		Если ВариантОтчета <> "" И ВариантОтчета <> Неопределено Тогда
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(ВариантОтчета);
			Настройки = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("НастройкиКомпоновкиДанных"));
			КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		КонецЕсли;
	Иначе
		ЗагрузитьСхемуКомпоновкиДанныхВКомпоновщикНастроек(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляГруппировкиНедоступны()
	
	Элементы.СтраницыПолейГруппировки.ТекущаяСтраница = Элементы.НедоступныеНастройкиПолейГруппировки;
					
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляДоступны(ЭлементСтруктуры)
	
	Если КомпоновщикНастроек.Настройки.НаличиеВыбораУЭлемента(ЭлементСтруктуры) Тогда
				
		ЛокальныеВыбранныеПоля = Истина;
		Элементы.СтраницыПолейВыбора.ТекущаяСтраница = Элементы.НастройкиВыбранныхПолей;
			
	Иначе
			
		ЛокальныеВыбранныеПоля = Ложь;
		Элементы.СтраницыПолейВыбора.ТекущаяСтраница = Элементы.ОтключенныеНастройкиВыбранныхПолей;
			
	КонецЕсли;
		
	Элементы.ЛокальныеВыбранныеПоля.ТолькоПросмотр = Ложь;
					
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляНедоступны()
	
	ЛокальныеВыбранныеПоля = Ложь;
	Элементы.ЛокальныеВыбранныеПоля.ТолькоПросмотр = Истина;
	Элементы.СтраницыПолейВыбора.ТекущаяСтраница = Элементы.НедоступныеНастройкиВыбранныхПолей;
					
КонецПроцедуры

&НаКлиенте
Процедура ОтборДоступен(ЭлементСтруктуры)
	
	Если КомпоновщикНастроек.Настройки.НаличиеОтбораУЭлемента(ЭлементСтруктуры) Тогда
		
		ЛокальныйОтбор = Истина;
		Элементы.СтраницыОтбора.ТекущаяСтраница = Элементы.НастройкиОтбора;
			
	Иначе
		
		ЛокальныйОтбор = Ложь;
		Элементы.СтраницыОтбора.ТекущаяСтраница = Элементы.ОтключенныеНастройкиОтбора;
			
	КонецЕсли;
			
	Элементы.ЛокальныйОтбор.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНедоступен()
	
	ЛокальныйОтбор = Ложь;
	Элементы.ЛокальныйОтбор.ТолькоПросмотр = Истина;
	Элементы.СтраницыОтбора.ТекущаяСтраница = Элементы.НедоступныеНастройкиОтбора;
		
КонецПроцедуры

&НаКлиенте
Процедура ПорядокДоступен(ЭлементСтруктуры)
	
	Если КомпоновщикНастроек.Настройки.НаличиеПорядкаУЭлемента(ЭлементСтруктуры) Тогда
		
		ЛокальныйПорядок = Истина;
		Элементы.СтраницыПорядка.ТекущаяСтраница = Элементы.НастройкиПорядка;
					
	Иначе
		
		ЛокальныйПорядок = Ложь;
		Элементы.СтраницыПорядка.ТекущаяСтраница = Элементы.ОтключенныеНастройкиПорядка;
					
	КонецЕсли;
			
	Элементы.ЛокальныйПорядок.ТолькоПросмотр = Ложь;
		
КонецПроцедуры

&НаКлиенте
Процедура ПорядокНедоступен()
	
	ЛокальныйПорядок = Ложь;
	Элементы.ЛокальныйПорядок.ТолькоПросмотр = Истина;
	Элементы.СтраницыПорядка.ТекущаяСтраница = Элементы.НедоступныеНастройкиПорядка;
		
КонецПроцедуры

&НаКлиенте
Процедура УсловноеОформлениеДоступно(ЭлементСтруктуры)
	
	Если КомпоновщикНастроек.Настройки.НаличиеУсловногоОформленияУЭлемента(ЭлементСтруктуры) Тогда
		
		ЛокальноеУсловноеОформление = Истина;
		Элементы.СтраницыУсловногоОформления.ТекущаяСтраница = Элементы.НастройкиУсловногоОформления;
					
	Иначе
		
		ЛокальноеУсловноеОформление = Ложь;
		Элементы.СтраницыУсловногоОформления.ТекущаяСтраница = Элементы.ОтключенныеНастройкиУсловногоОформления;
					
	КонецЕсли;
			
	Элементы.ЛокальноеУсловноеОформление.ТолькоПросмотр = Ложь;
		
КонецПроцедуры

&НаКлиенте
Процедура УсловноеОформлениеНедоступно()
	
	ЛокальноеУсловноеОформление = Ложь;
	Элементы.ЛокальноеУсловноеОформление.ТолькоПросмотр = Истина;
	Элементы.СтраницыУсловногоОформления.ТекущаяСтраница = Элементы.НедоступныеНастройкиУсловногоОформления;
		
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВыводаДоступны(ЭлементСтруктуры)
	
	Если КомпоновщикНастроек.Настройки.НаличиеПараметровВыводаУЭлемента(ЭлементСтруктуры) Тогда
		
		ЛокальныеПараметрыВывода = Истина;
		Элементы.СтраницыПараметровВывода.ТекущаяСтраница = Элементы.НастройкиПараметровВывода;
					
	Иначе
		
		ЛокальныеПараметрыВывода = Ложь;
		Элементы.СтраницыПараметровВывода.ТекущаяСтраница = Элементы.ОтключенныеНастройкиПараметровВывода;
					
	КонецЕсли;
			
	Элементы.ЛокальныеПараметрыВывода.ТолькоПросмотр = Ложь;
		
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВыводаНедоступны()
	
	ЛокальныеПараметрыВывода = Ложь;
	Элементы.ЛокальныеПараметрыВывода.ТолькоПросмотр = Истина;
	Элементы.СтраницыПараметровВывода.ТекущаяСтраница = Элементы.НедоступныеНастройкиПараметровВывода;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	КэшЗначений = Новый Структура;
	
	// Заполним список типов для быстрого выбора составного.
	МассивТипов  = Метаданные.Обработки.бит_ПолучениеДанныхРегистровБухгалтерии.Реквизиты.ИсточникДанных.Тип.Типы();
	СписокВыбора = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	КэшЗначений.Вставить("СписокТиповИсточникДанных", СписокВыбора);
		
КонецПроцедуры

// Устанавливает заголовок элемента "ИсточникДанных".
// 
&НаСервере
Процедура УстановитьЗаголовокИсточника()

	Элементы.ИсточникДанных.Заголовок = ?(ТипЗнч(Объект.ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных")
											, НСтр("ru='Источник данных';en='Data Source'")
											, НСтр("ru='Способ компоновки';en='Composition Method'")); 
											
КонецПроцедуры

&НаСервере
Процедура ПолучитьСКД(Знач СпособЗаполнения = Неопределено)

	СКД = Неопределено;
	Если ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) И СпособЗаполнения = Неопределено Тогда
		СКД = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		ЗагрузитьНастройки = Ложь;
	Иначе
		ПараметрыЗаполнения = Новый Структура("ИсточникДанных, Наименование");
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, Объект);

		СКД = Справочники.бит_НастройкиОтчетов.ЗаполнитьСхемуКомпоновки(ПараметрыЗаполнения,  СпособЗаполнения);
		ЗагрузитьНастройки = Истина;
	КонецЕсли;

	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
	Если ЗагрузитьНастройки Тогда
		ЗагрузитьНастройкиВарианта("", Истина);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПараметрыМакетовСхемы(ТекущаяСхема)

	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("Параметр");
	
	Для каждого МакетСхемы Из ТекущаяСхема.Макеты Цикл
		Для каждого СтрокаТаблицыОбласти Из МакетСхемы.Макет Цикл
			Для каждого ЯчейкаТаблицыОбласти Из СтрокаТаблицыОбласти.Ячейки Цикл
				Для каждого ПолеОбластиКд Из ЯчейкаТаблицыОбласти.Элементы Цикл
					
					// Значение поля области компоновки данных     						
					ЗначениеПоля = ПолеОбластиКд.Значение;
					// Если тип значения = Строка, то нужно подставить заголовки.
					Если ТипЗнч(ЗначениеПоля) = Тип("Строка") Тогда
						
						// Поиск вхождений параметров для замены: [ИмяПараметра].
						МассивСтрПарам = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(ЗначениеПоля, "[");
						Для каждого СтрокаПоиска Из МассивСтрПарам Цикл
							
							ПозицияЗакрытия = Найти(СтрокаПоиска, "]");
							Если ПозицияЗакрытия = 0 Тогда
								Продолжить;
							Иначе	
								СтрокаПараметр = Лев(СтрокаПоиска, ПозицияЗакрытия-1);
								Если ЗначениеЗаполнено(СтрокаПараметр) Тогда
								 	НоваяСтрока = ТаблицаПараметров.Добавить();
									НоваяСтрока.Параметр = СтрокаПараметр;
								КонецЕсли;  									
							КонецЕсли;
						
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;		
			КонецЦикла;			
		КонецЦикла; 		
	КонецЦикла;
	
	Если ТаблицаПараметров.Количество() = 0 Тогда
		ПараметрыМакетов = Новый Массив;
	Иначе
		ТаблицаПараметров.Свернуть("Параметр");
		ТаблицаПараметров.Сортировать("Параметр");
		ПараметрыМакетов = ТаблицаПараметров.ВыгрузитьКолонку("Параметр");
	КонецЕсли;

	Возврат ПараметрыМакетов;
	
КонецФункции

&НаСервере
Процедура ДобавитьПараметр(ИмяПараметра, Значение)

	НоваяСтрока = Объект.Параметры.Добавить();
	НоваяСтрока.Параметр     = ИмяПараметра;
	НоваяСтрока.ВидПараметра = Перечисления.бит_ВидыПараметровПроизвольныхОтчетов.ТекстНаРазныхЯзыках;
	НоваяСтрока.Значение     = Значение;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовкиПолейНаСервере()
	
	СхемыКомпоновки = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	Если СхемыКомпоновки = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.Параметры.Очистить();
	
	Добавленные = Новый Соответствие;

	Для каждого НаборДанных Из СхемыКомпоновки.НаборыДанных Цикл
		ПоляНабораДанных = НаборДанных.Поля;
		Для каждого ПолеНабора Из ПоляНабораДанных Цикл
			Если Добавленные.Получить(ПолеНабора.Поле) = Неопределено Тогда
				ЗаголовокПоля = "";
				Если ЗначениеЗаполнено(ПолеНабора.Заголовок) Тогда
					ЗаголовокПоля = СтрШаблон("ru = ""%1""", ПолеНабора.Заголовок);
				КонецЕсли;
				Добавленные.Вставить(ПолеНабора.Поле, ЗаголовокПоля);
				ДобавитьПараметр(СокрЛП(ПолеНабора.Поле), ЗаголовокПоля);   		
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	ПараметрыМакетов = ПараметрыМакетовСхемы(СхемыКомпоновки);
	Для каждого ИмяПараметра Из ПараметрыМакетов Цикл   		
		Если Добавленные.Получить(ИмяПараметра) = Неопределено Тогда
			ЗаголовокПоля = "";
			Добавленные.Вставить(ИмяПараметра, ЗаголовокПоля);
			ДобавитьПараметр(ИмяПараметра, ЗаголовокПоля);   		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗаполнитьКэшЗначений();
	ОбновитьКнопкиВариантовОтчета();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомандыВариантовОтчета()

	КомандыВариантовОтчета.Очистить();
	
	ПредопределенныйВариант = Справочники.бит_НастройкиОтчетов.ПредопределенныйВариант();
	КлючОтчета				= Метаданные.Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.ПолноеИмя();
	ИдентификаторОтчета 	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторОтчета", ИдентификаторОтчета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВариантыОтчетов.Ссылка КАК Ссылка,
	|	ВариантыОтчетов.Настройки КАК Настройки,
	|	ВариантыОтчетов.КлючВарианта КАК КлючВарианта,
	|	ВариантыОтчетов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО ВариантыОтчетов.Отчет = ИдентификаторыОбъектовМетаданных.Ссылка
	|			И (ИдентификаторыОбъектовМетаданных.Ссылка = &ИдентификаторОтчета)
	|ГДЕ
	|	НЕ ВариантыОтчетов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Настройка = ХранилищаНастроек.ХранилищеВариантовОтчетов.Загрузить(КлючОтчета, Выборка.КлючВарианта);
		Если ТипЗнч(Настройка) = Тип("НастройкиКомпоновкиДанных") Тогда
			ЗначениеПараметра = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(Настройка, "НастройкаОтчета");
			
			Если ЗначениеПараметра <> Неопределено И ЗначениеПараметра.Значение = Объект.Ссылка Тогда
				КонтрольнаяСумма = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Выборка.Ссылка);
				НоваяСтрока = КомандыВариантовОтчета.Добавить();
				НоваяСтрока.ИмяКоманды	  = "Подключаемый_СформироватьУниверсальныйОтчет" + КонтрольнаяСумма;
				НоваяСтрока.ВариантОтчета = Выборка.Ссылка;
				НоваяСтрока.Заголовок	  = Выборка.Наименование;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(КомандыВариантовОтчета) Тогда
		КонтрольнаяСумма = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ПредопределенныйВариант);
		НоваяСтрока = КомандыВариантовОтчета.Добавить();
		НоваяСтрока.ИмяКоманды	  			= "Подключаемый_СформироватьУниверсальныйОтчет" + КонтрольнаяСумма;
		НоваяСтрока.ВариантОтчета 			= ПредопределенныйВариант;
		НоваяСтрока.Заголовок	  			= НСтр("ru = 'Сформировать отчет'; en = 'Generate Report'");
		НоваяСтрока.ПредопределенныйВариант = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьКнопкиВариантовОтчета()

	Для каждого СтрокаТаблицы Из КомандыВариантовОтчета Цикл
		КомандаФормы = Команды.Найти(СтрокаТаблицы.ИмяКоманды);
		Если КомандаФормы <> Неопределено Тогда
			Команды.Удалить(КомандаФормы);		
		КонецЕсли;
		КнопкаФормы = Элементы.Найти(СтрокаТаблицы.ИмяКоманды); 
		Если КнопкаФормы <> Неопределено Тогда
			Элементы.Удалить(КнопкаФормы);		
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьКомандыВариантовОтчета();
	
	Если НЕ ЗначениеЗаполнено(КомандыВариантовОтчета) Тогда
		Возврат;
	КонецЕсли;
	
	РазмещениеКоманд = "";
	Если КомандыВариантовОтчета.Количество() = 1  Тогда
		РазмещениеКоманд = Элементы.ГруппаВариантыОтчета;
		КартинкаКнопки	 = БиблиотекаКартинок.СформироватьОтчет;
	Иначе	
		РазмещениеКоманд = Элементы.ПодменюВариантыОтчета;
		КартинкаКнопки	 = Новый Картинка;
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из КомандыВариантовОтчета Цикл
		КомандаФормы = Команды.Добавить(СтрокаТаблицы.ИмяКоманды);
		КомандаФормы.Действие  = "Подключаемый_СформироватьУниверсальныйОтчет";
		КомандаФормы.Заголовок = СтрокаТаблицы.Заголовок ;
		
		КнопкаФормы = Элементы.Добавить(СтрокаТаблицы.ИмяКоманды, Тип("КнопкаФормы"), РазмещениеКоманд); 
		КнопкаФормы.ИмяКоманды 	= СтрокаТаблицы.ИмяКоманды;
		КнопкаФормы.Картинка   	= КартинкаКнопки;
		КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаписатьОбъект(ПараметрыКоманды)

	ТекстСообщения = НСтр("ru = 'Данные еще не записаны.
                           |Сформировать отчет можно только после записи данных.
                           |Записать данные?'; 
						   |en = 'The data has not been recorded yet.
                           |You can generate a report only after recording the data.
                           |Write down the data?'");
	
	Оповещение = Новый ОписаниеОповещения("ПредложитьЗаписатьОбъектЗавершение", ЭтотОбъект, ПараметрыКоманды);
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПредложитьЗаписатьОбъектЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() Тогда
			Попытка
				Записать();		
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось записать справочник по причине: %1.'; 
									|en = 'The directory could not be recorded for the reason: %1.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ВызватьИсключение ТекстСообщения;
			КонецПопытки;
			СформироватьУниверсальныйОтчет(Дополнительно.Команда);
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

