#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область НачальноеЗаполнениеДанных

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	// ++ ЕРП 
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "Организации_ЦФО";
	Элемент.Наименование					   = НСтр("ru = 'Организации --> ЦФО'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код								   = "Организации_ЦФО";
	Элемент.Соотношение						   = Перечисления.бит_ВидыСоотношенийАналитик.ОдинКОдному;
	Элемент.Приоритет						   = 0;
	Элемент.ЛеваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Организации;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "СтатьиДДС_СтатьиОборотов";
	Элемент.Наименование 					   = НСтр("ru = 'Статьи ДДС --> Cтатьи оборотов'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтатьиДДС_СтатьиОборотов";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьиДвиженияДенежныхСредств;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных		   = "СтатьиДоходов_СтатьиОборотов";
	Элемент.Наименование					   = НСтр("ru = 'Статьи прочих доходов --> Статьи оборотов'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтатьиПрочихДоходов_СтатьиОборотов";
	// АПК:1297-вкл.
	Элемент.Соотношение						   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяДоходов;
	Элемент.ЛеваяАналитика_2				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.НаправлениеДеятельности;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "СтатьиРасходов_СтатьиОборотов";
	Элемент.Наименование 					   = НСтр("ru = 'Статьи расходов --> статьи оборотов'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтатьиРасходов_СтатьиОборотов";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяРасходов;
	Элемент.ЛеваяАналитика_2 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ПрочиеРасходы;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "СтруктураПредприятия_ЦФО";
	Элемент.Наименование 					   = НСтр("ru = 'Структура предприятия --> ЦФО'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтруктураПредприятия_ЦФО";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтруктураПредприятия;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "ЦФО_Организации";
	Элемент.Наименование 					   = НСтр("ru = 'ЦФО --> Организации'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "ЦФО_Организации";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Организации;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "СтатьиПрочихРасходовСтатьиОборотов";
	Элемент.Наименование 					   = НСтр("ru = 'Статьи прочих расходов --> Статьи оборотов'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтатьиПрочихРасходов_СтатьиОборотов";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ПрочиеДоходыИРасходы;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "СтатьиОборотовБДР_СтатьиОборотовБДДС";
	Элемент.Наименование 					   = НСтр("ru = 'Статьи оборотов БДР --> Статьи оборотов БДДС'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтатьиОборотовБДР_СтатьиОборотовБДДС";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;
	// -- ЕРП 
	
КонецПроцедуры

// См. бит_ОбновлениеИнформационнойБазыБФ.ПередОбновлениемИнформационнойБазы().
//
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

#КонецОбласти

// Функция возвращает максимальное количество аналитик, используемое в соответствии.
// 
// Возвращаемое значение:
//  Результат - Число.
// 
Функция МаксКоличествоАналитик() Экспорт

	Возврат 3;
	
КонецФункции // МаксКоличествоАналитик()

// Функция возвращает список имен, зарезервированных для фиксированных соответствий.
// 
// Возвращаемое значение:
//  Имена - Строка.
// 
Функция ЗарезервированныеИмена() Экспорт
	
	Имена = Новый СписокЗначений;
	
	флЕстьРегистр = ?(НЕ Метаданные.РегистрыСведений.Найти("бит_СтатьиОборотов_СтатьиРегл") = Неопределено, Истина, Ложь);
	
	Если флЕстьРегистр Тогда
		Имена.Добавить("Статьи_СтатьиРегл");
	КонецЕсли; 
	
	флЕстьРегистр = ?(НЕ Метаданные.РегистрыСведений.Найти("бит_СтатьиОборотов_НоменклатурныеГруппы") = Неопределено, Истина, Ложь);
	
	Если флЕстьРегистр Тогда
		Имена.Добавить("Статьи_НоменклатурныеГруппы");
	КонецЕсли; 
	
	флЕстьРегистр = ?(НЕ Метаданные.РегистрыСведений.Найти("бит_ЦФО_Подразделения") = Неопределено, Истина, Ложь);		
	
	Если флЕстьРегистр Тогда
		Имена.Добавить("ЦФО_Подразделения");
	КонецЕсли; 
	
	Возврат Имена;
	
КонецФункции // ЗарезервированныеИмена()

// Функция определяет наличие записей в РС.бит_СоответствиеАналитик.
// 
// Возвращаемое значение:
//  флЕстьЗаписи - Булево.
// 
Функция ЕстьЗаписи(ВидСоответствия) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСоответствия", ВидСоответствия);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_СоответствияАналитик.ВидСоответствия
	|ИЗ
	|	РегистрСведений.бит_СоответствияАналитик КАК бит_СоответствияАналитик
	|ГДЕ
	|	бит_СоответствияАналитик.ВидСоответствия = &ВидСоответствия";
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
