
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&После("ДобавитьКомандыПечати")
Процедура бит_ДобавитьКомандыПечати(КомандыПечати)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ4.1] [ASHolyavko@1cbit.ru] [01.07.2026] +        
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ДоговорРозничнойКуплиПродажиDOC";
	КомандаПечати.Представление = "(бит) Договор розничной купли-продажи DOCX";
	КомандаПечати.СписокФорм    = "ФормаСпискаДокументов,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	//КомандаПечати.МестоРазмещения = "ПодменюПечать";
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СогласиеНаОбработкуПерсональныхДанныхDOC";
	КомандаПечати.Представление = "(бит) Согласие на обработку персональных данных DOCX";
	КомандаПечати.СписокФорм    = "ФормаСпискаДокументов,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	//КомандаПечати.МестоРазмещения = "ПодменюПечать";
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ДоговорРозничнойКуплиПродажи";
	КомандаПечати.Представление = "(бит) Договор розничной купли-продажи";
	КомандаПечати.СписокФорм    = "ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	//КомандаПечати.МестоРазмещения = "ПодменюПечать";
	//КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СогласиеНаОбработкуПерсональныхДанных";
	КомандаПечати.Представление = "(бит) Согласие на обработку персональных данных";
	КомандаПечати.СписокФорм    = "ФормаСпискаДокументов,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	//КомандаПечати.МестоРазмещения = "ПодменюПечать";
	//КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ4.1] [ASHolyavko@1cbit.ru] [01.07.2026] -
	
КонецПроцедуры

&После("Печать")
Процедура бит_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ4.1] [ASHolyavko@1cbit.ru] [01.07.2026] +        
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорРозничнойКуплиПродажиDOC") Тогда 
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ДоговорРозничнойКуплиПродажиDOC");
		Если ПечатнаяФорма <> Неопределено Тогда           
			ОфисныеДокументы = НапечататьДоговорРозничнойКуплиПродажиDOC(МассивОбъектов, "ДоговорРозничнойКуплиПродажиDOC");
			ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;
			ПечатнаяФорма.СинонимМакета = "(бит) Договор розничной купли-продажи DOCX";
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СогласиеНаОбработкуПерсональныхДанныхDOC") Тогда 
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СогласиеНаОбработкуПерсональныхДанныхDOC");
		Если ПечатнаяФорма <> Неопределено Тогда           
			ОфисныеДокументы = НапечататьСогласиеНаОбработкуПерсональныхДанныхDOC(МассивОбъектов, "СогласиеНаОбработкуПерсональныхДанныхDOC");
			ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;
			ПечатнаяФорма.СинонимМакета = "(бит) Согласие на обработку персональных данных DOCX";
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорРозничнойКуплиПродажи") Тогда 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ДоговорРозничнойКуплиПродажи", "ДоговорРозничнойКуплиПродажи",НапечататьДоговорРозничнойКуплиПродажи(МассивОбъектов));
		Возврат;
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СогласиеНаОбработкуПерсональныхДанных") Тогда 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"СогласиеНаОбработкуПерсональныхДанных", "СогласиеНаОбработкуПерсональныхДанных",НапечататьСогласиеНаОбработкуПерсональныхДанных(МассивОбъектов));
		Возврат;
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ4.1] [ASHolyavko@1cbit.ru] [01.07.2026] -
	
КонецПроцедуры 

Функция НапечататьДоговорРозничнойКуплиПродажиDOC(МассивОбъектов, Идентификатор)
	
	ОфисныеДокументы = Новый Соответствие;
	
    Шаблон = "Договор розничной купли-продажи №[Номер] от [Дата]";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Номер, Дата, Ссылка");
	
    Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если Идентификатор = "ДоговорРозничнойКуплиПродажиDOC" Тогда
			НазваниеДокумента = "Договор розничной купли-продажи";
			АдресДокумента = СформироватьДоговорРозничнойКуплиПродажиDOC(Ссылка);
		КонецЕсли;
		
		РеквизитыДокумента = ЗначенияРеквизитов[Ссылка];
		РеквизитыДокумента.Дата = Формат(РеквизитыДокумента.Дата, "ДФ=dd.MM.yyyy");
		РеквизитыДокумента.Вставить("НазваниеДокумента", НазваниеДокумента);
		ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, РеквизитыДокумента) + "_" + Формат(ТекущаяДатаСеанса(), "ДФ=ddMMyyyyhhmmss");
		ОфисныеДокументы.Вставить(АдресДокумента, ИмяДокумента);
	КонецЦикла;
	
	Возврат ОфисныеДокументы;	
	
КонецФункции

Функция СформироватьДоговорРозничнойКуплиПродажиDOC(Документ)   
	
	МакетДокумента = ПолучитьМакет("ПФ_DOC_ДоговорРозничнойКуплиПродажи");
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, "");
	
	ОписаниеОбластей = Новый Структура;
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ОбластьПечати", "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ВерхнийКолонтитул", "ВерхнийКолонтитул");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "НижнийКолонтитул", "НижнийКолонтитул");
	ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);
	//-------------------------  
	ДанныеЗаполнения = Новый Структура;
	ЗаполнитьДанныеЗаполненияДоговорРозничнойКуплиПродажи(Документ, ДанныеЗаполнения);
	//--------------
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["ВерхнийКолонтитул"]);
	УправлениеПечатью.ПрисоединитьОбласть(ПечатнаяФорма, Область, Ложь);
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["ОбластьПечати"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеЗаполнения);
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["НижнийКолонтитул"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеЗаполнения);
	
	АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции 

Процедура ЗаполнитьДанныеЗаполненияДоговорРозничнойКуплиПродажи(Документ, ДанныеЗаполнения)
	
	Организация = Документ.Организация; 
	
	НомерДоговора = Документ.Номер;
	ДатаДоговора = Формат(Документ.Дата, "ДФ=dd.MM.yyyy");
		
	ПродавецИЕгоИНН = Организация.НаименованиеПолное + " ИНН " + Организация.ИНН;
	Покупатель = Документ.Партнер.Наименование;
	ЗаменаПокупателяНаКлиента = "";
	ОбщаяСтоимостьДоговора =
		"Цена товара составляет " + Формат(Документ.СуммаДокумента, "ЧЦ=15; ЧДЦ=2") + " " + Документ.Валюта + " "
		+ "(" + РаботаСКурсамиВалют.СформироватьСуммуПрописью(Документ.СуммаДокумента, Документ.Валюта) + ")," 
		+ " в том числе НДС в размере " + Формат(Документ.Товары.Итог("СуммаНДС"), "ЧЦ=15; ЧДЦ=2") + " " + Документ.Валюта + " "
	    + "(" + РаботаСКурсамиВалют.СформироватьСуммуПрописью(Документ.Товары.Итог("СуммаНДС"), Документ.Валюта) + ")";
		
	ДатаОтгрузки = "______________";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтгрузки УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаОтгрузки = Формат(ВыборкаДетальныеЗаписи.ДатаОтгрузки, "ДФ='dd MMMM yyyy'");
	КонецЦикла;
	
	Менеджер = Документ.Менеджер;
	Покупатель = Документ.Партнер.Наименование;
	НаименованиеПродавца = Организация.Наименование;
	ИННПродавца = Организация.ИНН;
	
	ЮридическийАдрес = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка = &Ссылка
		|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)";
	
	Запрос.УстановитьПараметр("Ссылка", Организация);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЮридическийАдрес = ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	
	КонтрагентПодразделения = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СопоставлениеПодразделенийИКонтрагентов.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.бит_СопоставлениеПодразделенийИКонтрагентов КАК бит_СопоставлениеПодразделенийИКонтрагентов
		|ГДЕ
		|	бит_СопоставлениеПодразделенийИКонтрагентов.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Документ.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КонтрагентПодразделения = ВыборкаДетальныеЗаписи.Контрагент;
	КонецЦикла;
	
	АдресМагазина = "";
    Город = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление,
		|	КонтактнаяИнформация.Город КАК Город,
		|	КонтактнаяИнформация.Значение КАК Значение
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Ссылка
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)";
	
	Запрос.УстановитьПараметр("Ссылка", КонтрагентПодразделения);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Значение = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		АдресМагазина = ВыборкаДетальныеЗаписи.Представление; 
		//Город = ВыборкаДетальныеЗаписи.Город;
		Значение = ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Значение); 
		
		МассивДанных = ПрочитатьJSON(ЧтениеJSON, Истина);
		
		Если ЗначениеЗаполнено(МассивДанных["city"]) Тогда
			Город = МассивДанных["city"];
		ИначеЕсли ЗначениеЗаполнено(МассивДанных["settlement"]) Тогда
			Город = МассивДанных["settlement"];
		ИначеЕсли ЗначениеЗаполнено(МассивДанных["locality"]) Тогда
			Город = МассивДанных["locality"];
		КонецЕсли;
		
		ЧтениеJSON.Закрыть();
		
	КонецЕсли;
	
	ТелефонМагазина = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Ссылка
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)";
	
	Запрос.УстановитьПараметр("Ссылка", КонтрагентПодразделения);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТелефонМагазина = ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	
	ФИОРуководителя = "";
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизаций.Представление КАК Представление
		|ИЗ
		|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
		|ГДЕ
		|	ОтветственныеЛицаОрганизаций.Владелец = &Владелец
		|	И ОтветственныеЛицаОрганизаций.ПравоПодписиПоДоверенности = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФИОРуководителя = ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	
	НаименованиеПокупателя = Документ.Партнер;
	
	ТелефонПокупателя = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Ссылка
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)";
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Контрагент);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТелефонПокупателя = ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	
	ФИОПокупателя = Документ.Партнер;
	
	ДанныеЗаполнения.Вставить("НомерДоговора", НомерДоговора); 
	ДанныеЗаполнения.Вставить("ДатаДоговора", ДатаДоговора);	
	ДанныеЗаполнения.Вставить("Город", "" + Город);
	ДанныеЗаполнения.Вставить("ДатаДоговора", "" + ДатаДоговора);
	ДанныеЗаполнения.Вставить("ПродавецИЕгоИНН", "" + ПродавецИЕгоИНН);
	ДанныеЗаполнения.Вставить("Покупатель", "" + Покупатель);
	ДанныеЗаполнения.Вставить("ЗаменаПокупателяНаКлиента", "" + ЗаменаПокупателяНаКлиента);
	ДанныеЗаполнения.Вставить("ОбщаяСтоимостьДоговора", "" + ОбщаяСтоимостьДоговора);
	ДанныеЗаполнения.Вставить("ДатаОтгрузки", "" + ДатаОтгрузки + " г., ");
	ДанныеЗаполнения.Вставить("Менеджер", "" + Менеджер);
	ДанныеЗаполнения.Вставить("Покупатель", "" + Покупатель);
	ДанныеЗаполнения.Вставить("НаименованиеПродавца", "" + НаименованиеПродавца);
	ДанныеЗаполнения.Вставить("ИННПродавца", "ИНН " + ИННПродавца);
	ДанныеЗаполнения.Вставить("ЮридическийАдрес", "Юридический адрес: " + ЮридическийАдрес);
	ДанныеЗаполнения.Вставить("АдресМагазина", "Филиал: " + АдресМагазина);
	ДанныеЗаполнения.Вставить("ТелефонМагазина", "Тел/факс.: " + ТелефонМагазина);
	
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИОРуководителя);
	ФИОРуководителя = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧастиИмени);
	ДанныеЗаполнения.Вставить("ФИОРуководителя", "" + ФИОРуководителя);
	
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(Документ.Менеджер.Наименование);
	ФИОМенеджера= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧастиИмени);
	ДанныеЗаполнения.Вставить("ФиоМенеджера", "" + ФИОМенеджера);
	
	ДанныеЗаполнения.Вставить("НаименованиеПокупателя", "" + НаименованиеПокупателя);
	ДанныеЗаполнения.Вставить("ТелефонПокупателя", "Тел.: " + ТелефонПокупателя);
	
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИОПокупателя);
	ФИОПокупателя = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧастиИмени);
	ДанныеЗаполнения.Вставить("ФИОПокупателя", "" + ФИОПокупателя); 
		
КонецПроцедуры

Функция НапечататьСогласиеНаОбработкуПерсональныхДанныхDOC(МассивОбъектов, Идентификатор)
	
	ОфисныеДокументы = Новый Соответствие;
	
    Шаблон = "Согласие на обработку персональных данных №[Номер] от [Дата]";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Номер, Дата, Ссылка");
	
    Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если Идентификатор = "СогласиеНаОбработкуПерсональныхДанныхDOC" Тогда
			НазваниеДокумента = "Согласие на обработку персональных данных";
			АдресДокумента = СформироватьСогласиеНаОбработкуПерсональныхДанныхDOC(Ссылка);
		КонецЕсли;
		
		РеквизитыДокумента = ЗначенияРеквизитов[Ссылка];
		РеквизитыДокумента.Дата = Формат(РеквизитыДокумента.Дата, "ДФ=dd.MM.yyyy");
		РеквизитыДокумента.Вставить("НазваниеДокумента", НазваниеДокумента);
		ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, РеквизитыДокумента) + "_" + Формат(ТекущаяДатаСеанса(), "ДФ=ddMMyyyyhhmmss");
		ОфисныеДокументы.Вставить(АдресДокумента, ИмяДокумента);
	КонецЦикла;
	
	Возврат ОфисныеДокументы;	
	
КонецФункции

Функция СформироватьСогласиеНаОбработкуПерсональныхДанныхDOC(Документ)   
	
	МакетДокумента = ПолучитьМакет("ПФ_DOC_СогласиеНаОбработкуПерсональныхДанных");
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, "");
	
	ОписаниеОбластей = Новый Структура;
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ОбластьПечати", "Общая");
	ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);
	//-------------------------  
	ДанныеЗаполнения = Новый Структура;
	ЗаполнитьДанныеЗаполненияСогласиеНаОбработкуПерсональныхДанных(Документ, ДанныеЗаполнения);
	//--------------
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["ОбластьПечати"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеЗаполнения);
	
	АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции 

Процедура ЗаполнитьДанныеЗаполненияСогласиеНаОбработкуПерсональныхДанных(Документ, ДанныеЗаполнения)

	ДанныеЗаполнения.Вставить("ФиоПолучателя", Документ.Партнер.Наименование); 

	ДокументУдостоверяющийЛичность = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ВидДокумента,
		|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
		|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
		|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
		|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&Дата, ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)) КАК ДокументыФизическихЛицСрезПоследних
		|ГДЕ
		|	ДокументыФизическихЛицСрезПоследних.Физлицо = &Физлицо";
	
	Запрос.УстановитьПараметр("Физлицо", Документ.Контрагент);
	Запрос.УстановитьПараметр("Дата", Документ.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДокументУдостоверяющийЛичность = 
		"Вид документа: " + ВыборкаДетальныеЗаписи.ВидДокумента  
		+ " Серия " + ВыборкаДетальныеЗаписи.Серия 
		+ " Номер " + ВыборкаДетальныеЗаписи.Номер 
		+ " Дата выдачи " + Формат(ВыборкаДетальныеЗаписи.ДатаВыдачи, "ДФ=dd.MM.yyyy") 
		+ " Кем выдан: " + ВыборкаДетальныеЗаписи.КемВыдан;
		
	КонецЦикла;
		
	ДанныеЗаполнения.Вставить("ДокументУдостоверяющийЛичность", ДокументУдостоверяющийЛичность);
	
	ФактическийАдресПокупателя = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Ссылка
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)";
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФактическийАдресПокупателя = ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	
	ДанныеЗаполнения.Вставить("ФактическийАдресПокупателя", "" + ФактическийАдресПокупателя);
	
	Организация = Документ.Организация;
	
	ИнформацияОПродавце = Организация.НаименованиеСокращенное + ", ОГРНИП " + Организация.ОГРН + ", зарегистрированному по адресу: ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка = &Ссылка
		|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)";
	
	Запрос.УстановитьПараметр("Ссылка", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИнформацияОПродавце = ИнформацияОПродавце + ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
			
	ДанныеЗаполнения.Вставить("ИнформацияОПродавце", "" + ИнформацияОПродавце);	
			
КонецПроцедуры

Функция НапечататьДоговорРозничнойКуплиПродажи(МассивОбъектов)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	МакетПечати = ПолучитьМакет("ПФ_ДоговорРозничнойКуплиПродажи");
	
	Для Каждого ЭлементМассива из МассивОбъектов Цикл
		
		ОбластьПечати = МакетПечати.ПолучитьОбласть("ОбластьПечати");
		
		ДанныеЗаполнения = Новый Структура;
		ЗаполнитьДанныеЗаполненияДоговорРозничнойКуплиПродажи(ЭлементМассива, ДанныеЗаполнения);
		
		ЗаполнитьЗначенияСвойств(ОбластьПечати.Параметры, ДанныеЗаполнения);
				
		ТабличныйДокумент.Вывести(ОбластьПечати);
		
		ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;

	//	ТабличныйДокумент.РазмерКолонтитулаСнизу = 10;

		ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "Покупатель:" 
		+ Символы.ПС
		+ "_________________" + ДанныеЗаполнения.ФИОПокупателя;
		
		ТабличныйДокумент.НижнийКолонтитул.ТекстСлева = "Продавец:" 
		+ Символы.ПС
		+ "_________________" + ДанныеЗаполнения.ФиоМенеджера;
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;	
	
КонецФункции

Функция НапечататьСогласиеНаОбработкуПерсональныхДанных(МассивОбъектов)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	МакетПечати = ПолучитьМакет("ПФ_СогласиеНаОбработкуПерсональныхДанных");
	
	Для Каждого ЭлементМассива из МассивОбъектов Цикл
		
		ОбластьПечати = МакетПечати.ПолучитьОбласть("ОбластьПечати");
		
		ДанныеЗаполнения = Новый Структура;
		ЗаполнитьДанныеЗаполненияСогласиеНаОбработкуПерсональныхДанных(ЭлементМассива, ДанныеЗаполнения);
		
		ЗаполнитьЗначенияСвойств(ОбластьПечати.Параметры, ДанныеЗаполнения);
		
		ТабличныйДокумент.Вывести(ОбластьПечати);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции


#КонецЕсли