#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Регистрирует задания к перераспределению запасов при изменении приоритета заказа на производство
//
// Параметры:
//  Задания - ТаблицаЗначений - колонки соответствуют измерениям, ресурсам и реквизитам регистра сведений
//                              "ЗаданияКРасчетуСтруктурыЗаказаПриИзмененииПриоритета", есть и служебные колонки:
//             * ЗаказНаПроизводство    - ДокументСсылка.ЗаказНаПроизводство2_2 -
//             * ИдентификаторЗаписи    - УникальныйИдентификатор -
//             * УдалитьДеньРегистрации - Число  -
//             * ДатаЗаписи             - Дата   -
//             * ИдентификаторЗадания   - УникальныйИдентификатор - служебная
//             * ДатаЗадания            - Дата                    - служебная
//  ИдентификаторыНеОбработанныхЗаписей - Соответствие из УникальныйИдентификатор - ключ, это идентификатор 
//                                                                                   не выполненных (выдающих ошибку при
//                                                                                   выполнении) записей регистра
//                                                                                   сведений очереди заданий
//                                                                                   (измерение ИдентификаторЗаписи
//                                                                                   регистра сведений очереди заданий),
//                                                                                  значение, это представление ошибки.
//  ДополнительныеСвойства - Неопределено, Структура - дополнительные свойства выполнения заданий.
//
Процедура ЗарегистрироватьЗадания(
			Задания,
			ИдентификаторыНеОбработанныхЗаписей,
			ДополнительныеСвойства = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДинамическаяСтруктураЗаказов = ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство");
	
	ТекстыЗапросов = Новый Массив();
	
	Если ДинамическаяСтруктураЗаказов Тогда
	
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|
			|	Движения.Номенклатура   КАК Номенклатура,
			|	Движения.Характеристика КАК Характеристика,
			|	Движения.Склад          КАК Склад,
			|	Движения.Назначение     КАК Назначение
			|
			|ИЗ
			|	РегистрСведений.СтруктураЗаказа КАК Движения
			|ГДЕ
			|	Движения.ЗаказНаПроизводство = &ЗаказНаПроизводство";
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЭтапПроизводства2_2 КАК Таблица
		|ГДЕ
		|	Таблица.Распоряжение = &ЗаказНаПроизводство
		|	И Таблица.Проведен";
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос = Новый Запрос(ТекстЗапроса);
	
	ПоляОшибки = Новый Структура("ЗаказНаПроизводство");
	
	Для каждого Задание Из Задания Цикл
	
		Попытка
			
			ЗаказНаПроизводство = Задание.ЗаказНаПроизводство;
			Запрос.УстановитьПараметр("ЗаказНаПроизводство", ЗаказНаПроизводство);
			Запрос.УстановитьПараметр("ТекущийПриоритет", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказНаПроизводство, "Приоритет"));
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			КоличествоПакетов = РезультатЗапроса.Количество();
			
			Если ДинамическаяСтруктураЗаказов И НЕ РезультатЗапроса[КоличествоПакетов-2].Пустой() Тогда
			
				РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаРаспределениеЗапасов.ДобавитьЗадания(
					РезультатЗапроса[КоличествоПакетов-2].Выгрузить());
				
			КонецЕсли;
			
			Если НЕ РезультатЗапроса[КоличествоПакетов-1].Пустой() Тогда
				
				Этапы = РезультатЗапроса[КоличествоПакетов-1].Выгрузить().ВыгрузитьКолонку(0);
				Документы.ЭтапПроизводства2_2.ОбновитьРеестрДокументов(ЗаказНаПроизводство, Этапы);
				РаспределениеЗапасовДвижения.ПриИзмененииПриоритета(Этапы);
				Этапы = Неопределено;
				
			КонецЕсли;
		
		Исключение
			
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ИдентификаторыНеОбработанныхЗаписей.Вставить(
				Задание.ИдентификаторЗаписи,
				ОтложенныеЗадания.ТекстОшибкиВыполнения(ПоляОшибки, Задание, ТекстОшибки));
		
		КонецПопытки;

	КонецЦикла;
	
	Если ДинамическаяСтруктураЗаказов Тогда
		СтруктураЗаказа.ЗапуститьРасчет();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
