////////////////////////////////////////////////////////////////////////////////
// Модуль содержит интерфейсы к методам типовых конфигураций.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область УправлениеВзаиморасчетами

// Функция получает договор контрагента по умолчанию с учетом условий отбора. 
// Возвращается основной договор или единственный или пустая ссылка.
// 
Функция УстановитьДоговорКонтрагента(ДоговорКонтрагента, ВладелецДоговора, ОрганизацияДоговора, СписокВидовДоговора = Неопределено, СтруктураПараметров = Неопределено) Экспорт
	
	Выполнено = Ложь;
	
	// ++ ЕРП
	Выполнено = БухгалтерскийУчетПереопределяемый.УстановитьДоговорКонтрагента(ДоговорКонтрагента, ВладелецДоговора, ОрганизацияДоговора, СписокВидовДоговора, СтруктураПараметров);                
    // -- ЕРП
	
    Если НЕ Выполнено И ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	КонецЕсли;
	
	Возврат Выполнено;
	
КонецФункции // УстановитьДоговорКонтрагента()	

// Устанавливает банковский счет по умолчанию. Возвращает состояние установлен/не установлен.
// 
Функция УстановитьБанковскийСчет(Счет, ВладелецСчета, Валюта, СовпадениеВалюты = Истина) Экспорт
	
	// ++ ЕРП 
	Возврат Ложь;
	// -- ЕРП 
	
КонецФункции

#КонецОбласти

#КонецОбласти
