#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// 1С:Бухучет и торговля
// 
//  Данная обработка реализует доставку оповещений по электронной почте, 
//  используя справочник "УчетныеЗаписиЭлектроннойПочты".
//  Обработка может быть сохранена как внешняя и использована для разработки собственных способов доставки оповещений,
//  при этом сигнатура всех процедур и функций должна быть сохранена.

#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет, что обработка является обработкой доставки оповещений.
// 
// Возвращаемое значение:
//   Булево
// 
Функция ЭтоОбработкаДоставкиОповещений() Экспорт
	
	Возврат Истина;
	
КонецФункции

Функция НастройкиПоУмолчанию() Экспорт

	РезСтруктура = Новый Структура;
	РезСтруктура.Вставить("EMAILУчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты);

	Возврат РезСтруктура;
	
КонецФункции // НастройкиПоУмолчанию()

Функция ОтправитьСообщение(СообщениеСтруктура, НастройкиДоставки, СтруктураПараметров, ПротоколОтправки = "") Экспорт
	
	Результат = Ложь;
	Отказ 	  = Ложь;
	СтруктураСообщенияКорректна(СообщениеСтруктура,Отказ,ПротоколОтправки);
	
	Если НЕ Отказ Тогда
		Попытка
			Результат = ОтправитьПочтовоеСообщение(СообщениеСтруктура, НастройкиДоставки, СтруктураПараметров, ПротоколОтправки);
		Исключение
			Результат = Ложь;
		КонецПопытки;

		Если Результат Тогда
			ТекстСообщения = НСтр("ru = 'Сообщение отправлено по адресу %1 %2.'; en = 'Message sent to the address %1 %2.'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Сообщение  не удалось отправить по адресу %1 %2.';
									|en = 'Message failed to send to %1 %2.'");
		КонецЕсли; 
		ПротоколОтправки = СтрШаблон(ТекстСообщения, СтруктураПараметров.АдресПолучателя, ТекущаяДатаСеанса());
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура проверяет корретность структуры сообщения.
// 
Процедура СтруктураСообщенияКорректна(Сообщение, Отказ, ПротоколОтправки = "")
	
	// Приведем строковое описание типа текста к системному перечислению.
	Если НЕ Сообщение.Свойство("ТипТекстаСообщения")
		ИЛИ НЕ ЗначениеЗаполнено(Сообщение.ТипТекстаСообщения) Тогда
		
		ТипТекстаСообщения = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Иначе
		
		Для Каждого ТекущийТипТекста Из ТипТекстаПочтовогоСообщения Цикл
			
			Если Строка(ТекущийТипТекста) = Сообщение.ТипТекстаСообщения Тогда
				ТипТекстаСообщения = ТекущийТипТекста;
				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Сообщение.Вставить("ТипТекстаСообщения", ТипТекстаСообщения);
	
КонецПроцедуры

Функция ОтправитьПочтовоеСообщение(СообщениеСтруктура, НастройкиДоставки, СтруктураПараметров, ПротоколОтправки)
	
	ПараметрыПисьма = ПараметрыПисьма(СообщениеСтруктура, НастройкиДоставки, СтруктураПараметров, ПротоколОтправки);
	Если ПараметрыПисьма = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(НастройкиДоставки.EMAILУчетнаяЗапись, ПараметрыПисьма);
	РаботаСПочтовымиСообщениями.ОтправитьПисьмо(НастройкиДоставки.EMAILУчетнаяЗапись, Письмо);
	Возврат Истина;
	
КонецФункции

// Проверяет возможность отправления письма и если
// это возможно - формирует параметры отправки.
//
Функция ПараметрыПисьма(СообщениеСтруктура, НастройкиДоставки, СтруктураПараметров, ПротоколОтправки)
	
	ПараметрыПисьма = Новый Структура;
	СписокПолучателей = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(СтруктураПараметров.АдресПолучателя);
	Адресаты = Новый Массив;
	Для Каждого Получатель Из СписокПолучателей Цикл
		Если НЕ ПустаяСтрока(Получатель.ОписаниеОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				Получатель.ОписаниеОшибки,, "ПочтовыйАдресПолучателя");
			Возврат Неопределено;
		КонецЕсли;
		Адресаты.Добавить(Новый Структура("Адрес, Представление", Получатель.Адрес, Получатель.Псевдоним));
	КонецЦикла;

	Если Адресаты.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо заполнить получателя письма'; en = 'You must fill in the email recipient'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ПочтовыйАдресПолучателя");
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыАдресаОтвета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкиДоставки.EMAILУчетнаяЗапись,
		"ИмяПользователя, АдресЭлектроннойПочты");
	ПараметрыАдресаОтвета = Новый Структура("Адрес, Представление", РеквизитыАдресаОтвета.АдресЭлектроннойПочты,
		РеквизитыАдресаОтвета.ИмяПользователя);
	АдресОтвета = Новый Массив;
	АдресОтвета.Добавить(ПараметрыАдресаОтвета);
	
	Тело = СообщениеСтруктура.Текст + Символы.ПС + СообщениеСтруктура.Подпись;
	
	ВложенияПисьма = Новый Массив;
	Если СообщениеСтруктура.ВложенияШаблона <> Неопределено Тогда
		Для каждого Вложение Из СообщениеСтруктура.ВложенияШаблона Цикл
			ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище, Идентификатор");
			ОписаниеВложения.Представление				= Вложение.Ключ;
			ОписаниеВложения.АдресВоВременномХранилище	= ПоместитьВоВременноеХранилище(Вложение.Значение.ПолучитьДвоичныеДанные());
			ОписаниеВложения.Идентификатор				= Вложение.Ключ;
			ВложенияПисьма.Добавить(ОписаниеВложения);
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыПисьма.Вставить("Кому",			Адресаты);
	ПараметрыПисьма.Вставить("АдресОтвета", 	АдресОтвета);
	ПараметрыПисьма.Вставить("Тема",			СообщениеСтруктура.Заголовок);
	ПараметрыПисьма.Вставить("Тело",			Тело);
	ПараметрыПисьма.Вставить("Кодировка",		КодировкаТекста.UTF8);
	ПараметрыПисьма.Вставить("ТипТекста",		СообщениеСтруктура.ТипТекстаСообщения);
	ПараметрыПисьма.Вставить("Вложения",		ВложенияПисьма);
	ПараметрыПисьма.Вставить("ПротоколПочты",	ПротоколОтправки);
	Если ВложенияПисьма.Количество() > 0 Тогда
		ПараметрыПисьма.Вставить("ОбрабатыватьТексты", Ложь);
	КонецЕсли;
	
	Возврат ПараметрыПисьма;
	
КонецФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли