
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИмяТипа = бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ИмяТипаОсновныеСредства();
	Если ТипЗнч(ПараметрКоманды) = Тип(ИмяТипа) Тогда
		Если ИмяТипа = "СправочникСсылка.ОбъектыЭксплуатации" Тогда
			ДатаСведений = ПараметрыВыполненияКоманды.Источник.Объект.ДатаСведений;
		Иначе
			ДатаСведений = ПараметрыВыполненияКоманды.Источник.ДатаСведений;
		КонецЕсли;
	Иначе
		ДатаСведений = ТекущаяДата();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ТекущийОбъект, ДатаСведений", ПараметрКоманды, ДатаСведений);
	
	ОткрытьФорму("Обработка.бит_СведенияПоМСФО.Форма.Форма", ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти
