#Область ПрограммныйИнтерфейс

// Возвращает префикс объектов расширения
// Возвращаемое значение:
//   Строка	- Префикс объектов расширения
Функция Префикс() Экспорт 
	
	Возврат "ИТК_";
	
КонецФункции

// Возвращает идентификатор расширения
//
// Возвращаемое значение:
//   Строка	- Идентификатор расширения
//
Функция Идентификатор() Экспорт 
	
	Возврат "InfostartToolkitPROF";
	
КонецФункции

Функция Представление() Экспорт
	
	Возврат НСтр("ru = 'Infostart Toolkit PROF';
						|en = 'Infostart Toolkit PROF'");
	
КонецФункции

// Возвращает полное имя расширения
//
// Возвращаемое значение:
//   Строка	- полное имя расширения
//
Функция ПолноеПредставление() Экспорт
	
	Версия = ИТК_ТуллкитКлиентСервер.Версия();
	Возврат СтрШаблон("%1 %2", Представление(), Версия);
	
КонецФункции

// Возвращает версию расширения
//
// Возвращаемое значение:
//   Строка	- версия расширения
//
Функция Версия() Экспорт
	
	Возврат ИТК_ТуллкитКлиентСерверПовтИсп.Версия();
	
КонецФункции

Функция ОграниченнаяВерсия() Экспорт
	
	Результат = СтрЗаканчиваетсяНа(Идентификатор(), "ADMIN");
	Возврат Результат;
	
КонецФункции

Функция ПолнаяВерсия() Экспорт
	
	Результат = НЕ ОграниченнаяВерсия();
	Возврат Результат;
	
КонецФункции

// Возвращает WebСайт расширения
//
// Возвращаемое значение:
//   Строка	- Веб-сайт расширения
//
Функция WebСайт() Экспорт
	
	Возврат "https://infostart.ru/public/1254364/";
	
КонецФункции

Функция ЖурналРегистрацииПредставление() Экспорт
	
	Возврат НСтр("ru = 'Журнал регистрации';
				|en = 'Event log'");
	
КонецФункции

Функция КонструкторСКДПредставление() Экспорт
	
	Возврат НСтр("ru = 'Конструктор схемы компоновки данных';
				|en = 'Data composition schema designer'");
	
КонецФункции

// Возвращает имя события журнала регистрации
//
// Возвращаемое значение:
//   Строка	- имя события журнала регистрации
//
Функция ИмяСобытияЖурналаРегистрации() Экспорт
	
	Возврат ИТК_ТуллкитКлиентСервер.Представление();
	
КонецФункции

Функция ОписаниеИнструмента(Инструмент) Экспорт
	
	ОписанияИнструментов = ИТК_ТуллкитКлиентСерверПовтИсп.СоответствиеОписаниеИнструментов();

	Результат = ОписанияИнструментов.Получить(Инструмент);
	Если Результат = Неопределено Тогда
		ВызватьИсключение "Не задано описание инструмента: " + Инструмент;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеИнструмента(Инструмент) Экспорт
	
	ОписаниеИнструмента = ОписаниеИнструмента(Инструмент);
	Если ОписаниеИнструмента = Неопределено Тогда
		ВызватьИсключение "Не задано описание инструмента: " + Инструмент;
	КонецЕсли;
	
	Возврат ОписаниеИнструмента["Представление"];
	
КонецФункции

Функция КартинкаИнструмента(Инструмент) Экспорт
	
	ОписаниеИнструмента = ОписаниеИнструмента(Инструмент);
	Если ОписаниеИнструмента = Неопределено Тогда
		ВызватьИсключение "Не задано описание инструмента: " + Инструмент;
	КонецЕсли;
	
	Возврат ОписаниеИнструмента["Картинка"];
	
КонецФункции

Функция ДоступенИнструмент(Инструмент) Экспорт
	
	ОписаниеИнструмента = ОписаниеИнструмента(Инструмент);
	Если ОписаниеИнструмента = Неопределено Тогда
		ВызватьИсключение "Не задано описание инструмента: " + Инструмент;
	КонецЕсли;
	
	Возврат ОписаниеИнструмента["Доступ"];
	
КонецФункции

Функция УникальныйИдентификатор() Экспорт
	
	Возврат Новый УникальныйИдентификатор("442fa533-e0c9-11ec-aefb-18c04d7e4214");
	
КонецФункции

#КонецОбласти