
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Элементы.ДекорацияПредупреждение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ЗначенияАналитик = Новый Структура("Сценарий, ЦФО");
	ЗаполнитьЗначенияСвойств(ЗначенияАналитик, Объект);
	
	МенеджерЗаписи = РегистрыСведений.бит_АналитикаСценарийЦФО.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЗначенияАналитик);
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Результат = МенеджерЗаписи.КлючАналитики;
		Если Результат <> Объект.Ссылка Тогда
			ТекстСообщения = НСтр("ru = 'Ключ с такими аналитиками уже существует: %1'; 
								  |en = 'The key with such Analytics already exists: %1'");
			
			ТекстСообщения = СтрШаблон(ТекстСообщения, Результат);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Результат, , ,Отказ); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_АналитикаСценарийЦФО.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	РегистрСведений.бит_АналитикаСценарийЦФО КАК бит_АналитикаСценарийЦФО
	|ГДЕ
	|	бит_АналитикаСценарийЦФО.КлючАналитики = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Ограничить 		 = НЕ РезультатЗапроса.Пустой();
	
	Элементы.Сценарий.ТолькоПросмотр 		   = Ограничить;
	Элементы.ЦФО.ТолькоПросмотр 			   = Ограничить;
	Элементы.ДекорацияПредупреждение.Видимость = Ограничить;
	
КонецПроцедуры

#КонецОбласти