#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает имя обработки доставки.
//
// Параметры:
//  НастройкаДоставки	 - 	СправочникСсылка.бит_фн_НастройкиДоставкиОповещений - настройка доставки.
// 
// Возвращаемое значение:
//  Имя - Строка - имя объекта.
//
Функция ИмяОбработкиДоставки(НастройкаДоставки) Экспорт

    Имя = НастройкаДоставки.ОбработкаДоставки.ИмяОбъекта;
    
    Возврат Имя;
    
КонецФункции

// Функция определяет использует ли данная настройка доставки через пуш уведомления.
//
// Параметры:
//  НастройкаДоставки	 - 	СправочникСсылка.бит_фн_НастройкиДоставкиОповещений - настройка доставки.
// 
// Возвращаемое значение:
//  флДоставкаЧерезПуш - Булево - флаг.
//
Функция ЭтоДоставкаЧерезПуш(НастройкаДоставки) Экспорт

    Имя = ИмяОбработкиДоставки(НастройкаДоставки);
    
    флДоставкаЧерезПуш = ?(Врег(Имя) = ВРег("бит_ДоставкаОповещенийPush"),Истина, Ложь);

    Возврат флДоставкаЧерезПуш;
    
КонецФункции

// Функция определяет использует ли данная настройка доставки через Telegram.
//
// Параметры:
//  НастройкаДоставки	 - СправочникСсылка.бит_фн_НастройкиДоставкиОповещений	 - настройка доставки.
// 
// Возвращаемое значение:
//  флРез - Булево - результат.
//
Функция ЭтоДоставкаЧерезTelegram(НастройкаДоставки) Экспорт

    Имя = ИмяОбработкиДоставки(НастройкаДоставки);
    
    флРез = ?(Врег(Имя) = ВРег("бит_ДоставкаОповещенийTelegram"),Истина, Ложь);

    Возврат флРез;
    
КонецФункции

// Функция определяет использует ли данная настройка доставки через систему взаимодействия.
//
// Параметры:
//  НастройкаДоставки	 - СправочникСсылка.бит_фн_НастройкиДоставкиОповещений	 - настройка доставки.
// 
// Возвращаемое значение:
//  флРез - Булево - результат.
//
Функция ЭтоДоставкаЧерезСистемуВзаимодействия(НастройкаДоставки) Экспорт

    Имя = ИмяОбработкиДоставки(НастройкаДоставки);
    
    флРез = ?(Врег(Имя) = ВРег("бит_ДоставкаОповещенийСистемаВзаимодействия"),Истина, Ложь);

    Возврат флРез;
    
КонецФункции

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОчиститьУстаревшиеНастройки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_фн_НастройкиДоставкиОповещений КАК Настройки
	|ГДЕ
	|	Настройки.СпособТранспорта = ЗНАЧЕНИЕ(Перечисление.бит_фн_СпособыТранспортаОповещений.PushNotification)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Настройка = Выборка.Ссылка.ПолучитьОбъект();
		Настройка.НастройкиДоставки.Очистить();
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Настройка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
 	
#КонецЕсли	