////////////////////////////////////////////////////////////////////////////////
// БИТ.ФИНАНС
///////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет, что текущее решение УТ. 
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ЭтоУТ() Экспорт
	
	// Доделать: Перенести в переопределяемый модуль.
	Возврат бит_ОбщегоНазначения.ЭтоУТ();
	
КонецФункции

// Возвращает структуру параметров, необходимых при запуске конфигурации.
//
// Возвращаемое значение:
//  Структура - параметры работы программы при запуске.
//
Функция ПараметрыРаботыКлиентаПриЗапуске() Экспорт
	
	ПараметрыКлиента = Новый Структура;
	
	// Для запрета обновления с неподдерживаемых версий
	// См. бит_ОбновлениеИнформационнойБазыБФ.ПриДобавленииПодсистемы()
	ВерсияДанных 	 = "БитФинанс";
	ВерсияМетаданных = бит_ОбщегоНазначенияПовтИсп.ПолучитьСведенияОПрограмме().НомерРелиза_БИТ;

	ПараметрыКлиента.Вставить("ВерсияДанных", ОбновлениеИнформационнойБазыСлужебный.ВерсияИБ(ВерсияДанных, Истина)); 
	ПараметрыКлиента.Вставить("ВерсияМетаданных",ВерсияМетаданных); 
	
	Возврат ПараметрыКлиента;
	
КонецФункции

// Функция получает массив типов которые может принимать элемент ПВХ.
//
// Параметры:
//  ЭлементПВХ.
//
Функция ДопустимыеТипыПоДаннымЭлемента(Знач ЭлементПВХ) Экспорт
	
	Возврат бит_ОбщегоНазначения.ДопустимыеТипыПоДаннымЭлемента(ЭлементПВХ);
	
КонецФункции

// Функция возвращает номер версии выбранной системы лицензирования.
// 
// Возвращаемое значение:
//  Число - номер версии системы лицензирования 1 или 2.
//
Функция СистемаЛицензированияБФ() Экспорт
	
	Возврат бит_ОбщегоНазначенияПовтИсп.СистемаЛицензированияБФ();
	
КонецФункции

// Возвращает значение общей переменной.
// 
// Параметры:
//  ИмяПараметра - Строка.
// 
// Возвращаемое значение:
//  Произвольный.
// 
Функция ЗначениеПеременной(Знач ИмяПараметра) Экспорт
	
	НайденноеЗначение = бит_ОбщиеПеременныеСервер.ЗначениеПеременной(ИмяПараметра);
		
	Возврат НайденноеЗначение;
	
КонецФункции

// Функция возвращает строковое представление описания типов.
// 
// Параметры:
//  ТекОписание - ОписаниеТипов.
//	СимволРазделитель - строка.
// 
// Возвращаемое значение:
//  Строка.
// 
Функция СтроковоеПредставлениеОписанияТипов(Знач ТекОписание, Знач СимволРазделитель = "/") Экспорт
	
	Возврат бит_ОбщегоНазначения.СтроковоеПредставлениеОписанияТипов(ТекОписание, СимволРазделитель);
	
КонецФункции

// Проверяет доступность реквизита выбранной версии продукта и формы констант.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЕстьДоступНаИзменениеВерсииПродукта() Экспорт
	
	Возврат бит_ОбщегоНазначения.ЕстьДоступНаИзменениеВерсииПродукта();
		
КонецФункции

// Проверяет наличие необработанных виз.
//
// Возвращаемое значение:
//  Булево - Наличие необработанных виз.
//
Функция ЕстьНеобработанныеВизы() Экспорт
	
	Возврат Обработки.бит_КонсольОперативногоВизирования.ЕстьНеобработанныеВизы();
	
КонецФункции

Функция ПроверкаНаличияНеобработанныхВизВФоне(Знач УникальныйИдентификатор) Экспорт
	
	НаименованиеЗадания = НСтр("ru='Проверка наличия необработанных виз.'");
	ВыполняемыйМетод    = "Обработки.бит_КонсольОперативногоВизирования.ПроверитьНаличиеНеобработанныхВиз";
	
	НастройкиПараметров = Новый Структура;
	НастройкиПараметров.Вставить("Ответственный", Пользователи.ТекущийПользователь());
	
	// Заполнение параметров длительной операции.
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, НастройкиПараметров, ПараметрыВыполнения);
	
КонецФункции

// Функция проверяет наличие активных задач у пользователя.
//
Функция ЕстьАктивныеЗадачи() Экспорт
	
	Возврат Обработки.бит_МоиЗадачи.ЕстьАктивныеЗадачи();
	
КонецФункции

// Функция получает значение, получив предварительно менеджер объекта.
// 
// Параметры:
//  СтруктураИмен - Структура.
//  ИдПоиска	  - Строка.
// 
// Возвращаемое значение:
//  Произвольное значение.
// 
Функция ЗначениеЧерезМенеджерОбъекта(Знач СтруктураИмен, Знач ИдПоиска) Экспорт
	
	Менеджер = бит_ОбщегоНазначения.ПолучитьМенеджер(СтруктураИмен.ИмяКоллекции);
	НайденноеЗначение = Менеджер[СтруктураИмен.ИмяОбъекта].ПолучитьСсылку(ИдПоиска);
	Доступно = ОбщегоНазначения.СсылкаСуществует(НайденноеЗначение);
	Если НЕ Доступно Тогда					
		НайденноеЗначение = Неопределено;					
	КонецЕсли;
	
	Возврат НайденноеЗначение;
	
КонецФункции

// Возвращает головную организацию для заданной организации
// Если для организации реквизит ГоловнаяОрганизация не заполнен 
// это значит, что сама организация является головной.
// 
// Параметры
//  Организация - СправочникСсылка.Организации.
// 
// Возвращаемое значение:
//   СправочникСсылка.Организации.
// 
Функция ГоловнаяОрганизация(Знач Организация) Экспорт
	
	Возврат бит_ОбщегоНазначения.ГоловнаяОрганизация(Организация);
	
КонецФункции

// Функция получает список собственных контрагентов по организации.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации.
// 
// Возвращаемое значение:
//  Список значений.
// 
Функция СобственныеКонтрагентыПоОрганизации(Знач Организация) Экспорт

	Возврат бит_ОбщегоНазначения.СобственныеКонтрагентыПоОрганизации(Организация);

КонецФункции

// Функция получает собственную организацию по контрагенту.
// 
// Параметры:
// 	Контрагент - СправочникСсылка.Контрагенты 
// 						(контрагент для которого надо найти организацию).
// 
// Возвращаемое значение:
// 	СобственнаяОрганизация - СправочникСсылка.Организации 
// 							(найденная организация или пустая ссылка, если организация не найдена).
// 
Функция ПолучитьСобственнуюОрганизациюПоКонтрагенту(Знач Контрагент) Экспорт
	
	Возврат бит_ОбщегоНазначения.ПолучитьСобственнуюОрганизациюПоКонтрагенту(Контрагент);
	
КонецФункции

// Функция получает имя документа по метаданным.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.
// 
// Возвращаемое значение:
//  Строка.
// 
Функция ПолучитьИмяДокумента(Знач ДокументСсылка) Экспорт
	
	Возврат бит_ОбщегоНазначения.ПолучитьИмяДокумента(ДокументСсылка);
	
КонецФункции

#КонецОбласти