

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов.
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники.бит_СтатьиОборотов);
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактировать;
	// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов.
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	ЕстьПраваНаШаблоныПроводок = ПравоДоступа("Редактирование",
		Метаданные.РегистрыСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов)
		И ПравоДоступа("Редактирование", Метаданные.Справочники.бит_СтатьиОборотов);

	УстановитьНастройкуРедактируютсяШаблоныПроводок(ЭтотОбъект);
	
	УправлениеФормой(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанШаблонПроводкиБюджетирования" Тогда
		ОбработатьЗаписьШаблонаПроводкиБюджетирования(Параметр);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИндивидуальнаяНастройкаШаблоновПроводокПриИзменении(Элемент)
	
	Если ИндивидуальнаяНастройкаШаблоновПроводок Тогда
		ИзмененыШаблоныПроводок = Истина;
	Иначе	
		ЗаполнитьШаблоныПроводокПоУмолчанию();
	КонецЕсли;

	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	Если РедактируютсяШаблоныПроводок Тогда
		ПодключитьОбработчикОжидания("ПриАктивизацииСтроки", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если РедактируютсяШаблоныПроводок И Элементы.Список.ТекущаяСтрока = НовыйОбъект Тогда
		ПриАктивизацииСтрокиНаСервере(Элементы.Список.ТекущаяСтрока);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШаблоныПроводок

&НаКлиенте
Процедура ШаблоныПроводокПриИзменении(Элемент)
	
	ИзмененыШаблоныПроводок = Истина;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПроводокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ШаблоныПроводок.ТекущиеДанные;
	Если Поле <> Элементы.ШаблоныПроводокШаблонПроводки И ЗначениеЗаполнено(ТекущиеДанные.ШаблонПроводки) Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ТекущиеДанные.ШаблонПроводки));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПроводокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;	
	КонецЕсли;
	
	ИзмененСоставСтрок = Ложь;
	Для каждого Элемент Из ВыбранноеЗначение Цикл
		УжеПодобран = Ложь;
		Для каждого СтрокаТаблицы Из ШаблоныПроводок Цикл
			Если СтрокаТаблицы.ШаблонПроводки = Элемент Тогда
				УжеПодобран = Истина;
				Прервать;		
			КонецЕсли;
		КонецЦикла;
		Если НЕ УжеПодобран Тогда
			НоваяСтрока = ШаблоныПроводок.Добавить();
			НоваяСтрока.ШаблонПроводки = Элемент;
			ЗаполнитьДобавленныеКолонкиТаблицыШаблоныПроводок(НоваяСтрока.ПолучитьИдентификатор());
			ИзмененСоставСтрок = Истина;
		КонецЕсли;
	КонецЦикла;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПроводокШаблонПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ШаблоныПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ШаблонПроводки) Тогда
		ЗаполнитьДобавленныеКолонкиТаблицыШаблоныПроводок(ТекущиеДанные.ПолучитьИдентификатор());
	Иначе	
		ДанныеСтроки = НовыеДанныеСтрокиШаблоныПроводок();
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСтроки);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыШаблоныПроводок

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список, Список);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандРаботыСExcel

&НаКлиенте
Процедура ЗагрузитьЧерезТабДок(Команда)
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("РежимЗагрузки",  ПредопределенноеЗначение("Перечисление.бит_РежимыЗагрузки.Справочник"));
    ПараметрыФормы.Вставить("ИмяСправочника", "бит_СтатьиОборотов");
    
    ОткрытьФорму("Обработка.бит_ЗагрузкаДанныхИзТабличногоДокумента.Форма", ПараметрыФормы, ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
    
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СкопироватьГруппуСтатейОборотовСПодчиненными(Команда)
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено И Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		СкопироватьГруппуСтатейОборотовСПодчиненнымиНаСервере(Элементы.Список.ТекущаяСтрока);
		ОповеститьОбИзменении(Тип("СправочникСсылка.бит_СтатьиОборотов"));
		ПоказатьПредупреждение(, НСтр("ru = 'Копирование завершено.'; en = 'Copying is completed.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШаблонИзИсточника(Команда)
	
	ПараметрыФормы = Новый Структура("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
 	Оповещение	   = Новый ОписаниеОповещения("ДобавитьШаблонИзИсточникаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.бит_СтатьиОборотов.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,, Оповещение);

КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ДобавитьШаблонИзИсточникаЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьШаблоныПроводок(Результат);
	
	ИзмененыШаблоныПроводок					= Истина;
	ИндивидуальнаяНастройкаШаблоновПроводок = Истина;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборШаблоновПроводок(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);

	ОткрытьФорму("Справочник.бит_ШаблоныПроводокБюджетирования.ФормаВыбора", 
		ПараметрыФормы, Элементы.ШаблоныПроводок, ЭтотОбъект);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаписатьШаблоныПроводок(Команда)
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ИзмененыШаблоныПроводок Тогда
		НазначитьШаблоныПроводок(Элементы.Список.ТекущаяСтрока, Элементы.Список.ТекущиеДанные.ЭтоГруппа);
		ОповеститьОбИзменении(Тип("СправочникСсылка.бит_СтатьиОборотов"));
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьШаблоныПроводок(Команда)
	
	РедактируютсяШаблоныПроводок = НЕ РедактируютсяШаблоныПроводок;
	
	УстановитьНастройкуРедактируютсяШаблоныПроводок(ЭтотОбъект);
	
	Если РедактируютсяШаблоныПроводок И Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		ПриАктивизацииСтрокиНаСервере(Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеШаблоныПроводок(Команда)
	
	Оповещение 	   = Новый ОписаниеОповещения("УдалитьВсеШаблоныПроводокЗавершение", ЭтотОбъект);
	ТекстСообщения = НСтр("ru = 'Будут удалены шаблоны проводок во всем справочнике. Продолжить?';
							|en = 'Transaction templates in the entire directory will be deleted. Continue?'");
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура УдалитьВсеШаблоныПроводокЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		УдалитьВсеШаблоныПроводокНаСервере();
		ОповеститьОбИзменении(Тип("СправочникСсылка.бит_СтатьиОборотов"));
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СкопироватьГруппуСтатейОборотовСПодчиненнымиНаСервере(ОбъектКопирования)
	
	Справочники.бит_СтатьиОборотов.СкопироватьГруппуСтатейОборотовСПодчиненными(ОбъектКопирования);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.УдалитьВсеШаблоныПроводок.Видимость  = Форма.ЕстьПраваНаШаблоныПроводок;
	Элементы.РедактироватьШаблоныПроводок.Пометка = Форма.РедактируютсяШаблоныПроводок;
	Элементы.ГруппаШаблоныПроводок.Видимость	  = Форма.РедактируютсяШаблоныПроводок;
	
	Если Форма.РедактируютсяШаблоныПроводок Тогда
		Если Форма.ЕстьПраваНаШаблоныПроводок Тогда
			Элементы.ШаблоныПроводок.ТолькоПросмотр = НЕ Форма.ИндивидуальнаяНастройкаШаблоновПроводок;
		Иначе
			Элементы.ШаблоныПроводок.ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Элементы.ШаблоныПроводокДобавитьШаблонИзИсточника.Доступность 	= НЕ Элементы.ШаблоныПроводок.ТолькоПросмотр;
		Элементы.ШаблоныПроводокПодборШаблоновПроводок.Доступность	  	= НЕ Элементы.ШаблоныПроводок.ТолькоПросмотр;
		Элементы.ИндивидуальнаяНастройкаШаблоновПроводок.ТолькоПросмотр = НЕ Форма.ЕстьПраваНаШаблоныПроводок;

		Элементы.ШаблоныПроводокЗаписатьШаблоныПроводок.КнопкаПоУмолчанию = Форма.ИзмененыШаблоныПроводок;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриАктивизацииСтроки()

	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ТекущийОбъектСШаблонами <> Элементы.Список.ТекущаяСтрока Тогда
		Если ИзмененыШаблоныПроводок Тогда
			ПредложитьЗаписатьШаблоныПроводок();
		Иначе
			ПриАктивизацииСтрокиНаСервере(Элементы.Список.ТекущаяСтрока);
			ТекущийОбъектСШаблонами		  = Элементы.Список.ТекущаяСтрока;
			ТекущийОбъектСШаблонамиГруппа = Элементы.Список.ТекущиеДанные.ЭтоГруппа;
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриАктивизацииСтрокиНаСервере(Ссылка)
	
	ШаблоныПроводок.Очистить();	
	ПрочитатьШаблоныПроводок(Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьШаблоныПроводок(ОбъектСШаблонами)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныПроводок.ШаблонПроводки КАК ШаблонПроводки,
	|	ШаблоныПроводок.ШаблонПроводки.СчетДТ КАК СчетДТ,
	|	ШаблоныПроводок.ШаблонПроводки.СчетКТ КАК СчетКТ,
	|	ШаблоныПроводок.ШаблонПроводки.КоэффициентСумма КАК КоэффициентСумма,
	|	ШаблоныПроводок.ШаблонПроводки.КоэффициентКоличество КАК КоэффициентКоличество,
	|	ШаблоныПроводок.ШаблонПроводки.Содержание КАК Содержание,
	|	ШаблоныПроводок.Назначено КАК Назначено
	|ИЗ
	|	РегистрСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов КАК ШаблоныПроводок
	|ГДЕ
	|	ШаблоныПроводок.ОбъектСШаблонами = &ОбъектСШаблонами
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШаблоныПроводок.ШаблонПроводки";
	
	Запрос.УстановитьПараметр("ОбъектСШаблонами", ОбъектСШаблонами);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = РезультатЗапроса.Выбрать();
	
	ИндивидуальнаяНастройкаШаблоновПроводок = Ложь;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ШаблоныПроводок.Добавить(), Выборка);
		ИндивидуальнаяНастройкаШаблоновПроводок = Выборка.Назначено;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблицыШаблоныПроводок(ИдентификаторСтроки)

	СтрокаТаблицы 	 = ШаблоныПроводок.НайтиПоИдентификатору(ИдентификаторСтроки);
	РеквизитыШаблона = НовыеДанныеСтрокиШаблоныПроводок();
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ШаблонПроводки) Тогда
		РеквизитыШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.ШаблонПроводки,
			"СчетДТ, СчетКТ, КоэффициентСумма, КоэффициентКоличество, Содержание");
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РеквизитыШаблона);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблоныПроводокПоУмолчанию()

	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	ШаблоныПроводок.Очистить();
	ПрочитатьШаблоныПроводок(ТекущаяСтрока.Родитель);
		
	ИндивидуальнаяНастройкаШаблоновПроводок = Ложь;
	ИзмененыШаблоныПроводок				    = Истина;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыеДанныеСтрокиШаблоныПроводок()

	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("СчетДТ",				   Неопределено);
	ДанныеСтроки.Вставить("СчетКТ", 			   Неопределено);
	ДанныеСтроки.Вставить("КоэффициентСумма", 	   0);
	ДанныеСтроки.Вставить("КоэффициентКоличество", 0);
	ДанныеСтроки.Вставить("Содержание", 		   "");
	Возврат ДанныеСтроки;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНастройкуРедактируютсяШаблоныПроводок(Форма)

	Форма.Список.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("РедактируютсяШаблоныПроводок", 
		Форма.РедактируютсяШаблоныПроводок);
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "РедактируютсяШаблоныПроводок",
		Форма.РедактируютсяШаблоныПроводок, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаписьШаблонаПроводкиБюджетирования(ШаблонПроводки)

	Если НЕ РедактируютсяШаблоныПроводок Тогда
		Возврат;	
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ШаблоныПроводок Цикл
		Если СтрокаТаблицы.ШаблонПроводки = ШаблонПроводки Тогда
			ЗаполнитьДобавленныеКолонкиТаблицыШаблоныПроводок(СтрокаТаблицы.ПолучитьИдентификатор());
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура НазначитьШаблоныПроводок(СтатьяОборотов, ЭтоГруппа)

	Если СтатьяОборотов = Неопределено Тогда
		СтатьяОборотов = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектСШаблонами.Установить(СтатьяОборотов);
	
	Для каждого СтрокаТаблицы Из ШаблоныПроводок Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ШаблонПроводки) Тогда
			Продолжить;	
		КонецЕсли;
		Запись = НаборЗаписей.Добавить();
		Запись.ОбъектСШаблонами = СтатьяОборотов;
		Запись.ШаблонПроводки	= СтрокаТаблицы.ШаблонПроводки;
		Запись.Назначено 	  	= ИндивидуальнаяНастройкаШаблоновПроводок;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	Если ЭтоГруппа Тогда
		Справочники.бит_СтатьиОборотов.УстановитьШаблоныПроводокСвязаннымСтатьям(СтатьяОборотов);	
	КонецЕсли;	
	
	ИзмененыШаблоныПроводок = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаписатьШаблоныПроводок()

	Оповещение 	   = Новый ОписаниеОповещения("ПредложитьЗаписатьШаблоныПроводокЗавершение", ЭтотОбъект);
	ТекстСообщения = НСтр("ru = 'Данные были изменены. Сохранить изменения?';
						|en = 'The data has been changed. Save changes?'");
	
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНетОтмена);

КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПредложитьЗаписатьШаблоныПроводокЗавершение(Результат, Дополнительно) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		НазначитьШаблоныПроводок(ТекущийОбъектСШаблонами, ТекущийОбъектСШаблонамиГруппа);
		ТекущийОбъектСШаблонами		  = Элементы.Список.ТекущаяСтрока;
		ТекущийОбъектСШаблонамиГруппа = Элементы.Список.ТекущиеДанные.ЭтоГруппа;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ИзмененыШаблоныПроводок 	  = Ложь;
		ТекущийОбъектСШаблонами 	  = Элементы.Список.ТекущаяСтрока;
		ТекущийОбъектСШаблонамиГруппа = Элементы.Список.ТекущиеДанные.ЭтоГруппа;
		ПриАктивизацииСтрокиНаСервере(ТекущийОбъектСШаблонами);
	Иначе
		Элементы.Список.ТекущаяСтрока = ТекущийОбъектСШаблонами;	
	КонецЕсли;	

	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеШаблоныПроводокНаСервере()
	
	НачатьТранзакцию();
	
	БлокировкаШаблонов = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаШаблонов.Добавить("РегистрСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;	
	ЭлементБлокировки = БлокировкаШаблонов.Добавить("РегистрСведений.бит_НаличиеШаблоновПроводокБюджетирования");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;	
	БлокировкаШаблонов.Заблокировать();
	
	Попытка
	
		НаборЗаписей = РегистрыСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось удалить шаблоны проводок по причине: %1.';
							|en = 'Failed to delete transaction templates for the reason: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение ТекстСообщения;		
	КонецПопытки;
	
	ИндивидуальнаяНастройкаШаблоновПроводок = Ложь;
	ИзмененыШаблоныПроводок					= Ложь;
	ШаблоныПроводок.Очистить();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции