#Область ПрограммныйИнтерфейс

// Идентификаторы документов по которым рассчитывается стоимость.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ИдентификаторыОбъектовМетаданных -  Идентификаторы документов
Функция ИдентификаторыДокументовПоКоторымРассчитываетсяСтоимость() Экспорт
	
	СписокТипов = РасчетСтоимостиВНА.ТипыДокументовПоКоторымРассчитываетсяСтоимость(Ложь);
	
	СписокОбъектов = Новый Массив;
	Для каждого ТипОбъекта Из СписокТипов Цикл
		СписокОбъектов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта));
	КонецЦикла; 
	
	Возврат СписокОбъектов;
	
КонецФункции

// Идентификаторы документов, по которым формируются отложенные движения.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ИдентификаторыОбъектовМетаданных - Идентификаторы документов
Функция ИдентификаторыДокументовПоКоторымФормируютсяОтложенныеДвижения() Экспорт

	СписокТипов = Новый Массив;
	
	// ОС
	СписокТипов.Добавить(Тип("ДокументСсылка.ИзменениеПараметровОС2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.КорректировкаСтоимостиИАмортизацииОС"));
	СписокТипов.Добавить(Тип("ДокументСсылка.МодернизацияОС2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ОбъединениеОС"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПеремещениеОС2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПереоценкаОС2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПодготовкаКПередачеОС2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.РазукомплектацияОС"));
	СписокТипов.Добавить(Тип("ДокументСсылка.СписаниеОС2_4"));

	// НМА
	СписокТипов.Добавить(Тип("ДокументСсылка.ИзменениеПараметровНМА2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.КорректировкаСтоимостиИАмортизацииНМА"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПеремещениеНМА2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПереоценкаНМА2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПодготовкаКПередачеНМА2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.СписаниеНМА2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.УлучшениеНМА"));
	
	// Аренда
	СписокТипов.Добавить(Тип("ДокументСсылка.ВозвратОСИзАренды2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ВыбытиеАрендованныхОС"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ВыкупАрендованныхОС"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ИзменениеУсловийДоговораАренды"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПередачаОСВАренду2_4"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПрекращениеДоговораАренды"));
	
	// Прочее
	СписокТипов.Добавить(Тип("ДокументСсылка.РеализацияУслугПрочихАктивов"));
	СписокТипов.Добавить(Тип("ДокументСсылка.НачислениеСписаниеРезервовПредстоящихРасходов"));
	
	СписокОбъектов = Новый Массив;
	Для каждого ТипОбъекта Из СписокТипов Цикл
		СписокОбъектов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта));
	КонецЦикла; 
	
	ОтложенноеФормированиеДвиженийВНАЛокализация.ДополнитьИдентификаторыДокументовПоКоторымФормируютсяОтложенныеДвижения(СписокОбъектов);
	
	Возврат СписокОбъектов;

КонецФункции

#КонецОбласти
