#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДоступныеЗначения(
		Параметры.Отбор, Параметры.СтрокаПоиска).ДоступныеЗначения;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Отбор") Тогда
		Параметры.Вставить("Отбор", Новый Структура);
	КонецЕсли;
	
	Если Параметры.Свойство("ФормаОплаты") И ЗначениеЗаполнено(Параметры.ФормаОплаты) Тогда
		Параметры.Отбор.Вставить("ФормаОплаты", Параметры.ФормаОплаты);
	КонецЕсли;
	
	Если Параметры.Свойство("Ссылка") И ЗначениеЗаполнено(Параметры.Ссылка) Тогда
		Параметры.Отбор.Вставить("Ссылка", Параметры.Ссылка);
	КонецЕсли;
	
	ДанныеВыбора = ПолучитьДоступныеЗначения(
		Параметры.Отбор, Неопределено).ДоступныеЗначения;
	
	Параметры.Отбор.Очистить();
	Параметры.Отбор.Вставить("Ссылка", ДанныеВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция выполняет заполнение списка значений 
// данных выбора с учетом настроек параметров учета.
// Поддерживается параметр отбора.
// Обрабатывается также строка поиска.
//
Функция ПолучитьДоступныеЗначения(Отбор, СтрокаПоиска = "") Экспорт
	
	Перем ФормаОплаты, ТипДокумента, ОтборСсылка;  
	
	ДоступныеЗначения 		= Новый СписокЗначений;
	ЕстьНедоступные   		= Ложь;
	ЗначенияДляОтбора		= Новый Массив;
	ЗначенияПоФормеОплаты 	= Новый Массив; 
	ЗначенияПоТипуДокумента = Новый Массив; 
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("ФормаОплаты") И ЗначениеЗаполнено(Отбор.ФормаОплаты) Тогда
			ФормаОплаты = Отбор.ФормаОплаты;
		КонецЕсли;
		Если Отбор.Свойство("ТипДокумента") И ЗначениеЗаполнено(Отбор.ТипДокумента) Тогда
			ТипДокумента = Отбор.ТипДокумента;
		КонецЕсли;
		Если Отбор.Свойство("Ссылка") И ЗначениеЗаполнено(Отбор.Ссылка) Тогда
			ОтборСсылка = Отбор.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФормаОплаты) Тогда
		ЗначенияПоФормеОплаты = ЗначенияПоФормеОплаты(ФормаОплаты);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипДокумента) Тогда
		ЗначенияПоТипуДокумента = ЗначенияПоТипуДокумента(ТипДокумента);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗначенияДляОтбора, ЗначенияПоФормеОплаты);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗначенияДляОтбора, ЗначенияПоТипуДокумента, Истина);
	
	Для каждого ЗначениеПеречисления Из Метаданные.Перечисления.бит_ВидыОперацийКазначейства.ЗначенияПеречисления Цикл
		
		Если ТипЗнч(СтрокаПоиска) = Тип("Строка")
			И НЕ ПустаяСтрока(СтрокаПоиска)
			И СтрНайти(НРег(ЗначениеПеречисления.Синоним), НРег(СтрокаПоиска)) <> 1 Тогда
			Продолжить;
		КонецЕсли;
		Ссылка = Перечисления.бит_ВидыОперацийКазначейства[ЗначениеПеречисления.Имя];
		Если ТипЗнч(ОтборСсылка) = Тип("ПеречислениеСсылка.бит_ВидыОперацийКазначейства")
			И ОтборСсылка <> Ссылка Тогда
			Продолжить;
		ИначеЕсли ТипЗнч(ОтборСсылка) = Тип("ФиксированныйМассив")
			И ОтборСсылка.Найти(Ссылка) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если (ЗначенияПоФормеОплаты.Количество() <> 0 И ЗначенияПоФормеОплаты.Найти(Ссылка) = Неопределено)
		 ИЛИ (ЗначенияПоТипуДокумента.Количество() <> 0 И ЗначенияПоТипуДокумента.Найти(Ссылка) = Неопределено) Тогда
			ЕстьНедоступные = Истина;
			Продолжить;
		КонецЕсли;
		ДоступныеЗначения.Добавить(Ссылка, ЗначениеПеречисления.Синоним);
		
	КонецЦикла;
	
	ДоступныеЗначения.СортироватьПоПредставлению();
	
	Если ДоступныеЗначения.Количество() = 0 Тогда
		ДоступныеЗначения.Добавить(Перечисления.бит_ВидыОперацийКазначейства.ПустаяСсылка());
	КонецЕсли;
	
	Возврат Новый Структура("ДоступныеЗначения, ЕстьНедоступные", ДоступныеЗначения, ЕстьНедоступные);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначенияПоФормеОплаты(ФормаОплаты)
	
	Если ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
		ВидыОпераций = бит_Казначейство.ВидыОперацийПоБанку(Истина);
	Иначе	
		ВидыОпераций = бит_Казначейство.ВидыОперацийСНаличными(Истина);
	КонецЕсли;
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ЗначенияПоТипуДокумента(ТипДокумента)

	Если ТипДокумента = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию") Тогда
		ВидыОпераций = бит_Казначейство.ВидыОперацийЗаявкаНаПереводСредств(Истина);
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") Тогда	
		ВидыОпераций = бит_Казначейство.ВидыОперацийЗаявкаНаПеремещение(Истина);
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		ВидыОпераций = бит_Казначейство.ВидыОперацийЗаявкиНаРасходованиеСредств(Истина);
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.бит_ДополнительныеУсловияПоДоговору") Тогда
		ВидыОпераций = бит_Казначейство.ВидыОперацийДополнительныеУсловияПоДоговору(Истина);	
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
		ВидыОпераций = бит_Казначейство.ВидыОперацийПоступленияДС(Истина);	
	Иначе
		ВидыОпераций = Новый Массив;
	КонецЕсли;
	
	Возврат ВидыОпераций;
	
КонецФункции
 
#КонецОбласти

#КонецЕсли