
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Идентификатор = Параметры.Идентификатор;
	
	ФоновоеЗадание = ИТК_ФоновыеЗадания.Получить(Идентификатор);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ФоновоеЗадание);
	
	РегламентноеЗадание = ФоновоеЗадание.РегламентноеЗадание;
	Если РегламентноеЗадание <> Неопределено Тогда
		
		ИдентификаторРегламентногоЗадания = РегламентноеЗадание.УникальныйИдентификатор;
		НаименованиеРегламентногоЗадания = ИТК_РегламентныеЗадания.Представление(РегламентноеЗадание);
		
	КонецЕсли;
	
	Результат = ИТК_ФоновыеЗадания.СообщенияИОписанияОшибок(ФоновоеЗадание);
	Ошибка = Результат.Ошибка;
	Сообщения = СтрСоединить(Результат.Сообщения, Символы.ПС);
	
	ОбновитьЭлементыФормыПриСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКОшибке(Команда)
	
	ОписаниеОшибкиВМодуле = ИТК_КодКлиентСервер.ОписаниеОшибкиВМодуле(Ошибка);
	ИТК_РедакторКодаКлиент.ОткрытьКодМодуля(ОписаниеОшибкиВМодуле.ИмяМодуля, ОписаниеОшибкиВМодуле.НомерСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.РегламентноеЗадание.Видимость = ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания);
	
	Элементы.Ошибка.Видимость = ЗначениеЗаполнено(Ошибка);
	Элементы.Сообщения.Видимость = ЗначениеЗаполнено(Сообщения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормыПриСозданииНаСервере()
	
	ВыгруженныеФайлы = ИТК_ФайлыКонфигурации.ПутьКФайлам();
	Элементы.ПерейтиКОшибке.Видимость = ЗначениеЗаполнено(ВыгруженныеФайлы) И ЗначениеЗаполнено(Ошибка);
	
КонецПроцедуры

#КонецОбласти