 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура РасчитатьПроцентВыполнениеПоВыпуску(Объект) Экспорт
		
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	//2. Реквизит "(бит)Выполнение по выпуску, %" должен пересчитываться в следующих случаях:
	//
	//Изменение поля "(бит)Количество план" в статусе документа "Выполнено"
	//Изменение "ТЧ "Выходные изделия" в статусе документа "Выполнено"
	//Изменение статуса документа на "Выполнено" с любого другого статуса
	//Формула расчета реквизита:  "(бит)Выполнение по выпуску, %" = ВЫХОД ГП/ "(бит)Количество план"*100
	
	ВыходГП = 0;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТЗ.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	
	Для Каждого СтрокаТЗ Из Объект.ВыходныеИзделия Цикл
		
		НоваяСтрокаТЗ = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, СтрокаТЗ);
		
		НоваяСтрокаТЗ.ВидНоменклатуры = СтрокаТЗ.Номенклатура.ВидНоменклатуры;
		
		Если ЗначениеЗаполнено(СтрокаТЗ.Упаковка) Тогда
			НоваяСтрокаТЗ.ЕдиницаИзмерения = СтрокаТЗ.Упаковка; 
		Иначе                                                  
			НоваяСтрокаТЗ.ЕдиницаИзмерения = СтрокаТЗ.Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ТЗ.Количество КАК Количество,
		|	ТЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ вт_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(вт_ТЗ.Количество) КАК Количество,
		|	вт_ТЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	вт_ТЗ КАК вт_ТЗ
		|ГДЕ
		|	вт_ТЗ.ВидНоменклатуры В(&ВидНоменклатуры)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ТЗ.ЕдиницаИзмерения";
	
	ВидНоменклатуры = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ВидыНоменклатурыГотовойПродукцииВПроизводственнойОперации);
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВыходГП = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла; 
	
	Если  Объект.бит_КоличествоПлан <> 0 Тогда
		Объект.бит_ВыполнениеПоВыпускуПроцент = ВыходГП / Объект.бит_КоличествоПлан * 100; 
	Иначе
		Сообщить("Нельзя расчитать процент выполнения по выпуску, т.к. ""Количество план"" равно 0!");
	КонецЕсли;                                                                                       
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -	
	
КонецПроцедуры

Процедура РасчитатьПроцентВыполнениеПоВремени(Объект) Экспорт
		
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	//3. Реквизит "(бит)Выполнение по времени, %" должен пересчитываться в следующих случаях:
	//
	//Изменение поля "(бит)Время выполнения план" в статусе документа "Выполнено"
	//Изменение поля "Время выполнения" или его единицы измерения в статусе документа "Выполнено"
	//Изменение статуса документа на "Выполнено" с любого другого статуса
	//Формула расчета реквизита:  "(бит)Выполнение по времени, %" = "Время выполнения" / "(бит)Время выполнения план"*100                                                                                     
	
	Если  Объект.бит_ВремяВыполненияПлан <> 0 Тогда
		Объект.бит_ВыполнениеПоВремениПроцент = Объект.ВремяВыполнения / Объект.бит_ВремяВыполненияПлан * 100; 
	Иначе
		Сообщить("Нелья расчитать процент выполнения по времени, т.к. ""Время выполнения план"" равно 0!");
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -	
	
КонецПроцедуры

#КонецЕсли