////////////////////////////////////////////////////////////////////////////////
//
// Учитывает особенности реализации в конфигурации-носителе.
// При обновлении библиотеки переносить только состав процедур и функций без содержимого.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДополнитьНаборХозяйственныхОпераций(ВидыОпераций) Экспорт
	
	// ++ НЕ УТ  
	ОплатаАрендодателю = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОплатаАрендодателю");
	ВидыОпераций.Вставить(ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаАрендодателю"), ОплатаАрендодателю);
	// -- НЕ УТ
	
КонецПроцедуры

#КонецОбласти