#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("Справочник.ТехнологическиеОперации.Форма.бит_ФормаНормыВыработки",ПараметрыФормы,,,,,,);  
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура бит_ЗаполнитьНормыВыработкиИзExcel(Команда)
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 + 
	ОткрытьФорму("Обработка.бит_ЗаполнитьНормыВыработкиИзExcel.Форма");
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -
	
КонецПроцедуры
