////////////////////////////////////////////////////////////////////////////////
// 1С:Бухучет и торговля
//  ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С МЕХАНИЗМОМ ХОЗЯЙСТВЕННЫХ ОПЕРАЦИЙ (ОБЩИЕ) (Сервер).
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Процедура устанавливает субконто на счете. Если такое субконто на счете
// отсутствует, то ничего не делается.
// 
// Параметры:
//  Счет 			  - Счет, к которому относится субконто.
//  Субконто 		  - Набор субконто.
// 	ИмяСубконто 	  - Номер или имя установливаемого субконто.
//  Значение субконто - значение устанавливаемого субконто.
//  Сообщать		  - Булево (По умолчанию = Ложь).
//  Заголовок		  - Строка (По умолчанию = "").
//  ВидыСубконтоСчета - (По умолчанию = Неопределено).
// 
Процедура бит_УстановитьСубконто(Счет, Субконто, ИмяСубконто, ЗначениеСубконто, Сообщать = Ложь, Заголовок = "", ВидыСубконтоСчета = Неопределено) Экспорт

	Если Счет = Неопределено ИЛИ Счет.Пустая() Тогда
		Возврат;
	КонецЕсли;

    СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
    ПВХ = Счет.Метаданные().ВидыСубконто.Имя;
    
	Если ТипЗнч(ИмяСубконто) = Тип("Число") Тогда

        Если ИмяСубконто > СвСч.КоличествоСубконто Тогда
			Возврат;
		КонецЕсли;

        ВидСубк = СвСч["ВидСубконто" + ИмяСубконто];

    Иначе
        
        Если ВидыСубконтоСчета = Неопределено Тогда
	        ВидыСубконтоСчета = Счет.ВидыСубконто;
	    КонецЕсли;
		ВидСубк = ПланыВидовХарактеристик[ПВХ][ИмяСубконто];
		Если ВидыСубконтоСчета.Найти(ВидСубк) = Неопределено Тогда
			Если Сообщать Тогда
				ТекстСообщения = НСтр("ru='Вид субконто <%1> для счета ""%2 (%3)"" не определен.';
									  |en='The type of sub-account <%1> for the account ""%2 (%3)"" is not defined.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ВидСубк, СвСч.Код, СвСч.Наименование);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
			КонецЕсли;
			Возврат;
		КонецЕсли;

	КонецЕсли;

	Если ВидСубк.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
		Субконто.Вставить(ВидСубк, ЗначениеСубконто);
	ИначеЕсли Сообщать Тогда
		ТекстСообщения = НСтр("ru='Неверное значение ""%1"" для вида субконто <%2>';
							  |en='Invalid value ""%1"" to form subkonto <%2>'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗначениеСубконто, ВидСубк);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
	КонецЕсли;

КонецПроцедуры

// Функция убирает из текста сообщения слущебную информацию.
// 
// Параметры:
//  ТекстСообщения, Строка, исходный текст сообщения.
//
// Возвращаемое значение:
//  Строка.
// 
Функция бит_СформироватьТекстСообщения(Знач ТекстСообщения) Экспорт

	НачалоСлужебногоСообщения    = Найти(ТекстСообщения, "{");
	ОкончаниеСлужебногоСообщения = Найти(ТекстСообщения, "}:");
	
	Если ОкончаниеСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения < ОкончаниеСлужебногоСообщения Тогда
		
		ТекстСообщения = Лев(ТекстСообщения, (НачалоСлужебногоСообщения - 1)) 
						 + Сред(ТекстСообщения, (ОкончаниеСлужебногоСообщения + 2));
						 
	КонецЕсли;
	
	Возврат СокрЛП(ТекстСообщения);

КонецФункции

// Выводит сообщение об ошибке и выставляет параметр Отказ в "Истина". 
// В случае работы на клиенте или на сервере выводит в окно сообщений,
// в случае внешнего соединения вызывает исключение.
// 
// Параметры:
//  ТекстСообщения - Строка, текст сообщения.
//  Отказ          - Булево, признак отказа (необязательный).
//  Заголовок	   - Строка (По умолчанию = "").
// 
Процедура бит_СообщитьОбОшибке(Знач ТекстСообщения, Отказ = Ложь, Заголовок = "") Экспорт

	ТекстСообщения = бит_СформироватьТекстСообщения(ТекстСообщения);
	Отказ = Истина;
	
	ТекстСообщения = НСтр("ru='" + ТекстСообщения + "'");
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
	
КонецПроцедуры

#Область ФункцииВызываемыеВШаблонах

// Функция выполняет пересчет из валюты регл в валюту упр.
// Предпогалается, что курс валюты Упр получен при формировании СтруктурыШапкиДокумента.
// Если период, на который необходимо выполнить пересчет не совападает с датой документа, 
// курс будет получен в процедуре.
// 
// Параметры:
//  Сумма 					- Число.
//  Период 					- Дата.
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  Число - сумма.
//
Функция ПересчитатьРеглУпр(Сумма, Период, СтруктураШапкиДокумента) Экспорт
	
	РезСумма = бит_МеханизмТрансляции.ПересчитатьРеглУпр(Сумма, Период, СтруктураШапкиДокумента);
		
	Возврат РезСумма;
	
КонецФункции

// Функция выполняет пересчет из валюты регл в валюту международного учета.
// Предпогалается, что курс валюты МУ получен при формировании СтруктурыШапкиДокумента.
// 
// Параметры:
//  Сумма 					- Число.
//  Период 					- Дата.
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  Число - сумма.
// 
Функция ПересчитатьРеглМУ(Сумма, Период, СтруктураШапкиДокумента) Экспорт

	РезСумма = бит_МеханизмТрансляции.ПересчитатьРеглМУ(Сумма,Период,СтруктураШапкиДокумента);

	Возврат РезСумма;
	
КонецФункции

// Функция выполняет пересчет из валюты регл в валюту сценария.
// 
// Параметры:
//  Сумма 					- Число.
//  Период 					- Дата.
//  Сценарий 				- СправочникСсылка.СценарииПланирования.
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  Число - сумма.
// 
Функция ПересчитатьРеглСценарий(Сумма, Период, Сценарий, СтруктураШапкиДокумента) Экспорт

	РезСумма = бит_МеханизмТрансляции.ПересчитатьРеглСценарий(Сумма, Период, Сценарий, СтруктураШапкиДокумента);

	Возврат РезСумма;
	
КонецФункции

// Функция выполняет валютные пересчеты.
// 
// Параметры:
//  Сумма 	  - Число.
//  Период 	  - Дата.
//  ВалютаНач - СправочникСсылка.Валюты.
//  ВалютаКон - СправочникСсылка.Валюты.
// 
// Возвращаемое значение:
//  Число - сумма.
// 
Функция ПересчитатьПоВалюте(Сумма, Период, ВалютаНач, ВалютаКон) Экспорт

	РезСумма = бит_МеханизмТрансляции.ПересчитатьПоВалюте(Сумма, Период, ВалютаНач, ВалютаКон);
		
	Возврат РезСумма;
	
КонецФункции

#КонецОбласти

#КонецОбласти
