&НаКлиенте
Процедура ВыбратьФайлExcel(ДополнительныеПараметры) Экспорт	
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "(*.xls;*.xlsx)|*.xls;*.xlsx|"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь;	
	
	ДополнительныеПараметры.Вставить("Диалог", Диалог);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьФайлаExcelЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Диалог.Показать(ОписаниеОповещения);		  
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлаExcelЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбора = ДополнительныеПараметры.Диалог; 
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда				
		
		ОчиститьСообщения();
		                                              
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
		
		АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
		
		бит_ОбщегоНазначенияСервер.ПолучитьТаблицуЗначенийИзФайла(АдресФайла
			, ИмяФайла
			, ДополнительныеПараметры.АдресТЗ
			, ДополнительныеПараметры.НомерКолонкиСДанными
			, ДополнительныеПараметры.НомерСтрокиСДанными
			, ДополнительныеПараметры.АдресТЗОписанияТиповКолонок);
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаОповещения, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

