
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастраиваемаяБухгалтерскаяОтчетность.НастроитьКомандыГенерацииНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ГенерацияПравилНастраиваемойОтчетности" Тогда
		ЭтотОбъект.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуНастройки(Команда)
	
	ОткрытьФорму("Справочник.НастройкиЗаполненияБухОтчетности.Форма.НастройкиЗаполненияОтчетности", Новый Структура("Настройка", Объект.Ссылка));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
// Программно генерируемая команда создания настроек.
// 
// Параметры:
//  Команда - КомандаКомандногоИнтерфейса
&НаКлиенте
Процедура СгенерироватьНастройкиПоУмолчанию(Команда) Экспорт
	
	НастраиваемаяБухгалтерскаяОтчетностьКлиент.СгенерироватьНастройкиПоУмолчанию(Объект.Ссылка, ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти