 
&НаСервере 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры_ = ЭтаФорма.Параметры;
	Параметры_.СформироватьПриОткрытии = Истина;
	
	АвтоОтображениеСостояния = РежимАвтоОтображенияСостояния.НеОтображать
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Ссылка"); 
	//Если ПараметрДанных.Значение.Количество() > 0 Тогда 
	ПараметрПользовательскойНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
	ПараметрПользовательскойНастройки.Значение = ПараметрДанных.Значение;
	ПараметрПользовательскойНастройки.Использование = Истина;
	//КонецЕсли;
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
    ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
    ЭтотОтчет.СкомпоноватьРезультат(Результат);
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	
	ПараметрыВызова = ЭтаФорма.Параметры; 
	ПараметрыВызова.СформироватьПриОткрытии = Истина;
	Если ПараметрыВызова.Свойство("ПараметрКоманды") Тогда 
		ПараметрыВызова = ПараметрыВызова.ПараметрКоманды;
		Если Не ПараметрыВызова[0].Ссылка = Документы.бит_РасчетПремии.ПустаяСсылка() И ПараметрыВызова.Количество() > 0 Тогда
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка", ПараметрыВызова[0].Ссылка);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры