
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.РесурснаяСпецификация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вызов обработки допустим только из формы ресурсной спецификации");
		Возврат;
	КонецЕсли;
	
	Если не УправлениеДоступом.ЕстьРоль("Пакетное создание правил наследования") Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно прав для работы с обработкой");
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры
