////////////////////////////////////////////////////////////////////////////////
// Модуль содержит методы работы со строками.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСШаблонамиТекста

// Процедура преобразует текст шаблона в сообщение.
//
// Параметры:
//  ТекстШаблона 		- Строка.
//  СтруктураКонтекст   - Структура.
//  СтруктураПараметров - Структура.
//
Функция ОбработатьТекстШаблона(ТекстШаблона, СтруктураКонтекст, СтруктураПараметров=Неопределено) Экспорт
	
	// Дополним в случае необходимости структуру параметров.
	ОбработатьСтруктуруПараметров(СтруктураПараметров);
	
	// Результат обработки текста шаблона, происходит постепенное преобразование.
	РезультатОбработки = ТекстШаблона;
	
	// Заполним параметры шаблона
	ЗаполнитьПараметрыШаблона(РезультатОбработки, СтруктураКонтекст, СтруктураПараметров);
	
	// Сформируем массив управляющих конструкций.
	МассивСинтаксическихКонструкций = СинтаксическиеКонструкции(РезультатОбработки, СтруктураКонтекст, СтруктураПараметров);
	
	ИсполняемыйКод = ПолучитьПрограммныйКодИзШаблона(РезультатОбработки, МассивСинтаксическихКонструкций, СтруктураПараметров);
	
	ТекстПодстановки = ВыполнитьПрограммныйКодШаблона(ИсполняемыйКод, СтруктураКонтекст, СтруктураПараметров);
	
	Если ТекстПодстановки <> Неопределено Тогда
		
		НомерНач = МассивСинтаксическихКонструкций[0].НомерПозиции;
		НомерКон = МассивСинтаксическихКонструкций[МассивСинтаксическихКонструкций.ВГраница()].НомерПозицииКонец-НомерНач+1;
		
		ЗаменяемыйТекст = Сред(РезультатОбработки, НомерНач, НомерКон);
		
		РезультатОбработки = СтрЗаменить(РезультатОбработки, ЗаменяемыйТекст, ТекстПодстановки);
		
	КонецЕсли;
	
	// Возможно в тексте шаблона присутствуют операторы встроенного языка вне управляющих конструкций.
	ЗаполнитьВыраженияШаблона(РезультатОбработки, СтруктураПараметров, Ложь, СтруктураКонтекст);
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецОбласти

// Функция разбирает текст на разных языках.
// 
// Параметры:
//  СтрИсходная - Структура.
// 
// Возвращаемое значение:
//  Структура.
// 
Функция РазобратьТекстНаЯзыки(СтрИсходная) Экспорт
	
	РезСтр = Новый Структура;
	
	МассивСтрок = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(СтрИсходная, """;");	
	Для каждого элемент Из МассивСтрок Цикл
		
		позицияРавно = Найти(Элемент, "=");		
		Если позицияРавно > 0 Тогда
			
			// Выделим код языка.
			СтрКод = Лев(Элемент,позицияРавно-1);
			СтрКод = СтрЗаменить(СтрКод," ","");
			СтрКод = СтрЗаменить(СтрКод,";","");
			СтрКод = СокрЛП(СтрКод);
			
			// Выделим текст.
			СтрТекст = Сред(Элемент,ПозицияРавно+1);
			СтрТекст = СокрЛП(СтрТекст);
			
			// Уберем начальную кавычку.
			Если Лев(СтрТекст,1) = """" Тогда				
				СтрТекст = Сред(СтрТекст,2);				
			КонецЕсли;	
			
			// Уберем конечную кавычку.
			Если Прав(СтрТекст,1) = """" Тогда				
				СтрТекст = Сред(СтрТекст,1,СтрДлина(СтрТекст)-1);				
			КонецЕсли;	
			
			Если НЕ ПустаяСтрока(СтрКод) Тогда				
				РезСтр.Вставить(СтрКод,СтрТекст);				
			КонецЕсли; 
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат РезСтр;
	
КонецФункции // РазобратьТекстНаЯзыки()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСШаблонамиТекста

// Функция определяет параметры, используемые в данном шаблоне.
// 
// Параметры:
//  ШаблонСообщения    - Строка
//  ПараметрыТекста    - Соответствие.
// 
// Возвращаемое значение:
//   ПараметрыТекста   - Соответствие.
// 
Процедура ОпределитьПараметрыТекста(ШаблонТекста, ПараметрыТекста = Неопределено, СтрОткрытие="{{", СтрЗакрытие="}}")
	
	Если ПараметрыТекста = Неопределено Тогда 		
		ПараметрыТекста = Новый Соответствие; 		
	КонецЕсли; 
	
	Стр = ШаблонТекста;	
	ЧислоШаблонов = СтрЧислоВхождений(Стр, СтрОткрытие);
	Для н = 1 По ЧислоШаблонов Цикл
		
		НомерСимволаОткрытие = Найти(Стр, СтрОткрытие);
		Если НомерСимволаОткрытие > 0 Тогда
			
			Стр = Сред(Стр,НомерСимволаОткрытие + 2);
			НомерСимволаЗакрытие = Найти(Стр, СтрЗакрытие);
			Если НомерСимволаЗакрытие > 0 Тогда
				
				ИмяПараметра = СокрЛП(Лев(Стр, НомерСимволаЗакрытие - 1));							
				Если ПараметрыТекста[ИмяПараметра] = Неопределено Тогда
					ПараметрыТекста.Вставить(ИмяПараметра);
				КонецЕсли; 
				Стр = Сред(Стр,НомерСимволаЗакрытие + 2);
				
			КонецЕсли; // Нашли закрытие
			
		КонецЕсли; // Нашли открытие
		
	КонецЦикла; // По количеству параметров в тексте
	
КонецПроцедуры // ОпределитьПараметрыТекста()

// Процедура проверяет наличие в структуре параметров обязательных значений.
// 
// Параметры:
// 	СтруктураПараметров - структура - дополнительные настройки влияющие на обработку текста шаблона.
// 
Процедура ОбработатьСтруктуруПараметров(СтруктураПараметров)
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
	КонецЕсли;
	
	// Определим синтаксис шаблона
	
	// Выделение в тексте выражений - текст который воспринимается как программный код 1С.
	Если НЕ СтруктураПараметров.Свойство("НачалоВстроенныйЯзык") Тогда
		СтруктураПараметров.Вставить("НачалоВстроенныйЯзык", "{%");
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("КонецВстроенныйЯзык") Тогда
		СтруктураПараметров.Вставить("КонецВстроенныйЯзык", "%}");
	КонецЕсли;
	
	// Выделение в тексте параметров - подстановка осуществляется из СтруктураКонтекст.
	Если НЕ СтруктураПараметров.Свойство("НачалоПараметр") Тогда
		СтруктураПараметров.Вставить("НачалоПараметр", "{{");
	КонецЕсли;
	Если НЕ СтруктураПараметров.Свойство("КонецПараметр") Тогда
		СтруктураПараметров.Вставить("КонецПараметр", "}}");
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет параметры в тексте шаблона.
// 
// Параметры:
// 	ТекстШаблона - строка - текст шаблона.
// 	СтруктураКонтекст - структура - содержит параметры для подстановки.
// 	СтруктураПараметров - структура - дополнительные настройки влияющие на обработку текста шаблона.
// 
Процедура ЗаполнитьПараметрыШаблона(ТекстШаблона, СтруктураКонтекст, СтруктураПараметров)
	
	// Получим символы выделения параметров в тексте шаблона.
	СтрОткрытие = СтруктураПараметров.НачалоПараметр;
	СтрЗакрытие = СтруктураПараметров.КонецПараметр;
	
	ПараметрыТекста = Новый Соответствие;
	
	// Определим параметры шаблона
	ОпределитьПараметрыТекста(ТекстШаблона,ПараметрыТекста, СтрОткрытие, СтрЗакрытие);
	
	ЭтоHTML = Ложь;
	Если СтрНайти(ТекстШаблона, "<!DOCTYPE") > 0 И СтрНайти(ТекстШаблона, "<body>") > 0 Тогда
		ЭтоHTML = Истина;
	КонецЕсли;
	
	Для Каждого КиЗ Из ПараметрыТекста Цикл
		
		СтрШаблон = СтрОткрытие + КиЗ.Ключ + СтрЗакрытие;
		
		// Вычислим значения параметров шаблона
		Выражение = "СтруктураКонтекст." + КиЗ.Ключ;
		Попытка			
			ЗначениеШаблона = Строка(Вычислить(Выражение));  			
		Исключение			
			ЗначениеШаблона = СтрШаблон; 			
		КонецПопытки;
		
		// Outlook игнорирует большинство настроек CSS, пришлось усилить уже указанный стиль "white-space: pre-wrap".
		// Явно указан перенос строк и отступы пробелами заменены на неразрывные пробелы.
		Если ЭтоHTML Тогда
			ЗначениеШаблона = СтрЗаменить(ЗначениеШаблона, Символы.ПС, "<br/>");
			ЗначениеШаблона = СтрЗаменить(ЗначениеШаблона, " ", "&nbsp;");
		КонецЕсли;
		
		// Подставим вычисленные значения параметров в шаблон.
		ТекстШаблона = СтрЗаменить(ТекстШаблона, СтрШаблон, ЗначениеШаблона);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПараметрыШаблона()

// Процедура заполняет выражения в тексте шаблона.
// 
// Параметры:
// 	ТекстШаблона - строка - текст шаблона
// 	СтруктураПараметров - структура - дополнительные настройки влияющие на обработку текста шаблона
// 	КонкатенацияСтрок - булево - Истина - 
// 
Процедура ЗаполнитьВыраженияШаблона(ТекстШаблона, СтруктураПараметров, КонкатенацияСтрок = Истина, СтруктураКонтекст = Неопределено)
	
	// Получим символы выделения выражений в тексте шаблона.
	СтрОткрытие = СтруктураПараметров.НачалоВстроенныйЯзык;
	СтрЗакрытие = СтруктураПараметров.КонецВстроенныйЯзык;
	
	ПараметрыТекста = Новый Соответствие;
	
	ОпределитьПараметрыТекста(ТекстШаблона, ПараметрыТекста, СтрОткрытие,СтрЗакрытие);
	
	Для Каждого КиЗ Из ПараметрыТекста Цикл
		
		СтрШаблон = СтрОткрытие + КиЗ.Ключ + СтрЗакрытие;
		
		Если КонкатенацияСтрок Тогда
			ТекстВыражения = """+" + КиЗ.Ключ + "+""";
		Иначе
			Попытка
				ТекстВыражения = Строка(Вычислить(КиЗ.Ключ));
			Исключение
				ТекстВыражения = СтрШаблон;
			КонецПопытки;
		КонецЕсли;
		
		ТекстШаблона = СтрЗаменить(ТекстШаблона, СтрШаблон, ТекстВыражения);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьВыраженияШаблона()

// Функция обрабатывает текст шаблона для поиска исполняемого кода
// 	Исполняемый код предназначен для динамического формирования текста.
// 
// Параметры:
// 	ТекстШаблона - строка - текст шаблона.
// 	МассивКонструкций - массив - содержит информацию по используемым в шаблоне управляющих конструкций.
// 	СтруктураПараметров - структура - дополнительные настройки.
// 
// Возвращаемое значение:
// 	ИсполняемыйКод - строка - программный код на встроенном языке 1С.
// 
Функция ПолучитьПрограммныйКодИзШаблона(ТекстШаблона, МассивКонструкций, СтруктураПараметров)
	
	ИсполняемыйКод   = "";
	ПовторяемыйТекст = "";
	
	ПозицияПредКонец = Неопределено;
	
	Для Каждого ТекущаяКонструкция Из МассивКонструкций Цикл 
		
		Если НЕ ПозицияПредКонец = Неопределено Тогда
			// Текст между окончанием предыдущей конструкции и началом следующей будет повторяться.
			ПовторяемыйТекст = Сред(ТекстШаблона, ПозицияПредКонец+1, ТекущаяКонструкция.НомерПозиции-ПозицияПредКонец-1);
			
			ПовторяемыйТекст = СтрЗаменить(СокрЛ(ПовторяемыйТекст), Символы.ПС, Символы.ПС+"|");
			
			ЗаполнитьВыраженияШаблона(ПовторяемыйТекст, СтруктураПараметров);
		КонецЕсли;
		
		Если ТекущаяКонструкция.ВидКонструкции = "ЦИКЛ" Тогда
			
			УправляющаяКонструкция = ЗаполнитьВыражениеВКонструкции(ТекущаяКонструкция);
			
			ИсполняемыйКод = ИсполняемыйКод + ?(ПустаяСтрока(ИсполняемыйКод),"",Символы.ПС)
			+"РезультирующийТекст = РезультирующийТекст + """+ПовторяемыйТекст+""";
			|"+УправляющаяКонструкция;
			
		ИначеЕсли ТекущаяКонструкция.ВидКонструкции = "КОНЕЦЦИКЛА" Тогда
			
			ИсполняемыйКод = ИсполняемыйКод + ?(ПустаяСтрока(ИсполняемыйКод),"",Символы.ПС)
			+"РезультирующийТекст = РезультирующийТекст + """+ПовторяемыйТекст+""";
			|"+ТекущаяКонструкция.Конструкция+";";
			
		КонецЕсли;
		
		ПозицияПредКонец = ТекущаяКонструкция.НомерПозицииКонец;
		
	КонецЦикла;
	
	Возврат ИсполняемыйКод;
	
КонецФункции // ПолучитьПрограммныйКодИзШаблона()	

// Функция заполняет выражение в конструкции.
// 
// Параметры:
// 	Конструкция - структура
// 
Функция ЗаполнитьВыражениеВКонструкции(ОписаниеКонструкции)
	
	Результат = ОписаниеКонструкции.Конструкция;
	
	Если ОписаниеКонструкции.ВидКонструкции = "ЦИКЛ" Тогда
		
		ДлинаСтроки = СтрДлина(ОписаниеКонструкции.Конструкция);
		
		Если ВРег(Лев(ОписаниеКонструкции.Конструкция,4))="ДЛЯ " Тогда
			
			НачалоИз = Найти(ВРег(ОписаниеКонструкции.Конструкция), " ИЗ ");
			
			Если НЕ НачалоИз = 0 Тогда
				// Получим имя коллекции которую собираемся обходить в цикле.
				ИмяКоллекции = Сред(ОписаниеКонструкции.Конструкция, НачалоИз+4, ДлинаСтроки-НачалоИз-8);
				
				// Саму коллекцию берем из переданной структуры.
				ТекстЗамены = " СтруктураКонтекст."+ИмяКоллекции+" ";
				
				Результат = СтрЗаменить(ОписаниеКонструкции.Конструкция, " "+ИмяКоллекции+" ", ТекстЗамены);
			КонецЕсли;
			
		ИначеЕсли ВРег(Лев(ОписаниеКонструкции.Конструкция,5))="ПОКА " Тогда
			// Для данного вида цикла ничего сами подставлять не будем.
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЗаполнитьВыражениеВКонструкции()

// Функция исполняет программный код полученный из шаблона.
// 
// Параметры:
// 	ИсполняемыйКод - строка - программный код на встроенном языке 1С.
// 	СтруктураКонтекст - структура - содержит параметры для подстановки.
// 	СтруктураПараметров - структура - дополнительные параметры.
// 
// Возвращаемое значение:
// 	РезультирующийТекст - строка - .
// 
Функция ВыполнитьПрограммныйКодШаблона(ИсполняемыйКод, СтруктураКонтекст, СтруктураПараметров)
	
	Если НЕ ЗначениеЗаполнено(ИсполняемыйКод) Тогда
		РезультирующийТекст = Неопределено;
	Иначе
		РезультирующийТекст = "";
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	Попытка
		Выполнить(ИсполняемыйКод);
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		// Сообщить(ТекстОшибки);
		
		ЕстьОшибки = Истина;
		
		РезультирующийТекст = Неопределено;
	КонецПопытки;
	
	Возврат РезультирующийТекст;
	
КонецФункции // ВыполнитьПрограммныйКодШаблона()

// Процедура получает управляющие конструкции из текста шаблона.
// 
// Параметры:
// 	ТекстШаблона - строка - текст шаблона.
// 	СтруктураКонтекст - структура - содержит параметры для подстановки.
// 	СтруктураПараметров - структура - дополнительные настройки влияющие на обработку текста шаблона.
// 
Функция СинтаксическиеКонструкции(ТекстШаблона, СтруктураКонтекст, СтруктураПараметров)
	
	МассивКонструкций = Новый Массив;
	
	// Получим символы, которыми выделяются границы управляющих конструкций в шаблоне.
	НачалоВстроенныйЯзык = СтруктураПараметров.НачалоВстроенныйЯзык;
	КонецВстроенныйЯзык  = СтруктураПараметров.КонецВстроенныйЯзык;
	
	// Предполагаемое число конструкций
	ЧислоВхождений = СтрЧислоВхождений(ТекстШаблона, НачалоВстроенныйЯзык);
	
	// Хранит номер первого символа конструкции в тексте шаблона.
	НомерПозиции = 0;
	
	Стр = ТекстШаблона;
	
	Для Ном = 0 По ЧислоВхождений Цикл
		
		НомерСимволаНачало = Найти(Стр, НачалоВстроенныйЯзык);		
		НомерПозиции 	   = НомерПозиции + НомерСимволаНачало;
		
		Если НомерСимволаНачало > 0 Тогда
			
			Стр 			  = Сред(Стр, НомерСимволаНачало + 2);			
			НомерСимволаКонец = Найти(Стр, КонецВстроенныйЯзык);			
			Если НомерСимволаКонец > 0 Тогда
				
				// Текст конструкции
				Конструкция = СокрЛП(Лев(Стр, НомерСимволаКонец - 1));				
				ВидКонструкции = ОпределитьВидКонструкции(Конструкция);				
				Если ВидКонструкции <> Неопределено Тогда
					
					ИнфоКонструкции = Новый Структура;					
					ИнфоКонструкции.Вставить("Конструкция"		, Конструкция);
					ИнфоКонструкции.Вставить("ВидКонструкции"	, ВидКонструкции);
					ИнфоКонструкции.Вставить("НомерПозиции"		, НомерПозиции);
					ИнфоКонструкции.Вставить("НомерПозицииКонец", НомерПозиции + (НомерСимволаКонец+2));					
					МассивКонструкций.Добавить(ИнфоКонструкции);
					
				КонецЕсли;
				
				Стр 		 = Сред(Стр, НомерСимволаКонец + 2);				
				НомерПозиции = НомерПозиции + НомерСимволаКонец;				
			КонецЕсли;
			
			НомерПозиции = НомерПозиции + 2;			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивКонструкций;
	
КонецФункции // СинтаксическиеКонструкции()

// Функция определяет вид переданной конструкции.
// 
// Параметры:
// 	УправляющаяКонструкция - структура - информация по конструкции.
// 
// Возвращаемое значение:
// 	ВидКонструкции - строка, Неопределено.
// 
Функция ОпределитьВидКонструкции(УправляющаяКонструкция)
	
	ВидКонструкции = Неопределено;
	
	Стр = СокрЛП(УправляющаяКонструкция);
	
	Если ВРег(Лев(Стр,4))="ДЛЯ "
		И ВРег(Прав(Стр,5))=" ЦИКЛ" Тогда
		
		ВидКонструкции = "ЦИКЛ";
		
	ИначеЕсли ВРег(Лев(Стр,5))="ПОКА "	
		И ВРег(Прав(Стр,5))=" ЦИКЛ" Тогда
		
		ВидКонструкции = "ЦИКЛ";
		
	ИначеЕсли ВРег(Стр)="КОНЕЦЦИКЛА" Тогда
		
		ВидКонструкции = "КОНЕЦЦИКЛА";
		
	КонецЕсли;
	
	
	Возврат ВидКонструкции;
	
КонецФункции // ОпределитьВидКонструкции()

#КонецОбласти

#КонецОбласти
