
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Поле.Родитель = Неопределено 
		 И Поле.Родитель.Имя = "ГруппаУУ"  Тогда
	
		 ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
		 Если ЗначениеЗаполнено(ТекущаяСтрока.Отражение) Тогда
			 
			 СтандартнаяОбработка = Ложь;
			 ОткрытьЗначение(ТекущаяСтрока.Отражение);
			 
		 КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеОтраженийФакта(Команда)
	
	ОткрытьФорму("Обработка.бит_ИзменениеОтраженийФакта.Форма");
	
КонецПроцедуры
