
#Область СлужебныйПрограммныйИнтерфейс

#Область ПроцедурыИФункцииВызываемыеВСгенерированномКоде

// АПК:581-выкл Подключаемые процедуры и функции в тексте исполняемого кода "правила трансляции".

// Функция извлекает значение дополнительного реквизита.
// 
// Параметры:
//   Источник - ДокументСсылка, СправочникСсылка.
//   ВидРеквизита - Строка.
//   ИмяРеквизита - Строка.
// 
// Возвращаемое значение:
//  Результат - Произвольный.
// 
Функция ЗначениеДопРеквизита(Источник, Параметр1, Параметр2 = Неопределено) Экспорт
	
	Если Источник = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЭтоОбъект = Ложь;
	XMLТип    = XMLТипЗнч(Источник);
	Если XMLТип <> Неопределено Тогда
		ТипЗначенияСтрокой = XMLТип.ИмяТипа;
		ЭтоОбъект = СтрНайти(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
	
	Если ЭтоОбъект Тогда
		СсылкаНаОбъект = Источник.Ссылка;
	Иначе
		СсылкаНаОбъект = Источник;
	КонецЕсли;
	
	Если Параметр2 = Неопределено Тогда
		ИмяРеквизита = Параметр1;
		Возврат ЗначениеДопРеквизитаСУканазиемКодаСвойства(СсылкаНаОбъект, ИмяРеквизита);
	КонецЕсли;
	
	ВидРеквизита = Параметр1;
	ИмяРеквизита = Параметр2;
	
	Возврат ЗначениеДопРеквизитаОсновнойАглоритм(СсылкаНаОбъект, ВидРеквизита, ИмяРеквизита);
	
КонецФункции

// Процедура получает значение субконто по номеру субконто или по имени субконто. 
// Возможно получение реквизитов субконто по имени. Имя субконто должно иметь следующий формат
// Субконто.[ИмяСубконто].[ИмяРеквизита].[ИмяРеквизита].
// Возможен вызов в сгенерированом коде условия трансляции.
// 
// Параметры:
//  ЗаписьИсточник 		 - РегистрБухгалтерииЗапись,РегистрНакопленияЗапись.
//  ДтКт           		 - Строка(2) - "Дт","Кт".
//  ИмяСубконто    		 - Число,Строка,ПланВидовХарактеристикСсылка.
// 
Функция ЗначениеСубконто(ЗаписьИсточник, ДтКт, ИмяСубконто) Экспорт

	РезЗначение = Неопределено;
	
	Счет = ЗаписьИсточник["Счет"+ДтКт];
	
	Если ТипЗнч(ИмяСубконто) = Тип("Число") Тогда
		
		// Получение значения субконто по номеру
        СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
		Если ИмяСубконто <= СвСч.КоличествоСубконто Тогда
            ВидСубконто = СвСч["ВидСубконто" + ИмяСубконто];
			РезЗначение = ЗаписьИсточник["Субконто"+ДтКт][ВидСубконто];
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(ИмяСубконто) = Тип("Строка") Тогда
		
		// Получение субконто и реквизитов субконто
		МассивИмен = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(ИмяСубконто,".");
		Если МассивИмен.Количество()>1 Тогда
			
			// Первое имя - имя вида субконто
			ИмяВидаСубконто = Счет.Метаданные().ВидыСубконто.Имя;
			ВидСубконто = НайтиВидСубконто(ИмяВидаСубконто,МассивИмен[1]);
			РезЗначение = ЗаписьИсточник["Субконто"+ДтКт][ВидСубконто];
			 
			 // Остальные - имена реквизитов
			 Для й=2 По МассивИмен.Количество()-1 Цикл
				 
				 Если РезЗначение <> Неопределено Тогда
					 
					 ИмяРеквизита = МассивИмен[й];
					 
					 Если ЭтоДопРеквизит(ИмяРеквизита) Тогда
						 
						 // Извлечение дополнительных реквизитов/свойств.
						 ИменаДоп = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(ИмяРеквизита,"_");
						 Если ИменаДоп.Количество() = 2 Тогда
						 	РезЗначение = ЗначениеДопРеквизита(РезЗначение, ИменаДоп[0], ИменаДоп[1]);
						 Иначе
						 	РезЗначение = ЗначениеДопРеквизита(РезЗначение, ИмяРеквизита);
						КонецЕсли;
						 
					 Иначе	
						 
						 // Извлечение обычного реквизита
						 Попытка
							 РезЗначение = РезЗначение[ИмяРеквизита];
						 Исключение
							 РезЗначение = Неопределено;
						 КонецПопытки;
					 КонецЕсли; 
				 КонецЕсли; 
			 КонецЦикла;// По именам реквизитов 
		КонецЕсли; // МассивИмен.Количество()>0
		
	Иначе
		
		ИмяПВХ  = Счет.Метаданные().ВидыСубконто.Имя;

		Если ТипЗнч(ИмяСубконто) = ТипЗнч(ПланыВидовХарактеристик[ИмяПВХ].ПустаяСсылка()) Тогда
		
			// В качестве имени указано непосредственно ссылка на ПВХ.
			РезЗначение = ЗаписьИсточник["Субконто"+ДтКт][ИмяСубконто];
		
		КонецЕсли; 
		
	КонецЕсли; // Условие по типу имени

	Возврат РезЗначение;
	
КонецФункции // ЗначениеСубконто()

// Функция получает значение параметра из кэша реквизитов.
// Возможен вызов в сгенерированом коде условия трансляции.
// 
// Параметры:
//  ИДСтроки  - Строка.
//  ИмяКолонки- Строка.
//  КэшРеквизитов - ТаблицаЗначений.
// 
// Возвращаемое значение:
//   РезЗначение   - Произвольный.
// 
Функция ЗначениеПараметра(ИДСтроки,ИмяКолонки,КэшРеквизитов) Экспорт
	
	РезЗначение = Неопределено;
	
	Если ТипЗнч(КэшРеквизитов) = Тип("ТаблицаЗначений") Тогда
		
		СтрОтбор = Новый Структура("ИД,ИмяКолонки",ИДСтроки,ИмяКолонки);
		МассивСтрок = КэшРеквизитов.НайтиСтроки(СтрОтбор);
		Если МассивСтрок.Количество()>0 Тогда
			
			РезЗначение = МассивСтрок[0].Значение;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат РезЗначение;
	
КонецФункции // ЗначениеРеквизита()

// Функция получает значения реквизитов документа-регистратороа.
// 
// Параметры:
//  ДокументОбъект  - ДокументОбъект.
//  ИмяРеквизита    - Строка -имя реквизита имеет формат Регистратор.<ИмяРегистратора>.<Реквизит1>.<Реквизит2>.
// 
// Возвращаемое значение:
//   РезЗначение   - Произвольный.
// 
Функция ЗначениеРеквизита(ДокументОбъект,ИмяРеквизита)   Экспорт

	РезЗначение = Неопределено;
	
	МассивИмен = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(ИмяРеквизита,".");

	Если МассивИмен.Количество()>2 Тогда
		
		РезЗначение = ДокументОбъект;
		
		// Остальные - имена реквизитов
		Для й=2 По МассивИмен.Количество()-1 Цикл
			
			Если РезЗначение <> Неопределено Тогда
				
				ИмяРеквизита = МассивИмен[й];
				
				Если ЭтоДопРеквизит(ИмяРеквизита) Тогда
					
					// Извлечение дополнительных реквизитов/свойств.
					ИменаДоп = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(ИмяРеквизита,"_");
					Если ИменаДоп.Количество() = 2 Тогда
						РезЗначение = ЗначениеДопРеквизита(РезЗначение, ИменаДоп[0], ИменаДоп[1]);
					Иначе
						РезЗначение = ЗначениеДопРеквизита(РезЗначение, ИмяРеквизита);
					КонецЕсли;
					
				Иначе	
					
					// Извлечение обычного реквизита
					Попытка
						РезЗначение = РезЗначение[ИмяРеквизита];
					Исключение
						РезЗначение = Неопределено;
					КонецПопытки;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;// По именам реквизитов 
		
	ИначеЕсли МассивИмен.Количество() = 2 Тогда
		
		РезЗначение = ДокументОбъект.Ссылка;
		
	КонецЕсли; 

	Возврат РезЗначение;
	
КонецФункции // ЗначениеРеквизита()

// Процедура выполняет пользовательскую функцию.
// 
// Параметры:
//  ФункцияСсылка - СправочникСсылка.бит_ПользовательскиеФункции.
// 
Функция ВыполнитьПользовательскуюФункцию(ФункцияСсылка, П1 = Неопределено, П2 = Неопределено,
														П3 = Неопределено, П4 = Неопределено, 
														П5 = Неопределено, П6 = Неопределено, 
														П7 = Неопределено, П8 = Неопределено,
														П9 = Неопределено, П10 = Неопределено) Экспорт

	Результат = бит_ОбщегоНазначения.ВыполнитьПользовательскуюФункцию(ФункцияСсылка, П1, П2, П3, П4, П5, П6, П7, П8, П9, П10);
	
	Возврат Результат;
	
КонецФункции // ВыполнитьПользовательскуюФункцию()

// Процедура устанавливает субконто на счете. Если такое субконто на счете отсутствует, 
// то ничего не делается. 
// Возможен вызов в сгенерированом коде условия трансляции.
// 
// Параметры:
// 	Счет - Счет, к которому относится субконто.
//  Субконто - набор субконто.
// 	Номер или имя установливаемого субконто.
//  Значение субконто - значение устанавливаемого субконто.
// 
Процедура УстановитьСубконто(Счет, Субконто, ИмяСубконто, ЗначениеСубконто, Сообщать = Ложь, Заголовок = "", ВидыСубконтоСчета = Неопределено) Экспорт

	Если Счет = Неопределено ИЛИ Счет.Пустая() Тогда
		Возврат;
	КонецЕсли;

    СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
    Если ВидыСубконтоСчета = Неопределено Тогда
         ВидыСубконтоСчета = Счет.ВидыСубконто;
    КонецЕсли; 
	
	Если ТипЗнч(ИмяСубконто) = Тип("Число") Тогда
        Если ИмяСубконто > СвСч.КоличествоСубконто Тогда
			Возврат;
		КонецЕсли;
        ВидСубк = СвСч["ВидСубконто" + ИмяСубконто];
	ИначеЕсли ТипЗнч(ИмяСубконто) = Тип("Строка") Тогда

		ИмяПВХ  = Счет.Метаданные().ВидыСубконто.Имя;
		ВидСубк = НайтиВидСубконто(ИмяПВХ,ИмяСубконто);

	Иначе
		
		ИмяПВХ  = Счет.Метаданные().ВидыСубконто.Имя;
		
		Если ТипЗнч(ИмяСубконто) = ТипЗнч(ПланыВидовХарактеристик[ИмяПВХ].ПустаяСсылка()) Тогда
		
			// В качестве имени указано непосредственно ссылка на ПВХ.
			ВидСубк = ИмяСубконто;
		
		КонецЕсли; 
		
	КонецЕсли;

	Если ТипЗнч(ИмяСубконто) <> Тип("Число") Тогда
		
		Если ВидыСубконтоСчета.Найти(ВидСубк) = Неопределено Тогда
			Если Сообщать Тогда
				ТекстСообщения = НСтр("ru='Вид субконто <%1> для счета ""%2 (%3)"" не определен.';
									  |en='View of subconto <%1> for account ""%2 (%3)"" is not defined.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ВидСубк, СвСч.Код, СвСч.Наименование);
				Если НЕ ПустаяСтрока(Заголовок) Тогда
					ОбщегоНазначения.СообщитьПользователю(Заголовок); 
					Заголовок = "";			
				КонецЕсли; 			
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			Возврат;
		КонецЕсли;		
		
	КонецЕсли; 
	
	Если ВидСубк.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
		Субконто.Вставить(ВидСубк, ЗначениеСубконто);
	ИначеЕсли Сообщать Тогда
		Если НЕ ПустаяСтрока(Заголовок) Тогда
			ОбщегоНазначения.СообщитьПользователю(Заголовок); 
			Заголовок = "";			
		КонецЕсли;		
		ТекстСообщения = НСтр("ru='Неверное значение ""%1"" для вида субконто <%2>'; 
							  |en='Invalid value ""%1"" for subconto view <%2>'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗначениеСубконто, ВидСубк);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры // УстановитьСубконто()

// Функция извлекает значение дополнительной аналитики из соответствия дополнительных аналитик.
// Также возможно получение реквизитов значения аналитики. 
// Формат имени <ИмяАналитики>.<ИмяРеквизита_1>.<ИмяРеквизита_2>...<ИмяРеквизита_n>.
// Возможен вызов в сгенерированом коде условия заполнения.
// 
// Параметры:
//  ИмяАналитики  - Строка.
//  ДополнительныеАналитики  - Соответствие.
// 
// Возвращаемое значение:
//   ЗначениеАналитики   - Произвольный.
// 
Функция ИзвлечьЗначениеАналитики(ИмяАналитикиВх,ДополнительныеАналитики) Экспорт
	
	ЗначениеАналитики = Неопределено;
	
	МассивИмен     = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(ИмяАналитикиВх,".");
	КоличествоИмен = МассивИмен.Количество();
	
	Если ДополнительныеАналитики.Количество() > 0 И КоличествоИмен > 0 Тогда
		
		ИмяАналитики = МассивИмен[0];
		
		Для каждого КиЗ Из ДополнительныеАналитики Цикл
			
			ЭтоСтроковойКлюч = ?(ТипЗнч(КиЗ.Ключ) = Тип("Строка"),Истина,Ложь);
			Прервать;
			
		КонецЦикла; 
		
		// Получение значения аналитики
		Если ЭтоСтроковойКлюч Тогда
			
			ЗначениеАналитики = ДополнительныеАналитики[ВРег(ИмяАналитики)];
			
		Иначе	
			
			Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ПустаяСсылка();
			
			Если ТипЗнч(ИмяАналитики) = ТипЗнч("Строка") Тогда
				Попытка
					Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик[ИмяАналитики];
				Исключение
					Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.НайтиПоКоду(ИмяАналитики);
				КонецПопытки;
			Иначе	
				Аналитика = ИмяАналитики;
			КонецЕсли; 
			
			ЗначениеАналитики = ДополнительныеАналитики[Аналитика];
			
		КонецЕсли; // Тип ключа
		
		// Получение реквизитов значения аналитики
		Если КоличествоИмен > 1 И ЗначениеЗаполнено(ЗначениеАналитики) Тогда
		
			 Для й = 1 По КоличествоИмен-1 Цикл
			 
				 Если ЗначениеАналитики <> Неопределено Тогда
					 
					 ИмяРеквизита = МассивИмен[й];
					 
					 Если ЭтоДопРеквизит(ИмяРеквизита) Тогда
						 
						 // Извлечение дополнительных реквизитов/свойств.
						 ИменаДоп = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(ИмяРеквизита,"_");
						 Если ИменаДоп.Количество() = 2 Тогда
							 ЗначениеАналитики = ЗначениеДопРеквизита(ЗначениеАналитики, ИменаДоп[0], ИменаДоп[1]);
						 Иначе
							 ЗначениеАналитики = ЗначениеДопРеквизита(ЗначениеАналитики, ИмяРеквизита);
						 КонецЕсли;
						 
					 Иначе	
						 
						 // Извлечение обычного реквизита
						 Попытка
							 
							 ЗначениеАналитики = ЗначениеАналитики[ИмяРеквизита];
							 
						 Исключение
							 
							 ЗначениеАналитики = Неопределено;
							 
						 КонецПопытки;
						 
					 КонецЕсли; 
					 
				КонецЕсли; 
			 
			 КонецЦикла;// По именам реквизитов 
		
		КонецЕсли; 
		
	КонецЕсли; // Есть аналитики
	
	Возврат ЗначениеАналитики;
	
КонецФункции // ИзвлечьЗначениеАналитики()

// Функция является оберткой для метода платформы ПринадлежитЭлементу(). 
// Для безопасности вызова проверяется существование родительского объекта.
// 
// Параметры:
//  ТекущийОбъект      - СправочникСсылка,ПланСчетовСсылка,ПланВидовХарактеристикСсылка.
//  РодительскийОбъект - СправочникСсылка,ПланСчетовСсылка,ПланВидовХарактеристикСсылка.
// 
// Возвращаемое значение:
//   флОбъектПодчинен   - Булево.
// 
Функция ОбъектПодчинен(ТекущийОбъект,РодительскийОбъект) Экспорт

	Возврат бит_ОбщегоНазначения.ОбъектПодчинен(ТекущийОбъект, РодительскийОбъект);
	
КонецФункции // ОбъектПодчинен()

// Функция является оберткой для метода платформы СтрЧислоВхождений().
// Выполняется без учета регистра.
//
// Параметры:
//  ИсходнаяСтрока	 - Строка - Исходная строка. 
//  ПодстрокаПоиска	 - Строка - Искомая подстрока.
// 
// Возвращаемое значение:
//  Содержит - булево. 
//
Функция Содержит(ИсходнаяСтрока, ПодстрокаПоиска) Экспорт

	Возврат бит_ОбщегоНазначения.Содержит(ИсходнаяСтрока, ПодстрокаПоиска);
	
КонецФункции

// Функция является оберткой для метода платформы СтрНачинаетсяС().
// Выполняется без учета регистра.
//
// Параметры:
//  ИсходнаяСтрока	 - Строка - Исходная строка. 
//  ПодстрокаПоиска	 - Строка - Искомая подстрока.
// 
// Возвращаемое значение:
//  НачинаетсяС - булево. 
//
Функция НачинаетсяС(ИсходнаяСтрока, ПодстрокаПоиска) Экспорт

	Возврат бит_ОбщегоНазначения.НачинаетсяС(ИсходнаяСтрока, ПодстрокаПоиска);

КонецФункции

// Функция выполняет пересчет из валюты регл в валюту упр.
// Предпогалается, что курс валюты Упр получен при формировании СтруктурыШапкиДокумента.
// Если период, на который необходимо выполнить пересчет не совападает с датой документа, 
// курс будет получен в процедуре.
// 
// Параметры:
//  Сумма - Число.
//  Период - Дата.
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  РезСумма - Число.
// 
Функция ПересчитатьРеглУпр(Сумма, Период, СтруктураШапкиДокумента)  Экспорт
	
	РезСумма = Сумма;
	
	Если СтруктураШапкиДокумента.Свойство("бит_ВалютаУправленческогоУчета") Тогда
		
		Если СтруктураШапкиДокумента.Дата = Период Тогда
			
			СтрКурса = Новый Структура("Курс, Кратность", СтруктураШапкиДокумента.бит_КурсУпр, СтруктураШапкиДокумента.бит_КратностьУпр);	
			
		Иначе	
			
			СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(СтруктураШапкиДокумента.бит_ВалютаУправленческогоУчета, Период);
			
		КонецЕсли; 
		
		РезСумма = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(Сумма
												, СтруктураШапкиДокумента.ВалютаРегламентированногоУчета
												, СтруктураШапкиДокумента.бит_ВалютаУправленческогоУчета
												, 1
												, СтрКурса.Курс
												, 1
												, СтрКурса.Кратность);
		
		
	КонецЕсли; 
	
	Возврат РезСумма;
	
КонецФункции // ПересчитатьРеглУпр()

// Функция выполняет пересчет из валюты регл в валюту международного учета.
// Предпогалается, что курс валюты МУ получен при формировании СтруктурыШапкиДокумента.
// 
// Параметры:
//  Сумма - Число.
//  Период - Дата.
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  РезСумма - Число.
// 
Функция ПересчитатьРеглМУ(Сумма, Период, СтруктураШапкиДокумента)  Экспорт

	РезСумма = Сумма;
	
	Если СтруктураШапкиДокумента.Свойство("бит_ВалютаМУ") Тогда
		
		Если СтруктураШапкиДокумента.Дата = Период Тогда
			
			СтрКурса = Новый Структура("Курс, Кратность", СтруктураШапкиДокумента.бит_КурсМУ, СтруктураШапкиДокумента.бит_КратностьМУ);	
			
		Иначе	
			
			СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(СтруктураШапкиДокумента.бит_ВалютаМУ, Период);
			
		КонецЕсли; 
		
		
		РезСумма = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(Сумма
		               , СтруктураШапкиДокумента.ВалютаРегламентированногоУчета
					   , СтруктураШапкиДокумента.бит_ВалютаМУ
					   , 1
					   , СтрКурса.Курс
					   , 1
					   , СтрКурса.Кратность);
	
	КонецЕсли; 

	Возврат РезСумма;
	
КонецФункции // ПересчитатьРеглМУ()

// Функция выполняет пересчет из валюты регл в валюту сценария.
// 
// Параметры:
//  Сумма  - Число.
//  Период - Дата.
//  Сценарий - СправочникСсылка.СценарииПланирования.
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  РезСумма - Число.
// 
Функция ПересчитатьРеглСценарий(Сумма, Период, Сценарий, СтруктураШапкиДокумента)  Экспорт

	РезСумма = Сумма;
	
	Если ЗначениеЗаполнено(Сценарий) Тогда
		
		ВалютаСценария = Сценарий.Валюта;
		СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаСценария, Период);
	
		РезСумма = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(Сумма, 
			СтруктураШапкиДокумента.ВалютаРегламентированногоУчета, ВалютаСценария, 1, СтрКурса.Курс, 1, СтрКурса.Кратность);
	
	КонецЕсли; 

	Возврат РезСумма;
	
КонецФункции

// Функция выполняет валютные пересчеты.
// 
// Параметры:
//  Сумма - Число.
//  Период - Дата.
//  ВалютаНач - СправочникСсылка.Валюты.
//  ВалютаКон - СправочникСсылка.Валюты.
// 
// Возвращаемое значение:
//  РезСумма - Число.
// 
Функция ПересчитатьПоВалюте(Сумма, Период, ВалютаНач, ВалютаКон)  Экспорт

	РезСумма = Сумма;
	
	Если ТипЗнч(ВалютаНач) = Тип("Строка") Тогда
	
		 ВалютаНач = Справочники.Валюты.НайтиПоКоду(ВалютаНач);
	
	КонецЕсли; 
	 
	Если ТипЗнч(ВалютаКон) = Тип("Строка") Тогда
	
		 ВалютаКон = Справочники.Валюты.НайтиПоКоду(ВалютаКон);
	
	КонецЕсли;  
	
	Если ВалютаНач <> ВалютаКон Тогда
		
		СтрКурсаНач = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаНач, Период);
		СтрКурсаКон = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаКон, Период);
		
		РезСумма = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(Сумма, 
			ВалютаНач, ВалютаКон, СтрКурсаНач.Курс, СтрКурсаКон.Курс, СтрКурсаНач.Кратность, СтрКурсаКон.Кратность);
		
	КонецЕсли; 
	
	Возврат РезСумма;
	
КонецФункции // ПересчитатьПоВалюте()

// Функция определяет, является ли контрагент собственным.
// 
// Параметры:
//   Контрагент - СправочникСсылка.Контрагенты.
// 
// Возвращаемое значение:
//  флСобственный - Булево.
// 
Функция ЭтоСобственныйКонтрагент(Контрагент)  Экспорт

	флСобственный = бит_МеханизмТрансляцииПовтИсп.ЭтоСобственныйКонтрагент(Контрагент);

	Возврат флСобственный;
	
КонецФункции // ЭтоСобственныйКонтрагент()

// АПК:581-вкл

#КонецОбласти

#Область ПроцедурыИФункцииПолученияСтруктурыРегистров

// Возвращает описание реквизитов движений для регистра бухгалтерии.
// 
// Параметры:
//  ИмяРегистра  - Строка. Имя регистра бухгалтерии.
//  УчитыватьКорреспонденцию - Булево.
//  ДобавлятьИменаВидовСубконто - Булево.
// 
// Возвращаемое значение:
//   ТаблицаРеквизитов   - ТаблицаЗначений.
// 
Функция ПолучитьРеквизитыРегистраБухгалтерии(ИмяРегистра,УчитыватьКорреспонденцию,ДобавлятьИменаВидовСубконто) Экспорт
	
	МетаданныеРегистр = Метаданные.РегистрыБухгалтерии[ИмяРегистра];
	
	ТаблицаРеквизитов = ИнициализироватьТаблицуРеквизитов();	
	
	// Дополним сначала обязательными реквизитами для регистра бухгалтерии.
	ТекстСинонима = НСтр("ru='Период';en='Period'");
	ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "Период", ТекстСинонима, мхо_ОписаниеТипов("Дата"));
	ТекстСинонима = НСтр("ru='Активность';en='Activity'");
	ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "Активность", ТекстСинонима, мхо_ОписаниеТипов("Булево"));	
	
	// Получим план счетов регистра бухгалтерии.
	ПланСчетов = МетаданныеРегистр.ПланСчетов;
	ОписаниеТипаСчета = мхо_ОписаниеТипов("ПланСчетовСсылка." + ПланСчетов.Имя);
	
	// Определим, поддерживается ли корреспонденция счетов регистра бухгалтерии.	
	Если МетаданныеРегистр.Корреспонденция И УчитыватьКорреспонденцию Тогда 	
		// Присутствуют реквизиты движения "СчетДт" и "СчетКт"
		ТекстСинонима = НСтр("ru='Счет Дт';en='Account Dt'");
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "СчетДт", ТекстСинонима, ОписаниеТипаСчета,,, Ложь);
		ТекстСинонима = НСтр("ru='Счет Кт';en='Account Ct'");
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "СчетКт", ТекстСинонима, ОписаниеТипаСчета,,, Ложь);
	Иначе											
		// Присутствует только реквизит движения "Счет".
		ТекстСинонима = НСтр("ru='Счет';en='Account'");
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "Счет", ТекстСинонима, ОписаниеТипаСчета,,, Ложь);
	КонецЕсли;
	
	// Заполним сведения о субконто регистра бухгалтерии.
	МаксСубконто 	= ПланСчетов.МаксКоличествоСубконто;
	ОписаниеТипаПВХ = ПланСчетов.ВидыСубконто.Тип;
	
	Для Номер = 1 По МаксСубконто Цикл
		// Определим, поддерживается ли корреспонденция счетов регистра бухгалтерии.
		Если МетаданныеРегистр.Корреспонденция И УчитыватьКорреспонденцию Тогда
			// Присутствуют реквизиты движения "СчетДт" и "СчетКт".
			Если ДобавлятьИменаВидовСубконто Тогда
				ТекстСинонима = НСтр("ru='Имя вида субконто Дт%1';en='Subconto species name Dt%1'");
				ТекстСинонима = СтрШаблон(ТекстСинонима, Номер);
				ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ИмяВидаСубконтоДт" + Строка(Номер), 
					ТекстСинонима, мхо_ОписаниеТипов("Строка"), Ложь, Ложь);
				ТекстСинонима = НСтр("ru='Имя вида субконто Кт%1';en='Subconto species name Ct%1'");
				ТекстСинонима = СтрШаблон(ТекстСинонима, Номер);
				ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ИмяВидаСубконтоКт" + Строка(Номер), 
					ТекстСинонима, мхо_ОписаниеТипов("Строка"), Ложь, Ложь);
			КонецЕсли;
			ТекстСинонима = НСтр("ru='Субконто Дт%1';en='Subconto Dt%1'");
			ТекстСинонима = СтрШаблон(ТекстСинонима, Номер);
			ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "СубконтоДт" + Строка(Номер), 
				ТекстСинонима, мхо_ОписаниеТипов(ОписаниеТипаПВХ),, Истина, Ложь);
			ТекстСинонима = НСтр("ru='Субконто Кт%1';en='Subconto Ct%1'");
			ТекстСинонима = СтрШаблон(ТекстСинонима, Номер);
			ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "СубконтоКт" + Строка(Номер), 
				ТекстСинонима, мхо_ОписаниеТипов(ОписаниеТипаПВХ),, Истина, Ложь);
		Иначе
			// Присутствует только реквизит движения "Счет".
			Если ДобавлятьИменаВидовСубконто Тогда
				ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ИмяВидаСубконто" + Строка(Номер), 
					СтрШаблон(НСтр("ru='Имя вида субконто %1';en='Subconto species name %1'") , Номер), 
					мхо_ОписаниеТипов("Строка"), Ложь,Ложь);
			КонецЕсли; 
			ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "Субконто" + Строка(Номер), 
				СтрШаблон(НСтр("ru='Субконто %1';en='Subconto %1'"), Номер), 
				мхо_ОписаниеТипов(ОписаниеТипаПВХ),,Истина,Ложь);
		КонецЕсли;
	КонецЦикла;
	
	// Заполним сведения об измерениях регистра бухгалтерии.
	Для Каждого Измерение Из МетаданныеРегистр.Измерения Цикл
		ОписаниеТипаИзмерения = мхо_ОписаниеТипов(Измерение.Тип);
		Если Измерение.Балансовый ИЛИ НЕ МетаданныеРегистр.Корреспонденция ИЛИ НЕ УчитыватьКорреспонденцию Тогда 	
			// У измерения не будет экземпляров "Дт" и "Кт".
			НоваяСтрока = ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, Измерение.Имя, Измерение.Синоним, ОписаниеТипаИзмерения,,, Измерение.Балансовый);
			НоваяСтрока.ЭтоИзмерение = Истина;
		Иначе																		
			// Имеются экземпляры "Дт" и "Кт"
			ТекстСинонима = СтрШаблон(НСтр("ru='%1 Дт';en='%1 Dt'"), Измерение.Синоним);
			НоваяСтрока = ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, Измерение.Имя + "Дт", ТекстСинонима, ОписаниеТипаИзмерения,,, Измерение.Балансовый);
			НоваяСтрока.ЭтоИзмерение = Истина;	
			ТекстСинонима = СтрШаблон(НСтр("ru='%1 Кт';en='%1 Ct'"), Измерение.Синоним);
			НоваяСтрока = ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, Измерение.Имя + "Кт", ТекстСинонима, ОписаниеТипаИзмерения,,, Измерение.Балансовый);
			НоваяСтрока.ЭтоИзмерение = Истина;						
		КонецЕсли;		
	КонецЦикла;
	
	// Заполним сведения о ресурсах регистра бухгалтерии.
	Для Каждого Ресурс Из МетаданныеРегистр.Ресурсы Цикл
		ОписаниеТипаРесурса = мхо_ОписаниеТипов(Ресурс.Тип);
		Если Ресурс.Балансовый ИЛИ НЕ МетаданныеРегистр.Корреспонденция ИЛИ НЕ УчитыватьКорреспонденцию Тогда 	
			// У ресурса не будет экземпляров "Дт" и "Кт".
			ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, Ресурс.Имя, Ресурс.Синоним, ОписаниеТипаРесурса,,, Ресурс.Балансовый);
		Иначе																	
			// Имеются экземпляры "Дт" и "Кт".
			ТекстСинонима = СтрШаблон(НСтр("ru='%1 Дт';en='%1 Dt'"), Ресурс.Синоним);
			ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, Ресурс.Имя + "Дт", ТекстСинонима, ОписаниеТипаРесурса,,, Ресурс.Балансовый);
			ТекстСинонима = СтрШаблон(НСтр("ru='%1 Кт';en='%1 Ct'"), Ресурс.Синоним);
			ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, Ресурс.Имя + "Кт", ТекстСинонима, ОписаниеТипаРесурса,,, Ресурс.Балансовый);
		КонецЕсли;
	КонецЦикла;
	
	// Заполним сведения о реквизитах регистра бухгалтерии.
	Для Каждого Реквизит Из МетаданныеРегистр.Реквизиты Цикл
		Если СтрСравнить(Реквизит.Имя, "СторнируемаяПроводка") = 0 И НЕ ИспользоватьСторнируемыеПроводки() Тогда
			Продолжить;
		КонецЕсли; 
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, Реквизит.Имя, Реквизит.Синоним, мхо_ОписаниеТипов(Реквизит.Тип));
	КонецЦикла;
	
	Возврат ТаблицаРеквизитов;
	
КонецФункции
 
// Возвращает описание реквизитов движений для регистра накопления.
// 
// Параметры:
//  ИмяРегистра  - Строка. Имя регистра бухгалтерии.
// 
// Возвращаемое значение:
//   ТаблицаРеквизитов   - ТаблицаЗначений.
// 
Функция ПолучитьРеквизитыРегистраНакопления(ИмяРегистра) Экспорт

	МетаданныеРегистр = Метаданные.РегистрыНакопления[ИмяРегистра];
	
	ТаблицаРеквизитов = ИнициализироватьТаблицуРеквизитов();
	
	ТипЗнчПер = ТипЗнч(ВидДвиженияНакопления);
	
	// Дополним сначала обязательными реквизитами для регистра накопления.
	ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "Период", НСтр("ru='Период';en='Period'"), мхо_ОписаниеТипов("Дата"));
	
	// Если регистр оборотный - вида движений не будет.
	Если МетаданныеРегистр.ВидРегистра <> Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Обороты Тогда
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ВидДвижения", 
			НСтр("ru='Вид движения';en='Вид движения'"),
			мхо_ОписаниеТипов("ПеречислениеСсылка.бит_ВидДвиженияНакопления"), Ложь);
	Иначе
		// Не добляем реквизит
	КонецЕсли;	
	
	// Заполним измерения, ресурсы и реквизиты
	
	МассивОбхода = Новый Массив;
	МассивОбхода.Добавить("Измерения");
	МассивОбхода.Добавить("Ресурсы");
	МассивОбхода.Добавить("Реквизиты");
	
	Для Каждого ЭлементОбхода Из МассивОбхода Цикл
		Для Каждого Реквизит Из МетаданныеРегистр[ЭлементОбхода] Цикл
			НоваяСтрока = ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, Реквизит.Имя, Реквизит.Синоним, мхо_ОписаниеТипов(Реквизит.Тип));
			НоваяСтрока.ЭтоИзмерение = ?(ЭлементОбхода = "Измерения",Истина,Ложь);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаРеквизитов;
	
КонецФункции // ПолучитьРеквизитыРегистраНакопления()

// Добавляет строку таблицы значений и заполняет ее поля переданными значениями.
// 
Функция ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов
	                                      , ИмяРеквизита
										  , Синоним
										  , ТипРеквизита
										  , Использование = Истина
										  , ЭтоСубконто   = Ложь
										  , Балансовый = Истина) Экспорт
	
	НовыйРеквизит = ТаблицаРеквизитов.Добавить();
	НовыйРеквизит.ИмяРеквизита 	= ИмяРеквизита;
	НовыйРеквизит.Синоним		= Синоним;
	НовыйРеквизит.Тип			= ТипРеквизита;
	НовыйРеквизит.Использование = Использование;
	НовыйРеквизит.ЭтоСубконто   = ЭтоСубконто;
	НовыйРеквизит.Балансовый    = Балансовый;
	
	Возврат НовыйРеквизит;
	
КонецФункции // ЗаполнитьСвойстваНовогоРеквизита()

// Возвращает описание переданных в качестве параметров типов + описание типа "Строка(900)".
// 
// Параметры:
//  ТипДанныхСтрокаМассив  - "Строка" Или "Массив" типов или "ОписаниеТипов".
// 
// Возвращаемое значение:
//   Описание типов.
// 
Функция мхо_ОписаниеТипов(ТипДанныхСтрокаМассив) Экспорт

	МассивТипов = Новый Массив;
	КС 			= Новый КвалификаторыСтроки(900);
	КЧ			= Неопределено;
	КД          = Неопределено;
	
	Если ТипЗнч(ТипДанныхСтрокаМассив) = Тип("Строка") Тогда
		МассивТипов.Добавить(Тип(ТипДанныхСтрокаМассив));
	ИначеЕсли ТипЗнч(ТипДанныхСтрокаМассив) = Тип("Массив") Тогда
		МассивТипов = ТипДанныхСтрокаМассив;
	Иначе
		МассивТипов = ТипДанныхСтрокаМассив.Типы();
		КЧ 			= ТипДанныхСтрокаМассив.КвалификаторыЧисла;
		КД 			= ТипДанныхСтрокаМассив.КвалификаторыДаты;
	КонецЕсли;
	
	// В любом случае, добавим тип "Строка"
	// МассивТипов.Добавить(Тип("Строка"));.
	
	Если КЧ = Неопределено Тогда
		НовоеОписаниеТипов = Новый ОписаниеТипов(МассивТипов,, КС);
	Иначе // В качестве параметра было передано описание типов. Необходимо учесть его квалификаторы.
		НовоеОписаниеТипов = Новый ОписаниеТипов(МассивТипов, КД, КС, КЧ);
	КонецЕсли;

	Возврат НовоеОписаниеТипов;
	
КонецФункции // Мхо_ОписаниеТипов()

// Дополняет таблицу реквизитов движений предопределенными.
// 
// Параметры:
//  ТаблицаРеквизитов - Таблица значений.
// 
Процедура ДополнитьТаблицуПредопределеннымиРеквизитамиДвижений(ТаблицаРеквизитов,ДобавитьДтКТ,Приемник) Экспорт

	Если ДобавитьДтКТ Тогда	
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ДтКт", НСтр("ru='Дт/Кт';en='Dt/Ct'"), 
			Новый ОписаниеТипов("ПеречислениеСсылка.бит_ВидыСоответствия"), Ложь);	
	КонецЕсли; 
	
	// Реквизиты для условий
	Для Номер = 1 По 3 Цикл
		Строка250 = ОбщегоНазначения.ОписаниеТипаСтрока(250);
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "Условие" + Строка(Номер), 
			СтрШаблон(НСтр("ru='Условие №%1';en='Condition №%1'"), Номер), Строка250, Ложь);
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ВидСравнения" + Строка(Номер), 
			НСтр("ru='Вид сравнения';en='Type of comparison'"), 
			Новый ОписаниеТипов("ПеречислениеСсылка.бит_ВидыСравненияТрансляции"), Ложь);
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "Значение" + Строка(Номер), 
			СтрШаблон(НСтр("ru='Значение №%1';en='Value №%1'"), Номер), ОписаниеПроизвольногоТипа(), Ложь);
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ОбъединениеСПоследующим" + Строка(Номер), "и/или", 
			Новый ОписаниеТипов("ПеречислениеСсылка.бит_ТипыОбъединенияУсловий"), Ложь);
	КонецЦикла;
	
	// Произвольное условие.
	ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ПроизвольноеУсловие", 
		НСтр("ru='Произвольное условие';en='An arbitrary condition'"), мхо_ОписаниеТипов("Строка"), Ложь);	
	// Произвольный код.
	ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ПроизвольныйКод", 
		НСтр("ru='Произвольный код';en='Arbitrary code'"), мхо_ОписаниеТипов("Строка"), Истина);	
	// Дополнительное поле.
	ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ДополнительноеПоле", 
		НСтр("ru='Дополнительное поле';en='Additional field'"), ОписаниеПроизвольногоТипа(), Истина);	
		
	// Дополнительные счета.
	Если Приемник.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии Тогда		
		ИмяПланаСчетов = Метаданные.РегистрыБухгалтерии[Приемник.ИмяОбъекта].ПланСчетов.Имя;
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ДополнительноеПоле_Счет", 
			НСтр("ru='Дополнительный счет';en='Additional account'") , 
			Новый ОписаниеТипов("ПланСчетовСсылка." + ИмяПланаСчетов), Истина);
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ДополнительноеПоле_СчетДт", 
			НСтр("ru='Дополнительный счет Дт';en='Additional account Dt'") , 
			Новый ОписаниеТипов("ПланСчетовСсылка." + ИмяПланаСчетов), Истина);	
		ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ДополнительноеПоле_СчетКт", 
			НСтр("ru='Дополнительный счет Кт';en='Additional account Ct'") , 
			Новый ОписаниеТипов("ПланСчетовСсылка." + ИмяПланаСчетов), Истина);	
	КонецЕсли; 
	
	// Коэффициенты для суммы и количества.
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 9));
	ТекстСиноним = НСтр("ru = 'Коэф. сумма';en = 'Ratio amount'");
	ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "КоэффициентСумма", ТекстСиноним, ОписаниеТипаЧисло, Истина);
	ТекстСиноним = НСтр("ru = 'Коэф. количество';en = 'Ratio quantity'");
	ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "КоэффициентКоличество", ТекстСиноним, ОписаниеТипаЧисло, Истина);

	// Признак заполнения аналитики корр. части.
	ОписаниеТипаБулево = мхо_ОписаниеТипов("Булево");
	ТекстСиноним = НСтр("ru = 'Использовать аналитику корр. счета';en = 'Use offsetting analytics'");
	ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ИспользоватьАналитикуКорр", ТекстСиноним, ОписаниеТипаБулево, Истина);
	// Использовать исторические курсы.
	ТекстСиноним = НСтр("ru = 'Использовать исторические курсы';en = 'Use historical courses'");
	ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ИспользоватьИсторическиеКурсы", ТекстСиноним, ОписаниеТипаБулево, Истина);
	// Шаблон МХО.
	ТекстСиноним = НСтр("ru = 'Шаблон движений';en = 'Motion pattern'");
	ЗаполнитьСвойстваНовогоРеквизита(ТаблицаРеквизитов, "ШаблонДвижений", ТекстСиноним, 
									 мхо_ОписаниеТипов("СправочникСсылка.бит_ШаблоныДвижений"), Истина);
	
КонецПроцедуры

// Возвращает Описание типов (Строка, Число, Булево, Дата, ЛюбаяСсылка).
// 
// Возвращаемое значение:
//   ОписаниеТипов.
// 
Функция ОписаниеПроизвольногоТипа() Экспорт

	Типы        = Новый Массив;
    Типы.Добавить(Тип(Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 2))));
    Типы.Добавить(Тип(Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(999)))); 
    Типы.Добавить(Тип(Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты()))); 
    Типы.Добавить(Тип(Новый ОписаниеТипов("Булево")));
	
    Для Каждого ЭлементТипа Из Документы.ТипВсеСсылки().Типы() Цикл
        Типы.Добавить(ЭлементТипа);      
    КонецЦикла;  
    Для Каждого ЭлементТипа Из Справочники.ТипВсеСсылки().Типы() Цикл
        Типы.Добавить(ЭлементТипа);      
    КонецЦикла;  
    Для Каждого ЭлементТипа Из Перечисления.ТипВсеСсылки().Типы() Цикл
        Типы.Добавить(ЭлементТипа);      
    КонецЦикла;  
    Для Каждого ЭлементТипа Из ПланыСчетов.ТипВсеСсылки().Типы() Цикл
        Типы.Добавить(ЭлементТипа);      
	КонецЦикла;
	Для каждого ЭлементТипа Из ПланыОбмена.ТипВсеСсылки().Типы() Цикл
        Типы.Добавить(ЭлементТипа);      
	КонецЦикла; 	
	Для каждого ЭлементТипа Из ПланыВидовХарактеристик.ТипВсеСсылки().Типы() Цикл
        Типы.Добавить(ЭлементТипа);      
	КонецЦикла; 
	Для каждого ЭлементТипа Из ПланыВидовРасчета.ТипВсеСсылки().Типы() Цикл
        Типы.Добавить(ЭлементТипа);      
	КонецЦикла;
	Для каждого ЭлементТипа Из БизнесПроцессы.ТипВсеСсылки().Типы() Цикл
        Типы.Добавить(ЭлементТипа);      
	КонецЦикла; 	
	Для каждого ЭлементТипа Из Задачи.ТипВсеСсылки().Типы() Цикл
        Типы.Добавить(ЭлементТипа);      
	КонецЦикла; 

	Возврат Новый ОписаниеТипов(Типы,
					Новый КвалификаторыЧисла(25, 9),
					Новый КвалификаторыСтроки(999),
					Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	
КонецФункции // ОписаниеПроизвольногоТипа()

// Функция инициализирует таблицу реквизитов.
// 
// Возвращаемое значение:
//   ТаблицаРеквизитов   - ТаблицаЗначений.
// 
Функция ИнициализироватьТаблицуРеквизитов()  Экспорт
	
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	
	ТаблицаРеквизитов = Новый ТаблицаЗначений;
	ТаблицаРеквизитов.Колонки.Добавить("ИмяРеквизита");
	ТаблицаРеквизитов.Колонки.Добавить("Синоним");
	ТаблицаРеквизитов.Колонки.Добавить("Тип");
	ТаблицаРеквизитов.Колонки.Добавить("Использование",ОписаниеБулево);
	ТаблицаРеквизитов.Колонки.Добавить("ЭтоСубконто"  ,ОписаниеБулево);
	ТаблицаРеквизитов.Колонки.Добавить("ЭтоИзмерение" ,ОписаниеБулево);	
	ТаблицаРеквизитов.Колонки.Добавить("Балансовый"   ,ОписаниеБулево);
	
	Возврат ТаблицаРеквизитов;
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункцииМеханизмаАвтозаполненияПоСоответствиям
 
// Функция получает сответствие статей регламентированного учета и статей затрат.
// 
// Возвращаемое значение:
//   РезСоответствие   - Соответствие.
// 
Функция ПолучитьСоответствиеСтатьиРеглСтатьи() Экспорт

	СоответствиеСтатей = Новый Соответствие;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таблица.СтатьяРегл КАК СтатьяРегл,
	|	Таблица.СчетУчетаБУ КАК СчетУчетаБУ,
	|	Таблица.СтатьяОборотов КАК СтатьяОборотов
	|ИЗ
	|	РегистрСведений.бит_СтатьиОборотов_СтатьиРегл КАК Таблица
	|ГДЕ
	|	НЕ Таблица.СтатьяОборотов.ПометкаУдаления И &ОтборПометкаУдаления 	
	|ИТОГИ
	|	МАКСИМУМ(СтатьяОборотов)
	|ПО
	|	СтатьяРегл,
	|	СчетУчетаБУ";
	
	// ++ ЕРП
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПометкаУдаления", ИСТИНА);
	// -- ЕРП

	Запрос 		 = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Результат 	 = Запрос.Выполнить();
	
	ВыборкаСтатьяРегл = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтатьяРегл.Следующий() Цикл
	
		 ВыборкаСчетУчетаБУ = ВыборкаСтатьяРегл.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		 
		 ВнутрСоотв = Новый Соответствие;
		 Пока ВыборкаСчетУчетаБУ.Следующий() Цикл
		 	  ВнутрСоотв.Вставить(ВыборкаСчетУчетаБУ.СчетУчетаБУ, ВыборкаСчетУчетаБУ.СтатьяОборотов);
		 КонецЦикла; 
		 
		 СоответствиеСтатей.Вставить(ВыборкаСтатьяРегл.СтатьяРегл, ВнутрСоотв); 
	КонецЦикла; 

	Возврат СоответствиеСтатей;
	
КонецФункции // ПолучитьСоответствиеСтатьиРеглСтатьи()

// Функция получает соответствие подразделений и ЦФО.
// 
// 
// Возвращаемое значение:
//   РезСоответствие   - Соответствие.
// 
Функция ПолучитьСоответствиеПодразделенияЦФО() Экспорт

	Результат = Новый Соответствие;
	// ++ ЕРП 
	// Не используется.
	// -- ЕРП 
	Возврат Результат;
	
КонецФункции

// Функция получает соответствие подразделений и ЦФО в режиме синхронизации подразделений регл и ЦФО.
// 
// Возвращаемое значение:
//   РезСоответствие   - Соответствие.
// 
Функция ПолучитьСинхронизированныеПодразделенияЦФО() Экспорт

	РезСоответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Подразделения.СтруктурнаяЕдиницаРегл КАК Подразделение,
	               |	Подразделения.Ссылка КАК ЦФО
	               |ИЗ
	               |	Справочник.Подразделения КАК Подразделения
	               |ГДЕ
	               |	Подразделения.СтруктурнаяЕдиницаРегл <> Неопределено";
				   
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Подразделение) Тогда
			
			РезСоответствие.Вставить(Выборка.Подразделение,Выборка.ЦФО);
			
		КонецЕсли; 
	
	КонецЦикла; 

	Возврат РезСоответствие;
	
КонецФункции // ПолучитьСинхронизированныеПодразделенияЦФО()

// Функция получает сответствие номенклатурных групп и статей оборотов.
// 
// Возвращаемое значение:
//   РезСоответствие   - Соответствие.
// 
Функция ПолучитьСоответствиеНомГруппыСтатьи() Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	бит_СтатьиОборотов_НоменклатурныеГруппы.СчетУчетаБУ КАК СчетУчетаБУ,
	               |	бит_СтатьиОборотов_НоменклатурныеГруппы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	бит_СтатьиОборотов_НоменклатурныеГруппы.СтатьяОборотов КАК СтатьяОборотов
	               |ИЗ
	               |	РегистрСведений.бит_СтатьиОборотов_НоменклатурныеГруппы КАК бит_СтатьиОборотов_НоменклатурныеГруппы
	               |ИТОГИ
	               |	МАКСИМУМ(СтатьяОборотов)
	               |ПО
	               |	НоменклатурнаяГруппа,
	               |	СчетУчетаБУ";
				   
	Результат = Запрос.Выполнить();
	
	РезСоответствие = Новый Соответствие;
	
	ВыборкаН = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаН.Следующий() Цикл
	
		 ВыборкаС = ВыборкаН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		 
		 ВнутрСоотв = Новый Соответствие;
		 Пока ВыборкаС.Следующий() Цикл
		 
		 	  ВнутрСоотв.Вставить(ВыборкаС.СчетУчетаБУ, ВыборкаС.СтатьяОборотов);
		 
		 КонецЦикла; 
		 
		 РезСоответствие.Вставить(ВыборкаН.НоменклатурнаяГруппа, ВнутрСоотв); 
	
	КонецЦикла; 
	
	Возврат РезСоответствие;
	
КонецФункции // ПолучитьСоответствиеСтатьиРеглСтатьи()

// Функция выполняет поиск в соответствии аналитик. Поиск выполняется по значению поиска 
// и если соответствие двухуровневое, то по СчетуУчетаБУ.
// 
// Параметры:
//  ЗначениеПоиска - Произвольный.
//  СчетПоиска - ПланыСчетовСсылка.Хозрасчетный.
// 
// Возвращаемое значение:
//  РезЗнч - Произвольный.
// 
Функция ИзвлечьИзСоответствия(ЗначениеПоиска, СчетПоиска, СоотвАвтозаполнения) Экспорт
	
	ЗнВрем = СоотвАвтозаполнения[ЗначениеПоиска];
	Если ТипЗнч(ЗнВрем) = Тип("Соответствие") Тогда
		
		РезЗнч = ЗнВрем[СчетПоиска];
		Если НЕ ЗначениеЗаполнено(РезЗнч) Тогда
			
			РезЗнч = ЗнВрем[ПланыСчетов.Хозрасчетный.ПустаяСсылка()];
			
		КонецЕсли; 
		
	Иначе	
		
		РезЗнч = ЗнВрем;
		
	КонецЕсли;	
	
	Возврат РезЗнч;
	
КонецФункции // ИзвлечьИзСоответствия()

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура разбирает строку с разделителями и упаковывает значения в массив.
// 
// Параметры:
//  ИсходнаяСтрока  - Строка.
//  Разделитель     - Строка.
// 
Функция РазобратьСтрокуСРазделителями(ИсходнаяСтрока,Разделитель) Экспорт
	
	Возврат бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(ИсходнаяСтрока,Разделитель);
	
КонецФункции // РазобратьУсловие()

// Добавляет новую строку "СтрокаТекста" к тексту "Текст".
// 
// Параметры:
//  Текст - текст
// 	СтрокаТекста - добавляемая строка.
// 
Процедура ДобавитьСтрокуКТексту(Текст, СтрокаТекста) Экспорт

	Текст = Текст + ?(СокрЛП(Текст) = "", "", Символы.ПС) + СтрокаТекста;

КонецПроцедуры // ДобавитьСтрокуКТексту()

// Функция получает колонки трансляции по настройке конструктора правил трансляции.
// 
// Параметры:
//  НастройкаПравилТрансляции  - СправочникСсылка.бит_СтруктураКонструктораПравилТрансляции.
// 
// Возвращаемое значение:
//   ТаблицаКолонки   - ТаблицаЗначений.
//   ДобавитьСлужебныеКолонки - Булево.
// 
Функция ПолучитьКолонкиТрансляции(НастройкаПравилТрансляции, ДобавитьСлужебныеКолонки = Ложь) Экспорт
 
    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.ИмяКолонки КАК ИмяКолонки,
	|	Таблица.ИмяРеквизита КАК ИмяРеквизита,
	|	Таблица.ВидКолонки КАК ВидКолонки,
	|	Таблица.ТипыЗначений КАК ТипыЗначений,
	|	Таблица.ТипыЗначенийСтр КАК ТипыЗначенийСтр,
	|	Таблица.НомерКолонки КАК НомерКолонки,
	|	Таблица.ПоложениеКолонки КАК ПоложениеКолонки,
	|	Таблица.ШиринаКолонки КАК ШиринаКолонки,
	|	Таблица.НеБалансовый КАК НеБалансовый,
	|	Таблица.ЭтоСубконто КАК ЭтоСубконто,
	|	Таблица.НаименованиеКолонки КАК НаименованиеКолонки,
	|	Таблица.КнопкаСпискаВыбора КАК КнопкаСпискаВыбора,
	|	Таблица.КнопкаВыбора КАК КнопкаВыбора,
	|	Таблица.КнопкаОткрытия КАК КнопкаОткрытия,
	|	Таблица.КнопкаОчистки КАК КнопкаОчистки,
	|	ИСТИНА КАК Видимость,
	|	ЛОЖЬ КАК ТолькоПросмотр
	|ИЗ
	|	Справочник.бит_СтруктураКонструктораПравилТрансляции.КолонкиПравилТрансляции КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерКолонки";
	
    Запрос.УстановитьПараметр("Ссылка",НастройкаПравилТрансляции);				   
				   
	ТаблицаКолонки = Запрос.Выполнить().Выгрузить();
	
	// Необходимы для отрисовки
	ТаблицаКолонки.Колонки.Добавить("НачатьГруппу"      , Новый ОписаниеТипов("Булево"));
	ТаблицаКолонки.Колонки.Добавить("ЗакончитьГруппу"   , Новый ОписаниеТипов("Булево"));
	ТаблицаКолонки.Колонки.Добавить("ГруппировкаКолонок", Новый ОписаниеТипов("ГруппировкаКолонок"));
	ТаблицаКолонки.Колонки.Добавить("ТипыЗначенийВФорме", Новый ОписаниеТипов("ОписаниеТипов"));
	
	Для каждого СтрокаТаблицы Из ТаблицаКолонки Цикл
		ТипыЗначений = СтрокаТаблицы.ТипыЗначений.Получить();
		Если ТипЗнч(ТипыЗначений) = Тип("ОписаниеТипов") Тогда
			// Один (единственый) из типов удален.
			Если ТипыЗначений.Типы().Количество() = 0 Тогда
				ТипыЗначений = ОбщегоНазначения.ОписаниеТипаСтрока(100);
			КонецЕсли;
		Иначе	
			// Незаполнялось.
			ТипыЗначений = ОбщегоНазначения.ОписаниеТипаСтрока(100); 
		КонецЕсли; 		
		СтрокаТаблицы.ТипыЗначенийВФорме = ТипыЗначений;	
	КонецЦикла; 
	
	// СлужебнаяОтметка - вспомогательная колонка, 
	// для маркировки пользователем строки правила. Добавляется всегда.
	НоваяСтрока = ТаблицаКолонки.Добавить();
	НоваяСтрока.НомерСтроки 		= 9998;
	НоваяСтрока.ИмяКолонки 			= "СлужебнаяОтметка";
	НоваяСтрока.ИмяРеквизита 		= "СлужебнаяОтметка";
	НоваяСтрока.ТипыЗначенийСтр 	= "Строка";
	НоваяСтрока.ТипыЗначенийВФорме 	= ОбщегоНазначения.ОписаниеТипаСтрока(150);
	НоваяСтрока.ПоложениеКолонки 	= Перечисления.бит_ПоложенияКолонокТаблицы.НоваяКолонка;
	НоваяСтрока.ВидКолонки 			= Перечисления.бит_ВидыКолонокПравилТрансляции.Прочее;
	НоваяСтрока.НаименованиеКолонки = НСтр("ru='Служебная отметка';en='Office mark'");
	НоваяСтрока.Видимость 			= Истина;
	НоваяСтрока.ТолькоПросмотр 		= Ложь;

	Если ДобавитьСлужебныеКолонки Тогда
		
		// Служебные колонки табличного поля настроек трансляции.
		НоваяСтрока = ТаблицаКолонки.Вставить(0);
		НоваяСтрока.НомерСтроки = -1;
		НоваяСтрока.ИмяКолонки = "НомерСтроки";
		НоваяСтрока.ИмяРеквизита = "НомерСтроки";
		НоваяСтрока.ТипыЗначенийСтр = "Число";
		НоваяСтрока.ТипыЗначенийВФорме = Новый ОписаниеТипов("Число");
		НоваяСтрока.ПоложениеКолонки = Перечисления.бит_ПоложенияКолонокТаблицы.НоваяКолонка;
		НоваяСтрока.ВидКолонки = Перечисления.бит_ВидыКолонокПравилТрансляции.Прочее;
		НоваяСтрока.НаименованиеКолонки = "№";
		НоваяСтрока.Видимость = Истина;
		НоваяСтрока.ТолькоПросмотр = Истина;
		
		НоваяСтрока = ТаблицаКолонки.Добавить();
		НоваяСтрока.НомерСтроки = 9999;
		НоваяСтрока.ИмяКолонки = "ИД";
		НоваяСтрока.ИмяРеквизита = "ИД";
		НоваяСтрока.ТипыЗначенийСтр = "Строка";
		НоваяСтрока.ТипыЗначенийВФорме = Новый ОписаниеТипов("Строка");
		НоваяСтрока.ПоложениеКолонки = Перечисления.бит_ПоложенияКолонокТаблицы.НоваяКолонка;
		НоваяСтрока.ВидКолонки = Перечисления.бит_ВидыКолонокПравилТрансляции.Прочее;		
		НоваяСтрока.НаименованиеКолонки = "ИД";
		НоваяСтрока.Видимость = Ложь;
		НоваяСтрока.ТолькоПросмотр = Истина;
		
	КонецЕсли; 
	
	Возврат ТаблицаКолонки;
	
КонецФункции

// Функция инициализирует структуру видов регистров источник и приемник.
// 
// Параметры:
//  ИсточникРегистрБухгалтерии - Булево.
//  ИсточникРегистрНакопления  - Булево.           
//  ПриемникРегистрБухгалтерии - Булево.
//  ПриемникРегистрНакопления  - Булево.
// 
// Возвращаемое значение:
//   ВидыРегистров   - Структура.
// 
Функция КонструкторСтруктурыВидыРегистров(ИсточникРегистрБухгалтерии,ИсточникРегистрНакопления,
			ПриемникРегистрБухгалтерии,ПриемникРегистрНакопления) Экспорт

	ВидыРегистров = Новый Структура;
								
	ВидыРегистров.Вставить("ИсточникРегистрБухгалтерии", 	 ИсточникРегистрБухгалтерии);
	ВидыРегистров.Вставить("ИсточникРегистрНакопления", 	 ИсточникРегистрНакопления);
	ВидыРегистров.Вставить("ПриемникРегистрБухгалтерии", 	 ПриемникРегистрБухгалтерии);
	ВидыРегистров.Вставить("ПриемникРегистрНакопления",		 ПриемникРегистрНакопления);
	ВидыРегистров.Вставить("МетаданныеИсточника", 			 Неопределено);
	ВидыРегистров.Вставить("МетаданныеПриемника", 			 Неопределено);
	ВидыРегистров.Вставить("РежимИспользованияСоответствий", Неопределено);
								
 	Возврат ВидыРегистров;
				
КонецФункции

// Функция инициализирует структуру параметров правил трансляции.
// 
// Возвращаемое значение:
//   СтруктураПараметров   - Структура.
// 
Функция КонструкторСтруктурыПараметровТрансляции()  Экспорт

СтруктураПараметров = Новый Структура("ОбязательныеПоля
										|,ПравилоЗаполнения
										|,ПравилаТрансляции
										|,КодУсловияТрансляции
										|,СтруктураШапкиДокумента
										|,ПользовательскиеФункции
										|,ДополнительныеАналитики
										|,ПризнакиУчета
										|,ВидыРегистров
										|,МетаданныеИсточника
										|,МетаданныеПриемника
										|,МетаданныеРегистратора
										|,ЗаписыватьДвижения
										|,ВестиПротокол
										|,ОбъектСистемыИсточник
										|,ОбъектСистемыПриемник
										|,НаборСоответствие
										|,НаборСоответствиеОборотов
										|,ПараметрыАвтозаполнения
										|,ОчиститьПриемник
										|,РежимИспользованияСоответствий");
																								
СтруктураПараметров.ОчиститьПриемник = Истина;
																				
Возврат СтруктураПараметров;														

КонецФункции // КонструкторСтруктурыПараметровТрансляции()

// Функция получает ражим трансляции.
// 
// Параметры:
//  ОбъектСистемы      - СправочникСсылка.ОбъектыСистемы.
//  ТекущаяДата        - Дата.
//  Организация 	   - СправочникСсылка.Организации.
//  НастройкиТрансляции - ТаблицаЗначений.
// 
// Возвращаемое значение:
//   РежимТрансляции   - Перечисления.бит_РежимыТрансляции.OnLine.
// 
Функция ПолучитьРежимТрансляции( ТекущаяДата, ОбъектСистемы, Организация = Неопределено, НастройкиТрансляции = Неопределено) Экспорт

	РежимТрансляции = Перечисления.бит_РежимыТрансляции.НеВыполнять;
	
	Если НастройкиТрансляции = Неопределено Тогда
	
		НастройкиТрансляции = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиТрансляции");
	
	КонецЕсли; 

	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Период"       ,Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("ОбъектСистемы",Новый ОписаниеТипов("СправочникСсылка.бит_ОбъектыСистемы"));
	ТаблицаДанных.Колонки.Добавить("Организация"  ,Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("Режим"        ,Новый ОписаниеТипов("ПеречислениеСсылка.бит_РежимыТрансляции"));
	
	Для каждого СтрокаТаблицы Из НастройкиТрансляции Цикл
	
		НоваяСтрока = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
	
	КонецЦикла; 
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ОбъектСистемы",ОбъектСистемы);
	Запрос.УстановитьПараметр("Организация"  ,Организация);
	Запрос.УстановитьПараметр("ТекущаяДата"  ,ТекущаяДата);
	Запрос.УстановитьПараметр("ТаблицаДанных",ТаблицаДанных);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДанных.Период,
	               |	ТаблицаДанных.ОбъектСистемы,
	               |	ТаблицаДанных.Организация,
	               |	ТаблицаДанных.Режим
	               |ПОМЕСТИТЬ ТаблицаДанных
	               |ИЗ
	               |	&ТаблицаДанных КАК ТаблицаДанных
	               |ГДЕ
	               |	(ТаблицаДанных.Организация = &Организация
	               |			ИЛИ ТаблицаДанных.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИЛИ ТаблицаДанных.Организация = НЕОПРЕДЕЛЕНО)
	               |	И (ТаблицаДанных.ОбъектСистемы = &ОбъектСистемы
	               |			ИЛИ ТаблицаДанных.ОбъектСистемы = НЕОПРЕДЕЛЕНО
	               |			ИЛИ ТаблицаДанных.ОбъектСистемы = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПустаяСсылка))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДанных.ОбъектСистемы,
	               |	ТаблицаДанных.Организация,
	               |	МАКСИМУМ(ТаблицаДанных.Период) КАК Период
	               |ПОМЕСТИТЬ ТаблицаДат
	               |ИЗ
	               |	ТаблицаДанных КАК ТаблицаДанных
	               |ГДЕ
	               |	ТаблицаДанных.Период <= &ТекущаяДата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаДанных.ОбъектСистемы,
	               |	ТаблицаДанных.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДат.Период,
	               |	ТаблицаДанных.ОбъектСистемы,
	               |	ТаблицаДанных.Организация,
	               |	ТаблицаДанных.Режим,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДанных.Организация = НЕОПРЕДЕЛЕНО
	               |				ИЛИ ТаблицаДанных.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ТаблицаДанных.ОбъектСистемы = НЕОПРЕДЕЛЕНО
	               |							ИЛИ ТаблицаДанных.ОбъектСистемы = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПустаяСсылка)
	               |						ТОГДА 4
	               |					ИНАЧЕ 3
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ТаблицаДанных.ОбъектСистемы = НЕОПРЕДЕЛЕНО
	               |						ИЛИ ТаблицаДанных.ОбъектСистемы = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПустаяСсылка)
	               |					ТОГДА 2
	               |				ИНАЧЕ 1
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Приоритет
	               |ИЗ
	               |	ТаблицаДат КАК ТаблицаДат
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанных КАК ТаблицаДанных
	               |		ПО ТаблицаДат.Период = ТаблицаДанных.Период
	               |			И ТаблицаДат.ОбъектСистемы = ТаблицаДанных.ОбъектСистемы
	               |			И ТаблицаДат.Организация = ТаблицаДанных.Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТаблицаДанных
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТаблицаДат";
				   
				   
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		РежимТрансляции = Выборка.Режим;
	
	КонецЕсли; 
	
	Возврат РежимТрансляции;
	
КонецФункции // ПолучитьНастройкиТрансляции()

// Процедура очищает соответствие движений для указанных Источника и Приемника.
// 
// Параметры:
//  НаборСоответствие - РегистрНакопленийНаборЗаписей.бит_ОборотыПоТипамПроводок.
//  Приемник 		  - СправочникСсылка.бит_ОбъектыСистемы.
// 
Процедура ОчиститьСоответствиеДвиженийПоТипуПроводки(НаборСоответствие, Приемник) Экспорт
		
	Индекс = НаборСоответствие.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ТекЗапись = НаборСоответствие[Индекс];
		// Т.к. набор-приемник очищается перед выполнение трансляции, 
		// то и все соответствия номеров по данному приемнику очищаем. 
	    // Иначе могут остаться соответствия от прошлых итерация, движения которых не будут записаны.
		Если ТекЗапись.РегистрБухгалтерии = Приемник Тогда
			НаборСоответствие.Удалить(ТекЗапись);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры // ОчиститьСоответствиеДвиженийПоТипуПроводки()

// Функция формирует имя аналитики БИТ.
// 
// Параметры:
//  АналитикаСсылка  - ПланВидовХарактеристикСсылка.бит_ВидыДополнительныхАналитик.
// 
// Возвращаемое значение:
//   ИмяАналитики   - Строка.
// 
Функция СформироватьИмяАналитики(АналитикаСсылка,ВерхнийРегистр = Ложь) Экспорт

	ИмяАналитики = "";
	
	Если АналитикаСсылка.Предопределенный Тогда
		
		ИмяАналитики    = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ПолучитьИмяПредопределенного(АналитикаСсылка);
		
	Иначе
		
		ИмяАналитики = СокрЛП(АналитикаСсылка.Код);
		ИмяАналитики = СтрЗаменить(ИмяАналитики," ","");
		
	КонецЕсли; 	
	
	Если ВерхнийРегистр Тогда
	
		ИмяАналитики = ВРег(ИмяАналитики);
	
	КонецЕсли; 
	
	Возврат ИмяАналитики;
	
КонецФункции // СформироватьИмяАналитики()

// Функция выполняет поиск вида субконто.
// 
// Параметры:
//  ИмяПВХ  - Строка.
//  ИмяСубконто - Строка.
// 
// Возвращаемое значение:
//  ВидСубконто - ПланВидовХарактеристикСсылка.
// 
Функция НайтиВидСубконто(ИмяПВХ,ИмяСубконто) Экспорт
	
	ПВХ = ПланыВидовХарактеристик[ИмяПВХ];

	Попытка
		// Предопределенные субконто получаем по имени.
		ВидСубконто = ПВХ[ИмяСубконто];
	Исключение
		ВидСубконто = ПВХ.ПустаяСсылка();
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ВидСубконто) Тогда
		Если Найти(ИмяПВХ,"бит_ВидыСубконтоДополнительные_")>0 
			 ИЛИ Найти(ИмяПВХ,"бит_ВидыСубконтоБюджетирования")>0 Тогда
			 
			 // Для субконто БИТ выполняем имя записано в код.
			 ВидСубконто = ПВХ.НайтиПоКоду(ИмяСубконто);
		Иначе	
			 // Другие непредопределенные субконто ищем по наименованию.
			 ВидСубконто = ПВХ.НайтиПоНаименованию(ИмяСубконто);
		КонецЕсли; 
	КонецЕсли; 

	Возврат ВидСубконто;
	
КонецФункции // НайтиВидСубконто()

// Функция получает имя субконто. Для предопределенных это имя, 
// заданное в конфигураторе, для не предопределенных БИТ - код, для остальных наименование.
// 
// Параметры:
//  ИмяПВХ  - Строка.
//  СубконтоСсылка  - ПланВидовХарактеристикСсылка.
// 
// Возвращаемое значение:
//   ИмяСубконто   - Строка.
// 
Функция ПолучитьИмяСубконто(ИмяПВХ,СубконтоСсылка) Экспорт

	Если СубконтоСсылка.Предопределенный Тогда
		
		// Для предопределенных - имя
		ИмяСубконто    = ПланыВидовХарактеристик[ИмяПВХ].ПолучитьИмяПредопределенного(СубконтоСсылка);
		
	Иначе	
		
		Если Найти(ИмяПВХ,"бит_ВидыСубконтоДополнительные_") > 0 
			ИЛИ Найти(ИмяПВХ,"бит_ВидыСубконтоБюджетирования")>0 Тогда
			
			// Не предопределенные БИТ - код
			ИмяСубконто =  СокрЛП(СубконтоСсылка.Код);
			
		Иначе
			
			// Остальные - наименование
			ИмяСубконто = СокрЛП(СубконтоСсылка.Наименование);
			
		КонецЕсли; 
		
	КонецЕсли; 	

	Возврат ИмяСубконто;
	
КонецФункции // СформироватьИмяСубконто()

// Инициализирует колонки таблицы, используемой для визуального представления настроек правил трансляции.
// 
// Параметры:
//  ТаблицаНастройки - ТаблицаЗначений.
//  ТаблицаКолонки   - ТаблицаЗначений.
//  ВидыКолонок           - Массив.
// 
Процедура ИнициализироватьТаблицуНастройки(ТаблицаНастройки,ТаблицаКолонки,ВидыКолонок = Неопределено)  Экспорт
	
	ТаблицаНастройки.Колонки.Очистить();
	
	Для каждого СтрокаОписание Из ТаблицаКолонки Цикл
		
		// Фильтр по виду колонок
		Если ТипЗнч(ВидыКолонок) = Тип("Массив") Тогда
			Если ВидыКолонок.Найти(СтрокаОписание.ВидКолонки) = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли;  
		
		ТекОписание = Неопределено;
		Если ТипЗнч(СтрокаОписание.ТипыЗначений) = Тип("ХранилищеЗначения") Тогда
			ТекОписание = СтрокаОписание.ТипыЗначений.Получить();
		КонецЕсли;
		
		Если ТипЗнч(ТекОписание) <> Тип("ОписаниеТипов") Тогда
			ТекОписание = ОписаниеПроизвольногоТипа();
		КонецЕсли; 
		
		ТаблицаНастройки.Колонки.Добавить(СтрокаОписание.ИмяКолонки,ТекОписание);
		
	КонецЦикла; // По таблице колонок
	
	// Добавим колонку обязательную колонку ИД
	ИмяКолонки = "ИД";
	ТекОписание = Новый ОписаниеТипов("Строка");
	ТаблицаНастройки.Колонки.Добавить(ИмяКолонки,ТекОписание);
	
	
КонецПроцедуры // НарисоватьКолонки()
 
Процедура КонтрольПоРучнойКорректировкеФакта(Объект, ЗаписыватьДвижения) Экспорт

	// Для совместимости с БП, КОРП.
	
КонецПроцедуры
 
// Очищает поля в наборе записей "Обороты по бюджетам" по настройкам измерения "Статья оборотов".
//
// Параметры:
//  Источник - РегистрНакопленияНаборЗаписей - наборе записей "Обороты по бюджетам".
//
Процедура ОчиститьНеиспользуемыеПоляОборотыПоБюджетам(Источник) Экспорт 
	// 28.02.2017  BF-619
	
	Измерения       = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Произвольные", "Синоним");
	НастройкиСтатей = Новый Соответствие(); 
	
	// Настройки для пустой статьи
	НастройкиПустойСтатьи = Новый Структура;
	НастройкиПустойСтатьи.Вставить("Измерения"		, Новый Структура);
	НастройкиПустойСтатьи.Вставить("Учет_Сумма"		, Ложь);
	НастройкиПустойСтатьи.Вставить("Учет_Количество", Ложь);

	Для каждого Измерение Из Измерения Цикл
		НастройкиИзмерений = Новый Структура;
		НастройкиИзмерений.Вставить("Имя"				, Измерение.Ключ);
		НастройкиИзмерений.Вставить("Учет"				, Ложь);
		НастройкиИзмерений.Вставить("Обязательный"		, Ложь);
		НастройкиИзмерений.Вставить("ИмяТипаПоУмолчанию", "");
		НастройкиИзмерений.Вставить("ТипПоУмолчанию"	, Неопределено);
		НастройкиПустойСтатьи.Измерения.Вставить(Измерение.Ключ, НастройкиИзмерений);
	КонецЦикла; 
	
	Для каждого Запись Из Источник Цикл
		НастройкиСтатьи = НастройкиСтатей.Получить(Запись.СтатьяОборотов);
		Если НастройкиСтатьи = Неопределено Тогда
			НастройкиСтатьи = Справочники.бит_СтатьиОборотов.ПолучитьНастройки(Запись.СтатьяОборотов);
			НастройкиСтатей.Вставить(Запись.СтатьяОборотов, НастройкиСтатьи);
		КонецЕсли; 
		
		бит_Бюджетирование.УстановитьИспользованиеРесурсов(Запись, НастройкиСтатьи);
		Если ЗначениеЗаполнено(Запись.СтатьяОборотов) Тогда
			бит_Бюджетирование.УстановитьИспользованиеАналитики(Запись, НастройкиСтатьи, Измерения);
		Иначе	
			бит_Бюджетирование.УстановитьИспользованиеАналитики(Запись, НастройкиПустойСтатьи, Измерения);
		КонецЕсли; 		
	КонецЦикла; 

КонецПроцедуры //ОчиститьНеиспользуемыеПоляОборотыПоБюджетам
 
#КонецОбласти

// Процедура обработчик подписки "бит_ОбработкаПроведенияТрансляция" на событие  "ОбработкаПроведения".
// 
// Параметры:
// Источник        - ДокументОбъект
// Отказ           - Булево
// РежимПроведения - РежимПроведенияДокумента. 
// 
Процедура бит_ОбработкаПроведенияТрансляцияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда		
		Возврат;		
	КонецЕсли; 
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
		Возврат;
	КонецЕсли; 			
	
	// ++ ЕРП
	Если НЕ бит_ОбщегоНазначения.ЭтоУТ()
		И ТипЗнч(Источник) = Тип("ДокументОбъект.ОперацияБух")
		И Источник.ЗаполнениеДвижений.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	// -- ЕРП
		
	МетаданныеИсточника = Источник.Метаданные();		
	
	Записывать = ?(МетаданныеИсточника.Имя = "ЗакрытиеМесяца" , Истина, Ложь);
	
	ОтображатьПротокол = Ложь;
	Если НЕ Пользователи.ЭтоСеансВнешнегоПользователя() Тогда 
		ОтображатьПротокол = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОтображатьПротоколТрансляции",
			Пользователи.ТекущийПользователь());
	КонецЕсли;	
	
	РезДанные = ВыполнитьТрансляцию(Источник, , ,Записывать, Перечисления.бит_РежимыТрансляции.OnLine, ОтображатьПротокол);
	Протокол  = РезДанные.Протокол;
	
	КонтрольПоРучнойКорректировкеФакта(Источник, Записывать);
	
	Если ОтображатьПротокол Тогда			
		  ОбщегоНазначения.СообщитьПользователю(Протокол); 
	КонецЕсли;	
	
КонецПроцедуры

// Процедура обработчик подписки "бит_ТрансляцияОперацияПриЗаписи" на событие  "ПриЗаписи" документа ОперацияБух.
// 
// Параметры:
// Источник        - ДокументОбъект.
// Отказ           - Булево.
// 
Процедура бит_ТрансляцияОперацияПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если Отказ  Тогда		
		Возврат;		
	КонецЕсли; 
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
		Возврат;
	КонецЕсли; 		
	
	// ++ЕРП
	Если Метаданные.Документы.Найти("ОперацияБух") <> Неопределено 
		 И ТипЗнч(Источник) = Тип("ДокументОбъект.ОперацияБух") Тогда
				
		Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
			бит_ОбщегоНазначения.ПриЗаписиОперацииРучнаяКорректировкаФакта(Источник, ?(Источник.ПометкаУдаления, Ложь, Истина));
		КонецЕсли; 
				
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.бит_ОперацияУправленческий") Тогда
		Для каждого НаборЗаписей Из Источник.Движения Цикл			
			МетаРегистр = НаборЗаписей.Метаданные();
			Если СтрСравнить(МетаРегистр.Имя, Источник.ИмяРегистраБухгалтерии)<>0 И НаборЗаписей.Количество() > 0 Тогда
			    НаборЗаписей.Очистить();
				НаборЗаписей.Записывать = Истина;
				НаборЗаписей.Записать();
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	// --ЕРП
	
	ОтображатьПротокол = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОтображатьПротоколТрансляции"
											, Пользователи.ТекущийПользователь());
											
	ЗаписыватьДвижения = Метаданные.Документы.Найти("РегламентнаяОперация") <> Неопределено 
						 И ТипЗнч(Источник) = Тип("ДокументОбъект.РегламентнаяОперация");
	РезДанные = ВыполнитьТрансляцию(Источник, , ,ЗаписыватьДвижения, Перечисления.бит_РежимыТрансляции.OnLine, ОтображатьПротокол);
	Протокол  = РезДанные.Протокол;	
	
	КонтрольПоРучнойКорректировкеФакта(Источник, ЗаписыватьДвижения);
	
	Если ОтображатьПротокол Тогда			
		ОбщегоНазначения.СообщитьПользователю(Протокол); 
	КонецЕсли;
	
КонецПроцедуры

// Функция определяет необходимость выполнения трансляции 
// в зависимости от НастройкиРежима трансляции и текущего РежимаВыполнения процедуры трансляции.
// 
// Параметры:
//  НастройкаРежима  - ПеречислениеСсылка.бит_РежимыТрансляции - настройка, 
// 						указывающая в каком режиме должна выполняться трансляция
//  РежимВыполнения  - ПеречислениеСсылка.бит_РежимыТрансляции - текущий режим,
// 						в котором вызвана процедура трансляции
//  Объект           - ДокументСсылка
//  Организация      - СправочникСсылка.Организации
//  РегистрыИсточники - Массив
//  РегистрыПриемники - Массив
//  ВестиПротокол     - Истина.
// 
// Возвращаемое значение:
//   флТрансляцияНеобходима   - Булево.
// 
Функция ОпределитьНеобходимостьТрансляции(НастройкаРежима, РежимВыполнения, Объект, Организация, РегистрыИсточники,
											РегистрыПриемники, Протокол = "", ВестиПротокол = Истина) Экспорт

	флТрансляцияНеобходима = Истина;
	
	Если НастройкаРежима = Перечисления.бит_РежимыТрансляции.Отложенный Тогда
		
		флЗакрытыйПериод = бит_КонтрольЗакрытогоПериода.ЭтоДокументЗакрытогоПериода(Объект, Организация);
		// Если документ попадает в закрытый период - принудительно выполняется on-line трансляция.
		Если флЗакрытыйПериод Тогда			
			НастройкаРежима = Перечисления.бит_РежимыТрансляции.OnLine;			
		КонецЕсли; 
		
	КонецЕсли; 	
	
	Если НастройкаРежима = Перечисления.бит_РежимыТрансляции.НеВыполнять Тогда
		
		// Трансляция вообще не выполняется.
		ТекстСообщения = НСтр("ru='Для данного объекта установлен режим трансляции ""не выполнять"".';
							  |en='This object is set to ""do not execute"" translation mode.'");
		ДобавитьСообщениеВПротокол(Протокол, ТекстСообщения, ВестиПротокол);		
		флТрансляцияНеобходима = Ложь;
		
	ИначеЕсли НастройкаРежима = Перечисления.бит_РежимыТрансляции.OnLine Тогда
		
		// Самый высокий приоритет - трансляция выполняется всегда.
		флТрансляцияНеобходима = Истина;			 
		
	ИначеЕсли НастройкаРежима = Перечисления.бит_РежимыТрансляции.Ручной  Тогда
		
		Если РежимВыполнения = Перечисления.бит_РежимыТрансляции.Ручной Тогда
			флТрансляцияНеобходима = Истина;
		Иначе	
			ТекстСообщения = НСтр("ru='Для данного объекта установлен режим трансляции ""Ручной"".';
								  |en='This object is set to ""Manual"" translation mode.'");
			ТекстСообщения = ТекстСообщения + " " 
						   + НСтр("ru='Трансляция выполняется обработками ""Групповая трансляция"" и ""Групповое редактирование дополнительных аналитик"".'; 
								  |en='Translation is performed by processings ""Group Live"" and ""Batch Edit additional analyst"".'");
			ДобавитьСообщениеВПротокол(Протокол,ТекстСообщения, ВестиПротокол);				
			флТрансляцияНеобходима = Ложь;
		КонецЕсли; 
		
	ИначеЕсли НастройкаРежима = Перечисления.бит_РежимыТрансляции.Отложенный  Тогда
		
		Если РежимВыполнения = Перечисления.бит_РежимыТрансляции.Отложенный Тогда
			
			флТрансляцияНеобходима = Истина;
			
		Иначе	
			
			МассивИсточники = Новый Массив;
			МассивПриемники = Новый Массив;
			
			Если ЗначениеЗаполнено(РегистрыИсточники) Тогда
				МассивИсточники = ОбщегоНазначения.СкопироватьРекурсивно(РегистрыИсточники);
			Иначе	
				МассивИсточники = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.бит_ОбъектыСистемы.ПустаяСсылка());
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РегистрыПриемники) Тогда
				МассивПриемники = ОбщегоНазначения.СкопироватьРекурсивно(РегистрыПриемники);	
			Иначе	
				МассивПриемники = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.бит_ОбъектыСистемы.ПустаяСсылка());			
			КонецЕсли;
			
			флЕстьОшибкиЗаписи = Ложь;
			Для каждого ЭлементИсточник Из МассивИсточники Цикл
				Для каждого ЭлементПриемник Из МассивПриемники Цикл
				
					МенеджерЗаписи = РегистрыСведений.бит_ОчередьТрансляции.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Статус             = Перечисления.бит_СтатусыВыполненияОтложеннойТрансляции.Ожидание;
					МенеджерЗаписи.Объект             = Объект;
					МенеджерЗаписи.Организация        = Организация;
					МенеджерЗаписи.ПоставленоВОчередь = ТекущаяДатаСеанса();
					МенеджерЗаписи.Источник           = ЭлементИсточник;
					МенеджерЗаписи.Приемник           = ЭлементПриемник;

					Попытка					
						МенеджерЗаписи.Записать();					
					Исключение 						
						флЕстьОшибкиЗаписи = Истина;						
					КонецПопытки;
				КонецЦикла; 
			КонецЦикла; 
			
			Если НЕ флЕстьОшибкиЗаписи Тогда				
				ТекстСообщения = НСтр("ru='Документ поставлен в очередь на выполнение трансляции.';
									  |en='A document is queued for translation.'");
				ДобавитьСообщениеВПротокол(Протокол, ТекстСообщения, ВестиПротокол);				
			Иначе				
				ТекстСообщения = НСтр("ru='Не удалось поставить документ в очередь на выполнение трансляции.';
									  |en='Unable to put the document in the queue for translation.'");
				ДобавитьСообщениеВПротокол(Протокол, ТекстСообщения, ВестиПротокол);				
			КонецЕсли; 
			
			флТрансляцияНеобходима = Ложь; 			
		КонецЕсли; 
	КонецЕсли;

	Возврат флТрансляцияНеобходима;
	
КонецФункции // ОпределитьВозможностьТрансляции()

// Процедура заполняет запись соответствия оборотов.
// 
// Параметры:
// НаборСоответствиеОборотов - РегистрНакопленияНаборЗаписей.бит_СоответствиеОборотовТрансляции.
// ЗаписьИсточник - РегистрБухгалтерииЗапись.бит_Дополнительный_<i>, РегистрБухгалтерииЗапись.Хозрасчетный.
// ЗаписьПриемник - РегистрБухгалтерииЗапись.бит_Дополнительный_<i>, РегистрБухгалтерииЗапись.Хозрасчетный.
// СтруктураШапкиДокумента - Структура.
// СтруктураПараметров - Структура.
// 
Процедура ЗаполнитьЗаписьСоответствияОборотов(НаборСоответствиеОборотов, 
	ЗаписьИсточник, ЗаписьПриемник, ПараметрыЗаписи) Экспорт
	
	// Запишем соответствие оборотов
	ЗаписьСоответствиеОб = НаборСоответствиеОборотов.Добавить();
	
	// Информационные поля
	ЗаписьСоответствиеОб.Регистратор = ПараметрыЗаписи.Реквизиты.Ссылка;
	ЗаписьСоответствиеОб.Период          = ЗаписьИсточник.Период;
	ЗаписьСоответствиеОб.ПериодПриемника = ЗаписьПриемник.Период; 
	
	Если ПараметрыЗаписи.СтороныТрансляции.МетаданныеИсточника.Измерения.Найти("Организация") <> Неопределено Тогда
		ЗаписьСоответствиеОб.Организация = ЗаписьИсточник.Организация;
	ИначеЕсли ПараметрыЗаписи.Реквизиты.Свойство("Организация") Тогда
		ЗаписьСоответствиеОб.Организация = ПараметрыЗаписи.Реквизиты.Организация;
	КонецЕсли;     
	
	ЗаписьСоответствиеОб.Источник    = ПараметрыЗаписи.СтороныТрансляции.ОбъектСистемыИсточник;
	ЗаписьСоответствиеОб.Приемник    = ПараметрыЗаписи.СтороныТрансляции.ОбъектСистемыПриемник;
	
	Если НЕ ПараметрыЗаписи.СтороныТрансляции.МетаданныеПриемника.Реквизиты.Найти("ТипПроводки") = Неопределено Тогда
		ЗаписьСоответствиеОб.ТипПроводки = ЗаписьПриемник.ТипПроводки;
	КонецЕсли; 
	
	// Активность
	ЗаписьСоответствиеОб.Активность = ЗаписьПриемник.Активность;
	
	// Счета
	ЗаписьСоответствиеОб.СчетИсточникаДт = ЗаписьИсточник.СчетДт;
	ЗаписьСоответствиеОб.СчетИсточникаКт = ЗаписьИсточник.СчетКт;				
	
	ЗаписьСоответствиеОб.СчетПриемникаДт = ЗаписьПриемник.СчетДт;
	ЗаписьСоответствиеОб.СчетПриемникаКт = ЗаписьПриемник.СчетКт;				
	
	// Субконто
	МаксКоличествоСубконтоСоотв = 4;
	
	ЗаполнитьСубконтоДляСоответствия(ЗаписьСоответствиеОб, ЗаписьИсточник, "Дт", "СубконтоИсточника", МаксКоличествоСубконтоСоотв);	
	ЗаполнитьСубконтоДляСоответствия(ЗаписьСоответствиеОб, ЗаписьИсточник, "Кт", "СубконтоИсточника", МаксКоличествоСубконтоСоотв);	
	
	ЗаполнитьСубконтоДляСоответствия(ЗаписьСоответствиеОб, ЗаписьПриемник, "Дт", "СубконтоПриемника", МаксКоличествоСубконтоСоотв);	
	ЗаполнитьСубконтоДляСоответствия(ЗаписьСоответствиеОб, ЗаписьПриемник, "Кт", "СубконтоПриемника", МаксКоличествоСубконтоСоотв);										
	
	// Ресурсы
	Если НЕ ПараметрыЗаписи.СтороныТрансляции.МетаданныеПриемника.Ресурсы.Найти("СуммаУпр") = Неопределено Тогда
		ЗаписьСоответствиеОб.СуммаУпр = ЗаписьПриемник.СуммаУпр;
	КонецЕсли; 
	
	Если НЕ ПараметрыЗаписи.СтороныТрансляции.МетаданныеПриемника.Ресурсы.Найти("СуммаРегл") = Неопределено Тогда
		ЗаписьСоответствиеОб.СуммаРегл = ЗаписьПриемник.СуммаРегл;
	КонецЕсли;   
	
	Если НЕ ПараметрыЗаписи.СтороныТрансляции.МетаданныеПриемника.Ресурсы.Найти("СуммаМУ") = Неопределено Тогда
		ЗаписьСоответствиеОб.СуммаМУ = ЗаписьПриемник.СуммаМУ;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ЗаписьИсточник.НомерСтроки) Тогда
		ЗаписьСоответствиеОб.НомерСтрокиИсточника = ЗаписьИсточник.НомерСтроки;
	Иначе
		ЗаписьСоответствиеОб.НомерСтрокиИсточника = ПараметрыЗаписи.НомерСтрокиИсточника;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаписьПриемник.НомерСтроки) Тогда
		ЗаписьСоответствиеОб.НомерСтрокиПриемника = ЗаписьПриемник.НомерСтроки;	
	Иначе
		ЗаписьСоответствиеОб.НомерСтрокиПриемника = ПараметрыЗаписи.НомерСтрокиПриемника;
	КонецЕсли; 
	
КонецПроцедуры // ЗаполнитьЗаписьСоответствияОборотов()

// Процедура выполняет преобразование записей источника в записи приемника по правилам трансляции.
// 
// Параметры:
//  Источник  - ДокументОбъект.
//  НаборИсточник - РегистрНакопления.НаборЗаписей, РегистрБухгалтерии.НаборЗаписей.
//  НаборПриемник - РегистрНакопления.НаборЗаписей, РегистрБухгалтерии.НаборЗаписей.
//  СтруктураПараметров - Структура.
//  Протокол      - Строка.
// 
Функция ВыполнитьТрансляциюДвижений(Источник, НаборИсточник, НаборПриемник, СтруктураПараметров, Протокол, ОбработанныеПриемники = Неопределено) Экспорт

	ЕстьОшибки = Ложь;	
	
	Если Источник = Неопределено И НЕ СтруктураПараметров.ОбработкаБезДокумента Тогда
		Возврат ЕстьОшибки;	
	КонецЕсли; 
	
	// Соберем итоговый код трансляции и кэш реквизитов.
	КодУсловияТрансляции 		= СтруктураПараметров.КодУсловияТрансляции;
	флГенерироватьКодТрансляции = НЕ ЗначениеЗаполнено(КодУсловияТрансляции);
	
	Если флГенерироватьКодТрансляции Тогда
		КодУсловияТрансляции = "";
	КонецЕсли; 
	
	КэшРеквизитов = Новый ТаблицаЗначений;
	КэшРеквизитов.Колонки.Добавить("ИД");
	КэшРеквизитов.Колонки.Добавить("ИмяКолонки");
	КэшРеквизитов.Колонки.Добавить("Значение");
	КэшРеквизитов.Индексы.Добавить("ИД, ИмяКолонки");
	
	Для каждого Правило Из СтруктураПараметров.ПравилаТрансляции Цикл
		
		ТабВрем = бит_МеханизмТрансляцииВызовПовтИсп.ПодготовитьКэшРеквизитов(Правило);
		
		Для каждого СтрокаТаблицы Из ТабВрем Цикл
			НоваяСтрока = КэшРеквизитов.Добавить();
			НоваяСтрока.ИД = СтрокаТаблицы.ИД;
			НоваяСтрока.ИмяКолонки = СтрокаТаблицы.ИмяКолонки;
			НоваяСтрока.Значение = СтрокаТаблицы.Значение;
		КонецЦикла; 
		
		Если флГенерироватьКодТрансляции Тогда
			 КодУсловияТрансляции = КодУсловияТрансляции + Правило.КодУсловияТрансляции;
		КонецЕсли; 
	КонецЦикла; 
	
	ПравилоЗаполнения       = СтруктураПараметров.ПравилоЗаполнения;
	СтруктураШапкиДокумента = СтруктураПараметров.СтруктураШапкиДокумента;
	ДополнительныеАналитики = СтруктураПараметров.ДополнительныеАналитики;
	ПользовательскиеФункции = СтруктураПараметров.ПользовательскиеФункции;
    ВидыРегистров           = СтруктураПараметров.ВидыРегистров;
	МетаданныеРегистратора  = СтруктураПараметров.МетаданныеРегистратора;
	
	Если СтруктураПараметров.Свойство("СтруктураШапкиМСФО") Тогда
		СтруктураШапкиМСФО = СтруктураПараметров.СтруктураШапкиМСФО;
	Иначе	
		СтруктураШапкиМСФО = СтруктураПараметров.СтруктураШапкиДокумента;
	КонецЕсли; 
	
	Если СтруктураПараметров.Свойство("ВестиПротокол") Тогда
		ВестиПротокол     = СтруктураПараметров.ВестиПротокол;
		Если НЕ ТипЗнч(ВестиПротокол) = Тип("Булево") Тогда
			ВестиПротокол = Ложь;
		КонецЕсли; 
	Иначе	
		ВестиПротокол    = Ложь;
	КонецЕсли; 
	
	// Набор записей для хранения соответствия номеров записей источника и приемника.
	НаборСоответствие       = СтруктураПараметров.НаборСоответствие;
	ЗаписыватьСоответствиеНомеров = НЕ НаборСоответствие = Неопределено;
	
	НаборСоответствиеОборотов = СтруктураПараметров.НаборСоответствиеОборотов;
	ЗаписыватьСоответствиеОборотов = ?(ВидыРегистров.ИсточникРегистрБухгалтерии 
	                                      И ВидыРегистров.ПриемникРегистрБухгалтерии 
										  И НЕ НаборСоответствиеОборотов = Неопределено , Истина, Ложь);
									  
	
	// Возможность отказа от ввода записей
	Отказ = Ложь;			
	// Массив для хранения описания возникших ошибок.
	Ошибки = Новый Массив;
	// Структура для отметки о типах возникших ошибок.
	ТипыОшибок = Новый Структура; 
	ТипыОшибок.Вставить("ПередФормированиемЗаписи", Ложь);
	ТипыОшибок.Вставить("КодУсловияТрансляции", Ложь);
	ТипыОшибок.Вставить("КодЗаполнения", Ложь);
	ТипыОшибок.Вставить("ПослеФормированияЗаписи", Ложь);
	
	// ОБРАБОТЧИК ПЕРЕД ФОРМИРОВАНИЕМ НАБОРА ЗАПИСЕЙ.
	Попытка
		// АПК:487-выкл ВыполнитьВБезопасномРежиме не используется, т.к. выполняется безопасный код.
		Выполнить(ПравилоЗаполнения.КодПередФормированиемНабораЗаписей);
		// АПК:487-вкл.
	Исключение
		Ошибки.Добавить(КонструкторПараметрыОшибки("ПередФормированиемНабораЗаписей",
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки;
	
	ОбработкаНабораПриРучномРедактированииФакта(СтруктураПараметров.МетаданныеПриемника, ДополнительныеАналитики, Отказ);										
	
	Если Отказ Тогда
		Возврат ЕстьОшибки;
	КонецЕсли; 
	
	// Анализ "НеОтражатьВФактеТрансляция", "НеОтражатьВМСФО", "НеВыполнятьТрансляцию" и
	// "РучнаяКорректировкаФактаБюджета".
	АнализироватьНеобходимостьОбработкиНабора(ПравилоЗаполнения
											,СтруктураПараметров.МетаданныеПриемника
											,ДополнительныеАналитики
											,Отказ);
											
	
	// Если выполняется трансляция документа у которого взведен флаг "Ручное редактирование" и Отказ = Истина,
	// тогда очищать движения не надо.
	Если НЕ Источник = Неопределено Тогда
		ЕстьРучнаяКорректировка = ОбщегоНазначения.ЕстьРеквизитОбъекта("РучнаяКорректировка", Источник.Метаданные());
		Если ЕстьРучнаяКорректировка И Источник.РучнаяКорректировка И Отказ Тогда
			Возврат ЕстьОшибки;
		КонецЕсли;
	КонецЕсли;
	
	ОчиститьСоответствия = Истина;
	Если СтруктураПараметров.ОчиститьПриемник Тогда
		
		Если ТипЗнч(ОбработанныеПриемники) = Тип("Соответствие") Тогда
			
			Если ОбработанныеПриемники[СтруктураПараметров.МетаданныеПриемника.Имя] = Неопределено Тогда
				
				// Приемник очищаем только при первом обращении в рамках трансляции по одному документу.
				// При последующих обращениях дозаписываем движения. Это позволяет выполнять трансляцию "Многие в один".
				НаборПриемник.Очистить();
				НаборПриемник.Записывать = Истина;			
				ОбработанныеПриемники.Вставить(СтруктураПараметров.МетаданныеПриемника.Имя, Истина);
			Иначе	
				
				// Не очищаем приемник и не очищаем соответствия.
				Если НаборПриемник.Количество() > 0 Тогда
					ОчиститьСоответствия = Ложь;
				КонецЕсли;
			КонецЕсли; 
		Иначе	
			НаборПриемник.Очистить();
			НаборПриемник.Записывать = Истина;			
		КонецЕсли; 
	КонецЕсли; 
	
	Если ЗаписыватьСоответствиеНомеров Тогда
		
		НаборСоответствие.Записывать = Истина;
		Если ОчиститьСоответствия Тогда
			ОчиститьСоответствиеДвижений(НаборСоответствие, СтруктураПараметров.ОбъектСистемыПриемник);
		КонецЕсли; 
	КонецЕсли; 								  
	
	Если ЗаписыватьСоответствиеОборотов Тогда
		
		НаборСоответствиеОборотов.Записывать = Истина;
		Если ОчиститьСоответствия Тогда
			ОчиститьСоответствиеДвижений(НаборСоответствиеОборотов, СтруктураПараметров.ОбъектСистемыПриемник);
		КонецЕсли; 
	КонецЕсли; 								  
	
	// Очищаем движения при групповой трансляции, когда Отказ = Истина.
	Если Отказ Тогда
		Если СтруктураПараметров.ЗаписыватьДвижения Тогда
			ЗаписатьНаборПриТрансляцииДвижений(НаборПриемник, НаборСоответствие, НаборСоответствиеОборотов, 
			Протокол, ВестиПротокол, ЕстьОшибки, ЗаписыватьСоответствиеНомеров, ЗаписыватьСоответствиеОборотов);
		КонецЕсли;
		Возврат ЕстьОшибки;
	КонецЕсли; 

	Ном         	  = 1;
	ДобавленоСтрок	  = 0;
	КоличествоОтказов = 0;
	Для каждого ЗаписьИсточник Из НаборИсточник Цикл
		
		// Возможность отказа от ввода записи
		Отказ = Ложь;	
		// При заполнении субконто использовать аналитику корр. счета.
		флИспользоватьАналитикуКорр = Ложь;

		Аналитики = СформироватьСоответствияАналитик(ЗаписьИсточник,СтруктураПараметров.МетаданныеИсточника,ВидыРегистров);
		
		// Соответствие для передачи значений между правилами трасляции и правилами заполнения.
		ДополнительныеДанные = Новый Соответствие;
		
		ЗаписьПриемник = НаборПриемник.Добавить();
		ЗаписьПриемник.Активность = ЗаписьИсточник.Активность;
		Если НЕ СтруктураПараметров.МетаданныеПриемника.Реквизиты.Найти("ТипПроводки") = Неопределено Тогда
			ЗаписьПриемник.ТипПроводки = Справочники.бит_ТипыПроводок.Трансляция;
		КонецЕсли;
		
		Если СтруктураПараметров.МетаданныеПриемника = Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам Тогда
			ЗаписьПриемник.ТипЗаписи   = Перечисления.бит_ТипыЗаписейОборотовПоБюджетам.Трансляция;
		КонецЕсли;
		
	    // ОБРАБОТЧИК ПЕРЕД ФОРМИРОВАНИЕМ ЗАПИСИ
		Попытка
			// АПК:487-выкл ВыполнитьВБезопасномРежиме не используется, т.к. выполняется безопасный код.
			Выполнить(ПравилоЗаполнения.КодПередФормированиемЗаписи);
			// АПК:487-вкл.
		Исключение
			Если НЕ ТипыОшибок.ПередФормированиемЗаписи Тогда
				Ошибки.Добавить(КонструкторПараметрыОшибки("ПередФормированиемЗаписи",КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
				ТипыОшибок.ПередФормированиемЗаписи = Истина;
			КонецЕсли; 
		КонецПопытки;
		
		// Заполним поля исходя из правил трансляции.
		СлужебнаяОтметкаДт = "";
		СлужебнаяОтметкаКт = "";
		Попытка
			// АПК:487-выкл ВыполнитьВБезопасномРежиме не используется, т.к. выполняется безопасный код.
			Выполнить(КодУсловияТрансляции);
			// АПК:487-вкл.
		Исключение
			Если НЕ ТипыОшибок.КодУсловияТрансляции Тогда
				Ошибки.Добавить(КонструкторПараметрыОшибки("КодУсловияТрансляции",КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
				ТипыОшибок.КодУсловияТрансляции = Истина;
			КонецЕсли; 
		КонецПопытки;
		
		// Заполним поля исходя из правил заполнения по - умолчанию.
		Попытка
			// АПК:487-выкл ВыполнитьВБезопасномРежиме не используется, т.к. выполняется безопасный код.
			Выполнить(ПравилоЗаполнения.КодЗаполнения);
			// АПК:487-вкл.
		Исключение
			Если НЕ ТипыОшибок.КодЗаполнения Тогда
				Ошибки.Добавить(КонструкторПараметрыОшибки("КодЗаполнения",КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
				ТипыОшибок.КодЗаполнения = Истина;
			КонецЕсли; 
		КонецПопытки;
		
		// Алгоритмы заполнения специфичные для МСФО
		Если бит_му_ОбщегоНазначения.ЭтоМеждународныйПланСчетовИлиРегистр(СтруктураПараметров.МетаданныеПриемника.Имя) Тогда
	
			ВыполнитьАлгоритмыМСФО(СтруктураШапкиМСФО
			                          , ЗаписьИсточник
									  , ЗаписьПриемник
									  , ПравилоЗаполнения
									  , ДополнительныеАналитики
									  , ДополнительныеДанные);
			
		КонецЕсли; // Алгоритмы заполнения специфичные для МСФО.
		 
		Если ВидыРегистров.ПриемникРегистрБухгалтерии Тогда
			
			// Подбор субконто по типу
			Если флИспользоватьАналитикуКорр Тогда
				ЗаполнитьСубконтоВПриемнике(ЗаписьПриемник,"Дт",Аналитики.АналитикиИсточникДт,Аналитики.АналитикиИсточникКт);
				ЗаполнитьСубконтоВПриемнике(ЗаписьПриемник,"Кт",Аналитики.АналитикиИсточникКт,Аналитики.АналитикиИсточникДт);			
			Иначе	
				ЗаполнитьСубконтоВПриемнике(ЗаписьПриемник,"Дт",Аналитики.АналитикиИсточникДт,Аналитики.АналитикиИсточник);
				ЗаполнитьСубконтоВПриемнике(ЗаписьПриемник,"Кт",Аналитики.АналитикиИсточникКт,Аналитики.АналитикиИсточник);			
			КонецЕсли; 
			
			// Применение коэффициентов к ресурсам
			Для каждого Ресурс Из СтруктураПараметров.МетаданныеПриемника.Ресурсы Цикл
				Если Ресурс.Балансовый Тогда
					ИмяРесурса = Ресурс.Имя;
					ПрименитьКоэффициенты(ЗаписьПриемник, ДополнительныеДанные, Ресурс.Имя);
				Иначе	
					ИмяРесурса = Ресурс.Имя+"Дт";
					ПрименитьКоэффициенты(ЗаписьПриемник, ДополнительныеДанные, ИмяРесурса);
					
					ИмяРесурса = Ресурс.Имя+"Кт";
					ПрименитьКоэффициенты(ЗаписьПриемник, ДополнительныеДанные, ИмяРесурса);
				КонецЕсли; 
			КонецЦикла; 
			
		ИначеЕсли ВидыРегистров.ПриемникРегистрНакопления Тогда
			
			// Подбор субконто по типу			
			ЗаполнитьИзмеренияВПриемнике(ЗаписьПриемник,Аналитики,СтруктураПараметров.МетаданныеПриемника);
			
			// Применение коэффициентов к ресурсам			
			Для каждого Ресурс Из СтруктураПараметров.МетаданныеПриемника.Ресурсы Цикл
				ПрименитьКоэффициенты(ЗаписьПриемник, ДополнительныеДанные, Ресурс.Имя);
			КонецЦикла; 
		КонецЕсли; 
		
		// Автозаполнение с использованием соответствий.
		Если СтруктураПараметров.РежимИспользованияСоответствий = Перечисления.бит_РежимыИспользованияСоответствийПриТрансляции.Стандартный  Тогда
			ЗаполнитьПоСоответствиям(ЗаписьИсточник, ЗаписьПриемник, СтруктураПараметров.ПараметрыАвтозаполнения, ВидыРегистров, 
				СтруктураПараметров.СтруктураШапкиДокумента.Дата);
		КонецЕсли; 
					  		
	    // Проверка заполнения обязательных реквизитов.
		ПроверитьОбязательныеПоля(ЗаписьПриемник,СтруктураПараметров.ОбязательныеПоля,Ном,Отказ,Протокол);
		Если ВидыРегистров.ПриемникРегистрБухгалтерии Тогда
		    // Проверка признака валютного и количественного учета.
			ПроверитьПризнакиУчета(ЗаписьПриемник,СтруктураПараметров.ПризнакиУчета);
		КонецЕсли; 
		
	    // ОБРАБОТЧИК ПОСЛЕ ФОРМИРОВАНИЯ ЗАПИСИ	
		Попытка
			// АПК:487-выкл ВыполнитьВБезопасномРежиме не используется, т.к. выполняется безопасный код.
			Выполнить(ПравилоЗаполнения.КодПослеФормированияЗаписи);
			// АПК:487-вкл.
		Исключение
			Если НЕ ТипыОшибок.ПослеФормированияЗаписи Тогда
				Ошибки.Добавить(КонструкторПараметрыОшибки("ПослеФормированияЗаписи",КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
				ТипыОшибок.ПослеФормированияЗаписи = Истина;
			КонецЕсли; 
		КонецПопытки;
		
		Если Отказ Тогда
			 НаборПриемник.Удалить(ЗаписьПриемник);
			 КоличествоОтказов = КоличествоОтказов + 1;
		Иначе
			ДобавленоСтрок = ДобавленоСтрок + 1;
			Если ЗаписыватьСоответствиеНомеров Тогда
				ПараметрыЗаписи = НовыеПараметрыЗаписиСоответствияДвижений();
				ПараметрыЗаписи.Реквизиты 			 = СтруктураШапкиДокумента;
				ПараметрыЗаписи.СтороныТрансляции 	 = СтруктураПараметров; 
				ПараметрыЗаписи.НомерСтрокиИсточника = Ном;
				ПараметрыЗаписи.НомерСтрокиПриемника = НаборПриемник.Количество();
				ПараметрыЗаписи.Активность 			 = ЗаписьПриемник.Активность;
				ПараметрыЗаписи.СлужебнаяОтметкаДт   = СлужебнаяОтметкаДт;
				ПараметрыЗаписи.СлужебнаяОтметкаКт	 = СлужебнаяОтметкаКт;
				
				// Переопределим организацию из записи источника, если она там пристуствует.
				ЗаполнитьЗначенияСвойств(ПараметрыЗаписи.Реквизиты, ЗаписьИсточник);
				
				// Запишем соответствие номеров источника и приемника.
				ДобавитьЗаписьСоответствияДвижений(НаборСоответствие, ПараметрыЗаписи);
			 КонецЕсли; 
			 
			 Если ЗаписыватьСоответствиеОборотов Тогда
				 
				 ПараметрыЗаписи = НовыеПараметрыЗаписиСоответствияДвижений();
				 ПараметрыЗаписи.Реквизиты 			  = СтруктураШапкиДокумента;  
				 ПараметрыЗаписи.СтороныТрансляции 	  = СтруктураПараметров; 
				 ПараметрыЗаписи.НомерСтрокиИсточника = Ном;
				 ПараметрыЗаписи.НомерСтрокиПриемника = НаборПриемник.Количество();
				 
				 ЗаполнитьЗаписьСоответствияОборотов(НаборСоответствиеОборотов, 
					 ЗаписьИсточник, ЗаписьПриемник, ПараметрыЗаписи);
			 
			 КонецЕсли; // Записывать соответствие оборотов
		КонецЕсли; 
		Ном = Ном+1;
	КонецЦикла; 
	
	// ОБРАБОТЧИК ПОСЛЕ ФОРМИРОВАНИЯ НАБОРА ЗАПИСЕЙ.
	Попытка
		// АПК:487-выкл ВыполнитьВБезопасномРежиме не используется, т.к. выполняется безопасный код.
		Выполнить(ПравилоЗаполнения.КодПослеФормированияНабораЗаписей);
		// АПК:487-вкл.
	Исключение
		Ошибки.Добавить(КонструкторПараметрыОшибки("ПослеФормированияНабораЗаписей",КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));		
	КонецПопытки;
	
    // Если в процессе трансляции были выявлены ошибки очистим приемник.
	Если Ошибки.Количество()>0 Тогда
		
		ЕстьОшибки = Истина;
		
		ПараметрыОбработки = Новый Структура;
		ПараметрыОбработки.Вставить("ТранслируемыйДокумент",Источник.Ссылка);
		ПараметрыОбработки.Вставить("Источник"             ,СтруктураПараметров.ОбъектСистемыИсточник);
		ПараметрыОбработки.Вставить("Приемник"             ,СтруктураПараметров.ОбъектСистемыПриемник);
		ПараметрыОбработки.Вставить("КодУсловияТрансляции" ,КодУсловияТрансляции);
		ПараметрыОбработки.Вставить("ПравилоЗаполнения"    ,ПравилоЗаполнения);
		ПараметрыОбработки.Вставить("ВестиПротокол"        ,ВестиПротокол);
		
		ОбработатьОшибки(Ошибки,ПараметрыОбработки,Протокол);
		
		НаборПриемник.Очистить();
	    НаборПриемник.Записывать = Истина;		
	
	КонецЕсли; 
	
	ТекстСообщения = СтрШаблон(НСтр("ru='Создано %1 записей Приемника.';en='Created %1 receiver records.'"), ДобавленоСтрок); 
	ДобавитьСообщениеВПротокол(Протокол,ТекстСообщения,ВестиПротокол);
	
	// При необходимости выполним формирование зависимых оборотов.
	Если ПравилоЗаполнения.ФормироватьЗависимыеОбороты 
		 И СтруктураПараметров.МетаданныеПриемника = Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам		 
		 И НаборПриемник.Количество()>0  Тогда
		 
		 КоличествоНач = НаборПриемник.Количество();
		 бит_Бюджетирование.СформироватьЗависимыеОборотыПоНаборуЗаписей(Источник, НаборПриемник);
		 КоличествоКон = НаборПриемник.Количество();
		 Дельта = КоличествоКон - КоличествоНач;
		 
		  ТекстСообщения = НСтр("ru='Выполнено формирование зависимых оборотов. Сформировано %1 записей.'; 
		 					   |en='Dependent turnovers generated. Formed %1 of the records.'");
		 ТекстСообщения = СтрШаблон(ТекстСообщения, Дельта);
	     ДобавитьСообщениеВПротокол(Протокол, ТекстСообщения, ВестиПротокол);
	КонецЕсли; 
	
	
	// При необходимости выполним формирование проводок бюджетирования исходя из шаблонов проводок 
	// по движениям регистра бит_ОборотыПоБюджетам.
	Если ПравилоЗаполнения.ФормироватьПроводкиБюджетирования 
		И НаборПриемник.Количество()>0  
		И СтруктураПараметров.МетаданныеПриемника = Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам
		И РегистрУчаствуетВДвижениях(Источник.Движения,"бит_Бюджетирование") Тогда
		
		КоличествоСтрок = Источник.Движения.бит_Бюджетирование.Количество();
		СформироватьПроводкиБюджетирования(Источник,НаборПриемник,СтруктураПараметров.ЗаписыватьДвижения);
		Добавлено = Источник.Движения.бит_Бюджетирование.Количество() - КоличествоСтрок;
		
		Если Добавлено > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Выполнено формирование проводок Бюджетирования по шаблонам проводок. Сформировано %1 проводок бюджетирования.';
			|en = 'Achieved formation transactions budget templates postings. Formed %1 postings budgeting.'");		
			ТекстСообщения = СтрШаблон(ТекстСообщения, Добавлено);
			ДобавитьСообщениеВПротокол(Протокол,ТекстСообщения,ВестиПротокол);
		КонецЕсли;
	КонецЕсли;
	
	// При необходимости запишем движения
	Если СтруктураПараметров.ЗаписыватьДвижения Тогда
		ЗаписатьНаборПриТрансляцииДвижений(НаборПриемник, НаборСоответствие, НаборСоответствиеОборотов, 
			Протокол, ВестиПротокол, ЕстьОшибки, ЗаписыватьСоответствиеНомеров, ЗаписыватьСоответствиеОборотов);
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	 
КонецФункции

// Процедура выполняет трансляцию набора записей регистра источника в набор записей регистра приемника.
// 
// Параметры:
// ДокументОбъект     - ДокументОбъект.
// РегистрыИсточники  - Массив, Неопределено.
// РегистрыПриемники  - Массив, Неопределено.
// ЗаписыватьДвижения - Булево.
// РежимВыполнения    - Перечисления.бит_РежимыТрансляции.
// ВестиПротокол      - Булево.
// 
Функция ВыполнитьТрансляцию(ДокументОбъект, РегистрыИсточники    = Неопределено, РегистрыПриемники    = Неопределено, 
								ЗаписыватьДвижения   = ЛОЖЬ, РежимВыполнения      = Неопределено, ВестиПротокол        = Истина)  Экспорт
	
							
	ЕстьОшибки = Ложь;						
							
	УстановитьПривилегированныйРежим(Истина);						
							
	Протокол = "";
	ТекстСообщения = НСтр("ru='Выполнение трансляции движений по документу: %1';
						  |en='Performing translation of movements through the document: %1.'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ДокументОбъект));
	ДобавитьСообщениеВПротокол(Протокол,ТекстСообщения,ВестиПротокол);
	
	МетаданныеИсточник = ДокументОбъект.Метаданные();
	
	Если бит_РаботаСМетаданными.ЕстьРеквизит("Организация",МетаданныеИсточник) Тогда
		Организация = ДокументОбъект.Организация;
	Иначе	
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли; 
	
	ОбъектСистемы   = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаданныеИсточник);
	
	НастройкаРежима = ПолучитьРежимТрансляции(ДокументОбъект.Дата,ОбъектСистемы,Организация);	
	
	Если МетаданныеИсточник = Метаданные.Документы.бит_ЗакрытиеСчетов Тогда
		// Подготовим массив регистров, по которым документ выполняет движения,
		// но удалем закрываемый регистр.
		ЗакрываемыйРегистр = ДокументОбъект.РегистрБухгалтерии;
		Если ЗначениеЗаполнено(РегистрыПриемники) Тогда
			Индекс = РегистрыПриемники.Найти(ЗакрываемыйРегистр);
			Если Индекс >= 0 Тогда
				РегистрыПриемники.Удалить(Индекс);				
			КонецЕсли;
		Иначе	
			Движения = Новый Массив; 
			Для каждого Регистр Из МетаданныеИсточник.Движения Цикл
				Движения.Добавить(Регистр);	
			КонецЦикла;
			Если ЗначениеЗаполнено(Движения) Тогда
				РегистрыПриемники = Справочники.бит_ОбъектыСистемы.ОбъектыСистемыПоОбъектамМетаданных(Движения);
				Индекс = РегистрыПриемники.Найти(ЗакрываемыйРегистр);
				Если Индекс >= 0 Тогда
					РегистрыПриемники.Удалить(Индекс);				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	флТрансляцияНеобходима = ОпределитьНеобходимостьТрансляции(НастройкаРежима, РежимВыполнения,
								ДокументОбъект.Ссылка, Организация, РегистрыИсточники, РегистрыПриемники,
								Протокол, ВестиПротокол);
	Если НЕ флТрансляцияНеобходима Тогда
	
		УстановитьПривилегированныйРежим(Ложь);
	    РезДанные = Новый Структура("ЕстьОшибки, Протокол", Ложь, Протокол);
		
		// Восстановление движений.
		Если ЕстьРучноеРедактированиеФакта(ДокументОбъект) Тогда
			ПриОтказеОтТрансляцииПриПроведении(ДокументОбъект, ЗаписыватьДвижения);	
		КонецЕсли;
		
		Возврат РезДанные;
	КонецЕсли; 
	
	// Хранит имена регистров приемников, в которые уже была выполнена трансляция
	Если НЕ ДокументОбъект.ДополнительныеСвойства.Свойство("бит_ТрансляцияОбработанныеПриемники") Тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("бит_ТрансляцияОбработанныеПриемники", Новый Соответствие);
	КонецЕсли;
	ОбработанныеПриемники = ДокументОбъект.ДополнительныеСвойства.бит_ТрансляцияОбработанныеПриемники;	
	
	// Хранит имена пар источник_приемник, по которым уже была выполнена трансляция.
	Если НЕ ДокументОбъект.ДополнительныеСвойства.Свойство("бит_ТрансляцияОбработанныеПары") Тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("бит_ТрансляцияОбработанныеПары", Новый Соответствие);
	КонецЕсли;
	ОбработанныеПары = ДокументОбъект.ДополнительныеСвойства.бит_ТрансляцияОбработанныеПары;
	
	// Получим данные необходимые для выполнения трансляции - структуру шапки документа 
	// и данные из регистра сведений бит_ДополнительныеАналитики.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ДокументОбъект);
	ДополнитьСтруктуруШапкиДокумента(ДокументОбъект,СтруктураШапкиДокумента);
	
	ДополнительныеАналитики = ПолучитьАналитикиОбъекта(ДокументОбъект.Ссылка);
	
	// Что бы избежать трансляции в регистр бухгалтерии, который установлен в шапке "Операция (управленческий),
	// зафиксируем ссылку. 
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.бит_ОперацияУправленческий") Тогда
		РБОперации = ДокументОбъект.РегистрБухгалтерии;
	Иначе
		РБОперации = Неопределено;
	КонецЕсли; 

	НаборСоответствиеПрочитан = Ложь;
	НаборСоответствиеОборотовПрочитан = Ложь;
	
	// Получим правила заполнения полей и правила трансляции.
	РезультатПравила = ПолучитьДоступныеПравилаТрансляции(Организация,ДокументОбъект,ДокументОбъект.Дата,РегистрыИсточники,РегистрыПриемники);
	
	ВыборкаПравилоЗаполнения = РезультатПравила.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПравилоЗаполнения.Следующий() Цикл
		
		СтруктураПравила = ПодготовитьСтруктурыПравил(ВыборкаПравилоЗаполнения.ПравилоЗаполнения);
		
		ВыборкаИсточник = ВыборкаПравилоЗаполнения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИсточник.Следующий() Цикл
			
			Если НЕ РегистрУчаствуетВДвижениях(ДокументОбъект.Движения, ВыборкаИсточник.ИсточникИмяОбъекта) Тогда
				Продолжить;
			КонецЕсли; 
			
			ВыборкаПриемник = ВыборкаИсточник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПриемник.Следующий() Цикл
				
				Если НЕ РегистрУчаствуетВДвижениях(ДокументОбъект.Движения,ВыборкаПриемник.ПриемникИмяОбъекта) Тогда
					Продолжить;
				КонецЕсли;
				
				Выборка = ВыборкаПриемник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				МассивПравил = Новый Массив;
				КодУсловияТрансляции = "";
				
				флКроме = Ложь;
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.УсловиеВхождения = Перечисления.бит_Кроме.Кроме Тогда
					
						флКроме = Истина;
						Прервать;
					
					КонецЕсли; 
					МассивПравил.Добавить(Выборка.ПравилаТрансляции);
					КодУсловияТрансляции = КодУсловияТрансляции + Выборка.КодУсловияТрансляции;
					
				КонецЦикла; // По настройкам
				
				Если флКроме Тогда
					Продолжить;
				КонецЕсли; 
				
				ИмяИсточника =  ВыборкаИсточник.ИсточникИмяОбъекта;
				ИмяПриемника =  ВыборкаПриемник.ПриемникИмяОбъекта;
				
				// Что бы избежать трансляции в регистр бухгалтерии, который установлен в шапке "Операция (управленческий),
				// пропустим правило. 
				Если ЗначениеЗаполнено(РБОперации) И РБОперации = ВыборкаПриемник.Приемник Тогда
					ОбработанныеПары.Вставить(ИмяИсточника+"_"+ИмяПриемника, Истина);
				КонецЕсли; 
				
				Если НЕ ОбработанныеПары[ИмяИсточника+"_"+ИмяПриемника] = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				
				// При необходимости получим валюту международного учета
				Если (бит_му_ОбщегоНазначения.ЭтоМеждународныйПланСчетовИлиРегистр(ИмяПриемника) 
					   ИЛИ бит_му_ОбщегоНазначения.ЭтоМеждународныйПланСчетовИлиРегистр(ИмяИсточника))
					 И СтруктураШапкиДокумента.Свойство("Организация") 
					 И НЕ СтруктураШапкиДокумента.Свойство("бит_ВалютаМУ") Тогда
				
					 СтруктураШапкиДокумента.Вставить("бит_ВалютаМУ", бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(СтруктураШапкиДокумента.Организация));
					 СтрКурсаМУ = бит_КурсыВалют.ПолучитьКурсВалюты(СтруктураШапкиДокумента.бит_ВалютаМУ,СтруктураШапкиДокумента.Дата);
					 СтруктураШапкиДокумента.Вставить("бит_КурсМУ"     ,СтрКурсаМУ.Курс);
					 СтруктураШапкиДокумента.Вставить("бит_КратностьМУ",СтрКурсаМУ.Кратность);
					
				КонецЕсли; 
				
				// Проверка необходимости трансляции для проформ
				// если движения по регистру сформированы МХО, то трансляция не должна выполняться.
				Если ДокументОбъект.ДополнительныеСвойства.Свойство("бит_ПриемникиМХО") Тогда
					Если ДокументОбъект.ДополнительныеСвойства.бит_ПриемникиМХО.Найти(ИмяПриемника) <> Неопределено Тогда						
				         ДобавитьСообщениеВПротокол(Протокол, "");												
						 ТекстСообщения =  НСтр("ru='Движения по регистру ""%1"" сформированы МХО. Трансляция в регистр ""%1"" выполняться не будет.';
						 						|en='Movements in the register ""%1"" formed by transaction mechanism. Translation to the register ""%1"" will not be performed.'");
						 ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПриемника);
				         ДобавитьСообщениеВПротокол(Протокол, ТекстСообщения);
						 Продолжить;					
					КонецЕсли; 
				КонецЕсли;
				
				// Проверка исключенных трансляций.
				Если ДокументОбъект.ДополнительныеСвойства.Свойство("ДанныеИсключеныхТрансляции") Тогда
					Если ДокументОбъект.ДополнительныеСвойства.ДанныеИсключеныхТрансляции.Свойство(ИмяПриемника) Тогда
						ДобавитьСообщениеВПротокол(Протокол, "");												
						ТекстСообщения =  НСтр("ru='Трансляция в регистр ""%1"" отключена.';
										|en='Transaction in the register ""%1"" turned off.'");
						ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПриемника);
						ДобавитьСообщениеВПротокол(Протокол, ТекстСообщения);
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				Если ДокументОбъект.Движения[ИмяИсточника].Модифицированность() 
						ИЛИ ДокументОбъект.Движения[ИмяИсточника].Записывать Тогда
					НаборИсточник = ДокументОбъект.Движения[ИмяИсточника];					
				Иначе
					МДИсточника = Метаданные.НайтиПоПолномуИмени(ВыборкаИсточник.ИсточникИмяОбъектаПолное);
					Если ОбщегоНазначения.ЭтоРегистрБухгалтерии(МДИсточника) Тогда
						НаборИсточник = РегистрыБухгалтерии[ИмяИсточника].СоздатьНаборЗаписей();
					ИначеЕсли ОбщегоНазначения.ЭтоРегистрНакопления(МДИсточника) Тогда 
						НаборИсточник = РегистрыНакопления[ИмяИсточника].СоздатьНаборЗаписей();
					ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(МДИсточника) Тогда 
						НаборИсточник = РегистрыСведений[ИмяИсточника].СоздатьНаборЗаписей();
					КонецЕсли; 
					НаборИсточник.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
					НаборИсточник.Прочитать();
				КонецЕсли; 
				
				НаборПриемник = ДокументОбъект.Движения[ИмяПриемника];
				
				Если РегистрУчаствуетВДвижениях(ДокументОбъект.Движения,"бит_СоответствиеЗаписейТрансляции") Тогда
					// Набор записей для хранения соответствия номеров записей источника и приемника.
					НаборСоответствие = ДокументОбъект.Движения.бит_СоответствиеЗаписейТрансляции;
					Если Не НаборСоответствиеПрочитан
						И (ЗаписыватьДвижения ИЛИ НаборСоответствие.Количество() = 0) Тогда
						НаборСоответствие.Прочитать();
						НаборСоответствиеПрочитан = Истина;
					КонецЕсли; 
				Иначе
					НаборСоответствие = Неопределено;
				КонецЕсли; 
				
				Если РегистрУчаствуетВДвижениях(ДокументОбъект.Движения,"бит_СоответствиеОборотовТрансляции") Тогда
					// Набор записей для хранения соответствия номеров записей источника и приемника.
					НаборСоответствиеОборотов = ДокументОбъект.Движения.бит_СоответствиеОборотовТрансляции;
					Если НаборСоответствиеОборотовПрочитан
						И (ЗаписыватьДвижения ИЛИ НаборСоответствиеОборотов.Количество() = 0) Тогда
						НаборСоответствиеОборотов.Прочитать();
						НаборСоответствиеОборотовПрочитан = Истина;
					КонецЕсли; 
				Иначе
					НаборСоответствиеОборотов = Неопределено;
				КонецЕсли; 
				
				// Определим вид регистров источника и приемника.
				ВидыРегистров = КонструкторСтруктурыВидыРегистров(Ложь, Ложь, Ложь, Ложь);				
				ВидыРегистров.ИсточникРегистрБухгалтерии = бит_ОбщегоНазначения.ОбъектПринадлежитКоллекцииМетаданных("РегистрыБухгалтерии",ИмяИсточника);													
				ВидыРегистров.ИсточникРегистрНакопления  = бит_ОбщегоНазначения.ОбъектПринадлежитКоллекцииМетаданных("РегистрыНакопления" ,ИмяИсточника);													
				ВидыРегистров.ПриемникРегистрБухгалтерии = бит_ОбщегоНазначения.ОбъектПринадлежитКоллекцииМетаданных("РегистрыБухгалтерии",ИмяПриемника);													
				ВидыРегистров.ПриемникРегистрНакопления  = бит_ОбщегоНазначения.ОбъектПринадлежитКоллекцииМетаданных("РегистрыНакопления" ,ИмяПриемника);													
				
				// Подготовим структуру параметров для передачи в процедуру трансляции.
				СтруктураПараметров = КонструкторСтруктурыПараметровТрансляции();				
				СтруктураПараметров.ОбязательныеПоля  = СтруктураПравила.ОбязательныеПоля;
				СтруктураПараметров.ПравилоЗаполнения = ВыборкаПравилоЗаполнения.ПравилоЗаполнения;
				СтруктураПараметров.ПравилаТрансляции = МассивПравил;
				СтруктураПараметров.КодУсловияТрансляции    = КодУсловияТрансляции;
				СтруктураПараметров.СтруктураШапкиДокумента = СтруктураШапкиДокумента;
				СтруктураПараметров.ПользовательскиеФункции = СтруктураПравила.ПользовательскиеФункции;
				СтруктураПараметров.ДополнительныеАналитики = ДополнительныеАналитики;
				СтруктураПараметров.ПризнакиУчета           = ЗаполнитьПризнакиУчета(ВыборкаПриемник.Приемник);
				СтруктураПараметров.ВидыРегистров           = ВидыРегистров;
				СтруктураПараметров.ЗаписыватьДвижения      = ЗаписыватьДвижения;
				СтруктураПараметров.ОбъектСистемыИсточник   = ВыборкаПриемник.Источник;
				СтруктураПараметров.ОбъектСистемыПриемник   = ВыборкаПриемник.Приемник;
				СтруктураПараметров.НаборСоответствие         = НаборСоответствие;
				СтруктураПараметров.НаборСоответствиеОборотов = НаборСоответствиеОборотов;
				СтруктураПараметров.ВестиПротокол             = ВестиПротокол;
				СтруктураПараметров.РежимИспользованияСоответствий = ВыборкаПравилоЗаполнения.РежимИспользованияСоответствий;
				
				Если ВидыРегистров.ИсточникРегистрБухгалтерии Тогда
					СтруктураПараметров.МетаданныеИсточника = Метаданные.РегистрыБухгалтерии[ИмяИсточника];
				ИначеЕсли ВидыРегистров.ИсточникРегистрНакопления Тогда	
					СтруктураПараметров.МетаданныеИсточника = Метаданные.РегистрыНакопления[ИмяИсточника];
				КонецЕсли; 
				
				Если ВидыРегистров.ПриемникРегистрБухгалтерии Тогда
					СтруктураПараметров.МетаданныеПриемника = Метаданные.РегистрыБухгалтерии[ИмяПриемника];
				ИначеЕсли ВидыРегистров.ПриемникРегистрНакопления Тогда	
					СтруктураПараметров.МетаданныеПриемника = Метаданные.РегистрыНакопления[ИмяПриемника];
				КонецЕсли; 
				
				ВидыРегистров.МетаданныеИсточника 			 = СтруктураПараметров.МетаданныеИсточника;
				ВидыРегистров.МетаданныеПриемника     		 = СтруктураПараметров.МетаданныеПриемника;
				ВидыРегистров.РежимИспользованияСоответствий = СтруктураПараметров.РежимИспользованияСоответствий;
				
				СтруктураПараметров.МетаданныеРегистратора = МетаданныеИсточник;
				
				ПараметрыАвтозаполнения = ПодготовитьПараметрыАвтозаполнения(СтруктураПараметров);
				СтруктураПараметров.ПараметрыАвтозаполнения = ПараметрыАвтозаполнения;
				
				ДобавитьСообщениеВПротокол(Протокол,"");				
				ДобавитьСообщениеВПротокол(Протокол,ИмяИсточника + " --> " + ИмяПриемника);
				
				// Выполним трансляцию для конкретной пары Источник --> Приемник.
				ЕстьОшибки = ВыполнитьТрансляциюДвижений(ДокументОбъект,НаборИсточник,НаборПриемник,СтруктураПараметров,Протокол,ОбработанныеПриемники);
				
				ТрансляцияПриПроведенииЕстьРучноеРедактированиеФакта(ДокументОбъект, НаборПриемник, СтруктураПараметров, Протокол, ЕстьОшибки);

				Если НЕ ЕстьОшибки Тогда
					ОбработанныеПары.Вставить(ИмяИсточника + "_" + ИмяПриемника, Истина);
				КонецЕсли; 
			КонецЦикла; // По приемникам
		КонецЦикла; // По источникам
	КонецЦикла; // Правило заполнения
	
	ТекстСообщения = НСтр("ru='Трансляция завершена.';en='Broadcast completed.'");
	ДобавитьСообщениеВПротокол(Протокол, ТекстСообщения, ВестиПротокол);
	
	УстановитьПривилегированныйРежим(Ложь);	
	РезДанные = Новый Структура("ЕстьОшибки, Протокол", ЕстьОшибки, Протокол);
	Возврат РезДанные;
	
КонецФункции // ВыполнитьТрансляцию()

// Функция выполняет отмену трансляции движений - набора записей регистра приемника.
// 
// Параметры:
//  ДокументСсылка    - ДокументСсылка.
//  РегистрыПриемники - Массив.
// 
// Возвращаемое значение:
//  Строка - текст протокола.
// 
Функция ОтменитьТрансляцию(ДокументСсылка, РегистрыПриемники) Экспорт
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	Протокол = НСтр("ru='Выполняется отмена трансляции движений (%1) по документу %2.';
					|en='Cancels broadcast movements (%1) on the document %2.'");
	Протокол = СтрШаблон(Протокол, ТекущаяДатаСеанса(), ДокументСсылка);
	
	Если НЕ ЗначениеЗаполнено(РегистрыПриемники) Тогда
		Возврат Протокол;	
	КонецЕсли;
	
	Для Каждого ТекРегистр Из РегистрыПриемники Цикл
		
		Если ТекРегистр.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии Тогда
			
			МенеджерРегистра   = бит_ОбщегоНазначения.ПолучитьМенеджер("РегистрыБухгалтерии");
			ПредставлеРегистра = НСтр("ru='движения регистра бухгалтерии';en='motion sensitive accounting'");
			
		ИначеЕсли ТекРегистр.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрНакопления Тогда
			
			МенеджерРегистра = бит_ОбщегоНазначения.ПолучитьМенеджер("РегистрыНакопления");
			ПредставлеРегистра = НСтр("ru='движения регистра накопления';en='motion accumulation register'");
			
		Иначе
			
			МенеджерРегистра = Неопределено;
			
		КонецЕсли;
		
		Если МенеджерРегистра = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НаборДляОчистки = МенеджерРегистра[ТекРегистр.ИмяОбъекта].СоздатьНаборЗаписей();
		НаборДляОчистки.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборДляОчистки.Прочитать();
		
		Если НаборДляОчистки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НаборДляОчистки.Очистить();
				
		// Запишем очищенный набор записей.
		флВыполненаЗапись = бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборДляОчистки);
		Если флВыполненаЗапись Тогда
			
			// Успешная запись
			Протокол = Протокол + Символы.ПС + НСтр("ru='Отменены ';en='Canceled'");
			
			// бит_СоответствиеЗаписейТрансляции
			Если МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыСведений.бит_СоответствиеЗаписейТрансляции) Тогда
				
				// Очистка соответсвия номеров движений
				НаборСоответствие = РегистрыСведений.бит_СоответствиеЗаписейТрансляции.СоздатьНаборЗаписей();
				НаборСоответствие.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборСоответствие.Прочитать();
				
				ОчиститьСоответствиеДвижений(НаборСоответствие,ТекРегистр);
				
				бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборСоответствие);			
				
			КонецЕсли;
			
			// бит_СоответствиеОборотовТрансляции
			Если МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыНакопления.бит_СоответствиеОборотовТрансляции) Тогда
				
				// Очистка соответсвия номеров движений
				НаборСоответствие = РегистрыНакопления.бит_СоответствиеОборотовТрансляции.СоздатьНаборЗаписей();
				НаборСоответствие.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборСоответствие.Прочитать();
				
				ОчиститьСоответствиеДвижений(НаборСоответствие,ТекРегистр);
				
				бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборСоответствие);			
				
			КонецЕсли;
			
			// бит_ОборотыПоТипамПроводок
			Если МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыНакопления.бит_ОборотыПоТипамПроводок) Тогда
				
				// Очистка соответсвия номеров движений
				НаборСоответствие = РегистрыНакопления.бит_ОборотыПоТипамПроводок.СоздатьНаборЗаписей();
				НаборСоответствие.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборСоответствие.Прочитать();
				
				ОчиститьСоответствиеДвиженийПоТипуПроводки(НаборСоответствие, ТекРегистр);
				
				бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборСоответствие);			
				
			КонецЕсли;
			
		Иначе
			
			// Не успешная запись
			Протокол = Протокол + Символы.ПС + НСтр("ru='Не отменены ';en='Not canceled'");
								
		КонецЕсли;
		
		Протокол = Протокол + ПредставлеРегистра + ": " + ТекРегистр.Наименование + ".";
		
	КонецЦикла;
	
	Возврат Протокол;
	
КонецФункции // ОтменитьТрансляцию()

// Процедура выполняет подбор счетов для различных приемника и источника.
// 
// Параметры:
//  СтруктураПараметров  - Структура - Ключи: {Счет,Субконто<i>} или {СчетДт,СчетКт,СубконтоДт<i>,СубконтоКт<i>}.
//  Организация          - СправочникСсылка.Организации.
//  ДатаПравил           - Дата.
//  ИмяРегистраИсточник  - Строка.
//  ИмяРегистраПриемник  - Строка.
// 
// Возвращаемое значение:
// РезСтруктура - Структура - Ключи: {Счет,Субконто<i>} или {СчетДт,СчетКт,СубконтоДт<i>,СубконтоКт<i>}.
// 
Функция ВыполнитьПодборСчетов(СтруктураПараметров
	                           ,Организация
							   ,ДатаПравил
	                           ,ИмяРегистраИсточник = "Хозрасчетный"
							   ,ИмяРегистраПриемник = "бит_Дополнительный_2") Экспорт

	Если СтруктураПараметров.Счет = Неопределено Тогда
		ЭтоПодборБезКорреспонденции = Ложь;
	Иначе 	
		ЭтоПодборБезКорреспонденции = Истина;
	КонецЕсли; 
	
	// Создаем наборы источник и приемник
	НаборИсточник = РегистрыБухгалтерии[ИмяРегистраИсточник].СоздатьНаборЗаписей();
	НаборПриемник = РегистрыБухгалтерии[ИмяРегистраПриемник].СоздатьНаборЗаписей();
	
	// Определяем максимальное количество субконто источника и приемника.
	ИмяПланаСчетовИсточник     = Метаданные.РегистрыБухгалтерии[ИмяРегистраИсточник].ПланСчетов.Имя;
	КоличествоСубконтоИсточник = Метаданные.ПланыСчетов[ИмяПланаСчетовИсточник].МаксКоличествоСубконто;
	
	ИмяПланаСчетовПриемник     = Метаданные.РегистрыБухгалтерии[ИмяРегистраПриемник].ПланСчетов.Имя;
	КоличествоСубконтоПриемник = Метаданные.ПланыСчетов[ИмяПланаСчетовПриемник].МаксКоличествоСубконто;
	
	// Инициализируем результирующую структуру
	Если ЭтоПодборБезКорреспонденции Тогда
		
		РезСтруктура = Новый Структура;
		РезСтруктура.Вставить("Счет");
		Для й = 1 По КоличествоСубконтоПриемник Цикл
		
			РезСтруктура.Вставить("Субконто"+й);
		
		КонецЦикла; 
		
	Иначе	
		
		РезСтруктура = Новый Структура;
		РезСтруктура.Вставить("СчетДт");
		РезСтруктура.Вставить("СчетКт");		
		Для й = 1 По КоличествоСубконтоПриемник Цикл
		
			РезСтруктура.Вставить("СубконтоДт"+й);
			РезСтруктура.Вставить("СубконтоКт"+й);
		
		КонецЦикла; 
		
	КонецЕсли; 
	
	// Заполним набор записей источник по переданной стуктуре.
	ЗаписьИсточник = НаборИсточник.Добавить();
	
	// Заполним счета
	Если ЭтоПодборБезКорреспонденции Тогда
		ЗаписьИсточник.СчетДт = СтруктураПараметров.Счет;
		ЗаписьИсточник.СчетКт = СтруктураПараметров.Счет;
		Если Не СтруктураПараметров.Подразделение = Неопределено Тогда
			ЗаписьИсточник.ПодразделениеДт = СтруктураПараметров.Подразделение; 
			ЗаписьИсточник.ПодразделениеКт = СтруктураПараметров.Подразделение; 
		КонецЕсли;
	Иначе	
		ЗаписьИсточник.СчетДт = СтруктураПараметров.СчетДт;
		ЗаписьИсточник.СчетКт = СтруктураПараметров.СчетКт;
	КонецЕсли; 
	
	// Заполним аналитику
	Для й = 1 По КоличествоСубконтоИсточник Цикл
		
		Если ЭтоПодборБезКорреспонденции Тогда
		   ИмяСубконтоДт = "Субконто"+й;
		   ИмяСубконтоКт = "Субконто"+й;
		Иначе	
		   ИмяСубконтоДт = "СубконтоДт"+й;
		   ИмяСубконтоКт = "СубконтоКт"+й;
		КонецЕсли; 
		
		Если Не СтруктураПараметров[ИмяСубконтоДт] = Неопределено Тогда
			бит_му_ОбщегоНазначения.УстановитьСубконто(ЗаписьИсточник.СчетДт,ЗаписьИсточник.СубконтоДт,й,СтруктураПараметров[ИмяСубконтоДт]);
	    КонецЕсли; 
	    Если Не СтруктураПараметров[ИмяСубконтоКт] = Неопределено Тогда
			бит_му_ОбщегоНазначения.УстановитьСубконто(ЗаписьИсточник.СчетКт,ЗаписьИсточник.СубконтоКт,й,СтруктураПараметров[ИмяСубконтоКт]);
		КонецЕсли; 
		
	КонецЦикла; 
	
	Протокол = "";
	
	МетаИсточник = Метаданные.РегистрыБухгалтерии[ИмяРегистраИсточник];
	МетаПриемник = Метаданные.РегистрыБухгалтерии[ИмяРегистраПриемник];
	ПараметрыТрансляции = ПодготовитьСтруктуруПараметровДляПодбораСчетов(Организация,ДатаПравил,МетаИсточник,МетаПриемник, СтруктураПараметров.ТекущийОбъект);
	
	// Выполним подбор счетов по правилам трансляции.
	ТекущийОбъект = СтруктураПараметров.ТекущийОбъект;		
	ПараметрыТрансляции.Вставить("ОбработкаБезДокумента", СтруктураПараметров.ОбработкаБезДокумента);
	
	ВыполнитьТрансляциюДвижений(ТекущийОбъект, НаборИсточник, НаборПриемник, ПараметрыТрансляции, Протокол);
	
	// Изменение кода. Начало. 07.06.2016{{
	РезСтруктура.Вставить("ЦФО");
	// Изменение кода. Конец. 07.06.2016}}
	// Заполним результирующую структуру исходя из сформированного набора приемника.
	Если НаборПриемник.Количество()>0 Тогда
	
		 ЗаписьПриемник = НаборПриемник[0];
		 
		 Если ЭтоПодборБезКорреспонденции Тогда
			 
			 РезСтруктура.Счет = ЗаписьПриемник.СчетДт;
			 Для й=1 По КоличествоСубконтоПриемник Цикл
			 
			 	РезСтруктура["Субконто"+й] = ЗначениеСубконто(ЗаписьПриемник,"Дт",й);
			 
			 КонецЦикла; 
			 
		 Иначе	
			 
			 РезСтруктура.СчетДт = ЗаписьПриемник.СчетДт;
			 РезСтруктура.СчетКт = ЗаписьПриемник.СчетКт;
			 
			 Для й=1 По КоличествоСубконтоПриемник Цикл
			 
			 	РезСтруктура["СубконтоДт"+й] = ЗначениеСубконто(ЗаписьПриемник,"Дт",й);
			 	РезСтруктура["СубконтоКт"+й] = ЗначениеСубконто(ЗаписьПриемник,"Кт",й);				
			 
			 КонецЦикла; 
			 
		 КонецЕсли; 
		 
		// Изменение кода. Начало. 07.06.2016{{
		Если ТипЗнч(ЗаписьПриемник) = Тип("РегистрБухгалтерииЗапись.бит_Бюджетирование") Тогда
		
			РезСтруктура.ЦФО = ЗаписьПриемник.ЦФО;
		
		КонецЕсли; 
		// Изменение кода. Конец. 07.06.2016}}
		 
	КонецЕсли; // Набор приемник содержит записи
	
	Возврат РезСтруктура;

КонецФункции // ВыполнитьПодборСчетов()

// Функция готовит структуру параметров трансляции для выполнения подбора счетов по правилам трансляции.
// 
// Параметры:
//  Организация  - СправочникСсылка.Организация.
//  ДатаПравил   - Дата.
//  МетаРегистрИсточник - .
//  МетаРегистрПриемник - .
//  ТекОбъект - ДокументОбъект (По умолчанию = Неопределено).
// 
// Возвращаемое значение:
//   СтруктураПараметров   - Структура.
// 
Функция ПодготовитьСтруктуруПараметровДляПодбораСчетов(Организация,ДатаПравил,МетаРегистрИсточник,МетаРегистрПриемник, ТекОбъект = Неопределено)  Экспорт

	РегистрИсточник = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаРегистрИсточник);	
	РегистрПриемник = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаРегистрПриемник);
	
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить(Перечисления.бит_НазначенияПравилТрансляции.ПодборСчетов);
	МассивНазначений.Добавить(Перечисления.бит_НазначенияПравилТрансляции.ТрансляцияИПодборСчетов);
	
	
	МассивПравил = ПолучитьПравилаТрансляцииДляПодбораСчетов(Организация, ДатаПравил, 
					МассивНазначений, РегистрИсточник, РегистрПриемник);	
																					   
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Источник", РегистрИсточник);
	Запрос.УстановитьПараметр("Приемник", РегистрПриемник);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТабНазначения.ПравилоЗаполнения
	               |ИЗ
	               |	РегистрСведений.бит_НазначениеПравилЗаполненияПриТрансляции КАК ТабНазначения
	               |ГДЕ
	               |	ТабНазначения.Источник = &Источник
	               |	И ТабНазначения.Приемник = &Приемник
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТабНазначения.Приоритет";
				   
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПравилоЗаполнения = Выборка.ПравилоЗаполнения;
		
	Иначе	
		
		ПравилоЗаполнения = Справочники.бит_ПравилаЗаполненияПолейПриТрансляции.ПустаяСсылка();
		
	КонецЕсли; 
																					   
	СтруктураПараметров = КонструкторСтруктурыПараметровТрансляции();														
														
	СтруктураПараметров.ОбязательныеПоля  = Новый Структура;
	СтруктураПараметров.ПравилоЗаполнения = ПравилоЗаполнения;
	СтруктураПараметров.ПравилаТрансляции = МассивПравил;
	
	СтруктураШапкиДокумента = Новый Структура("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	СтруктураПараметров.СтруктураШапкиДокумента = СтруктураШапкиДокумента;	
	
	Если ТекОбъект <> Неопределено И РегистрПриемник.ИмяОбъекта = "бит_Дополнительный_2" Тогда
		СтруктураШапкиМСФО = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ТекОбъект);
		СтруктураШапкиМСФО.Организация = Организация;
		СтруктураШапкиМСФО.Вставить("бит_ВалютаУправленческогоУчета", Константы.бит_ВалютаУправленческогоУчета.Получить());
		СтруктураШапкиМСФО.Вставить("бит_ВалютаМУ"					, бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация));
		СтруктураПараметров.Вставить("СтруктураШапкиМСФО"			, СтруктураШапкиМСФО);	
		
	ИначеЕсли ТекОбъект <> Неопределено Тогда
		СтруктураПараметров.МетаданныеРегистратора = ТекОбъект.Метаданные();
	КонецЕсли;
	
	СтруктураПараметров.ПользовательскиеФункции = Новый Соответствие;
	СтруктураПараметров.ДополнительныеАналитики = Новый Соответствие;
	СтруктураПараметров.ПризнакиУчета           = ЗаполнитьПризнакиУчета(РегистрПриемник);
	СтруктураПараметров.ВидыРегистров           = КонструкторСтруктурыВидыРегистров(Истина,Ложь,Истина,Ложь);
	СтруктураПараметров.МетаданныеИсточника     = Метаданные.РегистрыБухгалтерии[МетаРегистрИсточник.Имя];
	СтруктураПараметров.МетаданныеПриемника     = Метаданные.РегистрыБухгалтерии[МетаРегистрПриемник.Имя];
	СтруктураПараметров.ЗаписыватьДвижения      = Ложь;
	СтруктураПараметров.ВестиПротокол           = Истина;
	
	Возврат СтруктураПараметров;

КонецФункции // ПодготовитьСтруктуруПараметровДляПодбораСчетов()

// Функция получает массив правил трансляции для подбора счетов.
// 
// Параметры:
//  Организация  - СправочникСсылка.Организации.
//  ДатаЗапроса  - Дата.
//  НазначениеИспользования - Массив.
//  РегистрИсточник 		- СправочникСсылка.бит_ОбъектыСистемы.
//  РегистрПриемник  		- СправочникСсылка.бит_ОбъектыСистемы.
// 
// Возвращаемое значение:
//   МассивПравил - Массив.
// 
Функция ПолучитьПравилаТрансляцииДляПодбораСчетов(Организация, ДатаЗапроса, НазначениеИспользования, РегистрИсточник, РегистрПриемник)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	 		 Организация);
	Запрос.УстановитьПараметр("ДатаЗапроса",	 		 ДатаЗапроса);
	Запрос.УстановитьПараметр("ПустаяДата",		 		 Дата('00010101'));
	Запрос.УстановитьПараметр("НазначениеИспользования", НазначениеИспользования);
	Запрос.УстановитьПараметр("Источник",		  		 РегистрИсточник);
	Запрос.УстановитьПараметр("Приемник",		  		 РегистрПриемник);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаТрансляции.Ссылка КАК ПравилоТрансляции,
	|	ПравилаТрансляции.Источник КАК Источник,
	|	ПравилаТрансляции.Приемник КАК Приемник
	|ПОМЕСТИТЬ ПравилаТрансляции
	|ИЗ
	|	Справочник.бит_ПравилаТрансляции КАК ПравилаТрансляции
	|ГДЕ
	|	ПравилаТрансляции.Источник = &Источник
	|	И ПравилаТрансляции.Приемник = &Приемник
	|	И НЕ ПравилаТрансляции.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК Приоритет,
	|	ПравилаТрансляции.ПравилоТрансляции КАК ПравилаТрансляции,
	|	НазначенияПравилТрансляции.Приоритет КАК ПриоритетПравилаТрансляции
	|ПОМЕСТИТЬ ТаблицаПравилТрансляции
	|ИЗ
	|	ПравилаТрансляции КАК ПравилаТрансляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(
	|				&ДатаЗапроса,
	|				(СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка))
	|					И (ДатаОкончания > &ДатаЗапроса
	|						ИЛИ ДатаОкончания = &ПустаяДата)
	|					И Назначение В (&НазначениеИспользования)
	|					И ПравилоТрансляции В
	|						(ВЫБРАТЬ
	|							ПравилаТрансляции.ПравилоТрансляции КАК ПравилоТрансляции
	|						ИЗ
	|							ПравилаТрансляции КАК ПравилаТрансляции)) КАК НазначенияПравилТрансляции
	|		ПО ПравилаТрансляции.ПравилоТрансляции = НазначенияПравилТрансляции.ПравилоТрансляции
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ПравилаТрансляции.ПравилоТрансляции,
	|	НазначенияПравилТрансляции.Приоритет
	|ИЗ
	|	ПравилаТрансляции КАК ПравилаТрансляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(
	|				&ДатаЗапроса,
	|				СтруктурноеПодразделение В
	|						(ВЫБРАТЬ
	|							бит_ГруппыСтруктурныхПодразделенийСостав.Ссылка
	|						ИЗ
	|							Справочник.бит_ГруппыСтруктурныхПодразделений.Состав КАК бит_ГруппыСтруктурныхПодразделенийСостав
	|						ГДЕ
	|							бит_ГруппыСтруктурныхПодразделенийСостав.СтруктурноеПодразделение = &Организация)
	|					И (ДатаОкончания > &ДатаЗапроса
	|						ИЛИ ДатаОкончания = &ПустаяДата)
	|					И Назначение В (&НазначениеИспользования)
	|					И ПравилоТрансляции В
	|						(ВЫБРАТЬ
	|							ПравилаТрансляции.ПравилоТрансляции КАК ПравилоТрансляции
	|						ИЗ
	|							ПравилаТрансляции КАК ПравилаТрансляции)) КАК НазначенияПравилТрансляции
	|		ПО ПравилаТрансляции.ПравилоТрансляции = НазначенияПравилТрансляции.ПравилоТрансляции
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ПравилаТрансляции.ПравилоТрансляции,
	|	НазначенияПравилТрансляции.Приоритет
	|ИЗ
	|	ПравилаТрансляции КАК ПравилаТрансляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(
	|				&ДатаЗапроса,
	|				СтруктурноеПодразделение = &Организация
	|					И (ДатаОкончания > &ДатаЗапроса
	|						ИЛИ ДатаОкончания = &ПустаяДата)
	|					И Назначение В (&НазначениеИспользования)
	|					И ПравилоТрансляции В
	|						(ВЫБРАТЬ
	|							ПравилаТрансляции.ПравилоТрансляции КАК ПравилоТрансляции
	|						ИЗ
	|							ПравилаТрансляции КАК ПравилаТрансляции)) КАК НазначенияПравилТрансляции
	|		ПО ПравилаТрансляции.ПравилоТрансляции = НазначенияПравилТрансляции.ПравилоТрансляции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПравилТрансляции.ПравилаТрансляции КАК ПравилаТрансляции
	|ИЗ
	|	ТаблицаПравилТрансляции КАК ТаблицаПравилТрансляции
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаПравилТрансляции.Приоритет,
	|	ТаблицаПравилТрансляции.ПриоритетПравилаТрансляции";

	Результат = Запрос.Выполнить();
	Выборка  = Результат.Выбрать();
	
	ПравилаТрансляции = Новый Массив;
	Пока Выборка.Следующий() Цикл
	  ПравилаТрансляции.Добавить(Выборка.ПравилаТрансляции);	
	КонецЦикла; 
	
	Возврат ПравилаТрансляции;
	
КонецФункции // ПолучитьПравилаТрансляцииДляПодбораСчетов()

// Процедура дополняет структуру шапки документа необходимыми полями.
// 
// Параметры:
//  ТекущийОбъект  - ДокументОбъект.
//  СтруктураШапкиДокумента - Структура.
// 
Процедура ДополнитьСтруктуруШапкиДокумента(ТекущийОбъект,СтруктураШапкиДокумента) Экспорт
	
	Если НЕ СтруктураШапкиДокумента.Свойство("ВалютаРегламентированногоУчета") Тогда
		
		СтруктураШапкиДокумента.Вставить("ВалютаРегламентированногоУчета",Константы.ВалютаРегламентированногоУчета.Получить());
		
	КонецЕсли; 	
	СтруктураШапкиДокумента.Вставить("бит_ВалютаУправленческогоУчета",Константы.бит_ВалютаУправленческогоУчета.Получить());
	СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(СтруктураШапкиДокумента.бит_ВалютаУправленческогоУчета,СтруктураШапкиДокумента.Дата);
	СтруктураШапкиДокумента.Вставить("бит_КурсУпр",СтрКурса.Курс);
	СтруктураШапкиДокумента.Вставить("бит_КратностьУпр",СтрКурса.Кратность);
	
КонецПроцедуры // ДополнитьСтруктуруШапкиДокумента()

// Функция заполняет структуру признаков учета для регистра бухгалтерии. 
// Структура признаков учета в дальнейшем используется дла проверки заполнения свойств регистров 
// (измерений и ресурсов) с признаками учета.
// 
// Параметры:
//  ОбъектСистемы  - СправочникСсылка.бит_ОбъектыСистемы.
// 
// Возвращаемое значение:
//   ПризнакиУчета   - Структура- ключ: ИмяСвойства, значение: ИмяПризнакаУчета.
// 
Функция ЗаполнитьПризнакиУчета(ОбъектСистемы)  Экспорт
	
	ПризнакиУчета = Новый Структура;	
	
	МетаРегистр = Неопределено;
	Если ОбъектСистемы.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии Тогда
		МетаРегистр = Метаданные.РегистрыБухгалтерии[ОбъектСистемы.ИмяОбъекта];
	КонецЕсли; 	
	
	Если МетаРегистр <> Неопределено Тогда
		
		ДобавитьПризнакиУчета(МетаРегистр,"Измерения",ПризнакиУчета);
		ДобавитьПризнакиУчета(МетаРегистр,"Ресурсы",ПризнакиУчета);
		
		
	КонецЕсли; 
	
	Возврат ПризнакиУчета;
	
КонецФункции // ЗаполнитьПризнакиУчета()

// Функция получает дополнительные аналитики для объекта из регистра сведений бит_ДополнительныеАналитики.
// 
// Параметры:
//  ТекущийОбъект  - СправочникСсылка, ДокументСсылка.
//  ТипКлюча       - Строка - "Строка","ПВХ".
// 
// Возвращаемое значение:
//   Аналитики   - Соответствие - Ключ: ПланВидовХарактеристикСсылка.бит_ДополнительныеАналитики.
// 
Функция ПолучитьАналитикиОбъекта(ТекущийОбъект,ТипКлюча = "Строка") Экспорт

	Аналитики = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	бит_ДополнительныеАналитики.Аналитика,
	                |	бит_ДополнительныеАналитики.ЗначениеАналитики
	                |ИЗ
	                |	РегистрСведений.бит_ДополнительныеАналитики КАК бит_ДополнительныеАналитики
	                |ГДЕ
	                |	бит_ДополнительныеАналитики.Объект = &Объект";
					
	Запрос.УстановитьПараметр("Объект",ТекущийОбъект);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ВРег(ТипКлюча) = ВРег("Строка") Тогда
			
			ИмяАналитики = СформироватьИмяАналитики(Выборка.Аналитика,Истина);
			Аналитики.Вставить(ИмяАналитики,Выборка.ЗначениеАналитики);
			
		Иначе
			
		    Аналитики.Вставить(Выборка.Аналитика,Выборка.ЗначениеАналитики);
		  
		КонецЕсли; 
	
	КонецЦикла; 
	
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		Если ВРег(ТипКлюча) = ВРег("Строка") Тогда
			Аналитики.Вставить(ВРЕГ("РучнаяКорректировкаФактаБюджета"),
			бит_Бюджетирование.ЕстьРучнаяКорректировкаФакта(ТекущийОбъект));
		КонецЕсли;
	КонецЕсли; 

	Возврат Аналитики;
	
КонецФункции // ПолучитьАналитикиОбъекта()

// Экспортная функция для передачи исполнения функции локального контекста "ПолучитьДоступныеПравилаТрансляции".   
// 
Функция ПолучитьДоступныеПравилаТрансляцииПереопределяемый(Организация,ДокументОбъект,Дата,РегистрыИсточники,РегистрыПриемники) Экспорт 

	Возврат ПолучитьДоступныеПравилаТрансляции(Организация,ДокументОбъект,Дата,РегистрыИсточники,РегистрыПриемники);	

КонецФункции // ПолучитьДоступныеПравилаТрансляцииПереопределяемый()

// Функция проверяет есть ли заданное субконто на данном счете или нет.
// 
// Параметры
//  ВидСубконто  - ПланВидовХарактеристикСсылка.
//  Счет         - ПланСчетовСсылка.
// 
// Возвращаемое значение:
//   ЕстьСубконто   - Булево
// 
Функция ЕстьСубконтоНаСчете(Счет, ВидСубконто, ПВХ = НЕОПРЕДЕЛЕНО)  Экспорт
	
	ЕстьСубконто = Истина;
	
	Если ЗначениеЗаполнено(Счет) Тогда
		
		ВидыСубконтоСчета = Счет.ВидыСубконто;
		
		Если ТипЗнч(ВидСубконто) = Тип("Строка") 
			И ПВХ <> Неопределено Тогда
			ТекВидСубконто = ПВХ.НайтиПоКоду(ВидСубконто);
		Иначе
			ТекВидСубконто = ВидСубконто;
		КонецЕсли; 
		
		Если ВидыСубконтоСчета.Найти(ТекВидСубконто) = Неопределено Тогда
			ЕстьСубконто = Ложь;
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ЕстьСубконто;
	
КонецФункции // ЕстьСубконтоНаСчете()

// Функция определяет является ли данный реквизит дополнительным реквизитом/свойством.
// 
// Параметры:
//  ИмяРеквизита - Строка.
// 
// Возвращаемое значение:
//  флДопРеквизит - Булево.
// 
Функция ЭтоДопРеквизит(ИмяРеквизита) Экспорт

	флДопРеквизит = ?(Найти(ИмяРеквизита, "ДополнительныйРеквизит_")>0 
						 ИЛИ Найти(ИмяРеквизита, "ДополнительноеСвойство_")> 0, Истина, Ложь);
	
	

	Возврат флДопРеквизит;
	
КонецФункции // ЭтоДопРеквизит()

Функция ТипыЗначенийВФорме(ОписаниеТипов) Экспорт

		

КонецФункции

// Процедура создает колонки таблицы, используемой для настройки правил трансляции. 
// 
// Параметры:
//  ТекущаяФорма - УправляемаяФорма.
//  Элементы     - ВсеЭлементыФормы.
//  ТабКолонки   - ТаблицаЗначений.
//  ИмяТаблицы   - Строка.
//  УстанавливатьДействия - Булево.
// 
Процедура СоздатьКолонкиТаблицыТрансляции(ТекущаяФорма, Элементы, ТабКолонки, ИмяТаблицы, УстанавливатьДействия = Ложь, ВидыКолонок = Неопределено) Экспорт
	
	КоличествоКолонок = ТабКолонки.Количество();
	
	// Определим, когда необходимо создавать группы колонок.
	Для Индекс = 0 По КоличествоКолонок - 1 Цикл
	
		ТекСтрока = ТабКолонки[Индекс];
		Если Индекс + 1 <= КоличествоКолонок - 1 Тогда
		   СледСтрока = ТабКолонки[Индекс + 1];
		Иначе	
		   СледСтрока = Неопределено;
		КонецЕсли; 
		
		Если ТекСтрока.ПоложениеКолонки = Перечисления.бит_ПоложенияКолонокТаблицы.НоваяКолонка Тогда
			Если  НЕ СледСтрока = Неопределено 
				И НЕ СледСтрока.ПоложениеКолонки = Перечисления.бит_ПоложенияКолонокТаблицы.НоваяКолонка Тогда
				
				ТекСтрока.НачатьГруппу = Истина;
				Если СледСтрока.ПоложениеКолонки = Перечисления.бит_ПоложенияКолонокТаблицы.ВТойЖеКолонке Тогда
					ТекСтрока.ГруппировкаКолонок = ГруппировкаКолонок.Горизонтальная;
				Иначе	
					ТекСтрока.ГруппировкаКолонок = ГруппировкаКолонок.Вертикальная;
				КонецЕсли; 
			Иначе	
				ТекСтрока.ЗакончитьГруппу = Истина;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; // КоличествоКолонок
	
	// Удаляем динамические реквизиты
	ОчиститьДинамическиеКолонкиТаблицыТрансляции(ТекущаяФорма, Элементы, ИмяТаблицы);
	// Добавляем динамические реквизиты
	ДобавитьДинамическиеКолонкиТаблицыТрансляции(ТекущаяФорма, Элементы, ТабКолонки, ИмяТаблицы, УстанавливатьДействия, ВидыКолонок);
	// Условное оформление
	УстановитьУсловноеОформлениеКолонокТаблицыТрансляции(ТекущаяФорма.УсловноеОформление, ТабКолонки, ИмяТаблицы);
	
КонецПроцедуры // ОбновитьОтображение()

// Набор параметров для функионала подбора счетов.
//
// Параметры:
//
// Возвращаемое значение:
//   Конструктор  - структура.
//
Функция КонструкторПараметровПодбораСчетов() Экспорт

	Конструктор = Новый Структура;
	Конструктор.Вставить("ТекущийОбъект", Неопределено);
	Конструктор.Вставить("ОбработкаБезДокумента", Ложь);
	Конструктор.Вставить("Счет",          Неопределено);
	Конструктор.Вставить("Подразделение", Неопределено);
	Конструктор.Вставить("Субконто1",     Неопределено);
	Конструктор.Вставить("Субконто2",     Неопределено);
	Конструктор.Вставить("Субконто3",     Неопределено);
	Конструктор.Вставить("Субконто4",     Неопределено);

	Возврат Конструктор;
КонецФункции

Процедура СохранитьЗначенияИсключенийТрансляции(Источник, Активность = Истина, ПриЗаписиДокумента = Истина) Экспорт
	 
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 

КонецПроцедуры

Процедура ВосстановитьЗначенияИсключенийТрансляции(Источник, ЗаписыватьДвижения) Экспорт
	
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверочныеПроцедурыИФункции
                 
// Процедура осуществляет проверку корректности заполнения свойств с признаками учета в записи Приемника.
// Если признак учета не установлен, значение свойства зачищается.
// 
// Параметры:
//  ЗаписьПриемник - РегистрБухгалтерииЗапись,РегистрНакопленияЗапись.
//  ПризнакиУчета  - Структура.
// 
Процедура ПроверитьПризнакиУчета(ЗаписьПриемник,ПризнакиУчета)
	
	Для каждого КлючИЗначение Из ПризнакиУчета Цикл
		
		ИмяСвойства  = КлючИЗначение.Ключ;
		ИмяПризнака  = КлючИЗначение.Значение;
		
		Если ЗначениеЗаполнено(ЗаписьПриемник[ИмяСвойства]) 
			И НЕ ЗаписьПриемник["Счет"+Прав(ИмяСвойства,2)][ИмяПризнака] Тогда
			
			ЗаписьПриемник[ИмяСвойства] = НЕОПРЕДЕЛЕНО;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // ПроверитьВалютныйКоличественныйУчет()

// Процедура проверяет заполнение обязательных полей в записи Приемника. 
// В случае если обязательное поле не заполнено, устанавливается Отказ = Истина, 
// при дальнейшей обработке запись удаляется из Приемника.
// 
// Параметры:
//  ЗаписьПриемник - РегистрБухгалтерииЗапись,РегистрНакопленияЗапись.
//  СтруктураОбязательныхПолей - Структура.
//  НомерСтрокиИсточника       - Число.
//  Отказ                      - Булево.
//  Протокол                   - Строка.
// 
Процедура ПроверитьОбязательныеПоля(ЗаписьПриемник,СтруктураОбязательныхПолей,НомерСтрокиИсточника,Отказ,Протокол)
	
	Если СтруктураОбязательныхПолей.Количество()>0 Тогда
		// BF-2908. Для регистра бухгалтерии проверка на заполнение для "СчетДт" и "СчетКТ"
		// является обязательным, исключение только для забалансовых счетов.
		Регистр = Лев(ЗаписьПриемник, СтрНайти(ЗаписьПриемник, "Запись") - 1);
		Регистр = ВРег(Регистр);
		ЭтоРегистрБухгалтерии = (Регистр = "РЕГИСТРБУХГАЛТЕРИИ" Или Регистр = "ACCOUNTINGREGISTER");
		Если ЭтоРегистрБухгалтерии Тогда
			
			СвСчДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ЗаписьПриемник.СчетДт);
			СвСчКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ЗаписьПриемник.СчетКт);
			
			ЗабалансСчетДт = СвСчДт.Забалансовый;
			ЗабалансСчетКт = СвСчКт.Забалансовый;
			Если ЗабалансСчетДт ИЛИ ЗабалансСчетКт Тогда
				СтруктураОбязательныхПолей.Удалить("СчетДт");
				СтруктураОбязательныхПолей.Удалить("СчетКт");
			Иначе
				Если Не СтруктураОбязательныхПолей.Свойство("СчетДт") Тогда
					СтруктураОбязательныхПолей.Вставить("СчетДт", "Счет Дт");
				КонецЕсли; 
				Если Не СтруктураОбязательныхПолей.Свойство("СчетКт") Тогда
					СтруктураОбязательныхПолей.Вставить("СчетКт", "Счет Кт");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
		
		Для каждого КлючИЗначение Из СтруктураОбязательныхПолей Цикл
			
			ЗначениеПриемника = ЗаписьПриемник[КлючИЗначение.Ключ];
			Если НЕ ЗначениеЗаполнено(ЗначениеПриемника) Тогда
				
				ПолеОбъекта    = ?(ПустаяСтрока(КлючИЗначение.Значение),КлючИЗначение.Ключ,КлючИЗначение.Значение);
				ТекстСообщения = НСтр("ru='По строке №%1 Источника не удалось заполнить обязательное поле ""%2"".';
									  |en='On line №%1 Source failed to complete required field ""%2"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, НомерСтрокиИсточника, ПолеОбъекта); 
				Отказ 		   = Истина;				
				ДобавитьСообщениеВПротокол(Протокол, ТекстСообщения);				 
				
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры // ПроверитьОбязательныеПоля()

// Функция определяет принадлежит ли регистр коллекции движений документа.
// 
// Параметры:
//  Движения  - КоллекцияДвиженийДокумента.
//  ИмяРегистра - Строка.
// 
// Возвращаемое значение:
//   УчаствуетВДвижениях   - Булево.
// 
Функция РегистрУчаствуетВДвижениях(Движения,ИмяРегистра)
	
	Если Движения.Найти(ИмяРегистра) = Неопределено Тогда
		УчаствуетВДвижениях = Ложь;
	Иначе	
		УчаствуетВДвижениях = Истина;
	КонецЕсли; 
	
	Возврат УчаствуетВДвижениях;
	
КонецФункции // РегистрУчаствуетВДвижениях()

#КонецОбласти

#Область ОтрисовкаКолонокТаблицыТрансляции
 
// Функция возвращает имя поля в таблице, используемой для настройки полей трансляции.
// 
// Параметры:
//  ИмяТаблицы - Строка.
//  ИмяКолонки - Строка.
// 
// Возвращаемое значение:
//  ИмяПоля - Строка.
// 
Функция ИмяПоляТаблицыТрансляции(ИмяТаблицы, ИмяКолонки)

	Возврат ИмяТаблицы + "_"+ИмяКолонки;
	
КонецФункции

// Функция добавляет поле формы на форму.
// 
// Параметры:
//  Элементы - Все элементы формы.
//  Имя - Строка.
//  ПутьКДанным - Строка.
//  НастройкиОтображения - Структура.
//  ЭлементКонтейнер     - ЭлементФормы.
// 
// Возвращаемое значение:
//  ЭУ - ПолеФормы.
// 
Функция ДобавитьПолеФормы(Элементы, Имя, ПутьКДанным, НастройкиОтображения, ЭлементКонтейнер = Неопределено)

	ЭУ = Элементы.Добавить(Имя, Тип("ПолеФормы"), ЭлементКонтейнер);
	ЭУ.ПутьКДанным = ПутьКДанным;	
	
	Если НастройкиОтображения.ВидПоля = Перечисления.бит_ВидыПолейПроформы.ПолеФлажка Тогда
		ЭУ.Вид = ВидПоляФормы.ПолеФлажка;
	Иначе
		ЭУ.Вид                       = ВидПоляФормы.ПолеВвода;
		ЭУ.Видимость                 = НастройкиОтображения.Видимость;
		ЭУ.ТолькоПросмотр            = НастройкиОтображения.ТолькоПросмотр;		
		ЭУ.АвтоОтметкаНезаполненного = НастройкиОтображения.ПроверкаЗаполнения;
		ЭУ.Ширина                    = НастройкиОтображения.Ширина;
		ЭУ.КнопкаВыбора              = НастройкиОтображения.КнопкаВыбора;
		ЭУ.КнопкаОткрытия            = НастройкиОтображения.КнопкаОткрытия;
		ЭУ.КнопкаРегулирования       = НастройкиОтображения.КнопкаРегулирования;
		ЭУ.КнопкаОчистки             = НастройкиОтображения.КнопкаОчистки;
		ЭУ.КнопкаВыпадающегоСписка   = НастройкиОтображения.КнопкаСпискаВыбора;
	КонецЕсли; 
	
	Возврат ЭУ;
	
КонецФункции // ДобавитьПолеФормы()

// Функция конструктор, структуры, используемой для передачи параметров элемента управления.
// 
// Возвращаемое значение:
//  НастройкиОтображения - Строка.
// 
Функция КонструкторСтруктурыОтображения()
	
	Поля = ""
	+ "ВидПоля,"
	+ "ПроверкаЗаполнения,"
	+ "Ширина,"
	+ "Видимость,"
	+ "ТолькоПросмотр,"
	+ "КнопкаВыбора,"
	+ "КнопкаРегулирования,"
	+ "КнопкаСпискаВыбора,"
	+ "КнопкаОткрытия,"
	+ "КнопкаОчистки";

	НастройкиОтображения = Новый Структура(Поля);
	
	НастройкиОтображения.Ширина = 0;
	НастройкиОтображения.Видимость = Истина;
	НастройкиОтображения.ТолькоПросмотр = Ложь;
	
	Возврат НастройкиОтображения;
	
КонецФункции // КонструкторСтруктурыОтображения()

// Процедура устанавливает условное оформление колонок таблицы трансляции.
// 
// Параметры:
//  УсловноеОформление - УсловноеОформление.
//  ТаблицаНастроек - ТаблицаЗначений.
//  ИмяТаблицы - Строка.
// 
Процедура УстановитьУсловноеОформлениеКолонокТаблицыТрансляции(УсловноеОформление, ТаблицаНастроек, ИмяТаблицы)

	// Очистка предыдущих настроек
	КоличествоЭлементов = УсловноеОформление.Элементы.Количество();
	Для Сч = 1 По КоличествоЭлементов Цикл
		Номер = КоличествоЭлементов - Сч;
		ЭлементУО = УсловноеОформление.Элементы[Номер];
		Если ЭлементУО.Представление = ИмяТаблицы Тогда
			УсловноеОформление.Элементы.Удалить(ЭлементУО);
		КонецЕсли;	
	КонецЦикла;	
	
	// Оформление для полей источника
	ЭлементУО_Источник = УсловноеОформление.Элементы.Добавить();
	ЭлементУО_Источник.Представление = ИмяТаблицы;
	ЭлементУО_Источник.Использование = Истина;
	
	УсловиеУО 				 = ЭлементУО_Источник.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеУО.Использование  = Истина;
	УсловиеУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОтображениеКолонок.ПустойРеквизит");
	УсловиеУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУО_Источник.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтыйЗолотистый);	
	
	// Оформление для полей приемника
	ЭлементУО_Приемник = УсловноеОформление.Элементы.Добавить();
	ЭлементУО_Приемник.Представление = ИмяТаблицы;
	ЭлементУО_Приемник.Использование = Истина;
	
	УсловиеУО 				 = ЭлементУО_Приемник.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеУО.Использование  = Истина;
	УсловиеУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОтображениеКолонок.ПустойРеквизит");
	УсловиеУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУО_Приемник.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоНебесноГолубой);	
	
	// Заполнение оформляемых полей для элементов оформления источника и приемника.
	Для каждого СтрокаТаблицы Из ТаблицаНастроек Цикл
		Если СтрокаТаблицы.ВидКолонки = Перечисления.бит_ВидыКолонокПравилТрансляции.РеквизитПриемника 
			 ИЛИ СтрокаТаблицы.ИмяКолонки = "ШаблонДвижений" 
			 ИЛИ Найти(СтрокаТаблицы.ИмяКолонки,"ДополнительноеПоле") > 0 Тогда
			
			ОформляемоеПоле 	 = ЭлементУО_Приемник.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляТаблицыТрансляции(ИмяТаблицы, СтрокаТаблицы.ИмяКолонки));
		Иначе	
			ОформляемоеПоле 	 = ЭлементУО_Источник.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляТаблицыТрансляции(ИмяТаблицы, СтрокаТаблицы.ИмяКолонки));
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры // УстановитьУсловноеОформлениеКолонокТаблицыТрансляции()

Процедура ДобавитьДинамическиеКолонкиТаблицыТрансляции(ТекущаяФорма, Элементы, ТабКолонки, ИмяТаблицы, УстанавливатьДействия, ВидыКолонок)

	// Создать динамические реквизиты
	ДобавляемыеРеквизиты = Новый Массив;
	Для каждого СтрокаТаблицы Из ТабКолонки Цикл
		ОписаниеРеквизита = Новый ОписаниеТипов(СтрокаТаблицы.ТипыЗначенийВФорме.Типы(),,,
								СтрокаТаблицы.ТипыЗначенийВФорме.КвалификаторыЧисла,
								СтрокаТаблицы.ТипыЗначенийВФорме.КвалификаторыСтроки,
								СтрокаТаблицы.ТипыЗначенийВФорме.КвалификаторыДаты,
								СтрокаТаблицы.ТипыЗначенийВФорме.КвалификаторыДвоичныхДанных);

		НовыйРеквизит = Новый РеквизитФормы(СтрокаТаблицы.ИмяКолонки, ОписаниеРеквизита, 
							ИмяТаблицы, СтрокаТаблицы.НаименованиеКолонки, Истина);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла; 
	
	ТекущаяФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Контейнер = Элементы[ИмяТаблицы];
	ТекНомерГруппы = 1;
	// Создать динамические элементы управления
	Для каждого СтрокаТаблицы Из ТабКолонки Цикл
		
		// Фильтр по виду колонок
		Если ТипЗнч(ВидыКолонок) = Тип("Массив") Тогда
			Если ВидыКолонок.Найти(СтрокаТаблицы.ВидКолонки) = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли;  
		
		НастройкиОтображения = КонструкторСтруктурыОтображения();
		ЗаполнитьЗначенияСвойств(НастройкиОтображения, СтрокаТаблицы);
		ОписаниеТипов = СтрокаТаблицы.ТипыЗначенийВФорме;
		Если ОписаниеТипов.Типы().Количество() = 1 И ОписаниеТипов.Типы()[0] = Тип("Булево") Тогда
			НастройкиОтображения.ВидПоля = Перечисления.бит_ВидыПолейПроформы.ПолеФлажка;
		КонецЕсли; 
		
		Если СтрокаТаблицы.НачатьГруппу Тогда
			 ИмяГруппы             = ИмяТаблицы+"_Группа"+ТекНомерГруппы;
			 ТекГруппа             = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"),Элементы[ИмяТаблицы]);
			 ТекГруппа.Заголовок   = СтрокаТаблицы.НаименованиеКолонки;
			 ТекГруппа.Вид         = ВидГруппыФормы.ГруппаКолонок;
			 ТекГруппа.Группировка = СтрокаТаблицы.ГруппировкаКолонок;
			 ТекНомерГруппы        = ТекНомерГруппы + 1;
			 ТекГруппа.ОтображатьВШапке = Истина;
			 ТекГруппа.Заголовок = УдалитьЦифры(ТекГруппа.Заголовок);
			 Контейнер = ТекГруппа;
		КонецЕсли; 
		
		Если СтрокаТаблицы.ЗакончитьГруппу Тогда
			 Контейнер = Элементы[ИмяТаблицы];
		КонецЕсли; 
		
		ИмяЭлемента  = ИмяПоляТаблицыТрансляции(ИмяТаблицы, СтрокаТаблицы.ИмяКолонки);
		ПутьКДанным  = ИмяТаблицы + "." + СтрокаТаблицы.ИмяКолонки;
		НовыйЭлемент = ДобавитьПолеФормы(Элементы, ИмяЭлемента, ПутьКДанным, НастройкиОтображения, Контейнер);
		
		Если ТипЗнч(НовыйЭлемент.Родитель) = Тип("ГруппаФормы") Тогда
			НовыйЭлемент.ОтображатьВШапке = Ложь;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовыйЭлемент, "ПодсказкаВвода") Тогда
				НовыйЭлемент.ПодсказкаВвода = СтрокаТаблицы.НаименованиеКолонки; 
			КонецЕсли;		
		КонецЕсли; 
			
		Если УстанавливатьДействия Тогда
			УстановитьДействиеЭлементуФормы(НовыйЭлемент, СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура УстановитьДействиеЭлементуФормы(НовыйЭлемент, СтрокаТаблицы)
	
	// При необходимости устанавливаем действия для некоторых колонок.
	Если СтрНайти(СтрокаТаблицы.ИмяКолонки,"Условие")>0 И СтрокаТаблицы <> "ПроизвольноеУсловие"  Тогда
		
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_УсловиеНачалоВыбора");
		
	КонецЕсли;
	Если СтрНайти(СтрокаТаблицы.ИмяКолонки,"Значение")>0 И НовыйЭлемент.Вид <> ВидПоляФормы.ПолеФлажка Тогда
		
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_ЗначениеНачалоВыбора");
		
	КонецЕсли; 
	Если СтрНайти(СтрокаТаблицы.ИмяКолонки,"Счет")>0 
		И СтрокаТаблицы.ВидКолонки = Перечисления.бит_ВидыКолонокПравилТрансляции.РеквизитИсточника Тогда
		
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_СчетИсточникПриИзменении");
		
	КонецЕсли; 
	Если СтрНайти(СтрокаТаблицы.ИмяКолонки,"Счет")>0 
		И СтрокаТаблицы.ВидКолонки = Перечисления.бит_ВидыКолонокПравилТрансляции.РеквизитПриемника Тогда
		
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_СчетПриемникПриИзменении");
		
	КонецЕсли; 
	Если СтрНайти(СтрокаТаблицы.ИмяКолонки,"Субконто")>0 
		И СтрокаТаблицы.ВидКолонки = Перечисления.бит_ВидыКолонокПравилТрансляции.РеквизитИсточника Тогда
		
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_СубконтоИсточникНачалоВыбора");
		
	КонецЕсли; 
	Если СтрНайти(СтрокаТаблицы.ИмяКолонки,"Субконто")>0 
		И СтрокаТаблицы.ВидКолонки = Перечисления.бит_ВидыКолонокПравилТрансляции.РеквизитПриемника Тогда
		
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_СубконтоПриемникНачалоВыбора");
		
	КонецЕсли; 
	Если СтрНайти(СтрокаТаблицы.ИмяКолонки,"ИмяВидаСубконто")>0 
		И СтрокаТаблицы.ВидКолонки = Перечисления.бит_ВидыКолонокПравилТрансляции.РеквизитПриемника Тогда
		
		НовыйЭлемент.УстановитьДействие("АвтоПодбор", "Подключаемый_ИмяВидаСубконтоАвтоПодбор");
		
		
	КонецЕсли; 
	Если СтрНайти(СтрокаТаблицы.ИмяКолонки, "ПроизвольныйКод") > 0 
		И СтрокаТаблицы.ВидКолонки = Перечисления.бит_ВидыКолонокПравилТрансляции.РеквизитПриемника  Тогда
		
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_ПроизвольныйКодНачалоВыбора");
		
	КонецЕсли; 
	Если СтрНайти(СтрокаТаблицы.ИмяКолонки, "ПроизвольноеУсловие") > 0 
		И СтрокаТаблицы.ВидКолонки = Перечисления.бит_ВидыКолонокПравилТрансляции.Прочее  Тогда
		
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_ПроизвольноеУсловиеНачалоВыбора");
		
	КонецЕсли; 
	Если СтрокаТаблицы.ВидКолонки = Перечисления.бит_ВидыКолонокПравилТрансляции.РеквизитПриемника 
		И НЕ СтрокаТаблицы.ЭтоСубконто = Истина 
		И СтрНайти(СтрокаТаблицы.ИмяКолонки, "ИмяВидаСубконто") = 0
		И СтрНайти(СтрокаТаблицы.ИмяКолонки, "ПроизвольныйКод") = 0
		И СтрНайти(СтрокаТаблицы.ИмяКолонки, "СторнируемаяПроводка") = 0 Тогда
		
		Если НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка Тогда
			Возврат;		
		КонецЕсли;
		
		Если СтрНайти(СтрокаТаблицы.ИмяКолонки, "Счет") = 0 
			ИЛИ СтрНайти(СтрокаТаблицы.ИмяКолонки, "БанковскийСчет") > 0 Тогда
			
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_ПолеПриемникаНачалоВыбора");
			
		КонецЕсли;  
	КонецЕсли;

КонецПроцедуры
 
Процедура ОчиститьДинамическиеКолонкиТаблицыТрансляции(ТекущаяФорма, Элементы, ИмяТаблицы)

	// Удаление "динамически созданных" реквизитов.
	МассивРеквизитов   = ТекущаяФорма.ПолучитьРеквизиты(ИмяТаблицы);
	УдаляемыеРеквизиты = Новый Массив;
	Для каждого РеквФормы Из МассивРеквизитов Цикл
		Если Найти(РеквФормы.Имя,"ПустойРеквизит") = 0 Тогда
			УдаляемыеРеквизиты.Добавить(ИмяТаблицы+"."+РеквФормы.Имя);
		КонецЕсли; 
	КонецЦикла;
	
	ТекущаяФорма.ИзменитьРеквизиты(,УдаляемыеРеквизиты);

	// Удаление "динамически созданных" элементов управления.	
	УдаляемыеЭлементы = Новый Массив;
	Для каждого ЭлФормы Из Элементы[ИмяТаблицы].ПодчиненныеЭлементы Цикл
		Если Найти(ЭлФормы.Имя,ИмяТаблицы+"_")>0 
			 И (ТипЗнч(ЭлФормы) = Тип("ПолеФормы") 
			     ИЛИ ТипЗнч(ЭлФормы) = Тип("ГруппаФормы")) Тогда	
			// Достаточно удалить страницы на которых расположены таблицы.
			УдаляемыеЭлементы.Добавить(ЭлФормы);
		КонецЕсли; 
	КонецЦикла;
	
	Для каждого ЭлФормы Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(ЭлФормы);
	КонецЦикла; 
	
КонецПроцедуры

Функция УдалитьЦифры(Знач Текст)

	БезЦифр = Текст;
	ЛишниеСимволы = СтрРазделить("0,1,2,3,4,5,6,7,8,9,№,-",",");
	Для каждого Символ Из ЛишниеСимволы Цикл
		БезЦифр = СтрЗаменить(БезЦифр, Символ, "");
	КонецЦикла; 

	Возврат БезЦифр;
	
КонецФункции
 
#КонецОбласти

#Область Подключаемые

Функция НовыеПараметрыЗаписиСоответствияДвижений() Экспорт

	Реквизиты = Новый Структура("Ссылка, Дата, Организация"); 
	СтороныТрансляции = Новый Структура("ОбъектСистемыИсточник, ОбъектСистемыПриемник"); 
	
	Результат = Новый Структура; 
	Результат.Вставить("Реквизиты", Реквизиты);
	Результат.Вставить("СтороныТрансляции", СтороныТрансляции);
	Результат.Вставить("НомерСтрокиИсточника", 0);
	Результат.Вставить("НомерСтрокиПриемника", 0);
	Результат.Вставить("Активность", 		   Истина);
	Результат.Вставить("СлужебнаяОтметкаДт",   "");
	Результат.Вставить("СлужебнаяОтметкаКт",   "");
	
	Возврат Результат;
	
КонецФункции

// Добавляет запись в набор записи и заполняет свойства по параметрам.
//
// Параметры:
//  НаборСоответствие	 - РегистрСведенийНаборЗаписей.бит_СоответствиеЗаписейТрансляции - приемник.
//  ПараметрыЗаписи		 - Структура - см. НовыеПараметрыЗаписиСоответствияДвижений(). 
//
Процедура ДобавитьЗаписьСоответствияДвижений(НаборСоответствие, ПараметрыЗаписи)

	Если НаборСоответствие = Неопределено Тогда	
		 Возврат;
	КонецЕсли; 
	
	// Запишем соответствие номеров источника и приемника.
	Запись = НаборСоответствие.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыЗаписи);
	ЗаполнитьЗначенияСвойств(Запись, ЧастиСлужебнойОтметки(ПараметрыЗаписи.СлужебнаяОтметкаДт, "Дт"));
	ЗаполнитьЗначенияСвойств(Запись, ЧастиСлужебнойОтметки(ПараметрыЗаписи.СлужебнаяОтметкаКт, "Кт"));
	
	Запись.Регистратор = ПараметрыЗаписи.Реквизиты.Ссылка;
	Запись.Период      = ПараметрыЗаписи.Реквизиты.Дата;
	Запись.Источник    = ПараметрыЗаписи.СтороныТрансляции.ОбъектСистемыИсточник;
	Запись.Приемник    = ПараметрыЗаписи.СтороныТрансляции.ОбъектСистемыПриемник;
	
	Если ПараметрыЗаписи.Реквизиты.Свойство("Организация") Тогда
		Запись.Организация = ПараметрыЗаписи.Реквизиты.Организация;
	КонецЕсли; 

КонецПроцедуры

// Метод, подключаемый из кода "правила заполнения полей" - "после формирования записи".
// См. Обработка.бит_КонструкторВыражений.Форма.ФормаКонструкторКодаДополнительногоДвижения.
// Параметры см. НовыеПараметрыЗаписиСоответствияДвижений().
//
Процедура Подключаемый_ДобавитьЗаписьСоответствияДвижений(НаборСоответствие, ПараметрыЗаписи)

	ДобавитьЗаписьСоответствияДвижений(НаборСоответствие, ПараметрыЗаписи);	

КонецПроцедуры

// Добавляет дополнительную проводку при трансляции.
//
// Параметры:
//  НаборПриемник - РегистрБухгалтерии.НаборЗаписей.
//  ЗаписьИсточник - РегистрБухгалтерии.Запись, РегистрНакопления.Запись.
//  ЗаписьПриемник - РегистрБухгалтерии.Запись.
//  ДополнительныеДанные - Соответствие.
//  СтруктураИмен - Структура
//
// Возвращаемое значение:
//  НоваяЗапись - РегистрБухгалтерии.Запись.
//
Функция ДобавитьДополнительнуюПроводку(НаборПриемник, ЗаписьИсточник, ЗаписьПриемник, ДополнительныеДанные, СтруктураИмен)

	флСоздатьЗапись = Ложь;
	НоваяЗапись = Неопределено;
	
    СчетДопДт = ДополнительныеДанные[СтруктураИмен.ИмяДополнительногоПоля_СчетДт];
    СчетДопКт = ДополнительныеДанные[СтруктураИмен.ИмяДополнительногоПоля_СчетКт];
	
	флЗаполненДт = ЗначениеЗаполнено(СчетДопДт);
	флЗаполненКт = ЗначениеЗаполнено(СчетДопКт);
    
    СвСчДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетДопДт);
    СвСчКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетДопКт);
    
	флЗабаланДт  = ?(флЗаполненДт, СвСчДт.Забалансовый, Ложь);
	флЗабаланКт  = ?(флЗаполненКт, СвСчКт.Забалансовый, Ложь);
	
	Если флЗаполненДт И флЗаполненКт Тогда
		
		// Оба счета заполнены. Балансовые корреспондируют с балансовыми, забалансовые с забалансовыми.
		Если флЗабаланДт = флЗабаланКт Тогда
			
			флСоздатьЗапись = Истина;
			
		КонецЕсли; 
		 
	Иначе
		
		// Заполнен только один счет. Можно использовать только забалансовые.
		Если (флЗаполненДт И флЗабаланДт) ИЛИ (флЗаполненКт И флЗабаланКт) Тогда
		
			флСоздатьЗапись = Истина;
		
		КонецЕсли;  
		 
	КонецЕсли; 
		
	Если флСоздатьЗапись Тогда
		
		НоваяЗапись = НаборПриемник.Добавить();
		НоваяЗапись[СтруктураИмен.ИмяПоляПриемника_СчетДт] = СчетДопДт;
		НоваяЗапись[СтруктураИмен.ИмяПоляПриемника_СчетКт] = СчетДопКт;					  
		
		// Копируем свойства из ЗаписиПриемник, записи которая была только что заполнена трансляцией.
		ПоляИсключения = СтруктураИмен.ИмяПоляПриемника_СчетДт+", "+СтруктураИмен.ИмяПоляПриемника_СчетКт;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьПриемник,, ПоляИсключения);
        
        СвСчДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(НоваяЗапись.СчетДт);
        СвСчКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(НоваяЗапись.СчетКт);
    
		Если флЗаполненДт Тогда
						
			Для каждого КиЗ Из ЗаписьПриемник.СубконтоДт Цикл
			
				УстановитьСубконто(НоваяЗапись.СчетДт, НоваяЗапись.СубконтоДт, КиЗ.Ключ, КиЗ.Значение);
			
			КонецЦикла; 
		
		КонецЕсли; 
		
		Если НЕ СвСчДт.Валютный Тогда
			
			НоваяЗапись.ВалютаДт = Неопределено;
			НоваяЗапись.ВалютнаяСуммаДт = 0;
			
		КонецЕсли; 
		
		Если НЕ СвСчДт.Количественный Тогда
			
			НоваяЗапись.КоличествоДт = 0;
			
		КонецЕсли; 
		
		Если флЗаполненКт Тогда
						
			Для каждого КиЗ Из ЗаписьПриемник.СубконтоКт Цикл
				
				УстановитьСубконто(НоваяЗапись.СчетКт, НоваяЗапись.СубконтоКт, КиЗ.Ключ, КиЗ.Значение);
			
			КонецЦикла; 
		
		КонецЕсли; 

		Если НЕ СвСчКт.Валютный Тогда
			
			НоваяЗапись.ВалютаКт = Неопределено;
			НоваяЗапись.ВалютнаяСуммаКт = 0;
			
		КонецЕсли; 
		
		Если НЕ СвСчКт.Количественный Тогда
			
			НоваяЗапись.КоличествоКт = 0;
			
		КонецЕсли; 
		
	КонецЕсли; 

	Возврат НоваяЗапись;
	
КонецФункции // ДобавитьДополнительнуюПроводку()

// Метод, подключаемый из кода "правила заполнения полей" - "после формирования записи".
// См. Справочник.бит_ПравилаЗаполненияПолейПриТрансляции.Форма.КонструкторКодаДополнительнойПроводки.
// Параметры см. ДобавитьДополнительнуюПроводку().
//
Функция Подключаемый_ДобавитьДополнительнуюПроводку(НаборПриемник, ЗаписьИсточник, ЗаписьПриемник, ДополнительныеДанные, СтруктураИмен)

	Возврат ДобавитьДополнительнуюПроводку(НаборПриемник, ЗаписьИсточник, ЗаписьПриемник, ДополнительныеДанные, СтруктураИмен);
	
КонецФункции

// Устарела. Следует использовать ДобавитьЗаписьСоответствияДвижений().
// Удалять нельзя. Может использоваться в спр. "Правила заполнения полей" - "После формирования записи".
//
Процедура ЗаполнитьЗаписьСоответствияДвижений(НаборСоответствие, СтруктураШапкиДокумента, 
							СтруктураПараметров, НомерСтрокиИсточника, НомерСтрокиПриемника, Активность = Истина)
							
	ПараметрыЗаписи = НовыеПараметрыЗаписиСоответствияДвижений();
	ПараметрыЗаписи.Реквизиты 			 = СтруктураШапкиДокумента;
	ПараметрыЗаписи.СтороныТрансляции 	 = СтруктураПараметров; 
	ПараметрыЗаписи.НомерСтрокиИсточника = НомерСтрокиИсточника;
	ПараметрыЗаписи.НомерСтрокиПриемника = НомерСтрокиПриемника;
	ПараметрыЗаписи.Активность 			 = Активность;
	
	ДобавитьЗаписьСоответствияДвижений(НаборСоответствие, ПараметрыЗаписи);

КонецПроцедуры

// Выполняет шаблон движений МХО.
// 
// Параметры:
//  Источник - ДокументОбъект
//  ШаблонДвижений - СправочникСсылка.бит_ШаблоныДвижений
// 
Процедура ВыполнитьШаблонДвижения(Источник, ЗаписьИсточник, ШаблонДвижения)

	КомплектМодель = Справочники.бит_КомплектыДвижений.СоздатьЭлемент();
	НоваяСтрока = КомплектМодель.ШаблоныДвижений.Добавить();
	НоваяСтрока.ШаблонДвижения = ШаблонДвижения;
	бит_МеханизмХозяйственныхОперацийСервер.ИнтерпретироватьКомплект(КомплектМодель);
	
	// Получим массив переменных
	МассивПеременных 	= КомплектМодель.СтекПеременных.Получить();
	КодОбработчика 		= КомплектМодель.КодОбработчикаПроведения;
	
	Если СокрЛП(КодОбработчика) = "" Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоОтладка = Неопределено;
	
	Источник.ДополнительныеСвойства.Свойство("ЭтоОтладка", ЭтоОтладка);
	
	Попытка
		// АПК:487-выкл ВыполнитьВБезопасномРежиме не используется, т.к. выполняется безопасный код.
		Выполнить(КодОбработчика);
		// АПК:487-вкл.
	Исключение
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры 

// Метод, подключаемый в модуле объекта Справочник.бит_ПравилаТрансляции.ГенерироватьКодПоСтрокеПравил().
// Параметры см. ВыполнитьШаблонДвижения().
//
Процедура Подключаемый_ВыполнитьШаблонДвижения(Источник, ЗаписьИсточник, ШаблонДвижения)

	ВыполнитьШаблонДвижения(Источник, ЗаписьИсточник, ШаблонДвижения);

КонецПроцедуры

// Извлекает количество из  проводки.
// 
// Параметры:
//  ЗаписьИсточник - РегистрБухгалтерииХозрасчетный.Запись
// 
// Возвращаемое значение:
//  Количество - Число.
// 
Функция КоличествоПроводки(ЗаписьИсточник)

	Количество = 0;
    
    СвСчДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ЗаписьИсточник.СчетДт);        
	Если СвСчДт.Количественный Тогда		
		Количество = ЗаписьИсточник.КоличествоДт;		
    Иначе        
        СвСчКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ЗаписьИсточник.СчетКт);
        Если СвСчКт.Количественный Тогда			
		    Количество = ЗаписьИсточник.КоличествоКт;        
        КонецЕсли;    
	КонецЕсли; 

	Возврат Количество;
	
КонецФункции // КоличествоПроводки()

// Метод, подключаемый в Справочник.бит_ПравилаЗаполненияПолейПриТрансляции.Форма.ФормаЭлемента.ЗаполнитьПоляПриемника(). 
// Параметры см. КоличествоПроводки().
//
Функция Подключаемый_КоличествоПроводки(ЗаписьИсточник)

	Возврат КоличествоПроводки(ЗаписьИсточник);

КонецФункции

// Извлекает валюту для использования в движения по бюджету.
// 
// Параметры:
//  ЗаписьИсточник - РегистрБухгалтерииХозрасчетный.Запись
//  СтруктураШапкиДокумента - Структура
// 
// Возвращаемое значение:
//  Валюта - СправочникСсылка.Валюты.
// 
Функция ВалютаОборотовБюджетирования(ЗаписьИсточник, СтруктураШапкиДокумента)
	
	Валюта = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета;
	
	СтатьяДоходовРасходов = ЗначениеСубконто(ЗаписьИсточник, "Дт", "Субконто.ПрочиеДоходыИРасходы");
	
	Если НЕ ЗначениеЗаполнено(СтатьяДоходовРасходов) Тогда
		
		СтатьяДоходовРасходов = ЗначениеСубконто(ЗаписьИсточник, "Кт", "Субконто.ПрочиеДоходыИРасходы");
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтатьяДоходовРасходов) 
		 И СтатьяДоходовРасходов.Предопределенный 
		 И (СтатьяДоходовРасходов.ИмяПредопределенныхДанных = "КурсовыеРазницы" 
		    ИЛИ СтатьяДоходовРасходов.ИмяПредопределенныхДанных = "КурсовыеРазницыПоРасчетамВУЕ") Тогда
	
		// Для курсовых разниц валюта операции всегда рубль.
		Возврат Валюта;
	
	КонецЕсли; 
	
	Договор = ЗначениеСубконто(ЗаписьИсточник, "Дт", "Субконто.Договоры");
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		
		Договор = ЗначениеСубконто(ЗаписьИсточник, "Кт", "Субконто.Договоры");
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Договор) Тогда
		
		Валюта = бит_КурсыВалют.ПолучитьВалютуДоговораКонтрагента(Договор);
		
	Иначе	
		
		Если ЗначениеЗаполнено(ЗаписьИсточник.ВалютаДт) Тогда
			
			Валюта = ЗаписьИсточник.ВалютаДт;
			
		ИначеЕсли ЗначениеЗаполнено(ЗаписьИсточник.ВалютаКт) Тогда	
			
			Валюта = ЗаписьИсточник.ВалютаКт;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Валюта;
	
КонецФункции // ВалютаОборотовБюджетирования()

// Метод, подключаемый в Справочник.бит_ПравилаЗаполненияПолейПриТрансляции.Форма.ФормаЭлемента.ЗаполнитьПоляПриемника(). 
// Параметры см. ВалютаОборотовБюджетирования().
//
Функция Подключаемый_ВалютаОборотовБюджетирования(ЗаписьИсточник, СтруктураШапкиДокумента)

	Возврат ВалютаОборотовБюджетирования(ЗаписьИсточник, СтруктураШапкиДокумента);

КонецФункции

// Устанавливает период записи согласно данным указанным в дополнительных Аналитиках.
// 
// Параметры:
//  ЗаписьПриемник 			- РегистрНакопленияЗапись, РегистрБухгалтерииЗапись
//  СтруктураПараметров 	- Структура
//  ДополнительныеАналитики - Соответствие
// 
Процедура СкорректироватьПериод(ЗаписьПриемник, СтруктураПараметров, ДополнительныеАналитики)
	
	// При необходимости переопределяем даты движений.
	// Производим это до выполнения всех других алгоритмов, чтобы новые даты могли повлиять на последующие вычисления.
	Если СтруктураПараметров.МетаданныеПриемника = Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам
		ИЛИ СтруктураПараметров.МетаданныеПриемника = Метаданные.РегистрыБухгалтерии.бит_Бюджетирование Тогда
		
		// Установка даты проведения по Бюджету
		ДатаДвиженийБюдж = ИзвлечьЗначениеАналитики("ДатаПроведенияПоБюджету", ДополнительныеАналитики);
		Если ЗначениеЗаполнено(ДатаДвиженийБюдж) Тогда
			ЗаписьПриемник.Период = ДатаДвиженийБюдж;
		КонецЕсли; 	
		
	КонецЕсли;		
	
	Если бит_му_ОбщегоНазначения.ЭтоМеждународныйПланСчетовИлиРегистр(СтруктураПараметров.МетаданныеПриемника.Имя) Тогда
		
		ДатаДвиженийМСФО = ИзвлечьЗначениеАналитики("ДатаПроведенияМСФО", ДополнительныеАналитики);
		Если ЗначениеЗаполнено(ДатаДвиженийМСФО) Тогда
			ЗаписьПриемник.Период = ДатаДвиженийМСФО;
		КонецЕсли; 	
		
	КонецЕсли; // Алгоритмы заполнения специфичные для МСФО.
	
КонецПроцедуры

// Метод, подключаемый в бит_МеханизмТрансляцииКлиентСервер.ГенерироватьКодПоСтроке(). 
// Параметры см. СкорректироватьПериод().
//
Процедура Подключаемый_СкорректироватьПериод(ЗаписьПриемник, СтруктураПараметров, ДополнительныеАналитики)

	СкорректироватьПериод(ЗаписьПриемник, СтруктураПараметров, ДополнительныеАналитики);	

КонецПроцедуры

#КонецОбласти // Подключаемые

// Процедура очищает соответствие движений для указанных Источника и Приемника.
// 
// Параметры:
//  НаборСоответствие  - РегистрСведенийНаборЗаписей.бит_СоответствиеЗаписейТрансляции.
//						 РегистрНакопленийНаборЗаписей.бит_СоответствиеОборотовТрансляции.
//  Приемник           - СправочникСсылка.бит_ОбъектыСистемы.
// 
Процедура ОчиститьСоответствиеДвижений(НаборСоответствие, Приемник)
	
	Индекс = НаборСоответствие.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ТекЗапись = НаборСоответствие[Индекс];
		// Т.к. набор-приемник очищается перед выполнение трансляции, 
		// то и все соответствия номеров по данному приемнику очищаем. 
	    // Иначе могут остаться соответствия от прошлых итерация, движения которых не будут записаны.
		Если ТекЗапись.Приемник = Приемник Тогда
			НаборСоответствие.Удалить(ТекЗапись);
		КонецЕсли; 
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры 

Функция СвойствоОбъектаПоИмени(ИмяСвойства)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизитыИСведения.Ссылка КАК Свойство
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		|ГДЕ
		|	ДополнительныеРеквизитыИСведения.Имя = &ИмяСвойства";
	
	Запрос.УстановитьПараметр("ИмяСвойства", ИмяСвойства);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Свойство;

КонецФункции

Функция ЧастиСлужебнойОтметки(ТекстСлужебнойОтметки, ДтКт)

	СлужебнаяОтметка = "";
	Правило 		 = Справочники.бит_ПравилаТрансляции.ПустаяСсылка();
	
	ПозицияРазделителя = СтрНайти(ТекстСлужебнойОтметки, "ref =");
	Если ПозицияРазделителя <> 0 Тогда
		Идентификатор = Сред(ТекстСлужебнойОтметки, ПозицияРазделителя + 6);
		Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор) Тогда
			Идентификатор = Новый УникальныйИдентификатор(Идентификатор); 
			Правило 	  = Справочники.бит_ПравилаТрансляции.ПолучитьСсылку(Идентификатор);
		КонецЕсли;
		СлужебнаяОтметка = Лев(ТекстСлужебнойОтметки, ПозицияРазделителя - 3);
	Иначе
		СлужебнаяОтметка = ТекстСлужебнойОтметки;	
	КонецЕсли;
	
	ЧастиСлужебнойОтметки = Новый Структура;
	ЧастиСлужебнойОтметки.Вставить("Правило" 		  + ДтКт, Правило);
	ЧастиСлужебнойОтметки.Вставить("СлужебнаяОтметка" + ДтКт, СлужебнаяОтметка);
	
	Возврат ЧастиСлужебнойОтметки;
	
КонецФункции
 
Процедура ЗаписатьНаборПриТрансляцииДвижений(НаборПриемник, НаборСоответствие, НаборСоответствиеОборотов, 
											Протокол, флВестиПротокол, флЕстьОшибки, 
											флЗаписыватьСоответствиеНомеров, флЗаписыватьСоответствиеОборотов)
	
	Попытка
		НаборПриемник.Записать();
	Исключение
		флЕстьОшибки = Истина;
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ДобавитьСообщениеВПротокол(Протокол, Строка(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())), флВестиПротокол);						
	КонецПопытки;
	
	Если флЗаписыватьСоответствиеНомеров Тогда
		Попытка
			НаборСоответствие.Записать();
		Исключение
			флЕстьОшибки = Истина;
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ДобавитьСообщениеВПротокол(Протокол, Строка(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())), флВестиПротокол);				 
		КонецПопытки;			
	КонецЕсли; 
	
	Если флЗаписыватьСоответствиеОборотов Тогда
		Попытка
			НаборСоответствиеОборотов.Записать();
		Исключение
			флЕстьОшибки = Истина;
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ДобавитьСообщениеВПротокол(Протокол, Строка(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())), флВестиПротокол);				 
		КонецПопытки;			
	КонецЕсли; 
	
КонецПроцедуры

// Процедура формирует проводки бюджетирования по сформированным движениям регистра 
// бит_ОборотыПоБюджетам исходя из шаблонов проводок.
// 
// Параметры:
//  Источник           - ДокументОбъект.
//  НаборОбороты       - РегистрНакопленияНаборЗаписей.бит_ОборотыПоБюджетам.
//  ЗаписыватьДвижения - Булево.
// 
Процедура СформироватьПроводкиБюджетирования(Источник,НаборОбороты,ЗаписыватьДвижения)

	ТаблицаОбороты = НаборОбороты.Выгрузить();
	
	// Добавим в таблицу оборотов колонки, необходимые для корректного функционирования 
	// механизма формирования проводок бюджетирования.
	ОписаниеЧисло = Новый ОписаниеТипов("Число");
	
	// Дозаполним необходимые данные
	// т.к. трансляция при сборе факта идет из документов регл. учета будем считать, 
	// что входящие суммы в валюте регл. учета.
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	Для каждого СтрокаТаблицы Из ТаблицаОбороты Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Валюта) Тогда
			
			СтрокаТаблицы.Валюта      = ВалютаРегл;
			СтрокаТаблицы.Сумма       = СтрокаТаблицы.СуммаРегл;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// Сформируем проводки бюджетирования
	ПроводкиБюджетирования = Источник.Движения.бит_Бюджетирование;
	
	ПроводкиБюджетирования.Очистить();
	
	бит_БюджетированиеБалансовыйУчет.СформироватьПроводкиБюджетирования(ТаблицаОбороты,ПроводкиБюджетирования);

	Если ЗаписыватьДвижения Тогда
	
		ПроводкиБюджетирования.Записать();
	
	КонецЕсли; 
	
КонецПроцедуры // СформироватьПроводкиБюджетирования()

// Функция получает доступные правила трансляции и правила заполнения полей при трансляции.
// 
// Параметры:
//  Организация  - СправочникСсылка.Организации.
//  Дата         - Дата.
//  РегистрыИсточники - Массив.
//  РегистрыПриемники - Массив.
// 
// Возвращаемое значение:
//   Результат   - РезультатЗапроса.
// 
Функция ПолучитьДоступныеПравилаТрансляции(Организация, ДокументОбъект, Дата, РегистрыИсточники, РегистрыПриемники)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаТрансляции.Ссылка КАК ПравилоТрансляции,
	|	ПравилаТрансляции.Источник КАК Источник,
	|	ПравилаТрансляции.Приемник КАК Приемник,
	|	ПравилаТрансляции.КодУсловияТрансляции КАК КодУсловияТрансляции,
	|	ПравилаТрансляции.Источник.ИмяОбъекта КАК ИсточникИмяОбъекта,
	|	ПравилаТрансляции.Источник.ИмяОбъектаПолное КАК ИсточникИмяОбъектаПолное,
	|	ПравилаТрансляции.Приемник.ИмяОбъекта КАК ПриемникИмяОбъекта
	|ПОМЕСТИТЬ ВТ_ПравилаТрансляции
	|ИЗ
	|	Справочник.бит_ПравилаТрансляции КАК ПравилаТрансляции
	|ГДЕ
	|	НЕ ПравилаТрансляции.ПометкаУдаления
	|	И &УсловиеИсточники
	|	И &УсловиеПриемники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК Приоритет,
	|	НазначениеПравил.ПравилоТрансляции КАК ПравилоТрансляции,
	|	НазначениеПравил.ПравилоТрансляции.КодУсловияТрансляции КАК КодУсловияТрансляции,
	|	НазначениеПравил.ПравилоТрансляции.Источник КАК Источник,
	|	НазначениеПравил.ПравилоТрансляции.Приемник КАК Приемник,
	|	НазначениеПравил.Приоритет КАК ПриоритетПравилаТрансляции
	|ПОМЕСТИТЬ ТаблицаПравилТрансляции
	|ИЗ
	|	РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(
	|			&ДатаЗапроса,
	|			(СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка))
	|				И Назначение В (&НазначениеИспользования)) КАК НазначениеПравил
	|ГДЕ
	|	(КОНЕЦПЕРИОДА(НазначениеПравил.ДатаОкончания, ДЕНЬ) >= &ДатаЗапроса
	|			ИЛИ НазначениеПравил.ДатаОкончания = &ПустаяДата)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	НазначениеПравил.ПравилоТрансляции,
	|	НазначениеПравил.ПравилоТрансляции.КодУсловияТрансляции,
	|	НазначениеПравил.ПравилоТрансляции.Источник,
	|	НазначениеПравил.ПравилоТрансляции.Приемник,
	|	НазначениеПравил.Приоритет
	|ИЗ
	|	РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(
	|			&ДатаЗапроса,
	|			СтруктурноеПодразделение В
	|					(ВЫБРАТЬ
	|						бит_ГруппыСтруктурныхПодразделенийСостав.Ссылка
	|					ИЗ
	|						Справочник.бит_ГруппыСтруктурныхПодразделений.Состав КАК бит_ГруппыСтруктурныхПодразделенийСостав
	|					ГДЕ
	|						бит_ГруппыСтруктурныхПодразделенийСостав.СтруктурноеПодразделение = &Организация)
	|				И Назначение В (&НазначениеИспользования)) КАК НазначениеПравил
	|ГДЕ
	|	(КОНЕЦПЕРИОДА(НазначениеПравил.ДатаОкончания, ДЕНЬ) >= &ДатаЗапроса
	|			ИЛИ НазначениеПравил.ДатаОкончания = &ПустаяДата)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	НазначениеПравил.ПравилоТрансляции,
	|	НазначениеПравил.ПравилоТрансляции.КодУсловияТрансляции,
	|	НазначениеПравил.ПравилоТрансляции.Источник,
	|	НазначениеПравил.ПравилоТрансляции.Приемник,
	|	НазначениеПравил.Приоритет
	|ИЗ
	|	РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(
	|			&ДатаЗапроса,
	|			СтруктурноеПодразделение = &Организация
	|				И Назначение В (&НазначениеИспользования)) КАК НазначениеПравил
	|ГДЕ
	|	(КОНЕЦПЕРИОДА(НазначениеПравил.ДатаОкончания, ДЕНЬ) >= &ДатаЗапроса
	|			ИЛИ НазначениеПравил.ДатаОкончания = &ПустаяДата)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Источник,
	|	Приемник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначениеПравилЗаполнения.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	ВТ_ПравилаТрансляции.Источник КАК Источник,
	|	ВТ_ПравилаТрансляции.Приемник КАК Приемник,
	|	ВЫБОР
	|		КОГДА НазначениеПравилЗаполнения.ОбъектСистемы = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК АвтоПриоритетПравилаЗаполнения,
	|	НазначениеПравилЗаполнения.Приоритет КАК ПриоритетПравилаЗаполнения,
	|	ПриоритетПравилТрансляции.Приоритет КАК Приоритет,
	|	ПриоритетПравилТрансляции.ПриоритетПравилаТрансляции КАК ПриоритетПравилаТрансляции,
	|	ВТ_ПравилаТрансляции.ПравилоТрансляции КАК ПравилаТрансляции,
	|	ВТ_ПравилаТрансляции.КодУсловияТрансляции КАК КодУсловияТрансляции,
	|	ВТ_ПравилаТрансляции.ИсточникИмяОбъекта КАК ИсточникИмяОбъекта,
	|	ВТ_ПравилаТрансляции.ПриемникИмяОбъекта КАК ПриемникИмяОбъекта,
	|	ВТ_ПравилаТрансляции.ИсточникИмяОбъектаПолное КАК ИсточникИмяОбъектаПолное,
	|	НазначениеПравилЗаполнения.ОбъектСистемы КАК ОбъектСистемы,
	|	НазначениеПравилЗаполнения.УсловиеВхождения КАК УсловиеВхождения,
	|	НазначениеПравилЗаполнения.ПравилоЗаполнения.РежимИспользованияСоответствий КАК РежимИспользованияСоответствий
	|ИЗ
	|	ВТ_ПравилаТрансляции КАК ВТ_ПравилаТрансляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПравилТрансляции КАК ПриоритетПравилТрансляции
	|		ПО ВТ_ПравилаТрансляции.ПравилоТрансляции = ПриоритетПравилТрансляции.ПравилоТрансляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НазначениеПравилЗаполненияПриТрансляции КАК НазначениеПравилЗаполнения
	|		ПО ВТ_ПравилаТрансляции.Источник = НазначениеПравилЗаполнения.Источник
	|			И ВТ_ПравилаТрансляции.Приемник = НазначениеПравилЗаполнения.Приемник
	|ГДЕ
	|	НазначениеПравилЗаполнения.ОбъектСистемы В (&ОбъектСистемы, ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	АвтоПриоритетПравилаЗаполнения,
	|	ПриоритетПравилаЗаполнения,
	|	Приоритет,
	|	ПриоритетПравилаТрансляции
	|ИТОГИ
	|	МАКСИМУМ(ИсточникИмяОбъекта),
	|	МАКСИМУМ(ПриемникИмяОбъекта),
	|	МАКСИМУМ(ИсточникИмяОбъектаПолное)
	|ПО
	|	ПравилоЗаполнения,
	|	Источник,
	|	Приемник";

	ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(ДокументОбъект.Метаданные());
	
	// Без "подбора счетов".
	НазначениеИспользования = Новый Массив(); 
	Для каждого Элемент Из Перечисления.бит_НазначенияПравилТрансляции Цикл
		Если НЕ Элемент = Перечисления.бит_НазначенияПравилТрансляции.ПодборСчетов Тогда
			НазначениеИспользования.Добавить(Элемент);
		КонецЕсли; 
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("Организация",	   Организация);
	Запрос.УстановитьПараметр("ДатаЗапроса",	   Дата);
	Запрос.УстановитьПараметр("ПустаяДата",		   Дата('00010101'));
	Запрос.УстановитьПараметр("ОбъектСистемы",	   ОбъектСистемы);
	Запрос.УстановитьПараметр("НазначениеИспользования",  НазначениеИспользования);
	Запрос.УстановитьПараметр("УсловиеИсточники",  Истина);
	Запрос.УстановитьПараметр("УсловиеПриемники",  Истина);
	Запрос.УстановитьПараметр("РегистрыИсточники", РегистрыИсточники);
	Запрос.УстановитьПараметр("РегистрыПриемники", РегистрыПриемники);
	
	Если ЗначениеЗаполнено(РегистрыИсточники) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИсточники", 
							"Источник В(&РегистрыИсточники)");		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(РегистрыПриемники) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПриемники", 
							"Приемник В(&РегистрыПриемники)");
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

// Функция по справочнику бит_ПравилаЗаполненияПолейПриТрансляции готовит 
// структуры ОбязательныхПолей и ПользовательскихФункции. 
// Структуры используются при выполнении трансляции.
// 
// Параметры:
//  СпрПравила  - СправочникСсылка.бит_ПравилаЗаполненияПолейПриТрансляции.
// 
// Возвращаемое значение:
//   РезСтруктура   - Структура - Содержит структуры ОбязательныеПоля и ПользовательскиеФункции.
// 
Функция ПодготовитьСтруктурыПравил(СпрПравила)

  // Структура для проверки обязательных полей; ключ - ИмяПоля(Строка), значение - Синоним(Строка).
  ОбязательныеПоля  = Новый Структура;
  
  // Структура, содержащая ссылки на пользовательские функции, содержащиеся в правилах заполнения.
  // Ключ - ИмяФункции(Строка), значение - ПользовательскаяФункция(СправочникСсылка.бит_ПользовательскиеФункции). 
  ПользовательскиеФункции = Новый Соответствие;

  Для каждого СтрокаТаблицы Из СпрПравила.ПоляПриемника Цикл
	  
	// Заполняем обязательные поля  
  	Если СтрокаТаблицы.Обязательное Тогда
	
		 ОбязательныеПоля.Вставить(СтрокаТаблицы.ИмяПоля,СтрокаТаблицы.Синоним);
		 
		 
	КонецЕсли; 
	
	// Выделяем имя функции и заполняем структуру пользовательских функций.
	СтрокаКод = СтрокаТаблицы.ПравилоЗаполнения;
	ПозицияФункции = Найти(СтрокаКод,"#П.");
	
	Пока ПозицияФункции >0   Цикл
		
		СтрокаВрем = Сред(СтрокаКод,ПозицияФункции+3);
		ПозицияСкобки = Найти(СтрокаВрем,"(");
		ИмяФункции = Сред(СтрокаВрем,1,ПозицияСкобки-1);
		
		ПользовательскаяФункция = Справочники.бит_ПользовательскиеФункции.НайтиПоНаименованию(ИмяФункции);
		Если ЗначениеЗаполнено(ПользовательскаяФункция) Тогда
		
			 ПользовательскиеФункции.Вставить(ИмяФункции,ПользовательскаяФункция);
		
		КонецЕсли; 
		
		СтрокаВрем = "@@@"+СтрокаВрем;
		СтрокаКод  = Лев(СтрокаКод,ПозицияФункции-1)+СтрокаВрем;
		ПозицияФункции = Найти(СтрокаКод,"#П.");
		
	КонецЦикла;	
	
  КонецЦикла; 
  
  РезСтруктура = Новый Структура("ОбязательныеПоля,ПользовательскиеФункции",ОбязательныеПоля,ПользовательскиеФункции);
  
  Возврат РезСтруктура;
  
КонецФункции // ПодготовитьСтруктурыПравил()

// Процедура заполняет структуру признаков учета по коллекции объекта метаданных.
// 
// Параметры:
//  ОбъектМетаданных  - ОбъектМетаданных.
//  ИмяКоллекции      - Строка.
//  ПризнакиУчета     - Структура.
// 
Процедура ДобавитьПризнакиУчета(ОбъектМетаданных,ИмяКоллекции,ПризнакиУчета)

	Для каждого Мета Из ОбъектМетаданных[ИмяКоллекции] Цикл
		
		Если Мета.ПризнакУчета <> Неопределено Тогда
			
			Если Мета.Балансовый Тогда
				ПризнакиУчета.Вставить(Мета.Имя,Мета.ПризнакУчета.Имя);
			Иначе	
				ПризнакиУчета.Вставить(Мета.Имя+"Дт",Мета.ПризнакУчета.Имя);
				ПризнакиУчета.Вставить(Мета.Имя+"Кт",Мета.ПризнакУчета.Имя);			
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры // ДобавитьПризнакУчета()

// Функция формирует структуру с соответствиями аналитик. Соответствия аналитик заполняются по СубконтоДт,
// СубконтоКт и измерениям Источника. В соответствиях ключ 	   - ОписаниеТипов,
// 													  значение - ПроизвольноеЗначение.
// Соответствия используются для автоматической установки значений Субконто и измерений в Приемнике.
// Подбор производится по типам.
// 
// Параметры:
//  ЗаписьИсточник  - РегистрБухгалтерииЗапись,РегистрНакопленияЗапись.
//  МетаданныеИсточника - ОбъектМетаданных.
//  ВидыРегистров       - Структура.
// 
// Возвращаемое значение:
//   Аналитики   - Структура.
// 
Функция СформироватьСоответствияАналитик(ЗаписьИсточник,МетаданныеИсточника,ВидыРегистров)

	// Заполним соответствие аналитик
	Аналитики = Новый Структура;
	Аналитики.Вставить("АналитикиИсточникДт",Новый Соответствие);
	Аналитики.Вставить("АналитикиИсточникКт",Новый Соответствие);
	Аналитики.Вставить("АналитикиИсточник"  ,Новый Соответствие);
	
	Если ВидыРегистров.ИсточникРегистрБухгалтерии Тогда
		
		Для НомДтКт=0 По 1 Цикл
			
			ДтКт = ?(НомДтКт = 0,"Дт","Кт");
			ИмяСоответствия = "АналитикиИсточник"+ДтКт;	
			Счет =ЗаписьИсточник["Счет"+ДтКт];
            
            СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
			Для Ном=1 По СвСч.КоличествоСубконто Цикл
				
                ВидСубконто      = СвСч["ВидСубконто" + Ном];
				ЗначениеСубконто = ЗаписьИсточник["Субконто"+ДтКт][ВидСубконто];
                ТипЗнчСубконто   = СвСч["ВидСубконто" + Ном + "ТипЗначения"];
				ЗначениеИзСоответствия = Аналитики[ИмяСоответствия][ТипЗнчСубконто];
				Если Не ЗначениеЗаполнено(ЗначениеИзСоответствия) Тогда
					Аналитики[ИмяСоответствия].Вставить(ТипЗнчСубконто, ЗначениеСубконто);
                КонецЕсли; 
                
            КонецЦикла; // По субконто 
            
		КонецЦикла; // по ДтКт
		
		// Заполнение подразделения из измерения
		ИзмерениеМета = МетаданныеИсточника.Измерения.Найти("Подразделение");
		Если НЕ ИзмерениеМета = Неопределено И ИзмерениеМета.Балансовый = Ложь Тогда
			
			Для НомДтКт=0 По 1 Цикл
				
				ДтКт = ?(НомДтКт = 0,"Дт","Кт");
				ИмяСоответствия  = "АналитикиИсточник"+ДтКт;
				ИмяИзмерения     = ИзмерениеМета.Имя+ДтКт;
			    ЗначениеИзСоответствия = Аналитики[ИмяСоответствия][ИзмерениеМета.Тип];
				Если НЕ ЗначениеЗаполнено(ЗначениеИзСоответствия) Тогда					
					Аналитики[ИмяСоответствия].Вставить(ИзмерениеМета.Тип,ЗаписьИсточник[ИмяИзмерения]);					
				КонецЕсли; 
				
			КонецЦикла; 
		
		КонецЕсли; 
		
	КонецЕсли; // Источник регистр бухгалтерии

	Если ВидыРегистров.ИсточникРегистрНакопления Тогда
	
		 Для каждого Измерение Из МетаданныеИсточника.Измерения Цикл
		 
		 	 ТекущееЗначение = ЗаписьИсточник[Измерение.Имя];
			 МассивДляСоответствия = Новый Массив;
			 МассивДляСоответствия.Добавить(ТипЗнч(ТекущееЗначение));
			 ОписаниеКлюч = Новый ОписаниеТипов(МассивДляСоответствия);
			 Аналитики["АналитикиИсточник"].Вставить(ОписаниеКлюч,ТекущееЗначение);
		 
		 КонецЦикла; 
	
	КонецЕсли; // Источник регистр накопления
	
    Возврат Аналитики;
	
КонецФункции // СформироватьСоответствияАналитик()

// Функция извлекает значения из соответствия 
// аналитик с учетом использования составных типов.
// 
// Параметры:
//   ТипЗнчИсточник - ОписаниеТипов.
//   СоответствиеАналитик - Соответствие.
// 
// Возвращаемое значение:
//  ЗначениеЗаполнения - Произвольный.
// 
Функция ПолучитьЗначениеДляЗаполнения(ТипЗнчИсточник, СоответствиеАналитик)
	
	ЗначениеЗаполнения = Неопределено;
	МассивТипов = ТипЗнчИсточник.Типы();
	Для каждого ТекТип Из МассивТипов Цикл
		
		МассивВрем = Новый Массив;
		МассивВрем.Добавить(ТекТип);
		
		ОписаниеВрем       = Новый ОписаниеТипов(МассивВрем);
		ЗначениеЗаполнения = СоответствиеАналитик[ОписаниеВрем];
		
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// Если не удалось получить значение по ключу, попробуем перебором.
	Если НЕ ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
		
		Для каждого ТекТип Из МассивТипов Цикл
			
			Для каждого КиЗ Из СоответствиеАналитик Цикл
			
				Если КиЗ.Ключ.СодержитТип(ТекТип) Тогда
				
					 ЗначениеЗаполнения = КиЗ.Значение;
				
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
				
					 Прервать;
				
				КонецЕсли; 
				
			КонецЦикла; // По соответствию
			
		КонецЦикла;	// По типам
		
	КонецЕсли;
	
	Возврат ЗначениеЗаполнения;
	
КонецФункции // ПолучитьЗначениеДляЗаполнения()

//  Производит заполнение субконто в наборе записей Приемника на основании соответствий аналитик.
//              ДопСоответствиеАналитик служит для случае когда аналитики необходимо брать с КоррСчета.
// 
// Параметры:
//  ЗаписьПриемник - РегистрБухгалтерииЗапись,РегистрНакопленияЗапись.
//  ДтКт           - Строка(2) - "Дт","Кт".
//  СоответствиеАналитик    - Соответствие - ключ Тип, значение - ПроизвольноеЗначение.
//  ДопСоответствиеАналитик - Соответствие - ключ Тип, значение - ПроизвольноеЗначение.               
// 
Процедура ЗаполнитьСубконтоВПриемнике(ЗаписьПриемник,ДтКт,СоответствиеАналитик,ДопСоответствиеАналитик = Неопределено)
	
  ДтКтКорр = ?(ДтКт   ="Дт","Кт","Дт");
  
  Счет = ЗаписьПриемник["Счет"+ДтКт];
  ИмяСчета    = "Счет"+ДтКт;
  ИмяСубконто = "Субконто"+ДтКт;
  
  СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
    
  Для Ном = 1 По СвСч.КоличествоСубконто Цикл
      
      ВидСубконтоПриемник = СвСч["ВидСубконто" + Ном];
      ТипЗнчСубконто = СвСч["ВидСубконто" + Ном + "ТипЗначения"];
      
      Если НЕ ЗначениеЗаполнено(ЗаписьПриемник[ИмяСубконто][ВидСубконтоПриемник]) Тогда
		  
		  ЗначениеЗаполнения = ПолучитьЗначениеДляЗаполнения(ТипЗнчСубконто, СоответствиеАналитик);		  
          ЗаписьПриемник[ИмяСубконто][ВидСубконтоПриемник] = ТипЗнчСубконто.ПривестиЗначение(ЗначениеЗаполнения);
		  
	  КонецЕсли; 
      
      Если НЕ ЗначениеЗаполнено(ЗаписьПриемник[ИмяСубконто][ВидСубконтоПриемник]) И ДопСоответствиеАналитик <> Неопределено Тогда
		  
		  ЗначениеЗаполнения = ПолучитьЗначениеДляЗаполнения(ТипЗнчСубконто, ДопСоответствиеАналитик);		  		  
          ЗаписьПриемник[ИмяСубконто][ВидСубконтоПриемник] = ТипЗнчСубконто.ПривестиЗначение(ЗначениеЗаполнения);
		  
      КонецЕсли; 
      
  КонецЦикла;

КонецПроцедуры // ЗаполнитьСубконтоВПриемнике()

// Процедура применяет коэффициенты к ресурсам приемника. 
// 
// Параметры:
//  ЗаписьИсточник - РегистрНакопленияЗапись, РегистрБухгалтерииЗапись.
//  ДополнительныеДанные - Соответствие.
//  ИмяРесурса - Строка.
// 
Процедура ПрименитьКоэффициенты(ЗаписьПриемник, ДополнительныеДанные, ИмяРесурса)
	
	Если ТипЗнч(ЗаписьПриемник[ИмяРесурса]) <> Тип("Число") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрЧислоВхождений(ИмяРесурса, "Количество") > 0 И ТипЗнч(ДополнительныеДанные["КоэффициентКоличество"]) = Тип("Число") Тогда			
		ЗаписьПриемник[ИмяРесурса] = ДополнительныеДанные["КоэффициентКоличество"] * ЗаписьПриемник[ИмяРесурса];
	КонецЕсли;
	
	Если СтрЧислоВхождений(ИмяРесурса, "Количество") = 0 И ТипЗнч(ДополнительныеДанные["КоэффициентСумма"]) = Тип("Число") Тогда
		ЗаписьПриемник[ИмяРесурса] = ДополнительныеДанные["КоэффициентСумма"] * ЗаписьПриемник[ИмяРесурса];
	КонецЕсли; 
	
КонецПроцедуры

// Процедура заполняет значения измерений Приемника по соответствиям аналитик. 
// Подбор соответствия произодится по типам.
// 
// Параметры:
//  ЗаписьПриемник - РегистрБухгалтерииЗапись,РегистрНакопленияЗапись.
//  Аналитики      - Структура - содержит соответствия аналитик.
//  МетаданныеПриемника - ОбъектМетаданных.
// 
Процедура ЗаполнитьИзмеренияВПриемнике(ЗаписьПриемник,Аналитики,МетаданныеПриемника)
	
	Для каждого Измерение Из МетаданныеПриемника.Измерения Цикл
		
		ИмяИзмерения = Измерение.Имя;
		ТипИзмерения = Измерение.Тип;
		Если НЕ ЗначениеЗаполнено(ЗаписьПриемник[ИмяИзмерения]) Тогда
			
			ЗаписьПриемник[ИмяИзмерения] = Аналитики["АналитикиИсточник"][ТипИзмерения];
			
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(ЗаписьПриемник[ИмяИзмерения]) Тогда
			
			ЗаписьПриемник[ИмяИзмерения] = Аналитики["АналитикиИсточникДт"][ТипИзмерения];
			
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(ЗаписьПриемник[ИмяИзмерения]) Тогда
			
			ЗаписьПриемник[ИмяИзмерения] = Аналитики["АналитикиИсточникКт"][ТипИзмерения];
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьИзмеренияВПриемнике()

// Процедура анализируем необходима ли дальнейшая обработка текущего набора записей.
// 
// Параметры:
//  ПравилоЗаполнения  		- СправочникСсылка.бит_ПравилаЗаполненияПолейПриТрансляции.
//  МетаданныеПриемника 	- ОбъектМетаданных.
//  ДополнительныеАналитики - Соответствие.
//  Отказ 					- Булево.
// 
Процедура АнализироватьНеобходимостьОбработкиНабора(ПравилоЗаполнения, МетаданныеПриемника, ДополнительныеАналитики, Отказ)

	// Анализ аналитик "НеОтражатьВФакте", "НеОтражатьВМСФО","НеВыполнятьТрансляцию".
	Если бит_му_ОбщегоНазначения.ЭтоМеждународныйПланСчетовИлиРегистр(МетаданныеПриемника.Имя) Тогда
	
		Если ИзвлечьЗначениеАналитики("НеОтражатьВМСФО", ДополнительныеАналитики) = Истина Тогда
			Отказ = Истина;
		КонецЕсли;
		
	ИначеЕсли МетаданныеПриемника = Метаданные.РегистрыБухгалтерии.бит_Бюджетирование 
		  ИЛИ МетаданныеПриемника = Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам Тогда
		  
		  НеОтражатьВФактеТрансляция = (ИзвлечьЗначениеАналитики("НеОтражатьВФактеТрансляция", ДополнительныеАналитики) = Истина);
		  Если НеОтражатьВФактеТрансляция Тогда
			  Отказ = Истина;
		  КонецЕсли;  
	КонецЕсли;
	
	Если ИзвлечьЗначениеАналитики("НеВыполнятьТрансляцию", ДополнительныеАналитики) = Истина Тогда
		Отказ = Истина;
	КонецЕсли;  

КонецПроцедуры // АнализироватьНеобходимостьОбработкиНабора()

Процедура ОбработкаНабораПриРучномРедактированииФакта(МетаданныеПриемника, ДополнительныеАналитики, Отказ)
	
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		Если МетаданныеПриемника = Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам Тогда
			
			РучнаяКорректировкаФактаБюджета = (ИзвлечьЗначениеАналитики("РучнаяКорректировкаФактаБюджета", ДополнительныеАналитики) = Истина);
			Если РучнаяКорректировкаФактаБюджета Тогда
				Отказ = Истина;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
	 
КонецПроцедуры

// Процедура выполняет алгоритмы специфичные для МСФО. 
// Установка даты движений по МСФО из аналитик и принудительное заполнение валютных сумм.
// 
// Параметры:
//  ЗаписьИсточник  - РегистрБухгалтерииНаборЗаписей, РегистрСведенийНаборЗаписей.
//  ЗаписьПриемник  - РегистрБухгалтерииНаборЗаписей, РегистрСведенийНаборЗаписей.
//  ПравилоЗаполнения  - СправочникСсылка.бит_ПравилаЗаполненияПолейПриТрансляции.
//  ДополнительныеАналитики - Соответствие.
// 
Процедура ВыполнитьАлгоритмыМСФО(СтруктураШапкиДокумента
	                                , ЗаписьИсточник
									, ЗаписьПриемник
									, ПравилоЗаполнения
									, ДополнительныеАналитики
									, ДополнительныеДанные)
	
	
	// Принудительное заполнение валют
	Если ПравилоЗаполнения.ПринудительноеЗаполнениеВалютныхСумм Тогда
        
        СвСчДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ЗаписьПриемник.СчетДт);
        СвСчКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ЗаписьПриемник.СчетКт);
    
		Если СвСчДт.Валютный Тогда
			
			Если НЕ ЗначениеЗаполнено(ЗаписьПриемник.ВалютаДт) Тогда
				
				ЗаписьПриемник.ВалютаДт = Константы.ВалютаРегламентированногоУчета.Получить();
				ЗаписьПриемник.ВалютнаяСуммаДт = ЗаписьПриемник.СуммаРегл; 
				
			КонецЕсли;	
			
		КонецЕсли;
		
		Если СвСчКт.Валютный Тогда
			
			Если НЕ ЗначениеЗаполнено(ЗаписьПриемник.ВалютаКт) Тогда
				
				ЗаписьПриемник.ВалютаКт = Константы.ВалютаРегламентированногоУчета.Получить();
				ЗаписьПриемник.ВалютнаяСуммаКт = ЗаписьПриемник.СуммаРегл; 
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЕсли;// Принудительное заполнение валют 
	
	ВыполнитьАлгоритмыМСФОИсторическаяСтоимость(ЗаписьИсточник, ЗаписьПриемник, ПравилоЗаполнения, СтруктураШапкиДокумента);
	
КонецПроцедуры

Процедура ВыполнитьАлгоритмыМСФОИсторическаяСтоимость(ЗаписьИсточник, ЗаписьПриемник, ПравилоЗаполнения, СтруктураШапкиДокумента)
	
	// ++ ЕРП
	// Учет исторической стоимости не реализован в ЕРП.
	// -- ЕРП

КонецПроцедуры
 
Функция ИспользоватьСторнируемыеПроводки()
	
	Возврат ПолучитьФункциональнуюОпцию("бит_ИспользоватьСторнируемыеПроводки");
	
КонецФункции

// Функция готовит массив полей для автозаполнения по универсальным соответствиям. 
//
// Параметры:
//  ТекАналитика - ПланВидовХарактеристикСсылка.бит_ВидыДополнительныхАналитик.
//  ИмяПоляАналитики - Строка - Имя аналитики в регистре соответствия.
//  ПоляСоответствия - Структура.
//  МетаданныеРегистра - ОбъектМетаданных.
//
Процедура ПодготовитьМассивПолейУниверсальногоСоответствия(ТекАналитика, ИмяПоляАналитика, ПоляСоответствия, МетаданныеРегистра
															// Изменения кода. Начало: 24.11.2016  {{ 
															,НастройкиДопИзмерений)
															// Изменения кода. Конец 24.11.2016  }} 
	
	Если ЗначениеЗаполнено(ТекАналитика) Тогда
		
		МассивТипов  = ТекАналитика.ТипЗначения.Типы();
		// По типу выполняем поиск потенциальных полей.
		Поля = НайтиПоляАвтозаполнения(МетаданныеРегистра, МассивТипов
															// Изменения кода. Начало: 24.11.2016  {{ 
															,НастройкиДопИзмерений, ТекАналитика);
															// Изменения кода. Конец 24.11.2016  }} 
		Для каждого СтрПоле Из Поля Цикл
		
			СтрПоле.Вставить("ИмяКолонкиТаблицыАналитик", ИмяПоляАналитика);
			ПоляСоответствия.Добавить(СтрПоле);
		
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьМассивПолейУниверсальногоСоответствия()

// Функция готовит структуру полей для автозаполнения по универсальным соответствиям.
// 
// Параметры:
//  ТекАналитика - ПланВидовХарактеристикСсылка.бит_ВидыДополнительныхАналитик.
//  ИмяПоляАналитики - Строка - Имя аналитики в регистре соответствия.
//  ПоляСоответствия - Структура.
//  МетаданныеРегистра - ОбъектМетаданных.
// 
Процедура ПодготовитьСтруктуруПолейУниверсальногоСоответствия(ТекАналитика, ИмяПоляАналитика, ПоляСоответствия, МетаданныеРегистра, НастройкиДопИзмерений)
	
	Если ЗначениеЗаполнено(ТекАналитика) Тогда
		
		МассивТипов  = ТекАналитика.ТипЗначения.Типы();
		// По типу выполняем поиск потенциальных полей.
		Поля = НайтиПоляАвтозаполнения(МетаданныеРегистра, МассивТипов);
		КоличествоПолей = Поля.Количество();
		
		Если КоличествоПолей > 0 Тогда
			
			// Иногда поставщик меняет имя предопределенных данных.
			СловарьЕдМн = Новый Соответствие;
			СловарьЕдМн.Вставить("Контрагент", "Контрагенты");
			СловарьЕдМн.Вставить("НоменклатурнаяГруппа", "НоменклатурныеГруппы");
			
			Если КоличествоПолей = 1 Тогда
				
				// Если найдено только одно поле - проблем нет.
				ПоляСоответствия.Вставить(ИмяПоляАналитика, Поля[0]);
				
			Иначе	
				
				// Если полей с данным типом несколько - пытаемся найти по имени.
				флОбработано = Ложь;
				ИмяСущности = СокрЛП(ТекАналитика.Код);
				ИмяСущностиМн = СловарьЕдМн[ИмяСущности];
				ИмяСущностиМн = ?( ТипЗнч(ИмяСущностиМн) = Тип("Строка"), ИмяСущностиМн, "");
				
				ТекНастройкаИзмерения = НастройкиДопИзмерений[ТекАналитика];
				
				Для каждого СтрПоле Из Поля Цикл
					
					ИмяПоля = ВРег(СокрЛП(СтрПоле.Поле));
					ИмяПоля = СтрЗаменить(ИмяПоля," ","");
					Если ИмяПоля = ВРег(ИмяСущности) ИЛИ ИмяПоля = ВРег(ИмяСущностиМн) Тогда
						
						ПоляСоответствия.Вставить(ИмяПоляАналитика, СтрПоле);
						флОбработано = Истина;
						Прервать;
						
					ИначеЕсли НЕ ТекНастройкаИзмерения = Неопределено Тогда
						
						Если ИмяПоля = ВРег(ТекНастройкаИзмерения.ИмяИзмерения) Тогда
							
							ПоляСоответствия.Вставить(ИмяПоляАналитика, СтрПоле);
							флОбработано = Истина;
							Прервать;
						КонецЕсли; 
					КонецЕсли; 
				КонецЦикла; 
				
				// Не удалось найти по имени - берем первое.
				Если НЕ флОбработано Тогда
					
					ПоляСоответствия.Вставить(ИмяПоляАналитика, Поля[0]);
					
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьСтруктуруПолейУниверсальногоСоответствия()

// Функция готовит параметры для работы механизма автозаполнения по соответствиям.
// 
// Параметры:
//  СтруктураПараметров  - Структура.
// 
// Возвращаемое значение:
//   ПараметрыАвтозаполнения   - Структура.
// 
Функция ПодготовитьПараметрыАвтозаполнения(СтруктураПараметров)
	
	ПараметрыАвтозаполнения = Новый Структура;
	
	
	флИспользоватьСоответствия = ?(СтруктураПараметров.РежимИспользованияСоответствий 
		                             = Перечисления.бит_РежимыИспользованияСоответствийПриТрансляции.НеИспользовать, Ложь, Истина);
	
	
	Если флИспользоватьСоответствия Тогда
		
		НастройкиДопИзмерений = бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений();

		
		флНастраиватьВПравилах = ?(СтруктураПараметров.РежимИспользованияСоответствий 
		                             = Перечисления.бит_РежимыИспользованияСоответствийПриТрансляции.ВПравилахТрансляции, Истина, Ложь);
									 
		флСтандартныйРежим = ?(СтруктураПараметров.РежимИспользованияСоответствий 
		                             = Перечисления.бит_РежимыИспользованияСоответствийПриТрансляции.Стандартный, Истина, Ложь);
									 
									 
	     // Автоматическое заполнение ЦФО по подразделениям в режиме синхронизации.
		 Если ПолучитьФункциональнуюОпцию("бит_СинхронизироватьПодразделенияРеглЦФО") 
			  И ( флНастраиватьВПравилах 
			      ИЛИ ( флСтандартныйРежим И СтруктураПараметров.ПравилоЗаполнения.Использовать_СинхронизациюПодразделенияЦФО ))  Тогда
		 
				 МассивТипов = Новый Массив;
				 МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
				 МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));				
				 ПоляИсточника = НайтиПоляАвтозаполнения(СтруктураПараметров.МетаданныеИсточника,МассивТипов);
				 
				 // Организация должна идти последней, т.к. подразделение имеет приоритет.
				 Если ПоляИсточника.Количество()>1 Тогда
					 
					 ПервыйЭл = ПоляИсточника[0];
					 Если ПервыйЭл.Поле = "Организация" Тогда
						 
						 ПоляИсточника.Удалить(0);
						 ПоляИсточника.Добавить(ПервыйЭл);
						 
					 КонецЕсли; 
					 
				 КонецЕсли; 				 
				 
				 ИмяТипаЦФО = бит_ОбщегоНазначения.ПолучитьИмяТипаЦФО();
				 МассивТипов = Новый Массив;
				 МассивТипов.Добавить(Тип(ИмяТипаЦФО));
				 ПоляПриемника = НайтиПоляАвтозаполнения(СтруктураПараметров.МетаданныеПриемника,МассивТипов, НастройкиДопИзмерений);
				 
				 ТекСоответствие = ПолучитьСинхронизированныеПодразделенияЦФО();
				 
				 ТекСтруктура = Новый Структура;
				 ТекСтруктура.Вставить("ПоляИсточника"  , ПоляИсточника);
				 ТекСтруктура.Вставить("ПоляПриемника"  , ПоляПриемника);
				 ТекСтруктура.Вставить("Соответствие"   , ТекСоответствие);
				 ТекСтруктура.Вставить("ТипСоответствия", "Фиксированное");
				 
				 ПараметрыАвтозаполнения.Вставить("СинхронизацияПодразделенийЦФО",ТекСтруктура);
		 
		 КонецЕсли; 									 
									 
		 // Фиксированные соответствия
		 Если флНастраиватьВПравилах 
			  ИЛИ ( флСтандартныйРежим И СтруктураПараметров.ПравилоЗаполнения.Использовать_Соответствие_ЦФО_Подразделения ) Тогда
			  
			 флЕстьРегистр = НЕ (Метаданные.РегистрыСведений.Найти("бит_ЦФО_Подразделения") = Неопределено);
			 
			 Если флЕстьРегистр Тогда
				 
				 МассивТипов = Новый Массив;
				 МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
				 МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));				
				 ПоляИсточника = НайтиПоляАвтозаполнения(СтруктураПараметров.МетаданныеИсточника,МассивТипов);
				 
				 // Организация должна идти последней, т.к. подразделение имеет приоритет.
				 Если ПоляИсточника.Количество()>1 Тогда
					 
					 ПервыйЭл = ПоляИсточника[0];
					 Если ПервыйЭл.Поле = "Организация" Тогда
						 
						 ПоляИсточника.Удалить(0);
						 ПоляИсточника.Добавить(ПервыйЭл);
						 
					 КонецЕсли; 
					 
				 КонецЕсли; 
				 
				 ИмяТипаЦФО = бит_ОбщегоНазначения.ПолучитьИмяТипаЦФО();
				 МассивТипов = Новый Массив;
				 МассивТипов.Добавить(Тип(ИмяТипаЦФО));
				 ПоляПриемника = НайтиПоляАвтозаполнения(СтруктураПараметров.МетаданныеПриемника,МассивТипов, НастройкиДопИзмерений);
				 
				 ТекСоответствие = ПолучитьСоответствиеПодразделенияЦФО();				 
				 
				 ТекСтруктура = Новый Структура;
				 ТекСтруктура.Вставить("ПоляИсточника"  , ПоляИсточника);
				 ТекСтруктура.Вставить("ПоляПриемника"  , ПоляПриемника);
				 ТекСтруктура.Вставить("Соответствие"   , ТекСоответствие);
				 ТекСтруктура.Вставить("ТипСоответствия", "Фиксированное");
				 
				 ПараметрыАвтозаполнения.Вставить("ЦФО_Подразделения",ТекСтруктура);
				 
			 КонецЕсли; 
			 
		 КонецЕсли;	
		 
		 Если флНастраиватьВПравилах 
			   ИЛИ ( флСтандартныйРежим И СтруктураПараметров.ПравилоЗаполнения.Использовать_Соответствие_Статьи_СтатьиРегл ) Тогда
			   
			 флЕстьРегистр = ?(НЕ Метаданные.РегистрыСведений.Найти("бит_СтатьиОборотов_СтатьиРегл") = Неопределено, Истина, Ложь);
			 
			 Если флЕстьРегистр Тогда
				 
				 МассивТипов = Новый Массив;
				 МассивТипов.Добавить(Тип("СправочникСсылка.СтатьиЗатрат"));
				 МассивТипов.Добавить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
				 МассивТипов.Добавить(Тип("СправочникСсылка.ПрочиеДоходыИРасходы"));
				 
				 ПоляИсточника = НайтиПоляАвтозаполнения(СтруктураПараметров.МетаданныеИсточника,МассивТипов);
				 
				 МассивТипов = Новый Массив;
				 МассивТипов.Добавить(Тип("СправочникСсылка.бит_СтатьиОборотов"));
				 ПоляПриемника = НайтиПоляАвтозаполнения(СтруктураПараметров.МетаданныеПриемника,МассивТипов, НастройкиДопИзмерений);
				 
				 ТекСоответствие = ПолучитьСоответствиеСтатьиРеглСтатьи();
				 
				 ТекСтруктура = Новый Структура;
				 ТекСтруктура.Вставить("ПоляИсточника"  ,  ПоляИсточника);
				 ТекСтруктура.Вставить("ПоляПриемника"  ,  ПоляПриемника);
				 ТекСтруктура.Вставить("Соответствие"   ,  ТекСоответствие);
				 ТекСтруктура.Вставить("ТипСоответствия", "Фиксированное");
				 
				 
				 ПараметрыАвтозаполнения.Вставить("Статьи_СтатьиРегл",ТекСтруктура);
				 
			 КонецЕсли; 
			 
		 КонецЕсли;
		
		 Если флНастраиватьВПравилах 
			  ИЛИ ( флСтандартныйРежим И СтруктураПараметров.ПравилоЗаполнения.Использовать_Соответствие_Статьи_НомГруппы ) Тогда
			 
			 флЕстьРегистр = ?(НЕ Метаданные.РегистрыСведений.Найти("бит_СтатьиОборотов_НоменклатурныеГруппы") = Неопределено, Истина, Ложь);
			 
			 Если флЕстьРегистр Тогда
				 
				 МассивТипов = Новый Массив;
				 МассивТипов.Добавить(Тип("СправочникСсылка.НоменклатурныеГруппы"));
				 
				 ПоляИсточника = НайтиПоляАвтозаполнения(СтруктураПараметров.МетаданныеИсточника,МассивТипов);
				 
				 МассивТипов = Новый Массив;
				 МассивТипов.Добавить(Тип("СправочникСсылка.бит_СтатьиОборотов"));
				 ПоляПриемника = НайтиПоляАвтозаполнения(СтруктураПараметров.МетаданныеПриемника,МассивТипов, НастройкиДопИзмерений);
				 
				 ТекСоответствие = ПолучитьСоответствиеНомГруппыСтатьи();
				 
				 ТекСтруктура = Новый Структура;
				 ТекСтруктура.Вставить("ПоляИсточника"  ,  ПоляИсточника);
				 ТекСтруктура.Вставить("ПоляПриемника"  ,  ПоляПриемника);
				 ТекСтруктура.Вставить("Соответствие"   ,  ТекСоответствие);
				 ТекСтруктура.Вставить("ТипСоответствия", "Фиксированное");				 
				 
				 ПараметрыАвтозаполнения.Вставить("Статьи_НоменклатурныеГруппы",ТекСтруктура);
				 
			 КонецЕсли; 
			 
		 КонецЕсли;
		 
		 // Универсальные соответствия
		 Если флНастраиватьВПравилах ИЛИ флСтандартныйРежим Тогда
			 Дополнительно = Новый Структура;
			 Дополнительно.Вставить("ПравилоЗаполнения", СтруктураПараметров.ПравилоЗаполнения);
			 Дополнительно.Вставить("Период", СтруктураПараметров.СтруктураШапкиДокумента.Дата);
			 
			 ПодготовитьПараметрыАвтозаполненияУниверсальныхСоответствий(ПараметрыАвтозаполнения, 
			 	СтруктураПараметров.МетаданныеИсточника, СтруктураПараметров.МетаданныеПриемника, 
				Дополнительно);
		 КонецЕсли; 
	 КонецЕсли;
	
	Возврат ПараметрыАвтозаполнения;
	
КонецФункции

// Процедура готовит параметры универсальных соответствий.
//
Процедура ПодготовитьПараметрыАвтозаполненияУниверсальныхСоответствий(ПараметрыАвтозаполнения, МетаданныеИсточника, 
				МетаданныеПриемника, Дополнительно)

	
	ПравилоЗаполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Дополнительно, "ПравилоЗаполнения", Неопределено);
	ИмяСоответствия	  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Дополнительно, "ИмяСоответствия", "");
	Период			  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Дополнительно, "Период", ТекущаяДатаСеанса());
	
	МаксКоличествоАналитик  = Справочники.бит_ВидыСоответствийАналитик.МаксКоличествоАналитик();
	НастройкиДопИзмеренийАн = бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений("Аналитика");
	НастройкиДопИзмерений   = бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений();
	
	Если ЗначениеЗаполнено(ПравилоЗаполнения) Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВидыСоответствийАналитик.ВидСоответствия.Приоритет КАК ВидСоответствияПриоритет,
		|	ВидыСоответствийАналитик.ВидСоответствия КАК ВидСоответствия,
		|	ВидыСоответствийАналитик.ВидСоответствия.Код КАК КодВидаСоответствия,
		|	ВидыСоответствийАналитик.ВидСоответствия.АнализироватьКорреспондирующийСчет КАК АнализироватьКорреспондирующийСчет,
		|	ВЫБОР
		|		КОГДА ВидыСоответствийАналитик.ВидСоответствия.ПрименятьПриПолномСовпаденииТипов
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ВерсияАлгоритма
		|ИЗ
		|	Справочник.бит_ПравилаЗаполненияПолейПриТрансляции.ИспользуемыеСоответствия КАК ВидыСоответствийАналитик
		|ГДЕ
		|	ВидыСоответствийАналитик.Ссылка = &ПравилоЗаполнения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидСоответствияПриоритет УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВидыСоответствийАналитик.Ссылка КАК ВидСоответствия,
		|	ВидыСоответствийАналитик.Приоритет КАК Приоритет,
		|	ВидыСоответствийАналитик.Код КАК КодВидаСоответствия,
		|	ВидыСоответствийАналитик.АнализироватьКорреспондирующийСчет КАК АнализироватьКорреспондирующийСчет,
		|	ВЫБОР
		|		КОГДА ВидыСоответствийАналитик.ПрименятьПриПолномСовпаденииТипов
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ВерсияАлгоритма
		|ИЗ
		|	Справочник.бит_ВидыСоответствийАналитик КАК ВидыСоответствийАналитик
		|ГДЕ
		|	ВидыСоответствийАналитик.Код = &ИмяСоответствия
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ИмяСоответствия", ИмяСоответствия);
	Запрос.УстановитьПараметр("ПравилоЗаполнения", ПравилоЗаполнения);
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	// Таблица аналитик
	Аналитики = Новый Запрос;
	Аналитики.Текст = 
	"ВЫБРАТЬ
	|	СоответствияАналитик.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	СоответствияАналитик.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	СоответствияАналитик.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	СоответствияАналитик.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	СоответствияАналитик.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	СоответствияАналитик.ПраваяАналитика_3 КАК ПраваяАналитика_3,
	|	СоответствияАналитик.ВидСоответствия.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.бит_СоответствияАналитик.СрезПоследних(&Период, ВидСоответствия = &ВидСоответствия) КАК СоответствияАналитик
	|ГДЕ
	|	СоответствияАналитик.Используется";
	
	Пока Выборка.Следующий() Цикл
		
		ВидСоответствия = Выборка.ВидСоответствия;
		ПоляИсточника   = Новый Структура;
		ПоляПриемника   = Новый Массив;
		
		Для й = 1 По МаксКоличествоАналитик Цикл
			
			// Определим имена левых аналитик
			ИмяАналитики = "ЛеваяАналитика_"+й;
			ТекАналитика = ВидСоответствия[ИмяАналитики];
			ПодготовитьСтруктуруПолейУниверсальногоСоответствия(ТекАналитика, ИмяАналитики, ПоляИсточника, МетаданныеИсточника, НастройкиДопИзмеренийАн);
			
			// Определим имена правых аналитик
			ИмяАналитики = "ПраваяАналитика_" + й;
			ТекАналитика = ВидСоответствия[ИмяАналитики];
			ПодготовитьМассивПолейУниверсальногоСоответствия(ТекАналитика, ИмяАналитики, ПоляПриемника, МетаданныеПриемника, НастройкиДопИзмерений);
		КонецЦикла;
		
		// Таблица аналитик
		Аналитики.УстановитьПараметр("ВидСоответствия", ВидСоответствия);
		Аналитики.УстановитьПараметр("Период", 			Период);
		Результат = Аналитики.Выполнить();
		
		ТекСтруктура = Новый Структура;
		ТекСтруктура.Вставить("ПоляИсточника"  , ПоляИсточника);
		ТекСтруктура.Вставить("ПоляПриемника"  , ПоляПриемника);
		ТекСтруктура.Вставить("Соответствие"   , СортированнаяТаблицаРегистраСоответствияАналитик(Результат.Выгрузить()));
		ТекСтруктура.Вставить("ТипСоответствия", "Универсальное");
		ТекСтруктура.Вставить("ВерсияАлгоритма", Выборка.ВерсияАлгоритма);
		ТекСтруктура.Вставить("АнализироватьКорреспондирующийСчет", Выборка.АнализироватьКорреспондирующийСчет);
		
		ПараметрыАвтозаполнения.Вставить(Выборка.КодВидаСоответствия, ТекСтруктура);
		
	КонецЦикла; // По видам соответствий

КонецПроцедуры

// Сортирует выборку из регистра "бит_СоответствияАналитик" так,
// что бы снача шли строки, где аналитики заполненны.
// Потому что, в последствии берется первая строка результата поиска.
//
Функция СортированнаяТаблицаРегистраСоответствияАналитик(ТаблицаРегистра)

	ТаблицаРегистра.Колонки.Добавить("Вес", ОбщегоНазначения.ОписаниеТипаЧисло(4));
	Для каждого СтрокаТаблицы Из ТаблицаРегистра Цикл
		Вес = 0;
		Для Индекс = 1 По 3 Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы["ЛеваяАналитика_" + Индекс]) Тогда
				Вес = Вес + 1;
			КонецЕсли; 
		КонецЦикла; 
		СтрокаТаблицы.Вес = Вес;
	КонецЦикла;
	
	// АПК:1297-выкл Установка полей сортировки.
	ТаблицаРегистра.Сортировать("Вес убыв");
	// АПК:1297-вкл
	
	Возврат ТаблицаРегистра;
	
КонецФункции

// Функция выполняет поиск полей, для сервиса автозаполнени по соответсвиям .
// 
// Параметры:
//  МетаданныеРегистра  - ОбъектМетаданных.
//  МассивТипов         - Массив.
// 
// Возвращаемое значение:
//   Поля   - Массив.
// 
Функция НайтиПоляАвтозаполнения(МетаданныеРегистра,МассивТипов, НастройкиДопИзмерений = Неопределено
								// Изменения кода. Начало: 24.11.2016  {{ 
								, ТекАналитика = Неопределено)
								// Изменения кода. Конец 24.11.2016  }} 
	
	Поля = Новый Массив;
	
	МассивКоллекций = Новый Массив;
	МассивКоллекций.Добавить("Измерения");
	МассивКоллекций.Добавить("Реквизиты");
	
	ЭтоРегистрБухгалтерии = бит_ОбщегоНазначения.ОбъектПринадлежитКоллекцииМетаданных("РегистрыБухгалтерии",МетаданныеРегистра.Имя);

	ОписаниеКонтроль = Новый ОписаниеТипов(МассивТипов);
	
	Для каждого ИмяКоллекции Из МассивКоллекций Цикл
		
		Для каждого МетаЭлемент Из МетаданныеРегистра[ИмяКоллекции] Цикл
			
			ТекМассивТипов = Новый Массив;
			Если Найти(МетаЭлемент.Имя, "Аналитика_") > 0 
				И НЕ НастройкиДопИзмерений = Неопределено Тогда
				
				ТекНастройка = НастройкиДопИзмерений[МетаЭлемент.Имя];
				
				Если НЕ ТекНастройка = Неопределено Тогда
					
					// Добавление кода. Начало: 24.11.2016  {{
					Если НЕ ТекАналитика = Неопределено Тогда
						Если ТекНастройка.Аналитика = ТекАналитика Тогда
														
							Если ЭтоРегистрБухгалтерии И ИмяКоллекции = "Измерения" Тогда
								флУчитыватьКорр = НЕ МетаЭлемент.Балансовый;
							Иначе
								флУчитыватьКорр = Ложь;
							КонецЕсли; 
							
							ИмяПоля = МетаЭлемент.Имя;					
							
							СтруктураПоля = КонструкторСтруктурыКлючей(ИмяПоля,флУчитыватьКорр,Ложь);
							Поля.Добавить(СтруктураПоля);
							
							// Все нашлось по прямой ссылке
							Прервать;
						Иначе
							Продолжить;
						КонецЕсли;
					КонецЕсли; 
					// Добавление кода конец }} 
					
					ТекМассивТипов = ТекНастройка.ТипЗначения.Типы();
					
				КонецЕсли; 
				
			Иначе	
				
				ТекМассивТипов = МетаЭлемент.Тип.Типы();
				
			КонецЕсли; 
			
			Для каждого Элемент Из ТекМассивТипов Цикл
				
				Если ОписаниеКонтроль.СодержитТип(Элемент) Тогда
					
					Если ЭтоРегистрБухгалтерии И ИмяКоллекции = "Измерения" Тогда
						
						флУчитыватьКорр = НЕ МетаЭлемент.Балансовый;
						
					Иначе
						
						флУчитыватьКорр = Ложь;
						
					КонецЕсли; 
					
					ИмяПоля = МетаЭлемент.Имя;					
					
					СтруктураПоля = КонструкторСтруктурыКлючей(ИмяПоля,флУчитыватьКорр,Ложь);
					Поля.Добавить(СтруктураПоля);
					Прервать;
					
				КонецЕсли; 
				
			КонецЦикла; // По типам 
			
		КонецЦикла; // По метаданным
		
	КонецЦикла; // По массиву коллекций
	
	
	Если ЭтоРегистрБухгалтерии Тогда
	
		 ИмяПВХ = МетаданныеРегистра.ПланСчетов.ВидыСубконто.Имя;
		 
		 ВыборкаПВХ = ПланыВидовХарактеристик[ИмяПВХ].Выбрать();
		 
		 Пока ВыборкаПВХ.Следующий() Цикл
		 
		 	ТекМассивТипов = ВыборкаПВХ.ТипЗначения.Типы();
		    Для каждого Элемент Из ТекМассивТипов Цикл
			
				Если ОписаниеКонтроль.СодержитТип(Элемент) Тогда
					
					 СтруктураПоля = КонструкторСтруктурыКлючей(ВыборкаПВХ.Ссылка,МетаданныеРегистра.Корреспонденция,Истина);								 
					 Поля.Добавить(СтруктураПоля);
					 Прервать;
				
				КонецЕсли; 
			
			КонецЦикла; 
		 
		 КонецЦикла; 
		 
		 ТипПС = Тип("ПланСчетовСсылка."+МетаданныеРегистра.ПланСчетов.Имя);
		 
		 Если ОписаниеКонтроль.СодержитТип(ТипПС) Тогда
			 
			 СтруктураПоля = КонструкторСтруктурыКлючей("Счет",МетаданныеРегистра.Корреспонденция, Ложь);								 
			 Поля.Добавить(СтруктураПоля);
			 
		 КонецЕсли; 
		 
	КонецЕсли; 
	
	Возврат Поля;
	
КонецФункции // НайтиПолеПоТипу()

// Функция возвращает структуру, описывающей поле. Используется при 
// формировани информации для сервиса автозаполнения аналитик по соответствиям.
// 
// Параметры:
//  Поле  - Строка, ПланВидовХарактеристикСсылка.
//  УчитыватьКорр  - Булево.
//  ЭтоСубконто - Булево.
// 
// Возвращаемое значение:
//   СтруктураПоля   - Структура.
// 
Функция КонструкторСтруктурыКлючей(Поле,УчитыватьКорр,ЭтоСубконто)
	
	СтруктураПоля = Новый Структура("Поле,УчитыватьКорр,ЭтоСубконто"
									,Поле
									,УчитыватьКорр
									,ЭтоСубконто);
	
	Возврат СтруктураПоля;
	
КонецФункции // КонструкторСтруктурыКлючей()

// Процедура заполняет по соответствиям Подразделения-ЦФО, 
// СтатьяРегл-Статья, НомГруппа-Статья поля применика.
// 
// Параметры:
//  ЗаписьИсточник  - РегистрНакопления.НаборЗаписей,РегистрБухгалтерии.НаборЗаписей.
//  ЗаписьПриемник  - РегистрНакопления.НаборЗаписей,РегистрБухгалтерии.НаборЗаписей.
//  ПараметрыАвтозаполнения - Структура.
//  ВидыРегистров           - Структура.
//  ИмяСоответствия         - Строка.
// 
Процедура Подключаемый_ЗаполнитьПоСоответствию(ЗаписьИсточник, ЗаписьПриемник, ПараметрыАвтозаполнения, ВидыРегистров, ИмяСоответствия, Период = '0001-01-01')
	
	// ВАЖНО. Может подключаться в текст кода. 
	// См. Спр. бит_ПравилаТрансляции.МодульОбъекта.СформироватьКодУстановкиЗначенийПоКолонке().
	Если ПараметрыАвтозаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Период = '0001-01-01' Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
		
	ТекПараметры = Неопределено;
	ПараметрыАвтозаполнения.Свойство(ИмяСоответствия, ТекПараметры);
	
	// В режиме использования соответствий в правилах трансляции готовим соответствие при первом вызове.
	Если ТекПараметры = Неопределено 
		И ВидыРегистров.РежимИспользованияСоответствий = Перечисления.бит_РежимыИспользованияСоответствийПриТрансляции.ВПравилахТрансляции Тогда
		
		Дополнительно = Новый Структура; 
		Дополнительно.Вставить("ИмяСоответствия", ИмяСоответствия);
		Дополнительно.Вставить("Период", Период);
		
		ПодготовитьПараметрыАвтозаполненияУниверсальныхСоответствий(ПараметрыАвтозаполнения, 
			ВидыРегистров.МетаданныеИсточника, ВидыРегистров.МетаданныеПриемника, Дополнительно);
		
		ПараметрыАвтозаполнения.Свойство(ИмяСоответствия, ТекПараметры);
	КонецЕсли; 
	
	Если ТекПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ПоляИсточникаАвтозаполнение = ТекПараметры.ПоляИсточника;
	ПоляПриемникаАвтозаполнение = ТекПараметры.ПоляПриемника;
	СоотвАвтозаполнения         = ТекПараметры.Соответствие;
	ТипСоответствия             = ТекПараметры.ТипСоответствия;
	
	Если ВРег(ТипСоответствия) = ВРег("Фиксированное") Тогда
		
		// Определим ключевые значение источника, по которым будут извлекаться из соответствий значения для заполнения.
		ЗначенияИсточник = Новый Структура("Дт,Кт");
		
		Для каждого СтрПоляИсточник Из ПоляИсточникаАвтозаполнение Цикл
			Если СтрПоляИсточник.ЭтоСубконто Тогда
				ЗначенияИсточник.Дт = ЗначениеСубконто(ЗаписьИсточник,"Дт",СтрПоляИсточник.Поле);
				ЗначенияИсточник.Кт = ЗначениеСубконто(ЗаписьИсточник,"Кт",СтрПоляИсточник.Поле);
			Иначе
				Если СтрПоляИсточник.УчитыватьКорр Тогда
					ЗначенияИсточник.Дт = ЗаписьИсточник[СтрПоляИсточник.Поле+"Дт"];
					ЗначенияИсточник.Кт = ЗаписьИсточник[СтрПоляИсточник.Поле+"Кт"];						  
				Иначе	
					ЗначенияИсточник.Дт = ЗаписьИсточник[СтрПоляИсточник.Поле];
				КонецЕсли; 
			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(ЗначенияИсточник.Кт) Тогда
				ЗначенияИсточник.Кт = ЗначенияИсточник.Дт;
			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(ЗначенияИсточник.Дт) 
				И ЗначениеЗаполнено(ЗначенияИсточник.Кт) Тогда
				
				ЗначенияИсточник.Дт = ЗначенияИсточник.Кт;
			КонецЕсли; 
			
			// Значения для заполнения из соответствий
			ЗначенияСоотв = Новый Структура("Дт,Кт");
			
			Если ВидыРегистров.ИсточникРегистрБухгалтерии Тогда
				Если СтрПоляИсточник.УчитыватьКорр Тогда
					СчетПоискаДт = ЗаписьИсточник.СчетДт;
					СчетПоискаКт = ЗаписьИсточник.СчетКт;
				Иначе	
					СчетПоискаДт = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
					СчетПоискаКт = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
				КонецЕсли; 
			Иначе	
				СчетПоискаДт = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
				СчетПоискаКт = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			КонецЕсли; 
			
			ЗначенияСоотв.Дт = ИзвлечьИзСоответствия(ЗначенияИсточник.Дт, СчетПоискаДт, СоотвАвтозаполнения);
			ЗначенияСоотв.Кт = ИзвлечьИзСоответствия(ЗначенияИсточник.Кт, СчетПоискаКт, СоотвАвтозаполнения);
			
			// Заполнение значений
			Для каждого СтрПоляПриемник Из ПоляПриемникаАвтозаполнение Цикл
				
				Если СтрПоляПриемник.УчитыватьКорр ИЛИ СтрПоляПриемник.ЭтоСубконто Тогда
					ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,СтрПоляПриемник,ЗначенияСоотв,"Дт",ВидыРегистров.ПриемникРегистрБухгалтерии);
					ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,СтрПоляПриемник,ЗначенияСоотв,"Кт",ВидыРегистров.ПриемникРегистрБухгалтерии);
				Иначе	
					ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,СтрПоляПриемник,ЗначенияСоотв,"Дт",ВидыРегистров.ПриемникРегистрБухгалтерии);
					ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,СтрПоляПриемник,ЗначенияСоотв,"Кт",ВидыРегистров.ПриемникРегистрБухгалтерии);				
				КонецЕсли; 
			КонецЦикла; // Полям приемника к автозаполнению
		КонецЦикла; // По полям источника
	КонецЕсли; // Фиксированное соответствие
	
	Если ВРег(ТипСоответствия) = ВРег("Универсальное") Тогда
		Если ТекПараметры.ВерсияАлгоритма = 2 Тогда
			ЗаполнитьПоУниверсальномуСоответствиюВерсия2(ВидыРегистров, ЗаписьИсточник, ЗаписьПриемник, 
				ПоляИсточникаАвтозаполнение, ПоляПриемникаАвтозаполнение, СоотвАвтозаполнения, ТекПараметры.АнализироватьКорреспондирующийСчет);
		Иначе	
			ЗаполнитьПоУниверсальномуСоответствиюВерсия1(ВидыРегистров, ЗаписьИсточник, ЗаписьПриемник, 
				ПоляИсточникаАвтозаполнение, ПоляПриемникаАвтозаполнение, СоотвАвтозаполнения);
		КонецЕсли; 
	КонецЕсли;
		
КонецПроцедуры

// Устарела. Следует использовать бит_МеханизмТрансляции.Подключаемый_ЗаполнитьПоСоответствию(). 
// Оставлен для совместимости с существующими настройками трансляции.
//
Процедура ЗаполнитьПоСоответствию(ЗаписьИсточник, ЗаписьПриемник, ПараметрыАвтозаполнения, ВидыРегистров, ИмяСоответствия, Период = '0001-01-01')

	// ВАЖНО. Может подключаться в текст кода. 
	// См. Спр.бит_ПравилаТрансляции.МодульОбъекта.СформироватьКодУстановкиЗначенийПоКолонке().
	Подключаемый_ЗаполнитьПоСоответствию(ЗаписьИсточник, ЗаписьПриемник, ПараметрыАвтозаполнения, ВидыРегистров, ИмяСоответствия, Период);
		
КонецПроцедуры

Процедура ЗаполнитьПоУниверсальномуСоответствиюВерсия1(Знач ВидыРегистров,
	                                                   Знач ЗаписьИсточник, 
													   Знач ЗаписьПриемник, 
													   Знач ПоляИсточникаАвтозаполнение, 
													   Знач ПоляПриемникаАвтозаполнение, 
													   Знач СоотвАвтозаполнения)
	
	Перем ЗначенияСоотв, ИмяКолонкиТаблицыАналитик, КиЗ, НайденныеСтроки, ОтборДт, ОтборКт, ПерваяСтрока, ПолеИсточника, ПолеПриемник, ТекЗначение;
	
	ОтборДт = Новый Структура;
	ОтборКт = Новый Структура;
	
	Для каждого КиЗ Из ПоляИсточникаАвтозаполнение Цикл
		
		ИмяКолонкиТаблицыАналитик = КиЗ.Ключ;
		ПолеИсточника = КиЗ.Значение;
		
		Если ПолеИсточника.ЭтоСубконто Тогда
			
			ТекЗначение = ЗначениеСубконто(ЗаписьИсточник,"Дт",ПолеИсточника.Поле);
			Если ЗначениеЗаполнено(ТекЗначение) Тогда
				ОтборДт.Вставить(ИмяКолонкиТаблицыАналитик, ТекЗначение);
			КонецЕсли; 
			
			ТекЗначение = ЗначениеСубконто(ЗаписьИсточник,"Кт",ПолеИсточника.Поле);
			Если ЗначениеЗаполнено(ТекЗначение) Тогда
				ОтборКт.Вставить(ИмяКолонкиТаблицыАналитик, ТекЗначение);
			КонецЕсли; 
		Иначе
			
			Если ПолеИсточника.УчитыватьКорр Тогда
				ТекЗначение = ЗаписьИсточник[ПолеИсточника.Поле+"Дт"];
				Если ЗначениеЗаполнено(ТекЗначение) Тогда
					ОтборДт.Вставить(ИмяКолонкиТаблицыАналитик, ТекЗначение);
				КонецЕсли; 
				
				ТекЗначение = ЗаписьИсточник[ПолеИсточника.Поле+"Кт"];
				Если ЗначениеЗаполнено(ТекЗначение) Тогда
					ОтборКт.Вставить(ИмяКолонкиТаблицыАналитик, ТекЗначение);
				КонецЕсли; 
			Иначе	
				
				ТекЗначение = ЗаписьИсточник[ПолеИсточника.Поле];
				Если ЗначениеЗаполнено(ТекЗначение) Тогда
					ОтборДт.Вставить(ИмяКолонкиТаблицыАналитик, ТекЗначение);
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	Если ОтборДт.Количество() > 0 Тогда
		
		НайденныеСтроки = СоотвАвтозаполнения.НайтиСтроки(ОтборДт);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ПерваяСтрока = НайденныеСтроки[0];
			
			Для каждого ПолеПриемник Из ПоляПриемникаАвтозаполнение Цикл
				
				ИмяКолонкиТаблицыАналитик = ПолеПриемник.ИмяКолонкиТаблицыАналитик;
				ТекЗначение  = ПерваяСтрока[ИмяКолонкиТаблицыАналитик];
				Если ЗначениеЗаполнено(ТекЗначение) Тогда
					
					ЗначенияСоотв = Новый Структура("Дт", ТекЗначение);
					ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,ПолеПриемник,ЗначенияСоотв,"Дт",ВидыРегистров.ПриемникРегистрБухгалтерии);
					Если ПолеПриемник.УчитыватьКорр ИЛИ ПолеПриемник.ЭтоСубконто Тогда
						
						ЗначенияСоотв = Новый Структура("Кт", ТекЗначение);
						ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,ПолеПриемник,ЗначенияСоотв,"Кт",ВидыРегистров.ПриемникРегистрБухгалтерии);
						
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;  // Есть отбор ДТ
	
	Если ОтборКт.Количество() > 0 Тогда
		
		НайденныеСтроки = СоотвАвтозаполнения.НайтиСтроки(ОтборКт);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ПерваяСтрока = НайденныеСтроки[0];
			
			Для каждого ПолеПриемник Из ПоляПриемникаАвтозаполнение Цикл
				
				ИмяКолонкиТаблицыАналитик = ПолеПриемник.ИмяКолонкиТаблицыАналитик;
				ТекЗначение  = ПерваяСтрока[ИмяКолонкиТаблицыАналитик];
				Если ЗначениеЗаполнено(ТекЗначение) Тогда
					
					ЗначенияСоотв = Новый Структура("Кт", ТекЗначение);
					ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,ПолеПриемник,ЗначенияСоотв,"Кт",ВидыРегистров.ПриемникРегистрБухгалтерии);
					Если ПолеПриемник.УчитыватьКорр ИЛИ ПолеПриемник.ЭтоСубконто Тогда
						ЗначенияСоотв = Новый Структура("Дт", ТекЗначение);							
						ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,ПолеПриемник,ЗначенияСоотв,"Дт",ВидыРегистров.ПриемникРегистрБухгалтерии);
					КонецЕсли;	
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;  // Есть отбор КТ

КонецПроцедуры

Процедура ЗаполнитьПоУниверсальномуСоответствиюВерсия2(Знач ВидыРегистров,
	                                                   Знач ЗаписьИсточник, 
													   Знач ЗаписьПриемник, 
													   Знач ПоляИсточникаАвтозаполнение, 
													   Знач ПоляПриемникаАвтозаполнение, 
													   Знач СоотвАвтозаполнения,
													   АнализироватьКорреспондирующийСчет)
	
	Перем ЗначенияСоотв, ИмяКолонкиТаблицыАналитик, КиЗ, ОбрабатыватьДт, ОбрабатыватьКт, ОтборДт, ОтборКт, ПолеИсточника, ПолеПриемник, СтрокаСоответствия, ТекЗначение;
	
	ОтборДт = Новый Структура;
	ОтборКт = Новый Структура;
	
	ОбрабатыватьДт = Истина;
	ОбрабатыватьКт = Истина;
	
	Для каждого КиЗ Из ПоляИсточникаАвтозаполнение Цикл
		
		ИмяКолонкиТаблицыАналитик = КиЗ.Ключ;
		ПолеИсточника = КиЗ.Значение;
		
		Если ПолеИсточника.ЭтоСубконто Тогда
			Если АнализироватьКорреспондирующийСчет Тогда
				
				ТекЗначение = ЗначениеСубконто(ЗаписьИсточник,"Дт",ПолеИсточника.Поле);
				Если ЗначениеЗаполнено(ТекЗначение) Тогда 
				    ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборДт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьДт);
					ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборКт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьКт);
				Иначе
					ТекЗначение = ЗначениеСубконто(ЗаписьИсточник,"Кт",ПолеИсточника.Поле);
					ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборДт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьДт);
					ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборКт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьКт);
				КонецЕсли;
				
			Иначе
				
				ТекЗначение = ЗначениеСубконто(ЗаписьИсточник,"Дт",ПолеИсточника.Поле);
				ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборДт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьДт);
				
				ТекЗначение = ЗначениеСубконто(ЗаписьИсточник,"Кт",ПолеИсточника.Поле);
				ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборКт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьКт);
				
			КонецЕсли; 
			
		Иначе				
			Если ПолеИсточника.УчитыватьКорр Тогда
				
				Если АнализироватьКорреспондирующийСчет Тогда
					
					ТекЗначение = ЗаписьИсточник[ПолеИсточника.Поле+"Дт"];
					Если ЗначениеЗаполнено(ТекЗначение) Тогда
						ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборДт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьДт);
						ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборКт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьКт);
					Иначе
						ТекЗначение = ЗаписьИсточник[ПолеИсточника.Поле+"Кт"];
					    ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборДт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьДт);
						ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборКт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьКт);
					КонецЕсли; 
					
				Иначе
					
					ТекЗначение = ЗаписьИсточник[ПолеИсточника.Поле+"Дт"];
					ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборДт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьДт);
					
					ТекЗначение = ЗаписьИсточник[ПолеИсточника.Поле+"Кт"];
					ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборКт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьКт);
					
				КонецЕсли;
			Иначе	
				ТекЗначение = ЗаписьИсточник[ПолеИсточника.Поле];
				ДобавитьЭлементОтбораСоответствияАвтозаполнения(ОтборДт, ТекЗначение, ИмяКолонкиТаблицыАналитик, ОбрабатыватьДт);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	Если ОбрабатыватьДт Тогда
		
		СтрокаСоответствия = СтрокиСоответствияАвтозаполнения(СоотвАвтозаполнения, ОтборДт);
		Если СтрокаСоответствия <> Неопределено Тогда
			Для каждого ПолеПриемник Из ПоляПриемникаАвтозаполнение Цикл
				ИмяКолонкиТаблицыАналитик = ПолеПриемник.ИмяКолонкиТаблицыАналитик;
				ТекЗначение  = СтрокаСоответствия[ИмяКолонкиТаблицыАналитик];
				Если ЗначениеЗаполнено(ТекЗначение) Тогда
					ЗначенияСоотв = Новый Структура("Дт", ТекЗначение);
					ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,ПолеПриемник,ЗначенияСоотв,"Дт",ВидыРегистров.ПриемникРегистрБухгалтерии);
					Если ПолеПриемник.УчитыватьКорр ИЛИ ПолеПриемник.ЭтоСубконто Тогда
						ЗначенияСоотв = Новый Структура("Кт", ТекЗначение);
						ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,ПолеПриемник,ЗначенияСоотв,"Кт",ВидыРегистров.ПриемникРегистрБухгалтерии);
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;
	
	Если ОбрабатыватьКт Тогда
		СтрокаСоответствия = СтрокиСоответствияАвтозаполнения(СоотвАвтозаполнения, ОтборКт);
		Если СтрокаСоответствия <> Неопределено Тогда
			Для каждого ПолеПриемник Из ПоляПриемникаАвтозаполнение Цикл
				
				ИмяКолонкиТаблицыАналитик = ПолеПриемник.ИмяКолонкиТаблицыАналитик;
				ТекЗначение  = СтрокаСоответствия[ИмяКолонкиТаблицыАналитик];
				Если ЗначениеЗаполнено(ТекЗначение) Тогда
					
					ЗначенияСоотв = Новый Структура("Кт", ТекЗначение);
					ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,ПолеПриемник,ЗначенияСоотв,"Кт",ВидыРегистров.ПриемникРегистрБухгалтерии);
					Если ПолеПриемник.УчитыватьКорр ИЛИ ПолеПриемник.ЭтоСубконто Тогда
						ЗначенияСоотв = Новый Структура("Дт", ТекЗначение);							
						ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,ПолеПриемник,ЗначенияСоотв,"Дт",ВидыРегистров.ПриемникРегистрБухгалтерии);
					КонецЕсли;	
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;  // Есть отбор КТ

КонецПроцедуры

Функция СтрокиСоответствияАвтозаполнения(Таблица, Отбор)

	СтрокаСоответствия = Неопределено; 
	Для каждого СтрокаТаблицы Из Таблица Цикл
		РезультатСравнения = Истина;
		Для каждого ЭлементОтбора Из Отбор Цикл
			ЗначениеПоля = СтрокаТаблицы[ЭлементОтбора.Ключ];
			// Здесь: ЗначениеПоля - левое значение соотвествия автозаполнения.
			// Поиск прерывается по первому совпадению ЗначениеПоля и значения элемента отбора.
			// Пустое значение ЗначениеПоля игнорируется, т.к. интерпретируется как "любое значение".
			Если ЗначениеЗаполнено(ЗначениеПоля) И ЗначениеПоля <> ЭлементОтбора.Значение Тогда
				РезультатСравнения = Ложь;
				Прервать; // Дальнейшее сравнение по этому отбору бессмыслено. 
			КонецЕсли; 
		КонецЦикла; 
		Если РезультатСравнения Тогда
			СтрокаСоответствия = СтрокаТаблицы;
			Прервать; // Нашли первую строку, удовлетворяющую отбору.
		КонецЕсли; 
	КонецЦикла; 	

	Возврат СтрокаСоответствия;
	
КонецФункции

Процедура ДобавитьЭлементОтбораСоответствияАвтозаполнения(Отбор, Значение, Имя, Использование)
	
	Если Значение = NULL ИЛИ Значение = Неопределено Тогда
		Использование = Ложь;
	Иначе
		Отбор.Вставить(Имя, Значение);
	КонецЕсли; 
	
КонецПроцедуры
 
// Процедура заполняет по соответствиям Подразделения-ЦФО, 
// СтатьяРегл-Статья, НомГруппа-Статья поля применика.
// 
// Параметры:
//  ЗаписьИсточник  - РегистрНакопления.НаборЗаписей,РегистрБухгалтерии.НаборЗаписей.
//  ЗаписьПриемник  - РегистрНакопления.НаборЗаписей,РегистрБухгалтерии.НаборЗаписей.
//  ПараметрыАвтозаполнения - Структура.
//  ВидыРегистров           - Структура.
// 
Процедура ЗаполнитьПоСоответствиям(ЗаписьИсточник, ЗаписьПриемник, ПараметрыАвтозаполнения, ВидыРегистров, Период)
	
	Если ПараметрыАвтозаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли; 
		
	Для каждого КиЗ Из ПараметрыАвтозаполнения Цикл
		Подключаемый_ЗаполнитьПоСоответствию(ЗаписьИсточник, ЗаписьПриемник, ПараметрыАвтозаполнения, ВидыРегистров, КиЗ.Ключ, Период);
	КонецЦикла;	
	
КонецПроцедуры

// Процедура заполняет поля и субконто приемника значениями, полученными из соответствий.
// 
// Параметры:
//  ЗаписьПриемник  - РегистрНакопленияНаборЗаписей. 
//  СтрПоля         - Структура.
//  ЗначенияСоотв   - Структура.
//  ДтКт            - Строка.
//  ПриемникРегистрБухгалтерии - Булево.
// 
Процедура ЗаполнитьПолеПоСоответствию(ЗаписьПриемник,СтрПоля,ЗначенияСоотв,ДтКт,ПриемникРегистрБухгалтерии)

	// Значение, которым будем заполнять поля приемника.
	ЗначениеЗаполнения = ЗначенияСоотв[ДтКт];
	
	Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
		Если СтрПоля.ЭтоСубконто Тогда
			// Заполнение субконто - если оно пустое
			ТекЗначение = ЗначениеСубконто(ЗаписьПриемник,ДтКт,СтрПоля.Поле);
			Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
				ИмяПоляСчет      = "Счет"+ДтКт;
				ИмяВидовСубконто = "Субконто"+ДтКт;
				УстановитьСубконто(ЗаписьПриемник[ИмяПоляСчет],ЗаписьПриемник[ИмяВидовСубконто],СтрПоля.Поле,ЗначениеЗаполнения);
			КонецЕсли; 
		Иначе	
			
			Если СтрПоля.УчитыватьКорр Тогда
				// Заполнение не балансового поля регистра бухгалтерии, если оно пустое.
				ИмяПоля = СтрПоля.Поле+ДтКт;
				ТекЗначение = ЗаписьПриемник[ИмяПоля];
				Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
					ЗаписьПриемник[ИмяПоля] = ЗначениеЗаполнения;
				КонецЕсли; 
			Иначе	
				// Заполнение поля, если оно пустое
				ТекЗначение = ЗаписьПриемник[СтрПоля.Поле];
				Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
					ЗаписьПриемник[СтрПоля.Поле] = ЗначениеЗаполнения;
				КонецЕсли; 
			КонецЕсли; // Балансовый
		КонецЕсли; // ЭтоСубконто
	КонецЕсли; // Значение к заполнению не пустое

КонецПроцедуры

// Процедура добавляет сообщение в текстовый протокол.
// 
// Параметры:
//  Протокол  	   - Строка.
//  ТекстСообщения - Строка.
// 
Процедура ДобавитьСообщениеВПротокол(Протокол, ТекстСообщения, ВестиПротокол = Истина)

	Если ВестиПротокол Тогда
		
		Протокол = Протокол + ?(ПустаяСтрока(Протокол), "", Символы.ПС) + ТекстСообщения;
		
	КонецЕсли; 

КонецПроцедуры // ДобавитьСообщениеВПротокол()

// Процедура обрабатывает ошибки трансляции. 
// Возможно открытие формы для отладки ошибок трансляции.
// 
// Параметры:
//  Ошибки  - МассивОшибок.
//  СтруктураПараметров  - Структура.
//  Протокол - Строка.
// 
Процедура ОбработатьОшибки(Ошибки,СтруктураПараметров,Протокол)
	
	Заголовок = НСтр("ru='Трансляция движений документа: %1';en='Трансляция движений документа: %1'");
	Заголовок = СтрШаблон(Заголовок, СтруктураПараметров.ТранслируемыйДокумент);
		
	инд = 0;
	Для каждого ПараметрыОшибки Из Ошибки Цикл
		
		ТекстСообщения = НСтр("ru='Не удалось выполнить обработчик ""%1"" по причине: %2';
							  |en='Failed to run the processor ""%1"" because: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения,ПараметрыОшибки.ИмяОбработчика, ПараметрыОшибки.ОписаниеОшибки);			
		ДобавитьСообщениеВПротокол(Протокол, ТекстСообщения, СтруктураПараметров.ВестиПротокол);
		
		Если НЕ ПустаяСтрока(Заголовок) Тогда
			ОбщегоНазначения.СообщитьПользователю(Заголовок);
			Заголовок = "";		
		КонецЕсли; 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		
		инд = инд+1;
	КонецЦикла; 
		
КонецПроцедуры

// Функция создает структуру параметров, передающую информацию об ошибке.
// 
// Возвращаемое значение:
//   ПараметрыОшибки   - Структура.
// 
Функция КонструкторПараметрыОшибки(ИмяОбработчика = "",ОписаниеОшибки = "")
	
	ПараметрыОшибки = Новый Структура();
	
	ПараметрыОшибки.Вставить("ИмяОбработчика"       ,ИмяОбработчика);
	ПараметрыОшибки.Вставить("ОписаниеОшибки"       ,ОписаниеОшибки);
	
	Возврат ПараметрыОшибки;
	
КонецФункции // КонструкторПараметрыОшибки()

// Процедура заполняет измерения, соответствующие субконто в регистре соответствий обротов.
// 
// Параметры:
//  ЗаписьСоответствиеОб - РегистрНакопленияЗапись.бит_СоответствиеОборотовТрансляции.
//  Запись - РегистрБухгалтерииЗапись.
//  ДтКт - Строка.
//  НачалоИмениИзмерения - Строка.
//  МаксКоличествоСубконто - Число.
// 
Процедура ЗаполнитьСубконтоДляСоответствия(ЗаписьСоответствиеОб, Запись, ДтКт, НачалоИмениИзмерения, МаксКоличествоСубконто)
	
	// Изменение кода. Начало. 25.04.2016{{
	ИмяСчета = "Счет"+ДтКт;
	ТекСчет = Запись[ИмяСчета];
    
    СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекСчет);	
	КоличествоСубконто = СвСч.КоличествоСубконто;
    
	ИмяПланаСчетов = ТекСчет.Метаданные().Имя;
		
	Для НомСубк = 1 По МаксКоличествоСубконто Цикл
		
		Если НомСубк > КоличествоСубконто Тогда 		
			Продолжить; 		
		КонецЕсли; 
		 
		ТекСубконто = ТекСчет.ВидыСубконто[НомСубк - 1];
		
		Если ИмяПланаСчетов <> "бит_Бюджетирование" Тогда
			
			Если НЕ ТекСубконто.Суммовой Тогда				
				Продолжить; 				
			КонецЕсли;
			
		КонецЕсли; 
			
		ИмяИзмерения = НачалоИмениИзмерения + ДтКт + НомСубк;
        
        // Изменение кода. Начало. 10.12.2018{{ BF-2728
        ТипСубконто = СвСч["ВидСубконто" + НомСубк + "ТипЗначения"];
        ЗаписьСоответствиеОб[ИмяИзмерения] = ТипСубконто.ПривестиЗначение(ЗначениеСубконто(Запись, ДтКт, НомСубк));        
		// Изменение кода. Конец. 10.12.2018}}
        
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьСубконтоДляСоответствия()

// Восстанавливает сохраненный набор записей при ручном редактировании фатических данных "Обороты по бюджетам".
//
// Параметры:
//  Источник			 - ДокументОбъект .
//  НаборПриемник		 - Набор записей регистра приемника трансляции .
//  СтруктураПараметров	 - Структура .
//  Протокол			 - Строка .
//  флЕстьОшибки		 - Булево .
//
Процедура ТрансляцияПриПроведенииЕстьРучноеРедактированиеФакта(Источник, НаборПриемник, СтруктураПараметров, Протокол = "", флЕстьОшибки = Ложь)
	
	// Для совместимости с БП, КОРП.	
	 
КонецПроцедуры // бит_ОбработкаПроведенияТрансляцияОбработкаПроведения()

Функция ЕстьРучноеРедактированиеФакта(Объект)

	// Для совместимости с БП, КОРП.
	Возврат Ложь;
	
КонецФункции
 
Процедура ПриОтказеОтТрансляцииПриПроведении(Объект, ЗаписыватьДвижения)
	
	ПараметрыПередачи = Объект.ДополнительныеСвойства.ПараметрыРучногоРедактированияФакта;
	НаборСоответствие = ПараметрыПередачи.бит_СоответствиеЗаписейТрансляции;
	НаборОбороты      = ПараметрыПередачи.бит_ОборотыПоБюджетам;
	
	ОборотыПоБюджетам = Объект.Движения.бит_ОборотыПоБюджетам;
	ОборотыПоБюджетам.Загрузить(НаборОбороты);
	ОборотыПоБюджетам.Записывать = Истина;

	СоответствиеЗаписей = Объект.Движения.бит_СоответствиеЗаписейТрансляции;
	Для каждого СтрокаТаблицы Из НаборСоответствие Цикл
		НоваяСтрока = СоответствиеЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;
	СоответствиеЗаписей.Записывать = Истина;
	
	// При необходимости запишем движения (Регламентированная операция).
	Если ЗаписыватьДвижения Тогда
		
		Попытка
			ОборотыПоБюджетам.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru='Механизм трансляции';en='Механизм трансляции'", ОбщегоНазначения.КодОсновногоЯзыка()), 
				УровеньЖурналаРегистрации.Ошибка,, Объект, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Попытка
			СоответствиеЗаписей.Записать(); 
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru='Механизм трансляции';en='Механизм трансляции'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,, Объект, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеДопРеквизитаОсновнойАглоритм(Источник, ВидРеквизита, ИмяРеквизита)
	
	ЗначениеДопРеквизита = Неопределено;
	
	СвойстваИсточника = УправлениеСвойствами.СвойстваОбъекта(Источник);
	Запрос            = Новый Запрос;
	Запрос.Текст      =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Свойство
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка В(&СвойстваИсточника)
	|	И ДополнительныеРеквизитыИСведения.Наименование = &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДополнительныеРеквизитыИСведения.ПометкаУдаления";
	Запрос.УстановитьПараметр("СвойстваИсточника", СвойстваИсточника);
	Запрос.УстановитьПараметр("Наименование",      ИмяРеквизита);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Свойство = Выборка.Свойство;
	Иначе
		Возврат ЗначениеДопРеквизита;
	КонецЕсли;
	
	ЗначениеДопРеквизита = УправлениеСвойствами.ЗначениеСвойства(Источник, Свойство);	
	Если ЗначениеДопРеквизита = Неопределено
		И ЗначениеЗаполнено(Свойство) Тогда
		ТипСвойства          = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Свойство, "ТипЗначения");
		ЗначениеДопРеквизита = ТипСвойства.ПривестиЗначение(ЗначениеДопРеквизита);
	КонецЕсли; 
	
	Возврат ЗначениеДопРеквизита;	
	
КонецФункции

Функция ЗначениеДопРеквизитаСУканазиемКодаСвойства(Источник, ИмяРеквизита)
	
	ИмяРеквизитаБезДопРеквизита = СтрЗаменить(ИмяРеквизита, "ДополнительныйРеквизит_", "");
	ИмяРеквизитаБезДопСвойства  = СтрЗаменить(ИмяРеквизитаБезДопРеквизита, "ДополнительноеСвойство_", "");
	
	ИмяСвойства = ИмяРеквизитаБезДопСвойства;
	СвойствоОбъекта = СвойствоОбъектаПоИмени(ИмяСвойства);
	Если СвойствоОбъекта = Неопределено Тогда
		СвойствоОбъекта = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ИмяСвойства);
	КонецЕсли; 
	
	Возврат УправлениеСвойствами.ЗначениеСвойства(Источник, СвойствоОбъекта);
	
КонецФункции

#КонецОбласти