
&После("ОбработкаЗаполнения")
Процедура бит_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [19.08.2024] +        
	
	Если ДанныеЗаполнения.Свойство("ДокументОснование")
		И (ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказДавальца2_5")
		Или ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("Массив")
		И ДанныеЗаполнения.ДокументОснование.Количество() > 0
		И ТипЗнч(ДанныеЗаполнения.ДокументОснование[0]) = Тип("ДокументСсылка.ЗаказДавальца2_5")) Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("Массив") Тогда
			
			Комментарий = ДанныеЗаполнения.ДокументОснование[0].Комментарий;	
			
		Иначе
			
			Комментарий = ДанныеЗаполнения.ДокументОснование.Комментарий;
			
		КонецЕсли;
		
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [19.08.2024] -

КонецПроцедуры
