
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
			
	// Условное оформление субконто
	бит_БухгалтерскийУчет.УстановитьОформлениеСубконтоТаблицы(УсловноеОформление,
		"Закрытие", "СубконтоЗакрытия", "КоличествоДоступныхСубконтоЗакрытия",
		МаксКоличествоСубконтоНастройки);														   
															   
	УстановитьУсловноеОформление();
	УстановитьПараметрыВыбораДляСчетов();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РегистрБухгалтерииПриИзменении(Элемент)
	
	Если Объект.РегистрБухгалтерии = ТекущийРегистрБухгалтерии Тогда
		Возврат;	
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РегистрБухгалтерииПриИзмененииЗавершение", ЭтотОбъект);
	
	Если Объект.Закрытие.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='Табличная часть будет очищена. Продолжить?';
							  |en='Tabular section will be cleaned. Continue?'");
		
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
// 
&НаКлиенте
Процедура РегистрБухгалтерииПриИзмененииЗавершение(Ответ, ДопПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		РегистрБухгалтерииПриИзмененииНаСервере();	
	Иначе
		Объект.РегистрБухгалтерии = ТекущийРегистрБухгалтерии;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗакрытие

&НаКлиенте
Процедура ЗакрытиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.Закрытие.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		ТекущаяСтрока.ИД = Строка( Новый УникальныйИдентификатор);
		Если НЕ Копирование Тогда
			ТекущаяСтрока.СчетЗакрытия = ПараметрыРБ.ПустойСчет;
			ТекущаяСтрока.ВидЗакрытия = ПредопределенноеЗначение("Перечисление.бит_ВидыЗакрытия.Простое");
		КонецЕсли; 
	КонецЕсли; 
	
	УстановитьСпискиВыбораСпособаЗаполнения();
	УстановитьСпискиВыбораПолейИРесурсовИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеВидЗакрытияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Закрытие.ТекущиеДанные;
	
	УстановитьСпискиВыбораСпособаЗаполнения();
	
	// Очистим недоступные способы заполнения субконто
	// для выбранного вида закрытия.
	ЭтоРаспределение = ТекущаяСтрока.ВидЗакрытия = ПредопределенноеЗначение("Перечисление.бит_ВидыЗакрытия.Распределение");
	Если ЭтоРаспределение Тогда
		Список = СпособыЗаполнения;
	Иначе	
		Список = СпособыЗаполненияПростой;
	КонецЕсли;

	Для Ном = 1 По ПараметрыРБ.МинКоличествоСубконто Цикл
		Если Список.НайтиПоЗначению(ТекущаяСтрока["СпособЗаполненияСубконто" + Ном]) = Неопределено Тогда
			ТекущаяСтрока["СпособЗаполненияСубконто" + Ном] = "";			 
		КонецЕсли; 
	КонецЦикла; 
	
	Если НЕ ЭтоРаспределение Тогда
	    // Очистим поля заполняющиеся для распределения.		
		Для Ном = 1 По ПараметрыРБ.МинКоличествоСубконто Цикл
			ТекущаяСтрока["ПолеБазы"   + Ном] = "";
			ТекущаяСтрока["ПолеДанных" + Ном] = "";
		КонецЦикла;
	КонецЕсли; 
	
	Если ИспользуетсяРаспределение <> ИспользуетсяРаспределение(ЭтотОбъект) Тогда
		ИспользуетсяРаспределение = НЕ ИспользуетсяРаспределение;
	    УправлениеФормой(ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеДанныеПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Закрытие.ТекущиеДанные;
	ПриИзмененииИсточникаДанныхНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
	УстановитьСпискиВыбораПолейИРесурсовИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСчетЗакрытияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Закрытие.ТекущиеДанные;
	ЗакрытиеСчетЗакрытияПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСубконтоЗакрытияПриИзменении(Элемент)
	
	ТекущаяСтрока     = Элементы.Закрытие.ТекущиеДанные;
	
	ЗначениеСубконто  = ПолучитьЗначениеСубконтоТабПоле(ТекущаяСтрока,"Закрытие",Элемент.Имя);		
	ИзменениеСубконтоЗакрытия(Элементы.Закрытие.ТекущиеДанные,ЗначениеСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСубконтоЗакрытияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные     = Элементы.Закрытие.ТекущиеДанные;
	ЗначениеСубконто  = ПолучитьЗначениеСубконтоТабПоле(ТекущиеДанные, "Закрытие", Элемент.Имя);
	
	Если НЕ ЗначениеЗаполнено(ЗначениеСубконто) Тогда
	   Элемент.ВыбиратьТип = Истина;
	Иначе	
	   Элемент.ВыбиратьТип = Ложь;
	КонецЕсли; 
	
	ОграничениеСубконто = ПолучитьОграничениеТипаДляСубконто(Элемент.Имя, ТекущиеДанные);
	
	Элемент.ОграничениеТипа = ОграничениеСубконто;
	
	НачалоВыбораСубконтоЗакрытия(Элемент,СтандартнаяОбработка,ТекущиеДанные,ЗначениеСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСпособЗаполненияСубконто1ПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Закрытие.ТекущиеДанные;
	ОбработатьИзменениеСпособаЗаполнения(ТекущиеДанные.СпособЗаполненияСубконто1,
		ТекущиеДанные.СубконтоЗакрытия1);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСпособЗаполненияСубконто2ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Закрытие.ТекущиеДанные;
	ОбработатьИзменениеСпособаЗаполнения(ТекущиеДанные.СпособЗаполненияСубконто2,
		ТекущиеДанные.СубконтоЗакрытия2);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСпособЗаполненияСубконто3ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Закрытие.ТекущиеДанные;
	ОбработатьИзменениеСпособаЗаполнения(ТекущиеДанные.СпособЗаполненияСубконто3,
		ТекущиеДанные.СубконтоЗакрытия3);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСпособЗаполненияСубконто4ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Закрытие.ТекущиеДанные;
	ОбработатьИзменениеСпособаЗаполнения(ТекущиеДанные.СпособЗаполненияСубконто4,
		ТекущиеДанные.СубконтоЗакрытия4);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСпособЗаполненияПодразделенияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Закрытие.ТекущиеДанные;
	ОбработатьИзменениеСпособаЗаполнения(ТекущиеДанные.СпособЗаполненияПодразделения,
		ТекущиеДанные.ПодразделениеЗакрытия);
		
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьРесурсы(Команда)
	
	ИменаРесурсов = Новый СписокЗначений; 
	Для каждого СтрокаТаблицы Из Объект.ИменаРесурсов Цикл
		ИменаРесурсов.Добавить(СтрокаТаблицы.ИмяРесурса,,Истина);	
	КонецЦикла; 
	
	Для каждого Элемент Из РесурсыРегистра Цикл
		Если ИменаРесурсов.НайтиПоЗначению(Элемент.Значение) = Неопределено Тогда
			ИменаРесурсов.Добавить(Элемент.Значение);		
		КонецЕсли;
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("НастроитьРесурсыЗавершение", ЭтотОбъект); 
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ИменаРесурсов", ИменаРесурсов);
	ОткрытьФорму("Справочник.бит_НастройкиЗакрытия.Форма.НастройкаРесурсов", ПараметрыФормы, 
		ЭтотОбъект, ЭтотОбъект,,,Оповещение);
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура НастроитьРесурсыЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;	

	Объект.ИменаРесурсов.Очистить();
	Для каждого Элемент Из Результат Цикл
		Если Элемент.Пометка Тогда
			НоваяСтрока = Объект.ИменаРесурсов.Добавить();
			НоваяСтрока.ИмяРесурса = Элемент.Значение;
			НоваяСтрока.ИмяРеквизита = СтрШаблон("Сумма%1", НоваяСтрока.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьЗаголовкиКолонокЗакрытия(ЭтотОбъект);
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьОграничениеТипаДляСубконто(ИмяЭлемента, ТекущиеДанные)
	
	НомСтр = СтрЗаменить(ИмяЭлемента,"ЗакрытиеСубконтоЗакрытия","");
	Попытка		
		Индекс = Число(НомСтр);		
	Исключение		
		Индекс = 1;		
	КонецПопытки;
		
	Счет = ТекущиеДанные.СчетЗакрытия;
    СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
	Если СвСч.КоличествоСубконто >= Индекс Тогда	
        ОграничениеСубконто = СвСч["ВидСубконто" + Индекс + "ТипЗначения"];		
	Иначе		
		ОграничениеСубконто = Новый ОписаниеТипов();	
	КонецЕсли; 

	Возврат ОграничениеСубконто;
	
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ПараметрыРБ = бит_РегламентныеЗакрытия.ПараметрыРегистраБухгалтерии(Объект.РегистрБухгалтерии);
	
	МаксКоличествоРесурсовНастройки = Справочники.бит_НастройкиЗакрытия.МаксимальноеКоличествоРесурсовНастройки();
	МаксКоличествоСубконтоНастройки = Справочники.бит_НастройкиЗакрытия.МаксимальноеКоличествоСубконтоНастройки();
	
	ИспользуетсяРаспределение = ИспользуетсяРаспределение(ЭтотОбъект);
	
	УстановитьСпискиВыбора();
	
	// Восстанавливаем настройки субконто закрыти и признаки учета в зависимости от счетов закрытия.
	ЗаполнитьДобавленныеКолонкиТаблиц();

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	// ЗакрытиеСчетЗакрытия
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЗакрытиеСчетЗакрытия");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Закрытие.СчетЗакрытия", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Закрытие.ВидЗакрытия", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_ВидыЗакрытия.Простое);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	// ЗакрытиеПолеБазы..n, ЗакрытиеПолеДанных..n
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	Для н = 1 По МаксКоличествоСубконтоНастройки Цикл
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЗакрытиеПолеБазы"+н);
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЗакрытиеПолеДанных"+н);
	КонецЦикла;	
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Закрытие.ВидЗакрытия", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_ВидыЗакрытия.Простое);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// ЗакрытиеПодразделениеЗакрытия
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЗакрытиеПодразделениеЗакрытия");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Закрытие.УчетПоПодразделениям", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", 	   ЦветаСтиля.бит_ТекстНедоступнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", 		   НСтр("ru='<не требуется>';en='<Not required>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// "ЗакрытиеБаза"
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЗакрытиеБаза");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Закрытие.ВидЗакрытия", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_ВидыЗакрытия.Простое);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// "ЗакрытиеБаза"
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЗакрытиеБаза");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Закрытие.ВидЗакрытия", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_ВидыЗакрытия.Простое);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	// ЗакрытиеСубконтоЗакрытия..n
	Для Индекс = 1 По 4 Цикл
		ЭлементУО 	 = УсловноеОформление.Элементы.Добавить();
		ИмяПоляФормы = СтрШаблон("ЗакрытиеСубконтоЗакрытия%1", Индекс);
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяПоляФормы);
		
		ИмяПоляДанных = СтрШаблон("Объект.Закрытие.СпособЗаполненияСубконто%1", Индекс);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			ИмяПоляДанных, ВидСравненияКомпоновкиДанных.НеРавно, "Явно");
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	КонецЦикла;
	
	// ЗакрытиеПодразделениеЗакрытия
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЗакрытиеПодразделениеЗакрытия");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Закрытие.СпособЗаполненияПодразделения", ВидСравненияКомпоновкиДанных.НеРавно, "Явно");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Функция ИменаРесурсов()

	РезСтруктура = бит_ОбщегоНазначения.ПрочитатьXMLВТаблицу(
						Справочники.бит_НастройкиЗакрытия.ПолучитьМакет("ИменаРесурсовРегистра").ПолучитьТекст());
	ТабДанные    = РезСтруктура.Данные;

	Возврат ТабДанные;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРесурсыРегистра()
	
	ТабДанные = ИменаРесурсов();
	
	Фильтр = Новый Структура("ИмяРегистраБухгалтерии", Объект.РегистрБухгалтерии.ИмяОбъекта);
	Копия  = ТабДанные.Скопировать(Фильтр);
	
	РесурсыРегистра.ЗагрузитьЗначения(Копия.ВыгрузитьКолонку("ИмяРесурса"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСпискиВыбора()
	
	Список = бит_РегламентныеЗакрытия.СформироватьСписокРегистровБухгалтерииДляВыбора();
	Элементы.РегистрБухгалтерии.СписокВыбора.ЗагрузитьЗначения(Список.ВыгрузитьЗначения());
	
	// Список выбора для имен ресурсов регистра
	ЗаполнитьРесурсыРегистра();
	
	// Списки выбора полей базы и данных
	СписокСубконто = Справочники.бит_НастройкиЗакрытия.СформироватьСписокСубконто(ПараметрыРБ.МинКоличествоСубконто,
						ПараметрыРБ.ЕстьПодразделение);
																				   
	КоличествоПолейНастройки = ПараметрыРБ.МаксКоличествоСубконто + ?(ПараметрыРБ.ЕстьПодразделение, 1, 0);																			   
																				   
	Для Индекс = 1 По КоличествоПолейНастройки Цикл
		Элементы["ЗакрытиеПолеДанных"+Индекс].СписокВыбора.Очистить();
		Элементы["ЗакрытиеПолеБазы"+Индекс].СписокВыбора.Очистить();
		Для каждого Элемент Из СписокСубконто Цикл
			Элементы["ЗакрытиеПолеДанных"+Индекс].СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
			Элементы["ЗакрытиеПолеБазы"+Индекс].СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЦикла;
	КонецЦикла;
	
	Справочники.бит_НастройкиЗакрытия.СформироватьСписокСпособовЗаполненияСубконто(ЭтотОбъект);
	
КонецПроцедуры // УстановитьСпискиВыбора()

&НаСервере
Процедура ЗаполнитьПоУмолчаниюСоответствиеИменРесурсов()
	
	Объект.ИменаРесурсов.Очистить();
	
	// Получим таблицу с данными имен ресурсов.
	ТабДанные = ИменаРесурсов();
	
	// Добавим соответствия имен ресурсов для текущего регистра бухгалтерии.
	СтрОтбор = Новый Структура("ИмяРегистраБухгалтерии", Объект.РегистрБухгалтерии.ИмяОбъекта);
	МассивСтрок = ТабДанные.НайтиСтроки(СтрОтбор);
	
	Для Каждого ТекИмена Из МассивСтрок Цикл
		
		НовСтрока = Объект.ИменаРесурсов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекИмена);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоУмолчаниюСоответствиеИменРесурсов()

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	ПараметрыРБ = Форма.ПараметрыРБ;
	Элементы	= Форма.Элементы;
	Объект		= Форма.Объект;
	
	ИмяРегистраБухгалтерии = ПараметрыРБ.ИмяРегистра;
	
	// Управление видимостью колонок табличного поля "Закрытие".
	Элементы.ЗакрытиеИмяПоказателяЦФО.Видимость      = ПараметрыРБ.ЭтоРегистрБюдж;
	Элементы.ЗакрытиеИмяПоказателяВидУчета.Видимость = ПараметрыРБ.ЭтоРегистрНУ;
	
	КоличествоПолейНастройки = ПараметрыРБ.МинКоличествоСубконто + ?(ПараметрыРБ.ЕстьПодразделение, 1, 0);																			   	
	
	Для Ном = 1 По Форма.МаксКоличествоСубконтоНастройки Цикл
		
		ОтобразитьКолонку = ? (Ном <= ПараметрыРБ.МинКоличествоСубконто, Истина, Ложь);
		
		Элементы["ЗакрытиеСубконтоЗакрытия" + Ном].Видимость = ОтобразитьКолонку;
		Элементы["ЗакрытиеСпособЗаполненияСубконто" + Ном].Видимость = ОтобразитьКолонку;
		
		ОтобразитьКолонку = ? (Ном <= КоличествоПолейНастройки, Истина, Ложь);		
		
		Элементы["ЗакрытиеПолеБазы"   + Ном].Видимость = ОтобразитьКолонку;
		Элементы["ЗакрытиеПолеДанных" + Ном].Видимость = ОтобразитьКолонку;
	КонецЦикла;
	
	Элементы.ЗакрытиеИмяПоказателяКоличество.Видимость 	  = ПараметрыРБ.ЕстьКоличественныйУчет;
	Элементы.ЗакрытиеИмяПоказателяВалюта.Видимость 		  = ПараметрыРБ.ЕстьВалютныйУчет;
	Элементы.ЗакрытиеИмяПоказателяВалютнаяСумма.Видимость = ПараметрыРБ.ЕстьВалютныйУчет;
	
	Элементы.ЗакрытиеПодразделениеЗакрытия.Видимость 		 = ПараметрыРБ.ЕстьПодразделение;
	Элементы.ЗакрытиеСпособЗаполненияПодразделения.Видимость = ПараметрыРБ.ЕстьПодразделение;	

	// Установим заголовки колонок закрытия.
	УстановитьЗаголовкиКолонокЗакрытия(Форма);
	
	// Если в табличной части только простое закрытие можно скрыть колонки, имеющие смысл только для распределения.
	Элементы.ЗакрытиеБаза.Видимость 			= Форма.ИспользуетсяРаспределение;
	Элементы.ЗакрытиеГруппаПоляДанных.Видимость = Форма.ИспользуетсяРаспределение;
	Элементы.ЗакрытиеПоляБазы.Видимость 		= Форма.ИспользуетсяРаспределение;
	
	// Если не выбран регистр табличное поле недоступно.
	Элементы.Закрытие.Доступность = ?(ЗначениеЗаполнено(Объект.РегистрБухгалтерии), Истина, Ложь);
	
КонецПроцедуры // УстановитьВидимость()

&НаКлиентеНаСервереБезКонтекста
Функция ИспользуетсяРаспределение(Форма)

	ИспользуетсяРаспределение = Ложь;
	Объект					  = Форма.Объект;
	
	// Поиск не используем потому, что происходит неявный вызов сервера.
	Для каждого СтрокаТаблицы Из Объект.Закрытие Цикл
		Если СтрокаТаблицы.ВидЗакрытия = ПредопределенноеЗначение("Перечисление.бит_ВидыЗакрытия.Распределение") Тогда
			ИспользуетсяРаспределение = Истина;	
			Прервать;		
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ИспользуетсяРаспределение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиКолонокЗакрытия(Форма)
	
	Объект 	 = Форма.Объект;
	Элементы = Форма.Элементы;
	
	// Получим количество суммовых ресурсов для текущего регистра бухгалтерии.
	КолВоРесурсов = Мин(Объект.ИменаРесурсов.Количество(), Форма.МаксКоличествоРесурсовНастройки);
	
	Для Ном = 1 По Форма.МаксКоличествоРесурсовНастройки Цикл
		
		ОтобразитьКолонку = (Ном <= КолВоРесурсов);
		
		Элементы["ЗакрытиеИмяПоказателяСумма" + Ном].Видимость = ОтобразитьКолонку;
		
		Если ОтобразитьКолонку Тогда
			СтрокаТаблицы  = Объект.ИменаРесурсов.Получить(Ном - 1);
			ТекстЗаголовка = СтрокаТаблицы.ИмяРесурса;	
			
			Элементы["ЗакрытиеИмяПоказателяСумма" + Ном].Заголовок = ТекстЗаголовка;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УстановитьЗаголовкиКолонокЗакрытия()

&НаСервере
Процедура РегистрБухгалтерииПриИзмененииНаСервере()
	
	Объект.Закрытие.Очистить();
	
	Если ЗначениеЗаполнено(Объект.РегистрБухгалтерии) Тогда
		ПараметрыРБ = бит_РегламентныеЗакрытия.ПараметрыРегистраБухгалтерии(Объект.РегистрБухгалтерии);
	    УстановитьСпискиВыбора();		
		ЗаполнитьПоУмолчаниюСоответствиеИменРесурсов();
	КонецЕсли; 
	
	ТекущийРегистрБухгалтерии = Объект.РегистрБухгалтерии;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры // РегистрБухгалтерииИзменение()

&НаСервере
Процедура ЗакрытиеСчетЗакрытияПриИзмененииНаСервере(Идентификатор)
	
	ТекущаяСтрока = Объект.Закрытие.НайтиПоИдентификатору(Идентификатор);
	
	Если ТекущаяСтрока = Неопределено Тогда		
		Возврат;		
	КонецЕсли; 
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(ТекущаяСтрока.СчетЗакрытия, МаксКоличествоСубконтоНастройки);									  
	
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(ТекущаяСтрока,НастройкиСубконто,"СубконтоЗакрытия");
    
    ЗаполнитьДобавленныеКолонкиСтроки(ТекущаяСтрока);
	
	Если НЕ ТекущаяСтрока.УчетПоПодразделениям Тогда
		ТекущаяСтрока.ПодразделениеЗакрытия = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()
	
	Для каждого СтрокаТаблицы Из Объект.Закрытие Цикл
        ЗаполнитьДобавленныеКолонкиСтроки(СтрокаТаблицы);
		ПриИзмененииИсточникаДанныхНаСервере(СтрокаТаблицы);
	КонецЦикла; 											   
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиСтроки(Идентификатор)

	Если ТипЗнч(Идентификатор) = Тип("Число") Тогда
		ТекущаяСтрока = Объект.Закрытие.НайтиПоИдентификатору(Идентификатор);
	Иначе
		ТекущаяСтрока = Идентификатор;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СвойстваСчета = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущаяСтрока.СчетЗакрытия);
	
	ТекущаяСтрока.КоличествоДоступныхСубконтоЗакрытия = СвойстваСчета.КоличествоСубконто;
	ТекущаяСтрока.КоличественныйУчет   = СвойстваСчета.Количественный;
	ТекущаяСтрока.ВалютныйУчет 		   = СвойстваСчета.Валютный;
	ТекущаяСтрока.УчетПоПодразделениям = СвойстваСчета.УчетПоПодразделениям;		
	
КонецПроцедуры
 
&НаСервере
Процедура ПриИзмененииИсточникаДанныхНаСервере(Идентификатор)
	
	Если ТипЗнч(Идентификатор) = Тип("Число") Тогда
		ТекущаяСтрока = Объект.Закрытие.НайтиПоИдентификатору(Идентификатор);
	Иначе
		ТекущаяСтрока = Идентификатор;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока.РесурсыИсточника.Очистить();
	ТекущаяСтрока.ПоляИсточника.Очистить();
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Данные) Тогда
		 СписокРесурсов = Справочники.бит_ИсточникиДанных.ПоляИсточника(ТекущаяСтрока.Данные, "Ресурс");
		 СписокПолей 	= Справочники.бит_ИсточникиДанных.ПоляИсточника(ТекущаяСтрока.Данные, "Поле");
		 
		 ТекущаяСтрока.РесурсыИсточника.ЗагрузитьЗначения(СписокРесурсов.ВыгрузитьЗначения());
		 ТекущаяСтрока.ПоляИсточника.ЗагрузитьЗначения(СписокПолей.ВыгрузитьЗначения());
		 
		 // Автозаполнение ресурсов
		 Для каждого СтрокаИмена Из Объект.ИменаРесурсов Цикл
		 	 Если НЕ СписокРесурсов.НайтиПоЗначению(СтрокаИмена.ИмяРесурса) = Неопределено Тогда
			 	 ТекущаяСтрока["ИмяПоказателя"+СтрокаИмена.ИмяРеквизита] = СтрокаИмена.ИмяРесурса;
			 КонецЕсли; 
		 КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

// Процедура устанвливает параметры выбора для элементов формы. 
// 
// Параметры:
//  МассивЭлементов - Массив.
// 
&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.ЗакрытиеСчетЗакрытия);
	
	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры // УстановитьПараметрыВыбораДляСчетов() 

&НаКлиенте
Процедура УстановитьСпискиВыбораСпособаЗаполнения()
	
	ТекущиеДанные = Элементы.Закрытие.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда	
		Возврат;	
	КонецЕсли;
	
	Если ТекущиеДанные.ВидЗакрытия = ПредопределенноеЗначение("Перечисление.бит_ВидыЗакрытия.Распределение") Тогда
		Список = СпособыЗаполнения;
	Иначе	
		Список = СпособыЗаполненияПростой;
	КонецЕсли;

	Для Номер = 1 По МаксКоличествоСубконтоНастройки Цикл
		Элементы["ЗакрытиеСпособЗаполненияСубконто" + Номер].СписокВыбора.Очистить();
		
		Для каждого Элемент Из Список Цикл
			Элементы["ЗакрытиеСпособЗаполненияСубконто"+Номер].СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЦикла;
	КонецЦикла;
	
	Если ПараметрыРБ.ЕстьПодразделение Тогда
		Элементы.ЗакрытиеСпособЗаполненияПодразделения.СписокВыбора.Очистить();
		Для каждого Элемент Из Список Цикл
			Элементы.ЗакрытиеСпособЗаполненияПодразделения.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЦикла; // Список выбора
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСпискиВыбораПолейИРесурсовИсточника()

	ТекущиеДанные = Элементы.Закрытие.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоляФормыРесурсы = Новый Массив; 
	ПоляФормыРесурсы.Добавить(Элементы.ЗакрытиеИмяПоказателяКоличество);
	ПоляФормыРесурсы.Добавить(Элементы.ЗакрытиеИмяПоказателяВалютнаяСумма);
	ПоляФормыРесурсы.Добавить(Элементы.ЗакрытиеИмяПоказателяСумма1);
	ПоляФормыРесурсы.Добавить(Элементы.ЗакрытиеИмяПоказателяСумма2);
	ПоляФормыРесурсы.Добавить(Элементы.ЗакрытиеИмяПоказателяСумма3);
	ПоляФормыРесурсы.Добавить(Элементы.ЗакрытиеИмяПоказателяСумма4);
	
	Значения = ТекущиеДанные.РесурсыИсточника.ВыгрузитьЗначения();
	Для каждого ПолеФормы Из ПоляФормыРесурсы Цикл
		ПолеФормы.СписокВыбора.ЗагрузитьЗначения(Значения);
	КонецЦикла; 
	
	ПоляФормыПоля = Новый Массив;
	ПоляФормыПоля.Добавить(Элементы.ЗакрытиеИмяПоказателяВалюта);
	ПоляФормыПоля.Добавить(Элементы.ЗакрытиеИмяПоказателяВидУчета);
	ПоляФормыПоля.Добавить(Элементы.ЗакрытиеИмяПоказателяЦФО);
	
	Значения = ТекущиеДанные.ПоляИсточника.ВыгрузитьЗначения();
	Для каждого ПолеФормы Из ПоляФормыПоля Цикл
		ПолеФормы.СписокВыбора.ЗагрузитьЗначения(Значения);
	КонецЦикла;
	
КонецПроцедуры
 
&НаКлиенте
Функция ПолучитьЗначениеСубконтоТабПоле(ТекущаяСтрока,ИмяТабличногоПоля,ИмяЭлемента)

	ЗначениеСубконто = Неопределено;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		ИмяРеквизита      = СтрЗаменить(ИмяЭлемента,ИмяТабличногоПоля,"");
		ЗначениеСубконто  = ТекущаяСтрока[ИмяРеквизита];
		
	КонецЕсли; 

	Возврат ЗначениеСубконто;
	
КонецФункции // ПолучитьЗначениеСубконтоТабПоле()

&НаКлиенте
Процедура ИзменениеСубконтоЗакрытия(Контейнер,ЗначениеСубконто)
	
	СтруктураСубконто = бит_БухгалтерияКлиент.ПодготовитьСтруктуруСубконто(Контейнер,"СубконтоЗакрытия",МаксКоличествоСубконтоНастройки);
	бит_БухгалтерияВызовСервера.ОбработатьИзменениеСубконто(СтруктураСубконто,"СубконтоЗакрытия",ЗначениеСубконто,МаксКоличествоСубконтоНастройки);
	бит_БухгалтерияКлиент.ЗаполнитьСубконтоПоСтруктуре(СтруктураСубконто,Контейнер,"СубконтоЗакрытия","",МаксКоличествоСубконтоНастройки);																   
	
КонецПроцедуры // ИзменениеСубконтоКлиентМУ()

&НаКлиенте
Процедура НачалоВыбораСубконтоЗакрытия(Элемент,СтандартнаяОбработка,Контейнер,ЗначениеСубконто)
	
	ПараметрыВыбораСубконто = бит_БухгалтерияКлиент.ПодготовитьПараметрыВыбораСубконто(Контейнер, 
		"СубконтоЗакрытия", ЗначениеСубконто, МаксКоличествоСубконтоНастройки, Объект);	

	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, ПараметрыВыбораСубконто);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСпособаЗаполнения(СпособЗаполнения, Значение)
	
	Если СпособЗаполнения <> "Явно" Тогда
		Значение = Неопределено;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти       
