
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// стандартные действия при создании на сервере
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АвтоТест", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.ИмяМакета) Тогда
		ТекстСообщения = НСтр("ru = 'Непосредственное открытие этой формы не предусмотрено.';
							|en = 'You can''t open this form directly.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Организация = Параметры.Организация;
	
	Объект.Период.Вариант = ВариантСтандартногоПериода.Сегодня;
	
	// инициализируем настройки компоновщика
	АдресСхемыКомпоновкиДанных = Обработки.бит_кзн_ПодборЗаявокНаРасходованиеИПеремещение.ИнициализироватьКомпоновщик(
										Объект.Компоновщик, УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Объект.Компоновщик.Настройки.Отбор,
			"Организация", Организация,ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
	Элементы.КомпоновщикПользовательскиеНастройки.РежимОтображения = РежимОтображенияНастроекКомпоновкиДанных.БыстрыйДоступ;	
	
	УстановитьЗначенияПоУмолчанию();
	
	ИзмеренияДоп	   = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
		"Результат", ИзмеренияДоп, НастройкиИзмерений);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	
	ДобавитьВыбранныеСтроки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавить(Команда)
	
	ДобавитьВыбранныеСтроки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнвертировать(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.Результат, "Использование", 2, Элементы.Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.Результат, "Использование", 0, Элементы.Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.Результат, "Использование", 1, Элементы.Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастроитьПериод(Команда)
	
	//ПараметрыВыбора    = Новый Структура("НачалоПериода, КонецПериода", Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	//ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, ЭтотОбъект, , , , ОписаниеОповещения);

	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = Объект.Период;
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

// Обработчик завершения редактирования периода.
//  См. Синтакс-помощник: Показать().
//
&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Объект.Период = РезультатВыбора;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
		
	ПараметрыФормы     = Новый Структура;
	СтруктураНастройки = УпаковатьНастройкиВСтруктуру();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СтруктураНастройки);
	ПараметрыФормы.Вставить("ТипНастройки"		 , ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", "Обработка.бит_кзн_ПодборЗаявокНаРасходованиеИПеремещение");
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		ПараметрыФормы.Вставить("СохраненнаяНастройка",ТекущаяНастройка);
	КонецЕсли; 
		
	ОповещениеЗакрытиеФормы = Новый ОписаниеОповещения("ЗакрытиеФормыСохранения", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, 
		ЭтотОбъект,,,, ОповещениеЗакрытиеФормы, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры //КомандаСохранитьНастройки()

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ЗакрытиеФормыСохранения(СохрНастройка, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(СохрНастройка) Тогда
		ТекущаяНастройка = СохрНастройка;
		УстановитьЗаголовокФормы(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаВосстановитьНастройки(Команда)
			
	ПараметрыФормы     = Новый Структура;
	ПараметрыФормы.Вставить("ТипНастройки"		 , ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", "Обработка.бит_кзн_ПодборЗаявокНаРасходованиеИПеремещение");
	
	ОповещениеЗакрытиеФормы = Новый ОписаниеОповещения("ВосстановитьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", ПараметрыФормы, 
		ЭтотОбъект,,,, ОповещениеЗакрытиеФормы, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ВосстановитьНастройкиЗавершение(Результат, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		ТекущаяНастройка = Результат;
		ПрименитьНастройки(Результат);
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписок()

	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("Период", Объект.Период);
	
	Результат = Обработки.бит_кзн_ПодборЗаявокНаРасходованиеИПеремещение.ВыполнитьЗапросПоНастройке(Объект.Компоновщик,
					АдресСхемыКомпоновкиДанных, ПараметрыПередачи);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		ТекстСообщения = НСтр("ru='Нет данных, удовлетворяющих отбору';en='No data satisfying the selection'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 
	
	Объект.Результат.Загрузить(Результат);
	
	СписокРеквизитов	= "БанковскийСчет, ОбъектРасчетов, ВалютаДокумента";
	РеквизитыДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Результат.ВыгрузитьКолонку("ПлатежнаяПозиция"), 
							СписокРеквизитов);
	
	Для каждого СтрокаТаблицы Из Объект.Результат Цикл
		РеквизитыПозиции = РеквизитыДокументов[СтрокаТаблицы.ПлатежнаяПозиция];						
		ВалютыРассчетов  = бит_Казначейство.ВалютыРассчетов(РеквизитыПозиции.ОбъектРасчетов, 
										РеквизитыПозиции.БанковскийСчет, РеквизитыПозиции.ВалютаДокумента);
		
		СтрокаТаблицы.ВалютаПлатежа = ВалютыРассчетов.ВалютаОплаты;
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Функция УпаковатьНастройкиВСтруктуру()
	
	Сжатие 					  = Новый СжатиеДанных(9);
	ПользовательскиеНастройки = Новый ХранилищеЗначения(Объект.Компоновщик.ПользовательскиеНастройки, Сжатие);
	
	Настройки = Новый Структура;
	Настройки.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	
	Возврат Настройки;
	
КонецФункции

&НаСервере
Функция ПрименитьНастройки(Настройки)

	Если ЗначениеЗаполнено(Настройки) Тогда
		
		СтруктураНастроек = Настройки.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			
			ПользовательскиеНастройки = СтруктураНастроек.ПользовательскиеНастройки.Получить();
			
			Объект.Компоновщик.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
			
			ТекущаяНастройка = Настройки;
			УстановитьЗаголовокФормы(ЭтотОбъект);				
		КонецЕсли;	 
	КонецЕсли; 
	
КонецФункции

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	// Получим настройку по умолчанию
	СохрНастройка = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта("Обработка.бит_кзн_ПодборЗаявокНаРасходованиеИПеремещение");
	
	Если ЗначениеЗаполнено(СохрНастройка) Тогда
		ПрименитьНастройки(СохрНастройка);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОчисткиНачальногоЗначения(Контейнер, ИмяПоля, НастройкиИзмерений)
	
	Если Контейнер = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НастройкиИзмерений[ИмяПоля] <> Неопределено Тогда
		Если НастройкиИзмерений[ИмяПоля].ЭтоСоставнойТип Тогда
			Контейнер[ИмяПоля]   = Неопределено;
		Иначе	
			Контейнер[ИмяПоля]   = НастройкиИзмерений[ИмяПоля].ЗначениеПоУмолчанию;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьЗаголовокФормы(Форма)
	
	Если ЗначениеЗаполнено(Форма.ТекущаяНастройка) Тогда
		Форма.Заголовок = НСтр("ru = 'Подбор заявок на расходование и перемещение ДС (%1)'");
		Форма.Заголовок = СтрШаблон(Форма.Заголовок, Форма.ТекущаяНастройка);
	Иначе	
		Форма.Заголовок = НСтр("ru = 'Подбор заявок на расходование и перемещение ДС'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыбранныеСтроки(ОчищатьТабличнуюЧасть)

	МассивСтрокТЧ = Новый Массив;
	
	Для каждого ТекСтр Из Объект.Результат Цикл
		Если ТекСтр.Использование Тогда
			СтрокаТЧ = Новый Структура("ДокументПланирования, ПлатежнаяПозиция,
										| СуммаДокумента, СтатусЗаявки, СтатусПозиции,
										| СуммаПлан, ВалютаПлатежа");
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекСтр);
			МассивСтрокТЧ.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	РезультатПодбора = Новый Структура;
	РезультатПодбора.Вставить("МассивСтрок", 			МассивСтрокТЧ);
	РезультатПодбора.Вставить("ОчищатьТабличнуюЧасть", 	ОчищатьТабличнуюЧасть);
		
	Если МассивСтрокТЧ.Количество() > 0 Тогда
		ОповеститьВладельцаОВыборе(РезультатПодбора);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПеренестиЗаявкиЗавершение", ЭтотОбъект); 
	Если РезультатПодбора.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нет выбранных элементов. Закрыть форму подбора?'; 
							  |en = 'No selected items. Close the selection form?'");
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;

КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПеренестиЗаявкиЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОповеститьВладельцаОВыборе(Параметр)

	Оповестить("ПодборВРеестрПлатежей", Параметр, ЭтотОбъект.ВладелецФормы);

КонецПроцедуры

#КонецОбласти

