
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Объект.РежимЗагрузки = Параметры.РежимЗагрузки;
	РежимыЗагрузки = Перечисления.бит_РежимыЗагрузки;
    
    Объект.СобытиеПередЗаписью          = Параметры.СобытиеПередЗаписью;
    Объект.СобытиеПриЗаписи             = Параметры.СобытиеПриЗаписи;
    Объект.СобытиеПослеДобавленияСтроки = Параметры.СобытиеПослеДобавленияСтроки;
    
    Если Объект.РежимЗагрузки <> "РегистрСведений" Тогда
		Элементы.СтраницаПередЗаписью.Заголовок = НСтр("ru='Перед записью объекта';
								   	 				   |en='Before Object Writing'");
		Элементы.СтраницаПриЗаписи.Заголовок = НСтр("ru='При записи объекта';
								   	 				|en='When recording an object'");
	КонецЕсли;
    
    Элементы.ИнформацияПередЗаписьюСправочник.Видимость = Объект.РежимЗагрузки = РежимыЗагрузки.Справочник 
													  ИЛИ Объект.РежимЗагрузки = РежимыЗагрузки.Документ;
    Элементы.ИнформацияПриЗаписиСправочник.Видимость    = Объект.РежимЗагрузки = РежимыЗагрузки.Справочник 
													  ИЛИ Объект.РежимЗагрузки = РежимыЗагрузки.Документ;
    
    Элементы.ИнформацияПередЗаписьюРегистрСведений.Видимость = Объект.РежимЗагрузки = РежимыЗагрузки.РегистрСведений;
    Элементы.ИнформацияПриЗаписиРегистрСведений.Видимость    = Объект.РежимЗагрузки = РежимыЗагрузки.РегистрСведений;
    
    Элементы.ИнформацияПередЗаписьюТабличнаяЧасть.Видимость          = Объект.РежимЗагрузки = РежимыЗагрузки.ТабличнаяЧасть;
    Элементы.ИнформацияПриЗаписиТабличнаяЧасть.Видимость             = Объект.РежимЗагрузки = РежимыЗагрузки.ТабличнаяЧасть;
    Элементы.ИнформацияПослеДобавленияСтрокиТабличнаяЧасть.Видимость = Объект.РежимЗагрузки = РежимыЗагрузки.ТабличнаяЧасть;
    
	Элементы.СтраницаПослеДобавленияСтроки.Видимость = Объект.РежимЗагрузки = РежимыЗагрузки.ТабличнаяЧасть;
        
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Кнопка)
    
    СтруктураСобытий = Новый Структура;
    СтруктураСобытий.Вставить("СобытиеПередЗаписью"         , Объект.СобытиеПередЗаписью);
    СтруктураСобытий.Вставить("СобытиеПриЗаписи"            , Объект.СобытиеПриЗаписи);
    СтруктураСобытий.Вставить("СобытиеПослеДобавленияСтроки", Объект.СобытиеПослеДобавленияСтроки);
    
    Закрыть(СтруктураСобытий);
    
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
    
    Закрыть();
    
КонецПроцедуры

#КонецОбласти
