
#Область ПрограммныйИнтерфейс

// Производит разложение данных дорожек магнитной карты по шаблонам.
// Параметры:
//  ДанныеДорожек - Массив -- массив строк. Значения полученные из дорожек.
//  ПараметрыДорожек - Массив - массив структур содержащих параметры настройки устройства, где:
//   * Использовать - булево - признак использования дорожки.
//   * НомерДорожки - число - порядковый номер дорожки 1-3.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Шаблон - СправочникСсылка.ШаблоныМагнитныхКарт - ;
//   * ДанныеДорожек - Структура:
//  	** Поле - Строка
//  	** ЗначениеПоля - Произвольный - 
//
Функция РасшифроватьКодМагнитнойКарты(ДанныеДорожек, ПараметрыДорожек) Экспорт;
	
	Возврат ОборудованиеУстройстваВводаВызовСервера.РасшифроватьКодМагнитнойКарты(ДанныеДорожек, ПараметрыДорожек);
	
КонецФункции

#КонецОбласти
