Процедура ОткрытьФормуНастроек( ИнформацияОбОшибке = Неопределено) Экспорт 
	
	ОткрытьФорму("ОбщаяФорма.ФормаРаботыСХранилищами");
	
КонецПроцедуры

Процедура СделатьСкриншотИПоместитьВБуфер(ИнформацияОбОшибке = Неопределено) Экспорт 
	
	ИнфОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	
	Временный_zip_файл = ПолучитьИмяВременногоФайла("zip");
	Полный_путь_к_файлу = "";
	
	// Регистрация (сохранение и отправки данных) ошибки
	Отчет_об_ошибке = Новый ОтчетОбОшибке(ИнформацияОбОшибке);
	Отчет_об_ошибке.Записать(Временный_zip_файл, Ложь);
	
	// Получаем имя каталога временных файлов пользователя
	Каталог_файлов = КаталогВременныхФайлов() + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	
	// Чтение файла ZIP
	Архив_zip  = Новый ЧтениеZipФайла(Временный_zip_файл);
	Архив_zip.ИзвлечьВсе(Каталог_файлов, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	
	// Случайное число в диапазоне от 1 до 999999 для рандомного имени файла
	ГенераторСлЧисел = Новый ГенераторСлучайныхЧисел();
	СлучЧисло=ГенераторСлЧисел.СлучайноеЧисло(1,999999);
	
	ИмяФайла = Каталог_файлов+"\screenshot.png";
	Скриншот = Новый Картинка(ИмяФайла);
	
	//Вложения = Новый Структура("screenshot", Скриншот);
	
    СредстваБуфераОбмена.ПоместитьДанныеАсинх(Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Картинка, Скриншот));
    //Сообщить("Скриншот экрана помещен в буфер обмена!");

    Если ЗначениеЗаполнено(ИмяФайла) Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;
	
	// Чистим мусор
	УдалитьФайлы(Временный_zip_файл);
	УдалитьФайлы(Каталог_файлов);

КонецПроцедуры