
&После("ОбработкаЗаполнения")
Процедура бит_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [19.08.2024] +        
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			
			ТипОснование = ТипЗнч(ДанныеЗаполнения.ДокументОснование);
			
			Если ТипОснование = Тип("ДокументСсылка.ЗаказДавальца2_5") Тогда
				Комментарий = ДанныеЗаполнения.ДокументОснование.Комментарий;	
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;	
	// }}ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [19.08.2024] -
	
КонецПроцедуры
