
#Область СлужебныйПрограммныйИнтерфейс

#Область ЗагрузкаВыгрузкаExcel

#Область ОбщиеПроцедурыФункции

Функция ИнформационнаяСтрокаВыгрузки(Знач ДокументСсылка) Экспорт
	
	ШаблонСтроки = НСтр("ru='%1 Выгружено: %2';en='%1 Uploaded: %2'");
	ИнформационнаяСтрока = СтрШаблон(ШаблонСтроки, Строка(ДокументСсылка), Формат(ТекущаяДатаСеанса(), "ДЛФ=D"));
	Возврат ИнформационнаяСтрока;
	
КонецФункции

#КонецОбласти

#Область ЭлементыФормы

Функция ЦветПодсказкиДляЯчейки() Экспорт
	
	Возврат ЦветаСтиля.бит_ЦветФонаПодсказки;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаИзExcel

// Функция получает значение для ИБ из данных поля Excel.
//
// Параметры:
//  СсылкаЗначенияExcel        - Строка.
//  ИмяСпискаИсточникаExcel    - Строка.
//  ПредставлениеЗначенияExcel - Строка.
//
Функция ПолучитьЗначениеПоСсылкеExcel(Знач СсылкаЗначенияExcel, Знач ИмяСпискаИсточникаExcel, Знач ПредставлениеЗначенияExcel) Экспорт

	ТекЗначение = Неопределено;
	
	Если ИмяСпискаИсточникаExcel = "Булево" Тогда
		
		Если СсылкаЗначенияExcel = "Истина" Тогда
			ТекЗначение = Истина;	
		ИначеЕсли СсылкаЗначенияExcel = "Ложь" Тогда
			ТекЗначение = Ложь;
		КонецЕсли;	
	
	ИначеЕсли Лев(ИмяСпискаИсточникаExcel, 16) = "СправочникСсылка" Тогда
		
		ИмяОбъекта = СтрЗаменить(ИмяСпискаИсточникаExcel, "СправочникСсылка.", "");	
		СтрокаИнд  = Сред(СсылкаЗначенияExcel, Найти(СсылкаЗначенияExcel, "/") + 1);
		Попытка
            ТекЗначение = Справочники[ИмяОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаИнд));
		Исключение 
            ТекЗначение = ПолучитьЗначениеСправочникаПоНаименованию(ИмяСпискаИсточникаExcel, ПредставлениеЗначенияExcel);
		КонецПопытки;		
		
	ИначеЕсли Лев(ИмяСпискаИсточникаExcel, 18) = "ПеречислениеСсылка" Тогда
		
		ИмяОбъекта  = СтрЗаменить(ИмяСпискаИсточникаExcel, "ПеречислениеСсылка.", "");	
		СтрокаИнд 	= СтрЗаменить(СсылкаЗначенияExcel, "Перечисление." + ИмяОбъекта + ".", "");
		ТекЗначение = Перечисления[ИмяОбъекта][СтрокаИнд];
		
	ИначеЕсли Лев(ИмяСпискаИсточникаExcel, 16) = "ПланСчетовСсылка" Тогда
		
		ИмяОбъекта  = СтрЗаменить(ИмяСпискаИсточникаExcel, "ПланСчетовСсылка.", "");	
		СтрокаИнд 	= Сред(СсылкаЗначенияExcel, Найти(СсылкаЗначенияExcel, "/") + 1);
		ТекЗначение = ПланыСчетов[ИмяОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаИнд));
		
	ИначеЕсли Лев(ИмяСпискаИсточникаExcel, 22) = "ПланВидовХарактеристик" Тогда
		
		ИмяОбъекта  = СтрЗаменить(ИмяСпискаИсточникаExcel, "ПланВидовХарактеристик.", "");	
		СтрокаИнд 	= Сред(СсылкаЗначенияExcel, Найти(СсылкаЗначенияExcel, "/") + 1);
		ТекЗначение = ПланыВидовХарактеристик[ИмяОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаИнд));
		
	КонецЕсли;
	
	Возврат ТекЗначение;

КонецФункции

// Процедура загружает данные из Excel в табличную часть объекта.
//
// Параметры:
//  СтрОбъекта       - Структура.
//  АдресДанных      - Адрес во временном хранилище.
//  МассивСтрокExcel - Массив.
//  СтруктураДанных  - Структура.
//  СпискиИсточники  - Соответствие.
// 
Процедура ЗагрузитьДанныеТчИзExcelСервер(Знач СтрОбъекта, Знач АдресДанных, Знач МассивСтрокExcel, Знач СтруктураПолей, Знач СтруктураДанных, Знач СпискиИсточники) Экспорт

	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресДанных);
	
	Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
		
		Для каждого СтрExcel Из МассивСтрокExcel Цикл
			НоваяСтрокаТч = ТаблицаДанных.Добавить();
			ЗаполнитьСтрокуДаннымиИзExcel(НоваяСтрокаТч, СтруктураПолей, СтрExcel, СтруктураДанных, СпискиИсточники);					
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ТаблицаДанных) = Тип("ДеревоЗначений") Тогда
		
		КореньДерева = ТаблицаДанных.Строки;
		СдвигУровня  = 0;
		СтарыйУровень = 1;
		СтрокаДз = ТаблицаДанных;
		ЭтоПерваяСтрока = Истина;
				
		СтруктураУровней = Новый Структура;
		СтруктураУровней.Вставить("Уровень1", КореньДерева);
		    	
		Для каждого СтрExcel Из МассивСтрокExcel Цикл
			
			УрЕх = ПолучитьЗначениеДляИБИзДанныхПоляExcel(СтрExcel, "Доп_Уровень", СтруктураПолей.Доп_Уровень, СтруктураДанных, СпискиИсточники);
			Попытка
			 	ПроверкаУровня = Число(УрЕх);		
			Исключение
				УрЕх = 1;
			КонецПопытки;
			
			Если УрЕх < 1 ИЛИ ЭтоПерваяСтрока Тогда
				ВеткаДерева = КореньДерева;
			ИначеЕсли УрЕх > СтарыйУровень Тогда
				ВеткаДерева = СтрокаДз.Строки;
				Для i = СтарыйУровень + 1 По УрЕх Цикл
					СтруктураУровней.Вставить("Уровень"+i, ВеткаДерева);
				КонецЦикла;
			ИначеЕсли УрЕх < СтарыйУровень Тогда
				СтруктураУровней.Свойство("Уровень"+УрЕх, ВеткаДерева);
			КонецЕсли;
			
			СтрокаДз = ВеткаДерева.Добавить();
			Если СтрОбъекта.ВидОбъекта = "Справочники" И СтрОбъекта.ИмяОбъекта = "бит_ПравилаТрансляции" Тогда
				// Заполнение для справочника бит_ПравилаТрансляции.
				НастройкаПравилТрансляции = СтрОбъекта.НастройкаПравилТрансляции;
				ЗаполнитьСтрокуДаннымиИзExcelПравилаТрансляции(СтрокаДз, СтруктураПолей, СтрExcel, СтруктураДанных, СпискиИсточники, НастройкаПравилТрансляции);
			Иначе	
				// Заполнение для всех объектов.
				ЗаполнитьСтрокуДаннымиИзExcel(СтрокаДз, СтруктураПолей, СтрExcel, СтруктураДанных, СпискиИсточники);
			КонецЕсли;
			
			ЭтоПерваяСтрока = Ложь;
			СтарыйУровень = УрЕх;
			
		КонецЦикла;
					
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ТаблицаДанных, АдресДанных);

КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаВExcel

// Функция формирует данные необходимые для выгрузки проформы в Excel.
// 
// Параметры:
//  СтруктураПолей 		  - Структура
//  ВыгружатьСоставнойТип - Булево (По умолчанию = Ложь).
// 
// Возвращаемое значение:
//  Структура
// 
Функция ПодготовитьДанныеДляВыгрузкиШаблона(Знач СтруктураНастроекКолонок, Знач ВыгружатьСоставнойТип = Ложь) Экспорт 

	// Подготовка списков для выгрузки
	СпискиВыгрузки    = Новый Соответствие;
	ВидыПредставлений = Новый Массив;
	
	СтруктураПолей = СтруктураНастроекКолонок.СтруктураПолей;
	Если СтруктураНастроекКолонок.Свойство("ТаблицаОтборов") Тогда
		ТаблицаОтборов = СтруктураНастроекКолонок.ТаблицаОтборов.Получить();
	Иначе	
		ТаблицаОтборов = Неопределено;
	КонецЕсли;
	
    // Список Булево
	СписокБулево = Новый СписокЗначений;
	СписокБулево.Добавить("Истина"  , "Да");
	СписокБулево.Добавить("Ложь"    , "Нет"); 	
	СпискиВыгрузки.Вставить("Булево", СписокБулево);
	    
    Для каждого КлЗнчПоля Из СтруктураПолей Цикл
		
		СтруктураПоля = КлЗнчПоля.Значение;
		Если НЕ СтруктураПоля.ВыгружатьСписки Тогда
			Продолжить;	
		КонецЕсли;
		Если СтруктураПоля.ПримитивныйТип Тогда
			Продолжить;	
		КонецЕсли;
		Если НЕ ВыгружатьСоставнойТип И СтруктураПоля.СоставнойТип Тогда
			Продолжить;	
		КонецЕсли;
		
        СтрТип = СтруктураПоля.СтрТип;		
		
		Если СтруктураПоля.СоставнойТип Тогда
			СписокВыгрузки = ВыгружаемыйСписокИсточников(СтруктураПоля, СтрТип, ТаблицаОтборов, Истина);	
		Иначе
			СписокВыгрузки = ВыгружаемыйСписокИсточника(СтруктураПоля, СтрТип, ТаблицаОтборов, Истина);			
		КонецЕсли;	
						
		Если СписокВыгрузки.Количество() > 0 Тогда
			Если ТаблицаОтборов = Неопределено Тогда
				СпискиВыгрузки.Вставить(СтрТип, СписокВыгрузки);	
			Иначе
				НайденныеОтборы = ТаблицаОтборов.НайтиСтроки(Новый Структура("ИмяРеквизита", СтруктураПоля.Имя));
				Если НайденныеОтборы.Количество() = 0 Тогда
					СпискиВыгрузки.Вставить(СтрТип, СписокВыгрузки);
				Иначе	
					СпискиВыгрузки.Вставить(СтруктураПоля.Имя, СписокВыгрузки);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтруктураПоля.ТипРеквизита = Новый ОписаниеТипов("ВидСчета") Тогда
			СписокДляВыбора = Новый СписокЗначений;	
			Для каждого ЭлементВид Из ВидСчета Цикл
				ЭлементСтрокой = Строка(ЭлементВид);
				СписокДляВыбора.Добавить(ЭлементСтрокой, ЭлементСтрокой);	
			КонецЦикла;
			СпискиВыгрузки.Вставить("Вид", СписокДляВыбора);	
		КонецЕсли; 
	
	КонецЦикла;
		
	ДанныеВыгрузки = Новый Структура;
	// Списки, которые будут устанавливаться в качестве списков выбора
	ДанныеВыгрузки.Вставить("СпискиВыгрузки", СпискиВыгрузки);
	// Испольуемые виды представлений
	ДанныеВыгрузки.Вставить("ВидыПредставлений", ВидыПредставлений);
	
	Возврат ДанныеВыгрузки;
	
КонецФункции // ПодготовитьДанныеДляВыгрузкиШаблона()

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыгрузкаСписков

// Функция формирует текст запроса, для извлечения данных списков выгружаемых в Эксель.
// В Эксель списки используются в качестве списков выбора для полей соответсвующих типов.
// 
// Параметры:
//  СтруктураПоля     	   - Структура.
//  СтрТип                 - Строка
//  ТаблицаОтборов 		   - ТаблицаЗначений (По умолчанию = Неопределено).
//  ВыражениеПредставления - Строка (По умолчанию = "").
// 
// Возвращаемое значение:
//  Запрос.
// 
Функция ЗапросДляВыгрузкиДанных(СтруктураПоля, СтрТип, ТаблицаОтборов = Неопределено, ВыражениеПредставления = "")
	
	ИмяРеквизита = СтруктураПоля.Имя;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "";
	ТипВидСчета = Новый ОписаниеТипов("ВидСчета");
	
	Если СтруктураПоля.ИскатьПо <> Неопределено Тогда
		Если СтруктураПоля.ТипРеквизита = ТипВидСчета Тогда
			Возврат Запрос;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтруктураПоля.ИскатьПо) Тогда	
			ТекстСообщения = НСтр("ru='Не заполнено значение настройки ""Искать по"" для реквизита ""%1"".';
							 	  |en='The value of the setting ""Search by"" is not filled in for the variable ""%1"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяРеквизита); 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Запрос;
		КонецЕсли;
		Если СтруктураПоля.ИскатьПо = "НомерДата" Тогда
			ВыражениеПредставления = " ТекТаб.Номер КАК Номер,
									 | ТекТаб.Дата КАК Дата";
		Иначе	
			ВыражениеПредставления = СтрШаблон("Ссылка.%1 КАК Представление", СтруктураПоля.ИскатьПо);
		КонецЕсли;	
	КонецЕсли;
	
	// Заготовки для формирования текста запроса.
	ШаблонЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   ""%ИмяПолное%"" КАК ИмяПолное,
	|   ""%ИмяОбъекта%"" КАК ИмяОбъекта,
	|   %ВыражениеПредставления%,
	|	ТекТаб.Ссылка КАК Ссылка
	|{ВЫБРАТЬ
	| Представление.*,
	| Ссылка.*}
	|ИЗ
	|	%ИмяТаблицы% КАК ТекТаб
	|";
					
	ШаблонОбъединить = "
	|ОБЪЕДИНИТЬ ВСЕ
	|";
					   
    ШаблонНеГруппа = "
	|ГДЕ
	|(НЕ ТекТаб.ЭтоГруппа)
	|";
					
	ШаблонГруппа = "
	|ГДЕ
	|(ТекТаб.ЭтоГруппа)
	|";				
					
	ШаблонИнстр = "
	|{ГДЕ
	| ТекТаб.Ссылка.*}
	|{УПОРЯДОЧИТЬ ПО
	| Ссылка.*}
	|";
					   
	ШаблонАвтоУп = "АВТОУПОРЯДОЧИВАНИЕ";	
	
	Типы = бит_ОбщегоНазначенияКлиентСервер.ПолучитьТипыИзСтроки(СтрТип);
	
	Описание = Новый ОписаниеТипов(Типы);
	
	Для каждого ТекТип Из Типы Цикл
		
		Если НЕ бит_ОбщегоНазначенияКлиентСервер.ЭтоПримитивныйТип(ТекТип) Тогда
			
			МетаОбъект = Метаданные.НайтиПоТипу(ТекТип);			
			Если МетаОбъект <> Неопределено Тогда
				
				ИмяПолное = МетаОбъект.ПолноеИмя();
				СтрИмена = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ИмяПолное);
				ИмяТаблицы = СтрИмена.ИмяКласса + "." + СтрИмена.ИмяОбъекта;					  
			
			
				ТекстТекТаблица = ШаблонЗапроса;
				ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица, "%ИмяПолное%" , ИмяПолное);
				ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица, "%ИмяОбъекта%", СтрИмена.ИмяОбъекта);					  
				ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица, "%ИмяТаблицы%", ИмяТаблицы);
													
				Если ПустаяСтрока(ВыражениеПредставления) ИЛИ (СтрИмена.ИмяКласса = "Перечисление"
					И бит_ОбщегоНазначения.ОбъектПринадлежитКоллекцииМетаданных("Перечисления", СтрИмена.ИмяОбъекта)) Тогда	
					ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица, "%ВыражениеПредставления%", "ПредставлениеСсылки(ТекТаб.Ссылка) КАК Представление");
				Иначе				
					ВыражениеПредставления = СтрЗаменить(ВыражениеПредставления, "Ссылка.", "ТекТаб.");
					ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица, "%ВыражениеПредставления%", ВыражениеПредставления);					
				КонецЕсли; 
				
				Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда					
					ТекстТекТаблица = СтрЗаменить(ТекстТекТаблица, "РАЗРЕШЕННЫЕ", "");					
				КонецЕсли; 
				
				// Группы не выгружаем.
				Если СтрИмена.ИмяКласса = "Справочник"
					И бит_ОбщегоНазначения.ОбъектПринадлежитКоллекцииМетаданных("Справочники", СтрИмена.ИмяОбъекта) Тогда
					
					Если МетаОбъект.Иерархический 
						И МетаОбъект.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда						
						Если ИмяРеквизита = "Родитель" Тогда
							ТекстТекТаблица = ТекстТекТаблица + ШаблонГруппа;
						Иначе
							ТекстТекТаблица = ТекстТекТаблица + ШаблонНеГруппа;
						КонецЕсли;						
					КонецЕсли; 
										
				КонецЕсли; 
				
				ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", ШаблонОбъединить) + ТекстТекТаблица;
				
			КонецЕсли; 
			
		КонецЕсли; // Тип не примитивный
		
	КонецЦикла; // Типы
	
	Запрос.Текст = ТекстЗапроса;
	
	Если СтруктураПоля.Свойство("ЭтоДополнительныйРеквизит") И СтруктураПоля.ЭтоДополнительныйРеквизит 
		И СтруктураПоля.ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда		
		ИзменитьЗапросДобавитьОтборПоВладельцу(ИмяРеквизита, Запрос, СтруктураПоля.ДополнительныйРеквизит);				
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда				
		Если ТаблицаОтборов <> Неопределено Тогда
			бит_ОбменДанными.ИзменитьЗапросПоОтборам(ИмяРеквизита, Запрос, ТаблицаОтборов);
		КонецЕсли;		
		Запрос.Текст = Запрос.Текст + ШаблонИнстр + ШаблонАвтоУп;		
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции // ЗапросДляВыгрузкиДанных()

// Функция извлекает из БД список для выгрузки в Эксель.
// В Эксель список будет установлен в качестве списка выбора для полей соответсвующих типов.
// 
// Параметры:
//  СтруктураПоля					   - Структура.
//  СтрТип 	                           - Строка.
//  ТаблицаОтборов 					   - ТаблицаЗначений (По умолчанию = Неопределено).
//  ВыгружатьПредставлениеПеречисления - Булево (По умолчанию = Ложь).
// 
// Возвращаемое значение:
//  СписокЗначений - список выгрузки.
// 
Функция ВыгружаемыйСписокИсточника(СтруктураПоля, СтрТип, ТаблицаОтборов = Неопределено, ВыгружатьПредставлениеПеречисления = Ложь)
	
	СписокВыгрузки = Новый СписокЗначений;
		
	ЗаполнитьВыгружаемыеДанныеЗапросом(СписокВыгрузки, СтруктураПоля, СтрТип, ТаблицаОтборов, ВыгружатьПредставлениеПеречисления); 
	
	Возврат СписокВыгрузки;
	
КонецФункции // ВыгружаемыйСписокИсточника()

// Функция извлекает из БД список для выгрузки в Эксель.
// В Эксель список будет установлен в качестве списка выбора для полей соответсвующих типов.
// 
// Параметры:
//  СтруктураПоля					   - Структура.
//  СтрТип 	                           - Строка.
//  ТаблицаОтборов 					   - ТаблицаЗначений (По умолчанию = Неопределено).
//  ВыгружатьПредставлениеПеречисления - Булево (По умолчанию = Ложь).
// 
// Возвращаемое значение:
//  СписокЗначений - список выгрузки.
// 
Функция ВыгружаемыйСписокИсточников(СтруктураПоля, СтрТип, ТаблицаОтборов = Неопределено, ВыгружатьПредставлениеПеречисления = Ложь)
	
	СписокВыгрузки = Новый СписокЗначений;
	
	ВсеТипы = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(СтрТип, "/");
	Для каждого ТекущийТип Из ВсеТипы Цикл
		ЗаполнитьВыгружаемыеДанныеЗапросом(СписокВыгрузки, СтруктураПоля, ТекущийТип, ТаблицаОтборов, ВыгружатьПредставлениеПеречисления);	
	КонецЦикла;
			
	Возврат СписокВыгрузки;
	
КонецФункции // ВыгружаемыйСписокИсточников()

// Процедура извлекает из БД список для выгрузки в Эксель.
// В Эксель список будет установлен в качестве списка выбора для полей соответсвующих типов.
// 
// Параметры:
//  СписокВыгрузки					   - СписокЗначений.
//  СтруктураПоля					   - Структура.
//  СтрТип 	                           - Строка.
//  ТаблицаОтборов 					   - ТаблицаЗначений (По умолчанию = Неопределено).
//  ВыгружатьПредставлениеПеречисления - Булево (По умолчанию = Ложь).
// 
Процедура ЗаполнитьВыгружаемыеДанныеЗапросом(СписокВыгрузки, СтруктураПоля, СтрТип, ТаблицаОтборов = Неопределено, ВыгружатьПредставлениеПеречисления = Ложь)
		
	Запрос = ЗапросДляВыгрузкиДанных(СтруктураПоля, СтрТип, ТаблицаОтборов);
	
	Если НЕ ПустаяСтрока(Запрос.Текст) Тогда
		
		Попытка			
			Результат = Запрос.Выполнить();			
		Исключение			
			ТекстСообщения = НСтр("ru='Не удалось выгрузить список для типа ""%1"" по причине ""%2"".';
							 	  |en='Failed to unload list for type ""%1"" due to ""%2"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрТип, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Результат = Неопределено;			
		КонецПопытки; 			
						
		Если ТипЗнч(Результат) = Тип("РезультатЗапроса") Тогда
			
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Найти(Выборка.ИмяПолное, "Перечисление") > 0 Тогда
					
					ТекПеречисление = Перечисления[Выборка.ИмяОбъекта];
					ИмяЗначения = бит_ОбщегоНазначения.ПолучитьИмяЗначенияПеречисления(ТекПеречисление, Выборка.Ссылка);
					
					СтрСсылка = Выборка.ИмяПолное + "." + ИмяЗначения;
					СтрПредставление = ?(ВыгружатьПредставлениеПеречисления, Выборка.Представление, ИмяЗначения);								
					
				Иначе	 
					
					СтрСсылка = Выборка.ИмяПолное + "/" + Строка(Выборка.Ссылка.УникальныйИдентификатор());
					Если СтруктураПоля.ИскатьПо = "НомерДата" Тогда
						СтрПредставление = СтрШаблон("%1/%2", Выборка.Номер, Выборка.Дата);
					Иначе	
						СтрПредставление = Выборка.Представление;
					КонецЕсли;					
					
				КонецЕсли; 
				
				СписокВыгрузки.Добавить(СтрСсылка, СокрЛП(СтрПредставление));
				      				
			КонецЦикла; // Выборка
			
		КонецЕсли; // ЕстьРезультат
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьВыгружаемыеДанныеЗапросом()

#КонецОбласти

// Процедура добавляет отборы в запрос.
// 
// Параметры:
//  ИмяОбъекта     - Строка.
//  Запрос 		   - Запрос.
//  ТаблицаОтборов - ТаблицаЗначений.
//
Процедура ИзменитьЗапросДобавитьОтборПоВладельцу(ИмяОбъекта, Запрос, Владелец)
		
	Если ЗначениеЗаполнено(Владелец) Тогда
		
		Если Найти(Запрос.Текст, "ГДЕ") = 0 Тогда
			Запрос.Текст = Запрос.Текст + "
			| ГДЕ 
			|	ТекТаб.Владелец = &Владелец";	
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|	И ТекТаб.Владелец = &Владелец";
		КонецЕсли;
					
		Запрос.УстановитьПараметр("Владелец", Владелец);					
		
	КонецЕсли;

КонецПроцедуры // ИзменитьЗапросДобавитьОтборПоВладельцу()

// Функция получает значение для ИБ по наименованию элемента справочника.
//
// Параметры:
//  ИмяСпискаИсточникаExcel - Строка.
//  ПредставлениеЗначенияExcel - Строка.
//
Функция ПолучитьЗначениеСправочникаПоНаименованию(ИмяСпискаИсточникаExcel, ПредставлениеЗначенияExcel)

    ЗначениеДляИБ = Неопределено;
    
    ИмяОбъекта = СтрЗаменить(ИмяСпискаИсточникаExcel, "СправочникСсылка.", "");
    
    НовОтбор = Новый Структура("Наименование", ПредставлениеЗначенияExcel);
    
    ВыборкаОб = Справочники[ИмяОбъекта].Выбрать(, , НовОтбор);
    Пока ВыборкаОб.Следующий() Цикл
        ТекОбъект = ВыборкаОб.Ссылка;
        Прервать;
    КонецЦикла;	

    Возврат ЗначениеДляИБ;
    
КонецФункции // ПолучитьЗначениеСправочникаПоНаименованию()

// Функция проверяет значение на соответствие типу.
//
// Параметры:
//  ТекТип 					   - Тип.
//  ПредставлениеЗначенияExcel - Строка.
//  ЭтоПримитивныйТип		   - Булево (По умолчанию = Ложь).
// 
// Возвращаемое значение:
//  Любое значение (ЗначениеДляИБ).
//
Функция ПривестиЗначениеПоТипуТипу(ТекТип, ПредставлениеЗначенияExcel, ЭтоПримитивныйТип = Ложь)

	МассивТип = Новый Массив;
	МассивТип.Добавить(ТекТип);
	ТекОписание = Новый ОписаниеТипов(МассивТип);
	
	ТекЗначениеДляИБ = ТекОписание.ПривестиЗначение(ПредставлениеЗначенияExcel);
	Если НЕ ЗначениеЗаполнено(ТекЗначениеДляИБ) И НЕ ЭтоПримитивныйТип Тогда
		
		МетаОб = ТекЗначениеДляИБ.Метаданные();
		ИмяКоллекции = бит_ОбщегоНазначения.ОпределитьИмяКоллекции(МетаОб);
		Если ИмяКоллекции = "Справочники" Тогда
			ТекЗначениеДляИБ = Справочники[МетаОб.Имя].НайтиПоНаименованию(ПредставлениеЗначенияExcel);	
		ИначеЕсли ИмяКоллекции = "Перечисления" Тогда
			Для каждого ТекПереч Из Перечисления[МетаОб.Имя] Цикл
				Если Строка(ТекПереч) = ПредставлениеЗначенияExcel Тогда
				 	ТекЗначениеДляИБ = ТекПереч;				
				КонецЕсли; 			
			КонецЦикла;
		ИначеЕсли ИмяКоллекции = "ПланыВидовХарактеристик" Тогда
			ТекЗначениеДляИБ = ПланыВидовХарактеристик[МетаОб.Имя].НайтиПоНаименованию(ПредставлениеЗначенияExcel);
		КонецЕсли;
	                  
	КонецЕсли;
		
	Возврат ТекЗначениеДляИБ;

КонецФункции // ПривестиЗначениеПоТипуТипу()

// Процедура получает значение для поля ИБ из данных поля Excel.
//
// Параметры:
//  СтрExcel
//  КлЗнПоля - Структура
//  СтруктураДанных - Структура
//  СпискиИсточники
//
// Возвращаемое значение:
//  Любое значение
//
Функция ПолучитьЗначениеДляИБИзДанныхПоляExcel(СтрExcel, ИмяПоля, СтруктураПоля, СтруктураДанных, СпискиИсточники)

	ЗначениеДляИБ = Неопределено;
			
	ИмяПоляТч = ВРег(ИмяПоля); 
	
	Если СтрExcel.Свойство(ИмяПоляТч) Тогда
		
		ПредставлениеЗначенияExcel = СокрЛП(СтрExcel[ИмяПоляТч]);
        Если ЗначениеЗаполнено(ПредставлениеЗначенияExcel) Тогда
            
    		ТипРеквизита = СтруктураПоля.ТипРеквизита;//МетаТчРек[ИмяПоля].Тип;
    		ТипОдин = ТипРеквизита.Типы().Количество() = 1;
    			     
    		Если ТипОдин И ТипРеквизита.Типы()[0] = Тип("Дата") Тогда
    			
    			Попытка
    				// Значение типа "Дата".
    				ЗначениеДляИБ = Дата(ПредставлениеЗначенияExcel);
    			Исключение
    			КонецПопытки;  					
    			
    		ИначеЕсли ТипОдин И ТипРеквизита.Типы()[0] = Тип("Число") Тогда
    			
    			Если НЕ ПустаяСтрока(ПредставлениеЗначенияExcel) Тогда
    				// Значение типа "Число".
    				ЗначениеДляИБ = Число(ПредставлениеЗначенияExcel);
    			КонецЕсли;
    			
    		ИначеЕсли ТипОдин И ТипРеквизита.Типы()[0] = Тип("Строка") Тогда
    			
    			Если НЕ ПустаяСтрока(ПредставлениеЗначенияExcel) Тогда
    				// Значение типа "Строка".
    				ЗначениеДляИБ = ПредставлениеЗначенияExcel;
    			КонецЕсли;
    			
    		ИначеЕсли НЕ ТипОдин И НЕ ПустаяСтрока(ПредставлениеЗначенияExcel) Тогда
    			
    			// Значение составного типа.
    			
    			МассивПримитивныхТипов = Новый Массив;
    			ТипНайден 			   = Ложь;
    			ЕстьТипСтрока 		   = Истина;
    			
    			// Попытка привести значение к сложным типам
    			Для каждого ТекТип Из ТипРеквизита.Типы() Цикл
    				Если бит_ОбщегоНазначения.ЭтоПримитивныйТип(ТекТип) Тогда
    					Если ТекТип <> Тип("Строка") Тогда
    						МассивПримитивныхТипов.Добавить(ТекТип);
    					КонецЕсли;
    				Иначе	
    					ТекЗначениеДляИБ = ПривестиЗначениеПоТипуТипу(ТекТип, ПредставлениеЗначенияExcel);
    					Если ЗначениеЗаполнено(ТекЗначениеДляИБ) Тогда
    						ЗначениеДляИБ = ТекЗначениеДляИБ;
    						ТипНайден = Истина;
    						Прервать; 
    					КонецЕсли;
    				КонецЕсли; 		
    			КонецЦикла;
    			
    			// Попытка привести значение к примитивным типам
    			Если НЕ ТипНайден Тогда
    				ЗнчВерхРег = ВРег(ПредставлениеЗначенияExcel);
    				Для каждого ТекТип Из МассивПримитивныхТипов Цикл
    					Если ТекТип = Тип("Булево") Тогда
    						ЗнчВерхРег = ВРег(ПредставлениеЗначенияExcel);
    						Если ЗнчВерхРег = "ЛОЖЬ" ИЛИ ЗнчВерхРег = "НЕТ" Тогда
    							ЗначениеДляИБ = Ложь;
    						ИначеЕсли ЗнчВерхРег = "ИСТИНА" ИЛИ ЗнчВерхРег = "ДА" Тогда
    							ЗначениеДляИБ = Истина;
    						КонецЕсли;	
    					Иначе
    						ТекЗначениеДляИБ = ПривестиЗначениеПоТипуТипу(ТекТип, ПредставлениеЗначенияExcel, Истина);
    						Если ЗначениеЗаполнено(ТекЗначениеДляИБ) Тогда
    							ЗначениеДляИБ = ТекЗначениеДляИБ;
    							ТипНайден = Истина;
    							Прервать; 
    						КонецЕсли;
    					КонецЕсли;
    			    КонецЦикла;
    			КонецЕсли;
    			
    			// Тип - строка
    			Если НЕ ТипНайден И ЕстьТипСтрока Тогда
    				ЗначениеДляИБ = ПредставлениеЗначенияExcel;
    			КонецЕсли;
    			
    		Иначе
    		
    			ИмяСпискаИсточникаExcel = СтруктураДанных.НастройкиКолонок[ИмяПоляТч].ИмяСписка;
    			СписокИсточникExcel 	= СпискиИсточники.Получить(ИмяСпискаИсточникаExcel);
    			Если СписокИсточникExcel <> Неопределено Тогда
    				
    				СтруктураЗначенияExcel = СписокИсточникExcel.Получить(ПредставлениеЗначенияExcel);
    				Если СтруктураЗначенияExcel <> Неопределено Тогда
    					
    					// Значение найдено (ссылочного типа или булево).
    					ЗначениеДляИБ = ПолучитьЗначениеПоСсылкеExcel(СтруктураЗначенияExcel.Ссылка
                                                                                                    , ИмяСпискаИсточникаExcel
                                                                                                    , ПредставлениеЗначенияExcel);					
    				      					
                    Иначе
                        
                        // Поиск элемента в базе, если в списках excel не найден элемент.
                        
                        Если Найти(ИмяСпискаИсточникаExcel, "СправочникСсылка.") <> 0 Тогда
                            // Для справочников - поиск по наименованию.
                            ЗначениеДляИБ = ПолучитьЗначениеСправочникаПоНаименованию(ИмяСпискаИсточникаExcel, ПредставлениеЗначенияExcel);                            
                        КонецЕсли;
                        
                    КонецЕсли;
    				
    			КонецЕсли; 				
    			
    		КонецЕсли;
		
	    КонецЕсли;
				
	КонецЕсли;
	
	Возврат ЗначениеДляИБ;
	
КонецФункции // ПолучитьЗначениеДляИБИзДанныхПоляExcel()

// Процедура получает значение для поля ИБ из данных поля Excel.
//
// Параметры:
//  СтрExcel.
//  КлЗнПоля - Структура.
//  МетаТчРек - Метаданные табличной части.
//  СтруктураДанных - Структура.
//  СпискиИсточники.
//
// Возвращаемое значение:
//  Любое значение.
//
Функция ПолучитьЗначениеСубконтоДляИБИзДанныхПоляExcel(СтрExcel, ИмяПоля, СтруктураПоля, СтруктураДанных, СчетДляСубконто)

	ЗначениеДляИБ = Неопределено;
			
	ИмяПоляТч = ВРег(ИмяПоля);
		
	Если СтрExcel.Свойство(ИмяПоляТч) Тогда
		 		
		Если ЗначениеЗаполнено(СчетДляСубконто) Тогда
			
			// Свойства счета.
			СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетДляСубконто);
			
			// Поиск типа значения для субконто.
			ТипРеквизита = Неопределено; 
			Ид = СтруктураПоля.ИдСубконто;			
			Если Ид <> Неопределено Тогда				
				// Поиск вида субконто по номеру субконто.	                			
				Если СвСч.КоличествоСубконто > Ид Тогда // Ид(от 0) не выходит за количство видов субконто(от 1)
					ТипРеквизита = СвСч[СтрШаблон("ВидСубконто%1ТипЗначения", Строка(Ид+1))];	
				КонецЕсли;				
			Иначе				
				// Поиск вида субконто по наименованию или предопределенному имени субконто.				
				Если СтруктураПоля.Свойство("ИмяСубконто") Тогда					
					Для Сч = 1 По СвСч.КоличествоСубконто Цикл						
						ТекущееСубконто = СвСч[СтрШаблон("ВидСубконто%1", Сч)];
						Если ТекущееСубконто.Предопределенный Тогда
							// Предопределенное имя.
							ИмяСубконтоДляПроверки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущееСубконто, "ИмяПредопределенныхДанных");
						Иначе	
							// Обычное наименование.
							ИмяСубконтоДляПроверки = СвСч[СтрШаблон("ВидСубконто%1Наименование", Сч)];
						КонецЕсли;
						Если ИмяСубконтоДляПроверки = СтруктураПоля.ИмяСубконто Тогда
							ТипРеквизита = СвСч[СтрШаблон("ВидСубконто%1ТипЗначения", Сч)];
							Прервать;					
						КонецЕсли;						
					КонецЦикла;						
				КонецЕсли;				
			КонецЕсли;
						
            Если ТипРеквизита <> Неопределено Тогда 
								
				// Значение из Exel.
				ПредставлениеЗначенияExcel = СокрЛП(СтрExcel[ИмяПоляТч]);
				// На серверной базе образуются не те пробелы при загрузке из файла.
				ПредставлениеЗначенияExcel = СтрЗаменить(ПредставлениеЗначенияExcel, Символы.НПП, " ");
                
                Для каждого ТекТип Из ТипРеквизита.Типы() Цикл
                    
                    МетаОбъекта  = Метаданные.НайтиПоТипу(ТекТип);
    				ИмяКоллекции = бит_ОбщегоНазначения.ОпределитьИмяКоллекции(МетаОбъекта);
					
					ТекЗначение = Неопределено;
    				
    				Если ИмяКоллекции = "Справочники" Тогда
						
						Если Метаданные.Справочники[МетаОбъекта.Имя].ДлинаНаименования = 0 Тогда
							ТекЗначение = Справочники[МетаОбъекта.Имя].НайтиПоНаименованию(ПредставлениеЗначенияExcel);
						Иначе	
							ТекЗначение = Справочники[МетаОбъекта.Имя].НайтиПоНаименованию(ПредставлениеЗначенияExcel, Истина);
						КонецЕсли;
    											
					ИначеЕсли ИмяКоллекции = "Перечисления" Тогда
						
						Значения = Метаданные.Перечисления[МетаОбъекта.Имя].ЗначенияПеречисления;
						Для каждого ЗначениеПеречисления Из Значения Цикл
							Если ЗначениеПеречисления.Синоним = ПредставлениеЗначенияExcel Тогда
								ТекЗначение = Перечисления[МетаОбъекта.Имя][ЗначениеПеречисления.Имя];
								Прервать;
							КонецЕсли;						
						КонецЦикла; 
						
					ИначеЕсли ИмяКоллекции = "Документы" Тогда
						
						// ПредставлениеЗначенияExcel должно быть вида: "ИмяТипаДокумента + " " + НомерДокумента + " от " + ДатаДокумента".
						// Пример: "Принятие к учету ОС МУ00-000001 от 02.07.2019 11:27:54".
						// Сравнение имени типа документа.
						СинонимТипаДокумента = Строка(ТекТип);
						СтрДлинаИмяТипаДокумента = СтрДлина(СинонимТипаДокумента);
						Если Лев(ПредставлениеЗначенияExcel, СтрДлинаИмяТипаДокумента) <> СинонимТипаДокумента Тогда
							Продолжить;					
						КонецЕсли;
						// Поиск даты документа.
						Попытка
							ДатаДокумента = Дата(Прав(ПредставлениеЗначенияExcel, 19));					
						Исключение
							Продолжить;
						КонецПопытки;						
						// Поиск номера документа.
						ДлинаНомера = Метаданные.Документы[МетаОбъекта.Имя].ДлинаНомера;
						НомерДокумента = СокрЛП(Сред(ПредставлениеЗначенияExcel, СтрДлинаИмяТипаДокумента+2, ДлинаНомера));											
						// Поиск документа.
						Попытка
							ВыборкаДокументов = Документы[МетаОбъекта.Имя].Выбрать(ДатаДокумента, ДатаДокумента);
							Пока ВыборкаДокументов.Следующий() Цикл
								Если ВыборкаДокументов.Номер = НомерДокумента Тогда
									ТекЗначение = ВыборкаДокументов.Ссылка;
								КонецЕсли;												
							КонецЦикла;
						Исключение
							Продолжить;
						КонецПопытки;					
						
    				КонецЕсли;                	
					
					Если ЗначениеЗаполнено(ТекЗначение) Тогда    					
						ЗначениеДляИБ = ТекЗначение;
                        Прервать;    					
					КонецЕсли;
						
                КонецЦикла;				
				
			КонецЕсли;
		    
		КонецЕсли;
						
	КонецЕсли;
	
	Возврат ЗначениеДляИБ;
	
КонецФункции // ПолучитьЗначениеСубконтоДляИБИзДанныхПоляExcel()

Процедура ЗаполнитьСтрокуДаннымиИзExcel(НоваяСтрокаТч, СтруктураПолей, СтрExcel, СтруктураДанных, СпискиИсточники, ЭтоГруппа = Неопределено)

	Для каждого КлЗнПоля Из СтруктураПолей Цикл
			                                          			
        ИмяПоля       = КлЗнПоля.Ключ;
        СтруктураПоля = КлЗнПоля.Значение;
        
        Если ЭтоГруппа <> Неопределено Тогда
            Если ИмяПоля = "ЭтоГруппа" Тогда
                Продолжить;       
            КонецЕсли;
            Если (ЭтоГруппа И НЕ СтруктураПоля.ИспользованиеДляГруппы)
                 ИЛИ (НЕ ЭтоГруппа И НЕ СтруктураПоля.ИспользованиеДляЭлемента) Тогда
                 Продолжить;               
            КонецЕсли;
        КонецЕсли;       
        
        Если СтруктураПоля.ЭтоДополнение Тогда
             Продолжить;		
        КонецЕсли;
        
        Если СтруктураПоля.ЭтоСубконто Тогда
            
            ПолеСчет = СтруктураПоля.ПолеСчет;
            Если ПолеСчет = Неопределено Тогда
                 ЗначениеДляИБ = ПолучитьЗначениеДляИБИзДанныхПоляExcel(СтрExcel, ИмяПоля, СтруктураПоля, СтруктураДанных, СпискиИсточники);
            Иначе	
                СчетДляСубконто = НоваяСтрокаТч[ПолеСчет];
                ЗначениеДляИБ = ПолучитьЗначениеСубконтоДляИБИзДанныхПоляExcel(СтрExcel, ИмяПоля, СтруктураПоля, СтруктураДанных, СчетДляСубконто);
            КонецЕсли;
            
        Иначе	
            
            ЗначениеДляИБ = ПолучитьЗначениеДляИБИзДанныхПоляExcel(СтрExcel, ИмяПоля, СтруктураПоля, СтруктураДанных, СпискиИсточники);
        
        КонецЕсли;
        
        Если ЗначениеДляИБ <> Неопределено Тогда
            НоваяСтрокаТч[ИмяПоля] = ЗначениеДляИБ;	
        КонецЕсли;
                                             
    КонецЦикла;	

КонецПроцедуры // ЗаполнитьСтрокуДаннымиИзExcel()

Процедура ЗаполнитьСтрокуДаннымиИзExcelПравилаТрансляции(НоваяСтрокаТч, СтруктураПолей, СтрExcel, СтруктураДанных, СпискиИсточники, НастройкаПравилТрансляции)

	КолонкиТрансляции = бит_МеханизмТрансляции.ПолучитьКолонкиТрансляции(НастройкаПравилТрансляции);
	ИмяКолонкиСчетИсточник = "";
	ИмяКолонкиУсловие1 = ""; ИмяКолонкиУсловие2 = ""; ИмяКолонкиУсловие3 = "";
	ИмяКолонкиЗначение1 = ""; ИмяКолонкиЗначение2 = ""; ИмяКолонкиЗначение3 = "";
	
	Для каждого КолонкаТрансляции Из КолонкиТрансляции Цикл
		// АПК:1297-выкл Строковый параметр.
		Если КолонкаТрансляции.НаименованиеКолонки = "Источник - Счет" Тогда
			ИмяКолонкиСчетИсточник = КолонкаТрансляции.ИмяКолонки;	
		ИначеЕсли КолонкаТрансляции.НаименованиеКолонки = "Условие №1" Тогда
			ИмяКолонкиУсловие1 = КолонкаТрансляции.ИмяКолонки;	
		ИначеЕсли КолонкаТрансляции.НаименованиеКолонки = "Условие №2" Тогда
			ИмяКолонкиУсловие2 = КолонкаТрансляции.ИмяКолонки;	
		ИначеЕсли КолонкаТрансляции.НаименованиеКолонки = "Условие №3" Тогда
			ИмяКолонкиУсловие3 = КолонкаТрансляции.ИмяКолонки;	
		ИначеЕсли КолонкаТрансляции.НаименованиеКолонки = "Значение №1" Тогда
			ИмяКолонкиЗначение1 = КолонкаТрансляции.ИмяКолонки;
		ИначеЕсли КолонкаТрансляции.НаименованиеКолонки = "Значение №2" Тогда
			ИмяКолонкиЗначение2 = КолонкаТрансляции.ИмяКолонки;
		ИначеЕсли КолонкаТрансляции.НаименованиеКолонки = "Значение №3" Тогда
			ИмяКолонкиЗначение3 = КолонкаТрансляции.ИмяКолонки;
		КонецЕсли;
		// АПК:1297-вкл.
		Если НЕ СтрExcel.Свойство(КолонкаТрансляции.ИмяКолонки) Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось загрузить данные файла. Имена колонок в файле не соответсвует настройкам правил трансляции.'; 
				  			  	  |en = 'Failed to load file data. The column names in the file do not match the translation rule settings.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЦикла;	
	
	Для каждого КлЗнПоля Из СтруктураПолей Цикл
			                                          			
        ИмяПоля       = КлЗнПоля.Ключ;
        СтруктураПоля = КлЗнПоля.Значение;
                
		Если СтруктураПоля.ЭтоДополнение Тогда
		     Продолжить;		
		КонецЕсли;
        
		Если ИмяПоля = ИмяКолонкиЗначение1 ИЛИ ИмяПоля = ИмяКолонкиЗначение2 ИЛИ ИмяПоля = ИмяКолонкиЗначение3 Тогда
			
			Если ИмяПоля = ИмяКолонкиЗначение1 Тогда
				ИмяПоляУсловия = ИмяКолонкиУсловие1;
			ИначеЕсли ИмяПоля = ИмяКолонкиЗначение2 Тогда
				ИмяПоляУсловия = ИмяКолонкиУсловие2;
			ИначеЕсли ИмяПоля = ИмяКолонкиЗначение3 Тогда
				ИмяПоляУсловия = ИмяКолонкиУсловие3;
			КонецЕсли;
			
			ПолеУсловия = СтрExcel[ИмяПоляУсловия];
			
			МассивИмениУсловия = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(ПолеУсловия, ".");
			Если МассивИмениУсловия.Количество() > 1 И МассивИмениУсловия[1] = "Субконто" Тогда
												
				СохранениеИдСубконто  = СтруктураПоля.ИдСубконто;
				СохранениеПолеСчет 	  = СтруктураПоля.ПолеСчет;
				СтруктураПоля.Вставить("ИдСубконто" , Неопределено);
				СтруктураПоля.Вставить("ИмяСубконто", МассивИмениУсловия[2]);				
				СтруктураПоля.Вставить("ПолеСчет"   , СтрExcel[ИмяКолонкиСчетИсточник]);
				СчетДляСубконто = НоваяСтрокаТч[ИмяКолонкиСчетИсточник];
				Если ЗначениеЗаполнено(СчетДляСубконто) Тогда
					ЗначениеДляИБ = ПолучитьЗначениеСубконтоДляИБИзДанныхПоляExcel(СтрExcel, ИмяПоля, СтруктураПоля, СтруктураДанных, СчетДляСубконто);
				КонецЕсли;
	        	СтруктураПоля.Вставить("ИдСубконто", СохранениеИдСубконто);
				СтруктураПоля.Вставить("ПолеСчет"  , СохранениеПолеСчет);
				
			Иначе
				
				ЗначениеДляИБ = ПолучитьЗначениеДляИБИзДанныхПоляExcel(СтрExcel, ИмяПоля, СтруктураПоля, СтруктураДанных, СпискиИсточники);	
				
			КонецЕсли;
			
		Иначе
			
			ЗначениеДляИБ = ПолучитьЗначениеДляИБИзДанныхПоляExcel(СтрExcel, ИмяПоля, СтруктураПоля, СтруктураДанных, СпискиИсточники);
			
		КонецЕсли;
		        
        Если ЗначениеДляИБ <> Неопределено Тогда
            НоваяСтрокаТч[ИмяПоля] = ЗначениеДляИБ;	
        КонецЕсли;
                                             
    КонецЦикла;	

КонецПроцедуры // ЗаполнитьСтрокуДаннымиИзExcelПравилаТрансляции()

#КонецОбласти
