#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиОбновленияИБ

// Процедура конвертирует сохраненные настройки пользователей 
// для обработки бит_рлс_НастройкаПравДоступаНаУровнеЗаписей_Построитель
//
Процедура КонвертироватьНастройки() Экспорт	
	
	ТипРежимаПоиска = Новый ОписаниеТипов("ПеречислениеСсылка.бит_РежимыПоискаОбъекта");
	МетаданныеОбъекта = Метаданные.Справочники.бит_СохраненныеНастройки;
	ЕстьОшибки = Ложь;
	
	//----------------------------------------------------------------------
	// Выбор сохраненных настроек
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастраиваемыйОбъект", "Обработка.бит_ЗагрузкаДанныхИзТабличногоДокумента");
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	бит_СохраненныеНастройки.Ссылка,
	|	бит_СохраненныеНастройки.НастраиваемыйОбъект,
	|	бит_СохраненныеНастройки.ХранилищеНастроек
	|ИЗ
	|	Справочник.бит_СохраненныеНастройки КАК бит_СохраненныеНастройки
	|ГДЕ
	|	бит_СохраненныеНастройки.НастраиваемыйОбъект = &НастраиваемыйОбъект
	|	И бит_СохраненныеНастройки.ПометкаУдаления = ЛОЖЬ
	|";
	Результат = Запрос.Выполнить();	
	
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл
				
		СтруктураНастроек = Выборка.ХранилищеНастроек.Получить();
		Если СтруктураНастроек = Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		 		
		СпрСсылка = Выборка.Ссылка;	
		
		НачатьТранзакцию();
		Попытка
	
			// Блокируем объект от изменения другими сеансами.
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.бит_СохраненныеНастройки");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СпрСсылка);
			Блокировка.Заблокировать();
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
	
			ЕстьИзменения = Ложь;
			НастройкиРеквизитов = СтруктураНастроек.ТаблицаРеквизитов.Получить();
		
			// Конвертация режима загрузки.
			Если ТипЗнч(СтруктураНастроек.РежимЗагрузки) <> Тип("ПеречислениеСсылка.бит_РежимыЗагрузки") Тогда
				Если СтруктураНастроек.РежимЗагрузки = "Справочник" Тогда
					СтруктураНастроек.РежимЗагрузки = Перечисления.бит_РежимыЗагрузки.Справочник;
				ИначеЕсли СтруктураНастроек.РежимЗагрузки = "РегистрСведений" Тогда
					СтруктураНастроек.РежимЗагрузки = Перечисления.бит_РежимыЗагрузки.РегистрСведений;	
				ИначеЕсли СтруктураНастроек.РежимЗагрузки = "ТабличнаяЧасть" Тогда
					СтруктураНастроек.РежимЗагрузки = Перечисления.бит_РежимыЗагрузки.ТабличнаяЧасть;
				ИначеЕсли СтруктураНастроек.РежимЗагрузки = "РучнаяОперация" Тогда
					СтруктураНастроек.РежимЗагрузки = Перечисления.бит_РежимыЗагрузки.РучнаяОперация;
				ИначеЕсли СтруктураНастроек.РежимЗагрузки = "ПланСчетов" Тогда
					СтруктураНастроек.РежимЗагрузки = Перечисления.бит_РежимыЗагрузки.ПланСчетов;
				КонецЕсли;
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			// Конвертация режима поиска в таблице реквизитов.		
			Если НастройкиРеквизитов.Колонки.Найти("РежимЗагрузки") <> Неопределено Тогда			
				НастройкиРеквизитов.Колонки.Добавить("РежимПоиска", ТипРежимаПоиска);
				Для каждого НастройкаРеквизитов Из НастройкиРеквизитов Цикл
					Если НастройкаРеквизитов.РежимЗагрузки = "Искать" Тогда
						НастройкаРеквизитов.РежимПоиска = Перечисления.бит_РежимыПоискаОбъекта.Искать;
					ИначеЕсли НастройкаРеквизитов.РежимЗагрузки = "Устанавливать" Тогда
						НастройкаРеквизитов.РежимПоиска = Перечисления.бит_РежимыПоискаОбъекта.Устанавливать;	
					ИначеЕсли НастройкаРеквизитов.РежимЗагрузки = "Вычислять" Тогда
						НастройкаРеквизитов.РежимПоиска = Перечисления.бит_РежимыПоискаОбъекта.Вычислять;
					КонецЕсли;
				КонецЦикла;
				НастройкиРеквизитов.Колонки.Удалить("РежимЗагрузки");
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			// Поля поиска для документов.
			Для каждого НастройкаРеквизитов Из НастройкиРеквизитов Цикл
				Если НастройкаРеквизитов.ИскатьПо = "Номер" ИЛИ НастройкаРеквизитов.ИскатьПо = "Дата" Тогда
					НастройкаРеквизитов.ИскатьПо = "НомерДата";
					ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЦикла;
			
			// Запись.
			Если ЕстьИзменения Тогда			
				СтруктураНастроек.ТаблицаРеквизитов = Новый ХранилищеЗначения(НастройкиРеквизитов);
				СпрОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9));				
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);							
			КонецЕсли;
			
		ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось записать настройку: %1 по причине: %2';
								  |en = 'Failed to write setting: %1 due to: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СпрСсылка, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			СобытиеЖурналаРегистрации = ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации();
			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Предупреждение,
									 МетаданныеОбъекта, , ТекстСообщения);
			ЕстьОшибки = Истина;
			Продолжить;
		КонецПопытки;
	
	КонецЦикла;
	
КонецПроцедуры // КонвертироватьНастройки()

#КонецОбласти

#КонецОбласти

#КонецЕсли