#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ИдентификаторДокумента(ПрисоединенныйФайл) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПрисоединенныйФайл", ПрисоединенныйФайл);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаРегистра.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.ИдентификаторыДокументовНаРаботаВРоссии КАК ТаблицаРегистра
		|ГДЕ
		|	ТаблицаРегистра.ПрисоединенныйФайл = &ПрисоединенныйФайл";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Идентификатор;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗапомнитьИдентификатор(ПрисоединенныйФайл, Идентификатор) Экспорт
	
	Запись = РегистрыСведений.ИдентификаторыДокументовНаРаботаВРоссии.СоздатьМенеджерЗаписи();
	Запись.ПрисоединенныйФайл = ПрисоединенныйФайл;
	Запись.Идентификатор = Идентификатор;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли