#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиПечатныхФорм() Экспорт
	
	Возврат РегистрыСведений.НастройкиПечатныхФормБЗК.Настройки();
	
КонецФункции

Функция СсылкаНаКодДокументаКадровогоМероприятия(КодДокументаКадровогоМероприятия) Экспорт
	
	Возврат Справочники.КодыДокументовКадровыхМероприятий.НайтиПоКоду(КодДокументаКадровогоМероприятия);
	
КонецФункции

Функция КодКадровогоДокументаПоУмолчанию() Экспорт
	
	Возврат ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.КодыДокументовКадровыхМероприятий.ИныеДокументы");
	
КонецФункции

Функция СвойстваКодаКадровогоДокумента(Знач КодДокументаКадровогоМероприятия = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(КодДокументаКадровогоМероприятия) Тогда
		КодДокументаКадровогоМероприятия = КодКадровогоДокументаПоУмолчанию();
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КодДокументаКадровогоМероприятия, "Код,НаименованиеПолное");
	
КонецФункции

Функция ДанныеМЧДПодписи(МЧД, ИдентификаторХранилища) Экспорт
	
	Возврат ЭлектроннаяПодписьКЭДО.ДанныеМЧДПодписи(МЧД, Новый УникальныйИдентификатор(ИдентификаторХранилища));
	
КонецФункции

Функция ДокументКЭДОЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументКадровогоЭДО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ДокументКадровогоЭДО КАК ДокументКадровогоЭДО
		|ГДЕ
		|	ДокументКадровогоЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументКадровогоЭДО.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти