#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьНастройкиОбъектовВизированияПоУмолчанию() Экспорт
	
	ИменаОбъектовВизирования = Новый Массив;
	ТипыОбъектовВизирования = Метаданные.ОпределяемыеТипы.бит_ОбъектыВизирования.Тип.Типы();
	Для каждого ТипОбъекта Из ТипыОбъектовВизирования Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипОбъекта);
		ИменаОбъектовВизирования.Добавить(МетаданныеОбъекта.ПолноеИмя());
	КонецЦикла;
	
	МодульВизирование  = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
	ОтключенныеОбъекты = МодульВизирование.ОбъектыВизированияОтлюченныеПоУмолчанию();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыСистемы.Ссылка КАК ОбъектСистемы,
	|	ВЫБОР
	|		КОГДА ОбъектыСистемы.ИмяОбъектаПолное В (&ОтключенныеОбъекты)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИспользоватьВизирование,
	|	ЗНАЧЕНИЕ(Перечисление.бит_РежимыОбновленияПеречняВиз.ПоУмолчанию) КАК РежимОбновленияВиз,
	|	ЗНАЧЕНИЕ(Перечисление.бит_ВидыКонтроля.НеКонтролировать) КАК РежимКонтроляВложений
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкиОбъектовВизирования КАК НастроенныеОбъекты
	|		ПО ОбъектыСистемы.Ссылка = НастроенныеОбъекты.ОбъектСистемы
	|ГДЕ
	|	ОбъектыСистемы.ИмяОбъектаПолное В(&ИменаОбъектовВизирования)
	|	И НЕ ОбъектыСистемы.ПометкаУдаления
	|	И НастроенныеОбъекты.ОбъектСистемы ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ИменаОбъектовВизирования", ИменаОбъектовВизирования);
	Запрос.УстановитьПараметр("ОтключенныеОбъекты", ОтключенныеОбъекты);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.бит_НастройкиОбъектовВизирования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектСистемы.Установить(Выборка.ОбъектСистемы);
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли