
#Область ПрограммныйИнтерфейс

#Область ЗначенияСубконто

// Функция определяет субконто номенклатурные группы.
// 
// Параметры:
//  Счет - ПланСчетовСсылка.Хозрасчетный, ПланСчетовСсылка.бит_Бюджетирование, 
// 		   ПланСчетовСсылка.бит_Дополнительный_1, ПланСчетовСсылка.бит_Дополнительный_2,
//		   ПланСчетовСсылка.бит_Дополнительный_3, ПланСчетовСсылка.бит_Дополнительный_4, ПланСчетовСсылка.бит_Дополнительный_5.
//
// Возвращаемое значение:
//  ПланВидовХарактеристик.ВидыСубконтоХозрасчетные, ПланВидовХарактеристик.бит_ВидыСубконтоБюджетирования,
//  ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_1,
//  ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_2,
//  ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_3,
//  ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_4,
//  ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_5,
//  Неопределено
//
Функция СубконтоНоменклатурныеГруппы(Знач Счет) Экспорт

	Если ЕстьТиповойПланСчетовХозрасчетный() И ТипЗнч(Счет) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Бюджетирование") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоБюджетирования.НоменклатурныеГруппы");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Дополнительный_1") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_1.НоменклатурныеГруппы");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Дополнительный_2") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_2.НоменклатурныеГруппы");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Дополнительный_3") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_3.НоменклатурныеГруппы");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Дополнительный_4") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_4.НоменклатурныеГруппы");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Дополнительный_5") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_5.НоменклатурныеГруппы");
	Иначе
		Субконто = Неопределено;
	КонецЕсли;
	
	Возврат Субконто;

КонецФункции

// Функция определяет субконто договоры.
// 
// Параметры:
//  Счет - ПланСчетовСсылка.Хозрасчетный, ПланСчетовСсылка.бит_Бюджетирование, 
// 		   ПланСчетовСсылка.бит_Дополнительный_1, ПланСчетовСсылка.бит_Дополнительный_2,
//		   ПланСчетовСсылка.бит_Дополнительный_3, ПланСчетовСсылка.бит_Дополнительный_4, ПланСчетовСсылка.бит_Дополнительный_5.
//
// Возвращаемое значение:
//  ПланВидовХарактеристик.ВидыСубконтоХозрасчетные, ПланВидовХарактеристик.бит_ВидыСубконтоБюджетирования,
//  ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_1,
//  ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_2,
//  ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_3,
//  ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_4,
//  ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_5,
//  Неопределено
//
Функция СубконтоДоговоры(Знач Счет) Экспорт

	Если ЕстьТиповойПланСчетовХозрасчетный() И ТипЗнч(Счет) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Бюджетирование") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоБюджетирования.ДоговорыКонтрагентов");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Дополнительный_1") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_1.ДоговорыКонтрагентов");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Дополнительный_2") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_2.ДоговорыКонтрагентов");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Дополнительный_3") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_3.ДоговорыКонтрагентов");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Дополнительный_4") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_4.ДоговорыКонтрагентов");
	ИначеЕсли ТипЗнч(Счет) = Тип("ПланСчетовСсылка.бит_Дополнительный_5") Тогда
		Субконто = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_5.ДоговорыКонтрагентов");
	Иначе
		Субконто = Неопределено;
	КонецЕсли;
	
	Возврат Субконто;

КонецФункции

// Функция определяет соответствует ли значение типу субконто.
// 
// Параметры:
//  Значение - Любое значение.
//
// Возвращаемое значение:
//  Булево - значение содержит тип субконто.
//
Функция ЭтоВидСубконто(Знач Значение) Экспорт

	Типы = Новый Массив(); 
	Типы.Добавить(Тип("ПланВидовХарактеристикСсылка.бит_ВидыСубконтоБюджетирования"));
	Типы.Добавить(Тип("ПланВидовХарактеристикСсылка.бит_ВидыСубконтоДополнительные_1"));
	Типы.Добавить(Тип("ПланВидовХарактеристикСсылка.бит_ВидыСубконтоДополнительные_2"));
	Типы.Добавить(Тип("ПланВидовХарактеристикСсылка.бит_ВидыСубконтоДополнительные_3"));
	Типы.Добавить(Тип("ПланВидовХарактеристикСсылка.бит_ВидыСубконтоДополнительные_4"));
	Типы.Добавить(Тип("ПланВидовХарактеристикСсылка.бит_ВидыСубконтоДополнительные_5"));

	ОписаниеТипов = Новый ОписаниеТипов(Типы);
	Возврат ОписаниеТипов.СодержитТип(ТипЗнч(Значение));
	
КонецФункции
 
#КонецОбласти 

// Функция получает свойство счета.
// 
// Параметры:
//  Счет - ПланСчетовСсылка.Хозрасчетный, ПланСчетовСсылка.бит_Бюджетирование, 
// 		   ПланСчетовСсылка.бит_Дополнительный_1, ПланСчетовСсылка.бит_Дополнительный_2,
//		   ПланСчетовСсылка.бит_Дополнительный_3, ПланСчетовСсылка.бит_Дополнительный_4, ПланСчетовСсылка.бит_Дополнительный_5.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьСвойстваСчета(Знач Счет) Экспорт

	Если Счет = Неопределено Тогда
		ДанныеСчета = ДанныеСчетаПоУмолчанию();
	ИначеЕсли ЕстьТиповойПланСчетовХозрасчетный() И ТипЗнч(Счет) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		Модуль      = ОбщегоНазначения.ОбщийМодуль("БухгалтерскийУчетВызовСервераПовтИсп");
		ДанныеСчета = Модуль.ПолучитьСвойстваСчета(Счет);
	ИначеЕсли ЕстьТиповойПланСчетовМеждународный() И ТипЗнч(Счет) = Тип("ПланСчетовСсылка.Международный") Тогда
		Модуль      = ОбщегоНазначения.ОбщийМодуль("МеждународныйУчетСерверПовтИсп");
		ДанныеСчета = Модуль.СвойстваСчета(Счет);
	Иначе
		ДанныеСчета = ДанныеСчета(Счет);
	КонецЕсли;
	
	Возврат ДанныеСчета;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СвойстваСчетов

Функция ДанныеСчетаПоУмолчанию()

	ДанныеСчета = НовыеПараметрыСчета();
	Возврат Новый ФиксированнаяСтруктура(ДанныеСчета);
	
КонецФункции

Функция ДанныеСчета(Знач Счет)
	
	МенеджерСчета   = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Счет);
	МетаданныеСчета = Счет.Метаданные();
	
	ДанныеСчета          = НовыеПараметрыСчета();
	ДанныеСчета.Ссылка   = МенеджерСчета.ПустаяСсылка();
	ДанныеСчета.Родитель = МенеджерСчета.ПустаяСсылка();
	
	МаксКоличествоСубконто = МетаданныеСчета.МаксКоличествоСубконто;
	Для ИндексСубконто = 1 По МаксКоличествоСубконто Цикл
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", Ложь);
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
		Возврат ДанныеСчета;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПланСчетов.Ссылка КАК Ссылка,
	|	ПланСчетов.Родитель КАК Родитель,
	|	ПланСчетов.Код КАК Код,
	|	ПланСчетов.КодБыстрогоВыбора КАК КодБыстрогоВыбора,
	|	ПланСчетов.Наименование КАК Наименование,
	|	ПланСчетов.Вид КАК Вид,
	|	ПланСчетов.Забалансовый КАК Забалансовый,
	|	ПланСчетов.ЗапретитьИспользоватьВПроводках КАК ЗапретитьИспользоватьВПроводках,
	|	ПланСчетов.Валютный КАК Валютный,
	|	ПланСчетов.Количественный КАК Количественный,
	|	&ИспользоватьИсторическиеКурсы КАК ИспользоватьИсторическиеКурсы
	|ИЗ
	|	ПланСчетов.бит_Бюджетирование КАК ПланСчетов
	|ГДЕ
	|	ПланСчетов.Ссылка = &Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыСубконто.НомерСтроки КАК НомерСтроки,
	|	ВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ВидыСубконто.ВидСубконто.Наименование КАК Наименование,
	|	ВидыСубконто.ВидСубконто.ТипЗначения КАК ТипЗначения,
	|	ВидыСубконто.ТолькоОбороты КАК ТолькоОбороты
	|ИЗ
	|	ПланСчетов.бит_Бюджетирование.ВидыСубконто КАК ВидыСубконто
	|ГДЕ
	|	ВидыСубконто.Ссылка = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыСубконто.НомерСтроки";
	ТекстВыборкиИспользоватьИсторическиеКурсы = "ЛОЖЬ";
	Если МетаданныеСчета.Реквизиты.Найти("ИспользоватьИсторическиеКурсы") <> Неопределено Тогда
		ТекстВыборкиИспользоватьИсторическиеКурсы = "ПланСчетов.ИспользоватьИсторическиеКурсы";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИспользоватьИсторическиеКурсы", ТекстВыборкиИспользоватьИсторическиеКурсы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "бит_Бюджетирование", МетаданныеСчета.Имя);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Счет", Счет);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСчета, Выборка);
	КонецЕсли;
		
	ВыборкаВидыСубконто	= МассивРезультатов[1].Выбрать();
		
	ДанныеСчета.КоличествоСубконто	= ВыборкаВидыСубконто.Количество();
		
	ИндексСубконто	= 0;
		
	Пока ВыборкаВидыСубконто.Следующий() Цикл
		
		ИндексСубконто	= ИндексСубконто + 1;
		
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   ВыборкаВидыСубконто.ВидСубконто);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  ВыборкаВидыСубконто.Наименование);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   ВыборкаВидыСубконто.ТипЗначения);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", ВыборкаВидыСубконто.ТолькоОбороты);
		
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеСчета);
	
КонецФункции

#КонецОбласти

Функция ЕстьТиповойПланСчетовМеждународный()
	
	Возврат Метаданные.ПланыСчетов.Найти("Международый") <> Неопределено;
	
КонецФункции

Функция ЕстьТиповойПланСчетовХозрасчетный()
	
	Возврат Метаданные.ПланыСчетов.Найти("Хозрасчетный") <> Неопределено;
	
КонецФункции

Функция НовыеПараметрыСчета()
	
	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("Ссылка"                         , Неопределено);
	ДанныеСчета.Вставить("Наименование"                   , "");
	ДанныеСчета.Вставить("Код"                            , "");
	ДанныеСчета.Вставить("КодБыстрогоВыбора"              , "");
	ДанныеСчета.Вставить("Родитель"                       , Неопределено);
	ДанныеСчета.Вставить("Вид"                            , Неопределено);
	ДанныеСчета.Вставить("Забалансовый"                   , Ложь);
	ДанныеСчета.Вставить("ЗапретитьИспользоватьВПроводках", Ложь);
	ДанныеСчета.Вставить("Валютный"                       , Ложь);
	ДанныеСчета.Вставить("Количественный"                 , Ложь);
	ДанныеСчета.Вставить("УчетПоПодразделениям"           , Ложь);
	ДанныеСчета.Вставить("НалоговыйУчет"                  , Ложь);
	ДанныеСчета.Вставить("КоличествоСубконто"             , 0);
	ДанныеСчета.Вставить("ИспользоватьИсторическиеКурсы"  , Ложь);
	Возврат ДанныеСчета;
	
КонецФункции

#КонецОбласти

