#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция СрокВыполненияЗапроса(ТипЗапроса) Экспорт
	
	СрокВыполненияДней = 0;
	
	Если ЗначениеЗаполнено(ТипЗапроса) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СрокиВыполненияЗапросовНалоговогоМониторинга.СрокВыполнения КАК СрокВыполнения
			|ИЗ
			|	РегистрСведений.бит_СрокиВыполненияЗапросовНалоговогоМониторинга КАК СрокиВыполненияЗапросовНалоговогоМониторинга
			|ГДЕ
			|	СрокиВыполненияЗапросовНалоговогоМониторинга.ТипЗапроса = &ТипЗапроса";
		
		Запрос.УстановитьПараметр("ТипЗапроса", ТипЗапроса);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СрокВыполненияДней = Выборка.СрокВыполнения;
		КонецЕсли;	
	КонецЕсли; 
	
	Возврат СрокВыполненияДней;
	
КонецФункции

#КонецОбласти

#КонецЕсли