#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_ОтветНаЗапросНалоговогоМониторинга") Тогда
		ЗаполнитьПоОтветНаЗапрос(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Периодичность) Тогда
		Периодичность     = Перечисления.Периодичность.Месяц;
		ДатаНачалаПериода = НачалоМесяца(ТекущаяДатаСеанса());
		ДатаКонцаПериода  = КонецМесяца(ДатаНачалаПериода);
	КонецЕсли; 
	
	СрокВыполненияДней = Документы.бит_ЗапросНалоговогоМониторинга.СрокВыполненияЗапроса(ТипЗапроса);
	СрокВыполненияЗапроса = ТекущаяДатаСеанса() + СрокВыполненияДней * 24 * 3600;
	
	Автор = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоОтветНаЗапрос(ДанныеЗаполнения)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ДокументНаРассмотрение КАК ДокументНаРассмотрение,
	|	Реквизиты.РегламентированныйОтчет КАК РегламентированныйОтчет,
	|	Реквизиты.Содержание КАК Содержание,
	|	Реквизиты.ЗапросОснование.ТипЗапроса КАК ТипЗапроса,
	|	Реквизиты.ЗапросОснование.ДатаНачалаПериода КАК ДатаНачалаПериода,
	|	Реквизиты.ЗапросОснование.ДатаКонцаПериода КАК ДатаКонцаПериода,
	|	Реквизиты.ЗапросОснование.Периодичность КАК Периодичность
	|ИЗ
	|	Документ.бит_ОтветНаЗапросНалоговогоМониторинга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли