
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновщикНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	ОтобразитьПериодВЗаголовке();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьПериодВЗаголовке()
	
	Если ЗначениеЗаполнено(ПериодОтбор.ДатаНачала) Или ЗначениеЗаполнено(НачалоДня(ПериодОтбор.ДатаОкончания)) Тогда
		ПериодСтрокой = ": " + СтроковыеФункции.ПредставлениеПериодаВТексте(ПериодОтбор.ДатаНачала, ПериодОтбор.ДатаОкончания, , Ложь);
	Иначе               
		ПериодСтрокой = "";
	КонецЕсли;
	
	ЭтаФорма.Заголовок = "(бит) Формирование пакетов заказов на производство" + ПериодСтрокой; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановленОтбор_ФормированиеЗаказовНаПроизводствоПоПлану" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			КомпоновщикНастроекОтбор = Параметр.КомпоновщикНастроек;
			ПериодОтбор = Параметр.ПериодОтбор;
		КонецЕсли;

        ПолучитьОтборыСКДВФормуНаСервере();

	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ВыбратьПериодЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		ПериодОтбор = Результат; 
		УстановитьПериодСКД(); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы  

&НаКлиенте
Процедура ПроизвольныеОтборыНажатие(Элемент)
	
	ПередатьОтборыФормыВСКДНаСервере();
	
	ПФ = Новый Структура;
	ПФ.Вставить("КомпоновщикНастроек", КомпоновщикНастроекОтбор);
	ПФ.Вставить("АдресСхемыКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
	ПФ.Вставить("ТаблицаДинамическихПолей", АдресТаблицыДинамическихПолей);
	ПФ.Вставить("ПериодОтбор", ПериодОтбор);
	
	ОткрытьФорму("Обработка.бит_ФормированиеПакетовЗаказовНаПроизводство.Форма.ФормаОтбор", ПФ, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Отобрать(Команда)
	
	УдалитьСтарыеСтраницы();
	ОтобратьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Период(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ПериодОтбор;
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры  

&НаКлиенте
Процедура СоединитьВПакет(Команда)
	
	Если ТаблЭтапы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для формирования пакета");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияСКД	 

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()
	
	СписокСвойств = ПолучитьСписокСвойствДляОтбора(); 
	ПолучитьТаблицуДинамическихПолей(СписокСвойств);
	
	СхемаКомпоновкиДанных = Обработки.бит_ФормированиеПакетовЗаказовНаПроизводство.ПолучитьМакет("МакетОтбор");
	
	ТекстЗапроса = ПостроитьДинамическийЗапросСКД(СхемаКомпоновкиДанных, СписокСвойств);
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти("НаборДанных1");
	НаборДанных.Запрос = ТекстЗапроса;
	
	ДополнитьСхемуПолямиСвойств(СхемаКомпоновкиДанных, СписокСвойств);
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	КомпоновщикНастроекОтбор.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроекОтбор.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	НастроитьВидимостьПараметровСКД(СхемаКомпоновкиДанных);
	
	КомпоновщикНастроекОтбор.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	ДобавитьДинамическиеПоляВОтборыСКД();
	
КонецПроцедуры 

&НаСервере
Процедура НастроитьВидимостьПараметровСКД(СхемаКомпоновкиДанных)

    Для Каждого Параметр Из СхемаКомпоновкиДанных.Параметры Цикл
		Параметр.ВключатьВДоступныеПоля = Ложь;
    КонецЦикла;

КонецПроцедуры

#КонецОбласти 

#Область ДинамическаяСхемаСКД

&НаСервереБезКонтекста
Функция ПолучитьСписокСвойствДляОтбора()
	
	Возврат Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.РеквизитыХарактеристикДляОтборов);

КонецФункции

&НаСервере
Процедура ПолучитьТаблицуДинамическихПолей(СписокСвойств)

    Таблица = Новый ТаблицаЗначений;
    Таблица.Колонки.Добавить("ИмяПоля", Новый ОписаниеТипов("Строка"));
    Таблица.Колонки.Добавить("Свойство");
    Таблица.Колонки.Добавить("ТипЗначения");
    Таблица.Колонки.Добавить("ЭтоДополнительноеЗначение", Новый ОписаниеТипов("Булево"));

    Номер = 0;
    Для Каждого Свойство Из СписокСвойств Цикл
        Номер = Номер + 1;

        СтрокаТаблицы = Таблица.Добавить();
        СтрокаТаблицы.ИмяПоля = "ЗначениеДопСвойства" + Формат(Номер, "ЧГ=0");
        СтрокаТаблицы.Свойство = Свойство;
        СтрокаТаблицы.ТипЗначения = Свойство.ТипЗначения;
        СтрокаТаблицы.ЭтоДополнительноеЗначение = Свойство.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов"));

    КонецЦикла;
	
	АдресТаблицыДинамическихПолей = ПоместитьВоВременноеХранилище(Таблица, Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ПостроитьДинамическийЗапросСКД(СхемаКомпоновкиДанных, СписокСвойств) 

	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти("НаборДанных1");
	Если НаборДанных = Неопределено Тогда
		ВызватьИсключение "Не найден набор данных НаборДанных1";
	КонецЕсли;

	ТекстЗапроса = НаборДанных.Запрос;

	ТекстПолейБаза = "";
	ТекстСоединенийБаза = "";
	ТекстПолейИтог = "";
	ТекстПолейГде = "";

	Номер = 0;
	Для Каждого Свойство Из СписокСвойств Цикл

		Номер = Номер + 1;

		ИмяСоединения = "ДопСвойствоВыходногоИзделия" + Формат(Номер, "ЧГ=0");
		ИмяПоля = "ЗначениеДопСвойства" + Формат(Номер, "ЧГ=0");
		ИмяПараметра = "СвойствоДопОтбора" + Формат(Номер, "ЧГ=0");

		ТекстПолейБаза = ТекстПолейБаза + "," + Символы.ПС + "	" + ИмяСоединения + ".Значение КАК " + ИмяПоля;

		ТекстСоединенийБаза = ТекстСоединенийБаза + Символы.ПС
			+ "		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК " + ИмяСоединения + Символы.ПС
			+ "		ПО " + ИмяСоединения + ".Ссылка = ЭтапПроизводства2_2ВыходныеИзделия.Характеристика" + Символы.ПС
			+ "			И " + ИмяСоединения + ".Свойство = &" + ИмяПараметра;

		ТекстПолейИтог = ТекстПолейИтог + "," + Символы.ПС + "	База." + ИмяПоля + " КАК " + ИмяПоля;

		ТекстПолейГде = ТекстПолейГде + "," + Символы.ПС + "	База." + ИмяПоля;
		
		//-------------------------------
		// добавим параметры вручную
		ПараметрСКД = СхемаКомпоновкиДанных.Параметры.Добавить();
		ПараметрСКД.Имя = ИмяПараметра;
		ПараметрСКД.ВключатьВДоступныеПоля = Ложь;
		ПараметрСКД.ОграничениеИспользования = Истина;
	КонецЦикла;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	//{ДОПОЛНИТЕЛЬНЫЕ_ПОЛЯ_БАЗА}", ТекстПолейБаза);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	//{ДОПОЛНИТЕЛЬНЫЕ_СОЕДИНЕНИЯ_БАЗА}", ТекстСоединенийБаза);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	//{ДОПОЛНИТЕЛЬНЫЕ_ПОЛЯ_ИТОГ}", ТекстПолейИтог);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	//{ДОПОЛНИТЕЛЬНЫЕ_ПОЛЯ_ГДЕ}", ТекстПолейГде);

	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
Процедура ДополнитьСхемуПолямиСвойств(СхемаКомпоновкиДанных, СписокСвойств) Экспорт

    НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти("НаборДанных1");

    Если НаборДанных = Неопределено Тогда
        ВызватьИсключение "Не найден набор данных НаборДанных1";
    КонецЕсли;

    ТаблицаПолей = ПолучитьИзВременногоХранилища(АдресТаблицыДинамическихПолей);
    Для Каждого ОписаниеПоля Из ТаблицаПолей Цикл

        ИмяПоля = ОписаниеПоля.ИмяПоля;
        Если НаборДанных.Поля.Найти(ИмяПоля) <> Неопределено Тогда
            Продолжить;
        КонецЕсли;

        ПолеНабора = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
        ПолеНабора.Поле = ИмяПоля;
        ПолеНабора.ПутьКДанным = ИмяПоля;
        ПолеНабора.Заголовок = ПолучитьЗаголовокПоляСвойства(ОписаниеПоля.Свойство);;
        ПолеНабора.ТипЗначения = ОписаниеПоля.ТипЗначения;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьДинамическиеПоляВОтборыСКД()

    ТаблицаПолей = ПолучитьИзВременногоХранилища(АдресТаблицыДинамическихПолей);
    Для Каждого ОписаниеПоля Из ТаблицаПолей Цикл
        ДобавитьПолеВОтборСКД(ОписаниеПоля.ИмяПоля, СтрЗаменить(ОписаниеПоля.Свойство, " (Для характеристик)",  ""));
    КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеВОтборСКД(ИмяПоля, ПредставлениеПоля)

    Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого ЭлементОтбора Из КомпоновщикНастроекОтбор.Настройки.Отбор.Элементы Цикл
        Если ЭлементОтбора.ЛевоеЗначение = Поле Тогда
            Возврат;
        КонецЕсли;
    КонецЦикла;

    ЭлементОтбора = КомпоновщикНастроекОтбор.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.Использование = Ложь;
    ЭлементОтбора.ЛевоеЗначение = Поле;
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаголовокПоляСвойства(Свойство)

    Возврат "Характеристика - " + СтрЗаменить(Строка(Свойство), " (Для характеристик)", "");

КонецФункции
	
&НаСервере
Функция ЗаполнитьПараметрыСвойствСКД(СписокСвойств)
	
	Номер = 0;
    Для Каждого Свойство Из СписокСвойств Цикл

        Номер = Номер + 1;
        ИмяПараметра = "СвойствоДопОтбора" + Формат(Номер, "ЧГ=0");
        КомпоновщикНастроекОтбор.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ИмяПараметра, Свойство);

	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область ПередачаОтборовФормыВСКД

&НаСервере
Процедура ПередатьОтборыФормыВСКДНаСервере()
	
	УстановитьПериодСКД();
	
	ОтразитьСписокЗначенийВОтборахКомпоновки(КомпоновщикНастроекОтбор, "Подразделение", ПодразделениеОтбор);
	ОтразитьСписокЗначенийВОтборахКомпоновки(КомпоновщикНастроекОтбор, "Статус", СтатусОтбор);
	ОтразитьСписокЗначенийВОтборахКомпоновки(КомпоновщикНастроекОтбор, "ВидРабочегоЦентра", ВРЦОтбор);
	
	УстановитьПараметрыБулевыхОтборов(КомпоновщикНастроекОтбор, "ДополнятьЭтапамиВыбранногоЗаказа", ДополнятьЭтапамиВыбранногоЗаказа);
	УстановитьПараметрыБулевыхОтборов(КомпоновщикНастроекОтбор, "ВыводитьВРазрезеВРЦ", ВыводитьВРазрезеВРЦ);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодСКД()
	
	КомпоновщикНастроекОтбор.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ПериодОтбор);
	ОтобразитьПериодВЗаголовке();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтразитьСписокЗначенийВОтборахКомпоновки(КомпоновщикНастроек, ИмяПоля, СписокЗначений)
	
	сЗначений = Новый СписокЗначений;
	Для Каждого СтрокаСписка Из СписокЗначений Цикл
		Если ЗначениеЗаполнено(СтрокаСписка.Значение) Тогда
			сЗначений.Добавить(СтрокаСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ПолеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого Отбор Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Отбор.ЛевоеЗначение = ПолеПоиска Тогда
			Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Отбор.Использование = сЗначений.Количество() > 0;
			Отбор.ПравоеЗначение = сЗначений;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПараметрыБулевыхОтборов(КомпоновщикНастроек, ИмяПоля, Значение);
	
	ПолеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого Отбор Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Отбор.ЛевоеЗначение = ИмяПоля Тогда
			Настройка = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
			Если Настройка <> Неопределено Тогда
				Настройка.Использование = Значение;
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ОтразитьПростойОтборВОтборахКомпоновки(КомпоновщикНастроекОтбор, ИмяПоля, Значение)
	
	ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого Отбор Из КомпоновщикНастроекОтбор.Настройки.Отбор.Элементы Цикл
		Если Отбор.ЛевоеЗначение = ЗначениеПоиска Тогда
			Настройка = КомпоновщикНастроекОтбор.ПользовательскиеНастройки.Элементы.Найти(Отбор.ИдентификаторПользовательскойНастройки);
			Если Настройка <> Неопределено Тогда
				Настройка.Использование = ЗначениеЗаполнено(Значение);
				Если Настройка.Использование Тогда
					Настройка.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					Настройка.ПравоеЗначение = Значение;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеОтборовСКДВФорму

&НаСервере
Процедура ПолучитьОтборыСКДВФормуНаСервере()
	
	ЗаполнитьСписокИзОтбораСКД(ПодразделениеОтбор, КомпоновщикНастроекОтбор, "Подразделение");
	ЗаполнитьСписокИзОтбораСКД(СтатусОтбор, КомпоновщикНастроекОтбор, "Статус");
	ЗаполнитьСписокИзОтбораСКД(ВРЦОтбор, КомпоновщикНастроекОтбор, "ВидРабочегоЦентра");
	
	ПолучитьЗначениеБулевыхПараметров(ВыводитьВРазрезеВРЦ, КомпоновщикНастроекОтбор, "ВыводитьВРазрезеВРЦ");
	ПолучитьЗначениеБулевыхПараметров(ДополнятьЭтапамиВыбранногоЗаказа, КомпоновщикНастроекОтбор, "ДополнятьЭтапамиВыбранногоЗаказа");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокИзОтбораСКД(СписокЗначений, КомпоновщикНастроек, ИмяПоля)
	
	ПравоеЗначение = ПолучитьЗначениеПростогоОтбораСКД(КомпоновщикНастроек, ИмяПоля);

	СписокЗначений.Очистить();
	
	Если ПравоеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПравоеЗначение) = Тип("Массив") Тогда
		Для Каждого ЗначениеОтбора Из ПравоеЗначение Цикл
			НоваяСтрока = СписокЗначений.Добавить();
			НоваяСтрока.Пометка = Истина;
			НоваяСтрока.Значение = ЗначениеОтбора;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений") Тогда 
		Для Каждого ЗначениеОтбора Из ПравоеЗначение Цикл
			НоваяСтрока = СписокЗначений.Добавить();
			НоваяСтрока.Пометка = Истина;
			НоваяСтрока.Значение = ЗначениеОтбора.Значение;
		КонецЦикла;
		
	Иначе
		
		НоваяСтрока = СписокЗначений.Добавить();
		НоваяСтрока.Пометка = Истина;
		НоваяСтрока.Значение = ПравоеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПростогоОтбораСКД(КомпоновщикНастроек, ИмяПоля)
	
	ПолеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого Отбор Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Отбор.ЛевоеЗначение = ПолеПоиска Тогда
			Если Отбор.Использование Тогда
				Возврат Отбор.ПравоеЗначение;
			КонецЕсли;
			
		ИначеЕсли Отбор.ЛевоеЗначение = ИмяПоля Тогда
			Возврат Отбор.Использование;

		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПолучитьЗначениеБулевыхПараметров(ПараметрОтбора, КомпоновщикНастроек, ИмяПоля)
	
	ПравоеЗначение = ПолучитьЗначениеПростогоОтбораСКД(КомпоновщикНастроек, ИмяПоля);
	Если ПравоеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрОтбора = ПравоеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеОтбора

&НаСервере
Процедура ОтобратьНаСервере()
	
	ПередатьОтборыФормыВСКДНаСервере();
	
	СписокСвойств = ПолучитьСписокСвойствДляОтбора();
	ЗаполнитьПараметрыСвойствСКД(СписокСвойств);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекОтбор.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

	ТаблицаРезультата = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//ТаблицаРезультата
	УникальныеВРЦ = ТаблицаРезультата.Скопировать(, "ВидРабочегоЦентра");
	УникальныеВРЦ.Свернуть("ВидРабочегоЦентра");
	
	мСтраниц = УникальныеВРЦ.ВыгрузитьКолонку("ВидРабочегоЦентра");
	ВывестиСтраницы(мСтраниц);
	ЗаполнитьСтраницыДанными(ТаблицаРезультата); 
	
КонецПроцедуры

#КонецОбласти

#Область Интерфейс_СтраницыВРЦ

&НаСервере
Процедура УдалитьСтарыеСтраницы() 
	
	Если Элементы.Страницы.ПодчиненныеЭлементы.Количество() Тогда
		Для Индекс = Элементы.Страницы.ПодчиненныеЭлементы.Количество() - 1 По 0 Цикл
			Элемент = Элементы.Страницы.ПодчиненныеЭлементы[Индекс];
			Если СтрНачинаетсяС(Элемент.Имя, "СтраницаВРЦ") Тогда
				Элементы.Удалить(Элемент);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСтраницы(мСтраниц = Неопределено)
	// Добавляем страницы по выбранным ВРЦ 
	Если мСтраниц = Неопределено Тогда
		мСтраниц = ВРЦОтбор.ВыгрузитьЗначения();
	КонецЕсли;
		
	Если ВыводитьВРазрезеВРЦ Тогда
		Для каждого текВРЦ из мСтраниц Цикл 
			Если ЗначениеЗаполнено(текВРЦ) Тогда 
				ИмяСтраницы = "СтраницаВРЦ_" + Строка(текВРЦ.УникальныйИдентификатор());
				ЗаголовокСтраницы = Строка(текВРЦ);
			Иначе                                                                    
				ИмяСтраницы = "СтраницаВРЦ_000000";
				ЗаголовокСтраницы = "<пустое значение>";
			КонецЕсли;
			ВывестиСтраницуВРЦ(ИмяСтраницы, ЗаголовокСтраницы);
		КонецЦикла;    
	Иначе                                                
		ИмяСтраницы = "СтраницаВРЦ";    
		ЗаголовокСтраницы = "";
		ВывестиСтраницуВРЦ(ИмяСтраницы, ЗаголовокСтраницы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСтраницуВРЦ(ИмяСтраницы, ЗаголовокСтраницы)
	
	Страница = Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), Элементы.Страницы);
	Страница.Вид = ВидГруппыФормы.Страница;
	Страница.Заголовок = ЗаголовокСтраницы;
	 
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСтраницыДанными(ТаблицаРезультата)
	
КонецПроцедуры                                       

#КонецОбласти



