////////////////////////////////////////////////////////////////////////////////
// Расширение модуля "бит_МеханизмДопИзмерений".
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыУстановкиСвойствАналитикПоШаблону(АналитикаФормы, АналитикаОбъекта, СтатьяОборотовОбъекта) Экспорт
	
	Результат = НовыеПараметрыУстановкиСвойствАналитик();
	ВГраница  = бит_МеханизмДопИзмеренийКлиентСерверПереопределяемый.КоличествоДополнительныхИзмерений();
	
	Если НЕ ПустаяСтрока(АналитикаФормы) Тогда
		Для Индекс = 1 По ВГраница Цикл
			Результат.ПоляФормы["Аналитика_" + Индекс] = АналитикаФормы + Индекс;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(АналитикаОбъекта) Тогда
		Для Индекс = 1 По ВГраница Цикл
			Результат.ПоляОбъекта["Аналитика_" + Индекс] = АналитикаОбъекта + Индекс;
		КонецЦикла;
	КонецЕсли;

	Если НЕ ПустаяСтрока(СтатьяОборотовОбъекта) Тогда
		Результат.ПоляОбъекта.СтатьяОборотов = СтатьяОборотовОбъекта;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеУстановкиПараметровАналитик(Объект, ПараметрыУстановки) Экспорт
	
	Результат = Новый Структура;
	
	ПоляОбъекта  = ПараметрыУстановки.ПоляОбъекта;
	ДопРеквизиты = ПараметрыУстановки.ДопРеквизиты;
	
	ВГраница  = бит_МеханизмДопИзмеренийКлиентСерверПереопределяемый.КоличествоДополнительныхИзмерений();
	
	Для Индекс = 1 По ВГраница Цикл
		Если НЕ ЗначениеЗаполнено(ПоляОбъекта["Аналитика_" + Индекс]) Тогда
			Продолжить;
		КонецЕсли;
		ЗначениеСубконто = Объект[ПоляОбъекта["Аналитика_" + Индекс]];
		ТипСубконто = ТипЗнч(ЗначениеСубконто);
	КонецЦикла;
	
	Если ПоляОбъекта.Свойство("Организация") Тогда
		Результат.Вставить("Организация", Объект[ПоляОбъекта.Организация]);
	КонецЕсли;
	
	Для каждого ДопРеквизит Из ДопРеквизиты Цикл
		Результат.Вставить(ДопРеквизит.Ключ, ДопРеквизит.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	

Процедура УстановитьПараметрыВыбораАналитик(Форма, Объект, ПараметрыУстановки, ДанныеОбъекта) Экспорт

	Элементы = Форма.Элементы;
	
	ПоляОбъекта = ПараметрыУстановки.ПоляОбъекта;
	ПоляФормы   = ПараметрыУстановки.ПоляФормы;
	
	ВидыПараметров = Новый Соответствие;
	ВидыПараметров.Вставить(БухгалтерскийУчетКлиентСерверПереопределяемый.ТипПодразделения(), "Подразделение");
	
	ВГраница  = бит_МеханизмДопИзмеренийКлиентСерверПереопределяемый.КоличествоДополнительныхИзмерений();
	 
	Для Индекс = 1 По ВГраница Цикл
		Если НЕ ЗначениеЗаполнено(ПоляФормы["Аналитика_" + Индекс])
			ИЛИ НЕ ЗначениеЗаполнено(ПоляОбъекта["Аналитика_" + Индекс]) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементФормыСубконто = Элементы.Найти(ПоляФормы["Аналитика_" + Индекс]);
		Если ЭлементФормыСубконто = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТипСубконто   = ТипЗнч(Объект[ПоляОбъекта["Аналитика_" + Индекс]]);
		ВидПараметров = ВидыПараметров[ТипСубконто];
		Если ВидПараметров <> Неопределено Тогда
			
			МассивПараметров = Новый Массив();
			Если ВидПараметров = "Подразделение" Тогда
				Если ДанныеОбъекта.Свойство("Организация") Тогда
					ИмяРеквизитаОрганизация = БухгалтерскийУчетКлиентСерверПереопределяемый.ИмяРеквизитаОрганизацияПодразделения();
					Если ЗначениеЗаполнено(ИмяРеквизитаОрганизация) Тогда
						МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор." + ИмяРеквизитаОрганизация, ДанныеОбъекта.Организация));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если МассивПараметров.Количество() > 0 Тогда
				ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
				ЭлементФормыСубконто.ПараметрыВыбора = ПараметрыВыбора;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Функция проверяет вид аналитики - банковский счет или нет
//
// Параметры:
//  ИмяАналитики  	   - Строка.
//  НастройкиИзмерений - Соответствие.
//  
// Возвращаемое значение:
//   Булево.
//
Функция ЭтоАналитикаБанковскийСчет(ИмяАналитики, НастройкиИзмерений) Экспорт

	ЭтоБанковскийСчет = Ложь;
	Если СтрСравнить(ИмяАналитики, "БанковскийСчет") = 0 Тогда
		ЭтоБанковскийСчет = Истина;
	Иначе
		Настройка = НастройкиИзмерений.Получить(ИмяАналитики);
		Если Настройка <> Неопределено Тогда
			ТекАналитика = Настройка.Аналитика;
			ЭтоБанковскийСчет = ТекАналитика = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыДополнительныхАналитик.БанковскийСчет");
		КонецЕсли; 
	КонецЕсли; 
	            
	Возврат ЭтоБанковскийСчет;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеПараметрыУстановкиСвойствАналитик()
	
	ВГраница  = бит_МеханизмДопИзмеренийКлиентСерверПереопределяемый.КоличествоДополнительныхИзмерений();
	Результат = Новый Структура;
	
	ПоляФормы = Новый Структура;
	Для Индекс = 1 По ВГраница Цикл
		ПоляФормы.Вставить("Аналитика_" + Индекс);
	КонецЦикла; 
	Результат.Вставить("ПоляФормы", ПоляФормы);
	
	ПоляОбъекта = Новый Структура;
	ПоляОбъекта.Вставить("СтатьяОборотов", "СтатьяОборотов");
	Для Индекс = 1 По ВГраница Цикл
		ПоляОбъекта.Вставить("Аналитика_" + Индекс);
	КонецЦикла; 
	Результат.Вставить("ПоляОбъекта", ПоляОбъекта);
	
	ДопРеквизиты = Новый Структура;
	Результат.Вставить("ДопРеквизиты", ДопРеквизиты);
	
	Возврат Результат;
	
КонецФункции

Процедура ОчиститьАналитикиПриИзмененииОрганизации(Объект, ПараметрыУстановки)
	
	Если бит_ОбщегоНазначенияВызовСервера.ЭтоУТ() Тогда
		Возврат;
	КонецЕсли;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		МодульБухгалтерскийУчетВызовСервераПовтИсп = ОбщегоНазначения.ОбщийМодуль("БухгалтерскийУчетВызовСервераПовтИсп");
	#Иначе
		МодульБухгалтерскийУчетВызовСервераПовтИсп = ОбщегоНазначенияКлиент.ОбщийМодуль("БухгалтерскийУчетВызовСервераПовтИсп");
	#КонецЕсли
		
	ВсеТипыСвязанныхСубконто   = МодульБухгалтерскийУчетВызовСервераПовтИсп.ВсеТипыСвязанныхСубконто();
	ТипыСвязанныеСОрганизацией = ВсеТипыСвязанныхСубконто["Организация"];
	
	ПоляОбъекта = ПараметрыУстановки.ПоляОбъекта;
	
	Для каждого ПолеОбъекта Из ПоляОбъекта Цикл
		ИмяПоля = ПолеОбъекта.Значение;
		Если ЗначениеЗаполнено(ИмяПоля)
			И ЗначениеЗаполнено(Объект[ИмяПоля]) Тогда
			ТипПоля = ТипЗнч(Объект[ИмяПоля]);
			Если ТипыСвязанныеСОрганизацией.СодержитТип(ТипПоля) Тогда
				Объект[ИмяПоля] = Новый (ТипПоля);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти