&После("ПриСозданииНаСервере")
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// Первыйбит ЛТ2.2 ЛапшовГ "GVLapshov@1cbit.ru" 21.01.2025 + 
	Если  ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Если  ТипЗнч(Параметры.ЗначениеКопирования) = Тип("СправочникСсылка.Номенклатура")Тогда
		бит_ЗаполнитьПризнакиНоменклатуры(Параметры.ЗначениеКопирования);	
		КонецЕсли;
	КонецЕсли;	
	// Первыйбит ЛТ2.2 ЛапшовГ "GVLapshov@1cbit.ru" 21.01.2025 -
    
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 +   
	ЗаголовокФормы = ЭтаФорма.Заголовок;
	НоваяСтраница = Элементы.Добавить("СтраницаПризнаки", Тип("ГруппаФормы"), Элементы.СтраницыКарточкаНоменклатуры);
    НоваяСтраница.Вид = ВидГруппыФормы.Страница; 
	НоваяСтраница.Заголовок = "Признаки";
	
	ГруппаДинамическогоСписка  = Элементы.Добавить("Группабит_Признаки",Тип("ГруппаФормы"), Элементы.СтраницаПризнаки);
	ГруппаДинамическогоСписка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДинамическогоСписка.ОтображатьЗаголовок = Истина; 
	ГруппаДинамическогоСписка.Заголовок = "(бит) Признаки";
	ГруппаДинамическогоСписка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаДинамическогоСписка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаДинамическогоСписка.Поведение = ПоведениеОбычнойГруппы.Авто;
	ГруппаДинамическогоСписка.Скрыть();
    ТекстЗапроса = "ВЫБРАТЬ
                   |	бит_ЗначенияПризнаковНоменклатуры.бит_Признак.Код КАК Код,
                   |	бит_ЗначенияПризнаковНоменклатуры.бит_Признак КАК Наименование,
                   |	бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК Значение,
                   |	бит_ЗначенияПризнаковНоменклатуры.бит_ПризнакСертификации КАК ПризнакСертификации
                   |ИЗ
                   |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
                   |ГДЕ
                   |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &Номенклатура
                   |	И бит_ЗначенияПризнаковНоменклатуры.бит_ПризнакСертификации = ЛОЖЬ";
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("Код");
	МассивКолонок.Добавить("Наименование");
	МассивКолонок.Добавить("Значение");
	МассивКолонок.Добавить("ПризнакСертификации");
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Номенклатура", Объект.Ссылка); 
	СписокДействий = Новый Структура;
	СписокДействий.Вставить("ПередНачаломДобавления", "ПередНачаломДобавления"); 
	СозданиеДинамическогоСписка("бит_Признаки", ТекстЗапроса, МассивКолонок,СписокДействий,"РегистрСведений.бит_ЗначенияПризнаковНоменклатуры","Группабит_Признаки", , , СписокПараметров); 
	
	НоваяСтраница = Элементы.Добавить("СтраницаПризнакиСертификации", Тип("ГруппаФормы"), Элементы.СтраницыКарточкаНоменклатуры);
    НоваяСтраница.Вид = ВидГруппыФормы.Страница; 
	НоваяСтраница.Заголовок = "Признаки сертификации";
	
	ГруппаДинамическогоСписка  = Элементы.Добавить("Группабит_ПризнакиСертификации",Тип("ГруппаФормы"), Элементы.СтраницаПризнакиСертификации);
	ГруппаДинамическогоСписка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДинамическогоСписка.ОтображатьЗаголовок = Истина; 
	ГруппаДинамическогоСписка.Заголовок = "(бит) Признаки сертификации";
	ГруппаДинамическогоСписка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаДинамическогоСписка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаДинамическогоСписка.Поведение = ПоведениеОбычнойГруппы.Авто;
	ГруппаДинамическогоСписка.Скрыть();
    ТекстЗапроса = "ВЫБРАТЬ
                   |	бит_ЗначенияПризнаковНоменклатуры.бит_Признак.Код КАК Код,
                   |	бит_ЗначенияПризнаковНоменклатуры.бит_Признак КАК Наименование,
                   |	бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК Значение,
                   |	бит_ЗначенияПризнаковНоменклатуры.бит_ПризнакСертификации КАК ПризнакСертификации
                   |ИЗ
                   |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
                   |ГДЕ
                   |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &Номенклатура
                   |	И бит_ЗначенияПризнаковНоменклатуры.бит_ПризнакСертификации = Истина";
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("Код");
	МассивКолонок.Добавить("Наименование");
	МассивКолонок.Добавить("Значение");
	МассивКолонок.Добавить("ПризнакСертификации");
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Номенклатура", Объект.Ссылка);
	СписокДействий = Новый Структура;
	СписокДействий.Вставить("ПередНачаломДобавления", "ПередНачаломДобавления"); 
	СозданиеДинамическогоСписка("бит_ПризнакиСертификации", ТекстЗапроса, МассивКолонок, СписокДействий,"РегистрСведений.бит_ЗначенияПризнаковНоменклатуры","Группабит_ПризнакиСертификации", , , СписокПараметров);
	ЭтаФорма.Заголовок = ЗаголовокФормы;
	// Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -  
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [18.08.2025 21:36:33] +        
	НовыйЭлемент = Элементы.Добавить("бит_СтандартныйТипТары", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаОсновныеПараметрыУчета);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СтандартныйТипТары";                  
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.16]  [VUVaynula@1cbit.ru] [18.08.2025 21:36:33] - 
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [18.11.2025 20:04:43] +        
	НовыйЭлемент = Элементы.Добавить("бит_МатериалПровода", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаОсновныеПараметрыУчета);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_МатериалПровода";                  
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
	НовыйЭлемент = Элементы.Добавить("бит_ЗапросГенерацииНовойСерииВСменномЗадании", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаОсновныеПараметрыУчета);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ЗапросГенерацииНовойСерииВСменномЗадании";                  
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [18.11.2025 20:04:43] - 
	
	// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 17:24:57] +        
	НовыйЭлемент = Элементы.Добавить("бит_Склад", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаОсновныеПараметрыУчета);
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Склад";                  
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 17:24:57] -
КонецПроцедуры 

&НаСервере
Процедура СозданиеДинамическогоСписка(
	ИмяСписка = "Список", 			//тип строка - имя будущего списка на форме и реквизита
	ТекстЗапроса = "", 				//тип строка - запрос, если он не указан, необходимо указать таблицу
	МассивКолонок,                  //тип массив - массив создаваемых колонок, значения тип строка. Пример: "Д,ДоговораКонтрагента" значит будет создана колонка
									//				с заголовком "Д" и колонкой списка "ДоговораКонтрагента". Если указать просто "ДоговораКонтрагента", 
									//				заголовок будет идентичен заголовку по умолчанию типа "Договор контрагента".
	СписокДействий = Неопределено,  //тип структура - структура содержит действия (свойства) динамического списка, можно указать только те которые необходимы.
									//				пример: СписокДействий = Новый Структура("Выбор,ПриАктивизацииСтроки","СписокВыбор","СписокПриАктивизацииСтроки")
	ТаблицаСписка = "",				//тип строка - содержит имя основной таблицы, пример: "Документ.РеализацияТоваровУслуг"	
	ДобавитьВ = "",                 //тип строка - имя элемента на который будет размещен список, если пустое, тогда добавляется на форму
	ВставитьПеред = "",             //тип строка - имя элемента перед которым будет размещен список, если пустое, будет просто добавлен в конец
	СвояКоманднаяПанель = ЛОЖЬ,     //тип булево - если ИСТИНА, скрывает стандартную панель и создает свою пустую для будушего наполнения ИмяСписка+"КоманднаяПанель2"
	ПараметрыЗапроса = Неопределено)//тип структура - содержит перечень параметров, если они используются в запросе.
	
	// //Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 + 
	//Защита от дурака
	Если ТекстЗапроса = "" И ТаблицаСписка = "" Тогда Сообщить("Ошибка формирования динамического списка, укажите запрос или таблицу"); Возврат; КонецЕсли;
																									
	//Создаем свою командную панель, тот случай когда я не нашел способа снять галочку "Автозаполнение"
	//Если СвояКоманднаяПанель Тогда
		Если ВставитьПеред = "" Тогда
			ГруппаДинамическогоСписка  = Элементы.Добавить("Группа" + ИмяСписка + "CоСвоейКоманднойПанелью",Тип("ГруппаФормы"),?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ]));
		Иначе
			ГруппаДинамическогоСписка  = Элементы.Вставить("Группа" + ИмяСписка + "CоСвоейКоманднойПанелью",Тип("ГруппаФормы"),?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ]),ЭтаФорма.Элементы[ВставитьПеред]);			
		КонецЕсли;
		ГруппаДинамическогоСписка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаДинамическогоСписка.ОтображатьЗаголовок = Ложь; 
		//ГруппаДинамическогоСписка.Заголовок = "(бит) Данные для КГРТ";
		ГруппаДинамическогоСписка.Отображение = ОтображениеОбычнойГруппы.Нет;
		//КоманднаяПанельСписка  = Элементы.Добавить(ИмяСписка + "КоманднаяПанель2",Тип("ГруппаФормы"),ГруппаДинамическогоСписка);
	//	КоманднаяПанельСписка.Вид = ВидГруппыФормы.КоманднаяПанель;			
	//КонецЕсли;
									
	//Создаем реквизит формы
	ТипыРеквизита = Новый Массив;                             
	ТипыРеквизита.Добавить(Тип("ДинамическийСписок"));
	ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита); 
	ДинамическийСписок = Новый РеквизитФормы(ИмяСписка, ОписаниеТиповДляРеквизита,,"",ЛОЖЬ); //Имя реквизита
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);        
	
	//Задаем свойства реквизиту
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);        
	РеквизитДинамическийСписок = ЭтаФорма[ИмяСписка]; //Имя реквизита
	Если ТекстЗапроса = "" Тогда
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = ЛОЖЬ;
		РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка;
	Иначе
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = ИСТИНА;
		РеквизитДинамическийСписок.ТекстЗапроса = ТекстЗапроса;
		Если ТаблицаСписка <> "" Тогда РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка; КонецЕсли;		
	КонецЕсли;
	
	//Заполняем параметры если они были указаны
	Если ПараметрыЗапроса <> Неопределено Тогда
		Для Каждого Параметра из ПараметрыЗапроса Цикл
			РеквизитДинамическийСписок.Параметры.УстановитьЗначениеПараметра(Параметра.Ключ,Параметра.Значение);	
		КонецЦикла;		 
	КонецЕсли;
	
	//Размещаем реквизит на форме
	ТаблицаФормы = Элементы.Добавить(ИмяСписка,Тип("ТаблицаФормы"),ГруппаДинамическогоСписка);		
	ТаблицаФормы.ПутьКДанным = ИмяСписка; //Имя реквизита 
	
	//Если своя панель тогда скрываем стандартную
	Если СвояКоманднаяПанель Тогда
		Элементы[ИмяСписка].ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	КонецЕсли;

	//Создание колонок на основание МассивКолонок
	Для Каждого Элемента Из МассивКолонок Цикл
		ПараметрыКолонки = СтрЗаменить(Элемента,",",Символы.ПС);
		Если СтрЧислоСтрок(ПараметрыКолонки) > 1 Тогда
			Заголовок = СтрПолучитьСтроку(ПараметрыКолонки, 1) + " признака";
			ИмяКолонки = СтрПолучитьСтроку(ПараметрыКолонки, 2);
		Иначе
			Если ПараметрыКолонки = "ПризнакСертификации" Тогда
				Заголовок = "Признак сертификации";
				ИмяКолонки = ПараметрыКолонки; 	
			Иначе
				Заголовок = ПараметрыКолонки + " признака";
				ИмяКолонки = ПараметрыКолонки; 
		    КонецЕсли;
		КонецЕсли;
		НоваяКолонкаТаблицы = Элементы.Добавить(ИмяСписка + ИмяКолонки, Тип("ПолеФормы"), ТаблицаФормы);
		Если Заголовок <> "" Тогда НоваяКолонкаТаблицы.Заголовок = Заголовок; КонецЕсли;
		НоваяКолонкаТаблицы.ПутьКДанным = ИмяСписка + "." + ИмяКолонки; 	
	КонецЦикла;
	
	//Задаем действия (События) на основание СписокДействий, если он определен
	Если СписокДействий <> Неопределено Тогда 	
		ПереченьСвойств = "ПриИзменении
						|Выбор
						|ПриАктивизацииСтроки
						|ВыборЗначения
						|ПриАктивизацииПоля
						|ПриАктивизацииЯчейки
						|ПередНачаломДобавления
						|ПередНачаломИзменения
						|ПередУдалением
						|ПриНачалеРедактирования
						|ПередОкончаниемРедактирования
						|ПриОкончанииРедактирования
						|ОбработкаВыбора
						|ПередРазворачиванием
						|ПередСворачиванием
						|ПослеУдаления
						|ПриСменеТекущегоРодителя
						|ОбработкаЗаписиНового
						|ПриСохраненииПользовательскихНастроекНаСервере
						|ПередЗагрузкойПользовательскихНастроекНаСервере
						|ПриЗагрузкеПользовательскихНастроекНаСервере
						|ПриОбновленииСоставаПользовательскихНастроекНаСервере
						|ОбработкаЗапросаОбновления
						|ПриПолученииДанныхНаСервере
						|НачалоПеретаскивания
						|ПроверкаПеретаскивания
						|ОкончаниеПеретаскивания
						|Перетаскивание";
		Для Счетчик = 1 по 28 Цикл
			ИмяСвойства = СтрПолучитьСтроку(ПереченьСвойств, Счетчик); 
			//Действие = СписокДействий[ИмяСвойства];
			Элементы[ИмяСписка].УстановитьДействие(ИмяСвойства,?(СписокДействий.Свойство(ИмяСвойства),СписокДействий[ИмяСвойства],""));
		КонецЦикла;
	КонецЕсли;	
    // //Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
	
КонецПроцедуры  

&НаСервере
Процедура бит_ЗаполнитьПризнакиНоменклатуры(ОбъектКопирования)

	// Первыйбит ЛТ2.2 ЛапшовГ "GVLapshov@1cbit.ru" 21.01.2025 + 
	Если ОбъектКопирования.ЭтоГруппа = Ложь Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура КАК бит_Номенклатура,
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Признак КАК бит_Признак,
		|	бит_ЗначенияПризнаковНоменклатуры.бит_ПризнакСертификации КАК бит_ПризнакСертификации,
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК бит_Значение
		|ИЗ
		|	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
		|ГДЕ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &ОбъектКопирования";
		
		Запрос.УстановитьПараметр("ОбъектКопирования", ОбъектКопирования);
		
		ВыборкаПризнаков = Запрос.Выполнить().Выгрузить();
		
		Попытка 
			ЭтотОбъект.Записать();
			
			Номенклатура = Объект.Ссылка;
			
			НаборЗаписей = РегистрыСведений.бит_ЗначенияПризнаковНоменклатуры.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.бит_Номенклатура.Установить(Номенклатура); 
			
			Для Каждого Строка Из ВыборкаПризнаков Цикл 
				
				НоваяЗапись = НаборЗаписей.Добавить(); 
				
				НоваяЗапись.бит_Номенклатура 					= Номенклатура; 
				НоваяЗапись.бит_Признак 						= Строка.бит_Признак; 
				НоваяЗапись.бит_ПризнакСертификации 			= Строка.бит_ПризнакСертификации;
				НоваяЗапись.бит_Значение 						= Строка.бит_Значение;
				
			КонецЦикла; 
			
			НаборЗаписей.Записать(); 
		Исключение
		ТекстСообщения = "Признаки не удалось скопировать!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	// Первыйбит ЛТ2.2 ЛапшовГ "GVLapshov@1cbit.ru" 21.01.2025 -
	
КонецПроцедуры

&После("ОбработкаОповещения")
&НаКлиенте
Процедура бит_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 + 
	Если ИмяСобытия = "бит_ЗаписьПризнаки" или ИмяСобытия = "бит_ЗаписьПризнакиСертификации" Тогда
		Элементы.Группабит_Признаки.Обновить();	
		Элементы.Группабит_ПризнакиСертификации.Обновить();
	КонецЕсли;
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
	
КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 +
	
	ПараметрыФормы = Новый Структура;
	Если Не Копирование И Не Группа Тогда
		Отказ = Истина;
		ПараметрыФормы.Вставить("Источник", Объект.Ссылка);
		ОбработчикЗакрытия = Новый ОписаниеОповещения("Список_ОбработкаЗакрытияФормы", ЭтаФорма);
		ОткрытьФорму("РегистрСведений.бит_ЗначенияПризнаковНоменклатуры.ФормаЗаписи", ПараметрыФормы, ЭтаФорма,,,, ОбработчикЗакрытия);	
	КонецЕсли;

	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
	
КонецПроцедуры

&НаКлиенте
Процедура Список_ОбработкаЗакрытияФормы(РезультатОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 +
    ЭтаФорма.ОбновитьОтображениеДанных();
    //Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
	
КонецПроцедуры
 