#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
// Функция получает показатели произвольного отчета определенного вида.
// 
// Параметры:
//  НастройкаОтчета - СправочникСсылка.бит_НастройкиПроизвольныхОтчетов.
//  Вид             - ПеречислениеСсылка.бит_ВидыЯчеекПроизвольныхОтчетов.
// 
// Возвращаемое значение:
//   ТаблицаЗначений
// 
Функция ПолучитьПоказателиВида(НастройкаОтчета, Вид, ВесьСписок = Ложь) Экспорт
	
	Возврат Справочники.бит_ПоказателиПроизвольныхОтчетов.ПолучитьПоказателиВида(НастройкаОтчета, Вид, ВесьСписок);
	
КонецФункции // ПолучитьПоказателиВида()

// Функция получает показатели отчета.
// 
// Параметры:
//  НастройкаОтчета - СправочникСсылка.бит_НастройкиПроизвольныхОтчетов.
// 
// Возвращаемое значение:
//   ТаблицаЗначений
// 
Функция ПолучитьПоказателиОтчета(НастройкаОтчета, ВесьСписок = Ложь) Экспорт
	
	ВидыЯчеек = Новый Массив;
	Для каждого Элемент Из Перечисления.бит_ВидыЯчеекПроизвольногоОтчета Цикл
		ВидыЯчеек.Добавить(Элемент);
	КонецЦикла; 
	
	Если ВесьСписок Тогда
		ВидыЯчеек.Добавить(Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.ПустаяСсылка());
	КонецЕсли;
	
	Возврат ПолучитьПоказателиВида(НастройкаОтчета, ВидыЯчеек, ВесьСписок);
	
КонецФункции // ПолучитьПоказателиОтчета()

// Функция получает настройку аналитик произвольного отчета.
// 
// Параметры:
//  НастройкаОтчета - СправочникСсылка.бит_НастройкиПроизвольныхОтчетов.
// 
// Возвращаемое значение:
//  Соответствие
// 
Функция ПолучитьНастройкуАналитик(НастройкаОтчета, Ключ = "Имя") Экспорт

	НастройкаАналитик = Новый Соответствие;
	
	Для каждого СтрокаТаблицы Из НастройкаОтчета.ИспользованиеАналитики Цикл
		
		СтрНастроек = бит_МеханизмДопИзмерений.КонструкторНастроекАналитик();
		
		СтрНастроек.Аналитика           = СтрокаТаблицы.Аналитика;
		СтрНастроек.ИмяАналитики        = СтрокаТаблицы.ИмяАналитики;
		СтрНастроек.ИмяПоля             = СтрокаТаблицы.ИмяПоля;
		СтрНастроек.Синоним             = СтрокаТаблицы.СинонимАналитики;
		СтрНастроек.Обязательное        = СтрокаТаблицы.Обязательное;
		СтрНастроек.ТипЗначения         = СтрокаТаблицы.Аналитика.ТипЗначения;
		СтрНастроек.ЭтоСоставнойТип     = бит_МеханизмДопИзмерений.ЭтоАналитикаСоставногоТипа(СтрокаТаблицы.Аналитика);
		СтрНастроек.ИмяТипаПоУмолчанию  = "";
		бит_МеханизмДопИзмерений.ОпределитьЗначениеПоУмолчанию(СтрНастроек);
		
		Если Ключ = "Аналитика" Тогда
			НастройкаАналитик.Вставить(СтрокаТаблицы.Аналитика,СтрНастроек);										  
		Иначе	
			НастройкаАналитик.Вставить(СтрокаТаблицы.ИмяАналитики,СтрНастроек);										  
		КонецЕсли; 
	
	КонецЦикла; 

	Возврат НастройкаАналитик;
	
КонецФункции // ПолучитьНастройкуАналитик()

// Функция формирует соответствие полей таблицы данных, 
// получаемой механизмом способов компоновки источников и полей аналитики.
// 
// Параметры:
//  НастройкаОтчета - СправочникСсылка.бит_НастройкиПроизвольныхОтчетов.
// 
// Возвращаемое значение:
//  Соответствие
// 
Функция ПолучитьПоляАналитики(НастройкаОтчета) Экспорт

	ПоляАналитики = Новый Соответствие;
	
	Для каждого СтрокаТаблицы Из НастройкаОтчета.ИспользованиеАналитики Цикл		
		ПоляАналитики.Вставить(СтрокаТаблицы.ИмяПоля,СтрокаТаблицы.ИмяАналитики);  		
	КонецЦикла;

	Возврат ПоляАналитики;
	
КонецФункции // ПолучитьПоляАналитики()

#КонецОбласти

#КонецЕсли
