#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если Не ЭтоГруппа Тогда
		
		бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь());
		
		ТипОтчета = Перечисления.бит_ТипыПроизвольныхОтчетов.ПроизвольныйОтчет;   		  		
		
		ФорматЧисел = "ЧЦ=15; ЧДЦ=2"; 
		Префикс     = "П";
		ДлинаИмени  = 4;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	Если Не ЭтоНовый() И ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;	
																		
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
КонецПроцедуры // ПриЗаписи()

Процедура ПриКопировании(ОбъектКопирования)
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, 
		Пользователи.ТекущийПользователь(), ОбъектКопирования);
		
	Наименование = СтрШаблон(НСтр("ru = '%1 (Копия)'"), ОбъектКопирования.Наименование);	
		
КонецПроцедуры // ПриКопировании()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПоляОбъекта = Новый Структура;
	ПоляОбъекта.Вставить("ИмяАналитики");
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект, "ИспользованиеАналитики", 
		ПоляОбъекта, Отказ);
		
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли