#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
  
// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти = Неопределено) Экспорт
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачальноеСальдо";
	Элемент.Наименование			  = НСтр("ru = 'Начальное сальдо'; en = 'Opening balance'", КодОсновногоЯзыка);
	Элемент.Код						  = "000000001";
	Элемент.ВидОперации				  = Перечисления.бит_вго_ВидыОперацийВГО.Остатки;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КонечноеСальдо";
	Элемент.Наименование			  = НСтр("ru = 'Конечное сальдо'; en = 'Closing balance'", КодОсновногоЯзыка);
	Элемент.Код						  = "000000002";
	Элемент.ВидОперации				  = Перечисления.бит_вго_ВидыОперацийВГО.Остатки;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЭффектОтПересчета";
	Элемент.Наименование			  = НСтр("ru = 'Курсовая разница от пересчета в валюту упр.';
											|en = 'Exchange rate difference from conversion into management accounting currency'", КодОсновногоЯзыка);
	Элемент.Код						  = "000000003";
	Элемент.ВидОперации				  = Перечисления.бит_вго_ВидыОперацийВГО.Остатки;
	
КонецПроцедуры
	
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт

	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);

КонецПроцедуры

Процедура ПроверитьПервоначальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_вго_ОперацииВГО КАК Таблица
	|ГДЕ
	|	Таблица.Предопределенный
	|	И Таблица.ЭтоГруппа = ЛОЖЬ
	|	И (Таблица.ТипОперации <> ЗНАЧЕНИЕ(Перечисление.бит_вго_ТипыОперацийВГО.ПустаяСсылка)
	|			ИЛИ Таблица.Родитель <> ЗНАЧЕНИЕ(Справочник.бит_вго_ОперацииВГО.ПустаяСсылка))";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли