
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность =
			ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект,
																						Элементы.ГруппаКоманднаяПанель);
		
		Если Элементы.Найти("ФормаОбщаяКомандаИнтеграцияС1СДокументооборотСоздатьБизнесПроцесс") <> Неопределено Тогда
			Элементы.Переместить(
				Элементы.ФормаОбщаяКомандаИнтеграцияС1СДокументооборотСоздатьБизнесПроцесс,
				Элементы.ФормаГруппаВводНаОсновании);
		КонецЕсли;
		Если Элементы.Найти("ФормаОбщаяКомандаИнтеграцияС1СДокументооборотСоздатьПисьмо") <> Неопределено Тогда
			Элементы.Переместить(
				Элементы.ФормаОбщаяКомандаИнтеграцияС1СДокументооборотСоздатьПисьмо,
				Элементы.ФормаГруппаВводНаОсновании);
		КонецЕсли;
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());	
	
	МетаданныеОбъекта = Метаданные.Задачи.бит_Задача;
	
	// Добавление кнопки "Раскрасить по статусам"
	// Также добавляются процедуры: К-РаскраситьПоСтатусам(), С-ОформитьСписокДокументовПоСтатусам().
	бит_РаботаСДиалогамиСервер.ДобавитьКнопкуРаскраситьПоСтатусам(Элементы, Команды, Элементы.ГруппаКоманднаяПанель,
																  МетаданныеОбъекта);
	ОформитьСписокДокументовПоСтатусам(Элементы.РаскраситьПоСтатусам.Пометка, Истина);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ПараметрыФормы = ПараметрыСозданияЗадачи(Копирование);
	
	ОткрытьФорму("Задача.бит_Задача.Форма.ФормаСозданияЗадачи", ПараметрыФормы, ЭтотОбъект, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	// АПК:271-выкл команда подключаемая при наличии подсистемы ИнтеграцияС1СДокументооборотом.
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда,
																											ЭтотОбъект,
																											Элементы.Список);
	// АПК:271-вкл
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

// Процедура назначается динамически действию кнопки командной панели 
// КоманднаяПанель.РаскраситьПоСтатусам
// (обработчик события "Нажатие" кнопки "РаскраситьПоСтатусам").
// 
&НаКлиенте
Процедура Подключаемый_РаскраситьПоСтатусам()
	
	Элементы.РаскраситьПоСтатусам.Пометка = Не Элементы.РаскраситьПоСтатусам.Пометка;
	ОформитьСписокДокументовПоСтатусам(Элементы.РаскраситьПоСтатусам.Пометка);	
		
КонецПроцедуры // РаскраситьПоСтатусам()

&НаКлиенте
Процедура КомандаЗадачаНаОсновании(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		РежимОкна  = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;				
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗадачаОснование", ТекущаяСтрока.Ссылка);
		ОткрытьФорму("Задача.бит_Задача.Форма.ФормаСозданияЗадачи",ПараметрыФормы, ЭтотОбъект,,,,, РежимОкна);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьИсториюИзменений(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Задача", ТекущаяСтрока.Ссылка);
		ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.Форма.ФормаИсторияСостоянийЗадач", ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры
     
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура обновляет оформление списка документов по статусам.
// 
// Параметры:
//  Булево 
// 
&НаСервере
Процедура ОформитьСписокДокументовПоСтатусам(Знач ПометкаКн, Знач ЭтоОткрытие = Ложь)

	Если ЭтоОткрытие И Не ПометкаКн Тогда
		Возврат;	
	КонецЕсли;

	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());	
	
	МетаданныеОбъекта = Метаданные.Задачи.бит_Задача;
	
	ОбъектыНаОбработку = ?(ПометкаКн, бит_РаботаСДиалогамиСервер.ПолучитьМассивОбъектов(МетаданныеОбъекта), Новый Массив);
	бит_РаботаСДиалогамиСервер.ОформитьСписокДокументовПоСтатусам(ОбъектыНаОбработку, ПометкаКн, УсловноеОформление, "Список", "Состояние");
	
	Если Не ЭтоОткрытие Тогда
		// Сохранение значения пометки.
		РегистрыСведений.бит_СохраненныеЗначения.СохранитьЗнч(Пользователи.ТекущийПользователь(),
			МетаданныеОбъекта, "РаскраситьПоСтатусам_Пометка", ПометкаКн);
	КонецЕсли;
															
КонецПроцедуры

&НаСервере
Функция ПараметрыСозданияЗадачи(Копирование)
	
	ПараметрыЗадачи = Новый Структура;
	
	ЗначениеКопирования = Элементы.Список.ТекущаяСтрока;
	
	Если Копирование
		И ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		
		СтруктураЗадачи = Новый Структура;
		
		КопируемыеРеквизиты = "БизнесПроцесс, Наименование, ТочкаМаршрута, Исполнитель, РольИсполнителя, ОбъектАдресации_1,
							|ОбъектАдресации_2, ОбъектАдресации_3, Важность, Описание, Предмет, ЗадачаОснование, Алгоритм,
							|АлгоритмПодчиненный, ТочкаАлгоритма, ЭтоПроверочнаяЗадача, Виза";
		СтруктураЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначениеКопирования, КопируемыеРеквизиты);
	Иначе
		СтруктураЗадачи = ПолучитьПараметрыОтбораСписка();	
	КонецЕсли;
	
	ПараметрыЗадачи.Вставить("СтруктураЗадачи", СтруктураЗадачи);
	
	Возврат ПараметрыЗадачи;
	
КонецФункции

// Функция получает необходимые элементы отбора в списке.
// 
// Возвращаемое значение:
// 	СтруктураОтбора - структура
// 
&НаСервере
Функция ПолучитьПараметрыОтбораСписка()
	
	СтруктураОтбора = Новый Структура;
	ОтборСписка     = Список.Отбор;
	ПолеПредмет     = Новый ПолеКомпоновкиДанных("Предмет");
	
	Для Каждого ТекЭлемент Из ОтборСписка.Элементы Цикл
		
		Если ТекЭлемент.ЛевоеЗначение = ПолеПредмет Тогда
			СтруктураОтбора.Вставить("Предмет", ТекЭлемент.ПравоеЗначение);			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураОтбора;
	
КонецФункции

#КонецОбласти
