
&НаКлиенте
Процедура Сохранить(Команда) 
	
	 Модифицированность = Ложь;

    Оповестить("УстановленОтбор_ФормированиеЗаказовНаПроизводствоПоПлану", КомпоновщикНастроек);

    Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 Если Параметры.Свойство("АдресСхемыКомпоновкиДанных") Тогда
        АдресСхемыКомпоновкиДанных = Параметры.АдресСхемыКомпоновкиДанных;
    КонецЕсли;

    Если Параметры.Свойство("КомпоновщикНастроек") Тогда
        КомпоновщикНастроек = Параметры.КомпоновщикНастроек;
    Иначе
        ИнициализироватьКомпоновщикНастроекПоАдресу();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроекПоАдресу()

    Если НЕ ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда
        Возврат;
    КонецЕсли;

    СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);

    ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);

    КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
    КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
    КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);

КонецПроцедуры
