
&НаКлиенте
Процедура Сохранить(Команда) 
	
	УстановитьПериодВКомпоновщикНаСервере();

    ПараметрыВозврата = Новый Структура;
    ПараметрыВозврата.Вставить("КомпоновщикНастроек", КомпоновщикНастроек);
    ПараметрыВозврата.Вставить("ПериодОтбор", ПериодОтбор);

    Оповестить("УстановленОтбор_ФормированиеЗаказовНаПроизводствоПоПлану", ПараметрыВозврата);
    Закрыть();	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресСхемыКомпоновкиДанных") Тогда
        АдресСхемыКомпоновкиДанных = Параметры.АдресСхемыКомпоновкиДанных;
    КонецЕсли;

    Если Параметры.Свойство("КомпоновщикНастроек") Тогда
        КомпоновщикНастроек = Параметры.КомпоновщикНастроек;
    Иначе
        ИнициализироватьКомпоновщикНастроекПоАдресу();
	КонецЕсли;
	
	Если Параметры.Свойство("ТаблицаДинамическихПолей") Тогда
	    ТаблицаДинамическихПолей = Параметры.ТаблицаДинамическихПолей;
	КонецЕсли;
	
	Если Параметры.Свойство("ПериодОтбор") Тогда
		ПериодОтбор = Параметры.ПериодОтбор;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроекПоАдресу()

    Если НЕ ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда
        Возврат;
    КонецЕсли;

    СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);

    ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);

    КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
    КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
    КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);

КонецПроцедуры

&НаСервере
Процедура УстановитьПериодВКомпоновщикНаСервере()

    КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ПериодОтбор);

КонецПроцедуры

