
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
    Если Параметры.Ключ.Пустая() Тогда // Если это новый документ
        
        ПодготовитьФормуНаСервере();
    		
		ЭтоРегистрБюджетирования = Объект.ОбъектСистемы = фРегБухБюджетирование;
		
		Если ЗначениеЗаполнено(Объект.Сценарий)	И Не ЭтоРегистрБюджетирования Тогда
			Объект.Сценарий = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) И ЭтоРегистрБюджетирования Тогда
			Объект.Организация = Неопределено;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда			
			// Заполним сценарий при необходимости.
			ЗаполнитьСценарий();			
			// Приведем тип значения счетов и субконто.
			ПривестиТипЗначенияСчетовИСубконто();			
		КонецЕсли;
		
    КонецЕсли;
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
	// Установим связи субконто.
	УстановитьСвязиСубконто();
	
	УстановитьПараметрыВыбораДляСчетов();
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ЭтотОбъект.ВладелецФормы) = Тип("ТаблицаФормы") 
    	И ЭтотОбъект.ВладелецФормы.Родитель.ИмяФормы = "Документ.бит_ПереоценкаВалютныхДенежныхСтатей.Форма.ФормаСписка"
    	И ЭтотОбъект.ВладелецФормы.Родитель.фФормаСпискаОткрытаСОтбором Тогда    
    	Элементы.ОбъектСистемы.Видимость = Не ЗначениеЗаполнено(Объект.ОбъектСистемы);    
    КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Стандатные подсистемы ДатыЗапретаИзменения
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры // ПослеЗаписи()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_ПереоценкаВалютныхДенежныхСтатей";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
	ИзменениеОбъектСистемыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповещениеВыбор = Новый ОписаниеОповещения("ВыборОбъектСистемы", ЭтотОбъект);
	ПоказатьВыборИзСписка(ОповещениеВыбор, фСписокРегистров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ИзменениеОрганизацииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетРасходовПриИзменении(Элемент)
	
	ИзменениеСчетРасходовСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоРасходовПриИзменении(Элемент)
	
	ЗначениеСубконто = Объект[Элемент.Имя];
	ИзменениеСубконто(Объект, ЗначениеСубконто, "СубконтоРасходов");
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

   ЗначениеСубконто = Объект[Элемент.Имя];	
   НачалоВыбораСубконто(Элемент, СтандартнаяОбработка, Объект, ЗначениеСубконто, "СубконтоРасходов");
   
КонецПроцедуры

&НаКлиенте
Процедура СубконтоРасходовАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
    ЗначениеСубконто = Объект[Элемент.Имя];	
	ИсключитьОрганизацию = Объект.ОбъектСистемы = фРегБухБюджетирование;	
	
	ПараметрыСубконто = Новый Структура;
	ПараметрыСубконто.Вставить("ИмяСубконто"       , "СубконтоРасходов");
	ПараметрыСубконто.Вставить("ЗначениеСубконто"  , ЗначениеСубконто);
	ПараметрыСубконто.Вставить("КоличествоСубконто", фКоличествоСубконто);
	бит_БухгалтерияКлиент.СубконтоАвтоПодбор(Элемент, Параметры, Объект, Объект, ПараметрыСубконто, ИсключитьОрганизацию);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовПриИзменении(Элемент)
	
	ИзменениеСчетДоходовСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовПриИзменении(Элемент)
	
	ЗначениеСубконто = Объект[Элемент.Имя];
	ИзменениеСубконто(Объект, ЗначениеСубконто, "СубконтоДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

   ЗначениеСубконто = Объект[Элемент.Имя];	
   НачалоВыбораСубконто(Элемент, СтандартнаяОбработка, Объект, ЗначениеСубконто, "СубконтоДоходов");
   
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДоходовАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ЗначениеСубконто = Объект[Элемент.Имя];	
	ИсключитьОрганизацию = Объект.ОбъектСистемы = фРегБухБюджетирование;	
	
	ПараметрыСубконто = Новый Структура;
	ПараметрыСубконто.Вставить("ИмяСубконто"       , "СубконтоДоходов");
	ПараметрыСубконто.Вставить("ЗначениеСубконто"  , ЗначениеСубконто);
	ПараметрыСубконто.Вставить("КоличествоСубконто", фКоличествоСубконто);
	бит_БухгалтерияКлиент.СубконтоАвтоПодбор(Элемент, Параметры, Объект, Объект, ПараметрыСубконто, ИсключитьОрганизацию);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоВсемОрганизациямПриИзменении(Элемент)
	
	Если Объект.ПоВсемОрганизациям Тогда
		Объект.Организация = Неопределено;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоВсемЦФОПриИзменении(Элемент)
	
	Если Объект.ПоВсемЦФО Тогда
		Объект.ЦФО = Неопределено;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеСлужебныеПроцедурыИФункции

// Процедура заполняет значения, необходимые при работе на клиенте.
//
&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	// Представление документа для формирования заголовка.
	фПредставлениеОбъекта = Объект.Ссылка.Метаданные().ПредставлениеОбъекта;
    
	// Получим количество субконто плана счетов регистра.
	ПолучитьКоличествоСубконто();
	
	// Заполним значения реквизитов формы.
	МетаРегБухБюджетирование = Метаданные.РегистрыБухгалтерии.бит_Бюджетирование;
	МетаРегБухМеждународный  = Метаданные.РегистрыБухгалтерии.бит_Дополнительный_2;
	
	фРегБухБюджетирование = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаРегБухБюджетирование);
	фРегБухМеждународный  = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаРегБухМеждународный);
	
	// Сформируем список регистров бухгалтерии для выбора.
	ВидОбъектаРегБух = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии;	
	фСписокРегистров = бит_УправленческийУчет.СформироватьСписокОбъектовДляВыбора(ВидОбъектаРегБух, "бит_Дополнительный");    	
	// Отсортируем список регистров для выбора.
	фСписокРегистров.СортироватьПоПредставлению();
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры // ПодготовитьФормуНаСервере()

// Процедура осуществляет управление доступностью/видимостью элементов формы.
// 
// Параметры:
//  Нет.
// 
&НаСервере 
Процедура УправлениеЭлементамиФормы()
    
    ОбъектСистемы 			 = Объект.ОбъектСистемы;
	ЭтоРегистрБюджетирования = ОбъектСистемы = фРегБухБюджетирование;
	ЕстьОрганизация = бит_МеханизмДопИзмерений.ЕстьДопИзмерениеОрганизация();	
	
	Элементы.Сценарий.Видимость	          = ЭтоРегистрБюджетирования;
	Элементы.ЦФО.Видимость                = ЭтоРегистрБюджетирования;
	Элементы.ПоВсемЦФО.Видимость          = ЭтоРегистрБюджетирования;
	Элементы.Организация.Видимость        = Не ЭтоРегистрБюджетирования ИЛИ ЕстьОрганизация;
	Элементы.ПоВсемОрганизациям.Видимость = ЭтоРегистрБюджетирования И ЕстьОрганизация;
	Если ЭтоРегистрБюджетирования Тогда
		Элементы.Организация.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	Элементы.Организация.Доступность = НЕ Объект.ПоВсемОрганизациям;
	Элементы.ЦФО.Доступность         = НЕ Объект.ПоВсемЦФО;
	
	Элементы.ПереоценкаСуммаСценарий.Видимость = ЭтоРегистрБюджетирования;
	Если бит_ОбщегоНазначения.ЕстьОбъектыМСФО() И бит_ОбщегоНазначения.ЕстьРеквизит("ПереоценкаСуммаМУ", Метаданные.Документы.бит_ПереоценкаВалютныхДенежныхСтатей) Тогда
		Элементы.ПереоценкаСуммаМУ.Видимость = ОбъектСистемы = фРегБухМеждународный;	
	КонецЕсли;
	
	Элементы.ГруппаСчета.Видимость = ЗначениеЗаполнено(ОбъектСистемы);
	
	Элементы.ОтразитьВЗакрытомПериоде.Видимость = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(
		Пользователи.ТекущийПользователь(), ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноОтражениеДокументовВЗакрытомПериоде);
												   
КонецПроцедуры

// Процедура устанвливает параметры выбора для элементов формы. 
// 
// Параметры:
//  МассивЭлементов - Массив.
// 
&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.СчетРасходов);
	МассивЭлементов.Добавить(Элементы.СчетДоходов);
	
	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры // УстановитьПараметрыВыбораДляСчетов() 

// Процедура обрабатывает изменение субконто.
// 
// Параметры:
//  Контейнер        - Произвольный.
//  ЗначениеСубконто - Произвольный. Текущее значение субконто.
//  ИмяСубконтоСчета - Строка. / "СубконтоРасходов" / "СубконтоДоходов" /.
// 
&НаКлиенте
Процедура ИзменениеСубконто(Контейнер, ЗначениеСубконто, ИмяСубконтоСчета)

	СтруктураСубконто = бит_БухгалтерияКлиент.ПодготовитьСтруктуруСубконто(Контейнер,
		ИмяСубконтоСчета, фКоличествоСубконто);
																				
	бит_БухгалтерияВызовСервера.ОбработатьИзменениеСубконто(СтруктураСубконто,
		ИмяСубконтоСчета, ЗначениеСубконто, фКоличествоСубконто);
													 
	бит_БухгалтерияКлиент.ЗаполнитьСубконтоПоСтруктуре(СтруктураСубконто, Контейнер,
		ИмяСубконтоСчета, "", фКоличествоСубконто);

КонецПроцедуры // ИзменениеСубконтоСубконтоРасходов()

// Процедура обрабатывает начало выбора субконто.
// 
// Параметры:
//  Элемент              - ЭлементУправления.
//  СтандартнаяОбработка - Булево.
//  Контейнер            - Произвольный.
//  ЗначениеСубконто     - Произвольный.
//  ИмяСубконтоСчета     - Строка. / "СубконтоРасходов" / "СубконтоДоходов" /.
// 
&НаКлиенте
Процедура НачалоВыбораСубконто(Элемент, СтандартнаяОбработка, Контейнер, ЗначениеСубконто, ИмяСубконтоСчета)
	
	ИсключитьОрганизацию = ?(Объект.ОбъектСистемы = фРегБухБюджетирование, Истина, Ложь);
	СтруктураПараметров  = бит_БухгалтерияКлиент.ПодготовитьПараметрыВыбораСубконто(Контейнер, 
		ИмяСубконтоСчета, ЗначениеСубконто, фКоличествоСубконто, Объект, ИсключитьОрганизацию);	
	
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураПараметров);
		
КонецПроцедуры

// Обработка выбора объекта системы. 
// 
// Параметры:
//  ВыбранноеЗначение - СправочникСсылка.бит_ОбъектыСистемы.
// 
&НаКлиенте
Процедура ВыборОбъектСистемы(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если Не ВыбранноеЗначение = Неопределено Тогда
		
		Объект.ОбъектСистемы = ВыбранноеЗначение.Значение;
		ИзменениеОбъектСистемыСервер();
		Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры // ВыборОбъектСистемы() 

// Процедура получает количество субконто.
// 
&НаСервере 
Процедура ПолучитьКоличествоСубконто()
	
	Если ЗначениеЗаполнено(Объект.ОбъектСистемы) Тогда		
		МатаданныеПланаСчетов = Метаданные.РегистрыБухгалтерии[Объект.ОбъектСистемы.ИмяОбъекта].ПланСчетов;
		фКоличествоСубконто   = МатаданныеПланаСчетов.МаксКоличествоСубконто;		
	Иначе
		фКоличествоСубконто = 0;
	КонецЕсли;
	
КонецПроцедуры // ПолучитьКоличествоСубконто()

// Процедура заполняет сценарий, если он не заполнен и выбран регистр бюджетирования.
// 
// Параметры:
//  Нет.
// 
&НаСервере 
Процедура ЗаполнитьСценарий()
	
	Если Не ЗначениеЗаполнено(Объект.Сценарий)
		И Объект.ОбъектСистемы = фРегБухБюджетирование Тогда
		
		// Получаем имя справочника Сценарии бюджетирования в зависимости от текущего решения.
		ИмяСправочникаСценарии = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();
		
		// Заполним на предопределенный ФАКТ.
		Объект.Сценарий = Справочники[ИмяСправочникаСценарии].ФАКТ;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСценарий()

// Процедура устанавливает связи субконто счета расхода и дохода.
// 
// Параметры:
//  Нет.
// 
&НаСервере 
Процедура УстановитьСвязиСубконто()
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектСистемы) Тогда
		Возврат
	КонецЕсли;
	
	// Устанавливаем связи параметров выбора и связи по типу субконто для расходов.
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы, "СчетРасходов", "СубконтоРасходов", фКоличествоСубконто);
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(Объект.СчетРасходов, фКоличествоСубконто);									  
	бит_БухгалтерскийУчет.УстановитьНастройкиЭлементов(Элементы, НастройкиСубконто, "СубконтоРасходов");
	
	// Устанавливаем связи параметров выбора и связи по типу субконто для доходов.
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы, "СчетДоходов", "СубконтоДоходов", фКоличествоСубконто);
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(Объект.СчетДоходов, фКоличествоСубконто);									  
	бит_БухгалтерскийУчет.УстановитьНастройкиЭлементов(Элементы, НастройкиСубконто, "СубконтоДоходов");
	
КонецПроцедуры // УстановитьСвязиСубконто()

// Процедура выполняет действия необходимые при изменении Организации. Сервер.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура ИзменениеОрганизацииСервер()
	
	бит_БухгалтерскийУчет.ПроверитьСоответствиеОрганизации(Объект, "СубконтоРасходов", фКоличествоСубконто);
	бит_БухгалтерскийУчет.ПроверитьСоответствиеОрганизации(Объект, "СубконтоДоходов" , фКоличествоСубконто);
	
КонецПроцедуры // ИзменениеОрганизацииСервер()

// Процедура обрабатывает изменение объекта системы. Сервер.
// 
// Параметры:
//  Нет.
// 
&НаСервере 
Процедура ИзменениеОбъектСистемыСервер()
	
	ЭтоРегистрБюджетирования = ?(Объект.ОбъектСистемы = фРегБухБюджетирование, Истина, Ложь);
	ЭтоРегистрМУ 			 = ?(Объект.ОбъектСистемы = фРегБухМеждународный , Истина, Ложь);
	
	Если ЗначениеЗаполнено(Объект.Сценарий)
		И Не ЭтоРегистрБюджетирования Тогда
		Объект.Сценарий = Неопределено;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.Организация)
		И ЭтоРегистрБюджетирования Тогда
		Объект.Организация = Неопределено;
	КонецЕсли;
	
	Если Объект.ПереоценкаСуммаСценарий
		И Не ЭтоРегистрБюджетирования Тогда
		Объект.ПереоценкаСуммаСценарий = Ложь;
	КонецЕсли;
		
	Если бит_ОбщегоНазначения.ЕстьОбъектыМСФО() И Объект.ПереоценкаСуммаМУ
		И Не ЭтоРегистрМУ Тогда
		Объект.ПереоценкаСуммаМУ = Ложь;
	КонецЕсли;
	
	// Заполним сценарий при необходимости.
	ЗаполнитьСценарий();
	
	// Получим и запишем количество субконто плана счетов регистра в кэш значений.
	ПолучитьКоличествоСубконто();
	
	// Приведем тип значения счетов и субконто.
	ПривестиТипЗначенияСчетовИСубконто();
	
	// Установим связи субконто.
	УстановитьСвязиСубконто();
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ИзменениеОбъектСистемыСервер()

// Процедура приводит тип значения счетов и субконто к типу плана счетов 
// выбранного регистра бухгалтерии.
// 
// Параметры:
//  Нет.
// 
&НаСервере 
Процедура ПривестиТипЗначенияСчетовИСубконто()
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектСистемы) Тогда
		
		Объект.СчетРасходов = Неопределено;
		Объект.СчетДоходов  = Неопределено;
		
	Иначе
		
		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить("СчетРасходов");
		МассивСчетов.Добавить("СчетДоходов");
		
		// Получим пустую ссылку плана счетов выбранного регистра бухгалтерии.
		ИмяРегБух 	     = Объект.ОбъектСистемы.ИмяОбъекта;
		ИмяПланаСчетов   = Метаданные.РегистрыБухгалтерии[ИмяРегБух].ПланСчетов.Имя;
		СчетПустаяСсылка = ПланыСчетов[ИмяПланаСчетов].ПустаяСсылка();
		
		Для Каждого ТекИмяРеквизитаСчета Из МассивСчетов Цикл
			
			ЗначениеСчета = Объект[ТекИмяРеквизитаСчета];
			
			Если ЗначениеСчета = Неопределено Тогда
				
				Объект[ТекИмяРеквизитаСчета] = СчетПустаяСсылка;
				
				Если ТекИмяРеквизитаСчета = "СчетРасходов" Тогда
					ИзменениеСчетРасходовСервер();
				Иначе
					ИзменениеСчетДоходовСервер();
				КонецЕсли;
				
			Иначе
				
				Если Не ТипЗнч(ЗначениеСчета) = ТипЗнч(СчетПустаяСсылка) Тогда
					
					// Найдем счет по коду ранее выбранного счета.
					СчетДляЗамены = ПланыСчетов[ИмяПланаСчетов].НайтиПоКоду(ЗначениеСчета.Код);
					
					Если ЗначениеЗаполнено(СчетДляЗамены) Тогда
						Объект[ТекИмяРеквизитаСчета] = СчетДляЗамены;
					Иначе
						Объект[ТекИмяРеквизитаСчета] = СчетПустаяСсылка;
					КонецЕсли;
					
					Если ТекИмяРеквизитаСчета = "СчетРасходов" Тогда
						ИзменениеСчетРасходовСервер();
					Иначе
						ИзменениеСчетДоходовСервер();
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли; // Если ЗначениеСчета = Неопределено Тогда
			
		КонецЦикла; // Для Каждого ТекИмяРеквизитаСчета Из МассивСчетов Цикл.
		
	КонецЕсли; // Если Не ЗначениеЗаполнено(ОбъектСистемы) Тогда.
	
КонецПроцедуры // ПривестиТипЗначенияСчетовИСубконто()

// Процедура обрабатывает изменение счета "СчетРасходов". Сервер.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура ИзменениеСчетРасходовСервер()
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(Объект.СчетРасходов, фКоличествоСубконто);
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(Объект, НастройкиСубконто, "СубконтоРасходов");
	бит_БухгалтерскийУчет.УстановитьНастройкиЭлементов(Элементы, НастройкиСубконто, "СубконтоРасходов");
	
КонецПроцедуры // ИзменениеСчетРасходовСервер()

// Процедура обрабатывает изменение счета "СчетДоходов". Сервер.
// 
// Параметры:
//  Нет.
// 
// 
&НаСервере
Процедура ИзменениеСчетДоходовСервер()
	
	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(Объект.СчетДоходов, фКоличествоСубконто);
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(Объект, НастройкиСубконто, "СубконтоДоходов");
	бит_БухгалтерскийУчет.УстановитьНастройкиЭлементов(Элементы, НастройкиСубконто, "СубконтоДоходов");
	
КонецПроцедуры // ИзменениеСчетДоходовСервер()

#КонецОбласти

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

#КонецОбласти

