
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ПроверитьОтключитьРегламентноеЗадание();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьОтключитьРегламентноеЗадание()
	
	ИспользоватьЭлектроннуюПочту = Значение;
	
	Если ИспользоватьЭлектроннуюПочту Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Метаданные", "бит_ВизированиеЧерезПочту");
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	
	Если Задания.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	// Выключаем задание.
	ЗаданиеОповещенийПочты = Задания[0];
	Параметры = Новый Структура();
	Параметры.Вставить("Использование", Ложь);
	РегламентныеЗаданияСервер.ИзменитьЗадание(ЗаданиеОповещенийПочты.УникальныйИдентификатор, Параметры);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли