#Область СлужебныеПроцедурыИФункции

Функция ТипыОбъектовСоСтороннимиПечатнымиФормами() Экспорт
	
	Возврат КадровыйЭДОБазовый.ТипыОбъектовСоСтороннимиПечатнымиФормами();
	
КонецФункции

Процедура ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек) Экспорт
	
	КадровыйЭДОРасширенный.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	
КонецПроцедуры

Процедура ДокументКадровогоЭДОФормаСпискаПриСозданииНаСервере(УправляемаяФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	КадровыйЭДОРасширенный.ДокументКадровогоЭДОФормаСпискаПриСозданииНаСервере(УправляемаяФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
