#Область ПрограммныйИнтерфейс

Процедура ДанныеОтчета(Параметры, АдресРезультата) Экспорт
	
	КоличествоЭтапов = 3;
	НомерЭтапа = 1;
	ПрогрессВыполнения = 0;
	
	ТекстЭтапа = НСтр("ru = 'Подготовка вспомогательных данных';
						|en = 'Preparation of supporting data'");
	ТекстЭтапаПроцесса = ИТК_Строки.ТекстЭтапаПроцесса(ТекстЭтапа, НомерЭтапа, КоличествоЭтапов);
	ИТК_ДлительныеОперации.СообщитьПрогресс(ТекстЭтапаПроцесса, ПрогрессВыполнения);
	
	// Подготовка настроек отчета
	НастройкиОтчета = Новый Структура;

	ГруппировкиСтрок = Параметры.ГруппировкиСтрок;
	НастройкиОтчета.Вставить("ГруппировкиСтрок", ГруппировкиСтрок);
	
	ПолеКолонок = Параметры.ПолеКолонок;
	НастройкиОтчета.Вставить("ПолеКолонок", ПолеКолонок);

	НастройкиОтчета.Вставить("ОтборМетаданных", Параметры.ОтборМетаданных);
	НастройкиОтчета.Вставить("ОтборРолей", Параметры.ОтборРолей);
	
	НастройкиОтчета.Вставить("ОтборПользователей", Параметры.ОтборПользователей);
	НастройкиОтчета.Вставить("ОтборПользователейИсключитьНедоступных", Параметры.ОтборПользователейИсключитьНедоступных);
	
	НастройкиОтчета.Вставить("ОтборПравДоступа", Параметры.ОтборПравДоступа);
	
	ОтборыГруппировок = Новый Соответствие;
	ОтборыГруппировок.Вставить("Метаданные", Параметры.ОтборМетаданных);
	ОтборыГруппировок.Вставить("Пользователь", Параметры.ОтборПользователей);
	ОтборыГруппировок.Вставить("ПравоДоступа", Параметры.ОтборПравДоступа);
	ОтборыГруппировок.Вставить("Роль", Параметры.ОтборРолей);
	
	НастройкиОтчета.Вставить("ОтборыГруппировок", ОтборыГруппировок);
	
	// Подготовка группировок
	Группировки = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(ГруппировкиСтрок);
	Группировки.Добавить(ПолеКолонок, ИТК_АнализПравДоступаКлиентСервер.ПредставлениеПоляОтчета(ПолеКолонок));
	
	Для Каждого КлючИЗначение Из ОтборыГруппировок Цикл 
		
		Если ЗначениеЗаполнено(КлючИЗначение.Значение)
				И Группировки.НайтиПоЗначению(КлючИЗначение.Ключ) = Неопределено Тогда
			Группировки.Добавить(КлючИЗначение.Ключ, , Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	НастройкиОтчета.Вставить("Группировки", Группировки);
	
	НастройкиОтчета.Вставить("ГруппироватьМетаданныеПоКоллекциям", Параметры.ГруппироватьМетаданныеПоКоллекциям);
	НастройкиОтчета.Вставить("ОтображатьНеустановленныеПраваДоступа", Параметры.ОтображатьНеустановленныеПраваДоступа);
	
	НастройкиОтчета.Вставить("ПолеРесурса", "Доступ");
	
	ИспользуютсяМетаданные = ПолеИспользуетсяВОтчете(НастройкиОтчета, "Метаданные");
	НастройкиОтчета.Вставить("ИспользуютсяМетаданные", ИспользуютсяМетаданные);
	
	ИспользуетсяРоль = ПолеИспользуетсяВОтчете(НастройкиОтчета, "Роль");
	НастройкиОтчета.Вставить("ИспользуетсяРоль", ИспользуетсяРоль);
	
	ИспользуетсяПользователь = ПолеИспользуетсяВОтчете(НастройкиОтчета, "Пользователь");
	НастройкиОтчета.Вставить("ИспользуетсяПользователь", ИспользуетсяПользователь);
	
	ИспользуетсяПравоДоступа = ПолеИспользуетсяВОтчете(НастройкиОтчета, "ПравоДоступа");
	НастройкиОтчета.Вставить("ИспользуетсяПравоДоступа", ИспользуетсяПравоДоступа);
	
	// Заполнение вспомогательной таблицы
	ТаблицаПрав = СозданиеСлужебнойТаблицыПрав(НастройкиОтчета);
	ПодготовитьВспомогательныеДанные(НастройкиОтчета);
	НастройкиОтчета.Вставить("КоличествоЭтапов", КоличествоЭтапов);
	
	// Заполнение прав
	ОписаниеПрава = Новый Структура;
	ЗаполнениеТаблицуЗначенийПоГруппировке(ТаблицаПрав, НастройкиОтчета, ОписаниеПрава);
	
	ДополнитьТаблицуНеустановленнымиПравами(ТаблицаПрав, НастройкиОтчета);
	
	// Вывод данных
	НомерЭтапа = 3;
	ПрогрессВыполнения = 95;
	ТекстЭтапа = НСтр("ru = 'Вывод данных';
						|en = 'Data output'");
	ТекстЭтапаПроцесса = ИТК_Строки.ТекстЭтапаПроцесса(ТекстЭтапа, НомерЭтапа, КоличествоЭтапов);
	ИТК_ДлительныеОперации.СообщитьПрогресс(ТекстЭтапаПроцесса, ПрогрессВыполнения);
	
	РезультатВыполнения = ВыполнитьОтчетНаСКД(ТаблицаПрав, НастройкиОтчета);
	
	// Подготовка табличного документ
	ТабличныйДокументРезультат = Новый ТабличныйДокумент;
	
	ТабличныйДокументОтборы = ПодготовитьТабличныйДокументОтборов(НастройкиОтчета);
	ТабличныйДокументРезультат.Вывести(ТабличныйДокументОтборы);
	
	ТабличныйДокументОтчет = РезультатВыполнения.ДокументРезультат;
	ИТК_ТабличныйДокумент.ОформитьЧередованиеСтрок(ТабличныйДокументОтчет);
	ОформлениеТабличногоДокументаОбъединенияЗаголовкаКолонки(ТабличныйДокументОтчет);
		
	ТабличныйДокументРезультат.Вывести(ТабличныйДокументОтчет);
	
	ТабличныйДокументПодвал = ПодготовитьТабличныйДокументПодвал();
	ТабличныйДокументРезультат.Вывести(ТабличныйДокументПодвал);
	
	Результат = Новый Структура;
	Результат.Вставить("ДокументРезультат", ТабличныйДокументРезультат);
	Результат.Вставить("ДанныеРасшифровки", РезультатВыполнения.ДанныеРасшифровки);
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Функция ВсеПользователиСписок() Экспорт 
	
	Результат = Новый СписокЗначений;
	
	Для Каждого Пользователь Из ВсеПользователи() Цикл 
		
		Результат.Добавить(Пользователь.УникальныйИдентификатор, Пользователь.ПолноеИмя);

	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВсеПользователи(ИсключитьНедоступных = Ложь) Экспорт 
	
	Результат = ПользователиТаблицаРезультата();
	
	Для Каждого ПользовательИБ Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл 
		
		ДобавитьПользователяВРезультат(Результат, ПользовательИБ, ИсключитьНедоступных);

	КонецЦикла;
	
	Результат.Сортировать("ПолноеИмя");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СозданиеСлужебнойТаблицыПрав(НастройкиОтчета)
	
	Результат = Новый ТаблицаЗначений;

	Если НастройкиОтчета.ИспользуютсяМетаданные Тогда
		Результат.Колонки.Добавить("Метаданные", ИТК_ТипыКлиентСервер.ОписаниеКоллекцияИИмяМетаданных());
	КонецЕсли;
	
	Если НастройкиОтчета.ГруппироватьМетаданныеПоКоллекциям Тогда
		
		Результат.Колонки.Добавить("Коллекция", ИТК_ТипыКлиентСервер.ОписаниеИмяМетаданных());
		Результат.Колонки.Добавить("КоллекцияПорядок", ИТК_ТипыКлиентСервер.ОписаниеЧисло(10));
		
	КонецЕсли;
	
	Если НастройкиОтчета.ИспользуетсяРоль Тогда
		Результат.Колонки.Добавить("Роль", ИТК_ТипыКлиентСервер.ОписаниеИмяМетаданных());
	КонецЕсли;
	
	Если НастройкиОтчета.ИспользуетсяПользователь Тогда
		Результат.Колонки.Добавить("Пользователь", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
		Результат.Колонки.Добавить("ПользовательДоступный", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	КонецЕсли;
	
	Если НастройкиОтчета.ИспользуетсяПравоДоступа Тогда
		
		Результат.Колонки.Добавить("ПравоДоступаРасшифровка", ИТК_ТипыКлиентСервер.ОписаниеИмяМетаданных());
		Результат.Колонки.Добавить("ПравоДоступа", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
		Результат.Колонки.Добавить("ПравоДоступаПорядок", ИТК_ТипыКлиентСервер.ОписаниеЧисло(10));
		
	КонецЕсли;
	
	Результат.Колонки.Добавить("Доступ", ИТК_ТипыКлиентСервер.ОписаниеСтрока(5));
	
	Для Каждого Колонка Из Результат.Колонки Цикл 
		
		ИмяКолонки = Колонка.Имя;
		Если СтрЗаканчиваетсяНа(ИмяКолонки, "Расшифровка")
				ИЛИ СтрЗаканчиваетсяНа(ИмяКолонки, "Порядок") Тогда
			Продолжить;
		КонецЕсли;
		
		Колонка.Заголовок = ИТК_АнализПравДоступаКлиентСервер.ПредставлениеПоляОтчета(Колонка.Имя);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолеИспользуетсяВОтчете(НастройкиОтчета, Поле)
	
	Если НастройкиОтчета.ПолеКолонок = Поле Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НастройкиОтчета.ГруппировкиСтрок.НайтиПоЗначению(Поле) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОтборГруппировки = НастройкиОтчета.ОтборыГруппировок.Получить(Поле);
	
	Если ТипЗнч(ОтборГруппировки) = Тип("СписокЗначений") Тогда
		Результат = (ОтборГруппировки.Количество() = 1);
	Иначе
		
		ЭлементыОтбора = СтрРазделить(ОтборГруппировки, ", ");
		Результат = (ЭлементыОтбора.Количество() = 1)
						И СтрНайти(ЭлементыОтбора[0], ".");
						
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовитьВспомогательныеДанные(НастройкиОтчета)
	
	// Группировки выполнения
	ГруппировкиВыполнения = ИТК_ОбщийКлиентСервер.СкопироватьОбъект(НастройкиОтчета.Группировки);
	
	ГруппировкаМетаданные = ГруппировкиВыполнения.НайтиПоЗначению("Метаданные");
	Если ГруппировкаМетаданные <> Неопределено Тогда // Метаданные сдвигаем в начало
		ГруппировкиВыполнения.Сдвинуть(ГруппировкаМетаданные, -ГруппировкиВыполнения.Индекс(ГруппировкаМетаданные));
	КонецЕсли;
	
	ГруппировкаПраваДоступа = ГруппировкиВыполнения.НайтиПоЗначению("ПравоДоступа");
	Если ГруппировкаПраваДоступа <> Неопределено Тогда // Права доступа сдвигаем в конец
		
		Сдвиг = (ГруппировкиВыполнения.Количество() - 1) - ГруппировкиВыполнения.Индекс(ГруппировкаПраваДоступа);
		ГруппировкиВыполнения.Сдвинуть(ГруппировкаПраваДоступа, Сдвиг);
		
	КонецЕсли;
	НастройкиОтчета.Вставить("ГруппировкиВыполнения", ГруппировкиВыполнения);
	
	// Источники группировок
	ИсточникиГруппировок = Новый Соответствие;
	Для Каждого ЭлементГруппировка Из ГруппировкиВыполнения Цикл 
		
		ИмяГруппировки = ЭлементГруппировка.Значение;
		
		Если ИмяГруппировки = "Метаданные" Тогда
			
			ИсточникГруппировки = ОбъектыТаблицыСУчетомОтбора(НастройкиОтчета);
			
		ИначеЕсли ИмяГруппировки = "Роль" Тогда
			
			ИсточникГруппировки = РолиСУчетомОтбора(НастройкиОтчета);
			
		ИначеЕсли ИмяГруппировки = "ГруппаПользователей" Тогда
			
			ИсточникГруппировки = ГруппаПользователейСУчетомОтбора(Неопределено);
			
		ИначеЕсли ИмяГруппировки = "Пользователь" Тогда
			
			ИсточникГруппировки = ПользователиСУчетомОтборов(НастройкиОтчета);
			
		ИначеЕсли ИмяГруппировки = "ПравоДоступа" Тогда
			
			ПраваДоступаКоллекцииСУчетомОтборов = НастройкиОтчета.ПраваДоступаКоллекцииСУчетомОтборов;
			Для Каждого Коллекция Из ПраваДоступаКоллекцииСУчетомОтборов Цикл 
				
				ИмяКоллекции = Коллекция.Ключ;
				
				ПраваДоступа = ПраваДоступаСУчетомОтбора(ИмяКоллекции, НастройкиОтчета.ОтборПравДоступа);
				ПраваДоступаКоллекцииСУчетомОтборов.Вставить(ИмяКоллекции, ПраваДоступа);
				
			КонецЦикла;
			
			ИсточникГруппировки = Неопределено;
			
		Иначе
			
			ВызватьИсключение "Неизвестная группировка";
			
		КонецЕсли;
		
		ИсточникиГруппировок.Вставить(ИмяГруппировки, ИсточникГруппировки);
		
	КонецЦикла;
	
	НастройкиОтчета.Вставить("ИсточникиГруппировок", ИсточникиГруппировок);
	
	// Расчет количества обрабатываемых объектов
	ВсегоОбрабатываемыхОбъектов = 1;
	Для Каждого Группировка Из ГруппировкиВыполнения Цикл 
		
		ИмяГруппировки = Группировка.Значение;
		
		Если ИмяГруппировки = "ПравоДоступа" Тогда
			Продолжить;
		КонецЕсли;

		ИсточникГруппировки = НастройкиОтчета.ИсточникиГруппировок.Получить(ИмяГруппировки);
		Если ИмяГруппировки = "Метаданные"
				И ГруппировкиВыполнения.НайтиПоЗначению("ПравоДоступа") <> Неопределено Тогда
				
			ТаблицаЗначенийКоллекции = ИсточникГруппировки.Скопировать(, "Коллекция");
			ТаблицаЗначенийКоллекции.Колонки.Добавить("Количество", ИТК_ТипыКлиентСервер.ОписаниеЧисло(10));
			Для Каждого Строка Из ТаблицаЗначенийКоллекции Цикл 
				Строка.Количество = 1;
			КонецЦикла;
			ТаблицаЗначенийКоллекции.Свернуть("Коллекция", "Количество");
			
			ОбъектовВГруппировке = 0;
			Для Каждого Строка Из ТаблицаЗначенийКоллекции Цикл 
				
				ТаблицаЗначенийПраваДоступаПоКоллекции = НастройкиОтчета.ПраваДоступаКоллекцииСУчетомОтборов[Строка.Коллекция];
				ОбъектовВГруппировке = ОбъектовВГруппировке + Строка.Количество * ТаблицаЗначенийПраваДоступаПоКоллекции.Количество();

			КонецЦикла;
			
		Иначе 
			ОбъектовВГруппировке = ИсточникГруппировки.Количество();
		КонецЕсли;
		
		ВсегоОбрабатываемыхОбъектов = ВсегоОбрабатываемыхОбъектов * ОбъектовВГруппировке;
	
	КонецЦикла;
	НастройкиОтчета.Вставить("ВсегоОбрабатываемыхОбъектов", ВсегоОбрабатываемыхОбъектов);
	НастройкиОтчета.Вставить("ВсегоОбрабатываемыхОбъектовВТысячах", Цел(ВсегоОбрабатываемыхОбъектов/1000));
	
	// Прочее
	ДоступПоМетаданнымИПравамДоступа = НастройкиОтчета.ИспользуютсяМетаданные
											И НастройкиОтчета.ИспользуетсяПравоДоступа;
	НастройкиОтчета.Вставить("ДоступПоМетаданнымИПравамДоступа", ДоступПоМетаданнымИПравамДоступа);

КонецПроцедуры

Процедура ЗаполнениеТаблицуЗначенийПоГруппировке(Результат, НастройкиОтчета, ОписаниеПрава, Индекс = 0, НомерОбъекта = 0)
	
	Группировки = НастройкиОтчета.ГруппировкиВыполнения;
	ИмяГруппировки = Группировки[Индекс].Значение;
	РезультирующаяГруппировка = (Группировки.Количество() = Индекс + 1);
	
	ИсточникГруппировки = ИсточникГруппировки(НастройкиОтчета, ИмяГруппировки, ОписаниеПрава);
	Для Каждого ДанныеГруппировки Из ИсточникГруппировки Цикл 

		НомерОбъекта = НомерОбъекта + 1;
		Если ИмяГруппировки = "ПравоДоступа" Тогда
			
			ОписаниеПрава.Вставить("ПравоДоступаРасшифровка", ДанныеГруппировки.Имя);
			
		ИначеЕсли ИмяГруппировки = "Роль" Тогда
			
			ОписаниеПрава.Вставить("Роль", ДанныеГруппировки.Представление);
			ОписаниеПрава.Вставить("РольРасшифровка", ДанныеГруппировки.Метаданные);
			ОписаниеПрава.Вставить("ОбъектДоступа", ДанныеГруппировки.Метаданные);
			
		ИначеЕсли ИмяГруппировки = "ГруппаПользователей" Тогда
			
			ОписаниеПрава.Вставить("Группа", ДанныеГруппировки.Группа);
			
		ИначеЕсли ИмяГруппировки = "Пользователь" Тогда
			
			ПользовательИБ = ДанныеГруппировки.ПользовательИБ;
			
			ОписаниеПрава.Вставить("Пользователь", ДанныеГруппировки.ПолноеИмя);
			ОписаниеПрава.Вставить("ПользовательРасшифровка", ПользовательИБ);
			
			ВключенаАутентификация = ИТК_Пользователи.ВключенаАутентификация(ПользовательИБ);
			ОписаниеПрава.Вставить("ПользовательДоступный", ВключенаАутентификация);
			
			Если НЕ ОписаниеПрава.Свойство("ОбъектДоступа") Тогда
				ОписаниеПрава.Вставить("ОбъектДоступа", ПользовательИБ);
			КонецЕсли;
			
		ИначеЕсли ИмяГруппировки = "Метаданные" Тогда
			
			Коллекция = ДанныеГруппировки.Коллекция;
			ОписаниеПрава.Вставить("Коллекция", Коллекция);
			ОписаниеПрава.Вставить("КоллекцияПорядок", ИТК_МетаданныеКлиентСерверПовтИсп.ПорядокКоллекции(Коллекция));
			
			
			Если ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоСсылочныйОбъект(Коллекция) Тогда
				ПолеОграничения = ИТК_МетаданныеКлиентСерверПовтИсп.СтандартноеИмяПоляОбъекта("Ссылка");
			ИначеЕсли ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоРегистр(Коллекция) Тогда
				ПолеОграничения = "*";
			Иначе
				ПолеОграничения = Неопределено;
			КонецЕсли;
			ОписаниеПрава.Вставить("КоллекцияПолеОграничения", ПолеОграничения);
			
			ОписаниеПрава.Вставить("Метаданные", ДанныеГруппировки.Метаданные);
			ОписаниеПрава.Вставить("МетаданныеРасшифровка", ДанныеГруппировки.МетаданныеРасшифровка);
			
		КонецЕсли;
		
		// Сообщение прогресса
		Если НомерОбъекта % 10000 = 0 Тогда
			
			ВсегоОбрабатываемыхОбъектов = НастройкиОтчета.ВсегоОбрабатываемыхОбъектов;

			НомерЭтапа = 2;
			ДлительностьЭтапаВПроцентах = 90;

			ПрогрессВыполненияЭтапа = Цел(ДлительностьЭтапаВПроцентах * НомерОбъекта / ВсегоОбрабатываемыхОбъектов);
			ПрогрессВыполнения = Цел(5 + ПрогрессВыполненияЭтапа);
			
			ШаблонТекстЭтапа = НСтр("ru = 'Анализ прав объектов %1 из %2 тысяч';
									|en = 'Analysis of the rights of objects %1 from %2 thousand'");
			ТекстЭтапа = СтрШаблон(ШаблонТекстЭтапа, НомерОбъекта/1000, НастройкиОтчета.ВсегоОбрабатываемыхОбъектовВТысячах);
			ТекстЭтапаПроцесса = ИТК_Строки.ТекстЭтапаПроцесса(ТекстЭтапа, НомерЭтапа, НастройкиОтчета.КоличествоЭтапов);
			ИТК_ДлительныеОперации.СообщитьПрогресс(ТекстЭтапаПроцесса, ПрогрессВыполнения);

		КонецЕсли;
		
		Если РезультирующаяГруппировка Тогда
			ЗаполнениеТЗЗначениеДоступа(Результат, НастройкиОтчета, ОписаниеПрава);
		Иначе
			ЗаполнениеТаблицуЗначенийПоГруппировке(Результат, НастройкиОтчета, ОписаниеПрава, Индекс + 1, НомерОбъекта);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИсточникГруппировки(НастройкиОтчета, ИмяГруппировки, ОписаниеПрава)
	
	Если ИмяГруппировки = "ПравоДоступа" Тогда
		Результат = НастройкиОтчета.ПраваДоступаКоллекцииСУчетомОтборов[ОписаниеПрава.Коллекция];
	Иначе
		Результат = НастройкиОтчета.ИсточникиГруппировок.Получить(ИмяГруппировки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнениеТЗЗначениеДоступа(Результат, НастройкиОтчета, ОписаниеПрава)
	
	Если НастройкиОтчета.ДоступПоМетаданнымИПравамДоступа Тогда
		
		// Определение прав доступа 
		Коллекция = ОписаниеПрава.Коллекция;
		ОбъектМетаданных = ОписаниеПрава.МетаданныеРасшифровка; 
		ОбъектДоступа = ОписаниеПрава.ОбъектДоступа;
		ПравоДоступа = ОписаниеПрава.ПравоДоступаРасшифровка;
		
		ПоляОграничения = ОписаниеПрава.КоллекцияПолеОграничения;
		Если ЗначениеЗаполнено(ПоляОграничения) Тогда
			
			Если ПоляОграничения = "*" Тогда
				
				Если ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоРегистр(Коллекция) Тогда
					
					ИзмеренияРегистра = Новый Массив;
					Для Каждого ИзмерениеРегистра Из ОбъектМетаданных.Измерения Цикл 
						ИзмеренияРегистра.Добавить(ИзмерениеРегистра.Имя);
					КонецЦикла;
					
					ПоляОграничения = СтрСоединить(ИзмеренияРегистра, ",");
					
				КонецЕсли;
				
			КонецЕсли;
			
			ПараметрыДоступа = ПараметрыДоступа(ПравоДоступа, ОбъектМетаданных, ПоляОграничения, ОбъектДоступа);
			
			Если НЕ ПараметрыДоступа.Доступность Тогда
				ИмеетсяДоступ = Ложь;
			ИначеЕсли ПараметрыДоступа.ОграничениеУсловием Тогда
				ИмеетсяДоступ = Неопределено;
			Иначе
				ИмеетсяДоступ = Истина;
			КонецЕсли;
			
		Иначе
			ИмеетсяДоступ = ПравоДоступа(ПравоДоступа, ОбъектМетаданных, ОбъектДоступа);
		КонецЕсли;
		
	Иначе
		
		ПользовательИБ = ОписаниеПрава.ПользовательРасшифровка;
		ИмеетсяДоступ = ПользовательИБ.Роли.Содержит(ОписаниеПрава.РольРасшифровка);

	КонецЕсли;
	
	Если ИмеетсяДоступ = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Результат.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеПрава);
	Если ИмеетсяДоступ = Неопределено Тогда
		Доступ = ДоступОграничениеУсловием();
	Иначе
		Доступ = НСтр("ru = 'Да';
						|en = 'Yes'");
	КонецЕсли;
	НоваяСтрока.Доступ = Доступ;
	
	Если НастройкиОтчета.ИспользуетсяПравоДоступа Тогда
		
		ОписаниеПраваДоступа = ИТК_МетаданныеКлиентСервер.ОписаниеПраваДоступа(ПравоДоступа);
		
		НоваяСтрока.ПравоДоступа = ОписаниеПраваДоступа["Представление"];
		НоваяСтрока.ПравоДоступаПорядок = ОписаниеПраваДоступа["Порядок"];
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОбъектыТаблицыСУчетомОтбора(НастройкиОтчета)
	
	ОтборМетаданных = НастройкиОтчета.ОтборМетаданных;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Коллекция", ИТК_ТипыКлиентСервер.ОписаниеИмяМетаданных());
	Результат.Колонки.Добавить("Метаданные", ИТК_ТипыКлиентСервер.ОписаниеКоллекцияИИмяМетаданных());
	Результат.Колонки.Добавить("МетаданныеРасшифровка");
	
	ПраваДоступаКоллекцииСУчетомОтборов = Новый Структура;
	
	Если ЗначениеЗаполнено(ОтборМетаданных) Тогда
		
		ЭлементыОтбора = СтрРазделить(ОтборМетаданных, ",");
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл 
			
			ЭлементыОтбора = СтрРазделить(СокрЛП(ЭлементОтбора), ".");
			Если ЭлементыОтбора.Количество() = 1 Тогда
				
				ИмяКоллекции = ЭлементыОтбора[0];
				ОбъектыМетаданныхДобавитьКоллекцию(Результат, ИмяКоллекции);
				
			Иначе
				
				ИмяОбъектаКоллекции = ЭлементыОтбора[0];
				ИмяОбъекта = ЭлементыОтбора[1];
				
				ИмяКоллекции = ИТК_МетаданныеКлиентСерверПовтИсп.ИмяКоллекции(ИмяОбъектаКоллекции);
				ОбъектМетаданных = Метаданные[ИмяКоллекции][ИмяОбъекта];
				ОбъектыМетаданныхДобавитьОбъект(Результат, ИмяКоллекции, ОбъектМетаданных);
				
			КонецЕсли;
			
			ПраваДоступаКоллекцииСУчетомОтборов.Вставить(ИмяКоллекции,);

		КонецЦикла;
		
	Иначе
		
		ДоступныеКоллекции = ИТК_МетаданныеКлиентСерверПовтИсп.ДоступныеКоллекцииАнализПравДоступа();
		Для Каждого ИмяКоллекции Из ДоступныеКоллекции Цикл 
			
			ОбъектыМетаданныхДобавитьКоллекцию(Результат, ИмяКоллекции);
			ПраваДоступаКоллекцииСУчетомОтборов.Вставить(ИмяКоллекции);
			
		КонецЦикла;
		
	КонецЕсли;
	
	НастройкиОтчета.Вставить("ПраваДоступаКоллекцииСУчетомОтборов", ПраваДоступаКоллекцииСУчетомОтборов);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбъектыМетаданныхДобавитьКоллекцию(Результат, ИмяКоллекции)
	
	Для Каждого ОбъектМетаданных Из ИТК_Метаданные.ОбъектыКоллекцииБезИерархии(ИмяКоллекции) Цикл 
		
		ОбъектыМетаданныхДобавитьОбъект(Результат, ИмяКоллекции, ОбъектМетаданных)
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбъектыМетаданныхДобавитьОбъект(Результат, ИмяКоллекции, ОбъектМетаданных)
	
	НоваяСтрока = Результат.Добавить();
	НоваяСтрока.Коллекция = ИмяКоллекции;
	НоваяСтрока.Метаданные = ИТК_Метаданные.ПолноеИмя(ОбъектМетаданных);
	НоваяСтрока.МетаданныеРасшифровка = ОбъектМетаданных;
	
КонецПроцедуры

Функция РолиСУчетомОтбора(НастройкиОтчета)
	
	ОтборРолей = НастройкиОтчета.ОтборРолей;
	
	Если ЗначениеЗаполнено(ОтборРолей) Тогда
		
		Результат = Новый ТаблицаЗначений;
		Результат.Колонки.Добавить("Имя");
		Результат.Колонки.Добавить("Представление");
		Результат.Колонки.Добавить("Метаданные");

		Для Каждого ОписаниеРоли Из ОтборРолей Цикл 
			
			Роль = Метаданные.Роли[ОписаниеРоли.Значение];
			
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.Имя = Роль.Имя;
			НоваяСтрока.Представление = Роль.Представление();
			НоваяСтрока.Метаданные = Роль;

		КонецЦикла;
		
	Иначе
		
		Если ЗначениеЗаполнено(НастройкиОтчета.ОтборПользователей) Тогда // Когда установлен отбор по пользователяем нужно использовать их роли
		
			Результат = Новый ТаблицаЗначений;
			Результат.Колонки.Добавить("Имя");
			Результат.Колонки.Добавить("Представление");
			Результат.Колонки.Добавить("Метаданные");
			Для Каждого Пользователь Из НастройкиОтчета.ОтборПользователей Цикл 
				
				ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь.Значение);
				Для Каждого Роль Из ПользовательИБ.Роли Цикл 
					
					НоваяСтрока = Результат.Добавить();
					НоваяСтрока.Имя = Роль.Имя;
					НоваяСтрока.Представление = Роль.Представление();
					НоваяСтрока.Метаданные = Роль;

				КонецЦикла;
				
			КонецЦикла;
			
			Результат.Свернуть("Имя, Представление, Метаданные");
			
		Иначе
			
			Результат = ИТК_АнализПравДоступаПовтИсп.ВсеРоли();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПользователиСУчетомОтборов(НастройкиОтчета)
	
	ОтборПользователей = НастройкиОтчета.ОтборПользователей;
	ИсключитьНедоступных = НастройкиОтчета.ОтборПользователейИсключитьНедоступных;
	
	Если ЗначениеЗаполнено(ОтборПользователей) Тогда
		
		Результат = ПользователиТаблицаРезультата();
		
		Для Каждого Пользователь Из ОтборПользователей Цикл 
			
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь.Значение);
			ДобавитьПользователяВРезультат(Результат, ПользовательИБ, ИсключитьНедоступных);

		КонецЦикла;
		
	Иначе 
		
		Результат = ВсеПользователи(ИсключитьНедоступных);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ГруппаПользователейСУчетомОтбора(Отбор)
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Текст = ИТК_БСП.ТекстЗапросаГруппыПользователей();
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	ПостроительЗапроса.Выполнить();
	
	Возврат ПостроительЗапроса.Результат.Выгрузить();
	
КонецФункции

Процедура ДобавитьПользователяВРезультат(Результат, ПользовательИБ, ИсключитьНедоступных = Ложь)
	
	Аутентификация = ИТК_Пользователи.ВключенаАутентификация(ПользовательИБ);
	Если ИсключитьНедоступных
			И Аутентификация = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Результат.Добавить();
	НоваяСтрока.ПользовательИБ = ПользовательИБ;
	НоваяСтрока.ПолноеИмя = ПользовательИБ.ПолноеИмя;
	НоваяСтрока.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
	НоваяСтрока.Аутентификация = Аутентификация;
	
КонецПроцедуры

Функция ПользователиТаблицаРезультата()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ПользовательИБ");
	Результат.Колонки.Добавить("ПолноеИмя");
	Результат.Колонки.Добавить("УникальныйИдентификатор");
	Результат.Колонки.Добавить("Аутентификация", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	
	Возврат Результат;
	
КонецФункции

Функция ПраваДоступаСУчетомОтбора(ИмяКоллекции, ОтборПравДоступа)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Имя");
	Результат.Колонки.Добавить("Представление");
	Результат.Колонки.Добавить("Порядок");
	
	ПраваДоступа = ИТК_АнализПравДоступаПовтИсп.ВсеПраваДоступа(ИмяКоллекции);
	Для Каждого ПравоДоступа Из ПраваДоступа Цикл 
		
		ПравоДоступа = ПравоДоступа.Значение;
		Если ЗначениеЗаполнено(ОтборПравДоступа)
				И ОтборПравДоступа.НайтиПоЗначению(ПравоДоступа) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Имя = ПравоДоступа;

		ОписаниеПраваДоступа = ИТК_МетаданныеКлиентСервер.ОписаниеПраваДоступа(ПравоДоступа);
		
		НоваяСтрока.Представление = ОписаниеПраваДоступа["Представление"];
		НоваяСтрока.Порядок = ОписаниеПраваДоступа["Порядок"];
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьОтчетНаСКД(ТаблицаПрав, НастройкиОтчета)
	
	СхемаКомпоновкиДанных = СобратьСхемуКомпоновкиДанныхОтчета(ТаблицаПрав, НастройкиОтчета);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	ДанныеРасшифровки = Неопределено;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
							КомпоновщикНастроек.Настройки, , ,
							Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаПрав", ТаблицаПрав);
	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Результат = Новый Структура;
	Результат.Вставить("ДокументРезультат", ДокументРезультат);
	Результат.Вставить("ДанныеРасшифровки", ДанныеРасшифровки);
	Возврат Результат;
	
КонецФункции

Функция СобратьСхемуКомпоновкиДанныхОтчета(ТаблицаПрав, НастройкиОтчета)
	
	ГруппировкиСтрок = НастройкиОтчета.ГруппировкиСтрок;
	
	Результат = Новый СхемаКомпоновкиДанных;
	
	Источник = Результат.ИсточникиДанных.Добавить();
	Источник.Имя = "Основной";
	Источник.ТипИсточникаДанных = "local";
	
	НаборДанных = Результат.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.ИсточникДанных = Источник.Имя;
	НаборДанных.ИмяОбъекта = "ТаблицаПрав";
	НаборДанных.Имя = НаборДанных.ИмяОбъекта;
	
	ПоляНабораДанных = НаборДанных.Поля;
	
	Для Каждого КолонкаПрав Из ТаблицаПрав.Колонки Цикл 
		
		ИмяПоля = КолонкаПрав.Имя;
		
		Поле = ПоляНабораДанных.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		Поле.Заголовок = КолонкаПрав.Заголовок;
		Поле.Поле = ИмяПоля;
		Поле.ПутьКДанным = ИмяПоля;
		Поле.ТипЗначения = КолонкаПрав.ТипЗначения;
		
		ПолеУпорядочивания = ИмяПоля + "Порядок";
		КолонкаУпорядочивания = ТаблицаПрав.Колонки.Найти(ПолеУпорядочивания);
		Если КолонкаУпорядочивания <> Неопределено Тогда 
			
			ВыражениеУпорядочивания = Поле.ВыраженияУпорядочивания.Добавить();
			ВыражениеУпорядочивания.Выражение = ПолеУпорядочивания;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НовоеПолеРесурса = Результат.ПоляИтога.Добавить();
	НовоеПолеРесурса.Выражение = СтрШаблон("МАКСИМУМ(%1)", НастройкиОтчета.ПолеРесурса);
	НовоеПолеРесурса.ПутьКДанным = НастройкиОтчета.ПолеРесурса;
	
	ПоследняяГруппировкаСтрок = ГруппировкиСтрок[ГруппировкиСтрок.Количество() - 1].Значение;
	НовоеПолеРесурса.Группировки.Добавить(ПоследняяГруппировкаСтрок);
	
	// Добавление варианта и настроек
	Вариант = Результат.ВариантыНастроек[0];
	Вариант.Имя = "Основной";
	
	Настройки = Вариант.Настройки;
	
	Для Каждого КолонкаПрав Из ТаблицаПрав.Колонки Цикл 
		
		ВыбранноеПоле = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Заголовок = КолонкаПрав.Заголовок;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(КолонкаПрав.Имя);
		
	КонецЦикла;
	
	// Добавление структуры таблица с группировками строки и колонок
	ЭлементСтруктурыТаблица = Настройки.Структура.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	Родитель = ЭлементСтруктурыТаблица.Строки;
	Для Каждого ГруппировкаСтрок Из ГруппировкиСтрок Цикл 
		
		ИмяГруппировки = ГруппировкаСтрок.Значение;
		
		Если ИмяГруппировки = "Метаданные"
				И НастройкиОтчета.ГруппироватьМетаданныеПоКоллекциям Тогда
			
			НоваяГруппировка = ДобавитьГруппировкуВСхемуКомпоновкиДанныхОтчета(Родитель, "Коллекция");
			Родитель = НоваяГруппировка.Структура;
			
		КонецЕсли;
		
		НоваяГруппировка = ДобавитьГруппировкуВСхемуКомпоновкиДанныхОтчета(Родитель, ИмяГруппировки);
		Родитель = НоваяГруппировка.Структура;
		
	КонецЦикла;	
	
	ДобавитьГруппировкуВСхемуКомпоновкиДанныхОтчета(ЭлементСтруктурыТаблица.Колонки, НастройкиОтчета.ПолеКолонок);
	
	// Добавление оформления
	ДобавитьНастройкиОформленияСхемыКомпоновкиДанныхОтчета(Настройки, НастройкиОтчета);
	
	// Добавление сортировки
	Для Каждого Группировка Из НастройкиОтчета.Группировки Цикл 
		
		ИмяГруппировки = Группировка.Значение;
		Если ИмяГруппировки = "Метаданные" Тогда
			
			ДобавитьПолеСортировкиВСхемуКомпоновкиДанныхОтчета(Настройки, "Коллекция");
			ДобавитьПолеСортировкиВСхемуКомпоновкиДанныхОтчета(Настройки, "Метаданные");
			
		Иначе
			
			ДобавитьПолеСортировкиВСхемуКомпоновкиДанныхОтчета(Настройки, ИмяГруппировки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьГруппировкуВСхемуКомпоновкиДанныхОтчета(Родитель, ИмяГруппировки)
	
	НоваяГруппировка = Родитель.Добавить();
	НоваяГруппировка.Имя = ИмяГруппировки;
	
	ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяГруппировки);
	
	ВыбранноеПоле = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	Возврат НоваяГруппировка;
	
КонецФункции

Процедура ДобавитьПолеСортировкиВСхемуКомпоновкиДанныхОтчета(Настройки, ИмяПоля, НаправлениеСортировки = Неопределено)
	
	Если НаправлениеСортировки = Неопределено Тогда
		НаправлениеСортировки = НаправлениеСортировкиКомпоновкиДанных.Возр;
	КонецЕсли;
	
	ПолеСортировки = Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ПолеСортировки.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ПолеСортировки.ТипУпорядочивания = НаправлениеСортировки;
	
КонецПроцедуры

Процедура ДобавитьНастройкиОформленияСхемыКомпоновкиДанныхОтчета(НастройкиСКД, НастройкиОтчета)
	
	// Убираем итоги
	ПараметрыВывода = НастройкиСКД.ПараметрыВывода;
	
	ПараметрыВывода.УстановитьЗначениеПараметра("МакетОформления", "Античный");
	ПараметрыВывода.УстановитьЗначениеПараметра("ГоризонтальноеРасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
	ПараметрыВывода.УстановитьЗначениеПараметра("ВертикальноеРасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
	
	УсловноеОформление = НастройкиСКД.УсловноеОформление;
	
	// Убираем текст имя поля ресурса в заголовке
	НовыйЭлемент = УсловноеОформление.Элементы.Добавить();
	НовыйЭлемент.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	НовыйЭлемент.ИспользоватьВГруппировке = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
	НовыйЭлемент.ИспользоватьВЗаголовке = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
	
	НовоеПолеОформления = НовыйЭлемент.Поля.Элементы.Добавить();
	НовоеПолеОформления.Поле = Новый ПолеКомпоновкиДанных(НастройкиОтчета.ПолеРесурса);
	
	// Оформление поля колонки
	НовыйЭлемент = УсловноеОформление.Элементы.Добавить();
	
	НовыйЭлемент.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
	НовыйЭлемент.Оформление.УстановитьЗначениеПараметра("ВертикальноеПоложение", ВертикальноеПоложение.Низ);
	НовыйЭлемент.Оформление.УстановитьЗначениеПараметра("Размещение", ТипРазмещенияТекстаКомпоновкиДанных.Переносить);
	НовыйЭлемент.Оформление.УстановитьЗначениеПараметра("ОриентацияТекста", 90);
	НовыйЭлемент.Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 6);
	НовыйЭлемент.Оформление.УстановитьЗначениеПараметра("МаксимальнаяВысота", 150);
	
	НовыйЭлемент.ИспользоватьВГруппировке = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
	НовыйЭлемент.ИспользоватьВЗаголовке = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
	
	НовоеПолеОформления = НовыйЭлемент.Поля.Элементы.Добавить();
	НовоеПолеОформления.Поле = Новый ПолеКомпоновкиДанных(НастройкиОтчета.ПолеКолонок);
	
КонецПроцедуры

Процедура ОформлениеТабличногоДокументаОбъединенияЗаголовкаКолонки(ТабличныйДокумент)
	
	КоличествоГруппировок = ТабличныйДокумент.ФиксацияСверху;
	
	// Объединение областей заголовка колонок
	Для НомерКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы - ТабличныйДокумент.ФиксацияСлева Цикл 
		
		ИндексКолонки = ТабличныйДокумент.ФиксацияСлева + НомерКолонки;
		
		Область = ТабличныйДокумент.Область(1, ИндексКолонки, КоличествоГруппировок, ИндексКолонки);
		Область.Объединить();
		
	КонецЦикла;
	
	// После объединения сбивается высота, корректируем
	ВысотаГруппировки = Неопределено;
	Для НомерГруппировки = 1 По КоличествоГруппировок Цикл 
		
		Область = ТабличныйДокумент.Область(НомерГруппировки, 1, НомерГруппировки, 1);
		
		Если ВысотаГруппировки = Неопределено Тогда
			ВысотаГруппировки = Область.ВысотаСтроки / КоличествоГруппировок;
		КонецЕсли;
		
		Область.ВысотаСтроки = ВысотаГруппировки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьТабличныйДокументОтборов(НастройкиОтчета)
	
	// Подготовка используемых отборов
	Отборы = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(НастройкиОтчета.ОтборМетаданных) Тогда
		Отборы.Добавить(НастройкиОтчета.ОтборМетаданных, НСтр("ru = 'Метаданные'; en = 'Metadata'"));
	КонецЕсли;

	Если ЗначениеЗаполнено(НастройкиОтчета.ОтборРолей) Тогда
		Отборы.Добавить(НастройкиОтчета.ОтборРолей, НСтр("ru = 'Роли'; en = 'Roles'"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиОтчета.ОтборПользователей) Тогда
		Отборы.Добавить(НастройкиОтчета.ОтборПользователей, НСтр("ru = 'Пользователи'; en = 'Users'"));
	КонецЕсли;

	Если НастройкиОтчета.ИспользуетсяПользователь
			И НастройкиОтчета.ОтборПользователейИсключитьНедоступных Тогда
		Отборы.Добавить(НСтр("ru = 'Да'; en = 'Yes'"), НСтр("ru = 'Исключить отключенных пользователей'; en = 'Exclude disabled users'"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиОтчета.ОтборПравДоступа) Тогда
		Отборы.Добавить(НастройкиОтчета.ОтборПравДоступа, НСтр("ru = 'Права доступа'; en = 'Access rights'"));
	КонецЕсли;

	// Подготовка табличного документа
	Результат = Новый ТабличныйДокумент;
	Если НЕ ЗначениеЗаполнено(Отборы) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Макет = Отчеты.ИТК_АнализПравДоступа.ПолучитьМакет("Макет");
	
	Результат.НачатьАвтогруппировкуСтрок();
	
	ОбластьЗаголовокОтборов = Макет.ПолучитьОбласть("ЗаголовокОтборов");
	ОбластьЗаголовокОтборов.Параметры.Количество = Отборы.Количество();
	Результат.Вывести(ОбластьЗаголовокОтборов, 1, , Ложь);
	
	Для Каждого ЭлементОтбора Из Отборы Цикл 
		
		ОбластьСтрокаОтбор = Макет.ПолучитьОбласть("СтрокаОтбор");
		ОбластьСтрокаОтбор.Параметры.Поле = ЭлементОтбора.Представление;
		
		ЗначениеОтбора = ЭлементОтбора.Значение;
		ЗначениеОтбораМаксимумСимволов = 200;
		Если ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") Тогда
			ПредставлениеЗначенияОтбора = ИТК_ФормаКлиентСервер.ПредставлениеСписка(ЗначениеОтбора, ЗначениеОтбораМаксимумСимволов);
		Иначе
			ПредставлениеЗначенияОтбора = ИТК_Строки.Сократить(ЗначениеОтбора, ЗначениеОтбораМаксимумСимволов)
		КонецЕсли;
		ОбластьСтрокаОтбор.Параметры.ПредставлениеЗначения = ПредставлениеЗначенияОтбора;
		
		Результат.Вывести(ОбластьСтрокаОтбор, 2);
		
	КонецЦикла;
	
	Результат.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьТабличныйДокументПодвал()
	
	Результат = Новый ТабличныйДокумент;
	
	Макет = Отчеты.ИТК_АнализПравДоступа.ПолучитьМакет("Макет");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Результат.Вывести(ОбластьПодвал);
	
	Возврат Результат;
	
КонецФункции

Функция ДоступОграничениеУсловием()
	
	Возврат НСтр("ru = 'Да*';
				|en = 'Yes*'");
	
КонецФункции

Процедура ДополнитьТаблицуНеустановленнымиПравами(Результат, НастройкиОтчета)
	
	Если НЕ НастройкиОтчета.ОтображатьНеустановленныеПраваДоступа
			ИЛИ Результат.Колонки.Найти("Коллекция") = Неопределено
			ИЛИ Результат.Колонки.Найти("ПравоДоступа") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКоллекций = Результат.Скопировать( , "Коллекция");
	ТаблицаКоллекций.Свернуть("Коллекция");
	
	Для Каждого Строка Из ТаблицаКоллекций Цикл 
		
		ПерваяСтрокаКоллекции = Результат.Найти(Строка.Коллекция, "Коллекция");
		СтрокиПраваПоОбъектуКоллекции = Результат.НайтиСтроки(Новый Структура("Метаданные", ПерваяСтрокаКоллекции.Метаданные));
		
		ВсеПраваДоступаКоллекции = НастройкиОтчета.ПраваДоступаКоллекцииСУчетомОтборов[Строка.Коллекция];
		Для Каждого СтрокаПравоДоступаКоллекции Из ВсеПраваДоступаКоллекции Цикл 
			
			ПравоОтсутствует = Истина;
			Для Каждого СтрокаПраваПоОбъектуКоллекции Из СтрокиПраваПоОбъектуКоллекции Цикл 
				
				Если СтрокаПравоДоступаКоллекции.Имя = СтрокаПраваПоОбъектуКоллекции.ПравоДоступаРасшифровка Тогда
					
					ПравоОтсутствует = Ложь;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПравоОтсутствует Тогда
				
				НоваяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ПерваяСтрокаКоллекции);
				
				НоваяСтрока.ПравоДоступа = СтрокаПравоДоступаКоллекции.Представление;
				НоваяСтрока.ПравоДоступаПорядок = СтрокаПравоДоступаКоллекции.Порядок;
				НоваяСтрока.ПравоДоступаРасшифровка = СтрокаПравоДоступаКоллекции.Имя;
				
				НоваяСтрока.Доступ = Неопределено;

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
