
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусРегистрацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()

	ЭтоПринятоРешение   = Запись.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ПринятоРешение;
	ЭтоУстановленСтатус = Запись.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.УстановленСтатус;
	
	Элементы.Статус.Видимость = ЭтоУстановленСтатус;
	Элементы.Виза.Видимость   = ЭтоПринятоРешение;
	Элементы.Решение.Видимость= ЭтоПринятоРешение;
	
	Элементы.ДатаОтправки.Видимость 	= Запись.СтатусРегистрации = Перечисления.бит_фн_СтатусыРегистрацииОповещений.ОшибкаОтправки;
	Элементы.ПротоколОтправки.Видимость = Запись.СтатусРегистрации = Перечисления.бит_фн_СтатусыРегистрацииОповещений.ОшибкаОтправки;
	
КонецПроцедуры // УстановитьВидимость()
 
#КонецОбласти