#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли; 
	
	Заголовок = НСтр("en = 'Ошибка записи регистра сведений ""Настройки доступности элементов управления"":';
					 |ru = 'Ошибка записи регистра сведений ""Настройки доступности элементов управления"":'");

	Для Каждого Строка Из ЭтотОбъект Цикл
		 
		Если Не ЗначениеЗаполнено(Строка.Пользователь) Тогда
			ТекстСообщения = НСтр("en = 'Значение поля ""Пользователь"" не может быть пустым.';
								  |ru = 'Значение поля ""Пользователь"" не может быть пустым.'");
			Если ЗначениеЗаполнено(Заголовок) Тогда
				ОбщегоНазначения.СообщитьПользователю(Заголовок);
				Заголовок = "";
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ)
    	КонецЕсли;
		
		Если  Не ЗначениеЗаполнено(Строка.ИмяЭлементаУправления) Тогда
			ТекстСообщения 	= НСтр("en = 'Значение поля ""Имя элемента управления"" не может быть пустым.';
								   |ru = 'Значение поля ""Имя элемента управления"" не может быть пустым.'");
			Если ЗначениеЗаполнено(Заголовок) Тогда
				ОбщегоНазначения.СообщитьПользователю(Заголовок);
				Заголовок = "";
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ)
 		КонецЕсли;
			
	КонецЦикла; 
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли