
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_УправлениеДоступомБФ.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
			
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
		
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
		ОбработатьИзменениеНастройкиПротоколаНаСервере();
	КонецЕсли;
	
	УправлениеПодсказкойСписка(ЭтотОбъект, Ложь);
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбратьПериодЗавершение" И Источник = УникальныйИдентификатор Тогда	
		РедактированиеПериодаЗавершение(Параметр.Результат, Неопределено);
	ИначеЕсли ИмяСобытия = "ИзмененСтатус" И Источник = УникальныйИдентификатор Тогда
		ОбработкаОповещенияИзмененияСтатуса();
	ИначеЕсли ИмяСобытия = "ЗаписанНастройкиПротоколовРасхожденийБюджета" И Объект.Настройка = Параметр Тогда
		ОбработатьИзменениеНастройкиПротоколаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	НаименованиеТаблицы = НСтр("ru = 'Данные бюджета'; en = 'Budget Data'");
	бит_УправлениеДоступомБФ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект.ДанныеБюджета, НаименованиеТаблицы);
	
	ПодготовитьФормуНаСервере();
	ОбработатьИзменениеНастройкиПротоколаНаСервере();
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_ПротоколРасхожденийБюджета";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере();
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура окончание выбора комментария. 
//
// Параметры:
//  РезультатВыбора - Структура.
//  ДополнительныеПараметры - Структура.
//
&НаКлиенте 
Процедура НачалоВыбораКомментарийОкончание(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		
		ТекущаяСтрока 				= Элементы.ДанныеБюджета.ТекущиеДанные;
		ТекущаяСтрока.Комментарий 	= РезультатВыбора.Текст;
		Модифицированность = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры // НачалоВыбораКомментарийОкончание()

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ВопросОчисткиИзменениеНастройки", ЭтотОбъект); 
	Если Объект.ДанныеБюджета.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Табличная часть будет очищена. Продолжить?';
							  |en = 'Tabular section will be cleaned. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

// Процедура окончание процедуры "НастройкаПриИзменении". 
//
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура ВопросОчисткиИзменениеНастройки(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ДанныеБюджета.Очистить();
		ТекущаяНастройка = Объект.Настройка;
		ОбработатьИзменениеНастройкиПротоколаНаСервере();
	Иначе	
		Объект.Настройка = ТекущаяНастройка;
	КонецЕсли; 
                
КонецПроцедуры // ВопросОчисткиИзменениеНастройки()

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	УправлениеПодсказкойСписка(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	УправлениеПодсказкойСписка(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПланПриИзменении(Элемент)
	
	УправлениеПодсказкойСписка(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийФактПриИзменении(Элемент)
	
	УправлениеПодсказкойСписка(ЭтотОбъект, Истина);
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеБюджета

&НаКлиенте
Процедура ДанныеБюджетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеБюджетаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеБюджетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
 
	ТекущаяСтрока = Объект.ДанныеБюджета.НайтиПоИдентификатору(ВыбраннаяСтрока);

	Если ТекущаяСтрока <> Неопределено Тогда

		ИмяРеквизита = СтрЗаменить(Поле.Имя, "ДанныеБюджета", "");
		Если ИмяРеквизита = "СтатьяОборотовКодификатор" Тогда
			ИмяРеквизита = "СтатьяОборотов";	
		КонецЕсли;
		
		ТекЗнч = ТекущаяСтрока[ИмяРеквизита];
		Если ЗначениеЗаполнено(ТекЗнч) Тогда
			ПоказатьЗначение(,ТекЗнч);
		КонецЕсли; 

	КонецЕсли; 
 
КонецПроцедуры

&НаКлиенте
Процедура ДанныеБюджетаКомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.ДанныеБюджета.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Текст"			   , ТекущаяСтрока.Комментарий);
	ПараметрыФормы.Вставить("Заголовок"		   , "Комментарий");
	ПараметрыФормы.Вставить("ИмяТабличногоПоля", НСтр("ru='Данные бюджета';en='Budget data'"));
	ПараметрыФормы.Вставить("ИмяПоля"		   , "Комментарий");
										 
	Оповещение = Новый ОписаниеОповещения("НачалоВыбораКомментарийОкончание", ЭтотОбъект); 									 
	ОткрытьФорму("ОбщаяФорма.бит_ФормаРедактированияТекста", ПараметрыФормы, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ПодключаемыеКомандыЭлементовТаблицФормы

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДанныеБюджета.ТекущиеДанные;
	ИмяПоля  = СтрЗаменить(Элемент.Имя, "ДанныеБюджета", "");
	Если бит_МеханизмДопИзмеренийКлиент.ЭтоАналитикаБанковскийСчет(ИмяПоля, КэшЗначений.НастройкиИзмерений) Тогда
	  	бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(ТекущиеДанные, СтандартнаяОбработка, ИмяПоля);	
	Иначе	
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
			СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДанныеБюджета.ТекущиеДанные;
	ИмяПоля = СтрЗаменить(Элемент.Имя, "ДанныеБюджета", "");
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДанныеБюджета.ТекущиеДанные;
	ИмяПоля  = СтрЗаменить(Элемент.Имя, "ДанныеБюджета", "");
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры
	
#КонецОбласти 

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ЗначениеЗаполнено(Объект.Настройка) Тогда
		
		Отказ = НЕ ПериодЗаполненПравильно();
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 

		Оповещение = Новый ОписаниеОповещения("ВопросОчисткиДанныеБюджетаЗавершение", ЭтотОбъект); 
		Если Объект.ДанныеБюджета.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Табличная часть будет перезаполнена. Продолжить?';
								  |en = 'Table will be refilled. Continue?'");
			ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Иначе
			ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте 
Процедура ВопросОчисткиДанныеБюджетаЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьДанныеБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРедактироватьПериод(Команда)
	
	ПараметрыПередачи = Новый Структура(); 
	ПараметрыПередачи.Вставить("ДатаНачала", 	Объект.ДатаНачала);
	ПараметрыПередачи.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	ПараметрыПередачи.Вставить("Контекст", 		УникальныйИдентификатор);
	
	бит_ОбщегоНазначенияКлиент.ВыбратьПериод(ПараметрыПередачи);
	
КонецПроцедуры

// Процедура обработчик оповещения "РедактированиеПериодаЗавершение".
// 
// Параметры:
// Период - Произвольный
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура РедактированиеПериодаЗавершение(Период, ДополнительныеДанные)

	Если НЕ Период = Неопределено Тогда
		Объект.ДатаНачала    = Период.ДатаНачала;
		Объект.ДатаОкончания = Период.ДатаОкончания;
		УправлениеПодсказкойСписка(ЭтотОбъект, Истина);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура АнализПричинРасхожденийБюджета(Команда)
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("Отбор", ПараметрыАнализаПричинРасхожденийБюджета());
	ПараметрыФормы.Вставить("КлючВарианта", "АнализПричинРасхожденийБюджетаСОписанием");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("Расшифровка",		Истина);

	ОткрытьФорму("Отчет.бит_АнализПричинРасхожденийБюджета.Форма", ПараметрыФормы, 
		ЭтотОбъект, УникальныйИдентификатор); 
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнитьДанныеБюджета

&НаКлиенте
Процедура ЗаполнитьДанныеБюджета()
	
	ДлительнаяОперация    = НачатьЗаполнениеДанныхБюджетаНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьДанныеБюджетаЗавершение", ЭтотОбъект);
	ПараметрыОжидания     = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

// Обработчик завершения длительной операции ЗаполнитьДанныеБюджета.
//  См. Синтакс-помощник: Новый ОписаниеОповещения().
//
&НаКлиенте
Процедура ЗаполнитьДанныеБюджетаЗавершение(Результат, Дополнительно) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении, по причине: %1'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе	
		ЗаполнитьДанныеБюджетаЗавершениеНаСервере(Результат.АдресРезультата);
		УправлениеПодсказкойСписка(ЭтотОбъект, Ложь);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнениеДанныхБюджетаНаСервере()

	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Настройка",    Объект.Настройка);
	ДанныеОбъекта.Вставить("СценарийПлан", Объект.СценарийПлан);
	ДанныеОбъекта.Вставить("СценарийФакт", Объект.СценарийФакт);
	ДанныеОбъекта.Вставить("ДатаНачала",   Объект.ДатаНачала);
	ДанныеОбъекта.Вставить("ДатаОкончания",Объект.ДатаОкончания);
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ВыполняемыйМетод    = "Документы.бит_ПротоколРасхожденийБюджета.ЗаполнитьДанныеБюджета";
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, ДанныеОбъекта);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеБюджетаЗавершениеНаСервере(Знач АдресРезультата)

	ДанныеБюджета = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(ДанныеБюджета) = Тип("ТаблицаЗначений") Тогда
		Объект.ДанныеБюджета.Загрузить(ДанныеБюджета);
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти // ЗаполнитьДанныеБюджета

// Процедура заполняет необходимые параметры для работы формы.
// 
&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ТекущаяНастройка = Объект.Настройка;

	Если НЕ ФормаИнициализирована Тогда
		ИнициализироватьФорму();
	КонецЕсли;
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	КэшЗначений = Новый Структура;
	// Данные по дополнительным аналитикам.
	КэшЗначений.Вставить("НастройкиИзмерений", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	КэшЗначений.Вставить("ИзмеренияДоп"      , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним"));
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	бит_НастройкиДоступностиЭлементовФормКлиентСервер.РазблокироватьЭлементы(Форма);
		
	бит_НастройкиДоступностиЭлементовФормКлиентСервер.ЗаблокироватьЭлементы(Форма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеНастройкиПротоколаНаСервере()
		
	Настройка = Объект.Настройка;
	
	Если НЕ ЗначениеЗаполнено(Настройка) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Настройка, "Измерения, Ресурсы, ОтображатьКодификаторСтатьи");
	
	Выборка = РеквизитыНастройки.Измерения.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Найти(Выборка.Имя, "Аналитика") > 0
			И КэшЗначений.НастройкиИзмерений.Получить(Выборка.Имя) = Неопределено Тогда			
			Продолжить;
		КонецЕсли; 
		Элементы["ДанныеБюджета" + Выборка.Имя].Видимость = Выборка.Выполнять;
	КонецЦикла; 
	
	Выборка = РеквизитыНастройки.Ресурсы.Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы["ДанныеБюджета" + Выборка.Ресурс + "План"].Видимость 		   = Выборка.Выполнять;
		Элементы["ДанныеБюджета" + Выборка.Ресурс + "Факт"].Видимость 		   = Выборка.Выполнять;
		Элементы["ДанныеБюджета" + Выборка.Ресурс + "ОтклонениеОтн"].Видимость = Выборка.Выполнять;
		Элементы["ДанныеБюджета" + Выборка.Ресурс + "ОтклонениеАбс"].Видимость = Выборка.Выполнять;
		Элементы["ДанныеБюджетаНадпись" + Выборка.Ресурс].Видимость 		   = Выборка.Выполнять;
	КонецЦикла;
	
	Элементы.ДанныеБюджетаСтатьяОборотовКодификатор.Видимость = РеквизитыНастройки.ОтображатьКодификаторСтатьи;
	УправлениеПодсказкойСписка(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()

	ЗаполнитьКэшЗначений();
		
	// Элементы управления для измерений несуществующих в смежном решении	
	// создаются программно для унификации кода.
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправленияПротоколРасхожденийБюджета(Элементы);
	
	// Отображение дополнительных измерений в табличных полях.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
		"ДанныеБюджета", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	
	УстановитьУсловноеОформление();

	ФормаИнициализирована = Истина;
	
КонецПроцедуры

&НаКлиенте 
Функция ПериодЗаполненПравильно()

	ЗаполненПравильно = Истина;
	
	Отказ  = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Дата начала'; en = 'Start date'")); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.ДатаНачала",, Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Дата окончания'; en = 'End date'")); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.ДатаОкончания",, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Если Объект.ДатаОкончания < Объект.ДатаНачала Тогда
			ТекстСообщения = НСтр("ru = 'Период указан неверно. Дата начала больше даты окончания.';
								  |en = 'The period is incorrect. The start date is greater than the end date.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.ДатаОкончания",, Отказ);
		КонецЕсли;
	КонецЕсли; 
	
	Если Отказ Тогда
		ЗаполненПравильно = Ложь;
	КонецЕсли;  
	
	Возврат ЗаполненПравильно; 

КонецФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДанныеБюджетаНадписьКоличество");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ДанныеБюджета.НомерСтроки", ВидСравненияКомпоновкиДанных.Заполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Количество';en='Quantity'"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДанныеБюджетаНадписьСуммаРегл");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ДанныеБюджета.НомерСтроки", ВидСравненияКомпоновкиДанных.Заполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Сумма регл.';en='Total'"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДанныеБюджетаНадписьСуммаУпр");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ДанныеБюджета.НомерСтроки", ВидСравненияКомпоновкиДанных.Заполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Сумма упр.';en='Amount man.'"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДанныеБюджетаНадписьСуммаСценарий");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ДанныеБюджета.НомерСтроки", ВидСравненияКомпоновкиДанных.Заполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Сумма сценарий';en='Scenario Amount'"));
	
КонецПроцедуры

&НаСервере
Функция ПараметрыАнализаПричинРасхожденийБюджета()

	Период = Новый СтандартныйПериод(Объект.ДатаНачала, КонецДня(Объект.ДатаОкончания));
	
	Отборы = Новый Структура; 
	Отборы.Вставить("СценарийПлан", Объект.СценарийПлан);
	Отборы.Вставить("СценарийФакт", Объект.СценарийФакт);
	Отборы.Вставить("Период",		Период);
	Отборы.Вставить("ПоБюджету",	Ложь);
	Отборы.Вставить("Бюджет",	 	Неопределено);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Отборы.Вставить("Регистратор", 	Объект.Ссылка);
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Настройка) Тогда
		
		РеквизитыНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Настройка, 
			"Бюджет, Периодичность, Ресурсы");
		
		Если ЗначениеЗаполнено(РеквизитыНастройки.Бюджет) Тогда
			Отборы.Вставить("ПоБюджету", Истина);	
			Отборы.Вставить("Бюджет",	 РеквизитыНастройки.Бюджет);
		КонецЕсли;
		
		Периодичность = Новый Соответствие;
		Периодичность.Вставить(6, Перечисления.бит_ПериодичностьПланирования.День);
		Периодичность.Вставить(7, Перечисления.бит_ПериодичностьПланирования.Неделя);
		Периодичность.Вставить(8, Перечисления.бит_ПериодичностьПланирования.Декада);
		Периодичность.Вставить(9, Перечисления.бит_ПериодичностьПланирования.Месяц);
		Периодичность.Вставить(10, Перечисления.бит_ПериодичностьПланирования.Квартал);
		Периодичность.Вставить(11, Перечисления.бит_ПериодичностьПланирования.Полугодие);
		Периодичность.Вставить(12, Перечисления.бит_ПериодичностьПланирования.Год);

		РезультатПоиска = Периодичность.Получить(РеквизитыНастройки.Периодичность);
		
		Если ЗначениеЗаполнено(РезультатПоиска) Тогда
			Отборы.Вставить("Периодичность", РезультатПоиска);
		КонецЕсли;
		
		РесурсыНастройки = РеквизитыНастройки.Ресурсы.Выгрузить();
		
		Показатели = Новый Структура; 
		Показатели.Вставить("СуммаУпр", 1);
		Показатели.Вставить("СуммаРегл", 2);
		Показатели.Вставить("СуммаСценарий", 3);
		
		ПоказательНастроен = Ложь;
		Для каждого СтрокаТаблицы Из РесурсыНастройки Цикл
			Если НЕ СтрокаТаблицы.Выполнять Тогда
				Продолжить;			
			КонецЕсли;
			
			КодПоказателя = 0;
			Если НЕ ПоказательНастроен И Показатели.Свойство(СтрокаТаблицы.Ресурс, КодПоказателя) Тогда
				Отборы.Вставить("Показатели", КодПоказателя);
				ПоказательНастроен = Истина;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
	Возврат Отборы;
	
КонецФункции

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеПодсказкойСписка(Форма, Показать)
	
	Если Показать Тогда
		ТекстПодсказки = НСтр("ru = 'Изменены настройки заполнения. Нажмите ""Заполнить"", чтобы обновить список.'; 
							|en = 'The filling settings have been changed. Click ""Fill in"" to update the list.'");
	Иначе	
		ТекстПодсказки = "";
	КонецЕсли;
	
	Форма.Элементы.ДанныеБюджета.РасширеннаяПодсказка.Заголовок = ТекстПодсказки;
	
КонецПроцедуры

#КонецОбласти

