#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Вариант = Параметры.Вариант;
	ТипЗначения = Параметры.ТипЗначения;
	
	// Заполнение списка
	ВыборНесколькихЗначений = (Вариант = ИТК_Перечисления.ВариантФормыСписокЗначенийВыборНесколькихЗначений())
								ИЛИ (Вариант = ИТК_Перечисления.ВариантФормыСписокЗначенийВыборНесколькихЗначениеСПредставлением());
	Для Каждого ЭлементСписка Из Параметры.Значение Цикл
		
		НоваяСтрока = Список.Добавить();
		НоваяСтрока.Значение = ЭлементСписка.Значение;
		НоваяСтрока.Представление = ЭлементСписка.Представление;
		
		Пометка = ЭлементСписка.Пометка;
		Если НЕ ВыборНесколькихЗначений Тогда
			Пометка = Истина;
		КонецЕсли;
		НоваяСтрока.Пометка = Пометка;
		
	КонецЦикла;
	
	ОбновитьЭлементыФормыПриСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранныеЗначения, ИсточникВыбора)
	
	ДобавитьУникальныеЗначенияВСписок(ВыбранныеЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_ФормаКлиент.АктивизацияЗначенияВФорме(Элементы.СписокЗначение, ТекущиеДанные.Значение, ТипЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ИТК_ФормаКлиент.АктивизацияЗначенияВФорме(Элементы.Список.ТекущийЭлемент, Элементы.Список.ТекущиеДанные.Значение, ТипЗначения);
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПодключаемыйНачатьИзменениеСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОчисткаЗначенияСтрокиВФорме(Элемент);
	ИТК_ФормаКлиент.АктивизацияЗначенияВФорме(Элемент, Неопределено, ТипЗначения);

КонецПроцедуры

&НаКлиенте
Процедура СписокЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОбработкаВыбораЗначенияВФорме(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ЗначениеПараметра = ТекущиеДанные.Значение;
	
	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВводЗначенияПараметраЗавершен", ЭтотОбъект, ДополнительныеПараметры);
	ИТК_ФормаКлиент.ВводЗначенияСтрокиВФорме(НСтр("ru = 'Элемент списка';
													|en = 'List item'"), Элемент, ЗначениеПараметра, ТипЗначения,
													СтандартнаяОбработка, ОписаниеОповещенияЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.АвтоПодборЗначенияВФорме(Текст, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПометкаПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)

	ВыборНесколькихЗначений = (Вариант = ИТК_Перечисления.ВариантФормыСписокЗначенийВыборНесколькихЗначений())
								ИЛИ (Вариант = ИТК_Перечисления.ВариантФормыСписокЗначенийВыборНесколькихЗначениеСПредставлением());
	КоличествоОтмеченных = ИТК_ФормаКлиент.КоличествоПомеченныхВКоллекции(Список);

	Если ВыборНесколькихЗначений
			И КоличествоОтмеченных = 0 Тогда
			
		ПоказатьПредупреждение( , НСтр("ru = 'Необходимо выбрать элементы';
										|en = 'Items must be selected'"));
		Возврат;	
			
	КонецЕсли;
	
	Если ВыборНесколькихЗначений
			И КоличествоОтмеченных = Список.Количество() Тогда
		
		Результат = Новый СписокЗначений;
		
	Иначе
		
		Результат = Новый СписокЗначений;
		
		Для Каждого Строка Из Список Цикл
			
			Если ВыборНесколькихЗначений
					И НЕ Строка.Пометка Тогда 
				Продолжить;
			КонецЕсли;
			
			Результат.Добавить(Строка.Значение, Строка.Представление);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Если ТипЗначения.СодержитТип(Тип("Тип")) Тогда
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПодбораТипаБезОбработки", ЭтотОбъект, Новый Структура);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ЗакрыватьПриВыборе", Ложь);
		
		ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(ЭтотОбъект, НСтр("ru = 'подбор';
																			|en = 'selection'"), 
													ИТК_Перечисления.РежимРедактированияТипаЗначенияРедактированиеТипа(),
													Неопределено, ОписаниеОповещенияОЗавершении, , ДополнительныеПараметры);
		
	Иначе 
		
		КоличествоСсылочныхТипов = ИТК_ТипыКлиентСервер.КоличествоСсылочных(ТипЗначения);
		
		Если КоличествоСсылочныхТипов = 1 Тогда // один тип, сразу открываем форму подбора
			
			ИТК_ФормаКлиент.ОткрытьФормуВыбора(ИТК_ТипыКлиентСервер.ПервыйСсылочныйОписание(ТипЗначения), ЭтотОбъект, Ложь);
			
		Иначе // несколько типов нужно выбрать
			
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеВыбораТипаДляПодбора", ЭтотОбъект, Новый Структура);
			
			СсылочныеТипы = ИТК_ТипыКлиентСервер.СсылочныеТипы(ТипЗначения);
			ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(ЭтотОбъект, "Заголовок", ИТК_Перечисления.РежимРедактированияТипаЗначенияВыборТипа(),
															СсылочныеТипы, ОписаниеОповещенияОЗавершении);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзБуфераОбмена(Команда)

	КоличествоСсылочныхТипов = ИТК_ТипыКлиентСервер.КоличествоСсылочных(ТипЗначения);
	
	Если КоличествоСсылочныхТипов = 1 Тогда
		
		ОткрытьФормуВставкиИзБуфера(ИТК_ТипыКлиентСервер.ПервыйСсылочныйОписание(ТипЗначения));
		
	Иначе // несколько типов нужно выбрать
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеВыбораТипаДляВставкиИзБуфера", ЭтотОбъект, Новый Структура);
		СсылочныеТипы = ИТК_ТипыКлиентСервер.СсылочныеТипы(ТипЗначения);
		
		ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(ЭтотОбъект, "Заголовок", ИТК_Перечисления.РежимРедактированияТипаЗначенияВыборТипа(),
															СсылочныеТипы, ОписаниеОповещенияОЗавершении);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	УстановитьВсеПометки();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	УстановитьВсеПометки(Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыФормыПриСозданииНаСервере()
	
	Редактирование = (Вариант = ИТК_Перечисления.ВариантФормыСписокЗначенийРедактирование());
	РедактированиеСПредставлением = (Вариант = ИТК_Перечисления.ВариантФормыСписокЗначенийРедактированиеСПредставлением())
										ИЛИ (Вариант = ИТК_Перечисления.ВариантФормыСписокЗначенийВыборНесколькихЗначениеСПредставлением());
	ВыборНесколькихЗначений = (Вариант = ИТК_Перечисления.ВариантФормыСписокЗначенийВыборНесколькихЗначений())
								ИЛИ (Вариант = ИТК_Перечисления.ВариантФормыСписокЗначенийВыборНесколькихЗначениеСПредставлением());
	СписокРедактируется = Редактирование ИЛИ РедактированиеСПредставлением;
	
	КоличествоСсылочныхТипов = ИТК_ТипыКлиентСервер.КоличествоСсылочных(ТипЗначения);
	СодержитТипТип = ТипЗначения.СодержитТип(Тип("Тип"));
	
	// Список
	Элементы.Список.Шапка = РедактированиеСПредставлением;
	Элементы.Список.ИзменятьСоставСтрок = СписокРедактируется;
	Элементы.Список.ИзменятьПорядокСтрок = СписокРедактируется;
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.Список, ПоложениеСтрокиПоиска.КоманднаяПанель);
	Элементы.СписокПереместить.Видимость = СписокРедактируется;
	Элементы.СписокГруппаУправлениеПометками.Видимость = ВыборНесколькихЗначений;
	Элементы.Подбор.Видимость = ЗначениеЗаполнено(КоличествоСсылочныхТипов) ИЛИ СодержитТипТип;
	Элементы.СписокВставитьИзБуфераОбмена.Видимость = Редактирование И ИТК_БСПКлиентСервер.ИспользуетсяБСП() И НЕ СодержитТипТип;
	
	Элементы.СписокПометка.Видимость = ВыборНесколькихЗначений;
	
	Элементы.СписокЗначение.Видимость = СписокРедактируется;
	Элементы.СписокПредставление.Видимость = РедактированиеСПредставлением ИЛИ ВыборНесколькихЗначений;
	Элементы.СписокПредставление.ТолькоПросмотр = ВыборНесколькихЗначений;
	
	// Заполнение заголовка
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
	Иначе
		
		
		Шаблон = НСтр("ru = 'Редактирование списка значений: %1';
						|en = 'Editing the list of %1 values'");
		ДополнениеЗаголовка = Параметры.ДополнениеЗаголовка;
		
		Заголовок = СтрШаблон(Шаблон, ДополнениеЗаголовка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()

	ВыборНесколькихЗначений = (Вариант = ИТК_Перечисления.ВариантФормыСписокЗначенийВыборНесколькихЗначений())
								ИЛИ (Вариант = ИТК_Перечисления.ВариантФормыСписокЗначенийВыборНесколькихЗначениеСПредставлением());
	
	Если ВыборНесколькихЗначений Тогда
		
		ЗаголовокКнопки = НСтр("ru = 'Выбрать';
								|en = 'Select'");
		КоличествоВыбранных = ИТК_ФормаКлиент.КоличествоПомеченныхВКоллекции(Список);
		
	Иначе
		
		ЗаголовокКнопки = НСтр("ru = 'Сохранить и закрыть';
								|en = 'Save and close'");
		КоличествоВыбранных = Список.Количество();
		
	КонецЕсли;
	Элементы.СохранитьИЗакрыть.Заголовок = ИТК_ФормаКлиентСервер.ЗаголовокСКоличеством(ЗаголовокКнопки, КоличествоВыбранных);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТипаДляПодбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_ФормаКлиент.ОткрытьФормуВыбора(Результат, ЭтотОбъект, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПодбораТипаБезОбработки(Результат, ДополнительныеПараметры) Экспорт
	
	НичегоНеДелаем = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВводЗначенияПараметраЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ИТК_ФормаКлиент.ОбработкаЗавершенВводЗначенияВФорме(Элементы.СписокЗначение, Результат, ДополнительныеПараметры,
																ТекущиеДанные.Значение, ТипЗначения, Модифицированность); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйНачатьИзменениеСтроки() Экспорт
	
	Элементы.Список.ИзменитьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеПометки(Пометка = Истина)
	
	Для Каждого Строка Из Список Цикл 
		Строка.Пометка = Пометка;
	КонецЦикла;
		
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзБуфераОбменаЗавершение(НайденныеОбъекты, ДополнительныеПараметры) Экспорт
	
	Если НайденныеОбъекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьУникальныеЗначенияВСписок(НайденныеОбъекты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВставкиИзБуфера(ТипЗначения)

	ПараметрыПроцедуры = Новый Массив;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ОписаниеТипов", ТипЗначения);
	ПараметрыПоиска.Вставить("ПредставлениеПоля", ДополнениеЗаголовка);
	ПараметрыПоиска.Вставить("Сценарий", "ПоискСсылок"); // !!! Не переведено использование для англ. БСП
	ПараметрыПроцедуры.Добавить(ПараметрыПоиска);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ВставитьИзБуфераОбменаЗавершение", ЭтотОбъект);
	ПараметрыПроцедуры.Добавить(ОбработчикОповещения);
	
	ИТК_БСПКлиентСервер.ВыполнитьПроцедуру("ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗаполненияСсылок", ПараметрыПроцедуры);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТипаДляВставкиИзБуфера(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуВставкиИзБуфера(Результат);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУникальныеЗначенияВСписок(ВыбранныеЗначения)
	
	ДобавленныеЗначения = Новый Массив;
	Для Каждого ВыбранноеЗначение Из ВыбранныеЗначения Цикл 
		
		НайденныеСтроки = Список.НайтиСтроки(Новый Структура("Значение", ВыбранноеЗначение));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = Список.Добавить();
		НоваяСтрока.Значение = ВыбранноеЗначение;
		
		ДобавленныеЗначения.Добавить(ВыбранноеЗначение);
		
	КонецЦикла;
	
	ИТК_ФормаКлиент.ВыводОповещенийПодбора(ДобавленныеЗначения);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры	

#КонецОбласти
