#Область ПрограммныйИнтерфейс

Функция ЗначенияСвойств(Параметры, АдресРезультата = Неопределено) Экспорт
	
	ПолноеИмя = Параметры.ПолноеИмя;
	ТолькоВажные = Параметры.ТолькоВажные;
	СортироватьПоАлфавиту = Параметры.СортироватьПоАлфавиту;
	БазовыеСвойства = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "БазовыеСвойства", Истина);
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	Если ОбъектМетаданных = Неопределено Тогда
		
		ШаблонОшибки = НСтр("ru = 'Не найден объект с именем: %1,
                            |возможно удален или переименован';
							|en = 'No object found with name: %1,
                            |possibly removed or renamed'");
		
		ВызватьИсключение СтрШаблон(ШаблонОшибки, ПолноеИмя);
		
	КонецЕсли;
	
	ВыгруженныеФайлыКонфигурации = ИТК_ФайлыКонфигурации.ПутьКФайлам();
	ОтображатьМодули = ЗначениеЗаполнено(ВыгруженныеФайлыКонфигурации);

	ИмяКоллекции = ИТК_Метаданные.ИмяКоллекции(ПолноеИмя);
	ТаблицаСвойств = ИТК_МетаданныеПовтИсп.СвойстваПоКоллекции(ИмяКоллекции);
	
	// Обрабатываем настройки вывода
	Если СортироватьПоАлфавиту Тогда
		ТаблицаСвойств.Сортировать("Представление");
	Иначе
		ТаблицаСвойств.Сортировать("ГруппаПорядок, Порядок");
	КонецЕсли;
	
	Результат = Новый ДеревоЗначений;
	Результат.Колонки.Добавить("Представление", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Результат.Колонки.Добавить("Значение");
	Результат.Колонки.Добавить("ПредставлениеЗначения");
	Результат.Колонки.Добавить("Картинка", ИТК_ТипыКлиентСервер.ОписаниеКартинка());
	Результат.Колонки.Добавить("ЭтоГруппа", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	
	Результат.Колонки.Добавить("ДанныеГиперссылки");
	Результат.Колонки.Добавить("ПредставлениеГиперссылки", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	
	Для Каждого СтрокаСвойства Из ТаблицаСвойств Цикл 

		Если (ТолькоВажные И НЕ СтрокаСвойства.Важное)
				ИЛИ (НЕ БазовыеСвойства И СтрокаСвойства.Базовое) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеПоляОбъектаМетаданных = ОбъектМетаданных[СтрокаСвойства.Имя];
		
		ДанныеГиперссылки = СтрокаСвойства.ДанныеГиперссылки;
		
		Если ЗначениеЗаполнено(ДанныеГиперссылки)
				И ДанныеГиперссылки.Свойство("Модуль") Тогда
				
			Если НЕ ОтображатьМодули Тогда
				Продолжить;
			КонецЕсли;
			
			ПолноеИмяМодуля = ИТК_ИнструментМетаданныеКлиентСервер.ИмяМодуляИзДанныхГиперссылки(ДанныеГиперссылки.Модуль, ПолноеИмя, ЗначениеПоляОбъектаМетаданных);
			ОписаниеМодуля = ИТК_ФайлыКонфигурацииКлиентСервер.ОписаниеМодуляПерейтиКОпределению(ПолноеИмяМодуля);
				
			Если НЕ ИТК_ФайлыКонфигурации.ИспользуетсяМодуль(ВыгруженныеФайлыКонфигурации, ОписаниеМодуля) Тогда
				Продолжить;
			КонецЕсли;

		КонецЕсли;
		
		Родитель = Результат;
		
		Группа = СтрокаСвойства.Группа;
		Если ЗначениеЗаполнено(Группа)
				И НЕ СортироватьПоАлфавиту Тогда
			
			Родитель = Результат.Строки.Найти(Группа, "Представление");
			Если Родитель = Неопределено Тогда
				
				Родитель = Результат.Строки.Добавить();
				Родитель.Представление = Группа;
				Родитель.ЭтоГруппа = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока = Родитель.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСвойства);
		
		НоваяСтрока.ДанныеГиперссылки = ДанныеГиперссылки;
		
		Если ЗначениеЗаполнено(ДанныеГиперссылки) Тогда
			
			Если ДанныеГиперссылки.Свойство("Модуль") Тогда
				
				Если ДанныеГиперссылки.Модуль = Неопределено Тогда
					ПредставлениеГиперссылки = ЗначениеПоляОбъектаМетаданных;
				Иначе
					ПредставлениеГиперссылки = НСтр("ru = 'Перейти'; en = 'Go to'");
				КонецЕсли;
				
			ИначеЕсли ДанныеГиперссылки.Свойство("ОбъектМетаданных")
						И ЗначениеПоляОбъектаМетаданных <> Неопределено Тогда
				
				ПредставлениеГиперссылки = ЗначениеПоляОбъектаМетаданных.ПолноеИмя();
				
			ИначеЕсли ДанныеГиперссылки.Свойство("ОписаниеТипов") Тогда
				
				Если ИТК_ТипыКлиентСервер.ЕстьСсылочныеТипы(ЗначениеПоляОбъектаМетаданных) Тогда
					ПредставлениеГиперссылки = ИТК_Типы.ПредставлениеОписания(ЗначениеПоляОбъектаМетаданных);
				Иначе
					ПредставлениеГиперссылки = Неопределено;
				КонецЕсли;
				
			Иначе				
				ПредставлениеГиперссылки = Неопределено;	
			КонецЕсли;
			
			НоваяСтрока.ПредставлениеГиперссылки = ПредставлениеГиперссылки;
			
		КонецЕсли;
		
		ЗначениеСвойства = ЗначениеСвойства(ЗначениеПоляОбъектаМетаданных, СтрокаСвойства.ПреобразоватьВСтроку);
		НоваяСтрока.Значение = ЗначениеСвойства;
		НоваяСтрока.ПредставлениеЗначения = ПредставлениеЗначенияСвойства(СтрокаСвойства.Имя, ЗначениеСвойства);
		
	КонецЦикла;
	
	Возврат ИТК_ДлительныеОперации.Результат(Результат, АдресРезультата);
	
КонецФункции

Функция ПоискПоПодобию(Параметры, АдресРезультата = Неопределено) Экспорт
	
	СтрокаПоиска = Параметры.СтрокаПоиска;
	ПараметрыПоиска = ИТК_Строки.ПараметрыПоискаПоПодобию(СтрокаПоиска);
	
	Результат = Новый Массив;
	
	ОписаниеКоллекций = ПоискПоПодобию_ВыбранныеКоллекцииМетаданных(ПараметрыПоиска);
	
	// Расчет количества обрабатываемых
	КоличествоОбрабатываемых = 0;
	Для Каждого ОписаниеКоллекции Из ОписаниеКоллекций Цикл 
		КоличествоОбрабатываемых = КоличествоОбрабатываемых + ОписаниеКоллекции["Объекты"].Количество();
	КонецЦикла;
	
	// Поиск
	КоличествоНайденных = 0; Обрабатывается = 0;
	Для Каждого ОписаниеКоллекции Из ОписаниеКоллекций Цикл 

		ОбъектыКоллекции = ОписаниеКоллекции["Объекты"];
		Для Каждого ОбъектМетаданных Из ОбъектыКоллекции Цикл 
			
			Обрабатывается = Обрабатывается + 1;
			
			// Сообщение прогресса
			Если Обрабатывается % 1000 = 0 Тогда
				
				Прогресс = Цел((Обрабатывается * 100) / КоличествоОбрабатываемых);
				ИТК_ДлительныеОперации.СообщитьПрогресс(Неопределено, Прогресс, Результат);
				
			КонецЕсли;
			
			ИмяИСиноним = НРег(ОбъектМетаданных.Имя + " " + ОбъектМетаданных.Синоним);
			Если НЕ СтрНайти(ИмяИСиноним, ПараметрыПоиска.Слово) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ИТК_Строки.ПоискПоПодобиюНайденыДополнительныеСлова(ИмяИСиноним, ПараметрыПоиска) Тогда
				Продолжить;
			КонецЕсли;
			
			// Обработка найденных
			КоличествоНайденных = КоличествоНайденных + 1;
			Если КоличествоНайденных > 50 Тогда
				Возврат ИТК_ДлительныеОперации.Результат(Результат, АдресРезультата);
			КонецЕсли;

			ОписаниеНайденногоОбъекта = Новый Структура;
			ОписаниеНайденногоОбъекта.Вставить("Имя", ОбъектМетаданных.Имя);
			ОписаниеНайденногоОбъекта.Вставить("Синоним", ОбъектМетаданных.Синоним);
			ОписаниеНайденногоОбъекта.Вставить("ПолноеИмя", ОбъектМетаданных.ПолноеИмя());
			ОписаниеНайденногоОбъекта.Вставить("Картинка", ОписаниеКоллекции.Картинка);
			
			Результат.Добавить(ОписаниеНайденногоОбъекта);

		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ИТК_ДлительныеОперации.Результат(Результат, АдресРезультата);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеСвойства(Значение, ПреобразоватьВСтроку = Ложь)
	
	Если ТипЗнч(Значение) = Тип("КоллекцияЗначенийСвойстваОбъектаМетаданных") Тогда
		
		Результат = Новый СписокЗначений;
		Для Каждого ОбъектМетаданных Из Значение Цикл 
			
			Результат.Добавить(ОбъектМетаданных.ПолноеИмя());
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Значение) = Тип("ОбъектМетаданных") Тогда
		
		Результат = Значение.ПолноеИмя();
	
	ИначеЕсли ТипЗнч(Значение) = Тип("ОписаниеТипов") Тогда
		
		Если ИТК_ТипыКлиентСервер.ЕстьСсылочныеТипы(Значение) Тогда
			
			Результат = Новый СписокЗначений;
			Для Каждого Тип Из Значение.Типы() Цикл
				Результат.Добавить(ИТК_XML.ИмяТипа(Тип));
			КонецЦикла;
			
		Иначе 
			Результат = Значение;
		КонецЕсли;
		
	Иначе
		
		Результат = Значение;
		
	КонецЕсли;
	
	Если ПреобразоватьВСтроку Тогда
		Результат = Строка(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеЗначенияСвойства(Имя, Значение)
	
	Если ТипЗнч(Значение) = Тип("ОписаниеТипов") Тогда
		
		Результат = ИТК_Типы.ПредставлениеОписания(Значение);
		
	Иначе
		
		Результат = Значение;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПоискПоПодобию_ВыбранныеКоллекцииМетаданных(ПараметрыПоиска)
	
	// Доступные коллекции
	ДоступныеКоллекции = Новый Массив;
	Для Каждого ИмяКоллекции Из ИТК_МетаданныеКлиентСерверПовтИсп.ДоступныеКоллекцииМетаданных() Цикл 
		
		Если ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоПланОбмена(ИмяКоллекции) Тогда
			Продолжить;
		КонецЕсли;
		
		ДоступныеКоллекции.Добавить(ИмяКоллекции);
		
	КонецЦикла;
	
	Для Каждого ЭлементСписка Из ИТК_МетаданныеКлиентСерверПовтИсп.ДоступныеКоллекцииМетаданныхГруппыОбщие() Цикл 
		
		ИмяКоллекции = ЭлементСписка.Представление;
		ДоступныеКоллекции.Добавить(ИмяКоллекции);
		
	КонецЦикла;
	
	// Поиск по коллекциям
	ВыбранныеКоллекции = Новый Массив;
	Если ЗначениеЗаполнено(ПараметрыПоиска.Коллекция) Тогда
		
		Для Каждого ИмяКоллеции Из ДоступныеКоллекции Цикл  
			
			Если СтрНайти(НРег(ИмяКоллеции), ПараметрыПоиска.Коллекция) Тогда
				ВыбранныеКоллекции.Добавить(ИмяКоллеции);
			КонецЕсли;

		КонецЦикла;
		
	Иначе
		ВыбранныеКоллекции = ДоступныеКоллекции;
	КонецЕсли;
	
	// Подготовка результата объектов коллекций
	Результат = Новый Массив;
	Для Каждого ИмяКоллекции Из ВыбранныеКоллекции Цикл 
		
		ОписаниеКоллекции = Новый Структура;
		ОписаниеКоллекции.Вставить("Имя", ИмяКоллекции);
		ОписаниеКоллекции.Вставить("Картинка", ИТК_МетаданныеКлиентСерверПовтИсп.КартинкаКоллекции(ИмяКоллекции));
		ОписаниеКоллекции.Вставить("Объекты", ИТК_Метаданные.ОбъектыКоллекцииБезИерархии(ИмяКоллекции));
		
		Результат.Добавить(ОписаниеКоллекции);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
