
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Объект.РежимЗаписи 			= "Запись";
	Объект.ВыполнятьВТранзакции = Истина;
	
	СписокТиповДокументов = ДокументыИспользующиеДопАналитики();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОткрытьДиалогСтандартногоПериодаПоДатам(Объект);
	
КонецПроцедуры // НастройкаПериода()

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьОбработкуЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Будет произведена замена типов аналитик в документах. Продолжить?';
						|en='Types of analytics in documents will be switched. Continue?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры // ВыполнитьОбработку()

// Процедура обработчик оповещения "ВыполнитьОбработкуЗавершение".
// 
// Параметры:
// Результат - КодВозвратаДиалога.
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура ВыполнитьОбработкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаменитьТипыАналитик(СписокТиповДокументов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДокументыИспользующиеДопАналитики()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	СписокДокументов = ОбработкаОбъект.ПолучитьДокументыИспользующиеДопАналитики();
	
	Возврат СписокДокументов;
	
КонецФункции // ДокументыИспользующиеДопАналитики()

&НаСервере
Процедура ЗаменитьТипыАналитик(СписокДокументов)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	// Для замены типов аналитик кроме списка документов, необходима инициализация некоторых вспомогательных структур.
	ОбработкаОбъект.ПолучитьДокументыИспользующиеДопАналитики();
	
	ОбработкаОбъект.ЗаменитьТипыАналитик(СписокДокументов);
	
КонецПроцедуры // ЗаменитьТипыАналитик()

#КонецОбласти
