
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
  	// Стандартные действия при создании на сервере.
  	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомпилироватьВсеКомплекты(Команда)
	
	КомпилироватьВсеКомплектыСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КомпилироватьВсеКомплектыСервер()
	
	бит_МеханизмХозяйственныхОперацийСервер.ИнтерпретироватьВсеКомплекты();
	
КонецПроцедуры

#КонецОбласти


