
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ №5.31]  [VUVaynula@1cbit.ru] [30.04.2025 15:18:35] +        
	//НоваяКоманда = Команды.Добавить("бит_ВыделитьВсе");
	//НоваяКоманда.Заголовок = "Выделить все";
	//НоваяКоманда.Действие = "бит_ВыделитьВсе";
	//
	//НоваяКоманда = Команды.Добавить("бит_Очистить");
	//НоваяКоманда.Заголовок = "Очистить";
	//НоваяКоманда.Действие = "бит_Очистить";   
	
	НоваяКоманда = Команды.Добавить("бит_СоздатьЗаказНаПроизводство");
	НоваяКоманда.Заголовок = "Создать заказ на производство";
	НоваяКоманда.Действие = "бит_СоздатьЗаказНаПроизводство";   
	
	//НовыйЭлемент = Элементы.Добавить("бит_ВыделитьВсе", Тип("КнопкаФормы"), Элементы.КомандыСписка);
	//НовыйЭлемент.Заголовок = "";
	//НовыйЭлемент.ИмяКоманды = "бит_ВыделитьВсе";
	//НовыйЭлемент.Картинка = БиблиотекаКартинок.УстановитьФлажки;
	//НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;

	//НовыйЭлемент = Элементы.Добавить("бит_Очистить", Тип("КнопкаФормы"), Элементы.КомандыСписка);
	//НовыйЭлемент.Заголовок = "";
	//НовыйЭлемент.ИмяКоманды = "бит_Очистить";
	//НовыйЭлемент.Картинка = БиблиотекаКартинок.СнятьФлажки;
	//НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	
	НовыйЭлемент = Элементы.Добавить("бит_СоздатьЗаказНаПроизводство", Тип("КнопкаФормы"), Элементы.КомандыСписка);
	НовыйЭлемент.ИмяКоманды = "бит_СоздатьЗаказНаПроизводство"; 
	// ------------------------------------------------------------- 
	//СхемаЗапроса = Новый СхемаЗапроса;
	//СхемаЗапроса.УстановитьТекстЗапроса(ЭтаФорма["Список"].ТекстЗапроса);
	////Данный цикл нужен чтобы найти последний пакет запросов, чтобы не брать ВТ
	//Для Каждого ПакетЗапросов ИЗ СхемаЗапроса.ПакетЗапросов Цикл
	//	Если ПакетЗапросов.ТаблицаДляПомещения = "" Тогда	
	//		ЗапросВыбора = ПакетЗапросов;
	//	КонецЕсли;
	//КонецЦикла;
	//ОператорВыбора = ЗапросВыбора.Операторы[0];
	////Добавляем поля выбора, т.е. то что в ВЫБРАТЬ обычно пишем.
	//ОператорВыбора.ВыбираемыеПоля.Добавить("Ложь"); 
	//ЗапросВыбора.Колонки[ЗапросВыбора.Колонки.Количество() - 1].Псевдоним = "Отметка";
	//ЭтаФорма["Список"].ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();  
	//
	//НовыйЭлемент = Элементы.Добавить("СписокОтметка", Тип("ПолеФормы"), Элементы.Список);
	//НовыйЭлемент.ПутьКДанным = "Список.Отметка";
	//НовыйЭлемент.Заголовок = "Отметка";
	//НовыйЭлемент.КартинкаШапки = БиблиотекаКартинок.УстановитьФлажки;  
	//// ------------------------------------------------------------- 
	//СхемаЗапроса = Новый СхемаЗапроса;
	//СхемаЗапроса.УстановитьТекстЗапроса(ЭтаФорма["СписокЗаказы"].ТекстЗапроса);
	////Данный цикл нужен чтобы найти последний пакет запросов, чтобы не брать ВТ
	//Для Каждого ПакетЗапросов ИЗ СхемаЗапроса.ПакетЗапросов Цикл
	//	Если ПакетЗапросов.ТаблицаДляПомещения = "" Тогда	
	//		ЗапросВыбора = ПакетЗапросов;
	//	КонецЕсли;
	//КонецЦикла;
	//ОператорВыбора = ЗапросВыбора.Операторы[0];
	////Добавляем поля выбора, т.е. то что в ВЫБРАТЬ обычно пишем.
	//ОператорВыбора.ВыбираемыеПоля.Добавить("Ложь"); 
	//ЗапросВыбора.Колонки[ЗапросВыбора.Колонки.Количество() - 1].Псевдоним = "Отметка";
	//ЭтаФорма["СписокЗаказы"].ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();  
	//
	//НовыйЭлемент = Элементы.Добавить("СписокЗаказыОтметка", Тип("ПолеФормы"), Элементы.СписокЗаказы);
	//НовыйЭлемент.ПутьКДанным = "СписокЗаказы.Отметка";
	//НовыйЭлемент.Заголовок = "Отметка";
	//НовыйЭлемент.КартинкаШапки = БиблиотекаКартинок.УстановитьФлажки;

	// }}ПервыйБИТ ЛистТребований [ЛТ №5.31]  [VUVaynula@1cbit.ru] [30.04.2025 15:18:35] -
КонецПроцедуры 

&НаКлиенте
Процедура бит_СоздатьЗаказНаПроизводство(Команда)
	// {{ПервыйБИТ ЛистТребований [ЛТ №5.31]  [VUVaynula@1cbit.ru] [02.05.2025 20:20:35] +        
	мКлючейРегистра = Новый Массив;
	
	ВыбранныеСтроки = Элементы.Список.ВыделенныеСтроки;
    Для каждого стр из ВыбранныеСтроки Цикл
		Если ТипЗнч(стр) = Тип("РегистрСведенийКлючЗаписи.РаспределениеЗапасов") Тогда
			мКлючейРегистра.Добавить(стр);
		КонецЕсли;	
    КонецЦикла;
	
	ВыбранныеСтроки = Элементы.СписокЗаказы.ВыделенныеСтроки;
    Для каждого стр из ВыбранныеСтроки Цикл
		Если ТипЗнч(стр) = Тип("РегистрСведенийКлючЗаписи.РаспределениеЗапасов") Тогда
			мКлючейРегистра.Добавить(стр);
		КонецЕсли;
	КонецЦикла;    
	
	ОбработатьКлючиНаСервере(мКлючейРегистра);  
	Элементы.СписокЗаказы.Обновить(); 
	Элементы.Список.Обновить();
    // }}ПервыйБИТ ЛистТребований [ЛТ №5.31]  [VUVaynula@1cbit.ru] [02.05.2025 20:20:35] -
КонецПроцедуры                         

&НаСервере
Процедура ОбработатьКлючиНаСервере(мКлючейРегистра)
	// {{ПервыйБИТ ЛистТребований [ЛТ №5.31]  [VUVaynula@1cbit.ru] [02.05.2025 20:23:19] +        
    ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ЗаказКлиента", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
	ТД.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	//ТД.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТД.Колонки.Добавить("МаркаБренд"  , Новый ОписаниеТипов("СправочникСсылка.Марки"));
	ТД.Колонки.Добавить("РазмерГотовойПродукции");
	ТД.Колонки.Добавить("ВидИсполненияГотовойПродукции");
	ТД.Колонки.Добавить("ИзготовитьК", Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТД.Колонки.Добавить("Обособлено", Новый ОписаниеТипов("Булево"));
	ТД.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения")); 
	ТД.Колонки.Добавить("Склад",	Новый ОписаниеТипов("СправочникСсылка.Склады")); 
	ТД.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", ,, Новый КвалификаторыЧисла(15, 2)));
	ТД.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации")); 
	
	мЗаказовКИсправлению = новый Массив;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА бит_ЗначенияПризнаковНоменклатуры.бит_Признак = &ПризнакВИД
	                      |				ТОГДА бит_ЗначенияПризнаковНоменклатуры.бит_Значение
	                      |		КОНЕЦ) КАК ЗначениеВИД,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА бит_ЗначенияПризнаковНоменклатуры.бит_Признак = &ПризнакРазмер
	                      |				ТОГДА бит_ЗначенияПризнаковНоменклатуры.бит_Значение
	                      |		КОНЕЦ) КАК ЗначениеРазмер
	                      |ИЗ
	                      |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
	                      |ГДЕ
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &Номенклатура
	                      |	И (бит_ЗначенияПризнаковНоменклатуры.бит_Признак В (&ПризнакВИД, &ПризнакРазмер)
	                      |			ИЛИ бит_ЗначенияПризнаковНоменклатуры.бит_Признак В (&ПризнакВИД, &ПризнакРазмер))");
	Запрос.УстановитьПараметр("ПризнакВИД", Справочники.бит_ЗначенияПоУмолчанию.ПризнакВидИсполненияГотовойПродукции.Значение);
	Запрос.УстановитьПараметр("ПризнакРазмер", Справочники.бит_ЗначенияПоУмолчанию.ПризнакРазмерГотовойПродукции.Значение);
	Для каждого ключЗаписи из  мКлючейРегистра Цикл
		Запись = регистрыСведений.РаспределениеЗапасов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ключЗаписи);
		Запись.Прочитать();   
		Если ТипЗнч(Запись.ЗаказНаОтгрузку) <> Тип("ДокументСсылка.ЗаказКлиента") Или Не ЗначениеЗаполнено(Запись.ЗаказНаОтгрузку) Тогда
			Продолжить;
		КонецЕсли;
		нов = ТД.Добавить();                 
		
		нов.ЗаказКлиента = Запись.ЗаказНаОтгрузку; 
		нов.Склад = Запись.ЗаказНаОтгрузку.Склад;
		
		нов.Номенклатура = Запись.Номенклатура; 
		нов.МаркаБренд	= Запись.Номенклатура.Марка;
		
		Запрос.УстановитьПараметр("Номенклатура", Запись.Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			нов.РазмерГотовойПродукции = Выборка.ЗначениеРазмер;
			нов.ВидИсполненияГотовойПродукции = Выборка.ЗначениеВид;  
		КонецЕсли;
		
			мСтрокЗаказа = Запись.ЗаказНаОтгрузку.Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ДатаОтгрузки", Запись.Номенклатура, Запись.Характеристика, Запись.ЖелаемаяДатаОтгрузки));
			Если мСтрокЗаказа.Количество() Тогда
				нов.ИзготовитьК = мСтрокЗаказа[0].бит_ИзготовитьК;
				нов.Обособлено = мСтрокЗаказа[0].Обособленно;
			КонецЕсли; 
		нов.Количество = Запись.Зарезервировано + Запись.Обеспечено + Запись.НеОбеспечено; 
		нов.Назначение = Запись.Назначение;
		
		Если нов.Обособлено = Ложь И мЗаказовКИсправлению.Найти(нов.ЗаказКлиента) = Неопределено Тогда
			мЗаказовКИсправлению.Добавить(нов.ЗаказКлиента);
			нов.Обособлено = Истина; // авансом
		КонецЕсли;
		
	КонецЦикла;
	//Отработаем требование про галку обособленно
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Обособлено", Ложь);  
	СтруктураОтбора.Вставить("ЗаказКлиента");
	
	СтруктураОтбораТоваров = Новый Структура;
	СтруктураОтбораТоваров.Вставить("Обособлено", Ложь);  
	СтруктураОтбораТоваров.Вставить("Номенклатура");
	
	Для каждого Заказ из мЗаказовКИсправлению Цикл
		СтруктураОтбора.ЗаказКлиента = Заказ;
		мСтроки = ТД.НайтиСтроки(СтруктураОтбора);
		мНоменклатур = Новый Массив;
		Для каждого стр из мСтроки Цикл      
			мНоменклатур.Добавить(стр.Номенклатура);
		КонецЦикла;
		
		ЗаказОбъект = Заказ.ПолучитьОбъект();
		Для каждого стр из ЗаказОбъект.Товары Цикл
			Если стр.Обособленно = Ложь И мНоменклатур.Найти(стр.Номенклатура) <> Неопределено Тогда
				стр.Обособленно = Истина;
			КонецЕсли;
		КонецЦикла;
		ЗаказОбъект.Записать();
	КонецЦикла;
    // ----
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	РесурсныеСпецификации.Ссылка КАК Ссылка,
	                      |	МАКСИМУМ(РесурсныеСпецификации.НачалоДействия) КАК НачалоДействия,
	                      |	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура
	                      |ПОМЕСТИТЬ вт
	                      |ИЗ
	                      |	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	                      |ГДЕ
	                      |	РесурсныеСпецификации.Статус = Значение(Перечисление.СтатусыСпецификаций.Действует)
	                      |	И РесурсныеСпецификации.ОсновноеИзделиеНоменклатура В(&мНоменклатура)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РесурсныеСпецификации.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	РесурсныеСпецификации.Ссылка КАК Спецификация,
	                      |	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура КАК Номенклатура
	                      |ИЗ
	                      |	вт КАК вт
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	                      |		ПО вт.Ссылка = РесурсныеСпецификации.Ссылка
	                      |			И вт.НачалоДействия = РесурсныеСпецификации.НачалоДействия
	                      |			И вт.ОсновноеИзделиеНоменклатура = РесурсныеСпецификации.ОсновноеИзделиеНоменклатура"); 
	Запрос.УстановитьПараметр("мНоменклатура", ТД.ВыгрузитьКолонку("Номенклатура"));
	Выборка = Запрос.Выполнить().Выбрать();
	соотвСпецификации = Новый Соответствие;
	Пока Выборка.Следующий() Цикл          
		соотвСпецификации.Вставить(Выборка.Номенклатура, Выборка.Спецификация);
	КонецЦикла;
	
	ТаблицаУникальных = ТД.Скопировать(, "МаркаБренд,РазмерГотовойПродукции,ВидИсполненияГотовойПродукции,ИзготовитьК");
	ТаблицаУникальных.Свернуть("МаркаБренд,РазмерГотовойПродукции,ВидИсполненияГотовойПродукции,ИзготовитьК");
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("МаркаБренд");
	СтруктураОтбора.Вставить("РазмерГотовойПродукции");
	СтруктураОтбора.Вставить("ВидИсполненияГотовойПродукции");
	СтруктураОтбора.Вставить("ИзготовитьК");
	
	Для каждого уникЗапись Из ТаблицаУникальных Цикл
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, уникЗапись);
		
		МассивСтрок = ТД.НайтиСтроки(СтруктураОтбора);
		
		Документ = СоздатьШапкуЗаказаНаПроизводство(уникЗапись.ИзготовитьК);
		ЗаполнитьТЧЗаказаНаПроизводство(Документ, МассивСтрок, соотвСпецификации);
		ПроверкаНаНаличиеПодобногоДокумента(Документ);
		Если Документ.Продукция.Количество() = 0 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По всем выделенным строкам уже созданы заказы на производство");
			Продолжить;
		КонецЕсли;
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан " + Документ, Документ.Ссылка); 
		Исключение            
			Документ.Записать();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ был записан. " + Документ + ". Проведение не удалось по причине " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), Документ.Ссылка);
		КонецПопытки;
	КонецЦикла; 
	// }}ПервыйБИТ ЛистТребований [ЛТ №5.31]  [VUVaynula@1cbit.ru] [02.05.2025 20:23:19] -
КонецПроцедуры 

&НаСервере
Функция СоздатьШапкуЗаказаНаПроизводство(ИзготовитьК)
	// {{ПервыйБИТ ЛистТребований [ЛТ №5.31]  [VUVaynula@1cbit.ru] [02.05.2025 21:02:27] +        
	Документ = Документы.ЗаказНаПроизводство2_2.СоздатьДокумент();
	Документ.Дата = ТекущаяДатаСеанса();
	Документ.Автор = Пользователи.АвторизованныйПользователь();
	Документ.ВариантОбособления = Константы.ВариантОбособленияМатериаловВПроизводстве.Получить();
	Документ.ДатаПотребности = ИзготовитьК;
	Документ.ДатаПотребностиУказываетсяВСтроках = ?(ЗначениеЗаполнено(ИзготовитьК), Истина, Ложь); 
	Документ.ТипПроизводственногоПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Сборка; 
	Документ.ДинамическаяСтруктура = Документы.ЗаказНаПроизводство2_2.ДоступенРасчетСтруктурыЗаказа(Документ);	
	//Документ.Договор	Не заполнять	
	//Документ.ДоговорНеОбязателен	Нет	            
	//Документ.ЗадействоватьРезервДоступности	Нет	
	Документ.ЗаказПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС; //	Продажа облагается НДС	
	//Документ.Комментарий	Не заполнять	
	//Документ.НазначениеПродукция	Не заполнять	
	//Документ.НаправлениеДеятельности	Не заполнять	
	Документ.НачатьНеРанее = ТекущаяДатаСеанса(); // Устанавливать текущую дату	
	//Документ.ОбособлениеПолуфабрикатовПоНазначениюЭтаповНеИспользуется	Нет	
	//Документ.ОбособленноеОбеспечениеМатериаловИРабот	Нет	
	Документ.Организация = Справочники.бит_ЗначенияПоУмолчанию.ОрганизацияПоУмолчанию.Значение;  //ООО "Рыбинсккабель"	
	Документ.Ответственный = Пользователи.АвторизованныйПользователь();
	//Документ.Очередь	0	
	//Документ.ПартияПроизводства	 Не заполнять	
	//Документ.Партнер	 Не заполнять	
	Документ.Подразделение = Справочники.бит_ЗначенияПоУмолчанию.ПодразделениеДиспетчер.Значение;
	Документ.Приоритет = Справочники.бит_ЗначенияПоУмолчанию.СреднийПриоритет.Значение;
	Документ.РазмещениеВыпуска = Перечисления.СпособыПривязкиОперацийПроизводства.КОкончанию;	
	Документ.СпособРаспределенияЗатратНаВыходныеИзделия	= Перечисления.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости;
	Документ.Статус	 = Перечисления.СтатусыЗаказовНаПроизводство2_2.Формируется;
	//Документ.УдалитьМаксимальныйКодСтроки	0	
	//Документ.УкрупненныйЗаказПоНазначениямПродукции	Нет	
	Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СобственноеПроизводство; //	Собственное производство   

	Возврат Документ;
	// }}ПервыйБИТ ЛистТребований [ЛТ №5.31]  [VUVaynula@1cbit.ru] [02.05.2025 21:02:27] -
КонецФункции 

&НаСервере
Процедура ЗаполнитьТЧЗаказаНаПроизводство(Документ, ДанныеЗаполнения, соотвСпецификации)
	// {{ПервыйБИТ ЛистТребований [ЛТ №5.31]  [VUVaynula@1cbit.ru] [02.05.2025 21:02:27] +     
	мЗаказКлиента = Новый Массив;
	мНазначения = Новый Массив;
	Для каждого стр из ДанныеЗаполнения Цикл
		нов = Документ.Продукция.Добавить();
		нов.Номенклатура =	стр.Номенклатура;
		//нов.Характеристика	Не заполнять	
		//нов.Упаковка	Не заполнять	
		нов.Количество = стр.Количество; 
		нов.КоличествоУпаковок = стр.Количество;
		нов.Спецификация = соотвСпецификации.Получить(стр.Номенклатура);
		нов.Склад = стр.Склад;	
		//нов.Подразделение-получатель	Не заполнять	
		нов.Назначение = стр.Назначение; // Заполнять в соответствии с пунктом 6b	
		нов.ДатаПотребности = Документ.ДатаПотребности; //Значение реквизита "Изготовить к" из ТЧ документа "Заказ клиента", указанного в назначении.	
		//нов.Отменено	Нет 	
		//нов.Причина отмены	Не заполнять	
		//нов.Доля стоимости	Не заполнять	
		//нов.Доля стоимости на единицу	Не заполнять	
		//нов.Списать на расходы	Нет	
		//нов.Статья расходов / активов	Не заполнять	
		//нов.Аналитика расходов	Не заполнять	
		//нов.Аналитика активов/пассивов	Не заполнять	
		//нов.Ключ номенклатура	// Создать новый для каждой строки ТЧ // автоматом создает
		
		Если мЗаказКлиента.Найти(стр.ЗаказКлиента) = Неопределено Тогда
			мЗаказКлиента.Добавить(стр.ЗаказКлиента);
		КонецЕсли; 
		Если мНазначения.Найти(стр.Назначение) = Неопределено Тогда
			мНазначения.Добавить(стр.Назначение);
		КонецЕсли;
	КонецЦикла;          
		
	Если мЗаказКлиента.Количество() = 1 Тогда 
		Документ.ДокументОснование = мЗаказКлиента[0];
	КонецЕсли;  
	Если мНазначения.Количество() = 1 Тогда 
		Документ.Назначение = мНазначения[0];
	КонецЕсли;   
	Если Документ.Продукция.Количество() Тогда
		Документ.ТипПроизводственногоПроцесса = Документ.Продукция[0].Спецификация.ТипПроизводственногоПроцесса; // Реквизит "ТипПроизводственногоПроцесса" ресурсной спецификации, указанной реквизите "Спецификация" ТЧ "Продукция" документа "Заказ на производство"	
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ №5.31]  [VUVaynula@1cbit.ru] [02.05.2025 21:02:27] -
КонецПроцедуры

&НаСервере
Процедура ПроверкаНаНаличиеПодобногоДокумента(Документ)
	// {{ПервыйБИТ ЛистТребований [5.31]  [VUVaynula@1cbit.ru] [14.05.2025 14:02:49] +        
	тзДанныеДокумента = Документ.Продукция.Выгрузить(, "Номенклатура, Количество, Склад, Назначение, ДатаПотребности");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	                      |	СУММА(ЗаказНаПроизводство2_2Продукция.Количество) КАК Количество,
	                      |	ЗаказНаПроизводство2_2Продукция.Назначение КАК Назначение,
	                      |	ЗаказНаПроизводство2_2Продукция.Склад КАК Склад,
	                      |	&ДатаПотребности КАК ДатаПотребности
	                      |ПОМЕСТИТЬ втДанныеБазы
	                      |ИЗ
	                      |	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	                      |ГДЕ
	                      |	ЗаказНаПроизводство2_2Продукция.Ссылка.Проведен
	                      |	И ЗаказНаПроизводство2_2Продукция.Ссылка.ДатаПотребности = &ДатаПотребности
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗаказНаПроизводство2_2Продукция.Номенклатура,
	                      |	ЗаказНаПроизводство2_2Продукция.Назначение,
	                      |	ЗаказНаПроизводство2_2Продукция.Склад
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	тзДанныеДокумента.Номенклатура КАК Номенклатура,
	                      |	тзДанныеДокумента.Количество КАК Количество,
	                      |	тзДанныеДокумента.Назначение КАК Назначение,
	                      |	тзДанныеДокумента.Склад КАК Склад,
	                      |	тзДанныеДокумента.ДатаПотребности КАК ДатаПотребности
	                      |ПОМЕСТИТЬ тзДанныеДокумента
	                      |ИЗ
	                      |	&тзДанныеДокумента КАК тзДанныеДокумента
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	влДанныеДокумента.Номенклатура КАК Номенклатура,
	                      |	влДанныеДокумента.Назначение КАК Назначение,
	                      |	влДанныеДокумента.Склад КАК Склад,
	                      |	влДанныеДокумента.ДатаПотребности КАК ДатаПотребности,
	                      |	влДанныеДокумента.Количество - ЕСТЬNULL(втДанныеБазы.Количество, 0) КАК Количество,
						  |	ЕСТЬNULL(втДанныеБазы.Количество, 0) КАК КоличествоВЗаказах
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		тзДанныеДокумента.Номенклатура КАК Номенклатура,
	                      |		СУММА(тзДанныеДокумента.Количество) КАК Количество,
	                      |		тзДанныеДокумента.Назначение КАК Назначение,
	                      |		тзДанныеДокумента.Склад КАК Склад,
	                      |		тзДанныеДокумента.ДатаПотребности КАК ДатаПотребности
	                      |	ИЗ
	                      |		тзДанныеДокумента КАК тзДанныеДокумента
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		тзДанныеДокумента.Номенклатура,
	                      |		тзДанныеДокумента.Склад,
	                      |		тзДанныеДокумента.ДатаПотребности,
	                      |		тзДанныеДокумента.Назначение) КАК влДанныеДокумента
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеБазы КАК втДанныеБазы
	                      |		ПО влДанныеДокумента.Номенклатура = втДанныеБазы.Номенклатура
	                      |			И влДанныеДокумента.Назначение = втДанныеБазы.Назначение
	                      |			И влДанныеДокумента.Склад = втДанныеБазы.Склад
	                      |			И влДанныеДокумента.ДатаПотребности = втДанныеБазы.ДатаПотребности
	                      |ГДЕ
	                      |	влДанныеДокумента.Количество - ЕСТЬNULL(втДанныеБазы.Количество, 0) > 0");	
	Запрос.УстановитьПараметр("ДатаПотребности", Документ.ДатаПотребности); 
	Запрос.УстановитьПараметр("тзДанныеДокумента", тзДанныеДокумента); 
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	Если Результат.Количество() = 0 Тогда
		Документ.Продукция.Очистить();
	Иначе         
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура");
		СтруктураОтбора.Вставить("Назначение");
		СтруктураОтбора.Вставить("Склад");
		СтруктураОтбора.Вставить("ДатаПотребности");
		
		сч = Документ.Продукция.Количество() - 1;
		Пока сч >= 0 Цикл
			ТекСтрока = Документ.Продукция[сч];
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, ТекСтрока);
			мНайденныеСтроки = Результат.НайтиСтроки(СтруктураОтбора);
			Если мНайденныеСтроки.Количество() = 0 Тогда   
				Документ.Продукция.Удалить(ТекСтрока);
			Иначе
				ТекСтрока.Количество = мНайденныеСтроки[0].Количество;
				ТекСтрока.КоличествоУпаковок = ТекСтрока.Количество;
			КонецЕсли;
			сч = сч - 1;
		КонецЦикла;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [5.31]  [VUVaynula@1cbit.ru] [14.05.2025 14:02:49] -
КонецПроцедуры
