
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
  	// Стандартные действия при создании на сервере.
  	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Свойство("Ссылка") Тогда
		ЗаполнитьСостав(ТекущиеДанные.Ссылка);
	Иначе
		ЗаполнитьСостав(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Откроем форму источника данных
	ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Ссылка);	
	ОткрытьФорму("Справочник.бит_му_РыночныеСтавкиКредитыЗаймы.ФормаОбъекта", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗаполнитьСостав(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Откроем форму источника данных
	ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Ссылка);	
	ОткрытьФорму("Справочник.бит_му_РыночныеСтавкиКредитыЗаймы.ФормаОбъекта", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗаполнитьСостав(ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтчетРыночныеСтавкиКредитыЗаймы(Команда)
	
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии", Истина);	
	ОткрытьФорму("Отчет.бит_му_РыночныеСтавкиКредитыЗаймы.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры // ОтчетРыночныеСтавкиКредитыЗаймы()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет таблицу значений "Состав".
// 
// Параметры:
//  Ставки - СправочникСсылка.бит_му_РыночныеСтавкиКредитыЗаймы.
// 
&НаСервере
Процедура ЗаполнитьСостав(Ставки)

	ТекстЗапроса = "ВЫБРАТЬ
	               |	бит_му_РыночныеСтавкиКредитыЗаймыСтавки.Ставка,
	               |	бит_му_РыночныеСтавкиКредитыЗаймыСтавки.ЧислоДней
	               |ИЗ
	               |	Справочник.бит_му_РыночныеСтавкиКредитыЗаймы.Ставки КАК бит_му_РыночныеСтавкиКредитыЗаймыСтавки
	               |ГДЕ
	               |	бит_му_РыночныеСтавкиКредитыЗаймыСтавки.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	бит_му_РыночныеСтавкиКредитыЗаймыСтавки.НомерСтроки";
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Ссылка", Ставки);
	
	Состав.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры // ЗаполнитьСостав()

#КонецОбласти

