
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтрВозврата = ПроверитьВозможностьСозданияСводногоДокумента(ПараметрКоманды);
	
	Если НЕ СтрВозврата.Возможно Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(СтрВозврата.ТекстСообщения);
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОснование", ПараметрКоманды);
	
	Если СтрВозврата.Возможно Тогда
	
		ОткрытьФорму("Документ.бит_пз_СводнаяЗаявкаНаЗатраты.ФормаОбъекта"
		              , ПараметрыФормы
					  , ПараметрыВыполненияКоманды.Источник
					  , ПараметрыВыполненияКоманды.Уникальность
					  , ПараметрыВыполненияКоманды.Окно);
		
	КонецЕсли;				  
	
КонецПроцедуры

//  Функция проверяет возможность создания
// документа Сводная заявка на основании Заявки на затраты.
// 
// Параметры:
//  ЗаявкаНаЗатраты - ДокументСсылка.бит_пз_ЗаявкаНаЗатраты.
// 
&НаСервере
Функция ПроверитьВозможностьСозданияСводногоДокумента(ЗаявкаНаЗатраты) Экспорт 

	СтрВозврата = Новый Структура("Возможно, ТекстСообщения", Ложь, ""); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрСтатусыОбъектов.Статус КАК Статус,
	|	РегистрСтатусыОбъектов.Объект КАК Заявка,
	|	СправочникСтатусыОбъектов.ТипСтатуса КАК ТипСтатуса
	|ИЗ
	|	РегистрСведений.бит_СтатусыОбъектов КАК РегистрСтатусыОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_СтатусыОбъектов КАК СправочникСтатусыОбъектов
	|		ПО РегистрСтатусыОбъектов.Статус = СправочникСтатусыОбъектов.Ссылка
	|			И (РегистрСтатусыОбъектов.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус))
	|			И (РегистрСтатусыОбъектов.Объект = &Документ)";
	
	Запрос.УстановитьПараметр("Документ", ЗаявкаНаЗатраты);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипСтатуса = Перечисления.бит_ТипыСтатусовОбъектов.Утвержден
			ИЛИ Выборка.ТипСтатуса = Перечисления.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен
			ИЛИ Выборка.Статус = Справочники.бит_СтатусыОбъектов.ЗаявкаНаЗатраты_ВключенаВСводнуюЗаявку Тогда 
		
			СтрОстатков = Документы.бит_пз_ЗаявкаНаЗатраты.ПолучитьОстатки(ЗаявкаНаЗатраты);

			Если СтрОстатков.КоличествоОстаток > 0 Тогда				
				СтрВозврата.Вставить("Возможно", Истина);
				Возврат СтрВозврата;				
			Иначе	
				СтрВозврата.Вставить("ТекстСообщения", НСтр("ru='Превышен остаток по номенклатуре.';
															|en='Exceeded the balance of the nomenclature.'"));
				Возврат СтрВозврата;
			КонецЕсли; 
		
		Иначе 
			
			СтрВозврата.Вставить("ТекстСообщения", НСтр("ru='Создание Сводной заявки на затраты возможно только в статусах Утверждена, Частично исполнена и Включена в сводную заявку.';
														|en='Creating Consolidated application for costs is only possible in the status of Approved, partially performed and included in the consolidated application.'"));
			Возврат СтрВозврата;
			
		КонецЕсли; 
	
	КонецЦикла;
	
	Возврат СтрВозврата;
	
КонецФункции // ПроверитьВозможностьСозданияСводногоДокумента()
