
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОповещениеПриИзменении(Элемент)
	
	ИзменениеОповещения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура обрабатывает изменение оповещения.
// 
&НаСервере
Процедура ИзменениеОповещения()
	
	Если ЗначениеЗаполнено(Запись.Оповещение) Тогда
		
		Если Запись.ОбъектСистемы <> Запись.Оповещение.ОбъектСистемы Тогда			
			Запись.ОбъектСистемы = Запись.Оповещение.ОбъектСистемы;			
		КонецЕсли; 
        
        Если Запись.ВидСобытия <> Запись.Оповещение.ВидСобытия Тогда			
			Запись.ВидСобытия = Запись.Оповещение.ВидСобытия;			
		КонецЕсли;		
		
	КонецЕсли; 
	
КонецПроцедуры // ИзменениеОповещения()

#КонецОбласти
