
#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет способ транспорта в зависимости от типа точки доставки.
//
// Параметры:
//   ТочкаДоставки - Строка, СправочникСсылка.бит_МобильныеУстройства.
//
// Возвращаемое значение:
//  СпособТранспорта - ПеречислениеСсылка.бит_фн_СпособыТранспортаОповещений.
//
Функция ОпределитьСпособТранспорта(ТочкаДоставки) Экспорт
	
	Если ТипЗнч(ТочкаДоставки) = Тип("СправочникСсылка.бит_МобильныеУстройства") Тогда
		СпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.PushNotification");
	ИначеЕсли ТипЗнч(ТочкаДоставки) = Тип("СправочникСсылка.бит_ЧатыTelegram") Тогда 	
		СпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.Telegram");
	ИначеЕсли ТипЗнч(ТочкаДоставки) = Тип("СправочникСсылка.Пользователи") Тогда 	
		СпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.СистемаВзаимодействия");
	Иначе	
		СпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта");
	КонецЕсли; 

	Возврат СпособТранспорта;
	
КонецФункции

#КонецОбласти