#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает таблицу значений с действующими договорами и их настройками интеграции.
//
// Возвращаемое значение:
//	ТаблицаЗначений:
//		*Договор - СправочникСсылка.ДоговорыЭквайринга - 
//		*Интеграция - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//
Функция ДействующиеДоговораСНастройкамиИнтеграции() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор КАК Договор,
	               |	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция КАК Интеграция
	               |ИЗ
	               |	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
	               |ГДЕ
	               |	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	               |	И НЕ НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор.ПометкаУдаления
	               |	И НЕ НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция = ЗНАЧЕНИЕ(Справочник.НастройкиПодключенияКСистемеБыстрыхПлатежей.ПустаяСсылка)";
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

#КонецОбласти

#КонецЕсли
