#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Процедура устанавливает значения регистра по умолчанию
//
// Параметры:
//   Запись           - РегистрСведенийЗапись - запись регистра
//   ДанныеЗаполнения - Структура - где ключ - имя ресурса
//
Процедура УстановкаНастроекПоУмолчанию(Запись, ДанныеЗаполнения) Экспорт
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Период",
		ТекущаяДатаСеанса());
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СтруктурноеПодразделение",
		Неопределено);
		
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Календарь",
		Справочники.ПроизводственныеКалендари.ПустаяСсылка());
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли