	
////////////////////////////////////////////////////////////////////////////////
// Модуль механизмов обмена Аудиторской выгрузки.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает таблицу правил регистрации объекта для заданного плана обмена.
//
// Параметры:
//  ИмяПланаОбмена   - Строка - имя плана обмена как оно задано в конфигураторе.
//  ПолноеИмяОбъекта - Строка - полное имя объекта метаданных,
//                   для которого необходимо получить правила регистрации.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица правил регистрации объекта по заданному плану обмена.
//
Функция ПравилаРегистрацииОбъекта(Знач ИмяПланаОбмена, Знач ПолноеИмяОбъекта) Экспорт
	
	// АПК:277-выкл
	ПравилаРегистрацииОбъектовПланаОбмена = ОбменДаннымиСобытия.ПравилаРегистрацииОбъектовПланаОбмена(ИмяПланаОбмена);
	// АПК:277-вкл
	
	ТаблицаПравилРегистрации = ПравилаРегистрацииОбъектовПланаОбмена.Скопировать(Новый Структура("ОбъектМетаданныхИмя", ПолноеИмяОбъекта));
	ДополнитьСтандартнымиПравиламиРегистрации(ИмяПланаОбмена, ПолноеИмяОбъекта, ТаблицаПравилРегистрации);
	
	Возврат ТаблицаПравилРегистрации;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура бит_АудиторскаяВыгрузкаРегистрацияПередЗаписью(Источник, Отказ) Экспорт
	
	МетаданныеИсточника = Источник.Метаданные();
	ПолноеИмяМетаданных = МетаданныеИсточника.ПолноеИмя();
	Если НЕ бит_АудиторскаяВыгрузкаПовтИсп.ВходитВСоставАудиторскойВыгрузки(ПолноеИмяМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("бит_АудиторскаяВыгрузка", Источник, Отказ);
	
КонецПроцедуры

Процедура бит_АудиторскаяВыгрузкаРегистрацияДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	МетаданныеИсточника = Источник.Метаданные();
	ПолноеИмяМетаданных = МетаданныеИсточника.ПолноеИмя();
	Если НЕ бит_АудиторскаяВыгрузкаПовтИсп.ВходитВСоставАудиторскойВыгрузки(ПолноеИмяМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("бит_АудиторскаяВыгрузка", Источник,
																		Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура бит_АудиторскаяВыгрузкаРегистрацияКонстантыПередЗаписью(Источник, Отказ) Экспорт
	
	МетаданныеИсточника = Источник.Метаданные();
	ПолноеИмяМетаданных = МетаданныеИсточника.ПолноеИмя();
	Если НЕ бит_АудиторскаяВыгрузкаПовтИсп.ВходитВСоставАудиторскойВыгрузки(ПолноеИмяМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты("бит_АудиторскаяВыгрузка", Источник, Отказ);
	
КонецПроцедуры

Процедура бит_АудиторскаяВыгрузкаРегистрацияНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	МетаданныеИсточника = Источник.Метаданные();
	ПолноеИмяМетаданных = МетаданныеИсточника.ПолноеИмя();
	Если НЕ бит_АудиторскаяВыгрузкаПовтИсп.ВходитВСоставАудиторскойВыгрузки(ПолноеИмяМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("бит_АудиторскаяВыгрузка", Источник,
																		Отказ, Замещение);
	
КонецПроцедуры

Процедура бит_АудиторскаяВыгрузкаРегистрацияУдаленияПередУдалением(Источник, Отказ) Экспорт
	
	МетаданныеИсточника = Источник.Метаданные();
	ПолноеИмяМетаданных = МетаданныеИсточника.ПолноеИмя();
	Если НЕ бит_АудиторскаяВыгрузкаПовтИсп.ВходитВСоставАудиторскойВыгрузки(ПолноеИмяМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("бит_АудиторскаяВыгрузка", Источник, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьСтандартнымиПравиламиРегистрации(ИмяПланаОбмена, ПолноеИмяОбъекта, ТаблицаПравилРегистрации)
	
	Если ТаблицаПравилРегистрации.Количество() > 0 Тогда
		// Если заданы уникальные правила регистрации, то стандартные правила не используются.
		Возврат;
	КонецЕсли;
	
	СтандартноеПравило = СтандартноеПравилоОбъекта(ПолноеИмяОбъекта);
	
	Если СтандартноеПравило = Неопределено Тогда
		
		// Правила не добавляются, объект будет зарегистрирован во все узлы.
		Возврат;
		
	ИначеЕсли СтандартноеПравило = "ЗарегистироватьВГлавныйУзел" Тогда
		
		// Используем фильтр по значению из основного отбора набора записей.
		ПравилоРегистрации                                          = ТаблицаПравилРегистрации.Добавить();
		ПравилоРегистрации.ИмяПланаОбмена                           = ИмяПланаОбмена;
		ПравилоРегистрации.ОбъектМетаданныхИмя                      = ПолноеИмяОбъекта;
		ПравилоРегистрации.ЕстьОбработчикПередОбработкой            = Истина;
		ПравилоРегистрации.ЕстьОбработчикПослеОбработки             = Истина;
		ПравилоРегистрации.ПравилоПоСвойствамОбъектаПустое          = Истина;
		
		ПравилоРегистрации.ПослеОбработки = "
		|Получатели = Новый Массив;
		|Получатели.Добавить(ПланыОбмена.ГлавныйУзел());
		|";
		
		ПравилоРегистрации.ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|ИЗ
		|ПланОбмена." + ИмяПланаОбмена + " КАК ПланОбменаОсновнаяТаблица
		|ГДЕ
		|Истина
		|[ОбязательныеУсловия]";
		
	ИначеЕсли СтандартноеПравило = "Документ_ФильтрПоДатеИОрганизацииШапки" Тогда 
		
		// Выгружаем по фильтру организации, указанной в шапке документа.
		ПравилоРегистрации                     = ТаблицаПравилРегистрации.Добавить();
		ПравилоРегистрации.ИмяПланаОбмена      = ИмяПланаОбмена;
		ПравилоРегистрации.ОбъектМетаданныхИмя = ПолноеИмяОбъекта;
		ПравилоРегистрации.ПравилоПоСвойствамОбъектаПустое = Истина;
		ПравилоРегистрации.СвойстваОбъекта.Вставить("Дата", "Дата");
		ПравилоРегистрации.СвойстваОбъекта.Вставить("Организация", "Организация");
		ПравилоРегистрации.СвойстваОбъектаСтрокой = "Дата КАК Дата, Организация КАК Организация";
		ПравилоРегистрации.ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|ИЗ
		|ПланОбмена." + ИмяПланаОбмена + " КАК ПланОбменаОсновнаяТаблица
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|ПланОбмена." + ИмяПланаОбмена + ".Организации КАК ПланОбменаОрганизации
		|ПО ПланОбменаОсновнаяТаблица.Ссылка = ПланОбменаОрганизации.Ссылка
		|ГДЕ
		|((ПланОбменаОрганизации.Организация ЕСТЬ NULL
		|		   ИЛИ ПланОбменаОрганизации.Организация = &СвойствоОбъекта_Организация
		|		   )
		|	И ПланОбменаОсновнаяТаблица.НачалоПериодаВыгрузкиДокументов <= &СвойствоОбъекта_Дата
		|	И (ПланОбменаОсновнаяТаблица.КонецПериодаВыгрузкиДокументов >= НАЧАЛОПЕРИОДА(&СвойствоОбъекта_Дата, ДЕНЬ)
		|		   ИЛИ ПланОбменаОсновнаяТаблица.КонецПериодаВыгрузкиДокументов = ДАТАВРЕМЯ(1,1,1)
		|		   )
		| )
		|[ОбязательныеУсловия]";
		
	ИначеЕсли СтандартноеПравило = "Документ_ФильтрПоДате" Тогда 
		
		// Выгружаем по фильтру организации, указанной в шапке документа.
		ПравилоРегистрации                     = ТаблицаПравилРегистрации.Добавить();
		ПравилоРегистрации.ИмяПланаОбмена      = ИмяПланаОбмена;
		ПравилоРегистрации.ОбъектМетаданныхИмя = ПолноеИмяОбъекта;
		ПравилоРегистрации.ПравилоПоСвойствамОбъектаПустое = Истина;
		ПравилоРегистрации.СвойстваОбъекта.Вставить("Дата", "Дата");
		ПравилоРегистрации.СвойстваОбъектаСтрокой = "Дата КАК Дата";
		ПравилоРегистрации.ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|ИЗ
		|ПланОбмена." + ИмяПланаОбмена + " КАК ПланОбменаОсновнаяТаблица
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|ПланОбмена." + ИмяПланаОбмена + ".Организации КАК ПланОбменаОрганизации
		|ПО ПланОбменаОсновнаяТаблица.Ссылка = ПланОбменаОрганизации.Ссылка
		|ГДЕ
		|(ПланОбменаОсновнаяТаблица.НачалоПериодаВыгрузкиДокументов <= &СвойствоОбъекта_Дата
		|	И (ПланОбменаОсновнаяТаблица.КонецПериодаВыгрузкиДокументов >= НАЧАЛОПЕРИОДА(&СвойствоОбъекта_Дата, ДЕНЬ)
		|		   ИЛИ ПланОбменаОсновнаяТаблица.КонецПериодаВыгрузкиДокументов = ДАТАВРЕМЯ(1,1,1)
		|		   )
		| )
		|[ОбязательныеУсловия]";
		
	ИначеЕсли СтандартноеПравило = "ФильтрПоИзмерениюОрганизация"
		ИЛИ СтандартноеПравило = "ФильтрПоРегистратору"
		ИЛИ СтандартноеПравило = "Перерасчет_ФильтрПоОбъектуПерерасчета" Тогда
		
		// Используем фильтр по значению из основного отбора набора записей.
		ПравилоРегистрации                                          = ТаблицаПравилРегистрации.Добавить();
		ПравилоРегистрации.ИмяПланаОбмена                           = ИмяПланаОбмена;
		ПравилоРегистрации.ОбъектМетаданныхИмя                      = ПолноеИмяОбъекта;
		ПравилоРегистрации.ЕстьОбработчикПередОбработкой            = Истина;
		ПравилоРегистрации.ЕстьОбработчикПослеОбработки             = Истина;
		ПравилоРегистрации.ПравилоПоСвойствамОбъектаПустое          = Истина;
		
		Если СтандартноеПравило = "ФильтрПоИзмерениюОрганизация" Тогда
			ИмяИзмеренияОсновногоОтбора = "Организация";
		ИначеЕсли СтандартноеПравило = "Перерасчет_ФильтрПоОбъектуПерерасчета" Тогда
			ИмяИзмеренияОсновногоОтбора = "ОбъектПерерасчета";
		Иначе
			ИмяИзмеренияОсновногоОтбора = "Регистратор";
		КонецЕсли;
		
		ПравилоРегистрации.ПослеОбработки = "
		|ИмяИзмерения = """ + ИмяИзмеренияОсновногоОтбора + """;
		|
		|//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
		|//Для указанного измерения объекта будет определен массив получателей, который будет возвращен в качестве итогового
		|
		|Получатели = ОпределитьПолучателей(Объект.Отбор[ИмяИзмерения].Значение, """ + ИмяПланаОбмена + """);
		|";
		
		ПравилоРегистрации.ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|ИЗ
		|ПланОбмена." + ИмяПланаОбмена + " КАК ПланОбменаОсновнаяТаблица
		|ГДЕ
		|Истина
		|[ОбязательныеУсловия]";
		
	ИначеЕсли СтандартноеПравило = "СправочникОрганизация_ФильтрДляСвязанныхДанных" Тогда
		
		// Непосредственный фильтр по переданному значению организации.
		ПравилоРегистрации                                          = ТаблицаПравилРегистрации.Добавить();
		ПравилоРегистрации.ИмяПланаОбмена                           = ИмяПланаОбмена;
		ПравилоРегистрации.ОбъектМетаданныхИмя                      = ПолноеИмяОбъекта;
		ПравилоРегистрации.ЕстьОбработчикПриОбработке               = Истина;
		ПравилоРегистрации.ЕстьОбработчикПриОбработкеДополнительный = Истина;
		ПравилоРегистрации.ПравилоПоСвойствамОбъектаПустое          = Истина;
		
		ПравилоРегистрации.ПриОбработке = "
		|ТекстЗапроса = ""ВЫБРАТЬ РАЗЛИЧНЫЕ ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|				|ИЗ
		|				|ПланОбмена." + ИмяПланаОбмена + " КАК ПланОбменаОсновнаяТаблица
		|				|ЛЕВОЕ СОЕДИНЕНИЕ
		|				|ПланОбмена." + ИмяПланаОбмена + ".Организации КАК ПланОбменаОрганизации
		|				|ПО ПланОбменаОсновнаяТаблица.Ссылка = ПланОбменаОрганизации.Ссылка
		|				|ГДЕ
		|				|((ПланОбменаОрганизации.Организация ЕСТЬ NULL
		|				|		   ИЛИ ПланОбменаОрганизации.Организация = &СвойствоОбъекта_Ссылка
		|				|		   )
		|				| )
		|				|[ОбязательныеУсловия]"";
		|ПараметрыЗапроса.Вставить(""Ссылка"", Объект.Ссылка);
		|";
		
		ПравилоРегистрации.ПриОбработкеДополнительный = "
		|Отказ = Истина;
		|";
		
		ПравилоРегистрации.ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|ИЗ
		|ПланОбмена." + ИмяПланаОбмена + " КАК ПланОбменаОсновнаяТаблица
		|ГДЕ
		|Истина
		|[ОбязательныеУсловия]";
	КонецЕсли;
	
КонецПроцедуры

Функция СтандартноеПравилоОбъекта(ПолноеИмяОбъекта)
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
	
	Если бит_АудиторскаяВыгрузкаПовтИсп.ЭтоУзелАудита()
		И бит_АудиторскаяВыгрузкаПовтИсп.ОбъектРазрешенДляВыгрузкиИзАудита(ПолноеИмяОбъекта) Тогда
		Возврат "ЗарегистироватьВГлавныйУзел";
	ИначеЕсли Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
		Возврат СтандартноеПравилоДокумента(МетаданныеОбъекта);
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта) Тогда
		Возврат СтандартноеПравилоРегистраСведений(МетаданныеОбъекта);
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(МетаданныеОбъекта)
		ИЛИ Метаданные.РегистрыБухгалтерии.Содержит(МетаданныеОбъекта) Тогда
		Возврат "ФильтрПоРегистратору";
	ИначеЕсли Метаданные.РегистрыРасчета.Содержит(МетаданныеОбъекта) Тогда
		Если Найти(ПолноеИмяОбъекта, ".Перерасчет.") = 0 Тогда
			Возврат "ФильтрПоРегистратору";
		Иначе
			Возврат "Перерасчет_ФильтрПоОбъектуПерерасчета";
		КонецЕсли;
	ИначеЕсли ПолноеИмяОбъекта = "Справочник.Организации" Тогда
		// При регистрации связанных "по-организации" данных, нужно отдельное правило (т.к. сам справочник может не участвовать в выгрузке).
		Возврат "СправочникОрганизация_ФильтрДляСвязанныхДанных";
 	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СтандартноеПравилоДокумента(МетаданныеОбъекта)
	
	Если МетаданныеОбъекта.Реквизиты.Найти("Организация") <> Неопределено Тогда
		Возврат "Документ_ФильтрПоДатеИОрганизацииШапки";
	Иначе
		Возврат "Документ_ФильтрПоДате";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СтандартноеПравилоРегистраСведений(МетаданныеОбъекта)
	
	ПодчиненРегистратору = (МетаданныеОбъекта.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору);
	
	Если ПодчиненРегистратору Тогда
		Возврат "ФильтрПоРегистратору";
	КонецЕсли;
	
	ИзмерениеОрганизация = МетаданныеОбъекта.Измерения.Найти("Организация");
	Если ИзмерениеОрганизация <> Неопределено
		И ИзмерениеОрганизация.ОсновнойОтбор Тогда
		Возврат "ФильтрПоИзмерениюОрганизация";
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
