#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	СтруктураТаблиц = ПодготовитьТаблицыДокумента();	
	
	ПроверкаТаблицыОС(СтруктураТаблиц.ОС,СтруктураШапкиДокумента,Отказ,Заголовок);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,СтруктураТаблиц,Отказ,Заголовок);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьШапкуДокумента();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнитьШапкуДокумента(ОбъектКопирования);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверим наличие дублей в табличной части "Основные средства".	
	СтруктураОбязательныхПолей = Новый Структура("ОсновноеСредство");
	
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект
	                                                                  , "ОсновныеСредства"
																	  , СтруктураОбязательныхПолей
																	  , Отказ);
																	  
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Заполнить параметры подбора.
// 
// Возвращаемое значение:
//  ПараметрыФормы - структура.
//
Функция ЗаполнитьПараметрыПодбора() Экспорт

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("Организация"		, Организация);                             
	ПараметрыФормы.Вставить("Режим"				, Перечисления.бит_му_РежимыПодбораВНА.ПеремещениеОС);
	ПараметрыФормы.Вставить("ДатаНачала"		, НачалоМесяца(Дата));
	ПараметрыФормы.Вставить("ДатаОкончания"		, КонецМесяца(Дата));
	ПараметрыФормы.Вставить("МОЛ"				, МОЛ);
	ПараметрыФормы.Вставить("Местонахождение"	, Подразделение);
	
	Возврат ПараметрыФормы;
	
КонецФункции

// Процедура - Заполнить основные средства.
//
// Параметры:
//  ВыбранноеЗначение.
//
Процедура ЗаполнитьОсновныеСредства(ВыбранноеЗначение) Экспорт

	ОписаниеТаблицы = ВыбранноеЗначение.Данные;
	ТаблицаДанных = бит_ОбщегоНазначения.РаспаковатьТаблицуИзМассива(ОписаниеТаблицы.ПереченьОбъектов,ОписаниеТаблицы.ПереченьОбъектов_Колонки);
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ОсновноеСредство", СтрокаТаблицы.ВНА);
		
		МассивСтрок = ОсновныеСредства.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрок.Количество() = 0 Тогда
			НайденнаяСтрока = Неопределено;
		Иначе
			НайденнаяСтрока = МассивСтрок[0];
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			НоваяСтрока = ОсновныеСредства.Добавить();
			НоваяСтрока.ОсновноеСредство = СтрокаТаблицы.ВНА;
			ПараметрыОС = ПолучитьПараметрыОС(НоваяСтрока.ОсновноеСредство);
			ЗаполнитьСтрокуТЧПоДанным(НоваяСтрока,ПараметрыОС);
			
		Иначе
			
			ТекстСообщения = НСтр("ru = 'Основное средство ""%1"" инв. №%2  уже подобрано в строке №%3.'; 
			                      |en = 'Fixed asset ""%1"" inv. №%2 is already matched in line №%3.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.ВНА, СтрокаТаблицы.ИнвентарныйНомер, НайденнаяСтрока.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли; 
		
		
	КонецЦикла; // По строкам таблицы данных

КонецПроцедуры

// Функция готовит таблицы документа для проведения.
// 
// Возвращаемое значение:
//   ТаблицаБДДС   - ТаблицаЗначений.
// 
Функция ПодготовитьТаблицыДокумента()  Экспорт
	
	СтруктураТаблиц = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка"             ,Ссылка);
	Запрос.УстановитьПараметр("ПустоеФизЛицо"      ,Справочники.ФизическиеЛица.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустоеПодразделение",Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойЦФО"          ,Справочники.Подразделения.ПустаяСсылка());
	Запрос.УстановитьПараметр("СостояниеПринято"   ,Перечисления.бит_му_СостоянияОС.ПринятоКУчету);
	Запрос.УстановитьПараметр("СостояниеВыбыло"    ,Перечисления.бит_му_СостоянияОС.СнятоСУчета);
	
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ТабЧасть.ОсновноеСредство КАК ОсновноеСредство,
	|	ТабЧасть.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТабЧасть.Местонахождение_старый = ТабЧасть.Местонахождение
	|			ТОГДА &ПустоеПодразделение
	|		ИНАЧЕ ТабЧасть.Местонахождение
	|	КОНЕЦ КАК Местонахождение,
	|	ВЫБОР
	|		КОГДА ТабЧасть.ЦФО_Старый = ТабЧасть.ЦФО
	|			ТОГДА &ПустойЦФО
	|		ИНАЧЕ ТабЧасть.ЦФО
	|	КОНЕЦ КАК ЦФО,
	|	ВЫБОР
	|		КОГДА ТабЧасть.МОЛ = ТабЧасть.МОЛ_Старый
	|			ТОГДА &ПустоеФизЛицо
	|		ИНАЧЕ ТабЧасть.МОЛ
	|	КОНЕЦ КАК МОЛ,
	|	Принятые.ДатаСостояния КАК ДатаПринятия,
	|	Выбывшие.ДатаСостояния КАК ДатаВыбытия
	|ИЗ
	|	Документ.бит_му_ПеремещениеОС.ОсновныеСредства КАК ТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СостоянияОС КАК Принятые
	|		ПО ТабЧасть.ОсновноеСредство = Принятые.ОсновноеСредство
	|			И ТабЧасть.Ссылка.Организация = Принятые.Организация
	|			И (Принятые.Состояние = &СостояниеПринято)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СостоянияОС КАК Выбывшие
	|		ПО ТабЧасть.ОсновноеСредство = Выбывшие.ОсновноеСредство
	|			И ТабЧасть.Ссылка.Организация = Выбывшие.Организация
	|			И (Выбывшие.Состояние = &СостояниеВыбыло)
	|ГДЕ
	|	ТабЧасть.Ссылка = &Ссылка
	|	И (ТабЧасть.Местонахождение_старый <> ТабЧасть.Местонахождение
	|			ИЛИ ТабЧасть.МОЛ_Старый <> ТабЧасть.МОЛ
	|			ИЛИ ТабЧасть.ЦФО_Старый <> ТабЧасть.ЦФО)";
					
	РезТаблица = Запрос.Выполнить().Выгрузить();
	
	СтруктураТаблиц.Вставить("ОС",РезТаблица);
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицуБДДС()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыОС(ОсновноеСредство)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация"     ,Организация);
	СтруктураПараметров.Вставить("ОсновноеСредство",ОсновноеСредство);
	СтруктураПараметров.Вставить("МоментВремени"   ,?(ЭтоНовый(),КонецДня(Дата),МоментВремени()));
	
	ПараметрыВНА = Новый Массив;
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.Местонахождение_ОС);
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.МОЛ_ОС);
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.ЦФО_ОС);
	
	СтруктураПараметров.Вставить("ПараметрыВНА",ПараметрыВНА);
	
	РезЗначения = бит_му_ВНА.ДанныеПараметровВНА(СтруктураПараметров,"Соответствие");
	
	Возврат РезЗначения;

КонецФункции // ПолучитьПараметрыОС()

Процедура ЗаполнитьСтрокуТЧПоДанным(ТекущаяСтрока,РезЗначения)
	
	Если РезЗначения <> Неопределено 
		И ТекущаяСтрока <> Неопределено Тогда
		
		ПараметрыОС = РезЗначения[ТекущаяСтрока.ОсновноеСредство];
		
		Если ПараметрыОС <> Неопределено Тогда
			
			Для каждого КиЗ Из ПараметрыОС Цикл
				
				ТекущееЗначение    = КиЗ.Значение;
				Параметр           = КиЗ.Ключ;
				ИмяПараметра       = ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.ПолучитьИмяПредопределенного(Параметр); 
				ИмяРеквизита       = СтрЗаменить(ИмяПараметра,"_ОС","");
				ИмяРеквизитаСтарый = ИмяРеквизита+"_Старый";
				
				ТекущаяСтрока[ИмяРеквизита]        = ТекущееЗначение;
				ТекущаяСтрока[ИмяРеквизитаСтарый]  = ТекущееЗначение;
				
			КонецЦикла; // По параметрам 	
			
		КонецЕсли; // Есть параметры
		
	КонецЕсли; 

КонецПроцедуры 

Процедура ЗаполнитьШапкуДокумента(ОбъектКопирования=Неопределено)
	
	// Заполним шапку документа значениями по умолчанию.
    бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ОбъектКопирования);
	
	Если НЕ ОбъектКопирования = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;  
		
КонецПроцедуры

// Процедура проверят таблицу ОС на наличие принятые либо выбывшие ОС.
// 
// Параметры:
//  ТаблицаОС  - ТаблицаЗначений
//  Отказ      - Булево
//  Заголовок  - Строка
// 
Процедура ПроверкаТаблицыОС(ТаблицаОС,СтруктураШапкиДокумента,Отказ,Заголовок)

	КолонкиТаблицы = ТаблицаОС.Колонки;
	Для каждого СтрокаТаблицы Из ТаблицаОС Цикл
		
		бит_му_ВНА.ПроверитьСтрокуТаблицыОС(СтрокаТаблицы,КолонкиТаблицы,СтруктураШапкиДокумента,Отказ,Заголовок);
		
	КонецЦикла; 

КонецПроцедуры // ПроверкаТаблицыОС()

// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,СтруктураТаблиц,Отказ,Заголовок)
	
	// Движения по регистру сведений бит_му_ПараметрыОС.
	КолонкиТаблицы = СтруктураТаблиц.ОС.Колонки;
	ТаблицаДанных  = СтруктураТаблиц.ОС;
	НаборЗаписей   = Движения.бит_му_ПараметрыОС;
	
	ВидыПараметров = бит_му_ВНА.ПолучитьВидыПараметров(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.ОсновныеСредства);
	бит_му_ВНА.ЗаписатьПараметрыВНА(НаборЗаписей,СтруктураШапкиДокумента,ТаблицаДанных,ВидыПараметров,"ОС");
	
КонецПроцедуры // ДвиженияПоРегистрам()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли