
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	ПодготовитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаПорталВГОВыбор(Элемент)
	
	ОбработатьВыбор(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаФСДВыбор(Элемент)
	
	ОбработатьВыбор(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаКонсолидацияВыбор(Элемент)
	
	ОбработатьВыбор(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыбор(Элемент)
	
	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	НавигационнаяСсылкаБлока = Неопределено;
	Если НавигационныеСсылки.Свойство(ИмяЭлемента, НавигационнаяСсылкаБлока) 
		И ЗначениеЗаполнено(НавигационнаяСсылкаБлока) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаБлока);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФорму()

	// Готовим структуру из метаданных, чтобы проверка конфигурации реагировала на изменения.
	ОбъектыПодсистемы = Новый Структура;
	
	// Справочники.
	ОбъектыПодсистемы.Вставить("ПериметрыКонсолидации",		Метаданные.Справочники.бит_му_ПериметрыКонсолидации);
	ОбъектыПодсистемы.Вставить("СоставИнвесторов",			Метаданные.Справочники.бит_му_СоставИнвесторов);
	ОбъектыПодсистемы.Вставить("НастройкиЭлиминации",		Метаданные.Справочники.бит_му_НастройкиЭлиминации);
	ОбъектыПодсистемы.Вставить("ОперацииВГО",				Метаданные.Справочники.бит_вго_ОперацииВГО);
	ОбъектыПодсистемы.Вставить("ПравилаТрансляции",			Метаданные.Справочники.бит_ПравилаТрансляции);
	ОбъектыПодсистемы.Вставить("НастройкиАктовСверкиВГО",	Метаданные.Справочники.бит_вго_НастройкиАктовСверкиВГО);
	ОбъектыПодсистемы.Вставить("ВидыФормСбораДанных",		Метаданные.Справочники.бит_ВидыФормСбораДанных);
	
	// Документы.
	ОбъектыПодсистемы.Вставить("КонсолидационныеКорректировкиНовый",Метаданные.Документы.бит_му_КонсолидационныеКорректировкиНовый);
	ОбъектыПодсистемы.Вставить("Элиминация",						Метаданные.Документы.бит_му_Элиминация);
	ОбъектыПодсистемы.Вставить("СторноЭлиминационныхНачислений",	Метаданные.Документы.бит_му_СторноЭлиминационныхНачислений);
	ОбъектыПодсистемы.Вставить("АктСверкиВГО",						Метаданные.Документы.бит_вго_АктСверкиВГО);
	ОбъектыПодсистемы.Вставить("ПротоколРасхождений",				Метаданные.Документы.бит_вго_ПротоколРасхождений);
	ОбъектыПодсистемы.Вставить("ПодтверждениеСверкиВГО",			Метаданные.Документы.бит_вго_ПодтверждениеСверкиВГО);
	ОбъектыПодсистемы.Вставить("ФормаСбораДанных",					Метаданные.Документы.бит_ФормаСбораДанных);
	
	// Регистры сведений.
	ОбъектыПодсистемы.Вставить("СобственныеКонтрагенты",			Метаданные.РегистрыСведений.бит_СобственныеКонтрагенты);
	ОбъектыПодсистемы.Вставить("НастройкиПроведенияСверкиВГО",		Метаданные.РегистрыСведений.бит_вго_НастройкиПроведенияСверкиВГО);
	ОбъектыПодсистемы.Вставить("СоответствиеОперацийВГО",			Метаданные.РегистрыСведений.бит_вго_СоответствиеОперацийВГО);
	ОбъектыПодсистемы.Вставить("ЗакрытиеРедактированияСверкиВГО",	Метаданные.РегистрыСведений.бит_вго_ЗакрытиеРедактированияСверкиВГО);

	// Обработки.
  	ОбъектыПодсистемы.Вставить("ПорталСверкиВГО", Метаданные.Обработки.бит_ПорталСверкиВГО);
	
	// Отчеты.
  	ОбъектыПодсистемы.Вставить("СтатусСверкиВГО", Метаданные.Отчеты.бит_вго_СтатусСверкиВГО);
	
	// Формирование навигационных ссылок и проверка доступа по функциональным опциям.
	НедоступныеОбъекты = Новый Массив;
	Для Каждого ОбъектПодсистемы Из ОбъектыПодсистемы Цикл
		НавигационнаяСсылкаБлока = ""; 
		ОбъектДоступен = ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОбъектПодсистемы.Значение);
		Если ОбъектДоступен Тогда
			НавигационнаяСсылкаБлока = ПолучитьНавигационнуюСсылку(ОбъектПодсистемы.Значение);
		Иначе
			НедоступныеОбъекты.Добавить(ОбъектПодсистемы.Ключ);
		КонецЕсли;
		ОбъектыПодсистемы[ОбъектПодсистемы.Ключ] = НавигационнаяСсылкаБлока;
	КонецЦикла;
	НавигационныеСсылки = Новый ФиксированнаяСтруктура(ОбъектыПодсистемы);
	
	СхемаКонсолидация	= Обработки.бит_ПанельФункций_Консолидация.ПолучитьМакет("СхемаКонсолидация");
	СхемаПорталВГО		= Обработки.бит_ПанельФункций_Консолидация.ПолучитьМакет("СхемаПорталВГО");
	СхемаФСД			= Обработки.бит_ПанельФункций_Консолидация.ПолучитьМакет("СхемаФСД");
	
	// Ссылка может быть одновременно на разных схемах.
	Для Каждого НедоступныйОбъект Из НедоступныеОбъекты Цикл
		ЭлементыСхемы = СхемаКонсолидация.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
		ЭлементыСхемы = СхемаПорталВГО.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
		ЭлементыСхемы = СхемаФСД.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект)
	
	ЭлементСхемы = ЭлементыСхемы[НедоступныйОбъект];
	ЭлементСхемы.ЦветФона = ЦветаСтиля.бит_ЦветНедоступногоПоля;
	
КонецПроцедуры

#КонецОбласти