
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	Если фОтказ Тогда	
		Возврат;    	
	КонецЕсли; 
	    	
	Объект.ПланСчетовПриемник = Параметры.ПланСчетовПриемник;
	Если Не ЗначениеЗаполнено(Объект.ПланСчетовПриемник) Тогда    				
		фОтказ = Истина;
		Возврат;			
	КонецЕсли;
	
	МетаданныеПланаСчетовПриемник = Метаданные.ПланыСчетов[Объект.ПланСчетовПриемник];
	Если МетаданныеПланаСчетовПриемник = Неопределено Тогда
		фОтсуствуетПланСчетовПриемник = Истина;
		фОтказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Синоним плана счетов приемник
	ПредставлениеПланСчетовПриемник = бит_ПраваДоступа.ПолучитьСинонимОбъектаСистемы(МетаданныеПланаСчетовПриемник);
	
	ЗаполнитьКэшЗначений();
	УстановитьСписокПлановСчетовДляВыбора(Объект.ПланСчетовПриемник);
		
	ЗакрыватьПриВыборе = Ложь;
	
	Если Параметры.ЗаполнениеПоУмолчанию Тогда
		Объект.ЗаполнениеПоУмолчанию = Параметры.ЗаполнениеПоУмолчанию;
		ЗаполнитьСписокСчетовПоУмолчанию();
	Иначе
		ИнинциализироватьСКД();
	КонецЕсли;
		
	УстановитьВидимостьДоступность();
	
	фВыполнятьВТранзакции = Истина;
	фВыбиратьПодчиненные  = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Если фОтказ Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ПланСчетовПриемник) Тогда				
			ТекстОшибокПриОткрытии = НСтр("ru='Не указан ""План счетов приемник"". Данная обработка вызывается из других процедур конфигурации. Вручную ее вызывать запрещено.';
										  |en='Unknown ""Chart of the receiver."" This processing is called from the other configuration procedures. Manually, it is forbidden to cause.'");
	        ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибокПриОткрытии);
		КонецЕсли;
		
		Если фОтсуствуетПланСчетовПриемник Тогда 			
			ТекстОшибокПриОткрытии = НСтр("ru='В системе не обнаружен план счетов %1.';
										  |en='The system has not detected the chart of accounts %1.'");
			ТекстОшибокПриОткрытии = СтрШаблон(ТекстОшибокПриОткрытии, Объект.ПланСчетовПриемник);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибокПриОткрытии);			
		КонецЕсли;
		
		Отказ = Истина;
		Возврат;	
		
	КонецЕсли;
	
	// Установим заголовок формы.
	УстановитьЗаголовокФормы(); 
	
	Элементы.ПланСчетовСписокВыполнятьВТранзакции.Пометка = фВыполнятьВТранзакции;
	Элементы.ПланСчетовСписокВыбиратьПодчиненные.Пометка  = фВыбиратьПодчиненные;
	
	Если Объект.ЗаполнениеПоУмолчанию Тогда	
		бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ПланСчетовСписок, 
			ПланСчетовСписок.ПолучитьЭлементы(), Истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
КонецПроцедуры // ПередЗакрытием()

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	фРежимОтображенияСписка = СтрЗаменить(ТРег(Элементы.ПланСчетовСписок.Отображение), " ", "");
	Настройки.Вставить("фРежимОтображенияСписка", фРежимОтображенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если фРежимОтображенияСписка <> Неопределено И фРежимОтображенияСписка <> "" Тогда
		Элементы.ПланСчетовСписок.Отображение = ОтображениеТаблицы[фРежимОтображенияСписка];
	КонецЕсли;
					
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеПланСчетовИсточникПриИзменении(Элемент)
	
	ИзменениеПланаСчетовИсточникСервер();
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ПланСчетовСписок, ПланСчетовСписок.ПолучитьЭлементы(), Истина);
	
	// Установим заголовок формы.
	УстановитьЗаголовокФормы();
	
	// Видимость и доступность элементо формы
	УстановитьВидимостьДоступность();
	
КонецПроцедуры // ПредставлениеПланСчетовИсточникПриИзменении()

&НаКлиенте
Процедура ПредставлениеПланСчетовИсточникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Объект.ПланСчетовИсточник = ВыбранноеЗначение;
		
КонецПроцедуры // ПредставлениеПланСчетовИсточникОбработкаВыбора()

&НаКлиенте
Процедура ПредставлениеПланСчетовИсточникОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // ПредставлениеПланСчетовИсточникОчистка()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланСчетовСписок

&НаКлиенте
Процедура ПланСчетовСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Ссылка) Тогда
		ПоказатьЗначение( , Элемент.ТекущиеДанные.Ссылка);	
	КонецЕсли;
	
КонецПроцедуры // ПланСчетовСписокВыбор()

&НаКлиенте
Процедура ПланСчетовСписокВыбратьПриИзменении(Элемент)
	
	Если Не фВыбиратьПодчиненные Тогда
	 	Возврат;	
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ПланСчетовСписок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда	
		Возврат;	
	КонецЕсли;
	
	ПроставитьФлажкиДляПодчиненныхСчетов(ТекущиеДанные.ПолучитьИдентификатор());	
	
КонецПроцедуры // ПланСчетовСписокВыбратьПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокСчетов(Команда)
	
	ОбновитьСписокСчетовСервер();
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ПланСчетовСписок, ПланСчетовСписок.ПолучитьЭлементы(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСчета(Кнопка)
	
	Если Объект.ЗаполнениеПоУмолчанию Тогда
		ТекстВопроса = НСтр("ru='Будет выполнено добавление счетов в ""%1"". Продолжить?';
							|en='Accounts will be added to ""%1"". Continue?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, ПредставлениеПланСчетовПриемник);
	Иначе		
		ТекстВопроса = НСтр("ru='Будет выполнено добавление счетов из ""%1"" в ""%2"". Продолжить?';
							|en='Accounts from ""%1"" will be added to ""%2"". Continue?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, 
						Элементы.ПредставлениеПланСчетовИсточник.СписокВыбора.НайтиПоЗначению(ПредставлениеПланСчетовИсточник).Представление, 
						ПредставлениеПланСчетовПриемник); 
	КонецЕсли;
					
	Оповещение = Новый ОписаниеОповещения("ВопросОДобавленииСчетовЗавершение", ЭтотОбъект); 
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
		
КонецПроцедуры

// Процедура - обработчик оповещения "ВопросОДобавленииСчетовЗавершение".
// 
&НаКлиенте
Процедура ВопросОДобавленииСчетовЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		КоличествоДобавленных = 0;
		ДобавитьСчетаСервер(КоличествоДобавленных);
		
		Если КоличествоДобавленных = 0 Тогда
			
			ТекстСообщения = НСтр("ru='Не выбранны счета для добавления.';en='Not selected accounts to add.'");
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
						
		Иначе
			
			ТекстСообщения = НСтр("ru='Заполнение завершено.';en='Filling in completed.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ПроставитьФлажкиДляВсехСчетов(Ложь);
			
			ОповеститьОбИзменении(Тип("ПланСчетовСсылка." + Объект.ПланСчетовПриемник));
			
		КонецЕсли;
		
	КонецЕсли;     
	
КонецПроцедуры // ВопросОДобавленииСчетовЗавершение()
 
&НаКлиенте
Процедура ВыполнятьВТранзакции(Команда)
	
	фВыполнятьВТранзакции = Не фВыполнятьВТранзакции;
	Элементы.ПланСчетовСписокВыполнятьВТранзакции.Пометка = фВыполнятьВТранзакции;
	
КонецПроцедуры // ВыполнятьВТранзакции()

&НаКлиенте
Процедура ВыбиратьПодчиненные(Команда)
	
	фВыбиратьПодчиненные = Не фВыбиратьПодчиненные;
	Элементы.ПланСчетовСписокВыбиратьПодчиненные.Пометка = фВыбиратьПодчиненные;
	
КонецПроцедуры // ВыбиратьПодчиненные()
                      
&НаКлиенте
Процедура ПланСчетовСписок_СнятьВсе(Команда)
	
	ПроставитьФлажкиДляВсехСчетов(Ложь);
	
КонецПроцедуры // ПланСчетовСписок_СнятьВсе()

&НаКлиенте
Процедура ПланСчетовСписок_УстановитьВсе(Команда)
	
	ПроставитьФлажкиДляВсехСчетов(Истина);
	
КонецПроцедуры // ПланСчетовСписок_УстановитьВсе()

&НаКлиенте
Процедура ПланСчетовСписок_Инвертировать(Команда)
	
	ПроставитьФлажкиДляВсехСчетов();
	
КонецПроцедуры // ПланСчетовСписок_Инвертировать()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СерверныеПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура ЗаполнитьКэшЗначений()

	ФКэшЗначений = Новый Структура;
	
	фКэшЗначений.Вставить("СоответствиеВидовСубконтоПриемника", СформироватьСоответствиеВидовСубконто());	

КонецПроцедуры // ЗаполнитьКэшЗначений()

// Процедура формирует список планов счетов доступных для выбора.
// 
// Параметры:
//  ПланСчетовПриемник - Строка
// 
&НаСервере
Процедура УстановитьСписокПлановСчетовДляВыбора(ПланСчетовПриемник)
	
	ПланыСчетовМенеджер = Метаданные.ПланыСчетов;
	КартинкаПланСчетов  = БиблиотекаКартинок.ПланСчетовОбъект;
	
	Для Каждого ТекМетаданныеПланаСчетов Из ПланыСчетовМенеджер Цикл
		
		Если Не ТекМетаданныеПланаСчетов.Имя = ПланСчетовПриемник Тогда
			
			// Получим синоним плана счетов.
			СинонимПланаСчетов = бит_ПраваДоступа.ПолучитьСинонимОбъектаСистемы(ТекМетаданныеПланаСчетов);
			Элементы.ПредставлениеПланСчетовИсточник.СписокВыбора.Добавить(ТекМетаданныеПланаСчетов.Имя, СинонимПланаСчетов,, КартинкаПланСчетов);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ПредставлениеПланСчетовИсточник.СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры // УстановитьСписокПлановСчетовДляВыбора()

// Процедура осуществляет управление видимостью/доступностью элементов управления формы.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура УстановитьВидимостьДоступность()

	ИсточникУказан = ЗначениеЗаполнено(Объект.ПланСчетовИсточник) ИЛИ Объект.ЗаполнениеПоУмолчанию;
	ЗаполнениеПоУмолчанию = Объект.ЗаполнениеПоУмолчанию;
	
	Элементы.ПредставлениеПланСчетовИсточник.Видимость 		= НЕ ЗаполнениеПоУмолчанию;
	Элементы.КомпоновщикПользовательскиеНастройки.Видимость = НЕ ЗаполнениеПоУмолчанию;
	
	Элементы.ФормаОбновитьСписокСчетов.Доступность   		  = ИсточникУказан ИЛИ ЗаполнениеПоУмолчанию;
	Элементы.ПланСчетовСписокОбновитьСписокСчетов.Доступность = ИсточникУказан ИЛИ ЗаполнениеПоУмолчанию;
	  	
	Элементы.ПланСчетовСписок.Доступность 					  = ИсточникУказан ИЛИ ЗаполнениеПоУмолчанию;
	Элементы.ПланСчетовСписокКоманднаяПанель.Доступность      = ИсточникУказан ИЛИ ЗаполнениеПоУмолчанию;
	
	Элементы.КомпоновщикПользовательскиеНастройки.Доступность 				 = ИсточникУказан;
	Элементы.КомпоновщикПользовательскиеНастройкиКоманднаяПанель.Доступность = ИсточникУказан;
	
	Элементы.ПланСчетовСписокГруппаСубконто.Видимость = ЗаполнениеПоУмолчанию;
			
КонецПроцедуры

// ----------------------------------------------------------------------

&НаСервере
Функция СформироватьСоответствиеВидовСубконто()

	СоответствиеВидовСубконтоПриемника = Новый Соответствие;
	
	МетаданныеПланаСчетовПриемник = Метаданные.ПланыСчетов[Объект.ПланСчетовПриемник];
	
	ВидыСубконтоПриемникМенеджер = ПланыВидовХарактеристик[МетаданныеПланаСчетовПриемник.ВидыСубконто.Имя];
	ВыборкаВидыСубконтоПриемник  = ВидыСубконтоПриемникМенеджер.Выбрать();
			
	Пока ВыборкаВидыСубконтоПриемник.Следующий() Цикл
		
		ТекСсылка 	   = ВыборкаВидыСубконтоПриемник.Ссылка;
		ТипЗнчСубконто = ВыборкаВидыСубконтоПриемник.ТипЗначения;
		
		ВидСубконтоПриемника = СоответствиеВидовСубконтоПриемника.Получить(ТипЗнчСубконто);
		Если ВидСубконтоПриемника = Неопределено Тогда
			
			СоответствиеВидовСубконтоПриемника.Вставить(ТипЗнчСубконто, ТекСсылка);
			
		ИначеЕсли ТипЗнч(ВидСубконтоПриемника) = Тип("Массив") Тогда
			
			ВидСубконтоПриемника.Добавить(ТекСсылка);
			СоответствиеВидовСубконтоПриемника.Вставить(ТипЗнчСубконто, ВидСубконтоПриемника);
			
		Иначе
			
			НовМассивВидов = Новый Массив;
			НовМассивВидов.Добавить(ВидСубконтоПриемника);
			НовМассивВидов.Добавить(ТекСсылка);
			СоответствиеВидовСубконтоПриемника.Вставить(ТипЗнчСубконто, НовМассивВидов); 
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СоответствиеВидовСубконтоПриемника;	

КонецФункции // СформироватьСоответствиеВидовСубконто()

// Процедура проставляет флажки у подчиненных счетов.
// 
// Параметры:
//  ЗначениеФлага - Булево
//  Ид 			  - Число
// 
&НаСервере
Процедура ПроставитьФлажкиДляПодчиненныхСтрокДерева(ЗначениеФлага, ТекущиеДанные)
	
	ЗначениеФлагаЗаполнено = ЗначениеЗаполнено(ЗначениеФлага); 
	
	Для каждого СтрокаСчет Из ТекущиеДанные.ПолучитьЭлементы() Цикл
	 	СтрокаСчет.Выбрать = ?(ЗначениеФлагаЗаполнено, ЗначениеФлага, Не СтрокаСчет.Выбрать); 
		ПроставитьФлажкиДляПодчиненныхСтрокДерева(ЗначениеФлага, СтрокаСчет);	
	КонецЦикла;

КонецПроцедуры

// Процедура проставляет флажки у подчиненных счетов.
// 
// Параметры:
//  Ид - Число
// 
&НаСервере
Процедура ПроставитьФлажкиДляПодчиненныхСчетов(Ид = Неопределено)

	ТекущиеДанные = ?(Ид = Неопределено, ПланСчетовСписок, ПланСчетовСписок.НайтиПоИдентификатору(Ид));
	ПроставитьФлажкиДляПодчиненныхСтрокДерева(ТекущиеДанные.Выбрать, ТекущиеДанные);

КонецПроцедуры

// Процедура проставляет флажки у подчиненных счетов.
// 
// Параметры:
//  ЗначениеФлага - Булево Или Неопределено (По умолчанию = Неопределено).
// 
&НаСервере
Процедура ПроставитьФлажкиДляВсехСчетов(ЗначениеФлага = Неопределено)

	ПроставитьФлажкиДляПодчиненныхСтрокДерева(ЗначениеФлага, ПланСчетовСписок);

КонецПроцедуры

// ----------------------------------------------------------------------

// Процедура обрабатывает изменение плана счетов источник.
// 
&НаСервере
Процедура ИзменениеПланаСчетовИсточникСервер()
	
	ИнинциализироватьСКД();
	
	ОбновитьСписокСчетовСервер();

КонецПроцедуры

// Процедура добавляет счета в список.
// 
// Параметры:
//  ВерхнийУровеньВыборки.
//  УзелДерева.
// 
&НаСервере
Процедура ДобавитьСчетаВСписок(ВерхнийУровеньВыборки, УзелДерева)

	ВыборкаЗапроса = ВерхнийУровеньВыборки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);		
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		НоваяСтрока = УзелДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗапроса);
		НоваяСтрока.Картинка = БиблиотекаКартинок.ПланСчетовОбъект;
		УстановитьКраткийВидСчета(ВыборкаЗапроса.ВидСчета, НоваяСтрока.ВидКоротко);
		
		ДобавитьСчетаВСписок(ВыборкаЗапроса, НоваяСтрока.ПолучитьЭлементы());
		
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокСчетовСервер()
	
	КореньДерева = ПланСчетовСписок.ПолучитьЭлементы();
	КореньДерева.Очистить();
	
	Если Объект.ЗаполнениеПоУмолчанию Тогда
		ЗаполнитьСписокСчетовПоУмолчанию();
	Иначе
		ЗапросСКД 		 = ПолучитьЗапросСКД(); 	
		РезультатЗапроса = ЗапросСКД.Выполнить();		
		Если РезультатЗапроса.Пустой() Тогда		
			ТекстСообщения = НСтр("ru='Нет данных, удовлетворяющих отбору.';en='No data satisfying the selection.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
		Иначе		
			ДобавитьСчетаВСписок(РезультатЗапроса, КореньДерева);				
		КонецЕсли;
	КонецЕсли;	
	
	// Сортировка
	ДеревоПСС = РеквизитФормыВЗначение("ПланСчетовСписок");
	СтрокиДерева = ДеревоПСС.Строки;
	Если СтрокиДерева.Количество() > 0 Тогда
		СтрокиДерева.Сортировать("Порядок", Истина);	
	КонецЕсли;
	ЗначениеВДанныеФормы(ДеревоПСС, ПланСчетовСписок);
   	
КонецПроцедуры

// ----------------------------------------------------------------------
// Добвление счетов в приемник

// Функция получает структуру данных счета источника для заполнения счета приемника.
// 
// Параметры:
//  СчетИсточникСсылка 		      - ПланСчетовСсылка.
//  СтруктураПараметров			  - Структура
//  								   (ПланСчетовПриемникМенеджер	  - ПланСчетовМенеджер
//  									МетаданныеПланаСчетовПриемник - ПланСчетовМетаданные
//  									МетаданныеПланаСчетовИсточник - ПланСчетовМетаданные).
// 
// Возвращаемое значение:
//  ДанныеСчетаИсточника - Структура.
// 
&НаСервере
Функция ДанныеСчетаИсточника(СчетИсточникСсылка, СтруктураПараметров)
											 
	// Получим свойства плана счетов источника из метаданных.
	РеквизитыИсточника	   = СтруктураПараметров.МетаданныеПланаСчетовИсточник.Реквизиты;
	ПризнакиУчетаИсточника = СтруктураПараметров.МетаданныеПланаСчетовИсточник.ПризнакиУчета;
	// Ищем родителя счета приемника по коду родителя счета источника.
	РодительСчетаПриемника = СтруктураПараметров.ПланСчетовПриемникМенеджер.НайтиПоКоду(СчетИсточникСсылка.Родитель.Код);
	
	ДанныеСчетаИсточника = Новый Структура;
	
	ДанныеСчетаИсточника.Вставить("Код"			   , СчетИсточникСсылка.Код);
	ДанныеСчетаИсточника.Вставить("Порядок"		   , СчетИсточникСсылка.Порядок);
	ДанныеСчетаИсточника.Вставить("Наименование"   , СчетИсточникСсылка.Наименование);
	ДанныеСчетаИсточника.Вставить("Вид"			   , СчетИсточникСсылка.Вид);
	ДанныеСчетаИсточника.Вставить("Забалансовый"   , СчетИсточникСсылка.Забалансовый);  
	ДанныеСчетаИсточника.Вставить("ПометкаУдаления", СчетИсточникСсылка.ПометкаУдаления);
	ДанныеСчетаИсточника.Вставить("Родитель"	   , РодительСчетаПриемника);
	
	Для Каждого ТекРеквизит Из РеквизитыИсточника Цикл
		ИмяТекРеквизита = ТекРеквизит.Имя;
		ДанныеСчетаИсточника.Вставить(ИмяТекРеквизита, СчетИсточникСсылка[ИмяТекРеквизита]);
	КонецЦикла;
	
	Для Каждого ТекПризнак Из ПризнакиУчетаИсточника Цикл
		ИмяТекПризнака = ТекПризнак.Имя;
		ДанныеСчетаИсточника.Вставить(ИмяТекПризнака, СчетИсточникСсылка[ИмяТекПризнака]);
	КонецЦикла;
	
	Возврат ДанныеСчетаИсточника;
	
КонецФункции

// Процедура добавляет счета 
// 
// Параметры:
//  УзелДерева            - ДанныеФормыЭлементКоллекции.
//  КоличествоДобавленных - Число.
//  ЕстьОшибки			  - Булево.
//  СтруктураПараметров   - Структура
//  								   (ПланСчетовПриемникМенеджер	  	 - ПланСчетовМенеджер
//  									МетаданныеПланаСчетовПриемник 	 - ПланСчетовМетаданные
//  									МетаданныеПланаСчетовИсточник 	 - ПланСчетовМетаданные
//                                      ЕстьНаименованиеПолноеУПриемника - Булево
// 										МаскаКодаИсточник  				 - Строка
// 										МаскаКодаПриемник 				 - Строка).
// 
&НаСервере
Процедура ДобавитьСчет(СтрокаДерева, КоличествоДобавленных, ЕстьОшибки, СтруктураПараметров)
	
	Если Объект.ЗаполнениеПоУмолчанию Тогда
		ДанныеИсточник = СтрокаДерева.ДанныеМакета;
		РодительКод = ДанныеИсточник.РодительКод;
	Иначе		
		СчетИсточникСсылка = СтрокаДерева.Ссылка;
		ДанныеИсточник = ДанныеСчетаИсточника(СчетИсточникСсылка, СтруктураПараметров);
		РодительСсылка = бит_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетИсточникСсылка, "Родитель");
		Если ЗначениеЗаполнено(РодительСсылка) Тогда
			РодительКод = бит_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РодительСсылка, "Код");
		Иначе	
			РодительКод = "";
		КонецЕсли;			
	КонецЕсли;			
	
	МетаданныеПланаСчетовПриемник 	 = СтруктураПараметров.МетаданныеПланаСчетовПриемник;
	ПланСчетовПриемникМенеджер 		 = СтруктураПараметров.ПланСчетовПриемникМенеджер;
	МаскаКодаИсточник 		   		 = СтруктураПараметров.МаскаКодаИсточник;
	МаскаКодаПриемник 		   		 = СтруктураПараметров.МаскаКодаПриемник;
	ЕстьНаименованиеПолноеУПриемника = СтруктураПараметров.ЕстьНаименованиеПолноеУПриемника;
															   														   
	// Преобразуем данные, если маски не равны

	Если МаскаКодаИсточник <> МаскаКодаПриемник Тогда
		ДанныеИсточник.Вставить("РодительКод", РодительКод);
		РегистрыСведений.бит_МаскиКодов.ПреобразоватьДанныеПоМаскеКода(ДанныеИсточник, МаскаКодаПриемник);
		РодительСчетаПриемника = ПланСчетовПриемникМенеджер.НайтиПоКоду(РодительКод);
		ДанныеИсточник.Вставить("Родитель", РодительСчетаПриемника);
	ИначеЕсли ДанныеИсточник.Родитель = Неопределено И ЗначениеЗаполнено(РодительКод) Тогда
		РодительСчетаПриемника = ПланСчетовПриемникМенеджер.НайтиПоКоду(РодительКод);
		ДанныеИсточник.Вставить("Родитель", РодительСчетаПриемника);
	КонецЕсли;

	// Ищем счет приемник по коду счета источника.
	СчетПриемникСсылка = ПланСчетовПриемникМенеджер.НайтиПоКоду(ДанныеИсточник.Код);

	Если ЗначениеЗаполнено(СчетПриемникСсылка) Тогда
		СчетПриемникОбъект = СчетПриемникСсылка.ПолучитьОбъект();
	Иначе
		СчетПриемникОбъект = ПланСчетовПриемникМенеджер.СоздатьСчет();
	КонецЕсли;
				
	// Заполним значения счета приемника.
	ЗаполнитьЗначенияСвойств(СчетПриемникОбъект, ДанныеИсточник);

	// Если у счета приемника есть наименование полное и оно не заполнено, тогда.
	Если ЕстьНаименованиеПолноеУПриемника И Не ЗначениеЗаполнено(СчетПриемникОбъект.НаименованиеПолное) Тогда 			
		// Заполняем из наименования.
		СчетПриемникОбъект.НаименованиеПолное = СчетПриемникОбъект.Наименование; 			
	КонецЕсли;

	// Заполним виды субконто счета приемника.
	СчетПриемникОбъект.ВидыСубконто.Очистить();

	Если Объект.ЗаполнениеПоУмолчанию Тогда
		
		// Субконто для механизма заполнения по умолчанию из макета.
		СтруктураПараметровСчета = бит_БухгалтерскийУчет.ПолучитьДанныеПараметраКоманды(Объект.ПланСчетовПриемник);	
		ИмяВидовСубконто = СтруктураПараметровСчета.ИмяВидаСубконто;
		ВидыСубконтоМенеджер = ПланыВидовХарактеристик[ИмяВидовСубконто];
		
		ПризнакиУчетаСубконто 	 		= МетаданныеПланаСчетовПриемник.ПризнакиУчетаСубконто;
		ЕстьСуммовойУчетСубконто 		= ПризнакиУчетаСубконто.Найти("Суммовой") <> Неопределено;
		ЕстьВалютныйУчетСубконто 		= ПризнакиУчетаСубконто.Найти("Валютный") <> Неопределено;
		ЕстьКоличественныйУчетСубконто 	= ПризнакиУчетаСубконто.Найти("Количественный")<> Неопределено;
		СчетВалютный			 		= ?(МетаданныеПланаСчетовПриемник.ПризнакиУчета.Найти("Валютный") = Неопределено, Ложь, СчетПриемникОбъект.Валютный);
		СчетКоличественный			 	= ?(МетаданныеПланаСчетовПриемник.ПризнакиУчета.Найти("Количественный") = Неопределено, Ложь, СчетПриемникОбъект.Количественный);
		
		КоличествоСубконто = 4;
        Для Сч = 1 По КоличествоСубконто Цикл
            
            Имя           = "Субконто" + Сч;
            ТолькоОбороты = ДанныеИсточник["ОбСубконто" + Сч];
            
            Если ТипЗнч(ДанныеИсточник[Имя]) = Тип("Строка") Тогда
                // При загрузке из макета приходит строка.
                ИмяСубконто        = ДанныеИсточник[Имя];	
                ТекущийВидСубконто = Неопределено;
                Если НЕ ПустаяСтрока(ИмяСубконто) Тогда					
                	Попытка
                        ТекущийВидСубконто = ВидыСубконтоМенеджер[ИмяСубконто];
					Исключение
						ТекстСообщения = НСтр("ru = 'Неожиданное имя субконто'"); 
                    КонецПопытки;    					
					Если ТекущийВидСубконто = Неопределено Тогда    					
	                	ТекущийВидСубконто = ВидыСубконтоМенеджер.НайтиПоНаименованию(ИмяСубконто);    						
					КонецЕсли;     					
					Если НЕ ЗначениеЗаполнено(ТекущийВидСубконто) Тогда    					
						ТекстСообщения = НСтр("ru='В плане видов характеристик %1 не удалось найти субконто по имени %2.';
											  |en='In terms of types of characteristics of %1 could not find subkonto on behalf of %2.'");
						ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяВидовСубконто, ИмяСубконто);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);     					
                    КонецЕсли;
                КонецЕсли;
            Иначе
                // При загрузке из excel приходит ссылка.
                ТекущийВидСубконто = ДанныеИсточник[Имя];
            КонецЕсли;               
			                					
            Если ЗначениеЗаполнено(ТекущийВидСубконто) Тогда
                
                НовыйВидСубконто = СчетПриемникОбъект.ВидыСубконто.Добавить();
                НовыйВидСубконто.ВидСубконто = ТекущийВидСубконто;
                
                Если ЕстьСуммовойУчетСубконто Тогда
                    НовыйВидСубконто.Суммовой = Истина;
                КонецЕсли;
                
                Если ЕстьВалютныйУчетСубконто И СчетВалютный Тогда
                    НовыйВидСубконто.Валютный = Истина;
                КонецЕсли;
                
                Если ЕстьКоличественныйУчетСубконто
                    И СчетКоличественный Тогда
                    НовыйВидСубконто.Количественный = Истина;
                КонецЕсли;
                
                НовыйВидСубконто.ТолькоОбороты = ТолькоОбороты;
                
            КонецЕсли; 
                            
        КонецЦикла; // По видам субконто
	
	Иначе
		
		// Субконто для механизма заполнения из другого счета.
				
		ЗначенияВидовСубконтоИсточника = СчетИсточникСсылка.ВидыСубконто;		
		Для Каждого ТекЗначениеВидаСубконто Из ЗначенияВидовСубконтоИсточника Цикл
			
			ТипЗнчСубконто		 = ТекЗначениеВидаСубконто.ВидСубконто.ТипЗначения;
			ВидСубконтоПриемника = фКэшЗначений.СоответствиеВидовСубконтоПриемника.Получить(ТипЗнчСубконто);
			
			Если ЗначениеЗаполнено(ВидСубконтоПриемника) Тогда
				
				Если ТипЗнч(ВидСубконтоПриемника) = Тип("Массив") Тогда
					
					Для каждого ЭлМасс Из ВидСубконтоПриемника Цикл
						Если ЭлМасс.Наименование = ТекЗначениеВидаСубконто.ВидСубконто.Наименование Тогда
						
							НовыйВидСубконто = СчетПриемникОбъект.ВидыСубконто.Добавить();
							ЗаполнитьЗначенияСвойств(НовыйВидСубконто, ТекЗначениеВидаСубконто); 
							НовыйВидСубконто.Предопределенное = ?(СчетПриемникОбъект.Предопределенный, ТекЗначениеВидаСубконто.Предопределенное, Ложь);
							НовыйВидСубконто.ВидСубконто = ЭлМасс;
							Прервать;
						
						КонецЕсли;   				
					КонецЦикла;
					
				Иначе
				
					НовыйВидСубконто = СчетПриемникОбъект.ВидыСубконто.Добавить();
					ЗаполнитьЗначенияСвойств(НовыйВидСубконто, ТекЗначениеВидаСубконто); 	
					НовыйВидСубконто.Предопределенное = ?(СчетПриемникОбъект.Предопределенный, ТекЗначениеВидаСубконто.Предопределенное, Ложь);
					НовыйВидСубконто.ВидСубконто = ВидСубконтоПриемника;
					
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	// Запись счета.
	Если бит_ОбщегоНазначения.ЗаписатьСчет(СчетПриемникОбъект, ПредставлениеПланСчетовПриемник, , "Ошибки", Истина) Тогда
		КоличествоДобавленных = КоличествоДобавленных + 1;
	Иначе
		// Не удалось записать счет.
		ЕстьОшибки = Истина;			
	КонецЕсли;
 	
КонецПроцедуры // ДобавитьСчет()

// Процедура добавляет счета 
// 
// Параметры:
//  УзелДерева            - ДанныеФормыЭлементКоллекции.
//  КоличествоДобавленных - Число.
//  ЕстьОшибки			  - Булево.
//  СтруктураПараметров   - Структура.
// 
&НаСервере
Процедура ДобавитьВыбранныеСчета(УзелДерева, КоличествоДобавленных, ЕстьОшибки, СтруктураПараметров)
	
	Для каждого СтрокаДерева Из УзелДерева Цикл
		
		Если СтрокаДерева.Выбрать Тогда
			ДобавитьСчет(СтрокаДерева, КоличествоДобавленных, ЕстьОшибки, СтруктураПараметров);		
		КонецЕсли;
		
		ДобавитьВыбранныеСчета(СтрокаДерева.ПолучитьЭлементы(), КоличествоДобавленных, ЕстьОшибки, СтруктураПараметров);
	
	КонецЦикла;
	
КонецПроцедуры

// Процедура добавляет счета 
// 
// Параметры:
//  КоличествоДобавленных - Число.
// 
&НаСервере
Процедура ДобавитьСчетаСервер(КоличествоДобавленных)
	
	ЕстьОшибки = Ложь;
	
	МетаданныеПланаСчетовПриемник = Метаданные.ПланыСчетов[Объект.ПланСчетовПриемник];
	МаскаКодаПриемник = РегистрыСведений.бит_МаскиКодов.ПолучитьМаскуКодаПланаСчетов(Объект.ПланСчетовПриемник);
	Если Объект.ЗаполнениеПоУмолчанию Тогда
		// При заполнении по умолчанию источник - макет.
		МетаданныеПланаСчетовИсточник = Метаданные.ПланыСчетов[Объект.ПланСчетовПриемник];
		МаскаКодаИсточник = МаскаКодаПриемник;
	Иначе
		МетаданныеПланаСчетовИсточник = Метаданные.ПланыСчетов[Объект.ПланСчетовИсточник];
		МаскаКодаИсточник = РегистрыСведений.бит_МаскиКодов.ПолучитьМаскуКодаПланаСчетов(Объект.ПланСчетовИсточник);
	КонецЕсли;	
	
	ЕстьНаименованиеПолноеУПриемника = МетаданныеПланаСчетовПриемник.Реквизиты.Найти("НаименованиеПолное") <> Неопределено;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МетаданныеПланаСчетовИсточник"   , МетаданныеПланаСчетовИсточник);
	СтруктураПараметров.Вставить("МетаданныеПланаСчетовПриемник"   , МетаданныеПланаСчетовПриемник);
	СтруктураПараметров.Вставить("ПланСчетовПриемникМенеджер"      , ПланыСчетов[Объект.ПланСчетовПриемник]);
	СтруктураПараметров.Вставить("ЕстьНаименованиеПолноеУПриемника", ЕстьНаименованиеПолноеУПриемника);
	СтруктураПараметров.Вставить("МаскаКодаИсточник"			   , МаскаКодаИсточник);
	СтруктураПараметров.Вставить("МаскаКодаПриемник"			   , МаскаКодаПриемник);
	
	КореньДерева = ПланСчетовСписок.ПолучитьЭлементы();
	ДобавитьВыбранныеСчета(КореньДерева, КоличествоДобавленных, ЕстьОшибки, СтруктураПараметров);
												
КонецПроцедуры

// ----------------------------------------------------------------------
// СКД

// Функция получает запрос схемы компановки данных.
// 
// Параметры:
//  Нет
// 
// Возращаемое значение:
//  Запрос
// 
&НаСервере
Функция ПолучитьЗапросСКД()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);

	// Выполняем компановку макета МакетСКД
	// (настройки берутся из схемы компановки данных и из пользовательских настроек).
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетСКД = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Объект.Компоновщик.ПолучитьНастройки());
	
	// Получаем запрос макета компановки данных.
	Запрос = Новый Запрос(МакетСКД.НаборыДанных.СписокСчетов.Запрос);
	
	// Устанавливаем параметры запроса.
	ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
	Для каждого ОписаниеПараметраЗапроса Из ОписаниеПараметровЗапроса Цикл
		Запрос.УстановитьПараметр(ОписаниеПараметраЗапроса.Имя, МакетСКД.ЗначенияПараметров[ОписаниеПараметраЗапроса.Имя].Значение);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Запрос;
	
КонецФункции

// Процедура инициализирует схему компановки данных.
// 
&НаСервере
Процедура ИнинциализироватьСКД()

	УстановитьПривилегированныйРежим(Истина);
	
	СхемаКомпоновкиДанных = Обработки.бит_ЗаполнитьПланСчетовПоПлануСчетов.ПолучитьМакет("ПодборСчетов");
	
	Если ЗначениеЗаполнено(Объект.ПланСчетовИсточник) Тогда
	 	СхемаКомпоновкиДанных.НаборыДанных.СписокСчетов.Запрос = "
		|ВЫБРАТЬ
		|	ПланСчетовИсточник.Ссылка,
		|	ПланСчетовИсточник.Код,
		|	ПланСчетовИсточник.Порядок,
		|	ПланСчетовИсточник.Наименование,
		|	ПланСчетовИсточник.Предопределенный КАК Предопределенный,
		|	ПланСчетовИсточник.Вид КАК ВидСчета,
		|	ПланСчетовИсточник.Забалансовый КАК Забалансовый,
		|	ПланСчетовИсточник.Валютный КАК Валютный,
		|	ПланСчетовИсточник.Количественный КАК Количественный
		|{ВЫБРАТЬ
		|	Ссылка.*}
		|ИЗ
		|	ПланСчетов." + Объект.ПланСчетовИсточник + " КАК ПланСчетовИсточник
		|
		|{ГДЕ
		|	ПланСчетовИсточник.Ссылка.*}
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ УБЫВ
		|
		|";
		СхемаКомпоновкиДанных.НаборыДанных.СписокСчетов.Поля[0].ТипЗначения = Новый ОписаниеТипов("ПланСчетовСсылка." + Объект.ПланСчетовИсточник);
	Иначе
		СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор.Элементы.Очистить();	
	КонецЕсли;
	                 
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	Объект.Компоновщик.Инициализировать(ИсточникНастроек);
	Объект.Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура устанавливает заголовок формы обработки.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	Если Объект.ЗаполнениеПоУмолчанию Тогда
		ТекстЗаголовка = НСтр("ru='Заполнение по умолчанию: %1';en='Default padding: %1'");
		ТекстЗаголовка = СтрШаблон(ТекстЗаголовка, ПредставлениеПланСчетовПриемник);
	Иначе	
		ТекстИсточник = ?(ЗначениеЗаполнено(Объект.ПланСчетовИсточник),
						  Элементы.ПредставлениеПланСчетовИсточник.СписокВыбора.НайтиПоЗначению(ПредставлениеПланСчетовИсточник).Представление,
						  НСтр("ru='источник НЕ УКАЗАН';en='source is NOT specified'"));
		
		ТекстЗаголовка = НСтр("ru='Заполнение: %1 -> %2';en='Filling: %1 -> %2'");
		ТекстЗаголовка = СтрШаблон(ТекстЗаголовка, ТекстИсточник, ПредставлениеПланСчетовПриемник);
	КонецЕсли;
	
	ЭтотОбъект.Заголовок = ТекстЗаголовка;
	 		
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеПланаСчетовПоУмолчанию

// Процедура заполняет план счетов по умолчанию.
//
&НаСервере
Процедура ЗаполнитьСписокСчетовПоУмолчанию() Экспорт

	СтруктураПараметров = бит_БухгалтерскийУчет.ПолучитьДанныеПараметраКоманды(Объект.ПланСчетовПриемник);	
	Если Не СтруктураПараметров.КомандаДоступна Тогда
	 	Возврат;	
	КонецЕсли;
		             	
	СинонимПС		 = СтруктураПараметров.СинонимОбъекта;
	ИмяВидовСубконто = СтруктураПараметров.ИмяВидаСубконто;
	
	Если бит_му_ОбщегоНазначения.ЭтоМеждународныйПланСчетовИлиРегистр(Объект.ПланСчетовПриемник) Тогда
		ИмяМакета = "СчетаПоУмолчаниюМСФО";	
	Иначе
		ИмяМакета = "СчетаПоУмолчанию";
	КонецЕсли;
	
	ПараметрыЗаполнения = бит_БухгалтерскийУчет.НовыеПараметрыЗаполнитьПланСчетовИзМакета();
	ПараметрыЗаполнения.ИмяПланаСчетов  	= Объект.ПланСчетовПриемник;
	ПараметрыЗаполнения.ИмяВидовСубконто 	= ИмяВидовСубконто;
	ПараметрыЗаполнения.ИмяМакета 			= ИмяМакета;
	ПараметрыЗаполнения.РежимСообщений		= "Ошибки";
	ПараметрыЗаполнения.СинонимПС			= СинонимПС;
		
	ЗаполнитьСписокСчетовИзМакета(ПараметрыЗаполнения);
		
КонецПроцедуры
 
// Процедура заполняет план счетов по макету.
// 
// Параметры:
//  ИмяПланаСчетов  	 - Строка.
//  ИмяВидовСубконто	 - Строка.
//  ИмяМакета			 - Строка.
//  РежимСообщений		 - Строка: "Нет","Все","Ошибки".
//  РежимЗаполнения		 - Строка: "ИзменитьТолькоВидСчета", по умолчанию "".
//  УстанавливатьПометку - Булево - помечать на удаление счета, которых нет в макете.
//  Отказ				 - Булево (По умолчанию =Ложь).
//  СинонимПС			 - Строка - синоним плана счетов (По умолчанию = "").
// 
&НаСервере
Процедура ЗаполнитьСписокСчетовИзМакета(ПараметрыЗаполнения)
	
	ИмяПланаСчетов 		 = ПараметрыЗаполнения.ИмяПланаСчетов;
	ИмяВидовСубконто 	 = ПараметрыЗаполнения.ИмяВидовСубконто;
	ИмяМакета 			 = ПараметрыЗаполнения.ИмяМакета;
	РежимСообщений 		 = ПараметрыЗаполнения.РежимСообщений;
	РежимЗаполнения 	 = ПараметрыЗаполнения.РежимЗаполнения;
	УстанавливатьПометку = ПараметрыЗаполнения.УстанавливатьПометку;
	СинонимПС 			 = ПараметрыЗаполнения.СинонимПС;
	
	Отказ = Ложь;
	// Проверки.
	Если Метаданные.ПланыСчетов.Найти(ИмяПланаСчетов) = Неопределено Тогда
		ТекстСообщения = НСтр("ru='В системе не обнаружен план счетов ""%1""';
							  |en='The account plan ""%1"" was not found in the system""'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПланаСчетов);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
	КонецЕсли;
	Если Метаданные.ПланыВидовХарактеристик.Найти(ИмяВидовСубконто) = Неопределено Тогда
		ТекстСообщения = НСтр("ru='В системе не обнаружен план видов характеристик ""%1""';
							  |en='The system did not detect the ""%1"" feature plan""'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяВидовСубконто);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
	КонецЕсли;
	Если Метаданные.ПланыСчетов[ИмяПланаСчетов].Макеты.Найти(ИмяМакета) = Неопределено Тогда
		ТекстСообщения = НСтр("ru='У плана счетов ""%1"" не обнаружен макет ""%2"".'; 
							  |en='The ""%1"" chart of accounts did not have the ""%2"" layout detected""'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПланаСчетов, ИмяМакета);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПустаяСтрока(СинонимПС) Тогда
		// Получим синоним объекта.
		СинонимПС = бит_ПраваДоступа.ПолучитьСинонимОбъектаСистемы(Метаданные.ПланыСчетов[ИмяПланаСчетов]);
	КонецЕсли;
	
	ПланСчетовМенеджер   = ПланыСчетов[ИмяПланаСчетов];
	ВидыСубконтоМенеджер = ПланыВидовХарактеристик[ИмяВидовСубконто];
	
	// Служит для хранения ссылок найденных/записанных счетов.
	МассивСчетов         = Новый Массив;	
	МассивСтрокДляЗаполнения = Новый Массив;
	
    // Проверим наличие реквизита "КодБыстрогоВыбора".
    ЕстьКодБыстрогоВыбора = Не Метаданные.ПланыСчетов[ИмяПланаСчетов].Реквизиты.Найти("КодБыстрогоВыбора") = Неопределено;
	
	// Текущая маска кода из регистра сведений.
	МаскаКода 			     = РегистрыСведений.бит_МаскиКодов.ПолучитьМаскуКодаПланаСчетов(ИмяПланаСчетов);
	МаскаСодержитРазделители = ?(бит_БухгалтерияКлиентСервер.ПолучитьКоличествоРазделителейМаски(МаскаКода) = 0, Ложь, Истина);
	
	// Заполнение счетов из макета.	
	Макет = ПланСчетовМенеджер.ПолучитьМакет(ИмяМакета);
	
	ВидыСчета = Новый Соответствие;
	ВидыСчета.Вставить("А" , ВидСчета.Активный);
	ВидыСчета.Вставить("П" , ВидСчета.Пассивный);
	ВидыСчета.Вставить("АП", ВидСчета.АктивноПассивный);
	
	ПоляСтруктуры = бит_БухгалтерияКлиентСервер.ОпределитьСтрокуПолейПланаСчетов(ИмяПланаСчетов, Ложь, Истина); 
	
	НСтрока = 2;
	
	ТестовоеЗначение = СокрЛП(Макет.Область(НСтрока, 2, НСтрока, 2).Текст);
	Дальше = ЗначениеЗаполнено(ТестовоеЗначение);
	Пока Дальше Цикл
		
		// Считывание данных из макета.
		Данные = Новый Структура(ПоляСтруктуры);
		Сч = 1;
		Для каждого КлючИЗначение Из Данные Цикл
			
			ИмяПоля  = КлючИЗначение.Ключ;
			Значение = СокрЛП(Макет.Область(НСтрока, Сч, НСтрока, Сч).Текст);
			Если ИмяПоля = "Вид" Тогда
			   ТекущийВид      = ВидыСчета[Значение];	
			   Данные[ИмяПоля] = ?(ТекущийВид = Неопределено, ВидСчета.АктивноПассивный, ТекущийВид);
			ИначеЕсли ИмяПоля  = "Забалансовый" 
				      ИЛИ ИмяПоля = "Валютный" 
					  ИЛИ ИмяПоля = "Количественный"
					  ИЛИ ИмяПоля = "ОбСубконто1"
					  ИЛИ ИмяПоля = "ОбСубконто2"
					  ИЛИ ИмяПоля = "ОбСубконто3"
					  ИЛИ ИмяПоля = "ОбСубконто4" Тогда	
			   Данные[ИмяПоля] = ?(Значение = "1", Истина, Ложь);	  
			Иначе
			   Данные[ИмяПоля] = Значение;
			КонецЕсли; 
			
			Сч = Сч + 1;
		КонецЦикла; 
		
		бит_БухгалтерскийУчет.ДополнитьДанныеДляЗаполненияПланаСчетов(Данные, 
			ПланСчетовМенеджер, МаскаСодержитРазделители, МаскаКода);
		
		Если ЗначениеЗаполнено(Данные.ТекущийЭлемент) 
			И Данные.ТекущийЭлемент.Предопределенный  Тогда
			
			НСтрока = НСтрока + 1;				
			ТестовоеЗначение = СокрЛП(Макет.Область(НСтрока, 2, НСтрока, 2).Текст);
			Дальше = ЗначениеЗаполнено(ТестовоеЗначение);
			Продолжить;
		КонецЕсли; 
		
        НСтрока 		 = НСтрока + 1;				
        ТестовоеЗначение = СокрЛП(Макет.Область(НСтрока, 2, НСтрока, 2).Текст);
        Дальше 			 = ЗначениеЗаполнено(ТестовоеЗначение);
		
		МассивСтрокДляЗаполнения.Добавить(Данные);
		
	КонецЦикла;	
	
	КореньДерева = ПланСчетовСписок.ПолучитьЭлементы();
	КореньДерева.Очистить();
	
	ИдСтрок = Новый Соответствие;
			
	Для каждого Данные Из МассивСтрокДляЗаполнения Цикл
		
		Если ЗначениеЗаполнено(Данные.РодительКод) Тогда
			ИдРодителя = ИдСтрок.Получить("_"+Данные.РодительКод);
			Если ИдРодителя = Неопределено Тогда
				// Не найден родитель.
				СтрокаСчет = КореньДерева.Добавить();
			Иначе	
				СтрокаРодителя = ПланСчетовСписок.НайтиПоИдентификатору(ИдРодителя);
				ВеткаДерева = СтрокаРодителя.ПолучитьЭлементы();
				СтрокаСчет = ВеткаДерева.Добавить();
			КонецЕсли;		
		Иначе
			СтрокаСчет = КореньДерева.Добавить();
		КонецЕсли;	
		
		СтрокаСчет.Выбрать = Истина;
		ЗаполнитьЗначенияСвойств(СтрокаСчет, Данные);
		СтрокаСчет.ДанныеМакета = Данные;
		
		УстановитьКраткийВидСчета(Данные.Вид, СтрокаСчет.ВидКоротко);
		
		// Сохранение ИД строк для поиска родителей.
		ИдСтрок.Вставить("_"+СтрокаСчет.Код, СтрокаСчет.ПолучитьИдентификатор());
	    
	КонецЦикла; // По строкам макета
        
КонецПроцедуры

Процедура УстановитьКраткийВидСчета(ТекущийВид, ВидКоротко)
	
	Если ТекущийВид = ВидСчета.Активный Тогда		
		ВидКоротко = "(А)";	
	ИначеЕсли ТекущийВид = ВидСчета.Пассивный Тогда
		ВидКоротко = "(П)";	
	Иначе
		ВидКоротко = "(АП)";
	КонецЕсли;
		

КонецПроцедуры

#КонецОбласти

#КонецОбласти

