
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ОбъектВизирования) Тогда
		ТекстСообщения = НСтр("ru='Непосредственное открытие этой формы не предусмотрено. 
									|Для открытия формы можно воспользоваться командой ""Согласование"" в формах документов.';
							  |en='The immediate opening of this form is not provided. 
							  		|To open the form, you can use the ""Coordination"" in the forms of documents.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Элементы.ФормаКомандаПоказатьОтветственных.Доступность = ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.бит_ПраваУстановкиВиз)
						ИЛИ бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(ТекущийПользователь,
							ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.ПросмотрОтветственныхЗаВизы);
							
	Элементы.УстановленныеВизы.ИзменятьСоставСтрок = Пользователи.ЭтоПолноправныйПользователь()
						ИЛИ бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(ТекущийПользователь,
								ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноДобавлятьВизы);
	
	УстановитьУсловноеОформление();
	
	РазрешеноОбновлять = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(Пользователи.ТекущийПользователь(),
						 ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешитьОбновлятьПереченьВиз);
		
	Элементы.УстановленныеВизыОбновитьВизы.Видимость = РазрешеноОбновлять;
	
	Объект.ОбъектВизирования = Параметры.ОбъектВизирования;
	
	МетаОбъект = Объект.ОбъектВизирования.Метаданные();
	ВизированиеДоступно 		   = ВизированиеДоступно(Объект.ОбъектВизирования, МетаОбъект);
	
	ЭтотОбъект.ТолькоПросмотр 			  = НЕ ВизированиеДоступно;
	Элементы.ГрафическаяСхема.Доступность = ВизированиеДоступно;
	
	// Проверим, необходимо ли отображать карту маршрута вообще.
	НеОтображатьКарту = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("НеОтображатьКартуСогласования");	
	Элементы.УстановленныеВизыАлгоритмВидимость.Видимость = НЕ НеОтображатьКарту;	
	
	ОбновитьИсторию();
	
	ПодготовитьФормуНаСервере();
	
	ОбновитьДанныеЭПНаФорме(Истина);
	
	ИспользоватьЭП = бит_ЭлектронныеПодписи.ДоступенФункционалЭП();

	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	// Проверка на модифицированность набора другим пользователем.
	Отбор = Новый Структура;
	Отбор.Вставить("Объект", Объект.ОбъектВизирования);
	
	УстановленныеВизыТек = бит_ВизированиеСервер.ПрочитатьНаборВиз(Отбор);
	
	ТабВизыНач = УстановленныеВизыНач.Выгрузить(,"ИД, Решение, Комментарий, Пользователь, ДатаУстановки, АктивнаяВиза");
	ТабВизыТек = УстановленныеВизыТек.Выгрузить(,"ИД, Решение, Комментарий, Пользователь, ДатаУстановки, АктивнаяВиза");
	
	флТаблицыИдентичны = бит_КонтрольЗакрытогоПериода.СравнитьТаблицы(ТабВизыНач, ТабВизыТек);
	
	Если НЕ флТаблицыИдентичны Тогда
		ТекстСообщения = НСтр("ru='Визы были изменены другим пользователем, необходимо перечитать набор виз.';
							  |en='Visas have been changed by another user, you need to read a set of visas.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Оповещения могут быть отправлены в процессе работы пользователя с формой.
	ВизыОтправленныеПочтой   = Новый СписокЗначений;
	ВизыОтправленныеТелеграм = Новый СписокЗначений;
	Для каждого СтрокаВизыИБ Из УстановленныеВизыТек Цикл
		Если СтрокаВизыИБ.ОповещеноПочта Тогда
			ВизыОтправленныеПочтой.Добавить(СтрокаВизыИБ.ИД);
		КонецЕсли;
		Если СтрокаВизыИБ.ОповещеноТелеграм Тогда
			ВизыОтправленныеТелеграм.Добавить(СтрокаВизыИБ.ИД);
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаВизы Из ТекущийОбъект Цикл
		Если Не СтрокаВизы.ОповещеноПочта
			И ВизыОтправленныеПочтой.НайтиПоЗначению(СтрокаВизы.ИД) <> Неопределено Тогда
			СтрокаВизы.ОповещеноПочта = Истина;
		КонецЕсли;
		Если Не СтрокаВизы.ОповещеноТелеграм
			И ВизыОтправленныеТелеграм.НайтиПоЗначению(СтрокаВизы.ИД) <> Неопределено Тогда
			СтрокаВизы.ОповещеноТелеграм = Истина;
		КонецЕсли;
	КонецЦикла;
	 
	Алгоритм = бит_ВизированиеСервер.ПолучитьАлгоритмПоНаборуВиз(ТекущийОбъект);
	
	ПараметрыКонтекста = Новый Структура;
	ПараметрыКонтекста.Вставить("ТекущийОбъект", Объект.ОбъектВизирования.ПолучитьОбъект());
	ПараметрыКонтекста.Вставить("Алгоритм",      Алгоритм);
	ПараметрыКонтекста.Вставить("НаборВизы",     ТекущийОбъект);
	
	ВыполнятьПоэтапно = бит_УправлениеПроцессами.ВыполнятьАлгоритмПоэтапно(Алгоритм);
	
	Довыполнить = Ложь;
	УстановленныеРешения = Новый Соответствие();
	ТочкиОбработок       = Новый Массив;
	
	// Проанализируем следует ли довыполнять алгоритм визирования.
	Для каждого СтрокаТаблицы Из УстановленныеВизы Цикл
		// Оповещения могут быть отправлены в процессе работы пользователя с формой.
		Если НЕ СтрокаТаблицы.ОповещеноПочта
			И ВизыОтправленныеПочтой.НайтиПоЗначению(СтрокаТаблицы.ИД) <> Неопределено Тогда
			СтрокаТаблицы.ОповещеноПочта = Истина;
		КонецЕсли;
		Если НЕ СтрокаТаблицы.ОповещеноТелеграм
			И ВизыОтправленныеТелеграм.НайтиПоЗначению(СтрокаТаблицы.ИД) <> Неопределено Тогда
			СтрокаТаблицы.ОповещеноТелеграм = Истина;
		КонецЕсли;
		
		Если СтрокаТаблицы.Решение = СтрокаТаблицы.НачальноеРешение Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Решение) 
			И ЗначениеЗаполнено(СтрокаТаблицы.НачальноеРешение) Тогда
			Довыполнить = Истина;
			УстановленныеРешения.Вставить(СтрокаТаблицы.ИД,СтрокаТаблицы.Решение);
		КонецЕсли;
		
		ПараметрыПоследующихТочек = бит_УправлениеПроцессами.ТочкиДействияПослеТекущей(СтрокаТаблицы.ТочкаАлгоритма,
																						ПараметрыКонтекста);
		ТочкиДействия = ПараметрыПоследующихТочек.ТочкиДействия;
		Если ЗначениеЗаполнено(СтрокаТаблицы.Решение) Тогда
			Для каждого ТочкаОбработки Из ПараметрыПоследующихТочек.ТочкиОбработок Цикл
				ТочкиОбработок.Добавить(ТочкаОбработки);
			КонецЦикла;
		КонецЕсли;
			
		Если ВыполнятьПоэтапно Тогда
			Для каждого ТочкаДействия Из ТочкиДействия Цикл
				ОчищаемыеВизы = УстановленныеВизы.НайтиСтроки(Новый Структура("ТочкаАлгоритма", ТочкаДействия));
				Для каждого СтрокаДляОчистки Из ОчищаемыеВизы Цикл
					Если НЕ ЗначениеЗаполнено(СтрокаДляОчистки.Решение) Тогда
						Продолжить;
					КонецЕсли;
					УстановленныеРешения.Вставить(СтрокаДляОчистки.ИД,Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка());
					Довыполнить = Истина;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(ТочкиОбработок);
	Справочники.бит_ПользовательскиеДействия.ВыполнитьТочкиОбработки(ТочкиОбработок, ПараметрыКонтекста);
	
	Если Довыполнить И ВыполнятьПоэтапно Тогда

		// Сброс решения на пустое для очистки нижестоящих виз.
		Для каждого Запись Из ТекущийОбъект Цикл
			УстРешение = УстановленныеРешения[Запись.ИД];
			Если УстРешение <> Неопределено Тогда
				Запись.Решение = Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка();
				Если УстРешение = Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка() Тогда
					Запись.ДатаУстановки = '00010101';
					Запись.ДатаКрайняя   = '00010101';
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла;
		
		бит_ВизированиеСервер.ДовыполнитьАлгоритмВизирования(ПараметрыКонтекста.ТекущийОбъект, ТекущийОбъект, Ложь);
		
		// Восстановление установленных решений.
		Для каждого Запись Из ТекущийОбъект Цикл
			УстРешение = УстановленныеРешения[Запись.ИД];
			Если УстРешение <> Неопределено Тогда
				Запись.Решение = УстРешение;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	
	бит_ВизированиеСервер.УстановитьКрайниеДатыВизирования(Объект.ОбъектВизирования,ТекущийОбъект,Ложь);
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ПриЧтенииНаСервере может вызываться раньше ПриСозданииНаСервере
	// в этом случае реквизиты обработки еще не заполнены и ОбъектВизирования нужно определять по параметрам.
	ТекОбъектВизирования = Неопределено;	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектВизирования) Тогда
		Параметры.Свойство("ОбъектВизирования", ТекОбъектВизирования);
	Иначе
		ТекОбъектВизирования = Объект.ОбъектВизирования;
	КонецЕсли; 	
	
	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ЭтотОбъект.ВизыПользователя = бит_ВизированиеСервер.ВизыПользователя(ТекущийПользователь, ТекОбъектВизирования);
	ОбъектВизирования = Неопределено;
	
	УстановленныеВизыНач.Очистить();
	
	Для каждого ЭлементКоллекции Из УстановленныеВизы Цикл
		
		ПараметрыВизы = ПараметрыВизы(ЭлементКоллекции.Объект, ЭлементКоллекции.Виза, ЭтотОбъект.ВизыПользователя);
		ЭлементКоллекции.ДоступностьВизы = ПараметрыВизы.ДоступностьВизы;
		ЭлементКоллекции.ВидВизы         = ПараметрыВизы.ВидВизы;
		ЭлементКоллекции.ВидСвязиВизы    = ПараметрыВизы.ВидСвязиВизы;
		
		Если НЕ ЗначениеЗаполнено(ОбъектВизирования) Тогда
			ОбъектВизирования = ЭлементКоллекции.Объект;
		КонецЕсли; 
		
		ЭлементКоллекции.НачальноеРешение = ЭлементКоллекции.Решение;
		
		ЗаписьНов = УстановленныеВизыНач.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНов, ЭлементКоллекции);
	КонецЦикла; 
	
	бит_ВизированиеСервер.ЗаполнитьРеквизитыСтатусаВФорме(ЭтотОбъект, ТекОбъектВизирования);
	
	ПерерисоватьАлгоритмВизирования();  
	
	УстановленныеВизы.Сортировать("КодСортировки");  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.УстановленныеВизыАлгоритмВидимость.Пометка = НЕ АлгоритмСкрыт;
	Если АлгоритмПоложение = 0 Тогда 
		Элементы.АлгоритмПоложение.Заголовок = НСтр("ru='Алгоритм снизу';en='Algorithm below'");
	Иначе	
		Элементы.АлгоритмПоложение.Заголовок = НСтр("ru='Алгоритм справа';en='Algorithm to the right'");		
	КонецЕсли; 
	
	ВидимостьАлгоритма = ОпределитьВидимостьАлгоритма();
	УстановитьВидимостьАлгоритма(ВидимостьАлгоритма);	
	
	# Если ВебКлиент Тогда
		// В вебклиенте ДвоичныеДанныеИзСтроки() вызывает ошибку.
		ИспользоватьЭП = Ложь;	
	# КонецЕсли
	
	Если ИспользоватьЭП Тогда
		ПроверитьВсеПодписи();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ДействияПослеЗаписиФорма();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДействияПослеЗаписиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДействияПослеПринятияРешения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура тдИсторияОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.ОбъектВизирования);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУстановленныеВизы

&НаКлиенте
Процедура УстановленныеВизыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные      = Элементы.УстановленныеВизы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	флЭлементыДоступны = ЭлементыТаблицыДоступны(ТекущиеДанные);
	
	УстановитьДоступностьПодчиненныхЭлементов(Элементы.УстановленныеВизы, флЭлементыДоступны);
	
	Элементы.УстановленныеВизыВиза.ТолькоПросмотр = НЕ ТекущиеДанные.ДобавленаВручную;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПодчиненныхЭлементов(ЭлементВладелец, ДоступноРедактирование)
	
	Для каждого ПодчиненныйЭлемент Из ЭлементВладелец.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы") Тогда
			
			УстановитьДоступностьПодчиненныхЭлементов(ПодчиненныйЭлемент, ДоступноРедактирование);
			
		Иначе
			 
			Если ПодчиненныйЭлемент.Имя <> "УстановленныеВизыДобавленаВручную"
				И ПодчиненныйЭлемент.Имя <> "УстановленныеВизыПользователь"
				И ПодчиненныйЭлемент.Имя <> "УстановленныеВизыДатаУстановки"
				И ПодчиненныйЭлемент.Имя <> "ДатаКрайняя"
				И ПодчиненныйЭлемент.Имя <> "УстановленныеВизыВиза" Тогда
				ПодчиненныйЭлемент.ТолькоПросмотр = НЕ ДоступноРедактирование;
			КонецЕсли;
			
		КонецЕсли; 
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеВизыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.УстановленныеВизы.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.ДобавленаВручную Тогда
		Отказ 		   = Истина;
		ТекстСообщения = СтрШаблон(НСтр("ru='Виза ""%1"" установлена по умолчанию и не может быть удалена.';
									    |en='Visa ""%1"" is set and can not be deleted by default.'"),
							       ТекущиеДанные.Виза); 
		ПоказатьПредупреждение(, ТекстСообщения);	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеВизыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	НоваяВиза = УстановленныеВизы.Добавить();
	НоваяВиза.ДобавленаВручную = Истина;
	НоваяВиза.ДоступностьВизы  = Истина;
	НоваяВиза.Объект           = Объект.ОбъектВизирования;
	НоваяВиза.ИД        	   = Строка(Новый УникальныйИдентификатор);
	НоваяВиза.ВидВизы          = ПредопределенноеЗначение("Перечисление.бит_ВидыВиз.Согласующая");
	НоваяВиза.ВидСвязиВизы     = ПредопределенноеЗначение("Перечисление.бит_ВидыСвязиВиз.ФизическоеЛицо");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеВизыВизаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УстановленныеВизы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВизы = ПараметрыВизы(Объект.ОбъектВизирования, ТекущиеДанные.Виза, ЭтотОбъект.ВизыПользователя, Истина);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПараметрыВизы,, "ВремяНаУстановку");
	
	УстановитьДоступностьПодчиненныхЭлементов(Элементы.УстановленныеВизы, ПараметрыВизы.ДоступностьВизы);
	Элементы.УстановленныеВизыВиза.ТолькоПросмотр = НЕ ТекущиеДанные.ДобавленаВручную;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеВизыФизическоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.УстановленныеВизы.ТекущиеДанные;
	
	Если ТекущиеДанные.ВидСвязиВизы = ПредопределенноеЗначение("Перечисление.бит_ВидыСвязиВиз.ЦФО") Тогда
		ТекОписание = Новый ОписаниеТипов(бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ИмяТипаЦФО());
	Иначе  
		ТекОписание = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	КонецЕсли; 
	
	Элементы.УстановленныеВизыФизическоеЛицо.ОграничениеТипа = ТекОписание;
	Элементы.УстановленныеВизыФизическоеЛицо.ВыбиратьТип     = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеВизыФизическоеЛицоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УстановленныеВизы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФизическоеЛицо) 
		  И ТипЗнч(ТекущиеДанные.ФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		  
		ТекущиеДанные.Должность = ПолучитьДолжность(Объект.ОбъектВизирования,ТекущиеДанные.ФизическоеЛицо);
	Иначе	
	   	ТекущиеДанные.Должность = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеВизыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаВизы = УстановленныеВизы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаВизы <> Неопределено Тогда
		ДобавленаВручную = СтрокаВизы.ДобавленаВручную;
	Иначе
		ДобавленаВручную = Ложь;
	КонецЕсли;
	
	Если Поле = Элементы.ОтображениеЭЦП Тогда
		
		ОткрытьФормуПодписи(СтрокаВизы);
		
	ИначеЕсли Поле = Элементы.УстановленныеВизыРешение 
		 ИЛИ Поле = Элементы.УстановленныеВизыКомментарий
		 ИЛИ НЕ ДобавленаВручную Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуВыбораРешения(СтрокаВизы);
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура УстановленныеВизыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Записать();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрафическаяСхема

&НаКлиенте
Процедура ГрафическаяСхемаВыбор(Элемент)
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли; 
	
	Если Элементы.ГрафическаяСхема.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	КодТочки = Элементы.ГрафическаяСхема.ТекущийЭлемент.Имя;
	СтрокаТаблицыТочек = Неопределено;
	
	// Выполняем сканирование, что бы избежать серверного вызова при поиске в таблице.
	Для каждого СтрокаТаблицы Из ТаблицаТочкиВизы Цикл
		Если СтрокаТаблицы.КодТочки = КодТочки Тогда
			СтрокаТаблицыТочек = СтрокаТаблицы;
			Прервать;		
		КонецЕсли;
	КонецЦикла; 
	
	Если СтрокаТаблицыТочек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаТаблицыТочек.ВидТочки <> ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Действие") Тогда
		Возврат;	 
	КонецЕсли;
	
	КлючЗапиписи = Неопределено;
	// Выполняем сканирование, что бы избежать серверного вызова при поиске в таблице.
	Для каждого СтрокаТаблицы Из УстановленныеВизы Цикл
		Если СтрокаТаблицы.ИД = СтрокаТаблицыТочек.ИД Тогда
			КлючЗапиписи = СтрокаТаблицы;
			Прервать;		
		КонецЕсли;
	КонецЦикла; 
	
	Если КлючЗапиписи = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОткрытьФормуВыбораРешения(КлючЗапиписи);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьВизы(Команда)
	
	Если НЕ ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли; 

	Попытка
		ОбновитьВизыСервер();
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось обновить визы по причине: %1';
										|en='Failed to update a visa for a reason:%1'"), 
								   ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения; 	
	КонецПопытки; 
	
	ДействияПослеЗаписиФорма();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьВсеВизы(Команда)
	
	Для каждого СтрокаТаблицы Из УстановленныеВизы Цикл
	
		флЭлементыДоступны = ЭлементыТаблицыДоступны(СтрокаТаблицы);		
		Если флЭлементыДоступны И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Решение) Тогда
			УстановитьВизу(СтрокаТаблицы);
		КонецЕсли; 
	КонецЦикла; 
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсеВизы(Команда)
	
	Для каждого СтрокаТаблицы Из УстановленныеВизы Цикл
	
		флЭлементыДоступны = ЭлементыТаблицыДоступны(СтрокаТаблицы);		
		Если флЭлементыДоступны Тогда		
			ОчиститьВизу(СтрокаТаблицы);		
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПоложение(Команда)
	
	Если ЭтотОбъект.АлгоритмПоложение = 0 Тогда		
		ЭтотОбъект.АлгоритмПоложение = 1;
		Элементы.АлгоритмПоложение.Заголовок = НСтр("ru='Алгоритм справа';en='Algorithm to the right'");		
	Иначе		
		ЭтотОбъект.АлгоритмПоложение = 0;
		Элементы.АлгоритмПоложение.Заголовок = НСтр("ru='Алгоритм снизу';en='Algorithm below'");		
	КонецЕсли; 
	
	ВидимостьАлгоритма = ОпределитьВидимостьАлгоритма();	
	УстановитьВидимостьАлгоритма(ВидимостьАлгоритма);		
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмВидимость(Команда)
	
	Элементы.УстановленныеВизыАлгоритмВидимость.Пометка = НЕ Элементы.УстановленныеВизыАлгоритмВидимость.Пометка;
	
	АлгоритмСкрыт = НЕ Элементы.УстановленныеВизыАлгоритмВидимость.Пометка;
	
	ВидимостьАлгоритма = ОпределитьВидимостьАлгоритма();
	УстановитьВидимостьАлгоритма(ВидимостьАлгоритма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправитьСообщение(Команда)
	
	Если НЕ ПустаяСтрока(фСообщение) Тогда
		
		ОтправитьСообщение();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьСообщение(Команда)
	
	фСообщение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьИсторию(Команда)
	
	ОбновитьИсторию();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	
	ТекущиеДанные = Элементы.УстановленныеВизы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗадачи = ПараметрыНовойЗадачи(Объект.ОбъектВизирования, ТекущиеДанные.ПолучитьИдентификатор());
	
	Если СтруктураЗадачи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураЗадачи", СтруктураЗадачи);
	
	ОткрытьФорму("Задача.бит_Задача.Форма.ФормаСозданияЗадачи", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбзорСхемы(Команда)
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ГрафическаяСхема", ГрафическаяСхема);
	
	ОткрытьФорму("Справочник.бит_АлгоритмыПроцессов.Форма.ОбзорСхемы", ПараметрыФормы, 
		ЭтотОбъект, Объект.ОбъектВизирования);
		
КонецПроцедуры

&НаСервере
Процедура КомандаПоказатьОтветственныхСервере()
	
	Элементы.ПраваУстановкиВиз.Видимость = Истина;
	ОбновитьТаблицуОтветственныхЗаВизы();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьОтветственных(Команда)
	
	КомандаПоказатьОтветственныхСервере();
	ЭтотОбъект.ТекущийЭлемент = Элементы.ПраваУстановкиВиз;
	
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьПраваУстановкиВизНаСервере()
	ОбновитьТаблицуОтветственныхЗаВизы();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПраваУстановкиВиз(Команда)
	КомандаОбновитьПраваУстановкиВизНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЭЦП

&НаКлиенте
Процедура ПодписатьЭП(Команда)
	
	Если НЕ ИспользоватьЭП Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущиеДанные = Элементы.УстановленныеВизы.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Решение) Тогда		
		ТекстСообщения = НСтр("ru='Можно подписать только визу с заполненным результатом согласования.';
							  |en='You can sign a visa only with the completed result of harmonization.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;				
	КонецЕсли;
		
	СтрокаДляКодировки = СтрШаблон("%1%2%3%4%5", 
									Строка(ТекущиеДанные.Виза),
									Строка(ТекущиеДанные.Пользователь),
									Строка(ТекущиеДанные.Решение),
									Строка(ТекущиеДанные.ДатаУстановки),
									ТекущиеДанные.ИД);
		
	ДвоичныеДанныеИД = ДвоичныеДанныеИзСтроки(СтрокаДляКодировки);

	СтруктураПарметров = Новый Структура;
	СтруктураПарметров.Вставить("ДвоичныеДанныеИД", ДвоичныеДанныеИД);
	СтруктураПарметров.Вставить("Контейнер", ТекущиеДанные);
    СтруктураПарметров.Вставить("ОбъектПодписи", Объект.ОбъектВизирования);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодписатьПродолжение", ЭтотОбъект, СтруктураПарметров);
		
	Если Модифицированность Тогда
		
		ТекстСообщения = НСтр("ru='Данные еще не записаны. 
									|Выполнение действия ""Подписать"" возможно только после записи данных.';
							  |en='Data are not yet recorded. 
							  		|Implementation of action ""sign"" is possible only after the data.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	ИначеЕсли ТекущиеДанные.ПодписанЭП Тогда
		
		СтруктураПарметров.Вставить("ВизаПодписана", Истина);
		
		ТекстСообщения = НСтр("ru='Виза уже подписана, хотите переподписать?';
							  |en='Visa has signed it or re-sign?'");		
		ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, РежимДиалогаВопрос.ОКОтмена);
	
	Иначе
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.ОК);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьПродолжение(Результат, СтруктураПарметров) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда		
		Возврат;						
	КонецЕсли;
	
	Операция = НСтр("ru='Подписание визы согласования';
					|en='The signing of the visa coordination'");

	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("ПоказатьКомментарий"			 , Истина);
	ОписаниеДанных.Вставить("Операция"						 , Операция);
	ОписаниеДанных.Вставить("ЗаголовокДанных"                , "");
	ОписаниеДанных.Вставить("ПараметрыДополнительныхДействий", "ПодписьБИТ");

	ОписаниеДанных.Вставить("НаборДанных", Новый Массив);
	ОписаниеДанных.НаборДанных.Добавить(Новый Структура("Данные", СтруктураПарметров.ДвоичныеДанныеИД));
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПодписатьЗавершение", ЭтотОбъект, СтруктураПарметров);
	
	ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, ЭтотОбъект , ОбработчикЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьЗавершение(Результат, СтруктураПараметров) Экспорт
	
	Если Не Результат.Успех Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыПодписи = Новый Структура;
	ПараметрыПодписи.Вставить("Объект"		   , Объект.ОбъектВизирования);
	ПараметрыПодписи.Вставить("ИД"			   , СтруктураПараметров.Контейнер.ИД);
	ПараметрыПодписи.Вставить("Виза"		   , СтруктураПараметров.Контейнер.Виза);
    ПараметрыПодписи.Вставить("СвойстваПодписи", Результат.ТекущийЭлементНабораДанных.СвойстваПодписи);

	Если СтруктураПараметров.Свойство("ВизаПодписана") Тогда
		бит_ЭлектронныеПодписиВызовСервера.ПроверитьУдалитьПодписьВизы(СтруктураПараметров.Контейнер.ИД, Объект.ОбъектВизирования);
	КонецЕсли;
	
	бит_ЭлектронныеПодписиВызовСервера.ЗанестиИнформациюОПодписи(ПараметрыПодписи);	
	
	бит_ЭлектронныеПодписиВызовСервера.ЗаписатьДанныеПодписиВРегистрУстановленныеВизы(СтруктураПараметров.Контейнер.ИД, 
		Объект.ОбъектВизирования, "Подпись");
	
	ОбновитьДанныеЭПНаФорме();
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЭП(Команда)
	
	Если НЕ ИспользоватьЭП Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущиеДанные = Элементы.УстановленныеВизы.ТекущиеДанные;
	
	СтрокаДляКодировки = СтрШаблон("%1%2%3%4%5", 
									Строка(ТекущиеДанные.Виза),
									Строка(ТекущиеДанные.Пользователь),
									Строка(ТекущиеДанные.Решение),
									Строка(ТекущиеДанные.ДатаУстановки),
									ТекущиеДанные.ИД);	
	ДвоичныеДанныеИД = ДвоичныеДанныеИзСтроки(СтрокаДляКодировки);

	СтруктураПарметров = Новый Структура;
	СтруктураПарметров.Вставить("ДвоичныеДанныеИД", ДвоичныеДанныеИД);
	СтруктураПарметров.Вставить("Контейнер"		  , ТекущиеДанные);
	СтруктураПарметров.Вставить("Объект"		  , Объект.ОбъектВизирования);
	
	Если Модифицированность Тогда
		
		ТекстСообщения = НСтр("ru='Данные еще не записаны. 
									|Выполнение действия ""Проверить ЭП"" возможно только после записи данных.';
							  |en='Data are not yet recorded. 
									|Implementation of the action ""Check EP"" is possible only after the data.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				
	Иначе
		
		Подпись = ПолучитьДанныеПодписи(СтруктураПарметров.Контейнер.ИД, Объект.ОбъектВизирования, СтруктураПарметров.Контейнер.Виза, "Команда");

		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПроверитьЭПЗавершение",
			ЭтотОбъект, СтруктураПарметров);
			
		Если ЗначениеЗаполнено(Подпись) Тогда
			бит_ЭлектроннаяПодписьСлужебныйКлиент.ПроверитьПодпись(ОписаниеОповещения, СтруктураПарметров.ДвоичныеДанныеИД, Подпись);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЭПЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Булево") Тогда
		РезультатПроверкиПодписи = Результат;
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда	
		РезультатПроверкиПодписи = Не Результат.Свойство("ТекстОшибкиПроверкиПодписи");		
	КонецЕсли;
	
	бит_ЭлектронныеПодписиВызовСервера.ЗаписатьДанныеПодписиВРегистрУстановленныеВизы(ДополнительныеПараметры.Контейнер.ИД, 
		Объект.ОбъектВизирования, "Проверка", РезультатПроверкиПодписи);
		
	СтатусПроверкиПодписи = "";
	
	бит_ЭлектронныеПодписиВызовСервера.ОбновитьСтатусПроверкиПодписи(Результат, ДополнительныеПараметры.Контейнер.ИД, 
		Объект.ОбъектВизирования, СтатусПроверкиПодписи);
	
	ТекстСообщения = НСтр("ru='Результат проверки подписи: %1.';
						  |en='The result of the signature verification: %1.'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, СтатусПроверкиПодписи);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

	ОбновитьДанныеЭПНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВсе(Команда)
	
	Если НЕ ИспользоватьЭП Тогда
		Возврат;
	КонецЕсли; 
	
	ПроверитьВсеПодписи("Команда");
	
КонецПроцедуры

// Процедура проверяет все подписи в ТЧ "Установленные визы". 
//
// Параметры:
//  ВидОбработки - Строка.
//
&НаКлиенте
Процедура ПроверитьВсеПодписи(ВидОбработки = Неопределено)
	
	Если Модифицированность Тогда
			
		ТекстСообщения = НСтр("ru='Данные еще не записаны. Выполнение действия ""Проверить все"" возможно только после записи данных.';
							  |en='Data are not yet recorded. Implementation of the action ""Check All"" is possible only after the data.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
	Иначе
			
		Для каждого ТекущиеДанные Из ЭтотОбъект.УстановленныеВизы Цикл
			
			СтрокаДляКодировки = СтрШаблон("%1%2%3%4%5", 
									Строка(ТекущиеДанные.Виза),
									Строка(ТекущиеДанные.Пользователь),
									Строка(ТекущиеДанные.Решение),
									Строка(ТекущиеДанные.ДатаУстановки),
									ТекущиеДанные.ИД);	
			ДвоичныеДанныеИД = ДвоичныеДанныеИзСтроки(СтрокаДляКодировки);

			СтруктураПарметров = Новый Структура;
			СтруктураПарметров.Вставить("ДвоичныеДанныеИД", ДвоичныеДанныеИД);
			СтруктураПарметров.Вставить("Контейнер"		  , ТекущиеДанные);
			СтруктураПарметров.Вставить("Объект"		  , Объект.ОбъектВизирования);
			СтруктураПарметров.Вставить("ВидОбработки"	  , ВидОбработки);
			
			Подпись = ПолучитьДанныеПодписи(СтруктураПарметров.Контейнер.ИД, Объект.ОбъектВизирования, ТекущиеДанные.Виза, ВидОбработки);

			ОписаниеОповещения = Новый ОписаниеОповещения(
				"ПроверитьВсеЗавершение",
				ЭтотОбъект, СтруктураПарметров);
				
			Если ЗначениеЗаполнено(Подпись) Тогда
				бит_ЭлектроннаяПодписьСлужебныйКлиент.ПроверитьПодпись(ОписаниеОповещения, СтруктураПарметров.ДвоичныеДанныеИД, Подпись);
			КонецЕсли;

		КонецЦикла;
			
	КонецЕсли;

КонецПроцедуры // ПроверитьВсеПодписи()

&НаКлиенте
Процедура ПроверитьВсеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Булево") Тогда
		РезультатПроверкиПодписи = Результат;
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда	
		РезультатПроверкиПодписи = Не Результат.Свойство("ТекстОшибкиПроверкиПодписи");		
	КонецЕсли;
	
	бит_ЭлектронныеПодписиВызовСервера.ЗаписатьДанныеПодписиВРегистрУстановленныеВизы(ДополнительныеПараметры.Контейнер.ИД, 
		Объект.ОбъектВизирования, "Проверка", РезультатПроверкиПодписи);
	
	СтатусПроверкиПодписи = "";
	
	бит_ЭлектронныеПодписиВызовСервера.ОбновитьСтатусПроверкиПодписи(Результат, ДополнительныеПараметры.Контейнер.ИД, 
		Объект.ОбъектВизирования, СтатусПроверкиПодписи);
	
	Если ДополнительныеПараметры.ВидОбработки = "Команда" Тогда		
		ТекстСообщения = НСтр("ru='Результат проверки подписи визы ""%1"": %2.';
							  |en='Test result visa signature ""%1"": %2.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ДополнительныеПараметры.Контейнер.Виза), СтатусПроверкиПодписи);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ОбновитьДанныеЭПНаФорме();
	
КонецПроцедуры

// Процедура обновляет отображение значка подписи в строке ТЧ "Установленные визы".
//
// Параметры:
//  ПриСозданииНаСервере - Булево.
//
&НаСервере
Процедура ОбновитьДанныеЭПНаФорме(ПриСозданииНаСервере = Ложь)
	
	Если НЕ ПриСозданииНаСервере Тогда
		Прочитать();
	КонецЕсли;

	Для каждого Эл Из ЭтотОбъект.УстановленныеВизы Цикл
		
		Если Эл.ЭПДействительна И Эл.ПодписанЭП Тогда	
			Эл.ОтображениеЭЦП = 2;			
		ИначеЕсли Не Эл.ЭПДействительна И Эл.ПодписанЭП Тогда			
			Эл.ОтображениеЭЦП = 3;			
		ИначеЕсли Не Эл.ЭПДействительна И Не Эл.ПодписанЭП Тогда
			Эл.ОтображениеЭЦП = 1;			
		Иначе			
			Эл.ОтображениеЭЦП = 0;			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ОбновитьДанныеЭПНаФорме()

// Получаем двоичные данные из строк для подписи.
//
// Параметры:
//  Стр - Строка.
//
&НаКлиентеНаСервереБезКонтекста
Функция ДвоичныеДанныеИзСтроки(Стр)
            
    HTTPЗапрос = Новый HTTPЗапрос;         
    HTTPЗапрос.УстановитьТелоИзСтроки(Стр);
    Возврат HTTPЗапрос.ПолучитьТелоКакДвоичныеДанные();
                        
КонецФункции

// Считываем данные подписи при попытке проверки ее в строке ТЧ. 
//
// Параметры:
//  ИД 			  - Строка.
//  ОбъектПодписи - Объект.
//
&НаСервере
Функция ПолучитьДанныеПодписи(ИД, ОбъектПодписи, Виза, ВидОбработки = Неопределено)

	Подпись = Неопределено;
	
	НаборЗаписей = РегистрыСведений.бит_ЭлектронныеПодписи.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИД.Установить(ИД);
	НаборЗаписей.Отбор.Объект.Установить(ОбъектПодписи);
	НаборЗаписей.Прочитать();
	
	Для каждого Набор Из НаборЗаписей Цикл
		ДанныеПодписи = Набор.Подпись;
		Прервать;
	КонецЦикла;
	
	Если ДанныеПодписи = Неопределено Тогда
		Возврат Подпись;
	КонецЕсли;
	
	Попытка
		Подпись = ДанныеПодписи.Получить();
	Исключение	
		
		Если ЗначениеЗаполнено(ВидОбработки) Тогда			
			ТекстСообщения = НСтр("ru='Результат проверки подписи визы ""%1"": Подпись не найдена.';
								  |en='The result of the signature verification visa ""%1"": Signature is not found.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Виза);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат Подпись;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПодписи(ТекущиеДанные)
	
	ТекущиеДанные = Элементы.УстановленныеВизы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли; 

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Объект", ТекущиеДанные.Объект);
	ПараметрыФормы.Вставить("ИД"	, ТекущиеДанные.ИД);
	Попытка
		ОткрытьФорму("РегистрСведений.бит_ЭлектронныеПодписи.ФормаЗаписи", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьФормуВыбораРешения(КлючЗапиписи)
	
	Если НЕ ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли; 
		
	Дополнительно = Новый Структура;
	Дополнительно.Вставить("ТекущаяСтрока", КлючЗапиписи);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВыбораРешения", ЭтотОбъект, Дополнительно); 
	
	ДоступныеРешения = МенюРешений.Скопировать();
	Если НЕ КлючЗапиписи.Решение.Пустая() Тогда
		ДоступныеРешения.Добавить(ПредопределенноеЗначение("Справочник.бит_ВидыРешенийСогласования.ПустаяСсылка"),
								  НСтр("ru='Очистить решение';en='Clear solution'"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("МенюРешений", ДоступныеРешения);
	ПараметрыФормы.Вставить("Комментарий", КлючЗапиписи.Комментарий);
	ПараметрыФормы.Вставить("Виза", 	   КлючЗапиписи.Виза);
	ПараметрыФормы.Вставить("Решение", 	   КлючЗапиписи.Решение);
	ПараметрыФормы.Вставить("Объект", 	   КлючЗапиписи.Объект);
	ПараметрыФормы.Вставить("ТолькоПросмотр", НЕ КлючЗапиписи.ДоступностьВизы);
	
	ОткрытьФорму("Обработка.бит_УстановкаВиз.Форма.ВыборРешения", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,, Оповещение);

КонецПроцедуры

// Обработчик закрытия формы выбора решения.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте 
Процедура ЗавершениеВыбораРешения(Результат, ДополнительныеДанные) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока = ДополнительныеДанные.ТекущаяСтрока;
	Решение 	  = Результат.Решение;
	Комментарий   = Результат.Комментарий;
	
	Записывать = Истина;
	Если ТекущаяСтрока.Решение = Решение И ТекущаяСтрока.Комментарий = Комментарий Тогда
		Записывать = Ложь;	
	КонецЕсли; 
	
	Если НЕ Записывать Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока.Комментарий = Комментарий;
	
	Если ТекущаяСтрока.Решение <> Решение Тогда
		Если Решение = ПредопределенноеЗначение("Справочник.бит_ВидыРешенийСогласования.ПустаяСсылка") Тогда
			ОчиститьВизу(ТекущаяСтрока);
			Записывать = Ложь; // Записали в "ОчиститьВизу()"
		Иначе
			ТекущаяСтрока.Решение = Решение;
			УстановитьВизу(ТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
	Если Записывать Тогда
		Записать();
	КонецЕсли;
	
КонецПроцедуры

// Функция определяет доступны ли элементы ТаблицыФормы УстановленныеВизы.
// 
// Параметры:
//  ТекущаяСтрока  - ДанныеФормыЭлементКоллекции.
// 
// Возвращаемое значение:
//  Булево.
// 
&НаКлиенте
Функция ЭлементыТаблицыДоступны(ТекущаяСтрока)

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ТекущаяСтрока.ДоступностьВизы;
	
КонецФункции

// Функция выполняет поиск строки в таблице точек по переданной точке.
// 
// Параметры:
//  Точка  - СправочникСсылка.бит_ТочкиАлгоритмов.
// 
// Возвращаемое значение:
//   СтрокаТаблицыЗначений.
// 
&НаКлиенте
Функция НайтиСтрокуТаблицыТочек(Точка)

	ТекСтрока = Неопределено;
	
	СтрОтбор = Новый Структура("Точка",Точка);
	
	РезМассив = ТаблицаТочкиВизы.НайтиСтроки(СтрОтбор);
	
	ТекСтрока = Неопределено;
	Если РезМассив.Количество() > 0 Тогда	
		ТекСтрока = РезМассив[0];	
	КонецЕсли; 

	Возврат ТекСтрока;
	
КонецФункции // НайтиСтрокуТаблицыТочек()

// Процедура запрещает доступ к предшествующим в алгоритме точкам действия.
// Рекурсивный вызов.
// 
// Параметры:
//  СправочникСсылка.бит_ТочкиАлгоритмов.
// 
&НаКлиенте
Процедура ОбработатьВерхниеТочкиДействия(ТочкаНачальная)
	
	ТекСтрока = НайтиСтрокуТаблицыТочек(ТочкаНачальная);	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого СтрокаТаблицыВходящие Из ТекСтрока.ВходящиеТочки Цикл		
		Если СтрокаТаблицыВходящие.ВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Действие") Тогда
			ИзменитьДоступность(СтрокаТаблицыВходящие.Точка);			
		Иначе
			ОбработатьВерхниеТочкиДействия(СтрокаТаблицыВходящие.Точка);
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

// Процедура запрещает доступ к последующим в алгоритме точкам действия.
// Рекурсивный вызов.
// 
// Параметры:
//  СправочникСсылка.бит_ТочкиАлгоритмов.
// 
&НаКлиенте
Процедура ОбработатьНижниеТочкиДействия(ТочкаНачальная, СтекОбработанныхТочек = Неопределено)
	
	Если СтекОбработанныхТочек = Неопределено Тогда
		СтекОбработанныхТочек = Новый СписокЗначений;
	КонецЕсли;
	
	Если СтекОбработанныхТочек.НайтиПоЗначению(ТочкаНачальная) = Неопределено Тогда
		СтекОбработанныхТочек.Добавить(ТочкаНачальная);
	Иначе
		// Анализ данной точки уже выполнялся.
		Возврат;
	КонецЕсли;
	
	ТекСтрока = НайтиСтрокуТаблицыТочек(ТочкаНачальная);	
	Если ТекСтрока = Неопределено Тогда		
		Возврат;		
	КонецЕсли; 
	
	Для каждого СтрокаТаблицыИсходящие Из ТекСтрока.ИсходящиеТочки Цикл
		
		Если СтрокаТаблицыИсходящие.ВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Действие") Тогда			
			ИзменитьДоступность(СтрокаТаблицыИсходящие.Точка);			
		Иначе			
			ОбработатьНижниеТочкиДействия(СтрокаТаблицыИсходящие.Точка, СтекОбработанныхТочек);			
		КонецЕсли; 
		
	КонецЦикла; // По исходящим точкам	

КонецПроцедуры

// Процедура изменяет доступность строки таблицы УстановленныеВизы 
// 
// Параметры:
//  СправочникСсылка.бит_ТочкиАлгоритмов.
// 
&НаКлиенте
Процедура ИзменитьДоступность(Точка)
	
	СтрокаТаблицыТочек = НайтиСтрокуТаблицыТочек(Точка);
	Если СтрокаТаблицыТочек <> Неопределено Тогда
		
		// Закрываем от редактирования соответствующую строку.
		СтрОтбор  = Новый Структура("ИД", СтрокаТаблицыТочек.ИД);
		РезМассив = УстановленныеВизы.НайтиСтроки(СтрОтбор);
		Если РезМассив.Количество() > 0 Тогда			
			ЭлементКоллекцииВизы           		 = РезМассив[0];
			ЭлементКоллекцииВизы.ДоступностьВизы = Ложь;			
		КонецЕсли;				
		
	КонецЕсли; 
	
КонецПроцедуры // ИзменитьДоступность()

// Процедура устанавливает отметку о визировании в переданной строке ТаблицыФормы УстановленныеВизы.
// 
// Параметры:
//  ДанныеФормыЭлементКоллекции.
// 
&НаКлиенте
Процедура УстановитьВизу(ТекущиеДанные)
	
	КлючеваяОперация = "СогласованиеУстановкаРешения";
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Виза) Тогда		
		ТекущиеДанные.Пользователь    = ТекущийПользователь;
		ТекущиеДанные.ДатаУстановки   = ОбщегоНазначенияКлиент.ДатаСеанса();
		ЭтотОбъект.Модифицированность = Истина;		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Решение) Тогда
		ТекущиеДанные.Решение = ОсновноеРешение;
	КонецЕсли; 
	
	ОбработатьВерхниеТочкиДействия(ТекущиеДанные.ТочкаАлгоритма);
		
КонецПроцедуры

// Процедура сбрасывает отметку о визировании в переданной строке ТаблицыФормы УстановленныеВизы.
// 
// Параметры:
//  ДанныеФормыЭлементКоллекции.
// 
&НаКлиенте
Процедура ОчиститьВизу(ТекущиеДанные)

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Пользователь) Тогда
		ТекущиеДанные.Пользователь = Неопределено;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Решение) Тогда
		ТекущиеДанные.Решение = Неопределено;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекущиеДанные.Комментарий) Тогда
		ТекущиеДанные.Комментарий = "";
	КонецЕсли;
	
	ТекущиеДанные.ДатаУстановки = Дата('00010101');
	Модифицированность          = Истина;

	ОбработатьНижниеТочкиДействия(ТекущиеДанные.ТочкаАлгоритма);
	
	РежимОчисткиРешения = Истина;
	Записать();
	РежимОчисткиРешения = Ложь;
	
КонецПроцедуры

// Процедура выполняет действия после записи на клиенте.
// 
&НаКлиенте
Процедура ДействияПослеЗаписиФорма()
	
	#Если НЕ ВебКлиент Тогда
		
	Если ЭтотОбъект.ВладелецФормы <> Неопределено И ТипЗнч(ЭтотОбъект.ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		
		ОповеститьОбИзменении(ТипЗнч(Объект.ОбъектВизирования));
		СтруктураПроверки = Новый Структура("Статус");
		ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект.ВладелецФормы);
		Если СтруктураПроверки.Статус <> ЭтотОбъект.Статус Тогда
			ПараметрыОповещения = Новый Структура; 
			ПараметрыОповещения.Вставить("Статус", ЭтотОбъект.Статус);
			ПараметрыОповещения.Вставить("ДатаИзмененияСтатуса", ЭтотОбъект.ДатаИзмененияСтатуса);
			ПараметрыОповещения.Вставить("ОбъектВизирования", Объект.ОбъектВизирования);
			Оповестить("ИзмененСтатус", ПараметрыОповещения, ВладелецФормы.УникальныйИдентификатор);  
		КонецЕсли; 
			
		Если ПеречитатьВладельца Тогда
			Попытка 				
				ЭтотОбъект.ВладелецФормы.Прочитать();				
			Исключение
				ТекстСообщения = НСтр("ru='Не удалось обновить данные формы. Возможно документ был изменен другим пользователем.';
					|en='The form data could not be updated. Probably document have been modified by another user.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;			
			ПеречитатьВладельца = Ложь;
		КонецЕсли;
		
	КонецЕсли; 
		
	#КонецЕсли
	
КонецПроцедуры

// Функция определяет видим алгоритм или нет в зависимости от вида клиента и настроек формы.
// 
// Возвращаемое значение:
//   Булево.
// 
&НаКлиенте
Функция ОпределитьВидимостьАлгоритма()
	
	# Если НЕ ВебКлиент Тогда
		ВидимостьАлгоритма = НЕ ЭтотОбъект.АлгоритмСкрыт;	
	# КонецЕсли
	
	# Если ВебКлиент Тогда
		ВидимостьАлгоритма = Ложь;		
	# КонецЕсли
	
	Возврат ВидимостьАлгоритма;
	
КонецФункции

// Функция определяет доступность выполнения визирования для текущего объекта. 
// 
// Параметры:
//  ОбъектВизирования - ДокументСсылка.
//  МетаОбъект 		  - ОбъектМетаданных.
// 
// Возвращаемое значение:
//  Булево.
//
&НаСервере
Функция ВизированиеДоступно(ОбъектВизирования, МетаОбъект)
	
	флДоступно = Истина;	
	
	// Имена документов подсистемы Казначейство, для которых действует передача на согласование.
	ИменаКазначействоПередачаНаСогласование = Новый Массив;
	ИменаКазначействоПередачаНаСогласование.Добавить("бит_кзн_ЗаявкаНаРасходованиеСредств");
	ИменаКазначействоПередачаНаСогласование.Добавить("бит_кзн_ПланируемоеПоступлениеДенежныхСредств");
	ИменаКазначействоПередачаНаСогласование.Добавить("бит_кзн_ПлатежнаяПозиция");
	ИменаКазначействоПередачаНаСогласование.Добавить("бит_кзн_ПозицияПоступления");
	
	Если бит_РаботаСМетаданными.ОбъектПринадлежитКоллекцииМетаданных("Документы", МетаОбъект.Имя) 
		И МетаОбъект.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
	
	    флКазначействоПередачаНаСогласование = ИменаКазначействоПередачаНаСогласование.Найти(МетаОбъект.Имя) <> Неопределено;
		флПроводитьПослеУтверждения = бит_ВизированиеСервер.ПриниматьКУчетуПослеУтверждения(ОбъектВизирования);
		
		Если флКазначействоПередачаНаСогласование Тогда			
			// Казначейские документы ERP, для которых действует передача на согласование.
			флДоступно = ОбъектВизирования.ОтправленНаСогласование ИЛИ ОбъектВизирования.Проведен;			
		ИначеЕсли флПроводитьПослеУтверждения И бит_РаботаСМетаданными.ЕстьРеквизит("ОтправленНаСогласование", МетаОбъект) Тогда			
			// Документы бюджетирования, на которые действует константа бит_ПроводитьДокументыПослеУтверждения.
			флДоступно = ОбъектВизирования.ОтправленНаСогласование;			
		Иначе			
			// Прочие документы.
			флДоступно = ОбъектВизирования.Проведен;			
		КонецЕсли; 
		
	ИначеЕсли бит_РаботаСМетаданными.ОбъектПринадлежитКоллекцииМетаданных("Документы", МетаОбъект.Имя)
		И ТипЗнч(ОбъектВизирования) = Тип("ДокументСсылка.бит_ОперацияУправленческий") Тогда
		
		Если ОбъектВизирования.ПометкаУдаления Тогда
			флДоступно = Ложь;
		КонецЕсли;
		
	Иначе	
		
		флДоступно = Истина;
		
	КонецЕсли;	
	
	Возврат флДоступно;
	
КонецФункции // ВизированиеДоступно()

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	бит_ВизированиеСервер.ЗаполнитьРеквизитыСтатусаВФорме(ЭтотОбъект, Объект.ОбъектВизирования);
	
	ОсновноеРешение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновноеРешениеСогласования", ТекущийПользователь);
	Если Не ЗначениеЗаполнено(ОсновноеРешение) Тогда
		ОсновноеРешение = Справочники.бит_ВидыРешенийСогласования.Согласовано;
	КонецЕсли;
	
	Элементы.УстановленныеВизыПроставитьВсеВизы.Заголовок = ОсновноеРешение.Наименование;
	
	ПараметрыФормированияСписка = ПараметрыФормированияСпискаРешений();
	МенюРешений = бит_ВизированиеСервер.ДоступныеРешения(ПараметрыФормированияСписка);
	
	Если МенюРешений.НайтиПоЗначению(ОсновноеРешение) = Неопределено Тогда
		Элементы.УстановленныеВизыПроставитьВсеВизы.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормированияСпискаРешений()
	
	МетаданныеОбъекта = Объект.ОбъектВизирования.Метаданные();
	ОбъектСистемы     = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(МетаданныеОбъекта.ПолноеИмя());
	
	ПараметрыОпределенияСР = бит_ВизированиеСервер.НовыеПараметрыОпределенияСпискаРешений();
	ПараметрыОпределенияСР.ОбъектСистемы = ОбъектСистемы;
	ПараметрыОпределенияСР.ТекущийОбъект = Объект.ОбъектВизирования.ПолучитьОбъект();
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеОбъекта) Тогда
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектВизирования, "Организация");
		ПараметрыОпределенияСР.Вставить("Организация", Организация);
	КонецЕсли;
	
	Возврат ПараметрыОпределенияСР;
	
КонецФункции

// Процедура обновляет перечень виз.
// 
&НаСервере
Процедура ОбновитьВизыСервер()
	
	флРазрешеноОбновлять = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(ТекущийПользователь,
							ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешитьОбновлятьПереченьВиз);
								  
	Если флРазрешеноОбновлять <> Истина Тогда
		ТекстСообщения = НСтр("ru='У пользователя отстутствует право на принудительное обновление перечня виз.';
							  |en='The user has the right to enforce otstutstvuet update the list of visas.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли; 							  
	
	ОбъектВизированияСсылка = Объект.ОбъектВизирования;
	
	МетаданныеОбъекта = ОбъектВизированияСсылка.Метаданные();
	
	СтруктураПараметров = Новый Структура;
	
	Если бит_РаботаСМетаданными.ЕстьРеквизит("Организация", МетаданныеОбъекта) Тогда		
		СтруктураПараметров.Вставить("СтруктурноеПодразделение", ОбъектВизированияСсылка.Организация);		
	КонецЕсли; 
	
	Если бит_РаботаСМетаданными.ЕстьРеквизит("ЦФО", МетаданныеОбъекта) Тогда	
		СтруктураПараметров.Вставить("ЦФО", ОбъектВизированияСсылка.ЦФО);	
	КонецЕсли; 
	
	Если бит_ОбщегоНазначения.ОбъектПринадлежитКоллекцииМетаданных("Документы", МетаданныеОбъекта.Имя) Тогда		
		ДатаЗаполнения = ОбъектВизированияСсылка.Дата;		
	Иначе		
		ДатаЗаполнения = ТекущаяДатаСеанса();		
	КонецЕсли; 
	
	НачатьТранзакцию();
	Попытка
		бит_ВизированиеСервер.ОбновитьПереченьВиз(ОбъектВизированияСсылка, ДатаЗаполнения, СтруктураПараметров);
		ДействияПослеПринятияРешения();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());	
	КонецПопытки; 
	
	ДействияПослеЗаписиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДействияПослеПринятияРешения()

	ДокОбъект = Объект.ОбъектВизирования.ПолучитьОбъект();
	МетаОбъект = ДокОбъект.Метаданные();
	
	Если РежимОчисткиРешения Тогда
		ДокОбъект.ДополнительныеСвойства.Вставить("РежимОчисткиРешения", Истина);
	КонецЕсли;
	бит_ВизированиеСервер.ДовыполнитьАлгоритмВизирования(ДокОбъект);
	
	Попытка
		бит_ВизированиеСервер.УстановитьСтатус(ДокОбъект);
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось изменить статус по причине: %1';
		|en='Unable to change the status for a reason:%1'"), 
		КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения;
	КонецПопытки; 
	
	// В режиме "ПроводитьДокументыПослеУтверждения" при достижении статуса "Утвержден" документ должен провестись.
	флПроводитьПослеУтверждения = бит_ВизированиеСервер.ПриниматьКУчетуПослеУтверждения(Объект.ОбъектВизирования);
	
	ПровестиВСтатусеУтверждено	= бит_ВизированиеСервер.ПровестиВСтатусеУтверждено(ДокОбъект, МетаОбъект, флПроводитьПослеУтверждения, "Ошибки");
	Договор						= бит_ВизированиеСервер.МодульВизированияПереопределяемый().СоздатьДоговорВСтатусеУтвержден(ДокОбъект);
	Если ПровестиВСтатусеУтверждено ИЛИ ЗначениеЗаполнено(Договор) Тогда
		ПеречитатьВладельца = Истина;
	КонецЕсли; 
	
	бит_ВизированиеСервер.ЗаполнитьРеквизитыСтатусаВФорме(ЭтотОбъект, ДокОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДействияПослеЗаписиНаСервере()

    ПерерисоватьАлгоритмВизирования(Истина);
	
	ОбновитьИсторию();
	
	ОбновитьДанныеЭПНаФорме();	

КонецПроцедуры

&НаСервере
Процедура ПерерисоватьАлгоритмВизирования(СчитыватьВизы = Ложь)

	Если СчитыватьВизы Тогда
		Прочитать();
	КонецЕсли; 
	
	// Получим общую таблицу точек алгоритма и виз.
	ТаблицаВизы = УстановленныеВизы.Выгрузить();
	
	Алгоритм = Справочники.бит_АлгоритмыПроцессов.ПустаяСсылка();
	
	Для каждого СтрокаВизы Из ТаблицаВизы Цикл
		Если ЗначениеЗаполнено(СтрокаВизы.Алгоритм) Тогда
			Алгоритм = СтрокаВизы.Алгоритм;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	локТаблицаТочкиВизы = бит_УправлениеПроцессами.ОписаниеТочекАлгоритма(Алгоритм, ТаблицаВизы);
	
	флВыполнятьПоэтапно = бит_УправлениеПроцессами.ВыполнятьАлгоритмПоэтапно(Алгоритм);		
	
	ТекОбъектВизирования = Неопределено;	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектВизирования) Тогда
		Параметры.Свойство("ОбъектВизирования", ТекОбъектВизирования);
	Иначе
		ТекОбъектВизирования = Объект.ОбъектВизирования;
	КонецЕсли; 	
	
	// Определяем, какие точки алгоритма доступны.
	ДопПараметрыПроверкиУсловий = бит_ВизированиеСервер.НовыеПараметрыПроверкиУсловия();
	ДопПараметрыПроверкиУсловий.ТекущийОбъект = ТекОбъектВизирования;
	ДопПараметрыПроверкиУсловий.Визы          = ТаблицаВизы;
	ДопПараметрыПроверкиУсловий.Алгоритм      = Алгоритм;

	бит_УправлениеПроцессами.ОпределитьДоступностьТочек(локТаблицаТочкиВизы,флВыполнятьПоэтапно, ДопПараметрыПроверкиУсловий);
	
	локТаблицаТочкиВизы.ЗаполнитьЗначения(0,"Обработана");
	локТаблицаТочкиВизы.ЗаполнитьЗначения(0,"СвязиОбработаны");
	
	// Заполняем таблицу в форме.
	ТаблицаТочкиВизы.Загрузить(локТаблицаТочкиВизы);
	
	инд = 0;
	Для каждого СтрокаТаблицы Из локТаблицаТочкиВизы Цикл
		
		ЭлементКоллекции = ТаблицаТочкиВизы[инд];
		ЭлементКоллекции.ИсходящиеТочки.Загрузить(СтрокаТаблицы.ИсходящиеТочки);
		ЭлементКоллекции.ВходящиеТочки.Загрузить(СтрокаТаблицы.ВходящиеТочки); 		
		
		СтрОтбор  = Новый Структура("ИД",СтрокаТаблицы.ИД);
		РезМассив = УстановленныеВизы.НайтиСтроки(СтрОтбор);
		Если РезМассив.Количество() > 0 Тогда		
			ЭлементКоллекцииВизы = РезМассив[0];
			ЭлементКоллекцииВизы.ДоступностьВизы = СтрокаТаблицы.Доступность;		
		КонецЕсли; 
		
		инд = инд + 1;
		
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(Алгоритм) Тогда
		Возврат;
	КонецЕсли;
	
	КартаМаршрута    = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Алгоритм, "КартаМаршрута");
	ГрафическаяСхема = КартаМаршрута.Получить();
	
	бит_УправлениеПроцессами.ВыделитьЭлементыПоТаблицеВиз(ГрафическаяСхема, локТаблицаТочкиВизы);
	
КонецПроцедуры
 
// Функция получает вспомогательные реквизиты визы.
// 
// Параметры:
//  ОбъектВизирования  - ДокументСсылка.
//  ТекущаяВиза        - СправочникСсылка.бит_Визы.
//  ВизыПользователя   - СписокЗначений.
// 
// Возвращаемое значение:
//  Структура.
// 
&НаСервереБезКонтекста
Функция ПараметрыВизы(ОбъектВизирования, ТекущаяВиза, ВизыПользователя, РасчетСроков = Ложь)
	
	ПараметрыВизы = ПараметрыВизыПоУмолчанию();
	
	Если НЕ ЗначениеЗаполнено(ТекущаяВиза) Тогда
		Возврат ПараметрыВизы;
	КонецЕсли;
	
	ПараметрыВизы.ДоступностьВизы = (ВизыПользователя.НайтиПоЗначению(Справочники.бит_ГруппыВиз.ВсеВизы) <> Неопределено)
										ИЛИ (ВизыПользователя.НайтиПоЗначению(ТекущаяВиза) <> Неопределено);

	ЗначениеРеквизитовВизы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяВиза, "Вид, ОбъектСвязи, ВидСвязи, ВремяНаУстановку");
	ПараметрыВизы.ВидВизы          = ЗначениеРеквизитовВизы.Вид;
	ПараметрыВизы.ФизическоеЛицо   = ЗначениеРеквизитовВизы.ОбъектСвязи;
	ПараметрыВизы.ВремяНаУстановку = ЗначениеРеквизитовВизы.ВремяНаУстановку;
	ПараметрыВизы.Должность        = ПолучитьДолжность(ОбъектВизирования, ЗначениеРеквизитовВизы.ОбъектСвязи);
	
	Если РасчетСроков Тогда
		ПараметрыРасчетаСрока = бит_ВизированиеСервер.НовыеПараметрыРасчетаСрокаИсполнения();
		ПараметрыРасчетаСрока.ОбъектРасчета    = ОбъектВизирования;
		ПараметрыРасчетаСрока.ДатаОтсчета      = ТекущаяДатаСеанса();
		ПараметрыРасчетаСрока.ВремяНаУстановку = ЗначениеРеквизитовВизы.ВремяНаУстановку;
		ПараметрыВизы.ДатаКрайняя = бит_ВизированиеСервер.СрокИсполнения(ПараметрыРасчетаСрока);
	КонецЕсли;
	
	Возврат ПараметрыВизы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПараметрыВизыПоУмолчанию()
	
	ПараметрыВизыПоУмолчанию = Новый Структура;
	ПараметрыВизыПоУмолчанию.Вставить("ДоступностьВизы",  Ложь);
	ПараметрыВизыПоУмолчанию.Вставить("ВидВизы",          Перечисления.бит_ВидыВиз.Согласующая);
	ПараметрыВизыПоУмолчанию.Вставить("Должность",        "");
	ПараметрыВизыПоУмолчанию.Вставить("ФизическоеЛицо",   Справочники.ФизическиеЛица.ПустаяСсылка());
	ПараметрыВизыПоУмолчанию.Вставить("ВидСвязиВизы",     Перечисления.бит_ВидыСвязиВиз.ФизическоеЛицо);
	ПараметрыВизыПоУмолчанию.Вставить("ВремяНаУстановку", 0);
	ПараметрыВизыПоУмолчанию.Вставить("ДатаКрайняя",      '00010101');
	
	Возврат ПараметрыВизыПоУмолчанию;
	
КонецФункции

// Функция получает должность физического лица.
// 
// Параметры:
//  ОбъектВизирования - ДокументСсылка.
//  ФизическоеЛицо    - СправочникСсылка.ФизическиеЛица.
// 
// Возвращаемое значение:
//  Строка.
// 
&НаСервереБезКонтекста
Функция ПолучитьДолжность(ОбъектВизирования, ФизическоеЛицо)

	Должность = "";
	
	Если ЗначениеЗаполнено(ОбъектВизирования) 
		И ТипЗнч(ФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
	
	   МетаданныеОбъекта = ОбъектВизирования.Метаданные();
	   
	   Если бит_РаботаСМетаданными.ЕстьРеквизит("Организация", МетаданныеОбъекта) Тогда
		   СтруктурноеПодразделение = ОбъектВизирования.Организация;
	   ИначеЕсли бит_РаботаСМетаданными.ЕстьРеквизит("ЦФО", МетаданныеОбъекта) Тогда
		   СтруктурноеПодразделение = ОбъектВизирования.ЦФО	
	   Иначе	
		   СтруктурноеПодразделение = Неопределено;
	   КонецЕсли; 
	   
	   Если бит_ОбщегоНазначения.ОбъектПринадлежитКоллекцииМетаданных("Документы", МетаданныеОбъекта.Имя) Тогда
		   ДатаДанных = ОбъектВизирования.Дата;
	   Иначе	
		   ДатаДанных = ТекущаяДатаСеанса();
	   КонецЕсли; 
	   
	   Должность = бит_ОбщегоНазначения.ДолжностьФизЛица(ФизическоеЛицо, ОбъектВизирования.Дата, СтруктурноеПодразделение);
	
	КонецЕсли; 
	
	Возврат Должность;
	
КонецФункции

// Процедура управляет видимостью и положением табличного документа для отображения алгоритма.
// 
&НаСервере
Процедура УстановитьВидимостьАлгоритма(ВидимостьАлгоритма)

	Если НеОтображатьКарту Тогда		
		Элементы.ГруппаАлгоритм.Видимость = Ложь;		
	Иначе		
		Элементы.ГруппаАлгоритм.Видимость = ВидимостьАлгоритма;		
	КонецЕсли; 
	
	Если ЭтотОбъект.АлгоритмПоложение = 0 Тогда
		Элементы.ГруппаВерх.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	Иначе	
		Элементы.ГруппаВерх.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;	
	
КонецПроцедуры // ВидимостьАлгоритма()

// Процедура обновляет историю установки виз.
// 
&НаСервере
Процедура ОбновитьИсторию()

	Обработки.бит_УстановкаВиз.ВывестиИсториюВизирования(тдИстория, Объект.ОбъектВизирования);

	СоздатьКомандыУровней();
	
КонецПроцедуры // ОбновитьИсторию()

// Процедура выполняет отправку сообщения-комментария по визам. 
// 
&НаСервере
Процедура ОтправитьСообщение()

	ОблМакета = Элементы.тдИстория.ТекущаяОбласть;
	
	Если ТипЗнч(ОблМакета.Расшифровка) = Тип("Структура") И ОблМакета.Расшифровка.Свойство("Виза") Тогда
		
		ТекИД = Новый УникальныйИдентификатор;
		
		// Запись сообщения в регистр.
		МенеджерЗаписи = РегистрыСведений.бит_СообщенияПользователей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект       = Объект.ОбъектВизирования;
		МенеджерЗаписи.Виза         = ОблМакета.Расшифровка.Виза;
		МенеджерЗаписи.Пользователь = ТекущийПользователь;
		МенеджерЗаписи.ИД           = ТекИД;
		МенеджерЗаписи.ТекстСообщения = фСообщение;
		МенеджерЗаписи.Период 		= ТекущаяДатаСеанса();
		Попытка
			фСообщение = "";
			Отказ = Ложь;
			МенеджерЗаписи.Записать();
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось отправить сообщение. Описание ошибки: %1.';
								  |en='Failed to send the message. Description of error: %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецПопытки;
		
		Если НЕ Отказ Тогда
			ОбновитьИсторию();
			// Поиск созданного сообщения и позиционирование на нем.
			СтрТекИД = Строка(ТекИД);
			ОблСообщения = тдИстория.Области.Найти(СтрТекИД);
			Если ОблСообщения <> Неопределено Тогда
				Элементы.тдИстория.ТекущаяОбласть = ОблСообщения;
			КонецЕсли; 
		КонецЕсли; 
	Иначе	   
		ТекстСообщения = НСтр("ru='Не выбрана виза для отправки сообщения. Установите курсор на визе по которой необходимо отправить сообщение.';
						   	  |en='No visa selected to send message. Place the cursor on the visa for which you want to send a message.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 
	
КонецПроцедуры // ОтправитьСообщение()

// Заполняет структуру данных по задаче.
// 
// Параметры:
// 	ОбъектВизирования - ДокументСсылка.
// 	ИДСтроки 		  - Число.
// 
// Возвращаемое значение:
// 	Структура.
// 
&НаСервере
Функция ПараметрыНовойЗадачи(ОбъектВизирования, ИДСтроки)
	
	ДанныеПоВизе = УстановленныеВизы.НайтиПоИдентификатору(ИДСтроки);
	
	Если ДанныеПоВизе = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураЗадачи = Задачи.бит_Задача.СтруктураЗадачи();
	
	СтруктураЗадачи.Предмет = ОбъектВизирования;
	СтруктураЗадачи.Виза	= ДанныеПоВизе.Виза;
	
	МетаданныеОбъектаВизирования = ОбъектВизирования.Метаданные();
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответственный", МетаданныеОбъектаВизирования) Тогда
		СтруктураЗадачи.Исполнитель = ОбъектВизирования.Ответственный;
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("Менеджер", МетаданныеОбъектаВизирования) Тогда
		СтруктураЗадачи.Исполнитель = ОбъектВизирования.Менеджер; // Совместимость с ERP.
	КонецЕсли;
	
	Возврат СтруктураЗадачи;
	
КонецФункции

&НаСервере
Процедура СоздатьКомандыУровней()
	
	КоличествоУровней = тдИстория.КоличествоУровнейГруппировокСтрок();
	
	// Очищаем существующие кнопки подменю.
	КоличествоЭлементов = Элементы.ГруппаИсторияУровниГруппировок.ПодчиненныеЭлементы.Количество();
	Для Сч = 1 По КоличествоЭлементов Цикл	
		инд = КоличествоЭлементов - Сч;
		Кнопка = Элементы.ГруппаИсторияУровниГруппировок.ПодчиненныеЭлементы[инд];
		Элементы.Удалить(Кнопка);	
	КонецЦикла; 
	
	ШаблонЗаголовка = НСтр("ru='Уровень %1'; en='Level %1'");
	
	// Создадим команды и кнопки в подменю.
	Для НомерУровня = 1 По КоличествоУровней Цикл
		
		ИмяКоманды = "ГруппаИсторияУровниГруппировок_" + НомерУровня;		
		КомандаУровня = Команды.Найти(ИмяКоманды);
		
		Если КомандаУровня = Неопределено Тогда			
			КомандаУровня = Команды.Добавить(ИмяКоманды);
			КомандаУровня.Действие = "ДействиеУстановитьУровеньГруппировки";			
		КонецЕсли; 
		
		НоваяКнопка = Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"),Элементы.ГруппаИсторияУровниГруппировок);
		
		НоваяКнопка.ИмяКоманды = ИмяКоманды;
		НоваяКнопка.Заголовок  = СтрШаблон(ШаблонЗаголовка, НомерУровня);
		Если НомерУровня = 2 Тогда		
			НоваяКнопка.Пометка = Истина;		
		КонецЕсли; 
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеУстановитьУровеньГруппировки(Команда)
	
	КнопкиУровней = Элементы.ГруппаИсторияУровниГруппировок.ПодчиненныеЭлементы;
	
	НомПодчерк = Найти(Команда.Имя, "_");
	Если НомПодчерк > 0 Тогда
		
		НомУровняСтр = Сред(Команда.Имя, НомПодчерк+1);
		Попытка			
			НомУровня = Число(НомУровняСтр);			
		Исключение			
			НомУровня = -1;			
		КонецПопытки; 
		
		Если НомУровня > 0 Тогда
			
			тдИстория.ПоказатьУровеньГруппировокСтрок(НомУровня-1);
			
			инд = 1;
			Для каждого Кнопка Из КнопкиУровней Цикл				
				Кнопка.Пометка = Ложь;				
				Если инд = НомУровня Тогда					
					Кнопка.Пометка = Истина;					
				КонецЕсли;				
				инд = инд+1;
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаЭП.Видимость 	  = ИспользоватьЭП;
	Элементы.ОтображениеЭЦП.Видимость = ИспользоватьЭП; 

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.УстановленныеВизы.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УстановленныеВизы.ДоступностьВизы", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.УстановленныеВизыИД.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УстановленныеВизы.ДобавленаВручную", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УстановленныеВизы.ВидВизы", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_ВидыВиз.Утверждающая);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.КрасноФиолетовый);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.УстановленныеВизыИД.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УстановленныеВизы.ДобавленаВручную", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УстановленныеВизы.ВидВизы", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_ВидыВиз.Утверждающая);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.УстановленныеВизыИД.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УстановленныеВизы.ДобавленаВручную", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УстановленныеВизы.ВидВизы", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_ВидыВиз.Согласующая);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Зеленый);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.УстановленныеВизыИД.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УстановленныеВизы.ДобавленаВручную", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УстановленныеВизы.ВидВизы", ВидСравненияКомпоновкиДанных.Равно, Перечисления.бит_ВидыВиз.Согласующая);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ИзмененноеЗначениеРеквизитаФон);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.УстановленныеВизыИД.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УстановленныеВизы.ИД", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Белый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.УстановленныеВизы.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УстановленныеВизы.Решение", ВидСравненияКомпоновкиДанных.ВСписке,
		Справочники.бит_ВидыРешенийСогласования.ВсеРешенияПоТипу(Перечисления.бит_ТипыРешений.Отклоняющее));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуОтветственныхЗаВизы()
	
	ПраваУстановкиВиз.Загрузить(бит_ВизированиеСервер.ОтветственныеЗаУстановкуВиз(УстановленныеВизы.Выгрузить()));
	
КонецПроцедуры

#КонецОбласти
