#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	Если Объект.СрокЭксплуатации <> 0 Тогда
		
		СрокЭксплуатацииСтрокой = СтрШаблон(
					НСтр("ru = 'с %1 по %2 (%3 мес)';
						|en = 'from %1 to %2 (%3 months)'"),
					Формат(Объект.ДатаНачалаЭксплуатации, НСтр("ru = 'ДФ=''ММММ гггг ""г""''';
																|en = 'DF=''MMMM yyyy'''")),
					Формат(Объект.ДатаЗавершенияЭксплуатации, НСтр("ru = 'ДФ=''ММММ гггг ""г""''';
																	|en = 'DF=''MMMM yyyy'''")),
					Строка(Объект.СрокЭксплуатации));
					
	Иначе
		
		СрокЭксплуатацииСтрокой = СтрШаблон(
					НСтр("ru = 'с %1';
						|en = 'from %1'"),
					Формат(Объект.ДатаНачалаЭксплуатации, НСтр("ru = 'ДФ=''ММММ гггг ""г""''';
																|en = 'DF=''MMMM yyyy'''")));
					
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти