
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОбменССервисомBankFeedsКлиентСервер: Функции используемые и на клиенте и на сервере
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 
#Область СлужебныйПрограммныйИнтерфейс

// Формирует текст гиперссылки для размещения в форме элемента справочника БанковскиеСчетаОрганизации.
//
// Параметры:
//  Организация  - СправочникСсылка.Организации - организация, указанная в счете.
//  Банк  - СправочникСсылка.КлассификаторБанков - банк, указанный в счете.
//  ИдентификаторСчета  - Строка - идентификатор счета на сервисе
//
// Возвращаемое значение:
//   Строка - текст для гиперссылки.
//
Функция ЗаголовокНастройкиОбменаСБанком(Знач Организация, Знач Банк, Знач ИдентификаторСчета) Экспорт
	
	ТекущаяНастройка = ОбменССервисомBankFeedsВызовСервера.НастройкаОбмена(Организация, Банк);
	
	Если ЗначениеЗаполнено(ТекущаяНастройка)
		И ИдентификаторСчета <> "" Тогда
		
		Шаблон = НСтр("ru = 'Подключен';
						|en = 'Connected'");
		
	Иначе 
		Шаблон = НСтр("ru = 'Подключить сервис';
						|en = 'Enable service'") + " BankFeeds";;
	КонецЕсли;

	Возврат Шаблон;
	
КонецФункции

#КонецОбласти
