#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мВалютаРегламентированногоУчета Экспорт; // Хранит валюту регламентированного учета.

Перем мИзмеренияВсе Экспорт; // Хранит измерения бюджетирования.

Перем мИзмеренияДоп Экспорт; // Хранит дополнительные измерения бюджетирования.

Перем мНастройкиИзмерений Экспорт; // Хранит настройки дополнительных измерений.

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Заполняет наборы значений доступа.
// Параметры:
//  Таблица - ТаблицаЗначений - передает в этот параметр подготовленные наборы значений
//            доступа. Описание колонок см. в функции УправлениеДоступом.ТаблицаНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
		ЦФО, СтатьяОборотов);
	ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	ДобавитьСтрокуВНаборЗначенийДоступа(Ответственный, Таблица);
	
	// Таблица "БДДС"
	Для каждого СтрокаТаблицы Из БДДС Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
			
	// Удалим дубли
	ПоляГруппировки = "";
	Для каждого Колонка Из Таблица.Колонки Цикл
		ПоляГруппировки = "," + Колонка.Имя + ПоляГруппировки;
	КонецЦикла; 
	
	ПоляГруппировки = Сред(ПоляГруппировки, 2);
	Таблица.Свернуть(ПоляГруппировки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	// СтандартныеПодсистемы.Обновление версии ИБ.
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Обновление версии ИБ.
	
	Если ДанныеТЧВРегистре
		И НЕ ДополнительныеСвойства.Свойство("ОбработатьПереносТЧВРегистр")
		И НЕ ЭтоНовый() Тогда
		БДДС.Загрузить(Документы.бит_ФормаВводаБюджета.ДанныеТабличнойЧастиБДДС(Ссылка));
		ЗависимыеОбороты.Загрузить(Документы.бит_ФормаВводаБюджета.ДанныеТабличнойЧастиЗависимыеОбороты(Ссылка));
		ДополнительныеСвойства.Вставить("ОбработатьПереносТЧВРегистр", Истина);
	КонецЕсли;
	
	НаименованиеТаблицы = НСтр("ru = 'БДДС'; en = 'БДДС'"); 
	Если бит_УправлениеДоступомБФСлужебный.ДоступЗапрещен(БДДС, НаименованиеТаблицы, Истина) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
		
	бит_Бюджетирование.ОчиститьНеИспользуемыеАналитикиСтатейОборотов(БДДС);
	бит_ОбщегоНазначения.ЗаполнитьАналитикуВШапкеДокумента(ЭтотОбъект, БДДС, Отказ);
	Если РазрешенАвтоматическийВводЗависимыхОборотов() Тогда
		Если ЭтоНовый()
			ИЛИ (РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения 
			И ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления")) Тогда
			ЗаполнитьЗависимыеОбороты();
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	бит_Бюджетирование.ОчиститьНеИспользуемыеАналитикиСтатейОборотов(ЗависимыеОбороты);
	УстановитьПривилегированныйРежим(Ложь);	
	
	Если ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения") Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ОтправленНаСогласование = Истина;
		Иначе
			ОтправленНаСогласование = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПроводитьПослеУтверждения = ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения");
	
	Если НЕ ЭтоНовый() Тогда
		Если ПроводитьПослеУтверждения Тогда
			// Если документ был проведен в системе ранее, без отправки на согласование,
			// при повторном проведении его движения стирать нельзя.
			Если НЕ Проведен ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				РежимПринятияКУчету = 1;
			КонецЕсли;
		Иначе
			РежимПринятияКУчету = 0;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("ЦФО", ЦФО);
								
	ОтражатьСверхБюджета = НЕ бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(
									ПараметрыНастройки, Дата);
									
	Если ОтражатьСверхБюджета ИЛИ НЕ СверхБюджета Тогда
		СписатьЛимиты = Ложь;	
	КонецЕсли;		
	
	ОбработатьПереносТЧВРегистр();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.бит_ФормаВводаБюджета.ПодготовитьПараметрыПроведения(Ссылка, Отказ);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ТаблицаИсполнениеБюджета = бит_КонтрольИсполненияБюджета.ПодготовитьТаблицуВозвратЛимита(
									ПараметрыПроведения.ВозвратЛимита,
									ПараметрыПроведения.ИсполнениеБюджетаРеквизиты,
									Отказ);
	
	бит_КонтрольИсполненияБюджета.СформироватьДвиженияКонтрольныеЗначенияБюджетов(
		ТаблицаИсполнениеБюджета, Движения);
	// АПК:105-выкл Явная запись требуеся для анализа движений.	
	Движения.бит_КонтрольныеЗначенияБюджетов.Записать();
	// АПК:105-вкл

	ТаблицаИсполнениеБюджета = бит_КонтрольИсполненияБюджета.ПодготовитьТаблицуИсполнениеБюджета(
									ПараметрыПроведения.ИсполнениеБюджета,
									ПараметрыПроведения.ИсполнениеБюджетаРеквизиты,
									Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	бит_КонтрольИсполненияБюджета.СформироватьДвиженияКонтрольныеЗначенияБюджетов(ТаблицаИсполнениеБюджета, Движения);
		
	Документы.бит_ФормаВводаБюджета.СформироватьДвиженияОборотыПоБюджетам(ПараметрыПроведения.ТаблицаОборотыПоБюджетам,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	Документы.бит_ФормаВводаБюджета.СформироватьДвиженияБюджетирование(ПараметрыПроведения.ТаблицаОборотыПоБюджетам,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
   	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураКурсыВалют = бит_Бюджетирование.КурсыВалютСценария(ЭтотОбъект,Дата, Новый Структура("Документ, Регл, Упр, Сценарий"));
	ТаблицаБДДС = ПодготовитьТаблицуБДДС(СтруктураКурсыВалют);
	бит_Бюджетирование.ПроверитьФиксацию(СтруктураШапкиДокумента.Сценарий, ТаблицаБДДС, Отказ, Истина);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ВычислятьФормулыПриВводе Тогда
		ТекстСообщения = НСтр("ru = 'При проведении ""Вычисление формул при вводе"" должно быть включено.
									|Смотри в форме документа ""Параметры вычислений"".';
							  |en = '""Alculation of formulas at input"" must be enebled for posting.
							  	    |Check document form ""Calculation Parameters"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,,,Отказ);
	КонецЕсли;

	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаФормы, "Вид") = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет Тогда
		ПроверяемыеРеквизиты.Добавить("РежимФормированияДвижений");
	КонецЕсли;	
	
	// Обязательные измерения из разряда дополнительных.
	Для каждого КлючИЗначение Из мНастройкиИзмерений Цикл
		ИмяИзмерения = КлючИЗначение.Ключ;
		Настройка    = КлючИЗначение.Значение;
		Если Настройка.Обязательное Тогда
			ПроверяемыеРеквизиты.Добавить("БДДС."+ИмяИзмерения);
			ПроверяемыеРеквизиты.Добавить("ЗависимыеОбороты."+ИмяИзмерения);
		КонецЕсли; 
	КонецЦикла; 
	
	Для Каждого СтрокаТаблицы Из БДДС Цикл
		Если СтрокаТаблицы.Количество = 0 И СтрокаТаблицы.Сумма = 0 Тогда
			ТекстСообщения =  НСтр("ru = 'В строке №%1 табличной части ""Данные бюджета"" не заполнены ни сумма ни количество.';
								   |en='In line №%1 table ""Budget data"" must be filled amount or quantity.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли; 
	КонецЦикла;
	
	бит_Бюджетирование.ПроверитьОбязательныеРазрезыСтатейОборотов(ЭтотОбъект, "БДДС", Отказ);
	УстановитьПривилегированныйРежим(Истина);
	бит_Бюджетирование.ПроверитьОбязательныеРазрезыСтатейОборотов(ЭтотОбъект, "ЗависимыеОбороты", Отказ);
	УстановитьПривилегированныйРежим(Ложь);
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект,ПроверяемыеРеквизиты);
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		
		// Заполнение нового документа.
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.бит_НастройкиФормВводаБюджета") Тогда
			НастройкаФормы = ДанныеЗаполнения;
		КонецЕсли;
		
		бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), Неопределено);
		
		// Заполнение значений по-умолчанию из настроек формы ввода.
		Если ЗначениеЗаполнено(НастройкаФормы) Тогда
			СтрНастройкиФормы = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(НастройкаФормы);
			Для каждого КиЗ Из СтрНастройкиФормы.Измерения Цикл
				ТекОписание = КиЗ.Значение;
				Если НЕ ТекОписание.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать 
					И ЗначениеЗаполнено(ТекОписание.ЗначениеПоУмолчанию) Тогда
					
					ЭтотОбъект[ТекОписание.Имя] = ТекОписание.ЗначениеПоУмолчанию;
				КонецЕсли; 
			КонецЦикла; // СтрНастройкиФормы.
		КонецЕсли; // НастройкаФормы.
		
		Если НастройкаФормы.Вид = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет 
			И ЗначениеЗаполнено(Сценарий) 
			И Сценарий.бит_Периодичность <> НастройкаФормы.ПериодичностьПланирования Тогда
			
			// Сценарий по-умолчанию не подходит, 
			// т.к. не совпадает периодичность сценария и периодичность фиксированного макета.
			Сценарий = Неопределено;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Сценарий) Тогда
			ИзменениеСценарияОбъект();
		КонецЕсли; 													   
		
		Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
			ВалютаДокумента      = мВалютаРегламентированногоУчета;
			КурсДокумента        = 1;
			КратностьДокумента   = 1;			
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(РежимЗависимыхОборотов) Тогда
			РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Автоматический;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(РежимФормированияДвижений) Тогда
			РежимФормированияДвижений = Перечисления.бит_РежимыФормированияДвиженийФормыВвода.Все;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ЕдиницаИзмеренияСумм) Тогда
			ЕдиницаИзмеренияСумм = Перечисления.бит_ЕдиницыИзмеренияСумм.Единицы;			
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ДатаНачалаПланирования) Тогда
			ДатаНачалаПланирования = НачалоГода(ТекущаяДатаСеанса());		
		КонецЕсли; 
		
		Если ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения") Тогда
			РежимПринятияКУчету = 1;	
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры
         
Процедура ПриКопировании(ОбъектКопирования)
	
	// Скидываем значение флага "СверхБюджета".
	СверхБюджета  = Ложь;
	СписатьЛимиты = Ложь;
	
	// И признак начала согласования.
	ОтправленНаСогласование = Ложь;
	Ответственный = Пользователи.ТекущийПользователь();
	АктуализироватьКурсы();
	Если ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения") Тогда
		РежимПринятияКУчету = 1;
	Иначе
		РежимПринятияКУчету = 0;
	КонецЕсли;
	
	ДанныеТЧВРегистре = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СохранитьДанныеВХранилище(АдресХранилищаДанных) Экспорт
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресХранилищаДанных);
	ХранилищеДанных = Новый ХранилищеЗначения(ТаблицаДанных, Новый СжатиеДанных(9));
	
КонецПроцедуры

Процедура СохранитьСписокСмежностиВХранилище(АдресХранилищаСпискаСмежности) Экспорт
	
	СписокСмежности = ПолучитьИзВременногоХранилища(АдресХранилищаСпискаСмежности);
	ХранилищеСпискаСмежности = Новый ХранилищеЗначения(СписокСмежности, Новый СжатиеДанных(9));
	
КонецПроцедуры

// Процедура восстанавливает дерево при работе с объектом. 
// Вызывается при автоматическом выполнении действий из задач. 
//
// Параметры:
//  ВыводитьСообщения - Булево (По умолчанию = Ложь.
//
Процедура ВосстановитьДеревоПоДаннымВнеш(ВыводитьСообщения = Ложь) Экспорт

    // Заполнение пустых ИД.
    ТекИдБДДС = бит_Бюджетирование.ОпределитьТекущийИД(БДДС.Выгрузить(), "ИД");
    Для каждого СтрТч Из БДДС Цикл
        Если СтрТч.ИД = 0 Тогда
            СтрТч.ИД  = ТекИдБДДС;
            ТекИдБДДС = ТекИдБДДС + 1;         
        КонецЕсли;       
    КонецЦикла;   
    
	СтруктураНастроек = ПолучитьНастройкиПостроителя();
	
	ТабДок			= ПолучитьДерево();
	ТекстЗапроса	= НастройкаФормы.ТекстЗапроса;
	Компоновщик		= Новый КомпоновщикНастроекКомпоновкиДанных;
	АдресКомпоновки		= Документы.бит_ФормаВводаБюджета.ИнициализироватьКомпоновщик(ТекстЗапроса, Компоновщик, Новый УникальныйИдентификатор);	
	Адрес				= ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	АдресСпискаСмежности= ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ПараметрыВосстановленияДерева = Документы.бит_ФормаВводаБюджета.НовыеПараметрыДерева();
	ПараметрыВосстановленияДерева.СхемаКомпоновкиДанных	= ПолучитьИзВременногоХранилища(АдресКомпоновки);
	Если СтруктураНастроек.Свойство("НастройкиКомпоновщика") Тогда
		ПараметрыВосстановленияДерева.НастройкиКомпоновщика =  СтруктураНастроек.НастройкиКомпоновщика;
	КонецЕсли;	
	ПараметрыВосстановленияДерева.ВыводитьСообщения = ВыводитьСообщения;
	ПараметрыВосстановленияДерева.УдалитьЛишнее 	= Истина;
	ВосстановитьДеревоПоДанным(Адрес, АдресСпискаСмежности, Новый УникальныйИдентификатор(), ТабДок,
		НастройкаФормы, ТекстЗапроса, ПараметрыВосстановленияДерева);
	СохранитьДерево(ТабДок);

КонецПроцедуры

// Устарела. Следует использовать Документы.бит_ФормаВводаБюджета.ОбновитьДеревоДанных().
// Удалить 3.1.53.
Процедура ОбновитьДеревоДанных(ТабДок, Настройка, ТекстЗапроса, ПараметрыОбновления) Экспорт
	
	Документы.бит_ФормаВводаБюджета.ОбновитьДеревоДанных(ТабДок, Настройка, ТекстЗапроса, ПараметрыОбновления);
	
КонецПроцедуры

// Сохраняет дерево данных в хранилище значения.
// 
Процедура СохранитьДерево(ТабДок) Экспорт

	ХранилищеДерева = Новый ХранилищеЗначения(ТабДок, Новый СжатиеДанных(9));

КонецПроцедуры

// Извлекает дерево данных из хранилища.
// 
// Возвращаемое значение:
//  ТабДок - Табличный документ.
// 
Функция ПолучитьДерево() Экспорт
	
	ТабДок = ХранилищеДерева.Получить();
	Если НЕ ТипЗнч(ТабДок) = Тип("ТабличныйДокумент") Тогда
		ТабДок = Новый ТабличныйДокумент;
	КонецЕсли; 
	Возврат ТабДок;
	
КонецФункции

// Процедура сохраняет настройки построителя.
// 
// Параметры:
//  СтруктураНастроек - Структура.
// 
Процедура СохранитьНастройкиПостроителя(СтруктураНастроек)  Экспорт
	
	НастройкиПостроителя = Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9));
	
КонецПроцедуры

// Функция получает настройки построителя.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура.
// 
Функция ПолучитьНастройкиПостроителя() Экспорт
	
	СтруктураНастроек = НастройкиПостроителя.Получить();
	Если НЕ ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		СтруктураНастроек = Новый Структура;
	КонецЕсли; 
	Возврат СтруктураНастроек;
	
КонецФункции

// Процедура заполняет зависимые обороты по строке данных.
// 
// Параметры:
//  ТекущаяСтрока  - СтрокаТабличнойЧасти.БДДС.
//  Очищать        - Булево.
// 
Процедура ЗаполнитьЗависимыеОборотыПоСтроке(ТекущаяСтрока,Очищать=Истина) Экспорт

	Если НЕ РазрешенРучнойВводЗависимыхОборотов() Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Если Очищать Тогда
			ОчиститьЗависимыеОборотыПоСтроке(ТекущаяСтрока);
		КонецЕсли; 
		
	    Измерения = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все","имя");
		
		УстановитьПривилегированныйРежим(Истина);
		
		ПараметрыФормирования = бит_Бюджетирование.НовыеПараметрыФормированияЗависимыхОборотовПоСтроке();
		ПараметрыФормирования.ДатаЗаполнения 			= ТекущаяСтрока.Период;
		ПараметрыФормирования.ТекущийОбъект 			= ЭтотОбъект;
		ПараметрыФормирования.СтрокаТабличнойЧасти		= ТекущаяСтрока;
		ПараметрыФормирования.ИмяТабличнойЧастиИсточник = "БДДС";
		ПараметрыФормирования.ИмяТабличнойЧастиПриемник = "ЗависимыеОбороты";
		ПараметрыФормирования.ИзмеренияБюджетирования	= Измерения;
	
		бит_Бюджетирование.СформироватьЗависимыеОборотыПоСтроке(ПараметрыФормирования);
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 

КонецПроцедуры

// Процедура очищает табличную часть ЗависимыеОбороты.
// 
Процедура ОчиститьЗависимыеОбороты() Экспорт

	ЗависимыеОбороты.Очистить();

КонецПроцедуры

// Процедура заполняет табличную часть ЗависимыеОбороты.
// 
Процедура ЗаполнитьЗависимыеОбороты() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ПараметыЗаполнения = бит_Бюджетирование.НовыеПараметыЗаполненияЗависимыхОборотов();
	ПараметыЗаполнения.ТаблицаИсточник      = БДДС.Выгрузить();
	ПараметыЗаполнения.ТаблицаПриемник      = ЗависимыеОбороты.ВыгрузитьКолонки();
	ПараметыЗаполнения.ЕдиницаИзмеренияСумм = ЕдиницаИзмеренияСумм;
	ПараметыЗаполнения.Сценарий             = Сценарий;
	ПараметыЗаполнения.ВестиПротокол        = (ПараметыЗаполнения.ТаблицаПриемник.Колонки.Найти("КомментарийРасчета")
												<> Неопределено);
	
	ЗависимыеОбороты.Загрузить(бит_Бюджетирование.ЗависимыеОборотыПоИсточнику(ПараметыЗаполнения));

	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

// Процедура обрабатывает изменение валюты документа.
// 
Процедура ИзменениеВалюты() Экспорт
	
	Если ЗначениеЗаполнено(Сценарий) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "ИспользоватьКурсыСценария") Тогда
		ДатаКурса = ДатаНачалаПланирования;
	Иначе
		ДатаКурса = Дата;
	КонецЕсли;
	СтрКурса			= бит_Бюджетирование.ПолучитьКурсПоСценарию(Сценарий, ВалютаДокумента, ДатаКурса);
	КурсДокумента		= СтрКурса.Курс;
	КратностьДокумента	= СтрКурса.Кратность;
	
КонецПроцедуры

// Процедура обрабатывает изменение сценария в шапке документа.
// 
Процедура ИзменениеСценарияОбъект(ОчищатьДанные = Истина)  Экспорт

	Если ЗначениеЗаполнено(Сценарий) Тогда
		Если ОчищатьДанные Тогда
			ОчиститьТаблицы();
		КонецЕсли; 
		ВалютаДокумента = Сценарий.Валюта;
		ИзменениеВалюты();
	КонецЕсли; 

КонецПроцедуры

// Процедура заполняет параметры во вновь созданной форме. 
// Используется при программном создании формы ввода во время создания задачи. 
// 
Процедура ПодготовитьНовуюФорму() Экспорт
	
	Если НЕ ЗначениеЗаполнено(НастройкаФормы) Тогда		
		Возврат;		
	КонецЕсли; 
	
	ОчиститьТаблицы();
	
	ТекстЗапроса    = НастройкаФормы.ТекстЗапроса;
	Компоновщик     = Новый КомпоновщикНастроекКомпоновкиДанных;
	АдресКомпоновки = Документы.бит_ФормаВводаБюджета.ИнициализироватьКомпоновщик(ТекстЗапроса, Компоновщик, Новый УникальныйИдентификатор);	
	
	ТекНастройкиФормы = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(НастройкаФормы);
	
	// Копирование отбора из настройки.
	ОбНастройка   = НастройкаФормы.ПолучитьОбъект();
	СохрНастройка = ОбНастройка.ПолучитьНастройкиПостроителя();
	
	Документы.бит_ФормаВводаБюджета.ВосстановитьОтбор(СохрНастройка, Компоновщик, ТекстЗапроса);
	
	// Копирование значений по-умолчанию из настройки.
	Для каждого КиЗ Из ТекНастройкиФормы.Измерения Цикл
		ТекОписание = КиЗ.Значение;
		Если НЕ ТекОписание.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать 
			И ЗначениеЗаполнено(ТекОписание.ЗначениеПоУмолчанию) Тогда
			
			ЭтотОбъект[ТекОписание.Имя] = ТекОписание.ЗначениеПоУмолчанию;
		КонецЕсли; 
	КонецЦикла; // ФКэшЗначений.НастройкиФормы.Измерения.
	
	Если ЗначениеЗаполнено(НастройкаФормы.ПараметрНорм) Тогда
		ПараметрНорм = НастройкаФормы.ПараметрНорм;
	КонецЕсли; 
	
	// Восстанавливаем дерево по данным.
	ТабДок = Новый ТабличныйДокумент;

	РеквизитыСценария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сценарий, "бит_Периодичность, ПродолжительностьИнтервала");
	
	ПараметрыОбновления = Документы.бит_ФормаВводаБюджета.НовыеПараметрыДерева();
	ПараметрыОбновления.НастройкиКомпоновщика		= Компоновщик.ПолучитьНастройки();
	ПараметрыОбновления.ДатаНачалаПланирования 		= ДатаНачалаПланирования;
	ПараметрыОбновления.ДатаОкончанияПланирования 	= ДатаОкончанияПланирования;
	ПараметрыОбновления.Периодичность			    = РеквизитыСценария.бит_Периодичность;
	ПараметрыОбновления.ПродолжительностьИнтервала  = РеквизитыСценария.ПродолжительностьИнтервала;
	ПараметрыОбновления.СхемаКомпоновкиДанных 		= ПолучитьИзВременногоХранилища(АдресКомпоновки);
	
	Документы.бит_ФормаВводаБюджета.ОбновитьДеревоДанных(ТабДок, НастройкаФормы, ТекстЗапроса, ПараметрыОбновления);
	
	// Сохраняем дерево в хранилище.
	СохранитьДерево(ТабДок);
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("НастройкиКомпоновщика", Компоновщик.ПолучитьНастройки());
	
	СохранитьНастройкиПостроителя(СтруктураНастройки);
	
КонецПроцедуры

// Процедура заполняет документ.
// 
// Параметры:
//  СтруктураЗаполнения - Структура.
//
Процедура ЗаполнитьДокумент(СтруктураЗаполнения) Экспорт

    // Значения из структуры заполнения.
	// Обязательные для заполнения поля: Дата, НастройкаФормы, ЦФО.
	Для каждого КлЗнч Из СтруктураЗаполнения Цикл
		ИмяРеквизита = КлЗнч.Ключ;
		Если ИмяРеквизита = "Дата" ИЛИ Метаданные().Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
			ЭтотОбъект[ИмяРеквизита] = КлЗнч.Значение;
		КонецЕсли; 	
	КонецЦикла;
    
    // Дата документа.
    Дата = ТекущаяДатаСеанса();
    
    // Значения по умолчанию.
    Если ЗначениеЗаполнено(Сценарий) И НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда    
        ВалютаДокумента = Сценарий.Валюта;            
    КонецЕсли;       
    Если ЗначениеЗаполнено(ВалютаДокумента) И НЕ ЗначениеЗаполнено(КурсДокумента) Тогда
        ИзменениеВалюты();
    КонецЕсли;
    Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
        ВалютаДокумента      = мВалютаРегламентированногоУчета;
        КурсДокумента        = 1;
        КратностьДокумента   = 1;			
    КонецЕсли;        
    Если НастройкаФормы.Вид = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет 
         И ЗначениеЗаполнено(Сценарий) 
         И Сценарий.бит_Периодичность <> НастройкаФормы.ПериодичностьПланирования Тогда           
         // Сценарий по-умолчанию не подходит, 
         // т.к. не совпадает периодичность сценария и периодичность фиксированного макета.
         Сценарий = Неопределено;       
    КонецЕсли;         
    Если НЕ ЗначениеЗаполнено(РежимЗависимыхОборотов) Тогда     
        РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Автоматический;      
    КонецЕсли;       
    Если НЕ ЗначениеЗаполнено(РежимФормированияДвижений) Тогда           
        РежимФормированияДвижений = Перечисления.бит_РежимыФормированияДвиженийФормыВвода.Все;         
    КонецЕсли;	    
    Если НЕ ЗначениеЗаполнено(ЕдиницаИзмеренияСумм) Тогда       
        ЕдиницаИзмеренияСумм = Перечисления.бит_ЕдиницыИзмеренияСумм.Единицы;    
    КонецЕсли;       
    Если НЕ ЗначениеЗаполнено(ДатаНачалаПланирования) Тогда         
        ДатаНачалаПланирования = НачалоГода(ТекущаяДатаСеанса());	        
    КонецЕсли;
	ВычислятьФормулыПриВводе = Истина;
   
    // Обновление дерева данных.
    
    ТабДок = Новый ТабличныйДокумент;
    
    ТекстЗапроса    = НастройкаФормы.ТекстЗапроса;
    Компоновщик     = Новый КомпоновщикНастроекКомпоновкиДанных;
    АдресКомпоновки = Документы.бит_ФормаВводаБюджета.ИнициализироватьКомпоновщик(ТекстЗапроса, Компоновщик, Новый УникальныйИдентификатор());

    Если ЗначениеЗаполнено(НастройкаФормы) Тогда 
        // Копирование отбора из настройки.
    	ОбНастройка   = НастройкаФормы.ПолучитьОбъект();
    	СохрНастройка = ОбНастройка.ПолучитьНастройкиПостроителя();    	
    	Документы.бит_ФормаВводаБюджета.ВосстановитьОтбор(СохрНастройка, Компоновщик, ТекстЗапроса);
        СтруктураНастройки = Новый Структура("НастройкиКомпоновщика", Компоновщик.ПолучитьНастройки());
	    СохранитьНастройкиПостроителя(СтруктураНастройки);
    КонецЕсли;
	
	РеквизитыСценария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сценарий, "бит_Периодичность, ПродолжительностьИнтервала");
	
	ПараметрыОбновления = Документы.бит_ФормаВводаБюджета.НовыеПараметрыДерева();
	ПараметрыОбновления.НастройкиКомпоновщика		= Компоновщик.ПолучитьНастройки();
	ПараметрыОбновления.ДатаНачалаПланирования 		= ДатаНачалаПланирования;
	ПараметрыОбновления.ДатаОкончанияПланирования 	= ДатаОкончанияПланирования;
	ПараметрыОбновления.Периодичность			    = РеквизитыСценария.бит_Периодичность;
	ПараметрыОбновления.ПродолжительностьИнтервала  = РеквизитыСценария.ПродолжительностьИнтервала;
	ПараметрыОбновления.СхемаКомпоновкиДанных 		= ПолучитьИзВременногоХранилища(АдресКомпоновки);
	
    Документы.бит_ФормаВводаБюджета.ОбновитьДеревоДанных(ТабДок, НастройкаФормы, ТекстЗапроса, ПараметрыОбновления);
    
    СохранитьДерево(ТабДок);
        
КонецПроцедуры

// Устанавливает загруженные из Эксель данные в форму ввода.
// 
Процедура УстановитьЗагруженныеДанные(ДанныеЭксель, ТабДокДанные, НастройкиФормы, ВыводитьСообщения = Истина) Экспорт

	// Создание структуры сопоставления имен в документе и в файле.
	КолСтрок   = ТабДокДанные.ВысотаТаблицы;
	КолКолонок = ТабДокДанные.ШиринаТаблицы;
	НомПервойСтроки = 3;
	ИменаЯчеек = Новый Структура;
	Для нс = 1 По КолСтрок Цикл		
		сим = нс+НомПервойСтроки;		
		Для кол = 1 По КолКолонок Цикл			
			// Ячейка табличного документа.
			Обл = ТабДокДанные.Область(нс, кол, нс, кол);
			Имя = Обл.Имя;
			ЭтоСумма      = Лев(Имя,1)="С";
			ЭтоКоличество = Лев(Имя,1)="К";
			Если ЭтоСумма Тогда
				ИмяВФайле = "СП_R"+(нс+НомПервойСтроки)+"C"+кол;
				ИмяВФайле = СтрЗаменить(ИмяВФайле, Символы.НПП, "");
				ИменаЯчеек.Вставить(ИмяВФайле, Имя);	
			ИначеЕсли ЭтоКоличество Тогда
				ИмяВФайле = "КП_R"+(нс+НомПервойСтроки)+"C"+кол;
				ИмяВФайле = СтрЗаменить(ИмяВФайле, Символы.НПП, "");
				ИменаЯчеек.Вставить(ИмяВФайле, Имя);
			КонецЕсли;
			
		КонецЦикла; // По колонкам.		
	КонецЦикла; // По строкам.
	
	Счетчик = 1;
    Для каждого ЭД Из ДанныеЭксель Цикл
		
		ИмяВДокументе = ?(ИменаЯчеек.Свойство(ЭД.Имя), ИменаЯчеек[ЭД.Имя], ЭД.Имя);
		НовоеЗначение = ЭД.Значение;
		
    	Попытка
			Обл = ТабДокДанные.Область(ИмяВДокументе);
    	Исключение
    		Обл = Неопределено;
    		Если ВыводитьСообщения Тогда
    			ТекстСообщения = НСтр("ru = 'Не удалось найти ячейку по имени %1. Значение %2 не будет загружено.';
						  	  		  |en = 'Could not find cell by name %1. The value %2 will not be loaded.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяВДокументе, НовоеЗначение);
    			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
    		КонецЕсли; 
    	КонецПопытки;
    	
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) Тогда
			
			ОбластьР = Обл.Расшифровка;
			Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОбластьР,"РасшифровкаЯчейкиФормыВвода") 
				И ОбластьР.Вид = "Значение" 
				И НЕ ЗначениеЗаполнено(ОбластьР.Формула)  Тогда
				
				Если НовоеЗначение <> 0 Тогда
					СтрОтбор = Новый Структура;
					Для каждого КиЗ Из ОбластьР.Измерения Цикл     				
						СтрОтбор.Вставить(КиЗ.Ключ, КиЗ.Значение);    				
					КонецЦикла; 
					СтрОтбор.Вставить("Период", ОбластьР.Период);
					НайденныеСтроки = БДДС.НайтиСтроки(СтрОтбор);    				
					Если НайденныеСтроки.Количество() > 0 Тогда
						ТекСтрока = НайденныеСтроки[0];
						Если Лев(ОбластьР.Имя,1)  = "K"  Тогда
							ТекСтрока.Количество = НовоеЗначение;
						ИначеЕсли Лев(ОбластьР.Имя, 1) = "С" Тогда	
							ТекСтрока.Сумма = НовоеЗначение;
						КонецЕсли; 
					Иначе	
						СоздатьНовуюСтрокуБюджета(ОбластьР, НовоеЗначение, НастройкиФормы, Счетчик);
						Счетчик = Счетчик + 1;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
    КонецЦикла; // ДанныеЭксель.
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСтрокуВНаборЗначенийДоступа(ЗначениеДоступа, Таблица)
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = ЗначениеДоступа;

КонецПроцедуры

// Переносит данные табличных частей документа в соответствующие регистры сведений.
//
Процедура ОбработатьПереносТЧВРегистр()
	
	Если НЕ ДополнительныеСвойства.Свойство("ОбработатьПереносТЧВРегистр") Тогда
		Возврат;
	КонецЕсли;
	
	ОграничениеКоличестваСтрокТЧ = 100000;
	
	Если БДДС.Количество() >= ОграничениеКоличестваСтрокТЧ
		ИЛИ ЗависимыеОбороты.Количество() >= ОграничениеКоличестваСтрокТЧ Тогда
		ПререстиДанныеТЧВРегистры();
	ИначеЕсли ДанныеТЧВРегистре Тогда
		ОчиститьЗаписиРегистров();
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ПререстиДанныеТЧВРегистры()
	
	ДанныеТЧВРегистре = Истина;
		
	СсылкаНаДокумент = Ссылка;
	Если ЭтоНовый() Тогда
		УстановитьСсылкуНового(Документы.бит_ФормаВводаБюджета.ПолучитьСсылку());
		СсылкаНаДокумент = ПолучитьСсылкуНового();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.бит_ФормаВводаБюджетаБДДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументВладелец.Установить(СсылкаНаДокумент);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументВладелец",     СсылкаНаДокумент);
	Запрос.УстановитьПараметр("ДанныеТабличнойЧасти", БДДС);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтрокиДокумента,
	|	ДанныеТабличнойЧасти.ИД КАК ИД,
	|	ДанныеТабличнойЧасти.Период КАК ПериодСтрокиДокумента,
	|	ДанныеТабличнойЧасти.ЦФО КАК ЦФО,
	|	ДанныеТабличнойЧасти.СтатьяОборотов КАК СтатьяОборотов,
	// ++ ЕРП
	|	ДанныеТабличнойЧасти.Аналитика_8 КАК Аналитика_8,
	|	ДанныеТабличнойЧасти.Аналитика_9 КАК Аналитика_9,
	|	ДанныеТабличнойЧасти.Аналитика_10 КАК Аналитика_10,
	|	ДанныеТабличнойЧасти.Аналитика_11 КАК Аналитика_11,
	|	ДанныеТабличнойЧасти.Аналитика_12 КАК Аналитика_12,
	// -- ЕРП
	|	ДанныеТабличнойЧасти.Аналитика_1 КАК Аналитика_1,
	|	ДанныеТабличнойЧасти.Аналитика_2 КАК Аналитика_2,
	|	ДанныеТабличнойЧасти.Аналитика_3 КАК Аналитика_3,
	|	ДанныеТабличнойЧасти.Аналитика_4 КАК Аналитика_4,
	|	ДанныеТабличнойЧасти.Аналитика_5 КАК Аналитика_5,
	|	ДанныеТабличнойЧасти.Аналитика_6 КАК Аналитика_6,
	|	ДанныеТабличнойЧасти.Аналитика_7 КАК Аналитика_7,
	|	ДанныеТабличнойЧасти.Количество КАК Количество,
	|	ДанныеТабличнойЧасти.Норма КАК Норма,
	|	ДанныеТабличнойЧасти.Сумма КАК Сумма,
	|	ДанныеТабличнойЧасти.Измерение КАК Измерение,
	|	ДанныеТабличнойЧасти.Расчетная КАК Расчетная,
	|	ДанныеТабличнойЧасти.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ ДанныеТабличнойЧасти
	|ИЗ
	|	&ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦФО,
	|	СтатьяОборотов";
	Запрос.Выполнить();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеТабличнойЧасти.ЦФО КАК ЦФО,
	|	ДанныеТабличнойЧасти.СтатьяОборотов КАК СтатьяОборотов,
	|	МАКСИМУМ(ЕСТЬNULL(КлючиАналитик.КлючАналитики, ЗНАЧЕНИЕ(Справочник.бит_КлючиДоступаЦФОСтатьиОборотов.ПустаяСсылка))) КАК КлючДоступаЦФОСтатьиОборотов
	|ПОМЕСТИТЬ КлючиАналитик
	|ИЗ
	|	ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаЦФОСтатьяОборотов КАК КлючиАналитик
	|		ПО ДанныеТабличнойЧасти.ЦФО = КлючиАналитик.ЦФО
	|			И ДанныеТабличнойЧасти.СтатьяОборотов = КлючиАналитик.СтатьяОборотов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеТабличнойЧасти.ЦФО,
	|	ДанныеТабличнойЧасти.СтатьяОборотов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ДокументВладелец КАК ДокументВладелец,
	|	ДанныеТабличнойЧасти.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	ДанныеТабличнойЧасти.ИД КАК ИД,
	|	ДанныеТабличнойЧасти.ПериодСтрокиДокумента КАК ПериодСтрокиДокумента,
	|	ДанныеТабличнойЧасти.ЦФО КАК ЦФО,
	|	ДанныеТабличнойЧасти.СтатьяОборотов КАК СтатьяОборотов,
	// ++ ЕРП
	|	ДанныеТабличнойЧасти.Аналитика_8 КАК Аналитика_8,
	|	ДанныеТабличнойЧасти.Аналитика_9 КАК Аналитика_9,
	|	ДанныеТабличнойЧасти.Аналитика_10 КАК Аналитика_10,
	|	ДанныеТабличнойЧасти.Аналитика_11 КАК Аналитика_11,
	|	ДанныеТабличнойЧасти.Аналитика_12 КАК Аналитика_12,
	// -- ЕРП
	|	ДанныеТабличнойЧасти.Аналитика_1 КАК Аналитика_1,
	|	ДанныеТабличнойЧасти.Аналитика_2 КАК Аналитика_2,
	|	ДанныеТабличнойЧасти.Аналитика_3 КАК Аналитика_3,
	|	ДанныеТабличнойЧасти.Аналитика_4 КАК Аналитика_4,
	|	ДанныеТабличнойЧасти.Аналитика_5 КАК Аналитика_5,
	|	ДанныеТабличнойЧасти.Аналитика_6 КАК Аналитика_6,
	|	ДанныеТабличнойЧасти.Аналитика_7 КАК Аналитика_7,
	|	ДанныеТабличнойЧасти.Количество КАК Количество,
	|	ДанныеТабличнойЧасти.Норма КАК Норма,
	|	ДанныеТабличнойЧасти.Сумма КАК Сумма,
	|	ДанныеТабличнойЧасти.Измерение КАК Измерение,
	|	ДанныеТабличнойЧасти.Расчетная КАК Расчетная,
	|	ДанныеТабличнойЧасти.Комментарий КАК Комментарий,
	|	КлючиАналитик.КлючДоступаЦФОСтатьиОборотов КАК КлючДоступаЦФОСтатьиОборотов,
	|	ВЫБОР
	|		КОГДА КлючиАналитик.КлючДоступаЦФОСтатьиОборотов = ЗНАЧЕНИЕ(Справочник.бит_КлючиДоступаЦФОСтатьиОборотов.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СоздатьКлюч
	|ИЗ
	|	ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КлючиАналитик КАК КлючиАналитик
	|		ПО ДанныеТабличнойЧасти.ЦФО = КлючиАналитик.ЦФО
	|			И ДанныеТабличнойЧасти.СтатьяОборотов = КлючиАналитик.СтатьяОборотов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиДокумента";
	ВыборкаСтрокТЧ = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСтрокТЧ.Следующий() Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаСтрокТЧ);
		Если ВыборкаСтрокТЧ.СоздатьКлюч Тогда
			Запись.КлючДоступаЦФОСтатьиОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
										ВыборкаСтрокТЧ.ЦФО, ВыборкаСтрокТЧ.СтатьяОборотов);
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	
	НаборЗаписей = РегистрыСведений.бит_ФормаВводаБюджетаЗависимыеОбороты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументВладелец.Установить(СсылкаНаДокумент);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументВладелец",     СсылкаНаДокумент);
	Запрос.УстановитьПараметр("ДанныеТабличнойЧасти", ЗависимыеОбороты);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтрокиДокумента,
	|	ДанныеТабличнойЧасти.ИД КАК ИД,
	|	ДанныеТабличнойЧасти.ИД_Родитель КАК ИД_Родитель,
	|	ДанныеТабличнойЧасти.Период КАК ПериодСтрокиДокумента,
	|	ДанныеТабличнойЧасти.ЦФО КАК ЦФО,
	|	ДанныеТабличнойЧасти.СтатьяОборотов КАК СтатьяОборотов,
	// ++ ЕРП
	|	ДанныеТабличнойЧасти.Аналитика_8 КАК Аналитика_8,
	|	ДанныеТабличнойЧасти.Аналитика_9 КАК Аналитика_9,
	|	ДанныеТабличнойЧасти.Аналитика_10 КАК Аналитика_10,
	|	ДанныеТабличнойЧасти.Аналитика_11 КАК Аналитика_11,
	|	ДанныеТабличнойЧасти.Аналитика_12 КАК Аналитика_12,
	// -- ЕРП
	|	ДанныеТабличнойЧасти.Аналитика_1 КАК Аналитика_1,
	|	ДанныеТабличнойЧасти.Аналитика_2 КАК Аналитика_2,
	|	ДанныеТабличнойЧасти.Аналитика_3 КАК Аналитика_3,
	|	ДанныеТабличнойЧасти.Аналитика_4 КАК Аналитика_4,
	|	ДанныеТабличнойЧасти.Аналитика_5 КАК Аналитика_5,
	|	ДанныеТабличнойЧасти.Аналитика_6 КАК Аналитика_6,
	|	ДанныеТабличнойЧасти.Аналитика_7 КАК Аналитика_7,
	|	ДанныеТабличнойЧасти.Количество КАК Количество,
	|	ДанныеТабличнойЧасти.Норма КАК Норма,
	|	ДанныеТабличнойЧасти.Сумма КАК Сумма,
	|	ДанныеТабличнойЧасти.Измерение КАК Измерение,
	|	ДанныеТабличнойЧасти.Расчетная КАК Расчетная,
	|	ДанныеТабличнойЧасти.Комментарий КАК Комментарий,
	|	ДанныеТабличнойЧасти.КомментарийРасчета КАК КомментарийРасчета
	|ПОМЕСТИТЬ ДанныеТабличнойЧасти
	|ИЗ
	|	&ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦФО,
	|	СтатьяОборотов";
	Запрос.Выполнить();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеТабличнойЧасти.ЦФО КАК ЦФО,
	|	ДанныеТабличнойЧасти.СтатьяОборотов КАК СтатьяОборотов,
	|	МАКСИМУМ(ЕСТЬNULL(КлючиАналитик.КлючАналитики, ЗНАЧЕНИЕ(Справочник.бит_КлючиДоступаЦФОСтатьиОборотов.ПустаяСсылка))) КАК КлючДоступаЦФОСтатьиОборотов
	|ПОМЕСТИТЬ КлючиАналитик
	|ИЗ
	|	ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаЦФОСтатьяОборотов КАК КлючиАналитик
	|		ПО ДанныеТабличнойЧасти.ЦФО = КлючиАналитик.ЦФО
	|			И ДанныеТабличнойЧасти.СтатьяОборотов = КлючиАналитик.СтатьяОборотов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеТабличнойЧасти.ЦФО,
	|	ДанныеТабличнойЧасти.СтатьяОборотов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ДокументВладелец КАК ДокументВладелец,
	|	ДанныеТабличнойЧасти.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	ДанныеТабличнойЧасти.ИД КАК ИД,
	|	ДанныеТабличнойЧасти.ИД_Родитель КАК ИД_Родитель,
	|	ДанныеТабличнойЧасти.ПериодСтрокиДокумента КАК ПериодСтрокиДокумента,
	|	ДанныеТабличнойЧасти.ЦФО КАК ЦФО,
	|	ДанныеТабличнойЧасти.СтатьяОборотов КАК СтатьяОборотов,
	// ++ ЕРП
	|	ДанныеТабличнойЧасти.Аналитика_8 КАК Аналитика_8,
	|	ДанныеТабличнойЧасти.Аналитика_9 КАК Аналитика_9,
	|	ДанныеТабличнойЧасти.Аналитика_10 КАК Аналитика_10,
	|	ДанныеТабличнойЧасти.Аналитика_11 КАК Аналитика_11,
	|	ДанныеТабличнойЧасти.Аналитика_12 КАК Аналитика_12,
	// -- ЕРП
	|	ДанныеТабличнойЧасти.Аналитика_1 КАК Аналитика_1,
	|	ДанныеТабличнойЧасти.Аналитика_2 КАК Аналитика_2,
	|	ДанныеТабличнойЧасти.Аналитика_3 КАК Аналитика_3,
	|	ДанныеТабличнойЧасти.Аналитика_4 КАК Аналитика_4,
	|	ДанныеТабличнойЧасти.Аналитика_5 КАК Аналитика_5,
	|	ДанныеТабличнойЧасти.Аналитика_6 КАК Аналитика_6,
	|	ДанныеТабличнойЧасти.Аналитика_7 КАК Аналитика_7,
	|	ДанныеТабличнойЧасти.Количество КАК Количество,
	|	ДанныеТабличнойЧасти.Норма КАК Норма,
	|	ДанныеТабличнойЧасти.Сумма КАК Сумма,
	|	ДанныеТабличнойЧасти.Измерение КАК Измерение,
	|	ДанныеТабличнойЧасти.Расчетная КАК Расчетная,
	|	ДанныеТабличнойЧасти.Комментарий КАК Комментарий,
	|	ДанныеТабличнойЧасти.КомментарийРасчета КАК КомментарийРасчета,
	|	КлючиАналитик.КлючДоступаЦФОСтатьиОборотов КАК КлючДоступаЦФОСтатьиОборотов,
	|	ВЫБОР
	|		КОГДА КлючиАналитик.КлючДоступаЦФОСтатьиОборотов = ЗНАЧЕНИЕ(Справочник.бит_КлючиДоступаЦФОСтатьиОборотов.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СоздатьКлюч
	|ИЗ
	|	ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КлючиАналитик КАК КлючиАналитик
	|		ПО ДанныеТабличнойЧасти.ЦФО = КлючиАналитик.ЦФО
	|			И ДанныеТабличнойЧасти.СтатьяОборотов = КлючиАналитик.СтатьяОборотов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиДокумента";
	ВыборкаСтрокТЧ = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСтрокТЧ.Следующий() Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаСтрокТЧ);
		Если ВыборкаСтрокТЧ.СоздатьКлюч Тогда
			Запись.КлючДоступаЦФОСтатьиОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
										ВыборкаСтрокТЧ.ЦФО, ВыборкаСтрокТЧ.СтатьяОборотов);
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	БДДС.Очистить();
	ЗависимыеОбороты.Очистить();
	
КонецПроцедуры

Процедура ОчиститьЗаписиРегистров()
	
	ДанныеТЧВРегистре = Ложь;
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.бит_ФормаВводаБюджетаБДДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументВладелец.Установить(Ссылка);
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.бит_ФормаВводаБюджетаЗависимыеОбороты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументВладелец.Установить(Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#Область ФормированиеДерева

// Устарела. Следует использовать Документы.бит_ФормаВводаБюджета.ПреобразоватьПериод(). 
// Удалить в 3.1.53.
Функция ПреобразоватьПериод(ВхПериод, Сдвиг, Периодичность, КэшПериодов) Экспорт
	
	Возврат Документы.бит_ФормаВводаБюджета.ПреобразоватьПериод(ВхПериод, Сдвиг, Периодичность, КэшПериодов);					
	
КонецФункции	

// Восстанавливает дерево по табличным частям формы ввода.
//
// Параметры:
//  АдресХранилищаДанных	 - Строка - Адрес временного хранилища для сохранения новой таблицы данных.
//  ИдентификаторФормы		 - УникальныйИдентификатор - Уникальный идентификатор формы документа.
//  ТабДок					 - ТабличныйДокумент - Табличный документ с данными формы.
//  Настройка				 - СправочникСсылка.бит_НастройкиФормВводаБюджета - Настройки форм ввода бюджета.
//  ТекстЗапроса			 - Строка - Текст запроса формы ввода бюджета.
//  ПараметрыВосстановления	 - Структура - см. Документы.бит_ФормаВводаБюджета.НовыеПараметрыДерева().
//
Процедура ВосстановитьДеревоПоДанным(АдресХранилищаДанных, АдресХранилищаСпискаСмежности, ИдентификаторФормы, ТабДок, Настройка, ТекстЗапроса,
	ПараметрыВосстановления) Экспорт
	
	Бюджет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Настройка, "Бюджет");
	Если Справочники.бит_Бюджеты.БюджетЗапрещенВПланировании(Бюджет) Тогда
		ТекстИсключения = НСтр("ru = 'Выполнение операции остановлено. Бюджет настройки формы ввода не должен содержать дубли статей оборотов.';
							   |en = 'The operation is stopped. Budget setting entry forms should not contain duplicates revolutions articles.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ВыводитьСообщения	= ПараметрыВосстановления.ВыводитьСообщения;
	УдалитьЛишнее		= ПараметрыВосстановления.УдалитьЛишнее;
	
	Если ПараметрыВосстановления.ОбновитьДерево Тогда
		Если НЕ ЗначениеЗаполнено(ПараметрыВосстановления.ДатаНачалаПланирования) Тогда
			ПараметрыВосстановления.ДатаНачалаПланирования = ДатаНачалаПланирования;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПараметрыВосстановления.ДатаОкончанияПланирования) Тогда
			ПараметрыВосстановления.ДатаОкончанияПланирования = ДатаОкончанияПланирования;	
		КонецЕсли;
		
		// Динамическое формирование макета.
		Если НЕ ЗначениеЗаполнено(ПараметрыВосстановления.Периодичность) Тогда
			ПараметрыВосстановления.Периодичность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "бит_Периодичность"); 
		КонецЕсли;
		
		Если ПараметрыВосстановления.ПродолжительностьИнтервала = 0 Тогда
			ПараметрыВосстановления.ПродолжительностьИнтервала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "ПродолжительностьИнтервала"); 
		КонецЕсли; 

		ТабДок = Новый ТабличныйДокумент;
		Документы.бит_ФормаВводаБюджета.ОбновитьДеревоДанных(ТабДок, Настройка, ТекстЗапроса, ПараметрыВосстановления);
	КонецЕсли;
	
	// Изменение кода. Начало. 09.02.2018{{
	Если ПараметрыВосстановления.ОбновитьДерево Тогда
		АдресХранилищаДанных = Документы.бит_ФормаВводаБюджета.ЗаполнитьТаблицуДанных(ТабДок, ИдентификаторФормы);
		АдресХранилищаСпискаСмежности = Документы.бит_ФормаВводаБюджета.ЗаполнитьСписокСмежности(ТабДок, ИдентификаторФормы);
	КонецЕсли; 
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресХранилищаДанных);
	ТаблицаДанных.ЗаполнитьЗначения(0	,"ЗначениеВычисленияФормулы");
	ТаблицаДанных.ЗаполнитьЗначения(Ложь,"ФормулаВычислена");
	// Изменение кода. Конец. 09.02.2018}}
	
	ТабДанные = БДДС.Выгрузить();
    Если ТабДанные.Количество() > 1 Тогда
        // Поиск и удаление строк с пустым ИД. Это лишние строки. BF-1722.
        МассивЛишних = БДДС.НайтиСтроки(Новый Структура("ИД", 0));	
        Для каждого ЛишняяСтрока Из МассивЛишних Цикл
            БДДС.Удалить(ЛишняяСтрока);       
        КонецЦикла;
    КонецЕсли;
            
	ТабДанные.Колонки.Добавить("Обработана", Новый ОписаниеТипов("Булево"));

	// Восстанавливаем значения областей по значениям табличной части БДДС.
	Для каждого Обл Из ТабДок.Области Цикл
		
		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Обл.Расшифровка,"РасшифровкаЯчейкиФормыВвода") Тогда
			
			расш = Обл.Расшифровка;
			Если расш.Вид = "Значение" Тогда
				
				СтрОтбор = Новый Структура;
				
				СтрОтбор.Вставить("Период", расш.Период);
				Для каждого КиЗ Из расш.Измерения Цикл
					СтрОтбор.Вставить(КиЗ.Ключ, КиЗ.Значение);
				КонецЦикла; // Обл.Расшифровка.Измерения.
				
				МассивСтрок = ТабДанные.НайтиСтроки(СтрОтбор);
				ИтСумма      = 0;				 
				ИтКоличество = 0;
				Для каждого СтрокаТаблицы Из МассивСтрок Цикл
					
					СтрокаТаблицы.Обработана = Истина;
					ИтСумма      = ИтСумма + СтрокаТаблицы.Сумма;
					ИтКоличество = ИтКоличество + СтрокаТаблицы.Количество;
					
				КонецЦикла; // МассивСтрок.
				Если Лев(Обл.Имя,1) = "С" Тогда
					Обл.Значение = ИтСумма;
				КонецЕсли; 
				
				Если Лев(Обл.Имя,1) = "К" Тогда
					Обл.Значение = ИтКоличество;
				КонецЕсли;
				
				// Изменение кода. Начало. 09.02.2018{{
				СтрОтбор = Новый Структура("Имя,ИмяАргумента",Обл.Имя,Обл.Имя);
				МассивСтрок = ТаблицаДанных.НайтиСтроки(СтрОтбор);
				Если МассивСтрок.Количество()>0 Тогда
					СтрокаТаблицы = МассивСтрок[0];
					СтрокаТаблицы.Значение = Обл.Значение;
				КонецЕсли; 
				// Изменение кода. Конец. 09.02.2018}}
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; // ТабДок.Области.
	
	// Выполнение расчетов по формулам в табличном документе.
	// Изменение кода. Начало. 09.02.2018{{
	Документы.бит_ФормаВводаБюджета.ВыполнитьРасчетыПоЗависимостям(ТабДок,ТаблицаДанных);
	ПоместитьВоВременноеХранилище(ТаблицаДанных, ИдентификаторФормы);
	// Изменение кода. Конец. 09.02.2018}}
	
	// Актуализация данных, вычисленных по формулам.
	НастройкиФормы = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(Настройка);
	ТекИдБДДС = бит_Бюджетирование.ОпределитьТекущийИД(БДДС,"ИД");	 
	Для каждого Обл Из ТабДок.Области Цикл
		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Обл.Расшифровка,"РасшифровкаЯчейкиФормыВвода") Тогда
			расш = Обл.Расшифровка;
			Если расш.Вид = "Значение" И ЗначениеЗаполнено(расш.Формула) Тогда
				// Обрабатываем только ячейки, вычисляемые по формулам, связанные с данными.
				СтрОтбор = бит_БюджетированиеКлиентСервер.СформироватьОтборСтрок(расш);
				НайденныеСтроки = БДДС.НайтиСтроки(СтрОтбор);
				Если УдалитьЛишнее Тогда
					// В случае копирования данных другого бюджета очистим все перенесенные данные,
					//которые должны рассчитываться по формулам.
					Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						БДДС.Удалить(НайденнаяСтрока);
					КонецЦикла;
					НайденныеСтроки.Очистить();
				КонецЕсли;
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					Если ЗначениеЗаполнено(Обл.Значение) Тогда
						// Было вычислено значение по формуле, нужно создать соответствующую строку в таб. части.
						НоваяСтрока = БДДС.Добавить();
						НоваяСтрока.ИД = ТекИдБДДС;
						ТекИдБДДС = ТекИдБДДС + 1;
						
						бит_БюджетированиеКлиентСервер.ЗаполнитьНовуюСтрокуБюджета(ЭтотОбъект, НоваяСтрока, расш.Период, расш.Измерения, НастройкиФормы.Измерения);
						НоваяСтрока[расш.ИмяРесурса] = Обл.Значение;
						НоваяСтрока.Расчетная = Истина;
					КонецЕсли; 
				ИначеЕсли НайденныеСтроки.Количество() = 1 Тогда
					// Выполним синхронизацию данных между таб. частью и макетов.
					ПерваяСтрока = НайденныеСтроки[0];
					Если ЗначениеЗаполнено(Обл.Значение) Тогда
						ПерваяСтрока[расш.ИмяРесурса] = Обл.Значение;
						ПерваяСтрока.Расчетная = Истина;
					Иначе	
						БДДС.Удалить(ПерваяСтрока);
					КонецЕсли;
				ИначеЕсли НЕ ЗначениеЗаполнено(Обл.Значение) Тогда
					// При копировании бюджета по нескольким сценариям.
					Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						БДДС.Удалить(НайденнаяСтрока);
					КонецЦикла;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Выполним поиск строк, для которых не удалось найти ячейки в дереве.
	Если ВыводитьСообщения ИЛИ УдалитьЛишнее Тогда
	
		 СтрОтбор = Новый Структура;
		 СтрОтбор.Вставить("Обработана", Ложь);
		 
		 МассивСтрок = ТабДанные.НайтиСтроки(СтрОтбор);
		 Для каждого СтрокаТаблицы Из МассивСтрок Цикл
			 
			 Если ВыводитьСообщения Тогда
				 ТекстСообщения = НСтр("ru='Не удалось найти ячейку дерева для строки данных бюджета №%1, Период %2, Статья оборотов ""%3"".';
									   |en='Unable to find a tree cell line for the budget data number %1,Period  %2, Article revolutions ""%3"".'");
				 ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.НомерСтроки, Формат(СтрокаТаблицы.Период, "ДЛФ=D"), СтрокаТаблицы.СтатьяОборотов);
				 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			 КонецЕсли;  
			 
			 Если УдалитьЛишнее Тогда
				 // Удаляем строки табличной части, для которой не удалось найти ячейку в дереве.
			 	 СтрОтборИД     = Новый Структура("ИД", СтрокаТаблицы.ИД);
				 
				 СтрокиТабЧасти = БДДС.НайтиСтроки(СтрОтборИД);
				 Для Каждого СтрокаТабЧасти Из СтрокиТабЧасти Цикл
				 	БДДС.Удалить(СтрокаТабЧасти);
				 КонецЦикла; // СтрокиТабЧасти. 
				 
				 СтрокиТабЧасти = ЗависимыеОбороты.НайтиСтроки(СтрОтборИД);
				 Для Каждого СтрокаТабЧасти Из СтрокиТабЧасти Цикл
				 	ЗависимыеОбороты.Удалить(СтрокаТабЧасти);
				 КонецЦикла; 
			 КонецЕсли; 
		 КонецЦикла; // МассивСтрок.
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

// Заполняет норму в строке табличной части. 
// 
// Параметры:
//  ТекущиеДанные - СтрокаТабличнойЧасти.
//  ИмяТаблицы - Строка.
//  ИмяПоля - Строка.
// 
Процедура ЗаполнитьНорму(ТекущиеДанные, ИмяПоля) 
    
    ИменаПараметраНорм = ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ПодготовитьСтруктурыСвязи(ПараметрНорм);

    ИспользоватьНормы  = ПолучитьФункциональнуюОпцию("бит_ИспользоватьНормыВБюджетировании");    
    Если НЕ ИспользоватьНормы Тогда
        Возврат;
    КонецЕсли;
    
    Если бит_БюджетированиеКлиентСервер.ВыполнятьЗаполнениеНормы(ПараметрНорм, ИменаПараметраНорм, ИмяПоля, ИспользоватьНормы) Тогда
    	Если Сценарий.ИспользоватьКурсыСценария Тогда
    		СтрКурса    = бит_Бюджетирование.ПолучитьКурсПоСценарию(Сценарий, ВалютаДокумента, ТекущиеДанные.Период);
    		СтрКурсаДок = Новый Структура("Валюта, Курс, Кратность", ВалютаДокумента, СтрКурса.Курс, СтрКурса.Кратность);
    	Иначе
    		СтрКурсаДок = Новый Структура("Валюта, Курс, Кратность", ВалютаДокумента, КурсДокумента, КратностьДокумента);
    	КонецЕсли; 
    	бит_Бюджетирование.ЗаполнитьНормуВСтроке(ТекущиеДанные, ПараметрНорм, Сценарий, СтрКурсаДок, ИменаПараметраНорм, ЕдиницаИзмеренияСумм);
    КонецЕсли; 

КонецПроцедуры

// Создает новую строку табличной части БДДС.
// 
// Параметры:
//  Расшифровка   - Структура.
//  НовоеЗначение - Число.
// 
Процедура СоздатьНовуюСтрокуБюджета(Расшифровка, НовоеЗначение, НастройкиФормы,Счетчик)
	
	НоваяСтрока = БДДС.Добавить();
	// Изменение кода. Начало. 28.02.2018{{
	НоваяСтрока.ИД = Счетчик;
	// Изменение кода. Конец. 28.02.2018}}
	бит_БюджетированиеКлиентСервер.ЗаполнитьНовуюСтрокуБюджета(ЭтотОбъект, НоваяСтрока, Расшифровка.Период, Расшифровка.Измерения, НастройкиФормы.Измерения);
	// Заполнение ресурсов
	НоваяСтрока[Расшифровка.ИмяРесурса] = НовоеЗначение;
	// Период ставим, т.к. он безусловно обрабатывается.
	ЗаполнитьНорму(НоваяСтрока, "Период");  		
	
КонецПроцедуры

// Функция готовит таблицу БДДС для проведения.
// 
// Возвращаемое значение:
//   ТаблицаБДДС   - ТаблицаЗначений.
// 
Функция ПодготовитьТаблицуБДДС(СтруктураКурсыВалют)
	
	РазмерностьСумм = бит_ОбщегоНазначения.ПолучитьРазмерностьЕдиницыИзмеренияСумм(ЕдиницаИзмеренияСумм);
	
	ТекстВыборкиИзмеренийБДДС             = "";
	ТекстВыборкиИзмеренийЗависимыеОбороты = "";
	
	ШаблонВыборкиИзмерения = "
	|	%1.%2,";
	
	Для каждого Измерение Из Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения Цикл
		ИмяИзмерения = Измерение.Имя;
		Если ИмяИзмерения = "Валюта" Или ИмяИзмерения = "Сценарий" Тогда
			Продолжить;		
		КонецЕсли;
		ТекстВыборкиИзмеренийБДДС = ТекстВыборкиИзмеренийБДДС + СтрШаблон(ШаблонВыборкиИзмерения,
																		"ФормаВводаБюджетаБДДС",
																		ИмяИзмерения);
		ТекстВыборкиИзмеренийЗависимыеОбороты = ТекстВыборкиИзмеренийЗависимыеОбороты + СтрШаблон(ШаблонВыборкиИзмерения,
																						"ФормаВводаБюджетаЗависимыеОбороты",
																						ИмяИзмерения);
	КонецЦикла;
	
	Если ДанныеТЧВРегистре Тогда 
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ФормаВводаБюджетаБДДС.ПериодСтрокиДокумента КАК Период,
		|	ФормаВводаБюджетаБДДС.ДокументВладелец.ВалютаДокумента КАК Валюта,
		|	ФормаВводаБюджетаБДДС.ДокументВладелец.Сценарий КАК ДокументВладелецСценарий,
		|	&ТекстВыборкиИзмеренийБДДС,
		|	ФормаВводаБюджетаБДДС.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ФормаВводаБюджетаБДДС.СтатьяОборотов.ЭтоКоэффициент = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ФормаВводаБюджетаБДДС.Сумма, 0)
		|		ИНАЧЕ ЕСТЬNULL(ФормаВводаБюджетаБДДС.Сумма, 0) * &РазмерностьСумм
		|	КОНЕЦ КАК Сумма,
		|	ФормаВводаБюджетаБДДС.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
		|	ФормаВводаБюджетаБДДС.СтатьяОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент,
		|	0 КАК СуммаРегл,
		|	0 КАК СуммаУпр,
		|	0 КАК СуммаСценарий,
		|	ФормаВводаБюджетаБДДС.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.бит_ФормаВводаБюджетаБДДС КАК ФормаВводаБюджетаБДДС
		|ГДЕ
		|	ФормаВводаБюджетаБДДС.ДокументВладелец = &Ссылка
		|	И (&ОтборРасчетная = НЕОПРЕДЕЛЕНО
		|			ИЛИ ФормаВводаБюджетаБДДС.Расчетная = &ОтборРасчетная)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФормаВводаБюджетаЗависимыеОбороты.ПериодСтрокиДокумента,
		|	ФормаВводаБюджетаЗависимыеОбороты.ДокументВладелец.ВалютаДокумента,
		|	ФормаВводаБюджетаЗависимыеОбороты.ДокументВладелец.Сценарий,
		|	&ТекстВыборкиИзмеренийЗависимыеОбороты,
		|	ФормаВводаБюджетаЗависимыеОбороты.Количество,
		|	ФормаВводаБюджетаЗависимыеОбороты.Сумма,
		|	ФормаВводаБюджетаЗависимыеОбороты.СтатьяОборотов.СтавкаНДС,
		|	ФормаВводаБюджетаЗависимыеОбороты.СтатьяОборотов.ЭтоКоэффициент,
		|	0,
		|	0,
		|	0,
		|	ФормаВводаБюджетаЗависимыеОбороты.Комментарий
		|ИЗ
		|	РегистрСведений.бит_ФормаВводаБюджетаЗависимыеОбороты КАК ФормаВводаБюджетаЗависимыеОбороты
		|ГДЕ
		|	ФормаВводаБюджетаЗависимыеОбороты.ДокументВладелец = &Ссылка
		|	И (&ОтборРасчетная = НЕОПРЕДЕЛЕНО
		|			ИЛИ ФормаВводаБюджетаЗависимыеОбороты.Расчетная = &ОтборРасчетная)";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ФормаВводаБюджетаБДДС.Период КАК Период,
		|	ФормаВводаБюджетаБДДС.Ссылка.ВалютаДокумента КАК Валюта,
		|	ФормаВводаБюджетаБДДС.Ссылка.Сценарий КАК Сценарий,
		|	&ТекстВыборкиИзмеренийБДДС,
		|	ФормаВводаБюджетаБДДС.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ФормаВводаБюджетаБДДС.СтатьяОборотов.ЭтоКоэффициент = ИСТИНА
		|			ТОГДА ЕСТЬNULL(ФормаВводаБюджетаБДДС.Сумма, 0)
		|		ИНАЧЕ ЕСТЬNULL(ФормаВводаБюджетаБДДС.Сумма, 0) * &РазмерностьСумм
		|	КОНЕЦ КАК Сумма,
		|	ФормаВводаБюджетаБДДС.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
		|	ФормаВводаБюджетаБДДС.СтатьяОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент,
		|	0 КАК СуммаРегл,
		|	0 КАК СуммаУпр,
		|	0 КАК СуммаСценарий,
		|	ФормаВводаБюджетаБДДС.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.бит_ФормаВводаБюджета.БДДС КАК ФормаВводаБюджетаБДДС
		|ГДЕ
		|	ФормаВводаБюджетаБДДС.Ссылка = &Ссылка
		|	И (&ОтборРасчетная = НЕОПРЕДЕЛЕНО
		|			ИЛИ ФормаВводаБюджетаБДДС.Расчетная = &ОтборРасчетная)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФормаВводаБюджетаЗависимыеОбороты.Период,
		|	ФормаВводаБюджетаЗависимыеОбороты.Ссылка.ВалютаДокумента,
		|	ФормаВводаБюджетаЗависимыеОбороты.Ссылка.Сценарий,
		|	&ТекстВыборкиИзмеренийЗависимыеОбороты,
		|	ФормаВводаБюджетаЗависимыеОбороты.Количество,
		|	ФормаВводаБюджетаЗависимыеОбороты.Сумма,
		|	ФормаВводаБюджетаЗависимыеОбороты.СтатьяОборотов.СтавкаНДС,
		|	ФормаВводаБюджетаЗависимыеОбороты.СтатьяОборотов.ЭтоКоэффициент,
		|	0,
		|	0,
		|	0,
		|	ФормаВводаБюджетаЗависимыеОбороты.Комментарий
		|ИЗ
		|	Документ.бит_ФормаВводаБюджета.ЗависимыеОбороты КАК ФормаВводаБюджетаЗависимыеОбороты
		|ГДЕ
		|	ФормаВводаБюджетаЗависимыеОбороты.Ссылка = &Ссылка
		|	И (&ОтборРасчетная = НЕОПРЕДЕЛЕНО
		|			ИЛИ ФормаВводаБюджетаЗависимыеОбороты.Расчетная = &ОтборРасчетная)";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
					"&ТекстВыборкиИзмеренийБДДС,",
					ТекстВыборкиИзмеренийБДДС);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
					"&ТекстВыборкиИзмеренийЗависимыеОбороты,",
					ТекстВыборкиИзмеренийЗависимыеОбороты);
					
	ОтборРасчетная = Неопределено;
	ВидНастройки      = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаФормы, "Вид");
	Если ВидНастройки = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет Тогда
		Если РежимФормированияДвижений = Перечисления.бит_РежимыФормированияДвиженийФормыВвода.Расчетные Тогда
			ОтборРасчетная = Истина;
		ИначеЕсли РежимФормированияДвижений = Перечисления.бит_РежимыФормированияДвиженийФормыВвода.ИсключаяРасчетные Тогда
			ОтборРасчетная = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка"		   , Ссылка);			   
	Запрос.УстановитьПараметр("РазмерностьСумм", РазмерностьСумм);
	Запрос.УстановитьПараметр("ОтборРасчетная" , ОтборРасчетная);
	
	Результат = Запрос.Выполнить();
	ТаблицаБДДС = Результат.Выгрузить();
	
	// Получим таблицу периодов.
	КурсыПоПериодам = Неопределено;
	
	Если Сценарий.ИспользоватьКурсыСценария Тогда
		ТаблицаПериодов = Документы.бит_ФормаВводаБюджета.ДанныеТабличнойЧастиБДДС(Ссылка);
		ТаблицаПериодов.Свернуть("Период");
		// Установим настройки для получения курсов по периодам.
		СтруктураПараметров = бит_Бюджетирование.ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(Сценарий, ВалютаДокумента);
		// Получим курсы по периодам.
		КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураПараметров, Сценарий);
	КонецЕсли;
	бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(ТаблицаБДДС, КурсыПоПериодам, СтруктураКурсыВалют);
	Возврат ТаблицаБДДС;
	
КонецФункции
 
Процедура АктуализироватьКурсы()

	Если ЗначениеЗаполнено(Сценарий) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "ИспользоватьКурсыСценария") Тогда
		ДатаКурса = ДатаНачалаПланирования;
		СтрКурса			= бит_Бюджетирование.ПолучитьКурсПоСценарию(Сценарий, ВалютаДокумента, ДатаКурса);
		КурсДокумента		= СтрКурса.Курс;
		КратностьДокумента	= СтрКурса.Кратность;
	Иначе
		Если ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
			Возврат;
		КонецЕсли; 
		СтрКурса			= бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, ТекущаяДатаСеанса());
		КурсДокумента 		= СтрКурса.Курс;
		КратностьДокумента 	= СтрКурса.Кратность;
	КонецЕсли;
	
КонецПроцедуры

// Процедура очищает табличные части ЗависимыеОбороты и БДДС.
// 
Процедура ОчиститьТаблицы()
	
	ОчиститьЗависимыеОбороты();
	БДДС.Очистить();
	
КонецПроцедуры

// Функция определяет разрешен ли ручной ввод зависимых оборотов.
// 
// Возвращаемое значение:
//  ФлРазрешен   - Булево.
// 
Функция РазрешенРучнойВводЗависимыхОборотов()
	
	ФлРазрешен = ?(РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Ручной,Истина,Ложь);
	Возврат ФлРазрешен;
	
КонецФункции

// Функция определяет разрешен ли автоматический ввод зависимых оборотов.
// 
// Возвращаемое значение:
//  ФлРазрешен   - Булево.
// 
Функция РазрешенАвтоматическийВводЗависимыхОборотов()

	ФлРазрешен = ?(РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Автоматический,Истина,Ложь);
	Возврат ФлРазрешен;

КонецФункции

// Процедура удаляет строки зависимых оборотов, соответствующие указанной строке данных.
// 
// Параметры:
//  ТекущаяСтрока  - СтрокаТабличнойЧасти.БДДС.
// 
Процедура ОчиститьЗависимыеОборотыПоСтроке(ТекущаяСтрока)
	
	Если ТекущаяСтрока <> Неопределено Тогда
		 СтруктураОтбор = Новый Структура;
		 СтруктураОтбор.Вставить("ИД_Родитель",ТекущаяСтрока.ИД);
		 МассивСтрок = ЗависимыеОбороты.НайтиСтроки(СтруктураОтбор);
		 Для каждого СтрокаТаблицы Из МассивСтрок Цикл
		 	ЗависимыеОбороты.Удалить(СтрокаТаблицы);
		 КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область Инициализация

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

мИзмеренияДоп       = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
мИзмеренияВсе       = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все","синоним");
мНастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли