
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолноеИмяОбъекта = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ЭтотОбъект.ИмяФормы, Истина);
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКэшЗначений();
	
	ИзменениеВидаЗакрытия(Ложь);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидЗакрытияПриИзменении(Элемент)
	
	ИзменениеВидаЗакрытия(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурноеПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект
	                                                   ,Элемент
	                                                   ,Запись
	                                                   ,"СтруктурноеПодразделение"
													   ,фКэшЗначений.СписокТиповСтруктурноеПодразделение
													   ,СтандартнаяОбработка);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурноеПодразделениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет кэширование данных, необходимых для работы на клиенте. 
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	фКэшЗначений = Новый Структура;
	
	// Заполним список типов для быстрого выбора составного.
	МассивТипов  = Метаданные.РегистрыСведений.бит_НазначениеАлгоритмовЗакрытия.Измерения.СтруктурноеПодразделение.Тип.Типы();
	СписокВыбора = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	
	фКэшЗначений.Вставить("СписокТиповСтруктурноеПодразделение",СписокВыбора);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

// Процедура обрабатывает изменение види закрытия.
// 
&НаСервере
Процедура ИзменениеВидаЗакрытия(Очищать)
	
	Если ЗначениеЗаполнено(Запись.ВидЗакрытия) Тогда
		
		РегистрБухгалтерии = Запись.ВидЗакрытия.РегистрБухгалтерии;
		
		бит_ОбщегоНазначения.УстановитьСвязьПараметраВыбораЭлемента(Элементы.НастройкаЗакрытия,
			"Отбор.РегистрБухгалтерии", "РегистрБухгалтерии", РежимИзмененияСвязанногоЗначения.Очищать);
																				
		Если Очищать И Запись.ВидЗакрытия.РегистрБухгалтерии <> Запись.НастройкаЗакрытия.РегистрБухгалтерии Тогда			
			Запись.НастройкаЗакрытия = Неопределено;			
		КонецЕсли;
		
	Иначе	
		
		Элементы.НастройкаЗакрытия.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

