#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВариантыОтчетов
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ИнтеграцияИСПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	Совместимо = Истина;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.бит_кзн_ЗакрытиеДокументовПланирования КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	
	НомераТаблиц = Новый Структура;

	ТекстЗапроса = ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)
				 + ТекстЗапросаДокументыПланирования(НомераТаблиц)
				 + ТекстЗапросаПланируемыйРасходДенежныхСредств(НомераТаблиц)
				 + ТекстЗапросаПланируемоеПоступлениеДенежныхСредств(НомераТаблиц)
				 + ТекстЗапросаПланируемыеЗатраты(НомераТаблиц);
				 
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Процедура СформироватьКонтрольныеЗначенияБюджетов(ПараметрыПроведения, Движения) Экспорт
	
	СторноКонтрольныеЗначенияБюджетовПоДокументамРасходованияДенежныхСредств(ПараметрыПроведения, Движения);
	СторноКонтрольныеЗначенияБюджетовПоДокументамЗатрат(ПараметрыПроведения, Движения);
	
КонецПроцедуры

Процедура СформироватьПланируемыйРасходДенежныхСредств(ПланируемыйРасходДенежныхСредств, Реквизиты, Движения) Экспорт

	Если НЕ ЗначениеЗаполнено(ПланируемыйРасходДенежныхСредств) Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств");
	ЭлементБлокировки.ИсточникДанных = ПланируемыйРасходДенежныхСредств;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументПланирования","ДокументПланирования");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Позиция","Позиция");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;	
	Блокировка.Заблокировать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредствАналитика");
	ЭлементБлокировки.ИсточникДанных = ПланируемыйРасходДенежныхСредств;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументПланирования","ДокументПланирования");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Позиция","Позиция");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;	
	Блокировка.Заблокировать();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментДокумента"		  , Новый МоментВремени(Реквизиты.Период, Реквизиты.Регистратор));
	Запрос.УстановитьПараметр("ДокументыПланирования" , ПланируемыйРасходДенежныхСредств);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	ДокументыПланирования.Позиция КАК Позиция
	|ПОМЕСТИТЬ ДокументыПланирования
	|ИЗ
	|	&ДокументыПланирования КАК ДокументыПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланируемыйРасходДенежныхСредств.Организация КАК Организация,
	|	ПланируемыйРасходДенежныхСредств.ДокументПланирования КАК ДокументПланирования,
	|	ПланируемыйРасходДенежныхСредств.СуммаОстаток КАК Сумма,
	|	ПланируемыйРасходДенежныхСредств.ВидПлана КАК ВидПлана,
	|	ПланируемыйРасходДенежныхСредств.Позиция КАК Позиция
	|ИЗ
	|	РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств.Остатки(
	|			&МоментДокумента,
	|			(ДокументПланирования, Позиция) В
	|				(ВЫБРАТЬ
	|					ДокументыПланирования.ДокументПланирования,
	|					ДокументыПланирования.Позиция
	|				ИЗ
	|					ДокументыПланирования КАК ДокументыПланирования)) КАК ПланируемыйРасходДенежныхСредств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	ДокументыПланирования.Позиция КАК Позиция,
	|	РасширенныйПланируемыйРасход.Организация КАК Организация,
	|	РасширенныйПланируемыйРасход.ВидПлана КАК ВидПлана,
	|	РасширенныйПланируемыйРасход.ВидДенежныхСредств КАК ВидДенежныхСредств,
	|	РасширенныйПланируемыйРасход.Валюта КАК Валюта,
	|	РасширенныйПланируемыйРасход.ЦФО КАК ЦФО,
	|	РасширенныйПланируемыйРасход.СтатьяОборотов КАК СтатьяОборотов,
	|	РасширенныйПланируемыйРасход.БанковскийСчет КАК БанковскийСчет,
	|	РасширенныйПланируемыйРасход.Аналитика_1 КАК Аналитика_1,
	|	РасширенныйПланируемыйРасход.Аналитика_2 КАК Аналитика_2,
	|	РасширенныйПланируемыйРасход.Аналитика_3 КАК Аналитика_3,
	|	РасширенныйПланируемыйРасход.Аналитика_4 КАК Аналитика_4,
	|	РасширенныйПланируемыйРасход.Аналитика_5 КАК Аналитика_5,
	|	РасширенныйПланируемыйРасход.Аналитика_6 КАК Аналитика_6,
	|	РасширенныйПланируемыйРасход.Аналитика_7 КАК Аналитика_7,
	|	РасширенныйПланируемыйРасход.Аналитика_8 КАК Аналитика_8,
	|	РасширенныйПланируемыйРасход.Аналитика_9 КАК Аналитика_9,
	|	РасширенныйПланируемыйРасход.Аналитика_10 КАК Аналитика_10,
	|	РасширенныйПланируемыйРасход.Аналитика_11 КАК Аналитика_11,
	|	РасширенныйПланируемыйРасход.Аналитика_12 КАК Аналитика_12,
	|	СУММА(ЕСТЬNULL(РасширенныйПланируемыйРасход.Сумма, 0)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(РасширенныйПланируемыйРасход.СуммаОплаты, 0)) КАК СуммаОплаты,
	|	СУММА(ЕСТЬNULL(РасширенныйПланируемыйРасход.СуммаРегл, 0)) КАК СуммаРегл,
	|	СУММА(ЕСТЬNULL(РасширенныйПланируемыйРасход.СуммаУпр, 0)) КАК СуммаУпр
	|ИЗ
	|	ДокументыПланирования КАК ДокументыПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредствАналитика КАК РасширенныйПланируемыйРасход
	|		ПО ДокументыПланирования.Позиция = РасширенныйПланируемыйРасход.Регистратор
	|			И (РасширенныйПланируемыйРасход.Регистратор ССЫЛКА Документ.бит_кзн_ПлатежнаяПозиция)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасширенныйПланируемыйРасход.Аналитика_10,
	|	РасширенныйПланируемыйРасход.Аналитика_11,
	|	РасширенныйПланируемыйРасход.Аналитика_12,
	|	РасширенныйПланируемыйРасход.Аналитика_4,
	|	РасширенныйПланируемыйРасход.БанковскийСчет,
	|	РасширенныйПланируемыйРасход.Аналитика_5,
	|	РасширенныйПланируемыйРасход.Аналитика_2,
	|	ДокументыПланирования.Позиция,
	|	РасширенныйПланируемыйРасход.Валюта,
	|	РасширенныйПланируемыйРасход.ВидПлана,
	|	РасширенныйПланируемыйРасход.ВидДенежныхСредств,
	|	РасширенныйПланируемыйРасход.ЦФО,
	|	РасширенныйПланируемыйРасход.Организация,
	|	РасширенныйПланируемыйРасход.Аналитика_3,
	|	РасширенныйПланируемыйРасход.Аналитика_8,
	|	РасширенныйПланируемыйРасход.Аналитика_9,
	|	РасширенныйПланируемыйРасход.Аналитика_7,
	|	РасширенныйПланируемыйРасход.Аналитика_6,
	|	РасширенныйПланируемыйРасход.СтатьяОборотов,
	|	РасширенныйПланируемыйРасход.Аналитика_1,
	|	ДокументыПланирования.ДокументПланирования";
	
	РезультатПакета 			 = Запрос.ВыполнитьПакет();
	ПланируемыйРасход			 = РезультатПакета[1].Выгрузить();
	РасширенныйПланируемыйРасход = РезультатПакета[2].Выгрузить();
	
	Для каждого СтрокаТаблицы Из ПланируемыйРасход Цикл
		НоваяСтрока = Движения.бит_кзн_ПланируемыйРасходДенежныхСредств.Добавить();
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
		
		РезультатПоиска = РасширенныйПланируемыйРасход.Скопировать(Новый Структура("Позиция", СтрокаТаблицы.Позиция));
		Если ЗначениеЗаполнено(РезультатПоиска) И РезультатПоиска.Итог("Сумма") <> 0 Тогда
			
			Коэффициент = Окр(СтрокаТаблицы.Сумма / РезультатПоиска.Итог("Сумма"), 2);
			
			Ресурсы = Новый Массив;
			Ресурсы.Добавить("Сумма");
			Ресурсы.Добавить("СуммаОплаты");
			Ресурсы.Добавить("СуммаРегл");
			Ресурсы.Добавить("СуммаУпр");
			
			Для каждого Ресурс Из Ресурсы Цикл
				РаспределяемаяСумма =  - РезультатПоиска.Итог(Ресурс) * Коэффициент;
				Если РаспределяемаяСумма <> 0 Тогда
					КоэффициентыРаспределения = РезультатПоиска.ВыгрузитьКолонку(Ресурс);
					РезультатРаспределения 	  = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
													РаспределяемаяСумма, КоэффициентыРаспределения, 2);
					РезультатПоиска.ЗагрузитьКолонку(РезультатРаспределения, Ресурс);								
				КонецЕсли;
			КонецЦикла;
													
			Для каждого Запись Из РезультатПоиска Цикл
				НоваяСтрока = Движения.бит_кзн_ПланируемыйРасходДенежныхСредствАналитика.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Движения.бит_кзн_ПланируемыйРасходДенежныхСредств.Записывать = Истина;
	Движения.бит_кзн_ПланируемыйРасходДенежныхСредствАналитика.Записывать = Истина;

КонецПроцедуры

Процедура СформироватьПланируемоеПоступлениеДенежныхСредств(ПланируемоеПоступлениеДенежныхСредств, Реквизиты, Движения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПланируемоеПоступлениеДенежныхСредств) Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств");
	ЭлементБлокировки.ИсточникДанных = ПланируемоеПоступлениеДенежныхСредств;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументПланирования","ДокументПланирования");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Позиция","Позиция");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;	
	Блокировка.Заблокировать();

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредствАналитика");
	ЭлементБлокировки.ИсточникДанных = ПланируемоеПоступлениеДенежныхСредств;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументПланирования","ДокументПланирования");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Позиция","Позиция");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;	
	Блокировка.Заблокировать();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментДокумента"		  , Новый МоментВремени(Реквизиты.Период, Реквизиты.Регистратор));
	Запрос.УстановитьПараметр("ДокументыПланирования" , ПланируемоеПоступлениеДенежныхСредств);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	ДокументыПланирования.Позиция КАК Позиция
	|ПОМЕСТИТЬ ДокументыПланирования
	|ИЗ
	|	&ДокументыПланирования КАК ДокументыПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПланируемоеПоступление.ДокументПланирования ССЫЛКА Документ.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию
	|			ТОГДА ПланируемоеПоступление.ДокументПланирования.ОрганизацияПолучатель
	|		ИНАЧЕ ПланируемоеПоступление.Организация
	|	КОНЕЦ КАК Организация,
	|	ПланируемоеПоступление.ДокументПланирования КАК ДокументПланирования,
	|	ПланируемоеПоступление.СуммаОстаток КАК Сумма,
	|	ПланируемоеПоступление.ВидПлана КАК ВидПлана,
	|	ПланируемоеПоступление.Позиция КАК Позиция
	|ИЗ
	|	РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.Остатки(
	|			&МоментДокумента,
	|			(ДокументПланирования, Позиция) В
	|				(ВЫБРАТЬ
	|					ДокументыПланирования.ДокументПланирования,
	|					ДокументыПланирования.Позиция
	|				ИЗ
	|					ДокументыПланирования КАК ДокументыПланирования)) КАК ПланируемоеПоступление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	ДокументыПланирования.Позиция КАК Позиция,
	|	РасширенноеПланируемоеПоступление.Организация КАК Организация,
	|	РасширенноеПланируемоеПоступление.ВидПлана КАК ВидПлана,
	|	РасширенноеПланируемоеПоступление.ВидДенежныхСредств КАК ВидДенежныхСредств,
	|	РасширенноеПланируемоеПоступление.Валюта КАК Валюта,
	|	РасширенноеПланируемоеПоступление.ЦФО КАК ЦФО,
	|	РасширенноеПланируемоеПоступление.СтатьяОборотов КАК СтатьяОборотов,
	|	РасширенноеПланируемоеПоступление.БанковскийСчет КАК БанковскийСчет,
	|	РасширенноеПланируемоеПоступление.Аналитика_1 КАК Аналитика_1,
	|	РасширенноеПланируемоеПоступление.Аналитика_2 КАК Аналитика_2,
	|	РасширенноеПланируемоеПоступление.Аналитика_3 КАК Аналитика_3,
	|	РасширенноеПланируемоеПоступление.Аналитика_4 КАК Аналитика_4,
	|	РасширенноеПланируемоеПоступление.Аналитика_5 КАК Аналитика_5,
	|	РасширенноеПланируемоеПоступление.Аналитика_6 КАК Аналитика_6,
	|	РасширенноеПланируемоеПоступление.Аналитика_7 КАК Аналитика_7,
	|	РасширенноеПланируемоеПоступление.Аналитика_8 КАК Аналитика_8,
	|	РасширенноеПланируемоеПоступление.Аналитика_9 КАК Аналитика_9,
	|	РасширенноеПланируемоеПоступление.Аналитика_10 КАК Аналитика_10,
	|	РасширенноеПланируемоеПоступление.Аналитика_11 КАК Аналитика_11,
	|	РасширенноеПланируемоеПоступление.Аналитика_12 КАК Аналитика_12,
	|	СУММА(ЕСТЬNULL(РасширенноеПланируемоеПоступление.Сумма, 0)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(РасширенноеПланируемоеПоступление.СуммаОплаты, 0)) КАК СуммаОплаты,
	|	СУММА(ЕСТЬNULL(РасширенноеПланируемоеПоступление.СуммаРегл, 0)) КАК СуммаРегл,
	|	СУММА(ЕСТЬNULL(РасширенноеПланируемоеПоступление.СуммаУпр, 0)) КАК СуммаУпр
	|ИЗ
	|	ДокументыПланирования КАК ДокументыПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредствАналитика КАК РасширенноеПланируемоеПоступление
	|		ПО ДокументыПланирования.Позиция = РасширенноеПланируемоеПоступление.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	РасширенноеПланируемоеПоступление.Аналитика_10,
	|	РасширенноеПланируемоеПоступление.Аналитика_11,
	|	РасширенноеПланируемоеПоступление.Аналитика_12,
	|	РасширенноеПланируемоеПоступление.Аналитика_4,
	|	РасширенноеПланируемоеПоступление.БанковскийСчет,
	|	РасширенноеПланируемоеПоступление.Аналитика_5,
	|	РасширенноеПланируемоеПоступление.Аналитика_2,
	|	ДокументыПланирования.Позиция,
	|	РасширенноеПланируемоеПоступление.Валюта,
	|	РасширенноеПланируемоеПоступление.ВидПлана,
	|	РасширенноеПланируемоеПоступление.ВидДенежныхСредств,
	|	РасширенноеПланируемоеПоступление.ЦФО,
	|	РасширенноеПланируемоеПоступление.Организация,
	|	РасширенноеПланируемоеПоступление.Аналитика_3,
	|	РасширенноеПланируемоеПоступление.Аналитика_8,
	|	РасширенноеПланируемоеПоступление.Аналитика_9,
	|	РасширенноеПланируемоеПоступление.Аналитика_7,
	|	РасширенноеПланируемоеПоступление.Аналитика_6,
	|	РасширенноеПланируемоеПоступление.СтатьяОборотов,
	|	РасширенноеПланируемоеПоступление.Аналитика_1,
	|	ДокументыПланирования.ДокументПланирования";

	РезультатПакета 			 = Запрос.ВыполнитьПакет();
	ПланируемыйРасход			 = РезультатПакета[1].Выгрузить();
	РасширенныйПланируемыйРасход = РезультатПакета[2].Выгрузить();
	
	Для каждого СтрокаТаблицы Из ПланируемыйРасход Цикл
		НоваяСтрока = Движения.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.Добавить();
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
		
		РезультатПоиска = РасширенныйПланируемыйРасход.Скопировать(Новый Структура("Позиция", СтрокаТаблицы.Позиция));
		Если ЗначениеЗаполнено(РезультатПоиска) И РезультатПоиска.Итог("Сумма") <> 0 Тогда
			
			Коэффициент = Окр(СтрокаТаблицы.Сумма / РезультатПоиска.Итог("Сумма"), 2);
			
			Ресурсы = Новый Массив;
			Ресурсы.Добавить("Сумма");
			Ресурсы.Добавить("СуммаОплаты");
			Ресурсы.Добавить("СуммаРегл");
			Ресурсы.Добавить("СуммаУпр");
			
			Для каждого Ресурс Из Ресурсы Цикл
				РаспределяемаяСумма =  - РезультатПоиска.Итог(Ресурс) * Коэффициент;
				Если РаспределяемаяСумма <> 0 Тогда
					КоэффициентыРаспределения = РезультатПоиска.ВыгрузитьКолонку(Ресурс);
					РезультатРаспределения 	  = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
													РаспределяемаяСумма, КоэффициентыРаспределения, 2);
					РезультатПоиска.ЗагрузитьКолонку(РезультатРаспределения, Ресурс);								
				КонецЕсли;
			КонецЦикла;
													
			Для каждого Запись Из РезультатПоиска Цикл
				НоваяСтрока = Движения.бит_кзн_ПланируемоеПоступлениеДенежныхСредствАналитика.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Движения.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.Записывать 		   = Истина;
	Движения.бит_кзн_ПланируемоеПоступлениеДенежныхСредствАналитика.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьПланируемыеЗатраты(ПланируемыеЗатраты, Реквизиты, Движения) Экспорт

	Если НЕ ЗначениеЗаполнено(ПланируемыеЗатраты) Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.бит_пз_ПланируемыеЗатраты");
	ЭлементБлокировки.ИсточникДанных = ПланируемыеЗатраты;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументПланирования","ДокументПланирования");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЗаявкаНаЗатраты","ЗаявкаНаЗатраты");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;	
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментВремени"		  , Новый МоментВремени(Реквизиты.Период, Реквизиты.Регистратор));
	Запрос.УстановитьПараметр("ДокументыПланирования" , ПланируемыеЗатраты);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	ДокументыПланирования.ЗаявкаНаЗатраты КАК ЗаявкаНаЗатраты
	|ПОМЕСТИТЬ ДокументыПланирования
	|ИЗ
	|	&ДокументыПланирования КАК ДокументыПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланируемыеЗатраты.ДокументПланирования КАК ДокументПланирования,
	|	ПланируемыеЗатраты.Номенклатура КАК Номенклатура,
	|	ПланируемыеЗатраты.Организация КАК Организация,
	|	ПланируемыеЗатраты.ЗаявкаНаЗатраты КАК ЗаявкаНаЗатраты,
	|	ПланируемыеЗатраты.Характеристика КАК Характеристика,
	|	ПланируемыеЗатраты.КоличествоОстаток КАК Количество,
	|	ПланируемыеЗатраты.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.бит_пз_ПланируемыеЗатраты.Остатки(
	|			&МоментВремени,
	|			(ДокументПланирования, ЗаявкаНаЗатраты) В
	|				(ВЫБРАТЬ
	|					ДокументыПланирования.ДокументПланирования,
	|					ДокументыПланирования.ЗаявкаНаЗатраты
	|				ИЗ
	|					ДокументыПланирования КАК ДокументыПланирования)) КАК ПланируемыеЗатраты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.бит_пз_ПланируемыеЗатраты.Добавить();
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);	
	КонецЦикла; 
	Движения.бит_пз_ПланируемыеЗатраты.Записывать = Истина;
	
КонецПроцедуры
	
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВременнаяТаблицаДокументыПланирования", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДокументыПланирования.НомерСтроки КАК НомерСтроки,
	|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	ДокументыПланирования.ПричинаЗакрытия КАК ПричинаЗакрытия
	|ПОМЕСТИТЬ ВременнаяТаблицаДокументыПланирования
	|ИЗ
	|	Документ.бит_кзн_ЗакрытиеДокументовПланирования.ДокументыПланирования КАК ДокументыПланирования
	|ГДЕ
	|	ДокументыПланирования.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаДокументыПланирования(НомераТаблиц)
	
	НомераТаблиц.Вставить("ДокументыПланирования", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.ДокументПланирования КАК ДокументПланирования,
	|	Таблица.ПричинаЗакрытия КАК ПричинаЗакрытия
	|ИЗ
	|	ВременнаяТаблицаДокументыПланирования КАК Таблица
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаПланируемыйРасходДенежныхСредств(НомераТаблиц)
	
	НомераТаблиц.Вставить("ПланируемыйРасходДенежныхСредств", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Позиция КАК Позиция,
	|	Таблица.ДокументПланирования КАК ДокументПланирования
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПлатежнаяПозиция.Ссылка КАК Позиция,
	|		ПлатежнаяПозиция.ДокументПланирования КАК ДокументПланирования
	|	ИЗ
	|		ВременнаяТаблицаДокументыПланирования КАК ВременнаяТаблицаДокументыПланирования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежнаяПозиция
	|			ПО ВременнаяТаблицаДокументыПланирования.ДокументПланирования = ПлатежнаяПозиция.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		бит_кзн_ПлатежнаяПозиция.Ссылка,
	|		ВременнаяТаблицаДокументыПланирования.ДокументПланирования
	|	ИЗ
	|		ВременнаяТаблицаДокументыПланирования КАК ВременнаяТаблицаДокументыПланирования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПлатежнаяПозиция КАК бит_кзн_ПлатежнаяПозиция
	|			ПО ВременнаяТаблицаДокументыПланирования.ДокументПланирования = бит_кзн_ПлатежнаяПозиция.ДокументПланирования) КАК Таблица";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаПланируемоеПоступлениеДенежныхСредств(НомераТаблиц)
	
	НомераТаблиц.Вставить("ПланируемоеПоступлениеДенежныхСредств", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Позиция КАК Позиция,
	|	Таблица.ДокументПланирования КАК ДокументПланирования
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПозицияПоступления.Ссылка КАК Позиция,
	|		ПозицияПоступления.ДокументПланирования КАК ДокументПланирования
	|	ИЗ
	|		ВременнаяТаблицаДокументыПланирования КАК ВременнаяТаблицаДокументыПланирования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПозицияПоступления КАК ПозицияПоступления
	|			ПО ВременнаяТаблицаДокументыПланирования.ДокументПланирования = ПозицияПоступления.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПозицияПоступления.Ссылка,
	|		ВременнаяТаблицаДокументыПланирования.ДокументПланирования
	|	ИЗ
	|		ВременнаяТаблицаДокументыПланирования КАК ВременнаяТаблицаДокументыПланирования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПозицияПоступления КАК ПозицияПоступления
	|			ПО ВременнаяТаблицаДокументыПланирования.ДокументПланирования = ПозицияПоступления.ДокументПланирования) КАК Таблица";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаПланируемыеЗатраты(НомераТаблиц)
	
	НомераТаблиц.Вставить("ПланируемыеЗатраты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.ДокументПланирования КАК ДокументПланирования,
	|	Таблица.ЗаявкаНаЗатраты КАК ЗаявкаНаЗатраты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаявкаНаЗатраты.Ссылка КАК ДокументПланирования,
	|		ЗаявкаНаЗатраты.Ссылка КАК ЗаявкаНаЗатраты
	|	ИЗ
	|		ВременнаяТаблицаДокументыПланирования КАК ВременнаяТаблицаДокументыПланирования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_пз_ЗаявкаНаЗатраты КАК ЗаявкаНаЗатраты
	|			ПО ВременнаяТаблицаДокументыПланирования.ДокументПланирования = ЗаявкаНаЗатраты.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаявкиНаЗатраты.Ссылка,
	|		ЗаявкиНаЗатраты.ЗаявкаНаЗатраты
	|	ИЗ
	|		ВременнаяТаблицаДокументыПланирования КАК ВременнаяТаблицаДокументыПланирования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_пз_СводнаяЗаявкаНаЗатраты.ЗаявкиНаЗатраты КАК ЗаявкиНаЗатраты
	|			ПО ВременнаяТаблицаДокументыПланирования.ДокументПланирования = ЗаявкиНаЗатраты.Ссылка) КАК Таблица";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Процедура СторноКонтрольныеЗначенияБюджетовПоДокументамРасходованияДенежныхСредств(ТаблицыДокумента, Движения) 
	
	Реквизиты		 = ТаблицыДокумента.Реквизиты;
	ПлатежныеПозиции = ТаблицыДокумента.ПланируемыйРасходДенежныхСредств;
	
	Если НЕ ЗначениеЗаполнено(ПлатежныеПозиции) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(); 
	Запрос.УстановитьПараметр("Позиции",ПлатежныеПозиции.ВыгрузитьКолонку("Позиция"));
	Запрос.УстановитьПараметр("Заявки", ПлатежныеПозиции.ВыгрузитьКолонку("ДокументПланирования"));
	Запрос.УстановитьПараметр("Период", Новый МоментВремени(Реквизиты.Период, Реквизиты.Регистратор)); 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежныеПозиции.Ссылка КАК Ссылка,
	|	ПлатежныеПозиции.ДатаПлан КАК Период
	|ПОМЕСТИТЬ ПлатежныеПозиции
	|ИЗ
	|	Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежныеПозиции
	|ГДЕ
	|	ПлатежныеПозиции.Ссылка В(&Позиции)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланируемыйРасходДенежныхСредств.Позиция КАК Позиция,
	|	ВЫБОР
	|		КОГДА ПланируемыйРасходДенежныхСредств.СуммаРасход = 0
	|			ТОГДА 1
	|		КОГДА ПланируемыйРасходДенежныхСредств.СуммаРасход > ПланируемыйРасходДенежныхСредств.СуммаПриход
	|			ТОГДА 0
	|		ИНАЧЕ 1 - ПланируемыйРасходДенежныхСредств.СуммаРасход / ПланируемыйРасходДенежныхСредств.СуммаПриход
	|	КОНЕЦ КАК КоэффициентСписания
	|ПОМЕСТИТЬ ВТ_КоэффициентыСписания
	|ИЗ
	|	РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств.Обороты(
	|			,
	|			&Период,
	|			,
	|			Позиция В
	|				(ВЫБРАТЬ
	|					ПлатежныеПозиции.Ссылка
	|				ИЗ
	|					ПлатежныеПозиции КАК ПлатежныеПозиции)) КАК ПланируемыйРасходДенежныхСредств
	|ГДЕ
	|	ПланируемыйРасходДенежныхСредств.СуммаРасход < ПланируемыйРасходДенежныхСредств.СуммаПриход
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Позиция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрольныеЗначенияБюджетов.ЦФО КАК ЦФО,
	|	КонтрольныеЗначенияБюджетов.СтатьяОборотов КАК СтатьяОборотов,
	|	КонтрольныеЗначенияБюджетов.Аналитика_1 КАК Аналитика_1,
	|	КонтрольныеЗначенияБюджетов.Аналитика_2 КАК Аналитика_2,
	|	КонтрольныеЗначенияБюджетов.Аналитика_3 КАК Аналитика_3,
	|	КонтрольныеЗначенияБюджетов.Аналитика_4 КАК Аналитика_4,
	|	КонтрольныеЗначенияБюджетов.Аналитика_5 КАК Аналитика_5,
	|	КонтрольныеЗначенияБюджетов.Аналитика_6 КАК Аналитика_6,
	|	КонтрольныеЗначенияБюджетов.Аналитика_7 КАК Аналитика_7,
	|	КонтрольныеЗначенияБюджетов.Аналитика_8 КАК Аналитика_8,
	|	КонтрольныеЗначенияБюджетов.Аналитика_9 КАК Аналитика_9,
	|	КонтрольныеЗначенияБюджетов.Аналитика_10 КАК Аналитика_10,
	|	КонтрольныеЗначенияБюджетов.Аналитика_11 КАК Аналитика_11,
	|	КонтрольныеЗначенияБюджетов.Аналитика_12 КАК Аналитика_12,
	|	СУММА(КонтрольныеЗначенияБюджетов.СуммаСценарийИсполнение + КонтрольныеЗначенияБюджетов.СуммаСценарийСверхЛимита) * ВТ_КоэффициентыСписания.КоэффициентСписания КАК Сумма,
	|	ПлатежныеПозиции.Ссылка КАК ДокументПланирования,
	|	ПлатежныеПозиции.Период КАК Период,
	|	0 КАК Количество,
	|	ИСТИНА КАК КонтролироватьСумму,
	|	ЛОЖЬ КАК КонтролироватьКоличество,
	|	НЕ КонтрольныеЗначенияБюджетов.СтатьяОборотов.НеКонтролировать_Заявки КАК КонтролироватьПоСтатье,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(25)) КАК ИмяСписка,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(25)) КАК СинонимСписка,
	|	1 КАК НомерСтроки
	|ИЗ
	|	ПлатежныеПозиции КАК ПлатежныеПозиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоэффициентыСписания КАК ВТ_КоэффициентыСписания
	|		ПО ПлатежныеПозиции.Ссылка = ВТ_КоэффициентыСписания.Позиция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бит_КонтрольныеЗначенияБюджетов КАК КонтрольныеЗначенияБюджетов
	|		ПО (ВТ_КоэффициентыСписания.Позиция = КонтрольныеЗначенияБюджетов.Регистратор)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтрольныеЗначенияБюджетов.Аналитика_11,
	|	КонтрольныеЗначенияБюджетов.Аналитика_1,
	|	КонтрольныеЗначенияБюджетов.Аналитика_10,
	|	КонтрольныеЗначенияБюджетов.Аналитика_8,
	|	КонтрольныеЗначенияБюджетов.Аналитика_2,
	|	КонтрольныеЗначенияБюджетов.Аналитика_12,
	|	КонтрольныеЗначенияБюджетов.Аналитика_6,
	|	КонтрольныеЗначенияБюджетов.Аналитика_7,
	|	КонтрольныеЗначенияБюджетов.Аналитика_4,
	|	КонтрольныеЗначенияБюджетов.Аналитика_3,
	|	КонтрольныеЗначенияБюджетов.ЦФО,
	|	КонтрольныеЗначенияБюджетов.Аналитика_9,
	|	КонтрольныеЗначенияБюджетов.Аналитика_5,
	|	КонтрольныеЗначенияБюджетов.СтатьяОборотов,
	|	ПлатежныеПозиции.Период,
	|	ПлатежныеПозиции.Ссылка,
	|	ВТ_КоэффициентыСписания.КоэффициентСписания,
	|	НЕ КонтрольныеЗначенияБюджетов.СтатьяОборотов.НеКонтролировать_Заявки";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОбработатьДанныеДляСторноКонтрольныеЗначенияБюджетов(Результат, Движения);
	
КонецПроцедуры

Процедура СторноКонтрольныеЗначенияБюджетовПоДокументамЗатрат(ТаблицыДокумента, Движения) 
	
	Реквизиты		   = ТаблицыДокумента.Реквизиты;
	ПланируемыеЗатраты = ТаблицыДокумента.ПланируемыеЗатраты;
	
	Если НЕ ЗначениеЗаполнено(ПланируемыеЗатраты) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(); 
	Запрос.УстановитьПараметр("ЗаявкиНаЗатраты",ПланируемыеЗатраты.ВыгрузитьКолонку("ЗаявкаНаЗатраты"));
	Запрос.УстановитьПараметр("ДокументыПланирования", ПланируемыеЗатраты.ВыгрузитьКолонку("ДокументПланирования"));
	Запрос.УстановитьПараметр("Период", Новый МоментВремени(Реквизиты.Период, Реквизиты.Регистратор)); 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкиНаЗатраты.Ссылка КАК Ссылка,
	|	ЗаявкиНаЗатраты.КурсДокумента КАК КурсДокумента,
	|	ЗаявкиНаЗатраты.КратностьДокумента КАК КратностьДокумента,
	|	ЗаявкиНаЗатраты.Сценарий КАК Сценарий,
	|	ЗаявкиНаЗатраты.Сценарий.Валюта КАК ВалютаСценария,
	|	ЗаявкиНаЗатраты.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗаявкиНаЗатраты.Организация КАК Организация,
	|	ЗаявкиНаЗатраты.Дата КАК Дата
	|ПОМЕСТИТЬ ЗаявкиНаЗатраты
	|ИЗ
	|	Документ.бит_пз_ЗаявкаНаЗатраты КАК ЗаявкиНаЗатраты
	|ГДЕ
	|	ЗаявкиНаЗатраты.Ссылка В(&ЗаявкиНаЗатраты)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводныеЗаявкиНаЗатраты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СводныеЗаявкиНаЗатраты
	|ИЗ
	|	Документ.бит_пз_СводнаяЗаявкаНаЗатраты КАК СводныеЗаявкиНаЗатраты
	|ГДЕ
	|	СводныеЗаявкиНаЗатраты.Ссылка В(&ДокументыПланирования)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланируемыеЗатраты.ЗаявкаНаЗатраты КАК ЗаявкаНаЗатраты,
	|	ВЫБОР
	|		КОГДА ПланируемыеЗатраты.КоличествоРасход = 0
	|			ТОГДА 1
	|		КОГДА ПланируемыеЗатраты.КоличествоРасход > ПланируемыеЗатраты.КоличествоПриход
	|			ТОГДА 0
	|		ИНАЧЕ 1 - ПланируемыеЗатраты.КоличествоРасход / ПланируемыеЗатраты.КоличествоПриход
	|	КОНЕЦ КАК КоэффициентКоличество,
	|	ВЫБОР
	|		КОГДА ПланируемыеЗатраты.СуммаРасход = 0
	|			ТОГДА 1
	|		КОГДА ПланируемыеЗатраты.СуммаРасход > ПланируемыеЗатраты.СуммаПриход
	|			ТОГДА 0
	|		ИНАЧЕ 1 - ПланируемыеЗатраты.СуммаРасход / ПланируемыеЗатраты.СуммаПриход
	|	КОНЕЦ КАК КоэффициентСумма
	|ПОМЕСТИТЬ ВТ_КоэффициентыСписания
	|ИЗ
	|	РегистрНакопления.бит_пз_ПланируемыеЗатраты.Обороты(
	|			,
	|			&Период,
	|			,
	|			ДокументПланирования В
	|				(ВЫБРАТЬ
	|					ЗаявкиНаЗатраты.Ссылка КАК Ссылка
	|				ИЗ
	|					ЗаявкиНаЗатраты КАК ЗаявкиНаЗатраты)) КАК ПланируемыеЗатраты
	|ГДЕ
	|	(ПланируемыеЗатраты.КоличествоРасход < ПланируемыеЗатраты.КоличествоПриход
	|			ИЛИ ПланируемыеЗатраты.СуммаРасход < ПланируемыеЗатраты.СуммаПриход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПланируемыеЗатраты.ЗаявкаНаЗатраты,
	|	ВЫБОР
	|		КОГДА ПланируемыеЗатраты.КоличествоРасход = 0
	|			ТОГДА 1
	|		КОГДА ПланируемыеЗатраты.КоличествоРасход > ПланируемыеЗатраты.КоличествоПриход
	|			ТОГДА 0
	|		ИНАЧЕ 1 - ПланируемыеЗатраты.КоличествоРасход / ПланируемыеЗатраты.КоличествоПриход
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПланируемыеЗатраты.СуммаРасход = 0
	|			ТОГДА 1
	|		КОГДА ПланируемыеЗатраты.СуммаРасход > ПланируемыеЗатраты.СуммаПриход
	|			ТОГДА 0
	|		ИНАЧЕ 1 - ПланируемыеЗатраты.СуммаРасход / ПланируемыеЗатраты.СуммаПриход
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.бит_пз_ПланируемыеЗатраты.Обороты(
	|			,
	|			&Период,
	|			,
	|			ЗаявкаНаЗатраты В
	|					(ВЫБРАТЬ
	|						ЗаявкиНаЗатраты.Ссылка КАК Ссылка
	|					ИЗ
	|						ЗаявкиНаЗатраты КАК ЗаявкиНаЗатраты)
	|				И ДокументПланирования В
	|					(ВЫБРАТЬ
	|						ВТ_СводныеЗаявкиНаЗатраты.Ссылка КАК Ссылка
	|					ИЗ
	|						ВТ_СводныеЗаявкиНаЗатраты КАК ВТ_СводныеЗаявкиНаЗатраты)) КАК ПланируемыеЗатраты
	|ГДЕ
	|	(ПланируемыеЗатраты.КоличествоРасход < ПланируемыеЗатраты.КоличествоПриход
	|			ИЛИ ПланируемыеЗатраты.СуммаРасход < ПланируемыеЗатраты.СуммаПриход)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаявкаНаЗатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаЗатраты.Ссылка КАК ДокументПланирования,
	|	ЗаявкиНаЗатраты.Дата КАК Период,
	|	КонтрольныеЗначенияБюджетов.ЦФО КАК ЦФО,
	|	КонтрольныеЗначенияБюджетов.СтатьяОборотов КАК СтатьяОборотов,
	|	КонтрольныеЗначенияБюджетов.Аналитика_1 КАК Аналитика_1,
	|	КонтрольныеЗначенияБюджетов.Аналитика_2 КАК Аналитика_2,
	|	КонтрольныеЗначенияБюджетов.Аналитика_3 КАК Аналитика_3,
	|	КонтрольныеЗначенияБюджетов.Аналитика_4 КАК Аналитика_4,
	|	КонтрольныеЗначенияБюджетов.Аналитика_5 КАК Аналитика_5,
	|	КонтрольныеЗначенияБюджетов.Аналитика_6 КАК Аналитика_6,
	|	КонтрольныеЗначенияБюджетов.Аналитика_7 КАК Аналитика_7,
	|	КонтрольныеЗначенияБюджетов.Аналитика_8 КАК Аналитика_8,
	|	КонтрольныеЗначенияБюджетов.Аналитика_9 КАК Аналитика_9,
	|	КонтрольныеЗначенияБюджетов.Аналитика_10 КАК Аналитика_10,
	|	КонтрольныеЗначенияБюджетов.Аналитика_11 КАК Аналитика_11,
	|	КонтрольныеЗначенияБюджетов.Аналитика_12 КАК Аналитика_12,
	|	СУММА(КонтрольныеЗначенияБюджетов.КоличествоСценарийИсполнение + КонтрольныеЗначенияБюджетов.КоличествоСценарийСверхЛимита) * ВТ_КоэффициентыСписания.КоэффициентКоличество КАК Количество,
	|	СУММА(КонтрольныеЗначенияБюджетов.СуммаСценарийИсполнение + КонтрольныеЗначенияБюджетов.СуммаСценарийСверхЛимита) * ВТ_КоэффициентыСписания.КоэффициентСумма КАК Сумма,
	|	ИСТИНА КАК КонтролироватьСумму,
	|	ИСТИНА КАК КонтролироватьКоличество,
	|	НЕ КонтрольныеЗначенияБюджетов.СтатьяОборотов.НеКонтролировать_Заявки КАК КонтролироватьПоСтатье,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(25)) КАК ИмяСписка,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(25)) КАК СинонимСписка,
	|	1 КАК НомерСтроки
	|ИЗ
	|	ЗаявкиНаЗатраты КАК ЗаявкиНаЗатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоэффициентыСписания КАК ВТ_КоэффициентыСписания
	|		ПО ЗаявкиНаЗатраты.Ссылка = ВТ_КоэффициентыСписания.ЗаявкаНаЗатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бит_КонтрольныеЗначенияБюджетов КАК КонтрольныеЗначенияБюджетов
	|		ПО ЗаявкиНаЗатраты.Ссылка = КонтрольныеЗначенияБюджетов.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтрольныеЗначенияБюджетов.Аналитика_12,
	|	КонтрольныеЗначенияБюджетов.СтатьяОборотов,
	|	КонтрольныеЗначенияБюджетов.Аналитика_6,
	|	КонтрольныеЗначенияБюджетов.Аналитика_11,
	|	КонтрольныеЗначенияБюджетов.Аналитика_10,
	|	КонтрольныеЗначенияБюджетов.Аналитика_1,
	|	КонтрольныеЗначенияБюджетов.Аналитика_9,
	|	КонтрольныеЗначенияБюджетов.Аналитика_2,
	|	КонтрольныеЗначенияБюджетов.Аналитика_8,
	|	КонтрольныеЗначенияБюджетов.ЦФО,
	|	КонтрольныеЗначенияБюджетов.Аналитика_3,
	|	КонтрольныеЗначенияБюджетов.Аналитика_7,
	|	КонтрольныеЗначенияБюджетов.Аналитика_5,
	|	КонтрольныеЗначенияБюджетов.Аналитика_4,
	|	ЗаявкиНаЗатраты.Ссылка,
	|	ЗаявкиНаЗатраты.Дата,
	|	ВТ_КоэффициентыСписания.КоэффициентКоличество,
	|	ВТ_КоэффициентыСписания.КоэффициентСумма,
	|	НЕ КонтрольныеЗначенияБюджетов.СтатьяОборотов.НеКонтролировать_Заявки";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОбработатьДанныеДляСторноКонтрольныеЗначенияБюджетов(Результат, Движения);

КонецПроцедуры

Процедура ОбработатьДанныеДляСторноКонтрольныеЗначенияБюджетов(ВыборкаДокументов, Движения)

	Заявки = ВыборкаДокументов.Скопировать(, "ДокументПланирования");
	Заявки.Свернуть("ДокументПланирования");
	
	Для каждого СтрокаТаблицы Из Заявки Цикл
		ДокументПланирования = СтрокаТаблицы.ДокументПланирования;
		Менеджер    		 = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДокументПланирования);
		ПараметрыПроведения  = Менеджер.ПодготовитьПараметрыПроведения(ДокументПланирования, Ложь);
		
		Если НЕ ЗначениеЗаполнено(ПараметрыПроведения.ИсполнениеБюджета) Тогда
			// Методологически документ не контролируется по бюджету.
			Продолжить;		
		КонецЕсли;
		
		ИсполнениеБюджета = ПараметрыПроведения.ИсполнениеБюджета.СкопироватьКолонки();
		Остатки = ВыборкаДокументов.Скопировать(Новый Структура("ДокументПланирования", ДокументПланирования));
		Для каждого СтрокаТаблицы Из Остатки Цикл
			НоваяСтрока = ИсполнениеБюджета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.НомерСтроки = ИсполнениеБюджета.Количество();
		КонецЦикла;
		
		ТаблицаИсполнениеБюджета = бит_КонтрольИсполненияБюджета.ПодготовитьТаблицуВозвратЛимита(
									ИсполнениеБюджета,
									ПараметрыПроведения.ИсполнениеБюджетаРеквизиты,
									Ложь);
									
		бит_КонтрольИсполненияБюджета.СформироватьДвиженияКонтрольныеЗначенияБюджетов(ТаблицаИсполнениеБюджета, Движения);
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#КонецЕсли
