
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		УстановитьСостояниеДокумента();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_НазначениеПравилТрансляции";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// АПК:1297-выкл Строковый параметр.
	Если СтрСравнить(ИмяСобытия, "Выбор периода")=0 Тогда
	// АПК:1297-вкл Строковый параметр.	
		ДатаНачалаДоИзменения    = Объект.ДатаНачала;
		ДатаОкончанияДоИзменения = Объект.ДатаОкончания;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ИзменениеДатыДействия();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ИзменениеДатыДействия();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПравилаТрансляции

&НаКлиенте
Процедура ПравилаТрансляцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ПравилаТрансляцииРеквизитКартинкаВыбораПериода Тогда
		ТекущиеДанные = Элементы.ПравилаТрансляции.ТекущиеДанные;
		бит_РаботаСДиалогамиКлиент.ОткрытьДиалогСтандартногоПериодаПоДатам(ТекущиеДанные, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаТрансляцииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПравилаТрансляции.ТекущиеДанные;
		ТекущиеДанные.ДатаНачала	= Объект.ДатаНачала;
		ТекущиеДанные.ДатаОкончания = Объект.ДатаОкончания;  
		ТекущиеДанные.Назначение    = ПредопределенноеЗначение("Перечисление.бит_НазначенияПравилТрансляции.Трансляция");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаТрансляцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_ПравилаТрансляции") Тогда
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ПравилоТрансляции", ВыбранноеЗначение);
		
		МассивСтрок = Объект.ПравилаТрансляции.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрок.Количество() = 0 Тогда
			НайденнаяСтрока = Неопределено;
		Иначе
			НайденнаяСтрока = МассивСтрок[0];
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено Тогда
			НоваяСтрока = Объект.ПравилаТрансляции.Добавить();
			НоваяСтрока.ПравилоТрансляции = ВыбранноеЗначение;
			НоваяСтрока.ДатаНачала        = Объект.ДатаНачала;
			НоваяСтрока.ДатаОкончания     = Объект.ДатаОкончания;
			НоваяСтрока.Назначение        = ПредопределенноеЗначение("Перечисление.бит_НазначенияПравилТрансляции.Трансляция");
		Иначе
			ТекстСообщения = НСтр("ru = 'Правило ""%1"" уже подобрано в строку № %2 табличной части ""Правила трансляции"".';
										|en = 'Rule ""%1"" is already chosen in line number %2 tables of ""broadcasting rules"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ВыбранноеЗначение, НайденнаяСтрока.НомерСтроки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьПериоды(Команда)

	Для каждого СтрокаТаблицы Из Объект.ПравилаТрансляции Цикл
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Объект, "ДатаНачала, ДатаОкончания");
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОткрытьДиалогСтандартногоПериодаПоДатам(Объект, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.бит_ПравилаТрансляции.ФормаВыбора",ПараметрыФормы,Элементы.ПравилаТрансляции);
	
КонецПроцедуры

&НаКлиенте
Процедура ГотовностьПравилТрансляции(Команда)
	
	Правила = Новый СписокЗначений; 
	Для каждого СтрокаТаблицы Из Объект.ПравилаТрансляции Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПравилоТрансляции) Тогда
			Правила.Добавить(СтрокаТаблицы.ПравилоТрансляции);
		КонецЕсли;
	КонецЦикла; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ПравилоТрансляции", Правила));
	ПараметрыФормы.Вставить("КлючВарианта", "ГотовностьТрансляции");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ОткрытьФорму("Отчет.бит_ГотовностьПравилТрансляции.Форма", ПараметрыФормы, , ЭтотОбъект); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДатыДействия()

	Если Объект.ДатаОкончания <> Дата(1,1,1) И Объект.ДатаНачала > Объект.ДатаОкончания Тогда
		Объект.ДатаНачала    = ДатаНачалаДоИзменения;
		Объект.ДатаОкончания = ДатаОкончанияДоИзменения;
	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Дата начала не может быть больше даты окончания.';
			 										     |en='The start date can not be more than the end date.'"), 
												    Объект.Ссылка);
	Иначе
		ДатаНачалаДоИзменения    = Объект.ДатаНачала;
		ДатаОкончанияДоИзменения = Объект.ДатаОкончания;
	КонецЕсли; 
КонецПроцедуры // ИзменениеДатыДействия()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры
	
#КонецОбласти
