#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мРазоваяЗапись Экспорт; // Это разовая запись.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда
	
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ВидПроформы") Тогда
			
			Если ТипЗнч(ДанныеЗаполнения.ВидПроформы) = Тип("СправочникСсылка.бит_ВидыПроизвольныхФорм") Тогда
				ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_ПроизвольнаяФорма);
			ИначеЕсли ТипЗнч(ДанныеЗаполнения.ВидПроформы) = Тип("СправочникСсылка.бит_ВидыФормСбораДанных") Тогда
				ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_ФормаСбораДанных);
			Иначе
				ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_Проформы);
			КонецЕсли;
			ВидДокумента  = ОбъектСистемы;
			ВидПроформы   = ДанныеЗаполнения.ВидПроформы;
		
		КонецЕсли; 
		
		УстановитьНовыйКод();
		
	КонецЕсли;                                                   
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	Если ЭтоНовый() Тогда
		// Необходимо установить автора и дату создания шаблона.
		Автор 			= ПараметрыСеанса.ТекущийПользователь;
		ДатаСоздания    = ТекущаяДатаСеанса();
	Иначе
		// Установим последнего редактора и дату последнего редактирования.
		ПоследнийРедактор 				= ПараметрыСеанса.ТекущийПользователь;
		ДатаПоследнегоРедактирования 	= ТекущаяДатаСеанса();
	КонецЕсли;
		
	// Необходимо заполнить идентификатор шаблона.
	Идентификатор = бит_МеханизмХозяйственныхОперацийСервер.ПолучитьПодчиненныйИдентификаторШаблона(ЭтотОбъект);
	
	УникальныйИД = бит_МеханизмХозяйственныхОперацийСервер.ПолучитьИдентификаторШаблона(ЭтотОбъект);
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Область Инициализация

мРазоваяЗапись = Ложь;

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли