
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Список шаблонов.
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	бит_ШаблоныДвижений.Ссылка
	|ИЗ
	|	Справочник.бит_ШаблоныДвижений КАК бит_ШаблоныДвижений");	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	ШаблоныДвижений.ЗагрузитьЗначения(Результат);
	ШаблоныДвижений.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблоныДвиженийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ШаблонСсылка = ШаблоныДвижений.Получить(ВыбраннаяСтрока).Значение;
	ПоказатьЗначение(,ШаблонСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЭкспортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлЭкспорта;	
	ДиалогОткрытияФайла.Фильтр = НСтр("ru='Файл XML(*.xml)|*.xml';en='File XML(*.xml)|*.xml'");	
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';en='Select a file'");
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	
	ЗавершениеСохраненияВФайл = Новый ОписаниеОповещения("ФайлЭкспортаНачалоВыбораЗавершение", ЭтотОбъект);	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ЗавершениеСохраненияВФайл, ДиалогОткрытияФайла);
	
КонецПроцедуры

// Обработка оповещения процедуры "ФайлЭкспортаНачалоВыбора".
//
// Параметры:
//  ВыбранныеФайлы 	- массив 	   - массив выбранных имен файлов или Неопределено, если выбор не осуществлен. 
//  Дополнение	 	- Произвольный - произвольные данные.
//
&НаКлиенте
Процедура ФайлЭкспортаНачалоВыбораЗавершение(ВыбранныеФайлы, ДополненительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Объект.ФайлЭкспорта = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.Диалог.Фильтр 		  = НСтр("ru='Файл XML(*.xml)|*.xml';en='File XML(*.xml)|*.xml'");
	ПараметрыЗагрузки.Диалог.Заголовок 	  = НСтр("ru='Выберите файл импорта';en='Select the import file'");
	ПараметрыЗагрузки.Диалог.ПолноеИмяФайла = Объект.ФайлИмпорта;
	
	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("ФайлИмпортаНачалоВыбораЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ЗавершениеВыбораФайла, ПараметрыЗагрузки, Объект.ФайлИмпорта); 
	
КонецПроцедуры

// Обработка оповещения процедуры "ФайлИмпортаНачалоВыбора".
//
// Параметры:
//  ВыбранныеФайлы			 - Массив	 	 - массив выбранных имен файлов или Неопределено, если выбор не осуществлен. 
//  ДополнительныеПараметры	 - Произвольный	 - произвольные данные.
//
&НаКлиенте
Процедура ФайлИмпортаНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
		
	Если ВыбранныеФайлы <> Неопределено Тогда		
		Объект.ФайлИмпорта = ВыбранныеФайлы.Имя;		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	// Определим импорт или экспорт.
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЭкспорт Тогда
		ВыполнитьЭкспорт();
	Иначе
		ВыполнитьИмпорт();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает массив отмеченных шаблонов в списке шаблонов.
// 
&НаСервере
Функция ШаблоныВыбранные()
	
	МассивШаблонов = Новый Массив;
	
	Для Каждого СтрокаСписка Из ШаблоныДвижений Цикл
		
		Если СтрокаСписка.Пометка Тогда
			МассивШаблонов.Добавить(СтрокаСписка.Значение);
		КонецЕсли;
		
	КонецЦикла;

	Возврат МассивШаблонов;
	
КонецФункции

// Возвращает массив комплектов, в которые входят выбранные в списке шаблоны.
// 
&НаСервере
Функция КомплектыШаблоновВыбранных()
	
	МассивКомплектов = Новый Массив;
	МассивШаблонов 	 = ШаблоныВыбранные();
	
	Если Не ВыгружатьКомплекты Тогда
		Возврат МассивКомплектов;
	КонецЕсли;
			
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	бит_КомплектыДвиженийШаблоныДвижений.Ссылка
	|ИЗ
	|	Справочник.бит_КомплектыДвижений.ШаблоныДвижений КАК бит_КомплектыДвиженийШаблоныДвижений
	|ГДЕ
	|	бит_КомплектыДвиженийШаблоныДвижений.ШаблонДвижения В(&МассивШаблонов)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_КомплектыДвиженийШаблоныДвижений.Ссылка");
	
	Запрос.УстановитьПараметр("МассивШаблонов", МассивШаблонов);
	
	МассивКомплектов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивКомплектов;
	
КонецФункции

// Выполняет экспорт данных, в соответствии с выбранными шаблонами.
// 
&НаКлиенте
Процедура ВыполнитьЭкспорт()
	
	Если НЕ ЗначениеЗаполнено(Объект.ФайлЭкспорта) Тогда
		ТекстСообщения = НСтр("ru='Не выбран файл экспорта.';en='No export file selected.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ТекстXML = ПолучитьТекстXMLНаСервере();
	
	Выгрузка = Новый ТекстовыйДокумент;
	Выгрузка.УстановитьТекст(ТекстXML);
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьЭкспортЗавершение", ЭтотОбъект); 
	Выгрузка.НачатьЗапись(Оповещение, Объект.ФайлЭкспорта);
	
КонецПроцедуры

// Обработчик завершения метода "начать запись".
//  См. Синтакс-помощник: НачатьЗапись().
//
&НаКлиенте 
Процедура ВыполнитьЭкспортЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		ТекстСообщения = НСтр("ru='Выгрузка успешно завершена.';en='Upload completed successfully.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры
 
// Возвращает XML-описание выгрузки.
// 
&НаСервере
Функция ПолучитьТекстXMLНаСервере()
	
	ТекстXML = Обработки.бит_ИмпортЭкспортШаблоновДвижений.СформироватьXMLОписаниеВыгрузки(КомплектыШаблоновВыбранных(), ШаблоныВыбранные());
	
	Возврат ТекстXML;
	
КонецФункции

// Выполняет импорт данных из указанного файла импорта.
// 
&НаКлиенте
Процедура ВыполнитьИмпорт()
	
	Если Не ЗначениеЗаполнено(Объект.ФайлИмпорта) Тогда		
		ТекстСообщения = НСтр("ru='Не выбран файл импорта.';en='No import file selected.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);		
		Возврат;		
	КонецЕсли;
	
	// Проверим существование файла и в случае его отсутствия - создадим.
	Файл = Новый Файл(Объект.ФайлИмпорта);
	
	ЗавершениеВыполненияИмпорта1 = Новый ОписаниеОповещения("ВыполнитьИмпортЗавершение1", ЭтотОбъект);
	Файл.НачатьПроверкуСуществования(ЗавершениеВыполненияИмпорта1);
	
КонецПроцедуры

// Обработка оповещения процедуры "ВыполнитьИмпорт".
//
// Параметры:
//  Существует				 - Булево - результат записи.
//  ДополнительныеПараметры	 - Произвольный.
//
&НаКлиенте
Процедура ВыполнитьИмпортЗавершение1(Существует, ДополнительныеПараметры) Экспорт
	
	Если Не Существует Тогда		
		ТекстСообщения = НСтр("ru='Указанный файл не найден.';en='The specified file was not found.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;		
	КонецЕсли;
	
	ТекстДок = Новый ТекстовыйДокумент;
	
	ДополнительныеПараметры = Новый Структура("ТекстДок", ТекстДок);
	ЗавершениеВыполненияИмпорта2 = Новый ОписаниеОповещения("ВыполнитьИмпортЗавершение2", ЭтотОбъект, ДополнительныеПараметры);
	ТекстДок.НачатьЧтение(ЗавершениеВыполненияИмпорта2, Объект.ФайлИмпорта);

КонецПроцедуры

// Обработка оповещения процедуры "ВыполнитьИмпортЗавершение1".
//
// Параметры:
//  Результат				 - Булево - результат чтения.
//  ДополнительныеПараметры	 - Произвольный. 
//
&НаКлиенте
Процедура ВыполнитьИмпортЗавершение2(Результат) Экспорт
	
	ТекстДок = Результат.ТекстДок;	
	ТекстXML = ТекстДок.ПолучитьТекст();
	
	// Все нормально, можно загружать.
	ВыполнитьИмпортНаСервере(ТекстXML);
	
	ТекстСообщения = НСтр("ru='Загрузка успешно завершена.';en='Download completed successfully.'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

// Выполняет импорт данных из указанного файла импорта на сервере.
// 
&НаСервере
Процедура ВыполнитьИмпортНаСервере(ТекстXML)
	
	// Создадим временный файл для загрузки.
	КаталогВременныхФайлов = ФайловаяСистема.СоздатьВременныйКаталог("template");
	
	ИмяВременногоФайла = КаталогВременныхФайлов + Строка(Новый УникальныйИдентификатор) + ".xml";
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(ТекстXML);
	ТекстДок.Записать(ИмяВременногоФайла);
	
	Обработки.бит_ИмпортЭкспортШаблоновДвижений.ЗагрузитьШаблоны(ИмяВременногоФайла, ПротоколЗагрузки);
	ФайловаяСистема.УдалитьВременныйКаталог(КаталогВременныхФайлов);
	
КонецПроцедуры

#КонецОбласти
