 &Перед("ПриСозданииНаСервере") 
&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	Если Элементы.Найти("бит_НомерЗаказа") = Неопределено Тогда
		бит_СоздатьЭлементыБит(); 
	КонецЕсли;
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -  
	
КонецПроцедуры 

&НаСервере
Процедура бит_СоздатьЭлементыБит()

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
    //(бит) № заказа
	НовыйЭлемент = Элементы.Вставить("Сериибит_НомерЗаказа", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_НомерЗаказа";
	
	//(бит) Намотки
	НовыйЭлемент = Элементы.Вставить("Сериибит_Намотки", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Намотки";
	
	//(бит) Брутто, кг
	НовыйЭлемент = Элементы.Вставить("Сериибит_Брутто", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Брутто";
	
	//(бит) Примечание
	НовыйЭлемент = Элементы.Вставить("Сериибит_Примечание", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Примечание";
	
	//(бит) Тара
	//НовыйЭлемент = Элементы.Вставить("Сериибит_Тара", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Тара";
	
	//(бит) Прежний № тары
	НовыйЭлемент = Элементы.Вставить("Сериибит_ПрежнийНомерТары", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ПрежнийНомерТары";
    // Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 - 
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37доп]  [VUVaynula@1cbit.ru] [03.06.2025 16:39:45] +        
	НовыйЭлемент = Элементы.Вставить("Сериибит_ВидЗаказа", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ВидЗаказа";
	
	НовыйЭлемент = Элементы.Вставить("Сериибит_Партия", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Партия";

	НовыйЭлемент = Элементы.Вставить("Сериибит_ТипОбшивкиБарабана", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ТипОбшивкиБарабана";

	НовыйЭлемент = Элементы.Вставить("Сериибит_ТипБарабана", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ТипБарабана";

	НовыйЭлемент = Элементы.Вставить("Сериибит_ВесПродукции", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ВесПродукции";

	НовыйЭлемент = Элементы.Вставить("Сериибит_ВесОбшивки", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ВесОбшивки";

	НовыйЭлемент = Элементы.Вставить("Сериибит_ВесБарабана", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ВесБарабана";
	
	//НовыйЭлемент = Элементы.Вставить("Сериибит_ПереченьДлинНаБарабанеСтрокой", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ПереченьДлинНаБарабанеСтрокой";  
	
	НовыйЭлемент = Элементы.Вставить("Сериибит_Цвет", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Цвет";

	// }}ПервыйБИТ ЛистТребований [ЛТ5.37доп]  [VUVaynula@1cbit.ru] [03.06.2025 16:39:45] -
КонецПроцедуры