Функция бит_ПолучитьДоговорКнтрагента(Организация, Контрагент, ТипДоговора, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		//|	ДоговорыКонтрагентов.Организация = &Организация
		|	ДоговорыКонтрагентов.Контрагент = &Контрагент
		|	И ДоговорыКонтрагентов.ТипДоговора = &ТипДоговора
		|	И (&Дата МЕЖДУ ДоговорыКонтрагентов.ДатаНачалаДействия И ДоговорыКонтрагентов.ДатаОкончанияДействия
		|			ИЛИ ДоговорыКонтрагентов.ДатаНачалаДействия < &Дата
		|				И ДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипДоговора", ТипДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();	

КонецФункции