#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Весовщик = Пользователи.АвторизованныйПользователь();                   
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 2:56:27] +        
	Запрос = Новый Запрос("ВЫБРАТЬ Первые 1
	                      |	бит_ПартияЗавесов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.бит_ПартияЗавесов КАК бит_ПартияЗавесов
	                      |ГДЕ
	                      |	НЕ бит_ПартияЗавесов.Проведен
	                      |	И НЕ бит_ПартияЗавесов.ПометкаУдаления
	                      |	И бит_ПартияЗавесов.Автор = &Автор");
	Запрос.УстановитьПараметр("Автор", Пользователи.АвторизованныйПользователь());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПартияЗавеса = Выборка.Ссылка;  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Продолжение работы с партия завеса №%1 от %2", ПартияЗавеса.Номер, Формат(ПартияЗавеса.Дата, "ДФ=dd.MM.yyyy")), ПартияЗавеса);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 2:56:27] -
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода,ЭлектронныеВесы,ПринтерЭтикеток");
    ДоступностьЭлементов();
	
КонецПроцедуры              

&НаКлиенте
Процедура ПриЗакрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ПриИзмененииНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатуры()

	Серия = ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка");
	//Тара = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");

	ДоступностьЭлементов();

КонецПроцедуры             

&НаСервере
Процедура ПриИзмененииВесовщика()
	
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКонтроллера()
	
	ДопСвойство = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ШтампКонтроллера, , Истина);
	ШтампКонтроллёра = УправлениеСвойствами.ЗначениеСвойства(Контроллёр, ДопСвойство);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьЭлементов()
	
	Элементы.НовыйЗавес.Доступность 			= ЗначениеЗаполнено(ПартияЗавеса);
	Элементы.ГруппаНоменклатура.Доступность 	= ЗначениеЗаполнено(ПартияЗавеса);
	Элементы.ГруппаСерия.Доступность 			= ЗначениеЗаполнено(ПартияЗавеса);
	Элементы.ВыбратьСерию.Доступность 			= ЗначениеЗаполнено(ПартияЗавеса); 
	Элементы.Тара.Доступность					= ЗначениеЗаполнено(ПартияЗавеса); 
	Элементы.НайтиСериюПоШК.Доступность 		= ЗначениеЗаполнено(ПартияЗавеса);
	Элементы.Группа1.Доступность 				= ЗначениеЗаполнено(ПартияЗавеса);
	Элементы.Группа2.Доступность 				= ЗначениеЗаполнено(ПартияЗавеса);
	Элементы.Группа3.Доступность 				= ЗначениеЗаполнено(ПартияЗавеса);
	Элементы.МассаТары.Доступность 				= ЗначениеЗаполнено(ПартияЗавеса); 
	Элементы.МассаНетто.Доступность				= ЗначениеЗаполнено(ПартияЗавеса); 
	Элементы.Группа4.Доступность 				= ЗначениеЗаполнено(ПартияЗавеса);
	Элементы.НачатьПартиюЗавесов.Доступность 	= Не ЗначениеЗаполнено(ПартияЗавеса);
	Элементы.ЗавершитьПартиюЗавесов.Доступность = ЗначениеЗаполнено(ПартияЗавеса);

	Элементы.ГруппаСерия.Доступность = ЗначениеЗаполнено(Номенклатура);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбработатьШтрихкодыСерверСерии(Знач ДанныеШтрихкодов) 
	
	//СписокСерий = Новый СписокЗначений; 
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Строка") Тогда
		мШК = Новый Массив;
		мШК.Добавить(Новый Структура("Штрихкод, Количество", ДанныеШтрихкодов, 1));
	КонецЕсли;
	
	ШтрихкодыПоТипам = ШтрихкодированиеНоменклатурыСервер.СтруктураПоТипамШтрихкодов(мШК);
	
	ИспользоватьНомерСерии = Истина;     
	ИспользоватьСрокГодностиСерии = Истина;
			
	ЕстьОшибки = Ложь;
	ОбрабатываемаяСтрока = Неопределено;
	
		Если ШтрихкодыПоТипам.БезТипа.Количество() > 0 Тогда
		ТаблицаШтрихКодов = Новый ТаблицаЗначений;
		ТаблицаШтрихКодов.Колонки.Добавить("Номер", Метаданные.Справочники.СерииНоменклатуры.Реквизиты.Номер.Тип);
		ТаблицаШтрихКодов.Колонки.Добавить("ГоденДо", Новый ОписаниеТипов("Дата"));
		ТаблицаШтрихКодов.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный)));
		Для Каждого СтрМас Из ШтрихкодыПоТипам.БезТипа Цикл
			НоваяСтрока            = ТаблицаШтрихКодов.Добавить();
			НоваяСтрока.Количество = СтрМас.Количество;
			
			ПоляИзШтрихкода = НоменклатураКлиентСервер.ИнформацияОСерииИзШтрихкода(СтрМас.Штрихкод, 
			ИспользоватьНомерСерии,
			ИспользоватьСрокГодностиСерии);
			
			НоваяСтрока.Номер   = ПоляИзШтрихкода.Номер;
			НоваяСтрока.ГоденДо = ПоляИзШтрихкода.ГоденДо;
			
			Если ПоляИзШтрихкода.ЕстьОшибка Тогда
				ЕстьОшибки = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЕстьОшибки Тогда
			
			ТекстыЗапроса = Новый Массив;
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Штрихкоды.Номер КАК Номер,
			|	Штрихкоды.ГоденДо КАК ГоденДо,
			|	Штрихкоды.Количество КАК Количество
			|ПОМЕСТИТЬ Штрихкоды
			|ИЗ
			|	&Штрихкоды КАК Штрихкоды";
			
			ТекстыЗапроса.Добавить(ТекстЗапроса);
			
			ДобавитьТекстЗапросаНайденныхНомеровСерий(ТекстыЗапроса);
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	СУММА(1) КАК КоличествоНайденныхСерий,
			|	НайденныеНомераДляЗапроса.Номер
			|ПОМЕСТИТЬ КоличествоСерийПоНомеру
			|ИЗ
			|	НайденныеНомераДляЗапроса КАК НайденныеНомераДляЗапроса
			|
			|СГРУППИРОВАТЬ ПО
			|	НайденныеНомераДляЗапроса.Номер";
			
			ТекстыЗапроса.Добавить(ТекстЗапроса);
			
			ДобавитьТекстЗапросаКоличестваНайденныхНомеровСерий(ТекстыЗапроса);
			
			ТекстЗапроса = 
			"УНИЧТОЖИТЬ Штрихкоды
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ НайденныеНомераДляЗапроса
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ КоличествоСерийПоНомеру";
			
			ТекстыЗапроса.Добавить(ТекстЗапроса);
			
			Запрос = Новый Запрос;
			Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
			
			Запрос.УстановитьПараметр("ВидНоменклатуры", 
											?(ЗначениеЗаполнено(Номенклатура), 
												ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры"), 
												ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.ПустаяСсылка")));
			Запрос.УстановитьПараметр("Штрихкоды",ТаблицаШтрихКодов);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл  
				Если ЗначениеЗаполнено(Выборка.Серия) Тогда
					СписокСерий.Добавить(Выборка.Серия);
				КонецЕсли;
			КонецЦикла;

		КонецЕсли;
	КонецЕсли;
	
	
	//Возврат СписокСерий;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПараметыПоискаСканируемойСерии(ПараметрыПоиска, ДанныеСерии, ИсключаемыеСвойства)
	
	ПараметрыПоиска.Вставить("ДатаПроизводства");
	
	//++ Локализация
	ИдентификаторПартииВЕТИС		= ?(ЗначениеЗаполнено(ДанныеСерии.ИдентификаторПартииВЕТИС),
										ДанныеСерии.ИдентификаторПартииВЕТИС,
										Метаданные.ОпределяемыеТипы.СтрокаВЕТИС.Тип.ПривестиЗначение());
	МаксимальнаяРозничнаяЦенаМОТП	= ?(ЗначениеЗаполнено(ДанныеСерии.МаксимальнаяРозничнаяЦенаМОТП),
										ДанныеСерии.МаксимальнаяРозничнаяЦенаМОТП,
										Метаданные.ОпределяемыеТипы.ДенежнаяСуммаНеотрицательная.Тип.ПривестиЗначение());
	
	ИменаИсключаемыхСвойств = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ИдентификаторПартииВЕТИС) Тогда
		ИменаИсключаемыхСвойств.Добавить("ИдентификаторПартииВЕТИС");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МаксимальнаяРозничнаяЦенаМОТП) Тогда
		ИменаИсключаемыхСвойств.Добавить("МаксимальнаяРозничнаяЦенаМОТП");
	КонецЕсли;
	
	Если ИменаИсключаемыхСвойств.Количество() > 0 Тогда
		ИсключаемыеСвойства = СтрСоединить(ИменаИсключаемыхСвойств, ",")
	КонецЕсли;
	
	ПараметрыПоиска.Вставить("ПроизводительЕГАИС");
	ПараметрыПоиска.Вставить("Справка2ЕГАИС");
	ПараметрыПоиска.Вставить("ИдентификаторПартииВЕТИС", ИдентификаторПартииВЕТИС);
	ПараметрыПоиска.Вставить("ПроизводительВЕТИС");
	ПараметрыПоиска.Вставить("ЗаписьСкладскогоЖурналаВЕТИС");
	ПараметрыПоиска.Вставить("МаксимальнаяРозничнаяЦенаМОТП", МаксимальнаяРозничнаяЦенаМОТП);
	//-- Локализация
	
КонецПроцедуры

&НаСервере
Функция БитНайтиСерииНаСервере(Штрихкод)
	
	Список = Справочники.СерииНоменклатуры.НайтиСериюПоСтрокеШК(Штрихкод);
	Для каждого стр из Список Цикл
		СписокСерий.Добавить(стр.Значение);
	КонецЦикла;
	
КонецФункции 

&НаКлиенте
Асинх Процедура ПослеОбработкиШКСерииНаКлиенте(ВыбранноеЗначение)
	Если Не ЗначениеЗаполнено(Серия) Тогда
		Если СписокСерий.Количество() = 0 Тогда
			ПоказатьПредупреждение( , "Серия по штрихкоду не найдена");
		ИначеЕсли СписокСерий.Количество() = 1 Тогда
			Серия = СписокСерий[0].Значение;
			ПриИзмененииСерии();
		ИначеЕсли СписокСерий.Количество() > 1 Тогда
			Серия = Ждать ВыбратьИзСпискаАсинх(СписокСерий, Элементы.Серия);
			ПриИзмененииСерии();
		КонецЕсли;
	Иначе                       
		ПриИзмененииСерии();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Не ЗначениеЗаполнено(ПартияЗавеса) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда 
			Штрихкод = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр).Штрихкод;
			//Если ЭтаФорма.ТекущийЭлемент = Элементы.Номенклатура Тогда
			// логика рабоы сканера сначала номенклатура, потом серия, в итоге если номенклатура заполнена значит сканируется серия
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда
				ОбработатьШтрихкод(Штрихкод, "Номенклатура");
				ПриИзмененииНоменклатуры();
				Если ЗначениеЗаполнено(Номенклатура) Тогда
					ЭтаФорма.ТекущийЭлемент = Элементы.Серия;
				КонецЕсли;
			Иначе//Если ЭтаФорма.ТекущийЭлемент = Элементы.Серия Тогда
				// сначала поищем в реквизите штрихкодсерии
				ОбработатьШтрихкод(Штрихкод, "СерииНоменклатуры");
				ПослеОбработкиШКСерииНаКлиенте(Штрихкод);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПоискПоРеквизитуШКСерии(Знач Штрихкод, Знач ВидНоменклатуры)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	СерииНоменклатуры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	                      |ГДЕ
	                      |	СерииНоменклатуры.бит_Штрихкод = &бит_Штрихкод
						  |	И СерииНоменклатуры.ВидНоменклатуры в (&мВладельцев)");
	Запрос.УстановитьПараметр("бит_Штрихкод", Штрихкод);                       
	мВладельцев = Новый Массив;
	текВладелец = ВидНоменклатуры;
	Пока ЗначениеЗаполнено(текВладелец) Цикл
		мВладельцев.Добавить(текВладелец);
		текВладелец = текВладелец.ВладелецСерий;
	КонецЦикла;
	Запрос.УстановитьПараметр("мВладельцев", мВладельцев);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Серия = Выборка.Ссылка;
	Иначе       
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Серия;
		
КонецФункции    

&НаСервере
Функция ОбработатьШтрихкод(Знач ТекКод, Знач Параметр) 
	
	Если ТипЗнч(ТекКод) = Тип("Структура") Тогда
		ШК = ТекКод.Штрихкод;
	Иначе
		ШК = Формат(ТекКод, "ЧГ=0");
	КонецЕсли;
	
	Если Параметр = "Номенклатура" Тогда
		
		Запрос = Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод");
		Запрос.УстановитьПараметр("Штрихкод", ШК);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Номенклатура = Выборка.Номенклатура;
		Иначе
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
			
	ИначеЕсли Параметр = "СерииНоменклатуры" Тогда
		Серия = ПоискПоРеквизитуШКСерии(ШК, Номенклатура.ВидНоменклатуры);
		Если Не ЗначениеЗаполнено(Серия) Тогда
			ОбработатьШтрихкодыСерверСерии(ШК);
			Если СписокСерий.Количество() = 0 Тогда
				БитНайтиСерииНаСервере(ШК);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция СерияНеНайдена()
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Серия не найдена");
КонецФункции

&НаКлиенте
Процедура ПечатьЭтикетки(Команда)
	// Доступно для нажатия, если заполнены поля 
	// "Номенклатура", "Серия", Тара", "Весовщик", "Контроллёр".
    // Если хотя бы одно поле не заполнено - система должна выдавать ошибку о незаполненном поле.
	Если ЗначениеЗаполнено(Номенклатура) 
		И ЗначениеЗаполнено(Серия)
		И ЗначениеЗаполнено(Тара) Тогда
		
		АдресТаблицыТоваров = СобратьДанныеДляПечати();
		Если АдресТаблицыТоваров <> Неопределено Тогда                   
			ОткрытьФормуПечати(АдресТаблицыТоваров);
			ЗаписатьДанныеВСерию();
			ОбнулитьФорму(Ложь);
		КонецЕсли; 
			
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для печати этикетки необходимо заполнить поля 'Номенклатура', 'Серия', 'Тара', 'Весовщик' и 'Контроллёр'");
	КонецЕсли;
	
КонецПроцедуры                               

&НаСервере
Процедура ЗаписатьДанныеВСерию()
	
	СерияОбъект = Серия.ПолучитьОбъект();
	СерияОбъект.бит_Завешено = Истина; 
	СерияОбъект.бит_ТипТары = Тара;
	СерияОбъект.бит_МассаНетто = МассаНетто;
	СерияОбъект.бит_Брутто = МассаБрутто;
	СерияОбъект.бит_Весовщик = Весовщик;
	СерияОбъект.бит_ДатаВремяЗавеса = ТекущаяДатаСеанса();
	СерияОбъект.бит_Контроллёр = Контроллёр;
	СерияОбъект.бит_СменаВесовщика = СменаВесовщика;
	СерияОбъект.бит_Штрихкод = НовыйШтрихкод;
	СерияОбъект.Записать();
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 3:03:04] +        
	ДокОбъект = ПартияЗавеса.ПолучитьОбъект();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура"	, Номенклатура); 	
	//СтруктураПоиска.Вставить("Тара"			, Тара);
	СтруктураПоиска.Вставить("Серия"		, Серия);
	//СтруктураПоиска.Вставить("Назначение"	, Документы.бит_ПартияЗавесов.НайтиНазначение(Номенклатура, Серия));
	//СтруктураПоиска.Вставить("Весовщик"		, Весовщик);
	//СтруктураПоиска.Вставить("Контроллёр"	, Контроллёр);
	
	СтрокаПоКлючу = ДокОбъект.ДанныеСмены.НайтиСтроки(СтруктураПоиска);
	Если СтрокаПоКлючу.Количество() Тогда 
		нов = СтрокаПоКлючу[0];
	иначе
		нов = ДокОбъект.ДанныеСмены.Добавить();
	КонецЕсли;
	нов.Номенклатура = Номенклатура; 	
	нов.Тара = Тара;
	нов.Серия = Серия;
	нов.Назначение = Документы.бит_ПартияЗавесов.НайтиНазначение(Номенклатура, Серия);
	нов.Весовщик = Весовщик;
	нов.Контроллер = Контроллёр;
	нов.Количество = МассаНетто;   
	
	ДокОбъект.Записать();
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 3:03:04] -
КонецПроцедуры       

//&НаСервере
//Функция НайтиНазначение()
//	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 3:10:42] +        
//	Запрос = Новый Запрос("ВЫБРАТЬ
//	                      |	ТоварыНаСкладахОстатки.Назначение КАК Назначение
//	                      |ИЗ
//	                      |	РегистрНакопления.ТоварыНаСкладах.Остатки(
//	                      |			,
//	                      |			Номенклатура = &Номенклатура
//	                      |				И Серия = &Серия) КАК ТоварыНаСкладахОстатки");
//	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
//	Запрос.УстановитьПараметр("Серия", Серия);
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Назначение = Справочники.Назначения.ПустаяСсылка();
//	
//	Если Выборка.Следующий() Тогда
//		Назначение = Выборка.Назначение;
//	КонецЕсли;
//	
//	Возврат Назначение;
//	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 3:10:42] -
//КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШтрихкодНоменклатуры2(Знач Номенклатура)
// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] +        
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	                      |	И ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 1, 1) = ""2""");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ШК = Выборка.Штрихкод;
	Иначе
		ШК = "";
	КонецЕсли;                                                   
	
	Возврат ШК;
// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] -	
КонецФункции

&НаСервереБезКонтекста
Функция ПодготовитьШтрихкод(Знач Штрихкод, Знач ВесСтрокой) Экспорт
	
	Если СтрДлина(Штрихкод) = 13 И Лев(Штрихкод, 2) = "2_" Тогда
		Диапазон = ЗначениеНастроекПовтИсп.ДиапазонВесовыхШтрихкодовПоУмолчанию();
		
		Если Диапазон = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Не определены диапазоны весовых штрихкодов.';
									|en = 'Weight barcode ranges are not determined.'");	
		КонецЕсли;
		
		Строка = Диапазон + Сред(Штрихкод, 3, 5) + Лев(ВесСтрокой, 5);
		Возврат Строка + РегистрыСведений.ШтрихкодыНоменклатуры.КонтрольныйСимволEAN(Строка, 13);
	КонецЕсли;
	
	Возврат Штрихкод; 
	
КонецФункции
	
&НаСервере
Функция СобратьДанныеДляПечати()
	
	Штрихкод = ПолучитьШтрихкодНоменклатуры2(Номенклатура);
	Если Штрихкод = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Штрихкод не найден. Печать не выполнена");
		Возврат Неопределено;
	Иначе                                                                 
		// вставим вес нетто        
		ВесСтрокой = СтрЗаменить(Формат(МассаНетто, "ЧЦ=5; ЧДЦ=3; ЧРД=','; ЧН=Ноль; ЧВН="),",",""); 
		//Прав("0000000" + Лев(СтрЗаменитьПоРегулярномуВыражению(Вес, "[^0-9]", ""), 5), 5); 
		//Штрихкод = Лев(Штрихкод, 7) + ВесСтрокой + "_";
		Штрихкод = ПодготовитьШтрихкод(Штрихкод, ВесСтрокой); 
		НовыйШтрихкод = Штрихкод; 
		
	КонецЕсли;
	ТекущееВремя = ТекущаяДатаСеанса();
	Шаблон = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ЭтикеткаЗавесовПоУмолчанию, , Истина);
	
	ТипЧисло10_3 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10 ,3));
	ТипШаблон = Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников");
	ТипДата = Новый ОписаниеТипов("Дата");
	ТипСтрока1020 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1020));
	ТипУпаковка = Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения");
	ТипСтрока10 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10));
	
	ТаблицаЗначений = новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаЗначений.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));	
	ТаблицаЗначений.Колонки.Добавить("Упаковка", ТипУпаковка);	 	
	ТаблицаЗначений.Колонки.Добавить("Цена", ТипЧисло10_3);	
	ТаблицаЗначений.Колонки.Добавить("ЦенаДополнительно", ТипЧисло10_3);
	ТаблицаЗначений.Колонки.Добавить("Штрихкод", ТипСтрока1020); 
	ТаблицаЗначений.Колонки.Добавить("ШаблонЦенника", ТипШаблон);
	ТаблицаЗначений.Колонки.Добавить("КоличествоЦенников", ТипЧисло10_3);
	ТаблицаЗначений.Колонки.Добавить("ШаблонЭтикетки", ТипШаблон);	
	ТаблицаЗначений.Колонки.Добавить("ШаблонЭтикеткиПодготовлено", ТипШаблон);
	ТаблицаЗначений.Колонки.Добавить("КоличествоЭтикеток", ТипЧисло10_3);
	ТаблицаЗначений.Колонки.Добавить("ОстатокНаСкладе", ТипЧисло10_3);
	ТаблицаЗначений.Колонки.Добавить("КоличествоВДокументе", ТипЧисло10_3);
	ТаблицаЗначений.Колонки.Добавить("Весовой", Новый ОписаниеТипов("Булево"));	
	ТаблицаЗначений.Колонки.Добавить("ДатаПоследнегоИзмененияЦены", ТипДата);
	ТаблицаЗначений.Колонки.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно", ТипДата);
	
	ТаблицаЗначений.Колонки.Добавить("ТекущееВремя", ТипДата);
	ТаблицаЗначений.Колонки.Добавить("МассаТары", ТипСтрока10);
	ТаблицаЗначений.Колонки.Добавить("МассаНетто", ТипСтрока10);
	ТаблицаЗначений.Колонки.Добавить("МассаБрутто", ТипСтрока10);
	ТаблицаЗначений.Колонки.Добавить("ЕдТары", ТипУпаковка);
	
	// {{ПервыйБИТ ЛистТребований [без номера] [ASHolyavko@1cbit.ru] [04.08.2026] +        
	//в этикетке появился новый параметр "серия", чтоб не создавать новый шаблон, передаем пустой параметр
	ТаблицаЗначений.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	// }}ПервыйБИТ ЛистТребований [без номера] [ASHolyavko@1cbit.ru] [04.08.2026] -
	
		нов = ТаблицаЗначений.Добавить();
		нов.Номенклатура = Номенклатура;   
		нов.ШаблонЭтикетки = Шаблон;
		нов.Штрихкод = Штрихкод;
		нов.КоличествоЭтикеток = 1;  
		нов.ТекущееВремя = ТекущееВремя;
		нов.МассаТары   = Формат(МассаТары, "ЧЦ=10; ЧДЦ=3; ЧРД=,");
		нов.МассаНетто  = Формат(МассаНетто, "ЧЦ=10; ЧДЦ=3; ЧРД=,");
		нов.МассаБрутто = Формат(МассаБрутто, "ЧЦ=10; ЧДЦ=3; ЧРД=,");
	    нов.ЕдТары = Тара.ВесЕдиницаИзмерения;  
		нов.Весовой = Истина;
		
		
		
		
		
	Адрес = ПоместитьВоВременноеХранилище(ТаблицаЗначений);
	Возврат Адрес;

КонецФункции                    

&НаКлиенте
Процедура ОткрытьФормуПечати(Адрес)
// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] +        
	ПараметрыОткрытия = Новый Структура; 
	ПараметрыОткрытия.Вставить("ВладелецФормы");
	ПараметрыОткрытия.Вставить("ИменаМакетов", "ЭтикеткаТовары");		
	ПараметрыОткрытия.Вставить("ИмяМенеджераПечати", "Обработка.ПечатьЭтикетокИЦенников");
	ПараметрыОткрытия.Вставить("ИсточникДанных");
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм");
	ПараметрыОткрытия.Вставить("ОбъектыПечати", Новый СписокЗначений);
	МассивПараметрКоманды = новый Массив;
	МассивПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	ПараметрыОткрытия.Вставить("ПараметрКоманды", МассивПараметрКоманды);
	ПараметрыОткрытия.Вставить("ПараметрыВывода"); 
	ПараметрыОткрытия.Вставить("ПараметрыИсточника");
	СтруктураПараметрыПечати = Новый Структура;
	СтруктураПараметрыПечати.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	СтруктураПараметрыПечати.Вставить("ВидЦеныДополнительно", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	СтруктураПараметрыПечати.Вставить("Дата", ТекущаяДата());
	СтруктураПараметрыПечати.Вставить("ДатаДополнительно", ТекущаяДата());
	СтруктураПараметрыПечати.Вставить("МаксимальныйКодВесовогоТовара", 99999);
	СтруктураПараметрыПечати.Вставить("Организация");
	СтруктураПараметрыПечати.Вставить("ПравилоВыгрузкиВВесы", Ложь);
	СтруктураПараметрыПечати.Вставить("ПравилоОбмена");
	СтруктураПараметрыПечати.Вставить("Склад");
	СтруктураПараметрыПечати.Вставить("СтранаРегистрации", ПредопределенноеЗначение("Справочник.СтраныМира.Россия"));
	СтруктураПараметрыПечати.Вставить("СтруктураМакетаШаблона");
	СтруктураПараметрыПечати.Вставить("Товары", Адрес);
	
	
	ПараметрыОткрытия.Вставить("ПараметрыПечати", СтруктураПараметрыПечати);
	ПараметрыОткрытия.Вставить("ТекущийЯзык");
	ПараметрыОткрытия.Вставить("УникальныйИдентификаторХранилища");
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] -	
КонецПроцедуры

#Область КомандыФормы

&НаКлиенте
Процедура ВыбратьНоменклатуру(Команда)
	
	ОткрытьФормуВыбора(Номенклатура, "Номенклатура");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСерию(Команда)           
	
	ОткрытьФормуВыбора(Серия, "СерииНоменклатуры", "Серия");

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСмену(Команда)      
	
	ОткрытьФормуВыбора(СменаВесовщика, "бит_СменыВесовщика");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТару(Команда)
	
	ОткрытьФормуВыбора(Тара, "Номенклатура", "Тара");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВесовщика(Команда)             
	
	ОткрытьФормуВыбора(Весовщик, "Пользователи");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКонтроллера(Команда)     
	
	ОткрытьФормуВыбора(Контроллёр, "Сотрудники");

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбора(Знач Ключ, Знач Параметр, Знач ДопПараметр = "")
	
	ПФ = новый Структура;
	ПФ.Вставить("ЗакрыватьПриВыборе", Истина);
	ПФ.Вставить("МножественныйВыбор", Ложь);
	ПФ.Вставить("РежимВыбора", Истина);
	Если ЗначениеЗаполнено(Ключ) Тогда
		ПФ.Вставить("Ключ", Ключ);
		ПФ.Вставить("ТекущаяСтрока", Ключ);
	КонецЕсли;                   
	
	Если ДопПараметр = "Тара" Тогда
		ПФ.Вставить("Отбор", Новый Структура("ТипНоменклатуры", ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара")));
	ИначеЕсли ДопПараметр = "Серия" Тогда
		ПФ.Вставить("ВидНоменклатуры", ВладелецСерийВидаНоменклатуры(Номенклатура));
		// По умолчанию только показаны серии, у которых реквизит "Завешено" = Ложь. У пользователя должна быть возможность убрать этот отбор.
	КонецЕсли;
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект, Параметр + ДопПараметр);
	
	Форма = ОткрытьФорму("Справочник." + Параметр + ".ФормаВыбора", ПФ, ЭтаФорма,,,,ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Если ДопПараметр = "Серия" Тогда
		ПользовательскийОтбор = Форма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Форма.Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
		ПользовательскийОтбор.Элементы.Очистить();
	//    	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список,"бит_Завешено", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, Новый УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВладелецСерийВидаНоменклатуры(Номенклатура)
	
	ТекВид = Номенклатура.ВидНоменклатуры;
	Пока ЗначениеЗаполнено(ТекВид.ВладелецСерий) Цикл
		ТекВид = ТекВид.ВладелецСерий;
	КонецЦикла;    
	
	Возврат ТекВид;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбора(ВыбранноеЗначение, ДопПараметр) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметр = "СерииНоменклатурыСерия" Тогда
		Серия = ВыбранноеЗначение;	
		ПриИзмененииСерии();
	ИначеЕсли ДопПараметр = "Номенклатура" Тогда
		Номенклатура = ВыбранноеЗначение; 
		ПриИзмененииНоменклатуры();
	ИначеЕсли ДопПараметр = "бит_СменыВесовщика" Тогда
		СменаВесовщика = ВыбранноеЗначение;   
	ИначеЕсли ДопПараметр = "Сотрудники" Тогда
		Контроллёр = ВыбранноеЗначение;
		ПриИзмененииКонтроллера();
	ИначеЕсли ДопПараметр = "Пользователи" Тогда
		Весовщик = ВыбранноеЗначение;
		//ПриИзмененииВесовщика(); 
	ИначеЕсли ДопПараметр = "НоменклатураТара" Тогда
		Тара = ВыбранноеЗначение;   
		МассаТары = МассаТарыКГ(Тара);
		ПересчитатьНетто();
	ИначеЕсли ДопПараметр = "ШКНоменклатуры" Тогда
		ОбработатьШтрихкод(ВыбранноеЗначение, "Номенклатура");  
		ПриИзмененииНоменклатуры(); 
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			ПоказатьПредупреждение( , "Номенклатура по штрихкоду не найдена");
		КонецЕсли;		
	ИначеЕсли ДопПараметр = "ШКСерии" Тогда                   
		ОбработатьШтрихкод(ВыбранноеЗначение, "СерииНоменклатуры");
		ПослеОбработкиШКСерииНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСерии()
	Если ЗначениеЗаполнено(Серия) Тогда
		
		ДопСвойство = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ШтампЭмалировщика, , Истина);
	
		ШтампЭмалировщика = УправлениеСвойствами.ЗначениеСвойства(Серия.бит_Эмалировщик, ДопСвойство);
	 
	КонецЕсли;
КонецПроцедуры               

&НаКлиенте
Процедура ПересчитатьНетто()             
	
	МассаНетто = Макс(0, МассаБрутто - МассаТары);
	
КонецПроцедуры                           

&НаСервереБезКонтекста
Функция МассаТарыКГ(Знач Тара)
	
	Если Не ЗначениеЗаполнено(Тара) или Тара.ВесИспользовать = Ложь Тогда
		Масса = 0;
	Иначе
		кг = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("166");
		Масса = Тара.ВесЧислитель / ?(ЗначениеЗаполнено(Тара.ВесЗнаменатель), Тара.ВесЗнаменатель, 1);
		Если Тара.ЕдиницаИзмерения <> кг Тогда
			Масса = Масса * ?(ЗначениеЗаполнено(Тара.ЕдиницаИзмерения.Числитель), Тара.ЕдиницаИзмерения.Числитель, 1) / ?(ЗначениеЗаполнено(Тара.ЕдиницаИзмерения.Знаменатель), Тара.ЕдиницаИзмерения.Знаменатель, 1);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Масса;
КонецФункции             

&НаКлиенте
Процедура НайтиНоменклатуруПоШК(Команда)                                                                                         
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект, "ШКНоменклатуры");    
	
	ЗаголовокФормыВводаСерий = НСтр("ru = 'Введите штрихкод номенклатуры';
									|en = 'Enter barcode batch'");
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение,,ЗаголовокФормыВводаСерий);

КонецПроцедуры

&НаКлиенте
Процедура НайтиСериюПоШК(Команда)

	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект, "ШКСерии");    
	
	ЗаголовокФормыВводаСерий = НСтр("ru = 'Введите штрихкод серии';
									|en = 'Enter barcode batch'");
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение,,ЗаголовокФормыВводаСерий);
КонецПроцедуры      

#КонецОбласти

&НаСервере
Процедура ДобавитьТекстЗапросаНайденныхНомеровСерий(ТекстыЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	Штрихкоды.Номер,
	|	ЕСТЬNULL(СерииНоменклатуры.ГоденДо, Штрихкоды.ГоденДо) КАК ГоденДо,
	|	ЕСТЬNULL(СерииНоменклатуры.ДатаПроизводства, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПроизводства,
	|	Штрихкоды.Количество
	|ПОМЕСТИТЬ НайденныеНомераДляЗапроса
	|ИЗ
	|	Штрихкоды КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО Штрихкоды.Номер = СерииНоменклатуры.Номер
	|			И (Штрихкоды.ГоденДо = СерииНоменклатуры.ГоденДо
	|				ИЛИ Штрихкоды.ГоденДо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|			И (СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры)";
	
	//++ Локализация
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	Штрихкоды.Номер,
	|	ЕСТЬNULL(СерииНоменклатуры.ГоденДо, Штрихкоды.ГоденДо) КАК ГоденДо,
	|	ЕСТЬNULL(СерииНоменклатуры.ДатаПроизводства, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПроизводства,
	|	ЕСТЬNULL(СерииНоменклатуры.ПроизводительЕГАИС, ЗНАЧЕНИЕ(Справочник.КлассификаторОрганизацийЕГАИС.ПустаяСсылка)) КАК ПроизводительЕГАИС,
	|	ЕСТЬNULL(СерииНоменклатуры.Справка2ЕГАИС, ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)) КАК Справка2ЕГАИС,
	|	ЕСТЬNULL(СерииНоменклатуры.ИдентификаторПартииВЕТИС, НЕОПРЕДЕЛЕНО) КАК ИдентификаторПартииВЕТИС,
	|	ЕСТЬNULL(СерииНоменклатуры.ПроизводительВЕТИС, ЗНАЧЕНИЕ(Справочник.ПредприятияВЕТИС.ПустаяСсылка)) КАК ПроизводительВЕТИС,
	|	ЕСТЬNULL(СерииНоменклатуры.ЗаписьСкладскогоЖурналаВЕТИС, ЗНАЧЕНИЕ(Справочник.ЗаписиСкладскогоЖурналаВЕТИС.ПустаяСсылка)) КАК ЗаписьСкладскогоЖурналаВЕТИС,
	|	ЕСТЬNULL(СерииНоменклатуры.МаксимальнаяРозничнаяЦенаМОТП, НЕОПРЕДЕЛЕНО) КАК МаксимальнаяРозничнаяЦенаМОТП,
	|	Штрихкоды.Количество
	|ПОМЕСТИТЬ НайденныеНомераДляЗапроса
	|ИЗ
	|	Штрихкоды КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО Штрихкоды.Номер = СерииНоменклатуры.Номер
	|			И (Штрихкоды.ГоденДо = СерииНоменклатуры.ГоденДо
	|				ИЛИ Штрихкоды.ГоденДо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|			И (СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры)";
	//-- Локализация
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТекстЗапросаКоличестваНайденныхНомеровСерий(ТекстыЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ НайденныеНомераДляЗапроса.Серия
	|	КОНЕЦ КАК Серия,
	|	НайденныеНомераДляЗапроса.Номер,
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ НайденныеНомераДляЗапроса.ГоденДо
	|	КОНЕЦ КАК ГоденДо,
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ НайденныеНомераДляЗапроса.ДатаПроизводства
	|	КОНЕЦ КАК ДатаПроизводства,
	|	НайденныеНомераДляЗапроса.Количество
	|ИЗ
	|	НайденныеНомераДляЗапроса КАК НайденныеНомераДляЗапроса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоСерийПоНомеру КАК КоличествоСерийПоНомеру
	|		ПО НайденныеНомераДляЗапроса.Номер = КоличествоСерийПоНомеру.Номер";
	
	//++ Локализация
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ НайденныеНомераДляЗапроса.Серия
	|	КОНЕЦ КАК Серия,
	|	НайденныеНомераДляЗапроса.Номер,
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ НайденныеНомераДляЗапроса.ГоденДо
	|	КОНЕЦ КАК ГоденДо,
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ НайденныеНомераДляЗапроса.ДатаПроизводства
	|	КОНЕЦ КАК ДатаПроизводства,
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторОрганизацийЕГАИС.ПустаяСсылка)
	|		ИНАЧЕ НайденныеНомераДляЗапроса.ПроизводительЕГАИС
	|	КОНЕЦ КАК ПроизводительЕГАИС,
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)
	|		ИНАЧЕ НайденныеНомераДляЗапроса.Справка2ЕГАИС
	|	КОНЕЦ КАК Справка2ЕГАИС,
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НайденныеНомераДляЗапроса.ИдентификаторПартииВЕТИС
	|	КОНЕЦ КАК ИдентификаторПартииВЕТИС,
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ПредприятияВЕТИС.ПустаяСсылка)
	|		ИНАЧЕ НайденныеНомераДляЗапроса.ПроизводительВЕТИС
	|	КОНЕЦ КАК ПроизводительВЕТИС,
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЗаписиСкладскогоЖурналаВЕТИС.ПустаяСсылка)
	|		ИНАЧЕ НайденныеНомераДляЗапроса.ЗаписьСкладскогоЖурналаВЕТИС
	|	КОНЕЦ КАК ЗаписьСкладскогоЖурналаВЕТИС,
	|	ВЫБОР
	|		КОГДА КоличествоСерийПоНомеру.КоличествоНайденныхСерий > 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НайденныеНомераДляЗапроса.МаксимальнаяРозничнаяЦенаМОТП
	|	КОНЕЦ КАК МаксимальнаяРозничнаяЦенаМОТП,
	|	НайденныеНомераДляЗапроса.Количество
	|ИЗ
	|	НайденныеНомераДляЗапроса КАК НайденныеНомераДляЗапроса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоСерийПоНомеру КАК КоличествоСерийПоНомеру
	|		ПО НайденныеНомераДляЗапроса.Номер = КоличествоСерийПоНомеру.Номер";
	//-- Локализация
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура МассаБруттоПриИзменении(Элемент)
	ПересчитатьНетто();
КонецПроцедуры

&НаКлиенте
Процедура НовыйЗавес(Команда)
	ОбнулитьФорму();
КонецПроцедуры      

&НаКлиенте
Процедура ОбнулитьФорму(ОчищатьНоменклатуру = Истина)
	
	Если ОчищатьНоменклатуру Тогда 
		Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	//Тара = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	Серия = ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка");
	МассаБрутто = 0;
	МассаНетто = 0;
	ШтампЭмалировщика = "";
	//МассаТары = 0;
	СписокСерий.Очистить();
	НовыйШтрихкод = "";
	
КонецПроцедуры

&НаКлиенте
Процедура МассаТарыПриИзменении(Элемент)
	ПересчитатьНетто();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНоменклатуру(Команда)
	Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	ПриИзмененииНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ШтампКонтроллёраПриИзменении(Элемент)
	НайтиКонтроллераНаСервере();		
КонецПроцедуры                  

&НаСервере
Процедура НайтиКонтроллераНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ Первые 1
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники.ДополнительныеРеквизиты КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Свойство = &ШтампКонтроллера
	|	И Сотрудники.Значение.Наименование = &Значение");  
	
	СвойствоШтампКонтроллера = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ШтампКонтроллера, , Истина); 

	Запрос.УстановитьПараметр("ШтампКонтроллера", СвойствоШтампКонтроллера);
	Запрос.УстановитьПараметр("Значение", ШтампКонтроллёра);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Контроллёр = Выборка.Ссылка;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сотрудник не найден");
		Контроллёр = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПартиюЗавесов(Команда) 
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 2:54:22] +        
	НачатьПартиюЗавесовНаСервере(); 
	ДоступностьЭлементов();
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 2:54:22] -
КонецПроцедуры

&НаСервере
Процедура НачатьПартиюЗавесовНаСервере()
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [30.03.2026 5:05:15] +        
	Док = Документы.бит_ПартияЗавесов.СоздатьДокумент(); 
	Док.Смена = СменаВесовщика;
	Док.Дата = ТекущаяДатаСеанса(); 
	Док.Автор = Пользователи.АвторизованныйПользователь();
	Док.Записать();
	ПартияЗавеса = Док.Ссылка;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [30.03.2026 5:05:15] -
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗавершитьПартиюЗавесов(Команда)  
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 2:53:59] +        
	Ответ = Ждать ВопросАсинх("Завершить партию завесов?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Массив = Новый Массив;
		Массив.Добавить(ПартияЗавеса);
	
		ЗавершитьПартиюЗавесовНаСервере();
		ДоступностьЭлементов(); 
		
		// теперь печать
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("бит_ПартияЗавесов"); 
		ТабДок = ПолучитьТабДокНаСервере(Массив);
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
		КоллекцияПечатныхФорм[0].Экземпляров = 1;
    	КоллекцияПечатныхФорм[0].СинонимМакета = "(бит) Партия завеса";  
	    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);
		
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 2:53:59] -
КонецПроцедуры                                

&НаСервереБезКонтекста
Функция ПолучитьТабДокНаСервере(Массив)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [01.04.2026 1:27:34] +        
	Возврат Документы.бит_ПартияЗавесов.СформироватьПечатнуюФормуПартияЗавесов(Массив);
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [01.04.2026 1:27:34] -
КонецФункции

&НаСервере
Процедура ЗавершитьПартиюЗавесовНаСервере()
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [30.03.2026 5:05:15] +        
	ДокОбъект = ПартияЗавеса.ПолучитьОбъект();
	// свернем полностью дублированные строки
	ТЧ = ДокОбъект.ДанныеСмены.Выгрузить();
	РеквизитыТЧ = Метаданные.Документы.бит_ПартияЗавесов.ТабличныеЧасти["ДанныеСмены"].Реквизиты;
	СтрокаСвертки = "";
	Для каждого стр из РеквизитыТЧ Цикл
		СтрокаСвертки = СтрокаСвертки + стр.Имя + ",";
	КонецЦикла;
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаСвертки);
	ТЧ.Свернуть(СтрокаСвертки);             
	ДокОбъект.ДанныеСмены.Загрузить(ТЧ);
	// проводим документ
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ПартияЗавеса = Документы.бит_ПартияЗавесов.ПустаяСсылка();
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [30.03.2026 5:05:15] -
КонецПроцедуры




   