#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	УдалениеДвиженийПриОбмене = ЭтотОбъект.ДополнительныеСвойства.Свойство("СинхронизацияДанныхЧерезУниверсальныйФорматУдалениеДвижений")
		И ЭтотОбъект.ДополнительныеСвойства.СинхронизацияДанныхЧерезУниверсальныйФорматУдалениеДвижений;
		
	Если Не УдалениеДвиженийПриОбмене И ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	
	Если Количество()>0 Тогда
	    Заголовок = СокрЛП(Регистратор);
	КонецЕсли; 
	
	ВидыСоставныхСубконто = Новый Соответствие;
	ШаблонСообщения = Нстр("ru='Проводка № %1 <%2>: не заполнен счет %3.';
						   |en='Posting number %1 <%2>: is not filled by %3.'");
	Для Каждого Проводка Из ЭтотОбъект Цикл
        
        СвСчДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
        СвСчКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
        
		Если НЕ ЗначениеЗаполнено(Проводка.СчетДт) И НЕ СвСчКт.Забалансовый Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Формат(Проводка.НомерСтроки + 1,"ЧЦ=15; ЧГ="), Проводка.Содержание, Нстр("ru='дебета';en='debit'")); 
			Если ЗначениеЗаполнено(Заголовок) Тогда
				ОбщегоНазначения.СообщитьПользователю(Заголовок);
				Заголовок = "";		
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Проводка.СчетКт) И НЕ СвСчДт.Забалансовый Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Формат(Проводка.НомерСтроки + 1,"ЧЦ=15; ЧГ="), Проводка.Содержание, Нстр("ru='кредита';en='loan'")); 
			Если ЗначениеЗаполнено(Заголовок) Тогда
				ОбщегоНазначения.СообщитьПользователю(Заголовок);
				Заголовок = "";		
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		бит_БухгалтерскийУчет.КорректировкаПустыхЗначенийСубконто(Проводка.СубконтоДт, ВидыСоставныхСубконто);
		бит_БухгалтерскийУчет.КорректировкаПустыхЗначенийСубконто(Проводка.СубконтоКт, ВидыСоставныхСубконто);
		
	КонецЦикла;

	бит_УправленческийУчет.ОбработатьПроводкиПоТипамПроводок(ЭтотОбъект, Регистратор);
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли