#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мНастройкиВидовОбластей Экспорт; // Хранит настройки видов областей доступа.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат; 	
	КонецЕсли; 
	
	Для каждого Запись Из ЭтотОбъект Цикл
	
		Если Не ЗначениеЗаполнено(Запись.ВидНастройки) Тогда		 
			ТекстСообщения = Нстр("ru='Не заполнено значение реквизита ""Вид настройки"".';
								  |en='Not filled props to ""Settings View"".'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Запись, "ВидНастройки",, Отказ);
		КонецЕсли; 

		Если Не ЗначениеЗаполнено(Запись.ВидОбластиДоступа) Тогда 		 
			ТекстСообщения = Нстр("ru='Не заполнено значение реквизита ""Вид области доступа"".';
								  |en='Not filled props value ""View access area.""'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Запись, "ВидОбластиДоступа",, Отказ);
		КонецЕсли; 

		Если Не ЗначениеЗаполнено(Запись.Пользователь) Тогда 		 
			ТекстСообщения = Нстр("ru='Не заполнено значение реквизита ""Пользователь"".';
								  |en='Not filled value props ""User"".'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Запись, "Пользователь",, Отказ);
		КонецЕсли;		 
		        
		Если ЗначениеЗаполнено(Запись.ВидНастройки) 
			И ЗначениеЗаполнено(Запись.ВидОбластиДоступа) 
			И ЗначениеЗаполнено(Запись.Пользователь) Тогда
			
			ПротивоположныйВидНастройки = ?(Запись.ВидНастройки = Перечисления.бит_рлс_ВидыНастроекПрав.Доступ,
	 										Перечисления.бит_рлс_ВидыНастроекПрав.Запрет,
											Перечисления.бит_рлс_ВидыНастроекПрав.Доступ);
			
			НаборЗаписей = РегистрыСведений.бит_рлс_ПраваДоступа.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидНастройки.Установить(ПротивоположныйВидНастройки);
			НаборЗаписей.Отбор.ВидОбластиДоступа.Установить(Запись.ВидОбластиДоступа);
			НаборЗаписей.Отбор.Пользователь.Установить(Запись.Пользователь);
			НаборЗаписей.Отбор.Разделитель_1.Установить(Запись.Разделитель_1);
			НаборЗаписей.Отбор.Разделитель_2.Установить(Запись.Разделитель_2);
			НаборЗаписей.Отбор.Разделитель_3.Установить(Запись.Разделитель_3);
			НаборЗаписей.Отбор.Разделитель_4.Установить(Запись.Разделитель_4);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				
				ТекстИзмерений = Нстр("ru = 'Вид настройки:'")+ Символы.НПП + Запись.ВидНастройки 
								+ Нстр("ru=', Вид области доступа: ';en=', Type of access:'") + Запись.ВидОбластиДоступа 
								+ Нстр("ru=', Пользователь: ';en='Username:'") + Запись.Пользователь;
								
				Если Запись.ВидОбластиДоступа = Перечисления.бит_рлс_ВидыОбластейДоступа.ЦФОСтатьиОборотов Тогда
					ТекстИзмерений = СтрШаблон(Нстр("ru='%1, ЦФО: %2, Статья оборотов: %3';
												    |en='%1, FRC: %2, Article revolutions: %3'"), 
											   ТекстИзмерений, Запись.Разделитель_1, Запись.Разделитель_2);
				ИначеЕсли Запись.ВидОбластиДоступа = Перечисления.бит_рлс_ВидыОбластейДоступа.Пользователи Тогда
					ТекстИзмерений = СтрШаблон(Нстр("ru='%1, Пользователь: %2';
												    |en='%1, Username: %2'"), 
											   ТекстИзмерений, Запись.Разделитель_3);
				ИначеЕсли Запись.ВидОбластиДоступа = Перечисления.бит_рлс_ВидыОбластейДоступа.Проекты Тогда					
				    ТекстИзмерений = СтрШаблон(Нстр("ru='%1, Проект: %2';
												    |en='%1, Project: %2'"), 
											   ТекстИзмерений, Запись.Разделитель_4);
				КонецЕсли;
				
				ТекстСообщения = Нстр("ru='Существует аналогичная запись в регистре с противоположным значением вида настройки.';
									  |en='There is a similar entry in the register to the opposite value of the kind of customization.'") 
								 + Символы.ПС + ТекстИзмерений;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли;                                                                                                                   	 	
		 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Область Инициализация

мНастройкиВидовОбластей = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиВидовОбластейДоступа");

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли