////////////////////////////////////////////////////////////////////////////////
// ОБЩИЙ МОДУЛЬ СИСТЕМЫ ЛИЦЕНЗИРОВАНИЯ 1.6
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура выводит сообщение пользователю.
//
// Параметры:
//  ТекстСообщения - Строка.
//  ТекущееПоле    - Строка - Поле для которого выводим сообщение (По умолчанию = "").
//
Процедура ВывестиСообщение(ТекстСообщения, ТекущееПоле = "") Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле  = ТекущееПоле;
	Сообщение.Сообщить();
	
КонецПроцедуры

// Заполнение каркаса структуры локализации.
//
Процедура ЗаполнитьКаркасСтруктурыЛокализации(СтруктураЛокализации)

	Для Каждого ЭлементЗн Из СтруктураЛокализации Цикл
		
		ЭлементЗн.Значение.Вставить("РезультатыМетодов",           Новый Структура);
		ЭлементЗн.Значение.Вставить("СообщенияИСтроки",            Новый Структура);    
		ЭлементЗн.Значение.Вставить("бит_сл_КлиентЛицензирования", Новый Структура);
		ЭлементЗн.Значение.бит_сл_КлиентЛицензирования.Вставить("Сообщения",                 Новый Структура);
		ЭлементЗн.Значение.бит_сл_КлиентЛицензирования.Вставить("Форма",                     Новый Структура);
		ЭлементЗн.Значение.бит_сл_КлиентЛицензирования.Вставить("Форма_8_3_6",               Новый Структура);
		ЭлементЗн.Значение.бит_сл_КлиентЛицензирования.Вставить("Форма_СписокПользователей", Новый Структура);
		
	КонецЦикла; 
	
КонецПроцедуры 

// Формирует соответсвие ключей и локализированных строк.
//
// Параметры:
//  КодЯзыка - Строка (По умолчанию = "ru").
//
// Возвращаемое значение:
//  ЛокализацияСоответствие - Соответствие.
//
Функция ПолучитьДанныеЛокализации(КодЯзыка = "ru") Экспорт
	
	Локализация = Новый Структура;
	
	// Доступные языки локализации
	Локализация.Вставить("ru", Новый Структура);
	Локализация.Вставить("en", Новый Структура);
	
	// Создание каркаса структуры
	ЗаполнитьКаркасСтруктурыЛокализации(Локализация); 
	
	// Выбор локализации
	Если Не Локализация.Свойство(КодЯзыка) Тогда
		КодЯзыка = "ru";		
	КонецЕсли;	
	
	// Заполнение локализации	
	#Область СообщенияИСтроки
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_0", "БИТ:Система лицензирования: Нет ошибок.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_0", "License Server: No errors.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_1", "БИТ:Система лицензирования: Не удалось соединиться с сервером лицензий.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_1", "License Server: Could not connect to the license server.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_2", "БИТ:Система лицензирования: Система лицензирования отключена, выполнение удаленной функции не возможно.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_2", "License Server: The licensing system is disabled, the execution of the remote function is not possible.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_3", "БИТ:Система лицензирования: Не удалось обновить значение программного продукта.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_3", "License Server: Failed to update the application information.");	
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_4", "БИТ:Система лицензирования: Не удалось сохранить временный файл.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_4", "License Server: Unable to save the temporary file.");	
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_5", "БИТ:Система лицензирования: В ходе получения данных возникла ошибка.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_5", "License Server: An error occurred during receiving data.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_6", "БИТ:Система лицензирования: Запрашиваемый параметр не найден.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_6", "License Server: The requested parameter is not found.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_7", "БИТ:Система лицензирования: Неопознанный ответ от сервера лицензий.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_7", "License Server: Unidentified response from the license server.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_8", "БИТ:Система лицензирования: Во время выполнения функции на сервере лицензий, возникла ошибка.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_8", "License Server: During the execution of the functions on the license server, an error occurred.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_9", "БИТ:Система лицензирования: Сервер лицензий вернул результат, не найдено обязательное поле Result.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_9", "License Server: The license server returns the result, not found a required field Result.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_10", "БИТ:Система лицензирования: Версия модуля ""бит_сл_сервер"" не совпадает с версией обработки ""бит_сл_КлиентЛицензирования"".");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_10", "License Server: Version of the module ""бит_сл_сервер"" does not match the version of data processor ""бит_сл_КлиентЛицензирования"".");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_11", "БИТ:Система лицензирования: Входящий пакет данных отклонен по причине возможного использования пиратского программного обеспечения.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_11", "License Server: Incoming data package is rejected due to the possibility of use a pirated software.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_12", "БИТ:Система лицензирования: Сервер лицензий отказал в выполнении функции для клиента.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_12", "License Server: The license server refused the client''s request.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_13", "БИТ:Система лицензирования: Входящий пакет данных поврежден или не является пакетом сервера лицензий 1.6.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_13", "License Server: Incoming data package is corrupted or not the package of License Server 1.6.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_14", "БИТ:Система лицензирования: Не удалось обратиться к серверу лицензий 1.6 через службу ассистента сервера лицензий.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_14", "License Server: An error occurred during connection to the License Server 1.6 through License Server Assistant service.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_15", "БИТ:Система лицензирования: В программном продукте не установлен идентификатор решения, обратитесь в службу поддержки.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультата_15", "License Server: Application ID is not defined, please contact support team.");	
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_0", "Нет ошибок.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_0", "No errors.");	
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_1", "Не удалось установить соединение с ассистентом сервера лицензий.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_1", "Could not connect to the license server assistant.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_2", "При разборе JSON строки возникла ошибка.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_2", "An error occurred while parsing the JSON line.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_3", "При обращении к внешнему сервису, получен не ожидаемый HTTP код результата.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_3", "During access to an external service, unexpected HTTP result code was received.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_4", "Интеграция с внешним сервисом отключена в настройках конфигурации.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_4", "Integration with an external service is disabled in the configuration settings.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_5", "При формировании JSON объекта для передачи в удаленный сервис возникла ошибка.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_5", "An error occurred while generating the JSON object for transmission to the remote service.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_6", "Передан не поддерживаемый вид HTTP запроса.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_6", "An unsupported HTTP request has been submitted.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_7", "Структура полученного JSON объекта не идентифицирована.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_7", "The structure of the received JSON object is not identified.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_8", "Ожидался другой JSON объект.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_8", "Another JSON object was expected.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_9", "Поддержка клиента лицензирования выполнялась дольше 6 секунд 5 раз и была отключена.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистента_9", "License client support was performed for more than 6 seconds 5 times and was disabled.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистентаНеЗаполнено", "Описание не заполнено.");
	Локализация.en.СообщенияИСтроки.Вставить("ОписаниеКодаРезультатаАссистентаНеЗаполнено", "Description is empty");	
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОбщаяСтрокаСоединенияОбновлена", "БИТ:Система лицензирования: Произведено обновление общей строки соединения с сервером лицензий с ""##1##"" на ""##2##:##3##"".");
	Локализация.en.СообщенияИСтроки.Вставить("ОбщаяСтрокаСоединенияОбновлена", "License Server: Common connection string to the license server was updated from ""##1##"" to ""##2##:##3##"".");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ПерсональнаяСтрокаСоединенияОбновлена", "БИТ:Система лицензирования: Произведено обновление персональной строки соединения с сервером лицензий с ""##1##"" на ""##2##:##3##"".");
	Локализация.en.СообщенияИСтроки.Вставить("ПерсональнаяСтрокаСоединенияОбновлена", "License Server: Personal connection string to the license server was updated from ""##1##"" to ""##2##:##3##"".");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ПроизведеноОбновлениеКлиента", "БИТ:Система лицензирования: Произведено обновление клиента с версии ""##1##"" до версии ""##2##"".");
	Локализация.en.СообщенияИСтроки.Вставить("ПроизведеноОбновлениеКлиента", "License Server: The client was updated from version ""##1##"" to version ""##2##"".");
	
	Локализация.ru.СообщенияИСтроки.Вставить("НеАктивирован", "не активирован");
	Локализация.en.СообщенияИСтроки.Вставить("НеАктивирован", "not activated");
	
	Локализация.ru.СообщенияИСтроки.Вставить("Активирован", "активирован");
	Локализация.en.СообщенияИСтроки.Вставить("Активирован", "activated");
	
	Локализация.ru.СообщенияИСтроки.Вставить("Клиент", "Клиент");
	Локализация.en.СообщенияИСтроки.Вставить("Клиент", "Client");
	
	Локализация.ru.СообщенияИСтроки.Вставить("Сервер", "Сервер");
	Локализация.en.СообщенияИСтроки.Вставить("Сервер", "Server");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ЛицензияБудетПолученаПриПервомЗапросе", "Лицензия будет получена при первом запросе.");
	Локализация.en.СообщенияИСтроки.Вставить("ЛицензияБудетПолученаПриПервомЗапросе", "License will be received on the first request.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ВсеОбъектыДоступны", "Программное лицензирование вашего продукта отключено.");
	Локализация.en.СообщенияИСтроки.Вставить("ВсеОбъектыДоступны", "Software licensing of your product is disabled.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("КонструкторСтруктурыБезВетки", "БИТ:Система лицензирования: Конструктор структуры обработки не содержит необходимой ветки.");
	Локализация.en.СообщенияИСтроки.Вставить("КонструкторСтруктурыБезВетки", "License Server: Constructor of processing structure does not contain of the required node.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("РазмерПакетаНеСоотвТребованиям", "Размер входящего пакета данных не соответствует требованиям.");
	Локализация.en.СообщенияИСтроки.Вставить("РазмерПакетаНеСоотвТребованиям", "The size of the incoming data package does not match the requirements.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ДанныеПакетаПовреждены", "Данные пакета повреждены");
	Локализация.en.СообщенияИСтроки.Вставить("ДанныеПакетаПовреждены", "The data package is damaged");
	
	Локализация.ru.СообщенияИСтроки.Вставить("НеУдалосьСоединитьсяССервером", "Не удалось установить соединение с сервером");
	Локализация.en.СообщенияИСтроки.Вставить("НеУдалосьСоединитьсяССервером", "Could not connect to server");
	
	Локализация.ru.СообщенияИСтроки.Вставить("НеПравильныйТипВходящегоОбъекта", "Система лицензирования 1.6: При выводе сообщения об ошибке, возникла ошибка (не правильный тип входящего объекта)");
	Локализация.en.СообщенияИСтроки.Вставить("НеПравильныйТипВходящегоОбъекта", "License Server: An error occurred during output the error message (not correct type of the input object)");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ОшибкаПриВыводеСообщенияИСтрокиОбОшибке", "Система лицензирования 1.6: При выводе сообщения об ошибке, возникла ошибка (обязательное поле объекта не найдено)");
	Локализация.en.СообщенияИСтроки.Вставить("ОшибкаПриВыводеСообщенияИСтрокиОбОшибке", "License Server: An error occurred during output the error message (required object field not found)");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ПолученаЛицензияДля", "Получена лицензия для: ""##1##""");
	Локализация.en.СообщенияИСтроки.Вставить("ПолученаЛицензияДля", "License received for: ""##1##""");

	Локализация.ru.СообщенияИСтроки.Вставить("ПолученаЛицензияДляВашегоПродукта", "Лицензия для вашего продукта успешно получена.");
	Локализация.en.СообщенияИСтроки.Вставить("ПолученаЛицензияДляВашегоПродукта", "The license for your software was successfully received.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("ПожалуйстаПодождите", "Пожалуйста, подождите...");
	Локализация.en.СообщенияИСтроки.Вставить("ПожалуйстаПодождите", "Please wait...");
	
	Локализация.ru.СообщенияИСтроки.Вставить("НедостаточноПравДляСпискаПользователей", "Недостаточно прав для доступа к списку пользователей информационной базы.");
	Локализация.en.СообщенияИСтроки.Вставить("НедостаточноПравДляСпискаПользователей", "Insufficient rights to access the list of infobase users.");
	
	Локализация.ru.СообщенияИСтроки.Вставить("РегламентноеЗаданиеОтключено", "Регламентное задание ""Менеджер сеансов (БИТ)"" отключено. Для корректной работы продукта требуется разрешение запуска регламентных заданий на сервере. Обратитесь к администратору базы.");
	Локализация.en.СообщенияИСтроки.Вставить("РегламентноеЗаданиеОтключено", "Scheduled Job ""Licence Server Session Manager"" is disabled. Scheduled jobs should be enabled on the server for the smooth operation of the software. Please contact administrator for more information.");

	Локализация.ru.СообщенияИСтроки.Вставить("ТребуетсяОбновлениеСервера", "Для корректной работы продукта необходимо обновить БИТ.Сервер лицензий 1.6 до версии ##1## или выше.");
	Локализация.en.СообщенияИСтроки.Вставить("ТребуетсяОбновлениеСервера", "License server should be updated to the version ##1## or higher for the smooth operation of the software.");	
	
	Локализация.ru.СообщенияИСтроки.Вставить("ЛокализацияСодержитОшибки", "БИТ:Система лицензирования: Локализационные данные содержат ошибки в строке ""##1##""");
	Локализация.en.СообщенияИСтроки.Вставить("ЛокализацияСодержитОшибки", "License Server: Error was found in the localization data (row ""##1##"").");	
	
	Локализация.ru.СообщенияИСтроки.Вставить("НеПравильныйПорт", "Клиент лицензирования версии 1.6.3 и выше использует
		|""TCP Порт 2"" сервера лицензий.
		|Значение по умолчанию: 10601'"); 
	Локализация.en.СообщенияИСтроки.Вставить("НеПравильныйПорт", "Client of license server version 1.6.3 and above uses
		|""TCP Port 2"" of the license server.
		|Default value: 10601");
	
	Локализация.ru.СообщенияИСтроки.Вставить("НаСервереЛицензийНеЗарегистрированПродукт", "На сервере лицензий не зарегистрирован продукт ##1##");
	Локализация.en.СообщенияИСтроки.Вставить("НаСервереЛицензийНеЗарегистрированПродукт", "##1## is not registered in License server");
	
	Локализация.ru.СообщенияИСтроки.Вставить("НеУдалосьСоединитьсяССерверомЛицензий", "Не удалось соединиться с сервером лицензий.");
	Локализация.en.СообщенияИСтроки.Вставить("НеУдалосьСоединитьсяССерверомЛицензий", "Could not connect to the license server.");	
	
	Локализация.ru.СообщенияИСтроки.Вставить("ПоПричине", "По причине: ");
	Локализация.en.СообщенияИСтроки.Вставить("ПоПричине", "By reason of: ");	
	#КонецОбласти
	
	#Область бит_сл_КлиентЛицензирования_Форма
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("ЭтаФорма_Заголовок", "БИТ:Клиент лицензирования 1.6");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("ЭтаФорма_Заголовок", "License Server 1.6");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОбновитьСостояние_Заголовок", "Обновить");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОбновитьСостояние_Заголовок", "Refresh");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОбновитьСостояние_Подсказка", "Выполнить соединение и активировать продукт");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОбновитьСостояние_Подсказка", "Connect to the license server to activate the software");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОткрытьЗакладкуНастроек_Заголовок", "Открыть закладку настроек");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОткрытьЗакладкуНастроек_Заголовок", "Open Settings");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОткрытьЗакладкуНастроек_Подсказка", "Открыть закладку настроек");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОткрытьЗакладкуНастроек_Подсказка", "Open Settings");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОткрытьФормуСписка_Заголовок", "Задать список исключения");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОткрытьФормуСписка_Заголовок", "Specify the List of Exceptions");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОткрытьФормуСписка_Подсказка", "Изменить список исключения");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_ОткрытьФормуСписка_Подсказка", "Modify the list of exceptions");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_СохранитьНастройки_Заголовок", "Сохранить настройки");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_СохранитьНастройки_Заголовок", "Save Settings");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_СохранитьНастройки_Подсказка", "Сохранить настройки");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Команды_СохранитьНастройки_Подсказка", "Save settings");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ВерсияКлиентаИСервера_Заголовок", "Версия клиента и сервера лицензий ");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ВерсияКлиентаИСервера_Заголовок", "Version ");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_СостояниеАктивации_Заголовок", "Состояние активации");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_СостояниеАктивации_Заголовок", "Activation Status");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ГруппаСообщенияСистемы_Заголовок", "Информация");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ГруппаСообщенияСистемы_Заголовок", "Information");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_Настройки_Заголовок", "Настройки");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_Настройки_Заголовок", "Settings");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ОбщиеНастройки_Заголовок", "Общие настройки");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ОбщиеНастройки_Заголовок", "Common Settings");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ОсновнаяНадпись_Заголовок", "Сообщения системы");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ОсновнаяНадпись_Заголовок", "System messages");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_АдресСервераИПорт_Заголовок", "Адрес БИТ:Сервера лицензий 1.6");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_АдресСервераИПорт_Заголовок", "License Server IP Address");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общАдресСервераИПорт_Заголовок", "Адрес БИТ:Сервера лицензий 1.6");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общАдресСервераИПорт_Заголовок", "License Server IP Address");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_АдресСервераИПорт_Подсказка", 
		"Для работы продукта необходимо наличие в сети БИТ.Сервера лицензий версии 1.6.5.160 или выше. Здесь необходимо указать строку подключения, включающую IP адрес и опционально TCP порт 2 сервера лицензий.
	    ||Например: 127.0.0.1 или 127.0.0.1:10601");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_АдресСервераИПорт_Подсказка", 
		"License server version 1.6.5.160 and above should be available over your network for the smooth operation of the software. Here you should enter the connection string to the license server including IP address and TCP port #2 of the license server if necessary.
		||For example: 127.0.0.1 or 127.0.0.1:10601");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ПортАссистентаСервераЛицензий_Заголовок", "Порт ассистента сервера лицензий");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ПортАссистентаСервераЛицензий_Заголовок", "License Server Assistant Service Port");	
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ПортАссистентаСервераЛицензий_Подсказка", "Для работы продукта необходим сервер лицензий версии 1.6.5.160 или выше с запущенной службой ассистента сервера лицензий. Здесь необходимо указать TCP порт службы ассистента сервера лицензий. По умолчанию: 10602.");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ПортАссистентаСервераЛицензий_Подсказка", "License server version 1.6.5.160 and above with working License Server Assistant service is required for the smooth operation of the software. Here you should enter TCP port of the License Server Assistant service. By default: 10602.");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ИспользоватьProxyСервер_Заголовок", "Использовать proxy сервер");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ИспользоватьProxyСервер_Заголовок", "Use Proxy Server");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общИспользоватьProxyСервер_Заголовок", "Использовать proxy сервер");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общИспользоватьProxyСервер_Заголовок", "Use Proxy Server");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ДекорацияПредупреждение_Заголовок", "Опубликованы общие настройки, общие настройки имеют более высокий приоритет.");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ДекорацияПредупреждение_Заголовок", "Common settings is applied. Common settings have a higher priority.");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ВремяОжиданияДоАктивации_Заголовок", "Отложенная активация продукта");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ВремяОжиданияДоАктивации_Заголовок", "Delayed Software Activation");
		
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ВремяОжиданияДоАктивации_Подсказка", 
		"Допустимое значение от 0 до 15 (сек).
		||Определяет задержку перед обращением к серверу лицензий для инициализации платформы 1С.
		||При установке значения 0 обращение к серверу будет выполнено при первой необходимости.");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ВремяОжиданияДоАктивации_Подсказка", 
		"The range from 0 to 15 (seconds).
		||Defines the time before send license request to the license server.
		||If set to 0 the license request will be perfomed on demand.");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ОбъяснениеДействий_Заголовок", 
		"Данные параметры позволяют задать единые настройки для всех пользователей ИБ 1С.
		||При необходимости, можно задать список исключения, для пользователей из списка
		||исключения общие настройки не применяются.");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ОбъяснениеДействий_Заголовок", 
		"These options allow you to specify common settings for all users.
		||If necessary, you can specify a list of exceptions, for users in exception list
		||common settings are not applied.");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общАдресСервераИПорт_Подсказка", 
		"Для работы продукта необходимо наличие в сети БИТ.Сервера лицензий версии 1.6.5.160 или выше. Здесь необходимо указать строку подключения, включающую IP адрес и опционально TCP порт 2 сервера лицензий.
	    ||Например: 192.168.1.10 или 192.168.1.10:10601");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общАдресСервераИПорт_Подсказка", 
		"License server version 1.6.5.160 and above should be available over your network for the smooth operation of the software. Here you should enter the connection string to the license server including IP address and TCP port #2 of the license server if necessary.
		||For example: 192.168.1.10 or 192.168.1.10:10601");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общПортАссистентаСервераЛицензий_Заголовок", "Порт ассистента сервера лицензий");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общПортАссистентаСервераЛицензий_Заголовок", "License Server Assistant Service Port");	
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общПортАссистентаСервераЛицензий_Подсказка", 
		"Для работы продукта необходим сервер лицензий версии 1.6.5.160 или выше с запущенной службой ассистента сервера лицензий. Здесь необходимо указать TCP порт службы ассистента сервера лицензий. 
		||По умолчанию: 10602.");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общПортАссистентаСервераЛицензий_Подсказка", 
		"License server version 1.6.5.160 and above with working License Server Assistant service is required for the smooth operation of the software. Here you should enter TCP port of the License Server Assistant service. 
		||By default: 10602.");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общВремяОжиданияДоАктивации_Заголовок", "Отложенная активация продукта");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общВремяОжиданияДоАктивации_Заголовок", "Delayed Software Activation");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общВремяОжиданияДоАктивации_Подсказка", 
		"Допустимое значение от 0 до 15 (сек). 
		||Определяет задержку перед обращением к серверу лицензий для инициализации платформы 1С.
		||При установке значения 0 обращение к серверу будет выполнено при первой необходимости.");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общВремяОжиданияДоАктивации_Подсказка", 
		"The range from 0 to 15 (seconds).
		||Defines the time before send license request to the license server.
		||If set to 0 the license request will be perfomed on demand.");	
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ДекорацияСписокИсключенияНадпись_Заголовок", "список исключения содержит записей:");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ДекорацияСписокИсключенияНадпись_Заголовок", "exception list contains records:");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общПубликацияНастроек_Заголовок", "Опубликовать настройки для пользователей информационной базы ");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_общПубликацияНастроек_Заголовок", "Publish Settings for Database Users ");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ДекорацияИзменитьВерсиюПродукта_Заголовок", "Изменить версию продукта");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ДекорацияИзменитьВерсиюПродукта_Заголовок", "Change product version");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ДекорацияИнформацияДляТехПоддержки_Заголовок", "Информация для технической поддержки");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма.Вставить("Элементы_ДекорацияИнформацияДляТехПоддержки_Заголовок", "Show technical information for support team");
	#КонецОбласти
	
	#Область бит_сл_КлиентЛицензирования_Форма_8_3_6
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_8_3_6.Вставить("Элементы_ДекорацияСотояниеАктивации_Заголовок", "Состояние активации:");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_8_3_6.Вставить("Элементы_ДекорацияСотояниеАктивации_Заголовок", "Activation Status:");
	#КонецОбласти 
	
	#Область Форма_СписокПользователей
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("ЭтаФорма_Заголовок", "Публикация общих настроек - список исключения");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("ЭтаФорма_Заголовок", "Publication of Common Settings - Exception List");	
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Элементы_ДекорацияОписание_Заголовок", "Для выбранных пользователей не будут применяться общие настройки.");
	// АПК:254-выкл. Это не запрос.
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Элементы_ДекорацияОписание_Заголовок", "Selected users will not apply common settings.");
	// АПК:254-вкл.
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Элементы_СписокПользователейПользовательИБ_Заголовок", "Пользователь информационной базы");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Элементы_СписокПользователейПользовательИБ_Заголовок", "Database User");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_ВыбратьВсеСтроки_Заголовок", "Выбрать все строки");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_ВыбратьВсеСтроки_Заголовок", "Select All Rows");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_ВыбратьВсеСтроки_Подсказка", "Выбрать все строки");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_ВыбратьВсеСтроки_Подсказка", "Select all rows");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_ЗакрытьФорму_Заголовок", "Отмена");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_ЗакрытьФорму_Заголовок", "Cancel");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_ЗакрытьФорму_Подсказка", "Закрыть форму");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_ЗакрытьФорму_Подсказка", "Close Form");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_СнятьВсеСтроки_Заголовок", "Снять все строки");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_СнятьВсеСтроки_Заголовок", "Unselect All Rows");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_СнятьВсеСтроки_Подсказка", "Снять все строки");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_СнятьВсеСтроки_Подсказка", "Unselect all rows");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_СохранитьИЗакрыть_Заголовок", "Сохранить и закрыть");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_СохранитьИЗакрыть_Заголовок", "Save and Close");
	
	Локализация.ru.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_СохранитьИЗакрыть_Подсказка", "Сохранить изменения и закрыть окно");
	Локализация.en.бит_сл_КлиентЛицензирования.Форма_СписокПользователей.Вставить("Команды_СохранитьИЗакрыть_Подсказка", "Save the changes and close the window");
	#КонецОбласти
	
	// Возврат нужной структуры
	Возврат Локализация[КодЯзыка];
	
КонецФункции 

// Функция - Получить строку сообщения возвращает локализированную строку.
//
// Параметры:
//  ИдентификаторСтроки	 - Строка - идентификатор строки.
//  Параметры			 - Структура (По умолчанию = Неопределено).
//  КодЯзыка 			 - Строка (По умолчанию = Неопределено).
// 
// Возвращаемое значение:
//  Строка - текст сообщения.
//
Функция ПолучитьСтрокуСообщения(ИдентификаторСтроки, Параметры = Неопределено, КодЯзыка = Неопределено) Экспорт
	
	СтрокаРезультат = "";
	ТребуетсяПодставновкаПараметров = Ложь;
	
	Если Не бит_сл_ЗначениеОпределено(КодЯзыка) Тогда		
		КодЯзыка = бит_сл_сервер_ассистент.ПолучитьЯзыкКлиентаЛицензирования();		
	КонецЕсли; 
	
	Локализация = ПолучитьДанныеЛокализации(КодЯзыка).СообщенияИСтроки;
	
	Если бит_сл_ЗначениеОпределено(Параметры) И Тип(Параметры) = Тип("Соответствие") Тогда		
		Если Параметры.Количество() > 0 Тогда 			
			ТребуетсяПодставновкаПараметров = Истина;  			
		КонецЕсли;		
	КонецЕсли;		
	
	ИдентификаторСтрокиНайден = Локализация.Свойство(ИдентификаторСтроки);	
	Если ИдентификаторСтрокиНайден Тогда
		
		СтрокаРезультат = Локализация[ИдентификаторСтроки];
		
		Если ТребуетсяПодставновкаПараметров Тогда			
			Для Каждого ЭлементЗн Из Параметры Цикл				
				СтрокаРезультат = СтрЗаменить(СтрокаРезультат, ЭлементЗн.Ключ, ЭлементЗн.Значение);				
			КонецЦикла;			
		КонецЕсли;	
		
	Иначе
		
		СтрокаРезультат = "#текст локализации """ + ИдентификаторСтроки + """ не найден#";		 
		
	КонецЕсли; 
	
	Возврат СтрокаРезультат;
	
КонецФункции 

// Функция - Разобрать строку с разделителями в массив
// Обходит строку, находит символы разделителя и формирует массив строк.
//
// Параметры:
//  СтрокаСРазделителями			 - Строка.
//  Разделитель						 - Строка.
//  ИгнорироватьПробелыВокругСлова	 - Булево (По умолчанию = Истина). 
//  ДополнительныеНастройкиСтруктура - Структура (МассивИсключения передает массив с строками, элементы которых не будут возвращены;
// 										МассивИсключенияНеУчитыватьРегистр передает признак, 
//										будет ли учитываться регистр при сравнении строк).
//
// Возвращаемое значение:
//   Массив строк.
//
Функция РазобратьСтрокуСРазделителямиВМассив(СтрокаСРазделителями, Разделитель, ИгнорироватьПробелыВокругСлова = Истина, ДополнительныеНастройкиСтруктура = Неопределено) Экспорт
	
	ВсеОк = Истина;
	МассивСтрок = Новый Массив;
	
	Если СтрокаСРазделителями = "" Тогда		
		ВсеОк = Ложь;		
	КонецЕсли;
	
	Если ВсеОк Тогда
		
		Если Разделитель <> ""  Тогда
			
			Буфер = "";
			
			Для итератор = 1 По СтрДлина(СтрокаСРазделителями) Цикл
				
				Символ = Сред(СтрокаСРазделителями, итератор, 1);				
				Если Символ = Разделитель ИЛИ итератор = СтрДлина(СтрокаСРазделителями) Тогда
					
					Если итератор = СтрДлина(СтрокаСРазделителями) Тогда						
						Буфер = Буфер + Символ;						
					КонецЕсли;  
					
					Если Буфер <> "" Тогда						
						ДобавляемаяСтрока = ?(ИгнорироватьПробелыВокругСлова, СокрЛП(Буфер), Буфер);
						Буфер = "";
						МассивСтрок.Добавить(ДобавляемаяСтрока);						
					КонецЕсли; 
					
				Иначе
					
					Буфер = Буфер + Символ;
					
				КонецЕсли; 	
				
			КонецЦикла;		
			
		Иначе
			
			МассивСтрок.Добавить(СтрокаСРазделителями);		
			
		КонецЕсли; 	
		
	КонецЕсли; 
	
	// Применение доп. параметров
	Если ДополнительныеНастройкиСтруктура <> Неопределено Тогда
		
		// Применение массива исключения
		МассивИсключения = Новый Массив;		
		БезУчетаРегистра = ДополнительныеНастройкиСтруктура.МассивИсключенияНеУчитыватьРегистр;
		Для Каждого ЭлементЗн Из ДополнительныеНастройкиСтруктура.МассивИсключения Цикл			
			МассивИсключения.Добавить(?(БезУчетаРегистра, ВРег(ЭлементЗн), ЭлементЗн));			
		КонецЦикла;  
		
		ФильтрованныйМассивСтрок = Новый Массив;		
		Для Каждого ЭлементЗн Из МассивСтрок Цикл
			
			Если МассивИсключения.Найти(?(БезУчетаРегистра, ВРег(ЭлементЗн), ЭлементЗн)) = Неопределено Тогда				
				ФильтрованныйМассивСтрок.Добавить(ЭлементЗн);				
			КонецЕсли; 
			
		КонецЦикла; 
		
		МассивСтрок = ФильтрованныйМассивСтрок;
		
	КонецЕсли; 

	Возврат МассивСтрок;
	
КонецФункции

#КонецОбласти