#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	       	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли; 
	
КонецПроцедуры
		
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	// Очистка ненужных значений
	Если ВидЯчейки = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Значение Тогда		
		Формула = "";		
		Шаблон  = "";  			
	ИначеЕсли ВидЯчейки = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Формула Тогда
		ЭлементДанных = Неопределено;
		ИмяРесурса    = "";
		Шаблон   	  = ""; 
	ИначеЕсли ВидЯчейки = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Шаблон Тогда	
		ЭлементДанных = Неопределено;
		ИмяРесурса    = "";
		Формула 	  = "";
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли