
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

	ПолноеИмяОбъекта = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ИмяФормы, Истина);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКэшЗначений();
	
	// Проверка дополнительного права на работы со всеми заместителями.
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	ЭтоАдминистратор = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(ТекПользователь
	                              ,ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноАдминистрированиеЗаместителей);
	
	
	АдресСКД = Обработки.бит_НазначениеЗаместителей.ИнициализироватьКомпоновщик(Компоновщик, УникальныйИдентификатор, ЭтоАдминистратор);
	
	// Восстановление настройки по-умолчанию
	УстановитьЗначенияПоУмолчанию();	
	
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		Элементы.ДеревоДанныеПередаватьПраваРЛС.Видимость = Ложь;
	КонецЕсли;
								  
    Если НЕ ЭтоАдминистратор Тогда
	
		Объект.Пользователь = ТекПользователь;
	    Элементы.Пользователь.Видимость = Истина;
		Элементы.Пользователь.ТолькоПросмотр = Истина;
		
	Иначе
		
		Элементы.Пользователь.Видимость = Ложь;
		
	КонецЕсли; 								  
	
	УстановитьЗаголовокФормыСервер();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Видимость панели настроек
	Элементы.ФормаКомандаПанельНастроек.Пометка = Не фСкрытьПанельНастроек;		
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоДанные

&НаКлиенте
Процедура ДеревоДанныеЗаместительПриИзменении(Элемент)
	
	ОбработатьИзменениеЗаместителя();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныеЗаместительОчистка(Элемент, СтандартнаяОбработка)
	
	ОбработатьИзменениеЗаместителя();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныеДатаНачалаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	ТекущаяСтрока.Изменено = Истина;
	
	УстановитьЗначениеИерархически(ТекущаяСтрока, "ДатаНачала", ТекущаяСтрока.ДатаНачала);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныеДатаНачалаОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	ТекущаяСтрока.Изменено = Истина;
	
	УстановитьЗначениеИерархически(ТекущаяСтрока, "ДатаНачала", ТекущаяСтрока.ДатаНачала);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныеДатаОкончанияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	ТекущаяСтрока.Изменено = Истина;
	
	УстановитьЗначениеИерархически(ТекущаяСтрока, "ДатаОкончания", ТекущаяСтрока.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныеДатаОкончанияОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	ТекущаяСтрока.Изменено = Истина;
	
	УстановитьЗначениеИерархически(ТекущаяСтрока, "ДатаОкончания", ТекущаяСтрока.ДатаОкончания);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	// Отбор для поиска текущей строки после обновления.
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		СтрОтбор = Новый Структура("Пользователь, ПредставлениеГруппировки", ТекущаяСтрока.Пользователь, ТекущаяСтрока.ПредставлениеГруппировки);			
	Иначе	
		СтрОтбор = Новый Структура("Пользователь, ПредставлениеГруппировки", "ПустойПользователь", "ПустаяГруппировка");
	КонецЕсли; 
	
    ЗаписатьДанные(СтрОтбор);
	
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ДеревоДанные, ДеревоДанные.ПолучитьЭлементы(),Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	СтрОтбор = Новый Структура("Пользователь, ПредставлениеГруппировки");			
	
	ОбновитьДерево(СтрОтбор);
	
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ДеревоДанные, ДеревоДанные.ПолучитьЭлементы(),Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПанельНастроек(Команда)
	
	фСкрытьПанельНастроек = Не фСкрытьПанельНастроек;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКопировать(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено И ТекущаяСтрока.ЭтоДетальнаяЗапись Тогда
		
		// Копирование текущей строки дерева
		 СтрокаРодитель = ТекущаяСтрока.ПолучитьРодителя();
		 КоллекцияВерх = СтрокаРодитель.ПолучитьЭлементы();
		 
		 НовЭлемент = КоллекцияВерх.Добавить();
		 ЗаполнитьЗначенияСвойств(НовЭлемент, ТекущаяСтрока);
		 НовЭлемент.Заместитель           = Неопределено;
		 НовЭлемент.ЗаместительПредыдущий = Неопределено;
		 НовЭлемент.Состояние     = Неопределено;
		 НовЭлемент.ДатаНачала    = Неопределено;
		 НовЭлемент.ДатаОкончания = Неопределено;
		 НовЭлемент.ЗамАктивен    = Ложь;
		 НовЭлемент.Скопирована   = Истина;
		 
		 Элементы.ДеревоДанные.ТекущаяСтрока = НовЭлемент.ПолучитьИдентификатор();
		 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалить(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено И ТекущаяСтрока.ЭтоДетальнаяЗапись И ТекущаяСтрока.Скопирована Тогда
		
		// Копирование текущей строки дерева.
		СтрокаРодитель = ТекущаяСтрока.ПолучитьРодителя();
		КоллекцияВерх  = СтрокаРодитель.ПолучитьЭлементы();
		Инд = КоллекцияВерх.Индекс(ТекущаяСтрока);
		КоллекцияВерх.Удалить(Инд);
		 
	Иначе
		 
		ТекстСообщения = НСтр("ru='Строка не может быть удалена.';en='The line can not be removed.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСНастройками

// Процедура - действие команды "КомандаСохранитьНастройки".
// 
&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	
	ПараметрыФормы     = Новый Структура;
	СтруктураНастройки = УпаковатьНастройкиВСтруктуру();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СтруктураНастройки);
	ПараметрыФормы.Вставить("ТипНастройки"		 , фКэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", фКэшЗначений.НастраиваемыйОбъект);
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
	
		ПараметрыФормы.Вставить("СохраненнаяНастройка",ТекущаяНастройка);
	
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройки",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // КомандаСохранитьНастройки()

// Процедура - обработчик оповещения о закрытии формы сохранения настроек. 
// 
&НаКлиенте
Процедура СохранитьНастройки(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ТекущаяНастройка = Результат;
		УстановитьЗаголовокФормы();
		
	КонецЕсли;
	
КонецПроцедуры // СохранитьНастройки()

// Процедура - действие команды "КомандаВосстановитьНастройки".
// 
&НаКлиенте
Процедура КомандаВосстановитьНастройки(Команда)
	
	ПараметрыФормы     = Новый Структура;
	ПараметрыФормы.Вставить("ТипНастройки"		 , фКэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", фКэшЗначений.НастраиваемыйОбъект);
	
	Оповещение = Новый ОписаниеОповещения("ПрименениеНастроек",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // КомандаВосстановитьНастройки()

// Процедура - обработчик оповещения о закрытии формы применения настроек. 
// 
&НаКлиенте 
Процедура ПрименениеНастроек(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда        
		
		ПрименитьНастройки(Результат);
		
	КонецЕсли;	
	
КонецПроцедуры // ПрименениеНастроек

// Функция готовит структуру с настройками для сохранения.
// 
// Возвращаемое значение:
//   СтруктураНастройки   - Структура.
// 
&НаСервере
Функция УпаковатьНастройкиВСтруктуру()

	СтруктураНастройки = Новый Структура;
	
	СтруктураНастройки.Вставить("ПользовательскиеНастройки", Новый ХранилищеЗначения(Компоновщик.ПользовательскиеНастройки));
	
	Возврат СтруктураНастройки;
	
КонецФункции // УпаковатьНастройкиВСтруктуру()

// Применяет сохраненные настройки.
// 
// Параметры:
//  ВыбраннаяНастройка  - СправочникСсылка.бит_СохраненныеНастройки.
// 
&НаСервере
Процедура ПрименитьНастройки(ВыбраннаяНастройка)

	Если ЗначениеЗаполнено(ВыбраннаяНастройка) Тогда
		
		СтруктураНастроек = ВыбраннаяНастройка.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			
			// Загрузки пользовательских настроек
			ПользовательскиеНастройки = СтруктураНастроек.ПользовательскиеНастройки.Получить();
			
			Если ТипЗнч(ПользовательскиеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
				
				Компоновщик.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
				
			КонецЕсли; // Это пользовательские настройки
			
			ТекущаяНастройка = ВыбраннаяНастройка;
			УстановитьЗаголовокФормыСервер();				
			
		КонецЕсли;	 
		
	КонецЕсли; 
	
	УстановитьВидимость();
	 
КонецПроцедуры

// Процедура устанавливает настройку либо из последних использованных, либо из настройки по умолчанию.
// 
&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	// Получим настройку по - умолчанию и последнюю использованную.
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(фКэшЗначений.НастраиваемыйОбъект);
	
	Если ЗначениеЗаполнено(НастройкаПоУмолчанию) Тогда		
		ПрименитьНастройки(НастройкаПоУмолчанию);		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеСерверныеПроцедурыИФункции

// Процедура кеширует значения, в дальнейшем используемые на клиенте. 
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	фКэшЗначений = Новый Структура;
	
	фКэшЗначений.Вставить("ТекущийПользователь"		 , Пользователи.ТекущийПользователь());
	фКэшЗначений.Вставить("НастраиваемыйОбъект"		 , Метаданные.Обработки.бит_НазначениеЗаместителей.ПолноеИмя());
	фКэшЗначений.Вставить("ТипНастройки"             , Перечисления.бит_ТипыСохраненныхНастроек.Обработки);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

// Процедура устанавливает заголовок формы на сервере.
// 
&НаСервере
Процедура УстановитьЗаголовокФормыСервер()
	
	Заголовок = СформироватьЗаголовокФормы(ТекущаяНастройка);
	
КонецПроцедуры

// Процедура выполняет обновление дерева данных.
// 
&НаСервере
Функция ОбновитьДерево(СтрОтбор)
	
	ДеревоДанные.ПолучитьЭлементы().Очистить();
	
	Если ЗначениеЗаполнено(Объект.Пользователь) Тогда
	
		ЭлементОтбора = Компоновщик.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь");
		ЭлементОтбора.ПравоеЗначение = Объект.Пользователь;
	
	КонецЕсли; 
	
	ДеревоВрем = Обработки.бит_НазначениеЗаместителей.НастройкиЗаместителей(Компоновщик, АдресСКД);
	
	ТекИД = 0;
	ОбойтиДеревоВрем(ДеревоВрем, ДеревоДанные.ПолучитьЭлементы(),СтрОтбор, ТекИД);
	
	Возврат ТекИД;
	
КонецФункции

// Процедура обходит дерево значений и заполняет дерево, размещенное на форме.
// 
&НаСервере
Процедура ОбойтиДеревоВрем(СтрокаНастройки, КоллекцияФормы, СтрОтбор, ТекИД)

	Для каждого ТекСтрока Из СтрокаНастройки.Строки Цикл
		
		НовЭлементКоллекции = КоллекцияФормы.Добавить();
		ЗаполнитьЗначенияСвойств(НовЭлементКоллекции, ТекСтрока);
		НовЭлементКоллекции.НеактивныйЗаместитель = ПользовательНеактивен(НовЭлементКоллекции.Заместитель);
		
		Если СтрОтбор.Пользователь = НовЭлементКоллекции.Пользователь
			 И СтрОтбор.ПредставлениеГруппировки = НовЭлементКоллекции.ПредставлениеГруппировки Тогда
		
			 ТекИД = НовЭлементКоллекции.ПолучитьИдентификатор();
		
		КонецЕсли; 
		
		ОбойтиДеревоВрем(ТекСтрока, НовЭлементКоллекции.ПолучитьЭлементы(),СтрОтбор,ТекИД);
	
	КонецЦикла; 

КонецПроцедуры

// Процедура выполняет запись данных об установленных заместителях.
// 
&НаСервере
Процедура ЗаписатьДанные(СтрОтбор)

	ЗаписатьДанныеПоУровню(ДеревоДанные);

	ТекИД = ОбновитьДерево(СтрОтбор);
	
	Элементы.ДеревоДанные.ТекущаяСтрока = ТекИД;				
	
КонецПроцедуры

// Процедура записывает данные по уровню. 
// 
// Параметры:
//  СтрокаДерева - ДанныеФормыЭлементДерева.
// 
&НаСервере
Процедура ЗаписатьДанныеПоУровню(СтрокаДерева)
	
	ТекДата   = ОбщегоНазначения.ТекущаяДатаПользователя();
	Коллекция = СтрокаДерева.ПолучитьЭлементы();
	
	ПредыдущийЗаместитель  = "";
	ПредыдущийПользователь = "";

	Для каждого ТекущаяСтрока Из Коллекция Цикл
		
		// Проверка корректности интервала.
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаНачала) 
			 И ЗначениеЗаполнено(ТекущаяСтрока.ДатаОкончания) 
			 И ТекущаяСтрока.ДатаНачала > ТекущаяСтрока.ДатаОкончания Тогда
			 
			 ТекстСообщения = НСтр("ru='Для заместителя ""%1"" по области замещения ""%2"" неверно указан интервал дат.';
			 					   |en='For substituent ""%1"" area of ​​substitution ""%2"" incorrectly specified date range.'");
			 ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущаяСтрока.Заместитель, ТекущаяСтрока.ПредставлениеГруппировки);
			 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			 
			 Продолжить;
		
		КонецЕсли; 
		
		Если ТекущаяСтрока.ЭтоДетальнаяЗапись И ТекущаяСтрока.Изменено Тогда
			
			ЭтоУдаление = Ложь;
			Если ЗначениеЗаполнено(ТекущаяСтрока.ЗаместительПредыдущий) И ТекущаяСтрока.ЗаместительПредыдущий <> ТекущаяСтрока.Заместитель Тогда
			
				 // Удаление предыдущего заместителя.
				 Если ВРег(ТекущаяСтрока.ОбластьДанных) =  ВРег("Задачи") Тогда
					 МенеджерЗаписи = РегистрыСведений.бит_ЗаместителиПоЗадачам.СоздатьМенеджерЗаписи();
				 Иначе
					 МенеджерЗаписи = РегистрыСведений.бит_НазначенныеЗаместители.СоздатьМенеджерЗаписи();
				 КонецЕсли;
				 ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекущаяСтрока);
				 МенеджерЗаписи.Заместитель = ТекущаяСтрока.ЗаместительПредыдущий;
				 МенеджерЗаписи.Прочитать();
				 
				 ЗаместительПредыдущий = ТекущаяСтрока.ЗаместительПредыдущий;
				 
				 Если МенеджерЗаписи.Выбран() Тогда
					 
					 Попытка
						 
						 МенеджерЗаписи.Удалить();
						 ТекущаяСтрока.Изменено = Ложь;
						 ТекущаяСтрока.ЗаместительПредыдущий = ТекущаяСтрока.Заместитель;
						 ТекущаяСтрока.ЗамАктивен = Ложь;
						 ЭтоУдаление = Истина;
						 
					 Исключение
						 
						 ТекстСообщения = НСтр("ru='Не удалось удалить назначение заместителя ""%1"" пользователю ""%2"". Описание ошибки: ""%3"".';
						 					   |en='Unable to remove the appointment of a substitution ""%1"" for the user ""%2"". Error description: ""%3"".'");
						 ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущаяСтрока.Заместитель, 
						 							ТекущаяСтрока.Пользователь, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));						 
						 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);																			   
						 
					 КонецПопытки;
					 
				 КонецЕсли; 
			
			КонецЕсли; 
			
			ЭтоЗапись = Ложь;
			Если ЗначениеЗаполнено(ТекущаяСтрока.Заместитель) Тогда
				
				// Установка заместителя.
				Если ВРег(ТекущаяСтрока.ОбластьДанных) =  ВРег("Задачи") Тогда
					МенеджерЗаписи = РегистрыСведений.бит_ЗаместителиПоЗадачам.СоздатьМенеджерЗаписи();
				Иначе
					МенеджерЗаписи = РегистрыСведений.бит_НазначенныеЗаместители.СоздатьМенеджерЗаписи();
				КонецЕсли;

				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекущаяСтрока);
				МенеджерЗаписи.Прочитать();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекущаяСтрока);
				МенеджерЗаписи.Состояние   = РегистрыСведений.бит_НазначенныеЗаместители.ОпределитьСостояниеЗамещения(ТекущаяСтрока.ДатаНачала, ТекущаяСтрока.ДатаОкончания, ТекДата);
				 
				Попытка

					МенеджерЗаписи.Записать();
					ТекущаяСтрока.Изменено = Ложь;
					ТекущаяСтрока.ЗаместительПредыдущий = ТекущаяСтрока.Заместитель;
					Если МенеджерЗаписи.Состояние = Перечисления.бит_СостоянияЗаместителей.Назначен Тогда
						ТекущаяСтрока.ЗамАктивен = Истина;
					КонецЕсли; 
					ЭтоЗапись = Истина;

				Исключение

					ТекстСообщения = НСтр("ru='Не удалось назначить заместителя ""%1"" пользователю ""%2"". Описание ошибки: ""%3"".';
										  |en='Unable to assing substitution ""%1"" for the user ""%2"". Error description: ""%3"".'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущаяСтрока.Заместитель, ТекущаяСтрока.Пользователь,
												КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));																								   
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);																			   

				КонецПопытки;
				 
				Если ТекущаяСтрока.ПередаватьПраваРЛС Тогда
					Если ПредыдущийПользователь <> ТекущаяСтрока.Пользователь ИЛИ ПредыдущийЗаместитель <> ТекущаяСтрока.Заместитель Тогда

						ПредыдущийЗаместитель  = ТекущаяСтрока.Заместитель;
						ПредыдущийПользователь = ТекущаяСтрока.Пользователь;

						бит_ПраваДоступа.ПроверкаПрофилейДоступаПользователяИЗаместителя(ТекущаяСтрока.Заместитель, ТекущаяСтрока.Пользователь);

					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
			
			Если ЭтоУдаление И НЕ ЭтоЗапись Тогда			
				ТекущаяСтрока.ДатаНачала    = Неопределено;
				ТекущаяСтрока.ДатаОкончания = Неопределено;			
			КонецЕсли; 
			
		Иначе
			
			ТекущаяСтрока.Изменено = Ложь;
			
		КонецЕсли; 
		
		ЗаписатьДанныеПоУровню(ТекущаяСтрока);
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура управляет видимостью/доступностью элементов формы. 
// 
&НаСервере
Процедура УстановитьВидимость()

	Элементы.ФормаКомандаПанельНастроек.Пометка = Не фСкрытьПанельНастроек;
	Элементы.ГруппаНастройки.Видимость          = Не фСкрытьПанельНастроек;	

КонецПроцедуры // УстановитьВидимость()

&НаКлиенте
Процедура ДеревоДанныеПередаватьПраваРЛСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	ТекущаяСтрока.Изменено = Истина;
	
	УстановитьЗначениеИерархически(ТекущаяСтрока, "ПередаватьПраваРЛС", ТекущаяСтрока.ПередаватьПраваРЛС);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбработатьИзменениеЗаместителя()
	
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	ТекущаяСтрока.Изменено = Истина;
	
	УстановитьЗначениеИерархически(ТекущаяСтрока, "Заместитель", ТекущаяСтрока.Заместитель);
	
	ТекущаяСтрока.НеактивныйЗаместитель = ПользовательНеактивен(ТекущаяСтрока.Заместитель);
	
	УстановитьЗначениеИерархически(ТекущаяСтрока, "НеактивныйЗаместитель", ТекущаяСтрока.НеактивныйЗаместитель);
	
КонецПроцедуры

&НаСервере
Функция ПользовательНеактивен(Пользователь)
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, "ПометкаУдаления, Недействителен");
	Возврат РеквизитыПользователя.ПометкаУдаления ИЛИ РеквизитыПользователя.Недействителен;
	
КонецФункции

// Процедура устанавливает значения в подчиненных строках дерева.
// 
// Параметры:
//  СтрокаДерева - ДанныеФормыЭлементДерева.
//  ИмяКолонки - Строка
//  ЗначениеКолонки - Произвольный.
// 
&НаКлиенте
Процедура УстановитьЗначениеИерархически(СтрокаДерева, ИмяКолонки, ЗначениеКолонки)
	
	ТекКоллекция = СтрокаДерева.ПолучитьЭлементы();
	
	Для каждого ТекСтрока Из ТекКоллекция Цикл
	
		ТекСтрока[ИмяКолонки] = ЗначениеКолонки;
		ТекСтрока.Изменено = Истина;
		УстановитьЗначениеИерархически(ТекСтрока, ИмяКолонки, ЗначениеКолонки);
	
	КонецЦикла; 
	
КонецПроцедуры // УстановитьЗначениеИерархически()

// Функция формирует заголовок формы обработки.
// 
// Параметры:
//  РежимЗаполнения - Строка.
//  ТекущаяНастройка - СправочникСсылка.бит_СохраненныеНастройки.
// 
// Возвращаемое значение:
//  СтрЗаголовок - Строка.
// 
&НаКлиентеНаСервереБезКонтекста
Функция СформироватьЗаголовокФормы(ТекущаяНастройка)

	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		СтрЗаголовок = НСтр("ru='Назначение заместителей (%1)';en='Substitute Appointment (%1)'");
		СтрЗаголовок = СтрШаблон(СтрЗаголовок, ТекущаяНастройка);	
	Иначе
		СтрЗаголовок = НСтр("ru='Назначение заместителей';en='Substitute Appointment'");
	КонецЕсли; 
	
	Возврат СтрЗаголовок;
	
КонецФункции // СформироватьЗаголовокФормы()

// Процедура устанавливает заголовок формы на клиенте.
// 
&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	Заголовок = СформироватьЗаголовокФормы(ТекущаяНастройка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
		
	// ДеревоДанные
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл отсутствие интерфейсной разметки в типовом модуле.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоДанные");
	// АПК:277-вкл
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоДанные.Изменено", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.бит_ОсновнойЭлементСписка);
	
	// ДеревоДанные
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл отсутствие интерфейсной разметки в типовом модуле.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоДанные");
	// АПК:277-вкл
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоДанные.ЗамАктивен", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоДанные.НеактивныйЗаместитель", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ФонПодписьВерна);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл отсутствие интерфейсной разметки в типовом модуле.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоДанныеЗаместитель");
	// АПК:277-вкл
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоДанные.НеактивныйЗаместитель", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЗаголовокУдаленногоРеквизитаШрифт);
	
	// ДеревоДанныеПередаватьПраваРЛС
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл отсутствие интерфейсной разметки в типовом модуле.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоДанныеПередаватьПраваРЛС");
	// АПК:277-вкл
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоДанные.ОбластьДанных", ВидСравненияКомпоновкиДанных.Равно, "Задачи");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
    
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл отсутствие интерфейсной разметки в типовом модуле.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоДанныеПользовательскоеУсловие");
	// АПК:277-вкл
	
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		ЭлементУО.Отбор.Элементы, "ПользовательскоеУсловие", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"ДеревоДанные.ПользовательскоеУсловиеОсновное", ВидСравненияКомпоновкиДанных.Заполнено, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"ДеревоДанные.ОбластьДанных", ВидСравненияКомпоновкиДанных.НеРавно, "Визы");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ТекстНедоступнойНадписи);
	
КонецПроцедуры
 
#КонецОбласти
