
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	РегистрБухгалтерииМСФО = ПолучитьОбъектСистемыРегистрБухгалтерииМСФО();
	
	Если ЗначениеЗаполнено(РегистрБухгалтерииМСФО) Тогда
		
		ПараметрыФормы = Новый Структура("РегистрБухгалтерии", РегистрБухгалтерииМСФО);		
       															
        ОткрытьФорму("Документ.бит_ОперацияУправленческий.ФормаСписка"
						, ПараметрыФормы
						, ПараметрыВыполненияКоманды.Источник
						, Новый УникальныйИдентификатор("0dc4ef00-b10d-0cB0-c400-000000000001")
						, ПараметрыВыполненияКоманды.Окно
						, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	Иначе
		
		ТекстСообщения = Нстр("ru='Обновите объекты системы.';en='Update system objects.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получает элемент справочника "Объекты системы", соответствующий регистру бухгалтерии МСФО.
// 
// Параметры:
//  Нет
//  
// Возвращаемое значение:
//   СправочникСсылка.бит_ОбъектыСистемы.
// 
&НаСервере
Функция ПолучитьОбъектСистемыРегистрБухгалтерииМСФО()

	МетаОбъект = Метаданные.РегистрыБухгалтерии.бит_Дополнительный_2;
	
	РегистрБухгалтерииМСФО = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
	
	Возврат РегистрБухгалтерииМСФО;
	
КонецФункции // ПолучитьОбъектСистемыРегистрБухгалтерииМСФО()

#КонецОбласти
