 &Перед("ПриСозданииНаСервере") 
&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	Если Элементы.Найти("бит_НомерЗаказа") = Неопределено Тогда
		бит_СоздатьЭлементыБит(); 
	КонецЕсли;
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -  
	
КонецПроцедуры 

&НаСервере
Процедура бит_СоздатьЭлементыБит()

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	//(бит) № завеса
	НовыйЭлемент = Элементы.Вставить("Сериибит_НомерЗавеса", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_НомерЗавеса";
		
	//(бит) № заказа
	НовыйЭлемент = Элементы.Вставить("Сериибит_НомерЗаказа", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_НомерЗаказа";
		
	//(бит) Брутто, кг
	НовыйЭлемент = Элементы.Вставить("Сериибит_Брутто", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Брутто";
		
	//(бит) Тип тары
	НовыйЭлемент = Элементы.Вставить("Сериибит_ТипТары", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_ТипТары";
	
	//(бит) Штрихкод
	НовыйЭлемент = Элементы.Вставить("Сериибит_Штрихкод", Тип("ПолеФормы"), Элементы.Серии, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Серии.бит_Штрихкод";
    // Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 - 
	
КонецПроцедуры