
&После("ПередНачаломРаботыСистемы")
Процедура бит_ПередНачаломРаботыСистемы()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	#Если ТонкийКлиент или ТолстыйКлиент Тогда
		Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
			ИЛИ СистемнаяИнформация.ТипПлатформы=ТипПлатформы.Windows_x86_64 Тогда
			
			Кнопки = Новый Массив();                       
			   
			КнопкаНастроек = Новый Структура();
			КнопкаНастроек.Вставить("Картинка", БиблиотекаКартинок.Настройка);
			КнопкаНастроек.Вставить("Заголовок", "Настройки");
			Действие = Новый ОписаниеОповещения("ОткрытьФормуНастроек", бит_МодульНастроекКлиент , ИнформацияОбОшибке());
			КнопкаНастроек.Вставить("Действие", Действие);
			
			Кнопки.Добавить(КнопкаНастроек);
			
			ПанельЗадачОС.УстановитьКнопки(Кнопки);
			
		КонецЕсли;	
	#КонецЕсли

КонецПроцедуры

&После("ПриЗавершенииРаботыСистемы")
Процедура бит_ПриЗавершенииРаботыСистемы()
	// Вставить содержимое обработчика.
КонецПроцедуры
