
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользуетсяСинхронизация = ПолучитьФункциональнуюОпцию("бит_СинхронизироватьПодразделенияРеглЦФО");

	// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов.
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники.Подразделения);
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = (МожноРедактировать И НЕ ИспользуетсяСинхронизация);
	// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов.
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
    Элементы.Список.ИзменятьСоставСтрок 		   = НЕ ИспользуетсяСинхронизация;
	Элементы.ПредупреждениеОбОграничении.Видимость = ИспользуетсяСинхронизация;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"СкопироватьГруппуПодразделенийСПодчиненными", "Видимость", НЕ ИспользуетсяСинхронизация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ЗагрузитьЧерезТабДок", "Видимость", НЕ ИспользуетсяСинхронизация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ИмпортОбъектовИзExcel", "Видимость", НЕ ИспользуетсяСинхронизация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"СписокКонтекстноеМенюСкопироватьГруппуПодразделенийСПодчиненными", 
			"Видимость", НЕ ИспользуетсяСинхронизация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список, Список);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандРаботыСExcel

&НаКлиенте
Процедура ЗагрузитьЧерезТабДок(Команда)
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("РежимЗагрузки",  ПредопределенноеЗначение("Перечисление.бит_РежимыЗагрузки.Справочник"));
    ПараметрыФормы.Вставить("ИмяСправочника", "Подразделения");
    
    ОткрытьФорму("Обработка.бит_ЗагрузкаДанныхИзТабличногоДокумента.Форма", ПараметрыФормы, ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
    
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомандаСинхронизировать(Команда)
	
	ТекстВопроса =  НСтр("ru = 'Синхронизировать подразделения и ЦФО?'");
	Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте 
Процедура ВопросЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ДлительнаяОперация = ПараметрыСинхронизации();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru='Заполнение таблицы';en='Filling in the table'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииСинхронизации", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

// Обраборка оповещения процедуры "ПриЗавершенииСинхронизации".
//
// Параметры:
//  Результат				 - Структура - См. общий модуль ДлительныеОпрации.
//  ДополнительныеПараметры	 - Произвольный - произвольные данные, переданные в обработку оповещения. 
//
&НаКлиенте
Процедура ПриЗавершенииСинхронизации(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		// Ничего не делать или обработать ошибку.
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе	
		ОповеститьОбИзменении(Тип("СправочникСсылка.Подразделения"));
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыиФункции

&НаСервере
Функция ПараметрыСинхронизации()

	НаименованиеЗадания = НСтр("ru = 'Синхронизация ЦФО и подразделений.'");
	ВыполняемыйМетод = "бит_Бюджетирование.СинхронизацияПодразделенийЦФОВфоне";	
	
	// Заполнение пераметов длительной операции.
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, Новый Структура, ПараметрыВыполнения);

КонецФункции
	
#КонецОбласти