&НаСервере
Функция ПечатьНаСервере()
		
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Документ);

	ОбъектыПечати = Новый СписокЗначений;
	КодЯзыка = Неопределено;
	Возврат ЭтаОбработка.СформироватьПечатнуюФормуЗаявкаНаПеревозкуГруза(МассивОбъектов, ОбъектыПечати);
		
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	ТабличныйДокумент = ПечатьНаСервере();
	ТабличныйДокумент.Показать("(бит) Заявка на перевозку груза");
КонецПроцедуры
