#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает данные чата по переданному идектификатору.
// 
// Параметры:
//	ИдентификаторЧата - Число - Идентификатор чата.
//	Бот - СправочникСсылка.бит_БотыTelegram.
// 
// Возвращаемое значение:
//	Структура:
//	 Чат - СправочникСсылка.бит_ЧатыTelegram.
//	 СтатусРегистрации - ПеречислениеСсылка.бит_СтатусРегистрацииТелеграм.
//
Функция ДанныеЧатаПоИдентификатору(ИдентификаторЧата, Бот = Неопределено) Экспорт
	
	ДанныеЧата = Новый Структура;
	ДанныеЧата.Вставить("Чат",               Справочники.бит_ЧатыTelegram.ПустаяСсылка());
	ДанныеЧата.Вставить("СтатусРегистрации", Перечисления.бит_СтатусРегистрацииТелеграм.ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЧата) Тогда
		Возврат ДанныеЧата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЧатыTelegram.Ссылка КАК Чат,
	|	ЧатыTelegram.СтатусРегистрации КАК СтатусРегистрации
	|ИЗ
	|	Справочник.бит_ЧатыTelegram КАК ЧатыTelegram
	|ГДЕ
	|	ЧатыTelegram.ИД = &ИдентификаторЧата
	|	И &УсловиеОграниченияПоБоту
	|	И НЕ ЧатыTelegram.ПометкаУдаления";
	Запрос.УстановитьПараметр("ИдентификаторЧата", ИдентификаторЧата);
	Если НЕ ЗначениеЗаполнено(Бот) Тогда
		ТекстУсловия = "Истина";
	Иначе
		ТекстУсловия = "ЧатыTelegram.ОсновнойБот = &Бот";
		Запрос.УстановитьПараметр("Бот", Бот);
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОграниченияПоБоту", ТекстУсловия);
		
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеЧата.Чат               = Выборка.Чат;
		ДанныеЧата.СтатусРегистрации = Выборка.СтатусРегистрации;
	КонецЕсли;
	
	Возврат ДанныеЧата;		
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет обязательность заполнения реквизита Пользователя.
// 
// Параметры:
//	КомандыЧата - Массив - Массив доступных команд чата.
// 
// Возвращаемое значение:
//	Булево.
// 
Функция ОбязательноЗаполнениеПользователя(КомандыЧата) Экспорт
	
	ОписаниеКоманд = Справочники.бит_КомандыБотуТелеграм.ОписаниеПредопределенныхКоманд();
	
	Запрос         = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОписаниеКоманд.Команда КАК Команда,
	|	ОписаниеКоманд.ПользовательОбязателен КАК ПользовательОбязателен
	|ПОМЕСТИТЬ ОписаниеКоманд
	|ИЗ
	|	&ОписаниеКоманд КАК ОписаниеКоманд";
	Запрос.УстановитьПараметр("ОписаниеКоманд", ОписаниеКоманд);
	Запрос.Выполнить();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОписаниеКоманд.Команда КАК Команда
	|ИЗ
	|	ОписаниеКоманд КАК ОписаниеКоманд
	|ГДЕ
	|	ОписаниеКоманд.ПользовательОбязателен
	|	И ОписаниеКоманд.Команда В(&КомандыЧата)";
	Запрос.УстановитьПараметр("КомандыЧата",    КомандыЧата);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
