#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	       	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	Если СтатусРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СтатусРегистрации") Тогда
		ДополнительныеСвойства.Вставить("Автоматически", Истина);
	КонецЕсли;
	
	Если СтатусРегистрации = Перечисления.бит_СтатусРегистрацииТелеграм.Разрешено Тогда
		ПроверитьПраваПользователя(Отказ);
	КонецЕсли;
	
	ПроверитьУникальностьИдентификатора(Отказ);
	
КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
	
	Если НЕ ДополнительныеСвойства.Свойство("Автоматически") Тогда
		бит_ТелеграмСервер.НовоеСообщениеОСтатусеРегистрации(СтатусРегистрации, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИД = 0;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ТаблицаКоманд = ДоступныеКоманды.Выгрузить(, "КомандаТелеграм");
	КомандыЧата   = ТаблицаКоманд.ВыгрузитьКолонку("КомандаТелеграм");
	Если НЕ Справочники.бит_ЧатыTelegram.ОбязательноЗаполнениеПользователя(КомандыЧата) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Пользователь");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПраваПользователя(Отказ)
	
	Если Пользователь.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Пользователи.ЭтоПолноправныйПользователь(Пользователь,Ложь,Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеКоманд = Справочники.бит_КомандыБотуТелеграм.ОписаниеПредопределенныхКоманд();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОписаниеКоманд.Команда КАК Команда,
	|	ОписаниеКоманд.ТолькоПолныеПрава
	|ПОМЕСТИТЬ ОписаниеКоманд
	|ИЗ
	|	&ОписаниеКоманд КАК ОписаниеКоманд";
	Запрос.УстановитьПараметр("ОписаниеКоманд", ОписаниеКоманд);
	Запрос.Выполнить();
	
	СписокКоманд = ДоступныеКоманды.ВыгрузитьКолонку("КомандаТелеграм");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОписаниеКоманд.Команда КАК Команда
	|ИЗ
	|	ОписаниеКоманд КАК ОписаниеКоманд
	|ГДЕ
	|	ОписаниеКоманд.ТолькоПолныеПрава
	|	И ОписаниеКоманд.Команда В (&СписокКоманд)";
	Запрос.УстановитьПараметр("СписокКоманд", СписокКоманд);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		// Полные права не нужны.
		Возврат;
	КонецЕсли;
	
	МассивКоманд      = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Команда");
	КомандыПолныхПрав = СтрСоединить(МассивКоманд, ", ");
	ТекстСообщения    = НСтр("ru = 'В чате присутствуют команды, разрешенные только для пользователей с Полными правами: %1.';
								|en = 'There are commands which allow only for full-rights users: %1.'");
	ТекстСообщения    = СтрШаблон(ТекстСообщения, КомандыПолныхПрав);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,,,Отказ);	
	
КонецПроцедуры

// Процедура - Проверка уникальности ИД
//
// Параметры:
//  Отказ	 - Булево - флаг отказа от выполнения операции.
//
Процедура ПроверитьУникальностьИдентификатора(Отказ)
	
	Если ПустаяСтрока(ИД) ИЛИ ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЧатыTelegram.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ЧатыTelegram КАК ЧатыTelegram
	|ГДЕ
	|	ЧатыTelegram.Ссылка <> &ЭтотЧат
	|	И НЕ ЧатыTelegram.ПометкаУдаления
	|	И ЧатыTelegram.ИД = &ИД
	|	И ЧатыTelegram.ОсновнойБот = &Бот";
	Запрос.УстановитьПараметр("ЭтотЧат", Ссылка);
	Запрос.УстановитьПараметр("ИД", ИД);
	Запрос.УстановитьПараметр("Бот", ОсновнойБот);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = НСтр("ru='ID чата с ботом не уникально.';
							  |en='ID chat with the bot is not unique.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли