	
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.ДокументЗаполнения)
		И НЕ Параметры.АвтоТест Тогда
		ТекстСообщения = НСтр("ru='Непосредственное открытие этой формы не предусмотрено.';
							  |en='The immediate opening of this form is not provided.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНастройкиПоУмолчанию();
	
	Объект.ДокументЗаполнения = Параметры.ДокументЗаполнения;
	ОбработкаЗаполнения();
	
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		Объект.Период.Вариант = ВариантСтандартногоПериода.ЭтотГод;
	КонецЕсли;
	
	УстановитьЗаголовокФормы(Заголовок, ТекущаяНастройка);
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	СценарийПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОбработкиПриИзменении(Элемент)
	
	ВалютаПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОборотыПоБюджетам

&НаКлиенте
Процедура ОборотыПоБюджетамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ОборотыПоБюджетамКомментарийРасчета" Тогда
		СтандартнаяОбработка = Ложь;
		ОбработатьВыборКомментарияРасчета(ВыбраннаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	ПараметрыФормы.Вставить("СтруктураНастройки", СохраняемыеНастройки());
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		ПараметрыФормы.Вставить("СохраненнаяНастройка", ТекущаяНастройка);
	КонецЕсли; 
		
	ОповещениеЗакрытиеФормы = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", 
		ПараметрыФормы, ЭтотОбъект,,,, ОповещениеЗакрытиеФормы, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	
	ОповещениеЗакрытиеФормы = Новый ОписаниеОповещения("ВыбратьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", 
		ПараметрыФормы, ЭтотОбъект,,,, ОповещениеЗакрытиеФормы, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	

КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериод(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОткрытьДиалогСтандартногоПериода(Объект, "Период",, УникальныйИдентификатор);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	Если Объект.ОборотыПоБюджетам.Количество() > 0  Тогда
		ТекстВопроса = НСтр("ru='Данные будут очищены. Продолжить?';en='Data will be cleared. Continue?'");
		Оповещение = Новый ОписаниеОповещения("КомандаОбновитьВопросЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	Иначе
		НачатьОтложенноеОбновлениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагиУстановитьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ОборотыПоБюджетам, "Выполнять", 1,
		Элементы.ОборотыПоБюджетам);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагиСнятьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ОборотыПоБюджетам, "Выполнять", 0,
		Элементы.ОборотыПоБюджетам);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагиИнвертировать(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ОборотыПоБюджетам, "Выполнять", 2,
		Элементы.ОборотыПоБюджетам);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПеренестиДобавить(Команда)
	
	ОповеститьОВыбореДанных("Добавить");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЗаполнить(Команда)
	
	ОповеститьОВыбореДанных("Заполнить");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЗаменить(Команда)
	
	ОповеститьОВыбореДанных("Заменить");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗамерыПроизводительностиAPDEX

&НаКлиенте
Процедура ЗапуститьЗамерДлительностиКлючевойОперации(НаименованиеОперации)
	
	КлючеваяОперация = НаименованиеОперации + ".бит_ПолучениеДанныхБюджетаИзСвязанногоСценария";
	
	ИдентификаторЗамераВремени = ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьДлительностьКлючевойОперации()
	
	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(ИдентификаторЗамераВремени);
	
КонецПроцедуры

#КонецОбласти

#Область ПереносОбъектовИзОбработки

// Функция формирует структуру результата.
// 
// Параметры:
//  Режим - Строка.
//  
// Возвращаемое значение:
//  Струкутура.
// 
&НаСервере
Функция РезультатЗаполнения(Режим, ИдентификаторВладельца)

	РезультатЗаполнения = Новый Структура;
	РезультатЗаполнения.Вставить("Режим", 	  Режим);
	РезультатЗаполнения.Вставить("ИспользоватьЗначенияПоУмолчанию", Истина);
	РезультатЗаполнения.Вставить("Валюта", 	  Объект.ВалютаОбработки);
	РезультатЗаполнения.Вставить("Курс", 	  Объект.КурсОбработки);
	РезультатЗаполнения.Вставить("Кратность", Объект.КратностьОбработки);
	
	Отбор          = Новый Структура("Выполнять", Истина);
	ТаблицаБюджета = Объект.ОборотыПоБюджетам.Выгрузить(Отбор);
	
	РезультатЗаполнения.Вставить("КоличествоСтрок", ТаблицаБюджета.Количество());
	
	АдресОборотовПоБюджетамВХранилище = ПоместитьВоВременноеХранилище(ТаблицаБюджета, ИдентификаторВладельца);
	РезультатЗаполнения.Вставить("АдресОборотовПоБюджетам", АдресОборотовПоБюджетамВХранилище);
	
	Возврат РезультатЗаполнения;
	
КонецФункции

// Процедура опововещает форму-владельца о выборе данных.
// 
// Параметры:
//  Режим - Строка.
// 
&НаКлиенте
Процедура ОповеститьОВыбореДанных(Режим)

	РезультатЗаполнения = РезультатЗаполнения(Режим, ВладелецФормы.УникальныйИдентификатор);
	
	Если РезультатЗаполнения.КоличествоСтрок > 0 Тогда
		Оповестить("ПолучениеДанныхБюджета", РезультатЗаполнения, ВладелецФормы.УникальныйИдентификатор);
	Иначе
		ТекстСообщения = НСтр("ru='Не выбраны строки для переноса в документ.';
							  |en='Line to be transfered to the document are not selected.'");
		ПоказатьПредупреждение(, ТекстСообщения,, НСтр("ru='Перенос в документ';en='Transfer to paper'"));
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область РаботаСНастройками

&НаКлиенте
Процедура ОткрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница	  = Элементы.СтраницаНастройки;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;	

КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка;
	Элементы.ОбновитьДанные.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыХраненияНастроек()

	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("ТипНастройки", ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыХранения.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());

	Возврат ПараметрыХранения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НастраиваемыйОбъект()

	Возврат "Обработка.бит_ПолучениеДанныхБюджетаИзСвязанногоСценария";

КонецФункции

// Процедура - обработчик оповещения о закрытии формы сохранения настроек. 
// 
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(СохраненнаяНастройка, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(СохраненнаяНастройка) Тогда
		ТекущаяНастройка = СохраненнаяНастройка;
		УстановитьЗаголовокФормы(Заголовок, ТекущаяНастройка);
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик оповещения о закрытии формы применения настроек. 
// 
&НаКлиенте 
Процедура ВыбратьНастройкиЗавершение(ВыбраннаяНастройка, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(ВыбраннаяНастройка) Тогда        
		ТекущаяНастройка = ВыбраннаяНастройка;
		ПрименитьНастройки(ТекущаяНастройка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СохраняемыеНастройки()

	СтруктураНастройки = Новый Структура;	
	СтруктураНастройки.Вставить("ВидОтклонения", 	                   Объект.ВидОтклонения);
	СтруктураНастройки.Вставить("ВидОтклоненияКоличества",             Объект.ВидОтклоненияКоличества);
	СтруктураНастройки.Вставить("ЗначениеОтклонения",                  Объект.ЗначениеОтклонения);
	СтруктураНастройки.Вставить("ЗначениеОтклоненияКоличества",        Объект.ЗначениеОтклоненияКоличества);
	СтруктураНастройки.Вставить("НастройкиКомпоновщикаЗависимостей",   Объект.КомпоновщикЗависимостей.Настройки);
	СтруктураНастройки.Вставить("НастройкиКомпоновщикаОборотовПоБюджетам",
									Объект.КомпоновщикОборотовПоБюджетам.Настройки);
	СтруктураНастройки.Вставить("Период",                              Объект.Период);
	СтруктураНастройки.Вставить("ПериодичностьСдвигаДат",              Объект.ПериодичностьСдвигаДат);
	СтруктураНастройки.Вставить("Профиль",                             Объект.Профиль);
	СтруктураНастройки.Вставить("СдвигДат",                            Объект.СдвигДат);
	СтруктураНастройки.Вставить("СценарийИсточник",                    Объект.СценарийИсточник);
	
	Возврат СтруктураНастройки;
	
КонецФункции

// Процедура применяет сохраненные настройки.
// 
// Параметры:
//  ВыбраннаяНастройка - СправочникСсылка.бит_СохраненныеНастройки.
//  ОткрытиеФормы - Булево.
// 
&НаСервере
Процедура ПрименитьНастройки(ВыбраннаяНастройка)

	Если ЗначениеЗаполнено(ВыбраннаяНастройка) Тогда
		
		ТекущаяНастройка  = ВыбраннаяНастройка;
		СтруктураНастроек = ВыбраннаяНастройка.ХранилищеНастроек.Получить();
		ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроек);
		Объект.КомпоновщикЗависимостей.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщикаЗависимостей);
		Объект.КомпоновщикОборотовПоБюджетам.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщикаОборотовПоБюджетам);
		УстановитьЗаголовокФормы(Заголовок, ВыбраннаяНастройка);
		
	КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти

// Процедура обработчик оповещения "КомандаОбновитьВопросЗавершение".
// 
// Параметры:
// Ответ 			    - КодВозвратаДиалога.
// ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура КомандаОбновитьВопросЗавершение(Ответ, ДополнительныеДанные) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
	     НачатьОтложенноеОбновлениеДанных();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокФормы(Заголовок, ТекущаяНастройка)
	
	НаименованиеОбработки = НСтр("ru='Получение данных бюджета из связанного сценария'") ;
	Если НЕ ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		Заголовок = НаименованиеОбработки;
		Возврат;
	КонецЕсли;
	
	ШаблонЗаголовка = "%1 (%2)";
	Заголовок       = СтрШаблон(ШаблонЗаголовка, НаименованиеОбработки, ТекущаяНастройка);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаЗаполнения()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.ДанныеДокументаЗаполнения = Неопределено Тогда
		РеквизитыОснования = "Дата, Сценарий, КурсДокумента, КратностьДокумента, ВалютаДокумента, ЕдиницаИзмеренияСумм";
		ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументЗаполнения, РеквизитыОснования);
	Иначе
		ДанныеДокумента = Параметры.ДанныеДокументаЗаполнения;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, ДанныеДокумента);
	
	ДатаЗаполнения = ДанныеДокумента.Дата;
	
	Объект.Период.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Объект.Период.ДатаНачала    = НачалоМесяца(ДатаЗаполнения);
	Объект.Период.ДатаОкончания = КонецМесяца(ДатаЗаполнения);
	
	СценарийПриИзмененииНаСервере();
	
КонецПроцедуры
	
&НаСервере
Процедура СценарийПриИзмененииНаСервере()
	
	ДанныеСценария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Сценарий, "бит_Периодичность, Валюта");
	Объект.ПериодичностьСдвигаДат  = ДанныеСценария.бит_Периодичность;
	Объект.ВалютаОбработки         = ДанныеСценария.Валюта;
		
	ВалютаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()

	СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(Объект.ВалютаОбработки, ДатаЗаполнения);
	Объект.КурсОбработки      = СтруктураКурса.Курс;
	Объект.КратностьОбработки = СтруктураКурса.Кратность;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиПоУмолчанию()
	
	АдресСКД = Обработки.бит_ПолучениеДанныхБюджетаИзСвязанногоСценария.ИнициализироватьКомпоновщик("Зависимости", 
					Объект.КомпоновщикЗависимостей, УникальныйИдентификатор);
	АдресСКД = Обработки.бит_ПолучениеДанныхБюджетаИзСвязанногоСценария.ИнициализироватьКомпоновщик("ОборотыПоБюджетам", 
					Объект.КомпоновщикОборотовПоБюджетам, УникальныйИдентификатор);
					
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект());
	Если ЗначениеЗаполнено(НастройкаПоУмолчанию) Тогда		
		ПрименитьНастройки(НастройкаПоУмолчанию);		
	КонецЕсли;
	
КонецПроцедуры
				
&НаКлиенте
Процедура НачатьОтложенноеОбновлениеДанных(ДопДействие = Неопределено)
	
	СкрытьНастройки();
		
	ЗапуститьЗамерДлительностиКлючевойОперации("ФормированиеЗависимыхОборотовСценария");	
	
	ДлительнаяОперация = ПараметрыОбновленияОборотовПоБюджетам();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru='Заполнение таблицы';en='Filling table'");  
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииОбновленияОборотовПоБюджетам", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

// Процедура окончание процедуры "ОбновитьДанные".
//
&НаКлиенте
Процедура ПриЗавершенииОбновленияОборотовПоБюджетам(ПараметрыРезультата, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыРезультата.Статус = "Ошибка" Тогда
		// Ничего не делать или обработать ошибку.
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("en='Error during execution of %1';ru='Ошибка при выполнении: %1'"), 
		ПараметрыРезультата.КраткоеПредставлениеОшибки));
	Иначе
		ПриЗавершенииОбновленияОборотовПоБюджетамНаСервере(ПараметрыРезультата);
	КонецЕсли;
	
	ЗафиксироватьДлительностьКлючевойОперации();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗавершенииОбновленияОборотовПоБюджетамНаСервере(ПараметрыРезультата)
	
	СтруктураРезультатаОбновления = ПолучитьИзВременногоХранилища(ПараметрыРезультата.АдресРезультата);
	Если СтруктураРезультатаОбновления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТаблицаРезультат.Загрузить(СтруктураРезультатаОбновления.ТаблицаРезультат);
	Объект.ОборотыПоБюджетам.Загрузить(СтруктураРезультатаОбновления.ОборотыПоБюджетам);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОбновленияОборотовПоБюджетам()

	НаименованиеЗадания = НСтр("ru='Заполнение оборотов по бюджетам.'");
	ВыполняемыйМетод = "Обработки.бит_ПолучениеДанныхБюджетаИзСвязанногоСценария.ЗаполнитьОборотыПоБюджетам";
	
	НастройкиПараметров = НастройкаПараметровЗаполненияОборотовПоБюджетам();
	
	// Заполнение параметров длительной операции.
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Если ВыполнятьНаКлиенте Тогда
		ПараметрыВыполнения.ЗапуститьВФоне   = Ложь;
		ПараметрыВыполнения.ЗапуститьНеВФоне = Истина;
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, НастройкиПараметров, ПараметрыВыполнения);

КонецФункции

&НаСервере
Функция НастройкаПараметровЗаполненияОборотовПоБюджетам()
	
	ПараметрыЗаполнения	=
		Обработки.бит_ПолучениеДанныхБюджетаИзСвязанногоСценария.НовыеПараметрыЗаполненияОборотовПоБюджетам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, Объект);
	ПараметрыЗаполнения.НастройкиКомпоновщикаЗависимостей       = Объект.КомпоновщикЗависимостей.Настройки;
	ПараметрыЗаполнения.НастройкиКомпоновщикаОборотовПоБюджетам = Объект.КомпоновщикОборотовПоБюджетам.Настройки;
	ПараметрыЗаполнения.ПериодЗаполнения   = Объект.Период;
	ПараметрыЗаполнения.Сценарий           = Объект.СценарийИсточник;
	ПараметрыЗаполнения.СценарийЗависимый  = Объект.Сценарий;
	ПараметрыЗаполнения.РазмерностьЕдиницы = бит_ОбщегоНазначения.ПолучитьРазмерностьЕдиницыИзмеренияСумм(
												Объект.ЕдиницаИзмеренияСумм);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОборотыПоБюджетамКомментарийРасчета.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОборотыПоБюджетам.ОборотыПоБюджетамКомментарийРасчета");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = "";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветТочекАлгоритма);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст"     , НСтр("ru = 'Комментарий расчета';
																 	|en = 'Calculation commentary'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборКомментарияРасчета(ВыбраннаяСтрока)
	
	СтрокаОборотов = Объект.ОборотыПоБюджетам.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаОборотов = Неопределено 
		ИЛИ ПустаяСтрока(СтрокаОборотов.КомментарийРасчета) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КомментарийРасчета", СтрокаОборотов.КомментарийРасчета);
	ОткрытьФорму("ОбщаяФорма.бит_ФормаКомментарияРасчетаЗависимыхОборотов", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
