
#Область ОписаниеПеременных

&НаКлиенте
Перем Буфер; // Служит для передачи данных копирования.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	бит_УправлениеДоступомБФ.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
			
	Копирование = Ложь;
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Копирование = Истина;
		ИсточникЗаполнения = Параметры.ЗначениеКопирования;
	Иначе
		ИсточникЗаполнения = Объект.Ссылка;
	КонецЕсли;
	
	ДанныеХранилищ = Документы.бит_АктуализацияБюджета.ДанныеХранилищДокумента(ИсточникЗаполнения);
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.НастройкаФормы) И НЕ Копирование Тогда
		СтрНастроек = Справочники.бит_ЭлементыДанных.ПолучитьНастройкиПостроителя(Объект.НастройкаФормы);
	Иначе
		СтрНастроек = ДанныеХранилищ.НастройкиПостроителя;
	КонецЕсли;
	
	ТекстЗапроса = Объект.НастройкаФормы.ТекстЗапроса;
	
	АдресКомпоновкиСтруктура = Документы.бит_АктуализацияБюджета.ИнициализироватьКомпоновщикСтруктура(ТекстЗапроса, КомпоновщикСтруктура, Новый УникальныйИдентификатор);
	ВосстановитьОтбор(СтрНастроек);
	
	// Инициализация компоновщика для получения данных.
	ИнициализироватьКомпоновщикДанные();
	
	// Установка сохраненного отбора компоновщика данные.
	Если СтрНастроек.Свойство("НастройкиКомпоновщикаДанные")
		И ТипЗнч(СтрНастроек.НастройкиКомпоновщикаДанные) = Тип("НастройкиКомпоновкиДанных")  Тогда
		
		Если СтрНастроек.НастройкиКомпоновщикаДанные.Отбор.Элементы.Количество() > 0 Тогда
			КомпоновщикДанные.ЗагрузитьНастройки(СтрНастроек.НастройкиКомпоновщикаДанные);
		КонецЕсли; 
	КонецЕсли; 
	
	// Восстановление дерева из хранилища
	ТабДокДанные     = ДанныеХранилищ.ТабличныйДокумент;
	ЗависимостиЯчеек = бит_Бюджетирование.ПолучитьЗависимостиЯчеек(ТабДокДанные);	
	
	Статьи = ИзвлечьСтатьиИзДерева(ТабДокДанные);
	КэшЗначений.НастройкиСтатей = Новый Соответствие;
    бит_Бюджетирование.ПолучитьНастройкиСтатейОборотов(Статьи, КэшЗначений.НастройкиСтатей);	
		
	// Установка оформления таблиц БДДС и ЗависимыеОбороты.
	ИменаТаблиц = Новый Массив;  
	ИменаТаблиц.Добавить("БДДС");
	ИменаТаблиц.Добавить("БДДС_Редактирование");
	ОформитьТаблицу("БДДС", ИменаТаблиц, Статьи);	
	
	УстановитьУсловноеОформление();
	
	// Установка видимости колонок табличных полей БДДС_Редактирование И ЗависимыеОбороты_Редактирование.
	УправлениеВидимостьюКолонокТаблиц();
	
	// Установка текущей страницы
	Если ТабДокДанные.Области.Количество() > 0 Тогда
		 Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаДанныеБюджета;
	КонецЕсли; 	
	
	// Проверка наличия зафиксированных бюджетных данных.
	Если Объект.Проведен Тогда
		бит_Бюджетирование.ПроверитьФиксациюВФорме(ЭтотОбъект, Объект.Ссылка, Истина);
	КонецЕсли;
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()
	
	Если ФормаИнициализирована Тогда
		Возврат;
	КонецЕсли;
	
	// Элементы управления для измерений несуществующих в смежном решении	
	// создаются программно для унификации кода.
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправленияВкладкиОсновные(Элементы, Элементы.ГруппаДопАналитики);
	
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправления(Элементы, "БДДС_Редактирование", "БДДС", 
		Элементы.БДДС_РедактированиеКоличество);
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправления(Элементы, "БДДС", "БДДС", 
		Элементы.БДДСКоличество);
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправления(Элементы, "ЗависимыеОбороты", "ЗависимыеОбороты",
		Элементы.ЗависимыеОборотыКоличество);
	
	// Настроим отображение полей доп. аналитик в форме.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияНаФорме(ЭтотОбъект, 
	КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);	
	
	// Отображение дополнительных измерений в табличных полях.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
		"БДДС_Редактирование", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
		"БДДС", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
		"ЗависимыеОбороты", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);

	ФормаИнициализирована = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
	КонтролируемыеРеквизиты = Новый Структура;
	КонтролируемыеРеквизиты.Вставить("НастройкаФормы");
	КонтролируемыеРеквизиты.Вставить("ВалютаДокумента");
	КонтролируемыеРеквизиты.Вставить("Сценарий");
	КонтролируемыеРеквизиты.Вставить("СценарийЭталон");
	КонтролируемыеРеквизиты.Вставить("СпособАктуализации");
	КонтролируемыеРеквизиты.Вставить("ДатаНачалаПланирования");
	КонтролируемыеРеквизиты.Вставить("ДатаАктуализации");
	КонтролируемыеРеквизиты.Вставить("РежимЗависимыхОборотов");
	
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// АПК:278-выкл Проектное решение вызвать функционал другой подсистемы.
	ОбщегоНазначенияСлужебныйКлиент.УстановитьВидимостьПанелиПоказателей(Элементы, РазвернутьОбластьПоказателей);
	ОбщегоНазначенияСлужебныйКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТабДокДанные");
	// АПК:278-вкл
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатус" И Источник = УникальныйИдентификатор Тогда	
		ОбработкаОповещенияИзмененияСтатуса();
	ИначеЕсли ИмяСобытия = "ВыбратьПериодЗавершение" И Источник = УникальныйИдентификатор Тогда	
		РедактированиеПериода(Параметр.Результат, Неопределено);
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства	
	
	НаименованиеТаблицы = НСтр("ru = 'БДДС'; en = 'BDDS'");
	бит_УправлениеДоступомБФ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект.БДДС, НаименованиеТаблицы);
	
	ПодготовитьФормуНаСервере();
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Сохранение дерева данных
	ТекущийОбъект.СохранитьДерево(ТабДокДанные);
	
	// Сохранение отбора построителя
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("НастройкиКомпоновщика", КомпоновщикСтруктура.ПолучитьНастройки());
	СтруктураНастройки.Вставить("НастройкиКомпоновщикаДанные", КомпоновщикДанные.ПолучитьНастройки());
	
	ТекущийОбъект.СохранитьНастройкиПостроителя(СтруктураНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере();
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Состояние кнопки Отбор
	Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Пометка = УстанавливатьОтборЗависимых;
	УстановитьКартинкуКнопкиОтбор();	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаФормыПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("НастройкаФормыПриИзмененииЗавершение", ЭтотОбъект); 
	ЗадатьВопросОбОчисткеДанных(Оповещение);
			
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура НастройкаФормыПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ИзменениеНастройкиФормы(КонтролируемыеРеквизиты.НастройкаФормы);	
		ДобавитьВКэш("НастройкаФормы");
	Иначе
		ИзвлечьИзКэша("НастройкаФормы");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийЭталонПриИзменении(Элемент)
		
	Если СценарииМожноИспользоватьВместе() Тогда
		ПриИзмененииПлановыхСценариев();
	Иначе
		ИзвлечьИзКэшаПлановыеСценарии();
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	Если СценарииМожноИспользоватьВместе() Тогда
		ПриИзмененииПлановыхСценариев();
	Иначе	
		ИзвлечьИзКэшаПлановыеСценарии();
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПланированияПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ДатаНачалаПланированияПриИзмененииЗавершение", ЭтотОбъект); 
	ЗадатьВопросОбОчисткеДанных(Оповещение);
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ДатаНачалаПланированияПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ДатаНачалаПланированияИзменение();
		ПериодПланирования.ДатаНачала = Объект.ДатаНачалаПланирования;	
		ДобавитьВКэш("ДатаНачалаПланирования");
	Иначе
		ИзвлечьИзКэша("ДатаНачалаПланирования");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПланированияПриИзменении(Элемент)
	
	ПериодПланирования.ДатаОкончания = Объект.ДатаОкончанияПланирования;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктуализацииПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ДатаАктуализацииПриИзмененииЗавершение", ЭтотОбъект); 
	ЗадатьВопросОбОчисткеДанных(Оповещение);
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ДатаАктуализацииПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДатаАктуализацииИзменение();	
		ДобавитьВКэш("ДатаАктуализации");
	Иначе
		ИзвлечьИзКэша("ДатаАктуализации");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктуализацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("Направление", Направление);
	Оповещение = Новый ОписаниеОповещения("ДатаАктуализацииРегулированиеЗавершение", ЭтотОбъект, ДопПараметры); 
	ЗадатьВопросОбОчисткеДанных(Оповещение);
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ДатаАктуализацииРегулированиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	               
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДатаАктуализацииРегулированиеСервер(ДополнительныеПараметры.Направление);	
		ДобавитьВКэш("ДатаАктуализации");
	Иначе
		ИзвлечьИзКэша("ДатаАктуализации");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	Оповещение  = Новый ОписаниеОповещения("ВалютаДокументаПриИзмененииЗавершение", ЭтотОбъект);
	Если Объект.БДДС.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Изменена валюта документа. Пересчитать суммы в документе?';
						    |en='Currency of the document was changed. Recalculate document total?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ВалютаДокументаПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда			
		ИзменениеВалюты(Истина, КонтролируемыеРеквизиты["ВалютаДокумента"]);
		ДобавитьВКэш("ВалютаДокумента");			
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда  			
		ИзменениеВалюты(Ложь, КонтролируемыеРеквизиты["ВалютаДокумента"]);
		ДобавитьВКэш("ВалютаДокумента");		 
	Иначе	 
		ИзвлечьИзКэша("ВалютаДокумента");
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура СпособАктуализацииПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("СпособАктуализацииПриИзмененииЗавершение", ЭтотОбъект); 
	ЗадатьВопросОбОчисткеДанных(Оповещение);
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура СпособАктуализацииПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьВсе(ЭтотОбъект);	
		УправлениеФормой(ЭтотОбъект);	
		ДобавитьВКэш("СпособАктуализации");
	Иначе
		ИзвлечьИзКэша("СпособАктуализации");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РежимЗависимыхОборотовПриИзменении(Элемент)
	
	ТекущийРежимЗависимыхОборотов = КонтролируемыеРеквизиты.РежимЗависимыхОборотов;
	Если ТекущийРежимЗависимыхОборотов = Объект.РежимЗависимыхОборотов Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТекущийРежимЗависимыхОборотов", ТекущийРежимЗависимыхОборотов);
	Оповещение = Новый ОписаниеОповещения("РежимЗависимыхОборотовПриИзмененииЗавершение", ЭтотОбъект, ДопПараметры);
	Если Объект.ЗависимыеОбороты.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Зависимые обороты будут очищены. Продолжить?';
							|en='Dependent speed will be cleared. Continue?'"); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура РежимЗависимыхОборотовПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда 			
		Объект.ЗависимыеОбороты.Очистить();  
		УправлениеФормой(ЭтотОбъект);
	Иначе
		РежимЗависимыхОборотов = ДополнительныеПараметры.ТекущийРежимЗависимыхОборотов;
	КонецЕсли;
	
	ДобавитьВКэш("РежимЗависимыхОборотов");

КонецПроцедуры

&НаКлиенте
Процедура РежимЗависимыхОборотовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_РежимыЗависимыхОборотов.Автоматический"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_РежимыЗависимыхОборотов.НеФормировать"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеОборотыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = Объект.ЗависимыеОбороты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Поле.Имя = "ЗависимыеОборотыКомментарийРасчета" 
		  И НЕ СтрокаТаблицы = Неопределено 
		  И НЕ ПустаяСтрока(СтрокаТаблицы.КомментарийРасчета) Тогда
		
		СтандартнаяОбработка = Ложь;		
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КомментарийРасчета", СтрокаТаблицы.КомментарийРасчета);
		ОткрытьФорму("ОбщаяФорма.бит_ФормаКомментарияРасчетаЗависимыхОборотов", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		
		Если НЕ СтрокаТаблицы = Неопределено Тогда
			ИмяРеквизита = СтрЗаменить(Поле.Имя, "ЗависимыеОбороты", "");
			ТекЗнч = СтрокаТаблицы[ИмяРеквизита];
			Если ЗначениеЗаполнено(ТекЗнч) Тогда
				ПоказатьЗначение(,ТекЗнч);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура СверхБюджетаПриИзменении(Элемент)
	
	Если НЕ Объект.СверхБюджета Тогда
		Объект.СписатьЛимиты = Ложь;	
	КонецЕсли;
	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;

КонецПроцедуры

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	
	ЦФОПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабДокДанные

&НаКлиенте
Процедура ТабДокДанныеОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Расшифровка, "РасшифровкаЯчейкиФормыВвода")  Тогда
	
		Если Расшифровка.Вид = "Измерение" И ЗначениеЗаполнено(Расшифровка.Значение) Тогда
		
			ПоказатьЗначение( , Расшифровка.Значение);
		
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокДанныеПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОблМакета = Элементы.ТабДокДанные.ТекущаяОбласть;
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблМакета) Тогда
		
		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОблМакета.Расшифровка, "РасшифровкаЯчейкиФормыВвода") Тогда
			
			ИзменениеСодержимогоОбласти(ОблМакета);
			
		КонецЕсли;	// ИмяКласса подходит
		
		бит_БюджетированиеКлиентСервер.ВычислитьЗависимыеФормулы(ТабДокДанные, ЗависимостиЯчеек, ОблМакета.Имя);
		
	КонецЕсли; // ОблМакета подходит
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокДанныеПриАктивизацииОбласти(Элемент)

	ПодключитьОбработчикОжидания("ОбработчикТабДокДанныеПриАктивизацииОбласти", 0.1, Истина);
	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамически", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикТабДокДанныеПриАктивизацииОбласти()
	
	ОблМакета = Элементы.ТабДокДанные.ТекущаяОбласть;
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблМакета) Тогда
		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОблМакета.Расшифровка, "РасшифровкаЯчейкиФормыВвода") Тогда
			ОбластьР = ОблМакета.Расшифровка;
			Если ОбластьР.Вид = "Значение" Тогда
				// Устанавливаем отбор по периоду и комбинации измерений.
				СтрОтбор = бит_БюджетированиеКлиентСервер.СформироватьОтборСтрок(ОбластьР);
				Элементы.БДДС_Редактирование.ОтборСтрок = Новый ФиксированнаяСтруктура(СтрОтбор);
			Иначе	
				УстановитьНесуществующийОтборБДДС();
			КонецЕсли; 
		Иначе	  
			УстановитьНесуществующийОтборБДДС();
		КонецЕсли; // ИмяКласса подходит
	КонецЕсли; // ОблМакета подходит

КонецПроцедуры

// Выполняет расчет и вывод показателей выделенной области ячеек.
// См. обработчик события ТабДокДанныеПриАктивизацииОбласти.
//
&НаКлиенте
Процедура РассчитатьПоказателиДинамически()
	// АПК:278-выкл Проектное решение вызвать функционал другой подсистемы.
	ОбщегоНазначенияСлужебныйКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТабДокДанные");
	// АПК:278-вкл
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБДДС_Редактирование

&НаКлиенте
Процедура БДДС_РедактированиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ АктивнаРедактируемаяЯчейка() Тогда
		ТекстСообщения =  НСтр("ru = 'Для добавления данных необходимо установить курсор в редактируемую ячейку.';
							   |en = 'To add data, place the cursor in the cell you are editing.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.БДДС_Редактирование.ТекущиеДанные;
	Если НоваяСтрока Тогда
		ТекущаяСтрока.ИД = Строка(Новый УникальныйИдентификатор);
		Если НЕ Копирование И АктивнаРедактируемаяЯчейка() Тогда
			
			 ОбластьР = Элементы.ТабДокДанные.ТекущаяОбласть.Расшифровка;
			 бит_БюджетированиеКлиентСервер.ЗаполнитьНовуюСтрокуБюджета(Объект, ТекущаяСтрока ,ОбластьР.Период, ОбластьР.Измерения, КэшЗначений.НастройкиФормы.Измерения);
		
		КонецЕсли; 
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования И АктивнаРедактируемаяЯчейка() Тогда
		
		Обл = Элементы.ТабДокДанные.ТекущаяОбласть;
		ОбластьР   = Обл.Расшифровка;
		
		ОбновитьЗначениеЯчейкиДерева(Обл, ОбластьР);
		ОбновитьПарнуюЯчейки(Обл);		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеПослеУдаления(Элемент)
	
	Если АктивнаРедактируемаяЯчейка() Тогда
		
		Обл = Элементы.ТабДокДанные.ТекущаяОбласть;
		ОбластьР   = Обл.Расшифровка;
		
		ОбновитьЗначениеЯчейкиДерева(Обл, ОбластьР);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеСтатьяОборотовПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.БДДС_Редактирование.ТекущиеДанные;
	бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(ТекущаяСтрока, КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	
	ИзменениеСтатьиОборотовВТабличнойЧасти(ТекущаяСтрока.ПолучитьИдентификатор(),"БДДС", "БДДС_Редактирование");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБДДС

&НаКлиенте
Процедура БДДСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Объект.БДДС.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		ИмяРеквизита = СтрЗаменить(Поле.Имя, "БДДС", "");
		ТекЗнч = ТекущаяСтрока[ИмяРеквизита];
		
		Если ЗначениеЗаполнено(ТекЗнч) Тогда
			
			ПоказатьЗначение(, ТекЗнч);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БДДСПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.БДДС.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		УстановитьОтборЗависимые(ТекущаяСтрока.ИД);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область ПодключаемыеКомандыЭлементовФормы

&НаКлиенте
Процедура Подключаемый_АналитикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяПоля  = Элемент.Имя;
	Если бит_МеханизмДопИзмеренийКлиент.ЭтоАналитикаБанковскийСчет(Элемент.Имя, КэшЗначений.НастройкиИзмерений) Тогда
	  	бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(Объект, СтандартнаяОбработка, Элемент.Имя);	
	Иначе	
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, Объект, Элемент.Имя,
			СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаОчистка(Элемент, СтандартнаяОбработка)
	
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, Объект, Элемент.Имя,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);

КонецПроцедуры

#КонецОбласти 

#Область ПодключаемыеКомандыЭлементовТаблицФормы

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля  = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	Если бит_МеханизмДопИзмеренийКлиент.ЭтоАналитикаБанковскийСчет(ИмяПоля, КэшЗначений.НастройкиИзмерений) Тогда
	  	бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(ТекущиеДанные, СтандартнаяОбработка, ИмяПоля);	
	Иначе	
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
			СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля  = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры
	
#КонецОбласти 

#Область ОбработчикиКомандРасчетаПоказателей

&НаКлиенте
Процедура РассчитатьСумму(Команда)
	
	РассчитатьПоказатели(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличество(Команда)
	
	РассчитатьПоказатели(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСреднее(Команда)
	
	РассчитатьПоказатели(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМинимум(Команда)
	
	РассчитатьПоказатели(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМаксимум(Команда)
	
	РассчитатьПоказатели(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВсеПоказатели(Команда)
	// АПК:278-выкл Проектное решение вызвать функционал другой подсистемы.
	ОбщегоНазначенияСлужебныйКлиент.УстановитьВидимостьПанелиПоказателей(
		Элементы, Не Элементы.РассчитатьВсеПоказатели.Пометка);
	РазвернутьОбластьПоказателей = Элементы.РассчитатьВсеПоказатели.Пометка;	
	// АПК:278-вкл
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоказатели(ИмяКоманды)
	
	// АПК:278-выкл Проектное решение вызвать функционал другой подсистемы.
	ОбщегоНазначенияСлужебныйКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТабДокДанные", ИмяКоманды);
	// АПК:278-вкл
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомандаРедактироватьПериод(Команда)
	
	ПараметрыПередачи = Новый Структура(); 
	ПараметрыПередачи.Вставить("ДатаНачала", 	Объект.ДатаНачалаПланирования);
	ПараметрыПередачи.Вставить("ДатаОкончания", Объект.ДатаОкончанияПланирования);
	ПараметрыПередачи.Вставить("Контекст", 		УникальныйИдентификатор);
	
	бит_ОбщегоНазначенияКлиент.ВыбратьПериод(ПараметрыПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	Если ЗаполнениеДереваВозможно() Тогда
		Оповещение = Новый ОписаниеОповещения("КомандаОбновитьЗавершение", ЭтотОбъект);
		ЗадатьВопросОбОчисткеДанных(Оповещение);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура КомандаОбновитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбновитьДеревоВФоне();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВосстановить(Команда)
	
	Если ЗаполнениеДереваВозможно() Тогда		
		ВосстановитьДеревоВФоне();		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаАктуализировать(Команда)
	
	Если АктуализацияВозможна() Тогда
		АктуализацияВФоне();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКопироватьДанные(Команда)
	
	Буфер = Неопределено;
	ОблВыделенная = ТабДокДанные.ТекущаяОбласть;
	
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблВыделенная) Тогда
		
		Буфер = Новый Массив;		
		
		// Необходимо определить координаты всех ячеек выделенной области
		// и обойти по отдельности эти ячейки.
		
		ДельтаГ = ОблВыделенная.Право - ОблВыделенная.Лево + 1;
		ДельтаВ = ОблВыделенная.Низ   - ОблВыделенная.Верх + 1;
		
		ЛевоНач = ОблВыделенная.Лево;
		ВерхНач = ОблВыделенная.Верх;
		Для ИндексПраво = 1 По ДельтаГ Цикл
			
			Лево   = ЛевоНач + ИндексПраво-1;
			
			Для ИндексНиз = 1 По ДельтаВ Цикл
				
				Верх = ВерхНач + ИндексНиз-1;
				Обл  = ТабДокДанные.Область(Верх, Лево, Верх, Лево);
				
				// Если выделенная ячейка является ячейкой вида Значение - сохраним параметры, необходимые для копирования в буфер.
				ОбластьР = Обл.Расшифровка;
				Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОбластьР, "РасшифровкаЯчейкиФормыВвода") 
					 И ОбластьР.Вид = "Значение" Тогда
					
					ПарамКопирования = Новый Структура;
					ПарамКопирования.Вставить("ИмяКласса", "БуферКопированияФормыВвода");
					ПарамКопирования.Вставить("Период"   , ОбластьР.Период);
					ПарамКопирования.Вставить("Измерения", ОбластьР.Измерения);
					ПарамКопирования.Вставить("СдвигГор" , ИндексПраво-1);
					ПарамКопирования.Вставить("СдвигВерт", ИндексНиз-1);
					
					Буфер.Добавить(ПарамКопирования);
					
				КонецЕсли;
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВставитьДанные(Команда)
	
	Если ТипЗнч(Буфер) = Тип("Массив") Тогда
		Для каждого Обл Из ТабДокДанные.ВыделенныеОбласти Цикл
			Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) Тогда
				ПараметрыВставки = Новый Структура;
				ПараметрыВставки.Вставить("ИмяОбласти", Обл.Имя);
				ПараметрыВставки.Вставить("Верх", Обл.Верх);
				ПараметрыВставки.Вставить("Лево", Обл.Лево);
				ПараметрыВставки.Вставить("Низ", Обл.Низ);
				ПараметрыВставки.Вставить("Право", Обл.Право);
				ВыполнитьКопированиеДанных(Буфер, ПараметрыВставки);
			КонецЕсли; // ОблМакета подходит.
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьБуфер(Команда)
	
	Буфер = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьЗависимыеОбороты(Команда)
	
	Оповещение = Новый ОписаниеОповещения("КомандаЗаполнитьЗависимыеОборотыЗавершение", ЭтотОбъект);
	Если Объект.ЗависимыеОбороты.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Зависимые обороты будут очищены. Продолжить?';
							|en='Dependent speed will be cleared. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет); 
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура КомандаЗаполнитьЗависимыеОборотыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьЗависимыеОбороты();
		ЗаполнитьЗависимыеОбороты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПереключитьОтбор(Команда)
	
	Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Пометка = НЕ Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Пометка;	
	УстанавливатьОтборЗависимых = Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Пометка;
	
	Если УстанавливатьОтборЗависимых Тогда
		
		ТекущаяСтрока = Элементы.БДДС.ТекущиеДанные;
		Если НЕ ТекущаяСтрока = Неопределено Тогда
			
			УстановитьОтборЗависимые(ТекущаяСтрока.ИД);
			
		КонецЕсли; 
		
	Иначе	
		
		ОтключитьОтборЗависимые();
		
	КонецЕсли; 
	
	УстановитьКартинкуКнопкиОтбор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемыСвойства

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойств

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбщиеСлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ИзмеренияДоп", бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним"));
	КэшЗначений.Вставить("ИзмеренияВсе", бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все","синоним"));
	КэшЗначений.Вставить("НастройкиИзмерений" , бит_Бюджетирование.НастройкиИзмеренийБюджетирования()); 
	КэшЗначений.Вставить("НастройкиФормы"     , Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(Объект.НастройкаФормы));
	КэшЗначений.Вставить("ТекущийПользователь", Пользователи.ТекущийПользователь());	
	КэшЗначений.Вставить("ВидСравненияРавно"  , ВидСравнения.Равно);
	КэшЗначений.Вставить("ПроводитьПослеУтверждения", ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения"));	
		
	// Параметры, используемые для управления автовидимостью колонок.
	КэшЗначений.Вставить("НастройкаВидимостиКолонок"	 , Новый Структура);
	КэшЗначений.Вставить("МассивСтатей_БДДС"			 , Новый Массив);
	КэшЗначений.Вставить("МассивСтатей_ЗависимыеОбороты", Новый Массив);
	
	КэшЗначений.Вставить("СтруктураДопПолей", Новый Структура("Учет_Сумма, Учет_Количество", "Норма","Норма"));
	
	КэшЗначений.Вставить("НастройкиСтатей", Новый Соответствие);
	
	// Запишем параметр для формирования заголовка.
	КэшЗначений.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);

	КэшЗначений.Вставить("СценарийЭталон", Объект.СценарийЭталон);
	КэшЗначений.Вставить("Сценарий",		Объект.Сценарий);
	
КонецПроцедуры

// Процедура очищает табличные части ЗависимыеОбороты и БДДС.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТаблицы(Форма)

	Объект = Форма.Объект;
	Объект.БДДС.Очистить();
	Объект.ДоИзменения.Очистить();
	Объект.ФактическиеДанные.Очистить();

КонецПроцедуры

// Очищает таблицы данных и дерево данных. 
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьВсе(Форма)

	Форма.ТабДокДанные = Новый ТабличныйДокумент;
	ОчиститьТаблицы(Форма);

КонецПроцедуры

// Функция проверяет возможность заполнения дерева данные. 
// Заполнение возможно, если заполнены НастройкаФормы и все измерения, обязательные к заполнению.
// 
// Параметры:
// СтрПар - СтруктураПараметров
// ВыводитьСообщения  - Булево.
// 
// Возвращаемое значение:
//   ЗаполнениеВозможно   - Булево.
// 
&НаКлиенте
Функция ЗаполнениеДереваВозможно()
	
	ОчиститьСообщения();
	Отказ = Ложь;
 	Если НЕ ЗначениеЗаполнено(Объект.НастройкаФормы) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
							НСтр("ru = 'Настройка формы'; en = 'Form Setup'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.НастройкаФормы", Отказ); 
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(Объект.ДатаАктуализации) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
							НСтр("ru = 'Дата актуализации'; en = 'Updating Date'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.ДатаАктуализации", Отказ); 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаПланирования) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
							НСтр("ru = 'Дата начала планирования'; en = 'Planning Start Date'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.ДатаНачалаПланирования", Отказ); 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияПланирования) И Объект.ДатаОкончанияПланирования < Объект.ДатаНачалаПланирования Тогда
		Пояснение = НСтр("ru = 'Не верно указан интервал планирования. Дата окончания предшествует дате начала.';
						|en = 'The planning interval is incorrect. The end date precedes the start date.'"); 
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Корректность", 
							НСтр("ru = 'Дата окончания планирования'; en = 'Planning end date'"),,, Пояснение);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.ДатаОкончанияПланирования", Отказ);
	КонецЕсли; 

	Если ЗначениеЗаполнено(Объект.ДатаАктуализации) Тогда
		
		ОшибкаДатыАктуализации = Ложь;
		Если ЗначениеЗаполнено(Объект.ДатаНачалаПланирования) 
			И ЗначениеЗаполнено(Объект.ДатаОкончанияПланирования)
			И (Объект.ДатаАктуализации <= Объект.ДатаНачалаПланирования 
			ИЛИ Объект.ДатаАктуализации > Объект.ДатаОкончанияПланирования) Тогда
			
			ОшибкаДатыАктуализации = Истина;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Объект.ДатаНачалаПланирования) 
			И НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияПланирования) 
			И Объект.ДатаАктуализации <= Объект.ДатаНачалаПланирования Тогда
			
			ОшибкаДатыАктуализации = Истина;
		КонецЕсли; 
		
		Если ОшибкаДатыАктуализации Тогда
			Пояснение = НСтр("ru = 'Дата начала актуализации %1 не попадает в интервал планирования (%2,%3).';
							|en = 'Actualization %1 start date does not fall in the planning period (%2,%3).'");
			Пояснение = СтрШаблон(Пояснение, Формат(Объект.ДатаАктуализации, "ДЛФ=D"),
							Формат(Объект.ДатаНачалаПланирования, "ДЛФ=D"), Формат(Объект.ДатаОкончанияПланирования, "ДЛФ=D"));
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Корректность", 
								НСтр("ru = 'Дата актуализации'; en = 'Updating Date'"),,, Пояснение);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.ДатаАктуализации", Отказ);
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.СценарийЭталон) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
							НСтр("ru = 'Сценарий (план)'; en = 'Scenario (plan)'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.СценарийЭталон", Отказ);
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(Объект.Сценарий) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
							НСтр("ru = 'Сценарий (актуализация)'; en = 'The script (updated)'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.Сценарий", Отказ);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.СценарийЭталон) И ЗначениеЗаполнено(Объект.Сценарий) Тогда
		Сценарии = Новый Массив;
		Сценарии.Добавить(Объект.Сценарий);
		Сценарии.Добавить(Объект.СценарийЭталон);
		Реквизиты = Новый Массив;
		Реквизиты.Добавить("бит_Периодичность");
		Реквизиты.Добавить("ПродолжительностьИнтервала");
		РеквизитыСценариев = РеквизитыСценариев(Сценарии, Реквизиты);
		
		ПериодичностьСценария = РеквизитыСценариев[Объект.Сценарий].бит_Периодичность;
		ПериодичностьЭталонногоСценария = РеквизитыСценариев[Объект.СценарийЭталон].бит_Периодичность;
		Если ПериодичностьСценария <> ПериодичностьЭталонногоСценария Тогда
			Пояснение 	   = НСтр("ru = 'Периодичность сценария не совпадает с периодичность ""Сценарий (план)"".';
								|en = 'The frequency of the scenario does not coincide with the frequency of ""Scenario (Plan)"".'"); 
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Корректность", 
								НСтр("ru = 'Сценарий (актуализация)'; en = 'The script (updated)'"),,, Пояснение);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.Сценарий", Отказ);
			
			Пояснение 	   = НСтр("ru = 'Периодичность сценария не совпадает с периодичность ""Сценарий (актуализация)"".';
								|en = 'The frequency of the scenario does not coincide with the frequency of ""The script (updated)"".'"); 
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Корректность", 
								НСтр("ru = 'Сценарий (план)'; en = 'Scenario (plan)'"),,, Пояснение);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.СценарийЭталон", Отказ);
		КонецЕсли;
		
		ИнтервалСценария = РеквизитыСценариев[Объект.Сценарий].ПродолжительностьИнтервала;
		ИнтервалЭталонногоСценария = РеквизитыСценариев[Объект.СценарийЭталон].ПродолжительностьИнтервала;
		Если ИнтервалСценария <> ИнтервалЭталонногоСценария Тогда
			Пояснение 	   = НСтр("ru = 'Продолжительность интервала не совпадает с продолжительность ""Сценарий (план)"".';
								|en = 'The duration of the interval does not match the duration of the ""Scenario (Plan)"".'"); 
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Корректность", 
								НСтр("ru = 'Сценарий (актуализация)'; en = 'The script (updated)'"),,, Пояснение);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.Сценарий", Отказ);
			
			Пояснение 	   = НСтр("ru = 'Продолжительность интервала не совпадает с продолжительность ""Сценарий (актуализация)"".';
									|en = 'The duration of the interval does not match the duration of ""The script (updated)"".'"); 
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Корректность", 
								НСтр("ru = 'Сценарий (план)'; en = 'Scenario (plan)'"),,, Пояснение);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.СценарийЭталон", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ОбязательныеИзмерения = КэшЗначений.НастройкиФормы.СпособыЗаполнения[ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию")];
	Если ОбязательныеИзмерения <> Неопределено Тогда
		Для каждого Измерение Из ОбязательныеИзмерения Цикл
			Если НЕ ЗначениеЗаполнено(Объект[Измерение]) Тогда
				ПутьКДанным = СтрШаблон("Объект.%1", Измерение);
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", Измерение);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, ПутьКДанным, Отказ);
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат НЕ Отказ;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;
	
	бит_НастройкиДоступностиЭлементовФормКлиентСервер.РазблокироватьЭлементы(Форма);
	
	// Видимость элементов шапки
	Для каждого КиЗ Из Форма.КэшЗначений.НастройкиИзмерений Цикл
		
		Имя       = КиЗ.Ключ;
		Настройка = КиЗ.Значение;
		
		Если Имя = "Сценарий" Тогда
			Продолжить;
		КонецЕсли; 		
		
		Если Найти(Имя,"Аналитика_")>0 Тогда
			Если Настройка = Неопределено Тогда
				Элементы[Имя].Видимость = Ложь;
			Иначе
				Элементы[Имя].Заголовок = Настройка.Синоним;
			КонецЕсли; 
		КонецЕсли; 
		
		Элементы[Имя].АвтоОтметкаНезаполненного = Ложь;
		Элементы[Имя].ОтметкаНезаполненного = Ложь;		
		
	КонецЦикла; 

	СпособЗаполненияПоУмолчанию = ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию");
	ИзмеренияОбязательные 		= Форма.КэшЗначений.НастройкиФормы.СпособыЗаполнения[СпособЗаполненияПоУмолчанию];
	
	Для каждого Имя Из ИзмеренияОбязательные Цикл
	    Элементы[Имя].АвтоОтметкаНезаполненного = Истина;
		Если НЕ ЗначениеЗаполнено(Объект[Имя]) Тогда
			Элементы[Имя].ОтметкаНезаполненного = Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Элементы.ПрофильРаспределения.Видимость = (Объект.СпособАктуализации = 
													ПредопределенноеЗначение("Перечисление.бит_СпособыАктуализации.ПоПрофилю"));
																									
	Если Форма.КэшЗначений.ПроводитьПослеУтверждения 
		И Объект.Проведен И Объект.ОтправленНаСогласование
		И Объект.РежимПринятияКУчету = 1
		И Форма.ТипСтатуса <> ПредопределенноеЗначение("Перечисление.бит_ТипыСтатусовОбъектов.Утвержден") Тогда
		Элементы.ПредупреждениеОПринятиеКУчетуПослеУтверждения.Видимость = Истина;
	Иначе
		Элементы.ПредупреждениеОПринятиеКУчетуПослеУтверждения.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.СценарийЭталон = Объект.Сценарий
		И Объект.РежимЗависимыхОборотов = ПредопределенноеЗначение("Перечисление.бит_РежимыЗависимыхОборотов.Автоматический") Тогда
		Элементы.СторнироватьЗависимыеОбороты.Видимость = Истина
	Иначе	
		Элементы.СторнироватьЗависимыеОбороты.Видимость = Ложь;	
	КонецЕсли; 

	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;
	Элементы.СписатьЛимиты.Видимость   = Форма.НеУчитыватьСверхБюджета;
	
	бит_НастройкиДоступностиЭлементовФормКлиентСервер.ЗаблокироватьЭлементы(Форма);
	
КонецПроцедуры
  
// Процедура инициализирует компоновщик, используемый для фильтрации данных. 
// 
&НаСервере
Процедура ИнициализироватьКомпоновщикДанные()
	
	// Предполагаем, что разворот идет по одному измерению.
	ИмяИзмеренияРазворачивать = КэшЗначений.НастройкиФормы.ИмяРазворачивать;
	ТекстЗапросаДанные        = Документы.бит_АктуализацияБюджета.ТекстЗапросаПлановыеДанные(ИмяИзмеренияРазворачивать);
	
	// Создаем СКД по запросу
	СКД = бит_МеханизмПолученияДанных.СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапросаДанные);
	АдресКомпоновкиДанные = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	
	// Инициализируем компоновщик
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресКомпоновкиДанные);
	КомпоновщикДанные.Инициализировать(ИсточникНастроек);
	КомпоновщикДанные.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
КонецПроцедуры

// Выполняет пересчеты табличных частей при изменении валюты. 
// 
// Параметры:
//  КурсыДок - Структура
// 
&НаСервере
Процедура ПересчитатьТабличныеЧастиПоВалюте(КурсыДок)
	
	ПоляПересчета = Новый Массив;
	ПоляПересчета.Добавить("Сумма");
	бит_Бюджетирование.ПересчитатьТабЧастьПоВалюте(Объект.БДДС, Объект.Сценарий, КурсыДок, ПоляПересчета);
	
	ПоляПересчета = Новый Массив;
	ПоляПересчета.Добавить("Сумма");
	бит_Бюджетирование.ПересчитатьТабЧастьПоВалюте(Объект.ФактическиеДанные, Объект.Сценарий, КурсыДок, ПоляПересчета, "Измерение");
	
КонецПроцедуры

// Функция проверяет допустимость совместного использования сценария эталон и сценария актуализации.
// 
// 
// Возвращаемое значение:
//   ЕстьОшибки   - 
// 
&НаСервере
Функция СценарииМожноИспользоватьВместе()
	
	Если НЕ ЗначениеЗаполнено(Объект.СценарийЭталон) ИЛИ НЕ ЗначениеЗаполнено(Объект.Сценарий) Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Если Объект.СценарийЭталон = Объект.Сценарий Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Отказ = Ложь;

	СписокРеквизитов		= "бит_Периодичность, ПродолжительностьИнтервала";
	РеквизитыДоИзменения    = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СценарийЭталон, СписокРеквизитов);
	РеквизитыПослеИзменения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Сценарий, 		СписокРеквизитов);
	
	Если РеквизитыДоИзменения.бит_Периодичность <> РеквизитыПослеИзменения.бит_Периодичность  Тогда
		ТекстСообщения = НСтр("ru='Не совпадает периодичность сценариев ""План"" и ""Актуализация""';
							  |en='It does not match the frequency of scenario ""Plan"" and ""Updating""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли; 
	
	Если РеквизитыДоИзменения.ПродолжительностьИнтервала <> РеквизитыПослеИзменения.ПродолжительностьИнтервала Тогда
		ТекстСообщения = НСтр("ru = 'Не совпадает продолжительность сценариев ""План"" и ""Актуализация""';
							  |en = 'Does not match the length of the scenarios, ""Plan"" and ""Updating""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли; 
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииПлановыхСценариев()

	СценарийЭталонКонтроль = КэшЗначений.СценарийЭталон;
	СценарийКонтроль 	   = КэшЗначений.Сценарий;
	
	Если НЕ ЗначениеЗаполнено(СценарийЭталонКонтроль) ИЛИ НЕ ЗначениеЗаполнено(СценарийКонтроль) Тогда
		ДобавитьВКэшПлановыеСценарии();
		Возврат;
	КонецЕсли; 
	
	СторноКонтроль = СценарийЭталонКонтроль = СценарийКонтроль;
	Сторно 		   = Объект.СценарийЭталон = Объект.Сценарий;
	
	Если Сторно = СторноКонтроль Тогда
		ДобавитьВКэшПлановыеСценарии();
		Возврат;
	КонецЕсли; 
	
	Если Сторно Тогда
		// Надо перезаполнить "до изменения".
		ТекстСообщения = НСтр("ru = 'Сценарии ""план"" и ""актуализация"" совпадают.
                               		|Для сторнирования плановых данных при проведении документа,
                               		|необходимо повторно обновить данные бюджета.'; 
							  |en = 'The ""plan"" and ""update"" scenarios are the same.
                               		|To reverse the planned data when conducting a document,
                               		|you must update the budget data again.'");
		Кнопки = Новый СписокЗначений(); 
		Кнопки.Добавить(КодВозвратаДиалога.Да , НСтр("ru='Обновить';en='Refresh'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Отменить';en='Cancel'"));
		
		Дополнительно = Новый Структура("Сторно", Сторно); 
		Оповещение = Новый ОписаниеОповещения("ПриИзмененииПлановыхСценариевЗавершение", ЭтотОбъект, Дополнительно); 
		ПоказатьВопрос(Оповещение, ТекстСообщения, Кнопки,,КодВозвратаДиалога.Да, 
				НСтр("ru = 'Актуализация бюджета.'; en = 'The actualization of the budget.'"));		
	Иначе
		// Надо очистить "до изменения" , но спросить.
		ТекстСообщения = НСтр("ru = 'Сценарии ""план"" и ""актуализация"" теперь не совпадают.
                               		|Если планируется возврат к варианту документа с совпадающими сценариями,
                               		|тогда для сторнирования плановых данных при проведении документа,
                               		|потребуется повторно обновить данные бюджета. Продолжить?'; 
							  |en = 'The ""plan"" and ""update"" scenarios are no longer the same.
                               		|If you plan to return to a version of the document with matching scenarios,
                               		|then to reverse the planned data during the document,
                               		|you will need to update the budget data again. Continue?'");
		
		Дополнительно = Новый Структура("Сторно", Сторно);
		Оповещение = Новый ОписаниеОповещения("ПриИзмененииПлановыхСценариевЗавершение", ЭтотОбъект, Дополнительно); 
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да, 
			НСтр("ru='Актуализация бюджета.';en='The actualization of the budget.'"));
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПриИзмененииПлановыхСценариевЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ДополнительныеПараметры.Сторно Тогда
			Если ЗаполнениеДереваВозможно() Тогда
				ОбновитьДеревоВФоне();
				ДобавитьВКэшПлановыеСценарии();
			Иначе
				ИзвлечьИзКэшаПлановыеСценарии();
			КонецЕсли; 
		Иначе
			Объект.ДоИзменения.Очистить();
			ДобавитьВКэшПлановыеСценарии();
		КонецЕсли; 
	Иначе
		ИзвлечьИзКэшаПлановыеСценарии();
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВКэшПлановыеСценарии()

	КэшЗначений.Вставить("СценарийЭталон", Объект.СценарийЭталон);
	КэшЗначений.Вставить("Сценарий", Объект.Сценарий);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзвлечьИзКэшаПлановыеСценарии()

	Объект.СценарийЭталон = КэшЗначений.СценарийЭталон;
	Объект.Сценарий 	  = КэшЗначений.Сценарий;
	
КонецПроцедуры

// формирует массив статей, которые присутствуют в дереве.
// 
// Параметры:
//  ТабДок - ТабличныйДокумент
// 
// Возвращаемое значение:
//  МассивСтатей - Массив.
// 
&НаСервере
Функция ИзвлечьСтатьиИзДерева(ТабДок)
	
	МассивСтатей = Новый Массив;
	
	Для каждого Обл Из ТабДок.Области Цикл
		
		Если Найти(Обл.Имя, "СтатьяОборотов_") > 0 Тогда
			
			Если ТипЗнч(Обл.Расшифровка.Значение) = Тип("СправочникСсылка.бит_СтатьиОборотов") 
				 И НЕ Обл.Расшифровка.Значение.ЭтоГруппа Тогда
				
				МассивСтатей.Добавить(Обл.Расшифровка.Значение);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ТабВрем = Объект.БДДС.Выгрузить();
	ТабВрем.Свернуть("СтатьяОборотов");
	
	Для каждого СтрокаТаблицы Из ТабВрем Цикл
	
		МассивСтатей.Добавить(СтрокаТаблицы.СтатьяОборотов);
	
	КонецЦикла; 
	
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСтатей);
	
	
	Возврат МассивСтатей;
	
КонецФункции

// Управляет видимостью колонок табличных полей БДДС_Редактирование и ЗависимыеОбороты_Редактирование.
// 
&НаСервере
Процедура УправлениеВидимостьюКолонокТаблиц()

	Для каждого КиЗ Из КэшЗначений.НастройкиФормы.Измерения Цикл
		
		Если КиЗ.Ключ = "Сценарий" Тогда
		
			Продолжить;
		
		КонецЕсли; 		
		
		ТекОписание = КиЗ.Значение;
		
		ИмяКолонки = "БДДС_Редактирование"+ТекОписание.Имя;
		Элементы[ИмяКолонки].Видимость = Истина;
	
	КонецЦикла; 
	
	// Скроем аналитики, которые заведомо не используются ни в одной статье в рамках формы ввода.
	Статьи = Новый Массив;
	Для каждого КиЗ Из КэшЗначений.НастройкиСтатей Цикл
	
		Статьи.Добавить(КиЗ.Ключ);
	
	КонецЦикла; 
	НастройкаВидимостиКолонок = Новый Структура;
	
	НеобходимоИзменение = бит_РаботаСДиалогамиСервер.НужноИзменитьВидимостьКолонокБюджета(Статьи
																		, Новый Массив
																		, НастройкаВидимостиКолонок);
	
	
	бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы
											 				, НастройкаВидимостиКолонок
											 				, "БДДС_Редактирование");
															

	// Скрываем в поле редактирования колонки, для которых установлен режим "Разворачивать" или "ПоУмолчанию".
	Для каждого КиЗ Из КэшЗначений.НастройкиФормы.Измерения Цикл
		
		Если КиЗ.Ключ = "Сценарий" Тогда
		
			Продолжить;
		
		КонецЕсли; 		
		
		ТекОписание = КиЗ.Значение;
		
		Показать = ?(ТекОписание.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию 
		                 ИЛИ ТекОписание.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать, Ложь, Истина);
						 				 						 
		Если Найти(ТекОписание.Имя,"Аналитика_")>0 Тогда
		
			Если КэшЗначений.НастройкиИзмерений[ТекОписание.Имя] = Неопределено Тогда
				Показать = Ложь;
			КонецЕсли;	
		
		КонецЕсли; 				 
		
		Если НЕ Показать Тогда
			
			ИмяКолонки = "БДДС_Редактирование"+ТекОписание.Имя;
			Элементы[ИмяКолонки].Видимость = Показать;
			
		КонецЕсли; 
	
	КонецЦикла; 
															
															
КонецПроцедуры

// Процедура оформляет табличное поле.
// 
// Параметры:
//  ПрефиксТаблицы 		- Строка
//  МассивОформляемыхТаблиц - Массив
//  Статьи - Массив.
// 
&НаСервере
Процедура ОформитьТаблицу(ИмяТаблицы, Таблицы = Неопределено, Статьи = Неопределено) 

	ПрефиксКонтейнера = "Объект.";
	
	Если Статьи = Неопределено Тогда
	    // Формирование массива статей, по которым нужно добавить элементы УО.
		ТаблицаПоиска = Объект[ИмяТаблицы].Выгрузить();
		МассивСтатей = ТаблицаПоиска.ВыгрузитьКолонку("СтатьяОборотов");
		бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСтатей);
		
		ЭтотОбъект["СписокСтатей" + ИмяТаблицы].ЗагрузитьЗначения(МассивСтатей);
	Иначе // Работаем только с массивом статей оборотов.
		
		МассивСтатей = Новый Массив; 		
		
		Для каждого ТекСтатья Из Статьи Цикл
			
			НайденноеЗначение = ЭтотОбъект["СписокСтатей" + ИмяТаблицы].НайтиПоЗначению(ТекСтатья);
			Если НайденноеЗначение = Неопределено Тогда	
				МассивСтатей.Добавить(ТекСтатья);
				ЭтотОбъект["СписокСтатей" + ИмяТаблицы].Добавить(ТекСтатья);		
			КонецЕсли;  		
		КонецЦикла; 
	КонецЕсли;	
	
	ПараметрыОформления = бит_РаботаСДиалогамиСервер.НовыеПараметрыОформленияСтатей();
	ПараметрыОформления.ПрефиксКонтейнера                 = ПрефиксКонтейнера;
	ПараметрыОформления.ПрефиксТаблицы                    = ИмяТаблицы;
	ПараметрыОформления.ПоляОформления                    = КэшЗначений.СтруктураДопПолей;
	ПараметрыОформления.ИменаОформляемыхТаблиц            = Таблицы;
	ПараметрыОформления.ОтметитьОбязательныеРазрезыСтатей = Истина;
	бит_РаботаСДиалогамиСервер.ОформитьТаблицуПоСтатьямОборотов(УсловноеОформление, МассивСтатей, ПараметрыОформления);
	
КонецПроцедуры

// Процедура обрабатывает изменение реквизита "СтатьяОборотов" в табличной части "БДДС".
// 
&НаСервере
Процедура ИзменениеСтатьиОборотовВТабличнойЧасти(ИдСтроки, ИмяТабЧасти, ИмяПоля, ЗаполнятьНорму = Истина)
	
	ТекущаяСтрока = Объект[ИмяТабЧасти].НайтиПоИдентификатору(ИдСтроки);
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если КэшЗначений.НастройкиСтатей[ТекущаяСтрока.СтатьяОборотов] = Неопределено Тогда
	
		бит_Бюджетирование.ПолучитьНастройкиСтатейОборотов(ТекущаяСтрока.СтатьяОборотов, КэшЗначений.НастройкиСтатей);
	
	КонецЕсли; 
	
	бит_МеханизмДопИзмерений.ИнициализироватьЗначенияДопИзмерений(ТекущаяСтрока,КэшЗначений.ИзмеренияДоп,КэшЗначений.НастройкиИзмерений);	
	
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить(ИмяПоля);
	
	МассивСтатей = Новый Массив;
	МассивСтатей.Добавить(ТекущаяСтрока.СтатьяОборотов);
	
	ОформитьТаблицу(ИмяТабЧасти, ИменаПолей, МассивСтатей);			
	
	ИзмеренияРазворачивать = КэшЗначений.НастройкиФормы.СпособыЗаполнения[ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать")];	
	УдаленоКлючевоеПоле = бит_БюджетированиеКлиентСервер.ПроверитьПоляВСтроке(ТекущаяСтрока, КэшЗначений.НастройкиСтатей, КэшЗначений.ИзмеренияВсе, ИзмеренияРазворачивать);
	
	Если УдаленоКлючевоеПоле Тогда
	
        бит_БюджетированиеКлиентСервер.ВывестиСообщениеОНесоответствииСтатьи(ТекущаяСтрока.СтатьяОборотов);		
	
	КонецЕсли; 
	
КонецПроцедуры

// Процедура устанавливает параметры выбора статей оборотов, в зависимости от настройки формы ввода бюджета.
// 
&НаСервере
Процедура УстановитьПараметрыВыбораСтатей()
	
	ИзмеренияРазворачивать = КэшЗначений.НастройкиФормы.СпособыЗаполнения[ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать")];
	Если ИзмеренияРазворачивать.Найти("СтатьяОборотов") = Неопределено Тогда
		
		// Если разворот не по статьям, выбирать можно только те статьи, 
		// в которых ведется учет как минимум разворачиваемых аналитик.
		СтрОтбор = Новый Структура;
		Для каждого Имя Из ИзмеренияРазворачивать Цикл
			СтрОтбор.Вставить("Учет_"+Имя, Истина);
		КонецЦикла; 
		
		бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элементы.БДДС_РедактированиеСтатьяОборотов, СтрОтбор);
		бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элементы.СтатьяОборотов, СтрОтбор);
	КонецЕсли; 
	
КонецПроцедуры

// Процедура восстанавливает отбор из хранилища значения.
// 
// Параметры:
//  СохраненнаяНастройка - Структура.
// 
&НаСервере
Процедура ВосстановитьОтбор(СохраненнаяНастройка)

	Если СохраненнаяНастройка.Свойство("НастройкиКомпоновщика") 
		И ТипЗнч(СохраненнаяНастройка.НастройкиКомпоновщика) = Тип("НастройкиКомпоновкиДанных")  Тогда
		
		Если СохраненнаяНастройка.НастройкиКомпоновщика.Отбор.Элементы.Количество() > 0 Тогда
			
			КомпоновщикСтруктура.ЗагрузитьНастройки(СохраненнаяНастройка.НастройкиКомпоновщика);
			
		КонецЕсли;  
		
	Иначе
		
		// Если сохранена еще старая настройка выполним конвертацию отбора построителя в отбор компоновщика.
		бит_МеханизмПолученияДанных.КонвертацияОтборПостроителяОтборКомпоновщика(СохраненнаяНастройка, КомпоновщикСтруктура, ТекстЗапроса);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОбОчисткеДанных(Оповещение)
	
	Если Объект.БДДС.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Данные будут очищены. Продолжить?';en='Data will be cleared. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Нет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеПериода(ДопПараметры)
	
	ПериодПланирования = ДопПараметры.ПериодРезультат;
	Объект.ДатаНачалаПланирования    = ПериодПланирования.ДатаНачала;
	Объект.ДатаОкончанияПланирования = ПериодПланирования.ДатаОкончания;
	
    ОчиститьВсе(ЭтотОбъект);	
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеПериода(ПериодРезультат, ДопПараметры)
	
	Если ПериодРезультат <> Неопределено Тогда
		ДопПараметры = Новый Структура("ПериодРезультат", ПериодРезультат);
		Оповещение = Новый ОписаниеОповещения("РедактированиеПериодаЗавершение", ЭтотОбъект, ДопПараметры); 
		ЗадатьВопросОбОчисткеДанных(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура РедактированиеПериодаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьДанныеПериода(ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьНесуществующийОтборБДДС()
	
	// Устанавливаем заведомом несуществующий отбор, т.к. в таб. части документа не может быть больше 100000 строк.
	Элементы.БДДС_Редактирование.ОтборСтрок = Новый ФиксированнаяСтруктура("ИД",9999999);
	
КонецПроцедуры

// Обрабатывает изменение ячейки данных дерева данных. 
// 
// Параметры:
//  Обл - ОбластьЯчеекТабличногоДокумента.
// 
&НаКлиенте
Процедура ИзменениеСодержимогоОбласти(Обл)
	
	ОбластьР = Обл.Расшифровка;
	
	Если ОбластьР.Вид = "Значение" Тогда
		
		СтрОтбор = бит_БюджетированиеКлиентСервер.СформироватьОтборСтрок(ОбластьР);
		
		МассивСтрок = Объект.БДДС.НайтиСтроки(СтрОтбор);
		
		Если Обл.Значение = 0 Тогда
			
			// Удаляем строки по данной комбинации измерений.
			Для каждого СтрокаТаблицы Из МассивСтрок Цикл
			
				Объект.БДДС.Удалить(СтрокаТаблицы);
			
			КонецЦикла; 
			
		Иначе	
			
			Если МассивСтрок.Количество() = 0 Тогда
				
				// Создаем новую строку
				СоздатьНовуюСтрокуБюджета_Клиент(ОбластьР, Обл.Значение);
				
			ИначеЕсли МассивСтрок.Количество() = 1 Тогда	
				
				// Изменяем значение строки
				ТекСтрока = МассивСтрок[0];
				ТекСтрока[ОбластьР.ИмяРесурса] = Обл.Значение;
				бит_БюджетированиеКлиентСервер.ПроверитьПоляВСтроке(ТекСтрока, КэшЗначений.НастройкиСтатей);
				
			Иначе
				
				// Восстанавливаем предыдущее значение
				Ит = 0;
				Для каждого СтрокаТаблицы Из МассивСтрок Цикл
				
					Ит = Ит + СтрокаТаблицы[ОбластьР.ИмяРесурса];
				
				КонецЦикла; 
				Обл.Значение = Ит;
				
			КонецЕсли; 
			
		КонецЕсли;  // Обл.Значение = 0
		
		Модифицированность = Истина;
		
		// Значения могли быть очищены, поэтому обновляем значения ячейки по данным табличной части.
		ОбновитьЗначениеЯчейкиДерева(Обл, ОбластьР);
		// Обновляем парную ячейку
		ОбновитьПарнуюЯчейки(Обл);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюСтрокуБюджета_Клиент(Расшифровка, НовоеЗначение)

	НоваяСтрока = Объект.БДДС.Добавить();
	
	// Установка ИД строки
	НоваяСтрока.ИД = Строка(Новый УникальныйИдентификатор);
	
	// Заполнение аналитики
	бит_БюджетированиеКлиентСервер.ЗаполнитьНовуюСтрокуБюджета(Объект, НоваяСтрока, Расшифровка.Период, Расшифровка.Измерения, КэшЗначений.НастройкиФормы.Измерения);
	
	// Заполнение ресурсов
	НоваяСтрока[Расшифровка.ИмяРесурса] = НовоеЗначение;
		
	// Проверка возможности заполнения полей в строке в зависимости от статьи оборотов.
	ИзмеренияРазворачивать = КэшЗначений.НастройкиФормы.СпособыЗаполнения[ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать")];
	УдаленоКлючевоеПоле  = бит_БюджетированиеКлиентСервер.ПроверитьПоляВСтроке(НоваяСтрока,КэшЗначений.НастройкиСтатей, КэшЗначений.ИзмеренияВсе, ИзмеренияРазворачивать); 	
	
	Если УдаленоКлючевоеПоле Тогда
		
        бит_БюджетированиеКлиентСервер.ВывестиСообщениеОНесоответствииСтатьи(НоваяСтрока.СтатьяОборотов);		
		// Необходимо удалить строку, потому что к ней не будет доступа, т.к. отбор в табличном поле 
		// редактирования осуществляется по измерениям со способом заполнения Разворачивать.
		Объект.БДДС.Удалить(НоваяСтрока);
		
	КонецЕсли; 
	
КонецПроцедуры

// Обновляет значение в ячейке дерева данных по данным, установленным в табличной части. 
// 
// Параметры:
//  Обл - ТабличныйДокумент
//  Расшифровка - Структура
// 
&НаКлиенте
Процедура ОбновитьЗначениеЯчейкиДерева(Обл, Расшифровка)
	
	// Копируем отбор из отбора строк
	СтрОтбор = Новый Структура;
	Для каждого КиЗ Из Элементы.БДДС_Редактирование.ОтборСтрок Цикл
		
		СтрОтбор.Вставить(КиЗ.Ключ, КиЗ.Значение);
		
	КонецЦикла; 
	
	// Вычисляем итог для данного отбора
	МассивСтрок = Объект.БДДС.НайтиСтроки(СтрОтбор);
	
	Ит = 0;
	Для каждого СтрокаТаблицы Из МассивСтрок Цикл
		
		Ит = Ит+СтрокаТаблицы[Расшифровка.ИмяРесурса];
		
	КонецЦикла; 
	
	// Устанавливаем в дерево
	Обл.Значение = Ит;
	бит_БюджетированиеКлиентСервер.ВычислитьЗависимыеФормулы(ТабДокДанные, ЗависимостиЯчеек, Обл.Имя);
	
КонецПроцедуры

// Процедура обновляет парную ячейку (Количество для Сумма, Сумму для Количества) в дереве.
// 
&НаКлиенте
Процедура ОбновитьПарнуюЯчейки(Обл)
	
	// Возможно следует обновить значение парной ячейки.
	Если ИспользуютсяДвеЯчейки() Тогда
		
		Имя = бит_БюджетированиеКлиент.ИмяВторойЯчейки(Обл.Имя);
		Область = ТабДокДанные.Области.Найти(Имя);
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Область) 
			И бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Область.Расшифровка, "РасшифровкаЯчейкиФормыВвода") Тогда
			
			ОбновитьЗначениеЯчейкиДерева(Область, Область.Расшифровка);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ИспользуютсяДвеЯчейки()
	
	Возврат КэшЗначений.НастройкиФормы.УчетСумма И КэшЗначений.НастройкиФормы.УчетКоличество;
	
КонецФункции

// Определяет, что активна ячейка для ввода значения.
// 
// Возвращаемое значение:
//  ЭтоРедактируемаяЯчейка - Булево.
// 
&НаКлиенте
Функция АктивнаРедактируемаяЯчейка()
	
	ЭтоРедактируемаяЯчейка = Ложь;
	ОблМакета = Элементы.ТабДокДанные.ТекущаяОбласть;
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблМакета) Тогда
		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОблМакета.Расшифровка, "РасшифровкаЯчейкиФормыВвода") 
			  И ОблМакета.Расшифровка.Вид = "Значение" Тогда
			
			ЭтоРедактируемаяЯчейка = Истина;
			
		КонецЕсли;	// ИмяКласса подходит
	КонецЕсли; // ОблМакета подходит
	
	Возврат ЭтоРедактируемаяЯчейка;
	
КонецФункции

&НаКлиенте
Функция АктуализацияВозможна()

	ОчиститьСообщения();
	Отказ = Ложь;
	Если Объект.СпособАктуализации = ПредопределенноеЗначение("Перечисление.бит_СпособыАктуализации.Ручной") Тогда
		Пояснение 	   = НСтр("ru='Установлен способ актуализации ""Ручной"". Автоматическая актуализация не производится.';
								|en='Set way to updating the ""Manual"". Automatic updating is not performed.'"); 
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Корректность", 
							НСтр("ru = 'Способ актуализации'; en = 'Update Method'"),,, Пояснение);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.СпособАктуализации", Отказ);
	КонецЕсли; 
	
	Если Объект.СпособАктуализации = ПредопределенноеЗначение("Перечисление.бит_СпособыАктуализации.ПоПрофилю") 
	   И НЕ ЗначениеЗаполнено(Объект.ПрофильРаспределения) Тогда
  		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
							НСтр("ru = 'Профиль распределения'; en = 'Allocation Profile'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.ПрофильРаспределения", Отказ); 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Сценарий) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
							НСтр("ru = 'Сценарий (актуализация)'; en = 'The script (updated)'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "Объект.Сценарий", Отказ);
	КонецЕсли; 
	
	Если Объект.АктуализацияВыполнена Тогда
		ТекстСообщения = НСтр("ru='Актуализация уже выполнена. Для повторного выполнения актуализации следует обновить данные.';
							  |en='Updating is done. data should be updated to re-execute actualization.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.АктуализацияВыполнена",, Отказ);
	КонецЕсли; 

	Возврат НЕ Отказ;
	
КонецФункции

// Процедура выполняет копирование данных из буфера. 
// 
// Параметры:
//  Буфер      - Массив.
//  ПараметрыВставки - Структура
// 
&НаКлиенте
Процедура ВыполнитьКопированиеДанных(Буфер, ПараметрыВставки)
	
	КоличествоСкопированных = Буфер.Количество();
	Приемники = Новый Массив;
	
	// Определение ячеек приемников
	Если КоличествоСкопированных = 0 Тогда
		
		// Ничего делать не нужно
		
	ИначеЕсли КоличествоСкопированных = 1 Тогда
		
		// Если скопирована одна ячейка, то в случае выделения области ее нужно вставить во вся ячейки области.
		
		ДельтаГ = ПараметрыВставки.Право - ПараметрыВставки.Лево + 1;
		ДельтаВ = ПараметрыВставки.Низ   - ПараметрыВставки.Верх + 1;
		
		ЛевоНач = ПараметрыВставки.Лево;
		ВерхНач = ПараметрыВставки.Верх;
		Для нг = 1 По ДельтаГ Цикл
			
			Лево   = ЛевоНач + нг-1;
			
			Для нв = 1 По ДельтаВ Цикл
				
				Верх = ВерхНач + нв-1;
				Обл  = ТабДокДанные.Область(Верх, Лево, Верх, Лево);
				
				// Если выделенная ячейка является ячейкой вида Значение - запомним координаты.
				ОбластьР = Обл.Расшифровка;
				Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОбластьР, "РасшифровкаЯчейкиФормыВвода") 
					И ОбластьР.Вид = "Значение" Тогда
					
					Приемники.Добавить(Обл);
					
				КонецЕсли;	// ИмяКласса подходит
				
			КонецЦикла; 
			
		КонецЦикла; 
		
	Иначе	
		
		// Если копируется более одной ячейки - 
		// выполняем копирование области начиная с левого верхнего угла выделенной области.
		Обл = ТабДокДанные.Область(ПараметрыВставки.Верх, ПараметрыВставки.Лево, ПараметрыВставки.Верх, ПараметрыВставки.Лево);
		ОбластьР = Обл.Расшифровка;
		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОбластьР, "РасшифровкаЯчейкиФормыВвода") 
			И ОбластьР.Вид = "Значение" Тогда
			
			Приемники.Добавить(Обл);
			
		КонецЕсли;	// ИмяКласса подходит
		
	КонецЕсли; 
	
	// Подготовка данных для копирования
	ДанныеКопирования = Новый Массив;
	
	Для каждого ПараметрыКопирования Из Буфер Цикл
	
		// Выполним копирование данных
		СтрОтбор = Новый Структура;
		СтрОтбор.Вставить("Период", ПараметрыКопирования.Период);
		Для каждого КиЗ Из ПараметрыКопирования.Измерения Цикл
			
			СтрОтбор.Вставить(КиЗ.Ключ, КиЗ.Значение);
			
		КонецЦикла; // МПараметрыПеретаскивания.Измерения
		
		// Источник копирования
		МассивИсточник = Объект.БДДС.НайтиСтроки(СтрОтбор);
		
		ДанныеКопирования.Добавить(Новый Структура("СдвигГор, СдвигВерт, МассивДанных"
		                                             , ПараметрыКопирования.СдвигГор
													 , ПараметрыКопирования.СдвигВерт
													 , МассивИсточник));
		
	КонецЦикла;  // По параметрам копирования
	
	// Выполнение копирования
	Для каждого ОбластьПриемник Из Приемники  Цикл
		
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОбластьПриемник) Тогда
			
			ЛевоНач = ОбластьПриемник.Лево;
			ВерхНач = ОбластьПриемник.Верх;
			
			Для каждого ПараметрыКопирования Из ДанныеКопирования Цикл
				
				Лево = ЛевоНач+ПараметрыКопирования.СдвигГор;
				Верх = ВерхНач+ПараметрыКопирования.СдвигВерт;
				
				Обл = ТабДокДанные.Область(Верх, Лево, Верх, Лево);
				
					Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) 
						 И бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Обл.Расшифровка, "РасшифровкаЯчейкиФормыВвода") 
						 И Обл.Расшифровка.Вид = "Значение" 
						 И НЕ ЗначениеЗаполнено(Обл.Значение) Тогда
					
						 ОбластьР = Обл.Расшифровка;
						 
						 Если ОбластьР.ПланФакт = "Ф" Тогда
						 
						 	  Продолжить;
						 
						 КонецЕсли; 
						 
						 // Источник копирования
						 МассивИсточник = ПараметрыКопирования.МассивДанных;
						 
						 ИтСумма = 0;
						 ИтКоличество = 0;
						 Для каждого СтрокаИсточник Из МассивИсточник Цикл
						 	
						 	НоваяСтрока = Объект.БДДС.Добавить();
						 	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
						 	НоваяСтрока.ИД = Строка(Новый УникальныйИдентификатор);
						 	НоваяСтрока.Период = ОбластьР.Период;
						 	Для каждого КиЗ Из ОбластьР.Измерения Цикл
						 		
						 		НоваяСтрока[КиЗ.Ключ] = КиЗ.Значение;
						 		
						 	КонецЦикла; 
						 	
						 	ИтСумма = ИтСумма+НоваяСтрока.Сумма;
						 	ИтКоличество = ИтКоличество+НоваяСтрока.Количество;
						 	
							
							УстановитьЗначениеЯчейки(Обл, ИтКоличество, ИтСумма);
							
						 КонецЦикла; // МассивИсточник 
					
					КонецЕсли; 
				
			КонецЦикла; // По данным копирования
			
		КонецЕсли;  // Область приемник подходит
		
	КонецЦикла; // Приемники
	
	
КонецПроцедуры

// Устанавливает значение в ячейке дерева. 
// 
// Параметры:
//  Обл - ОбластьЯчеекТабличногоДокумента.
//  ЗнКоличество - Число
//  ЗнСумма - Число;
// 
&НаКлиенте
Процедура УстановитьЗначениеЯчейки(Обл, ПараметрКоличество, ПараметрСумма)

	Если Лев(Обл.Имя,1) = "С" Тогда
	
		Обл.Значение = ПараметрСумма;
		
		Рез = бит_БюджетированиеКлиентСервер.ВычислитьЗависимыеФормулы(ТабДокДанные, ЗависимостиЯчеек, Обл.Имя);
		Для каждого ОблИзмененная  Из Рез.ИзмененныеОбласти Цикл
			
			ИзменениеСодержимогоОбласти(ОблИзмененная);
			
		КонецЦикла; 
		
		Если КэшЗначений.НастройкиФормы.УчетКоличество Тогда
		
			Имя = СтрЗаменить(Обл.Имя,"С","К");
			Область = ТабДокДанные.Область(Имя);
			
			Если Область <> Неопределено Тогда
			
				Область.Значение = ПараметрКоличество;
				Рез = бит_БюджетированиеКлиентСервер.ВычислитьЗависимыеФормулы(ТабДокДанные, ЗависимостиЯчеек, Область.Имя);
				Для каждого ОблИзмененная  Из Рез.ИзмененныеОбласти Цикл
					
					ИзменениеСодержимогоОбласти(ОблИзмененная);
					
				КонецЦикла; 
				
			
			КонецЕсли; 
		
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Лев(Обл.Имя,1) = "К" Тогда
		
		Обл.Значение = ПараметрКоличество;
		
		Рез = бит_БюджетированиеКлиентСервер.ВычислитьЗависимыеФормулы(ТабДокДанные, ЗависимостиЯчеек, Обл.Имя);
		Для каждого ОблИзмененная  Из Рез.ИзмененныеОбласти Цикл
			
			ИзменениеСодержимогоОбласти(ОблИзмененная);
			
		КонецЦикла; 
		
		Если КэшЗначений.НастройкиФормы.УчетСумма Тогда
			
			Имя = СтрЗаменить(Обл.Имя,"К","С");
			Область = ТабДокДанные.Область(Имя);
			
			Если Область <> Неопределено Тогда
				
				Область.Значение = ПараметрСумма;
				Рез = бит_БюджетированиеКлиентСервер.ВычислитьЗависимыеФормулы(ТабДокДанные, ЗависимостиЯчеек, Область.Имя);
				Для каждого ОблИзмененная  Из Рез.ИзмененныеОбласти Цикл
					
					ИзменениеСодержимогоОбласти(ОблИзмененная);
					
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из КонтролируемыеРеквизиты Цикл
		КонтролируемыеРеквизиты[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры

// Процедура добавляет в кэш реквизитов текущее значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	КонтролируемыеРеквизиты[ИмяРеквизита] = Объект[ИмяРеквизита];	
	
КонецПроцедуры

// Процедура извлекает из кэша и присваивает объекту значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ИзвлечьИзКэша(ИмяРеквизита)
	
	Объект[ИмяРеквизита] = КонтролируемыеРеквизиты[ИмяРеквизита];
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийЭлементовФормыНаСервере

// Процедура обрабатывает изменение настройки формы ввода.
// 
&НаСервере
Процедура ИзменениеНастройкиФормы(ТекущаяНастройкаФормы)
	
	НовНастройкиФормы = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(Объект.НастройкаФормы);
	
	Если НовНастройкиФормы.КоличествоРазворачивать > 1 Тогда	
		Объект.НастройкаФормы = ТекущаяНастройкаФормы;
		ТекстСообщения = НСтр("ru='Актуализация может быть проведена только по настройкам с одним разворачиваемым измерением.';
							  |en='Mainstreaming can be carried out only by setting one resolvable dimension.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;	
	КонецЕсли; 
	
	ОчиститьВсе(ЭтотОбъект);	
	
    КэшЗначений.НастройкиФормы = НовНастройкиФормы;	
	
	ТекстЗапроса = Объект.НастройкаФормы.ТекстЗапроса;
	АдресКомпоновкиСтруктура = Документы.бит_АктуализацияБюджета.ИнициализироватьКомпоновщикСтруктура(ТекстЗапроса, КомпоновщикСтруктура, Новый УникальныйИдентификатор);
	
	// Инициализация компоновщика для получения данных.
	ИнициализироватьКомпоновщикДанные();
	
	Если ЗначениеЗаполнено(Объект.НастройкаФормы) Тогда
		
		// Копирование отбора из настройки
		ОбНастройка   		 = Объект.НастройкаФормы.ПолучитьОбъект();
		НастройкиПостроителя = ОбНастройка.ПолучитьНастройкиПостроителя();
		
		ВосстановитьОтбор(НастройкиПостроителя);
		
		// Копирование значений по-умолчанию из настройки.
		Для каждого КиЗ Из КэшЗначений.НастройкиФормы.Измерения Цикл
			
			ТекОписание = КиЗ.Значение;
			Если НЕ ТекОписание.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать 
				И ЗначениеЗаполнено(ТекОписание.ЗначениеПоУмолчанию) Тогда
				
				ЕстьРазличия = ?(Объект[ТекОписание.Имя] <> ТекОписание.ЗначениеПоУмолчанию, Истина, Ложь);
				Объект[ТекОписание.Имя] = ТекОписание.ЗначениеПоУмолчанию;
				
				Если ЕстьРазличия Тогда
					
					// Вызов обработчиков
					Если ТекОписание.Имя = "Сценарий" Тогда
						
						ИзменениеСценария(Ложь);
						
					ИначеЕсли ТекОписание.Имя = "Контрагент" Тогда
						
						ИзменениеКонтрагента();
						
					ИначеЕсли ТекОписание.Имя = "ДоговорКонтрагента" Тогда	
						
						ИзменениеДоговораКонтрагента();
						
					КонецЕсли; 
					
				КонецЕсли; // ФлЕстьРазличия
				
			КонецЕсли; 
			
		КонецЦикла; // ФКэшЗначений.НастройкиФормы.Измерения
		
        УстановитьПараметрыВыбораСтатей();
		
	КонецЕсли; // ЗначениеЗаполнено(Объект.НастройкаФормы)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

// Процедура обрабатывает изменение валюты.
// 
&НаСервере
Процедура ИзменениеВалюты(ПересчитатьСуммы, ВалютаНач = Неопределено)
	
	СтрНач = бит_КурсыВалют.СтруктураКурса(ВалютаНач, Объект.КурсДокумента, Объект.КратностьДокумента);	
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ИзменениеВалюты();
	ЗначениеВДанныеФормы(ДокОбъект, Объект);
	
	Если ПересчитатьСуммы И ЗначениеЗаполнено(ВалютаНач) Тогда
		СтрКон = бит_КурсыВалют.СтруктураКурса(Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);
		КурсыДок = Новый Структура("Нач, Кон", СтрНач, СтрКон);
		ПересчитатьТабличныеЧастиПоВалюте(КурсыДок);
		ВосстановитьДерево();
	КонецЕсли; // Пересчитать.	
	
КонецПроцедуры

// Процедура обрабатывает изменение сценария. 
// 
&НаСервере
Процедура ИзменениеСценария(ПересчитатьСуммы)
	
	ВалютаНач = Объект.ВалютаДокумента;
	СтрНач = бит_КурсыВалют.СтруктураКурса(ВалютаНач, Объект.КурсДокумента, Объект.КратностьДокумента);		
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ИзменениеСценария(Ложь);
	ЗначениеВДанныеФормы(ДокОбъект, Объект);
	
	СтрКон = бит_КурсыВалют.СтруктураКурса(Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);
		
	Если ПересчитатьСуммы И ЗначениеЗаполнено(ВалютаНач) Тогда
		КурсыДок = Новый Структура("Нач, Кон", СтрНач, СтрКон);
		ПересчитатьТабличныеЧастиПоВалюте(КурсыДок);
	КонецЕсли; // Пересчитать.
	
	Если ПересчитатьСуммы Тогда
		ВосстановитьДерево();
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обрабатывает изменение даты начала планирования. 
// 
&НаСервере
Процедура ДатаНачалаПланированияИзменение()

	ОчиститьВсе(ЭтотОбъект);

	Объект.ДатаАктуализации = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(Объект.ДатаАктуализации,Объект.Сценарий.бит_Периодичность);	
	
КонецПроцедуры

// Процедура обрабатывает изменение даты актуализации. 
// 
&НаСервере
Процедура ДатаАктуализацииИзменение()

	ОчиститьВсе(ЭтотОбъект);
	
	Объект.ДатаАктуализации = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(Объект.ДатаАктуализации,Объект.Сценарий.бит_Периодичность);

КонецПроцедуры

// Процедура обрабатывает регулирование даты актуализации. 
// 
// Параметры:
//  Направление - Число.
// 
&НаСервере
Процедура ДатаАктуализацииРегулированиеСервер(Направление)

	ОчиститьВсе(ЭтотОбъект);	
	
	Объект.ДатаАктуализации = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(Объект.ДатаАктуализации,Объект.Сценарий.бит_Периодичность);
	Объект.ДатаАктуализации = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(Объект.ДатаАктуализации,Направление,Объект.Сценарий.бит_Периодичность);

КонецПроцедуры

// Обрабатывает изменение контрагента. 
// 
&НаСервере
Процедура ИзменениеКонтрагента()
	
	бит_РаботаСДиалогамиСервер.ПроверитьВладельцаДоговораКонтрагентаВСтроке(Объект.Контрагент, Объект.ДоговорКонтрагента);
	
КонецПроцедуры

// Обрабатывает изменение договора контрагента. 
// 
&НаСервере
Процедура ИзменениеДоговораКонтрагента()

  бит_РаботаСДиалогамиСервер.ИзменениеДоговораКонтрагента(Объект.ДоговорКонтрагента, Объект.Контрагент);	

КонецПроцедуры

#КонецОбласти

#Область ЗависимыеОбороты

// Процедура отключает отбор в табличном поле ЗависимыеОбороты.
// 
&НаКлиенте
Процедура ОтключитьОтборЗависимые()

	Элементы.ЗависимыеОбороты.ОтборСтрок = Неопределено;

КонецПроцедуры

// Процедура устанавливает отбор в табличном поле ЗависимыеОбороты.
// 
&НаКлиенте
Процедура УстановитьОтборЗависимые(ИдСтроки)
	
	Если УстанавливатьОтборЗависимых Тогда
		
		СтрОтбор = Новый Структура("ИД", ИдСтроки);
		СтрокаРодитель = Объект.БДДС.НайтиСтроки(СтрОтбор);
		
		Если СтрокаРодитель.Количество()>0 Тогда
			
			СтрокаБДДС = СтрокаРодитель[0];
			Элементы.ЗависимыеОбороты.ОтборСтрок = Новый ФиксированнаяСтруктура("ИД_Родитель",СтрокаБДДС.ИД);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура устанавливает картинку и подсказку кнопки переключения отбора. 
// 
&НаСервере
Процедура УстановитьКартинкуКнопкиОтбор()

	Если УстанавливатьОтборЗависимых Тогда
		
		Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Картинка  = БиблиотекаКартинок.ОтключитьОтбор;
		Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Заголовок = НСтр("ru='Отключить отбор';en='Disable Filter'");
		
	Иначе	
		
		Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Картинка  = БиблиотекаКартинок.ОтборКомпоновкиДанных;
		Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Заголовок = НСтр("ru='Установить отбор';en='Set Filter'");
		
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция РазрешенВводЗависимыхОборотов()

	Если Объект.РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Автоматический Тогда
	  ФлРазрешен = Истина;
	Иначе	
	  ФлРазрешен = Ложь;
	КонецЕсли;

	Возврат ФлРазрешен;
	
КонецФункции

// Выполняет очистку зависимых оборотов. 
// 
&НаСервере
Процедура ОчиститьЗависимыеОбороты()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ОчиститьЗависимыеОбороты();
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
КонецПроцедуры

// Выполняет заполнение зависимых оборотов. 
// 
&НаСервере
Процедура ЗаполнитьЗависимыеОбороты()
	
	Если РазрешенВводЗависимыхОборотов() Тогда
		
		ДокОбъект = РеквизитФормыВЗначение("Объект");	
		ДокОбъект.ЗаполнитьЗависимыеОбороты();
		ЗначениеВДанныеФормы(ДокОбъект, Объект);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбновленияДерева

// Выполняет обновление дерева данных. 
// 
&НаКлиенте
Процедура ОбновитьДеревоВФоне()
	
	ОчиститьВсе(ЭтотОбъект);
	ДлительнаяОперация = НачатьОбновлениеДерева();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьДеревоЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьОбновлениеДерева()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;

	РеквизитыСценария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Сценарий, "бит_Периодичность, ПродолжительностьИнтервала");
	Настройки = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(Объект.НастройкаФормы);
	
	НовыеПараметрыДерева = Документы.бит_АктуализацияБюджета.НовыеПараметрыОбновеления();
	ЗаполнитьЗначенияСвойств(НовыеПараметрыДерева, Объект);
	НовыеПараметрыДерева.ТабДок						= Новый ТабличныйДокумент;
	НовыеПараметрыДерева.Настройки					= Настройки;
	НовыеПараметрыДерева.ТекстЗапроса				= ТекстЗапроса;
	
	НовыеПараметрыДерева.СхемаКомпоновкиСтруктура		= ПолучитьИзВременногоХранилища(АдресКомпоновкиСтруктура);
	НовыеПараметрыДерева.НастройкиКомпоновщикаСтруктура	= КомпоновщикСтруктура.ПолучитьНастройки();
	НовыеПараметрыДерева.СхемаКомпоновкиДанные			= ПолучитьИзВременногоХранилища(АдресКомпоновкиДанные);
	НовыеПараметрыДерева.НастройкиКомпоновщикаДанные	= КомпоновщикДанные.ПолучитьНастройки();
	
	НовыеПараметрыДерева.Периодичность				= РеквизитыСценария.бит_Периодичность;
	НовыеПараметрыДерева.ПродолжительностьИнтервала	= РеквизитыСценария.ПродолжительностьИнтервала;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
				"Документы.бит_АктуализацияБюджета.ОбновитьДеревоДанных", НовыеПараметрыДерева);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДеревоЗавершение(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Тогда  // Отменено пользователем.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбновитьДеревоЗавершениеНаСервере(Результат);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьДеревоЗавершениеНаСервере(Результат)
	
	Если Результат.Свойство("АдресРезультата") И ЗначениеЗаполнено(Результат.АдресРезультата) Тогда
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если РезультатВыполнения = Неопределено Тогда
			ТекстОшибки = НСтр("ru = 'Из временного хранилища не получен результат (получено Неопределено)';
								|en = 'No result received from temporary storage (Received Undefined)'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		Объект.ФактическиеДанные.Загрузить(РезультатВыполнения.ФактическиеДанные);
		Объект.БДДС.Загрузить(РезультатВыполнения.БДДС);
		Объект.ДоИзменения.Загрузить(РезультатВыполнения.ДоИзменения);
		ТабДокДанные = РезультатВыполнения.ТабДок;
		Объект.АктуализацияВыполнена = Ложь;
		ПослеИзмененияМакета();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВосстановленияДерева

// Восстанавливает дерево данных по табличным частям. 
// 
&НаКлиенте
Процедура ВосстановитьДеревоВФоне()
	
	ТабДокДанные = Новый ТабличныйДокумент;
	ДлительнаяОперация = НачатьВосстановлениеДерева();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВосстановитьДеревоВФонеЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьВосстановлениеДерева()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	РеквизитыСценария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Сценарий, "бит_Периодичность, ПродолжительностьИнтервала");
	Настройки = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(Объект.НастройкаФормы);
	
	НовыеПараметрыДерева = Документы.бит_АктуализацияБюджета.НовыеПараметрыВосстановления();
	ЗаполнитьЗначенияСвойств(НовыеПараметрыДерева, Объект);
	НовыеПараметрыДерева.ТабДок						= Новый ТабличныйДокумент;
	НовыеПараметрыДерева.Настройки					= Настройки;
	НовыеПараметрыДерева.ТекстЗапроса				= ТекстЗапроса;

	НовыеПараметрыДерева.СхемаКомпоновкиСтруктура		= ПолучитьИзВременногоХранилища(АдресКомпоновкиСтруктура);
	НовыеПараметрыДерева.НастройкиКомпоновщикаСтруктура	= КомпоновщикСтруктура.ПолучитьНастройки();
	
	НовыеПараметрыДерева.Периодичность				= РеквизитыСценария.бит_Периодичность;
	НовыеПараметрыДерева.ПродолжительностьИнтервала	= РеквизитыСценария.ПродолжительностьИнтервала;
	НовыеПараметрыДерева.БДДС						= Объект.БДДС.Выгрузить();
	НовыеПараметрыДерева.ФактическиеДанные			= Объект.ФактическиеДанные.Выгрузить();
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
				"Документы.бит_АктуализацияБюджета.ВосстановитьДеревоПоДанным", НовыеПараметрыДерева);
	
КонецФункции

&НаКлиенте
Процедура ВосстановитьДеревоВФонеЗавершение(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Тогда  // Отменено пользователем.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ВосстановитьДеревоВФонеЗавершениеНаСервере(Результат);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ВосстановитьДеревоВФонеЗавершениеНаСервере(Результат)
	
	Если Результат.Свойство("АдресРезультата") И ЗначениеЗаполнено(Результат.АдресРезультата) Тогда
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если РезультатВыполнения = Неопределено Тогда
			ТекстОшибки = НСтр("ru = 'Из временного хранилища не получен результат (получено Неопределено)';
								|en = 'No result received from temporary storage (Received Undefined)'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		ТабДокДанные = РезультатВыполнения.ТабДок;
		ПослеИзмененияМакета();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьДерево()

	РеквизитыСценария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Сценарий, "бит_Периодичность, ПродолжительностьИнтервала");
	Настройки = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(Объект.НастройкаФормы);
	
	НовыеПараметрыДерева = Документы.бит_АктуализацияБюджета.НовыеПараметрыВосстановления();
	ЗаполнитьЗначенияСвойств(НовыеПараметрыДерева, Объект);
	НовыеПараметрыДерева.ТабДок						= Новый ТабличныйДокумент;
	НовыеПараметрыДерева.Настройки					= Настройки;
	НовыеПараметрыДерева.ТекстЗапроса				= ТекстЗапроса;

	НовыеПараметрыДерева.СхемаКомпоновкиСтруктура		= ПолучитьИзВременногоХранилища(АдресКомпоновкиСтруктура);
	НовыеПараметрыДерева.НастройкиКомпоновщикаСтруктура	= КомпоновщикСтруктура.ПолучитьНастройки();
	
	НовыеПараметрыДерева.Периодичность				= РеквизитыСценария.бит_Периодичность;
	НовыеПараметрыДерева.ПродолжительностьИнтервала	= РеквизитыСценария.ПродолжительностьИнтервала;
	НовыеПараметрыДерева.БДДС						= Объект.БДДС.Выгрузить();
	НовыеПараметрыДерева.ФактическиеДанные			= Объект.ФактическиеДанные.Выгрузить();
	
	РезультатВыполнения = Документы.бит_АктуализацияБюджета.ВосстановитьДеревоПоДанным(НовыеПараметрыДерева);
	ТабДокДанные = РезультатВыполнения.ТабДок;
	ПослеИзмененияМакета();
	
КонецПроцедуры

#КонецОбласти

#Область Актуализация

&НаКлиенте
Процедура АктуализацияВФоне()
	
	ДлительнаяОперация = НачатьАктуализацию();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("АктуализацияЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьАктуализацию()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;

	РеквизитыСценария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Сценарий, "бит_Периодичность, ПродолжительностьИнтервала");
	Настройки = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(Объект.НастройкаФормы);
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыАктуализации = Документы.бит_АктуализацияБюджета.НовыеПараметрыАктуализации();
 	ЗаполнитьЗначенияСвойств(ПараметрыАктуализации, Объект, ,"БДДС,ФактическиеДанные");
	АналитикиБДДСДляПодстановки = Документы.бит_АктуализацияБюджета.АналитикиБДДСДляПодстановки(ДокументОбъект, Настройки);
	
	ПараметрыАктуализации.АналитикиБДДСДляПодстановки	= АналитикиБДДСДляПодстановки;
	ПараметрыАктуализации.Настройки						= Настройки;
	ПараметрыАктуализации.Периодичность					= РеквизитыСценария.бит_Периодичность;
	ПараметрыАктуализации.ПродолжительностьИнтервала	= РеквизитыСценария.ПродолжительностьИнтервала;
	ПараметрыАктуализации.БДДС							= Объект.БДДС.Выгрузить();
	ПараметрыАктуализации.ФактическиеДанные				= Объект.ФактическиеДанные.Выгрузить();

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
				"Документы.бит_АктуализацияБюджета.ВыполнитьАктуализацию", ПараметрыАктуализации);
	
КонецФункции

&НаКлиенте
Процедура АктуализацияЗавершение(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Тогда  // Отменено пользователем.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		АктуализацияВФонеЗавершениеНаСервере(Результат);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура АктуализацияВФонеЗавершениеНаСервере(Результат)
	
	Если Результат.Свойство("АдресРезультата") И ЗначениеЗаполнено(Результат.АдресРезультата) Тогда
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если РезультатВыполнения = Неопределено Тогда
			ТекстОшибки = НСтр("ru = 'Из временного хранилища не получен результат (получено Неопределено)';
								|en = 'No result received from temporary storage (Received Undefined)'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		Объект.БДДС.Загрузить(РезультатВыполнения.БДДС);
		Объект.АктуализацияВыполнена = Истина;
		Модифицированность = Истина;
		ВосстановитьДерево();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПослеИзмененияМакета()
	
	Статьи = ИзвлечьСтатьиИзДерева(ТабДокДанные);	
	КэшЗначений.НастройкиСтатей = Новый Соответствие;
	бит_Бюджетирование.ПолучитьНастройкиСтатейОборотов(Статьи, КэшЗначений.НастройкиСтатей);
	ЗависимостиЯчеек = бит_Бюджетирование.ПолучитьЗависимостиЯчеек(ТабДокДанные);	
	УправлениеВидимостьюКолонокТаблиц();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЗависимыеОборотыКомментарийРасчета");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.КурсДокумента", ВидСравненияКомпоновкиДанных.Больше, -1);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветГиперссылки);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Комментарий расчета';en='Calculation Comments'"));

КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеУчитыватьСверхБюджета(ЦФО, Период)

	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("ЦФО", ЦФО);
								
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(
								ПараметрыНастройки, Период);
								
	Возврат НеУчитыватьСверхБюджета;							

КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗаполнитьКэшЗначений();
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);
	
	ПериодПланирования.ДатаНачала    = Объект.ДатаНачалаПланирования;
	ПериодПланирования.ДатаОкончания = Объект.ДатаОкончанияПланирования;

	ИнициализироватьФорму();

	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ЦФОПриИзмененииНаСервере()

	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()

	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры 

// Функция - Реквизиты сценариев
//
// Параметры:
//  Сценарии	 - Массив - Массив из ссылок на сценарии.
//  Реквизиты	 - Массив - Массив из имен реквизитов.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - список объектов и значений их реквизитов:
//   * Ключ - ЛюбаяСсылка - ссылка на объект;
//   * Значение - Структура:
//    ** Ключ - Строка - имя реквизита;
//    ** Значение - Произвольный - значение реквизита.
//
&НаСервереБезКонтекста
Функция РеквизитыСценариев(Сценарии, Реквизиты)
	
	Если НЕ ЗначениеЗаполнено(Сценарии) ИЛИ Реквизиты.Количество() = 0 Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Сценарии, Реквизиты);
	
КонецФункции

#КонецОбласти