#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет наборы значений доступа.
// Параметры:
//  Таблица - ТаблицаЗначений - передает в этот параметр подготовленные наборы значений
//            доступа. Описание колонок см. в функции УправлениеДоступом.ТаблицаНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ДобавитьСтрокуВНаборЗначенийДоступа(Организация, Таблица);
	
	КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
		ЦФО, СтатьяОборотов);
	ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	
	КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
		ЦФО, СтатьяОборотовНачисления);
	ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
		ДобавитьСтрокуВНаборЗначенийДоступа(Ответственный, Таблица);
	
	// Таблица "ГрафикПлатежей"
	Для каждого СтрокаТаблицы Из ГрафикПлатежей Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
	
	// Таблица "ГрафикНачислений"
	Для каждого СтрокаТаблицы Из ГрафикНачислений Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотовНачисления);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
		
	// Удалим дубли
	ПоляГруппировки = "";
	Для каждого Колонка Из Таблица.Колонки Цикл
		ПоляГруппировки = "," + Колонка.Имя + ПоляГруппировки;
	КонецЦикла; 
	
	ПоляГруппировки = Сред(ПоляГруппировки, 2);
	Таблица.Свернуть(ПоляГруппировки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДоговорКонтрагента") Тогда
			ЗаполнитьНаОснованииДоговора(ДанныеЗаполнения);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьШапкуДокумента();
	
	ЗаполнитьАналитикиПоУмолчанию();
	
	// При создании нового документа вид операции выбирает пользователь.
	ВидОперации = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект, Ложь);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.бит_ДополнительныеУсловияПоДоговору.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ТаблицаИсполнениеБюджета = бит_КонтрольИсполненияБюджета.ПодготовитьТаблицуИсполнениеБюджета(
									ПараметрыПроведения.ИсполнениеБюджета,
									ПараметрыПроведения.ИсполнениеБюджетаРеквизиты, Отказ);
		
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 
	
	бит_КонтрольИсполненияБюджета.СформироватьДвиженияКонтрольныеЗначенияБюджетов(ТаблицаИсполнениеБюджета, Движения);
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	ИсточникПроводок = ОпределитьИсточникПроводок();
    // Документ по МСФО проводим только для некоторых видов операций.
	Если НЕ ПустаяСтрока(ИсточникПроводок) Тогда	
		ПроверитьРавенстроСумм(ПараметрыПроведения);	
	КонецЕсли; 
	
	Если Не Отказ Тогда
		
		// Получим курсы валют, неоходимые для выполнения пересчетов.
		ВидыКурсов = Новый Структура("Взаиморасчеты, Регл, Упр, Сценарий, Документ");
		СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ПараметрыПроведения, ИсточникПроводок, СтруктураКурсыВалют, Отказ, "");
		
	КонецЕсли;
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	
	// Уберем проверку реквизита "Период", если это необходимо.
	Если ПроверитьТЧГрафикПлатежей() Тогда
		НепроверяемыеРеквизиты.Добавить("ГрафикПлатежей.Период");
	КонецЕсли;
	
	Если РасходДоход = Перечисления.бит_РасходДоход.Поступление Тогда
		НепроверяемыеРеквизиты.Добавить("ХозяйственнаяОперация");	
	КонецЕсли;
	
	ПроверкаЗаполнения(Отказ);
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли;
	
	// ++ ЕРП 
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	// -- ЕРП 
	
	Если бит_ОбщегоНазначения.ЭтоУТ() Тогда
		ФормироватьДвижения = Ложь;
	КонецЕсли;
	
	Если РасходДоход = Перечисления.бит_РасходДоход.Поступление Тогда
		ХозяйственнаяОперация 	 = Перечисления.бит_РасходДоход.ПустаяСсылка();
		БанковскийСчетПолучателя = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
	КонецЕсли;

	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("Проведен", Проведен);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// Очистим табличную часть "ГрафикПлатежей".
	ГрафикПлатежей.Очистить();
	// Очистим табличную часть "ГрафикНачислений".
	ГрафикНачислений.Очистить();
	
	ЗаполнитьШапкуДокумента(ОбъектКопирования);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ВалютыСуммы

// Процедура обрабатывает изменение валюты документа.
//
// Параметры:
//  Нет.
//
Процедура ИзменениеВалюты() Экспорт
    
    СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
    
    КурсДокумента      = СтрКурса.Курс;
    КратностьДокумента = СтрКурса.Кратность;
    
КонецПроцедуры

// Процедура расчитывает суммму НДС.
//
// Параметры:
//  Контейнер - СтрокаТабличнойЧасти, ЭтотОбъект.
//
Процедура РассчитатьСуммуНДС(Контейнер, РеквизитСумма = "Сумма", РеквизитНДС = "НДС", пСуммаВключаетНДС = Истина, РеквизитСтавка="СтавкаНДС") Экспорт

    Если Контейнер = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Контейнер[РеквизитНДС] = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Контейнер[РеквизитСумма]
        											   ,Истина
        											   ,пСуммаВключаетНДС
        											   ,бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(Контейнер[РеквизитСтавка]));
													   
    Если РеквизитСумма = "Сумма" Тогда
		Контейнер.СуммаБезНДС = Контейнер.Сумма - Контейнер[РеквизитНДС];
	ИначеЕсли РеквизитСумма = "СуммаБезНДС" Тогда
		Контейнер.Сумма = Контейнер.СуммаБезНДС + Контейнер[РеквизитНДС];	
	КонецЕсли; 												
		
КонецПроцедуры

#КонецОбласти

#Область ФормированиеГрафиков

// Формирует структуру значений параметров графика.
// Без привязки имени элемента структуры к конкретному графику.
//
Функция ПолучитьЗначенияРеквизитовШапкиТаблицы(ИмяГрафика) Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	
	Если ИмяГрафика = "ГрафикПлатежей" Тогда
		СтруктураРеквизитов.Вставить("СтатьяОборотов", СтатьяОборотов);
		СтруктураРеквизитов.Вставить("Периодичность", Периодичность);
		СтруктураРеквизитов.Вставить("ДатаНачала", ДатаНачала);
		СтруктураРеквизитов.Вставить("ДатаОкончания", ДатаОкончания);
		СтруктураРеквизитов.Вставить("СуммаПриход", СуммаПриход);
		СтруктураРеквизитов.Вставить("СуммаНДСПриход", СуммаНДСПриход);
		СтруктураРеквизитов.Вставить("СуммаРасход", СуммаРасход);
		СтруктураРеквизитов.Вставить("СуммаНДСРасход", СуммаНДСРасход);
		СтруктураРеквизитов.Вставить("СтавкаНДС", СтавкаНДС);
	Иначе
		СтруктураРеквизитов.Вставить("СтатьяОборотов", СтатьяОборотовНачисления);
		СтруктураРеквизитов.Вставить("Периодичность", ПериодичностьНачисления);
		СтруктураРеквизитов.Вставить("ДатаНачала", ДатаНачалаНачисления);
		СтруктураРеквизитов.Вставить("ДатаОкончания", ДатаОкончанияНачисления);
		СтруктураРеквизитов.Вставить("СуммаПриход", СуммаПриходНачисления);
		СтруктураРеквизитов.Вставить("СуммаНДСПриход", СуммаНДСПриходНачисления);
		СтруктураРеквизитов.Вставить("СуммаРасход", СуммаРасходНачисления);
		СтруктураРеквизитов.Вставить("СуммаНДСРасход", СуммаНДСРасходНачисления);
		СтруктураРеквизитов.Вставить("СтавкаНДС", СтавкаНДСНачисления);
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

// Переносит значения параметров графика из структуры в объект.
//
Процедура ИзменитьЗначенияРеквизитовШапкиТаблицы(СтруктураРеквизитов, ИмяГрафика) Экспорт
	
	Если ИмяГрафика = "ГрафикПлатежей" Тогда
		СтатьяОборотов = СтруктураРеквизитов.СтатьяОборотов;
		Периодичность = СтруктураРеквизитов.Периодичность;
		ДатаНачала = СтруктураРеквизитов.ДатаНачала;
		ДатаОкончания = СтруктураРеквизитов.ДатаОкончания;
		СуммаПриход = СтруктураРеквизитов.СуммаПриход;
		СуммаНДСПриход = СтруктураРеквизитов.СуммаНДСПриход;
		СуммаРасход = СтруктураРеквизитов.СуммаРасход;
		СуммаНДСРасход = СтруктураРеквизитов.СуммаНДСРасход;
		СтавкаНДС = СтруктураРеквизитов.СтавкаНДС;
	Иначе
		СтатьяОборотовНачисления = СтруктураРеквизитов.СтатьяОборотов;
		ПериодичностьНачисления = СтруктураРеквизитов.Периодичность;
		ДатаНачалаНачисления = СтруктураРеквизитов.ДатаНачала;
		ДатаОкончанияНачисления = СтруктураРеквизитов.ДатаОкончания;
		СуммаПриходНачисления = СтруктураРеквизитов.СуммаПриход;
		СуммаНДСПриходНачисления = СтруктураРеквизитов.СуммаНДСПриход;
		СуммаРасходНачисления = СтруктураРеквизитов.СуммаРасход;
		СуммаНДСРасходНачисления = СтруктураРеквизитов.СуммаНДСРасход;
		СтавкаНДСНачисления = СтруктураРеквизитов.СтавкаНДС;
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует структуру значений для заполнения строк графика платежей.
//
// Параметры:
//   Нет.
//  
// Возвращаемое значение:
//   Структура.
//
Функция СформироватьСтруктуруДанныхГрафика(ИмяГрафика) Экспорт
	
	СтруктураДанных = Новый Структура;
	
	Если ИмяГрафика = "ГрафикПлатежей" Тогда
		
		Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
			СтавкаНДС = бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.БезНДС);	
		КонецЕсли; 
		
		СтруктураДанных.Вставить("СтатьяОборотов", СтатьяОборотов);
		СтруктураДанных.Вставить("СтавкаНДС"     , СтавкаНДС);
		
	Иначе
		
		Если Не ЗначениеЗаполнено(СтавкаНДСНачисления) Тогда
			СтавкаНДСНачисления = бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.БезНДС);	
		КонецЕсли;
		
		СтруктураДанных.Вставить("СтатьяОборотовНачисления", СтатьяОборотовНачисления);
		СтруктураДанных.Вставить("СтавкаНДС"     , СтавкаНДСНачисления);
		
	КонецЕсли;

    СтруктураДанных.Вставить("ЦФО"                 , ЦФО);
    СтруктураДанных.Вставить("Проект"              , Проект);
	//СтруктураДанных.Вставить("НоменклатурнаяГруппа", НоменклатурнаяГруппа);

	МаксКолвоДопАналитик = бит_МеханизмДопИзмерений.ПолучитьМаксимальноеКоличествоДополнительныхИзмерений();
	Для н = 1 По МаксКолвоДопАналитик Цикл
		СтруктураДанных.Вставить("Аналитика_"+н, ЭтотОбъект["Аналитика_"+н]);
	КонецЦикла;
	Возврат СтруктураДанных;
	
КонецФункции

// Процедура формирует график.
//
Процедура СформироватьГрафик(ИмяГрафика, СпособЗаполнения="Пропорционально", ЗаменитьГрафик=Истина, СтруктураПараметров=Неопределено) Экспорт
	
	РеквизитыШапкиТаблицы = ПолучитьЗначенияРеквизитовШапкиТаблицы(ИмяГрафика);
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
	КонецЕсли;
	
	ЗначСтатьяОборотов = ?(СтруктураПараметров.Свойство("СтатьяОборотов"), СтруктураПараметров.СтатьяОборотов, Неопределено);
	ЗначРасходДоход    = ?(СтруктураПараметров.Свойство("РасходДоход"), СтруктураПараметров.РасходДоход, Неопределено);
	
	Если НЕ ЗаменитьГрафик Тогда
		// Если производится  добавление данных, а не замена - сохраним текущие строки.
		СохраненныеСтроки = ЭтотОбъект[ИмяГрафика].Выгрузить();	
	КонецЕсли;
	
	// Очистим график платежей.
	ЭтотОбъект[ИмяГрафика].Очистить();
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШапкиТаблицы.Периодичность) Тогда
		ТекстСообщения = НСтр("ru='Не заполнено значение реквизита ""Периодичность"".';en='Not filled value props ""Frequency"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		 
		Возврат;
	КонецЕсли;
	
	// Получим массив периодов.
	МассивПериодов = Документы.бит_ДополнительныеУсловияПоДоговору.ПолучитьМассивПериодов(
		РеквизитыШапкиТаблицы.Периодичность, РеквизитыШапкиТаблицы.ДатаНачала, РеквизитыШапкиТаблицы.ДатаОкончания);
	
	КоличествоПериодов = МассивПериодов.Количество();
	
	Если КоличествоПериодов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Сформируем структуру значений для заполнения строк графика.
	СтруктураДанных = СформироватьСтруктуруДанныхГрафика(ИмяГрафика);
	
	// При необходимости переопределим некоторые значения.
	Если НЕ ЗначСтатьяОборотов = Неопределено Тогда
		Если ИмяГрафика = "ГрафикНачислений" Тогда
			СтруктураДанных.Вставить("СтатьяОборотовНачисления", ЗначСтатьяОборотов);
		Иначе
			СтруктураДанных.Вставить("СтатьяОборотов", ЗначСтатьяОборотов);
		КонецЕсли;
	КонецЕсли;
	
	// Если сумма прихода не равна нулю, тогда сформируем график прихода.
	Если (ЗначРасходДоход = Неопределено ИЛИ ЗначРасходДоход = Перечисления.бит_РасходДоход.Поступление) 
		И НЕ РеквизитыШапкиТаблицы.СуммаПриход = 0 Тогда
		
		СтруктураДанных.Вставить("РасходДоход", Перечисления.бит_РасходДоход.Поступление);
		СтруктураДанных.Вставить("Сумма"	  , РеквизитыШапкиТаблицы.СуммаПриход);
		СтруктураДанных.Вставить("НДС"  	  , РеквизитыШапкиТаблицы.СуммаНДСПриход);
		
		// Заполним график прихода.
		Для Ном = 1 По КоличествоПериодов Цикл
			
			НовСтрока = ЭтотОбъект[ИмяГрафика].Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтруктураДанных);
			НовСтрока.Период = МассивПериодов[Ном - 1];
			Если СтруктураПараметров.Свойство("НазначениеПлатежа") Тогда
				НовСтрока.НазначениеПлатежа = СтруктураПараметров.НазначениеПлатежа;
			КонецЕсли;
			
		КонецЦикла;
		
		// Распределить суммы документа по графику.
		РаспределитьСуммыДокументаПоГрафику(ИмяГрафика, РеквизитыШапкиТаблицы, Перечисления.бит_РасходДоход.Поступление, СпособЗаполнения);
		
	КонецЕсли;
	
	// Если сумма расхода не равна нулю, тогда сформируем график расхода.
	Если (ЗначРасходДоход = Неопределено ИЛИ ЗначРасходДоход = Перечисления.бит_РасходДоход.Расходование) 
		И РеквизитыШапкиТаблицы.СуммаРасход <> 0 Тогда
		
		СтруктураДанных.Вставить("РасходДоход", Перечисления.бит_РасходДоход.Расходование);
		СтруктураДанных.Вставить("Сумма"	  , РеквизитыШапкиТаблицы.СуммаРасход);
		СтруктураДанных.Вставить("НДС"  	  , РеквизитыШапкиТаблицы.СуммаНДСРасход);
		
		// Заполним график расхода.
		Для Ном = 1 По КоличествоПериодов Цикл
			
			НовСтрока = ЭтотОбъект[ИмяГрафика].Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтруктураДанных);
			НовСтрока.Период = МассивПериодов[Ном - 1];
			Если СтруктураПараметров.Свойство("НазначениеПлатежа") Тогда
				НовСтрока.НазначениеПлатежа = СтруктураПараметров.НазначениеПлатежа;
			КонецЕсли;

		КонецЦикла;
		
		// Распределить суммы документа по графику начислений.
		РаспределитьСуммыДокументаПоГрафику(ИмяГрафика, РеквизитыШапкиТаблицы, Перечисления.бит_РасходДоход.Расходование, СпособЗаполнения);
		
	КонецЕсли;
	
	// Добавим ранее сохраненные строки.
	Если Не ЗаменитьГрафик Тогда	
		Для Каждого СтрокаСохр Из СохраненныеСтроки Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("РасходДоход", СтрокаСохр.РасходДоход);
			СтруктураОтбора.Вставить("Период", СтрокаСохр.Период);
			СтруктураОтбора.Вставить("СтавкаНДС", СтрокаСохр.СтавкаНДС);
			
			Если ИмяГрафика = "ГрафикПлатежей" Тогда
				СтруктураОтбора.Вставить("СтатьяОборотов", СтрокаСохр.СтатьяОборотов);
			Иначе	
				СтруктураОтбора.Вставить("СтатьяОборотовНачисления", СтрокаСохр.СтатьяОборотовНачисления);
			КонецЕсли;
			
			НайденныеСтроки = ЭтотОбъект[ИмяГрафика].НайтиСтроки(СтруктураОтбора); 
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтрока = ЭтотОбъект[ИмяГрафика].Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаСохр);
			Иначе
				НовСтрока = НайденныеСтроки[0];
				НовСтрока.Сумма = НовСтрока.Сумма + СтрокаСохр.Сумма;
				РассчитатьСуммуНДС(НовСтрока);
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	ЭтотОбъект[ИмяГрафика].Сортировать("Период");
	
	// Заменим период в шапке на актуальный.
	Если НЕ ЭтотОбъект[ИмяГрафика].Количество() = 0 Тогда
		НомерПоследнейСтроки = ЭтотОбъект[ИмяГрафика].Количество()-1;
		
		РеквизитыШапкиТаблицы.ДатаНачала    = ЭтотОбъект[ИмяГрафика][0].Период;
		РеквизитыШапкиТаблицы.ДатаОкончания = ЭтотОбъект[ИмяГрафика][НомерПоследнейСтроки].Период;
	КонецЕсли;
	
	ИзменитьЗначенияРеквизитовШапкиТаблицы(РеквизитыШапкиТаблицы, ИмяГрафика);
	
КонецПроцедуры

// Процедура распределяет суммы документа по графику начислений.
//
// Параметры:
//  Направление - ПеречислениеСсылка.бит_РасходДоход.
//  ВидРасчета  - Строка.
//
Процедура РаспределитьСуммыДокументаПоГрафику(ИмяГрафика, РеквизитыШапкиТаблицы, Направление, СпособЗаполнения = "Пропорционально") Экспорт
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("РасходДоход", Направление);
	
	СтрокиДляИзменения = ЭтотОбъект[ИмяГрафика].НайтиСтроки(СтруктураОтбора);
	
	Если СтрокиДляИзменения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Коэффициенты = Новый Массив;
		
	Если Направление = Перечисления.бит_РасходДоход.Расходование Тогда
		СуммаДокумента = РеквизитыШапкиТаблицы.СуммаРасход;
	Иначе
		СуммаДокумента = РеквизитыШапкиТаблицы.СуммаПриход;
	КонецЕсли;
	
	Если СуммаДокумента <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВариантыСтавокНДС 		 = Новый Соответствие;	
	ИтогоКоэффициентов 		 = 0;
	РавномерноеРаспределение = Новый Массив;

	Для каждого СтрокаТаблицы Из СтрокиДляИзменения Цикл
		ВариантыСтавокНДС.Вставить(СтрокаТаблицы.СтавкаНДС);
		Коэффициенты.Добавить(СтрокаТаблицы.КоэффициентРаспределения);
		РавномерноеРаспределение.Добавить(1);
		ИтогоКоэффициентов = ИтогоКоэффициентов + СтрокаТаблицы.КоэффициентРаспределения;
	КонецЦикла;
	
	РаспределитьРавномерно = (СпособЗаполнения = "Пропорционально" 
						 ИЛИ СпособЗаполнения = "Периодическое заполнение"
						 ИЛИ СпособЗаполнения = "Распределение");
						 
	// Если в массиве не указана ни одна сумма. 
	// Тогда заполним суммы по умолчанию значением 1.
	// Для возможности равномерного распределения.
	// Суммы документа по строкам графика.
	Если ИтогоКоэффициентов = 0 ИЛИ РаспределитьРавномерно Тогда
		Коэффициенты = РавномерноеРаспределение; 		
	КонецЕсли;
		 
	СуммаДляРасчета = ?(СпособЗаполнения = "Периодическое заполнение", 
					СуммаДокумента * Коэффициенты.Количество(),
					СуммаДокумента);
					
	СуммаНДСКРаспредлению = 0;				
	Если Направление = Перечисления.бит_РасходДоход.Расходование Тогда
		РеквизитыШапкиТаблицы.СуммаРасход = СуммаДляРасчета;
		РассчитатьСуммуНДС(РеквизитыШапкиТаблицы, "СуммаРасход", "СуммаНДСРасход", , "СтавкаНДС");
		СуммаНДСКРаспредлению = РеквизитыШапкиТаблицы.СуммаНДСРасход;
	Иначе
		РеквизитыШапкиТаблицы.СуммаПриход = СуммаДляРасчета;
		РассчитатьСуммуНДС(РеквизитыШапкиТаблицы, "СуммаПриход", "СуммаНДСПриход", , "СтавкаНДС");
		СуммаНДСКРаспредлению = РеквизитыШапкиТаблицы.СуммаНДСПриход;
	КонецЕсли;
	
	РезультатСумма = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
						СуммаДляРасчета, Коэффициенты);

	Если ВариантыСтавокНДС.Количество() = 1 Тогда
		// Если ставки во всех строчках одинаковые, то сумму НДС документа
		// распределяю пропроционально суммам, что бы не было расхождений в итоге по колонке и сумме НДС документа.
		Если СуммаНДСКРаспредлению = 0 Тогда
			РезультатНДС = Новый Массив(Коэффициенты.Количество());
		Иначе	
			РезультатНДС = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
								СуммаНДСКРаспредлению, Коэффициенты);
		КонецЕсли;	
	КонецЕсли;					
	
	Счетчик = 0;
	Для Каждого СтрокаТаблицы Из СтрокиДляИзменения Цикл
		
		СтрокаТаблицы.Сумма = РезультатСумма[Счетчик];
		Если ВариантыСтавокНДС.Количество() = 1 Тогда
			СтрокаТаблицы.НДС  = РезультатНДС[Счетчик];
		Иначе	
			РассчитатьСуммуНДС(СтрокаТаблицы);
		КонецЕсли;
		
		СтрокаТаблицы.СуммаБезНДС = СтрокаТаблицы.Сумма - СтрокаТаблицы.НДС;
		Счетчик = Счетчик + 1;
	КонецЦикла;
    
КонецПроцедуры

// Процедура заполняет графики документа данными из договора.
//
// Параметры:
//  СтруктураПараметров - Структура.
//
Процедура СформироватьГрафикПоДоговору(СтруктураПараметров) Экспорт

	// График платежей
	СтатьяПроценты                = СтруктураПараметров.СтатьяПроценты;
	СтатьяТранш                   = СтруктураПараметров.СтатьяРасходованияПоступления;
	СтатьяОсновнойДолг            = СтруктураПараметров.СтатьяОсновнойДолг;
	СтатьяКомиссии                = СтруктураПараметров.СтатьяКомиссии;

	// график начислений
	СтатьяБДРПроценты             = СтруктураПараметров.СтатьяБДРПроценты;
	СтатьяБДРКомиссии             = СтруктураПараметров.СтатьяБДРКомиссии;

	Если ДоговорКонтрагента.ХарактерДоговора = Перечисления.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм Тогда
		
		НаправлениеОбщее = Перечисления.бит_РасходДоход.Расходование;
		НаправлениеТранш = Перечисления.бит_РасходДоход.Поступление;

		НаправлениеГрафикНачислений = Перечисления.бит_РасходДоход.Расходование;
		
	Иначе
		
		НаправлениеОбщее = Перечисления.бит_РасходДоход.Поступление;
		НаправлениеТранш = Перечисления.бит_РасходДоход.Расходование;

		НаправлениеГрафикНачислений = Перечисления.бит_РасходДоход.Поступление;

	КонецЕсли;
	
	СтруктураАналитик = Новый Структура;
	
	МаксКолвоДопАналитик = бит_МеханизмДопИзмерений.ПолучитьМаксимальноеКоличествоДополнительныхИзмерений();
	Для н = 1 По МаксКолвоДопАналитик Цикл
		СтруктураАналитик.Вставить("Аналитика_"+н, ЭтотОбъект["Аналитика_"+н]);
	КонецЦикла;

	// очистим графики если необходимо
	Если СтруктураПараметров.ЗагрузитьДобавить = "Загрузить" Тогда
		
		ГрафикПлатежей.Очистить();
		
		ГрафикНачислений.Очистить();

	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикТраншейКредитовИДепозитов.Период,
		|	СУММА(ГрафикТраншейКредитовИДепозитов.Сумма) КАК СуммаТранша,
		|	СУММА(0) КАК СуммаДолга,
		|	СУММА(0) КАК СуммаПроценты,
		|	СУММА(0) КАК СуммаКомиссии
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	РегистрСведений.ГрафикТраншейКредитовИДепозитов КАК ГрафикТраншейКредитовИДепозитов
		|ГДЕ
		|	ГрафикТраншейКредитовИДепозитов.ВариантГрафика.Используется = ИСТИНА
		|	И ГрафикТраншейКредитовИДепозитов.ВариантГрафика.Владелец = &ДоговорКредитовДепозитов
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикТраншейКредитовИДепозитов.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГрафикОплатКредитовИДепозитов.Период,
		|	СУММА(0),
		|	СУММА(ГрафикОплатКредитовИДепозитов.Сумма),
		|	СУММА(0),
		|	СУММА(0)
		|ИЗ
		|	РегистрСведений.ГрафикОплатКредитовИДепозитов КАК ГрафикОплатКредитовИДепозитов
		|ГДЕ
		|	ГрафикОплатКредитовИДепозитов.ВариантГрафика.Используется = ИСТИНА
		|	И ГрафикОплатКредитовИДепозитов.ВариантГрафика.Владелец = &ДоговорКредитовДепозитов
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикОплатКредитовИДепозитов.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГрафикОплатКредитовИДепозитов.Период,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(ГрафикОплатКредитовИДепозитов.Проценты),
		|	СУММА(0)
		|ИЗ
		|	РегистрСведений.ГрафикОплатКредитовИДепозитов КАК ГрафикОплатКредитовИДепозитов
		|ГДЕ
		|	ГрафикОплатКредитовИДепозитов.ВариантГрафика.Используется = ИСТИНА
		|	И ГрафикОплатКредитовИДепозитов.ВариантГрафика.Владелец = &ДоговорКредитовДепозитов
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикОплатКредитовИДепозитов.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГрафикОплатКредитовИДепозитов.Период,
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(0),
		|	СУММА(ГрафикОплатКредитовИДепозитов.Комиссия)
		|ИЗ
		|	РегистрСведений.ГрафикОплатКредитовИДепозитов КАК ГрафикОплатКредитовИДепозитов
		|ГДЕ
		|	ГрафикОплатКредитовИДепозитов.ВариантГрафика.Используется = ИСТИНА
		|	И ГрафикОплатКредитовИДепозитов.ВариантГрафика.Владелец = &ДоговорКредитовДепозитов
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикОплатКредитовИДепозитов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДанных.Период КАК Период,
		|	ТаблицаДанных.СуммаТранша,
		|	ТаблицаДанных.СуммаДолга,
		|	ТаблицаДанных.СуммаПроценты,
		|	ТаблицаДанных.СуммаКомиссии
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("ДоговорКредитовДепозитов", ДоговорКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СуммаТранша > 0 Тогда
			
			Направление = НаправлениеТранш;
			Статья      = СтатьяТранш;
			Сумма       = Выборка.СуммаТранша;
			
		ИначеЕсли Выборка.СуммаДолга > 0 Тогда

			Направление = НаправлениеОбщее;
			Статья      = СтатьяОсновнойДолг;
			Сумма       = Выборка.СуммаДолга;

		ИначеЕсли Выборка.СуммаПроценты > 0 Тогда
			
			Направление = НаправлениеОбщее;
			Статья      = СтатьяПроценты;
			Сумма       = Выборка.СуммаПроценты;

		ИначеЕсли Выборка.СуммаКомиссии > 0 Тогда
			
			Направление = НаправлениеОбщее;
			Статья      = СтатьяКомиссии;
			Сумма       = Выборка.СуммаКомиссии;

		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = ГрафикПлатежей.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураАналитик);
		
		НоваяСтрока.Период         = Выборка.Период;
		НоваяСтрока.ЦФО            = ЦФО;
		НоваяСтрока.Проект         = Проект;
		НоваяСтрока.РасходДоход    = Направление;
		НоваяСтрока.Сумма          = Сумма;
		
		Если ЗначениеЗаполнено(СтатьяТранш) Тогда
			НоваяСтрока.СтатьяОборотов = Статья;
			НоваяСтрока.СтавкаНДС      = Статья.СтавкаНДС;
			
			СтавкаНДСРасчет = бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(Статья.СтавкаНДС);
			
			СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Сумма, Истина, Истина,СтавкаНДСРасчет);
			НоваяСтрока.НДС         = СуммаНДС;
			НоваяСтрока.СуммаБезНДС = Сумма - СуммаНДС;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьГрафикНачисленийПоДоговору(СтатьяБДРПроценты, СтатьяБДРКомиссии, НаправлениеГрафикНачислений, СтруктураАналитик);
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеДокументовПланирования

// Функция формирует дерево документов планирования.
//
// Возвращаемое значение:
//	ДеревоЗначений.	
//
Функция ДокументыПланирования() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования КАК ДокументПланированияСсылка,
	|	ТИПЗНАЧЕНИЯ(бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования) КАК ТипДокумента,
	|	""Заявка на расходование ДС"" КАК ВидДокумента
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей
	|ГДЕ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.Ссылка = &ТекущийДокумент
	|	И НЕ бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования В (&МассивПустыхСсылок)
	|	И бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования.ВидПлана = ЗНАЧЕНИЕ(перечисление.бит_кзн_ВидыПланов.План)
	|	И бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования ССЫЛКА Документ.бит_кзн_ЗаявкаНаРасходованиеСредств
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования,
	|	ТИПЗНАЧЕНИЯ(бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования,
	|	ТИПЗНАЧЕНИЯ(бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования),
	|	""Планируемое поступление""
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей
	|ГДЕ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.Ссылка = &ТекущийДокумент
	|	И НЕ бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования В (&МассивПустыхСсылок)
	|	И бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования.ВидПлана = ЗНАЧЕНИЕ(перечисление.бит_кзн_ВидыПланов.План)
	|	И бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования ССЫЛКА Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования,
	|	ТИПЗНАЧЕНИЯ(бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования,
	|	ТИПЗНАЧЕНИЯ(бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования),
	|	""Прогноз платежа""
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей
	|ГДЕ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.Ссылка = &ТекущийДокумент
	|	И НЕ бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования В (&МассивПустыхСсылок)
	|	И бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования.ВидПлана = ЗНАЧЕНИЕ(перечисление.бит_кзн_ВидыПланов.Прогноз)
	|	И бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования ССЫЛКА Документ.бит_кзн_ЗаявкаНаРасходованиеСредств
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования,
	|	ТИПЗНАЧЕНИЯ(бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования,
	|	ТИПЗНАЧЕНИЯ(бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования),
	|	""Прогноз поступления""
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей
	|ГДЕ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.Ссылка = &ТекущийДокумент
	|	И НЕ бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования В (&МассивПустыхСсылок)
	|	И бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования.ВидПлана = ЗНАЧЕНИЕ(перечисление.бит_кзн_ВидыПланов.Прогноз)
	|	И бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования ССЫЛКА Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования,
	|	ТИПЗНАЧЕНИЯ(бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей.ДокументПланирования)
	|ИТОГИ ПО
	|	ВидДокумента";
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	
	МассивПустыхСсылок = Новый Массив;
	МассивПустыхСсылок.Добавить(Неопределено);
	
	МетаОбъектТабЧасти = ЭтотОбъект.Метаданные().ТабличныеЧасти;
	
	МетаРеквизитыПлатежей = МетаОбъектТабЧасти.ГрафикПлатежей.Реквизиты; 
	Для Каждого ТекущийТип Из МетаРеквизитыПлатежей.ДокументПланирования.Тип.Типы() Цикл
		МассивТипов.Добавить(ТекущийТип);		
		Массив = Новый Массив;
		Массив.Добавить(ТекущийТип);
		ОписаниеТипа = Новый ОписаниеТипов(Массив);		
		МассивПустыхСсылок.Добавить(ОписаниеТипа.ПривестиЗначение());
	КонецЦикла;
	
	МетаРеквизитыНачислений = МетаОбъектТабЧасти.ГрафикНачислений.Реквизиты; 
	Для Каждого ТекущийТип Из МетаРеквизитыНачислений.ДокументПланирования.Тип.Типы() Цикл
		МассивТипов.Добавить(ТекущийТип);		
		Массив = Новый Массив;
		Массив.Добавить(ТекущийТип);
		ОписаниеТипа = Новый ОписаниеТипов(Массив);		
		МассивПустыхСсылок.Добавить(ОписаниеТипа.ПривестиЗначение());
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТекущийДокумент"	  , Ссылка);
	Запрос.УстановитьПараметр("МассивПустыхСсылок", МассивПустыхСсылок);
	
	Результат = Запрос.Выполнить();
	
	ДеревоДокументов = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДеревоДокументов.Колонки.Добавить("Выполнять"			, Новый ОписаниеТипов("Число"));
	ДеревоДокументов.Колонки.Добавить("ДокументПланирования", Новый ОписаниеТипов(МассивТипов));
	ДеревоДокументов.Колонки.Добавить("КартинкаПроведен");
	
	СтрокиКУдалению = Новый Массив;
	
	Для Каждого ТекущийУзел Из ДеревоДокументов.Строки Цикл
		// Для ролей ИсполнительКазначейства и ИсполнительПоЗаявкамНаЗатраты.
		// Могут отображаться битые ссылки в документах планирования.
		//ОбъектМета = Метаданные.НайтиПоТипу(ТекущийУзел.ТипДокумента);
		//Если НЕ ОбъектМета = Неопределено
		//	И НЕ ПравоДоступа("Просмотр", ОбъектМета) Тогда
		//	СтрокиКУдалению.Добавить(ТекущийУзел);
		//	Продолжить;
		//КонецЕсли;
		
		ТекущийУзел.ДокументПланирования = ТекущийУзел.ВидДокумента;
		Для Каждого ТекущаяСтрока Из ТекущийУзел.Строки Цикл
			ТекущаяСтрока.ДокументПланирования = ТекущаяСтрока.ДокументПланированияСсылка;		
			ДокументПланированияПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.ДокументПланирования,"Проведен");
			Если ДокументПланированияПроведен Тогда 	
				ТекущаяСтрока.КартинкаПроведен = БиблиотекаКартинок.ДокументПроведенКоннекторНиз;
			Иначе
				ТекущаяСтрока.КартинкаПроведен = БиблиотекаКартинок.ДокументЗаписанКоннекторНиз;
			КонецЕсли; 		
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из СтрокиКУдалению Цикл
		ДеревоДокументов.Строки.Удалить(ТекСтрока);
	КонецЦикла;
	
	Возврат ДеревоДокументов;
	
КонецФункции

Функция РеквизитыЗаполненыДляСозданияДокументовПланирования(ИмяГрафика, СтрокиКОбработке, РежимСообщений) Экспорт
    
    Отказ = Ложь;
    
    Заголовок = НСтр("ru='""%1"" - создание документов планирования:';en='""%1"" - the creation of planning documents:'");
    Заголовок = СтрШаблон(Заголовок, Строка(Ссылка));
    
    СтруктураОбязательныхПолей = Новый Структура;
    СтруктураОбязательныхПолей.Вставить("Организация");
    СтруктураОбязательныхПолей.Вставить("ВалютаДокумента");
	СтруктураОбязательныхПолей.Вставить("КурсДокумента");
	СтруктураОбязательныхПолей.Вставить("КратностьДокумента");
	
	ОтборСтрокРасхода = Новый Структура("РасходДоход", Перечисления.бит_РасходДоход.Расходование);
	ЗаписиРасходаЕсть = Не ЭтотОбъект[ИмяГрафика].НайтиСтроки(ОтборСтрокРасхода).Количество() = 0;
	
	// Если это поступление и вид договора контрагента "Прочее".
	Если ИмяГрафика = "ГрафикПлатежей" Тогда		
		СтруктураОбязательныхПолей.Вставить("Контрагент");
		СтруктураОбязательныхПолей.Вставить("ДоговорКонтрагента");
	КонецЕсли;
    
    бит_РаботаСМетаданными.ПроверитьЗаполнениеШапки(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Заполним массив обязательных полей в строках для создания документов планирования.
	СписокПолейДляПланирования = Новый Структура;
	СписокПолейДляПланирования.Вставить("Период"     , НСтр("ru='Период';en='Period'"));
	СписокПолейДляПланирования.Вставить("РасходДоход", НСтр("ru='Направление';en='Direction'"));
	СписокПолейДляПланирования.Вставить("ЦФО"        , НСтр("ru='ЦФО';en='Fin. Resp. Ctr.'"));
	СписокПолейДляПланирования.Вставить("Сумма"      , НСтр("ru='Сумма';en='Amount'"));
	СписокПолейДляПланирования.Вставить("СтавкаНДС"  , НСтр("ru='Ставка НДС';en='VAT Rate'"));
	
	Если ИмяГрафика = "ГрафикНачислений" Тогда
		СписокПолейДляПланирования.Вставить("СтатьяОборотовНачисления", НСтр("ru='Статья оборотов';en='Line Item'"));
	Иначе
		СписокПолейДляПланирования.Вставить("СтатьяОборотов", НСтр("ru='Статья оборотов';en='Line Item'"));
	КонецЕсли;	

	// Добавим обязательные измерения в список полей для планирования.
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	Для каждого КлючИЗначение Из НастройкиИзмерений Цикл		
		ИмяИзмерения = КлючИЗначение.Ключ;
		Настройка    = КлючИЗначение.Значение;		
		Если Настройка.Обязательное Тогда
			СписокПолейДляПланирования.Вставить(ИмяИзмерения, Настройка.Синоним);	
		КонецЕсли;		
	КонецЦикла;

	Для Каждого ТекущаяСтрока Из СтрокиКОбработке Цикл		
		Если НЕ ЗначенияВлияющиеНаФормированиеДокументаПланированияЗаполнены(ИмяГрафика, СписокПолейДляПланирования, ТекущаяСтрока, РежимСообщений) Тогда
			Отказ = Истина;
		КонецЕсли;		
	КонецЦикла;
	
    ЗначенияЗаполнены = НЕ Отказ;
    
    Возврат ЗначенияЗаполнены;
    
КонецФункции

// Процедура создает документы планирования по графику платежей.
//
// Параметры:
//  РежимЗаписи    - РежимЗаписиДокумента.
//  РежимСообщений - Строка: "Нет", "Все", "Ошибки".
//
Процедура СоздатьДокументыПланирования(ИмяГрафика, МассивСтрок, ВидДокументаПланирования, РежимЗаписи, РежимСообщений) Экспорт
    
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаГрафик = ЭтотОбъект[ИмяГрафика].ВыгрузитьКолонки();
	
	Для Каждого ТекущаяСтрока Из МассивСтрок Цикл
		НоваяСтрока = ТаблицаГрафик.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	НайденнаяКолонка = ТаблицаГрафик.Колонки.Найти("СтатьяОборотовНачисления");
	Если НайденнаяКолонка <> Неопределено Тогда
		НайденнаяКолонка.Имя = "СтатьяОборотов";
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("ВыбранныеСтроки"  , ТаблицаГрафик);
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	
	// Строки с одним периодом будем оформлять одним документом планирования.
	ТекстЗапроса = 
	"ВЫБРАТЬ
    |	ВыбранныеСтроки.НомерСтроки КАК НомерСтроки,
    |	ВыбранныеСтроки.Период КАК Период,
    |	ВыбранныеСтроки.РасходДоход КАК РасходДоход,
    |	ВыбранныеСтроки.ЦФО,
    |	ВыбранныеСтроки.СтатьяОборотов,
    |	ВыбранныеСтроки.Проект,
	|	ВыбранныеСтроки.Подразделение,
    |	ВыбранныеСтроки.Аналитика_1,
    |	ВыбранныеСтроки.Аналитика_2,
    |	ВыбранныеСтроки.Аналитика_3,
    |	ВыбранныеСтроки.Аналитика_4,
	|	ВыбранныеСтроки.Аналитика_5,
	|	ВыбранныеСтроки.Аналитика_6,
	|	ВыбранныеСтроки.Аналитика_7,
	|	ВыбранныеСтроки.Аналитика_8,
    |	ВыбранныеСтроки.Аналитика_9,
	|	ВыбранныеСтроки.Аналитика_10,
	|	ВыбранныеСтроки.Аналитика_11,
	|	ВыбранныеСтроки.Аналитика_12,
	|	&СверхБюджета КАК СверхБюджета,
	|	ВыбранныеСтроки.Сумма,
    |	ВыбранныеСтроки.СтавкаНДС,
    |	ВыбранныеСтроки.НДС,
    |	ВыбранныеСтроки.ДокументПланирования,
    |	ВыбранныеСтроки.СоставляющаяПлатежа,
    |	ВыбранныеСтроки.НазначениеПлатежа
    |ПОМЕСТИТЬ ВыбранныеСтроки
    |ИЗ
    |	&ВыбранныеСтроки КАК ВыбранныеСтроки
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ТаблицаГрафик.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаГрафик.Период >= &НачалоТекущегоДня
	|			ТОГДА ТаблицаГрафик.Период
	|		ИНАЧЕ &НачалоТекущегоДня
	|	КОНЕЦ КАК Период,
    |	ТаблицаГрафик.РасходДоход КАК РасходДоход,
    |	ТаблицаГрафик.ЦФО,
    |	ТаблицаГрафик.СтатьяОборотов,
    |	ТаблицаГрафик.Проект,
    |	ТаблицаГрафик.Аналитика_1,
    |	ТаблицаГрафик.Аналитика_2,
    |	ТаблицаГрафик.Аналитика_3,
    |	ТаблицаГрафик.Аналитика_4,
	|	ТаблицаГрафик.Аналитика_5,
	|	ТаблицаГрафик.Аналитика_6,
	|	ТаблицаГрафик.Аналитика_7,
	|	ТаблицаГрафик.Аналитика_8,
    |	ТаблицаГрафик.Аналитика_9,
	|	ТаблицаГрафик.Аналитика_10,
	|	ТаблицаГрафик.Аналитика_11,
	|	ТаблицаГрафик.Аналитика_12,
	|	ТаблицаГрафик.СверхБюджета КАК СверхБюджета,
    |	ТаблицаГрафик.Сумма,
    |	ТаблицаГрафик.СтавкаНДС,
    |	ТаблицаГрафик.НДС,
    |	ТаблицаГрафик.ДокументПланирования,
	|	ТаблицаГрафик.СоставляющаяПлатежа,
    |	ТаблицаГрафик.НазначениеПлатежа
    |ИЗ
    |	ВыбранныеСтроки КАК ТаблицаГрафик
    |
    |УПОРЯДОЧИТЬ ПО
    |	НомерСтроки
    |ИТОГИ ПО
	|	&СтрИтоги
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |УНИЧТОЖИТЬ ВыбранныеСтроки";
	
	Если НеОбъединятьДокументыПоДате И ИмяГрафика = "ГрафикПлатежей" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрИтоги", "РасходДоход");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрИтоги", "РасходДоход, Период, СверхБюджета");
	КонецЕсли;
	Если ИмяГрафика = "ГрафикПлатежей" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СверхБюджета", "ВыбранныеСтроки.СверхБюджета");
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СверхБюджета", "ЛОЖЬ");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
		
	РеквизитыШапки = НовыеДанныеЗаполненияДокументовПланирования();
	ЗаполнитьЗначенияСвойств(РеквизитыШапки, ЭтотОбъект);
	
	Если ИмяГрафика = "ГрафикПлатежей" Тогда
		РеквизитыШапки.ТипЗаявки = Перечисления.бит_ТипыЗаявокНаРасходованиеСредств.ГрафикПлатежей;
	Иначе
		РеквизитыШапки.ТипЗаявки = Перечисления.бит_ТипыЗаявокНаРасходованиеСредств.ГрафикНачислений;
	КонецЕсли;

	РеквизитыШапки.Дата						= ТекущаяДатаСеанса();
	РеквизитыШапки.ВидДокументаПланирования = ВидДокументаПланирования;
	РеквизитыШапки.Исполнитель				= Пользователи.ТекущийПользователь();
	РеквизитыШапки.Важность					= Перечисления.бит_Важность.Средняя;
	
	ВалютаРеглУчета	  = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, 
							"ВалютаВзаиморасчетов, ОплатаВВалюте");
	 
	РеквизитыШапки.ВалютаВзаиморасчетов = РеквизитыДоговора.ВалютаВзаиморасчетов;
	
	Если РеквизитыДоговора.ОплатаВВалюте ИЛИ РеквизитыДоговора.ВалютаВзаиморасчетов = ВалютаРеглУчета Тогда
		РеквизитыШапки.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа;
	Иначе	
		Если ВалютаДокумента = РеквизитыШапки.ВалютаВзаиморасчетов Тогда
			РеквизитыШапки.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов;
		Иначе	
			РеквизитыШапки.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа;
		КонецЕсли;	
	КонецЕсли;
	
	ВыборкаПоНаправлению = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "РасходДоход");    
	Пока ВыборкаПоНаправлению.Следующий() Цикл
		
		Если НеОбъединятьДокументыПоДате И ИмяГрафика = "ГрафикПлатежей" Тогда
			
			ВыборкаСтрок = ВыборкаПоНаправлению.Выбрать();						
			Пока ВыборкаСтрок.Следующий() Цикл
				
				МассивСтрокДляДокумента = Новый Массив;

				// Если не указан документ планирования и заполнены значения.
				Если Не ЗначениеЗаполнено(ВыборкаСтрок.ДокументПланирования) Тогда					
					ИндексСтроки = ВыборкаСтрок.НомерСтроки - 1;
					МассивСтрокДляДокумента.Добавить(ЭтотОбъект[ИмяГрафика][ИндексСтроки]);					
				КонецЕсли;
				
				РеквизитыШапки.ПараметрРасходДоход = ВыборкаСтрок.РасходДоход;
				РеквизитыШапки.ПараметрПериод 	   = ВыборкаСтрок.Период;
				
				// Создадим документ планирования.
				СоздатьДокументПланирования(МассивСтрокДляДокумента, РеквизитыШапки, РежимЗаписи, РежимСообщений);

			КонецЦикла;
			
		Иначе
			
			ВыборкаПоПериоду = ВыборкаПоНаправлению.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период");			
			Пока ВыборкаПоПериоду.Следующий() Цикл				
				
				ВыборкаСверхБюджета = ВыборкаПоПериоду.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СверхБюджета");
				Пока ВыборкаСверхБюджета.Следующий() Цикл
					
					МассивСтрокДляДокумента = Новый Массив;
					ВыборкаСтрок = ВыборкаСверхБюджета.Выбрать();
					Пока ВыборкаСтрок.Следующий() Цикл					
						// Если не указан документ планирования и заполнены значения.
						Если Не ЗначениеЗаполнено(ВыборкаСтрок.ДокументПланирования) Тогда						
							ИндексСтроки = ВыборкаСтрок.НомерСтроки - 1;
							МассивСтрокДляДокумента.Добавить(ЭтотОбъект[ИмяГрафика][ИндексСтроки]);						
						КонецЕсли;					
					КонецЦикла;
					
					РеквизитыШапки.ПараметрРасходДоход = ВыборкаПоПериоду.РасходДоход;
					РеквизитыШапки.ПараметрПериод 	   = ВыборкаПоПериоду.Период;
					
					// Создадим документ планирования.
					СоздатьДокументПланирования(МассивСтрокДляДокумента, РеквизитыШапки, РежимЗаписи, РежимСообщений);
				КонецЦикла;
				
			КонецЦикла;
				
		КонецЕсли;
		
	КонецЦикла;
    
	// Если были добавлены ссылки на документы планирования в табличную часть "Графики платежей".
	Если Модифицированность() Тогда
		// Запишем документ.
		бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ЭтотОбъект, РежимЗаписиДокумента.Запись,, "Ошибки")
	КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область РаботаСФинансовымиГрафиками

Функция ЭлементыФинДоговораДоступны() Экспорт
	
	Результат = Ложь;
	Если ПолучитьФункциональнуюОпцию("бит_УУ")
		И ЗначениеЗаполнено(ДоговорКонтрагента) 
		И (ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		ИЛИ ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"))
		И (ДоговорКонтрагента.бит_НаправлениеДоговора = Справочники.бит_НаправленияДоговоров.Финансовый
		ИЛИ ДоговорКонтрагента.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.КредитыПолученные
		ИЛИ ДоговорКонтрагента.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыВыданные
		ИЛИ ДоговорКонтрагента.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыПолученные) Тогда
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;							
	
КонецФункции

// Функция получает периодичность выплат по составляющей платежа ОсновнойДолг.
//
// Возвращаемое значение:
//	ПериодичностьОсновногоДолга.
//
Функция ПолучитьПериодичностьСоставляющейОсновнойДолг() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договор",				ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ТипПлатежаОснДолг",		Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.ОсновнойДолг);
	Запрос.УстановитьПараметр("ПараметрПериодичность",	ПланыВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров.Периодичность);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЗначенияПараметровФинансовыхДоговоров.ДоговорКонтрагента,
	|	бит_ЗначенияПараметровФинансовыхДоговоров.СоставляющаяПлатежа,
	|	бит_ЗначенияПараметровФинансовыхДоговоров.Параметр,
	|	бит_ЗначенияПараметровФинансовыхДоговоров.ЗначениеПараметра
	|ИЗ
	|	РегистрСведений.бит_ЗначенияПараметровФинансовыхДоговоров КАК бит_ЗначенияПараметровФинансовыхДоговоров
	|ГДЕ
	|	бит_ЗначенияПараметровФинансовыхДоговоров.ДоговорКонтрагента = &Договор
	|	И бит_ЗначенияПараметровФинансовыхДоговоров.СоставляющаяПлатежа.ТипПлатежаПоФинДоговору = &ТипПлатежаОснДолг
	|	И бит_ЗначенияПараметровФинансовыхДоговоров.Параметр = &ПараметрПериодичность";
	
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();	
	Если Выборка.Следующий() Тогда
		ПериодичностьОсновногоДолга = Выборка.ЗначениеПараметра;
	Иначе
		ПериодичностьОсновногоДолга = Неопределено;
	КонецЕсли;
	
	Возврат ПериодичностьОсновногоДолга;
	
КонецФункции

// Процедура заполняет график выдачи траншей в документе.
//
Процедура ЗаполнитьГрафикВыдачиТраншей() Экспорт
	
	ГрафикВыдачиТраншей.Очистить();	
	
	Если НЕ ЭлементыФинДоговораДоступны() Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, "Дата, ДатаОкончанияДействия, бит_СуммаДоговора");
	
	Если НЕ ЗначениеЗаполнено(РеквизитыДоговора.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока						= ГрафикВыдачиТраншей.Добавить();
	НоваяСтрока.ДатаТранша			= РеквизитыДоговора.Дата;
	НоваяСтрока.ДатаПогашения		= РеквизитыДоговора.ДатаОкончанияДействия;
	НоваяСтрока.СуммаТранша			= РеквизитыДоговора.бит_СуммаДоговора;
	НоваяСтрока.МесяцПервогоПлатежа = ДобавитьМесяц(НоваяСтрока.ДатаТранша, 1);

	ПериодичностьПланирования = Перечисления.бит_ПериодичностьПланирования.Месяц;
	НоваяСтрока.ПредставлениеМесяцаПервогоПлатежа = бит_РаботаСДиалогамиКлиентСервер.СформироватьПредставлениеПериода(
														НоваяСтрока.МесяцПервогоПлатежа, ПериодичностьПланирования);	
	
	ПериодичностьОсновногоДолга = ПолучитьПериодичностьСоставляющейОсновнойДолг();
	КоличествоПериодов = Обработки.бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.РассчитатьКоличествоПериодовВыплат(
								ПериодичностьОсновногоДолга, НоваяСтрока.МесяцПервогоПлатежа, НоваяСтрока.ДатаПогашения);
	НоваяСтрока.КоличествоПериодовВыплат = КоличествоПериодов;
	
КонецПроцедуры

#КонецОбласти

// Функция определяет необходимо ли обязательно формировать движения документа.
//
// Возвращаемое значение:
//  Булево.
//
Функция ОбязательноФормироватьДвижения() Экспорт

	ЭтаОперацияДляАрендыОС = (ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоставщику
						 ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаАрендодателю);
						 
	ЭтоОперацияДляКредитовЗаймов = (ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоКредитам);                     
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда	
		ТипДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "бит_ТипДоговора");
		Если ЭтаОперацияДляАрендыОС И ТипДоговора = Справочники.бит_ТипыДоговоров.АрендаОС Тогда			
			ФормироватьДвижения = Истина;			
		ИначеЕсли ЭтоОперацияДляКредитовЗаймов
			    И (ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыПолученные
			       ИЛИ ТипДоговора = Справочники.бит_ТипыДоговоров.КредитыПолученные) Тогда				  
			ФормироватьДвижения = Истина;	    
		ИначеЕсли РасходДоход = Перечисления.бит_РасходДоход.Поступление 
			    И ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыВыданные Тогда				  
			ФормироватьДвижения = Истина;			
	    ИначеЕсли РасходДоход = Перечисления.бит_РасходДоход.Поступление  
		  	    И ТипДоговора = Справочники.бит_ТипыДоговоров.ЦенныеБумаги Тогда			
			ФормироватьДвижения = Истина;				  
		Иначе			
			ФормироватьДвижения = Ложь;			
		КонецЕсли;
	Иначе		
		ФормироватьДвижения = Ложь;		
	КонецЕсли;

	Возврат ФормироватьДвижения;
	
КонецФункции

// Функция готовит таблицы документа для проведения.
//
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТабЧасть.Объект 		  КАК Объект,
	|	ТабЧасть.Период 		  КАК Период,
	|	СУММА(ТабЧасть.Сумма) 	  КАК СуммаПлатежа
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ПообъектныйГрафикПлатежей КАК ТабЧасть
	|ГДЕ
	|	ТабЧасть.Ссылка = &Ссылка
    |
	|СГРУППИРОВАТЬ ПО
	|	ТабЧасть.Объект,
	|	ТабЧасть.Период
    |
	|УПОРЯДОЧИТЬ ПО
	|	Объект,
	|	Период
	|";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПоПообъектномуГрафикуПлатежей = РезультатЗапроса.Выгрузить();
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТабЧасть.Период       		КАК Период,
	|	СУММА(ТабЧасть.СуммаБезНДС) КАК СуммаПлатежа
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК ТабЧасть
	|ГДЕ
	|	ТабЧасть.Ссылка = &Ссылка
	|	И ТабЧасть.Период > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
    |
	|СГРУППИРОВАТЬ ПО
	|	ТабЧасть.Период
    |
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПоГрафикуПлатежей = РезультатЗапроса.Выгрузить();

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикПлатежей.Период КАК Период,
	|	ГрафикПлатежей.Ссылка.Сценарий,
	|	ГрафикПлатежей.ЦФО,
	|	ГрафикПлатежей.СтатьяОборотов,
	|	ГрафикПлатежей.СтатьяОборотов.ТипСтатьи КАК ТипСтатьи,
	|	ГрафикПлатежей.Ссылка.Контрагент КАК Контрагент,
	|	ГрафикПлатежей.Ссылка.ДоговорКонтрагента,
	|	ГрафикПлатежей.Проект,
	|	ГрафикПлатежей.Аналитика_1,
	|	ГрафикПлатежей.Аналитика_2,
	|	ГрафикПлатежей.Аналитика_3,
	|	ГрафикПлатежей.Аналитика_4,
	|	ГрафикПлатежей.Аналитика_5,
	|	ГрафикПлатежей.Аналитика_6,
	|	ГрафикПлатежей.Аналитика_7,
	|	ГрафикПлатежей.Аналитика_8,
	|	ГрафикПлатежей.Аналитика_9,
	|	ГрафикПлатежей.Аналитика_10,
	|	ГрафикПлатежей.Аналитика_11,
	|	ГрафикПлатежей.Аналитика_12,
	|	ГрафикПлатежей.СтавкаНДС,
	|	СУММА(ГрафикПлатежей.Сумма) КАК Сумма,
	|	СУММА(ГрафикПлатежей.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ГрафикПлатежей.НДС) КАК НДС,
	|	ГрафикПлатежей.РасходДоход,
	|	ГрафикПлатежей.СтатьяОборотов.РасходДоход КАК РасходДоходСтатьиОборотов
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК ГрафикПлатежей
	|ГДЕ
	|	ГрафикПлатежей.Ссылка = &Ссылка
	|	И ГрафикПлатежей.Период > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикПлатежей.Ссылка.Сценарий,
	|	ГрафикПлатежей.ЦФО,
	|	ГрафикПлатежей.СтатьяОборотов,
	|	ГрафикПлатежей.СтавкаНДС,
	|	ГрафикПлатежей.Проект,
	|	ГрафикПлатежей.Ссылка.ДоговорКонтрагента,
	|	ГрафикПлатежей.Аналитика_1,
	|	ГрафикПлатежей.Аналитика_2,
	|	ГрафикПлатежей.Аналитика_3,
	|	ГрафикПлатежей.Аналитика_4,
	|	ГрафикПлатежей.Аналитика_5,
	|	ГрафикПлатежей.Аналитика_6,
	|	ГрафикПлатежей.Аналитика_7,
	|	ГрафикПлатежей.Аналитика_8,
	|	ГрафикПлатежей.Аналитика_9,
	|	ГрафикПлатежей.Аналитика_10,
	|	ГрафикПлатежей.Аналитика_11,
	|	ГрафикПлатежей.Аналитика_12,
	|	ГрафикПлатежей.Ссылка.Контрагент,
	|	ГрафикПлатежей.РасходДоход,
	|	ГрафикПлатежей.Период,
	|	ГрафикПлатежей.СтатьяОборотов.ТипСтатьи,
	|	ГрафикПлатежей.СтатьяОборотов.РасходДоход
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГрафикНачислений.Период,
	|	ГрафикНачислений.Ссылка.Сценарий,
	|	ГрафикНачислений.ЦФО,
	|	ГрафикНачислений.СтатьяОборотовНачисления,
	|	ГрафикНачислений.СтатьяОборотовНачисления.ТипСтатьи,
	|	ГрафикНачислений.Ссылка.Контрагент,
	|	ГрафикНачислений.Ссылка.ДоговорКонтрагента,
	|	ГрафикНачислений.Проект,
	|	ГрафикНачислений.Аналитика_1,
	|	ГрафикНачислений.Аналитика_2,
	|	ГрафикНачислений.Аналитика_3,
	|	ГрафикНачислений.Аналитика_4,
	|	ГрафикНачислений.Аналитика_5,
	|	ГрафикНачислений.Аналитика_6,
	|	ГрафикНачислений.Аналитика_7,
	|	ГрафикНачислений.Аналитика_8,
	|	ГрафикНачислений.Аналитика_9,
	|	ГрафикНачислений.Аналитика_10,
	|	ГрафикНачислений.Аналитика_11,
	|	ГрафикНачислений.Аналитика_12,
	|	ГрафикНачислений.СтавкаНДС,
	|	СУММА(ГрафикНачислений.Сумма),
	|	СУММА(ГрафикНачислений.СуммаБезНДС),
	|	СУММА(ГрафикНачислений.НДС),
	|	ГрафикНачислений.РасходДоход,
	|	ГрафикНачислений.СтатьяОборотовНачисления.РасходДоход
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикНачислений КАК ГрафикНачислений
	|ГДЕ
	|	ГрафикНачислений.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикНачислений.Период,
	|	ГрафикНачислений.Ссылка.Сценарий,
	|	ГрафикНачислений.Ссылка.ДоговорКонтрагента,
	|	ГрафикНачислений.ЦФО,
	|	ГрафикНачислений.РасходДоход,
	|	ГрафикНачислений.СтатьяОборотовНачисления,
	|	ГрафикНачислений.Ссылка.Контрагент,
	|	ГрафикНачислений.Проект,
	|	ГрафикНачислений.СтавкаНДС,
	|	ГрафикНачислений.Аналитика_1,
	|	ГрафикНачислений.Аналитика_2,
	|	ГрафикНачислений.Аналитика_3,
	|	ГрафикНачислений.Аналитика_4,
	|	ГрафикНачислений.Аналитика_5,
	|	ГрафикНачислений.Аналитика_6,
	|	ГрафикНачислений.Аналитика_7,
	|	ГрафикНачислений.Аналитика_8,
	|	ГрафикНачислений.Аналитика_9,
	|	ГрафикНачислений.Аналитика_10,
	|	ГрафикНачислений.Аналитика_11,
	|	ГрафикНачислений.Аналитика_12,
	|	ГрафикНачислений.СтатьяОборотовНачисления.ТипСтатьи,
	|	ГрафикНачислений.СтатьяОборотовНачисления.РасходДоход
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПоГрафикамДоговоров = РезультатЗапроса.Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.Ссылка КАК Ссылка,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.Ссылка.Организация КАК Организация,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.Ссылка.Контрагент КАК Контрагент,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.ДатаТранша КАК Период,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.ДатаТранша КАК ДатаТранша,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.ДатаПогашения КАК ДатаПогашения,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.СуммаТранша КАК Сумма,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.МесяцПервогоПлатежа КАК МесяцПервогоПлатежа,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.КоличествоПериодовВыплат КАК КоличествоПериодовВыплат
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикВыдачиТраншей КАК бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей
	|ГДЕ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПоГрафикуВыдачиТраншей = РезультатЗапроса.Выгрузить();
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ТаблицаПоПообъектномуГрафикуПлатежей", ТаблицаПоПообъектномуГрафикуПлатежей);
	СтруктураТаблиц.Вставить("ТаблицаПоГрафикуПлатежей"			   , ТаблицаПоГрафикуПлатежей);
	СтруктураТаблиц.Вставить("ТаблицаПоГрафикамДоговоров"		   , ТаблицаПоГрафикамДоговоров);
	СтруктураТаблиц.Вставить("ТаблицаПоГрафикуВыдачиТраншей"	   , ТаблицаПоГрафикуВыдачиТраншей);
	
	Возврат СтруктураТаблиц;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Общие

Процедура ЗаполнитьШапкуДокумента(ОбъектКопирования = Неопределено)
	
	// Заполним шапку значениями по-умолчанию.
	ТекущийПользователь = Пользователи.ТекущийПользователь();
		
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
	ИзменениеВалюты();
	
	Если ОбъектКопирования = Неопределено Тогда
		// ++ ЕРП25 - СтавкаНДС.
		СтавкаНДСПоУмолчанию = бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
		СтавкаНДС 			= СтавкаНДСПоУмолчанию;
		СтавкаНДСНачисления = СтавкаНДСПоУмолчанию;
		// -- ЕРП25
	Иначе
		ПроектДоговора 			  = Неопределено;
		СверхБюджета 			  = Ложь;
		НеКонтролироватьПоБюджету = Ложь;		
	КонецЕсли;
	
	СуммаВключаетНДС = Истина;
	
	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		Периодичность = Перечисления.бит_ПериодичностьПланирования.Месяц;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПериодичностьНачисления) Тогда
		ПериодичностьНачисления = Перечисления.бит_ПериодичностьПланирования.Месяц;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = ТекущаяДатаСеанса();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = КонецГода(ДатаНачала);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачалаНачисления) Тогда
		ДатаНачалаНачисления = ТекущаяДатаСеанса();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияНачисления) Тогда
		ДатаОкончанияНачисления = КонецГода(ДатаНачалаНачисления);
	КонецЕсли;
		
	// Заполнить реквизиты значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, ТекущийПользователь, ОбъектКопирования);

	// Инициализируем значения доп. измерений.
	ДопИзмерения	   = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним");
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	бит_МеханизмДопИзмерений.ИнициализироватьЗначенияДопИзмерений(ЭтотОбъект, ДопИзмерения, НастройкиИзмерений);
	
КонецПроцедуры

// Процедура проверяет равенство итоговых сумм по пообъектному графику платежей.
// И основному графику платежей.
//
// Параметры:
//  СтруктураТаблиц - ТаблицаЗначений.
//
Процедура ПроверитьРавенстроСумм(СтруктураТаблиц)

	Если бит_ОбщегоНазначения.ЭтоУТ() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаОперацияДляАрендыОС = (ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоставщику
                         ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаАрендодателю);
	ТипДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "бит_ТипДоговора");
	
	Если (ТипДоговора = Справочники.бит_ТипыДоговоров.АрендаОС И ЭтаОперацияДляАрендыОС) 
		ИЛИ (ТипДоговора = Справочники.бит_ТипыДоговоров.ЦенныеБумаги 
		     И РасходДоход = Перечисления.бит_РасходДоход.Поступление) Тогда
			
		ТаблицаПоОсновному    = СтруктураТаблиц.ТаблицаПоГрафикуПлатежей;
		ТаблицаПоПообъектному = СтруктураТаблиц.ТаблицаПоПообъектномуГрафикуПлатежей;
		
		СуммаПоОсновному    = ТаблицаПоОсновному.Итог("СуммаПлатежа");
		СуммаПоПообъектному = ТаблицаПоПообъектному.Итог("СуммаПлатежа");
		
		Если СуммаПоОсновному <> СуммаПоПообъектному Тогда
			ТестСуммаПоОсновному    = Формат(СуммаПоОсновному   , "ЧЦ=15; ЧДЦ=2; ЧН=0");
			ТестСуммаПоПообъектному = Формат(СуммаПоПообъектному, "ЧЦ=15; ЧДЦ=2; ЧН=0");
			ТекстСообщения = НСтр("ru='Итоговая сумма без НДС пообъектного графика ""%1"" не равна итоговой сумме без ндс графика платежей ""%2"".';
								  |en='The total amount of VAT poobektnogo schedule ""%1"" does not equal the total amount of VAT payment schedule ""%2"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТестСуммаПоПообъектному, ТестСуммаПоОсновному); 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Функция определяет таблицу-источник проводок.
// Если источник не определен - отказ от проведения.
//  
// Возвращаемое значение:
//   Строка ("ИзПообъектногоГрафика" или "ИзОбщегоГрафика").
//
Функция ОпределитьИсточникПроводок()
	
	ЭтаОперацияДляАрендыОС       = ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоставщику
							   ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаАрендодателю;
	ЭтоОперацияДляКредитовЗаймов = ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоКредитам;
	
	ТипДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "бит_ТипДоговора");
	
    Если ЭтаОперацияДляАрендыОС И ТипДоговора = Справочники.бит_ТипыДоговоров.АрендаОС Тогда
		
		ИсточникПроводок = "ИзПообъектногоГрафика";
		
	ИначеЕсли ЭтоОперацияДляКредитовЗаймов
		И (ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыПолученные
			ИЛИ ТипДоговора = Справочники.бит_ТипыДоговоров.КредитыПолученные) Тогда
		
		ИсточникПроводок = "ИзОбщегоГрафика";
    
    
	ИначеЕсли РасходДоход = Перечисления.бит_РасходДоход.Поступление 
		И ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыВыданные Тогда
		
		ИсточникПроводок = "ИзОбщегоГрафика";
		
	ИначеЕсли РасходДоход = Перечисления.бит_РасходДоход.Поступление
		И ТипДоговора = Справочники.бит_ТипыДоговоров.ЦенныеБумаги Тогда
		
		ИсточникПроводок = "ИзПообъектногоГрафика";			
		
	ИначеЕсли ФормироватьДвижения Тогда
		
		ИсточникПроводок = "ИзОбщегоГрафика";
		
	Иначе	
		
		ИсточникПроводок = "";
		
	КонецЕсли;
	
	Возврат ИсточникПроводок;
	
КонецФункции

Функция ПроверитьТЧГрафикПлатежей()

	Результат = Ложь;
	
	Для Каждого Стр Из ГрафикПлатежей Цикл
		Если ЗначениеЗаполнено(Стр.Событие) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

// Функция проверяет заполненность обязательных значений для создания документа планирования. 
//
// Параметры:
//  ИмяГрафика - Строка - имя графика.
//  СписокПолей - Структура.
//  СтрокаСДанными - СтрокаТабличнойЧасти - ВыборкаИзРезультатаЗапроса.
//  РежимСообщений - Строка - "Нет", "Все", "Ошибки".
//
// Возвращаемое значение:
//  Булево.
//
Функция ЗначенияВлияющиеНаФормированиеДокументаПланированияЗаполнены(ИмяГрафика, СписокПолей, СтрокаСДанными, РежимСообщений)
    
    ЗначенияЗаполнены = Истина;
	
	НазваниеТабличнойЧасти = "";
	Если ИмяГрафика = "ГрафикПлатежей" Тогда
		НазваниеТабличнойЧасти = НСтр("ru='График платежей';en='Payment Schedule'");
	Иначе  
        НазваниеТабличнойЧасти = НСтр("ru='График начислений';en='Accrual Schedule'");
	КонецЕсли;
	
    Заголовок = НСтр("ru='Создание документа планирования для строки номер ""%1"" табличной части %2:';
					 |en='Creating a planning document for the line number ""%1"" of the table %2:'");
	Заголовок = СтрШаблон(Заголовок, СтрокаСДанными.НомерСтроки, НазваниеТабличнойЧасти);
	
    СтрокаНачСообщения = НСтр("ru='В строке номер ""%1"" табличной части %2: Не заполнено значение реквизита ""';
							  |en='Detail value in line number ""%1"" of the table %2 is empty'");
	СтрокаНачСообщения = СтрШаблон(СтрокаНачСообщения, СтрокаСДанными.НомерСтроки, НазваниеТабличнойЧасти);
			
    Для Каждого КлючЗначение Из СписокПолей Цикл
        
        Если Не ЗначениеЗаполнено(СтрокаСДанными[КлючЗначение.Ключ]) Тогда
            
			Если РежимСообщений = "Все" Или РежимСообщений = "Ошибки" Тогда
				Если НЕ ПустаяСтрока(Заголовок) Тогда
					ОбщегоНазначения.СообщитьПользователю(Заголовок);
					Заголовок = "";		
				КонецЕсли;
				ОбщегоНазначения.СообщитьПользователю(СтрокаНачСообщения + КлючЗначение.Значение + """.");
			КонецЕсли;
            ЗначенияЗаполнены = Ложь;
        КонецЕсли;
    КонецЦикла;
	
    Возврат ЗначенияЗаполнены;
    
КонецФункции

Процедура ПроверкаЗаполнения(Отказ)
	
	// Реквизиты табличной части "Пообъектный график платежей".
	НайденнаяСтрока = ПообъектныйГрафикПлатежей.Найти(Дата("00010101"), "Период");
	
	Если НЕ НайденнаяСтрока = Неопределено Тогда
		ТекстСообщения = НСтр("ru='В пообъектном графике платежей присутствуют строки с незаполненным периодом';
							  |en='By-object payment schedule has lines with empty period'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	Для Каждого СтрокаОбъекта Из ПообъектныйГрафикПлатежей Цикл
		Если Не ЗначениеЗаполнено(СтрокаОбъекта.Объект) Тогда
			ТекстСообщения = НСтр("ru='В пообъектном графике платежей присутствуют группы с незаполненным объектом';
								  |en='By-object payment schedule has groups with empty object'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

// Процедура заполняет текущий документ в соответствии с переданным документом ПроектДоговора.
//
// Параметры:
//	Основание - ДокументСсылка.бит_ПроектДоговора.
//
Процедура ЗаполнитьНаОснованииДоговора(ДанныеЗаполнения)
	
	ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
	Организация 	   = ДоговорКонтрагента.Организация;
	Контрагент 		   = ДоговорКонтрагента.Контрагент;
	ЦФО 			   = ДоговорКонтрагента.бит_ЦФО;
	Проект 			   = ДоговорКонтрагента.бит_Проект;
	
	ИменаРеквизитов = Новый Массив; 
	ИменаРеквизитов.Добавить("ВалютаВзаиморасчетов");
	ИменаРеквизитов.Добавить("бит_КурсВзаиморасчетов");
	ИменаРеквизитов.Добавить("бит_КратностьВзаиморасчетов");
	ИменаРеквизитов.Добавить("бит_СуммаДоговора");
	ИменаРеквизитов.Добавить("бит_СуммаНДСВзаиморасчеты");
	ИменаРеквизитов.Добавить("бит_ОсновнаяСтатьяОборотов");
	ИменаРеквизитов.Добавить("бит_ОсновнаяСтатьяОборотовБДР");
	ИменаРеквизитов.Добавить("ТипДоговора");
	ИменаРеквизитов.Добавить("бит_ТипДоговора");
	
	Если ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
		ИменаРеквизитов.Добавить("ДатаПервогоТранша");
		ИменаРеквизитов.Добавить("ДатаПоследнегоПлатежа");
		ИменаРеквизитов.Добавить("ХарактерДоговора");
	Иначе
		ИменаРеквизитов.Добавить("ДатаНачалаДействия");
		ИменаРеквизитов.Добавить("ДатаОкончанияДействия");
	КонецЕсли;
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, СтрСоединить(ИменаРеквизитов, ","));
	
	ВалютаДокумента = РеквизитыДоговора.ВалютаВзаиморасчетов;
	Если ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		КурсДокумента	   = 1;
		КратностьДокумента = 1;
	Иначе
		КурсДокумента 	   = РеквизитыДоговора.бит_КурсВзаиморасчетов;
		КратностьДокумента = РеквизитыДоговора.бит_КратностьВзаиморасчетов;
	КонецЕсли;
	
	// Курс получаем на дату документа Доп.условия по договору.
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ТекущаяДатаСеанса());
	
	КурсВалютыДоговора = Новый Структура; 
	КурсВалютыДоговора.Вставить("Валюта", 	 РеквизитыДоговора.ВалютаВзаиморасчетов);
	КурсВалютыДоговора.Вставить("Курс", 	 РеквизитыДоговора.бит_КурсВзаиморасчетов);
	КурсВалютыДоговора.Вставить("Кратность", РеквизитыДоговора.бит_КратностьВзаиморасчетов);
	
	СуммаВзаиморасчеты 	  = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(РеквизитыДоговора.бит_СуммаДоговора, 
								КурсВалютыДоговора, КурсВалюты);
	СуммаНДСВзаиморасчеты = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(РеквизитыДоговора.бит_СуммаНДСВзаиморасчеты, 
								КурсВалютыДоговора, КурсВалюты);
	
	Если ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
																			
		// Заполним реквизиты связанные с видом договора.
		Если РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком
			ИЛИ РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.СКомитентом
			ИЛИ РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.Импорт
			ИЛИ РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком Тогда
						
			РасходДоход 			 = Перечисления.бит_РасходДоход.Расходование;
			СуммаРасход 			 = СуммаВзаиморасчеты;
			СуммаРасходНачисления 	 = СуммаВзаиморасчеты;
			СуммаНДСРасход			 = СуммаНДСВзаиморасчеты;
			СуммаНДСРасходНачисления = СуммаНДСВзаиморасчеты;
			
		ИначеЕсли РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем
			ИЛИ РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.СКомиссионером 
			ИЛИ РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.СДавальцем Тогда
						
			РасходДоход				 = Перечисления.бит_РасходДоход.Поступление;
			СуммаПриход 			 = СуммаВзаиморасчеты;
			СуммаПриходНачисления 	 = СуммаВзаиморасчеты;
			СуммаНДСПриход			 = СуммаНДСВзаиморасчеты;
			СуммаНДСПриходНачисления = СуммаНДСВзаиморасчеты;
		Иначе
			РасходДоход				 = Перечисления.бит_РасходДоход.Расходование;
			СуммаРасход 			 = СуммаВзаиморасчеты;
			СуммаРасходНачисления 	 = СуммаВзаиморасчеты;
			СуммаНДСРасход			 = СуммаНДСВзаиморасчеты;
			СуммаНДСРасходНачисления = СуммаНДСВзаиморасчеты;
		КонецЕсли;

	Иначе
					
		РасходДоход				 = Перечисления.бит_РасходДоход.Расходование;
		СуммаРасход 			 = СуммаВзаиморасчеты;
		СуммаРасходНачисления 	 = СуммаВзаиморасчеты;
		СуммаНДСРасход			 = СуммаНДСВзаиморасчеты;
		СуммаНДСРасходНачисления = СуммаНДСВзаиморасчеты;
	КонецЕсли;
	
	Периодичность 			= Перечисления.бит_ПериодичностьПланирования.Месяц;
	ПериодичностьНачисления = Перечисления.бит_ПериодичностьПланирования.Месяц;
	
	// Заполним статьи оборотов из договора.
	СтатьяОборотов = РеквизитыДоговора.бит_ОсновнаяСтатьяОборотов;
	Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
		СтавкаНДС = СтатьяОборотов.СтавкаНДС;
	КонецЕсли;
	
	СтатьяОборотовНачисления = РеквизитыДоговора.бит_ОсновнаяСтатьяОборотовБДР;
	Если ЗначениеЗаполнено(СтатьяОборотовНачисления) Тогда
		СтавкаНДСНачисления = СтатьяОборотовНачисления.СтавкаНДС;
	КонецЕсли;

	Если ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
		ДатаНачала    = РеквизитыДоговора.ДатаПервогоТранша;
		ДатаОкончания = РеквизитыДоговора.ДатаПоследнегоПлатежа;
	Иначе		
		ДатаНачала = РеквизитыДоговора.ДатаНачалаДействия;		
		Если ЗначениеЗаполнено(РеквизитыДоговора.ДатаОкончанияДействия) Тогда
			ДатаОкончания = РеквизитыДоговора.ДатаОкончанияДействия;
		ИначеЕсли ЗначениеЗаполнено(РеквизитыДоговора.ДатаНачалаДействия) Тогда
			ДатаОкончания = КонецГода(РеквизитыДоговора.ДатаНачалаДействия);
		Иначе
			ДатаОкончания = Дата("00010101");
		КонецЕсли;
	КонецЕсли;
	ДатаНачалаНачисления 	= ДатаНачала;
	ДатаОкончанияНачисления = ДатаОкончания;
	
	ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
	
	Если бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды() 
		И ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыАренды") Тогда
		
		ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаАрендодателю;
		РасходДоход 		  = Перечисления.бит_РасходДоход.Расходование;               
		
	ИначеЕсли ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
		
		РасходДоход = Перечисления.бит_РасходДоход.Расходование;
		
		Если РеквизитыДоговора.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.КредитыПолученные 
			ИЛИ РеквизитыДоговора.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыПолученные Тогда
			ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоКредитам;					
		ИначеЕсли РеквизитыДоговора.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыВыданные
			ИЛИ РеквизитыДоговора.ХарактерДоговора = Перечисления.ХарактерыДоговоровФинансовыхИнструментов.Депозит Тогда
			РасходДоход = Перечисления.бит_РасходДоход.Поступление;
		КонецЕсли;
		
	Иначе
		
		Если РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем 
		 ИЛИ РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.СКомиссионером
		 ИЛИ РеквизитыДоговора.ТипДоговора = Перечисления.ТипыДоговоров.СДавальцем Тогда
			
			ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПоступлениеОплатыОтКлиента;
			РасходДоход 		  = Перечисления.бит_РасходДоход.Поступление;
			
		Иначе 
			
			РасходДоход = Перечисления.бит_РасходДоход.Расходование;
			
			// Поиск хозяйственной операции в настройках пользователя.
			ОперацияпоУмолчанию = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
										ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнаяХозяйственнаяОперацияРасходДС);
			
			// Проверка доступности хозяйственной операции пользователю.								
			Если ЗначениеЗаполнено(ОперацияпоУмолчанию) Тогда
				ХозяйственнаяОперация = ОперацияпоУмолчанию;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьСтрокуВНаборЗначенийДоступа(ЗначениеДоступа, Таблица)
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = ЗначениеДоступа;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляОбеспеченияПроведенияДокументаСобытий

// Процедура записывает движения по регистру накопления бит_му_ФинансовыеГрафики.
//
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  СтруктураКурсыВалют     - Структура.
//  ИзПообъектного 			- Булево.
//
Процедура ДвижениеПоРегиструНакопленияФинансовыеГрафики(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, ИзПообъектного = Истина)

	Если бит_ОбщегоНазначения.ЭтоУТ() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзПообъектного Тогда		
		ТаблицаДанных = СтруктураТаблиц.ТаблицаПоПообъектномуГрафикуПлатежей;		
	Иначе		
		ТаблицаДанных = СтруктураТаблиц.ТаблицаПоГрафикуПлатежей;		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Организация"		 , СтруктураШапкиДокумента.Организация);
	СтруктураПараметров.Вставить("Валюта"			 , СтруктураШапкиДокумента.ВалютаДокумента);
	СтруктураПараметров.Вставить("Контрагент"		 , СтруктураШапкиДокумента.Контрагент);
	СтруктураПараметров.Вставить("ДоговорКонтрагента", СтруктураШапкиДокумента.ДоговорКонтрагента);
	
	НаборЗаписей = Движения.бит_му_ФинансовыеГрафики;
	НаборЗаписей.Записывать = Истина;
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить("СуммаПлатежаУпр");
	МассивИсключений.Добавить("СуммаПлатежаСценарий");
	
	Для Каждого ТекСтрокаГрафика Из ТаблицаДанных Цикл
		
		Запись = ТаблицаДвижений.Добавить();
		
		СтруктураПараметров.Вставить("Период"		, ТекСтрокаГрафика.Период);
		СтруктураПараметров.Вставить("СуммаПлатежа" , ТекСтрокаГрафика.СуммаПлатежа);
		Если ИзПообъектного Тогда
			СтруктураПараметров.Вставить("Объект"	, ТекСтрокаГрафика.Объект);
		Иначе
			СтруктураПараметров.Вставить("Объект"	, СтруктураШапкиДокумента.ДоговорКонтрагента);
		КонецЕсли;  		
		
        ЗаполнитьЗначенияСвойств(Запись, СтруктураПараметров);
				
		// Сформируем массив имен источника.
		МассивИмен = Новый Массив;
		МассивИмен.Добавить("СуммаПлатежа");
		
		// Выполним расчет сумм "Регламентного и управленческого учета".
		бит_КурсыВалют.ВыполнитьВалютныеПересчеты(СтруктураПараметров , Запись , МассивИмен,
												  СтруктураКурсыВалют , СтруктураКурсыВалют.Документ, МассивИсключений);	
		
	КонецЦикла;
	
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;
	НаборЗаписей.ДобавитьДвижение();
	
	ПараметрыФинИнструментов = Новый Структура;
	ПараметрыФинИнструментов.Вставить("СтавкаНДСПоДоговору", СтруктураШапкиДокумента.СтавкаНДС);
	
	НаборЗаписей = Движения.бит_му_ПараметрыФинИнструментов;
	
	бит_му_ФинИнструменты.ЗаписатьПараметры(НаборЗаписей, СтруктураШапкиДокумента, ПараметрыФинИнструментов);
	
КонецПроцедуры

// Процедура выполняет движения по регистрам.
//
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, ИсточникПроводок, СтруктураКурсыВалют, Отказ, Заголовок)
	
	Движения.бит_ГрафикиДоговоров.Записывать = Истина;
	
	Если ИсточникПроводок = "ИзПообъектногоГрафика" Тогда		
		ДвижениеПоРегиструНакопленияФинансовыеГрафики(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют);		
	ИначеЕсли ИсточникПроводок = "ИзОбщегоГрафика" Тогда		
		ДвижениеПоРегиструНакопленияФинансовыеГрафики(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, Ложь);		
	КонецЕсли;
	
	ТаблицаДвижений = Движения.бит_ГрафикиДоговоров.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить("СуммаВзаиморасчеты");
	МассивИсключений.Добавить("СуммаБезНДСВзаиморасчеты");
	
	// Сформируем массив имен источника.
	МассивИмен = Новый Массив;
	МассивИмен.Добавить("Сумма");
	МассивИмен.Добавить("СуммаБезНДС");
	
	Для каждого СтрокаТаблицы Из СтруктураТаблиц.ТаблицаПоГрафикамДоговоров Цикл
	
		НоваяСтрока = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
				
		// Выполним расчет сумм.
		бит_КурсыВалют.ВыполнитьВалютныеПересчеты(СтрокаТаблицы, НоваяСтрока, МассивИмен, СтруктураКурсыВалют, СтруктураКурсыВалют.Документ, МассивИсключений);
	КонецЦикла; 
	
	// Заполним измерение ДокументРегистратор, используемое для увеличения скорости работы отчетов по данному регистру.
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "ДокументРегистратор");
	
	Движения.бит_ГрафикиДоговоров.мТаблицаДвижений = ТаблицаДвижений;
	Движения.бит_ГрафикиДоговоров.ДобавитьДвижение();
	Движения.бит_ГрафикиДоговоров.Записать();
	
	бит_Договоры.ПровестиКонтрольСумм(ЭтотОбъект, Отказ);
	
	// Регистр накопления бит_ТраншиПоФинансовымДоговорам.	
	ТаблицаДвижений = Движения.бит_ТраншиПоФинансовымДоговорам.Выгрузить();
	ТаблицаДвижений.Очистить();	
	Для каждого СтрокаТаблицы Из СтруктураТаблиц.ТаблицаПоГрафикуВыдачиТраншей Цикл	
		НоваяСтрока = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);		
	КонецЦикла; 	
	Движения.бит_ТраншиПоФинансовымДоговорам.мТаблицаДвижений = ТаблицаДвижений;
	Движения.бит_ТраншиПоФинансовымДоговорам.ДобавитьДвижение();
	Движения.бит_ТраншиПоФинансовымДоговорам.Записывать = Истина;
	
	// -- NB ДвиженияПоРегиструКонтрольныхЗначений(СтруктураШапкиДокумента, СтруктураТаблиц.ТаблицаПоГрафикамДоговоров, Отказ, Заголовок);
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеДокументовПланирования

// Процедура выполняет запись/проведение/отмену проведения документа.
// 
// Параметры:
//  ТекущийОбъект  				- ДокументОбъект,СправочникОбъект.
//  РежимЗаписи    				- РежимЗаписиДокумента.
//  Заголовок      				- Строка.
//  РежимСообщений 				- Строка: "Нет","Все","Ошибки".
// 	ЗаписыватьПередПроведением 	- Булево.
// 	ОшибкиВЖурналРегистрации 	- Булево.
// 
// Возвращаемое значение:
//   Булево - действие выполнено.
// 
Функция ЗаписатьПровестиДокумент(ТекущийОбъект, РежимЗаписи, Заголовок = "", РежимСообщений = "Все", ЗаписыватьПередПроведением = Истина, ОшибкиВЖурналРегистрации = Ложь)

	ДействиеВыполнено  = Ложь;
	
	ВыводитьОшибки     = РежимСообщений = "Все" ИЛИ РежимСообщений = "Ошибки";
	ВыводитьИнформацию = РежимСообщений = "Все";
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ТекущийОбъект.ПроверитьЗаполнение() = Ложь Тогда
		ТекущийРежимЗаписи = РежимЗаписиДокумента.Запись;
	Иначе
		ТекущийРежимЗаписи = РежимЗаписи; 
	КонецЕсли;
	
	Если ТекущийРежимЗаписи = РежимЗаписиДокумента.Запись 
		ИЛИ (ТекущийРежимЗаписи = РежимЗаписиДокумента.Проведение И ЗаписыватьПередПроведением) Тогда
		Попытка			
			ТекущийОбъект.Записать(РежимЗаписиДокумента.Запись);
			ДействиеВыполнено = Истина;
			Если ВыводитьИнформацию Тогда
				ТекстСообщения = НСтр("ru='Записан документ ""%1"".';en='Written document ""%1"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийОбъект.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;			
		Исключение			
			ДействиеВыполнено = Ложь;						
			Если ВыводитьОшибки Тогда
				ТекстСообщения = НСтр("ru='Не удалось записать документ ""%1"". 
									  	  |%2';
									  |en='Could not write the document ""%1"". 
									  	  |%2'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийОбъект.Ссылка, ОписаниеОшибки());
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;			
			Если ОшибкиВЖурналРегистрации Тогда
				ИмяСобытияЖурнала = НСтр("ru='БИТ.ОшибкаЗаписиДокумента';en='BIT.OshibkaZapisiDokumenta'", ОбщегоНазначения.КодОсновногоЯзыка());
				ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала,УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);				
			КонецЕсли;			
		КонецПопытки;		
	КонецЕсли;	
	
	Если ТекущийРежимЗаписи = РежимЗаписиДокумента.Проведение Тогда		
		Попытка			
			ТекущийОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ДействиеВыполнено = Истина;
			Если ВыводитьИнформацию Тогда
				ТекстСообщения = НСтр("ru='Проведен документ ""%1"".';en='Held document ""%1"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийОбъект.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;			
		Исключение			
			ДействиеВыполнено = Ложь;						
			Если ВыводитьОшибки Тогда
				ТекстСообщения = НСтр("ru='Не удалось провести документ ""%1"".';en='Unable to carry out document ""%1"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийОбъект.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;			
			Если ОшибкиВЖурналРегистрации Тогда				
				ИмяСобытияЖурнала = НСтр("ru='БИТ.ОшибкаПроведенияДокумента';en='BIT.OshibkaProvedeniyaDokumenta'", ОбщегоНазначения.КодОсновногоЯзыка());
				ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);				
			КонецЕсли;			
		КонецПопытки;		
	КонецЕсли;

	Если ТекущийРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда		
		Попытка			
			ТекущийОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ДействиеВыполнено = Истина;
			Если ВыводитьИнформацию Тогда
				ТекстСообщения = НСтр("ru='Отменено проведение документа ""%1"".';en='Cancel the document ""%1"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийОбъект.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);				
			КонецЕсли;			
		Исключение			
			ДействиеВыполнено = Ложь;						
			Если ВыводитьОшибки Тогда
				ТекстСообщения = НСтр("ru='Не удалось отменить проведение документа ""%1"".';
									  |en='Failed to cancel the document ""%1"".'") + Символы.ПС + ОписаниеОшибки();
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийОбъект.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;		
		КонецПопытки;		
	КонецЕсли; 
	
	Возврат ДействиеВыполнено;
	
КонецФункции

Функция НовыеДанныеЗаполненияДокументовПланирования()
    
    ДанныеЗаполнения = Новый Структура;
	
	ДанныеЗаполнения.Вставить("ТипЗаявки");
    ДанныеЗаполнения.Вставить("Дата");
    ДанныеЗаполнения.Вставить("ФормаОплаты"); 
    ДанныеЗаполнения.Вставить("Важность");
    ДанныеЗаполнения.Вставить("Организация");
    ДанныеЗаполнения.Вставить("Сценарий");
    ДанныеЗаполнения.Вставить("Контрагент");
    ДанныеЗаполнения.Вставить("ДоговорКонтрагента");
	ДанныеЗаполнения.Вставить("Исполнитель");
    ДанныеЗаполнения.Вставить("Ответственный");
	ДанныеЗаполнения.Вставить("БанковскийСчетПолучателя");
    ДанныеЗаполнения.Вставить("ВидДокументаПланирования");
	ДанныеЗаполнения.Вставить("ПараметрРасходДоход");
	ДанныеЗаполнения.Вставить("ПараметрПериод");
	ДанныеЗаполнения.Вставить("ПланированиеСуммы");
    ДанныеЗаполнения.Вставить("ВалютаДокумента");
	ДанныеЗаполнения.Вставить("ВалютаВзаиморасчетов");
	ДанныеЗаполнения.Вставить("КурсЧислительВзаиморасчетов", 0);
	ДанныеЗаполнения.Вставить("КурсЗнаменательВзаиморасчетов", 0);
	ДанныеЗаполнения.Вставить("СуммаВзаиморасчетов", 0);
	ДанныеЗаполнения.Вставить("Подразделение");

    Возврат ДанныеЗаполнения;
    
КонецФункции

Процедура ЗаполнитьЗаявкуНаРасходДенежныхСредств(ПараметрыЗаполнения, РеквизитыШапки, РежимЗаписи, РежимСообщений)
	
	ДанныеЗаполнения = Новый Массив;
	
	Для каждого ТекСтрока Из ПараметрыЗаполнения Цикл
		Реквизиты = ОбщегоНазначения.СкопироватьРекурсивно(РеквизитыШапки); 
		Реквизиты.Вставить("Аналитика_1");
		Реквизиты.Вставить("Аналитика_2");
		Реквизиты.Вставить("Аналитика_3");
		Реквизиты.Вставить("Аналитика_4");
		Реквизиты.Вставить("Аналитика_5");
		Реквизиты.Вставить("Аналитика_6");
		Реквизиты.Вставить("Аналитика_7");
		Реквизиты.Вставить("Аналитика_8");
		Реквизиты.Вставить("Аналитика_9");
		Реквизиты.Вставить("Аналитика_10");
		Реквизиты.Вставить("Аналитика_11");
		Реквизиты.Вставить("Аналитика_12");
		Реквизиты.Вставить("СтавкаНДС");
		Реквизиты.Вставить("ЦФО");
		Реквизиты.Вставить("СтатьяОборотов");
  		Реквизиты.Вставить("НазначениеПлатежа");
		Реквизиты.Вставить("СверхБюджета");
		ЗаполнитьЗначенияСвойств(Реквизиты, ТекСтрока);

		Реквизиты.Вставить("ДокументОснование", 		Ссылка);
		Реквизиты.Вставить("ВидПлана",					РеквизитыШапки.ВидДокументаПланирования);
		Реквизиты.Вставить("ХозяйственнаяОперация",		ХозяйственнаяОперация);
   		Реквизиты.Вставить("ДатаПлан",					РеквизитыШапки.ПараметрПериод);
		Реквизиты.Вставить("НазначениеПлатежаУпр",		ТекСтрока.НазначениеПлатежа);
		Реквизиты.Вставить("СуммаДокумента",			ТекСтрока.Сумма);
		Реквизиты.Вставить("ДоговорАренды",			ДоговорКонтрагента);
		Реквизиты.Вставить("ДоговорКредитаДепозита",	ДоговорКонтрагента);
		Реквизиты.Вставить("ДоговорСЗаказчиком",		ДоговорКонтрагента);
		Реквизиты.Вставить("Договор",					ДоговорКонтрагента);
		Реквизиты.Вставить("СуммаНДС");
		Реквизиты.Вставить("БанковскийСчет");
		Реквизиты.Вставить("ДокументПланирования");
		Реквизиты.Вставить("ОбъектРасчетов");
		Реквизиты.Вставить("ТипСуммыКредитаДепозита");
		
		Реквизиты.СуммаНДС = ТекСтрока.Сумма - ТекСтрока.СуммаБезНДС;
		Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, "БанковскийСчет, БанковскийСчетКонтрагента");
			Реквизиты.БанковскийСчет 			= РеквизитыДоговора.БанковскийСчет;
			Если НЕ ЗначениеЗаполнено(Реквизиты.БанковскийСчетПолучателя) Тогда
				Реквизиты.БанковскийСчетПолучателя 	= РеквизитыДоговора.БанковскийСчетКонтрагента;
			КонецЕсли;
		КонецЕсли; 
		
		Если ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВозвратОплатыКлиенту
			ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоставщику
			ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеТаможне Тогда
			Реквизиты.ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(ДоговорКонтрагента);
		КонецЕсли;
		
 		ЗаполнитьЗначенияДопАналитик(Реквизиты, ТекСтрока.Проект);
				
		ВалютаРеглУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Реквизиты.Организация);
		
		Если Реквизиты.ВалютаДокумента = Реквизиты.ВалютаВзаиморасчетов Тогда
			Реквизиты.КурсЧислительВзаиморасчетов	= 1;
			Реквизиты.КурсЗнаменательВзаиморасчетов = 1;
			Реквизиты.СуммаВзаиморасчетов			= Реквизиты.СуммаДокумента;
		Иначе
			КурсИКратность = ДенежныеСредстваСервер.КурсЧислительИКурсЗнаменательВзаиморасчетов(
								Реквизиты.ВалютаДокумента, Реквизиты.ВалютаВзаиморасчетов, ВалютаРеглУчета, 
								Реквизиты.ДатаПлан, Реквизиты.ОбъектРасчетов, Реквизиты.Договор);
			Реквизиты.КурсЧислительВзаиморасчетов	= КурсИКратность.КурсЧислитель;
			Реквизиты.КурсЗнаменательВзаиморасчетов = КурсИКратность.КурсЗнаменатель;
			
			Данные = Новый Структура;
			Данные.Вставить("Сумма", 						 Реквизиты.СуммаДокумента);
			Данные.Вставить("КурсЧислительВзаиморасчетов",	 Реквизиты.КурсЧислительВзаиморасчетов);
			Данные.Вставить("КурсЗнаменательВзаиморасчетов", Реквизиты.КурсЗнаменательВзаиморасчетов);
			Данные.Вставить("СуммаВзаиморасчетов",			 Реквизиты.СуммаВзаиморасчетов);
			
			ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
				Данные, Реквизиты.ВалютаДокумента, ВалютаРеглУчета);
			
			Реквизиты.СуммаВзаиморасчетов = Данные.СуммаВзаиморасчетов; 		

		КонецЕсли;
		
		// Тип суммы.
		Если ТекСтрока.СоставляющаяПлатежа = Справочники.бит_СоставляющиеПлатежейПоФинДоговорам.ПогашениеОсновногоДолга Тогда
			Реквизиты.ТипСуммыКредитаДепозита = Перечисления.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг;
		ИначеЕсли ТекСтрока.СоставляющаяПлатежа = Справочники.бит_СоставляющиеПлатежейПоФинДоговорам.Проценты Тогда	
			Реквизиты.ТипСуммыКредитаДепозита = Перечисления.ТипыСуммГрафикаКредитовИДепозитов.Проценты;
		ИначеЕсли ТекСтрока.СоставляющаяПлатежа = Справочники.бит_СоставляющиеПлатежейПоФинДоговорам.КомиссияЗаВыдачу
			ИЛИ ТекСтрока.СоставляющаяПлатежа = Справочники.бит_СоставляющиеПлатежейПоФинДоговорам.КомиссияЗаНеиспользованныйЛимит Тогда	
			Реквизиты.ТипСуммыКредитаДепозита = Перечисления.ТипыСуммГрафикаКредитовИДепозитов.Комиссия;
		Иначе
			Реквизиты.ТипСуммыКредитаДепозита = Перечисления.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг;
		КонецЕсли;		 
		
		ДанныеЗаполнения.Добавить(Реквизиты);
		
	КонецЦикла;
	
	ДокументПланирования = Неопределено;
	Попытка
		ДокументПланирования = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ДокументПоДаннымПлатежныхПозиций(ДанныеЗаполнения);
		// Запишем ссылку на документ в строки графика платежей.
		Для Каждого ТекСтрока Из ПараметрыЗаполнения Цикл
			ТекСтрока.ДокументПланирования = ДокументПланирования;
		КонецЦикла;
	Исключение
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ДокументПланирования) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РезультатПоиска = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(ДокументПланирования);
		Если ЗначениеЗаполнено(РезультатПоиска.МассивПозиций) Тогда
			Попытка
				НачатьТранзакцию();       
				
				ТекущийОбъект = ДокументПланирования.ПолучитьОбъект();
				ТекущийОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			    ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию(); 
				
				ТекстСообщения = НСтр("ru = 'Не удалось провести документ ""%1"" по причине: %2.'; 
									|en = 'The document ""%1"" could not be processed due to: %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументПланирования, 
									ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); 
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументПланирования);				
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПланируемоеПоступлениеДенежныхСредств(ПараметрыЗаполнения, РеквизитыШапки, РежимЗаписи, РежимСообщений)
		
	ДанныеЗаполнения = Новый Массив;
	
	Для каждого ТекСтрока Из ПараметрыЗаполнения Цикл
		Реквизиты = ОбщегоНазначения.СкопироватьРекурсивно(РеквизитыШапки); 
		Реквизиты.Вставить("Аналитика_1");
		Реквизиты.Вставить("Аналитика_2");
		Реквизиты.Вставить("Аналитика_3");
		Реквизиты.Вставить("Аналитика_4");
		Реквизиты.Вставить("Аналитика_5");
		Реквизиты.Вставить("Аналитика_6");
		Реквизиты.Вставить("Аналитика_7");
		Реквизиты.Вставить("Аналитика_8");
		Реквизиты.Вставить("Аналитика_9");
		Реквизиты.Вставить("Аналитика_10");
		Реквизиты.Вставить("Аналитика_11");
		Реквизиты.Вставить("Аналитика_12");
		Реквизиты.Вставить("СтавкаНДС");
		Реквизиты.Вставить("ЦФО");
		Реквизиты.Вставить("СтатьяОборотов");
  		Реквизиты.Вставить("НазначениеПлатежа");
		Реквизиты.Вставить("СверхБюджета");
		ЗаполнитьЗначенияСвойств(Реквизиты, ТекСтрока);

		Реквизиты.Вставить("ДокументОснование", 		Ссылка);
		Реквизиты.Вставить("ВидПлана",					РеквизитыШапки.ВидДокументаПланирования);
		Реквизиты.Вставить("ХозяйственнаяОперация",		ХозяйственнаяОперация);
   		Реквизиты.Вставить("ДатаПлан",					РеквизитыШапки.ПараметрПериод);
		Реквизиты.Вставить("НазначениеПлатежаУпр",		ТекСтрока.НазначениеПлатежа);
		Реквизиты.Вставить("СуммаДокумента",			ТекСтрока.Сумма);
		Реквизиты.Вставить("ДоговорАренды",				ДоговорКонтрагента);
		Реквизиты.Вставить("ДоговорКредитаДепозита",	ДоговорКонтрагента);
		Реквизиты.Вставить("ДоговорСЗаказчиком",		ДоговорКонтрагента);
		Реквизиты.Вставить("Договор",					ДоговорКонтрагента);
		Реквизиты.Вставить("СуммаНДС");
		Реквизиты.Вставить("БанковскийСчет");
		Реквизиты.Вставить("ДокументПланирования");
		Реквизиты.Вставить("ОбъектРасчетов");
		
		Реквизиты.СуммаНДС = ТекСтрока.Сумма - ТекСтрока.СуммаБезНДС;
		Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, "БанковскийСчет, БанковскийСчетКонтрагента");
			Реквизиты.БанковскийСчет 			= РеквизитыДоговора.БанковскийСчет;
			Если НЕ ЗначениеЗаполнено(Реквизиты.БанковскийСчетПолучателя) Тогда
				Реквизиты.БанковскийСчетПолучателя 	= РеквизитыДоговора.БанковскийСчетКонтрагента;
			КонецЕсли;
		КонецЕсли; 
		
		Если ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВозвратОплатыКлиенту
			ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоставщику
			ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеТаможне Тогда
			
			Реквизиты.ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(ДоговорКонтрагента);
			
		ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоКредитам
			ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты
			ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоКредитам Тогда
			
			Реквизиты.ДоговорКредитаДепозита = ДоговорКонтрагента;	
			
		ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПустаяСсылка() Тогда
			
			Реквизиты.ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(ДоговорКонтрагента);
		КонецЕсли;
		
 		ЗаполнитьЗначенияДопАналитик(Реквизиты, ТекСтрока.Проект);
				
		ВалютаРеглУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Реквизиты.Организация);
		
		Если Реквизиты.ВалютаДокумента = Реквизиты.ВалютаВзаиморасчетов Тогда
			Реквизиты.КурсЧислительВзаиморасчетов	= 1;
			Реквизиты.КурсЗнаменательВзаиморасчетов = 1;
			Реквизиты.СуммаВзаиморасчетов			= Реквизиты.СуммаДокумента;
		Иначе
			КурсИКратность = ДенежныеСредстваСервер.КурсЧислительИКурсЗнаменательВзаиморасчетов(
								Реквизиты.ВалютаДокумента, Реквизиты.ВалютаВзаиморасчетов, ВалютаРеглУчета, 
								Реквизиты.ДатаПлан, Реквизиты.ОбъектРасчетов, Реквизиты.Договор);
			Реквизиты.КурсЧислительВзаиморасчетов	= КурсИКратность.КурсЧислитель;
			Реквизиты.КурсЗнаменательВзаиморасчетов = КурсИКратность.КурсЗнаменатель;
			
			Данные = Новый Структура;
			Данные.Вставить("Сумма", 						 Реквизиты.СуммаДокумента);
			Данные.Вставить("КурсЧислительВзаиморасчетов",	 Реквизиты.КурсЧислительВзаиморасчетов);
			Данные.Вставить("КурсЗнаменательВзаиморасчетов", Реквизиты.КурсЗнаменательВзаиморасчетов);
			Данные.Вставить("СуммаВзаиморасчетов",			 Реквизиты.СуммаВзаиморасчетов);
			
			ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
				Данные, Реквизиты.ВалютаДокумента, ВалютаРеглУчета);
			
			Реквизиты.СуммаВзаиморасчетов = Данные.СуммаВзаиморасчетов; 		

		КонецЕсли;
		ДанныеЗаполнения.Добавить(Реквизиты);
	КонецЦикла;

	Попытка
		ДокументПланирования = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ДокументПоДаннымПозицийПоступления(ДанныеЗаполнения);	
		// Запишем ссылку на документ в строки графика платежей.
		Для Каждого ТекСтрока Из ПараметрыЗаполнения Цикл
			ТекСтрока.ДокументПланирования = ДокументПланирования;
		КонецЦикла;
	Исключение
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

// Процедура создает документ планирования.
//
// Параметры:
//  СтрокаСДаннымиШапки - СтрокаТабличнойЧасти.ГрафикПлатежей, ВыборкаИзРезультатаЗапроса.
//  СтрокаСДанными      - СтрокаТабличнойЧасти.ГрафикПлатежей, ВыборкаИзРезультатаЗапроса.
//  СтруктураЗначений   - Структура.
//  РежимЗаписи    - РежимЗаписиДокумента.
//  РежимСообщений - Строка: "Нет", "Все", "Ошибки".
//
Процедура СоздатьДокументПланирования(МассивСтрокДляДокумента, РеквизитыШапки, РежимЗаписи, РежимСообщений)
    
    Если МассивСтрокДляДокумента.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РеквизитыШапки.Свойство("ПараметрРасходДоход") ИЛИ НЕ РеквизитыШапки.Свойство("ПараметрПериод") Тогда		
		Возврат;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РеквизитыШапки.ВидДокументаПланирования) Тогда
		ТекстСообщения = НСтр("ru='Не указан вид плана создаваемого документа расхода.';
							  |en='Unknown type of document produced by the flow.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// Если направление - "Расходование".
	Если РеквизитыШапки.ПараметрРасходДоход = Перечисления.бит_РасходДоход.Расходование Тогда
		ЗаполнитьЗаявкуНаРасходДенежныхСредств(МассивСтрокДляДокумента, РеквизитыШапки, РежимЗаписи, РежимСообщений);
	Иначе
		ЗаполнитьПланируемоеПоступлениеДенежныхСредств(МассивСтрокДляДокумента, РеквизитыШапки, РежимЗаписи, РежимСообщений);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеГрафиков

// Процедура заполняет график начислений по договору
//
// Параметры:
//  СтатьяПроценты - СправчоникСсылка.
//
Процедура ЗаполнитьГрафикНачисленийПоДоговору(СтатьяБДРПроценты, СтатьяБДРКомиссии, НаправлениеГрафикНачислений, СтруктураАналитик)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикНачисленийКредитовИДепозитов.Период,
		|	СУММА(ГрафикНачисленийКредитовИДепозитов.Проценты) КАК СуммаПроценты,
		|	СУММА(0) КАК СуммаКомиссии
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	РегистрСведений.ГрафикНачисленийКредитовИДепозитов КАК ГрафикНачисленийКредитовИДепозитов
		|ГДЕ
		|	ГрафикНачисленийКредитовИДепозитов.ВариантГрафика.Используется = ИСТИНА
		|	И ГрафикНачисленийКредитовИДепозитов.ВариантГрафика.Владелец = &ДоговорКредитаДепозита
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикНачисленийКредитовИДепозитов.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГрафикНачисленийКредитовИДепозитов.Период,
		|	СУММА(0),
		|	СУММА(ГрафикНачисленийКредитовИДепозитов.Комиссия)
		|ИЗ
		|	РегистрСведений.ГрафикНачисленийКредитовИДепозитов КАК ГрафикНачисленийКредитовИДепозитов
		|ГДЕ
		|	ГрафикНачисленийКредитовИДепозитов.ВариантГрафика.Используется = ИСТИНА
		|	И ГрафикНачисленийКредитовИДепозитов.ВариантГрафика.Владелец = &ДоговорКредитаДепозита
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикНачисленийКредитовИДепозитов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДанных.Период КАК Период,
		|	ТаблицаДанных.СуммаПроценты,
		|	ТаблицаДанных.СуммаКомиссии
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("ДоговорКредитаДепозита", ДоговорКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СуммаПроценты > 0 Тогда
			
			Статья      = СтатьяБДРПроценты;
			Сумма       = Выборка.СуммаПроценты;

		ИначеЕсли Выборка.СуммаКомиссии > 0 Тогда
			
			Статья      = СтатьяБДРКомиссии;
			Сумма       = Выборка.СуммаКомиссии;

		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = ГрафикНачислений.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураАналитик);
		
		НоваяСтрока.Период                   = Выборка.Период;
		НоваяСтрока.ЦФО                      = ЦФО;
		НоваяСтрока.Проект                   = Проект;
		НоваяСтрока.РасходДоход              = НаправлениеГрафикНачислений;
		НоваяСтрока.Сумма                    = Сумма;
		
		Если ЗначениеЗаполнено(Статья) Тогда
			НоваяСтрока.СтатьяОборотовНачисления = Статья;
			НоваяСтрока.СтавкаНДС   = Статья.СтавкаНДС;
			
			СтавкаНДСРасчет = бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(Статья.СтавкаНДС);
			
			СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Сумма, Истина, Истина, СтавкаНДСРасчет);
			НоваяСтрока.НДС         = СуммаНДС;
			НоваяСтрока.СуммаБезНДС = Сумма - СуммаНДС;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеАналитик

Процедура ЗаполнитьАналитикиПоУмолчанию()

	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	Для каждого Аналитика Из НастройкиИзмерений Цикл
		Если НЕ Аналитика.Значение.ЭтоСоставнойТип Тогда 
			Если Аналитика.Значение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Организации")) Тогда
				ЭтотОбъект[Аналитика.Ключ] = Организация;
			ИначеЕсли Аналитика.Значение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Проекты")) Тогда	
				ЭтотОбъект[Аналитика.Ключ] = Проект;
			ИначеЕсли Аналитика.Значение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда	
				ЭтотОбъект[Аналитика.Ключ] = Контрагент;
			ИначеЕсли Аналитика.Значение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда	
				ЭтотОбъект[Аналитика.Ключ] = ДоговорКонтрагента;
			ИначеЕсли Аналитика.Значение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Подразделения")) Тогда	
				ЭтотОбъект[Аналитика.Ключ] = ЦФО;
			КонецЕсли; 
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьЗначенияДопАналитик(Позиция, ПроектВТабЧасти)

	Настр = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	Для каждого Аналит Из Настр Цикл
		
		Если Аналит.Значение.ТипЗначения.Типы()[0] = Тип("СправочникСсылка.Проекты") Тогда 
			
			Если ЗначениеЗаполнено(ПроектВТабЧасти) Тогда
				Позиция[Аналит.Ключ] = ПроектВТабЧасти;
			Иначе
				Позиция[Аналит.Ключ] = Проект;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
