
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	ПодготовитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаПараметрыУчетаВыбор(Элемент)
	
	ОбработатьВыбор(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаУчетНаПСВыбор(Элемент)
	
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	Если СтрСравнить(ИмяЭлемента, "ПланыСчетов") = 0 Тогда
		// Сформируем список выбора планов счетов.
		ДополнительныеПараметры = Новый Структура("ИмяФормы", "ПланСчетов.%1.ФормаСписка");
		Оповещение = Новый ОписаниеОповещения("ВыборОбъектаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ЗаголовокФормыВыбора = НСтр("ru = 'Выбор объекта: План счетов';
									|en = 'Object Selection: Chart of Accounts'");
		ПланыСчетов = ПланыСчетов();
		ПланыСчетов.ПоказатьВыборЭлемента(Оповещение, ЗаголовокФормыВыбора);
	ИначеЕсли СтрСравнить(ИмяЭлемента, "ЖурналыПроводок") = 0 Тогда
		// Сформируем список выбора регистров бухгалтерии.
		ДополнительныеПараметры = Новый Структура("ИмяФормы", "РегистрБухгалтерии.%1.ФормаСписка");
		Оповещение = Новый ОписаниеОповещения("ВыборОбъектаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ЗаголовокФормыВыбора = НСтр("ru = 'Выбор объекта: Регистр бухгалтерии';
									|en = 'Object Selection: Accounting Register'");
		ЖурналыПроводок = ЖурналыПроводок();
		ЖурналыПроводок.ПоказатьВыборЭлемента(Оповещение, ЗаголовокФормыВыбора);
	Иначе		
		ОбработатьВыбор(Элемент);
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик оповещения "ВыборОбъектаЗавершение".
// 
// Параметры:
// ВыбранныйЭлемент - Выбранный элемент из списка.
// ДополнительныеДанные - Структура.
&НаКлиенте 
Процедура ВыборОбъектаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ИмяОбъекта = ВыбранныйЭлемент.Значение;
		ПутьКФорме = СтрШаблон(ДополнительныеПараметры.ИмяФормы, ИмяОбъекта);
		ОткрытьФорму(ПутьКФорме);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаЗакрытиеСчетовВыбор(Элемент)
	
	ОбработатьВыбор(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура ОборотноСальдоваяВедомость(Команда)
	
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "ОСВУправленческий");
	
	Попытка
		ОткрытьФорму("Отчет.бит_БухгалтерскийОтчетУправленческийБезКорреспонденции.ФормаОбъекта", ПараметрыПередачи,,
			"ОСВУправленческий");	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура ОборотноСальдоваяВедомостьПоСчету(Команда)
	
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "ОСВПоСчетуУправленческий");
	
	Попытка
		ОткрытьФорму("Отчет.бит_БухгалтерскийОтчетУправленческийБезКорреспонденции.ФормаОбъекта", ПараметрыПередачи,,
			"ОСВПоСчетуУправленческий");	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры
 
&НаКлиенте
Процедура АнализСубконто(Команда)
	
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "АнализСубконтоУправленческий");
	
	Попытка
		ОткрытьФорму("Отчет.бит_БухгалтерскийОтчетУправленческийБезКорреспонденции.ФормаОбъекта", ПараметрыПередачи,,
			"АнализСубконтоУправленческий");	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура АнализСчета(Команда)
	
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "АнализСчетаУправленческий");
	
	Попытка
		ОткрытьФорму("Отчет.бит_БухгалтерскийОтчетУправленческийСКорреспонденцией.ФормаОбъекта", ПараметрыПередачи,,
			"АнализСчетаУправленческий");	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура КарточкаСчета(Команда)
	
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "КарточкаСчетаУправленческий");
	
	Попытка
		ОткрытьФорму("Отчет.бит_КарточкаСчетаУправленческий.ФормаОбъекта", ПараметрыПередачи,,
			"КарточкаСчетаУправленческий");	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура ОСВПоСчетуСКорреспонденцией(Команда)
	
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "ОСВПоСчетуСКорреспонденциейУправленческий");
	
	Попытка
		ОткрытьФорму("Отчет.бит_БухгалтерскийОтчетУправленческийСКорреспонденцией.ФормаОбъекта", ПараметрыПередачи,,
			"ОСВПоСчетуСКорреспонденциейУправленческий");	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПроводкам(Команда)
	
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "ОтчетПоПроводкамУправленческий");
	
	Попытка
		ОткрытьФорму("Отчет.бит_КарточкаСчетаУправленческий.ФормаОбъекта", ПараметрыПередачи,,
			"ОтчетПоПроводкамУправленческий");	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура СводныеПроводки(Команда)
	
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "СводныеПроводки");
	
	Попытка
		ОткрытьФорму("Отчет.бит_КарточкаСчетаУправленческий.ФормаОбъекта", ПараметрыПередачи,,
			"СводныеПроводки");	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыбор(Элемент)
	
	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	НавигационнаяСсылкаБлока = Неопределено;
	Если НавигационныеСсылки.Свойство(ИмяЭлемента, НавигационнаяСсылкаБлока)
		И ЗначениеЗаполнено(НавигационнаяСсылкаБлока) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаБлока);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФорму()
	
	// Готовим структуру из метаданных, чтобы проверка конфигурации реагировала на изменения.
	ОбъектыПодсистемы = Новый Структура;
	
	// Справочники.
	ОбъектыПодсистемы.Вставить("ВидыЗакрытияСчетов", Метаданные.Справочники.бит_ВидыЗакрытияСчетов);
	ОбъектыПодсистемы.Вставить("НастройкиЗакрытия",	Метаданные.Справочники.бит_НастройкиЗакрытия);
	
	// Документы.
	ОбъектыПодсистемы.Вставить("ЗакрытиеСчетов", Метаданные.Документы.бит_ЗакрытиеСчетов);
	ОбъектыПодсистемы.Вставить("ОперацияУправленческий", Метаданные.Документы.бит_ОперацияУправленческий);
	ОбъектыПодсистемы.Вставить("ПереоценкаВалютныхДенежныхСтатей", Метаданные.Документы.бит_ПереоценкаВалютныхДенежныхСтатей);
	
	// Регистры сведений.
	ОбъектыПодсистемы.Вставить("НачалоОткрытогоПериода", Метаданные.РегистрыСведений.бит_НачалоОткрытогоПериода);
	ОбъектыПодсистемы.Вставить("ВалютныеНеденежныеСтатьи", Метаданные.РегистрыСведений.бит_ВалютныеНеденежныеСтатьи);
	ОбъектыПодсистемы.Вставить("МаскиКодов", Метаданные.РегистрыСведений.бит_МаскиКодов);
	ОбъектыПодсистемы.Вставить("НазначениеАлгоритмовЗакрытия", Метаданные.РегистрыСведений.бит_НазначениеАлгоритмовЗакрытия);
	
	// Общие формы.
	ОбъектыПодсистемы.Вставить("Константы", Метаданные.ОбщиеФормы.бит_Константы);
	
	// Планы счетов.
	ОбъектыПодсистемы.Вставить("Бюджетирование", Метаданные.ПланыСчетов.бит_Бюджетирование);
	
	// Формирование навигационных ссылок и проверка доступа по функциональным опциям.
	НедоступныеОбъекты = Новый Массив;
	Для Каждого ОбъектПодсистемы Из ОбъектыПодсистемы Цикл
		НавигационнаяСсылкаБлока = ""; 
		ОбъектДоступен = ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОбъектПодсистемы.Значение);
		Если ОбъектДоступен Тогда
			Если ОбъектПодсистемы.Значение = Метаданные.ОбщиеФормы.бит_Константы Тогда
				НавигационнаяСсылкаБлока = "e1cib/app/ОбщаяФорма.бит_Константы";
			Иначе	
				НавигационнаяСсылкаБлока = ПолучитьНавигационнуюСсылку(ОбъектПодсистемы.Значение);
			КонецЕсли;
		Иначе
			НедоступныеОбъекты.Добавить(ОбъектПодсистемы.Ключ);	
		КонецЕсли;
		ОбъектыПодсистемы[ОбъектПодсистемы.Ключ] = НавигационнаяСсылкаБлока;
	КонецЦикла;
	
	НавигационныеСсылки = Новый ФиксированнаяСтруктура(ОбъектыПодсистемы);
	
	СхемаПараметрыУчета    = Обработки.бит_ПанельФункций_УправленческийУчет.ПолучитьМакет("СхемаПараметрыУчета");
	СхемаУчетНаПланеСчетов = Обработки.бит_ПанельФункций_УправленческийУчет.ПолучитьМакет("СхемаУчетНаПланеСчетов");
	СхемаЗакрытиеСчетов    = Обработки.бит_ПанельФункций_УправленческийУчет.ПолучитьМакет("СхемаЗакрытиеСчетов");
	
	// Ссылка может быть одновременно на разных схемах.
	Для Каждого НедоступныйОбъект Из НедоступныеОбъекты Цикл
		ЭлементыСхемы = СхемаПараметрыУчета.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
		ЭлементыСхемы = СхемаУчетНаПланеСчетов.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
		ЭлементыСхемы = СхемаЗакрытиеСчетов.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект)
	
	ЭлементСхемы = ЭлементыСхемы[НедоступныйОбъект];
	ЭлементСхемы.ЦветФона = ЦветаСтиля.бит_ЦветНедоступногоПоля;
	
КонецПроцедуры

&НаСервере
Функция ПланыСчетов()
	
	СписокВыбора = бит_УправленческийУчет.СформироватьСписокОбъектовДляВыбора(Перечисления.бит_ВидыОбъектовСистемы.ПланСчетов, "бит_Дополнительный");
	Для Каждого ТекЭлемент Из СписокВыбора Цикл
		ТекЭлемент.Значение = ТекЭлемент.Значение.ИмяОбъекта;
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция ЖурналыПроводок()
	
	СписокВыбора = бит_УправленческийУчет.СформироватьСписокОбъектовДляВыбора(Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии, "бит_Дополнительный");
	Для Каждого ТекЭлемент Из СписокВыбора Цикл
		ТекЭлемент.Значение = ТекЭлемент.Значение.ИмяОбъекта;
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

#КонецОбласти
