// @strict-types

#Область СлужебныеПроцедурыИФункции

#Область КлючДоступаКСервисуЭДО

// Параметры:
//  РезультатыПолученияОтпечатков - см. КриптографияБЭДКлиентСервер.НовыеРезультатыПолученияОтпечатков
//  ИдентификаторыЭДО - Неопределено,Массив из Строка
//  ИдентификаторФормы - Неопределено,УникальныйИдентификатор
//  
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ДанныеАутентификацииВключенияИспользованияКлючаДоступаВФоне(Знач РезультатыПолученияОтпечатков, Знач ИдентификаторыЭДО, Знач ИдентификаторФормы = Неопределено) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	// См. АвтоматическоеПолучениеЭДО.ДанныеАутентификацииВключенияИспользованияКлючаДоступаКСервисуЭДО
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"АвтоматическоеПолучениеЭДО.ДанныеАутентификацииВключенияИспользованияКлючаДоступаКСервисуЭДО",
		РезультатыПолученияОтпечатков, ИдентификаторыЭДО);
	
КонецФункции

// Параметры:
//  ИдентификаторыЭДО - Массив из Строка
//  РасшифрованныеМаркеры - см. КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных
//  ИдентификаторФормы - Неопределено,УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ВключитьИспользованиеКлючаДоступаКСервисуЭДОВФоне(Знач ИдентификаторыЭДО, Знач РасшифрованныеМаркеры, Знач ИдентификаторФормы = Неопределено) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	// См. АвтоматическоеПолучениеЭДО.ВключитьИспользованиеКлючаДоступаКСервисуЭДО
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"АвтоматическоеПолучениеЭДО.ВключитьИспользованиеКлючаДоступаКСервисуЭДО",
		ИдентификаторыЭДО, РасшифрованныеМаркеры);
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Неопределено,Строка
Процедура Отключить(Знач ИдентификаторЭДО = Неопределено) Экспорт
	АвтоматическоеПолучениеЭДО.ОтключитьИспользованиеКлючаДоступаКСервисуЭДО(ИдентификаторЭДО);
КонецПроцедуры

#КонецОбласти

#Область Получение

// Параметры:
//  АдресРезультата - Строка
// 
// Возвращаемое значение:
//  См. АвтоматическоеПолучениеЭДО.ПолучитьЧерезИнтервал
Функция РезультатПолученияЧерезИнтервал(Знач АдресРезультата) Экспорт
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата); // См. АвтоматическоеПолучениеЭДО.ПолучитьЧерезИнтервал
	УдалитьИзВременногоХранилища(АдресРезультата);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Предупреждение

// Параметры:
//  ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  См. АвтоматическоеПолучениеЭДО.ОтборЖурналаРегистрации
Функция ОтборЖурналаРегистрации(Знач ИдентификаторЭДО) Экспорт
	Возврат АвтоматическоеПолучениеЭДО.ОтборЖурналаРегистрации(ИдентификаторЭДО);
КонецФункции

#КонецОбласти

#КонецОбласти
