///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ОнлайнЗаказыВызовСервера".
// ОбщийМодуль.ОнлайнЗаказы.
//
// Серверные процедуры настройки использования сервиса:
//  - определение параметров создания заказа;
//  - проверка, создание и установка использования предопределенных шаблонов сообщений.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// См. ОнлайнЗаказыСлужебный.ПриОпределенииПараметровСозданияЗаказа.
//
Функция ПриОпределенииПараметровСозданияЗаказа(Знач ДокументЗаказа) Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.ПриОпределенииПараметровСозданияЗаказа(
		ДокументЗаказа);
	
КонецФункции

// См. ОнлайнЗаказыСлужебный.НастройкаОнлайнЗаказовДоступна.
//
Функция НастройкаОнлайнЗаказовДоступна() Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.НастройкаОнлайнЗаказовДоступна();
	
КонецФункции

// См. ОнлайнЗаказыСлужебный.ВсеШаблоныСозданы.
//
Функция ВсеШаблоныСозданы() Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.ВсеШаблоныСозданы();
	
КонецФункции

// См. ОнлайнЗаказыСлужебный.СоздатьПредопределенныеШаблоныСообщенийПроверкаПодсистем.
//
Функция СоздатьПредопределенныеШаблоныСообщенийПроверкаПодсистем() Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.СоздатьПредопределенныеШаблоныСообщенийПроверкаПодсистем();
	
КонецФункции

// См. ОнлайнЗаказыСлужебный.УстановитьИспользованиеШаблоновСообщенийПроверкаПодсистем.
//
Процедура УстановитьИспользованиеШаблоновСообщенийПроверкаПодсистем() Экспорт
	
	ОнлайнЗаказыСлужебный.УстановитьИспользованиеШаблоновСообщенийПроверкаПодсистем();
	
КонецПроцедуры

// См. ОнлайнЗаказыСлужебный.ОбновитьНастройкиСтраницЗапускЗадания.
//
Функция ОбновитьНастройкиСтраницЗапускЗадания(
		Знач ИдентификаторФормы,
		Знач НастройкаОплаты) Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.ОбновитьНастройкиСтраницЗапускЗадания(
		ИдентификаторФормы,
		НастройкаОплаты);
	
КонецФункции

#КонецОбласти