#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
#Область ДляВызоваИзДругихПодсистем

// Процедура устанавливает значения регистра по умолчанию
//
// Параметры:
//   Запись           - РегистрСведенийЗапись - запись регистра
//   ДанныеЗаполнения - Структура - где ключ - имя ресурса
//
Процедура УстановкаНастроекПоУмолчанию(Запись, ДанныеЗаполнения) Экспорт
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Период",
		ТекущаяДатаСеанса());
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СтруктурноеПодразделение",
		Неопределено);
		
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"УстанавливатьВДоговорахВысокийПриоритетЗаполненияАналитик",
		Ложь);
		
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"КонтролироватьГрафикиДоговоровПоБюджету",
		Ложь);
		
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"КонтролироватьПревышенияСуммыПоДоговору",
		Перечисления.бит_ВидыКонтроля.НеКонтролировать);
				
КонецПроцедуры

#КонецОбласти
#КонецОбласти

#КонецЕсли