#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет наборы значений доступа.
// Параметры:
//  Таблица - ТаблицаЗначений - передает в этот параметр подготовленные наборы значений
//            доступа. Описание колонок см. в функции УправлениеДоступом.ТаблицаНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
		ЦФО, СтатьяОборотов);
	ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	ДобавитьСтрокуВНаборЗначенийДоступа(Ответственный, Таблица);
	
	// Таблица "ФактическиеДанные"
	Для каждого СтрокаТаблицы Из ФактическиеДанные Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
			
	// Удалим дубли
	ПоляГруппировки = "";
	Для каждого Колонка Из Таблица.Колонки Цикл
		ПоляГруппировки = "," + Колонка.Имя + ПоляГруппировки;
	КонецЦикла; 
	
	ПоляГруппировки = Сред(ПоляГруппировки, 2);
	Таблица.Свернуть(ПоляГруппировки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ОбщегоНазначения.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
		Сценарий = Справочники.СценарииПланирования.ФАКТ;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Сценарий) Тогда
		ВалютаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "Валюта");
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли; 
	
	ИзменениеВалютыОбъект();	
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Автоматический;
	КонецЕсли;

	// Заполнение шапки
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), Неопределено);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СвойстваСтатей  = СвойстваСтатей(ФактическиеДанные.ВыгрузитьКолонку("СтатьяОборотов"));
	
	Для каждого СтрокаТаблицы Из ФактическиеДанные Цикл
		
		Префикс = "ФактическиеДанные[%1].";
		Префикс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Префикс, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="));
					
		ТекущиеСвойства = СвойстваСтатей.Получить(СтрокаТаблицы.СтатьяОборотов);
		Если ТекущиеСвойства.ЭтоГруппа Тогда
			// При загрузке из источников ошибочно принимаются группы.
			Поле = Префикс + "СтатьяОборотов";
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ", 
								НСтр("ru = 'Статья оборотов';en = 'Line Item'"), 
								СтрокаТаблицы.НомерСтроки,
								НСтр("ru = 'Фактические данные';en = 'Actual data'"),
								НСтр("ru = 'Использование иерархических групп для целей учета не поддерживается.';
									 |en = 'Using hierarchical groups for accounting purposes is not supported.'"));			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		ИначеЕсли ТекущиеСвойства.КоличественныйУчет И ТекущиеСвойства.СуммовойУчет Тогда
			Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.Количество = 0	Тогда
				СообщитьОНулевомКоличестве(СтрокаТаблицы, Префикс, Отказ);
				СообщитьОНулевойСумме(СтрокаТаблицы, Префикс, Отказ);
			КонецЕсли;
		ИначеЕсли ТекущиеСвойства.КоличественныйУчет И СтрокаТаблицы.Количество = 0 Тогда
			СообщитьОНулевомКоличестве(СтрокаТаблицы, Префикс, Отказ);
		ИначеЕсли ТекущиеСвойства.СуммовойУчет И СтрокаТаблицы.Сумма = 0 Тогда
			СообщитьОНулевойСумме(СтрокаТаблицы, Префикс, Отказ);
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	НаименованиеТаблицы = НСтр("ru='Фактические данные';en='Actual data'"); 
	Если бит_УправлениеДоступомБФСлужебный.ДоступЗапрещен(ФактическиеДанные, НаименованиеТаблицы, Истина) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый()
		ИЛИ (РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения 
		И ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления")) Тогда
		УстановитьПривилегированныйРежим(Истина);
		ЗаполнитьЗависимыеОбороты();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
			Сценарий = Справочники.СценарииПланирования.ФАКТ;
		КонецЕсли; 
	КонецЕсли; 
		
	// Заполним аналитику в шапке документа.
	бит_ОбщегоНазначения.ЗаполнитьАналитикуВШапкеДокумента(ЭтотОбъект, ФактическиеДанные, Отказ);
	
КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка, Отказ, Заголовок, ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураШапкиДокумента  = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураКурсыВалют		 = бит_Бюджетирование.КурсыВалютСценария(ЭтотОбъект,
								Дата, Новый Структура("Документ, Регл, Упр, Сценарий"));
	ТаблицаФактическиеДанные = ПодготовитьТаблицуФактическиеДанные(СтруктураШапкиДокумента, СтруктураКурсыВалют);
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаФактическиеДанные, Отказ, Заголовок);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	Комментарий   = "";
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура очищает табличную часть ЗависимыеОбороты.
// 
// Параметры:
//  Нет
// 
Процедура ОчиститьЗависимыеОбороты() Экспорт

	ЗависимыеОбороты.Очистить();

КонецПроцедуры // ОчиститьЗависимыеОбороты()

// Процедура заполняет табличную часть ЗависимыеОбороты.
// 
// Параметры:
//  Нет
// 
Процедура ЗаполнитьЗависимыеОбороты() Экспорт

	УстановитьПривилегированныйРежим(Истина);	
	
	ОчиститьЗависимыеОбороты();
	
	Если РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.НеФормировать Тогда
		// Не формируем зависимые обороты.
		Возврат;
	КонецЕсли;
	
	ПараметыЗаполнения = бит_Бюджетирование.НовыеПараметыЗаполненияЗависимыхОборотов();
	ПараметыЗаполнения.ТаблицаИсточник      = ФактическиеДанные.Выгрузить();
	ПараметыЗаполнения.ТаблицаПриемник      = ЗависимыеОбороты.ВыгрузитьКолонки();
	ПараметыЗаполнения.Сценарий             = Сценарий;
	ПараметыЗаполнения.ВестиПротокол        = (ПараметыЗаполнения.ТаблицаПриемник.Колонки.Найти("КомментарийРасчета")
												<> Неопределено);
	ЗависимыеОбороты.Загрузить(бит_Бюджетирование.ЗависимыеОборотыПоИсточнику(ПараметыЗаполнения));
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры // ЗаполнитьЗависимыеОбороты()
   
// Процедура обрабатывает изменение валюты документа.
// 
// Параметры:
//  Нет
// 
Процедура ИзменениеВалютыОбъект() Экспорт
	
	СтрКурса = бит_Бюджетирование.ПолучитьКурсПоСценарию(Сценарий, ВалютаДокумента, Дата);
	КурсДокумента      = СтрКурса.Курс;
	КратностьДокумента = СтрКурса.Кратность;
	
КонецПроцедуры // ИзменениеВалютыОбъект()

// Процедура обрабатывает изменение сценария.
// 
// Параметры:
//  Нет
// 
Процедура ИзменениеСценарияОбъект() Экспорт
	
	// Изменяем валюту документа на валюту из сценария.
	ВалютаДокумента = Сценарий.Валюта;
	
	ИзменениеВалютыОбъект();
	
КонецПроцедуры // ИзменениеСценарияОбъект()
           
// Процедура выполняет заполнение фактических данных по источникам.
// 
// Параметры:
//  Нет
// 
Процедура ЗаполнитьФактическиеДанные() Экспорт
	
	ФактическиеДанные.Очистить();

	ГраницаНач = ДатаНачала;
	ГраницаКон = Новый Граница(КонецДня(ДатаОкончания), ВидГраницы.Включая);

	Для каждого СтрокаТаблицы Из ИсточникиДанных Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ИсточникДанных) Тогда			
			Продолжить;			
		КонецЕсли; 
		
		СтрПар = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоИсточнику();
		СтрПар.НастройкаПулаПодключений = НастройкаПулаПодключений;
		
		ТаблицаРезультат = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточнику(СтрокаТаблицы.ИсточникДанных, ГраницаНач,
							ГраницаКон, СтрПар);
																				
		ЕстьРегистратор = ?(ТаблицаРезультат.Колонки.Найти("Регистратор") = Неопределено, Ложь, Истина);
		
		Для каждого СтрокаРезультат Из ТаблицаРезультат Цикл
			НоваяСтрока = ФактическиеДанные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультат);
			НоваяСтрока.ИсточникДанных = СтрокаТаблицы.ИсточникДанных;
			Если ЕстьРегистратор И ТипЗнч(СтрокаРезультат.Регистратор) = Тип("Структура") Тогда
				ЗначВнешнее                      = СтрокаРезультат.Регистратор;
				НоваяСтрока.НастройкаПодключения = ЗначВнешнее.НастройкаПодключения;
				НоваяСтрока.НавигационнаяСсылка  = ЗначВнешнее.ПолноеИмя + "?ref""" + ЗначВнешнее.ИД + """";
				НоваяСтрока.Регистратор = ЗначВнешнее.Представление;
			КонецЕсли;       
		КонецЦикла; 
	КонецЦикла; 
	
	ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Заполнение завершено.';en='Filling in completed.'"), ЭтотОбъект); 
	
КонецПроцедуры // ЗаполнитьФактическиеДанные()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСтрокуВНаборЗначенийДоступа(ЗначениеДоступа, Таблица)
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = ЗначениеДоступа;

КонецПроцедуры

Функция ПодготовитьТаблицуФактическиеДанные(СтруктураШапкиДокумента, СтруктураКурсыВалют)
	
	ТекстПолей_ФактическиеДанные = "";
	ТекстПолей_ЗависимыеОбороты  = "";
	Для каждого ТекИзмерение Из Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения Цикл		
		
		ИмяИзмерения = ТекИзмерение.Имя;
		Если ИмяИзмерения = "Валюта" Или ИмяИзмерения = "Сценарий" Тогда
			Продолжить;		
		КонецЕсли;
		
		ТекстПолей_ФактическиеДанные = ТекстПолей_ФактическиеДанные + Символы.ПС + "	ФактическиеДанные." + ИмяИзмерения + ",";
				
	КонецЦикла;
	ТекстПолей_ЗависимыеОбороты = СтрЗаменить(ТекстПолей_ФактическиеДанные, "ФактическиеДанные", "ЗависимыеОбороты");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФормироватьДвиженияПоФактическимДанным", НЕ СтруктураШапкиДокумента.НеФормироватьДвиженияПоФактическимДанным);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ФактическиеДанные.Период,
	|	ФактическиеДанные.Ссылка.ВалютаДокумента КАК Валюта,
	|	ФактическиеДанные.Ссылка.Сценарий КАК Сценарий,
	|   " + ТекстПолей_ФактическиеДанные + "
	|	ФактическиеДанные.СтатьяОборотов.СтавкаНДС КАК СтавкаНДС,
	|	ФактическиеДанные.СтатьяОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент,	
	|	ФактическиеДанные.Количество,
	|	ФактическиеДанные.Сумма,
	|	0 КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаСценарий,
	|	ФактическиеДанные.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.бит_ПолучениеФактическихДанных.ФактическиеДанные КАК ФактическиеДанные
	|ГДЕ
	|	ФактическиеДанные.Ссылка = &Ссылка
	|	И &ФормироватьДвиженияПоФактическимДанным
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗависимыеОбороты.Период,
	|	ЗависимыеОбороты.Ссылка.ВалютаДокумента,
	|	ЗависимыеОбороты.Ссылка.Сценарий,
	|   " + ТекстПолей_ЗависимыеОбороты + "
	|	ЗависимыеОбороты.СтатьяОборотов.СтавкаНДС,
	|	ЗависимыеОбороты.СтатьяОборотов.ЭтоКоэффициент,	
	|	ЗависимыеОбороты.Количество,
	|	ЗависимыеОбороты.Сумма,
	|	0,
	|	0,
	|	0,
	|	""""
	|ИЗ
	|	Документ.бит_ПолучениеФактическихДанных.ЗависимыеОбороты КАК ЗависимыеОбороты
	|ГДЕ
	|	ЗависимыеОбороты.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);			   
	Результат = Запрос.Выполнить();
	
	ТаблицаФактическиеДанные = Результат.Выгрузить();
	
	КурсыПоПериодам = Неопределено;
	
	Если Сценарий.ИспользоватьКурсыСценария Тогда
		
		// Получим таблицу периодов
		ТаблицаПериодов = ФактическиеДанные.Выгрузить();
		ТаблицаПериодов.Свернуть("Период");
		
		// Установим настройки для получения курсов по периодам.
		СтруктураПараметров = бит_Бюджетирование.ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(Сценарий, ВалютаДокумента);
		
		// Получим курсы по периодам
		КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураПараметров, Сценарий);
		
	КонецЕсли;
	
	бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(ТаблицаФактическиеДанные, КурсыПоПериодам, СтруктураКурсыВалют);
	
	Возврат ТаблицаФактическиеДанные;
	
КонецФункции // ПодготовитьТаблицуФактическиеДанные()
 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаБДДС, Отказ, Заголовок)
	
	// Движения по регистру обороты по бюджетам
	ТаблицаДвижений = Движения.бит_ОборотыПоБюджетам.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаБДДС Цикл
	
		НоваяСтрока = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла; 
	
	Движения.бит_ОборотыПоБюджетам.мТаблицаДвижений = ТаблицаДвижений;
	Движения.бит_ОборотыПоБюджетам.ДобавитьДвижение();
	
	Если НЕ СтруктураШапкиДокумента.НеФормироватьПроводкиБюджетирования Тогда
		
		// Регистр бухгалтерии бюджетирование
		бит_Бюджетирование.СформироватьПроводкиБюджетирования(ТаблицаБДДС, Движения.бит_Бюджетирование);
		
	КонецЕсли; 
	
КонецПроцедуры // ДвиженияПоРегистрам()

Функция СвойстваСтатей(Статьи)
	
	СвойстваСтатей = Новый Соответствие(); 
	
	ТекущиеСвойства = Новый Структура;
	ТекущиеСвойства.Вставить("ЭтоГруппа", Ложь);
	ТекущиеСвойства.Вставить("КоличественныйУчет", Ложь);
	ТекущиеСвойства.Вставить("СуммовойУчет", Ложь);
	СвойстваСтатей.Вставить(Справочники.бит_СтатьиОборотов.ПустаяСсылка(), ТекущиеСвойства);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Статьи", Статьи);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиОборотов.Ссылка КАК Ссылка,
	|	СтатьиОборотов.ЭтоГруппа КАК ЭтоГруппа,
	|	ЕСТЬNULL(СтатьиОборотов.Учет_Количество, ЛОЖЬ) КАК КоличественныйУчет,
	|	ЕСТЬNULL(СтатьиОборотов.Учет_Сумма, ЛОЖЬ) КАК СуммовойУчет
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|ГДЕ
	|	СтатьиОборотов.Ссылка В(&Статьи)";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекущиеСвойства = Новый Структура("ЭтоГруппа, КоличественныйУчет, СуммовойУчет"); 
		ЗаполнитьЗначенияСвойств(ТекущиеСвойства, Выборка);
		СвойстваСтатей.Вставить(Выборка.Ссылка, ТекущиеСвойства);
	КонецЦикла;
	
	Возврат СвойстваСтатей;
	
КонецФункции

Процедура СообщитьОНулевомКоличестве(СтрокаТаблицы, Префикс, Отказ)
	
	Поле = Префикс + "Количество";
	ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",,НСтр("ru='Количество';en='Quantity'"), 
						СтрокаТаблицы.НомерСтроки, НСтр("ru='Фактические данные';en='Actual data'"));	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);

КонецПроцедуры

Процедура СообщитьОНулевойСумме(СтрокаТаблицы, Префикс, Отказ)
	
	Поле = Префикс + "Сумма";
	ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",,НСтр("ru='Сумма';en='Amount'"), 
						СтрокаТаблицы.НомерСтроки, НСтр("ru='Фактические данные';en='Actual data'"));	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли