
&После("ОпределитьОбъектыСКомандамиПечати")
Процедура бит_ОпределитьОбъектыСКомандамиПечати(СписокОбъектов)
	СписокОбъектов.Добавить(Документы.бит_АктСрезкиГП);
	
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 +
	СписокОбъектов.Добавить(Документы.бит_АктОБраке);
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ7.8] [ASHolyavko@1cbit.ru] [06.10.2025] +        
	СписокОбъектов.Добавить(Документы.бит_РасчетПремии); 
	// }}ПервыйБИТ ЛистТребований [ЛТ7.8] [ASHolyavko@1cbit.ru] [06.10.2025] -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 16:51:08] +        
	СписокОбъектов.Добавить(Документы.бит_ПартияЗавесов); 
	// }}ПервыйБИТ ЛистТребований [ЛТ5.32]  [VUVaynula@1cbit.ru] [31.03.2026 16:51:08] -	
КонецПроцедуры
