
Функция ПолучитьОсновноеКоличествоХодов(ВидРабочегоЦентра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПризнакиВРЦДляОТиЗ.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.бит_ПризнакиВРЦДляОТиЗ КАК бит_ПризнакиВРЦДляОТиЗ
		|ГДЕ
		|	бит_ПризнакиВРЦДляОТиЗ.ВидРабочегоЦентра = &ВидРабочегоЦентра
		|	И бит_ПризнакиВРЦДляОТиЗ.ПризнакОТиЗ = &ПризнакОТиЗ";
	
	Запрос.УстановитьПараметр("ВидРабочегоЦентра", ВидРабочегоЦентра);
	Запрос.УстановитьПараметр("ПризнакОТиЗ", Перечисления.бит_ТипыПризнаковДляОТиЗ.ОсновноеКоличествоХодов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение
	КонецЦикла;
	
	Возврат 1;
	
КонецФункции