
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Управляем видимостью колонок дополнительных измерений
	бит_МеханизмДопИзмерений.ОтобразитьДополнительныеИзмеренияВТабличномПоле_Управляемая(ЭтотОбъект, "Список");
	
КонецПроцедуры // ПриСозданииНаСервере()
