
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АвтоТест", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.ИмяМетаданных) Тогда
		ТекстСообщения = НСтр("ru = 'Непосредственное открытие этой формы не предусмотрено.';
								|en = 'You can''t open this form directly.'");
    	ВызватьИсключение ТекстСообщения;
	КонецЕсли;
		
	ИмяМетаданных 	= Параметры.ИмяМетаданных;
	АдресВХранилище = Параметры.АдресВХранилище;
	Заголовок		= Параметры.Заголовок;
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
	КонецЕсли;
	
	УстановитьФлагиЗаданий();	
	
	Если ЭтоСоздатьДокументыПланированияИзДопУсловий Тогда
		ПрочитатьПараметрыСоздатьДокументыПланированияИзДопУсловий();
	ИначеЕсли ЭтоРегистрацияОповещенийОВизировании Тогда
		УстановитьПараметрыВыбораОповещения();
		ПрочитатьПараметрыРегистрацияОповещенийОВизировании();
	ИначеЕсли ЭтоУстановкаРешенийПоПросроченнымВизам Тогда
		ВизируемыеОбъектыСистемы = ВизируемыеОбъектыСистемы();
		ПрочитатьПараметрыУстановкаРешенийПоПросроченнымВизам();
	ИначеЕсли ЭтоЗакрытиеДокументовПланирования Тогда
		ПрочитатьПараметрыЗакрытиеДокументовПланирования();
	КонецЕсли;
			
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОчиститьСообщения();
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Параметры регламентного задания изменены. Сохранить изменения?';
							|en = 'Parameters of the regulation task have been change. Save changes?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект); 
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаписатьИЗакрыть();
	Иначе
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
                
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СоздаватьЗаявкаНаРасходованиеДСПриИзменении(Элемент)
	
	Если СоздаватьЗаявкаНаРасходованиеДС Тогда
		СоздаватьПрогнозПлатежа = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьПрогнозПлатежаПриИзменении(Элемент)
	
	Если СоздаватьПрогнозПлатежа Тогда
		СоздаватьЗаявкаНаРасходованиеДС = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов", 		   СписокВидовОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы",    ОбъектСистемы);
	ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", ВизируемыеОбъектыСистемы);
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)

	ЗаписатьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ГруппаСтраницаПараметрыОповещенийВизирования.Видимость = ЭтоРегистрацияОповещенийОВизировании;
	Элементы.ГруппаСтраницаНастройкаРешенийВизирования.Видимость 	= ЭтоУстановкаРешенийПоПросроченнымВизам;
	Элементы.ГруппаСтраницаПараметрыСозданияДокументов.Видимость 	= ЭтоСоздатьДокументыПланированияИзДопУсловий;
	Элементы.ГруппаСтраницаЗакрытиеДокументовПланирования.Видимость = ЭтоЗакрытиеДокументовПланирования;
		
	ИспользуютсяЗаявкиНаЗатраты = Метаданные.Документы.Найти("бит_ЗаявкаНаЗатраты") <> Неопределено;
	
	Элементы.СоздаватьЗаявкаНаЗатраты.Видимость	= ИспользуютсяЗаявкиНаЗатраты;
	Элементы.ЗаявкаНаЗатратыДни.Видимость		= ИспользуютсяЗаявкиНаЗатраты;
	Элементы.Декорация4.Видимость 		  		= ИспользуютсяЗаявкиНаЗатраты;

КонецПроцедуры
 
&НаСервере
Процедура ПрочитатьПараметрыСоздатьДокументыПланированияИзДопУсловий()
	
	ЗначенияПоУмолчанию = Обработки.бит_УправлениеРегламентнымиЗаданиями.ЗначенияПоУмолчаниюСоздатьДокументыПланированияИзДопУсловий();
	ПараметрыЗадания	= ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	Если ТипЗнч(ПараметрыЗадания) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЗначенияПоУмолчанию, ПараметрыЗадания); 
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыУстановкаРешенийПоПросроченнымВизам()
	
	ЗначенияПоУмолчанию = Обработки.бит_УправлениеРегламентнымиЗаданиями.ЗначенияПоУмолчаниюУстановкаРешенийПоПросроченнымВизам();
	ПараметрыЗадания	= ПолучитьИзВременногоХранилища(АдресВХранилище);

	Если ТипЗнч(ПараметрыЗадания) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЗначенияПоУмолчанию, ПараметрыЗадания);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияПоУмолчанию);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыРегистрацияОповещенийОВизировании()
	
	ЗначенияПоУмолчанию = Обработки.бит_УправлениеРегламентнымиЗаданиями.ЗначенияПоУмолчаниюРегистрацияОповещенийОВизировании();
	ПараметрыЗадания	= ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	Если ТипЗнч(ПараметрыЗадания) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЗначенияПоУмолчанию, ПараметрыЗадания); 
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияПоУмолчанию, , "СогласующиеЛица");
	
	Для Каждого СтрокаТаблицы Из ЗначенияПоУмолчанию.СогласующиеЛица Цикл
		НоваяСтрока = СогласующиеЛица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыЗакрытиеДокументовПланирования()
	
	ЗначенияПоУмолчанию = Обработки.бит_УправлениеРегламентнымиЗаданиями.ЗначенияПоУмолчаниюЗакрытиеДокументовПланирования();
	ПараметрыЗадания	= ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	Если ТипЗнч(ПараметрыЗадания) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЗначенияПоУмолчанию, ПараметрыЗадания); 
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияПоУмолчанию);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыРегистрацияОповещенийОВизировании()

	НастройкаЗадания = Обработки.бит_УправлениеРегламентнымиЗаданиями.ЗначенияПоУмолчаниюРегистрацияОповещенийОВизировании();
	ЗаполнитьЗначенияСвойств(НастройкаЗадания, ЭтотОбъект);

	НастройкаЗадания.СогласующиеЛица = СогласующиеЛица.Выгрузить();
	
	ПоместитьВоВременноеХранилище(НастройкаЗадания, АдресВХранилище);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыУстановкаРешенийПоПросроченнымВизам()
	
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСоздатьДокументыПланированияИзДопУсловий()
	
	НастройкаЗадания = Обработки.бит_УправлениеРегламентнымиЗаданиями.ЗначенияПоУмолчаниюСоздатьДокументыПланированияИзДопУсловий();
	ЗаполнитьЗначенияСвойств(НастройкаЗадания, ЭтотОбъект);
	
	ПоместитьВоВременноеХранилище(НастройкаЗадания, АдресВХранилище);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыЗакрытиеДокументовПланирования()

	НастройкаЗадания = Обработки.бит_УправлениеРегламентнымиЗаданиями.ЗначенияПоУмолчаниюЗакрытиеДокументовПланирования();
	ЗаполнитьЗначенияСвойств(НастройкаЗадания, ЭтотОбъект);

	ПоместитьВоВременноеХранилище(НастройкаЗадания, АдресВХранилище);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОбязательноЗаполнятьПользователя(Форма)

	Результат = Форма.ЭтоРегистрацияОповещенийОВизировании
			ИЛИ Форма.ЭтоОтправкаОповещений
			ИЛИ Форма.ЭтоРегистрацияНапоминанийПоДоговорам
			ИЛИ Форма.ЭтоУстановкаРешенийПоПросроченнымВизам;
			  
	Возврат Результат;		  

КонецФункции

&НаКлиенте
Процедура ЗаписатьНастройкиРегламентногоЗадания()
	
	Если ЭтоРегистрацияОповещенийОВизировании Тогда
		УстановитьПараметрыРегистрацияОповещенийОВизировании();
	ИначеЕсли ЭтоУстановкаРешенийПоПросроченнымВизам Тогда
		УстановитьПараметрыУстановкаРешенийПоПросроченнымВизам();
	ИначеЕсли ЭтоСоздатьДокументыПланированияИзДопУсловий Тогда
		УстановитьПараметрыСоздатьДокументыПланированияИзДопУсловий();
	ИначеЕсли ЭтоЗакрытиеДокументовПланирования Тогда
		УстановитьПараметрыЗакрытиеДокументовПланирования();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть()

	Если ПроверитьОбязательныеРеквизиты() Тогда
		ЗаписатьНастройкиРегламентногоЗадания();
		Модифицированность = Ложь;
		Закрыть(АдресВХранилище);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьФлагиЗаданий()
	
	ЭтоРегистрацияОповещенийОВизировании 		= (ИмяМетаданных = "бит_РегистрацияОповещенийОВизировании");
	ЭтоСоздатьДокументыПланированияИзДопУсловий = (ИмяМетаданных = "бит_СоздатьДокументыПланированияИзДопУсловий");
	ЭтоОтправкаОповещений						= (ИмяМетаданных = "бит_ОтправкаОповещений");
	ЭтоРегистрацияНапоминанийПоДоговорам 		= (ИмяМетаданных = "бит_РегистрацияНапоминанийПоДоговорам");
	ЭтоУстановкаРешенийПоПросроченнымВизам 		= (ИмяМетаданных = "бит_УстановкаРешенийПоПросроченнымВизам");
	ЭтоЗакрытиеДокументовПланирования 			= (ИмяМетаданных = "бит_ЗакрытиеДокументовПланирования");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораОповещения()

	ОбработкаВизирования = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(
								Метаданные.Обработки.бит_КонсольОперативногоВизирования);

	Отбор = Новый Массив;
	Отбор.Добавить(Новый ПараметрВыбора("Отбор.ВидСобытия",	   Перечисления.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования));
	Отбор.Добавить(Новый ПараметрВыбора("Отбор.ОбъектСистемы", ОбработкаВизирования));
	
	НовыеПараметры = Новый ФиксированныйМассив(Отбор);
	Элементы.Оповещение.ПараметрыВыбора = НовыеПараметры;	

КонецПроцедуры

&НаСервере
Функция ВизируемыеОбъектыСистемы()
	
	Возврат бит_ВизированиеСервер.ВизируемыеОбъектыСистемы();
	
КонецФункции

&НаКлиенте
Функция ПроверитьОбязательныеРеквизиты()
	
	Отказ = Ложь;
	
	Если ЭтоУстановкаРешенийПоПросроченнымВизам Тогда
		Если НЕ ЗначениеЗаполнено(Решение) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",  НСтр("ru = 'Решение'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Решение", , Отказ);
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

#КонецОбласти
