
#Область ОбработчикиСобытийФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	фКэшЗначений = Новый Структура;
	фКэшЗначений.Вставить("НастройкиАналитик", Новый Соответствие);
	
	Если Параметры.Свойство("ИспользуемаяАналитика") Тогда
	 
		Если Параметры.ИспользуемаяАналитика.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Не настроена аналитика для отчета.';
						  	  	  |en = 'Do not set an analyst for the report'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 

		Для каждого КиЗ Из Параметры.ИспользуемаяАналитика Цикл

			Элементы.Аналитика.СписокВыбора.Добавить(КиЗ.Значение);

			ПарамАналитики = Новый Структура;
			ПарамАналитики.Вставить("ИмяАналитикиОтчета", КиЗ.Ключ);
			ПарамАналитики.Вставить("Аналитика"		    , КиЗ.Значение);
			ПарамАналитики.Вставить("ТипЗначения"		, ПарамАналитики.Аналитика.ТипЗначения);

			фКэшЗначений.НастройкиАналитик.Вставить(ПарамАналитики.Аналитика, ПарамАналитики);

		КонецЦикла; 

	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
	
&НаКлиенте
Процедура АналитикаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Аналитика) Тогда
		
		 ПарамАналитики = фКэшЗначений.НастройкиАналитик[Аналитика];
		 Если ПарамАналитики <> Неопределено Тогда			 
			 ЭлементыЗаполнения.ТипЗначения = ПарамАналитики.ТипЗначения;			 
		 КонецЕсли; 
		 
		 ЭлементыЗаполнения.Очистить();		
		 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыЗаполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ПроверитьВыбор(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыЗаполненияЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ПроверитьВыбор(ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	РезДанные = Новый Структура;
	РезДанные.Вставить("ИмяАналитики", "");
	РезДанные.Вставить("Аналитика", Аналитика);
	РезДанные.Вставить("ИмяРесурса", "");
	РезДанные.Вставить("ЭлементыЗаполнения", ЭлементыЗаполнения);
	
	Если ЗначениеЗаполнено(Аналитика) Тогда
		
		ПарамАналитики = фКэшЗначений.НастройкиАналитик[Аналитика];
		Если ПарамАналитики <> Неопределено Тогда		
			РезДанные.ИмяАналитики = ПарамАналитики.ИмяАналитикиОтчета;		
		КонецЕсли; 
		
	КонецЕсли; 
	
	Закрыть(РезДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоГруппе(Команда)
	
	Если ЗначениеЗаполнено(Аналитика) Тогда

		ПарамАналитики = фКэшЗначений.НастройкиАналитик[Аналитика];
		Если ПарамАналитики <> Неопределено Тогда

			ИмяФормыВыбора = ПолучитьИмяФормыВыбора(ПарамАналитики.ТипЗначения);

			Оповещение = Новый ОписаниеОповещения("ВыборГруппыЗавершение", ЭтотОбъект);
			РежимОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			ОткрытьФорму(ИмяФормыВыбора,, ЭтотОбъект,,,, Оповещение, РежимОкна);
		 
		КонецЕсли;

	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "ВыборГруппыЗавершение".
//
// Параметры:
// ВыбЗначение - Произвольный
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура ВыборГруппыЗавершение(ВыбЗначение, ДополнительныеДанные) Экспорт

	Если ВыбЗначение <> Неопределено Тогда
		ЗаполнитьПоГруппе(ВыбЗначение);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьВыбор(Знач ВыбранноеЗначение)
	
	СтандартнаяОбработка = Истина;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для каждого Эл Из ВыбранноеЗначение Цикл
			
			Если Эл.ЭтоГруппа Тогда				
				СтандартнаяОбработка = Ложь;
				ТекстСообщения = НСтр("ru='Выбор групп не доступен.';
									  |en='Group selection is not available.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Прервать;				
			КонецЕсли; 
			
		КонецЦикла; 
		
	Иначе	
		
		Если ВыбранноеЗначение.ЭтоГруппа Тогда			
			СтандартнаяОбработка = Ложь;
			ТекстСообщения = НСтр("ru='Выбор групп не доступен.';en='Group selection is not available.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат СтандартнаяОбработка;
	
КонецФункции

// Функция получает имя формы выбора.
//
// Параметры:
//  ВходящееОписание - ОписаниеТипов
//
// Возвращаемое значение:
//  Строка.
//
&НаСервере
Функция ПолучитьИмяФормыВыбора(Знач ВходящееОписание)
	
	ИмяФормыВыбора = "";
	
	Имена = бит_РаботаСМетаданными.ПолучитьИмяОбъектаПоОписаниюТипов(ВходящееОписание);
	ИмяФормыВыбора = "Справочник."+Имена.Имя+".ФормаВыбораГруппы";
		
	Возврат ИмяФормыВыбора;
	
КонецФункции

// Процедура заполняет список по группе справочника. 
//
// Параметры:
//  ГруппаСтатей - СправочникСсылка.
//
&НаСервере
Процедура ЗаполнитьПоГруппе(Знач ГруппаСтатей)

	ТекТип = ТипЗнч(ГруппаСтатей);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТекТип);
	
	ТекОписание = Новый ОписаниеТипов(МассивТипов);	
	Имена = бит_РаботаСМетаданными.ПолучитьИмяОбъектаПоОписаниюТипов(ТекОписание);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Группа", ГруппаСтатей);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабСпр.Ссылка
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК ТабСпр
	|ГДЕ
	|	ТабСпр.Ссылка В ИЕРАРХИИ(&Группа)
	|	И ТабСпр.Ссылка <> &Группа";				   
	
	// Изменяем таблицу через источник запроса.	
	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(Запрос.Текст);
	ТаблицаСхемы = Схема.ПакетЗапросов[0].ДоступныеТаблицы.Найти("Справочник."+Имена.Имя);
	Схема.ПакетЗапросов[0].Операторы[0].Источники.Заменить(0, ТаблицаСхемы); 

	Запрос.Текст = Схема.ПолучитьТекстЗапроса();		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если ЭлементыЗаполнения.НайтиПоЗначению(Выборка.Ссылка) <> Неопределено 
			 ИЛИ Выборка.Ссылка.ЭтоГруппа Тогда		
			Продолжить;		
		КонецЕсли;		
		ЭлементыЗаполнения.Добавить(Выборка.Ссылка);
	
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
