
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Основание = Параметры.Основание;
	Если ЗначениеЗаполнено(Основание) Тогда
		ОснованиеЗаполнения = Основание;
		Если ТипЗнч(Основание) = Тип("Структура") И Основание.Свойство("ШаблонВводаНаОсновании") Тогда
			ШаблонВводаНаОсновании = Основание.ШаблонВводаНаОсновании;
			ОснованиеЗаполнения    = Основание.Основание;
			Справочники.бит_ШаблоныВводаНаОсновании.ЗаполнитьПоШаблону(ШаблонВводаНаОсновании, ОснованиеЗаполнения, ЭтотОбъект);
		КонецЕсли;
		Предмет = ОснованиеЗаполнения;
	КонецЕсли;
	
	СтруктураЗадачи = Параметры.СтруктураЗадачи;
	Если ЗначениеЗаполнено(СтруктураЗадачи) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураЗадачи);
	КонецЕсли;
	
	ЗадачаОснование = Параметры.ЗадачаОснование;
	Если ЗначениеЗаполнено(ЗадачаОснование) Тогда
		Важность       = ЗадачаОснование.Важность;
		СрокИсполнения = ЗадачаОснование.СрокИсполнения;
		Наименование   = ЗадачаОснование.Наименование;
		Описание       = ЗадачаОснование.Описание;
		Предмет        = ЗадачаОснование.Предмет;
	КонецЕсли; 
	
	ЗадачаКопирование = Параметры.ЗадачаКопирование;
	Если ЗначениеЗаполнено(ЗадачаКопирование) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗадачаКопирование);
	КонецЕсли;
	
	Важность = Перечисления.бит_ВидыВажностиЗадач.Средняя;
	
	МаксКоличествоОбъектов = бит_УправлениеПроцессами.МаксимальноеКоличествоОбъектовАдресации();
	НастройкиАдресации = Справочники.бит_РолиИсполнителей.НастройкиОбъектовАдресации(РольИсполнителя);	
	
	СрокИсполнения = КонецДня(ТекущаяДатаСеанса());
	
	УстановитьВидимость();
	
	Если ЗначениеЗаполнено(ЗадачаОснование) Тогда
		Заголовок = НСтр("ru = 'Создание задачи на основании'; en = 'Creating a task based on'");
	Иначе	
		Заголовок = НСтр("ru = 'Создание задачи'; en = 'Task creation'");
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособАдресации = 0 Тогда
		
		// Адресация по исполнителю - РольИсполнителя не обязательна.
		Сч =  ПроверяемыеРеквизиты.Найти("РольИсполнителя");
		
		Если ТипЗнч(Сч) = Тип("Число") Тогда		
			ПроверяемыеРеквизиты.Удалить(Сч);		
		КонецЕсли; 
		
	ИначеЕсли СпособАдресации = 1 Тогда	
		
		// Адресация по роли - Исполнитель не обязательный.
		Сч =  ПроверяемыеРеквизиты.Найти("Исполнитель");
		
		Если ТипЗнч(Сч) = Тип("Число") Тогда		
			ПроверяемыеРеквизиты.Удалить(Сч);		
		КонецЕсли; 
		
		Для Сч = 1 По МаксКоличествоОбъектов Цикл
		
			ИмяРеквизита = "ОбъектАдресации_"+Сч;
			
			ТекНастройка = Неопределено;
			НастройкиАдресации.Свойство(ИмяРеквизита, ТекНастройка);
			
			Если ТекНастройка <> Неопределено И ТекНастройка.Обязательный Тогда			
				ПроверяемыеРеквизиты.Добавить(ИмяРеквизита);			
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РольИсполнителяПриИзменении(Элемент)
	
	ИзменениеРолиИсполнителя();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособАдресацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресации_1Очистка(Элемент, СтандартнаяОбработка)
	
	ОчисткаОбъектаАдресации("ОбъектАдресации_1");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресации_2Очистка(Элемент, СтандартнаяОбработка)
	
	ОчисткаОбъектаАдресации("ОбъектАдресации_2");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресации_3Очистка(Элемент, СтандартнаяОбработка)
	
	ОчисткаОбъектаАдресации("ОбъектАдресации_3");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСоздатьЗадачу(Команда)
	
	ЗадачаСсылка = ВыполнитьСозданиеЗадачи();
	Если ЗначениеЗаполнено(ЗадачаСсылка) Тогда
		ОповеститьОбИзменении(Тип("ЗадачаСсылка.бит_Задача"));
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗадачуПрикрепитьФайлы(Команда)
	
	СообщениеВопрос = НСтр("ru = 'В результате выполнения команды будет создана задача и осуществлен переход в форму прикрепления файлов. Продолжить?';
						   |en = 'As a result, the command will create a task, and the transition in the file attachment form. Continue?'");
		
	ОповещениеВопрос = Новый ОписаниеОповещения("СоздатьЗадачуОповещение", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеВопрос, СообщениеВопрос, РежимДиалогаВопрос.ДаНет, 30);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачуОповещение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗадачаСсылка = ВыполнитьСозданиеЗадачи();
		Если ЗначениеЗаполнено(ЗадачаСсылка) Тогда
			ОповеститьОбИзменении(Тип("ЗадачаСсылка.бит_Задача"));
			Закрыть();
			ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", Новый Структура("ВладелецФайла", ЗадачаСсылка));
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция выполняет создание задачи.
// 
// Возвращаемое значение:
//  флДействиеВыполнено - Булево.
// 
&НаСервере
Функция ВыполнитьСозданиеЗадачи()
	
	флДанныеЗаполнены = ПроверитьЗаполнение();
		
	Если флДанныеЗаполнены Тогда
		
		СтрЗадача = Задачи.бит_Задача.СтруктураЗадачи();
		ЗаполнитьЗначенияСвойств(СтрЗадача, ЭтотОбъект);
		
		ЗадачаСсылка = Задачи.бит_Задача.СоздатьНовуюЗадачу(СтрЗадача, МаксКоличествоОбъектов);
		
	КонецЕсли; 

	Возврат ЗадачаСсылка;
	
КонецФункции // ВыполнитьСозданиеЗадачи()

// Процедура управляет видимостью элементов формы. 
// 
&НаСервере
Процедура УстановитьВидимость()
	
	флЭтоАдресацияИсполнителю = СпособАдресации = 0;
	флЭтоАдресацияРоли        = СпособАдресации = 1;
	
	Элементы.Исполнитель.Видимость         = флЭтоАдресацияИсполнителю;
	Элементы.ГруппаАдресацияРоли.Видимость = флЭтоАдресацияРоли;
	
	бит_УправлениеПроцессами.НастроитьПоляОбъектовАдресации(Элементы, НастройкиАдресации, МаксКоличествоОбъектов);
	
	Элементы.ЗадачаОснование.Видимость = ЗначениеЗаполнено(ЗадачаОснование);
	
	Элементы.Виза.Видимость = ЗначениеЗаполнено(Виза);
	
КонецПроцедуры // УстановитьВидимость()

// Процедура обрабатывает изменение роли исполнителя. 
// 
&НаСервере
Процедура ИзменениеРолиИсполнителя()

	НастройкиАдресации = Справочники.бит_РолиИсполнителей.НастройкиОбъектовАдресации(РольИсполнителя);

	бит_УправлениеПроцессами.НазначитьТипыОбъектовАдресации(ЭтотОбъект, НастройкиАдресации, МаксКоличествоОбъектов);
	
	УстановитьВидимость();

КонецПроцедуры // ИзменениеРолиИсполнителя()

// Процедура осуществляет очистку объекта адресации. 
// 
// Параметры:
//  Имя - Строка.
// 
&НаКлиенте
Процедура ОчисткаОбъектаАдресации(Имя)
	
	ТекНастройка = Неопределено;
	НастройкиАдресации.Свойство(Имя, ТекНастройка);
	
	Если ТекНастройка <> Неопределено Тогда
		
		ЭтотОбъект[Имя] = ТекНастройка.Тип.ПривестиЗначение(ЭтотОбъект[Имя]);
		
	Иначе
		
		ЭтотОбъект[Имя] = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры // ОчисткаОбъектаАдресации()

#КонецОбласти
