#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс
    
// Функция формирует список доступных пользователю хозяйственных операций. 
// При необходимосить выполняется фильтрация по форме оплаты.
//
// Параметры:
//  ОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы
//  Пользователь  - СправочникСсылка.Пользователи
//  ФормаОплаты   - ПеречислениеСсылка.бит_ВидыДенежныхСредств
//
// Возвращаемое значение:
//  СписокЗначений.
//
Функция СформироватьСписокДоступныхОпераций(ОбъектСистемы, Пользователь, ФормаОплаты = Неопределено) Экспорт

	СписокОпераций = Новый СписокЗначений;
			
	Возврат СписокОпераций;
	
КонецФункции

// Процедура назначает хозяйственные операции по-умолчанию.
//
Процедура ЗаполнитьПоУмолчанию(РежимСообщений = "Ошибки") Экспорт

КонецПроцедуры
 
#КонецОбласти

#КонецЕсли
