
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Команда") Тогда		
    	ТекстСообщения = НСтр("ru='Непосредственное открытие этой формы не предусмотрено.
								  |Для открытия формы можно воспользоваться командой ""Изменить"" в формах документов.';
							  |en='The immediate opening of this form is not provided.
								  |To open the form, you can use the command ""Edit"" in the forms of documents.'");
   		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	КлючОбъекта = Параметры.Команда;
	
	ЗаполнитьКэшЗначений();
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправленияИзменениеТабЧастиДанныеБюджета(Элементы);
	УстановитьВидимость();
	СформироватьСписокАналитик();
	НачальноеЗаполнениеАналитик();
	ЗаполнитьДобавленныеКолонкиТаблиц();
	Объект.ТипОперации = "ИзменитьРеквизиты";

	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Объект.АналитикиТЧ.Выгрузить(), 
									Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЕстьНесохраненныеДанные И НЕ ПрограммноеЗакрытие Тогда

		ТекстПредупреждения = НСтр("ru = 'Есть не сохраненные изменения. Закрыть без сохранения?'; 
									|en = 'There are not saved changes. Close without saving?'");
		
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(ЭтотОбъект,
			Отказ, ЗавершениеРаботы, ТекстПредупреждения, "ПрограммноеЗакрытие");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОперацииПриИзменении(Элемент)
	
	Если Объект.ТипОперации = "ИзменитьРеквизиты" Тогда
		Элементы.ГруппаШапка.Видимость = Истина;
	Иначе
		Элементы.ГруппаШапка.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАналитики

&НаКлиенте
Процедура АналитикиЗначениеАналитикиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Аналитики.ТекущиеДанные;
	ТекущиеДанные.Выполнять = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиАналитикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("АналитикиАналитикаНачалоВыбораЗавершение", ЭтотОбъект);
	ПоказатьВыборИзСписка(Оповещение, СписокАналитик);
	
КонецПроцедуры

// Обработчик завершения открытия формы списка значений.
//  См. Синтакс-помощник: ПоказатьВыборИзСписка().
// 
&НаКлиенте 
Процедура АналитикиАналитикаНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = Элементы.Аналитики.ТекущиеДанные;
	Если РезультатВыбора <> Неопределено Тогда
		ТекущиеДанные.Аналитика = РезультатВыбора.Представление;
		ТекущиеДанные.Реквизит 	= РезультатВыбора.Значение;
		ИзменениеАналитики(ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиЗначениеАналитикиНачальноеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Аналитики.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.Реквизит) Тогда
		Возврат;
	КонецЕсли; 
	
	Элемент.ОграничениеТипа = Новый ОписаниеТипов;
	Элемент.ВыбиратьТип = Ложь;
	Если ВзятьТекущее(ТекущиеДанные.ЗначениеАналитикиНачальное) Тогда		
		ОписаниеТиповАналитики = СоответствиеАналитик[ТекущиеДанные.Реквизит];
		ТекущиеДанные.ЗначениеАналитикиНачальное = ОписаниеТиповАналитики.ПривестиЗначение(ТекущиеДанные.ЗначениеАналитикиНачальное);
		Элемент.ВыбиратьТип = ТекущиеДанные.ЗначениеАналитикиНачальное = Неопределено;
		Элемент.ОграничениеТипа = ОписаниеТиповАналитики; 
	КонецЕсли; 
	
	ТекущиеДанные.Выполнять = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиЗначениеАналитикиНачальноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.Реквизит) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.ЗначениеАналитикиНачальное = Неопределено Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов;
		Элемент.ВыбиратьТип = Ложь;
		Если ВзятьТекущее(ТекущиеДанные.ЗначениеАналитикиНачальное) Тогда		
			ОписаниеТиповАналитики = СоответствиеАналитик[ТекущиеДанные.Реквизит];
			Элемент.ВыбиратьТип = ТекущиеДанные.ЗначениеАналитикиНачальное = Неопределено;
			Элемент.ОграничениеТипа = ОписаниеТиповАналитики; 
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиЗначениеАналитикиНачальноеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.Реквизит) Тогда
		Возврат;
	КонецЕсли; 
	Если ТипЗнч(ТекущиеДанные.ЗначениеАналитикиНачальное) = Тип("ПеречислениеСсылка.бит_СпособыИзмененияНачальногоЗначенияТабличнойЧасти") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыИзмененияНачальногоЗначенияТабличнойЧасти");
		Элемент.ВыбиратьТип = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыИзмененияНачальногоЗначенияТабличнойЧасти.ВсеЗначения"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыИзмененияНачальногоЗначенияТабличнойЧасти.ПустоеЗначение"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_СпособыИзмененияНачальногоЗначенияТабличнойЧасти.ТекущееЗначение"));
	Иначе	
		ОписаниеТиповАналитики = СоответствиеАналитик[ТекущиеДанные.Реквизит];
		Элемент.ВыбиратьТип = ТекущиеДанные.ЗначениеАналитикиНачальное = Неопределено;
		Элемент.ОграничениеТипа = ОписаниеТиповАналитики;
	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура АналитикиЗначениеАналитикиНачальноеОчистка(Элемент, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Аналитики.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	Элемент.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыИзмененияНачальногоЗначенияТабличнойЧасти");
	Элемент.ВыбиратьТип = Ложь;
	ТекущиеДанные.ЗначениеАналитикиНачальное = СпособыИзмененияТабЧастиВсеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИнвертироватьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.АналитикиТЧ, "Выполнять", 2, Элементы.АналитикиТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.АналитикиТЧ, "Выполнять", 0, Элементы.АналитикиТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.АналитикиТЧ, "Выполнять", 1, Элементы.АналитикиТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТЧДокумента(Команда)
	
	ОбработатьТаблицу(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТЧДокументаИЗакрыть(Команда)
	
	ОбработатьТаблицу(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	ЗавершитьРедактирование();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаТаблицыДокумента

&НаКлиенте
Процедура ОбработатьТаблицу(Закрыть)

	Отказ = Ложь;

	// Не используется поиск в табличной части, что бы не делать неявный серверный вызов.
	РеквизитыДляЗамены = Новый Массив;
	Если Объект.ТипОперации = "ИзменитьРеквизиты" Тогда
		Для каждого СтрокаТаблицы Из Объект.Аналитики Цикл
			Если СтрокаТаблицы.Выполнять Тогда
				РеквизитыДляЗамены.Добавить(СтрокаТаблицы.ПолучитьИдентификатор());		
			КонецЕсли;
		КонецЦикла;
		
		Если РеквизитыДляЗамены.Количество() = 0 Тогда
			ТекстПояснения = НСтр("ru='Не выбраны реквизиты для замены.';en='Not selected for replacement details.'");
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , "Корректность",,, 
								НСтр("ru = 'Реквизиты документа'; en = 'Document Attributes'"), ТекстПояснения);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Аналитики", "Объект", Отказ);
		КонецЕсли; 
	КонецЕсли;
	
	// Не используется поиск в табличной части, что бы не делать неявный серверный вызов.
	СтрокиДляЗамены = Новый Массив;
	Для каждого СтрокаТаблицы Из Объект.АналитикиТЧ Цикл
		Если СтрокаТаблицы.Выполнять Тогда
			СтрокиДляЗамены.Добавить(СтрокаТаблицы.ПолучитьИдентификатор());		
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиДляЗамены.Количество() = 0 Тогда
		ТекстПояснения = НСтр("ru='Не выбраны строки для замены в табличной части.';
							  |en='Not selected line replacement in the dimension tables.'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , "Корректность",,, 
							НСтр("ru = 'Табличная часть документа'; en = 'Document Tabular Section'"), ТекстПояснения);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "АналитикиТЧ", "Объект", Отказ);	
	КонецЕсли; 

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьНесохраненныеДанные = Истина;
	
	ОбработатьТаблицуНаСервере(СтрокиДляЗамены, РеквизитыДляЗамены);
	ПараметрОповещения = Новый Структура;
	ПараметрОповещения.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	ПараметрОповещения.Вставить("ИмяТабличнойЧасти", 		 ИмяТабличнойЧасти);

	Если Закрыть Тогда
		ЗавершитьРедактирование();
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуНаСервере(СтрокиДляЗамены, РеквизитыДляЗамены)

	Если Объект.ТипОперации = "ИзменитьРеквизиты" Тогда
		ИзменитьРеквизитыТаблицы(СтрокиДляЗамены, РеквизитыДляЗамены);
	Иначе	
		ИнвертироватьКоличествоСумму(СтрокиДляЗамены)
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРеквизитыТаблицы(СтрокиДляЗамены, РеквизитыДляЗамены)
		
	СпособыЗаполнения = Перечисления.бит_СпособыИзмененияНачальногоЗначенияТабличнойЧасти;
	Для каждого РеквизитДляЗамены Из РеквизитыДляЗамены Цикл
		ДанныеДляЗамены = Объект.Аналитики.НайтиПоИдентификатору(РеквизитДляЗамены);
		Если НЕ ЗначениеЗаполнено(ДанныеДляЗамены.Реквизит) Тогда
			Продолжить;
		КонецЕсли;	
		
		Для каждого СтрокаДляЗамены Из СтрокиДляЗамены Цикл
			СтрокаТаблицы = Объект.АналитикиТЧ.НайтиПоИдентификатору(СтрокаДляЗамены); 
			Если ДанныеДляЗамены.ЗначениеАналитикиНачальное = СпособыЗаполнения.ВсеЗначения Тогда					
				ИзменитьРеквизитыСтроки(СтрокаТаблицы, ДанныеДляЗамены, 
					КэшЗначений.НастройкиИзмеренийБюджетирования);					
			ИначеЕсли ДанныеДляЗамены.ЗначениеАналитикиНачальное = СпособыЗаполнения.ПустоеЗначение
				И НЕ ЗначениеЗаполнено(СтрокаТаблицы[ДанныеДляЗамены.Реквизит]) Тогда 					
				ИзменитьРеквизитыСтроки(СтрокаТаблицы, ДанныеДляЗамены, 
					КэшЗначений.НастройкиИзмеренийБюджетирования);					
			ИначеЕсли СтрокаТаблицы[ДанныеДляЗамены.Реквизит] = ДанныеДляЗамены.ЗначениеАналитикиНачальное Тогда					
				ИзменитьРеквизитыСтроки(СтрокаТаблицы, ДанныеДляЗамены, 
					КэшЗначений.НастройкиИзмеренийБюджетирования);
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ИзменитьРеквизитыСтроки(СтрокаТаблицы, ДанныеДляЗамены, ИзмеренияБюджетирования)

	Если ЗначениеЗаполнено(СтрокаТаблицы.СтатьяОборотов) И ИзмеренияБюджетирования[ДанныеДляЗамены.Реквизит] <> Неопределено Тогда
		ИмяРеквизитаУчета = СтрШаблон("Учет_%1", ДанныеДляЗамены.Реквизит);
		ЕстьРеквизитУчета = ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизитаУчета, СтрокаТаблицы.СтатьяОборотов.Метаданные());
		Если ЕстьРеквизитУчета И НЕ СтрокаТаблицы.СтатьяОборотов[ИмяРеквизитаУчета] Тогда
			// Если по такому разрезу не ведется учет, значит можно пропустить.
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	СтрокаТаблицы[ДанныеДляЗамены.Реквизит] = ДанныеДляЗамены.ЗначениеАналитики;
	
КонецПроцедуры 

&НаСервере
Процедура ИнвертироватьКоличествоСумму(СтрокиДляЗамены)
	
	Для каждого СтрокаДляЗамены Из СтрокиДляЗамены Цикл
		СтрокаТаблицы = Объект.АналитикиТЧ.НайтиПоИдентификатору(СтрокаДляЗамены);
		СтрокаТаблицы.Сумма	 	 = - СтрокаТаблицы.Сумма;
		СтрокаТаблицы.Количество = - СтрокаТаблицы.Количество;
	КонецЦикла; 
	
КонецПроцедуры
	
#КонецОбласти // ОбработкаТаблицыДокумента

&НаКлиенте
Процедура ЗавершитьРедактирование()

	РезультатИзменения = Неопределено;
	
	Если ЕстьНесохраненныеДанные Тогда
		ЕстьНесохраненныеДанные = Ложь;
		ПрограммноеЗакрытие		= Истина;
		
		ЗавершитьРедактированиеНаСервере();
		
		РезультатИзменения = Новый Структура;
		РезультатИзменения.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
		РезультатИзменения.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
		
	КонецЕсли;

	Закрыть(РезультатИзменения);

КонецПроцедуры

&НаСервере
Процедура ЗавершитьРедактированиеНаСервере()

	ПоместитьВоВременноеХранилище(Объект.АналитикиТЧ.Выгрузить(), АдресВоВременномХранилище);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшЗначений()

	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("НастройкиИзмерений", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	КэшЗначений.Вставить("ИзмеренияДоп", бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним"));
	КэшЗначений.Вставить("НастройкиИзмеренийБюджетирования", бит_Бюджетирование.НастройкиИзмеренийБюджетирования());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	ОтобразитьДополнительныеИзмерения(Параметры.Команда);
	ИмяТабличнойЧасти = Параметры.ИмяТабличнойЧасти;
	Если ЭтоАдресВременногоХранилища(Параметры.ТабличнаяЧасть) Тогда
		
		ТаблицаДокумента 	 = ПолучитьИзВременногоХранилища(Параметры.ТабличнаяЧасть);
		РеквизитыОбработки	 = Объект.АналитикиТЧ.Выгрузить().Колонки;
		ДобавляемыеРеквизиты = Новый Массив();

		Для каждого Колонка Из ТаблицаДокумента.Колонки Цикл
			Если РеквизитыОбработки.Найти(Колонка.Имя) = Неопределено Тогда
				НовыйРеквизит = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "Объект.АналитикиТЧ");
				ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
			КонецЕсли; 
		КонецЦикла;
		Если ДобавляемыеРеквизиты.Количество() <> 0 Тогда
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);		
		КонецЕсли; 
		Объект.АналитикиТЧ.Загрузить(ТаблицаДокумента);
		
	КонецЕсли; 
	
	// Для ERP.
	Для каждого Элемент Из КэшЗначений.НастройкиИзмеренийБюджетирования Цикл
		Если Элементы.АналитикиТЧ.ПодчиненныеЭлементы.Найти("АналитикиТЧГруппа"+Элемент.Ключ) <> Неопределено Тогда
			Элементы.АналитикиТЧ.ПодчиненныеЭлементы["АналитикиТЧГруппа"+Элемент.Ключ].Видимость = Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	// Скопируем настройку видимости колонок из оригинальной формы.
	Если ТипЗнч(Параметры.ВидимостьАналитик) = Тип("Структура") Тогда
		Для каждого КлючЗначение Из Параметры.ВидимостьАналитик Цикл
			ЭлементФормы = Элементы.Найти("АналитикиТЧ" + КлючЗначение.Ключ);
			Если ЭлементФормы <> Неопределено Тогда
				ЭлементФормы.Видимость = КлючЗначение.Значение;			
			КонецЕсли; 		
		КонецЦикла; 
	КонецЕсли;
	
	Если КлючОбъекта = "бит_БюджетнаяОперация" Тогда
		Элементы.ТипОперации.Видимость = Истина;
	Иначе
		Элементы.ТипОперации.Видимость = Ложь;
	КонецЕсли;
	
	Если КлючОбъекта = "бит_УстановкаЗависимыхОборотов" Тогда
		Элементы.АналитикиТЧПериод_Старый.Видимость    = Ложь;
		Элементы.АналитикиТЧПериод.Видимость           = Ложь;
		Элементы.АналитикиТЧГруппаКоличество.Видимость = Ложь;
		Элементы.АналитикиТЧГруппаСтавкаНДС.Видимость  = Ложь;
		Элементы.АналитикиТЧГруппаСценарий.Видимость   = Ложь;
		Элементы.АналитикиТЧГруппаСуммаРегл.Видимость  = Ложь;
		Элементы.АналитикиТЧГруппаСуммаУпр.Видимость   = Ложь;
		Элементы.АналитикиТЧСумма_Старый.Видимость     = Ложь;
		Элементы.АналитикиТЧСумма.Видимость            = Ложь;
		Элементы.АналитикиТЧГруппаВалюта.Видимость     = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьДополнительныеИзмерения(ИмяДокумента)
	
	// Подготовка параметров, необходимых для отображения доп. измерений.
	ПараметрыГрупп = Новый Соответствие;
	ПараметрыПолей = Новый Соответствие;
	Для каждого ТекЭлемент Из КэшЗначений.ИзмеренияДоп Цикл
		
		СтруктураИмен = Новый Структура;
		СтруктураИмен.Вставить("ИмяПоля" , "АналитикиТЧГруппа" + ТекЭлемент.Ключ);
		СтруктураИмен.Вставить("Префикс" , "");
		СтруктураИмен.Вставить("Постфикс", "");
		
		ПараметрыГрупп.Вставить(ТекЭлемент.Ключ, СтруктураИмен);
		
		СтруктураИмен = Новый Структура;
		СтруктураИмен.Вставить("ИмяПоля" , "АналитикиТЧ" + ТекЭлемент.Ключ + "_Старый");
		СтруктураИмен.Вставить("Префикс" , "");
		СтруктураИмен.Вставить("Постфикс", " " + НСтр("ru='(старый)';en='(old)'"));
		
		ПараметрыПолей.Вставить(ТекЭлемент.Ключ, СтруктураИмен);
		
	КонецЦикла;
	
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(
		ЭтотОбъект, "АналитикиТЧ", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
																	
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(
		ЭтотОбъект, "АналитикиТЧ", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений, ПараметрыГрупп);
	
	Если ИмяДокумента <> "бит_КорректировкаБюджета" Тогда
		Для каждого Эл Из Элементы.АналитикиТЧ.ПодчиненныеЭлементы Цикл
			Если ТипЗнч(Эл) = Тип("ГруппаФормы") Тогда
				Для каждого ЭлемГруппы Из Эл.ПодчиненныеЭлементы Цикл
					Если Найти(ВРег(ЭлемГруппы.Имя), ВРег("_Старый"))>0 Тогда
						ЭлемГруппы.Видимость = Ложь;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		КонецЦикла;
		Элементы.АналитикиТЧГруппаНадписи.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НачальноеЗаполнениеАналитик()

	ОсновныеАналитики = Новый Массив();
	Если КлючОбъекта <> "бит_УстановкаЗависимыхОборотов" Тогда
		ОсновныеАналитики.Добавить("Период");
	КонецЕсли;
	ОсновныеАналитики.Добавить("ЦФО");
	Если КлючОбъекта <> "бит_УстановкаЗависимыхОборотов" Тогда
		ОсновныеАналитики.Добавить("СтатьяОборотов");
	КонецЕсли;
	
	Для каждого Элемент Из ОсновныеАналитики Цикл
		ЭлементСписка = СписокАналитик.НайтиПоЗначению(Элемент); 
		Если ЭлементСписка <> Неопределено Тогда
			НоваяСтрока = Объект.Аналитики.Добавить();
			НоваяСтрока.Аналитика = ЭлементСписка.Представление;
			НоваяСтрока.Реквизит  = ЭлементСписка.Значение;
			ИзменениеАналитики(НоваяСтрока.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Процедура СформироватьСписокАналитик()

	Контейнер = Новый Соответствие;
	СписокАналитик = Новый СписокЗначений();
	
	Если Элементы.АналитикиТЧПериод.Видимость Тогда
		СписокАналитик.Добавить("Период", "Период");
		Контейнер.Вставить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	КонецЕсли;
				
	Для каждого Колонка Из КэшЗначений.НастройкиИзмеренийБюджетирования Цикл
		Если Колонка.Значение <> Неопределено Тогда
			// Список разрезов бюджета зависит от видимости колонок.
			ЭлементФормы = Элементы.Найти("АналитикиТЧ" + Колонка.Ключ);
			Если ЭлементФормы <> Неопределено И ЭлементФормы.Видимость Тогда
				СписокАналитик.Добавить(Колонка.Ключ, Колонка.Значение.Синоним);
				Контейнер.Вставить(Колонка.Ключ, Колонка.Значение.ТипЗначения);
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Элементы.АналитикиТЧСумма.Видимость Тогда
		СписокАналитик.Добавить("Сумма", "Сумма");
		Контейнер.Вставить("Сумма", РаботаСКурсамиВалют.ОписаниеТипаДенежногоПоля());
	КонецЕсли;
	
	СоответствиеАналитик = Новый ФиксированноеСоответствие(Контейнер);
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеАналитики(ИдСтроки)
	
	ТекущаяСтрока = Объект.Аналитики.НайтиПоИдентификатору(ИдСтроки);
	ДозаполнитьСтрокуАналитик(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ДозаполнитьСтрокуАналитик(ТекущаяСтрока)

	Если ТекущаяСтрока <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Аналитика) Тогда
			ОписаниеТиповАналитики = СоответствиеАналитик[ТекущаяСтрока.Реквизит];
			ТекущаяСтрока.ЗначениеАналитики = ОписаниеТиповАналитики.ПривестиЗначение(ТекущаяСтрока.ЗначениеАналитики);
			ТекущаяСтрока.ЗначениеАналитикиНачальное = Перечисления.бит_СпособыИзмененияНачальногоЗначенияТабличнойЧасти.ВсеЗначения;
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте 
Функция ВзятьТекущее(Значение)
	
	ВзятьТекущее = (Значение = 
		ПредопределенноеЗначение("Перечисление.бит_СпособыИзмененияНачальногоЗначенияТабличнойЧасти.ТекущееЗначение"));
		
 	Возврат ВзятьТекущее;
	
КонецФункции

&НаКлиенте  
Функция СпособыИзмененияТабЧастиВсеЗначения()

	Возврат ПредопределенноеЗначение("Перечисление.бит_СпособыИзмененияНачальногоЗначенияТабличнойЧасти.ВсеЗначения");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНадписиВСтроке(ТекущаяСтрока)

	ТекущаяСтрока.НадписиНовоеЗначение = НСтр("ru='после изменения:';en='after the change:'");
	ТекущаяСтрока.НадписиСтароеЗначение = НСтр("ru='до изменения:';en='before the change:'");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	Для каждого СтрокаТаблицы Из Объект.АналитикиТЧ Цикл
		ЗаполнитьНадписиВСтроке(СтрокаТаблицы);
	КонецЦикла; 	

КонецПроцедуры

&НаКлиенте
Процедура АналитикиЗначениеАналитикиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ТекущиеДанные.Реквизит,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений, "ЗначениеАналитики");
    
КонецПроцедуры

&НаКлиенте
Процедура АналитикиЗначениеАналитикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	Если бит_МеханизмДопИзмеренийКлиент.ЭтоАналитикаБанковскийСчет(ТекущиеДанные.Реквизит, КэшЗначений.НастройкиИзмерений) Тогда
	  	бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(ТекущиеДанные, СтандартнаяОбработка, "ЗначениеАналитики");	
	Иначе	
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ТекущиеДанные.Реквизит,
			СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений, "ЗначениеАналитики");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиЗначениеАналитикиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, ТекущиеДанные, ТекущиеДанные.Реквизит,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры

#КонецОбласти
