
&НаКлиенте
Процедура МаркаПриИзменении(Элемент)

	// {{ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [23.08.2024] +        
	
	УстановитьНаименование();
	
	// }}ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [23.08.2024] -
		
КонецПроцедуры

&НаКлиенте
Процедура ГосударственныйНомерПриИзменении(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [23.08.2024] +        
	
	УстановитьНаименование();
	
	// }}ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [23.08.2024] -
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаименование()

	// {{ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [23.08.2024] +        
	
	Объект.Наименование = Строка(Объект.Марка) + " " + Строка(Объект.ГосударственныйНомер);
	
	// }}ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [23.08.2024] -

КонецПроцедуры