
&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ9.3]  [VUVaynula@1cbit.ru] [26.07.2025 21:09:01] +  
	Группа = Элементы.Вставить("бит_ГруппаРекламации", Тип("ГруппаФормы"), Элементы.ГруппаОсновное, Элементы.Комментарий);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.ОтображатьЗаголовок = Ложь; 
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;

	НовыйЭлемент = Элементы.Добавить("бит_ПризнаниеРекламации", Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ПризнаниеРекламации";
	
	НовыйЭлемент = Элементы.Добавить("бит_ВидДокумента", Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВидДокумента"; 
	// ---------------------------------------------------------------------------------------------------
	ГруппаПереписка = Элементы.Вставить("бит_Переписка", Тип("ГруппаФормы"), Элементы.ГруппаОсновное, Элементы.Комментарий);
	ГруппаПереписка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПереписка.Заголовок = "(бит) Переписка";
	ГруппаПереписка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаПереписка.ОтображатьЗаголовок = Истина; 
	ГруппаПереписка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПереписка.РастягиватьПоГоризонтали = Истина;
	
	ГруппаПерепискаЛево = ЭтаФорма.Элементы.Добавить("бит_ГруппаПерепискаЛево", Тип("ГруппаФормы"), ГруппаПереписка);
	ГруппаПерепискаЛево.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПерепискаЛево.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаПерепискаЛево.ОтображатьЗаголовок = Ложь; 
	ГруппаПерепискаЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ГруппаПерепискаПраво = ЭтаФорма.Элементы.Добавить("бит_ГруппаПерепискаПраво", Тип("ГруппаФормы"), ГруппаПереписка);
	ГруппаПерепискаПраво.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПерепискаПраво.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаПерепискаПраво.ОтображатьЗаголовок = Ложь; 
	ГруппаПерепискаПраво.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;   
	
	НовыйЭлемент = Элементы.Добавить("бит_НомерВходящего", Тип("ПолеФормы"), ГруппаПерепискаЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НомерВходящего";
	
	НовыйЭлемент = Элементы.Добавить("бит_ДатаВходящего", Тип("ПолеФормы"), ГруппаПерепискаПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ДатаВходящего";
	
	НовыйЭлемент = Элементы.Добавить("бит_НомерИсходящего", Тип("ПолеФормы"), ГруппаПерепискаЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НомерИсходящего";
	
	НовыйЭлемент = Элементы.Добавить("бит_ДатаИсходящего", Тип("ПолеФормы"), ГруппаПерепискаПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ДатаИсходящего";  
	// ---------------------------------------------------------------------------------------------------                  
	СписокРеквизитовСтрокой = "бит_НесоответствиеПоПретензии,бит_ФактическиВозвращеноКг,бит_ТипТары,бит_КоличествоТары,";
	СписокРеквизитовСтрокой = СписокРеквизитовСтрокой + "бит_ДатаИзготовления,бит_Машина,бит_Ход,бит_Смена,бит_ОкончательныйБракКг,";
	СписокРеквизитовСтрокой = СписокРеквизитовСтрокой + "бит_ФактическиСданоНаСкладКг,бит_ПеремаркированоВ,бит_ФактическийТипТары";
	МассивЭлементов = СтрРазделить(СписокРеквизитовСтрокой, ",");
	Для каждого стр из МассивЭлементов Цикл  
		НовыйЭлемент  = Элементы.Добавить("ВозвращаемыеТовары" + стр, Тип("ПолеФормы"), Элементы.ВозвращаемыеТовары);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
		НовыйЭлемент.ПутьКДанным = "Объект.ВозвращаемыеТовары." + стр;
	КонецЦикла;
	// ---------------------------------------------------------------------------------------------------
	СтраницаАнализ = Элементы.Вставить("бит_ГруппаАнализ", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы, Элементы.ГруппаЗаменяющиеТовары);
	СтраницаАнализ.Вид = ВидГруппыФормы.Страница;
	СтраницаАнализ.Заголовок = "(бит) Анализ"; 
	// ---------------------------------------------------------------------------------------------------
	Группа = Элементы.Добавить("бит_ГруппаАнализДаты", Тип("ГруппаФормы"), СтраницаАнализ);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.ОтображатьЗаголовок = Ложь; 
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;

	НовыйЭлемент = Элементы.Добавить("бит_ДатаСоставленияАкта", Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ДатаСоставленияАкта";
	
	НовыйЭлемент = Элементы.Добавить("бит_ДатаПоступления", Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ДатаПоступления";
	
	Группа = Элементы.Добавить("бит_ГруппаАнализНарушения", Тип("ГруппаФормы"), СтраницаАнализ);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.ОтображатьЗаголовок = Ложь; 
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;

	НовыйЭлемент = Элементы.Добавить("бит_НарушенияПриТранспортировкеВозврата", Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НарушенияПриТранспортировкеВозврата";
	
	НовыйЭлемент = Элементы.Добавить("бит_МестоОбнаруженияДефекта", Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_МестоОбнаруженияДефекта";
	
	Группа = Элементы.Добавить("бит_ГруппаАнализДефекты", Тип("ГруппаФормы"), СтраницаАнализ);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.ОтображатьЗаголовок = Ложь; 
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	ГруппаАнализЛево = Элементы.Добавить("бит_ГруппаАнализЛево", Тип("ГруппаФормы"), Группа);
	ГруппаАнализЛево.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАнализЛево.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаАнализЛево.ОтображатьЗаголовок = Ложь; 
	ГруппаАнализЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	ГруппаАнализПраво = Элементы.Добавить("бит_ГруппаАнализПраво", Тип("ГруппаФормы"), Группа);
	ГруппаАнализПраво.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАнализПраво.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаАнализПраво.ОтображатьЗаголовок = Ложь; 
	ГруппаАнализПраво.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	НовыйЭлемент = Элементы.Добавить("бит_НаименованиеДефекта", Тип("ПолеФормы"), ГруппаАнализЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НаименованиеДефекта";
	НовыйЭлемент.МногострочныйРежим = Истина;
	
	НовыйЭлемент = Элементы.Добавить("бит_ПричинаДефекта", Тип("ПолеФормы"), ГруппаАнализПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ПричинаДефекта";
	НовыйЭлемент.МногострочныйРежим = Истина;
	
	НовыйЭлемент = Элементы.Добавить("бит_МероприятияПоПредупреждениюДефекта", Тип("ПолеФормы"), ГруппаАнализЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_МероприятияПоПредупреждениюДефекта";
	НовыйЭлемент.МногострочныйРежим = Истина;
	
	НовыйЭлемент = Элементы.Добавить("бит_ЗаключениеКомиссии", Тип("ПолеФормы"), ГруппаАнализПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ЗаключениеКомиссии";
	НовыйЭлемент.МногострочныйРежим = Истина;
	// --------------------------------------------------------
	Группа = Элементы.Добавить("бит_ГруппаАнализПодвал", Тип("ГруппаФормы"), СтраницаАнализ);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.ОтображатьЗаголовок = Ложь; 
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	НовыйЭлемент = Элементы.Добавить("бит_ИнженерТехнолог", Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ИнженерТехнолог";
	
	НовыйЭлемент = Элементы.Добавить("бит_МастерКонтрольный", Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_МастерКонтрольный";
	
	НовыйЭлемент = Элементы.Добавить("бит_МенеджерПоКачествуИСертификации", Тип("ПолеФормы"), Группа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_МенеджерПоКачествуИСертификации"; 
	// ---------------------------------------------------------------------------------------------------
	СтраницаВиновники = Элементы.Вставить("бит_ГруппаВиновники", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы, Элементы.СтраницаДоставка);
	СтраницаВиновники.Вид = ВидГруппыФормы.Страница;
	СтраницаВиновники.Заголовок = "(бит) Виновники"; 
    // ---------------------------------------------------------------------------------------------------
	ТаблицаВиновники = Элементы.Добавить("бит_Виновники", Тип("ТаблицаФормы"), СтраницаВиновники);
	ТаблицаВиновники.ПутьКДанным = "Объект.бит_Виновники"; 
	// ---------------------------------------------------------------------------------------------------
	НовыйЭлемент  = Элементы.Добавить("бит_Виновники" + "Номенклатура", Тип("ПолеФормы"), ТаблицаВиновники);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Виновники." + "Номенклатура";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ВиновникиНоменклатураПриИзменении");
		
	СписокРеквизитовСтрокой = "НесоответствиеПоПретензии,ФактическиВозвращеноКг,ОкончательныйБракКг,БракПоВинеРаботникаКг,";
	СписокРеквизитовСтрокой = СписокРеквизитовСтрокой + "СдалиВОтходыПоВинеРаботникаКг,ФИО,";  
	// {{ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 15:04:46] +        
	СписокРеквизитовСтрокой = СписокРеквизитовСтрокой + "ПолнаяСебестоимость,СтоимостьВозможногоИспользованияЗаЕдИзм,";  
	СписокРеквизитовСтрокой = СписокРеквизитовСтрокой + "СтоимостьОкончательногоБракаПоВинеРаботника,СтоимостьИсправимогоБракаПоВинеРаботника";  
	// }}ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 15:04:46] -
	МассивЭлементов = СтрРазделить(СписокРеквизитовСтрокой, ",");
	Для каждого стр из МассивЭлементов Цикл  
		НовыйЭлемент  = Элементы.Добавить("бит_Виновники" + стр, Тип("ПолеФормы"), ТаблицаВиновники);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
		НовыйЭлемент.ПутьКДанным = "Объект.бит_Виновники." + стр;
	КонецЦикла;
	// }}ПервыйБИТ ЛистТребований [ЛТ9.3]  [VUVaynula@1cbit.ru] [26.07.2025 21:09:01] -
	
	// {{ПервыйБИТ ЛистТребований [9.7]  [VUVaynula@1cbit.ru] [26.07.2025 21:57:24] +        
	ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов
	НовыйРеквизит = Новый РеквизитФормы("бит_НомерАктаСрезки", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(4, 0, ДопустимыйЗнак.Неотрицательный))); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
	НовыйЭлемент = Элементы.Добавить("бит_НомерАктаСрезки", Тип("ПолеФормы"), СтраницаАнализ);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_НомерАктаСрезки"; 
	НовыйЭлемент.ТолькоПросмотр = Истина; 
	
	Если Не Параметры.Ключ.Пустая() Тогда
		ЭтаФорма.бит_НомерАктаСрезки = Документы.ЗаявкаНаВозвратТоваровОтКлиента.НайтиНомерАктаСрезки(Объект.Ссылка);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [9.7]  [VUVaynula@1cbit.ru] [26.07.2025 21:57:24] - 
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 15:06:13] +        
	Элементы.бит_ВиновникиСдалиВОтходыПоВинеРаботникаКг.УстановитьДействие("ПриИзменении", "бит_ВиновникиСдалиВОтходыПоВинеРаботникаКгПриИзменении");
	Элементы.бит_ВиновникиПолнаяСебестоимость.УстановитьДействие("ПриИзменении", "бит_ВиновникиПолнаяСебестоимостьПриИзменении");
	Элементы.бит_ВиновникиСтоимостьВозможногоИспользованияЗаЕдИзм.УстановитьДействие("ПриИзменении", "СтоимостьВозможногоИспользованияЗаЕдИзмПриИзменении");
	// }}ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 15:06:13] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ВиновникиСдалиВОтходыПоВинеРаботникаКгПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 17:10:27] +        
	ТД = Элементы.бит_Виновники.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ПересчитатьСтоимостьОкончательногоБракаПоВинеРаботника(ТД);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 17:10:27] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ВиновникиПолнаяСебестоимостьПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 17:10:27] +        
	ТД = Элементы.бит_Виновники.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ПересчитатьСтоимостьОкончательногоБракаПоВинеРаботника(ТД);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 17:10:27] -
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьВозможногоИспользованияЗаЕдИзмПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 17:10:27] +        
	ТД = Элементы.бит_Виновники.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ПересчитатьСтоимостьОкончательногоБракаПоВинеРаботника(ТД);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 17:10:27] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ВиновникиНоменклатураПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ9.3]  [VUVaynula@1cbit.ru] [26.07.2025 21:44:36] +        
	ТД = Элементы.бит_Виновники.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТД.Номенклатура) Тогда
			мСтрок = Объект.ВозвращаемыеТовары.НайтиСтроки(Новый Структура("Номенклатура", ТД.Номенклатура));	
			Если мСтрок.Количество() Тогда
				ТД.НесоответствиеПоПретензии = мСтрок[0].бит_НесоответствиеПоПретензии;
				ТД.ФактическиВозвращеноКг 	 = мСтрок[0].бит_ФактическиВозвращеноКг;
				ТД.ОкончательныйБракКг 		 = мСтрок[0].бит_ОкончательныйБракКг;
			КонецЕсли;
			// {{ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 15:09:06] +        
			ТД.ПолнаяСебестоимость 		 =  бит_РассчитатьПолнуюСебестоимостьПоРС(ТД.Номенклатура, ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ОбщегоНазначенияКлиентСервер.датаДатаТекущаяДатаСеанса()));
			// }}ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 15:09:06] -
		Иначе
			ТД.НесоответствиеПоПретензии = "";
			ТД.ФактическиВозвращеноКг 	 = 0;
			ТД.ОкончательныйБракКг 		 = 0;
			ТД.ПолнаяСебестоимость 		 = 0; // {{ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 15:08:02]
		КонецЕсли;
	КонецЕсли;  
	ПересчитатьСтоимостьОкончательногоБракаПоВинеРаботника(ТД);
	// }}ПервыйБИТ ЛистТребований [ЛТ9.3]  [VUVaynula@1cbit.ru] [26.07.2025 21:44:36] -
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьОкончательногоБракаПоВинеРаботника(ТД)
	// {{ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 17:06:54] +        
	ТД.СтоимостьОкончательногоБракаПоВинеРаботника = ТД.СдалиВОтходыПоВинеРаботникаКг * (ТД.ПолнаяСебестоимость - ТД.СтоимостьВозможногоИспользованияЗаЕдИзм); 
	// }}ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 17:06:54] -
КонецПроцедуры    

&НаСервереБезКонтекста
Функция бит_РассчитатьПолнуюСебестоимостьПоРС(Номенклатура, Дата)
	// {{ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 16:18:50] +        
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РесурсныеСпецификации.Ссылка КАК РС
	                      |ПОМЕСТИТЬ втВсеРесСпецДействующие
	                      |ИЗ
	                      |	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	                      |ГДЕ
	                      |	РесурсныеСпецификации.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
	                      |	И НЕ РесурсныеСпецификации.ПометкаУдаления
	                      |	И РесурсныеСпецификации.ОсновноеИзделиеНоменклатура = &Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПлановыеМатериальныеЗатратыОбороты.Период КАК Период,
	                      |	ПлановыеМатериальныеЗатратыОбороты.Калькуляция КАК Калькуляция
	                      |ПОМЕСТИТЬ втПериодыИКалькуляция
	                      |ИЗ
	                      |	РегистрНакопления.ПлановыеМатериальныеЗатраты.Обороты(
	                      |			,
	                      |			&КонецПериода,
	                      |			Запись,
	                      |			ПартияСпецификация В
	                      |				(ВЫБРАТЬ
	                      |					втВсеРесСпецДействующие.РС
	                      |				ИЗ
	                      |					втВсеРесСпецДействующие КАК втВсеРесСпецДействующие)) КАК ПлановыеМатериальныеЗатратыОбороты
	                      |ГДЕ
	                      |	ПлановыеМатериальныеЗатратыОбороты.Регистратор ССЫЛКА Документ.ПлановаяКалькуляция2_2
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(втПериодыИКалькуляция.Калькуляция) КАК Калькуляция
	                      |ПОМЕСТИТЬ втПоследняяКалькуляция
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		МАКСИМУМ(втПериодыИКалькуляция.Период) КАК Период
	                      |	ИЗ
	                      |		втПериодыИКалькуляция КАК втПериодыИКалькуляция) КАК влМаксПериод
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПериодыИКалькуляция КАК втПериодыИКалькуляция
	                      |		ПО влМаксПериод.Период = втПериодыИКалькуляция.Период
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПлановыеМатериальныеЗатратыОбороты.СтоимостьБезНДСОборот КАК Себестоимость
	                      |ИЗ
	                      |	РегистрНакопления.ПлановыеМатериальныеЗатраты.Обороты(
	                      |			,
	                      |			,
	                      |			Запись,
	                      |			Калькуляция В
	                      |				(ВЫБРАТЬ
	                      |					втПоследняяКалькуляция.Калькуляция
	                      |				ИЗ
	                      |					втПоследняяКалькуляция КАК втПоследняяКалькуляция)) КАК ПлановыеМатериальныеЗатратыОбороты
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ПлановыеТрудозатратыОбороты.СтоимостьОборот
	                      |ИЗ
	                      |	РегистрНакопления.ПлановыеТрудозатраты.Обороты(, , , ) КАК ПлановыеТрудозатратыОбороты
	                      |ГДЕ
	                      |	ПлановыеТрудозатратыОбороты.Калькуляция В
	                      |			(ВЫБРАТЬ
	                      |				втПоследняяКалькуляция.Калькуляция
	                      |			ИЗ
	                      |				втПоследняяКалькуляция КАК втПоследняяКалькуляция)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ПлановыеПрочиеЗатратыОбороты.СтоимостьБезНДСОборот
	                      |ИЗ
	                      |	РегистрНакопления.ПлановыеПрочиеЗатраты.Обороты(, , , ) КАК ПлановыеПрочиеЗатратыОбороты
	                      |ГДЕ
	                      |	ПлановыеПрочиеЗатратыОбороты.Калькуляция В
	                      |			(ВЫБРАТЬ
	                      |				втПоследняяКалькуляция.Калькуляция
	                      |			ИЗ
	                      |				втПоследняяКалькуляция КАК втПоследняяКалькуляция)");  
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Дата));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	ТЗ = Запрос.Выполнить().Выгрузить();                    
	Возврат ТЗ.Итог("Себестоимость");
	// }}ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [02.09.2025 16:18:50] -
КонецФункции                                               

&НаСервере
Процедура бит_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// {{ПервыйБИТ ЛистТребований [ЛТ9.7]  [VUVaynula@1cbit.ru] [04.08.2025 12:13:22] +        
	Если Объект.Проведен И ЭтаФорма.Элементы.Найти("бит_НомерАктаСрезки") <> Неопределено Тогда
		НомерАктаСрезки = Документы.ЗаявкаНаВозвратТоваровОтКлиента.НайтиНомерАктаСрезки(Объект.Ссылка);
		Если ЗначениеЗаполнено(НомерАктаСрезки) Тогда
			ЭтаФорма.бит_НомерАктаСрезки = НомерАктаСрезки;
			ЭтаФорма.Модифицированность = Ложь;
		КонецЕсли;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ9.7]  [VUVaynula@1cbit.ru] [04.08.2025 12:13:22] -
КонецПроцедуры

&НаСервере
Процедура бит_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	// {{ПервыйБИТ ЛистТребований [ЛТ9.7]  [VUVaynula@1cbit.ru] [04.08.2025 12:13:22] +        
	Если Объект.Проведен Тогда
		НомерАктаСрезки = Документы.ЗаявкаНаВозвратТоваровОтКлиента.НайтиНомерАктаСрезки(Объект.Ссылка);
		Если ЗначениеЗаполнено(НомерАктаСрезки) Тогда
			ЭтаФорма.бит_НомерАктаСрезки = НомерАктаСрезки;
			ЭтаФорма.Модифицированность = Ложь;
		КонецЕсли;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ9.7]  [VUVaynula@1cbit.ru] [04.08.2025 12:13:22] -
КонецПроцедуры
