////////////////////////////////////////////////////////////////////////////////
// Модуль содержит реализацию различных валютных пересчетов.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Пересчитывает сумму из валюты ВалютаНач по курсу ПоКурсуНач 
// в валюту ВалютаКон по курсу ПоКурсуКон.
// 
// Параметры:      
// 	Сумма          - сумма, которую следует пересчитать;
// 	ВалютаНач      - ссылка на элемент справочника Валют;
//                   определяет валюты из которой надо пересчитвать;
// 	ВалютаКон      - ссылка на элемент справочника Валют;
//                   определяет валюты в которую надо пересчитвать;
// 	ПоКурсуНач     - курс из которого надо пересчитать;
// 	ПоКурсуКон     - курс в который надо пересчитать;
// 	ПоКратностьНач - кратность из которого надо пересчитать (по умолчанию = 1);
// 	ПоКратностьКон - кратность в который надо пересчитать  (по умолчанию = 1);
// 
// Возвращаемое значение: 
//  Сумма, пересчитанная в другую валюту.
// 
Функция ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон, 
	                               ПоКратностьНач = 1, ПоКратностьКон = 1 ) Экспорт

	Если (ВалютаНач = ВалютаКон) Тогда

		// Считаем, что пересчет не нужен.
		Возврат Сумма;

	КонецЕсли;

	Если (ПоКурсуНач = ПоКурсуКон) И (ПоКратностьНач = ПоКратностьКон) Тогда

		// Ну, тут и считать нечего...
		Возврат Сумма;

	КонецЕсли;

	Если ПоКурсуНач = 0 ИЛИ ПоКурсуКон = 0 ИЛИ ПоКратностьНач = 0 ИЛИ ПоКратностьКон = 0 Тогда	 
					  
		ТекстСообщения = НСтр("ru='Процедура ""ПересчитатьИзВалютыВВалюту()"": при пересчете обнаружен нулевой курс. Валюта начальная ""%1"", валюта конечная ""%2"".';
							  |en='Procedure ""Recalculate from one currency to another()"": zero rate detected. Original currency ""%1"", Resulting currency ""%2"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ВалютаНач, ВалютаКон);
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		
		Возврат 0;

	КонецЕсли;

	СуммаРез = (Сумма * ПоКурсуНач * ПоКратностьКон) / (ПоКурсуКон * ПоКратностьНач);
	
	Возврат СуммаРез;

КонецФункции // ПересчитатьИзВалютыВВалюту()

// Функция выполняет расчет суммы по курсу.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат - Число.
//
Функция ПересчитатьСуммуПоКурсу(СуммаВх, Курс, Кратность) Экспорт

	РезСумма = 0;
	
	РезСумма = СуммаВх*Курс/Кратность;

	Возврат РезСумма;
	
КонецФункции // ПересчитатьСуммуПоКурсу()

#КонецОбласти
