
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Функция эмулирует с помощью структур описание метаданных документа для указанного вида проформы.
// 
// Параметры:
//  ВидПроформы  - СправочникСсылка.бит_ВидыПроформ.
//  ВидКоллекции - Строка - "Массив", "Структура".
// 
// Возвращаемое значение:
//  ПсевдоМета - Структура.
// 
Функция ЭмулироватьМетаданные(ВидПроформы, ВидКоллекции = "Массив") Экспорт
	
	// Заполним данные о реквизиты проформы
	Если ВидКоллекции = "Структура" Тогда		
		КоллекцияРеквизиты = Новый Структура;		
	Иначе		
		КоллекцияРеквизиты = Новый Массив;		
	КонецЕсли; 
	
	СтрОтбор = Новый Структура("ИмяТаблицы","Реквизиты");
	МассивНастройки = ВидПроформы.НастройкиРеквизитов.НайтиСтроки(СтрОтбор);
	
	Для каждого СтрокаНастройка Из МассивНастройки Цикл		
		Если ВидКоллекции = "Структура" Тогда			
			КоллекцияРеквизиты.Вставить(СтрокаНастройка.Имя, ОписаниеРеквизита(СтрокаНастройка));			
		Иначе			
			КоллекцияРеквизиты.Добавить(ОписаниеРеквизита(СтрокаНастройка));			
		КонецЕсли;		
	КонецЦикла; 
	
	СтрОтбор = Новый Структура("ИмяТаблицы","ТабличныеЧасти");
	МассивНастройкиТЧ = ВидПроформы.НастройкиРеквизитов.НайтиСтроки(СтрОтбор);
	
	// Заполним данные о табличных частях проформы.
	СтрТабЧасти = Новый Структура;
	
	Для каждого СтрокаТЧ Из МассивНастройкиТЧ  Цикл
		
		ИмяТабЧасти = СтрокаТЧ.Имя;
		
		Если ВидКоллекции = "Структура" Тогда			
			КоллекцияРеквизитыТабЧасти = Новый Структура;			
		Иначе			
			КоллекцияРеквизитыТабЧасти = Новый Массив;			
		КонецЕсли; 
		
		СтрОтбор = Новый Структура("ИмяТаблицы",ИмяТабЧасти);
		МассивНастройки = ВидПроформы.НастройкиРеквизитов.НайтиСтроки(СтрОтбор);
		
		Для каждого СтрокаНастройка Из МассивНастройки Цикл			
			Если ВидКоллекции = "Структура" Тогда				
				КоллекцияРеквизитыТабЧасти.Вставить(СтрокаНастройка.Имя, ОписаниеРеквизита(СтрокаНастройка));				
			Иначе				
				КоллекцияРеквизитыТабЧасти.Добавить(ОписаниеРеквизита(СтрокаНастройка));				
			КонецЕсли; 			
		КонецЦикла; 
		
		МетаТабЧасть = ОписаниеТабЧасти(СтрокаТЧ.Имя, СтрокаТЧ.Синоним, КоллекцияРеквизитыТабЧасти);		
		СтрТабЧасти.Вставить(СтрокаТЧ.Имя, МетаТабЧасть);
		
	КонецЦикла; 
	
	// Стандартные реквизиты
	Если ВидКоллекции = "Структура" Тогда		
		СтандартныеРеквизиты = Новый Структура;		
	Иначе		
		СтандартныеРеквизиты = Новый Массив;		
	КонецЕсли; 
	
	СтРекв = ОписаниеСтандартногоРеквизита("НомерПроформы", НСтр("ru='Номер проформы';en='Proforma number'"), "Строка");
	ДобавитьВКоллекцию(СтандартныеРеквизиты, СтРекв, СтРекв.Имя);
	СтРекв = ОписаниеСтандартногоРеквизита("Дата", "Дата", "Дата");
	ДобавитьВКоллекцию(СтандартныеРеквизиты, СтРекв, СтРекв.Имя);
	СтРекв = ОписаниеСтандартногоРеквизита("ВалютаДокумента", НСтр("ru='Валюта';en='Currency'"), "СправочникСсылка.Валюты");
	ДобавитьВКоллекцию(СтандартныеРеквизиты, СтРекв, СтРекв.Имя);
	СтРекв = ОписаниеСтандартногоРеквизита("КурсДокумента", НСтр("ru='Курс';en='Exchange rate'"), "Число(10,4)");
	ДобавитьВКоллекцию(СтандартныеРеквизиты, СтРекв, СтРекв.Имя);
	СтРекв = ОписаниеСтандартногоРеквизита("КратностьДокумента", НСтр("ru='Кратность';en='Multiplicity'"), "Число(10,4)");
	ДобавитьВКоллекцию(СтандартныеРеквизиты, СтРекв, СтРекв.Имя);
	
	// Эмулируем метаданные проформы
	ПсевдоМета = Новый Структура;
	ПсевдоМета.Вставить("Имя"           	  , ВидПроформы.Имя);
	ПсевдоМета.Вставить("Синоним"       	  , ВидПроформы.Наименование);
	ПсевдоМета.Вставить("Реквизиты"     	  , КоллекцияРеквизиты);
	ПсевдоМета.Вставить("СтандартныеРеквизиты", СтандартныеРеквизиты);
	ПсевдоМета.Вставить("ТабличныеЧасти"	  , СтрТабЧасти);

	Возврат ПсевдоМета;
	
КонецФункции // ЭмулироватьМетаданные()

// Функция определяет организацию произвольной формы.
//
// Параметры:
//  ПроизвольнаяФормаСсылка	 - ДокументСсылка.бит_ПроизвольнаяФорма
//                             ДокументСсылка.бит_ФормаСбораДанных - ссылка на документ произвольной формы.
// 
// Возвращаемое значение:
//  СправочникСсылка.Организации - организация произвольной формы.
//
Функция ОрганизацияПроизвольнойФормы(ПроизвольнаяФормаСсылка) Экспорт
	
	СтрокаДанныеШапки = ПроизвольнаяФормаСсылка.ДанныеШапки.Найти("Организация", "ИмяРеквизита");
	Возврат ?(СтрокаДанныеШапки = Неопределено, Справочники.Организации.ПустаяСсылка(), СтрокаДанныеШапки.ЗначениеРеквизита);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция описание стандартного реквизита.
// 
// Параметры:
//  Имя - Строка
//  Синоним - Строка
//  Тип - ОписаниеТипов
// 
// Возвращаемое значение:
//  Реквизит - Структура.
// 
Функция ОписаниеСтандартногоРеквизита(Имя, Синоним, СтрТип)

	Реквизит = Новый Структура;
	Реквизит.Вставить("Имя"	   , Имя);
	Реквизит.Вставить("Синоним", Синоним);
	Реквизит.Вставить("Тип"	   , бит_ОбщегоНазначенияКлиентСервер.ПолучитьОписаниеИзСтроки(СтрТип));
	Реквизит.Вставить("СтрТип" , СтрТип);
	Реквизит.Вставить("НастройкиОбмена");
	
	Возврат Реквизит;
	
КонецФункции

// Функция добавляет значение в массив или структуру.
// 
// Параметры:
//   Коллекция - Массив, Структура.
//   Значение - Произвольный.
//   Имя - Строка.
// 
Процедура ДобавитьВКоллекцию(Коллекция, Значение, Имя = "")

	Если ТипЗнч(Коллекция) = Тип("Структура") И Не ПустаяСтрока(Имя) Тогда
		
		Коллекция.Вставить(Имя, Значение);
		
	ИначеЕсли ТипЗнч(Коллекция) = Тип("Массив")	Тогда
		
		Коллекция.Добавить(Значение);
		
	КонецЕсли; 
	
КонецПроцедуры

// Функция создает структуру-описание табличной части.
// 
// Параметры:
// Имя - Строка
// Синоним - Строка
// Реквизиты - Структура
// 
// Возвращаемое значение:
//  МетаТабЧасть - Структура.
// 
Функция ОписаниеТабЧасти(Имя, Синоним, Реквизиты)

	МетаТабЧасть = Новый Структура;
	МетаТабЧасть.Вставить("Имя",Имя);
	
	ТекСиноним = ?(ПустаяСтрока(Синоним),Имя, Синоним);
	МетаТабЧасть.Вставить("Синоним", ТекСиноним);
	МетаТабЧасть.Вставить("Реквизиты", Реквизиты);

	Возврат МетаТабЧасть;
	
КонецФункции // ОписаниеТабЧасти()

// Функция создает структуру-описание реквизита 
// по строке табличной части СправочникТабличнаяЧастьСтрока.бит_ВидыПроформ.НастройкиРеквизитов.
// 
// Параметры:
// ВхСтрока - СправочникТабличнаяЧастьСтрока.бит_ВидыПроформ.НастройкиРеквизитов.
// 
// Возвращаемое значение:
//  Реквизит - Структура.
// 
Функция ОписаниеРеквизита(ВхСтрока)
	
	Реквизит = Новый Структура;
	Реквизит.Вставить("Имя", ВхСтрока.Имя);
	
	ТекСиноним = ?(ПустаяСтрока(ВхСтрока.Синоним),ВхСтрока.Имя,ВхСтрока.Синоним);
	Реквизит.Вставить("Синоним", ТекСиноним);
	
	ТекТип = бит_ОбщегоНазначенияКлиентСервер.ПолучитьОписаниеИзСтроки(ВхСтрока.СтрТип);
	Реквизит.Вставить("Тип",ТекТип);
	Реквизит.Вставить("СтрТип", ВхСтрока.СтрТип);
	
	Реквизит.Вставить("ПроверкаЗаполнения",ВхСтрока.ПроверкаЗаполнения);
	
	НастройкиОтображения = ОписаниеОтображенияЭлемента(ВхСтрока);
	Реквизит.Вставить("НастройкиОтображения", НастройкиОтображения);
	
	НастройкиОбмена = ОписаниеНастроекОбмена(ВхСтрока);
	Реквизит.Вставить("НастройкиОбмена", НастройкиОбмена);
	
	Возврат Реквизит;
	
КонецФункции

// Функция - конструктор структуры, описывающей интерфейсное отображения поля проформы.
// 
// Параметры:
// ВхСтрока - СправочникТабличнаяЧастьСтрока.бит_ВидыПроформ.НастройкиРеквизитов.
// 
// Возвращаемое значение:
//  НастройкиОтображения - Структура.
// 
Функция ОписаниеОтображенияЭлемента(ВхСтрока)

	НастройкиОтображения = Новый Структура("ВидПоля
	                                        |, ПроверкаЗаполнения
	                                        |, Ширина
											|, КнопкаВыбора
											|, КнопкаРегулирования
											|, КнопкаОткрытия
											|, КнопкаОчистки
											|, ВыводитьИтог");
	
		
	НастройкиОтображения.ВидПоля = ?(ЗначениеЗаполнено(ВхСтрока.ВидПоля),ВхСтрока.ВидПоля, Перечисления.бит_ВидыПолейПроформы.ПолеВвода);
	НастройкиОтображения.Ширина  = ВхСтрока.Ширина;
	НастройкиОтображения.КнопкаВыбора        = РежимКнопки(ВхСтрока.КнопкаВыбора);
	НастройкиОтображения.КнопкаРегулирования = РежимКнопки(ВхСтрока.КнопкаРегулирования);
	НастройкиОтображения.КнопкаОткрытия      = РежимКнопки(ВхСтрока.КнопкаОткрытия);
	НастройкиОтображения.КнопкаОчистки       = РежимКнопки(ВхСтрока.КнопкаОчистки);
	НастройкиОтображения.ПроверкаЗаполнения  = ВхСтрока.ПроверкаЗаполнения;
	НастройкиОтображения.ВыводитьИтог        = ВхСтрока.ВыводитьИтог;
	
	Возврат НастройкиОтображения;
	
КонецФункции

// Функция - конструктор структуры, описывающей настройки обмена данными.
// 
// Параметры:
// ВхСтрока - СправочникТабличнаяЧастьСтрока.бит_ВидыПроформ.НастройкиРеквизитов.
// 
// Возвращаемое значение:
//  НастройкиОбмена - Структура.
// 
Функция ОписаниеНастроекОбмена(ВхСтрока)

	НастройкиОбмена = Новый Структура("Выгружать,ВыражениеПредставления, Настройки");
	
	Если Не ТипЗнч(ВхСтрока) = Тип("СправочникТабличнаяЧастьСтрока.бит_ВидыПроизвольныхФорм.НастройкиРеквизитов") Тогда
		НастройкиОбмена.Выгружать = ВхСтрока.Выгружать;
		НастройкиОбмена.ВыражениеПредставления = ВхСтрока.ВыражениеПредставления;
		НастройкиОбмена.Настройки = ВхСтрока.ХранилищеНастроек.Получить();
	КонецЕсли; 
	
	Возврат НастройкиОбмена;
	
КонецФункции

// Функция определяет необходимость добавления кнопки, исходя из установленого режима.
// 
// Параметры:
//  ВхРежим - ПеречислениеСсылка.бит_ДаНетАвто.
// 
// Возвращаемое значение:
//  Режим - Булево.
// 
Функция РежимКнопки(ВхРежим)
	
	Если ВхРежим = Перечисления.бит_ДаНетАвто.Да Тогда
		
		Режим = Истина;
		
	ИначеЕсли ВхРежим = Перечисления.бит_ДаНетАвто.Нет Тогда
		
		Режим = Ложь;
		
	Иначе	
		
		Режим = Неопределено;
		
	КонецЕсли; 
	
	Возврат Режим;
	
КонецФункции

#КонецОбласти