
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.Справочники.бит_НастройкиПроизвольныхОтчетов; 	
		
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);	
	Если фОтказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура СоздатьЭкземплярОтчета(Команда)
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;	
	Для каждого ТекСсылка Из МассивСтрок Цикл
	
		Если ЗначениеЗаполнено(ТекСсылка) И НЕ ПроверитьЭтоГруппа(ТекСсылка) Тогда

			// Создаем новую форму документа.
			бит_РаботаСДиалогамиКлиент.ОткрытьНовуюФормуСправочникаЭкземплярОтчета(ТекСсылка);			
			Прервать;

		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПроверитьЭтоГруппа(Знач ТекСсылка)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСсылка, "ЭтоГруппа");
		
КонецФункции

#КонецОбласти
