
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	МодульСтрокой		   = "Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств";
	ПараметрыОткрытияФормы = бит_КазначействоВызовСервера.ПараметрыФормыВводНаОсновании(МодульСтрокой, ПараметрКоманды);
	
	Если ПараметрыОткрытияФормы.Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Нет остатков прогнозов поступлений денежных средств.'; 
							|en = 'There are no balances of cash receipts forecasts.'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(ПараметрыОткрытияФормы.ИмяФормы, ПараметрыОткрытияФормы.ПараметрыФормы,
				ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры
			
#КонецОбласти

