
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 	
	
	УстановитьОтборСпискаРеквизитов(Объект.Ссылка);
	УстановитьВидимость();   	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьОтборСпискаРеквизитов(ТекущийОбъект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает отбор динамического списка описаний реквизитов текущего объекта.
// 
// Параметры:
//  ТекущаяСсылка - СправочникСсылка.бит_мдм_ОписанияОбъектовОбмена.
// 
&НаСервере
Процедура УстановитьОтборСпискаРеквизитов(ТекущаяСсылка)
	
	ЭлО = СписокРеквизиты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлО.Использование = Истина;
	ЭлО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлО.ПравоеЗначение = ТекущаяСсылка;
	
КонецПроцедуры // УстановитьОтборРеквизитов()

// Процедура устанавливает видимость/доступность элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()

	ЭтоСправочник = ?(Объект.Вид = Перечисления.бит_мдм_ВидыОбъектовОбмена.Справочник, Истина, Ложь);
	ЭтоСчет       = ?(Объект.Вид = Перечисления.бит_мдм_ВидыОбъектовОбмена.Счет, Истина, Ложь);
	
	Элементы.ОтправлятьКод.Видимость = Истина;
	Элементы.ВидыСубконто.Видимость = ЭтоСчет;

КонецПроцедуры // УстановитьВидимость()

#КонецОбласти