#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОсновноеПредставление = ИТК_Перечисления.ПредставлениеОбъектовСиноним();
	
	ИТК_ФормаКлиентСервер.ОформитьСтрокуПоискаПоПодобию(Элементы.Поиск);
	
	Коллекции = ИТК_МетаданныеКлиентСерверПовтИсп.ДоступныеКоллекцииВсеДействия();
	Для Каждого ИмяКоллекции Из Коллекции Цикл 
		
		КоллекцияОбъектов = Метаданные[ИмяКоллекции];
		Если Не ЗначениеЗаполнено(КоллекцияОбъектов) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъектаКоллекции = ИТК_МетаданныеКлиентСерверПовтИсп.ИмяОбъектаКоллекции(ИмяКоллекции);
		ПредставлениеКоллекции = ИТК_Строки.ПредставлениеИдентификатора(ИмяКоллекции);
		
		СтрокаКоллекция = ДобавитьСтрокуДерева(Дерево, ИмяКоллекции, ПредставлениеКоллекции, ИТК_МетаданныеКлиентСерверПовтИсп.КартинкаОбъектаКоллекции(ИмяОбъектаКоллекции));
		ДобавитьСтрокуДерева(СтрокаКоллекция);
		
	КонецЦикла;
	
	// Стандартные
	СтрокаКоллекция = ДобавитьСтрокуДерева(Дерево, "Стандартные", НСтр("ru = 'Стандартные';
																		|en = 'Standard'"), БиблиотекаКартинок.Форма);
	ДобавитьСтрокуДерева(СтрокаКоллекция);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	ОсновноеПредставлениеИзНастроек = Настройки.Получить("ОсновноеПредставление");
	Если ЗначениеЗаполнено(ОсновноеПредставлениеИзНастроек) Тогда
		ОсновноеПредставление = ОсновноеПредставлениеИзНастроек;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИТК_ОбщийКлиент.ОбработчикПриОткрытии(Отказ);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоискПриИзменении(Элемент)

	ОбновитьПоискПоСтроке();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Строка = НайтиСтрокуПоИдентификатору(ТекущиеДанные.Значение);
	Элементы.Дерево.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	Строка = СтрокаОбъект();
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраноЗначение(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУниверсальнуюФорму(Команда)
	
	Строка = СтрокаОбъект();
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = Строка.ПолучитьРодителя();
	
	ИмяКоллекции = ЗначениеПоСтроке(Родитель);
	ИмяОбъектаКоллекции = ИТК_МетаданныеКлиентСерверПовтИсп.ИмяОбъектаКоллекции(ИмяКоллекции);
	ИмяОбъекта = ЗначениеПоСтроке(Строка);
	
	Таблица = СтрШаблон("%1.%2", ИмяОбъектаКоллекции, ИмяОбъекта);
	ИТК_ФормаКлиент.ОткрытьДинамическийСписок(Таблица);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеПредставлениеИмя(Команда)
	
	ИзменитьОсновноеПредставление(ИТК_Перечисления.ПредставлениеОбъектовИмя());
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеПредставлениеСиноним(Команда)
	
	ИзменитьОсновноеПредставление(ИТК_Перечисления.ПредставлениеОбъектовСиноним());

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбраноЗначение(Элемент.ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередРазворачиванием(Элемент, Строка, Отказ)
	
	РазворачиваемаяСтрока = Дерево.НайтиПоИдентификатору(Строка);
	
	Если ИТК_ФормаКлиентСервер.НеобходимоРазвернутьСтроку(РазворачиваемаяСтрока) Тогда
		
		РазвернутьСтрокуКоллекции(Строка);
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока = Неопределено, Поле = Неопределено, СтандартнаяОбработка = Неопределено)
	
	Идентификатор = Элемент.ТекущиеДанные.Значение;
	Строка = НайтиСтрокуПоИдентификатору(Идентификатор);
	
	ВыбраноЗначение(Строка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДобавитьСтрокуДерева(Родитель, Имя = Неопределено, Синоним = Неопределено, Картинка = Неопределено, Представление = Неопределено)

	НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
	НоваяСтрока.Картинка = Картинка;
	НоваяСтрока.Имя = Имя;
	НоваяСтрока.Синоним = Синоним;
	
	Если Представление = Неопределено Тогда
		Представление = Синоним;
	КонецЕсли;
	НоваяСтрока.Представление = Представление;
	
    Возврат НоваяСтрока;
	
КонецФункции

&НаСервере
Процедура РазвернутьСтрокуКоллекции(ИдентификаторСтроки)

	РазворачиваемаяСтрока = Дерево.НайтиПоИдентификатору(ИдентификаторСтроки);
	РазворачиваемаяСтрока.ПолучитьЭлементы().Очистить();
	
	ИмяКоллекции = ЗначениеПоСтроке(РазворачиваемаяСтрока);
	
	Если ИмяКоллекции = "Стандартные" Тогда
		
		КоллекцияСтандартные = Новый СписокЗначений;
		
		КоллекцияСтандартные.Добавить("StandardActiveUsers", НСтр("ru = 'Активные пользователи';
																	|en = 'Active users'"));
		КоллекцияСтандартные.Добавить("StandardEventLog", НСтр("ru = 'Журнал регистрации';
																|en = 'Event log'"));
		КоллекцияСтандартные.Добавить("StandardFindByRef", НСтр("ru = 'Поиск ссылок на объект';
																|en = 'Finding object references'"));
		КоллекцияСтандартные.Добавить("StandardDocumentsPosting", НСтр("ru = 'Проведение документов';
																		|en = 'Documents posting'"));
		КоллекцияСтандартные.Добавить("StandardDeleteMarkedObjects", НСтр("ru = 'Удаление помеченных объектов';
																			|en = 'Deleting marked objects'"));
		КоллекцияСтандартные.Добавить("StandardExternalDataSourcesManagement", НСтр("ru = 'Управление внешними источниками данных';
																					|en = 'Management of external data sources'"));
		КоллекцияСтандартные.Добавить("StandardTotalsManagement", НСтр("ru = 'Управление итогами';
																		|en = 'Totals management'"));
		КоллекцияСтандартные.Добавить("StandardFullTextSearchManagement", НСтр("ru = 'Управление полнотекстовым поиском';
																				|en = 'Full-text search management'"));
		
		ИмяУправлениеРасширениямиКонфигурации = "StandardExtensionsManagement";
		Если ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.20") Тогда
			ИмяУправлениеРасширениямиКонфигурации = "StandardConfigurationExtensionsManagement";
		КонецЕсли;
		КоллекцияСтандартные.Добавить(ИмяУправлениеРасширениямиКонфигурации,НСтр("ru = 'Управление расширениями конфигурации';
																				|en = 'Configuration extensions management'"));
		
		Если ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.11") Тогда
			КоллекцияСтандартные.Добавить("StandardECSRegister", НСтр("ru = 'Управление системой взаимодействия';
																		|en = 'Interaction system management'"));
		КонецЕсли;

		Если ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.20") Тогда
			ИмяУправлениеСерверами = "StandardServersManagement";
		ИначеЕсли ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.15") Тогда
			ИмяУправлениеСерверами = "StandartServersControl";
		Иначе
			ИмяУправлениеСерверами = Неопределено
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяУправлениеСерверами) Тогда

			КоллекцияСтандартные.Добавить(ИмяУправлениеСерверами, НСтр("ru = 'Управление серверами';
																		|en = 'Server management'"));

		КонецЕсли;

		Если ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.15") Тогда

			КоллекцияСтандартные.Добавить("StandardIntegrationServicesManagment", НСтр("ru = 'Управление сервисами интеграции';
																						|en = 'Integration service management'"));
			КоллекцияСтандартные.Добавить("StandardAnalyticsSystemManagement", НСтр("ru = 'Управление системой аналитики';
																					|en = 'Analytics system management'"));
		КонецЕсли;

		Если ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.17") Тогда
			КоллекцияСтандартные.Добавить("StandardErrorProcessingSettings", НСтр("ru = 'Управление настройками обработки ошибок';
																					|en = 'Managing error handling settings'"));
		КонецЕсли;

		Если ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.20") Тогда
			КоллекцияСтандартные.Добавить("StandardAuthenticationLocks", НСтр("ru = 'Блокировка аутентификации';
																				|en = 'Authentication blocking'"));
			КоллекцияСтандартные.Добавить("StandardAdditionalAuthenticationSettings", НСтр("ru = 'Дополнительные настройки аутентификации';
																							|en = 'Additional authentication settings'"));
			КоллекцияСтандартные.Добавить("StandardConfigurationLicense", НСтр("ru = 'Лицензирование конфигураций';
																				|en = 'Licensing configurations'"));
			КоллекцияСтандартные.Добавить("StandardEventLogSettings", НСтр("ru = 'Настройка журнала регистрации';
																			|en = 'Setting up the logbook'"));
			КоллекцияСтандартные.Добавить("StandardInfobaseParameters", НСтр("ru = 'Параметры информационной базы';
																			|en = 'Infobase parameters'"));
			КоллекцияСтандартные.Добавить("StandardLicenseAcquisition", НСтр("ru = 'Получение лицензии';
																			|en = 'Obtaining a license'"));
			КоллекцияСтандартные.Добавить("StandardInfobaseRegionalSettings", НСтр("ru = 'Региональные установки информационной базы';
																					|en = 'Regional settings of the infobase'"));
			КоллекцияСтандартные.Добавить("StandardUsers", НСтр("ru = 'Пользователи';
																|en = 'Users'"));
		КонецЕсли;

		КоллекцияСтандартные.СортироватьПоПредставлению();
		
		Для Каждого ЭлементКоллекции Из КоллекцияСтандартные Цикл 
			
			ДобавитьСтрокуДерева(РазворачиваемаяСтрока, ЭлементКоллекции.Значение, ЭлементКоллекции.Представление, РазворачиваемаяСтрока.Картинка);
			
		КонецЦикла;
		
	Иначе
		
		// Добавление объектов коллекции
		ПредставленияИИменаМетаданных = ИТК_МетаданныеПовтИсп.КэшПредставленийИИменКоллекции(ИмяКоллекции);
		Если ОсновноеПредставление = ИТК_Перечисления.ПредставлениеОбъектовИмя() Тогда
			ПредставленияИИменаМетаданных.СортироватьПоЗначению();
		КонецЕсли;

		Для Каждого ЭлементОбъектаМетаданных Из ПредставленияИИменаМетаданных Цикл 
			
			ИмяОбъектаМетаданных = ЭлементОбъектаМетаданных.Значение;
			ПредставлениеОбъектаМетаданных = ЭлементОбъектаМетаданных.Представление;
			
			ПолноеПредставление = ПолноеПредставление(ОсновноеПредставление, ИмяОбъектаМетаданных, ПредставлениеОбъектаМетаданных);
			СтрокаОбъект = ДобавитьСтрокуДерева(РазворачиваемаяСтрока, ИмяОбъектаМетаданных, ПредставлениеОбъектаМетаданных, РазворачиваемаяСтрока.Картинка, ПолноеПредставление);
			
			Если ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоВнешнийИсточникДанных(ИмяКоллекции) Тогда
				
				КартинкаТаблицыВнешнегоИсточника = ИТК_ОбщийКлиентСерверПовтИсп.БиблиотекаКартинок("ИТК_ВнешнийИсточникДанныхТаблица");
				Для Каждого ОбъектТаблица Из Метаданные[ИмяКоллекции][ИмяОбъектаМетаданных].Таблицы Цикл 
					
					ИмяОбъектаТаблица = ОбъектТаблица.Имя;
					СинонимОбъектаТаблица = ОбъектТаблица.Синоним;
					ПолноеПредставлениеОбъектаТаблица = ПолноеПредставление(ОсновноеПредставление, ИмяОбъектаТаблица, СинонимОбъектаТаблица);
					
					ДобавитьСтрокуДерева(СтрокаОбъект, ИмяОбъектаТаблица, СинонимОбъектаТаблица, КартинкаТаблицыВнешнегоИсточника, ПолноеПредставлениеОбъектаТаблица);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПоСтроке(Строка)
	
	Возврат Строка.Имя;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторСтроки(Строка)
	
	Если Строка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧастиИдентификатора = Новый Массив;
	ЧастиИдентификатора.Добавить(ЗначениеПоСтроке(Строка));
	
	Родитель = Строка.ПолучитьРодителя();
	Пока Родитель <> Неопределено Цикл 
		
		ЧастиИдентификатора.Вставить(0, ЗначениеПоСтроке(Родитель));
		Родитель = Родитель.ПолучитьРодителя();
		
	КонецЦикла;
	
	Возврат СтрСоединить(ЧастиИдентификатора, ".");
	
КонецФункции

&НаКлиенте
Функция СтрокаОбъект()
	
	Если ЗначениеЗаполнено(Поиск) Тогда
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Результат = НайтиСтрокуПоИдентификатору(ТекущиеДанные.Значение);

	Иначе 
		Результат = Элементы.Дерево.ТекущиеДанные;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПоискПоСтроке()
	
	Список.Очистить();
	Если ЗначениеЗаполнено(Поиск) Тогда
		
		ОбновитьПоискПоСтрокеСервер();
		ПодключитьОбработчикОжидания("ПодключаемыйТекущийЭлементСтрокаПоискаПослеОжидания", 0.2, Истина);
		
	КонецЕсли;
	
	ОбновлениеЭлементовФормыПослеОжидания();
	
	ТекущийЭлемент = Элементы.Поиск;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоискПоСтрокеСервер()
	
	// Получим все строки коллекций
	Для Каждого Строка Из Дерево.ПолучитьЭлементы() Цикл 
		
		Если ИТК_ФормаКлиентСервер.НеобходимоРазвернутьСтроку(Строка) Тогда
			
			РазвернутьСтрокуКоллекции(Строка.ПолучитьИдентификатор());
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыПоиска = ИТК_Строки.ПараметрыПоискаПоПодобию(Поиск);
	ПолеПредставления = ПолеПредставленияОбъектов(ОсновноеПредставление);
	ДобавитьВСписок(Дерево, ПараметрыПоиска, ПолеПредставления);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВСписок(КоллекцияСтрок, ПараметрыПоиска, ПолеПредставления)
	
	Для Каждого Строка Из КоллекцияСтрок.ПолучитьЭлементы() Цикл 
		
		ЭтоГруппа = ЗначениеЗаполнено(Строка.ПолучитьЭлементы());
		
		Если ЭтоГруппа Тогда
			
			Если ЗначениеЗаполнено(ПараметрыПоиска.Коллекция)
					И НЕ СтрНайти(НРег(Строка.Имя), ПараметрыПоиска.Коллекция) Тогда 
				Продолжить;
			КонецЕсли;
			
			ДобавитьВСписок(Строка, ПараметрыПоиска, ПолеПредставления);
			
		Иначе
			
			АнализируемаяСтрока = НРег(Строка.Имя + " " + Строка.Синоним);
			
			Если НЕ СтрНайти(АнализируемаяСтрока, ПараметрыПоиска.Слово) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ИТК_Строки.ПоискПоПодобиюНайденыДополнительныеСлова(АнализируемаяСтрока, ПараметрыПоиска) Тогда
				Продолжить;
			КонецЕсли;
			
			Идентификатор = ИдентификаторСтроки(Строка);
			Список.Добавить(Идентификатор, Строка[ПолеПредставления], , Строка.Картинка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	ПоискЗаполнен = ЗначениеЗаполнено(Поиск);
	
	Элементы.Дерево.Видимость = Не ПоискЗаполнен;
	Элементы.Список.Видимость = ПоискЗаполнен;

	ОсновноеПредставлениеИмя = (ОсновноеПредставление = ИТК_Перечисления.ПредставлениеОбъектовИмя());
	Элементы.ОсновноеПредставлениеИмя.Пометка = ОсновноеПредставлениеИмя;
	
	ОсновноеПредставлениеСиноним = (ОсновноеПредставление = ИТК_Перечисления.ПредставлениеОбъектовСиноним());
	Элементы.ОсновноеПредставлениеСиноним.Пометка = ОсновноеПредставлениеСиноним;
	
	ОбновитьДоступностьДействий();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеЭлементовФормыПослеОжидания()
	
	ПодключитьОбработчикОжидания("ПодключаемыйОбновлениеЭлементовФормыПослеОжидания", 0.1, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйОбновлениеЭлементовФормыПослеОжидания()

	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуПоИдентификатору(Идентификатор)
	
	ЧастиИдентификатора = СтрРазделить(Идентификатор, ".");

	Для Каждого СтрокаКоллекция Из Дерево.ПолучитьЭлементы() Цикл 
		
		Если ЗначениеПоСтроке(СтрокаКоллекция) <> ЧастиИдентификатора[0] Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЧастиИдентификатора.Количество() = 1 Тогда
			Возврат СтрокаКоллекция;
		КонецЕсли;
		
		Для Каждого СтрокаОбъектМетаданных Из СтрокаКоллекция.ПолучитьЭлементы() Цикл 
			
			Если ЗначениеПоСтроке(СтрокаОбъектМетаданных) <> ЧастиИдентификатора[1] Тогда
				Продолжить;
			КонецЕсли;
				
			Если ЧастиИдентификатора.Количество() = 2 Тогда
				Возврат СтрокаОбъектМетаданных;
			КонецЕсли;
			
			Для Каждого СтрокаЭлементОбъектМетаданных Из СтрокаОбъектМетаданных.ПолучитьЭлементы() Цикл 
				
				Если ЗначениеПоСтроке(СтрокаЭлементОбъектМетаданных) <> ЧастиИдентификатора[2] Тогда
					Продолжить;
				КонецЕсли;
				
				Возврат СтрокаЭлементОбъектМетаданных;
				
			КонецЦикла
			
		КонецЦикла
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ВыбраноЗначение(Строка, СтандартнаяОбработка = Неопределено)
	
	Если НЕ СтрокаВыбирается(Строка) Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	ТекущийЭлемент = Элементы.Поиск;
	Закрыть();
	
	ОткрытьФормуПоСтроке(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПоСтроке(Строка)
	
	Родитель = ОсновнойРодительСтроки(Строка);
	
	ИмяКоллекции = ЗначениеПоСтроке(Родитель);
	
	Если ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоВнешнийИсточникДанных(ИмяКоллекции) Тогда
		
		ИмяОбъектаМетаданных = ЗначениеПоСтроке(Строка.ПолучитьРодителя());
		ИмяЭлементаОбъектаМетаданных = ЗначениеПоСтроке(Строка);
		
	Иначе
		
		ИмяОбъектаМетаданных = ЗначениеПоСтроке(Строка);
		ИмяЭлементаОбъектаМетаданных = Неопределено;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	Если ИмяКоллекции = "Стандартные" Тогда
		
		Если ИмяОбъектаМетаданных = "StandardActiveUsers" Тогда
			
			ПолноеИмяФормы = "Обработка.ИТК_Пользователи.Форма";
			ПараметрыФормы.Вставить("НачальнаяСтраница", "АктивныеПользователи");
			
		ИначеЕсли ИмяОбъектаМетаданных = "StandardUsers" Тогда
			
			ПолноеИмяФормы = "Обработка.ИТК_Пользователи.Форма";
			ПараметрыФормы.Вставить("НачальнаяСтраница", "Пользователи");
			
		ИначеЕсли ИмяОбъектаМетаданных = "StandardFindByRef" Тогда
			
			ПолноеИмяФормы = "Обработка.ИТК_ПоискСсылокНаОбъект.Форма";
			
		ИначеЕсли ИмяОбъектаМетаданных = "StandardEventLog" Тогда

			ПолноеИмяФормы = "Обработка.ИТК_ЖурналРегистрации.Форма";			
			
		Иначе
			
			ИТК_ОбщийВызовСервера.ПодключитьСтандартнуюОбработку(ИмяОбъектаМетаданных);
			ПолноеИмяФормы = СтрШаблон("ВнешняяОбработка.%1.Форма", ИмяОбъектаМетаданных);
			
		КонецЕсли;
		
	ИначеЕсли ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоВнешнийИсточникДанных(ИмяКоллекции) Тогда
		
		ИмяОбъектаКоллекции = ИТК_МетаданныеКлиентСерверПовтИсп.ИмяОбъектаКоллекции(ИмяКоллекции);
		Параметр = СтрШаблон("%1.%2.Таблица.%3", ИмяОбъектаКоллекции, ИмяОбъектаМетаданных, ИмяЭлементаОбъектаМетаданных); 
		ИТК_ТуллкитКлиент.ОткрытьИнструмент(ИТК_Перечисления.ИнструментДинамическийСписок(), Параметр);
		Возврат;
		
	ИначеЕсли ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоКонстанта(ИмяКоллекции) Тогда
		
		ПолноеИмяФормы = "Обработка.ИТК_РедакторКонстант.Форма";
		ПараметрыФормы.Вставить("Имя", ИмяОбъектаМетаданных);
		
	Иначе
		
		ИмяОбъектаКоллекции = ИТК_МетаданныеКлиентСерверПовтИсп.ИмяОбъектаКоллекции(ИмяКоллекции);
		ПолноеИмяФормы = ИмяОбъектаКоллекции + "." + ИмяОбъектаМетаданных;
		
		Если ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоОбработка(ИмяКоллекции)
				ИЛИ ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоОтчет(ИмяКоллекции) Тогда
				
			Дополнение = "Форма";
			
		Иначе
			
			Дополнение = "ФормаСписка";
			
		КонецЕсли;
		ПолноеИмяФормы = ПолноеИмяФормы + "." + Дополнение;
	
	КонецЕсли;
	
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы, , , , , , РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Функция СтрокаВыбирается(Строка)
	
	Если Строка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат НЕ ЗначениеЗаполнено(Строка.ПолучитьЭлементы());
	
КонецФункции

&НаКлиенте
Процедура ИзменитьОсновноеПредставление(Значение) 
	
	Если ОсновноеПредставление = Значение Тогда
		Возврат;
	КонецЕсли;
	
	ОсновноеПредставление = Значение;
	ОбновитьЭлементыФормы();

	ОбновитьПолноеПредставление();
	ОбновитьПоискПоСтроке();
	ПересортироватьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПолноеПредставление()
	
	Для Каждого Строка Из Дерево.ПолучитьЭлементы() Цикл 
		
		Если ИТК_ФормаКлиентСервер.НеобходимоРазвернутьСтроку(Строка) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ПодчиненнаяСтрока Из Строка.ПолучитьЭлементы() Цикл 
			
			ПодчиненнаяСтрока.Представление = ПолноеПредставление(ОсновноеПредставление, ПодчиненнаяСтрока.Имя, ПодчиненнаяСтрока.Синоним);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьДействий()
	
	Строка = Элементы.Дерево.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Родитель = ОсновнойРодительСтроки(Строка);
	ИмяКоллекции = ЗначениеПоСтроке(Родитель);

	ЭтоВнешнийИсточникДанных = ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоВнешнийИсточникДанных(ИмяКоллекции);
	СтрокаВыбирается = СтрокаВыбирается(Строка);
	
	ДоступноОткрытие = СтрокаВыбирается И НЕ ЭтоВнешнийИсточникДанных;
	Элементы.Открыть.Доступность = ДоступноОткрытие;
	Элементы.ДеревоКонтекстноеМенюОткрытьОбъект.Доступность = ДоступноОткрытие;
	
	Если ЭтоВнешнийИсточникДанных Тогда
		ДоступнаУниверсальнаяФорма = Истина;
	ИначеЕсли СтрокаВыбирается
			И НЕ ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоГруппаСтандартные(ИмяКоллекции) Тогда

		ИмяОбъектаКоллекции = ИТК_МетаданныеКлиентСерверПовтИсп.ИмяОбъектаКоллекции(ИмяКоллекции);
		
		ДоступныеТипыОбъектов = ИТК_МетаданныеКлиентСерверПовтИсп.ДоступныеОбъектыОсновнойТаблицыДинамическогоСписка();
		ДоступнаУниверсальнаяФорма = (ДоступныеТипыОбъектов.Найти(ИмяОбъектаКоллекции) <> Неопределено);
		
	Иначе
		ДоступнаУниверсальнаяФорма = Ложь;
	КонецЕсли;
	
	Элементы.ДеревоКонтекстноеМенюОткрытьУниверсальнуюФорму.Доступность = ДоступнаУниверсальнаяФорма;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересортироватьДерево()
	
	ПолеСортировки = ПолеПредставленияОбъектов(ОсновноеПредставление);
	Для Каждого Строка Из Дерево.ПолучитьЭлементы() Цикл 
		ИТК_ФормаКлиент.СортироватьСтрокиДерева(Строка.ПолучитьЭлементы(), ПолеСортировки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолеПредставленияОбъектов(Значение)
	
	Результат = "Представление";
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолноеПредставление(ОсновноеПредставление, Имя, Синоним)
	
	Если ОсновноеПредставление = ИТК_Перечисления.ПредставлениеОбъектовИмя() Тогда
		
		Представление = Имя;
		Пояснение = Синоним;
		
	Иначе
		
		Представление = Синоним;
		Пояснение = Имя;
		
	КонецЕсли;
	
	СинонимБезПробелов = СтрЗаменить(Синоним, " ", "");
	Если СтрСравнить(Имя, СинонимБезПробелов) = 0 Тогда
		
		Результат = Представление;
		
	Иначе
		
		Результат = СтрШаблон("%1 (%2)", Представление, Пояснение); 
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОсновнойРодительСтроки(Строка)
	
	Результат = Строка;
	Родитель = Строка.ПолучитьРодителя();
	Пока Родитель <> Неопределено Цикл 
		
		Результат = Родитель;
		Родитель = Родитель.ПолучитьРодителя();
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключаемыйТекущийЭлементСтрокаПоискаПослеОжидания()

	ТекущийЭлемент = Элементы.Поиск;
	
КонецПроцедуры

#КонецОбласти