
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [20.08.2024] +        
	
	Если ТипЗнч(Объект.ЗаказДавальца) = Тип("ДокументСсылка.ЗаказДавальца2_5") Тогда
		
		Если Объект.ЗаказДавальца.Статус <> Перечисления.СтатусыЗаказовДавальцев.НеСогласован Тогда
		
			Элементы.Комментарий.ТолькоПросмотр = НЕ РольДоступна("бит_ПравоРедактированияКомментария");
			
		КонецЕсли;	
				
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [20.08.2024] -

КонецПроцедуры
