
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	бит_РаботаСДиалогамиСервер.ДобавитьКнопкуРаскраситьПоСтатусам(Элементы,
																Команды,
																Элементы.ФормаКоманднаяПанель,
																Метаданные.Справочники.бит_ВнутренниеДокументы,
																Истина);
	ОформитьСписокПоСтатусам(Элементы.РаскраситьПоСтатусам.Пометка, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьЭлементаСправочникабит_ВнутренниеДокументы" Тогда
		СпозиционироватьсяНаЗаписанномЭлементе(Параметр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыДокументов

&НаКлиенте
Процедура ВидыДокументовПриАктивизацииСтроки(Элемент)
	
	ТекущийВидДокумента = Элементы.ВидыДокументов.ТекущаяСтрока;
	ПодключитьОбработчикОжидания("УстановитьОтборВидаДокумента", 0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВидДокументаОпределен(ТекущийВидДокумента) Тогда
		СтандартнаяОбработка = Ложь;
		СоздатьВнутреннийДокумент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ВидДокументаОпределен(ТекущийВидДокумента) Тогда
		Отказ = Истина;
		СоздатьВнутреннийДокумент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// Процедура назначается динамически действию кнопки командной панели 
// КоманднаяПанель.РаскраситьПоСтатусам
// (обработчик события "Нажатие" кнопки "РаскраситьПоСтатусам").
//
&НаКлиенте
Процедура Подключаемый_РаскраситьПоСтатусам()
	
	Элементы.РаскраситьПоСтатусам.Пометка = Не Элементы.РаскраситьПоСтатусам.Пометка;
	ОформитьСписокПоСтатусам(Элементы.РаскраситьПоСтатусам.Пометка);	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура обновляет оформление списка документов по статусам.
//
// Параметры:
//  РаскраситьПоСтатусам - Булево - Признак необходимости применения условного оформления.
//  ЭтоОткрытие - Булево - Признак точки вызова процедуры.
// 
&НаСервере
Процедура ОформитьСписокПоСтатусам(Знач РаскраситьПоСтатусам, Знач ЭтоОткрытие = Ложь)

	Если ЭтоОткрытие И НЕ РаскраситьПоСтатусам Тогда
		Возврат;	
	КонецЕсли;
	
	МетаданныеОбъекта = Метаданные.Справочники.бит_ВнутренниеДокументы;
	
	ОбъектыОформления = ?(РаскраситьПоСтатусам, бит_РаботаСДиалогамиСервер.ПолучитьМассивОбъектов(МетаданныеОбъекта),
							Новый Массив);
	бит_РаботаСДиалогамиСервер.ОформитьСписокДокументовПоСтатусам(ОбъектыОформления, РаскраситьПоСтатусам,
						УсловноеОформление);
	
	Если НЕ ЭтоОткрытие Тогда
		// Сохранение значения пометки.
		РегистрыСведений.бит_СохраненныеЗначения.СохранитьЗнч(Пользователи.ТекущийПользователь(),
			МетаданныеОбъекта, "РаскраситьПоСтатусам_Пометка", РаскраситьПоСтатусам);
	КонецЕсли;
															
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборВидаДокумента()
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидДокумента", ТекущийВидДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВнутреннийДокумент()
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВидДокумента", ТекущийВидДокумента);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Справочник.бит_ВнутренниеДокументы.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Функция ВидДокументаОпределен(ТекущийВидДокумента)
	
	ТекущиеДанные = Элементы.ВидыДокументов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекущиеДанные.Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат НЕ ТекущиеДанные.ЭтоГруппа;
	
КонецФункции

&НаКлиенте
Процедура СпозиционироватьсяНаЗаписанномЭлементе(ПараметрыЭлемента)
	
	ТекущийОтбор = Новый Структура;
	ТекущийОтбор.Вставить("ВидДокумента", ТекущийВидДокумента);
	Если ЗаписанныеДанныеСоответствуютОтбору(ПараметрыЭлемента, ТекущийОтбор) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийВидДокумента = ПредопределенноеЗначение("Справочник.бит_ВидыВнутреннихДокументов.ПустаяСсылка");
	Элементы.ВидыДокументов.ТекущаяСтрока = ТекущийВидДокумента;
	УстановитьОтборВидаДокумента();
	Элементы.Список.ТекущаяСтрока = ПараметрыЭлемента.Ссылка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписанныеДанныеСоответствуютОтбору(Знач ПараметрыЭлемента, Знач ТекущийОтбор)

	ОтборВидДокумента = ТекущийОтбор.ВидДокумента;
	
	Если ОтборВидДокумента.Пустая() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ВидыВнутреннихДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ВидыВнутреннихДокументов КАК бит_ВидыВнутреннихДокументов
	|ГДЕ
	|	бит_ВидыВнутреннихДокументов.Ссылка В ИЕРАРХИИ(&ТекущийОтбор)
	|	И бит_ВидыВнутреннихДокументов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("ТекущийОтбор", ОтборВидДокумента);
	Запрос.УстановитьПараметр("Ссылка", ПараметрыЭлемента.ВидДокумента);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
