
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.15]  [VUVaynula@1cbit.ru] [21.06.2026 0:36:12] +        
	Если Не (Параметры.Свойство("Отбор") 
				И Параметры.Отбор.Свойство("ПодразделениеДиспетчерИлиПроизводственноеПодразделение"))
		И (Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ПроизводственноеПодразделение")) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПроизводственноеПодразделение", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.15]  [VUVaynula@1cbit.ru] [21.06.2026 0:36:12] -
КонецПроцедуры
