
#Область СлужебныйПрограммныйИнтерфейс

#Область ПроцедурыИФункцииСтруктурыПодчиненности

// Функция получает список подчиненных документов.
// 
// Параметры:
//  ДокументОснование 			- ДокументСсылка.
//  мКэшПраваДоступаКМетаданным - Соответствие.
// 
// Возвращаемое значение:
//  ТаблицаДокументов - ТаблицаЗначений.
// 
Функция ПодчиненныеДоступныеДокументы(ДокументОснование, мКэшПраваДоступаКМетаданным, ИмяКритерия = "бит_СтруктураПодчиненностиЗадач") Экспорт
		
	ТекстЗапроса = "";
	
	ТаблицаДокументов 	 = Новый ТаблицаЗначений;
	ТипДокументОснование = ТипЗнч(ДокументОснование);
	СоставКритерия		 = Метаданные.КритерииОтбора[ИмяКритерия].Состав;
	
	Для Каждого ЭлементСостава Из СоставКритерия Цикл
		
		Если Не ЭлементСостава.Тип.СодержитТип(ТипДокументОснование) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = ЭлементСостава.ПолноеИмя();
		СтруктураПутьКДанным = бит_ОбщегоНазначения.РазобратьПутьКОбъектуМетаданных(ПутьКДанным
																				   ,мКэшПраваДоступаКМетаданным);
		Если Не СтруктураПутьКДанным.ЕстьДоступКМетаданным Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = СтруктураПутьКДанным.ТипОбъекта + "." + СтруктураПутьКДанным.ВидОбъекта;
		
		ТекущаяСтрокаГДЕ = "ГДЕ " + СтруктураПутьКДанным.ВидОбъекта + "." 
						   + СтруктураПутьКДанным.ИмяРеквизита + " = &ЗначениеКритерияОтбора";
			
		ИмяТЧ 		 = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		ИмяРеквизита = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".") -1);
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ОБЪЕДИНИТЬ
					   |ВЫБРАТЬ") + "
					   |" + СтруктураПутьКДанным.ВидОбъекта   + ".Ссылка ИЗ " + ИмяОбъекта 						+ "."
					      + СтруктураПутьКДанным.ИмяТаблЧасти + " КАК " 	  + СтруктураПутьКДанным.ВидОбъекта + "
					   |" + СтрЗаменить(ТекущаяСтрокаГДЕ, "..", ".") + "
					   |";
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ТаблицаДокументов = РезультатЗапроса.Выгрузить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаДокументов;
	
КонецФункции // ПодчиненныеДоступныеДокументы()

// Функция выполняет действия перед стартом системы.
// 
// Возвращаемое значение:
//  РезСтр - Структура.
// 
Функция ДействияПередСтартомСистемы() Экспорт

	РезСтр = Новый Структура("ТекстСообщения, Отказ, ЭтоИнтПоставка", "", Ложь, Ложь);
	
	РезСтр.ЭтоИнтПоставка = бит_ОбщегоНазначения.ЭтоИнтернационаяПоставка();
	
	Если Пользователи.ЭтоСеансВнешнегоПользователя() Тогда
		Возврат РезСтр;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ТекстСообщения = ПроверитьВозможностьСтартаСистемы(Отказ);
	
	Если НЕ Отказ И РезСтр.ЭтоИнтПоставка Тогда
		
		Параметры = Новый Структура;
		Параметры.Вставить("ПервыйЗапросПараметров"                 , Ложь);
		Параметры.Вставить("ПараметрЗапуска"                        , ""); // ПараметрЗапуска
		Параметры.Вставить("СтрокаСоединенияИнформационнойБазы"     , СтрокаСоединенияИнформационнойБазы());
		Параметры.Вставить("ПолученныеПараметрыКлиента"             , Неопределено);
		Параметры.Вставить("СкрытьРабочийСтолПриНачалеРаботыСистемы", Истина);		
		
		// Установка даты клиента непосредственно перед вызовом, чтобы уменьшить погрешность.
		Параметры.Вставить("ТекущаяДатаНаКлиенте", ТекущаяДата()); // Для расчета ПоправкаКВремениСеанса.
		Параметры.Вставить("ТекущаяУниверсальнаяДатаВМиллисекундахНаКлиенте",
		ТекущаяУниверсальнаяДатаВМиллисекундах());
		
		ПарамКлиента = СтандартныеПодсистемыВызовСервера.ПараметрыРаботыКлиентаПриЗапуске(Параметры);
		
		Если ПарамКлиента.Свойство("НеобходимоОбновлениеИнформационнойБазы") 
			  И ПарамКлиента.НеобходимоОбновлениеИнформационнойБазы Тогда
			  
			Если Метаданные.РегистрыСведений.Найти("бит_ДоступныеИнтерфейсы") <> Неопределено Тогда
				  
			 	ТекПользователь   = Пользователи.ТекущийПользователь();
			 	флДоступенРусский = РегистрыСведений.бит_ДоступныеИнтерфейсы.ОпределитьДоступностьРусскогоИнтерфейса(ТекПользователь);
			 
				Если НЕ флДоступенРусский Тогда
				 
					Отказ = Истина;
					ТекстСообщения = НСтр("ru='Необходимо выполнить обновление информационной базы. 
										  |Обновление может быть выполнено только пользователем с русским интерфейсом.'; 
									  |en = 'Update of the information base have to be done. 
										  |In the current version updates can be performed in the Russian interface only.'");
			 
			 КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли; 
	
	КонецЕсли; 
	
	РезСтр.ТекстСообщения = ТекстСообщения;
	РезСтр.Отказ = Отказ;

	Если Отказ Тогда
		ИмяСобытия = НСтр("ru='Запуск программы';en='Program start'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);		
	КонецЕсли; 
	
	Возврат РезСтр;
	
КонецФункции // ДействияПередСтартомСистемы()

// Функция проверяет является ли данный узел чужим подчиненным.
// 
// Возвращаемое значение:
//  ЭтоЧужой - Булево.
// 
Функция ЭтоЧужойПодчиненныйУзел() Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		ЭтоЧужой = Ложь;		
	Иначе
		Если НЕ Метаданные.ПланыОбмена.Найти("бит_Полный") = Неопределено Тогда
			ЭтоЧужой = ?(ВРег(ПланыОбмена.ГлавныйУзел().Метаданные().Имя) = ВРег("бит_Полный"), Ложь, Истина);
		Иначе
			ЭтоЧужой = ?(ВРег(ПланыОбмена.ГлавныйУзел().Метаданные().Имя) = ВРег("Полный"), Ложь, Истина);
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат ЭтоЧужой;
	
КонецФункции // ЭтоЧужойПодчиненныйУзел()

// Получает перечень параметров, определяющих действия, необходимые при старте системы. 
// 
// Параметры:
//  ТочкаВызова - Строка
// 
Функция ПолучитьПараметрыДляСтартаСистемы(ТочкаВызова = "")  Экспорт
		
	ПараметрыСтарта = НовыеПараметрыДляСтартаСистемы();
    	
	ПараметрыСтарта.ЭтоЧужойПодчиненныйУзел = ЭтоЧужойПодчиненныйУзел();           
	
	Если ПараметрыСтарта.ЭтоЧужойПодчиненныйУзел 
		ИЛИ Пользователи.ЭтоСеансВнешнегоПользователя() Тогда
		Возврат ПараметрыСтарта;	
	КонецЕсли; 
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	Если Метаданные.РегистрыСведений.Найти("бит_ДоступныеИнтерфейсы") <> Неопределено Тогда
		ПараметрыСтарта.РусскийПользователь = РегистрыСведений.бит_ДоступныеИнтерфейсы.ОпределитьДоступностьРусскогоИнтерфейса(ТекПользователь);	
	Иначе
		ПараметрыСтарта.РусскийПользователь = Истина;
	КонецЕсли;	

	// При обновлении ИБ значение данной настройки устанавливается в "Истина", нет необходимости в дополнительных проверках.
	// См. бит_ОбновлениеИнформационнойБазыБФ.ЗаписатьНастройкуПоказыватьДополнительнуюИнформациюБит().
	ОткрытьДополнительнуюИнформацию = бит_УправлениеПользователямиСервер.ПолучитьНастройкуПользователя(
		"ПоказыватьДополнительнуюИнформациюБит", ТекПользователь) И ПараметрыСтарта.РусскийПользователь;
	ПараметрыСтарта.ОткрытьДополнительнуюИнформациюБИТ = ОткрытьДополнительнуюИнформацию; 
		
	// Открытие рабочего места визирования.
	ОткрытьРабочееМестоВизирования = ПравоДоступа("Использование", Метаданные.Обработки.бит_КонсольОперативногоВизирования) 
		И бит_УправлениеПользователямиСервер.ПолучитьНастройкуПользователя("НапоминатьОНеобходимостиУстановкиВизПриЗапуске",ТекПользователь);
	ПараметрыСтарта.ОткрытьРабочееМестоВизирования = ОткрытьРабочееМестоВизирования; 							  				 
	
	Интервал = бит_УправлениеПользователямиСервер.ПолучитьНастройкуПользователя("ИнтервалУведомленияУстановкиВиз",ТекПользователь);
	Интервал = ?(ПравоДоступа("Использование", Метаданные.Обработки.бит_КонсольОперативногоВизирования), Интервал, 0);
	ПараметрыСтарта.ИнтервалУведомленияУстановкиВиз = Интервал;
	
	Возврат ПараметрыСтарта;
	
КонецФункции
 
// Функция получает код языка используемый в текущем сеансе.
// 
// Возвращаемое значение:
//  КодЯзыка - Строка.
// 
Функция ПолучитьКодЯзыка() Экспорт

	КодЯзыка = "ru";
	
	ТекЯзык = ТекущийЯзык();
	
	Если ТипЗнч(ТекЯзык) = Тип("ОбъектМетаданных") Тогда
		
		КодЯзыка = ТекЯзык.КодЯзыка;
	
	Иначе	
		
		КодЯзыка = ТекЯзык;
		
	КонецЕсли; 
	
	Возврат КодЯзыка;
	
КонецФункции // ПолучитьКодЯзыка()

// Функция определяет доступность общих настроек пользователю.
//
// Возвращаемое значение:
//  Булево.
//
Функция ДоступностьОбщихНастроек() Экспорт

	флДоступность = (Метаданные.Роли.Найти("бит_сл_Администратор") <> Неопределено И РольДоступна("бит_сл_Администратор")) 
		ИЛИ (Метаданные.Роли.Найти("сл2_Администратор") <> Неопределено И РольДоступна("сл2_Администратор"))
		ИЛИ (Метаданные.Роли.Найти("ПолныеПрава") <> Неопределено И РольДоступна("ПолныеПрава")) 
		ИЛИ (Метаданные.Роли.Найти("бит_ПолныеПрава") <> Неопределено И РольДоступна("бит_ПолныеПрава")) 
		ИЛИ ПользователиИнформационнойБазы.ТекущийПользователь().Имя = "";	

	Возврат флДоступность;
	
КонецФункции // ДоступностьОбщихНастроек()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеПараметрыДляСтартаСистемы()

	Параметры = Новый Структура; 	
	Параметры.Вставить("ЭтоЧужойПодчиненныйУзел", Ложь);
	Параметры.Вставить("РусскийПользователь", Истина);
	Параметры.Вставить("ОткрытьДополнительнуюИнформациюБИТ", Ложь);
	Параметры.Вставить("ОткрытьРабочееМестоВизирования", Ложь);
	Параметры.Вставить("ИнтервалУведомленияУстановкиВиз", 0);
	
	Возврат Параметры;
	
КонецФункции

// Функция проверяет возможность старта системы с текущим набором ролей.
// 
// Параметры:
//  Отказ - Булево.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПроверитьВозможностьСтартаСистемы(Отказ)
	
	Протокол = НСтр("ru='Недостаточно прав доступа';en='Insufficient access rights'");
	
	Если Метаданные.РегистрыСведений.Найти("бит_ДоступныеИнтерфейсы") <> Неопределено Тогда
		// Проверка настроек доступности русского интерефейса.
		ТекПользователь = Пользователи.ТекущийПользователь();		
		РегистрыСведений.бит_ДоступныеИнтерфейсы.ПроверитьУстановитьДоступностьРусскогоИнтерфейса(ТекПользователь);
	КонецЕсли;	
	
	Возврат Протокол;
	
КонецФункции // ПроверитьВозможностьСтартаСистемы()

#КонецОбласти