
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ7.2] [ASHolyavko@1cbit.ru] [28.08.2025] +        
	
	НовыйЭлемент = Элементы.Добавить("бит_ВыплачиваетсяПремияЗаМногостаночноеОбслуживание", Тип("ПолеФормы"), Элементы.ГруппаНадбавкаЗаВредность); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВыплачиваетсяПремияЗаМногостаночноеОбслуживание";
 
	НовыйЭлемент = Элементы.Добавить("бит_ВыплачиваетсяПремияЗаСложностьОборудования", Тип("ПолеФормы"), Элементы.ГруппаНадбавкаЗаВредность); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВыплачиваетсяПремияЗаСложностьОборудования";
	
	// }}ПервыйБИТ ЛистТребований [ЛТ7.2] [ASHolyavko@1cbit.ru] [28.08.2025] -
	
КонецПроцедуры
