#Область ОписаниеПеременных

&НаКлиенте
Перем ИдетПолучениеСвойств;

&НаКлиенте
Перем ИдетПолучениеСтруктурыХранения;

&НаКлиенте
Перем ИдетПолучениеСсылокНаОбъект;

&НаКлиенте
Перем ТребуетсяОбновлениеСвойствПриСменеСтраницы;

&НаКлиенте
Перем ТребуетсяОбновлениеСтруктурыХраненияПриСменеСтраницы;

&НаКлиенте
Перем ТребуетсяОбновлениеСсылокНаОбъектПриСменеСтраницы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОписаниеОбъектаМетаданных = ИТК_МетаданныеКлиентСервер.ОсновнойДополнительныйОбъектПоПолномуИмени(Параметры.Ключ);
	ПолноеИмя = ОписаниеОбъектаМетаданных.ОсновнойОбъект;
	ПолноеИмяДополнение = ОписаниеОбъектаМетаданных.Дополнение;
	
	ТолькоВажныеСвойства = Истина;
	ИменаВБазеДанныхВТерминах = "СУБД";
	
	Страница = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "Страница");
	Если ЗначениеЗаполнено(Страница) Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы["Страница" + Страница];
	КонецЕсли;

	ОбновитьЭлементыФормыПриСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИТК_ОбщийКлиент.ОбработчикПриОткрытии(Отказ);
	
	ИдетПолучениеСвойств = Ложь;
	ИдетПолучениеСтруктурыХранения = Ложь;
	ИдетПолучениеСсылокНаОбъект = Ложь;
	
	ТребуетсяОбновлениеСвойствПриСменеСтраницы = Истина;
	ТребуетсяОбновлениеСтруктурыХраненияПриСменеСтраницы = Истина;
	ТребуетсяОбновлениеСсылокНаОбъектПриСменеСтраницы = Истина;
	
	СтраницыПриСменеСтраницы(Элементы.Страницы, Элементы.Страницы.ТекущаяСтраница);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаОсновное Тогда
		
		Если ТребуетсяОбновлениеСвойствПриСменеСтраницы Тогда
			ОбновитьСвойства();
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаСтруктураХранения Тогда
			
		Если ТребуетсяОбновлениеСтруктурыХраненияПриСменеСтраницы Тогда
			ОбновитьСтруктуруХранения();
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаСсылкиНаОбъект Тогда
			
		Если ТребуетсяОбновлениеСсылокНаОбъектПриСменеСтраницы Тогда
			ОбновитьСсылкиНаОбъект();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИменаВБазеДанныхВТерминахПриИзменении(Элемент)

	ОбновитьСтруктуруХранения();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоСвойствОбъекта

&НаКлиенте
Процедура ДеревоСвойствОбъектаВыбор(Элемент, ИдентификаторВыбраннойСтроки, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент <> Элементы.ДеревоСвойствОбъектаПредставлениеГиперссылки Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяСтрока = ДеревоСвойствОбъекта.НайтиПоИдентификатору(ИдентификаторВыбраннойСтроки);
	ДанныеГиперссылки = ВыбраннаяСтрока.ДанныеГиперссылки;
	ЗначениеСвойства = Элемент.ТекущиеДанные.Значение;
	
	ИТК_ИнструментМетаданныеКлиент.ОбработкаГиперссылкиСвойства(ЭтотОбъект, ДанныеГиперссылки, ЗначениеСвойства, ПолноеИмя, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоСсылкиНаОбъект

&НаКлиенте
Процедура ДеревоСсылкиНаОбъектВыбор(Элемент, ИдентификаторВыбраннойСтроки, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент <> Элементы.ДеревоСсылкиНаОбъектМетаданные Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяСтрока = ДеревоСсылкиНаОбъект.НайтиПоИдентификатору(ИдентификаторВыбраннойСтроки);
	
	Если НЕ ЗначениеЗаполнено(ВыбраннаяСтрока.Метаданные) Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(ИТК_Перечисления.ИнструментМетаданные(), ВыбраннаяСтрока.Метаданные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазвернутьВсеСвойства(Команда)

	ИТК_ФормаКлиент.РазвернутьДерево(Элементы.ДеревоСвойствОбъекта, ДеревоСвойствОбъекта, Истина);

КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсеСвойства(Команда)
	
	ИТК_ФормаКлиент.СвернутьДерево(Элементы.ДеревоСвойствОбъекта, ДеревоСвойствОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоВажныеСвойства(Команда)
	
	ТолькоВажныеСвойства = НЕ ТолькоВажныеСвойства;
	ОбновитьСвойства();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсюСтруктуру(Команда)

	ИТК_ФормаКлиент.РазвернутьДерево(Элементы.ДеревоСтруктурыХранения, ДеревоСтруктурыХранения, Истина);

КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсюСтруктуру(Команда)
	
	ИТК_ФормаКлиент.СвернутьДерево(Элементы.ДеревоСтруктурыХранения, ДеревоСтруктурыХранения);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеСсылкиНаОбъект(Команда)

	ИТК_ФормаКлиент.РазвернутьДерево(Элементы.ДеревоСсылкиНаОбъект, ДеревоСсылкиНаОбъект, Истина);

КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсеСсылкиНаОбъект(Команда)
	
	ИТК_ФормаКлиент.СвернутьДерево(Элементы.ДеревоСсылкиНаОбъект, ДеревоСсылкиНаОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыФормыПриСозданииНаСервере()
	
	Заголовок = ПолноеИмя;

	УстановитьУсловноеОформление();

	Состояние = НСтр("ru = 'Получение свойств объекта...';
					|en = 'Getting properties of an object...'");
	ИТК_ФормаКлиентСервер.ОтображениеСостоянияТабличногоДокумента(Элементы.ИдетПолучениеСвойствТабличныйДокумент, Состояние);
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.ДеревоСвойствОбъекта);
	
	Состояние = НСтр("ru = 'Получение структуры хранения...';
					|en = 'Getting storage structure...'");
	ИТК_ФормаКлиентСервер.ОтображениеСостоянияТабличногоДокумента(Элементы.ИдетПолучениеСтруктурыХраненияТабличныйДокумент, Состояние);
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.ДеревоСтруктурыХранения);
	
	Состояние = НСтр("ru = 'Получение ссылок на объект...';
					|en = 'Getting references to an object...'");
	ИТК_ФормаКлиентСервер.ОтображениеСостоянияТабличногоДокумента(Элементы.ИдетПолучениеСсылокНаОбъектТабличныйДокумент, Состояние);
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.ДеревоСсылкиНаОбъект);
	
	ИмяКоллекции = ИТК_Метаданные.ИмяКоллекции(ПолноеИмя);
	ДоступноИндексирование = ИТК_МетаданныеКлиентСерверПовтИсп.ИмеетИндексируемыеРеквизиты(ИмяКоллекции)
								ИЛИ ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоЖурналДокументов(ИмяКоллекции)
								ИЛИ ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоРегистр(ИмяКоллекции);
	Элементы.ДеревоСвойствОбъектаИндексирование.Видимость = ДоступноИндексирование;
	
	// Страницы
	ДоступнаСтруктураХранения = ИТК_МетаданныеКлиентСерверПовтИсп.ИмеетСтруктуруХранения(ИмяКоллекции);
	Элементы.СтраницаСтруктураХранения.Видимость = ДоступнаСтруктураХранения;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ДеревоСвойствОбъекта.Видимость = НЕ ИдетПолучениеСвойств;
	Элементы.ДеревоСвойстваОбъектаПоказыватьТолькоВажныеСвойства.Пометка = ТолькоВажныеСвойства;
	
	Элементы.ИдетПолучениеСвойствТабличныйДокумент.Видимость = ИдетПолучениеСвойств;
	
	Элементы.ДеревоСтруктурыХранения.Видимость = НЕ ИдетПолучениеСтруктурыХранения;
	Элементы.ИдетПолучениеСтруктурыХраненияТабличныйДокумент.Видимость = ИдетПолучениеСтруктурыХранения;
	
	Элементы.ДеревоСсылкиНаОбъект.Видимость = НЕ ИдетПолучениеСсылокНаОбъект;
	Элементы.ИдетПолучениеСсылокНаОбъектТабличныйДокумент.Видимость = ИдетПолучениеСсылокНаОбъект;
	
	Элементы.ДеревоСвойствОбъектаРасширение.Видимость = ИТК_МетаданныеКлиентСерверПовтИсп.ИспользуютсяРасширения()
																И ИТК_ОбщийКлиент.ЗаполненаКолонкаДерева(ДеревоСвойствОбъекта, "Расширение");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Дерево свойств
	Оформление = Новый Структура("Шрифт", ИТК_ОбщийКлиентСервер.ШрифтЖирный());
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ДеревоСвойствОбъекта", Оформление,
												"ДеревоСвойствОбъекта.ЭтоГруппа", Истина);
	
	Оформление = Новый Структура("Шрифт", ИТК_ОбщийКлиентСервер.ШрифтЖирный());
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ДеревоСвойствОбъектаИндексирование", Оформление,
												"ДеревоСвойствОбъекта.Индексирование", Неопределено, ВидСравненияКомпоновкиДанных.Заполнено);
	
	Оформление = Новый Структура("Видимость", Ложь);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ДеревоСвойствОбъектаТип", Оформление, "ДеревоСвойствОбъекта.ПредставлениеГиперссылки", , ВидСравненияКомпоновкиДанных.Заполнено);
	
	Оформление = Новый Структура("Видимость", Ложь);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ДеревоСвойствОбъектаПредставлениеГиперссылки", Оформление, "ДеревоСвойствОбъекта.ПредставлениеГиперссылки", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	// Дерево структуры хранения
	Оформление = Новый Структура("Шрифт", ИТК_ОбщийКлиентСервер.ШрифтЖирный());
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ДеревоСтруктурыХранения", Оформление,
												"ДеревоСтруктурыХранения.ЭтоГруппа", Истина);
	
	Оформление = Новый Структура("Текст", "<...>");
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ДеревоСтруктурыХраненияПоле", Оформление,
												"ДеревоСтруктурыХранения.Поле", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСвойства()

	ИдетПолучениеСвойств = Истина;
	ТребуетсяОбновлениеСвойствПриСменеСтраницы = Ложь;
		
	ДлительнаяОперацияСвойства = ОбновитьСвойстваНаСервере(ПолноеИмя, ТолькоВажныеСвойства, УникальныйИдентификатор);
		
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеСвойств", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияСвойства, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьСвойстваНаСервере(ПолноеИмя, ТолькоВажныеСвойства, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПолноеИмя", ПолноеИмя);
	ПараметрыПроцедуры.Вставить("ТолькоВажныеСвойства", ТолькоВажныеСвойства);

	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_ИнструментМетаданныеСвойстваОбъекта.СвойстваОбъекта", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноОбновлениеСвойств(Результат, ДополнительныеПараметры) Экспорт
	
	ИдетПолучениеСвойств = Ложь;
	ОбновитьЭлементыФормы();

	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОбновитьЗначениеСвойствНаФорме(Результат.АдресРезультата);
		
		КорневаяСтрока = ДеревоСвойствОбъекта.ПолучитьЭлементы()[0];
		РазвернутьВсеУровни = (КорневаяСтрока.ПолучитьЭлементы().Количество() = 1)
									ИЛИ ИТК_ОбщийКлиент.КоличествоСтрокВДереве(ДеревоСвойствОбъекта) <= 20;
		ИТК_ФормаКлиент.РазвернутьДерево(Элементы.ДеревоСвойствОбъекта, ДеревоСвойствОбъекта, РазвернутьВсеУровни);
		
		АктивироватьЭлементыСвойствПоПараметруДополнение();
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначениеСвойствНаФорме(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗначениеВРеквизитФормы(Результат, "ДеревоСвойствОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьЭлементыСвойствПоПараметруДополнение()
	
	Если НЕ ЗначениеЗаполнено(ПолноеИмяДополнение) Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиПолноеИмяДополнение = СтрРазделить(ПолноеИмяДополнение, ".");
	ПолноеИмяДополнение = Неопределено;
	
	Если ЧастиПолноеИмяДополнение.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОбъектаКоллекции = ЧастиПолноеИмяДополнение[0];
	ИмяОбъекта = ЧастиПолноеИмяДополнение[1];
	
	СоответствиеОбъектаИКоллеции = Новый Соответствие;
	СоответствиеОбъектаИКоллеции.Вставить("Реквизит", "Реквизиты");
	СоответствиеОбъектаИКоллеции.Вставить("Команда", "Команды");
	СоответствиеОбъектаИКоллеции.Вставить("ТабличнаяЧасть", "ТабличныеЧасти");
	
	ИмяКоллекции = СоответствиеОбъектаИКоллеции.Получить(ИмяОбъектаКоллекции);
	ЭтоКоллекцияТабличнаяЧасть = (ИмяОбъектаКоллекции = "ТабличнаяЧасть");

	СтрокаРодитель = ИТК_ФормаКлиент.НайтиСтрокуДерева(ДеревоСвойствОбъекта, "Значение", ИмяКоллекции);
	Если СтрокаРодитель = Неопределено Тогда 
		
		Возврат;
	КонецЕсли;
	
	АктивируемаяСтрока = СтрокаРодитель;
	Элементы.ДеревоСвойствОбъекта.Развернуть(СтрокаРодитель.ПолучитьИдентификатор(), Истина);
	
	Если ЭтоКоллекцияТабличнаяЧасть Тогда
		ИмяПоляПоискаЭлементаКоллекции = "Значение";
	Иначе
		ИмяПоляПоискаЭлементаКоллекции = "Имя";
	КонецЕсли;
	
	СтрокаЭлемент = ИТК_ФормаКлиент.НайтиСтрокуДерева(СтрокаРодитель, ИмяПоляПоискаЭлементаКоллекции, ИмяОбъекта);
	Если СтрокаЭлемент = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	АктивируемаяСтрока = СтрокаЭлемент;
	
	Если ЭтоКоллекцияТабличнаяЧасть Тогда
		
		Элементы.ДеревоСвойствОбъекта.Развернуть(СтрокаЭлемент.ПолучитьИдентификатор(), Истина);
		ИмяРеквизита = ЧастиПолноеИмяДополнение[3];
		
		СтрокаРеквизит = ИТК_ФормаКлиент.НайтиСтрокуДерева(СтрокаЭлемент, "Имя", ИмяРеквизита);
		Если СтрокаРеквизит = Неопределено Тогда
			Возврат;
		КонецЕсли;
		АктивируемаяСтрока = СтрокаРеквизит;
		
	КонецЕсли;
	
	Элементы.ДеревоСвойствОбъекта.ТекущаяСтрока = АктивируемаяСтрока.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтруктуруХранения()

	ИдетПолучениеСтруктурыХранения = Истина;
	ТребуетсяОбновлениеСтруктурыХраненияПриСменеСтраницы = Ложь;
		
	ДлительнаяОперацияСтруктураХранения = ОбновитьСтруктуруХраненияНаСервере(ПолноеИмя, ИменаВБазеДанныхВТерминах, УникальныйИдентификатор);
		
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеСтруктурыХранения", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияСтруктураХранения, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьСтруктуруХраненияНаСервере(ПолноеИмя, ИменаВБазеДанныхВТерминах, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПолноеИмя", ПолноеИмя);
	ПараметрыПроцедуры.Вставить("ИменаВБазеДанныхВТерминах", ИменаВБазеДанныхВТерминах);

	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_ИнструментМетаданныеСвойстваОбъекта.СтруктураХранения", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноОбновлениеСтруктурыХранения(Результат, ДополнительныеПараметры) Экспорт
	
	ИдетПолучениеСтруктурыХранения = Ложь;
	ОбновитьЭлементыФормы();

	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОбновитьЗначениеСтруктурыХраненияНаФорме(Результат.АдресРезультата);
		ИТК_ФормаКлиент.РазвернутьДерево(Элементы.ДеревоСтруктурыХранения, ДеревоСтруктурыХранения);
		
		ТекущийЭлемент = Элементы.ДеревоСтруктурыХранения;
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначениеСтруктурыХраненияНаФорме(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗначениеВРеквизитФормы(Результат, "ДеревоСтруктурыХранения");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСсылкиНаОбъект()

	ИдетПолучениеСсылокНаОбъект = Истина;
	ТребуетсяОбновлениеСсылокНаОбъектПриСменеСтраницы = Ложь;
		
	ДлительнаяОперацияСсылкиНаОбъект = ОбновитьСсылкиНаОбъектНаСервере(ПолноеИмя, УникальныйИдентификатор);
		
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеСсылокНаОбъект", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияСсылкиНаОбъект, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьСсылкиНаОбъектНаСервере(ПолноеИмя, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПолноеИмя", ПолноеИмя);

	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_ИнструментМетаданныеСвойстваОбъекта.СсылкиНаОбъект", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноОбновлениеСсылокНаОбъект(Результат, ДополнительныеПараметры) Экспорт
	
	ИдетПолучениеСсылокНаОбъект = Ложь;
	ОбновитьЭлементыФормы();

	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОбновитьЗначениеСсылкиНаОбъектНаФорме(Результат.АдресРезультата);
		
		Если ИТК_ОбщийКлиент.КоличествоСтрокВДереве(ДеревоСсылкиНаОбъект) <= 20 Тогда
			ИТК_ФормаКлиент.РазвернутьДерево(Элементы.ДеревоСсылкиНаОбъект, ДеревоСсылкиНаОбъект);
		КонецЕсли;
		
		ТекущийЭлемент = Элементы.ДеревоСсылкиНаОбъект;
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначениеСсылкиНаОбъектНаФорме(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗначениеВРеквизитФормы(Результат, "ДеревоСсылкиНаОбъект");
	
КонецПроцедуры

#КонецОбласти