
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Задача = Параметры.Задача;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Задача;
	
	Если ТипЗнч(Задача) = Тип("БизнесПроцессСсылка.бит_Процесс") Тогда
	
		ЭтотОбъект.Заголовок = НСтр("ru='История изменения состояний процесса';en='History of process states change'");
		Элементы.Задача.Заголовок = НСтр("ru='Процесс';en='Process'");
		
	Иначе
		
		ЭтотОбъект.Заголовок = НСтр("ru='История изменения состояний задачи';en='Task Status Change Hiostry'");
		Элементы.Задача.Заголовок = НСтр("ru='Задача';en='Task'");		
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти
