#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура бит_ПерезаполнитьПоОперациям(Знач мЭтапов) Экспорт 
	// {{ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [02.12.2025 0:35:51] +        
	Если мЭтапов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("мЭтапов", мЭтапов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ЗначенияПоУмолчаниюЗначения.Значение КАК Значение
	               |ПОМЕСТИТЬ ВидыГП
	               |ИЗ
	               |	Справочник.бит_ЗначенияПоУмолчанию.Значения КАК бит_ЗначенияПоУмолчаниюЗначения
	               |ГДЕ
	               |	бит_ЗначенияПоУмолчаниюЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.бит_ЗначенияПоУмолчанию.ВидыНоменклатурыГотовойПродукцииВПроизводственнойОперации)
	               |";
	Запрос.Выполнить();
	
	// сначала скорректируем количество в операциях
	СкорректироватьКоличествоПобочногоВыходаВОперациях(Запрос);
	
	// теперь сама трансляция
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка КАК ПроизводственнаяОперация,
	               |	ПроизводственнаяОперация2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	               |	ПроизводственнаяОперация2_2ВыходныеИзделия.Серия КАК СерияНоменклатуры,
	               |	ПроизводственнаяОперация2_2ВыходныеИзделия.Количество КАК Количество,
	               |	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка.Этап КАК Этап,
	               |	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка.СменноеЗадание.Дата КАК ДатаПроизводства
	               |ПОМЕСТИТЬ База
	               |ИЗ
	               |	Документ.ПроизводственнаяОперация2_2.ВыходныеИзделия КАК ПроизводственнаяОперация2_2ВыходныеИзделия
	               |ГДЕ
	               |	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка.Этап В(&мЭтапов)
	               |	И ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка.Проведен
	               |	И ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроизводственныхОпераций.Выполнена)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	База.Этап КАК Этап,
	               |	База.Номенклатура КАК Номенклатура,
	               |	База.СерияНоменклатуры КАК Серия,
	               |	База.ДатаПроизводства КАК ДатаПроизводства,
	               |	СУММА(База.Количество) КАК Количество
	               |ИЗ
	               |	База КАК База
	               |ГДЕ
	               |	База.Номенклатура.ВидНоменклатуры В
	               |			(ВЫБРАТЬ
	               |				ВидыГП.Значение
	               |			ИЗ
	               |				ВидыГП)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	База.Этап,
	               |	База.Номенклатура,
	               |	База.СерияНоменклатуры,
	               |	База.ДатаПроизводства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	База.Этап КАК Этап,
	               |	База.Номенклатура КАК Номенклатура,
	               |	База.СерияНоменклатуры КАК Серия,
	               |	База.ДатаПроизводства КАК ДатаПроизводства,
	               |	СУММА(База.Количество) КАК Количество
	               |ИЗ
	               |	База КАК База
	               |ГДЕ
	               |	НЕ База.Номенклатура.ВидНоменклатуры В
	               |				(ВЫБРАТЬ
	               |					ВидыГП.Значение
	               |				ИЗ
	               |					ВидыГП)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	База.Этап,
	               |	База.Номенклатура,
	               |	База.СерияНоменклатуры,
	               |	База.ДатаПроизводства";

	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
    тзВыходныеИзделияБаза = МассивРезультатовЗапроса[1].Выгрузить();
	тзПобочныйВыходБаза = МассивРезультатовЗапроса[2].Выгрузить();
	
	КГ = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("166");
	
	Для каждого текЭтап Из мЭтапов Цикл
		// собсно гемор перезаполнения бегин                                                         
		СтруктураПоиска = Новый Структура("Этап", текЭтап);
		СтрокиВыходныеИзделияБазаРаспределения = тзВыходныеИзделияБаза.НайтиСтроки(СтруктураПоиска); 
		СтрокиПобочкаБазаРаспределения = тзПобочныйВыходБаза.НайтиСтроки(СтруктураПоиска); 
		
		Если СтрокиВыходныеИзделияБазаРаспределения.Количество() = 0 Тогда
			Продолжить; // попытаться стоило
		КонецЕсли;               
		
		ЭтапОбъект = ТекЭтап.ПолучитьОбъект();
		ЭтапОбъект.ВыходныеИзделия.Очистить();
		
		// -----------Коэффициент пересчета из спецификации---------------------------
		Спецификация = текЭтап.Спецификация; 
		Если Спецификация.ОсновноеИзделиеУпаковка.Знаменатель = 0 Тогда
			КоэфУпакРС = 1;
		Иначе
			КоэфУпакРС = Спецификация.ОсновноеИзделиеУпаковка.Числитель / Спецификация.ОсновноеИзделиеУпаковка.Знаменатель;
		КонецЕсли;
			
		КоэфРС = Спецификация.ОсновноеИзделиеКоличествоУпаковок * КоэфУпакРС;  
		Если КоэфРС = 0 Тогда 
			КоэфРС = 1;
		КонецЕсли;
		КоэффициентПересчета = текЭтап.КоличествоУпаковокФакт / КоэфРС;
		// --------------------------------------
		тзЭтапаВыходныеИзделия = текЭтап.ВыходныеИзделия.Выгрузить();
		// --------------------------------------
		// вернем на место отмененные
		//СтрокиПоКлючу = тзЭтапаВыходныеИзделия.НайтиСтроки(Новый Структура("Отменено", Истина));
		//Для каждого СтрОтмены Из СтрокиПоКлючу Цикл
		//	нов = ЭтапОбъект.ВыходныеИзделия.Добавить();
		//	ЗаполнитьЗначенияСвойств(нов, СтрОтмены);
		//КонецЦикла;
		// свернем то что было в этапе
		тзЭтапаВыходныеИзделия.Свернуть("Номенклатура, Характеристика, Получатель, Упаковка, Назначение, Подразделение, Отменено, ПричинаОтмены", "Количество, КоличествоУпаковок");
		тзЭтапаВыходныеИзделия.Колонки.Добавить("Серия");
		тзЭтапаВыходныеИзделия.Колонки.Добавить("ДатаПроизводства");
		тзЭтапаВыходныеИзделия.Колонки.Добавить("Произведено");
		// заполним переменные
		СтатьяКалькуляции = Справочники.СтатьиКалькуляции.ПустаяСсылка();
		Получатель = Неопределено;
		Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
		Если ЭтапОбъект.ПобочныеИзделия.Количество() Тогда
			СтатьяКалькуляции = ЭтапОбъект.ПобочныеИзделия[0].СтатьяКалькуляции;
			Получатель = ЭтапОбъект.ПобочныеИзделия[0].Получатель;
			Подразделение = ЭтапОбъект.ПобочныеИзделия[0].Подразделение;
			
			тзПобочные = ЭтапОбъект.ПобочныеИзделия.Выгрузить();
			ЭтапОбъект.ПобочныеИзделия.Очистить();
			// вернем отмененные
			СтрокиПоКлючу = тзПобочные.НайтиСтроки(Новый Структура("Отменено", Истина));
			Для каждого СтрОтмены Из СтрокиПоКлючу Цикл
				нов = ЭтапОбъект.ПобочныеИзделия.Добавить();
				ЗаполнитьЗначенияСвойств(нов, СтрОтмены);
			КонецЦикла;
		КонецЕсли;
		
		// с побочными все просто: 
		// 1. закидываем все что есть в операциях  
		КодСтроки = 1;
		Для каждого стр из СтрокиПобочкаБазаРаспределения Цикл
			нов = ЭтапОбъект.ПобочныеИзделия.Добавить();
			нов.Номенклатура = стр.Номенклатура;
			нов.КоличествоУпаковок = стр.Количество;
			нов.Количество = стр.Количество;
			нов.Получатель = Получатель;
			нов.Серия = стр.Серия;
			нов.ДатаПроизводства = стр.ДатаПроизводства;  
			нов.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			нов.СтатьяКалькуляции = СтатьяКалькуляции;
			
			нов.КодСтроки = КодСтроки;
			КодСтроки = КодСтроки + 1;
			
			нов.Период = КонецМесяца(стр.ДатаПроизводства);
			нов.Подразделение = Подразделение;
			
			нов.Произведено = Истина;
			
			нов.КлючНоменклатура = Новый УникальныйИдентификатор;
		КонецЦикла;
		// 2. Добиваем тем что есть в спецификации
		Для каждого стрСпецификации из Спецификация.ВозвратныеОтходы Цикл
				СтрокиПоКлючу = ЭтапОбъект.ПобочныеИзделия.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", стрСпецификации.Номенклатура, стрСпецификации.Характеристика));
				КоличествоВЭтапе = 0;
				Для каждого стрПобочки из СтрокиПоКлючу Цикл
					КоличествоВЭтапе = КоличествоВЭтапе + стрПобочки.Количество;
				КонецЦикла;
				Если КоличествоВЭтапе < стрСпецификации.КоличествоУпаковок * КоэффициентПересчета Тогда
					нов = ЭтапОбъект.ПобочныеИзделия.Добавить();
					нов.Номенклатура = стрСпецификации.Номенклатура;
					нов.КоличествоУпаковок = (стрСпецификации.КоличествоУпаковок * КоэффициентПересчета) - КоличествоВЭтапе;
					нов.Количество = нов.КоличествоУпаковок;
					нов.Получатель = Получатель;
					нов.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
					нов.СтатьяКалькуляции = СтатьяКалькуляции;
			        нов.КодСтроки = КодСтроки;
					КодСтроки = КодСтроки + 1;
			
					нов.Подразделение = Подразделение;
			
					нов.КлючНоменклатура = Новый УникальныйИдентификатор;
				КонецЕсли;
		КонецЦикла;                                                                             
		
		// -------------------------------------------------------------------------------------
		// для выходных изделий в таблице к распределению есть колонки 
		// Номенклатура, Серия, ДатаПроизводства, Количество. добавляем строки. откусываем количество от 
		// тзЭтапаВыходныеИзделия: Номенклатура, Получатель, Упаковка, Назначение, Подразделение", "Количество
		// то есть ищем по номенклатуре
		// все что останется - пойдет к производству без серии. если не хватит - ставим флаг и потом пересчитаем обеспечение
    	// Флаг превышения количества хоть в одной строке
		ФлагПревышения = Ложь;
		Если тзЭтапаВыходныеИзделия.Количество() Тогда
        	СтрокаЭталон = тзЭтапаВыходныеИзделия[0];
		Иначе              
			СтрокаЭталон = Неопределено;
		КонецЕсли;
		СтрДок = Неопределено;             
		
		// СтрокиВыходныеИзделияБазаРаспределения - это список номенклатур которые прилетели из операции. 
    	Для Каждого ОпорнаяСтрока Из СтрокиВыходныеИзделияБазаРаспределения Цикл
        	// Ищем строки документа с той же номенклатурой и пустой серией
			// отмененные не трогаем
        	МассивСтрок = тзЭтапаВыходныеИзделия.НайтиСтроки(Новый Структура("Номенклатура, Серия, Отменено", ОпорнаяСтрока.Номенклатура, Неопределено, Ложь));
			Для Каждого СтрДок Из МассивСтрок Цикл              
				СтрокаЭталон = СтрДок;
                // ----------------------------
				Если ОпорнаяСтрока.Количество = 0 Тогда
					Продолжить;
				КонецЕсли;   
				// ----------------------------
				Если СтрДок.Количество > ОпорнаяСтрока.Количество Тогда
                	// Создаем новую строку и копируем все свойства из исходной строки документа
                	НовСтр = тзЭтапаВыходныеИзделия.Добавить();
                	ЗаполнитьЗначенияСвойств(НовСтр, СтрДок);
                	// Заполняем уникальные поля
                	НовСтр.Серия             = ОпорнаяСтрока.Серия;
                	НовСтр.ДатаПроизводства  = ОпорнаяСтрока.ДатаПроизводства;
                	НовСтр.Количество        = ОпорнаяСтрока.Количество;
					НовСтр.КоличествоУпаковок = ОпорнаяСтрока.Количество;
					НовСтр.Произведено       = Истина;
                	// Уменьшаем количество в исходной строке
                	СтрДок.Количество = СтрДок.Количество - ОпорнаяСтрока.Количество;
					СтрДок.КоличествоУпаковок = СтрДок.Количество;
					
					ОпорнаяСтрока.Количество = 0;
            	Иначе
                	// Если количество строки документа меньше или равно распределению 
					ФлагПревышения = ФлагПревышения Или (СтрДок.Количество < ОпорнаяСтрока.Количество);
					
                	СтрДок.Серия             = ОпорнаяСтрока.Серия;
                	СтрДок.ДатаПроизводства  = ОпорнаяСтрока.ДатаПроизводства;
					СтрДок.Количество		 = ОпорнаяСтрока.Количество;
					СтрДок.КоличествоУпаковок = ОпорнаяСтрока.Количество;
               		СтрДок.Произведено       = Истина;
					
					ОпорнаяСтрока.Количество = 0;
				КонецЕсли;
        	КонецЦикла;
        	// Если после распределения остался остаток → создаем новую строку
        	Если ОпорнаяСтрока.Количество > 0 Тогда
            	НовСтр = тзЭтапаВыходныеИзделия.Добавить();
				Если ЗначениеЗаполнено(СтрокаЭталон) Тогда
            		ЗаполнитьЗначенияСвойств(НовСтр, СтрокаЭталон);
				КонецЕсли;
	            НовСтр.Серия             = ОпорнаяСтрока.Серия;
	            НовСтр.ДатаПроизводства  = ОпорнаяСтрока.ДатаПроизводства;
	            НовСтр.Количество		 = ОпорнаяСтрока.Количество;
				НовСтр.КоличествоУпаковок = ОпорнаяСтрока.Количество;
	            НовСтр.Произведено       = Истина;
	            ФлагПревышения = Истина;
        	КонецЕсли;
    	КонецЦикла;
        // Загружаем обратно в документ
    	ЭтапОбъект.ВыходныеИзделия.Загрузить(тзЭтапаВыходныеИзделия);
		
		// посчитаем итог по этапу
		Всего = 0;
		Для каждого стрПроизведено из ЭтапОбъект.ВыходныеИзделия Цикл
			Если стрПроизведено.Произведено Тогда
				Всего = Всего + стрПроизведено.Количество;
			КонецЕсли;
		КонецЦикла;
		ЭтапОбъект.КоличествоУпаковокФакт = Всего;                   
		
		// обеспечение и далее
		// посчитаем количество произведенной ГП
		ВсегоПоФакту = 0;
		Для Каждого стр из ЭтапОбъект.ВыходныеИзделия Цикл
			Если стр.Отменено Тогда
				Продолжить;
			КонецЕсли;
			ВсегоПоФакту = ВсегоПоФакту + стр.Количество; 
		КонецЦикла;
		
		тзОбеспечениеИзСпецификации = ЭтапОбъект.Спецификация.МатериалыИУслуги.Выгрузить();
		Для каждого стрОбеспечениеЭтапа из ЭтапОбъект.ОбеспечениеМатериаламиИРаботами Цикл
			Если стрОбеспечениеЭтапа.Отменено Тогда
				Продолжить;
			КонецЕсли;
			
			мСтрокСпецификации = тзОбеспечениеИзСпецификации.НайтиСтроки(Новый Структура("Номенклатура, КлючСвязи", стрОбеспечениеЭтапа.Номенклатура, стрОбеспечениеЭтапа.КлючСвязиСпецификация));
			Если мСтрокСпецификации.Количество() Тогда
				новКоличество = ВсегоПоФакту * мСтрокСпецификации[0].КоличествоУпаковок / КоэфРС;
				
				Если новКоличество > стрОбеспечениеЭтапа.Количество Тогда
					стрОбеспечениеЭтапа.Количество = новКоличество;
					стрОбеспечениеЭтапа.КоличествоУпаковок = новКоличество;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
			
		Если не ЗначениеЗаполнено(ЭтапОбъект.ДатаПроизводства) Тогда
			ЭтапОбъект.ДатаПроизводства = КонецДня(ТекущаяДатаСеанса());
		КонецЕсли;
		
		ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ЭтапОбъект, Документы.ЭтапПроизводства2_2));
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтапОбъект, ПараметрыУказанияСерий.ВыходныеИзделия);
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтапОбъект, ПараметрыУказанияСерий.ПобочныеИзделия);
		//Для каждого стр Из ЭтапОбъект.ВыходныеИзделия Цикл  
		//	Если ЗначениеЗаполнено(стр.Серия) Тогда
		//		стр.СтатусУказанияСерий = 14;
		//		стр.СтатусУказанияСерийОтправитель = 14;   
		//		
		//	КонецЕсли;
		//КонецЦикла;
		//Для каждого стр Из ЭтапОбъект.ПобочныеИзделия Цикл 
		//	Если ЗначениеЗаполнено(стр.Серия) Тогда
		//		стр.СтатусУказанияСерий = 14;
		//		стр.СтатусУказанияСерийОтправитель = 14;
		//	КонецЕсли;
		//КонецЦикла;
			
		Попытка
			ЭтапОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение                                               
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось транслировать данные в " + ТекЭтап + ":" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;	
		КонецПопытки;
	КонецЦикла;
	
		
	// Для номенклатуры готовой продукции, имеющей серийный учет: необходимо перенести данные из операций после завешивания 
	// в "Этап производства" – произвести перезаполнение данных по сериям внутри этапа из операции 
	// и произвести перерасчет израсходованных материалов в этапе в случае изменения общего количества номенклатуры готовой продукции 
	// по операциям из текущего сменного задания. 
	
	// Серии, которые были указаны в корректируемой операции ранее, но значение реквизита серии «Завешено» = Ложь 
	// удаляются из табличной части этапа, вместо них вставляется строка без признака «Произведено» 
	// по аналогии как происходит при создании этапа производства - это касается только серий из текущего сменного задания. 
	
	// Если в этапе присуствуют серии из другого сменного задания, то они будут корректироваться из другого сменного задания 
	// при нажатии кнопки «Транслировать данные завесов в операцию». 
	// При любых корректировках этапа должно сохраняться итоговое изначально запланированное к производству количество продукции.
	
	//Например, было запланировано 1000кг. Завешенные и скорректированные серии этапа - 500кг. 
	// Незавешенные и некорректированные серии этапа - 400 кг. Остаток для распределения операций без признака "Произведено" - 100кг. 
	// Если скорректировать 400кг серий на 410кг, то остаток для распределения операций без признака "Произведено" - 
	// должен измениться со 100 на 90кг.

	// Для выходной продукции, не имеющей серийного учета: происходит трансляция данных из операции в этапы производства 
	// для моментального отражения поступления полуфабрикатов на производственную кладовую.

    // 4. При реализации пункта 3 задачи 5 учесть, что вся произведенная продукция должна быть указана в табличной части «Выпуск» 
	// по первоначальному назначению и сохранить первоначальное значение поля «Получатель», 
	// которое было указано при создании документа "Этап производства".
	
	//Например если в этапе первоначально было указано произвести 100 кг «Провод» по назначению «Заказ клиента 001» 
	// получатель «Склад готовой продукции», а произвели 110 кг двумя сериями, транслируется следующим образом:
    // 1: «Провод» «55 кг» «Заказ клиента 001» «серия 1» «Склад годовой продукции»
    // 2: «Провод» «55 кг» «Заказ клиента 001» «серия 2» «Склад годовой продукции»

    //При трансляции учесть, что один "Этап производства" может выполняться несколькими документами "Производственная операция". 
	// Перезаполнение строк этапа по одной операции не должно затрагивать строк других операций.
		
	// }}ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [02.12.2025 0:35:51] -	
КонецПроцедуры

Процедура СкорректироватьКоличествоПобочногоВыходаВОперациях(Запрос)
	// Получаем:
	// 1. документы операций;
	// 2. фактический выпуск ГП по операции без учета серий;
	// 3. нормы возвратных отходов из ресурсной спецификации;
	// 4. расчетное количество возвратного отхода по факту выпуска.

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПроизводственнаяОперация2_2.Ссылка КАК ПроизводственнаяОперация,
	|	ПроизводственнаяОперация2_2.Этап КАК Этап,
	|	ПроизводственнаяОперация2_2.Этап.Спецификация КАК Спецификация,
	|	ПроизводственнаяОперация2_2.Этап.Спецификация.ОсновноеИзделиеКоличествоУпаковок КАК КоличествоГППоСпецификации,
	|	ПроизводственнаяОперация2_2.Этап.Спецификация.ОсновноеИзделиеУпаковка КАК УпаковкаГППоСпецификации
	|ПОМЕСТИТЬ втОперации
	|ИЗ
	|	Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
	|ГДЕ
	|	ПроизводственнаяОперация2_2.Этап В(&мЭтапов)
	|	И ПроизводственнаяОперация2_2.Проведен
	|	И ПроизводственнаяОперация2_2.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроизводственныхОпераций.Выполнена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка КАК ПроизводственнаяОперация,
	|	СУММА(ПроизводственнаяОперация2_2ВыходныеИзделия.Количество) КАК КоличествоГПФакт
	|ПОМЕСТИТЬ втГППоОперациям
	|ИЗ
	|	Документ.ПроизводственнаяОперация2_2.ВыходныеИзделия КАК ПроизводственнаяОперация2_2ВыходныеИзделия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВидыГП КАК ВидыГП
	|		ПО ПроизводственнаяОперация2_2ВыходныеИзделия.Номенклатура.ВидНоменклатуры = ВидыГП.Значение
	|ГДЕ
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка В
	|			(ВЫБРАТЬ
	|				втОперации.ПроизводственнаяОперация
	|			ИЗ
	|				втОперации КАК втОперации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОперации.ПроизводственнаяОперация КАК ПроизводственнаяОперация,
	|	втОперации.Спецификация КАК Спецификация,
	|	втГППоОперациям.КоличествоГПФакт КАК КоличествоГПФакт,
	|	втОперации.КоличествоГППоСпецификации КАК КоличествоГППоСпецификации,
	|	втОперации.УпаковкаГППоСпецификации КАК УпаковкаГППоСпецификации,
	|	ВЫБОР    
	|		КОГДА втОперации.УпаковкаГППоСпецификации.Знаменатель есть null
	|			ТОГДА 1
	|		КОГДА втОперации.УпаковкаГППоСпецификации.Знаменатель = 0
	|			ТОГДА 1
	|		КОГДА втОперации.УпаковкаГППоСпецификации.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ втОперации.УпаковкаГППоСпецификации.Числитель / втОперации.УпаковкаГППоСпецификации.Знаменатель
	|	КОНЕЦ КАК КоэфУпаковкиГП,
	|	ВЫБОР     
	|		КОГДА РесурсныеСпецификацииВозвратныеОтходы.Упаковка.Знаменатель есть null
	|			ТОГДА 1
	|		КОГДА РесурсныеСпецификацииВозвратныеОтходы.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		КОГДА РесурсныеСпецификацииВозвратныеОтходы.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ РесурсныеСпецификацииВозвратныеОтходы.Упаковка.Числитель / РесурсныеСпецификацииВозвратныеОтходы.Упаковка.Знаменатель
	|	КОНЕЦ КАК КоэфУпаковкиОтхода,
	|	РесурсныеСпецификацииВозвратныеОтходы.Номенклатура КАК Номенклатура,
	|	РесурсныеСпецификацииВозвратныеОтходы.Характеристика КАК Характеристика,
	|	РесурсныеСпецификацииВозвратныеОтходы.Упаковка КАК Упаковка,
	|	РесурсныеСпецификацииВозвратныеОтходы.КоличествоУпаковок КАК КоличествоОтходаПоСпецификации
	|ИЗ
	|	втОперации КАК втОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГППоОперациям КАК втГППоОперациям
	|		ПО втОперации.ПроизводственнаяОперация = втГППоОперациям.ПроизводственнаяОперация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВозвратныеОтходы КАК РесурсныеСпецификацииВозвратныеОтходы
	|		ПО втОперации.Спецификация = РесурсныеСпецификацииВозвратныеОтходы.Ссылка
	|ГДЕ
	|	втГППоОперациям.КоличествоГПФакт > 0
	|	И втОперации.КоличествоГППоСпецификации > 0";

	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВидовГП = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ВидыНоменклатурыГотовойПродукцииВПроизводственнойОперации);
	СоответствиеОпераций = Новый Соответствие;

	Пока Выборка.Следующий() Цикл

		КоэфУпаковкиГП = Выборка.КоэфУпаковкиГП; 
		КоэфУпаковкиОтхода = Выборка.КоэфУпаковкиОтхода;

		// Норма отхода на единицу ГП.
		// Сначала приводим норму отхода и количество ГП спецификации к базовым единицам.
		КоличествоГПСпецификацииВБазовойЕдинице = Выборка.КоличествоГППоСпецификации * КоэфУпаковкиГП;
		КоличествоОтходаСпецификацииВБазовойЕдинице = Выборка.КоличествоОтходаПоСпецификации * КоэфУпаковкиОтхода;

		НормаОтходаНаЕдиницуГП = КоличествоОтходаСпецификацииВБазовойЕдинице / КоличествоГПСпецификацииВБазовойЕдинице;
		// Фактическое количество отхода в базовой единице.
		КоличествоОтходаФактВБазовойЕдинице = Выборка.КоличествоГПФакт * КоэфУпаковкиГП * НормаОтходаНаЕдиницуГП;
		// Возвращаем в единицу / упаковку строки возвратного отхода.
		КоличествоОтходаФакт = КоличествоОтходаФактВБазовойЕдинице / КоэфУпаковкиОтхода;

		СтрокиОперации = СоответствиеОпераций.Получить(Выборка.ПроизводственнаяОперация);
		Если СтрокиОперации = Неопределено Тогда
			СтрокиОперации = Новый ТаблицаЗначений;
			СтрокиОперации.Колонки.Добавить("Номенклатура");
			СтрокиОперации.Колонки.Добавить("Характеристика");
			СтрокиОперации.Колонки.Добавить("Упаковка");
			СтрокиОперации.Колонки.Добавить("Количество");
			СоответствиеОпераций.Вставить(Выборка.ПроизводственнаяОперация, СтрокиОперации);
		КонецЕсли;

		НоваяСтрока = СтрокиОперации.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Характеристика = Выборка.Характеристика;
		НоваяСтрока.Упаковка = Выборка.Упаковка;
		НоваяСтрока.Количество = КоличествоОтходаФакт;

	КонецЦикла;
	
	// обработаем то что нашли по итогу
	Для Каждого ЭлементОперации Из СоответствиеОпераций Цикл
		
		ОперацияОбъект = ЭлементОперации.Ключ.ПолучитьОбъект();
		ТаблицаОтходов = ЭлементОперации.Значение;

		Для Каждого СтрокаРасчета Из ТаблицаОтходов Цикл
			
			стрОтбора = Новый Структура("Номенклатура, Характеристика", СтрокаРасчета.Номенклатура, СтрокаРасчета.Характеристика);
			СтрокиОперации = ОперацияОбъект.ВыходныеИзделия.НайтиСтроки(стрОтбора);
			Для Каждого СтрокаОперации Из СтрокиОперации Цикл
				
				// на всякий случай проверим тут
				Если МассивВидовГП.Найти(СтрокаОперации.Номенклатура.ВидНоменклатуры) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;

				СтрокаОперации.Количество = СтрокаРасчета.Количество;
				СтрокаОперации.КоличествоУпаковок = СтрокаРасчета.Количество;

				Если ЗначениеЗаполнено(СтрокаРасчета.Упаковка) Тогда
					СтрокаОперации.Упаковка = СтрокаРасчета.Упаковка;
				КонецЕсли;

			КонецЦикла;

		КонецЦикла;
        Попытка
			ОперацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось скорректировать количество возвратных отходов для " 
																+ ОперацияОбъект.Ссылка 
																+ " по причине " 
																+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ОперацияОбъект.Ссылка); 
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры
 
#КонецЕсли

&ИзменениеИКонтроль("ТекстЗапросаЗаполненияСтатусовУказанияСерийОбеспечениеМатериаламиИРаботами")
Функция бит_ТекстЗапросаЗаполненияСтатусовУказанияСерийОбеспечениеМатериаламиИРаботами()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Товары.Склад КАК Склад,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Серия КАК Серия,
	|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	Товары.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	|	Товары.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.ВариантОбеспечения КАК ВариантОбеспечения,
	|	Товары.Отменено КАК Отменено,
	|	Товары.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Товары.Отменено
	|				ИЛИ ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL
	|				ИЛИ НЕ Товары.ВариантОбеспечения В (
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))
	|			ТОГДА 0
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|			ТОГДА ВЫБОР
	|					КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|						ТОГДА 14
	|					КОГДА Товары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	|						ТОГДА 15
	|					ИНАЧЕ 13
	|				КОНЕЦ
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки
	|			ТОГДА ВЫБОР
	|					КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|						ТОГДА 10
	|					КОГДА Товары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	|						ТОГДА 11
	|					ИНАЧЕ 9
	|				КОНЕЦ
	// При отгрузке из нашей кладовой
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтбора
	|				И Товары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|				И ВЫРАЗИТЬ(Товары.Склад КАК Справочник.Склады).ЦеховаяКладовая
	|				И ВЫРАЗИТЬ(Товары.Склад КАК Справочник.Склады).Подразделение = Товары.Подразделение
	|				И НЕ &ПроизводствоНаСтороне
	|			ТОГДА ВЫБОР
	|					КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчетСерийПоFEFO
	|						ТОГДА ВЫБОР
	|								КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|									ТОГДА 6
	|								ИНАЧЕ 5
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|								ТОГДА 8
	|							ИНАЧЕ 7
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПоФактуОтбора
	|				И ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриОтгрузкеНаВнутренниеНужды
	|				И Товары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|				И ВЫРАЗИТЬ(Товары.Склад КАК Справочник.Склады).ЦеховаяКладовая
	|				И ВЫРАЗИТЬ(Товары.Склад КАК Справочник.Склады).Подразделение = Товары.Подразделение
	|				И НЕ &ПроизводствоНаСтороне
	|			ТОГДА ВЫБОР
	|					КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|						ТОГДА ВЫБОР
	|								КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|									ТОГДА 4
	|								ИНАЧЕ 3
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|								ТОГДА 2
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусУказанияСерий
	|ПОМЕСТИТЬ СтатусыОтправитель
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|		ПО Товары.Склад = ПолитикиУчетаСерий.Склад
	|			И (СпрНоменклатура.ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Товары.Отменено 
	|				ИЛИ ВидыНоменклатуры.ПолитикаУчетаСерий ЕСТЬ NULL
	|			ТОГДА 0  
	#Вставка 
	// внедрение +
	|		КОГДА ПолитикиУчетаСерийСклад.Склад ЕСТЬ НЕ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ПолитикиУчетаСерийСклад.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикиУчетаСерий.СерииНеИспользуются)
	|							ИЛИ ПолитикиУчетаСерийСклад.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикиУчетаСерий.ПустаяСсылка)
	|						ТОГДА 0
	|					КОГДА ПолитикиУчетаСерийСклад.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|							И Товары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|							И ВЫРАЗИТЬ(Товары.Склад КАК Справочник.Склады).ЦеховаяКладовая
	|							И ВЫРАЗИТЬ(Товары.Склад КАК Справочник.Склады).Подразделение = Товары.Подразделение
	|							И НЕ &ПроизводствоНаСтороне
	|						ТОГДА ВЫБОР
	|								КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|									ТОГДА 14
	|								ИНАЧЕ 13
	|							КОНЕЦ
	|					КОГДА ПолитикиУчетаСерийСклад.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|							И ПолитикиУчетаСерийСклад.ПолитикаУчетаСерий.УчетСерийПереданныхПереработчикуТоваров
	|							И Товары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|							И &ПроизводствоНаСтороне
	|						ТОГДА ВЫБОР
	|								КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|									ТОГДА 18
	|								ИНАЧЕ 17
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	// внедрение -
	#КонецВставки
	|		КОГДА ВидыНоменклатуры.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|				И Товары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|				И ВЫРАЗИТЬ(Товары.Склад КАК Справочник.Склады).ЦеховаяКладовая
	|				И ВЫРАЗИТЬ(Товары.Склад КАК Справочник.Склады).Подразделение = Товары.Подразделение
	|				И НЕ &ПроизводствоНаСтороне
	|			ТОГДА ВЫБОР
	|					КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|						ТОГДА 14
	|					ИНАЧЕ 13
	|				КОНЕЦ
	|		КОГДА ВидыНоменклатуры.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|				И ВидыНоменклатуры.ПолитикаУчетаСерий.УчетСерийПереданныхПереработчикуТоваров
	|				И Товары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|				И &ПроизводствоНаСтороне  
	#Удаление
	|				ТОГДА
	|					ВЫБОР
	|						КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|							ТОГДА 18
	|						ИНАЧЕ 17
	|					КОНЕЦ
	#КонецУдаления
	#Вставка
	// внедрение +
	|			ТОГДА ВЫБОР
	|					КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|						ТОГДА 18
	|					ИНАЧЕ 17
	|				КОНЕЦ
	// внедрение -
	#КонецВставки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусУказанияСерий
	|ПОМЕСТИТЬ СтатусыПолучатель
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО Товары.Номенклатура = СпрНоменклатура.Ссылка   
	#Вставка 
	// внедрение +
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерийСклад
	|		ПО Товары.Склад = ПолитикиУчетаСерийСклад.Склад
	|			И (СпрНоменклатура.ВидНоменклатуры = ПолитикиУчетаСерийСклад.Ссылка) 
	// внедрение -
	#КонецВставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО (СпрНоменклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	СтатусыОтправитель.СтатусУказанияСерий КАК СтатусУказанияСерийОтправитель,
	|	СтатусыПолучатель.СтатусУказанияСерий КАК СтатусУказанияСерийПолучатель,
	|	ВЫБОР
	|		КОГДА СтатусыПолучатель.СтатусУказанияСерий <> 0
	|			ТОГДА СтатусыПолучатель.СтатусУказанияСерий
	|		ИНАЧЕ СтатусыОтправитель.СтатусУказанияСерий
	|	КОНЕЦ КАК СтатусУказанияСерий
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыОтправитель КАК СтатусыОтправитель
	|		ПО Товары.НомерСтроки = СтатусыОтправитель.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыПолучатель КАК СтатусыПолучатель
	|		ПО Товары.НомерСтроки = СтатусыПолучатель.НомерСтроки
	|ГДЕ
	|	(СтатусыОтправитель.СтатусУказанияСерий <> Товары.СтатусУказанияСерийОтправитель
	|			ИЛИ СтатусыПолучатель.СтатусУказанияСерий <> Товары.СтатусУказанияСерийПолучатель
	|			ИЛИ ВЫБОР
	|				КОГДА СтатусыПолучатель.СтатусУказанияСерий <> 0
	|					ТОГДА СтатусыПолучатель.СтатусУказанияСерий
	|				ИНАЧЕ СтатусыОтправитель.СтатусУказанияСерий
	|			КОНЕЦ <> Товары.СтатусУказанияСерий)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки";

	Возврат ТекстЗапроса;

КонецФункции
