
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	КартаМаршрута = ТекущийОбъект.КартаМаршрута.Получить();
	ПодготовитьФормуНаСервере(КартаМаршрута, ТекущийОбъект.Ссылка, Ложь);
	УправлениеДопИнформацией();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов.
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов.
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	#Если ВебКлиент Тогда
	 	ЭтоВебКлиент = Истина;	
	#КонецЕсли 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Параметры.Ключ.Пустая() Тогда
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ЗначениеКопирования, 
									"КартаМаршрута, ВидАлгоритма");
			КартаМаршрута	 = Параметры.ЗначениеКопирования.КартаМаршрута.Получить();
			Если РеквизитыИсточника.ВидАлгоритма = Перечисления.бит_ВидыАлгоритмов.Прочее Тогда
				ЗначениеКопирования = Параметры.ЗначениеКопирования;
			КонецЕсли;
		Иначе 
			КартаМаршрута = Справочники.бит_АлгоритмыПроцессов.ПолучитьМакет("СхемаНовогоАлгоритма");
		КонецЕсли; 		
		
		ПодготовитьФормуНаСервере(КартаМаршрута, Параметры.ЗначениеКопирования, Истина);
		УправлениеДопИнформацией();
	КонецЕсли; 
	
	// Восстановление типов параметров в таб. поле ПараметрыАлгоритма.
	ВосстановитьТипыПараметров();
	
	ТекущийВидАлгоритма = Объект.ВидАлгоритма;
	
	УстановитьПараметрыВыбораТекущаяТочкаДействие(ЭтотОбъект);
	УправлениеПанельюТекущаяТочка(ЭтотОбъект, Ложь);
	
	Если ТочкиМаршрута.Количество() <> 0 Тогда
	    Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМаршрут;
	КонецЕсли; 
	
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		КартинкаДлительнойОперации = "ДлительнаяОперация200";
	Иначе
		КартинкаДлительнойОперации = "ДлительнаяОперация48";
	КонецЕсли;
	Элементы.ДекорацияКот.Картинка = БиблиотекаКартинок[КартинкаДлительнойОперации];
	
	УправлениеФормой(ЭтотОбъект);
	ПрочитатьДанныеРегламентногоЗадания();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
	 	ЭтоВебКлиент = Истина;
		УправлениеПанельюТекущаяТочка(ЭтотОбъект, Ложь);
		УправлениеФормой(ЭтотОбъект);
	#КонецЕсли 
	
	Если ЭтоВебКлиент Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ПодключитьОбработчикОжидания("ПриОткрытииПродолжение", 1, Истина);
	ИначеЕсли Объект.Ссылка.Пустая() Тогда 	
		// Выделить точку действия "новой" схемы.
		ВыделитьЭлементыСхемы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ТочкиМаршрута.Количество() <> 0 Тогда
		ТочкаСтарта = ТочкиМаршрута.НайтиСтроки(Новый Структура("ВидТочки", Перечисления.бит_ВидыТочекАлгоритмов.Старт));
		Если ТочкаСтарта.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет точки старта.'; en = 'There is no starting point.'"),,, "Объект", Отказ); 
		ИначеЕсли ТочкаСтарта.Количество() > 1 Тогда 	
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Несколько точек старта не поддерживатся.';
													   |en = 'Multiple start points are not supported.'"),,, "Объект", Отказ);
		КонецЕсли; 
	КонецЕсли; 
	
	Если Объект.ВидАлгоритма = Перечисления.бит_ВидыАлгоритмов.Визирование Тогда
		// Визирование не поддерживает вложенные процессы.
		Для каждого СтрокаТаблицы Из ТочкиМаршрута Цикл
			Если Объект.ВидАлгоритма = Перечисления.бит_ВидыАлгоритмов.Визирование
			   И СтрокаТаблицы.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.ПодчиненныйПроцесс Тогда
				ТекстСообщения = НСтр("ru = 'Вложенные процессы в алгоритме визирования не поддерживаются.';
									  |en = 'Nested processes are not supported in the sighting algorithm.'"); 
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,"Объект",Отказ);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если СтартоватьПоРасписанию
		И Объект.ВидАлгоритма <> ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Прочее") Тогда
		
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ПередЗаписьюОтключениеРегЗаданияЗавершение", ЭтотОбъект);
		Вопрос = РежимДиалогаВопрос.ДаНет;
		Текст = Нстр("ru = 'Для выбранного вида алгоритма будет отключено регламентное задание. Продолжить?'");
		ПоказатьВопрос(Оповещение, Текст, Вопрос, 0);
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоВебКлиент Тогда
		Возврат;
	КонецЕсли;
	
	// Операции без активизации графической схемы.
	УстановитьСвойстваТекущейСтрокиТочекМаршрута(ЭтотОбъект);

	ВыделитьЭлементыСхемы();
	
	ПроверитьИспользованиеАлгоритма(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоВебКлиент Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущийОбъект.КартаМаршрута = Новый ХранилищеЗначения(ГрафическаяСхема, 
										Новый СжатиеДанных(9));

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоВебКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийОбъект.ПометкаУдаления Тогда
		ТекстСообщения = НСтр("ru = 'Алгоритм помечен на удаление. Графическая схема сохранена, но изменения точек схемы игнорируются.'; 
							  |en = 'The algorithm is marked for deletion. The graphic diagram is saved, but changes to the diagram points are ignored.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СхемаXDTO         = СериализаторXDTO.ЗаписатьXDTO(ГрафическаяСхема);
	ЭлементыСхемы     = СхемаXDTO.item;
	СвойстваЭлементов = бит_ГрафическиеСхемы.ОписаниеСвойствЭлементовСхемы(ЭлементыСхемы);
	ТаблицаСвязей     = СвойстваЭлементов.ТаблицаСвязей;
	ТаблицаСвязей.Индексы.Добавить("ЭлементИсточник");
	ТаблицаСвязей.Индексы.Добавить("ЭлементПриемник");
	
	ИдентификаторыТочек = Новый Соответствие(); // Для ускорения многократного поиска.
	КопияТочкиМаршрута  = РеквизитФормыВЗначение("ТочкиМаршрута"); // Резервная копия для восстановления при ошибках записи.
	
	Для каждого СтрокаТаблицы Из ТочкиМаршрута Цикл
		Если СтрокаТаблицы.НоваяТочка Тогда
			СтрокаТаблицы.ТочкаМаршрута = Справочники.бит_ТочкиАлгоритмов.ПолучитьСсылку();
		КонецЕсли; 
		ИдентификаторыТочек.Вставить(СтрокаТаблицы.ИдентификаторТочки, СтрокаТаблицы);
	КонецЦикла;
	
	КэшПройденныхТочек  = Новый Соответствие;
	ДобавленыНовыеТочки = Ложь;
	
	ИсходящиеТочкиДляПроверкиЗацикливания = ИсходящиеТочкиДляПроверкиЗацикливания(ТочкиМаршрута, ТаблицаСвязей, ИдентификаторыТочек);
	
	Для каждого СтрокаТаблицы Из ТочкиМаршрута Цикл
		
		Если Отказ Тогда
			Прервать;		
		КонецЕсли; 
		
		ДанныеЗаполнения = Новый Структура("Наименование, КодТочки, ИдентификаторТочки, ВидТочки, Владелец"); 
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, СтрокаТаблицы);
		ДанныеЗаполнения.Вставить("ПользовательскоеУсловие",       СтрокаТаблицы.Условие);
		ДанныеЗаполнения.Вставить("ПользовательскоеДействие",      СтрокаТаблицы.Действие);
		ДанныеЗаполнения.Вставить("ПользовательскийВыборВарианта", СтрокаТаблицы.ВыборВарианта);
		ДанныеЗаполнения.Вставить("Владелец", 				       ТекущийОбъект.Ссылка);
		
		Если СтрокаТаблицы.НоваяТочка Тогда
			ТочкаМаршрута = Справочники.бит_ТочкиАлгоритмов.СоздатьЭлемент();
			ТочкаМаршрута.Заполнить(ДанныеЗаполнения);
			ТочкаМаршрута.УстановитьСсылкуНового(СтрокаТаблицы.ТочкаМаршрута);
		Иначе
			ТочкаМаршрута = СтрокаТаблицы.ТочкаМаршрута.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(ТочкаМаршрута, ДанныеЗаполнения);
		КонецЕсли; 
		
		ТочкаМаршрута.ВходящиеТочки.Очистить();
		ТочкаМаршрута.ИсходящиеТочки.Очистить();
		ТочкаМаршрута.ПараметрыПроцесса.Очистить();
		ТочкаМаршрута.ВариантыВыбора.Очистить();
		
		ОтборПоПриемнику = Новый Структура("ЭлементПриемник", СтрокаТаблицы.ИдентификаторТочки);
		НайденныеСвязи   = ТаблицаСвязей.НайтиСтроки(ОтборПоПриемнику);
		Для каждого ЭлементСвязи Из НайденныеСвязи Цикл
			СвойствоВходящейТочки  = ИдентификаторыТочек.Получить(ЭлементСвязи.ЭлементИсточник);
			Если СвойствоВходящейТочки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока             = ТочкаМаршрута.ВходящиеТочки.Добавить();
			НоваяСтрока.Точка       = СвойствоВходящейТочки.ТочкаМаршрута;
			НоваяСтрока.Направление = Перечисления.бит_Направление.Вертикаль;
			Если СвойствоВходящейТочки.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Условие Тогда
				Если ТекстСодержитОтрицание(ЭлементСвязи.Заголовок) Тогда
					НоваяСтрока.ЗначениеУсловия = Ложь;
					НоваяСтрока.Направление     = Перечисления.бит_Направление.Горизонталь;
				Иначе
					НоваяСтрока.ЗначениеУсловия = Истина;
				КонецЕсли;
			ИначеЕсли СвойствоВходящейТочки.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.ВыборВарианта Тогда
				НомерВарианта    = Окр((ЭлементСвязи.ГраньИсточника - 5) / 2);
				ЗначениеВарианта = СвойствоВходящейТочки.Варианты[НомерВарианта - 1].Значение;
				НоваяСтрока.ЗначениеУсловия = ЗначениеВарианта;
			КонецЕсли;
		КонецЦикла;
		
		ОтборПоИсточнику = Новый Структура("ЭлементИсточник", СтрокаТаблицы.ИдентификаторТочки);
		НайденныеСвязи   = ТаблицаСвязей.НайтиСтроки(ОтборПоИсточнику);
		Для каждого ЭлементСвязи Из НайденныеСвязи Цикл
			СвойствоИсходящейТочки  = ИдентификаторыТочек.Получить(ЭлементСвязи.ЭлементПриемник);
			Если СвойствоИсходящейТочки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока             = ТочкаМаршрута.ИсходящиеТочки.Добавить();
			НоваяСтрока.Точка       = СвойствоИсходящейТочки.ТочкаМаршрута;
			НоваяСтрока.Направление = Перечисления.бит_Направление.Вертикаль;
			Если СтрокаТаблицы.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Условие Тогда
				Если ТекстСодержитОтрицание(ЭлементСвязи.Заголовок) Тогда
					НоваяСтрока.ЗначениеУсловия = Ложь;
					НоваяСтрока.Направление     = Перечисления.бит_Направление.Горизонталь;
				Иначе
					НоваяСтрока.ЗначениеУсловия = Истина;
				КонецЕсли;
			ИначеЕсли СтрокаТаблицы.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.ВыборВарианта Тогда
				НомерВарианта    = Окр((ЭлементСвязи.ГраньИсточника - 5) / 2);
				ЗначениеВарианта = СтрокаТаблицы.Варианты[НомерВарианта - 1].Значение;
				НоваяСтрока.ЗначениеУсловия = ЗначениеВарианта;
			КонецЕсли;
		КонецЦикла;
		
		КопироватьЗначенияПараметров(Объект.ПараметрыАлгоритма, 
			СтрокаТаблицы.ПараметрыТочки, ТочкаМаршрута.ПараметрыПроцесса);
			
		Для каждого СтрокаВаринта Из СтрокаТаблицы.Варианты Цикл
			НовыйВариант = ТочкаМаршрута.ВариантыВыбора.Добавить();
			НовыйВариант.ИмяВарианта    = СтрокаВаринта.Имя;
			НовыйВариант.ЗначениеВыбора = СтрокаВаринта.Значение;
		КонецЦикла;

		ТочкаМаршрута.Владелец = ТекущийОбъект.Ссылка;
		
		ТочкаМаршрута.ДополнительныеСвойства.Вставить("КэшПройденныхТочек", КэшПройденныхТочек);
		ТочкаМаршрута.ДополнительныеСвойства.Вставить("ИсходящиеТочкиДляПроверкиЗацикливания",
														ИсходящиеТочкиДляПроверкиЗацикливания);
		Если ТочкаМаршрута.ПроверитьЗаполнение() Тогда
			Попытка
				ТочкаМаршрута.Заблокировать();
				ТочкаМаршрута.Записать();
				ДобавленыНовыеТочки              = Истина;
				СтрокаТаблицы.НоваяТочка 		 = Ложь;
				СтрокаТаблицы.Модифицированность = Ложь;
			Исключение
				ТекстСообщения = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецПопытки; 
		Иначе
			Отказ = Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Если НЕ Отказ И ДобавленыНовыеТочки Тогда
		// Зацикливание алгоритма можно проверить только после того как созданы все точки.
		Для каждого СтрокаТаблицы Из ТочкиМаршрута Цикл
			ТочкаМаршрута = СтрокаТаблицы.ТочкаМаршрута.ПолучитьОбъект();
			Если НЕ ТочкаМаршрута.ПроверитьЗаполнение() Тогда
				Отказ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		ЗначениеВРеквизитФормы(КопияТочкиМаршрута, "ТочкиМаршрута");
		Возврат;	
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из ТочкиМаршрутаКУдалению Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ТочкаМаршрута) Тогда
			ДанныеЗаполнения = Новый Структура("КодТочки, ИдентификаторТочки", "", 0);
			ТочкаМаршрута = СтрокаТаблицы.ТочкаМаршрута.ПолучитьОбъект();
			ТочкаМаршрута.ДополнительныеСвойства.Вставить("УдаленИзСхемы", Истина);
			ТочкаМаршрута.УстановитьПометкуУдаления(Истина);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоВебКлиент Тогда
		Возврат;
	КонецЕсли;
	
	// Восстановление типов параметров в таб. поле ПараметрыАлгоритма.
	ВосстановитьТипыПараметров();	
	УправлениеФормой(ЭтотОбъект);
	УстановитьПараметрыВыбораТекущаяТочкаДействие(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЭтоВебКлиент Тогда
		Возврат;	
	КонецЕсли; 
	
	Если НЕ ЗавершениеРаботы И НЕ ЗакрыватьФорму Тогда
		Если Модифицированность Тогда
			УстановитьСвойстваТекущейСтрокиТочекМаршрута(ЭтотОбъект);
			ВыделитьЭлементыСхемы();
		КонецЕсли; 
		Если НЕ Объект.ПометкаУдаления Тогда
			ПроверитьЗаполнениеТочекМаршрутаПередЗакрытием(Отказ);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЭтоАдресВременногоХранилища(ВыбранноеЗначение) Тогда
		СоздатьТочкиВыбранныеВПомощнике(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Шапка

&НаКлиенте
Процедура ВидПроцессаПриИзменении(Элемент)
	
	Если ТекущийВидАлгоритма <> Объект.ВидАлгоритма Тогда
		ТекущийВидАлгоритма = Объект.ВидАлгоритма;
		УстановитьПараметрыВыбораТекущаяТочкаДействие(ЭтотОбъект);
		ВидАлгоритмаИзменение();
		ПредложитьЗаписатьСправочник();
		ВыделитьЭлементыСхемы();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтартоватьПоРасписаниюПриИзменении(Элемент)
	
	Если Модифицированность И СтартоватьПоРасписанию Тогда
		Оповещение = Новый ОписаниеОповещения("СтартоватьПоРасписаниюПриИзмененииЗавершение", ЭтотОбъект);
		Вопрос = РежимДиалогаВопрос.ДаНет;
		Текст = Нстр("ru = 'Для включения регламентного задания необходимо записать алгоритм. Записать?'");
		ПоказатьВопрос(Оповещение, Текст, Вопрос, 0);
	Иначе
		УстановитьИспользованиеРегламентногоЗадания();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик оповещения "СтартоватьПоРасписаниюПриИзмененииЗавершение".
// 
&НаКлиенте
Процедура СтартоватьПоРасписаниюПриИзмененииЗавершение(Ответ, Параметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да
		И Записать() Тогда
		УстановитьИспользованиеРегламентногоЗадания();
	Иначе
		СтартоватьПоРасписанию = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРасписаниеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьРасписанияРегламентногоЗадания", ЭтотОбъект);
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ГрафическаяСхема

&НаСервере
Процедура ГрафическаяСхемаПриИзмененииНаСервере()
	
	УстановитьСвойстваТекущейСтрокиТочекМаршрута(ЭтотОбъект);
		
	ПриИзмененииГрафическойСхемы(ЭтотОбъект);
	ДобавитьНовуюСхемуВИсторию();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафическаяСхемаПриИзменении(Элемент)
	
	// Изменение схемы может быть связано с изменением свойств элементов схемы или состава элементов.
	// При этом изменение свойств текущей точки может быть не зафиксированно.
	// Считываем текущую точку.
	// Изменяем таблицу точек при изменении схемы.
	// Устанавливть новую текущую точку будем при активизации.
	
	ГрафическаяСхемаПриИзмененииНаСервере();
	ТекущаяТочкаИдентификатор = Неопределено;
	ПодключитьОбработчикОжидания("ПриАктивизацииГрафическойСхемы", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафическаяСхемаПриАктивизации(Элемент)
	
	ПодключитьОбработчикОжидания("ПриАктивизацииГрафическойСхемы", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафическаяСхемаВыбор(Элемент)
	
	// Выбор происходит раньше подключенного обработчика, поэтому вызываем.
	ПриАктивизацииГрафическойСхемы();
	
	Если ТекущаяТочкаИдентификатор <> 0 Тогда
		
		Если ТекущаяТочкаВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Действие") Тогда
			Если ЗначениеЗаполнено(ТекущаяТочкаДействие) Тогда
				ПараметрыПередачи = Новый Структура("Ключ", ТекущаяТочкаДействие);
				ПараметрыПередачи.Вставить("ЗначенияЗаполнения", ПараметрыВыбораТочкиДействия()); 
				
				ОткрытьФорму("Справочник.бит_ПользовательскиеДействия.ФормаОбъекта", ПараметрыПередачи, 
					ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе
				ПоказатьСписокВыбораДействия();	
			КонецЕсли;	
		КонецЕсли;
		
		Если ТекущаяТочкаВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.ПодчиненныйПроцесс") Тогда
			Если ЗначениеЗаполнено(ТекущаяТочкаДействие) Тогда
				ПодчиненныйАлгоритм = ПодчиненныйАлгоритм(ТекущаяТочкаДействие);
				ПараметрыПередачи = Новый Структура("Ключ", ПодчиненныйАлгоритм);
				ПараметрыПередачи.Вставить("ЗначенияЗаполнения", ПараметрыВыбораТочкиДействия());
				
				ОткрытьФорму("Справочник.бит_АлгоритмыПроцессов.ФормаОбъекта", ПараметрыПередачи, 
					ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе
				ПоказатьСписокВыбораДействия();	
			КонецЕсли;	
		КонецЕсли;
		
		Если ТекущаяТочкаВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Условие") Тогда
			Если ЗначениеЗаполнено(ТекущаяТочкаУсловие) Тогда
				ПараметрыПередачи = Новый Структура("Ключ", ТекущаяТочкаУсловие); 
				ОткрытьФорму("Справочник.бит_ПользовательскиеУсловия.ФормаОбъекта", ПараметрыПередачи, 
					ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			Иначе
				ПоказатьСписокВыбораУсловия();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ТекущаяТочка

&НаКлиенте
Процедура ТекущаяТочкаНаименованиеПриИзменении(Элемент)
	
	ПриИзмененииНаименованияТекущейТочки();
	ТекущаяТочкаМодифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТочкаДействиеПриИзменении(Элемент)
	
	ОбработатьИзменениеТекущейТочкиДействие();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТочкаДействиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Прочее")
		И Объект.Ссылка.Пустая() Тогда
		ПредложитьЗаписатьСправочник();
	Иначе
		ПоказатьСписокВыбораДействия();
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТочкаДействиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПередачи = Новый Структура("Ключ", ТекущаяТочкаДействие);
	ПараметрыПередачи.Вставить("ЗначенияЗаполнения", ПараметрыВыбораТочкиДействия()); 
	
	ОткрытьФорму("Справочник.бит_ПользовательскиеДействия.ФормаОбъекта", ПараметрыПередачи, 
		ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТочкаУсловиеПриИзменении(Элемент)

	ОбработатьИзменениеТекущейТочкиУсловие();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТочкаВыборВариантаПриИзменении(Элемент)
	
	ОбработатьИзменениеВыбораВарианта();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТочкаВариантыПриИзменении(Элемент)
	
	ОбработатьИзменениеВарантовТекущейТочки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТочкаВариантыПередУдалением(Элемент, Отказ)
	
	Если ТекущаяТочкаВарианты.Количество() = 1 Тогда
		// Должен быть хотябы один вариант.
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТочкаВариантыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И ОтменаРедактирования Тогда
		ОбработатьИзменениеВарантовТекущейТочки();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыАлгоритма

&НаКлиенте
Процедура ПараметрыАлгоритмаПриИзменении(Элемент)
	
	ОпределитьИспользуютсяПараметрыТочки(ЭтотОбъект);
	УправлениеПанельюТекущаяТочка(ЭтотОбъект, ТекущаяТочкаИдентификатор <> 0);	
	
	// Приведение параметров точек к параметрам алгоритма.
	Для каждого ПараметрАлгоритма Из Объект.ПараметрыАлгоритма Цикл
		СтрокаСуществует = Ложь;
		Для каждого СтрокаТаблицы Из ТекущаяТочкаПараметрыПроцесса Цикл
			Если СтрокаТаблицы.Имя = ПараметрАлгоритма.Имя Тогда
				СтрокаСуществует = Истина;
				Если НЕ ПараметрАлгоритма.Динамический Тогда
					ТекущаяТочкаПараметрыПроцесса.Удалить(СтрокаТаблицы);
				Иначе
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ПараметрАлгоритма);
					СтрокаТаблицы.Значение = ПараметрАлгоритма.Тип.ПривестиЗначение(СтрокаТаблицы.Значение);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
		Если НЕ СтрокаСуществует И ПараметрАлгоритма.Динамический Тогда
			СтрокаТаблицы = ТекущаяТочкаПараметрыПроцесса.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ПараметрАлгоритма);
			СтрокаТаблицы.Значение = ПараметрАлгоритма.ЗначениеПоУмолчанию;	 
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыАлгоритмаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекущаяСтрока = Элементы.ПараметрыАлгоритма.ТекущиеДанные;
		ТекущаяСтрока.СтрТип = "Строка";
		ТекущаяСтрока.Тип    = Новый ОписаниеТипов("Строка");
		ТекущаяСтрока.ЗначениеПоУмолчанию = ТекущаяСтрока.Тип.ПривестиЗначение(ТекущаяСтрока.ЗначениеПоУмолчанию);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыАлгоритмаТипПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПараметрыАлгоритма.ТекущиеДанные;
	ТипИзменение(ТекущаяСтрока.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыАлгоритмаЗначениеПоУмолчаниюОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ПараметрыАлгоритма.ТекущиеДанные;
	ТекущаяСтрока.ЗначениеПоУмолчанию = ТекущаяСтрока.Тип.ПривестиЗначение(ТекущаяСтрока.ЗначениеПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыАлгоритмаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ПараметрыАлгоритма.ТекущиеДанные;
	ТекущиеДанные.Имя = СтрЗаменить(ТекущиеДанные.Имя, " ","_");
	ТекущиеДанные.Имя = СтрЗаменить(ТекущиеДанные.Имя, ",","_");

	ОчиститьСообщения();
	
	Если НЕ ПустаяСтрока(ТекущиеДанные.Имя) Тогда
		Попытка
			Кандидат = Новый Структура(ТекущиеДанные.Имя); 
		Исключение
			
			ИндексСтроки = Объект.ПараметрыАлгоритма.Индекс(Элементы.ПараметрыАлгоритма.ТекущиеДанные);
			
			Пояснение = НСтр("ru = 'Имя параметра не соответствуют требованиям к именам переменных.';
							 |en = 'The parameter name does not meet the requirements for variable names.'")
					  + НСтр("ru = 'Параметром  может быть любая последовательность букв, цифр и знаков подчеркивания, начинающаяся с буквы или знака подчеркивания.';
							 |en = 'The parameter can be any sequence of letters, numbers, and underscores starting with a letter or underscore.'");			
			Поле = СтрШаблон("Объект.ПараметрыАлгоритма[%1].Имя", Формат(ИндексСтроки, "ЧН=0; ЧГ="));
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
								"Имя", ИндексСтроки + 1,"Параметры", Пояснение);
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,Поле,, Отказ);
		КонецПопытки; 
	КонецЕсли; 

	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТекущаяТочкаПараметрыПроцесса

&НаКлиенте
Процедура ТекущаяТочкаПараметрыПроцессаПриИзменении(Элемент)
	
	ТекущаяТочкаМодифицированность = Истина;

КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТекущаяТочкаВарианты

&НаКлиенте
Процедура ТекущаяТочкаВариантыЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	// В случае если установление НЕ составное ограничение типа,
	// сброс значение варианта на "Прочее" необходимо выполнить принудительно.
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанныеВарианта = Элементы.ТекущаяТочкаВарианты.ТекущиеДанные;
	ТекущиеДанныеВарианта.Значение = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НазначитьИспользование(Команда)
	
	Отказ = Ложь;
	ПередНачаломИспользования(Отказ);
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидАлгоритма", Объект.ВидАлгоритма); 
	Отбор.Вставить("Алгоритм", 	   Объект.Ссылка); 
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор); 
	ОткрытьФорму("РегистрСведений.бит_НазначениеАлгоритмов.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Отбор);
	ОткрытьФорму("РегистрСведений.бит_НазначениеАлгоритмов.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбзорСхемы(Команда)
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ГрафическаяСхема", ГрафическаяСхема);
	
	ОткрытьФорму("Справочник.бит_АлгоритмыПроцессов.Форма.ОбзорСхемы", ПараметрыФормы, 
		ЭтотОбъект, Объект.Ссылка);
		
КонецПроцедуры

&НаКлиенте
Процедура ТочкиАлгоритма(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстСообщения = НСтр("ru='Алгоритм не записан';en='The algorithm is not recorded'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Отбор = Новый Структура("Владелец", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца", Отбор, Истина);
	ОткрытьФорму("Справочник.бит_ТочкиАлгоритмов.ФормаСписка", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект); 
	
КонецПроцедуры

&НаСервере
Процедура АвторазмещениеЭлементовНаСервере()
	
	бит_ГрафическиеСхемы.ОптимизироватьГрафическуюСхему(ГрафическаяСхема);
	УстановитьСвойстваТекущейСтрокиТочекМаршрута(ЭтотОбъект);
	ПриИзмененииГрафическойСхемы(ЭтотОбъект);
	ДобавитьНовуюСхемуВИсторию();
	
КонецПроцедуры

&НаКлиенте
Процедура АвторазмещениеЭлементов(Команда)
	
	АвторазмещениеЭлементовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОтменитьИзменение(Команда)
	
	ИсторияОтменитьИзменениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВернутьИзменение(Команда)
	
	ИсторияВернутьИзменениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Помощник(Команда)
	
	ТекущийЭлементСхемы = Элементы.ГрафическаяСхема.ТекущийЭлемент;
	Если ТекущийЭлементСхемы = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо выделить элемент, после которого будет производиться вставка.';
							|en = 'It need to activate scheme element which become parent for input.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	КодТекущейТочки = ТекущийЭлементСхемы.Имя;
	
	ПараметрыСозданияТочек = Новый Структура;
	ПараметрыСозданияТочек.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыСозданияТочек.Вставить("КодТекущейТочки", КодТекущейТочки);
	ПараметрыСозданияТочек.Вставить("Ссылка", Объект.Ссылка);
	
	ОткрытьФормуПомощника(ПараметрыСозданияТочек);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСРегламентнымЗаданием

&НаСервере
Функция КлючРегламентногоЗадания()
	
	Если Объект.Ссылка.Пустая() Тогда
		ВызватьИсключение НСтр("ru = 'Получение ключа задания для несохраненного элемента.'");
	КонецЕсли;
	
	УникальныйИдентификаторАлгоритма = Объект.Ссылка.UUID();
	КлючЗадания = "СтартоватьПроцесс_" + УникальныйИдентификаторАлгоритма;
	
	Возврат КлючЗадания;
	
КонецФункции

&НаСервере
Процедура ПрочитатьДанныеРегламентногоЗадания()
	
	РегламентноеЗадание = Неопределено;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		УстановитьПривилегированныйРежим(Истина);
		Отбор = Новый Структура;
		Отбор.Вставить("Ключ", КлючРегламентногоЗадания());
		Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.бит_СтартПериодическихПроцессовБФ);
		МассивЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
		Если МассивЗаданий.Количество() > 0 Тогда
			РегламентноеЗадание = МассивЗаданий[0];
			ИдентификаторРегламентногоЗадания = РегламентноеЗадание.УникальныйИдентификатор;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь)
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда
		СтартоватьПоРасписанию         = РегламентноеЗадание.Использование;
		РасписаниеРегламентногоЗадания = РегламентноеЗадание.Расписание;
		НадписьРасписание              = РасписаниеРегламентногоЗадания;
	Иначе
		СтартоватьПоРасписанию = Ложь;
		НадписьРасписание      = НСтр("ru = '<Расписание не задано>'"); 
	КонецЕсли;
	
	Элементы.НадписьРасписание.Доступность = СтартоватьПоРасписанию;
	
КонецПроцедуры

// Процедура окончание выбора расписания задания. 
//
// Параметры:
//  РезультатВыбора         - Структура.
//  ДополнительныеПараметры - Структура.
//
&НаКлиенте 
Процедура УстановитьРасписанияРегламентногоЗадания(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НадписьРасписание              = РасписаниеЗадания;
	РасписаниеРегламентногоЗадания = РасписаниеЗадания;
	
	УстановитьРасписанияРегламентногоЗаданияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРасписанияРегламентногоЗаданияНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	РегламентныеЗаданияСервер.УстановитьРасписаниеРегламентногоЗадания(ИдентификаторРегламентногоЗадания,
																		РасписаниеРегламентногоЗадания);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИспользованиеРегламентногоЗадания()
	
	УстановитьПривилегированныйРежим(Истина);
	Если СтартоватьПоРасписанию Тогда
		Если ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда
			РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(ИдентификаторРегламентногоЗадания, Истина);
		Иначе
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Использование", Истина);
		
			ПараметрыВыполненияЗадания = Новый Массив;
			ПараметрыВыполненияЗадания.Добавить(Объект.Ссылка);
			
			НаименованиеЗадания = СтрШаблон(НСтр("ru = 'Старт процесса ""%1""'"), Объект.Наименование);
			
			ПараметрыЗадания.Вставить("Метаданные",    Метаданные.РегламентныеЗадания.бит_СтартПериодическихПроцессовБФ);
			ПараметрыЗадания.Вставить("Параметры",     ПараметрыВыполненияЗадания);
			ПараметрыЗадания.Вставить("Наименование",  НаименованиеЗадания);
			ПараметрыЗадания.Вставить("Ключ",          КлючРегламентногоЗадания());
			
			РегламентноеЗадание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
			ИдентификаторРегламентногоЗадания = РегламентноеЗадание.УникальныйИдентификатор;
		КонецЕсли;
		РасписаниеРегламентногоЗадания = РегламентныеЗаданияСервер.РасписаниеРегламентногоЗадания(ИдентификаторРегламентногоЗадания);
		НадписьРасписание              = РасписаниеРегламентногоЗадания;
	Иначе
		Если ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда
			РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(ИдентификаторРегламентногоЗадания, Ложь);
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Элементы.НадписьРасписание.Доступность = СтартоватьПоРасписанию;
	
КонецПроцедуры

// Процедура - обработчик оповещения "ПередЗаписьюОтключениеРегЗаданияЗавершение".
// 
&НаКлиенте
Процедура ПередЗаписьюОтключениеРегЗаданияЗавершение(Ответ, Параметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		СтартоватьПоРасписанию = Ложь;
		УстановитьИспользованиеРегламентногоЗадания();
		Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ТекстСодержитОтрицание(Знач ПроверяемыйТекст)
	
	Возврат (СтрСравнить(ПроверяемыйТекст, "Нет") = 0 ИЛИ СтрСравнить(ПроверяемыйТекст, "No") = 0);
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТекущаяТочкаВариантыЗначение");
	// АПК:277-вкл 
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ТекущаяТочкаВарианты.Значение", ВидСравненияКомпоновкиДанных.Равно, Неопределено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Прочее';en='Else'"));
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеТекущейТочкиУсловиеНаСервере()
	
	ТекущаяТочкаМодифицированность = Истина;
	
	Если ЗначениеЗаполнено(ТекущаяТочкаУсловие) Тогда
		ТекущаяТочкаНаименование = Строка(ТекущаяТочкаУсловие);
		ПриИзмененииНаименованияТекущейТочки();
	КонецЕсли; 
	
	ВыделитьЭлементСхемы(ТекущаяТочкаУсловие, Ложь, Строка(ТекущаяТочкаИдентификатор), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеТекущейТочкиУсловие()
	
	ОбработатьИзменениеТекущейТочкиУсловиеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеВыбораВарианта()
	
	ТекущаяТочкаМодифицированность = Истина;
	
	Если ЗначениеЗаполнено(ТекущаяТочкаВыборВарианта) Тогда
		ТекущаяТочкаНаименование = Строка(ТекущаяТочкаВыборВарианта);
		ПриИзмененииНаименованияТекущейТочки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеВарантовТекущейТочки()
	
	ТекущаяТочкаМодифицированность = Истина;
	
	СхемаXDTO     = СериализаторXDTO.ЗаписатьXDTO(ГрафическаяСхема);
	ЭлементыСхемы = СхемаXDTO.item;
	
	СвойстваЭлементов         = бит_ГрафическиеСхемы.ОписаниеСвойствЭлементовСхемы(ЭлементыСхемы);
	ЭлементыПоИдентификаторам = СвойстваЭлементов.ЭлементыПоИдентификаторам;
	ТаблицаСвязей             = СвойстваЭлементов.ТаблицаСвязей;
	
	ЭлементВариантыВыбора     = ЭлементыПоИдентификаторам.Получить(ТекущаяТочкаИдентификатор);
	Если ЭлементВариантыВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВариантыСхемы            = ЭлементВариантыВыбора.transition;
	ВариантыПользователя     = ТекущаяТочкаВарианты.Выгрузить();
	КолВариантовСхемы        = ВариантыСхемы.Количество();
	КолВариантовПользователя = ВариантыПользователя.Количество();
	
	Если КолВариантовПользователя < КолВариантовСхемы Тогда
		
		// Удален вариант.
		ИндексУдаляемогоВарианта = 0;
		Для каждого ВариантСхемы Из ВариантыСхемы Цикл
			СтрокаВариантаПользователя = ВариантыПользователя.Найти(ВариантСхемы.name, "Имя");
			Если СтрокаВариантаПользователя = Неопределено Тогда
				Прервать; // Нашли удаленную строку.
			КонецЕсли;
			ИндексУдаляемогоВарианта = ИндексУдаляемогоВарианта + 1;
		КонецЦикла;
		
		Отбор = Новый Структура("ЭлементИсточник", ТекущаяТочкаИдентификатор);
		ИсходящиеСвязиВыбораВарианта = ТаблицаСвязей.НайтиСтроки(Отбор);
		Для каждого СтрокаСвязи Из ИсходящиеСвязиВыбораВарианта Цикл
			НомерВарианта = Окр((СтрокаСвязи.ГраньИсточника - 5) / 2);
			
			Если НомерВарианта = (ИндексУдаляемогоВарианта + 1) Тогда
				// Удаление исходящих линий удаляемого элемента.
				ИдентификаторЛинии = СтрокаСвязи.ЛинияСвязи;
				ТекущийИндекс = 0;
				Для каждого ЭлементСхемы Из ЭлементыСхемы Цикл
					Если ЭлементСхемы.itemId = ИдентификаторЛинии Тогда
						ЭлементыСхемы.Удалить(ТекущийИндекс);
						Прервать;
					КонецЕсли;
					ТекущийИндекс = ТекущийИндекс + 1;
				КонецЦикла;
			ИначеЕсли НомерВарианта > (ИндексУдаляемогоВарианта + 1) Тогда
				// Смещение граней связи.
				ЭлементСхемы = ЭлементыПоИдентификаторам.Получить(СтрокаСвязи.ЛинияСвязи);
				ЭлементСхемы.portIndexFrom = ЭлементСхемы.portIndexFrom - 2;
				СтрокаСвязи.ГраньИсточника = ЭлементСхемы.portIndexFrom;
			ИначеЕсли НомерВарианта < (ИндексУдаляемогоВарианта + 1) Тогда
				// Смещение координат линии связи.
				ЭлементСхемы       = ЭлементыПоИдентификаторам.Получить(СтрокаСвязи.ЛинияСвязи);
				ТочкиЛинииСвязи    = ЭлементСхемы.point;
				ОрдинатаДоСмещения = ТочкиЛинииСвязи[0].y;
				Смещение           = 20;
				Для каждого ТочкаЛинии Из ТочкиЛинииСвязи Цикл
					Если ТочкаЛинии.y = ОрдинатаДоСмещения Тогда
						ТочкаЛинии.y = ТочкаЛинии.y + Смещение;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		ВариантыСхемы.Удалить(ИндексУдаляемогоВарианта);
		
	ИначеЕсли КолВариантовПользователя > КолВариантовСхемы Тогда
		
		// Добавлен вариант.
		ИмяНовогоВарианта = "ВариантN";
		
		НовыйВариант = СериализаторXDTO.Фабрика.Создать(СериализаторXDTO.Фабрика.Тип("http://v8.1c.ru/8.2/data/graphscheme","Transition"));
		НовыйВариант.backColor   = Новый Цвет;
		НовыйВариант.name        = ИмяНовогоВарианта;
		
		ТипЛокализованнаяСтрока  = СериализаторXDTO.Фабрика.Тип("http://v8.1c.ru/8.1/data/core","LocalStringType");
		НовыйВариант.description = СериализаторXDTO.Фабрика.Создать(ТипЛокализованнаяСтрока);
		
		ТипЭлементЛокализации   = СериализаторXDTO.Фабрика.Тип("http://v8.1c.ru/8.1/data/core","LocalStringItemType");
		НовыйЭлементЛокализации = СериализаторXDTO.Фабрика.Создать(ТипЭлементЛокализации);
		НовыйЭлементЛокализации.lang    = "#";
		НовыйЭлементЛокализации.content = ИмяНовогоВарианта;
		НовыйВариант.description.item.Добавить(НовыйЭлементЛокализации);
		
		ВариантыСхемы.Добавить(НовыйВариант);
		
		// Увеличим высоту элемента варианты выбора.
		ЭлементВариантыВыбора.rectBottom = ЭлементВариантыВыбора.rectBottom + 20;
		ЭлементВариантыВыбора.point[2].y = ЭлементВариантыВыбора.point[2].y + 20;
		ЭлементВариантыВыбора.point[3].y = ЭлементВариантыВыбора.point[3].y + 20;
		
		// Добавим новую исходящую линию для варианта.
		МаксИдентификатор = 0;
		Для каждого ЭлементИдентификатора Из ЭлементыПоИдентификаторам Цикл
			МаксИдентификатор = Макс(МаксИдентификатор, ЭлементИдентификатора.Ключ);
		КонецЦикла;
		ИдентификаторЛинии  = МаксИдентификатор + 1;
		
		СоединительнаяЛиния = бит_ГрафическиеСхемы.НовыйЭлементСхемы(Перечисления.бит_ЭлементыГрафическойСхемы.Линия,
																	ИдентификаторЛинии);
		ЭлементыПоИдентификаторам.Вставить(ИдентификаторЛинии, СоединительнаяЛиния);
		
		бит_ГрафическиеСхемы.УстановитьПривязкуСоединительнойЛинии(СоединительнаяЛиния, ТаблицаСвязей,
												ЭлементВариантыВыбора,, КолВариантовСхемы * 2 + 7);
																	
		КоординатыТочки1 = бит_ГрафическиеСхемы.НовыеКоординатыЭлементаXDTO();
		КоординатыТочки1.x = ЭлементВариантыВыбора.rectRight - 1;
		КоординатыТочки1.y = ЭлементВариантыВыбора.rectBottom - 10;
		НоваяТочкаXDTO   = бит_ГрафическиеСхемы.НоваяТочкаXDTO(КоординатыТочки1);
		СоединительнаяЛиния.point.Добавить(НоваяТочкаXDTO);
		
		КоординатыТочки2 = бит_ГрафическиеСхемы.НовыеКоординатыЭлементаXDTO();
		КоординатыТочки2.x = КоординатыТочки1.x + 30;
		КоординатыТочки2.y = КоординатыТочки1.y;
		НоваяТочкаXDTO   = бит_ГрафическиеСхемы.НоваяТочкаXDTO(КоординатыТочки2);
		СоединительнаяЛиния.point.Добавить(НоваяТочкаXDTO);
		
		ЭлементыСхемы.Добавить(СоединительнаяЛиния);
	КонецЕсли;
	
	Индекс = 0;
	Для каждого ВариантСхемы Из ВариантыСхемы Цикл
		НовоеИмя = ВариантыПользователя.Получить(Индекс).Имя;
		Если ПустаяСтрока(НовоеИмя) Тогда
			НовоеИмя = СтрШаблон("Вариант %1", Индекс + 1);
		КонецЕсли;
		ВариантСхемы.name = НовоеИмя;
		ВариантСхемы.description.item[0].content = НовоеИмя;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	ГрафическаяСхема = СериализаторXDTO.ПрочитатьXDTO(СхемаXDTO);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеТекущейТочкиДействиеНаСервере()
	
	ТекущаяТочкаМодифицированность = Истина;
	
	Если ЗначениеЗаполнено(ТекущаяТочкаДействие) Тогда
		ТекущаяТочкаНаименование = Строка(ТекущаяТочкаДействие);
		ПриИзмененииНаименованияТекущейТочки();
	КонецЕсли; 
	
	Затемнить = Ложь;
	Если Объект.ВидАлгоритма = Перечисления.бит_ВидыАлгоритмов.Визирование
		И ТекущаяТочкаВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.ПодчиненныйПроцесс Тогда
		Затемнить = Истина;
	КонецЕсли;
	
	ВыделитьЭлементСхемы(ТекущаяТочкаДействие, Затемнить, Строка(ТекущаяТочкаИдентификатор), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеТекущейТочкиДействие()
	
	ОбработатьИзменениеТекущейТочкиДействиеНаСервере();

КонецПроцедуры 

&НаКлиенте
Функция ПараметрыВыбораТочкиДействия()

	ПараметрыВыбораТочки = Элементы.ТекущаяТочкаДействие.ПараметрыВыбора;
	УстановленныеОтборы  = Новый Структура; 

	Если ПараметрыВыбораТочки <> Неопределено Тогда
		Для каждого ПараметрВыбора Из ПараметрыВыбораТочки Цикл
			УстановленныеОтборы.Вставить(СтрЗаменить(ПараметрВыбора.Имя, "Отбор.", ""), ПараметрВыбора.Значение);
		КонецЦикла; 
	КонецЕсли;	

	Возврат УстановленныеОтборы;

КонецФункции
 
&НаКлиенте
Процедура ПоказатьСписокВыбораДействия()
	
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("Отбор", ПараметрыВыбораТочкиДействия());
	ПараметрыПередачи.Вставить("ТекущаяСтрока", ТекущаяТочкаДействие);
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьСписокВыбораДействияЗавершение", ЭтотОбъект); 
	ОткрытьФорму("Справочник.бит_ПользовательскиеДействия.ФормаВыбора", ПараметрыПередачи, 
		Неопределено, ЭтотОбъект,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ПоказатьСписокВыбораДействияЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	Если ТекущаяТочкаДействие <> Результат Тогда
		ТекущаяТочкаДействие = Результат;
		ОбработатьИзменениеТекущейТочкиДействие();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокВыбораУсловия()
	
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("ТекущаяСтрока", ТекущаяТочкаУсловие);
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьСписокВыбораУсловияЗавершение", ЭтотОбъект); 

	ОткрытьФорму("Справочник.бит_ПользовательскиеУсловия.ФормаВыбора", , 
		Неопределено, ЭтотОбъект,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ПоказатьСписокВыбораУсловияЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	Если ТекущаяТочкаУсловие <> Результат Тогда
		ТекущаяТочкаУсловие = Результат;
		ОбработатьИзменениеТекущейТочкиУсловие();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодчиненныйАлгоритм(Знач Действие)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Действие, "АлгоритмПодчиненный");

КонецФункции
 
&НаКлиенте
Процедура ПриОткрытииПродолжение()
	
	ТекстСообщения = НСтр("ru = 'Скопировать пользовательские действия в точки алгоритма?
                           		|Для этого придется записать элемент.'; 
						  |en = 'To copy a custom action in terms of algorithm?
                           		|To do this, you will need to write an element.'");	
	Оповещение = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект); 
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
	    Записать();
	    ПриОткрытииЗавершениеНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииЗавершениеНаСервере()

	Справочники.бит_АлгоритмыПроцессов.КопироватьДействияВТочкиМаршрута(ЗначениеКопирования, Объект.Ссылка);
	ЗначениеКопирования = Неопределено;
	Прочитать();
	
КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста 
Процедура ОпределитьИспользуютсяПараметрыТочки(Форма)
	
	Объект = Форма.Объект;
	// Используется сканирование таблицы, для того, что бы избежать вызова сервера при обработке на клиенте.
	Форма.ИспользуютсяПараметрыТочки = Ложь;
	Для каждого СтрокаТаблицы Из Объект.ПараметрыАлгоритма Цикл
		Форма.ИспользуютсяПараметрыТочки = Макс(СтрокаТаблицы.Динамический, Форма.ИспользуютсяПараметрыТочки);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоВизирование  = Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Визирование");
	ЭтоПроизвольный = Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Прочее");
	
	КомандыВставкиЭлементовСхемы = Элементы.КоманднаяПанельГрафическойСхемы.ПодчиненныеЭлементы.ГрафическаяСхемаВставить.ПодчиненныеЭлементы;
	КомандыВставкиЭлементовСхемы.ГрафическаяСхемаВставитьЭлементОбработка.Видимость = ЭтоВизирование;
	КомандыВставкиЭлементовСхемы.ГрафическаяСхемаВставитьЭлементВложенныйБизнесПроцесс.Видимость = ЭтоПроизвольный;
	                                    	
	Элементы.СпособВыполнения.Видимость 		  = ЭтоВизирование;
	Элементы.ГруппаНазначение.Видимость 		  = ЭтоПроизвольный;
	Элементы.НазначитьИспользование.Видимость 	  = НЕ ЭтоПроизвольный;
	Элементы.ВидПроцесса.ТолькоПросмотр     	  = Форма.ЭтоВебКлиент;
	Элементы.СтраницаПараметрыАлгоритма.Видимость = ЭтоПроизвольный;
	Элементы.ФормаПомощник.Видимость              = ЭтоПроизвольный;
	Элементы.СтартоватьПоРасписанию.Видимость     = ЭтоПроизвольный;
	Элементы.НадписьРасписание.Видимость          = ЭтоПроизвольный;
	
	Если ЭтоПроизвольный Тогда
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе	
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли; 
	
	Если Форма.ЭтоВебКлиент Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Прочее") Тогда
		Элементы.ТекущаяТочкаДействие.Доступность = НЕ Объект.Ссылка.Пустая();
		Если Объект.Ссылка.Пустая() Тогда
			ТекстСообщения = НСтр("ru = '<Запишите алгоритм>'; en = '<Write down the algorithm>'"); 
		Иначе	
			ТекстСообщения = ""; 
		КонецЕсли; 
		Элементы.ТекущаяТочкаДействие.ПодсказкаВвода = ТекстСообщения;
	Иначе	
		Элементы.ТекущаяТочкаДействие.Доступность 	 = Истина;
		Элементы.ТекущаяТочкаДействие.ПодсказкаВвода = "";
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьТипыПараметров()
	
	Для каждого СтрокаТаблицы Из Объект.ПараметрыАлгоритма Цикл
		
		СтрокаТаблицы.Тип = бит_ОбщегоНазначенияКлиентСервер.ПолучитьОписаниеИзСтроки(СтрокаТаблицы.СтрТип);
		
	КонецЦикла; 
	
КонецПроцедуры // ВосстановитьТипыПараметров()

&НаСервере
Процедура УправлениеДопИнформацией()
	
	НадписьИнформация = "";
	Результат = Справочники.бит_АлгоритмыПроцессов.АлгоритмИспользуется(Объект.Ссылка);
	
	АлгоритмИспользуется = Результат.АлгоритмИспользуется;
	Если АлгоритмИспользуется Тогда
		НадписьИнформация = СтрШаблон(НСтр("ru = 'Изменение состава точек не рекомендуется. Алгоритм используется %1.';
								|en = 'Changing the composition of points is not recommended. The algorithm is used by %1.'"), 
								Результат.МестоИспользования); 
	КонецЕсли; 
	Элементы.ГруппаДекорацияПредупреждение.Видимость = АлгоритмИспользуется;
	
КонецПроцедуры

&НаКлиенте 
Процедура ВидАлгоритмаИзменение()
	
	УправлениеФормой(ЭтотОбъект);
	
	Если Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Прочее") Тогда
		Объект.СпособВыполнения = ПредопределенноеЗначение("Перечисление.бит_СпособыВыполненияАлгоритма.Поэтапно");
	ИначеЕсли Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Визирование") Тогда
		Объект.СпособВыполнения = ПредопределенноеЗначение("Перечисление.бит_СпособыВыполненияАлгоритма.Поэтапно");	
	ИначеЕсли Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.ИзменениеСтатусовОбъектов") Тогда	
		Объект.СпособВыполнения = ПредопределенноеЗначение("Перечисление.бит_СпособыВыполненияАлгоритма.Сразу");
	КонецЕсли; 
	
	ТекущаяТочкаДействие = ПредопределенноеЗначение("Справочник.бит_ПользовательскиеДействия.ПустаяСсылка");
	Для каждого СтрокаТаблицы Из ТочкиМаршрута Цикл
		СтрокаТаблицы.Действие = ТекущаяТочкаДействие;
	КонецЦикла; 
   
КонецПроцедуры

&НаСервере
Процедура ТипИзменение(Знач ИдСтроки)
    
	ТекущаяСтрока = Объект.ПараметрыАлгоритма.НайтиПоИдентификатору(ИдСтроки);
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		ТекущаяСтрока.СтрТип              = бит_ОбщегоНазначения.СтроковоеПредставлениеОписанияТипов(ТекущаяСтрока.Тип);
		ТекущаяСтрока.ЗначениеПоУмолчанию = ТекущаяСтрока.Тип.ПривестиЗначение(ТекущаяСтрока.ЗначениеПоУмолчанию);
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломИспользования(Отказ)

	Если (Модифицированность ИЛИ Объект.Ссылка.Пустая()) Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Запишите алгоритм.'; en = 'Write down the algorithm.'"); 
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 
	
	ОчиститьСообщения();
	Результат = АлгоритмГотовКРаботе();
	Если НЕ Результат.ГотовКРаботе Тогда
		ВызватьИсключение Результат.Ошибки;
	КонецЕсли; 

КонецПроцедуры
 
&НаСервере
Функция АлгоритмГотовКРаботе()
	
	ГотовКРаботе = Справочники.бит_АлгоритмыПроцессов.АлгоритмГотовКРаботе(Объект.Ссылка);
	Ошибки = "";
	Если НЕ ГотовКРаботе Тогда
		Сообщения = ПолучитьСообщенияПользователю(Истина);
		Тексты = Новый Массив; 
		Для каждого Сообщение Из Сообщения Цикл
			Тексты.Добавить(Сообщение.Текст);
		КонецЦикла; 
		Ошибки = СтрСоединить(Тексты, Символы.ПС);
	КонецЕсли; 
	
	Результат = Новый Структура; 
	Результат.Вставить("ГотовКРаботе", ГотовКРаботе);
	Результат.Вставить("Ошибки", Ошибки);
	
	Возврат Результат;

КонецФункции
 
&НаКлиенте
Процедура ПроверитьЗаполнениеТочекМаршрутаПередЗакрытием(Отказ)

	ПропуститьПроверку = Ложь;
	
	Если ТочкиМаршрута.Количество() = 0 Тогда
		// Нет точек - нет проверки.
		ПропуститьПроверку = Истина;
	Иначе
		Если ТочкиМаршрута.Количество() = 1 Тогда
			Если ТочкиМаршрута[0].ВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Старт") Тогда
				// Единственная точка - "старт". Пропустим проверку.
				ПропуститьПроверку = Истина;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	Если ПропуститьПроверку Тогда
		Возврат;
	КонецЕсли; 
	
	Результат = АлгоритмГотовКРаботе();
	
	Если НЕ Результат.ГотовКРаботе Тогда
		Отказ = Истина;
		ТекстСообщения = Результат.Ошибки 
					   + Символы.ПС + НСтр("ru='Закрыть форму?';en='Close form?'");   
		Оповещение = Новый ОписаниеОповещения("ПроверитьЗаполнениеТочекМаршрутаЗавершение", ЭтотОбъект); 
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры
 
// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПроверитьЗаполнениеТочекМаршрутаЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрыватьФорму = Истина;
		Закрыть();
	Иначе	
		ЗакрыватьФорму = Ложь;
	КонецЕсли; 

КонецПроцедуры
 
&НаКлиенте
Процедура ПредложитьЗаписатьСправочник()

	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.ВидАлгоритма) Тогда
		ТекстСообщения = "";
		Если Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Прочее") Тогда
			ТекстСообщения = НСтр("ru = 'Для заполнения действий в точках вида ""Действие"" требуется записать алгоритм. Продолжить?';
								  |en = 'To fill in actions in points of the ""Action""type, you need to write an algorithm. Continue?'"); 
			ОписаниеОповещения = Новый ОписаниеОповещения("ПредложитьЗаписатьСправочникЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли; 	

КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПредложитьЗаписатьСправочникЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() Тогда
			Записать();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриАктивизацииГрафическойСхемы()

	ТекущийЭлементСхемы = Элементы.ГрафическаяСхема.ТекущийЭлемент;
	ТочкаМаршрута = Неопределено;
	Если ТекущийЭлементСхемы <> Неопределено Тогда
		ТочкаМаршрута = НайтиТочкуМаршрута(ТекущийЭлементСхемы.Имя, "КодТочки");
		Если ТочкаМаршрута <> Неопределено Тогда
			Если ТекущаяТочкаИдентификатор <> ТочкаМаршрута.ИдентификаторТочки Тогда
			    УстановитьСвойстваТекущейСтрокиТочекМаршрута(ЭтотОбъект);
				УстановитьСвойстваТекущейТочки(ТочкаМаршрута);
				УстановитьПараметрыВыбораТекущаяТочкаДействие(ЭтотОбъект);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
	УправлениеПанельюТекущаяТочка(ЭтотОбъект, ТекущаяТочкаИдентификатор <> 0);
	
КонецПроцедуры
 
&НаКлиенте    
Функция НайтиТочкуМаршрута(Значение, Колонка)
	
	// Используется сканирование таблицы, для того, что бы избежать вызова сервера при обработке на клиенте.
	СтрокаТочекМаршрута = Неопределено;
	Для каждого СтрокаТаблицы Из ТочкиМаршрута Цикл
	    Если СтрокаТаблицы[Колонка] = Значение Тогда
		      Возврат СтрокаТаблицы
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат СтрокаТочекМаршрута
	
КонецФункции
 
&НаСервереБезКонтекста
Процедура ПриИзмененииГрафическойСхемы(Форма)
	
	ВидыЭлементов = бит_УправлениеПроцессами.ВидыЭлементовГрафическойСхемы();
	
	ИдентификаторыТочек = Новый Массив;
	
	ДокументDOM = бит_УправлениеПроцессами.ГрафическаяСхемаВDOM(Форма.ГрафическаяСхема);
	
	// Каждый элемент схемы "item" представлен свойством "itemType"
	СписокЭлементовDOM = ДокументDOM.ПолучитьЭлементыПоИмени("itemType");
	
	Для Каждого Элемент Из СписокЭлементовDOM Цикл
		
		ТипЭлемента = Число(Элемент.ТекстовоеСодержимое);
		
		Если ТипЭлемента = 0 ИЛИ ТипЭлемента = 1 Тогда
			// Типы элементов см. бит_УправлениеПроцессами.ТипыЭлементовГрафическойСхемы().
			Продолжить;
		КонецЕсли;
		
		УзелТочкиМаршрута = Элемент.РодительскийУзел;
		
		// Каждый элемент схемы имеет itemId
		ИдентификаторТочки = Число(бит_УправлениеПроцессами.ЗначениеСвойстваЭлемента(УзелТочкиМаршрута, "itemId"));
		КодТочки		   = бит_УправлениеПроцессами.ЗначениеСвойстваЭлемента(УзелТочкиМаршрута, "itemCode");
		НаименованиеТочки  = бит_УправлениеПроцессами.ЗначениеСвойстваЭлемента(УзелТочкиМаршрута, "content");
		УзлыВариантов      = УзелТочкиМаршрута.ПолучитьЭлементыПоИмени("transition");
		
		ВидТочки           = ВидыЭлементов[ТипЭлемента];
		
		// Заполняеем перечень текущих идентификаторов
		ИдентификаторыТочек.Добавить(ИдентификаторТочки);
		
		// Находим, есть ли данный узел в точках маршрута
		ПараметрыОтбора = Новый Структура("ИдентификаторТочки", ИдентификаторТочки);
		
		РезультатПоиска = Форма.ТочкиМаршрута.НайтиСтроки(ПараметрыОтбора);
		
		Если РезультатПоиска.Количество() = 0 Тогда
			СтрокаТаблицы = Форма.ТочкиМаршрута.Добавить();
			СтрокаТаблицы.НоваяТочка         = Истина;
			СтрокаТаблицы.Модифицированность = Истина;
			СтрокаТаблицы.ИдентификаторТочки = ИдентификаторТочки;
			СтрокаТаблицы.ВидТочки           = ВидТочки;
			СтрокаТаблицы.Наименование       = НаименованиеТочки;
			СтрокаТаблицы.КодТочки           = КодТочки;
			ТаблицаВариантов = СтрокаТаблицы.Варианты;
			Для каждого УзелВарианта Из УзлыВариантов Цикл
				СтрокаВарианта = ТаблицаВариантов.Добавить();
				ИмяВарианта    = бит_УправлениеПроцессами.ЗначениеСвойстваЭлемента(УзелВарианта, "name");
				СтрокаВарианта.Имя = ИмяВарианта;
			КонецЦикла;
			Если ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.ПодчиненныйПроцесс 
				И Форма.ТекущийВидАлгоритма = Перечисления.бит_ВидыАлгоритмов.Визирование Тогда
				ТекстСообщения = НСтр("ru = 'Вложенные процессы в алгоритме визирования не поддерживаются.';
									  |en = 'Nested processes are not supported in the sighting algorithm.'"); 
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе            
			СтрокаТаблицы = РезультатПоиска[0];
			Если СтрокаТаблицы.Наименование <> НаименованиеТочки Тогда
			     СтрокаТаблицы.Наименование = НаименованиеТочки;
				 СтрокаТаблицы.Модифицированность = Истина;
			КонецЕсли; 
			Если СтрокаТаблицы.КодТочки <> КодТочки Тогда
			     СтрокаТаблицы.КодТочки = КодТочки;
				 СтрокаТаблицы.Модифицированность = Истина;
			КонецЕсли;
			СопоставитьВарианты(УзлыВариантов, СтрокаТаблицы.Варианты);
		КонецЕсли;
		
	КонецЦикла;

	// Удалим из таблицы точек маршрута те элементы, которые удалили на схеме.
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаТаблицы Из Форма.ТочкиМаршрута Цикл
		Если ИдентификаторыТочек.Найти(СтрокаТаблицы.ИдентификаторТочки) = Неопределено Тогда
			СтрокиКУдалению.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из СтрокиКУдалению Цикл
		ЗаполнитьЗначенияСвойств(Форма.ТочкиМаршрутаКУдалению.Добавить(), СтрокаТаблицы);
		Если СтрокаТаблицы.ИдентификаторТочки = Форма.ТекущаяТочкаИдентификатор Тогда
		    Форма.ТекущаяТочкаИдентификатор = 0; 
			УправлениеПанельюТекущаяТочка(Форма, Ложь);
		КонецЕсли;
		Форма.ТочкиМаршрута.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СопоставитьВарианты(УзлыВариантов, ВариантыТочки)
	
	КоличествоВариантовЭлемента = УзлыВариантов.Количество();
	Если УзлыВариантов.Количество() = ВариантыТочки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	КопияВариантыТочки = ВариантыТочки.Выгрузить();
	ВариантыТочки.Очистить();
	
	Для каждого УзелВарианта Из УзлыВариантов Цикл
		СтрокаВарианта = ВариантыТочки.Добавить();
		ИмяВарианта    = бит_УправлениеПроцессами.ЗначениеСвойстваЭлемента(УзелВарианта, "name");
		СтрокаВарианта.Имя = ИмяВарианта;
		
		СтрокаДоИзменения = КопияВариантыТочки.Найти(ИмяВарианта, "Имя");
		Если СтрокаДоИзменения <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаВарианта, СтрокаДоИзменения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВидЭлемента(ЭлементDOM)
	
	ВидЭлемента = Неопределено;
	
	ТипЭлемента = бит_УправлениеПроцессами.ЗначениеСвойстваЭлемента(ЭлементDOM, "itemType");
	Если ЗначениеЗаполнено(ТипЭлемента) Тогда
		ВидыЭлементов = бит_УправлениеПроцессами.ВидыЭлементовГрафическойСхемы();
		ВидЭлемента   = ВидыЭлементов[Число(ТипЭлемента)];
	КонецЕсли;
	
	Возврат ВидЭлемента;
	
КонецФункции

&НаКлиенте 
Процедура ВыделитьЭлементыСхемы()
		
	ВыделитьЭлементыСхемыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыделитьЭлементыСхемыНаСервере()
	
	ДокументDOM 	   = бит_УправлениеПроцессами.ГрафическаяСхемаВDOM(ГрафическаяСхема);
	СписокЭлементовDOM = ДокументDOM.ПолучитьЭлементыПоИмени("itemType");
	
	ТаблицаМаршрута = РеквизитФормыВЗначение("ТочкиМаршрута");
	ТаблицаМаршрута.Индексы.Добавить("ИдентификаторТочки");
	
	Для Каждого Элемент Из СписокЭлементовDOM Цикл
		
		ТипЭлемента = Число(Элемент.ТекстовоеСодержимое);
		Если НЕ (ТипЭлемента = 4 ИЛИ ТипЭлемента = 5 ИЛИ ТипЭлемента = 10) Тогда
			Продолжить;
		КонецЕсли;
		
		УзелТочкиМаршрута  = Элемент.РодительскийУзел;
		ИдентификаторТочки = Число(бит_УправлениеПроцессами.ЗначениеСвойстваЭлемента(УзелТочкиМаршрута, "itemId"));
		СтрокаТаблицы      = ТаблицаМаршрута.Найти(ИдентификаторТочки, "ИдентификаторТочки");
		
		СвойствоДляПроверки = Неопределено;
		Если СтрокаТаблицы.ВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.ПодчиненныйПроцесс") Тогда
			Если Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Визирование") Тогда
				СвойствоДляПроверки = Неопределено;
				// Затемнить элемент.
				бит_УправлениеПроцессами.УстановитьЗначениеСвойстваЭлемента(УзелТочкиМаршрута, "passageState", "1");
			Иначе	
				СвойствоДляПроверки = СтрокаТаблицы.Действие;
			КонецЕсли; 
		ИначеЕсли СтрокаТаблицы.ВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Действие") Тогда
			СвойствоДляПроверки = СтрокаТаблицы.Действие;	
		ИначеЕсли СтрокаТаблицы.ВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Условие") Тогда
			СвойствоДляПроверки = СтрокаТаблицы.Условие;
		КонецЕсли; 
		
		Если СвойствоДляПроверки <> Неопределено Тогда
			Если ЗначениеЗаполнено(СвойствоДляПроверки) Тогда
				passageState = "0";
			Иначе	
				passageState = "2";
			КонецЕсли; 
			бит_УправлениеПроцессами.УстановитьЗначениеСвойстваЭлемента(УзелТочкиМаршрута, "passageState", passageState);
		КонецЕсли; 
	КонецЦикла;
	
	ГрафическаяСхема = бит_УправлениеПроцессами.ГрафическаяСхемаИзDOM(ДокументDOM);
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТочкиМаршрута(Ссылка, Копирование)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТочкиАлгоритмов.Ссылка КАК ТочкаМаршрута,
	|	ТочкиАлгоритмов.ВидТочки КАК ВидТочки,
	|	ТочкиАлгоритмов.Наименование КАК Наименование,
	|	ТочкиАлгоритмов.ИдентификаторТочки КАК ИдентификаторТочки,
	|	ТочкиАлгоритмов.КодТочки КАК КодТочки,
	|	ТочкиАлгоритмов.ПользовательскоеУсловие КАК Условие,
	|	ТочкиАлгоритмов.ПользовательскоеДействие КАК Действие,
	|	ТочкиАлгоритмов.ПользовательскийВыборВарианта КАК ВыборВарианта
	|ПОМЕСТИТЬ ТочкиМаршрута
	|ИЗ
	|	Справочник.бит_ТочкиАлгоритмов КАК ТочкиАлгоритмов
	|ГДЕ
	|	ТочкиАлгоритмов.Владелец = &Владелец
	|	И ТочкиАлгоритмов.ИдентификаторТочки <> 0
	|	И ТочкиАлгоритмов.АктивнаяТочкаМаршрута
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &Копирование
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.бит_ТочкиАлгоритмов.ПустаяСсылка)
	|		ИНАЧЕ ТочкиМаршрута.ТочкаМаршрута
	|	КОНЕЦ КАК ТочкаМаршрута,
	|	ТочкиМаршрута.ВидТочки КАК ВидТочки,
	|	ТочкиМаршрута.Наименование КАК Наименование,
	|	ТочкиМаршрута.ИдентификаторТочки КАК ИдентификаторТочки,
	|	ТочкиМаршрута.КодТочки КАК КодТочки,
	|	ВЫБОР
	|		КОГДА &Копирование
	|				И ТочкиМаршрута.Условие.КонтекстВыполнения = ЗНАЧЕНИЕ(Перечисление.бит_КонтекстыВыполненияПользовательскихУсловий.Процесс)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеУсловия.ПустаяСсылка)
	|		ИНАЧЕ ТочкиМаршрута.Условие
	|	КОНЕЦ КАК Условие,
	|	ТочкиМаршрута.Действие КАК Действие,
	|	ТочкиМаршрута.ВыборВарианта КАК ВыборВарианта,
	|	&Копирование КАК НоваяТочка,
	|	&Копирование КАК Модифицированность,
	|	ТочкиМаршрута.ТочкаМаршрута.ПараметрыПроцесса.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Имя КАК Имя,
	|		СтрТип КАК СтрТип,
	|		Значение КАК Значение,
	|		Обязательный КАК Обязательный
	|	) КАК ПараметрыПроцесса,
	|	ТочкиМаршрута.ТочкаМаршрута.ВариантыВыбора.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИмяВарианта КАК Имя,
	|		ЗначениеВыбора КАК Значение
	|	) КАК ВариантыВыбораТочки
	|ИЗ
	|	ТочкиМаршрута КАК ТочкиМаршрута
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторТочки";
	
	Запрос.УстановитьПараметр("Владелец", Ссылка);
	Запрос.УстановитьПараметр("Копирование", Копирование);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТочкиМаршрута.Очистить();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТочкиМаршрута.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ПараметрыТочки.Загрузить(ВыборкаДетальныеЗаписи.ПараметрыПроцесса.Выгрузить());
		НоваяСтрока.Варианты.Загрузить(ВыборкаДетальныеЗаписи.ВариантыВыбораТочки.Выгрузить());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНаименованияТекущейТочки()
	
	ДокументDOM = бит_УправлениеПроцессами.ГрафическаяСхемаВDOM(ГрафическаяСхема);
	
	ИдентификаторТочки = Строка(ТекущаяТочкаИдентификатор);
	УзелТочкиМаршрута  = бит_УправлениеПроцессами.ЭлементПоЗначениюСвойства(ДокументDOM, "itemId", ИдентификаторТочки);
	
	Если УзелТочкиМаршрута = Неопределено Тогда
		Возврат;	
	КонецЕсли; 

	ТипЭлемента = ВидЭлемента(УзелТочкиМаршрута);
	
	УзелДляУстановкиЗаголовка = УзелТочкиМаршрута;
	Если ТипЭлемента = Перечисления.бит_ВидыТочекАлгоритмов.ВыборВарианта Тогда
		ЗаголовкиВыбораВарианта = УзелТочкиМаршрута.ПолучитьЭлементыПоИмени("itemTitle");
		Если ЗаголовкиВыбораВарианта.Количество() = 1 Тогда
			УзелДляУстановкиЗаголовка = ЗаголовкиВыбораВарианта[0];
		КонецЕсли;
	Иначе
		УзелДляУстановкиЗаголовка = УзелТочкиМаршрута;
	КонецЕсли;
	бит_УправлениеПроцессами.УстановитьЗначениеСвойстваЭлемента(УзелДляУстановкиЗаголовка, "content", ТекущаяТочкаНаименование);
	
	ГрафическаяСхема = бит_УправлениеПроцессами.ГрафическаяСхемаИзDOM(ДокументDOM);
	
	ДобавитьНовуюСхемуВИсторию();
	
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура ВыделитьЭлементСхемы(СвойствоДляПроверки, Затемнить, ИдентификаторТочки, Форма)
	
	Если Затемнить Тогда
		passageState = "1";
	Иначе	
		Если НЕ ЗначениеЗаполнено(СвойствоДляПроверки)  Тогда  
			passageState = "2";
		Иначе
			passageState = "0";
		КонецЕсли;
	КонецЕсли; 

	бит_УправлениеПроцессами.ВыделитьЭлемент(Форма.ГрафическаяСхема, 
		ИдентификаторТочки, passageState);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УправлениеПанельюТекущаяТочка(Форма, ПоказатьСвойства)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;

	Элементы.ДекорацияСвойстваТочки.Видимость 	  = НЕ ПоказатьСвойства; 
	Элементы.ДекорацияКот.Видимость 	  		  = НЕ ПоказатьСвойства;
	Элементы.ГруппаСвойстваТекущейТочки.Видимость = ПоказатьСвойства;

	ЭтоТочкаДействия  = Форма.ТекущаяТочкаВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Действие");			
	ЭтоТочкаУсловия   = Форма.ТекущаяТочкаВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Условие");
	ЭтоТочкаПроцесса  = Форма.ТекущаяТочкаВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.ПодчиненныйПроцесс");
	ЭтоТочкаОбработки = Форма.ТекущаяТочкаВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Обработка");
	ЭтоТочкаВарианта  = Форма.ТекущаяТочкаВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.ВыборВарианта");
		
	Элементы.ТекущаяТочкаДействие.Видимость = ЭтоТочкаДействия ИЛИ ЭтоТочкаПроцесса ИЛИ ЭтоТочкаОбработки;
	Элементы.ТекущаяТочкаУсловие.Видимость  = ЭтоТочкаУсловия;
	Элементы.ТекущаяТочкаВыборВарианта.Видимость = ЭтоТочкаВарианта;
	Элементы.ТекущаяТочкаВарианты.Видимость      = ЭтоТочкаВарианта;
	
	Если Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Прочее") Тогда
		Элементы.ТекущаяТочкаПараметрыПроцесса.Видимость = (ЭтоТочкаДействия ИЛИ ЭтоТочкаПроцесса) 
			И Форма.ИспользуютсяПараметрыТочки;
	Иначе	
		Элементы.ТекущаяТочкаПараметрыПроцесса.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаСвойстваТочки.Видимость = НЕ Форма.ЭтоВебКлиент;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваТекущейСтрокиТочекМаршрута(Форма)

	Если НЕ Форма.ТекущаяТочкаМодифицированность Тогда
	     Возврат;	
	КонецЕсли;
	
	НайденныеСтроки = Форма.ТочкиМаршрута.НайтиСтроки(
		Новый Структура("ИдентификаторТочки", Форма.ТекущаяТочкаИдентификатор));
	Если НайденныеСтроки.Количество() > 0 Тогда
		СвойстваТочки = НайденныеСтроки[0];
		СвойстваТочки.Наименование = Форма.ТекущаяТочкаНаименование; 
		СвойстваТочки.ИдентификаторТочки = Форма.ТекущаяТочкаИдентификатор;
		СвойстваТочки.Действие = Форма.ТекущаяТочкаДействие;
		СвойстваТочки.Условие = Форма.ТекущаяТочкаУсловие;
		СвойстваТочки.Модифицированность = Форма.ТекущаяТочкаМодифицированность;
		СвойстваТочки.ВидТочки           = Форма.ТекущаяТочкаВидТочки;
		СвойстваТочки.КодТочки           = Форма.ТекущаяТочкаКодТочки;
		
		СвойстваТочки.ВыборВарианта      = Форма.ТекущаяТочкаВыборВарианта;
		СвойстваТочки.Варианты.Очистить();
		Для каждого ТекущийВариант Из Форма.ТекущаяТочкаВарианты Цикл
			НовыйВариант = СвойстваТочки.Варианты.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйВариант, ТекущийВариант);
		КонецЦикла;
		
		ПараметрыТочки = СвойстваТочки.ПараметрыТочки;
		КопироватьЗначенияПараметров(Форма.Объект.ПараметрыАлгоритма, 
			Форма.ТекущаяТочкаПараметрыПроцесса, ПараметрыТочки);
		Форма.ТекущаяТочкаМодифицированность = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвойстваТекущейТочки(СвойстваТочки)

	ТекущаяТочкаНаименование       = СвойстваТочки.Наименование; 
	ТекущаяТочкаИдентификатор      = СвойстваТочки.ИдентификаторТочки;
	ТекущаяТочкаДействие           = СвойстваТочки.Действие;
	ТекущаяТочкаУсловие            = СвойстваТочки.Условие;
	ТекущаяТочкаМодифицированность = СвойстваТочки.Модифицированность;
	ТекущаяТочкаВидТочки           = СвойстваТочки.ВидТочки;
	ТекущаяТочкаКодТочки           = СвойстваТочки.КодТочки;
	ТекущаяТочкаВыборВарианта      = СвойстваТочки.ВыборВарианта;

	КопироватьЗначенияПараметров(Объект.ПараметрыАлгоритма, 
		СвойстваТочки.ПараметрыТочки, ТекущаяТочкаПараметрыПроцесса);
		
	ТекущаяТочкаВарианты.Очистить();
	Для каждого Вариант Из СвойстваТочки.Варианты Цикл
		НоваяСтрокаВарианта = ТекущаяТочкаВарианты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаВарианта, Вариант);
	КонецЦикла;
	Элементы.ТекущаяТочкаВариантыЗначение.ОграничениеТипа = ОграничениеТипаЗначенийВарианта(СвойстваТочки.ВыборВарианта);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура КопироватьЗначенияПараметров(Шаблон, Источник, Приемник)

	Приемник.Очистить();
	Для каждого ТекущийПараметр Из Шаблон Цикл
		Если НЕ ТекущийПараметр.Динамический Тогда
		     Продолжить;
		КонецЕсли;
	    НоваяСтрока = Приемник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийПараметр);
	    // Используется сканирование таблицы, для того, что бы избежать вызова сервера при обработке на клиенте.
		Для каждого ПараметрТочки Из Источник Цикл
		   Если ПараметрТочки.Имя = ТекущийПараметр.Имя Тогда
		   	    НоваяСтрока.Значение = ТекущийПараметр.Тип.ПривестиЗначение(ПараметрТочки.Значение);
		   КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОграничениеТипаЗначенийВарианта(Знач ВыборВарианта)
	
	Если НЕ ЗначениеЗаполнено(ВыборВарианта) Тогда
		Возврат Новый ОписаниеТипов;
	КонецЕсли;
	
	ОграничениеВыбораВариантов = ВыборВарианта.ОграничениеТипаЗначенийВариантов.Получить();
	Если ОграничениеВыбораВариантов = Неопределено Тогда
		Возврат Новый ОписаниеТипов;
	КонецЕсли;
	
	Возврат ОграничениеВыбораВариантов;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыВыбораТекущаяТочкаДействие(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ПараметрыВыбора = Новый Структура; 	
	Если Форма.ТекущаяТочкаВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Обработка") Тогда
		НазначениеДействия = ПредопределенноеЗначение("Перечисление.бит_НазначенияПользовательскихДействий.Обработка");
	ИначеЕсли Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Визирование") Тогда
		НазначениеДействия = ПредопределенноеЗначение("Перечисление.бит_НазначенияПользовательскихДействий.Визирование");
	ИначеЕсли Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.ИзменениеСтатусовОбъектов") Тогда
		НазначениеДействия = ПредопределенноеЗначение("Перечисление.бит_НазначенияПользовательскихДействий.ИзменениеСтатусовОбъектов");
	ИначеЕсли Объект.ВидАлгоритма = ПредопределенноеЗначение("Перечисление.бит_ВидыАлгоритмов.Прочее") Тогда
		Если Форма.ТекущаяТочкаВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.ПодчиненныйПроцесс") Тогда
			НазначениеДействия = ПредопределенноеЗначение("Перечисление.бит_НазначенияПользовательскихДействий.ПодчиненныйПроцесс");
		Иначе	
			НазначениеДействия = ПредопределенноеЗначение("Перечисление.бит_НазначенияПользовательскихДействий.СозданиеЗадачи");
		КонецЕсли; 
		ПараметрыВыбора.Вставить("Алгоритм", Объект.Ссылка);
	КонецЕсли; 
	
	ПараметрыВыбора.Вставить("Назначение",НазначениеДействия);
	
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элементы.ТекущаяТочкаДействие, ПараметрыВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(КартаМаршрута, Алгоритм, Копирование)

	ИнициацияПараметровИстории();
	
	ОпределитьИспользуютсяПараметрыТочки(ЭтотОбъект);

	Если ТипЗнч(КартаМаршрута) = Тип("ГрафическаяСхема") Тогда
		ГрафическаяСхема = КартаМаршрута;
		ЗаполнитьТочкиМаршрута(Алгоритм, Копирование);
		// Что бы синхронизироваь данные справочника "Точки" и схемы.
		ПриИзмененииГрафическойСхемы(ЭтотОбъект);
		ДобавитьНовуюСхемуВИсторию();
	КонецЕсли;

КонецПроцедуры

// Открывает форму помощника создания точек алгоритма.
// 
&НаКлиенте
Процедура ОткрытьФормуПомощника(ПараметрыФормы)
	
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросОЗаписиЭлементаЗавершение", ЭтотОбъект, ПараметрыФормы);
		Вопрос = РежимДиалогаВопрос.ДаНет;
		Текст = Нстр("ru = 'Для открытия формы помощника необходимо записать документ. Записать?'");
		ПоказатьВопрос(Оповещение, Текст, Вопрос, 0);
	Иначе
		РежимОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		ОткрытьФорму("Справочник.бит_АлгоритмыПроцессов.Форма.ФормаПомощникаВводаАлгоритма",ПараметрыФормы,ЭтотОбъект,,,,,РежимОкна);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик оповещения "ВопросОЗаписиЭлементаЗавершение".
// 
&НаКлиенте
Процедура ВопросОЗаписиЭлементаЗавершение(Ответ, ПараметрыФормы) Экспорт

	Если Ответ = КодВозвратаДиалога.Да
		И Записать() Тогда
		РежимОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;		
		ОткрытьФорму("Справочник.бит_АлгоритмыПроцессов.Форма.ФормаПомощникаВводаАлгоритма",ПараметрыФормы,ЭтотОбъект,,,,,РежимОкна);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИсходящиеТочкиДляПроверкиЗацикливания(ТочкиМаршрута, ТаблицаСвязей, ИдентификаторыТочек)
	
	ИсходящиеТочкиДляПроверкиЗацикливания = Новый ТаблицаЗначений;
	
	ТипТочка = Новый ОписаниеТипов("СправочникСсылка.бит_ТочкиАлгоритмов");
	ИсходящиеТочкиДляПроверкиЗацикливания.Колонки.Добавить("ТочкаМаршрута",  ТипТочка);
	ИсходящиеТочкиДляПроверкиЗацикливания.Колонки.Добавить("ИсходящаяТочка", ТипТочка);
	
	Для каждого СтрокаТаблицы Из ТочкиМаршрута Цикл
		ОтборПоИсточнику = Новый Структура("ЭлементИсточник", СтрокаТаблицы.ИдентификаторТочки);
		НайденныеСвязи   = ТаблицаСвязей.НайтиСтроки(ОтборПоИсточнику);
		Для каждого ЭлементСвязи Из НайденныеСвязи Цикл
			СвойствоИсходящейТочки  = ИдентификаторыТочек.Получить(ЭлементСвязи.ЭлементПриемник);
			Если СвойствоИсходящейТочки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ИсходящиеТочкиДляПроверкиЗацикливания.Добавить();
			НоваяСтрока.ТочкаМаршрута  = СтрокаТаблицы.ТочкаМаршрута;
			НоваяСтрока.ИсходящаяТочка = СвойствоИсходящейТочки.ТочкаМаршрута;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ИсходящиеТочкиДляПроверкиЗацикливания;
	
КонецФункции

#Область РаботаСИсториейИзменений

&НаСервере
Процедура ИнициацияПараметровИстории()
	
	ГлубинаХранения = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ГлубинаХраненияИсторииАлгоритмов");
	
	ПараметрыИстории = Новый Структура;
	ПараметрыИстории.Вставить("ИсторияИзмененийСхемы", Новый Массив);
	ПараметрыИстории.Вставить("УказательТекущейСхемы", 0);
	ПараметрыИстории.Вставить("ГлубинаХранения",       ГлубинаХранения + 1);
	ПараметрыИстории.Вставить("ГраницаСохранения",     0);
	ПараметрыИстории.Вставить("СчетчикСдвига",         0);
	
	АдресПараметровИстории = ПоместитьВоВременноеХранилище(ПараметрыИстории, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ИзмененныеСвойстваТочек()
	
	Если НЕ ТекущаяТочкаМодифицированность Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("ИдентификаторТочки", ТекущаяТочкаИдентификатор);
	НайденыеСтроки  = ТочкиМаршрута.НайтиСтроки(ПараметрыОтбора);
	Если НайденыеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	СвойстваТочки = НайденыеСтроки[0];
	
	ИзмененныеСвойстваТочек = Новый ТаблицаЗначений;
	ИзмененныеСвойстваТочек.Колонки.Добавить("ИдентификаторТочки", Новый ОписаниеТипов("Число",
												Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	ИзмененныеСвойстваТочек.Колонки.Добавить("НаименованиеСвойства");															   
	ИзмененныеСвойстваТочек.Колонки.Добавить("ЗначениеДоИзменения");
	ИзмененныеСвойстваТочек.Колонки.Добавить("ЗначениеПослеИзменения");
	
	Если СвойстваТочки.Наименование <> ТекущаяТочкаНаименование Тогда
		ИзмененноеСвойство = ИзмененныеСвойстваТочек.Добавить();
		ИзмененноеСвойство.ИдентификаторТочки     = ТекущаяТочкаИдентификатор;
		ИзмененноеСвойство.НаименованиеСвойства   = "Наименование";
		ИзмененноеСвойство.ЗначениеДоИзменения    = СвойстваТочки.Наименование;
		ИзмененноеСвойство.ЗначениеПослеИзменения = ТекущаяТочкаНаименование;
	КонецЕсли;
	Если СвойстваТочки.Действие <> ТекущаяТочкаДействие Тогда
		ИзмененноеСвойство = ИзмененныеСвойстваТочек.Добавить();
		ИзмененноеСвойство.ИдентификаторТочки     = ТекущаяТочкаИдентификатор;
		ИзмененноеСвойство.НаименованиеСвойства   = "Действие";
		ИзмененноеСвойство.ЗначениеДоИзменения    = СвойстваТочки.Действие;
		ИзмененноеСвойство.ЗначениеПослеИзменения = ТекущаяТочкаДействие;
	КонецЕсли;
	Если СвойстваТочки.Условие <> ТекущаяТочкаУсловие Тогда
		ИзмененноеСвойство = ИзмененныеСвойстваТочек.Добавить();
		ИзмененноеСвойство.ИдентификаторТочки     = ТекущаяТочкаИдентификатор;
		ИзмененноеСвойство.НаименованиеСвойства   = "Условие";
		ИзмененноеСвойство.ЗначениеДоИзменения    = СвойстваТочки.Условие;
		ИзмененноеСвойство.ЗначениеПослеИзменения = ТекущаяТочкаУсловие;
	КонецЕсли;
	Если СвойстваТочки.КодТочки <> ТекущаяТочкаКодТочки Тогда
		ИзмененноеСвойство = ИзмененныеСвойстваТочек.Добавить();
		ИзмененноеСвойство.ИдентификаторТочки     = ТекущаяТочкаИдентификатор;
		ИзмененноеСвойство.НаименованиеСвойства   = "КодТочки";
		ИзмененноеСвойство.ЗначениеДоИзменения    = СвойстваТочки.КодТочки;
		ИзмененноеСвойство.ЗначениеПослеИзменения = ТекущаяТочкаКодТочки;
	КонецЕсли;
	Если СвойстваТочки.ВыборВарианта <> ТекущаяТочкаВыборВарианта Тогда
		ИзмененноеСвойство = ИзмененныеСвойстваТочек.Добавить();
		ИзмененноеСвойство.ИдентификаторТочки     = ТекущаяТочкаИдентификатор;
		ИзмененноеСвойство.НаименованиеСвойства   = "ВыборВарианта";
		ИзмененноеСвойство.ЗначениеДоИзменения    = СвойстваТочки.ВыборВарианта;
		ИзмененноеСвойство.ЗначениеПослеИзменения = ТекущаяТочкаВыборВарианта;
	КонецЕсли;
	
	Возврат ИзмененныеСвойстваТочек;
	
КонецФункции

&НаСервере
Процедура ДобавитьНовуюСхемуВИсторию()
	
	ПараметрыИстории      = ПолучитьИзВременногоХранилища(АдресПараметровИстории);
	
	ИсторияИзмененийСхемы = ПараметрыИстории.ИсторияИзмененийСхемы;
	ГлубинаХранения       = ПараметрыИстории.ГлубинаХранения;
	ГраницаСохранения     = ПараметрыИстории.ГраницаСохранения;
	УказательТекущейСхемы = ПараметрыИстории.УказательТекущейСхемы;
	
	Если ГлубинаХранения = 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ИсторияИзмененийСхемы.Количество() < ГлубинаХранения Тогда
		ИсторияИзмененийСхемы.Добавить(Неопределено);
	КонецЕсли;
	
	СхемаXDTO = СериализаторXDTO.ЗаписатьXDTO(ГрафическаяСхема);
	СохраняемыеПараметры = Новый Структура;
	СохраняемыеПараметры.Вставить("Схема", СхемаXDTO);
	СохраняемыеПараметры.Вставить("ИзмененныеСвойстваТочек", ИзмененныеСвойстваТочек());
	
	ИсторияИзмененийСхемы[УказательТекущейСхемы] = СохраняемыеПараметры;
	
	УказательТекущейСхемы = УказательТекущейСхемы + 1;
	Если УказательТекущейСхемы = ГлубинаХранения Тогда
		УказательТекущейСхемы = 0;
	КонецЕсли;
	
	Если УказательТекущейСхемы = ГраницаСохранения Тогда
		ГраницаСохранения = ГраницаСохранения + 1;
	КонецЕсли;
	
	Если ГраницаСохранения = ГлубинаХранения Тогда
		ГраницаСохранения = 0;
	КонецЕсли;
	
	Если ИсторияИзмененийСхемы.Количество() > 1 Тогда
		Элементы.ГрафическаяСхемаИсторияОтменитьИзменение.Доступность = Истина;
	КонецЕсли;
	Элементы.ГрафическаяСхемаИсторияВернутьИзменение.Доступность = Ложь;
	
	ПараметрыИстории.УказательТекущейСхемы = УказательТекущейСхемы;
	ПараметрыИстории.ГраницаСохранения     = ГраницаСохранения;
	ПараметрыИстории.СчетчикСдвига         = 0;
	
	ПоместитьВоВременноеХранилище(ПараметрыИстории, АдресПараметровИстории);
	
КонецПроцедуры

&НаСервере
Процедура ИсторияОтменитьИзменениеНаСервере()
	
	ПараметрыИстории      = ПолучитьИзВременногоХранилища(АдресПараметровИстории);
	
	ИсторияИзмененийСхемы      = ПараметрыИстории.ИсторияИзмененийСхемы;
	ГлубинаХранения            = ПараметрыИстории.ГлубинаХранения;
	ГраницаСохранения          = ПараметрыИстории.ГраницаСохранения;
	УказательТекущейСхемы      = ПараметрыИстории.УказательТекущейСхемы;
	СчетчикСдвига              = ПараметрыИстории.СчетчикСдвига;
	
	УказательТекущейСхемы = УказательТекущейСхемы - 1;
	Если УказательТекущейСхемы < 0 Тогда
		УказательТекущейСхемы = ГлубинаХранения - 1;
	КонецЕсли;
	
	ИндексИзвлекаемогоЭлемента = УказательТекущейСхемы - 1;
	Если ИндексИзвлекаемогоЭлемента < 0 Тогда
		ИндексИзвлекаемогоЭлемента = ГлубинаХранения - 1;
	КонецЕсли;
	
	СохраняемыеПараметры = ИсторияИзмененийСхемы[ИндексИзвлекаемогоЭлемента];
	ГрафическаяСхема     = СериализаторXDTO.ПрочитатьXDTO(СохраняемыеПараметры.Схема);
	
	// Измененные свойства точек хранятся в элементе массива, на котором выполнялись преобразования.
	ИзмененныеСвойстваТочек = ИсторияИзмененийСхемы[УказательТекущейСхемы].ИзмененныеСвойстваТочек;
	Если ИзмененныеСвойстваТочек <> Неопределено Тогда
		Для каждого ИзмененноеСвойство Из ИзмененныеСвойстваТочек Цикл
			ПараметрыОтбора = Новый Структура("ИдентификаторТочки", ИзмененноеСвойство.ИдентификаторТочки);
			НайденыеСтроки  = ТочкиМаршрута.НайтиСтроки(ПараметрыОтбора);
			Если НайденыеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СвойстваТочки = НайденыеСтроки[0];
			ЭтоСвойстваТекущейТочки = (ТекущаяТочкаИдентификатор = ИзмененноеСвойство.ИдентификаторТочки);
			Если ИзмененноеСвойство.НаименованиеСвойства = "Наименование" Тогда
				СвойстваТочки.Наименование = ИзмененноеСвойство.ЗначениеДоИзменения;
				Если ЭтоСвойстваТекущейТочки Тогда
					ТекущаяТочкаНаименование = ИзмененноеСвойство.ЗначениеДоИзменения;
				КонецЕсли;
			ИначеЕсли ИзмененноеСвойство.НаименованиеСвойства = "Действие" Тогда
				СвойстваТочки.Действие = ИзмененноеСвойство.ЗначениеДоИзменения;
				Если ЭтоСвойстваТекущейТочки Тогда
					ТекущаяТочкаДействие = ИзмененноеСвойство.ЗначениеДоИзменения;
				КонецЕсли;
			ИначеЕсли ИзмененноеСвойство.НаименованиеСвойства = "Условие" Тогда
				СвойстваТочки.Условие = ИзмененноеСвойство.ЗначениеДоИзменения;
				Если ЭтоСвойстваТекущейТочки Тогда
					ТекущаяТочкаУсловие = ИзмененноеСвойство.ЗначениеДоИзменения;
				КонецЕсли;
			ИначеЕсли ИзмененноеСвойство.НаименованиеСвойства = "КодТочки" Тогда
				СвойстваТочки.КодТочки = ИзмененноеСвойство.ЗначениеДоИзменения;
				Если ЭтоСвойстваТекущейТочки Тогда
					ТекущаяТочкаКодТочки = ИзмененноеСвойство.ЗначениеДоИзменения;
				КонецЕсли;
			ИначеЕсли ИзмененноеСвойство.НаименованиеСвойства = "ВыборВарианта" Тогда
				СвойстваТочки.ВыборВарианта = ИзмененноеСвойство.ЗначениеДоИзменения;
				Если ЭтоСвойстваТекущейТочки Тогда
					ТекущаяТочкаВыборВарианта = ИзмененноеСвойство.ЗначениеДоИзменения;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	СчетчикСдвига        = СчетчикСдвига + 1;
	
	Элементы.ГрафическаяСхемаИсторияВернутьИзменение.Доступность = Истина;
	Если УказательТекущейСхемы = (ГраницаСохранения + 1) Тогда
		Элементы.ГрафическаяСхемаИсторияОтменитьИзменение.Доступность = Ложь;
	КонецЕсли;
	
	ПараметрыИстории.УказательТекущейСхемы = УказательТекущейСхемы;
	ПараметрыИстории.СчетчикСдвига         = СчетчикСдвига;
	
	ПоместитьВоВременноеХранилище(ПараметрыИстории, АдресПараметровИстории);
	
	УстановитьСвойстваТекущейСтрокиТочекМаршрута(ЭтотОбъект);
	ПриИзмененииГрафическойСхемы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИсторияВернутьИзменениеНаСервере()
	
	ПараметрыИстории      = ПолучитьИзВременногоХранилища(АдресПараметровИстории);
	
	ИсторияИзмененийСхемы = ПараметрыИстории.ИсторияИзмененийСхемы;
	ГлубинаХранения       = ПараметрыИстории.ГлубинаХранения;
	ГраницаСохранения     = ПараметрыИстории.ГраницаСохранения;
	УказательТекущейСхемы = ПараметрыИстории.УказательТекущейСхемы;
	СчетчикСдвига         = ПараметрыИстории.СчетчикСдвига;
	
	УказательТекущейСхемы = УказательТекущейСхемы + 1;
	Если УказательТекущейСхемы = ГлубинаХранения Тогда
		УказательТекущейСхемы = 0;
	КонецЕсли;
	
	ИндексИзвлекаемогоЭлемента = УказательТекущейСхемы - 1;
	Если ИндексИзвлекаемогоЭлемента < 0 Тогда
		ИндексИзвлекаемогоЭлемента = ГлубинаХранения - 1;
	КонецЕсли;
	
	СохраняемыеПараметры = ИсторияИзмененийСхемы[ИндексИзвлекаемогоЭлемента];
	ГрафическаяСхема     = СериализаторXDTO.ПрочитатьXDTO(СохраняемыеПараметры.Схема);
	Если СохраняемыеПараметры.ИзмененныеСвойстваТочек <> Неопределено Тогда
		Для каждого ИзмененноеСвойство Из СохраняемыеПараметры.ИзмененныеСвойстваТочек Цикл
			ПараметрыОтбора = Новый Структура("ИдентификаторТочки", ИзмененноеСвойство.ИдентификаторТочки);
			НайденыеСтроки  = ТочкиМаршрута.НайтиСтроки(ПараметрыОтбора);
			Если НайденыеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СвойстваТочки = НайденыеСтроки[0];
			ЭтоСвойстваТекущейТочки = (ТекущаяТочкаИдентификатор = ИзмененноеСвойство.ИдентификаторТочки);
			Если ИзмененноеСвойство.НаименованиеСвойства = "Наименование" Тогда
				СвойстваТочки.Наименование = ИзмененноеСвойство.ЗначениеПослеИзменения;
				Если ЭтоСвойстваТекущейТочки Тогда
					ТекущаяТочкаНаименование = ИзмененноеСвойство.ЗначениеПослеИзменения;
				КонецЕсли;
			ИначеЕсли ИзмененноеСвойство.НаименованиеСвойства = "Действие" Тогда
				СвойстваТочки.Действие = ИзмененноеСвойство.ЗначениеПослеИзменения;
				Если ЭтоСвойстваТекущейТочки Тогда
					ТекущаяТочкаДействие = ИзмененноеСвойство.ЗначениеПослеИзменения;
				КонецЕсли;
			ИначеЕсли ИзмененноеСвойство.НаименованиеСвойства = "Условие" Тогда
				СвойстваТочки.Условие = ИзмененноеСвойство.ЗначениеПослеИзменения;
				Если ЭтоСвойстваТекущейТочки Тогда
					ТекущаяТочкаУсловие = ИзмененноеСвойство.ЗначениеПослеИзменения;
				КонецЕсли;
			ИначеЕсли ИзмененноеСвойство.НаименованиеСвойства = "КодТочки" Тогда
				СвойстваТочки.КодТочки = ИзмененноеСвойство.ЗначениеПослеИзменения;
				Если ЭтоСвойстваТекущейТочки Тогда
					ТекущаяТочкаКодТочки = ИзмененноеСвойство.ЗначениеПослеИзменения;
				КонецЕсли;
			ИначеЕсли ИзмененноеСвойство.НаименованиеСвойства = "ВыборВарианта" Тогда
				СвойстваТочки.ВыборВарианта = ИзмененноеСвойство.ЗначениеДоИзменения;
				Если ЭтоСвойстваТекущейТочки Тогда
					ТекущаяТочкаВыборВарианта = ИзмененноеСвойство.ЗначениеДоИзменения;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	СчетчикСдвига        = СчетчикСдвига - 1;
	
	Если СчетчикСдвига = 0 Тогда
		Элементы.ГрафическаяСхемаИсторияВернутьИзменение.Доступность = Ложь;
	КонецЕсли;
	Элементы.ГрафическаяСхемаИсторияОтменитьИзменение.Доступность = Истина;
	
	ПараметрыИстории.УказательТекущейСхемы = УказательТекущейСхемы;
	ПараметрыИстории.СчетчикСдвига         = СчетчикСдвига;
	
	ПоместитьВоВременноеХранилище(ПараметрыИстории, АдресПараметровИстории);
	
	УстановитьСвойстваТекущейСтрокиТочекМаршрута(ЭтотОбъект);
	ПриИзмененииГрафическойСхемы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаПомощникомСозданияТочек

&НаСервере
Процедура СоздатьТочкиВыбранныеВПомощнике(Знач АдресХранищаРезультатаВыбора)
	
	ПараметрыВводаТочек      = ПолучитьИзВременногоХранилища(АдресХранищаРезультатаВыбора);
	КодТекущейТочки          = ПараметрыВводаТочек.КодТекущейТочки;
	ПользовательскоеДействие = ПараметрыВводаТочек.Действие;
	ТаблицаТочек             = ПараметрыВводаТочек.ТаблицаТочек;
	
	ЭлементыПоИдентификаторам = Новый Соответствие;
	ПараметрыРазмещения       = бит_ГрафическиеСхемы.НовыеПараметрыРазмещенияЭлементовСхемы();
	ТаблицаСвязей             = бит_ГрафическиеСхемы.НоваяТаблицаСвязейЭлементовГрафическойСхемы();
	СхемаXDTO                 = СериализаторXDTO.ЗаписатьXDTO(ГрафическаяСхема);
	ЭлементыСхемы             = СхемаXDTO.item;	
	
	СчетчикИндекс          = 0;
	ЭлементРодитель        = Неопределено;
	Для каждого ЭлементСхемы Из ЭлементыСхемы Цикл
		СчетчикИндекс = Макс(ЭлементСхемы.itemId, СчетчикИндекс);
		ЭлементыПоИдентификаторам.Вставить(ЭлементСхемы.itemId, ЭлементСхемы);
		Если КодТекущейТочки = ЭлементСхемы.itemCode Тогда
			ЭлементРодитель = ЭлементСхемы;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементРодитель = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось определить текущий элемент схемы.';
								|en = 'Cant match current cheme element.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИсходящаяЛинияРодителя = Неопределено;
	ТочкаПродолжения       = Неопределено;
	Для каждого ЭлементСхемы Из ЭлементыСхемы Цикл
		ТипЭлемента = бит_ГрафическиеСхемы.ТипЭлементаXDTOГрафическойСхемы(ЭлементСхемы);
		Если ТипЭлемента <> Перечисления.бит_ЭлементыГрафическойСхемы.Линия Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементСхемы.connectFromItemId = ЭлементРодитель.itemId Тогда
			ИсходящаяЛинияРодителя = ЭлементСхемы;
			ТочкаПродолжения       = ЭлементыПоИдентификаторам.Получить(ИсходящаяЛинияРодителя.connectToItemId);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СчетчикИндекс = СчетчикИндекс + 1;
	
	ТочкаРазделения   = бит_ГрафическиеСхемы.НовыйЭлементСхемы(Перечисления.бит_ЭлементыГрафическойСхемы.Разделение,
																СчетчикИндекс);
	ЭлементыПоИдентификаторам.Вставить(СчетчикИндекс, ТочкаРазделения);
	СчетчикИндекс     = СчетчикИндекс + 1;
	ГраницыРазмещения = бит_ГрафическиеСхемы.ГраницыРазмещенияЭлементаСхемы(ПараметрыРазмещения, 2, 1);
	бит_ГрафическиеСхемы.РазместитьЭлементНаСхеме(ТочкаРазделения, ГраницыРазмещения, ПараметрыРазмещения);
	ЭлементыСхемы.Добавить(ТочкаРазделения);
	ДобавитьТочкуМаршрута(ТочкаРазделения);
	
	СоединительнаяЛиния = бит_ГрафическиеСхемы.НовыйЭлементСхемы(Перечисления.бит_ЭлементыГрафическойСхемы.Линия,
																СчетчикИндекс);
	ЭлементыПоИдентификаторам.Вставить(СчетчикИндекс, СоединительнаяЛиния);
	СчетчикИндекс       = СчетчикИндекс + 1;
	ЭлементыСхемы.Добавить(СоединительнаяЛиния);
	бит_ГрафическиеСхемы.УстановитьПривязкуСоединительнойЛинии(СоединительнаяЛиния, ТаблицаСвязей, ЭлементРодитель,
																ТочкаРазделения);
	
	ТочкаСлияния      = бит_ГрафическиеСхемы.НовыйЭлементСхемы(Перечисления.бит_ЭлементыГрафическойСхемы.Слияние,
																СчетчикИндекс);
	ЭлементыПоИдентификаторам.Вставить(СчетчикИндекс, ТочкаСлияния);
	СчетчикИндекс     = СчетчикИндекс + 1;
	ГраницыРазмещения = бит_ГрафическиеСхемы.ГраницыРазмещенияЭлементаСхемы(ПараметрыРазмещения, 4, 1);
	бит_ГрафическиеСхемы.РазместитьЭлементНаСхеме(ТочкаСлияния, ГраницыРазмещения, ПараметрыРазмещения);
	ЭлементыСхемы.Добавить(ТочкаСлияния);
	ДобавитьТочкуМаршрута(ТочкаСлияния);
	
	ИменаДоступныхПараметров = Новый СписокЗначений;
	Для каждого КолонкаТаблицы Из ТаблицаТочек.Колонки Цикл
		ИменаДоступныхПараметров.Добавить(КолонкаТаблицы.Имя);
	КонецЦикла;
	
	ВидДобавляемыхДействий = Перечисления.бит_ЭлементыГрафическойСхемы.Действие;
	Если ЗначениеЗаполнено(ПользовательскоеДействие)
		И (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПользовательскоеДействие, "Назначение")
			= Перечисления.бит_НазначенияПользовательскихДействий.ПодчиненныйПроцесс) Тогда
		ВидДобавляемыхДействий = Перечисления.бит_ЭлементыГрафическойСхемы.ВложенныйПроцесс;
	КонецЕсли;
	
	НомерДобавляемого = 1;
	Для каждого СтрокаТабличцыТочек Из ТаблицаТочек Цикл
		НовыйЭлемент      = бит_ГрафическиеСхемы.НовыйЭлементСхемы(ВидДобавляемыхДействий, СчетчикИндекс);
		ЭлементыПоИдентификаторам.Вставить(СчетчикИндекс, НовыйЭлемент);
		СчетчикИндекс     = СчетчикИндекс + 1;
		ГраницыРазмещения = бит_ГрафическиеСхемы.ГраницыРазмещенияЭлементаСхемы(ПараметрыРазмещения, 3, НомерДобавляемого);
		бит_ГрафическиеСхемы.РазместитьЭлементНаСхеме(НовыйЭлемент, ГраницыРазмещения, ПараметрыРазмещения);
		ЭлементыСхемы.Добавить(НовыйЭлемент);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ПользовательскоеДействие", ПользовательскоеДействие);
		СтруктураПараметров.Вставить("ИменаДоступныхПараметров", ИменаДоступныхПараметров);
		СтруктураПараметров.Вставить("СтрокаТабличцыТочек",      СтрокаТабличцыТочек);
		ДобавитьТочкуМаршрута(НовыйЭлемент, СтруктураПараметров);
		
		СоединительнаяЛиния = бит_ГрафическиеСхемы.НовыйЭлементСхемы(Перечисления.бит_ЭлементыГрафическойСхемы.Линия,
																	СчетчикИндекс);
		ЭлементыПоИдентификаторам.Вставить(СчетчикИндекс, СоединительнаяЛиния);
		СчетчикИндекс       = СчетчикИндекс + 1;
		ЭлементыСхемы.Добавить(СоединительнаяЛиния);
		бит_ГрафическиеСхемы.УстановитьПривязкуСоединительнойЛинии(СоединительнаяЛиния, ТаблицаСвязей, ТочкаРазделения,
																	НовыйЭлемент);
		
		СоединительнаяЛиния = бит_ГрафическиеСхемы.НовыйЭлементСхемы(Перечисления.бит_ЭлементыГрафическойСхемы.Линия,
																	СчетчикИндекс);
		ЭлементыПоИдентификаторам.Вставить(СчетчикИндекс, СоединительнаяЛиния);
		СчетчикИндекс       = СчетчикИндекс + 1;
		ЭлементыСхемы.Добавить(СоединительнаяЛиния);
		бит_ГрафическиеСхемы.УстановитьПривязкуСоединительнойЛинии(СоединительнаяЛиния, ТаблицаСвязей, НовыйЭлемент, ТочкаСлияния);
		
		НомерДобавляемого = НомерДобавляемого + 1;
	КонецЦикла;
	
	Если ИсходящаяЛинияРодителя <> Неопределено Тогда
		бит_ГрафическиеСхемы.УстановитьПривязкуСоединительнойЛинии(ИсходящаяЛинияРодителя, ТаблицаСвязей, ТочкаСлияния,
																ТочкаПродолжения);
	Иначе														
		СоединительнаяЛиния = бит_ГрафическиеСхемы.НовыйЭлементСхемы(Перечисления.бит_ЭлементыГрафическойСхемы.Линия,
																		СчетчикИндекс);
		ЭлементыПоИдентификаторам.Вставить(СчетчикИндекс, СоединительнаяЛиния);
		СчетчикИндекс       = СчетчикИндекс + 1;
		ЭлементыСхемы.Добавить(СоединительнаяЛиния);
		бит_ГрафическиеСхемы.УстановитьПривязкуСоединительнойЛинии(СоединительнаяЛиния, ТаблицаСвязей, ТочкаСлияния);
	КонецЕсли;
	
	ПараметрыРазмещения.МенятьГраниСоединенияЛиний = Ложь;
	бит_ГрафическиеСхемы.РазместитьЛинииСвязей(ТаблицаСвязей, ЭлементыПоИдентификаторам, ПараметрыРазмещения);
	ПараметрыРазмещения.МенятьГраниСоединенияЛиний = Истина;
	
	ГрафическаяСхема = СериализаторXDTO.ПрочитатьXDTO(СхемаXDTO);
	
	АвторазмещениеЭлементовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТочкуМаршрута(НоваяТочкаМаршрута, СтруктураПараметров = Неопределено)
	
	ВидыЭлементов = бит_УправлениеПроцессами.ВидыЭлементовГрафическойСхемы();
	ВидТочки      = ВидыЭлементов[НоваяТочкаМаршрута.itemType];
	
	СтрокаТаблицы = ТочкиМаршрута.Добавить();
	СтрокаТаблицы.ВидТочки           = ВидТочки;
	СтрокаТаблицы.ИдентификаторТочки = НоваяТочкаМаршрута.itemId;
	СтрокаТаблицы.Наименование       = НоваяТочкаМаршрута.itemTitle.item[0].content;
	СтрокаТаблицы.КодТочки           = НоваяТочкаМаршрута.itemCode;
	СтрокаТаблицы.Модифицированность = Истина;
	СтрокаТаблицы.НоваяТочка         = Истина;
	
	Если ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Действие
		ИЛИ ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Обработка
		ИЛИ ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.ПодчиненныйПроцесс Тогда
		СтрокаТаблицы.Действие = СтруктураПараметров.ПользовательскоеДействие;
		
		ПредставлениеТочки = Строка(СтрокаТаблицы.Действие);
		Для каждого ТекущийПараметр Из Объект.ПараметрыАлгоритма Цикл
			Если НЕ ТекущийПараметр.Динамический Тогда
				Продолжить;
			КонецЕсли;
			НовыйПараметрТочки = СтрокаТаблицы.ПараметрыТочки.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйПараметрТочки, ТекущийПараметр);
			
			Если СтруктураПараметров.ИменаДоступныхПараметров.НайтиПоЗначению(НовыйПараметрТочки.Имя) <> Неопределено Тогда
				ЗначениеПараметра = СтруктураПараметров.СтрокаТабличцыТочек[НовыйПараметрТочки.Имя];
				НовыйПараметрТочки.Значение = НовыйПараметрТочки.Тип.ПривестиЗначение(ЗначениеПараметра);
				
				ПредставлениеПараметра = Строка(НовыйПараметрТочки.Значение);
				Если НЕ ПустаяСтрока(ПредставлениеПараметра) Тогда
					ПредставлениеТочки = ПредставлениеТочки + ". " + СокрЛП(ПредставлениеПараметра);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		СтрокаТаблицы.Наименование = ПредставлениеТочки;
		НоваяТочкаМаршрута.itemTitle.item[0].content =  ПредставлениеТочки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПроверитьИспользованиеАлгоритма(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеДопИнформацией();
	
	Если РазрешенаЗаписьИспользуемогоАлгоритма Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ТочкиМаршрутаКУдалению.Количество() = 0
		ИЛИ НЕ АлгоритмИспользуется Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ТекстОшибки = НСтр("ru='Алгоритм используется. Удаление точек может вызвать несоответствие списка виз карте маршрута. Принять риски и продолжить?'");
	Оповещение  = Новый ОписаниеОповещения("ВопросРазренитьЗаписьИспользуемогоАлгоритмаЗавершение", ЭтотОбъект);
	Вопрос      = РежимДиалогаВопрос.ДаНет;
	ПоказатьВопрос(Оповещение, ТекстОшибки, Вопрос, 0);
	
КонецПроцедуры

// Процедура - обработчик оповещения "ВопросРазренитьЗаписьИспользуемогоАлгоритмаЗавершение".
// 
&НаКлиенте
Процедура ВопросРазренитьЗаписьИспользуемогоАлгоритмаЗавершение(Ответ, Параметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РазрешенаЗаписьИспользуемогоАлгоритма = Истина;
	Записать();
	
КонецПроцедуры

#КонецОбласти 