
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БыстрыйСтарт = Обработки.бит_БыстрыйСтартБюджетирование.ПолучитьМакет("БыстрыйСтарт").ПолучитьТекст();
	ЗаполнениеНСИ = Обработки.бит_БыстрыйСтартБюджетирование.ПолучитьМакет("ЗаполнениеНСИ").ПолучитьТекст();
	БюджетныйПроцесс = Обработки.бит_БыстрыйСтартБюджетирование.ПолучитьМакет("БюджетныйПроцесс").ПолучитьТекст();
	СборФакта = Обработки.бит_БыстрыйСтартБюджетирование.ПолучитьМакет("СборФакта").ПолучитьТекст();
	РазграничениеДоступа = Обработки.бит_БыстрыйСтартБюджетирование.ПолучитьМакет("РазграничениеДоступа").ПолучитьТекст();
	АнализДанных = Обработки.бит_БыстрыйСтартБюджетирование.ПолучитьМакет("АнализДанных").ПолучитьТекст();
	
	Страницы = Новый Структура;
	Страницы.Вставить("ЗаполнениеНСИ",			ЗаполнениеНСИ);
	Страницы.Вставить("БюджетныйПроцесс",		БюджетныйПроцесс);
	Страницы.Вставить("СборФакта",				СборФакта);
	Страницы.Вставить("РазграничениеДоступа",	РазграничениеДоступа);
	Страницы.Вставить("АнализДанных",			АнализДанных);
	Страницы.Вставить("БыстрыйСтарт",			БыстрыйСтарт);	
	
	Руководство = Страницы.БыстрыйСтарт;
	ПодготовитьФорму();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СправкаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		Возврат;
	КонецЕсли;
	Попытка
		ЧастиПути = СтрРазделить(ДанныеСобытия.Href, "/", Ложь);
		Ссылка = ЧастиПути[ЧастиПути.ВГраница()];
		Если СтрНайти(Ссылка, "Навигация") Тогда
			Переход(Ссылка);
		Иначе
			НавигационнаяСсылкаОбъекта = Неопределено;
			Если НавигационныеСсылки.Свойство(Ссылка, НавигационнаяСсылкаОбъекта) 
				И ЗначениеЗаполнено(НавигационнаяСсылкаОбъекта) Тогда
				ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаОбъекта);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ТекстОшибки = НСтр("ru = 'Объект не найден.'; en = 'Object not found.'");
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
&НаСервере
Процедура ПодготовитьФорму()
	
	// Готовим структуру из метаданных, чтобы проверка конфигурации реагировала на изменения.
	ОбъектыПодсистемы = Новый Структура;
	
	// Справочники.
	ОбъектыПодсистемы.Вставить("СтатьиОборотов",                      Метаданные.Справочники.бит_СтатьиОборотов);
	ОбъектыПодсистемы.Вставить("Подразделения",                       Метаданные.Справочники.Подразделения);
	ОбъектыПодсистемы.Вставить("СценарииПланирования",                Метаданные.Справочники.СценарииПланирования);
	ОбъектыПодсистемы.Вставить("Валюты",                              Метаданные.Справочники.Валюты);
	ОбъектыПодсистемы.Вставить("Бюджеты",                             Метаданные.Справочники.бит_Бюджеты);
	ОбъектыПодсистемы.Вставить("НастройкиФормВводаБюджета",           Метаданные.Справочники.бит_НастройкиФормВводаБюджета);
	ОбъектыПодсистемы.Вставить("АлгоритмыПроцессов",                  Метаданные.Справочники.бит_АлгоритмыПроцессов);
	ОбъектыПодсистемы.Вставить("Оповещения",                          Метаданные.Справочники.бит_фн_Оповещения);
	ОбъектыПодсистемы.Вставить("ШаблоныСообщений",                    Метаданные.Справочники.бит_фн_ШаблоныСообщений);
	ОбъектыПодсистемы.Вставить("НастройкиДоставкиОповещений",         Метаданные.Справочники.бит_фн_НастройкиДоставкиОповещений);
	ОбъектыПодсистемы.Вставить("ПравилаЗаполненияПолейПриТрансляции", Метаданные.Справочники.бит_ПравилаЗаполненияПолейПриТрансляции);
	ОбъектыПодсистемы.Вставить("ПравилаТрансляции",                   Метаданные.Справочники.бит_ПравилаТрансляции);
	ОбъектыПодсистемы.Вставить("Запросы",                             Метаданные.Справочники.бит_Запросы);
	ОбъектыПодсистемы.Вставить("ИсточникиДанных",                     Метаданные.Справочники.бит_ИсточникиДанных);
	ОбъектыПодсистемы.Вставить("ВидыСоответствийАналитик",            Метаданные.Справочники.бит_ВидыСоответствийАналитик);
	ОбъектыПодсистемы.Вставить("Пользователи",                        Метаданные.Справочники.Пользователи);
	ОбъектыПодсистемы.Вставить("ПрофилиГруппДоступа",                 Метаданные.Справочники.ПрофилиГруппДоступа);
	ОбъектыПодсистемы.Вставить("ОбъектыСистемы",                      Метаданные.Справочники.бит_ОбъектыСистемы);
	ОбъектыПодсистемы.Вставить("ГруппыОбъектовСистемы",               Метаданные.Справочники.бит_ГруппыОбъектовСистемы);
	ОбъектыПодсистемы.Вставить("ШаблоныПравДоступа",                  Метаданные.Справочники.бит_ШаблоныПравДоступа);
	
	// Документы.
	ОбъектыПодсистемы.Вставить("УстановкаЗависимыхОборотов",              Метаданные.Документы.бит_УстановкаЗависимыхОборотов);
	ОбъектыПодсистемы.Вставить("УстановкаЗначенийПроизвольныхПараметров", Метаданные.Документы.бит_УстановкаЗначенийПроизвольныхПараметров);
	ОбъектыПодсистемы.Вставить("НазначениеПравилТрансляции",              Метаданные.Документы.бит_НазначениеПравилТрансляции);
	ОбъектыПодсистемы.Вставить("ПолучениеФактическихДанных",              Метаданные.Документы.бит_ПолучениеФактическихДанных);

	// Регистры сведений.
	ОбъектыПодсистемы.Вставить("НазначениеДополнительныхИзмерений",       Метаданные.РегистрыСведений.бит_НазначениеДополнительныхИзмерений);
	ОбъектыПодсистемы.Вставить("НазначениеАлгоритмов",                    Метаданные.РегистрыСведений.бит_НазначениеАлгоритмов);
	ОбъектыПодсистемы.Вставить("ПраваУстановкиВиз",                       Метаданные.РегистрыСведений.бит_ПраваУстановкиВиз);
	ОбъектыПодсистемы.Вставить("НазначениеПравилЗаполненияПриТрансляции", Метаданные.РегистрыСведений.бит_НазначениеПравилЗаполненияПриТрансляции);
	ОбъектыПодсистемы.Вставить("НазначениеОповещений",                    Метаданные.РегистрыСведений.бит_фн_НазначениеОповещений);
	ОбъектыПодсистемы.Вставить("СоответствияАналитик",                    Метаданные.РегистрыСведений.бит_СоответствияАналитик);
	
	// Обработки.
	ОбъектыПодсистемы.Вставить("РегламентныеИФоновыеЗадания",             Метаданные.Обработки.РегламентныеИФоновыеЗадания);
	ОбъектыПодсистемы.Вставить("НастройкаПравДоступа",                    Метаданные.Обработки.бит_НастройкаПравДоступа);

	// Отчеты.
   	ОбъектыПодсистемы.Вставить("ПроизвольныйОтчет",                    Метаданные.Отчеты.бит_ПроизвольныйОтчет);
  	ОбъектыПодсистемы.Вставить("УниверсальныйОтчетПоИсточникамДанных", Метаданные.Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных);
 	ОбъектыПодсистемы.Вставить("ОтчетПоСпособамКомпоновкиИсточников",  Метаданные.Отчеты.бит_ОтчетПоСпособамКомпоновкиИсточников);
	
	// Общие формы.
	ОбъектыПодсистемы.Вставить("Константы",          Метаданные.ОбщиеФормы.бит_Константы);
	ОбъектыПодсистемы.Вставить("НастройкиПрограммы", Метаданные.ОбщиеФормы.бит_НастройкиПрограммы);
	
	// Формирование навигационных ссылок и проверка доступа по функциональным опциям.
	НедоступныеОбъекты = Новый Массив;
	Для Каждого ОбъектПодсистемы Из ОбъектыПодсистемы Цикл
		НавигационнаяСсылкаОбъекта = ""; 
		ОбъектДоступен = ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОбъектПодсистемы.Значение);
		Если ОбъектДоступен Тогда
			Если ОбъектПодсистемы.Значение = Метаданные.ОбщиеФормы.бит_Константы Тогда
				НавигационнаяСсылкаОбъекта = "e1cib/app/ОбщаяФорма.бит_Константы";
			ИначеЕсли ОбъектПодсистемы.Значение = Метаданные.ОбщиеФормы.бит_НастройкиПрограммы Тогда
				НавигационнаяСсылкаОбъекта = "e1cib/app/ОбщаяФорма.бит_НастройкиПрограммы";
			Иначе	
				НавигационнаяСсылкаОбъекта = ПолучитьНавигационнуюСсылку(ОбъектПодсистемы.Значение);
			КонецЕсли;
		Иначе
			НедоступныеОбъекты.Добавить(ОбъектПодсистемы.Ключ);	
		КонецЕсли;
		ОбъектыПодсистемы[ОбъектПодсистемы.Ключ] = НавигационнаяСсылкаОбъекта;
	КонецЦикла;
	
	НавигационныеСсылки = Новый ФиксированнаяСтруктура(ОбъектыПодсистемы);
	
КонецПроцедуры

&НаКлиенте
Процедура Переход(Ссылка) 
	
	Если СтрСравнить(Ссылка, "НавигацияЗаполнениеНСИ") = 0 Тогда
		Руководство = Страницы.ЗаполнениеНСИ;
	ИначеЕсли СтрСравнить(Ссылка, "НавигацияБюджетныйПроцесс") = 0 Тогда
		Руководство = Страницы.БюджетныйПроцесс;
	ИначеЕсли СтрСравнить(Ссылка, "НавигацияСборФакта") = 0 Тогда
		Руководство = Страницы.СборФакта;
	ИначеЕсли СтрСравнить(Ссылка, "НавигацияРазграничениеДоступа") = 0 Тогда
		Руководство = Страницы.РазграничениеДоступа;
	ИначеЕсли СтрСравнить(Ссылка, "НавигацияАнализДанных") = 0 Тогда
		Руководство = Страницы.АнализДанных;
	ИначеЕсли СтрСравнить(Ссылка, "НавигацияБыстрыйСтарт") = 0 Тогда
		Руководство = Страницы.БыстрыйСтарт;
	ИначеЕсли СтрСравнить(Ссылка, "НавигацияОборотыБюджета") = 0 Тогда
		ПараметрыПередачи = бит_ОтчетыКлиент.ПараметрыПереходаКНовомуОтчету(); 
		ПараметрыПередачи.ИмяОтчета    = "бит_ОборотыБюджета";
		ПараметрыПередачи.КлючВарианта = "ОборотыБюджета";
		бит_ОтчетыКлиент.ОткрытьНовуюРедакциюОтчета(ПараметрыПередачи.ИмяОтчета, ПараметрыПередачи.КлючВарианта)	
	ИначеЕсли СтрСравнить(Ссылка, "НавигацияОборотыБюджетаСРасчетами") = 0 Тогда
		ПараметрыПередачи = бит_ОтчетыКлиент.ПараметрыПереходаКНовомуОтчету(); 
		ПараметрыПередачи.ИмяОтчета    = "бит_ОборотыБюджетаСРасчетами";
		ПараметрыПередачи.КлючВарианта = "ОборотыБюджетаСРасчетами";
		бит_ОтчетыКлиент.ОткрытьНовуюРедакциюОтчета(ПараметрыПередачи.ИмяОтчета, ПараметрыПередачи.КлючВарианта);
	ИначеЕсли СтрСравнить(Ссылка, "НавигацияОтчетПоБюджету_ОстаткиПоСчетам") = 0 Тогда
		ПараметрыПередачи = бит_ОтчетыКлиент.ПараметрыПереходаКНовомуОтчету(); 
		ПараметрыПередачи.ИмяОтчета    = "бит_ОборотыБюджетаИОстаткиПоСчетам";
		ПараметрыПередачи.КлючВарианта = "бит_ОтчетПоБюджету_ОстаткиПоСчетам";
		бит_ОтчетыКлиент.ОткрытьНовуюРедакциюОтчета(ПараметрыПередачи.ИмяОтчета, ПараметрыПередачи.КлючВарианта)	
	ИначеЕсли СтрСравнить(Ссылка, "НавигацияПрогнозИсполненияБюджета") = 0 Тогда
		ПараметрыПередачи = бит_ОтчетыКлиент.ПараметрыПереходаКНовомуОтчету(); 
		ПараметрыПередачи.ИмяОтчета    = "бит_ПрогнозИсполненияБюджета";
		ПараметрыПередачи.КлючВарианта = "ПрогнозИсполненияБюджета";
		бит_ОтчетыКлиент.ОткрытьНовуюРедакциюОтчета(ПараметрыПередачи.ИмяОтчета, ПараметрыПередачи.КлючВарианта)	
	ИначеЕсли СтрСравнить(Ссылка, "НавигацияПланФактныйАнализБюджета") = 0 Тогда
		ПараметрыПередачи = бит_ОтчетыКлиент.ПараметрыПереходаКНовомуОтчету(); 
		ПараметрыПередачи.ИмяОтчета    = "бит_ПланФактныйАнализБюджета";
		ПараметрыПередачи.КлючВарианта = "ПланФактныйАнализБюджета";
		бит_ОтчетыКлиент.ОткрытьНовуюРедакциюОтчета(ПараметрыПередачи.ИмяОтчета, ПараметрыПередачи.КлючВарианта)	
	ИначеЕсли СтрСравнить(Ссылка, "НавигацияПланФактныйАнализПоБюджету_ОстаткиПоСчетам") = 0 Тогда
		ПараметрыПередачи = бит_ОтчетыКлиент.ПараметрыПереходаКНовомуОтчету(); 
		ПараметрыПередачи.ИмяОтчета    = "бит_ПланФактныйАнализБюджетаИОстаткиПоСчетам";
		ПараметрыПередачи.КлючВарианта = "ПланФактныйАнализБюджетаИОстаткиПоСчетам";
		бит_ОтчетыКлиент.ОткрытьНовуюРедакциюОтчета(ПараметрыПередачи.ИмяОтчета, ПараметрыПередачи.КлючВарианта)	
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
