////////////////////////////////////////////////////////////////////////////////
// бит_КазначействоСобытия: обработчики подписок подсистемы Казначейство.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик подписки "бит_ОбработкаПроведенияПлатежногоДокумента".
// См.  Синтакс-помощник: ДокументОбъект.ОбработкаПроведения().
//
Процедура ОбработкаПроведенияПлатежногоДокумента(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
		Возврат;
	КонецЕсли; 			
		
	бит_Казначейство.ОбработкаПроведенияПлатежногоДокумента(Источник, Отказ, РежимПроведения, Ложь);
	
КонецПроцедуры

// Обработчик подписки "бит_ОбработкаУдаленияПроведенияПлатежногоДокумента".
//
Процедура ОбработкаУдаленияПроведенияПлатежногоДокумента(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
		Возврат;
	КонецЕсли; 			
	
	бит_Казначейство.ОбработкаУдаленияПроведенияПлатежногоДокумента(Источник, Отказ);
	
КонецПроцедуры

// Обработчик подписки бит_ПриЗаписиДокументыДДС.
//
Процедура ПриЗаписиПлатежногоДокумента(Источник, Отказ) Экспорт
			
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
		Возврат;
	КонецЕсли; 			

	бит_Казначейство.ПриЗаписиПлатежногоДокумента(Источник, Отказ);
	
КонецПроцедуры

#КонецОбласти