
&После("ОбработкаЗаполнения")
Процедура бит_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9/12] [ASHolyavko@1cbit.ru] [19.08.2024] +        
	Если ЗначениеЗаполнено(ЭтотОбъект.Распоряжение)
		И ТипЗнч(ЭтотОбъект.Распоряжение) = Тип("ДокументСсылка.ЭтапПроизводства2_2") Тогда
		Комментарий = ЭтотОбъект.Распоряжение.Комментарий;
		бит_Толеранс = ЭтотОбъект.Распоряжение.бит_Толеранс;
	КонецЕсли;	
	// }}ПервыйБИТ ЛистТребований [ЛТ9/12] [ASHolyavko@1cbit.ru] [19.08.2024] -
	
КонецПроцедуры
