
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
    // Параметры выбора пользовательского условия.
	МассивПараметров = Новый Массив;
	
	НовыйПараметр   = Новый ПараметрВыбора("Отбор.КонтекстВыполнения", Перечисления.бит_КонтекстыВыполненияПользовательскихУсловий.ТекущийОбъект);
	МассивПараметров.Добавить(НовыйПараметр);	
	
	Элементы.ПользовательскоеУсловие.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
	// Заместителя не копируем.
	ЭтоЗамещаемый = ЗначениеЗаполнено(Запись.Замещаемый);
	Если НЕ Параметры.ЗначениеКопирования.Пустой() Тогда	
		Запись.Замещаемый = Справочники.Пользователи.ПустаяСсылка();	
	КонецЕсли; 
	
	Элементы.ГруппаЗамещение.Видимость = ЭтоЗамещаемый;
	Если ЭтоЗамещаемый Тогда
	
		ЭтотОбъект.ТолькоПросмотр = Истина;
		
		ПарамЗаместителя = РегистрыСведений.бит_НазначенныеЗаместители.КонструкторПараметрыНазначенияЗаместителя();
		ЗаполнитьЗначенияСвойств(ПарамЗаместителя, Запись);
		ПарамЗаместителя.Заместитель = Запись.Пользователь;
		ПарамЗаместителя.Пользователь = Запись.Замещаемый;
		Элементы.ДекорацияИнфоПериодЗамещения.Заголовок = РегистрыСведений.бит_НазначенныеЗаместители.ПредставлениеПериодаЗамещения(ПарамЗаместителя);
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("СправочникСсылка.Пользователи")       , НСтр("ru = 'Пользователи'; en = 'Users'"));
	СписокТипов.Добавить(Тип("СправочникСсылка.ГруппыПользователей"), НСтр("ru = 'Группы пользователей'; en = 'User group'"));	
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект,
			Элемент, Запись, "Пользователь", СписокТипов, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВизаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("СправочникСсылка.бит_Визы")     , НСтр("ru = 'Визы'; en = 'Visas'"));
	СписокТипов.Добавить(Тип("СправочникСсылка.бит_ГруппыВиз"), НСтр("ru = 'Группы виз'; en = 'Visa groups'"));	
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект,
				Элемент, Запись ,"Виза" ,СписокТипов , СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВизаОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

#КонецОбласти
