
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [20.08.2024] +        
	
	Если НЕ РольДоступна("бит_ПравоРедактированияКомментария") Тогда
		
		Если ЗначениеЗаполнено(Объект.Распоряжение) И 
			ЗначениеЗаполнено(Объект.Распоряжение.ДокументОснование)Тогда
			
			Если Объект.Распоряжение.ДокументОснование.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда	
				
				Элементы.Комментарий.ТолькоПросмотр = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ12] [ASHolyavko@1cbit.ru] [20.08.2024] +        
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Толеранс", Тип("ПолеФормы"), Элементы.Группа4);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Толеранс";
	НовыйЭлемент.Заголовок = "(бит) Толеранс";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ12] [ASHolyavko@1cbit.ru] [20.08.2024] -

		// {{ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:02:31] +        
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_АтрибутыТары");
	НоваяКоманда.Заголовок = "Атрибуты тары";
	НоваяКоманда.Действие = "бит_АтрибутыТары";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_АтрибутыТары", Тип("КнопкаФормы"), Элементы.ВыходныеИзделия.КоманднаяПанель);
	НовыйЭлемент.Заголовок = "Атрибуты тары";
	НовыйЭлемент.ИмяКоманды = "бит_АтрибутыТары";
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:02:31] -
	
	// {{ПервыйБИТ ЛистТребований [5.32 дополнение УПО кнопка в шапку 8281]  [VUVaynula@1cbit.ru] [01.06.2025 23:43:25] +        
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ПересчитатьОбеспечениеЭтапаПоСпецификации");
	НоваяКоманда.Заголовок = "(бит) Пересчитать обеспечение";
	НоваяКоманда.Подсказка = "(бит) Пересчитать обеспечение этапа по спецификации";
	НоваяКоманда.Действие = "бит_ПересчитатьОбеспечениеЭтапаПоСпецификации";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ПересчитатьОбеспечениеЭтапаПоСпецификации", Тип("КнопкаФормы"), КоманднаяПанель);
	НовыйЭлемент.Заголовок = "(бит) Пересчитать обеспечение";                                    
	НовыйЭлемент.ИмяКоманды = "бит_ПересчитатьОбеспечениеЭтапаПоСпецификации";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_РучнойВводМатериалов", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво, Элементы.ГруппаСообщенияКоманды);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_РучнойВводМатериалов";
	// }}ПервыйБИТ ЛистТребований [5.32 дополнение УПО кнопка в шапку 8281]  [VUVaynula@1cbit.ru] [01.06.2025 23:43:25] -
КонецПроцедуры

&НаКлиенте
Процедура бит_АтрибутыТары(Команда)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:05:37] + 
	ИмяТЧ = "ВыходныеИзделия";
	ИмяТЧСерии = "ВыходныеИзделияСерии";
	
	ТД = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ПФ = Неопределено;
		Если ЗначениеЗаполнено(ТД.Серия) Тогда
			ПФ = Новый Структура("Ключ, Документ, Номенклатура, Упаковка, Количество, КоличествоУпаковок, Назначение, НомерСтроки",
								ТД.Серия,
								Объект.Ссылка, 
								ТД.Номенклатура,
								ТД.Упаковка,
								ТД.Количество,
								ТД.КоличествоУпаковок,
								ТД.Назначение,
								ТД.НомерСтроки);	
		Иначе
			СписокСерий = Объект[ИмяТЧСерии].НайтиСтроки(Новый Структура("Номенклатура,Характеристика", ТД.Номенклатура, ТД.Характеристика));
			Если СписокСерий.Количество() = 1 Тогда 
				ПФ = Новый Структура("Ключ, Документ, Номенклатура, Упаковка, Количество, КоличествоУпаковок, Назначение, НомерСтроки",
								СписокСерий[0].Серия,
								Объект.Ссылка, 
								ТД.Номенклатура,
								ТД.Упаковка,
								ТД.Количество,
								ТД.КоличествоУпаковок,
								ТД.Назначение,
								ТД.НомерСтроки);
			Иначе
				РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.ВыходныеИзделия, ЭтотОбъект);
				ОткрытьПодборСерий("ВыходныеИзделия");
			КонецЕсли;
		КонецЕсли;   
	КонецЕсли;
	Если ПФ <> Неопределено Тогда
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.бит_ФормаАтрибутыТары", ПФ, ЭтаФорма, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:05:37] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ПересчитатьОбеспечениеЭтапаПоСпецификации(Команда)
	// {{ПервыйБИТ ЛистТребований [ЛТ 5.32]  [VUVaynula@1cbit.ru] [05.05.2025 16:43:52] +
	бит_ПересчитатьОбеспечениеЭтапаПоСпецификацииНаСервере();
	// }}ПервыйБИТ ЛистТребований [ЛТ 5.32]  [VUVaynula@1cbit.ru] [05.05.2025 16:43:52] -
КонецПроцедуры  

&НаСервере
Процедура бит_ПересчитатьОбеспечениеЭтапаПоСпецификацииНаСервере()
	// {{ПервыйБИТ ЛистТребований [ЛТ 5.32]  [VUVaynula@1cbit.ru] [05.05.2025 16:43:52] +
	бит_ЭтапПроизводства.ПересчитатьОбеспечениеЭтапаПоСпецификации(Объект)
	// }}ПервыйБИТ ЛистТребований [ЛТ 5.32]  [VUVaynula@1cbit.ru] [05.05.2025 16:43:52] -
КонецПроцедуры

&НаКлиенте
Процедура бит_СтатусПриИзмененииПосле(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ 5.32]  [VUVaynula@1cbit.ru] [05.05.2025 16:43:52] +
	бит_ПересчитатьОбеспечениеЭтапаПоСпецификацииНаСервере();
	// }}ПервыйБИТ ЛистТребований [ЛТ 5.32]  [VUVaynula@1cbit.ru] [05.05.2025 16:43:52] -
КонецПроцедуры
