
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.ПланыСчетов.бит_Бюджетирование;
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	бит_РаботаСДиалогамиСервер.ЗаполнитьПараметрыСпискаПланаСчетов(ЭтотОбъект);
	
	ИмяПланаСчетов = СтрЗаменить(Список.ОсновнаяТаблица, "ПланСчетов.", "");
	
	// Выведем установленный заголовок.
    бит_НазначениеСинонимовОбъектов.ВывестиЗаголовокФормы(МетаданныеОбъекта, ЭтотОбъект, Перечисления.бит_ВидыФормОбъекта.Списка);
		
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПланСчетовПриемник"   , ИмяПланаСчетов);
	ПараметрыФормы.Вставить("ЗаполнениеПоУмолчанию", Истина);
	ОткрытьФорму("Обработка.бит_ЗаполнитьПланСчетовПоПлануСчетов.Форма", ПараметрыФормы, ЭтотОбъект, "ЗаполнитьПоУмолчанию_0");

	Элементы.Список.Обновить();
			
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПлануСчетов(Команда)
		
	ПараметрыФормы = Новый Структура("ПланСчетовПриемник", ИмяПланаСчетов);
	ОткрытьФорму("Обработка.бит_ЗаполнитьПланСчетовПоПлануСчетов.Форма", ПараметрыФормы, ЭтотОбъект, "ЗаполнитьПоПлануСчетов_0");

	Элементы.Список.Обновить();
	
КонецПроцедуры

#Область бит_ОбработчикиКомандРаботаСExcel

&НаКлиенте
Процедура ЗагрузитьЧерезТабДок(Команда)
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("РежимЗагрузки",  ПредопределенноеЗначение("Перечисление.бит_РежимыЗагрузки.ПланСчетов"));
    ПараметрыФормы.Вставить("ИмяПланаСчетов", "бит_Бюджетирование");
    
    ОткрытьФорму("Обработка.бит_ЗагрузкаДанныхИзТабличногоДокумента.Форма", ПараметрыФормы, ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
    
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Для счетов-групп всю строку выделяем желтым цветом.

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Список");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Список.ЗапретитьИспользоватьВПроводках", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтый);

КонецПроцедуры

#КонецОбласти
