
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ТекстСообщения = НСтр("ru = 'Непосредственное открытие этой формы не предусмотрено.';
							 | en = 'This form cannot be opened directly.'") + Символы.ПС 
					   + НСтр("ru = 'Для открытия формы можно воспользоваться командой ""Аналитики (БИТ)"" в формах документов.';
						 	  |en = 'To open the form, you can use the ""Analytics (bit)"" command in document forms.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 	
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОтобразитьРаспределениеБюджета();
	ПодключитьОбработчикОжидания("ПроверитьМодификациюВладельцаФормы", 0.5, Истина);
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОпределитьПереченьПозиций(ТекущийОбъект);
	
	МетаданныеДокумента = Метаданные.Документы.бит_ОтражениеФактаДДС;
	Если бит_ДатыЗапретаРедактирования.ПропуститьПроверкуДатыЗапрета(МетаданныеДокумента, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = Объект.ДокументОснование.Метаданные();
	РедактированиеЗапрещено = бит_ДатыЗапретаРедактирования.ВыполнитьПроверкуДатыЗапретаРедактирования(
									МетаданныеДокумента, Объект.ДокументОснование);
	Если РедактированиеЗапрещено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	ФормироватьДвижения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.ДокументОснование, "Проведен");
	Если ФормироватьДвижения Тогда
		ВыполнитьПроведениеБитНаСервере(ТекущийОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДоработатьТаблицуАналитик();
	ЗаполнитьДобавленныеКолонкиТаблиц();
	ЗаполнитьКурсКратностьТекстом();

	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаписатьИЗакрыть = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ЗаписатьИЗакрыть", Ложь);
	
	Если ВладелецФормы <> Неопределено Тогда
		Если ЗаписатьИЗакрыть Тогда
			// АПК:534-выкл Безопасное открытие формы документа.
			ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Объект.ДокументОснование));
			// АПК:534-вкл
		КонецЕсли;
	Иначе
		Если ЗаписатьИЗакрыть И Открыта() Тогда
		     Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НеСинхронизироватьПриИзменении(Элемент)
	
	Если Объект.НеСинхронизировать Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("НеСинхронизироватьПриИзмененииЗавершение", ЭтотОбъект); 

	Если ЕстьСсылкиНаПлатежныеПозиции() Тогда
		ТекстВопроса = НСтр("ru='Документ заполнен на основании данных документа планирования ДДС. 
							|При снятии флага ""Не синхронизировать"" документ при проведении будет перезаполнен без учета этих данных. Продолжить?';
							|en='The document is filled on the basis of the document data DDS planning. 
							|When removing the flag ""out of sync"" the document will be refilled during excluding those data. Proceed?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли; 
			
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура НеСинхронизироватьПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда			
		Объект.НеСинхронизировать = Истина;			
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НеСинхронизироватьПериодПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НеСинхронизироватьСуммуПриИзменении(Элемент)
	
	Если НЕ Объект.НеСинхронизироватьСумму Тогда
		ОбработатьИзменнениеНеСинхронизироватьСумму();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыФормыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ИмяТекущейСтраницы = Элементы.СтраницыФормы.ТекущаяСтраница.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНажатие(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Объект.ДокументОснование));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАналитики

&НаКлиенте
Процедура АналитикиАналитикаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Аналитики.ТекущиеДанные;
	ИзменениеАналитики(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораЗначениеАналитикиШапки(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Аналитики.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
    	Возврат;
    КонецЕсли;
		
    бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, 
		ТекущиеДанные.ИмяАналитики, СтандартнаяОбработка, КэшЗначений.НастройкиАналитик,  "ЗначениеАналитики");
															   
КонецПроцедуры // НачалоВыбораЗначениеАналитикиШапки()

&НаКлиенте
Процедура АналитикиЗначениеАналитикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачалоВыбораЗначениеАналитикиШапки(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиЗначениеАналитикиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	НачалоВыбораЗначениеАналитикиШапки(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // АналитикиЗначениеАналитикиАвтоПодбор()

&НаКлиенте
Процедура АналитикиЗначениеАналитикиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Аналитики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контейнер = Новый Структура;
	Контейнер.Вставить(ТекущиеДанные.ИмяАналитики, ТекущиеДанные.ЗначениеАналитики);	

	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент,
																			Контейнер,
																		   	ТекущиеДанные.ИмяАналитики,
																		   	СтандартнаяОбработка,
																		   	КэшЗначений.НастройкиАналитик);
																		
	ТекущиеДанные.ЗначениеАналитики = Контейнер[ТекущиеДанные.ИмяАналитики];
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиПриИзменении(Элемент)
	
	Объект.НеСинхронизировать = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФактическиеДанные

&НаКлиенте
Процедура ФактическиеДанныеПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	
	бит_МеханизмДопИзмеренийКлиент.УстановитьНачальныеСвойстваАналитикСтроки(
		ЭтотОбъект, ТекущиеДанные, ПараметрыУстановкиСвойствАналитик(ЭтотОбъект, "ФактическиеДанные"));

КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		Если ЕстьРасшифровкаПлатежа Тогда
			ИдентификаторСтроки 		  = Элементы.ФактическиеДанные.ОтборСтрок.ИдентификаторСтроки;
			ДанныеСтрокиРасшифровки 	  = Элементы.РасшифровкаПлатежа.ТекущиеДанные; 
			СуммаОплаты 				  = ДанныеСтрокиРасшифровки.Сумма;
			ВалютаВзаиморасчетов		  = ДанныеСтрокиРасшифровки.ВалютаВзаиморасчетов;
			КурсЧислительВзаиморасчетов   = ДанныеСтрокиРасшифровки.КурсЧислительВзаиморасчетов;
			КурсЗнаменательВзаиморасчетов = ДанныеСтрокиРасшифровки.КурсЗнаменательВзаиморасчетов;
		Иначе	
			ИдентификаторСтроки 		  = "";
			СуммаОплаты					  = СуммаДокумента;
			ВалютаВзаиморасчетов		  = Объект.ВалютаДокумента;
			КурсЧислительВзаиморасчетов   = 1;
			КурсЗнаменательВзаиморасчетов = 1;
		КонецЕсли; 
		
		ТекущиеДанные.ИдентификаторСтроки 			= ИдентификаторСтроки;
		ТекущиеДанные.ВалютаВзаиморасчетов 			= ВалютаВзаиморасчетов;
		ТекущиеДанные.КурсЧислительВзаиморасчетов	= КурсЧислительВзаиморасчетов;
		ТекущиеДанные.КурсЗнаменательВзаиморасчетов = КурсЗнаменательВзаиморасчетов;
		
		Если Объект.ФактическиеДанные.Количество() = 1 Тогда
			ТекущиеДанные.СуммаОплаты = СуммаОплаты;
		КонецЕсли; 
	КонецЕсли; 

	Если НоваяСтрока Тогда
		ПриИзмененииСуммыПлатежаРаспределенияБюджета(Копирование);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеПриИзменении(Элемент)
	
	// Любой элемент таблицы, кроме "суммы платежа", взводит флаг "НеСинхронизировать".
	Колонка = Элементы.ФактическиеДанные.ТекущийЭлемент;
	Если Колонка = Элементы.ФактическиеДанныеНомерСтрокиДокумента Тогда
		Возврат;
	КонецЕсли;
	
	Если Колонка <> Элементы.ФактическиеДанныеСуммаОплаты Тогда
		Объект.НеСинхронизировать = Истина;
	КонецЕсли; 	
	
	УправлениеФормой(ЭтотОбъект);
	
	КлючСтроки = "";
	Если ЕстьРасшифровкаПлатежа Тогда
		КлючСтроки = Элементы.ФактическиеДанные.ОтборСтрок.ИдентификаторСтроки;
	КонецЕсли; 
	
	ОбновитьИтоги(КлючСтроки, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеПозицияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Перем ДокументПланирования;
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ДокументПланирования = ТекущиеДанные.Позиция;
	КонецЕсли;
	
	Если ИспользуетсяПланируемоеПоступление Тогда
		ОткрытьПодборПланируемогоПоступленияДС(ДокументПланирования, Элемент, СтандартнаяОбработка);
	Иначе	
		ОткрытьПодборПлатежнойПозиции(ДокументПланирования, Элемент, СтандартнаяОбработка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеПозицияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Позиция) Тогда	
		ТекущаяСтатьяОборотов = ТекущиеДанные.СтатьяОборотов;
		НоваяСтрока = ДанныеЗаполненияИзПозиции(ТекущиеДанные.Позиция, ТекущиеДанные.ПолучитьИдентификатор());
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, НоваяСтрока);
		Если ТекущиеДанные.СтатьяОборотов <> ТекущаяСтатьяОборотов Тогда
			ИзменениеСтатьиОборотовНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Объект.ФактическиеДанные.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ИмяРеквизита = СтрЗаменить(Поле.Имя, "ФактическиеДанные", "");
	
	Если ТекущаяСтрока <> Неопределено И ТекущаяСтрока.Заблокировать = 2 И ИмяРеквизита = "Позиция" Тогда
	
		ТекЗнч = ТекущаяСтрока[ИмяРеквизита];		
		Если ЗначениеЗаполнено(ТекЗнч) Тогда
			ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ТекЗнч));		
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеАналитика_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	ИмяАналитики  = СтрЗаменить(Элемент.Имя, "ФактическиеДанные", "");
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные,
		ИмяАналитики, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеАналитика_АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	ИмяАналитики  = СтрЗаменить(Элемент.Имя, "ФактическиеДанные", "");
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные,
		ИмяАналитики, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
                                                               
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеАналитика_Очистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	ИмяАналитики  = СтрЗаменить(Элемент.Имя, "ФактическиеДанные", "");
	
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, ТекущиеДанные,
		ИмяАналитики, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеСуммаОплатыПриИзменении(Элемент)
		
	ПриИзмененииСуммыПлатежаРаспределенияБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеСуммаВзаиморасчетовПриИзменении(Элемент)
	
	ТекущиеДанные 	= Элементы.ФактическиеДанные.ТекущиеДанные;
	ТекущееЗначение = ТекущиеДанные.СуммаОплаты;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СуммаВзаиморасчетов)
		И ТекущиеДанные.ВалютаВзаиморасчетов = Объект.ВалютаДокумента
		И ТекущиеДанные.СуммаВзаиморасчетов <> ТекущиеДанные.СуммаОплаты Тогда
		ТекущиеДанные.СуммаВзаиморасчетов = ТекущиеДанные.СуммаОплаты;
	Иначе
		ПараметрыПередачи = Новый Структура;
		ПараметрыПередачи.Вставить("КурсЧислительВзаиморасчетов", 	ТекущиеДанные.КурсЧислительВзаиморасчетов);
		ПараметрыПередачи.Вставить("КурсЗнаменательВзаиморасчетов", ТекущиеДанные.КурсЗнаменательВзаиморасчетов);
		ПараметрыПередачи.Вставить("СуммаВзаиморасчетов", 			ТекущиеДанные.СуммаВзаиморасчетов);
		ПараметрыПередачи.Вставить("Сумма", 						ТекущиеДанные.СуммаОплаты);
		
		ДенежныеСредстваКлиентСервер.РассчитатьСуммуВСтрокеРасшифровки(
			ПараметрыПередачи, Объект.ВалютаДокумента, ВалютаРеглУчета);
		
		ТекущиеДанные.СуммаОплаты = ПараметрыПередачи.Сумма; 	
	КонецЕсли;
	
	Если ТекущиеДанные.СуммаОплаты <> ТекущиеДанные.СуммаОплаты Тогда
		Если ЕстьРасшифровкаПлатежа Тогда
			ДанныеРасшифровки 	= Элементы.РасшифровкаПлатежа.ТекущиеДанные;
			ИдентификаторСтроки	= Элементы.ФактическиеДанные.ОтборСтрок.ИдентификаторСтроки;
		Иначе
			ИдентификаторСтроки = "";
		КонецЕсли;	
		ОбновитьИтоги(ИдентификаторСтроки, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеПериодПриИзменении(Элемент)
	
	Объект.НеСинхронизироватьПериод = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеСтатьяОборотовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	ИзменениеСтатьиОборотовНаСервере(ТекущиеДанные.ПолучитьИдентификатор());

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаПлатежа

&НаКлиенте
Процедура РасшифровкаПлатежаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Колонка 	  = СтрЗаменить(Поле.Имя, "РасшифровкаПлатежа", "");
	
	Если Колонка = "КурсЧислительВзаиморасчетовТекст" ИЛИ Колонка = "КурсЧислительВзаиморасчетов" Тогда
		
	Иначе
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(ТекущиеДанные[Колонка]) Тогда
			ПоказатьЗначение(, ТекущиеДанные[Колонка]);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриАктивизацииСтроки(Элемент)
	
	ОтобразитьРаспределениеБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаКурсЧислительВзаиморасчетовПриИзменении(Элемент)
	
	РасшифровкаПлатежаКурсЧислительВзаиморасчетовПриИзмененииНаСервере();
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти  

&НаКлиенте
Процедура КомандаЗаписатьЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура("ЗаписатьИЗакрыть", Истина); 
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШапкуПоОснованию(Команда)
	
	ЗаполнитьШапкуПоОснованиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактическиеДанные(Команда)
	
	ЗаполнитьФактическиеДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоОснованию(Команда)
	
	ЗаполнитьПоОснованию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШапкуПоФактическимДанным(Команда)
	
	Отказ = Ложь;
			
	Если Объект.ФактическиеДанные.Количество() = 0 Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("СПИСОК", 
							"Заполнение",,, НСтр("ru = 'Фактичекие данные'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ФактическиеДанные", "Объект", Отказ);
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьШапкуПоФактическимДаннымНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьТаблицы(Команда)
	
	ТекстСообщения = НСтр("ru = 'Проверьте правильность заполнения номеров строк. После записи документа изменить связи таблиц будет невозможно. Продолжить?'; 
							|en = 'Check that the line numbers are filled in correctly. After writing the document, it will be impossible to change the table relationships. Continue?'");
	
	Оповещение = Новый ОписаниеОповещения("ПривязатьТаблицыЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПривязатьТаблицыЗавершение(Результат, Дополнительно) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	ВсеСтрокиПривязаны = Истина;
	
	Для каждого СтрокаТаблицы Из Объект.ФактическиеДанные Цикл
		// Метод НайтиСтроки() на клиенте выполняет неявный вызов сервера. Скнируем таблицу.
		СтрокаПривязана = Ложь;
		Для каждого ДанныеСтрокиРасшифровки Из РасшифровкаПлатежа Цикл
			Если СтрокаТаблицы.НомерСтрокиДокумента = ДанныеСтрокиРасшифровки.НомерСтрокиДокумента Тогда
				СтрокаТаблицы.ИдентификаторСтроки 			= ДанныеСтрокиРасшифровки.ИдентификаторСтроки;
				СтрокаТаблицы.ВалютаВзаиморасчетов		    = ДанныеСтрокиРасшифровки.ВалютаВзаиморасчетов;
				СтрокаТаблицы.КурсЧислительВзаиморасчетов   = ДанныеСтрокиРасшифровки.КурсЧислительВзаиморасчетов;
				СтрокаТаблицы.КурсЗнаменательВзаиморасчетов = ДанныеСтрокиРасшифровки.КурсЗнаменательВзаиморасчетов;
				
				ПараметрыПередачи = Новый Структура;
				ПараметрыПередачи.Вставить("КурсЧислительВзаиморасчетов", 	СтрокаТаблицы.КурсЧислительВзаиморасчетов);
				ПараметрыПередачи.Вставить("КурсЗнаменательВзаиморасчетов", СтрокаТаблицы.КурсЗнаменательВзаиморасчетов);
				ПараметрыПередачи.Вставить("СуммаВзаиморасчетов", 			СтрокаТаблицы.СуммаВзаиморасчетов);
				ПараметрыПередачи.Вставить("Сумма", 						СтрокаТаблицы.СуммаОплаты);
				
				ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
					ПараметрыПередачи, Объект.ВалютаДокумента, ВалютаРеглУчета);
				
				СтрокаТаблицы.СуммаВзаиморасчетов = ПараметрыПередачи.СуммаВзаиморасчетов; 	

				СтрокаПривязана = Истина;
			КонецЕсли;	
			ОбновитьИтоги(СтрокаТаблицы.ИдентификаторСтроки, ЭтотОбъект);
		КонецЦикла;
		Если НЕ СтрокаПривязана Тогда
			ВсеСтрокиПривязаны = Ложь;	
		КонецЕсли;
	КонецЦикла;
	
	Если ВсеСтрокиПривязаны Тогда
		Объект.НачатПереходНаНовуюАрхитектуру = Ложь;
		УправлениеФормой(ЭтотОбъект);
		ОтобразитьРаспределениеБюджета();
	Иначе
		ТекстСообщения = НСтр("ru = 'Найдены непривязанные строки. Уточните привязку.'; 
								|en = 'Unbound strings were found. Specify the binding.'");
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗаполнитьКэшЗначений();
	ПрочитатьРеквизитыВладельцаАналитик();
	
	ПараметрыВидимости = бит_КазначействоКлиентСервер.ПодготовитьПараметрыВидимости(ХозяйственнаяОперацияБФ);
	ВалютаРеглУчета	   = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	
	ЗаполнитьФлаги();
	
	ДоработатьТаблицуАналитик();
	
	// Управляем видимостью колонок дополнительных измерений.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, "ФактическиеДанные",
		КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
			
	Если ЕстьРасшифровкаПлатежа Тогда
		
		ПрочитатьРасшифровкуПлатежа();
		
		Для каждого СтрокаТаблицы Из РасшифровкаПлатежа Цикл
			ПараметрыОтбора	  = Новый Структура("ИдентификаторСтроки", СтрокаТаблицы.ИдентификаторСтроки);
			РезультатПоиска = Объект.ФактическиеДанные.НайтиСтроки(ПараметрыОтбора);
			Если ЗначениеЗаполнено(РезультатПоиска) Тогда
				Запись = РезультатПоиска[0];	
				СтрокаТаблицы.КурсЧислительВзаиморасчетов	= Запись.КурсЧислительВзаиморасчетов;
				СтрокаТаблицы.КурсЗнаменательВзаиморасчетов = Запись.КурсЗнаменательВзаиморасчетов;
			КонецЕсли;
			ОбновитьИтоги(СтрокаТаблицы.ИдентификаторСтроки, ЭтотОбъект);
		КонецЦикла;
		Элементы.ФактическиеДанныеСуммаОплаты.ПутьКДаннымПодвала = "Элементы.РасшифровкаПлатежа.ТекущиеДанные.Распределено";
		
		// Переход на новую архитектуру.
		Если Объект.НачатПереходНаНовуюАрхитектуру Тогда
			НомерСтроки = 0;
			ВГраница 	= РасшифровкаПлатежа.Количество();
			Пока НомерСтроки <= ВГраница Цикл
				Элементы.ФактическиеДанныеНомерСтрокиДокумента.СписокВыбора.Добавить(НомерСтроки);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
			Для каждого СтрокаТаблицы Из РасшифровкаПлатежа Цикл
				ПараметрыОтбора	  = Новый Структура("ИдентификаторСтроки", СтрокаТаблицы.ИдентификаторСтроки);
				РезультатПоиска = Объект.ФактическиеДанные.НайтиСтроки(ПараметрыОтбора);
				Для каждого Элемент Из РезультатПоиска Цикл
					Элемент.НомерСтрокиДокумента = СтрокаТаблицы.НомерСтрокиДокумента;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	Иначе
		ОбновитьИтоги("", ЭтотОбъект);	
		Элементы.ФактическиеДанныеСуммаОплаты.ПутьКДаннымПодвала = "Распределено";
	КонецЕсли; 	

	ВладелецМодифицирован = ТолькоПросмотр;	
	
	Элементы.РасшифровкаПлатежаСумма.Заголовок	  	= СтрШаблон(НСтр("ru = 'Сумма (%1)'; en = 'Amount (%1)'"), Объект.ВалютаДокумента);
	Элементы.РасшифровкаПлатежаСуммаНДС.Заголовок 	= СтрШаблон(НСтр("ru = 'Сумма НДС (%1)'; en = 'VAT amount (%1)'"), Объект.ВалютаДокумента);
	Элементы.ФактическиеДанныеСуммаОплаты.Заголовок	= СтрШаблон(НСтр("ru = 'Сумма (%1)'; en = 'Amount (%1)'"), Объект.ВалютаДокумента);
	
	ЗаполнитьКурсКратностьТекстом();
	ЗаполнитьДобавленныеКолонкиТаблиц();
	УправлениеФормой(ЭтотОбъект);
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшЗначений()

	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ИзмеренияДоп", бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним"));
	// Настройки дополнительных измерений.
	КэшЗначений.Вставить("НастройкиИзмерений", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	// Настройки всех дополнительных аналитик.
	КэшЗначений.Вставить("НастройкиАналитик", бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхАналитик());
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФлаги()

	// ++ NB При перемещении денег используется 2 вида документов.
	
	ЕстьРасшифровкаПлатежа = бит_ОбщегоНазначенияПереопределяемый.ЕстьРасшифровкаПлатежа(
								Объект.ДокументОснование, Неопределено);
								
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") 
		ИЛИ ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
		ОграничениеТипаПозиции = Новый ОписаниеТипов("ДокументСсылка.бит_кзн_ПозицияПоступления");
		ИспользуетсяПланируемоеПоступление = Истина;
	Иначе	
		ОграничениеТипаПозиции = Новый ОписаниеТипов("ДокументСсылка.бит_кзн_ПлатежнаяПозиция");
		ИспользуетсяПлатежнаяПозиция = Истина;
	КонецЕсли;
	
	Элементы.ФактическиеДанныеПозиция.ОграничениеТипа = ОграничениеТипаПозиции;					

	ИспользоватьДоговорыСПоставщиками	   = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками");
	ИспользоватьДоговорыМеждуОрганизациями = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыМеждуОрганизациями");
	ИспользоватьДоговорыСКлиентами		   = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");

КонецПроцедуры

&НаСервере
Процедура ПрочитатьРеквизитыВладельцаАналитик()

	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("Валюта");
	ИменаРеквизитов.Вставить("Организация");
	ИменаРеквизитов.Вставить("СуммаДокумента");
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ХозяйственнаяОперация", Объект.ДокументОснование.Метаданные()) Тогда
		ИменаРеквизитов.Вставить("ХозяйственнаяОперацияУП", "ХозяйственнаяОперация");	
	КонецЕсли;
	
	РеквизитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументОснование, 
							Новый ФиксированнаяСтруктура(ИменаРеквизитов));
							
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыВладельца);
	
	ХозяйственнаяОперацияБФ = бит_КазначействоКлиентСервер.ХозяйственнаяОперацияБФ(ХозяйственнаяОперацияУП);
	
КонецПроцедуры

// Процедура дозаполняет строку аналитик. 
//
&НаСервере
Процедура ДозаполнитьСтрокуАналитик(ТекущаяСтрока)

	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Аналитика) Тогда
			
			ОписаниеТиповАналитики = ТекущаяСтрока.Аналитика.ТипЗначения;
			ТекущаяСтрока.ЗначениеАналитики = ОписаниеТиповАналитики.ПривестиЗначение(ТекущаяСтрока.ЗначениеАналитики);
			
			// Для дополнительных значений аналитик необходимо проверить владельца.
			Если ТипЗнч(ТекущаяСтрока.ЗначениеАналитики) = Тип("СправочникСсылка.бит_ДополнительныеЗначенияАналитик") 
				 И ЗначениеЗаполнено(ТекущаяСтрока.ЗначениеАналитики) Тогда
			
				Если ТекущаяСтрока.ЗначениеАналитики.Владелец <> ТекущаяСтрока.Аналитика Тогда				
					ТекущаяСтрока.ЗначениеАналитики = Справочники.бит_ДополнительныеЗначенияАналитик.ПустаяСсылка();				
				КонецЕсли; 
			
			КонецЕсли; 
			
			ТекущаяСтрока.ИмяАналитики = СокрЛП(ТекущаяСтрока.Аналитика.Код);
			
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры // ДозаполнитьСтрокуАналитик()

// Процедура дополняет НаборДопАналитики необходимыми данными.
//
&НаСервере
Процедура ДоработатьТаблицуАналитик()

	Для каждого СтрокаТаблицы Из Объект.Аналитики Цикл	
		ДозаполнитьСтрокуАналитик(СтрокаТаблицы);	
	КонецЦикла; 

КонецПроцедуры // ДоработатьТаблицуАналитик()

// Обрабатывает изменение аналитики в строке таблицы НаборДопАналитики. 
//
// Параметры:
//  ИдСтроки - Число.
//
&НаСервере
Процедура ИзменениеАналитики(ИдСтроки)
	
	ТекущаяСтрока = Объект.Аналитики.НайтиПоИдентификатору(ИдСтроки);
	ДозаполнитьСтрокуАналитик(ТекущаяСтрока);
	
КонецПроцедуры // ИзменениеАналитики()

&НаКлиентеНаСервереБезКонтекста 
Процедура УправлениеФормой(Форма)
	
	Объект	 = Форма.Объект;
	Элементы = Форма.Элементы;
												 
	Элементы.ФормаЗаписатьЗакрыть.Доступность	   = НЕ Форма.ВладелецМодифицирован;
	Элементы.ПерезаполнитьПоОснованию.Доступность  = НЕ Форма.ВладелецМодифицирован;
	Элементы.АналитикиПодменюЗаполнить.Доступность = НЕ Форма.ВладелецМодифицирован;
		
	Элементы.ПредупреждениеОНезаписанномДокументе.Видимость	= Форма.ВладелецМодифицирован;
	Элементы.ЗаполнитьАналитикиТабличнойЧасти.Доступность   = НЕ Форма.ВладелецМодифицирован;
	
	Элементы.РасшифровкаПлатежа.Видимость 	  				= Форма.ЕстьРасшифровкаПлатежа;
	Элементы.ГруппаСуммаПлатежа.Видимость 	 				= НЕ Форма.ЕстьРасшифровкаПлатежа;
	Элементы.ФактическиеДанныеСуммаВзаиморасчетов.Видимость = Форма.ЕстьРасшифровкаПлатежа;
	
	Если ПустаяСтрока(Форма.ИмяТекущейСтраницы) Тогда
		Если Объект.ФактическиеДанные.Количество() <= 1 Тогда
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаАналитикиШапки;
		Иначе	
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаАналитикиТабличнойЧасти;
		КонецЕсли;
		Форма.ИмяТекущейСтраницы = Элементы.СтраницыФормы.ТекущаяСтраница.Имя;
	Иначе	
		// При обновлении формы-владельца происходит повторное открытие формы.
		// Это приводит к переключению закладок.
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы[Форма.ИмяТекущейСтраницы];
	КонецЕсли;

	ПараметрыВидимости 		= Форма.ПараметрыВидимости;
	ХозяйственнаяОперацияБФ = Форма.ХозяйственнаяОперацияБФ;
	
	Элементы.РасшифровкаПлатежаОбъектРасчетов.Видимость = ПараметрыВидимости.ЕстьОбъектРасчетов;
	
	Если Объект.НеСинхронизироватьСумму Тогда
		ЗаголовокКурсЧислительВзаиморасчетов = НСтр("ru = 'Факт по курсу'; en = 'Fact by rate'");
	Иначе	
		ЗаголовокКурсЧислительВзаиморасчетов = НСтр("ru = 'По курсу'; en = 'By rate'");
	КонецЕсли;
	Элементы.РасшифровкаПлатежаКурсЧислительВзаиморасчетов.Заголовок = ЗаголовокКурсЧислительВзаиморасчетов;
	
	Элементы.ФактическиеДанныеСуммаВзаиморасчетов.ТолькоПросмотр = НЕ Объект.НеСинхронизироватьСумму;
	
	Если ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты")
		ИЛИ ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоКредитам")
		ИЛИ ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты") 
		ИЛИ ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймов") Тогда 			
		Элементы.РасшифровкаПлатежаДоговорКредитаДепозита.Видимость = Истина;
		Элементы.РасшифровкаПлатежаДоговорАренды.Видимость 	 	   = Ложь;	
	ИначеЕсли ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаАрендодателю") Тогда			
		Элементы.РасшифровкаПлатежаДоговорКредитаДепозита.Видимость = Ложь;
		Элементы.РасшифровкаПлатежаДоговорАренды.Видимость		   = Истина;
	ИначеЕсли ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыНаПлатежнуюКарту") Тогда
		Элементы.РасшифровкаПлатежаДоговорКредитаДепозита.Видимость = Ложь;
		Элементы.РасшифровкаПлатежаДоговорАренды.Видимость		   = Ложь;
	Иначе	
		Элементы.РасшифровкаПлатежаДоговорКредитаДепозита.Видимость = Ложь;
		Элементы.РасшифровкаПлатежаДоговорАренды.Видимость 		   = Ложь;
	КонецЕсли; 

	Если (ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию")
		И Форма.ИспользоватьДоговорыМеждуОрганизациями 
	  ИЛИ ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыКлиенту") 
		И Форма.ИспользоватьДоговорыСКлиентами 
  	  ИЛИ ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоставщику")
		И Форма.ИспользоватьДоговорыСПоставщиками
	  ИЛИ ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию")
		И Форма.ИспользоватьДоговорыМеждуОрганизациями
	  ИЛИ ХозяйственнаяОперацияБФ = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеТаможне")
		И Форма.ИспользоватьДоговорыСПоставщиками) Тогда
		
		Элементы.РасшифровкаПлатежаДоговор.Видимость = Истина;
	Иначе
		Элементы.РасшифровкаПлатежаДоговор.Видимость = Ложь;
	КонецЕсли;

	Элементы.ПредупреждениеОНезавершенномПереходеНаНовуюАрхитектуру.Видимость = Объект.НачатПереходНаНовуюАрхитектуру;
	Элементы.ФактическиеДанныеПривязатьТаблицы.Видимость					  = Объект.НачатПереходНаНовуюАрхитектуру;
	Элементы.ФактическиеДанныеНомерСтрокиДокумента.Видимость				  = Объект.НачатПереходНаНовуюАрхитектуру;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроведениеБитНаСервере(ТекущийОбъект, Отказ)

	ТекущийОбъект.ПровестиОтражениеДДС(ТекущийОбъект, Отказ);
	
	ПлатежныеПозиции = РазличныеПозиции.ВыгрузитьЗначения();
	КэшОпераций      = бит_ВизированиеСервер.НовыйКэшОперацийУстановкиСтатусов();
	Документы.бит_ОтражениеФактаДДС.ОбновитьСтатусыПлатежныхПозиций(ПлатежныеПозиции, КэшОпераций);
	Документы.бит_ОтражениеФактаДДС.ОбновитьСтатусыЗаявокПоПлатежнымПозициям(ПлатежныеПозиции, КэшОпераций);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПереченьПозиций(ТекущийОбъект)
	
	РазличныеПозиции.Очистить();
	
	ТекущиеПозиции = ТекущийОбъект.ФактическиеДанные.ВыгрузитьКолонку("Позиция");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФактическиеДанные.Позиция КАК Позиция
	|ПОМЕСТИТЬ ПозицииДоИзменения
	|ИЗ
	|	Документ.бит_ОтражениеФактаДДС.ФактическиеДанные КАК ФактическиеДанные
	|ГДЕ
	|	ФактическиеДанные.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлатежныеПозиции.Ссылка КАК Позиция
	|ПОМЕСТИТЬ ВсеПозиции
	|ИЗ
	|	ПозицииДоИзменения КАК ПозицииДоИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежныеПозиции
	|		ПО ПозицииДоИзменения.Позиция = ПлатежныеПозиции.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлатежныеПозиции.Ссылка
	|ИЗ
	|	Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежныеПозиции
	|ГДЕ
	|	ПлатежныеПозиции.Ссылка В(&ТекущиеПозиции)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПозицииПоступления.Ссылка
	|ИЗ
	|	ПозицииДоИзменения КАК ПозицииДоИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПозицияПоступления КАК ПозицииПоступления
	|		ПО ПозицииДоИзменения.Позиция = ПозицииПоступления.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПозицииПоступления.Ссылка
	|ИЗ
	|	Документ.бит_кзн_ПозицияПоступления КАК ПозицииПоступления
	|ГДЕ
	|	ПозицииПоступления.Ссылка В(&ТекущиеПозиции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеПозиции.Позиция КАК Позиция
	|ИЗ
	|	ВсеПозиции КАК ВсеПозиции";
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТекущиеПозиции", ТекущиеПозиции);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	РазличныеПозиции.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Позиция"));
	
КонецПроцедуры

// Процедура заполняет аналитики шапки 
//
&НаСервере
Процедура ЗаполнитьШапкуПоОснованиюНаСервере()

	НеСинхронизировать		 = Объект.НеСинхронизировать;
	НеСинхронизироватьПериод = Объект.НеСинхронизироватьПериод;
	
	Объект.НеСинхронизировать		= Ложь;
	Объект.НеСинхронизироватьПериод = Ложь;
	
	РеквизитыОснования = Документы.бит_ОтражениеФактаДДС.РеквизитыОснования(Объект.ДокументОснование);

	Документы.бит_ОтражениеФактаДДС.ЗаполнитьАналитикиШапкиПоДаннымОснования(Объект, РеквизитыОснования);
	
	Объект.НеСинхронизировать		= НеСинхронизировать;
	Объект.НеСинхронизироватьПериод = НеСинхронизироватьПериод;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактическиеДанныеНаСервере()

	НеСинхронизировать		 = Объект.НеСинхронизировать;
	НеСинхронизироватьПериод = Объект.НеСинхронизироватьПериод;
	
	Объект.НеСинхронизировать		= Ложь;
	Объект.НеСинхронизироватьПериод = Ложь;
	
	РеквизитыОснования = Документы.бит_ОтражениеФактаДДС.РеквизитыОснования(Объект.ДокументОснование);
	
	Документы.бит_ОтражениеФактаДДС.ЗаполнитьАналитикиФактическихДанных(Объект, РеквизитыОснования);
	
	Объект.НеСинхронизировать		= НеСинхронизировать;
	Объект.НеСинхронизироватьПериод = НеСинхронизироватьПериод;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованию()

	НеСинхронизировать		 = Объект.НеСинхронизировать;
	НеСинхронизироватьПериод = Объект.НеСинхронизироватьПериод;
	
	Объект.НеСинхронизировать		= Ложь;
	Объект.НеСинхронизироватьПериод = Ложь;

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(Объект.ДокументОснование);
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	Объект.НеСинхронизировать		= НеСинхронизировать;
	Объект.НеСинхронизироватьПериод = НеСинхронизироватьПериод;
	
	ПодготовитьФормуНаСервере();

КонецПроцедуры

//  Функция проверяет наличие позиций в табл части ФактическиеДанные 
 //
&НаСервере
Функция ЕстьСсылкиНаПлатежныеПозиции()
	
	ЕстьСсылки = Ложь;
	
	Для каждого Стр Из Объект.ФактическиеДанные Цикл
		Если ЗначениеЗаполнено(Стр.Позиция) Тогда		
			ЕстьСсылки = Истина;
			Прервать;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьСсылки;
	
КонецФункции

&НаСервере
Функция ДанныеЗаполненияИзПозиции(Позиция, ТекущаяСтрока)

	НоваяСтрока = Новый Структура;
	НоваяСтрока.Вставить("Аналитика_1");
	НоваяСтрока.Вставить("Аналитика_2");
	НоваяСтрока.Вставить("Аналитика_3");
	НоваяСтрока.Вставить("Аналитика_4");
	НоваяСтрока.Вставить("Аналитика_5");
	НоваяСтрока.Вставить("Аналитика_6");
	НоваяСтрока.Вставить("Аналитика_7");
	НоваяСтрока.Вставить("Аналитика_8");
	НоваяСтрока.Вставить("Аналитика_9");
	НоваяСтрока.Вставить("Аналитика_10");
	НоваяСтрока.Вставить("Аналитика_11");
	НоваяСтрока.Вставить("Аналитика_12");
	НоваяСтрока.Вставить("ЦФО");
	НоваяСтрока.Вставить("СтатьяОборотов");
	НоваяСтрока.Вставить("Период");

	ЗаполнитьЗначенияСвойств(НоваяСтрока, Позиция);

	Если ИспользуетсяПлатежнаяПозиция Тогда		
		ОстатокПланирования = ОстатокПлатежнойПозиции(Позиция);		
	Иначе		
		ОстатокПланирования = ОстатокПозицииПоступления(Позиция);
	КонецЕсли;
	
	СтрокаРаспределения = Объект.ФактическиеДанные.НайтиПоИдентификатору(ТекущаяСтрока);
	Если ЕстьРасшифровкаПлатежа Тогда
		РезультатПоиска  = РасшифровкаПлатежа.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаРаспределения.ИдентификаторСтроки));
		СтрокаРасшифровки = РезультатПоиска[0];
		
		ВалютаВзаиморасчетов		  = СтрокаРасшифровки.ВалютаВзаиморасчетов;
		КурсЧислительВзаиморасчетов	  = СтрокаРасшифровки.КурсЧислительВзаиморасчетов;
		КурсЗнаменательВзаиморасчетов = СтрокаРасшифровки.КурсЗнаменательВзаиморасчетов;
	Иначе	
		
	КонецЕсли;
	
	Сумма = 0;
	Если ОстатокПланирования.Сумма <> 0 Тогда
		Коэффициенты = бит_Казначейство.ПолучитьКоэффициентыПересчетаВалюты(ВалютаВзаиморасчетов,
					Объект.ВалютаДокумента, Объект.Дата, Организация, КурсЧислительВзаиморасчетов, КурсЗнаменательВзаиморасчетов);
		
		Сумма = Коэффициенты.КоэффициентПересчетаВВалютуВзаиморасчетов * ОстатокПланирования.Сумма;
	КонецЕсли;
	
	НоваяСтрока.Вставить("СуммаОплаты", Сумма); 
	НоваяСтрока.Вставить("Период", 		Позиция.ДатаПлан); 
	
	Возврат НоваяСтрока;
									
КонецФункции

&НаСервере
Функция ОстатокПлатежнойПозиции(Позиция)

	Данные = Новый Структура("Валюта, Сумма", Объект.ВалютаДокумента, 0);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Позиция", Позиция);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланируемыйРасходДенежныхСредств.Позиция КАК Позиция,
	|	ПланируемыйРасходДенежныхСредств.СуммаОстаток КАК Сумма,
	|	ВЫБОР
	|		КОГДА ПлатежныеПозиции.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа)
	|			ТОГДА ПлатежныеПозиции.ВалютаДокумента
	|		ИНАЧЕ ПлатежныеПозиции.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК Валюта
	|ИЗ
	|	РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств.Остатки(, Позиция = &Позиция) КАК ПланируемыйРасходДенежныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежныеПозиции
	|		ПО ПланируемыйРасходДенежныхСредств.Позиция = ПлатежныеПозиции.Ссылка";
					   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Данные, Выборка);
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Функция ОстатокПозицииПоступления(Позиция)
	
	Данные = Новый Структура("Валюта, Сумма", Объект.ВалютаДокумента, 0);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Позиция", Позиция);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланируемоеПоступлениеДенежныхСредств.Позиция КАК Позиция,
	|	ПланируемоеПоступлениеДенежныхСредств.СуммаОстаток КАК Сумма,
	|	ВЫБОР
	|		КОГДА ПозицииПоступления.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа)
	|			ТОГДА ПозицииПоступления.ВалютаДокумента
	|		ИНАЧЕ ПозицииПоступления.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК Валюта
	|ИЗ
	|	РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.Остатки(, Позиция = &Позиция) КАК ПланируемоеПоступлениеДенежныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПозицияПоступления КАК ПозицииПоступления
	|		ПО ПланируемоеПоступлениеДенежныхСредств.Позиция = ПозицииПоступления.Ссылка";
					   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Данные, Выборка);
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьШапкуПоФактическимДаннымНаСервере()
	
	Если Объект.ФактическиеДанные.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли; 	
	
	Документы.бит_ОтражениеФактаДДС.ЗаполнитьАналитикиШапкиПоФактическимДанным(
		Объект.ДокументОснование.Метаданные(), Объект.ФактическиеДанные, Объект.Аналитики);
						
КонецПроцедуры

// Процедура вызывается по кнопке при изменении активной строки в таблице расшифровки платежа.
//
&НаКлиенте
Процедура ОтобразитьРаспределениеБюджета()
	
	Если Объект.НачатПереходНаНовуюАрхитектуру Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьРасшифровкаПлатежа Тогда
		СтрокаТаблицы =  Элементы.РасшифровкаПлатежа.ТекущиеДанные;
		
		Если СтрокаТаблицы <> Неопределено Тогда
			// Включаем отбор по ключу из текущей строки табличной части "РасшифровкаПлатежа".
			ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки", СтрокаТаблицы.ИдентификаторСтроки); 
			
			Элементы.ФактическиеДанные.ТолькоПросмотр = Ложь;
			Элементы.ФактическиеДанные.ОтборСтрок 	  = ОтборСтрок;
		Иначе
			// Текущая строка в таблице распределения платежа не установлена.
			Элементы.ФактическиеДанные.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	УстановитьУсловноеОформлениеШапка();
	УстановитьУсловноеОформлениеРасшифровкаПлатежа();
	УстановитьУсловноеОформлениеФактическиеДанные();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеШапка()

	// Распределено.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Разница");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Разница", ВидСравненияКомпоновкиДанных.Равно, 0);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.ЗеленыйЛес);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧЦ=15; ЧДЦ=2; ЧН=0");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Разница");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Разница", ВидСравненияКомпоновкиДанных.НеРавно, 0);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧЦ=15; ЧДЦ=2; ЧН=0");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеРасшифровкаПлатежа()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасшифровкаПлатежаДоговорКонтрагента");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"РасшифровкаПлатежа.ДоговорСЗаказчиком", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<Договор>';en='<Contract>'"));

	// РасшифровкаПлатежаСтатьяДвиженияДенежныхСредств.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасшифровкаПлатежаСтатьяДвиженияДенежныхСредств");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<Статья движения ден. средств>';en='<Article motion den. tools>'"));

	// РасшифровкаПлатежаРазница.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасшифровкаПлатежаРазница");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"РасшифровкаПлатежа.Разница", ВидСравненияКомпоновкиДанных.Равно, 0);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.ЗеленыйЛес);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧЦ=15; ЧДЦ=2; ЧН=0");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасшифровкаПлатежаРазница");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"РасшифровкаПлатежа.Разница", ВидСравненияКомпоновкиДанных.НеРавно, 0);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧЦ=15; ЧДЦ=2; ЧН=0");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасшифровкаПлатежаКурсЧислительВзаиморасчетов");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"РасшифровкаПлатежа.КурсЧислительВзаиморасчетов", ВидСравненияКомпоновкиДанных.Заполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасшифровкаПлатежаКурсЧислительВзаиморасчетов");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.НеСинхронизироватьСумму", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасшифровкаПлатежаКурсЧислительВзаиморасчетовТекст");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.НеСинхронизироватьСумму", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеФактическиеДанные()
	
	Разрезы = АналитическиеРазрезы();
	Для каждого Разрез Из Разрезы Цикл
		
		// Доступность аналитик
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ФактическиеДанные" + Разрез);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ФактическиеДанные." + Разрез + "Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);

		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<не требуется>';en='<Not required>'"));
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	КонецЦикла; 
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ФактическиеДанныеСтатьяОборотов");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ФактическиеДанные.СтатьяОборотов", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	//ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	//	"ОсновнаяСтатьяОборотов", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<Статья оборотов>';en='<Article speed>'"));
	
	//// Если статья в списке на заполнена, но есть в "шапке", покажем представление статьи шапки.
	//ЭлементУО = УсловноеОформление.Элементы.Добавить();
	//КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РаспределениеБюджетаСтатьяОборотов");
	//
	//ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	//	"ФактическиеДанные.СтатьяОборотов", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	//ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	//	"ОсновнаяСтатьяОборотов", ВидСравненияКомпоновкиДанных.Заполнено, "");
	//
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("ОсновнаяСтатьяОборотов"));

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ФактическиеДанныеПозиция");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ФактическиеДанные.Позиция", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	//ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	//	"ОсновнаяПлатежнаяПозиция", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<Документ планирования>';en='<Planning Document>'"));
	
	//// Если документ планирования в списке на заполнен, но есть в "шапке", покажем представление документа шапки.
	//ЭлементУО = УсловноеОформление.Элементы.Добавить();
	//КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РаспределениеБюджетаДокументПланирования");
	//
	//ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	//	"ФактическиеДанные.ДокументПланирования", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	//ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	//	"ОсновнаяПлатежнаяПозиция", ВидСравненияКомпоновкиДанных.Заполнено, "");
	//
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("ОсновнаяПлатежнаяПозиция"));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ОбновитьИтоги(КлючСтроки, Форма)

	Объект = Форма.Объект;
	
	Распределено 			   = 0;
	Разница					   = 0;
	РаспределеноВзаиморасчетов = 0;
	
	Для каждого СтрокаТаблицы Из Объект.ФактическиеДанные Цикл
		Если СтрокаТаблицы.ИдентификаторСтроки = КлючСтроки Тогда
			Распределено			   = Распределено + СтрокаТаблицы.СуммаОплаты;
			РаспределеноВзаиморасчетов = РаспределеноВзаиморасчетов + СтрокаТаблицы.СуммаВзаиморасчетов;
		КонецЕсли; 
	КонецЦикла; 

	Если Форма.ЕстьРасшифровкаПлатежа Тогда
		Для каждого СтрокаТаблицы Из Форма.РасшифровкаПлатежа Цикл
			Если СтрокаТаблицы.ИдентификаторСтроки = КлючСтроки Тогда
				СтрокаТаблицы.Распределено 				 = Распределено;
				СтрокаТаблицы.РаспределеноВзаиморасчетов = РаспределеноВзаиморасчетов;
				СтрокаТаблицы.Разница 	 				 = СтрокаТаблицы.Сумма - Распределено;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Форма.Распределено = Распределено;
	Форма.Разница      = Форма.СуммаДокумента - Распределено;
	
КонецПроцедуры

&НаСервере
Функция АналитическиеРазрезы()

	Разрезы = Новый Массив();
	Для Индекс = 1 По 12 Цикл
		Разрезы.Добавить("Аналитика_" + Индекс);
	КонецЦикла; 
	
	Возврат Разрезы;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьМодификациюВладельцаФормы()
		
	Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
		Если НЕ ВладелецМодифицирован = ВладелецФормы.Модифицированность Тогда
			ТолькоПросмотр 		  = ВладелецФормы.Модифицированность;
			ВладелецМодифицирован = ВладелецФормы.Модифицированность;
			Если ТолькоПросмотр Тогда
				Модифицированность = Ложь;
			КонецЕсли; 
			ПодготовитьФормуНаСервере();
		КонецЕсли; 
		ПодключитьОбработчикОжидания("ПроверитьМодификациюВладельцаФормы", 0.5, Истина);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыУстановкиСвойствАналитик(Форма, Префикс = "")

	Результат = бит_МеханизмДопИзмеренийКлиентСервер.ПараметрыУстановкиСвойствАналитикПоШаблону(
		Префикс + "Аналитика_", "Аналитика_", "СтатьяОборотов");
		
	Результат.ДопРеквизиты.Вставить("Организация", Форма.Организация);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ПриИзмененииСуммыПлатежаРаспределенияБюджета(Копирование = Ложь)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные;
	
	Если ЕстьРасшифровкаПлатежа Тогда
		ДанныеРасшифровки 	= Элементы.РасшифровкаПлатежа.ТекущиеДанные;
		СуммаОплаты 	  	= ДанныеРасшифровки.Сумма;
		ИдентификаторСтроки	= Элементы.ФактическиеДанные.ОтборСтрок.ИдентификаторСтроки;
	Иначе
		СуммаОплаты			= СуммаДокумента;
		ИдентификаторСтроки = "";
	КонецЕсли; 
	
	Итого = 0;
	Для каждого СтрокаТаблицы Из Объект.ФактическиеДанные Цикл
		Если СтрокаТаблицы.ИдентификаторСтроки = ИдентификаторСтроки Тогда
			Итого = СтрокаТаблицы.СуммаОплаты + Итого;
		КонецЕсли; 
	КонецЦикла; 
	
	Остаток = СуммаОплаты - Итого + ТекущиеДанные.СуммаОплаты;
	
	КонтролироватьПревышение = НЕ Объект.НеСинхронизироватьСумму;
	Если КонтролироватьПревышение Тогда
		Остаток = Макс(Остаток, 0);
		Если НЕ Копирование И Итого > СуммаОплаты Тогда
			Если ЕстьРасшифровкаПлатежа Тогда
				ТекстСообщения = НСтр("ru='Сумма распределенных платежей превышает сумму платежа. Остаток от распределения: %1.';
									  |en='The amount of distributed payment exceeds the amount of the payment. The residue from the distribution: %1.'");
			Иначе
				ТекстСообщения = НСтр("ru='Сумма распределенных платежей превышает сумму документа. Сумма документа: %1.';
									  |en='The amount of payments exceeds the amount distributed document. The amount of the document: %1.'"); 
			КонецЕсли;
			ТекстСообщения = СтрШаблон(ТекстСообщения, Формат(Остаток, "ЧДЦ=2; ЧН=")); 
			Индекс		   = Объект.ФактическиеДанные.Индекс(ТекущиеДанные);		
			Поле  		   = СтрШаблон("Объект.ФактическиеДанные[%1].СуммаОплаты", Формат(Индекс, "ЧН=0; ЧГ="));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, ); 
		КонецЕсли;
		Если ТекущиеДанные.СуммаОплаты <> 0 Тогда
			Остаток = Мин(ТекущиеДанные.СуммаОплаты, Остаток);
		КонецЕсли;
		ТекущиеДанные.СуммаОплаты = Остаток;
	КонецЕсли; 
	
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("КурсЧислительВзаиморасчетов", 	ТекущиеДанные.КурсЧислительВзаиморасчетов);
	ПараметрыПередачи.Вставить("КурсЗнаменательВзаиморасчетов", ТекущиеДанные.КурсЗнаменательВзаиморасчетов);
	ПараметрыПередачи.Вставить("СуммаВзаиморасчетов", 			ТекущиеДанные.СуммаВзаиморасчетов);
	ПараметрыПередачи.Вставить("Сумма", 						ТекущиеДанные.СуммаОплаты);
	
	ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
		ПараметрыПередачи, Объект.ВалютаДокумента, ВалютаРеглУчета);
		
	ТекущиеДанные.СуммаВзаиморасчетов = ПараметрыПередачи.СуммаВзаиморасчетов; 	

	ОбновитьИтоги(ТекущиеДанные.ИдентификаторСтроки, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()
	
	Для каждого СтрокаТаблицы Из Объект.ФактическиеДанные Цикл
		ЗаполнитьДобавленныеКолонкиСтроки(СтрокаТаблицы); 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиСтроки(СтрокаТаблицы)
	
	СтатьяОборотов = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
	
	// Если в "аналитиках шапки" выбрана статья оборотов, но не выбрана в "распределении",
	// наследуем ее настройки.
	Если ЗначениеЗаполнено(СтрокаТаблицы.СтатьяОборотов) Тогда
		СтатьяОборотов = СтрокаТаблицы.СтатьяОборотов;
	Иначе	
	//	СтатьяОборотов = ОсновнаяСтатьяОборотов;
		Возврат;
	КонецЕсли; 
	
	СвойстваСтатьи = бит_БюджетированиеПовтИспСервер.ПолучитьСвойстваСтатьи(СтатьяОборотов);
	Разрезы = АналитическиеРазрезы(); 
	
	Для каждого Разрез Из Разрезы Цикл
		СтрокаТаблицы[Разрез + "Доступность"] = СвойстваСтатьи[Разрез];
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Процедура ИзменениеСтатьиОборотовНаСервере(ИД)

	СтрокаТаблицы = Объект.ФактическиеДанные.НайтиПоИдентификатору(ИД); 
	
	бит_МеханизмДопИзмерений.УстановитьСвойстваАналитикСтрокиПриИзмененииСтатьиОборотов(
				ЭтотОбъект, СтрокаТаблицы, ПараметрыУстановкиСвойствАналитик(ЭтотОбъект, "ФактическиеДанные"));
	ЗаполнитьДобавленныеКолонкиСтроки(СтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборПлатежнойПозиции(ДокументПланирования, Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Отборы = Новый Структура;
	Отборы.Вставить("Организация", 			 Организация);
	Отборы.Вставить("ХозяйственнаяОперация", ХозяйственнаяОперацияБФ);
	Отборы.Вставить("ТекущаяСтрока", 		 ДокументПланирования);
	Отборы.Вставить("ВидПлана", 		  	 ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.План"));
	
	ПараметрыПередачи = Новый Структура("Отбор", Отборы);

	ОткрытьФорму("Документ.бит_кзн_ПлатежнаяПозиция.ФормаВыбора", ПараметрыПередачи, Элемент, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборПланируемогоПоступленияДС(ДокументПланирования, Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Отборы = Новый Структура;
	Отборы.Вставить("Организация", 			 Организация);
	Отборы.Вставить("ТекущаяСтрока", 		 ДокументПланирования);
	
	ПараметрыПередачи = Новый Структура("Отбор", Отборы);

	ОткрытьФорму("Документ.бит_кзн_ПозицияПоступления.ФормаВыбора", ПараметрыПередачи, Элемент, ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьРасшифровкуПлатежа()
	
	РасшифровкаПлатежа.Очистить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасшифровкаПлатежа.НомерСтроки КАК ИДСтроки,
	|	РасшифровкаПлатежа.НомерСтроки КАК НомерСтрокиДокумента,
	|	РасшифровкаПлатежа.Сумма КАК Сумма,
	|	РасшифровкаПлатежа.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РасшифровкаПлатежа.Ссылка КАК Документ,
	|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКредитаДепозита,
	|	НЕОПРЕДЕЛЕНО КАК ОбъектРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАренды,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорСЗаказчиком,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	РасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	РасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
	|	РасшифровкаПлатежа.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РасшифровкаПлатежа.КурсЧислительВзаиморасчетов КАК КурсЧислительВзаиморасчетов,
	|	РасшифровкаПлатежа.КурсЗнаменательВзаиморасчетов КАК КурсЗнаменательВзаиморасчетов
	|ИЗ
	|	#РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|ГДЕ
	|	РасшифровкаПлатежа.Ссылка = &ТекущийОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиДокумента";
	
	ОбъектСсылка	 = Объект.ДокументОснование;
	МетаданныеСсылки = ОбъектСсылка.Метаданные().ТабличныеЧасти.РасшифровкаПлатежа;
	
	ЕстьДоговорКредитаДепозита = ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКредитаДепозита", МетаданныеСсылки);
	Если ЕстьДоговорКредитаДепозита Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕОПРЕДЕЛЕНО КАК ДоговорКредитаДепозита",
			"ДоговорКредитаДепозита КАК ДоговорКредитаДепозита");
	КонецЕсли; 
	
	ЕстьОбъектРасчетов = ОбщегоНазначения.ЕстьРеквизитОбъекта("ОбъектРасчетов", МетаданныеСсылки);
	Если ЕстьОбъектРасчетов Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕОПРЕДЕЛЕНО КАК ОбъектРасчетов",
			"ОбъектРасчетов КАК ОбъектРасчетов");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕОПРЕДЕЛЕНО КАК Договор",
			"ОбъектРасчетов.Договор КАК Договор");
	КонецЕсли;
	
	ЕстьДоговорАренды = ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорАренды", МетаданныеСсылки);
	Если ЕстьДоговорАренды Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕОПРЕДЕЛЕНО КАК ДоговорАренды",
			"ДоговорАренды КАК ДоговорАренды");
	КонецЕсли;
	
	ЕстьДоговорСЗаказчиком = ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорСЗаказчиком", МетаданныеСсылки);
	Если ЕстьДоговорСЗаказчиком Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕОПРЕДЕЛЕНО КАК ДоговорСЗаказчиком",
			"ДоговорСЗаказчиком КАК ДоговорСЗаказчиком");
	КонецЕсли;
		
	Путь = ОбъектСсылка.Метаданные().ПолноеИмя();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#РасшифровкаПлатежа", Путь + ".РасшифровкаПлатежа");			   
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийОбъект", ОбъектСсылка);
	Запрос.Текст = ТекстЗапроса;
	Результат 	 = Запрос.Выполнить();
	Выборка   	 = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(РасшифровкаПлатежа.Добавить(), Выборка);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКурсКратностьТекстом()
	
	Для каждого СтрокаТаблицы Из РасшифровкаПлатежа Цикл
		ДенежныеСредстваКлиентСервер.СформироватьКурсЗнаменательТекстом(СтрокаТаблицы, Объект.ВалютаДокумента, ВалютаРеглУчета);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаПлатежаКурсЧислительВзаиморасчетовПриИзмененииНаСервере()

	ТекущаяСтрокаРасшифровки = РасшифровкаПлатежа.НайтиПоИдентификатору(Элементы.РасшифровкаПлатежа.ТекущаяСтрока);
	
	ПараметрыОтборы = Новый Структура("ИдентификаторСтроки", ТекущаяСтрокаРасшифровки.ИдентификаторСтроки);
	
	СтрокиФактическихДанных = Объект.ФактическиеДанные.НайтиСтроки(ПараметрыОтборы);
	
	Для каждого СтрокаТаблицы Из СтрокиФактическихДанных Цикл
		
		СтрокаТаблицы.КурсЧислительВзаиморасчетов = ТекущаяСтрокаРасшифровки.КурсЧислительВзаиморасчетов;

		ПараметрыПередачи = Новый Структура;
		ПараметрыПередачи.Вставить("КурсЧислительВзаиморасчетов", 	СтрокаТаблицы.КурсЧислительВзаиморасчетов);
		ПараметрыПередачи.Вставить("КурсЗнаменательВзаиморасчетов", СтрокаТаблицы.КурсЗнаменательВзаиморасчетов);
		ПараметрыПередачи.Вставить("СуммаВзаиморасчетов", 			СтрокаТаблицы.СуммаВзаиморасчетов);
		ПараметрыПередачи.Вставить("Сумма", 						СтрокаТаблицы.СуммаОплаты);
		
		ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
			ПараметрыПередачи, Объект.ВалютаДокумента, ВалютаРеглУчета);
			
		СтрокаТаблицы.СуммаВзаиморасчетов = ПараметрыПередачи.СуммаВзаиморасчетов; 	
	КонецЦикла;
	
	ДенежныеСредстваКлиентСервер.СформироватьКурсЗнаменательТекстом(ТекущаяСтрокаРасшифровки, 
		Объект.ВалютаДокумента, ВалютаРеглУчета);

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменнениеНеСинхронизироватьСумму()

	РеквизитыДокументаОснования = Документы.бит_ОтражениеФактаДДС.РеквизитыОснования(Объект.ДокументОснование);
	
	ФактическиеДанные = Объект.ФактическиеДанные.Выгрузить();
	Документы.бит_ОтражениеФактаДДС.ИнициироватьФактическиеДанные(
		РеквизитыДокументаОснования.РасшифровкаПлатежа, ФактическиеДанные, Объект);
		
	Объект.ФактическиеДанные.Загрузить(ФактическиеДанные);
	
	Если ЕстьРасшифровкаПлатежа Тогда
		Для каждого СтрокаТаблицы Из РасшифровкаПлатежа Цикл
			ПараметрыОтбора	  = Новый Структура("ИдентификаторСтроки", СтрокаТаблицы.ИдентификаторСтроки);
			РезультатПоиска = Объект.ФактическиеДанные.НайтиСтроки(ПараметрыОтбора);
			Если ЗначениеЗаполнено(РезультатПоиска) Тогда
				Запись = РезультатПоиска[0];	
				СтрокаТаблицы.КурсЧислительВзаиморасчетов	= Запись.КурсЧислительВзаиморасчетов;
				СтрокаТаблицы.КурсЗнаменательВзаиморасчетов = Запись.КурсЗнаменательВзаиморасчетов;
			КонецЕсли;
			ОбновитьИтоги(СтрокаТаблицы.ИдентификаторСтроки, ЭтотОбъект);
		КонецЦикла;
		ЗаполнитьКурсКратностьТекстом();
	Иначе
		ОбновитьИтоги("", ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
