
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.ПланыСчетов.бит_Дополнительный_4;
		
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	бит_РаботаСДиалогамиСервер.ЗаполнитьПараметрыСпискаПланаСчетов(ЭтотОбъект);
	
	ИмяПланаСчетов = СтрЗаменить(Список.ОсновнаяТаблица, "ПланСчетов.", "");
	
	// Выведем установленный заголовок.
    бит_НазначениеСинонимовОбъектов.ВывестиЗаголовокФормы(МетаданныеОбъекта, ЭтотОбъект, Перечисления.бит_ВидыФормОбъекта.Списка);
														 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПланСчетовПриемник"   , ИмяПланаСчетов);
	ПараметрыФормы.Вставить("ЗаполнениеПоУмолчанию", Истина);
	ОткрытьФорму("Обработка.бит_ЗаполнитьПланСчетовПоПлануСчетов.Форма", ПараметрыФормы, ЭтотОбъект, "ЗаполнитьПоУмолчанию_4");

	Элементы.Список.Обновить();
			
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПлануСчетов(Команда)
	
	ПараметрыФормы = Новый Структура("ПланСчетовПриемник", ИмяПланаСчетов);
	ОткрытьФорму("Обработка.бит_ЗаполнитьПланСчетовПоПлануСчетов.Форма", ПараметрыФормы, ЭтотОбъект, "ЗаполнитьПоПлануСчетов_4");

	Элементы.Список.Обновить();
	
КонецПроцедуры

#Область бит_ОбработчикиКомандРаботаСExcel

&НаКлиенте
Процедура ЗагрузитьЧерезТабДок(Команда)
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("РежимЗагрузки",  ПредопределенноеЗначение("Перечисление.бит_РежимыЗагрузки.ПланСчетов"));
    ПараметрыФормы.Вставить("ИмяПланаСчетов", "бит_Дополнительный_4");
    
    ОткрытьФорму("Обработка.бит_ЗагрузкаДанныхИзТабличногоДокумента.Форма", ПараметрыФормы, ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
    
КонецПроцедуры

#КонецОбласти

#КонецОбласти

