
&ИзменениеИКонтроль("ДобавитьНоменклатуруВСегмент")
Процедура бит_ДобавитьНоменклатуруВСегмент(Сегмент, Номенклатура, Характеристика = Неопределено)

	Запись = РегистрыСведений.НоменклатураСегмента.СоздатьМенеджерЗаписи();
	Запись.Сегмент = Сегмент;
	Запись.Номенклатура = Номенклатура;
	Если Характеристика = Неопределено Тогда
		Запись.Характеристика = Характеристика;
	КонецЕсли;
	#Вставка     
	// косяк релиза
	Если Характеристика <> Неопределено Тогда
		Запись.Характеристика = Характеристика;
	КонецЕсли;
	#КонецВставки

	Запись.Записать();

КонецПроцедуры
