
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	СтрПеречисление = бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений);
	
	СтрПеречисления = Новый Структура("бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений", СтрПеречисление);
	
	мКэшЗначений = Новый Структура("Перечисления",СтрПеречисления);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьСообщения(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", мКэшЗначений.Перечисления.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.ОтправитьОповещения);
	
	ОткрытьФорму("Обработка.бит_ОбработкаЗаписейРегистраОповещений.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтправленные(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", мКэшЗначений.Перечисления.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.Удалить);
	
	ОткрытьФорму("Обработка.бит_ОбработкаЗаписейРегистраОповещений.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатус(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", мКэшЗначений.Перечисления.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.ИзменитьСтатус);
	
	ОткрытьФорму("Обработка.бит_ОбработкаЗаписейРегистраОповещений.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
