#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПередЗаписью(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа И НЕ ЗначениеЗаполнено(Родитель) Тогда
		// Нельзя создавать новые элементы в корне справочника.
		ТекстСообщения = НСтр("ru='На первом уровне иерархии распологаются группы (описание регистров).';
						 	  |en='On the first level of the hierarchy are placed group (register description).'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,,, Отказ);
	КонецЕсли;	
	
	// Проверим, нет ли реквизита с таким именем, или группы реквизитов с таким именем.
	Если ЭтоГруппа Тогда
		ПроверитьДубли(Ложь, Отказ);
	Иначе
		// Необходимо проверить дубль для текущего родителя.
		ПроверитьДубли(Истина, Отказ)			
	КонецЕсли;
	
	// Запретим перенос элементов между группами.
	Если НЕ Ссылка.Пустая() И Родитель <> Ссылка.Родитель Тогда
		ТекстСообщения = НСтр("ru='Перенос элементов между группами справочника запрещен';
							  |en='The transfer element between the reference groups banned'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "Родитель",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДубли(ИскатьВГруппе, Отказ)
	
	Если ИскатьВГруппе Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	бит_ВидыРеквизитовДвижений.Ссылка
		|ИЗ
		|	Справочник.бит_ВидыРеквизитовДвижений КАК бит_ВидыРеквизитовДвижений
		|ГДЕ
		|	бит_ВидыРеквизитовДвижений.Наименование = &Наименование
		|	И бит_ВидыРеквизитовДвижений.Родитель В ИЕРАРХИИ(&Родитель)
		|	И бит_ВидыРеквизитовДвижений.Ссылка <> &Ссылка";
		
		ТекстСообщения = НСтр("ru='Для регистра ""%1"" реквизит с таким наименованием уже задан';
							  |en='To register ""%1"" props with this name already defined'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Родитель);  				   
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	бит_ВидыРеквизитовДвижений.Ссылка
		|ИЗ
		|	Справочник.бит_ВидыРеквизитовДвижений КАК бит_ВидыРеквизитовДвижений
		|ГДЕ
		|	бит_ВидыРеквизитовДвижений.Наименование = &Наименование
		|	И бит_ВидыРеквизитовДвижений.Ссылка <> &Ссылка
		|	И ЭтоГруппа";
		
		ТекстСообщения = НСтр("ru='Группа с таким нименованием существует';
							  |en='Group with nimenovaniem there'");
	КонецЕсли; 
	
	Запрос = Новый Запрос(); 
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Родитель",     Родитель);
	Запрос.УстановитьПараметр("Ссылка",       Ссылка);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		// Сообщим о том, что операция невозможна
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", "КОРРЕКТНОСТЬ", "Наименование",,, ТекстСообщения);		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "Наименование",, Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли