#Область ПрограммныйИнтерфейс

Функция СоответствиеПоляПеречисляемыхТипов() Экспорт
	
	Результат = Новый Соответствие;
	
	#Область СистемнаяИнформация
	ОписаниеПолей = Новый Массив;
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ВерсияОС";
	ОписаниеПоля["ИмяНаАнглийском"] = "OSVersion";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ВерсияПриложения";
	ОписаниеПоля["ИмяНаАнглийском"] = "AppVersion";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ТипПлатформы";
	ОписаниеПоля["ИмяНаАнглийском"] = "PlatformType";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ОперативнаяПамять";
	ОписаниеПоля["ИмяНаАнглийском"] = "RAM";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "Процессор";
	ОписаниеПоля["ИмяНаАнглийском"] = "Processor";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ИдентификаторКлиента";
	ОписаниеПоля["ИмяНаАнглийском"] = "ClientID";
	ОписаниеПолей.Добавить(ОписаниеПоля);

	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ИнформацияПрограммыПросмотра";
	ОписаниеПоля["ИмяНаАнглийском"] = "UserAgentInformation";
	ОписаниеПолей.Добавить(ОписаниеПоля);

	Результат.Вставить(Тип("СистемнаяИнформация"), ОписаниеПолей);
	#КонецОбласти
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеПоляПеречисляемогоТипа()
	
	Результат = Новый Структура;
	Результат.Вставить("Имя");
	Результат.Вставить("ИмяНаАнглийском");
	Результат.Вставить("Тип", Тип("Строка"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
