
&После("ПередЗаписью")
Процедура бит_ПередЗаписью(Отказ)  

//1БИТ ЛТ13 KAKravchenko@1cbit.ru 11.12.2024 +

	// Первыйбит ЛТ13 доп. ЛапшовГ "GVLapshov@1cbit.ru" 05.05.2025 +
	// Отключение проверки исторических данных
	Если Не ЗначениеЗаполнено(Номер) Тогда 
	// Первыйбит ЛТ13 доп. ЛапшовГ "GVLapshov@1cbit.ru" 05.05.2025 -
	
	//Создаю номер при первой записи
	Если бит_НомерДоговора = 0 И ЭтоНовый() Тогда 
		
		бит_НомерДоговора = бит_ПолучитьНовыйНомерДоговора();
		
		Если ЗначениеЗаполнено(бит_Префикс) Тогда
			Номер = бит_Префикс + "/" + СтрЗаменить(Строка(бит_НомерДоговора),Символы.НПП, ""); 
		Иначе  
			Номер = СтрЗаменить(Строка(бит_НомерДоговора),Символы.НПП, "");
		КонецЕсли;
	КонецЕсли;   
	
	//Проверяю уникальность номера
	Если НЕ бит_НомерДоговораУникален(бит_НомерДоговора, Ссылка) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Номер договора не уникален! (ЛТ 13)";
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	
	// Первыйбит ЛТ13 доп. ЛапшовГ "GVLapshov@1cbit.ru" 05.05.2025 +
	КонецЕсли;  
	// Первыйбит ЛТ13 доп. ЛапшовГ "GVLapshov@1cbit.ru" 05.05.2025 -  
	
//1БИТ ЛТ13 KAKravchenko@1cbit.ru 11.12.2024 -
	
КонецПроцедуры 

Функция бит_ПолучитьНовыйНомерДоговора()
	
//1БИТ ЛТ13 KAKravchenko@1cbit.ru 11.12.2024 +	
	МаксимальныйНомер = 0;
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.бит_НомерДоговора КАК бит_НомерДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_НомерДоговора УБЫВ");

		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		МаксимальныйНомер = Выборка.бит_НомерДоговора;
	КонецЦикла;
	
	Возврат МаксимальныйНомер + 1; 
//1БИТ ЛТ13 KAKravchenko@1cbit.ru 11.12.2024 -	

КонецФункции  

Функция бит_НомерДоговораУникален(НомерДоговора, Ссылка)
	
//1БИТ ЛТ13 KAKravchenko@1cbit.ru 11.12.2024 +	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.Ссылка = &Ссылка
		|	И ДоговорыКонтрагентов.бит_НомерДоговора = &Номер");

	Запрос.УстановитьПараметр("Номер", НомерДоговора);
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
//1БИТ ЛТ13 KAKravchenko@1cbit.ru 11.12.2024 -	

КонецФункции 

