
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПроверитьВключитьСинхронизациюДанных();
	
	УзлыАудиторскойВыгрузки = УзлыАудиторскойВыгрузки();
	КоличествоУзловАудита   = УзлыАудиторскойВыгрузки.Количество();
	
	Если КоличествоУзловАудита = 0 Тогда
		ПараметрыПомощника = Новый Структура;
		ПараметрыПомощника.Вставить("ИмяПланаОбмена",         "бит_АудиторскаяВыгрузка");
		ПараметрыПомощника.Вставить("ИдентификаторНастройки", "");
		ПараметрыПомощника.Вставить("НастройкаНовойСинхронизации");
		
		ОткрытьФорму("Обработка.ПомощникСозданияОбменаДанными.Форма.НастройкаСинхронизации", ПараметрыПомощника);
	ИначеЕсли КоличествоУзловАудита = 1 Тогда
		УзелВыгрузки = УзлыАудиторскойВыгрузки[0];
		Если НастройкаСинхронизацииЗавершена(УзелВыгрузки) Тогда
			// АПК:278-выкл вызов типового служебного интерфейса.
			ОбменДаннымиКлиент.ВыполнитьОбменДаннымиОбработкаКоманды(УзелВыгрузки, УзелВыгрузки);
			// АПК:278-вкл
		Иначе
			ПараметрыПомощника = Новый Структура;
			ПараметрыПомощника.Вставить("УзелОбмена", УзелВыгрузки);
			
			ОткрытьФорму("Обработка.ПомощникСозданияОбменаДанными.Форма.НастройкаСинхронизации", ПараметрыПомощника);
		КонецЕсли;
	Иначе
		// ++ ЕРП
		ОткрытьФорму("ОбщаяФорма.СинхронизацияДанныхБазовая");
		// -- ЕРП
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьВключитьСинхронизациюДанных()
	
	Если НЕ Константы.ИспользоватьСинхронизациюДанных.Получить() Тогда
		Константы.ИспользоватьСинхронизациюДанных.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УзлыАудиторскойВыгрузки()
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АудиторскаяВыгрузка.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.бит_АудиторскаяВыгрузка КАК АудиторскаяВыгрузка
	|ГДЕ
	|	НЕ АудиторскаяВыгрузка.ПометкаУдаления
	|	И НЕ АудиторскаяВыгрузка.ЭтотУзел";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивУзлов;
	КонецЕсли;
	
	МассивУзлов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивУзлов;
	
КонецФункции

&НаСервере
Функция НастройкаСинхронизацииЗавершена(Знач УзелВыгрузки)
	
	Возврат ОбменДаннымиСервер.НастройкаСинхронизацииЗавершена(УзелВыгрузки);
	
КонецФункции

#КонецОбласти