
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПравилоЗаполненияПриИзменении(Элемент)
	
	ПриИзмененииПравилаЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.РегистрНакопления"));
	СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.РегистрБухгалтерии"));
	
	ОткрытьФормуВыбораОбъектаСистемы(Элемент, Запись.Источник, СписокВидовОбъектов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.РегистрНакопления"));
	СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.РегистрБухгалтерии"));
	
	ОткрытьФормуВыбораОбъектаСистемы(Элемент, Запись.Приемник, СписокВидовОбъектов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
	
	ОткрытьФормуВыбораОбъектаСистемы(Элемент, Запись.ОбъектСистемы, СписокВидовОбъектов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораОбъектаСистемы(Элемент, ТекущееЗначение, ВидыОбъектов)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы", ТекущееЗначение);
	ПараметрыФормы.Вставить("ВидыОбъектов"        , ВидыОбъектов);
	
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПравилаЗаполнения()
	
	Если ЗначениеЗаполнено(Запись.ПравилоЗаполнения) Тогда
		
		Запись.Источник = Запись.ПравилоЗаполнения.Источник;
		Запись.Приемник = Запись.ПравилоЗаполнения.Приемник;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

