#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
#Область ОбновлениеИнформационнойБазы

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция получает остатки из регистра Планируемые затраты.
//
// Параметры:
//   СводнаяЗаявка - ДокументСсылка.бит_пз_СводнаяЗаявка
//
// Возвращаемое значение:
//  СтрОплата - Структура.
//
Функция ПолучитьОстатки(СводнаяЗаявка) Экспорт

	СтрОплата = Новый Структура("КоличествоПлан, КоличествоФакт, КоличествоОстаток",0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", СводнаяЗаявка);
	Запрос.УстановитьПараметр("Организация"         , СводнаяЗаявка.Организация);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатраты.КоличествоКонечныйОстаток, 0)) КАК КоличествоОстаток,
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатраты.КоличествоПриход, 0)) КАК КоличествоПлан,
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатраты.КоличествоРасход, 0)) КАК КоличествоФакт
	               |ИЗ
	               |	Документ.бит_пз_СводнаяЗаявкаНаЗатраты.ЗаявкиНаЗатраты КАК ТЧСводнаяЗаявка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_пз_ПланируемыеЗатраты.ОстаткиИОбороты(, , , , Организация = &Организация) КАК ПланируемыеЗатраты
	               |		ПО ТЧСводнаяЗаявка.Ссылка = ПланируемыеЗатраты.ДокументПланирования
	               |			И ТЧСводнаяЗаявка.ЗаявкаНаЗатраты = ПланируемыеЗатраты.ЗаявкаНаЗатраты
	               |			И ТЧСводнаяЗаявка.Номенклатура = ПланируемыеЗатраты.Номенклатура
	               |			И ТЧСводнаяЗаявка.Характеристика = ПланируемыеЗатраты.Характеристика
	               |ГДЕ
	               |	ТЧСводнаяЗаявка.Ссылка = &ДокументПланирования";
				   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		СтрОплата.КоличествоПлан    = ?(ЗначениеЗаполнено(Выборка.КоличествоПлан), Выборка.КоличествоПлан, 0);
		СтрОплата.КоличествоФакт    = ?(ЗначениеЗаполнено(Выборка.КоличествоФакт), Выборка.КоличествоФакт, 0);
		СтрОплата.КоличествоОстаток = ?(ЗначениеЗаполнено(Выборка.КоличествоОстаток), Выборка.КоличествоОстаток, 0);
	
	КонецЕсли; 

	Возврат СтрОплата;
	
КонецФункции // ПолучитьОстатки()

// Функция определяет новый статус объекта в зависимости от режима записи документа
//и предыдущего статуса. Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_пз_ЗаявкаНаЗатраты.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   НовыйСтатус - СправочникСсылка.бит_СтатусыОбъектов.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Если ПараметрыУстановкиСтатуса.ТекущийСтатус = Справочники.бит_СтатусыОбъектов.Закрыт Тогда
		Возврат ПараметрыУстановкиСтатуса.ТекущийСтатус;
	КонецЕсли;
		
	Если ПараметрыУстановкиСтатуса.ПараметрыОплаты = Неопределено Тогда
		СтруктураОплаты = ПолучитьОстатки(ТекущийОбъект.Ссылка);
	Иначе	
		СтруктураОплаты = ПараметрыУстановкиСтатуса.ПараметрыОплаты;
	КонецЕсли;
	
	РежимЗаписи = ПараметрыУстановкиСтатуса.РежимЗаписи;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		ИЛИ (РежимЗаписи = РежимЗаписиДокумента.Запись И НЕ ТекущийОбъект.Проведен) Тогда
		Возврат Справочники.бит_СтатусыОбъектов.Черновик;
	КонецЕсли;
	
	СсылкаНаОбъект = ТекущийОбъект.Ссылка;
	
	ОтменаСводнойЗаявки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущийОбъект.ДополнительныеСвойства, "ОтменаСводнойЗаявки", Ложь);
	
	Если бит_ВизированиеСервер.ЕстьБлокирующиеРешения(СсылкаНаОбъект) Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Отклонен;
		
	ИначеЕсли СтруктураОплаты.КоличествоОстаток <= 0.01 И СтруктураОплаты.КоличествоФакт > 0 Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.ЗаявкаНаЗатраты_Исполнена;
		
	ИначеЕсли СтруктураОплаты.КоличествоФакт > 0 Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.ЗаявкаНаЗатраты_ЧастичноИсполнена;
		
	ИначеЕсли бит_ВизированиеСервер.ВсеВизыСогласованы(СсылкаНаОбъект) Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Утвержден;
		
	КонецЕсли;
	
	Возврат Справочники.бит_СтатусыОбъектов.НаСогласовании;
	
КонецФункции

#КонецОбласти

#КонецЕсли
