#Область ОписаниеПеременных

&НаКлиенте
Перем ТекущаяСтрока Экспорт;

&НаКлиенте
Перем НаборыДанныхИдентификаторПоследнейВыделеннойСтроки Экспорт;

&НаКлиенте
Перем СвязиНаборовДанныхИдентификаторПоследнейВыделеннойСтроки Экспорт;

&НаКлиенте
Перем НаборыДанныхСтароеИмя Экспорт;

&НаКлиенте
Перем ВариантыИдентификаторПоследнейВыделеннойСтроки Экспорт;

&НаКлиенте
Перем ПоляНаборовДанныхИдентификаторПоследнейВыделеннойСтроки Экспорт;

&НаКлиенте
Перем ПредыдущийИдентификатор Экспорт;

&НаКлиенте
Перем ПредыдущаяСтраница Экспорт;

&НаКлиенте
Перем ЗакрытиеРазрешено;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьСхемуКомпоновкиДанныхИзТекста(Параметры.XMLТекст);
	ЗагрузитьСхемуКомпоновкиДанныхВДанныеФормы();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(НаборыДанных.ПолучитьЭлементы()) Тогда
		
		НоваяСтрока = ИсточникиДанных.Добавить();
		НоваяСтрока.Имя = "ИсточникДанных1";
		
	КонецЕсли;
	
	ОбновитьСписокДоступныхИсточников();
	ПослеЗагрузкиСхемыКомпоновкиДанных();
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТекущиеДанные = Элементы.ВложенныеСхемы.ТекущиеДанные;
	ТекущиеДанные.Схема = ИТК_СКД.XMLТекстИзАдреса(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Истина Тогда
		
		Если Модифицированность Тогда
			
			ТекстПредупреждения = НСтр("ru = 'Имеются несохраненные данные, они будут потеряны.
                                        |Для сохранения изменений нажмите ""Продолжить работу"", сохраните данные, а потом завершите работу.';
                                        |en = 'There is unsaved data, it will be lost.
                                        |To save changes, click Continue, save the data, and then exit.'");
			
			Отказ = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗакрытиеРазрешено = Неопределено Тогда
			
			Отказ = Истина;
			ЗапуститьОбработчикСПроверкойНаСохранностьДанных(Новый ОписаниеОповещения("ОбработчикЗакрытиеРазрешеноЗакрыть", ЭтотОбъект));

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ИТК_РедакторКодаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОшибкаТекстНажатие(Элемент)
	
	ПоказатьОшибку();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ПредыдущаяСтраница = Элементы.СтраницаНастройки Тогда
		СохранитьИзмененныеДанныеСтрокиВариантаНастроек();
	КонецЕсли;
	
	ТекущаяСтраница = Элемент.ТекущаяСтраница;
	Если ТекущаяСтраница = Элементы.СтраницаРесурсы Тогда
		
		ОбновитьДоступныеПоляРесурсов();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПараметры Тогда
		
		ОбновитьПараметры();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаНастройки Тогда
		
		ЗагрузитьДанныеВариантаНастроек();
		
	КонецЕсли;
	
	ПредыдущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборыДанныхИмяОбъектаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ИТК_Строки.НекорректныйИдентификатор(Текст) Тогда 
		
		СтандартнаяОбработка = Ложь;
		Элемент.ОбновитьТекстРедактирования();
		
		ТекстПредупреждения = НСтр("ru = 'Некорректное имя!
                                  |Имя должно состоять из слова,
                                  |Начинаться с буквы и не содержать специальных символов кроме ""_"".';
                                  |en = 'Invalid name!
                                  |The name must be composed of a word,
                                  |Start with a letter and contain no special characters other than ""_"".'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияПредупрежденияНекорректноеИмяОбъектаНабораДанных", ЭтотОбъект);
		ПоказатьПредупреждение(ОписаниеОповещения, ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИТК_ПодключаемыйРедакторПриИзменении(Элемент)
	
	ИзмененТекстЗапроса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИТК_ПодключаемыйДокументСформирован(Элемент)
	
	ИТК_РедакторКодаКлиент.ДополнительнаяИнициализация(ЭтотОбъект, Элемент);
	
	ПодключаемыйЗагрузитьСостояниеРедактораЗапроса();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИТК_ПодключаемыйПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаТекстЗапросаПриИзменении", ЭтотОбъект);
	ИТК_РедакторКодаКлиент.ОбработкаСобытий(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДереваНаборыДанных

&НаКлиенте
Процедура НаборыДанныхПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	НаборыДанныхИдентификаторТекущейСтроки = Элемент.ТекущаяСтрока;
	
	Если НаборыДанныхИдентификаторПоследнейВыделеннойСтроки <> НаборыДанныхИдентификаторТекущейСтроки Тогда 
		
		НаборыДанныхИдентификаторПоследнейВыделеннойСтроки = НаборыДанныхИдентификаторТекущейСтроки;
		
		ПодключаемыйЗагрузитьСостояниеРедактораЗапроса();
		
		Если ТекущаяСтрока = Неопределено Тогда
			ТекущаяСтрокаВид = Неопределено;
		Иначе
			ТекущаяСтрокаВид = ТекущаяСтрока.Вид;
		КонецЕсли;

		Если ТекущаяСтрокаВид = ИТК_Перечисления.СКДНаборДанныхОбъединение() Тогда
				
			ЗаполнитьПоляНабораДанныхОбъединение(НаборыДанныхИдентификаторТекущейСтроки);
			
		ИначеЕсли ТекущаяСтрокаВид = ИТК_Перечисления.СКДНаборДанныхЗапрос() Тогда
			
			ЭлементТекст = Элементы.ТекстЗапроса;
			Если ИТК_РедакторКодаКлиент.ТребуетсяПервоначальнаяИнициализация(ЭлементТекст) Тогда
				
				ИнициализацияРедактораЗапроса();
				ИТК_РедакторКодаКлиент.Инициализация(ЭтотОбъект, "ТекстЗапроса");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НаборыДанныхПриИзменении(Элемент)
	
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборыДанныхПередУдалением(Элемент, Отказ)
	
	ОбработкаУдалениеНабораДанных(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборыДанныхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда 
		Возврат;
	КонецЕсли;
	
	НаборыДанныхСтароеИмя = Элемент.ТекущиеДанные["Представление"];
	
КонецПроцедуры

&НаКлиенте
Процедура НаборыДанныхПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьКоличествоВЗаголовке(Элемент);
	ОбработкаПереименованияНабораДанных(Элемент, НоваяСтрока, ОтменаРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборыДанныхПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	ПриемникПеретаскивания = СтрокаПриемникПеретаскиванияНабораДанных(Строка);
	СтрокиКоторыеМожноПеренести = СтрокиНабораДанныхКоторыеМожноПеренести(Элемент.ВыделенныеСтроки, ПараметрыПеретаскивания, ПриемникПеретаскивания);
	
	Если Не ЗначениеЗаполнено(СтрокиКоторыеМожноПеренести) Тогда
		
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборыДанныхПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	ПриемникПеретаскивания = СтрокаПриемникПеретаскиванияНабораДанных(Строка);
	СтрокиКоторыеМожноПеренести = СтрокиНабораДанныхКоторыеМожноПеренести(Элемент.ВыделенныеСтроки, ПараметрыПеретаскивания, ПриемникПеретаскивания);
	
	Копирование = (ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование);
	Для Каждого Идентификатор Из СтрокиКоторыеМожноПеренести Цикл
		
		ПереносимаяСтрока = НаборыДанных.НайтиПоИдентификатору(Идентификатор);
		АктивироватьСтроку = (Элемент.ТекущаяСтрока = Идентификатор);
		
		Если ТипЗнч(ПриемникПеретаскивания) = Тип("ДанныеФормыДерево") 
				ИЛИ ПриемникПеретаскивания.Вид = ИТК_Перечисления.СКДНаборДанныхОбъединение() Тогда
			
			ИндексВставки = Неопределено;
			
		Иначе
			
			РодительПриемникаПеретаскивания = ИТК_ФормаКлиент.РодительСтрокиДерева(НаборыДанных, ПриемникПеретаскивания);
			ИндексВставки = РодительПриемникаПеретаскивания.ПолучитьЭлементы().Индекс(ПриемникПеретаскивания);
			ПриемникПеретаскивания = РодительПриемникаПеретаскивания;
			
		КонецЕсли;

		ПереместитьСтрокуНабораДанных(ПереносимаяСтрока, ПриемникПеретаскивания, Копирование, АктивироватьСтроку, ИндексВставки);
		
		ОбработкаУдалениеНабораДанных(ПереносимаяСтрока);
		// Удалим перемещенную строку (сделали копию строки на новом месте и нужно удалить старую)
		Если Не Копирование Тогда
			
			РодительПереносимойСтроки = ИТК_ФормаКлиент.РодительСтрокиДерева(НаборыДанных, ПереносимаяСтрока);
			
			Если ПереносимаяСтрока <> Неопределено Тогда // Возможно уже была удалена
				
				РодительПереносимойСтроки.ПолучитьЭлементы().Удалить(ПереносимаяСтрока);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДереваПоляНаборовДанных

&НаКлиенте
Процедура ПоляНаборовДанныхПриАктивизацииСтроки(Элемент)
	
	ПоляНаборовДанныхИдентификаторТекущейСтроки = Элемент.ТекущаяСтрока;
	Если ПоляНаборовДанныхИдентификаторПоследнейВыделеннойСтроки <> ПоляНаборовДанныхИдентификаторТекущейСтроки Тогда 
		
		ПоляНаборовДанныхИдентификаторПоследнейВыделеннойСтроки = ПоляНаборовДанныхИдентификаторТекущейСтроки;
		
	КонецЕсли;
	
	//ЗаполнитьСписокВыбораОформления(Элемент, "ТипЗначенияВЗапросе");
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ДоступноКопирование = Элементы.СкопироватьПоле.Доступность;
	Если Копирование 
			И НЕ ДоступноКопирование Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
			ИЛИ Не Копирование Тогда
			
		ВидДобавляемогоПоля = ИТК_Перечисления.СКДВидыПолейНаборовДанныхПоле();
		
	Иначе
		
		ВидДобавляемогоПоля = ТекущиеДанные.Вид;
		
	КонецЕсли;
	
	ЭтоПолеГруппа = (ВидДобавляемогоПоля = ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа());
	
	ДоступноДобавлениеПоля = Элементы.ДобавитьПоле.Видимость;
	ДоступноДобавлениеГруппы = Элементы.ДобавитьПолеГруппу.Доступность;
	
	ДоступноДобавление = ДоступноДобавлениеПоля
							ИЛИ (ЭтоПолеГруппа
									И ДоступноДобавлениеГруппы);
	Если Не ДоступноДобавление Тогда
		Возврат;
	КонецЕсли;
		
	ДобавитьПолеВНаборДанных(ВидДобавляемогоПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ПроверкаИдентификатораПриНачалеРедактирования(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ПроверкаИдентификатораПередОкончаниемРедактирования(Элемент, ОтменаРедактирования, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	ПриемникПеретаскивания = СтрокаПриемникПеретаскиванияПолейНабораДанных(Строка);
	СтрокиКоторыеМожноПеренести = СтрокиПолейНабораДанныхКоторыеМожноПеренести(Элемент.ВыделенныеСтроки, ПараметрыПеретаскивания, ПриемникПеретаскивания);
	
	Если Не ЗначениеЗаполнено(СтрокиКоторыеМожноПеренести) Тогда
		
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	ПриемникПеретаскивания = СтрокаПриемникПеретаскиванияПолейНабораДанных(Строка);
	СтрокиКоторыеМожноПеренести = СтрокиПолейНабораДанныхКоторыеМожноПеренести(Элемент.ВыделенныеСтроки, ПараметрыПеретаскивания, ПриемникПеретаскивания);
	
	КоллекцияПолей = Элементы.НаборыДанных.ТекущиеДанные.Поля;
	Копирование = (ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование);
	Для Каждого Идентификатор Из СтрокиКоторыеМожноПеренести Цикл
		
		ПереносимаяСтрока = КоллекцияПолей.НайтиПоИдентификатору(Идентификатор);
		АктивироватьСтроку = (Элемент.ТекущаяСтрока = Идентификатор);
		
		Если ТипЗнч(ПриемникПеретаскивания) = Тип("ДанныеФормыДерево") 
				ИЛИ ЭтоПолеНабораДанныхКоллеция(ПриемникПеретаскивания.Вид) Тогда
			
			ИндексВставки = Неопределено;
			
		Иначе
			
			РодительПриемникаПеретаскивания = ИТК_ФормаКлиент.РодительСтрокиДерева(КоллекцияПолей, ПриемникПеретаскивания);
			ИндексВставки = РодительПриемникаПеретаскивания.ПолучитьЭлементы().Индекс(ПриемникПеретаскивания);
			ПриемникПеретаскивания = РодительПриемникаПеретаскивания;
			
		КонецЕсли;

		ПереместитьСтрокуПолейНабораДанных(ПереносимаяСтрока, ПриемникПеретаскивания, Копирование, АктивироватьСтроку, ИндексВставки);
		
		// Удалим перемещенную строку (сделали копию строки на новом месте и нужно удалить старую)
		Если Не Копирование Тогда
			
			РодительПереносимойСтроки = ИТК_ФормаКлиент.РодительСтрокиДерева(КоллекцияПолей, ПереносимаяСтрока);
			
			Если ПереносимаяСтрока <> Неопределено Тогда // Возможно уже была удалена
				
				РодительПереносимойСтроки.ПолучитьЭлементы().Удалить(ПереносимаяСтрока);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхПолеПриИзменении(Элемент)
	
	ЗаконченоИзменениеИмяПоляКоллекцииСЗаголовком(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхПередУдалением(Элемент, Отказ)
	
	ОбработкаПослеУдаленияПоляНабораОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхЗаголовокПредставлениеПриИзменении(Элемент)
	
	ЗаконченоИзменениеЗаголовкаИзПоляКоллекции(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхЗаголовокПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	
	РедактированияЗаголовкаПоляКоллекцииВОтдельнойФорме(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхРольПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Поле", ТекущиеДанные.Поле);
	ПараметрыФормы.Вставить("Значение", ТекущиеДанные.Роль);
	ПараметрыФормы.Вставить("КонтекстВыражения", КонтекстВыражения());
	ПараметрыФормы.Вставить("ВариантыИменРолиОстаток", ВариантыИменРолиОстаток());
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НаборыДанныхПоляРольЗавершениеРедактирования", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ИТК_КонструкторСКД.Форма.РедактированиеРолиПоляНабораДанных", ПараметрыФормы, ЭтотОбъект, , , ,
							ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхРольПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	ПустаяРоль = ИТК_СКДКлиентСервер.ПустоеОписаниеРолиПоляНабораДанных();
	
	ТекущиеДанные.Роль = ПустаяРоль;
	ТекущиеДанные.РольПредставление = Неопределено;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхВыражениеПредставленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
 	ИТК_СКДКлиент.ОткрытьВыборПоля(Элемент, ДоступныеПоляНабораДанных(), СтандартнаяОбработка, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхВыражениеПредставленияОткрытие(Элемент, СтандартнаяОбработка)
	
	КонтекстВыражения = КонтекстВыражения();
	ОткрытьРедактированиеВыражения(Элемент, КонтекстВыражения, "Поле", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхВыраженияУпорядочиванияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НаборыДанныхПоляВыраженияУпорядочиванияЗавершениеРедактирования", ЭтотОбъект);
	
	КонтекстВыражения = КонтекстВыражения();
	ИТК_СКДКлиент.ОткрытьВыраженияУпорядочивания(Элемент, КонтекстВыражения, ТекущиеДанные.ВыраженияУпорядочивания, ОповещениеОЗакрытии, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхВыраженияУпорядочиванияПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	ВыраженияУпорядочиванияПустое = Новый СписокЗначений;
	
	ТекущиеДанные.ВыраженияУпорядочивания = ВыраженияУпорядочиванияПустое;
	ТекущиеДанные.ВыраженияУпорядочиванияПредставление = Неопределено;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхНаборДанныхПроверкиИерархииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИсключитьТекущий", Истина);
	
	НачалоВыбораНабораДанныхИзСписка(Элемент, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхПараметрНабораДанныхПроверкиИерархииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	
	НаборДанных = НайтиНаборовДанныхПоИмени(ТекущиеДанные.НаборДанныхПроверкиИерархии);
	ДоступныеПоляНабораДанных = ДоступныеПоляНабораДанных(НаборДанных);
	
	ИТК_СКДКлиент.ОткрытьВыборПоля(Элемент, ДоступныеПоляНабораДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхПараметрНабораДанныхПроверкиИерархииОткрытие(Элемент, СтандартнаяОбработка)
	
	ЭлементКоллекция = ИТК_ФормаКлиент.КоллекцияРодитель(Элемент);
	ТекущиеДанные = ЭлементКоллекция.ТекущиеДанные;
	
	НаборДанных = НайтиНаборовДанныхПоИмени(ТекущиеДанные.НаборДанныхПроверкиИерархии);
	ДоступныеПоляНабораДанных = ДоступныеПоляНабораДанных(НаборДанных);
	
	КонтекстВыражения = КонтекстВыражения(Ложь);
	КонтекстВыражения.Вставить("ДоступныеПоля", ДоступныеПоляНабораДанных);
	
	ОткрытьРедактированиеВыражения(Элемент, КонтекстВыражения, "Поле", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;

	РежимРедактирования = ИТК_Перечисления.РежимРедактированияТипаЗначенияРедактированиеОписанияТипов();
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеТипаЗначенияПоляНабораДанныхЗавершено", ЭтотОбъект, Новый Структура);
	
	ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(ЭтотОбъект, ТекущиеДанные.Поле, РежимРедактирования, ТекущиеДанные.ТипЗначения, ОписаниеОповещения, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхДоступныеЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеДоступныхЗначенийПоляНабораДанныхЗавершено", ЭтотОбъект);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДополнениеЗаголовка", ТекущиеДанные.Поле);
	
	ИТК_ФормаКлиент.ОткрытьСписокЗначений(ЭтотОбъект, ИТК_Перечисления.ВариантФормыСписокЗначенийРедактированиеСПредставлением(),
											ТекущиеДанные.ДоступныеЗначения, ТекущиеДанные.ТипЗначения,
											ОписаниеОповещения, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхПараметрыРедактированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеПараметровРедактированияПоляНабораДанныхЗавершено", ЭтотОбъект);
	ИТК_ФормаКлиент.ОткрытьРедактированиеПараметровРедактирования(ЭтотОбъект, ТекущиеДанные.ПараметрыРедактирования, ДоступныеПоляНабораДанных(), ОписаниеОповещения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыСвязиНаборовДанных

&НаКлиенте
Процедура СвязиНаборовДанныхПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СвязиНаборовИдентификаторТекущейСтроки = Элемент.ТекущаяСтрока;
	
	Если СвязиНаборовДанныхИдентификаторПоследнейВыделеннойСтроки <> СвязиНаборовИдентификаторТекущейСтроки Тогда 
		
		СвязиНаборовДанныхИдентификаторПоследнейВыделеннойСтроки = СвязиНаборовИдентификаторТекущейСтроки;
		
		ОбновитьПараметры();
		ОбновитьСписокВыбораПараметраСвязейНаборов();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязиНаборовДанныхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Обязательная = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязиНаборовДанныхПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязиНаборовДанныхПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязиНаборовДанныхНаборДанныхИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачалоВыбораНабораДанныхИзСписка(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязиНаборовДанныхВыражениеИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СвязиНаборовДанных.ТекущиеДанные;
	
	НаборДанных = НайтиНаборовДанныхПоИмени(ТекущиеДанные.НаборДанныхИсточник);
	ДоступныеПоляНабораДанных = ДоступныеПоляНабораДанных(НаборДанных);
	
	ИТК_СКДКлиент.ОткрытьВыборПоля(Элемент, ДоступныеПоляНабораДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязиНаборовДанныхНаборДанныхПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачалоВыбораНабораДанныхИзСписка(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязиНаборовДанныхВыражениеПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СвязиНаборовДанных.ТекущиеДанные;
	
	НаборДанных = НайтиНаборовДанныхПоИмени(ТекущиеДанные.НаборДанныхПриемник);
	ДоступныеПоляНабораДанных = ДоступныеПоляНабораДанных(НаборДанных);
	
	ИТК_СКДКлиент.ОткрытьВыборПоля(Элемент, ДоступныеПоляНабораДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязиНаборовДанныхУсловиеСвязиОткрытие(Элемент, СтандартнаяОбработка)
	
	КонтекстВыражения = КонтекстВыражения();
	ОткрытьРедактированиеВыражения(Элемент, КонтекстВыражения, "УсловиеСвязи", СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура СвязиНаборовДанныхНачальноеВыражениеОткрытие(Элемент, СтандартнаяОбработка)
	
	КонтекстВыражения = КонтекстВыражения();
	ОткрытьРедактированиеВыражения(Элемент, КонтекстВыражения, "НачальноеВыражение", СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДереваВычисляемыеПоля

&НаКлиенте
Процедура ВычисляемыеПоляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ДобавитьВычисляемоеПоле();
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ПроверкаИдентификатораПриНачалеРедактирования(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ПроверкаИдентификатораПередОкончаниемРедактирования(Элемент, ОтменаРедактирования, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляПолеПриИзменении(Элемент)

	ЗаконченоИзменениеИмяПоляКоллекцииСЗаголовком(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляЗаголовокПредставлениеПриИзменении(Элемент)
	
	ЗаконченоИзменениеЗаголовкаИзПоляКоллекции(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляЗаголовокПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	
	РедактированияЗаголовкаПоляКоллекцииВОтдельнойФорме(Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляВыражениеОткрытие(Элемент, СтандартнаяОбработка)
	
	КонтекстВыражения = КонтекстВыражения();
	ОткрытьРедактированиеВыражения(Элемент, КонтекстВыражения, "Поле", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляВыражениеПредставленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИТК_СКДКлиент.ОткрытьВыборПоля(Элемент, ДоступныеПоляНабораДанных(), СтандартнаяОбработка, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляВыражениеПредставленияОткрытие(Элемент, СтандартнаяОбработка)
	
	КонтекстВыражения = КонтекстВыражения();
	ОткрытьРедактированиеВыражения(Элемент, КонтекстВыражения, "Поле", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляВыраженияУпорядочиванияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВычисляемыеПоля.ТекущиеДанные;
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВычисляемыеПоляВыраженияУпорядочиванияЗавершениеРедактирования", ЭтотОбъект);
	
	ИТК_СКДКлиент.ОткрытьВыраженияУпорядочивания(Элемент, ДоступныеПоляНабораДанных(), ТекущиеДанные.ВыраженияУпорядочивания, ОповещениеОЗакрытии, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВычисляемыеПоля.ТекущиеДанные;

	РежимРедактирования = ИТК_Перечисления.РежимРедактированияТипаЗначенияРедактированиеОписанияТипов();
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеТипаЗначенияВычисляемогоПоляЗавершено", ЭтотОбъект, Новый Структура);
	
	ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(ЭтотОбъект, ТекущиеДанные.Поле, РежимРедактирования, ТекущиеДанные.ТипЗначения, ОписаниеОповещения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляДоступныеЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВычисляемыеПоля.ТекущиеДанные;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеДоступныхЗначенийВычисляемогоПоляЗавершено", ЭтотОбъект);
	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДополнениеЗаголовка", ТекущиеДанные.Поле);
	
	ИТК_ФормаКлиент.ОткрытьСписокЗначений(ЭтотОбъект, ИТК_Перечисления.ВариантФормыСписокЗначенийРедактированиеСПредставлением(),
											ТекущиеДанные.ДоступныеЗначения, ТекущиеДанные.ТипЗначения,
											ОписаниеОповещения, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляПараметрыРедактированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВычисляемыеПоля.ТекущиеДанные;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеПараметровРедактированияВычисляемогоПоляЗавершено", ЭтотОбъект);
	ИТК_ФормаКлиент.ОткрытьРедактированиеПараметровРедактирования(ЭтотОбъект, ТекущиеДанные.ПараметрыРедактирования, ДоступныеПоляНабораДанных(), ОписаниеОповещения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыДоступныеПоляРесурсов

&НаКлиенте
Процедура ДоступныеПоляРесурсовВыбор(Элемент, ВыбраннаяСтрокаИдентификатор, Поле, СтандартнаяОбработка)
	
	ВыбраннаяСтрока = ДоступныеПоляРесурсов.НайтиПоИдентификатору(ВыбраннаяСтрокаИдентификатор);
	ДобавитьРесурсИзДоступныхПолей(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыРесурсы

&НаКлиенте
Процедура РесурсыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеРесурса = ТекущиеДанные.Поле;
	// Заполнение списка выбора "Выражения"
	
	Отбор = Новый Структура("Поле", ПолеРесурса);
	НайденныеСтроки = ДоступныеПоляРесурсов.НайтиСтроки(Отбор);
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		
		СтрокаДоступноеПолеРесурсов = НайденныеСтроки[0];
		
		АгрегатныеФункцииРесурса = АгрегатныеФункцииРесурса(ПолеРесурса, СтрокаДоступноеПолеРесурсов.ТипЗначения);
		Элементы.РесурсыВыражение.СписокВыбора.ЗагрузитьЗначения(АгрегатныеФункцииРесурса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПриИзменении(Элемент)
	
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ЗначениеЗаполнено(Поле) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Для Каждого СтрокаДоступноеПолеРесурсов Из ПараметрыПеретаскивания.Значение Цикл 
		
		ДобавитьРесурсИзДоступныхПолей(СтрокаДоступноеПолеРесурсов);

	КонецЦикла;
	
	ОбновитьКоличествоВЗаголовке(Элементы.Ресурсы);

КонецПроцедуры

&НаКлиенте
Процедура РесурсыГруппировкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПоляГруппировки = ПоляГруппировкиРесурсаСтроки(Элементы.Ресурсы.ТекущиеДанные);
	ИТК_СКДКлиент.ОткрытьПоляГруппировки(Элемент, ПоляГруппировки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыВыражениеОткрытие(Элемент, СтандартнаяОбработка)
	
	КонтекстВыражения = КонтекстВыражения();
	ОткрытьРедактированиеВыражения(Элемент, КонтекстВыражения, "Выражение", СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПараметрыСКД

&НаКлиенте
Процедура ПараметрыСКДПриАктивизацииСтроки(Элемент)
	
	ОбновитьЭлементыФормы();
	ПривестиЗначениеПараметраСКДВТекущейСтроке();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ПрефиксИмени = ИТК_КонструкторСКДКлиентСервер.ПрефиксИмениНовогоПараметра();
	ИТК_ФормаКлиент.ПриНачалеРедактированияНовоеИмяВКоллекции(Элемент, ПараметрыСКД, НоваяСтрока, Копирование, ПрефиксИмени);
	
	Если НЕ НоваяСтрока
			ИЛИ Копирование Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекущиеДанные.ВключатьВДоступныеПоля = Истина;
	
	ПроверкаИдентификатораПриНачалеРедактирования(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ПроверкаИдентификатораПередОкончаниемРедактирования(Элемент, ОтменаРедактирования, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	УдаляемыеСтроки = Новый Массив;
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ПараметрыСКД.ВыделенныеСтроки Цикл 
		
		ВыделеннаяСтрока = ПараметрыСКД.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		
		Если ВыделеннаяСтрока.ДобавленАвтоматически Тогда
			Продолжить;
		КонецЕсли;
		
		УдаляемыеСтроки.Добавить(ВыделеннаяСтрока);
		
	КонецЦикла;
	
	Для Каждого Строка Из УдаляемыеСтроки Цикл 
		ПараметрыСКД.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДИмяПриИзменении(Элемент)
	
	ЗаконченоИзменениеИмяПоляКоллекцииСЗаголовком(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДЗаголовокПриИзменении(Элемент)
	
	ЗаконченоИзменениеЗаголовкаИзПоляКоллекции(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДЗаголовокОткрытие(Элемент, СтандартнаяОбработка)
	
	РедактированияЗаголовкаПоляКоллекцииВОтдельнойФорме(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПараметрыСКД.ТекущиеДанные;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Системные", Истина);
	
	РежимРедактирования = ИТК_Перечисления.РежимРедактированияТипаЗначенияРедактированиеОписанияТипов();
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеТипаЗначенияПараметраСКДЗавершено", ЭтотОбъект, Новый Структура);
	
	ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(ЭтотОбъект, ТекущиеДанные.Имя, РежимРедактирования, ТекущиеДанные.ТипЗначения, ОписаниеОповещения, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПараметрыСКД.ТекущиеДанные;
	
	Если ТекущиеДанные.ДоступенСписокЗначений Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеЗначениеПараметраСКДВСпискеЗавершено", ЭтотОбъект);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДополнениеЗаголовка", НСтр("ru = 'Значение';
																	|en = 'Value'"));
		
		ИТК_ФормаКлиент.ОткрытьСписокЗначений(ЭтотОбъект, ИТК_Перечисления.ВариантФормыСписокЗначенийРедактирование(),
													ТекущиеДанные.Значение, ТекущиеДанные.ТипЗначения,
													ОписаниеОповещения, СтандартнаяОбработка, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДДоступныеЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПараметрыСКД.ТекущиеДанные;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеДоступныхЗначенийПараметраСКДВСпискеЗавершено", ЭтотОбъект);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДополнениеЗаголовка", ТекущиеДанные.Поле);
	
	ИТК_ФормаКлиент.ОткрытьСписокЗначений(ЭтотОбъект, ИТК_Перечисления.ВариантФормыСписокЗначенийРедактированиеСПредставлением(),
											ТекущиеДанные.ДоступныеЗначения, ТекущиеДанные.ТипЗначения,
											ОписаниеОповещения, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДВыражениеОткрытие(Элемент, СтандартнаяОбработка)
	
	КонтекстВыражения = КонтекстВыражения(Ложь);
	ОткрытьРедактированиеВыражения(Элемент, КонтекстВыражения, "Выражение", СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДДоступенСписокЗначенийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыСКД.ТекущиеДанные;
	ТекущееЗначение = ТекущиеДанные.Значение;
	
	Если ТекущиеДанные.ДоступенСписокЗначений Тогда
		
		НовоеЗначение = Новый СписокЗначений;
		Если ЗначениеЗаполнено(ТекущееЗначение) Тогда
			НовоеЗначение.Добавить(ТекущееЗначение);
		КонецЕсли;
		
	Иначе	
		
		Если ЗначениеЗаполнено(ТекущееЗначение) Тогда
			НовоеЗначение = ТекущееЗначение[0].Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущиеДанные.Значение = НовоеЗначение;	
	ПривестиЗначениеПараметраСКДВТекущейСтроке();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДПараметрыРедактированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПараметрыСКД.ТекущиеДанные;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеПараметровРедактированияПараметрыСКДЗавершено", ЭтотОбъект);
	ИТК_ФормаКлиент.ОткрытьРедактированиеПараметровРедактирования(ЭтотОбъект, ТекущиеДанные.ПараметрыРедактирования, ДоступныеПоляНабораДанных(), ОписаниеОповещения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыМакеты

&НаКлиенте
Процедура МакетыПриИзменении(Элемент)
	
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МакетыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыВложенныеСхемы

&НаКлиенте
Процедура ВложенныеСхемыПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенныеСхемыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ПроверкаИдентификатораПриНачалеРедактирования(Элемент);
	ПрефиксИмени = ИТК_КонструкторСКДКлиентСервер.ПрефиксИмениНовойВложеннойСхемы();
	ИТК_ФормаКлиент.ПриНачалеРедактированияНовоеИмяВКоллекции(Элемент, ВложенныеСхемы, НоваяСтрока, Копирование, ПрефиксИмени);
	
	Если НЕ НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;

	ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();
	ЗаполнитьПредставлениеСтрокиВложеннаяСхема(ИдентификаторСтроки);

КонецПроцедуры

&НаКлиенте
Процедура ВложенныеСхемыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ПроверкаИдентификатораПередОкончаниемРедактирования(Элемент, ОтменаРедактирования, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенныеСхемыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьКоличествоВЗаголовке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенныеСхемыСхемаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВложенныеСхемы.ТекущиеДанные;
	ИТК_ФормаКлиент.ОткрытьТонкийКонструкторСхемыКомпоновкиДанных(ЭтотОбъект, ТекущиеДанные.Схема);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенныеСхемыИмяПриИзменении(Элемент)
	
	ЗаконченоИзменениеИмяПоляКоллекцииСЗаголовком(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенныеСхемыЗаголовокПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	
	РедактированияЗаголовкаПоляКоллекцииВОтдельнойФорме(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенныеСхемыЗаголовокПредставлениеПриИзменении(Элемент)
	
	ЗаконченоИзменениеЗаголовкаИзПоляКоллекции(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыВариантыНастроек

&НаКлиенте
Процедура ВариантыНастроекПриАктивизацииСтроки(Элемент)
	
	ВариантыИдентификаторТекущейСтроки = Элемент.ТекущаяСтрока;
	Если ВариантыИдентификаторПоследнейВыделеннойСтроки <> ВариантыИдентификаторТекущейСтроки Тогда 
		
		СохранитьИзмененныеДанныеСтрокиВариантаНастроек();
		
		ВариантыИдентификаторПоследнейВыделеннойСтроки = ВариантыИдентификаторТекущейСтроки;
		
		ЗагрузитьДанныеВариантаНастроек();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыНастроекПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ПроверкаИдентификатораПриНачалеРедактирования(Элемент);
	
	ПрефиксИмени = ИТК_КонструкторСКДКлиентСервер.ПрефиксИмениНовогоВариантаНастроек();
	ИТК_ФормаКлиент.ПриНачалеРедактированияНовоеИмяВКоллекции(Элемент, ВариантыНастроек, НоваяСтрока, Копирование, ПрефиксИмени);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыНастроекПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ПроверкаИдентификатораПередОкончаниемРедактирования(Элемент, ОтменаРедактирования, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыНастроекПриИзменении(Элемент)
	
	ОбновитьКоличествоВЗаголовке(Элемент);
	ОбновитьОсновнойВариантНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыНастроекПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьКоличествоВЗаголовке(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВариантыНастроекИмяПриИзменении(Элемент)
	
	ЗаконченоИзменениеИмяПоляКоллекцииСЗаголовком(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыНастроекЗаголовокПредставлениеПриИзменении(Элемент)
	
	ЗаконченоИзменениеЗаголовкаИзПоляКоллекции(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВариантыНастроекЗаголовокПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	
	РедактированияЗаголовкаПоляКоллекцииВОтдельнойФорме(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДереваКомпоновщикНастроекНастройки

&НаКлиенте
Процедура ПриИзмененииНастроекСКД(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СтрНайти(Поле.Имя, "НаличиеВыбора") Тогда
		
		АктивируемаяСтраница = Элементы.СтраницаПоляВыбора; 
		
	ИначеЕсли СтрНайти(Поле.Имя, "НаличиеОтбора") Тогда
		
		АктивируемаяСтраница = Элементы.СтраницаОтбор; 
		
	ИначеЕсли СтрНайти(Поле.Имя, "НаличиеПорядка") Тогда
		
		АктивируемаяСтраница = Элементы.СтраницаПорядок; 
		
	ИначеЕсли СтрНайти(Поле.Имя, "НаличиеУсловногоОформления") Тогда
		
		АктивируемаяСтраница = Элементы.СтраницаУсловноеОформление; 
		
	ИначеЕсли СтрНайти(Поле.Имя, "НаличиеПараметровВывода") Тогда
		
		АктивируемаяСтраница = Элементы.СтраницаПараметрыВывода; 
		
	Иначе
		
		Возврат;

	КонецЕсли;
	
	Элементы.СтраницыТекущихНастроек.ТекущаяСтраница = АктивируемаяСтраница;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьНаборДанныхЗапрос(Команда)
	
	ДобавитьНаборДанных(ИТК_Перечисления.СКДНаборДанныхЗапрос());
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаборДанныхОбъект(Команда)
	
	ДобавитьНаборДанных(ИТК_Перечисления.СКДНаборДанныхОбъект());
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаборДанныхОбъединение(Команда)

	ДобавитьНаборДанных(ИТК_Перечисления.СКДНаборДанныхОбъединение());
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПолеГруппу(Команда)
	
	ВидГруппа = ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа();
	ДобавитьПолеВНаборДанных(ВидГруппа);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПолеНабор(Команда)
	
	ВидНабор = ИТК_Перечисления.СКДВидыПолейНаборовДанныхНабор();
	ДобавитьПолеВНаборДанных(ВидНабор);
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("РаботаКонструктораЗапросаЗавершена", ЭтотОбъект);
	
	Текст = ИТК_РедакторКодаКлиент.Текст(ЭтотОбъект, "ТекстЗапроса");
	ИТК_ЗапросКлиент.ОткрытьКонструктор(Текст, ОповещениеОЗавершении, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗапрос(Команда)
	
	ОбработкаПослеИзмененияЗапросаНабораДанных();
	ПроверитьПоказатьОшибку(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуИзФайлаXML(Команда)
	
	ВыборФайла = Новый ДиалогВыбораФайла (РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.Фильтр = ИТК_СКДКлиентСервер.ФильтрФайловXML();
	ВыборФайла.Расширение = "xml";
	ВыборФайла.Заголовок = НСтр("ru = 'Загрузка схемы компоновки данных';
								|en = 'Loading the data layout diagram'");
	ВыборФайла.МножественныйВыбор = Ложь;
	
	НачатьПомещениеФайлов(Новый ОписаниеОповещения("ЗагрузитьСхемуКомпоновкиДанныхИзФайлаПослеПомещенияФайлов", ЭтотОбъект), , ВыборФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСхемуВXMLФайл(Команда)
	
	СохранитьИзмененныеДанныеСтрокиВариантаНастроек();
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Фильтр = ИТК_СКДКлиентСервер.ФильтрФайловXML();
	ВыборФайла.Заголовок = НСтр("ru = 'Сохранение схемы компоновки данных';
								|en = 'Saving the data layout diagram'");
	ВыборФайла.Расширение = "xml";
	
	ВыборФайла.Показать(Новый ОписаниеОповещения("СохранитьСхемуКомпоновкиДанныхВФайлЗавершениеВыбораФайла", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЗакрытиеРазрешено = Истина;
	
	СохранитьИзмененныеДанныеСтрокиВариантаНастроек();
	
	Результат = СобратьСхемуКомпоновкиДанныхИзДанныхФормы();
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	ЗакрытиеРазрешено = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьИсточникиДанных(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	СписокИсточниковДанных = Новый СписокЗначений;
	Для Каждого ОписаниеИсточникаДанных Из ИсточникиДанных Цикл 
		СписокИсточниковДанных.Добавить( , ОписаниеИсточникаДанных.Имя);
	КонецЦикла;
	ПараметрыФормы.Вставить("Источники", СписокИсточниковДанных);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИсточникиДанныхЗавершениеРедактирования", ЭтотОбъект);
	ОткрытьФорму("Обработка.ИТК_КонструкторСКД.Форма.РедактированиеИсточниковДанных", ПараметрыФормы, ЭтотОбъект, , , ,
							ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
							
КонецПроцедуры

&НаКлиенте
Процедура ИТК_ПодключаемаяКомандаРедакторКодаОбработчик(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработкаКомандыРедактораЗавершена", ЭтотОбъект, ДополнительныеПараметры);
	ИТК_РедакторКодаКлиент.ПодключаемыйОбработчикКоманд(ЭтотОбъект, Команда.Имя, ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПолеВНаборДанных(Вид, АктивизироватьСтроку = Истина)
	
	Модифицированность = Истина;
	КоллекцияПолей = Элементы.НаборыДанных.ТекущиеДанные.Поля;
	
	ПоляНаборовДанныхТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	Если ПоляНаборовДанныхТекущиеДанные <> Неопределено
			И ЭтоПолеНабораДанныхКоллеция(ПоляНаборовДанныхТекущиеДанные.Вид) Тогда
			
		Родитель = ПоляНаборовДанныхТекущиеДанные;
		
	Иначе
		
		Родитель = КоллекцияПолей;
		
	КонецЕсли;
	НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
	
	НоваяСтрока.Вид = Вид;
	НоваяСтрока.Картинка = ИТК_КонструкторСКДКлиентСервер.КартинкаПоляНабораДанных(Вид);
	НоваяСтрока.ПолеСРеквизитами = Истина;
	НоваяСтрока.Роль = ИТК_СКДКлиентСервер.ПустоеОписаниеРолиПоляНабораДанных();
	
	// Заполнение имени поля
	ЗанятыеИдентификаторы = ИспользуемыеИдентификаторыКоллекции(Элементы.ПоляНаборовДанных, КоллекцияПолей);
	ПрефиксИмени = ИТК_КонструкторСКДКлиентСервер.ПрефиксИмениНовогоПоляНабораДанных(Вид);
	
	ИмяПоля = ИТК_Строки.НовыйИдентификатор(ПрефиксИмени, ЗанятыеИдентификаторы);
	НоваяСтрока.Поле = ИмяПоля;
	
	Если АктивизироватьСтроку Тогда
		Элементы.ПоляНаборовДанных.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРесурс(Команда)
	
	ТекущиеДанные = Элементы.ДоступныеПоляРесурсов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьРесурсИзДоступныхПолей(ТекущиеДанные);
	ОбновитьКоличествоВЗаголовке(Элементы.Ресурсы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсеРесурсы(Команда)
	
	Для Каждого СтрокаДоступноеПолеРесурсов Из ДоступныеПоляРесурсов Цикл 
		
		Если НЕ СуммируемоеДоступноеПолеРесурсов(СтрокаДоступноеПолеРесурсов) Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьРесурсИзДоступныхПолей(СтрокаДоступноеПолеРесурсов);
		
	КонецЦикла;
	
	ОбновитьКоличествоВЗаголовке(Элементы.Ресурсы);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРесурс(Команда)
	
	ТекущиеДанные = Элементы.Ресурсы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ресурсы.Удалить(ТекущиеДанные);
	ОбновитьКоличествоВЗаголовке(Элементы.Ресурсы);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеРесурсы(Команда)
	
	Ресурсы.Очистить();
	ОбновитьКоличествоВЗаголовке(Элементы.Ресурсы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМакетПоля(Команда)
	
	ДобавитьМакет(ИТК_Перечисления.СКДМакетПоля());
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМакетГруппировки(Команда)
	
	ДобавитьМакет(ИТК_Перечисления.СКДМакетГруппировки());
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМакетЗаголовкаГруппировки(Команда)
	
	ДобавитьМакет(ИТК_Перечисления.СКДМакетЗаголовкаГруппировки());
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМакетРесурсов(Команда)
	
	ДобавитьМакет(ИТК_Перечисления.СКДМакетРесурсов());
	
КонецПроцедуры

&НаКлиенте
Процедура СвязиНаборовДанныхПодробно(Команда)
	
	СвязиНаборовДанныхПодробно = НЕ СвязиНаборовДанныхПодробно;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСКДПодробно(Команда)
	
	ПараметрыСКДПодробно = НЕ ПараметрыСКДПодробно;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемыеПоляПодробно(Команда)
	
	ВычисляемыеПоляПодробно = НЕ ВычисляемыеПоляПодробно;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНаборовДанныхПодробно(Команда)
	
	ПоляНаборовДанныхПодробно = НЕ ПоляНаборовДанныхПодробно;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойВариант(Команда)
	
	ТекущиеДанные = Элементы.ВариантыНастроек.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Сдвигаем строку в начало
	Смещение = 0;
	Для Каждого ВариантНастроек Из ВариантыНастроек Цикл 
		
		Если ВариантНастроек = ТекущиеДанные Тогда
			Прервать;
		КонецЕсли;
		
		Смещение = Смещение - 1;
		
	КонецЦикла;
	
	ИндексТекущейСтроки = ВариантыНастроек.Индекс(ТекущиеДанные);
	ВариантыНастроек.Сдвинуть(ИндексТекущейСтроки, Смещение);
	
	ОбновитьОсновнойВариантНастроек();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Поля наборов данных
	// Оформление видимости ОграничениеИспользованияРеквизитов набора
	Оформление = Новый Структура("Отображать", Ложь);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияПоле");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияУсловие");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияГруппировка");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияПорядок");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовПоле");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовУсловие");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовГруппировка");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовПорядок");
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ОформляемыеПоля, Оформление, "Элементы.НаборыДанных.ТекущиеДанные.Поля.Вид",
											ИТК_Перечисления.СКДВидыПолейНаборовДанныхНабор());
											
	// Оформление видимости ОграничениеИспользованияРеквизитов группы
	Оформление = Новый Структура("Отображать", Ложь);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовПоле");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовУсловие");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовГруппировка");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовПорядок");
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ОформляемыеПоля, Оформление, "Элементы.НаборыДанных.ТекущиеДанные.Поля.Вид",
											ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа());
	
	// Оформление только просмотр ОграничениеИспользованияРеквизитов для полей без реквизитов
	Оформление = Новый Структура("ТолькоПросмотр", Истина);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовПоле");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовУсловие");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовГруппировка");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияРеквизитовПорядок");
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ОформляемыеПоля, Оформление, "Элементы.НаборыДанных.ТекущиеДанные.Поля.ПолеСРеквизитами", Ложь);

	// Оформление только просмотр ОграничениеИспользования для полей только для выбора
	Оформление = Новый Структура("ТолькоПросмотр", Истина);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияУсловие");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияГруппировка");
	ОформляемыеПоля.Добавить("ПоляНаборовДанныхОграничениеИспользованияПорядок");
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ОформляемыеПоля, Оформление, "Элементы.НаборыДанных.ТекущиеДанные.Поля.ПолеТолькоДляВыбора", Истина);
	
	// Оформление только просмотр Роли для полей наборов типа набор
	Оформление = Новый Структура("ТолькоПросмотр", Истина);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ПоляНаборовДанныхРольПредставление", Оформление, "Элементы.НаборыДанных.ТекущиеДанные.Поля.Вид",
											ИТК_Перечисления.СКДВидыПолейНаборовДанныхНабор());

	// Страница "Параметры" -------------------------------------------------------------------------------------------------
	// Оформление только просмотр Имя для добавленных автоматически
	Оформление = Новый Структура("ТолькоПросмотр", Истина);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить("ПараметрыСКДИмя");
	ОформляемыеПоля.Добавить("ПараметрыСКДТипЗначения");
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ОформляемыеПоля, Оформление, "ПараметрыСКД.ДобавленАвтоматически", Истина);
											
	//	Автозаголовок
	Оформление = Новый Структура;
	Оформление.Вставить("ЦветТекста", ИТК_ОбщийКлиентСервер.ЦветТекстаНедоступно());
	Оформление.Вставить("Текст", НСтр("ru = '<Авто>';
										|en = '<Auto>'"));
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ПоляНаборовДанныхЗаголовокПредставление", Оформление, "НаборыДанных.Поля.ЗаголовокПредставление", "");
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ВычисляемыеПоляЗаголовокПредставление", Оформление, "ВычисляемыеПоля.ЗаголовокПредставление", "");
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ПараметрыСКДЗаголовокПредставление", Оформление, "ПараметрыСКД.ЗаголовокПредставление", "");
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ВложенныеСхемыЗаголовокПредставление", Оформление, "ВложенныеСхемы.ЗаголовокПредставление", "");
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ВариантыНастроекЗаголовокПредставление", Оформление, "ВариантыНастроек.ЗаголовокПредставление", "");
	
	// Страница "Настройки" -------------------------------------------------------------------------------------------------
	Оформление = Новый Структура;
	Оформление.Вставить("Шрифт", ИТК_ОбщийКлиентСервер.ШрифтЖирный());
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ВариантыНастроекИмя", Оформление, "ВариантыНастроек.Основной", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.РедактироватьИсточникиДанных.Заголовок = ИТК_ФормаКлиентСервер.ЗаголовокСКоличеством(НСтр("ru = 'Источники';
																										|en = 'Sources'"), ИсточникиДанных.Количество());
	
	Если ТекущаяСтрока = Неопределено Тогда
		ВидНабораДанных = Неопределено;
	Иначе
		ВидНабораДанных = ТекущаяСтрока.Вид;
	КонецЕсли;
	ПрисутствуютНаборыДанных = (ВидНабораДанных <> Неопределено);
	НаборДанныхЗапрос = (ВидНабораДанных = ИТК_Перечисления.СКДНаборДанныхЗапрос());
	НаборДанныхОбъект = (ВидНабораДанных = ИТК_Перечисления.СКДНаборДанныхОбъект());
	НаборДанныхОбъединение = (ВидНабораДанных = ИТК_Перечисления.СКДНаборДанныхОбъединение());

	Элементы.ГруппаНовыйНаборДанных.Видимость = НЕ ПрисутствуютНаборыДанных;
	Элементы.ГруппаПоляНаборовДанных.Доступность = ПрисутствуютНаборыДанных;
	Элементы.ГруппаОбъект.Видимость = НаборДанныхОбъект;
	
	Элементы.ГруппаЗапрос.Видимость = НаборДанныхЗапрос;
	Если НЕ НаборДанныхЗапрос Тогда
		ИТК_РедакторКодаКлиент.УстановитьТребуетсяДополнительнаяИнициализация(Элементы.ТекстЗапроса);
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НаборДанныхЗапрос Тогда
		
		Элементы.ИспользоватьГруппировкиЗапросаЕслиВозможно.Видимость = ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.14");
		ОбновитьЭлементыОшибки();
	Иначе
		
		ИТК_РедакторКодаКлиент.УстановитьТребуетсяДополнительнаяИнициализация(Элементы.ТекстЗапроса);

	КонецЕсли;
	
	// Поля наборов
	ТекущиеДанныеПоляНаборовДанных = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	
	ЭтоСтрокаГруппа = (ТекущиеДанныеПоляНаборовДанных <> Неопределено 
						И ТекущиеДанныеПоляНаборовДанных.Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа());
	ДоступныДействияСПолями = ЭтоСтрокаГруппа ИЛИ НаборДанныхОбъект;
	ДоступноДобавлениеПолей = НаборДанныхОбъект;
	
	Элементы.ДобавитьПоле.Видимость = ДоступноДобавлениеПолей;
	Элементы.СкопироватьПоле.Доступность = ДоступныДействияСПолями;
	Элементы.УдалитьПоле.Доступность = ДоступныДействияСПолями;
	Элементы.ДобавитьПолеНабор.Видимость = ДоступноДобавлениеПолей;
	
	Элементы.ПоляНаборовДанныхКонтекстноеМенюДобавить.Видимость = ДоступноДобавлениеПолей;
	Элементы.ПоляНаборовДанныхКонтекстноеМенюСкопироватьПоле.Доступность = ДоступныДействияСПолями;
	Элементы.ПоляНаборовДанныхКонтекстноеМенюУдалитьПоле.Доступность = ДоступныДействияСПолями;
	Элементы.ПоляНаборовДанныхКонтекстноеМенюДобавитьПолеНабор.Видимость = ДоступноДобавлениеПолей;
	
	ПолеНабораДанныхРедактируется = ЭтоСтрокаГруппа ИЛИ НаборДанныхОбъект;
	Элементы.ПоляНаборовДанныхПоле.ТолькоПросмотр = НЕ ПолеНабораДанныхРедактируется;
	
	// Видимость колонок полей
	// Поля наборов
	ДоступноУправлениеПолямиНабора = НЕ ВложенВОбъединение(ТекущаяСтрока);
	
	Поля = Новый Массив;
	Поля.Добавить("ВыражениеПредставления");
	Поля.Добавить("ВыраженияУпорядочиванияПредставление");
	Поля.Добавить("НаборДанныхПроверкиИерархии");
	Поля.Добавить("ПараметрНабораДанныхПроверкиИерархии");
	Поля.Добавить("ТипЗначения");
	Поля.Добавить("ДоступныеЗначения");
	Поля.Добавить("Оформление");
	Поля.Добавить("ПараметрыРедактирования");
	ОбновитьВидимостьСкрываемыхПолейКоллекций(Элементы.ПоляНаборовДанных, Поля, ДоступноУправлениеПолямиНабора);
	
	Элементы.ПоляНаборовДанныхЗаголовокПредставление.Видимость = ДоступноУправлениеПолямиНабора;
	Элементы.ПоляНаборовДанныхРольПредставление.Видимость = ДоступноУправлениеПолямиНабора;
	
	// Связи наборов данных
	Поля = Новый Массив;
	Поля.Добавить("НачальноеВыражение");
	Поля.Добавить("УсловиеСвязи");
	ОбновитьВидимостьСкрываемыхПолейКоллекций(Элементы.СвязиНаборовДанных, Поля);
	
	// Вычисляемые поля
	Поля = Новый Массив;
	Поля.Добавить("ВыражениеПредставления");
	Поля.Добавить("ВыраженияУпорядочиванияПредставление");
	Поля.Добавить("ТипЗначения");
	Поля.Добавить("ДоступныеЗначения");
	Поля.Добавить("Оформление");
	Поля.Добавить("ПараметрыРедактирования");
	ОбновитьВидимостьСкрываемыхПолейКоллекций(Элементы.ВычисляемыеПоля, Поля);
	
	// Параметры
	ВыделеныПараметрыКоторыеМожноУдалить = ВыделеныПараметрыКоторыеМожноУдалить();
	Элементы.ПараметрыСКДУдалить.Доступность = ВыделеныПараметрыКоторыеМожноУдалить;
	Элементы.ПараметрыСКДКонтекстноеМенюУдалить.Доступность = ВыделеныПараметрыКоторыеМожноУдалить;
	
	Поля = Новый Массив;
	Поля.Добавить("ДоступныеЗначения");
	Поля.Добавить("ПараметрФункциональныхОпций");
	Поля.Добавить("ПараметрыРедактирования");
	ОбновитьВидимостьСкрываемыхПолейКоллекций(Элементы.ПараметрыСКД, Поля);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыОшибки()
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементГруппаОшибка = Элементы.ГруппаОшибкаВЗапросе;
	ЭлементТекст = Элементы.ТекстЗапроса;
	ЭлементТекстОшибки = Элементы.ОшибкаВЗапросеТекст;
	ЭлементКартинкаОшибки = Элементы.ОшибкаВЗапросеКартинка;
		
	ТребуетсяПроверка = ТекущаяСтрока.ТребуетсяПроверка;
	
	Ошибка = ИТК_ЗапросКлиентСервер.ИнформацияООшибке(ТекущаяСтрока.ТекстОшибки);
	ЕстьОшибки = ЗначениеЗаполнено(Ошибка);
	
	АкцентироватьТекст = ЕстьОшибки ИЛИ ТребуетсяПроверка;
	ЭлементГруппаОшибка.Видимость = АкцентироватьТекст;
	
	Если ЭлементТекст <> Неопределено Тогда
		
		Если АкцентироватьТекст Тогда
			ЦветРамки = WebЦвета.Красный;
		Иначе
			ЦветРамки = Новый Цвет();
		КонецЕсли;
		
		ЭлементТекст.ЦветРамки = ЦветРамки;
		ЭлементТекстОшибки.Гиперссылка = Не ТребуетсяПроверка;
		
	КонецЕсли;
	
	Если ТребуетсяПроверка Тогда
		
		ТекстОшибки = НСтр("ru = 'Требуется проверка текста';
							|en = 'You want to check the text'");
		ЭлементКартинкаОшибки.Картинка = Новый Картинка;
		
	Иначе
		
		Если ЕстьОшибки Тогда
			
			ТекстОшибки = ИТК_ОбщийКлиентСервер.ПредставлениеОшибкиВТекстеЗапросаИлиСхемеКомпоновкиДанных(Ошибка);
			ЭлементКартинкаОшибки.Картинка = БиблиотекаКартинок.ИТК_ОшибкаВТексте;
			
		КонецЕсли;
		
	КонецЕсли;

	ЭлементТекстОшибки.Заголовок = ТекстОшибки;
	
КонецПроцедуры

&НаКлиенте
Процедура ИТК_ПодключаемыйВосстановлениеФокусаРедактора() Экспорт 
	
	ИТК_РедакторКодаКлиент.ВосстановлениеФокусаРедактора(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибку()
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементТекст = Элементы.ТекстЗапроса;
	Ошибка = ИТК_ЗапросКлиентСервер.ИнформацияООшибке(ТекущаяСтрока.ТекстОшибки);
		
	Если ТипЗнч(Ошибка) = Тип("Структура") Тогда
		
		ИТК_РедакторКодаКлиент.ПоказатьОшибку(ЭлементТекст, Ошибка.НомерСтроки, Ошибка.НомерСтолбца);

	КонецЕсли;
		
	ТекущийЭлемент = ЭлементТекст;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуПослеОжидания()
	
	ПодключитьОбработчикОжидания("ПоказатьОшибку", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПоказатьОшибку(ВыводитьПредупреждениеОшибокНет = Ложь)
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = ПроверитьТекстЗапроса(ТекущаяСтрока);
	ЗаполнитьПоляНабораДанных();
	
	ОбновитьЭлементыФормы();
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
		
		ПоказатьОшибкуПослеОжидания();
		
	Иначе
		
		Если ВыводитьПредупреждениеОшибокНет Тогда
			
			ТекстОшибокНет = НСтр("ru = 'Запрос проверен. Ошибок нет';
									|en = 'Query verified. There are no errors'");
			ПоказатьОповещениеПользователя(ИТК_КонструкторСКДКлиентСервер.Представление(), , ТекстОшибокНет, БиблиотекаКартинок.СинтаксическийКонтроль);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьТекстЗапроса(Данные)
	
	Если Данные.ТребуетсяПроверка Тогда
			
		ПроверитьДанныеЗапроса(Данные);
		Результат = ИТК_ОбщийКлиентСервер.ПредставлениеОшибкиВТекстеЗапросаИлиСхемеКомпоновкиДанных(Данные.ТекстОшибки);
		
	Иначе
		
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

&НаКлиенте
Процедура ПроверитьДанныеЗапроса(Данные)
	
	ТекстЗапроса = Данные.ТекстЗапроса;
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		
		РезультатПроверки = ИТК_Запрос.ПроверитьТекст(ТекстЗапроса);
		ТекстОшибки = РезультатПроверки.ТекстОшибки;
		
	Иначе
		
		ТекстОшибки = ИТК_ЗапросКлиентСервер.ТекстОшибкиПустойЗапрос();
		
	КонецЕсли;
	
	Данные.ТребуетсяПроверка = Ложь;
	Данные.ТекстОшибки = ТекстОшибки;

КонецПроцедуры

&НаКлиенте
Функция ДобавитьНаборДанных(Вид, Активировать = Истина)
	
	Модифицированность = Истина;
	
	ЭлементКоллекция = Элементы.НаборыДанных;
	Родитель = ЭлементКоллекция.ТекущиеДанные;
	Если Родитель = Неопределено Тогда
		
		Родитель = НаборыДанных;
		
	ИначеЕсли Родитель.Вид <> ИТК_Перечисления.СКДНаборДанныхОбъединение() Тогда
			
		Родитель = ИТК_ФормаКлиент.РодительСтрокиДерева(НаборыДанных, Родитель);
		
	КонецЕсли;

	Индекс = ИТК_ФормаКлиент.МаксимальныйИндексСтрокДерева(Родитель);
	Представление = НСтр("ru = 'НаборДанных';
						|en = 'Datasets'") + ИТК_Строки.ЧислоВСтроку(Индекс + 1);
	
	НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
	НоваяСтрока.Вид = Вид;
	НоваяСтрока.Картинка = ИТК_КонструкторСКДКлиентСервер.КартинкаНабораДанных(Вид);
	НоваяСтрока.Представление = Представление;
	
	НаборДанныхЗапрос = (Вид = ИТК_Перечисления.СКДНаборДанныхЗапрос());
	
	Если НаборДанныхЗапрос Тогда
		
		НоваяСтрока.АвтоЗаполнение = Истина;
		НоваяСтрока.ИспользоватьГруппировкиЗапросаЕслиВозможно = Истина;
		НоваяСтрока.ТекстОшибки = ИТК_ЗапросКлиентСервер.ТекстОшибкиПустойЗапрос();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИсточникиДанных) Тогда
		НоваяСтрока.Источник = ИсточникиДанных[0].Имя;
	КонецЕсли;
	НоваяСтрока.ТребуетсяПроверка = Ложь;
	
	Если Активировать Тогда
		
		ЭлементКоллекция.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		
		Если НаборДанныхЗапрос Тогда
			ИТК_РедакторКодаКлиент.УстановитьФокус(ЭтотОбъект, Элементы.ТекстЗапроса);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьКоличествоВЗаголовке(ЭлементКоллекция);
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Функция СтрокаПриемникПеретаскиванияНабораДанных(Идентификатор)
	
	Если Идентификатор = Неопределено Тогда // Перенос в корень дерева
		
		Возврат НаборыДанных;
		
	Иначе
		
		Возврат НаборыДанных.НайтиПоИдентификатору(Идентификатор);
		
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Функция СтрокиНабораДанныхКоторыеМожноПеренести(АнализируемыеСтроки, ПараметрыПеретаскивания, ПриемникПеретаскивания)
	
	Результат = Новый Массив;
	Для Каждого Идентификатор Из АнализируемыеСтроки Цикл
		
		ПеретаскиваемаяСтрока = НаборыДанных.НайтиПоИдентификатору(Идентификатор);
		
		Если МожноПереместитьСтрокуНабораДанных(ПеретаскиваемаяСтрока, ПараметрыПеретаскивания, ПриемникПеретаскивания) Тогда
			
			Результат.Добавить(Идентификатор);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МожноПереместитьСтрокуНабораДанных(ПроверяемаяСтрока, ПараметрыПеретаскивания, ПриемникПеретаскивания)
	
	// Правила перетаскивания
	// 1. В корень дерева можно переносить любые элементы
	// 2. Строку нельзя переносить саму в себя
	// 3. Необходимо проверять не перемещается ли группа внутрь самой себя для избежания бесконечной рекурсии
	
	Если ТипЗнч(ПриемникПеретаскивания) = Тип("ДанныеФормыДерево") Тогда // (должно быть начальной проверкой) // 1
		
		Результат = Истина;
		
	ИначеЕсли ПроверяемаяСтрока = ПриемникПеретаскивания Тогда // 2
		
		Результат = Ложь;
		
	ИначеЕсли ИТК_ФормаКлиент.СтрокаДеревоВходитВСтроку(ПриемникПеретаскивания, ПроверяемаяСтрока) Тогда // 3
		
		Результат = Ложь;
		
	Иначе
		
		Результат = Истина;
				
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПереместитьСтрокуНабораДанных(Источник, Приемник, Копирование = Ложь, Активизировать = Ложь, ИндексВставки = Неопределено)
	
	Элемент = Элементы.НаборыДанных;
	Коллекция = Приемник.ПолучитьЭлементы();
	
	Если ИндексВставки = Неопределено Тогда
		НоваяСтрока = Коллекция.Добавить();
	Иначе 
		НоваяСтрока = Коллекция.Вставить(ИндексВставки + 1);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Источник, , "Поля");
	ИТК_ФормаКлиент.ДеревоСкопироватьСтроки(НоваяСтрока.Поля, Источник.Поля);
	
	Для Каждого Строка Из Источник.ПолучитьЭлементы() Цикл
		
		ПереместитьСтрокуНабораДанных(Строка, НоваяСтрока, Копирование);
		
		// Развернем в соответствии с источником
		Если Элемент.Развернут(Источник.ПолучитьИдентификатор()) Тогда
			Элемент.Развернуть(НоваяСтрока.ПолучитьИдентификатор());
		КонецЕсли;
		
	КонецЦикла;
	
	Если Активизировать Тогда
		
		Элемент.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Функция СтрокаПриемникПеретаскиванияПолейНабораДанных(Идентификатор)
	
	КоллекцияПолей = Элементы.НаборыДанных.ТекущиеДанные.Поля;
	Если Идентификатор = Неопределено Тогда // Перенос в корень дерева
		
		Результат = КоллекцияПолей;
		
	Иначе
		
		Результат = КоллекцияПолей.НайтиПоИдентификатору(Идентификатор);
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтрокиПолейНабораДанныхКоторыеМожноПеренести(АнализируемыеСтроки, ПараметрыПеретаскивания, ПриемникПеретаскивания)
	
	Результат = Новый Массив;
	Для Каждого Идентификатор Из АнализируемыеСтроки Цикл
		
		КоллекцияПолей = Элементы.НаборыДанных.ТекущиеДанные.Поля;
		ПеретаскиваемаяСтрока = КоллекцияПолей.НайтиПоИдентификатору(Идентификатор);
		
		Если МожноПереместитьСтрокуПолейНабораДанных(ПеретаскиваемаяСтрока, ПараметрыПеретаскивания, ПриемникПеретаскивания) Тогда
			
			Результат.Добавить(Идентификатор);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МожноПереместитьСтрокуПолейНабораДанных(ПроверяемаяСтрока, ПараметрыПеретаскивания, ПриемникПеретаскивания)
	
	// Данные проверяемой строки
	РодительПроверяемойСтроки = ПроверяемаяСтрока.ПолучитьРодителя();
	Если РодительПроверяемойСтроки = Неопределено Тогда
		ВидРодителяПроверяемойСтроки = Неопределено;
	Иначе
		ВидРодителяПроверяемойСтроки = РодительПроверяемойСтроки.Вид;
	КонецЕсли;
	ВидПроверяемойСтроки = ПроверяемаяСтрока.Вид;
	
	// Данные приемника перетаскивания
	ПриемникПеретаскиванияЭтоКорень = (ТипЗнч(ПриемникПеретаскивания) = Тип("ДанныеФормыДерево"));
	Если ПриемникПеретаскиванияЭтоКорень Тогда
		ВидПриемникаПеретаскивания = Неопределено;
		РодительПриемникаПеретаскивания = Неопределено;
	Иначе
		ВидПриемникаПеретаскивания = ПриемникПеретаскивания.Вид;
		РодительПриемникаПеретаскивания = ПриемникПеретаскивания.ПолучитьРодителя();
	КонецЕсли;
	Если РодительПриемникаПеретаскивания = Неопределено Тогда
		ВидРодителяПриемникаПеретаскивания = Неопределено;
	Иначе
		ВидРодителяПриемникаПеретаскивания = РодительПриемникаПеретаскивания.Вид;
	КонецЕсли;
		
	// Правила перетаскивания
	// 1. Строку нельзя переносить саму в себя
	// 2. Необходимо проверять не перемещается ли группа внутрь самой себя для избежания бесконечной рекурсии
	// 3. Коллекцию (папку или набор) нельзя переностить в другую коллекцию
	// 4. Внутрь набора можно пемещать только поля которые уже в нем находятся
	// 5. В корень дерева можно переносить любые элементы, кроме полей набора
	
	Если ПроверяемаяСтрока = ПриемникПеретаскивания Тогда // 1
		
		Результат = Ложь;
		
	ИначеЕсли ИТК_ФормаКлиент.СтрокаДеревоВходитВСтроку(ПриемникПеретаскивания, ПроверяемаяСтрока) Тогда // 2
		
		Результат = Ложь;
		
	ИначеЕсли ЭтоПолеНабораДанныхКоллеция(ВидПроверяемойСтроки)
				И (ЭтоПолеНабораДанныхКоллеция(ВидПриемникаПеретаскивания)
					ИЛИ ЭтоПолеНабораДанныхКоллеция(ВидРодителяПриемникаПеретаскивания)) Тогда // 3

		Результат = Ложь;
		
	ИначеЕсли РодительПроверяемойСтроки <> ПриемникПеретаскивания
				И РодительПроверяемойСтроки <> РодительПриемникаПеретаскивания
				И (ВидРодителяПриемникаПеретаскивания = ИТК_Перечисления.СКДВидыПолейНаборовДанныхНабор()
						ИЛИ ВидРодителяПроверяемойСтроки = ИТК_Перечисления.СКДВидыПолейНаборовДанныхНабор()
						ИЛИ ВидПриемникаПеретаскивания = ИТК_Перечисления.СКДВидыПолейНаборовДанныхНабор()) Тогда // 4
				
		Результат = Ложь;
		
	ИначеЕсли ПриемникПеретаскиванияЭтоКорень
			И ВидРодителяПроверяемойСтроки = ИТК_Перечисления.СКДВидыПолейНаборовДанныхНабор() Тогда // 5
		
		Результат = Ложь;
		
	Иначе
		
		Результат = Истина;
				
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПереместитьСтрокуПолейНабораДанных(Источник, Приемник, Копирование = Ложь, Активизировать = Ложь, ИндексВставки = Неопределено)
	
	Элемент = Элементы.ПоляНаборовДанных;
	Коллекция = Приемник.ПолучитьЭлементы();
	
	Если ИндексВставки = Неопределено Тогда
		НоваяСтрока = Коллекция.Добавить();
	Иначе 
		НоваяСтрока = Коллекция.Вставить(ИндексВставки + 1);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Источник);
	
	Для Каждого Строка Из Источник.ПолучитьЭлементы() Цикл
		
		ПереместитьСтрокуПолейНабораДанных(Строка, НоваяСтрока, Копирование);
		
		// Развернем в соответствии с источником
		Если Элемент.Развернут(Источник.ПолучитьИдентификатор()) Тогда
			Элемент.Развернуть(НоваяСтрока.ПолучитьИдентификатор());
		КонецЕсли;
		
	КонецЦикла;
	
	Если Активизировать Тогда
		
		Элемент.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Функция ЭтоПолеНабораДанныхКоллеция(Вид)
	
	Результат = (Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа()
					ИЛИ Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхНабор());
					
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаТекстЗапросаПриИзменении(Результат, ДополнительныеПараметры) Экспорт
	
	ИзмененТекстЗапроса();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыРедактораЗавершена(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_РедакторКодаКлиент.СтандартныйОбработчикЗавершенияКоманды(Результат, ДополнительныеПараметры);	
	
	ИТК_РедакторКодаКлиент.УстановитьТекст(ЭтотОбъект, ДополнительныеПараметры.Элемент, Результат);
	ИзмененТекстЗапроса(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаКонструктораЗапросаЗавершена(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы["ТекстЗапроса"];
	ИТК_РедакторКодаКлиент.УстановитьТекст(ЭтотОбъект, Элемент, Результат);
	ИзмененТекстЗапроса(Истина);
	
	ОбработкаПослеИзмененияЗапросаНабораДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененТекстЗапроса(Проверен = Ложь)
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущаяСтрока.ТекстЗапроса = ИТК_РедакторКодаКлиент.Текст(ЭтотОбъект, "ТекстЗапроса");
	ТекущаяСтрока.ТекстОшибки = Неопределено;
	ТекущаяСтрока.ТребуетсяПроверка = НЕ Проверен;
	
	Если Проверен Тогда
		
		ЗаполнитьПоляНабораДанных();
		ОбновитьЭлементыФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоляНабораДанных()
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущаяСтрока.Автозаполнение Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = Элементы.НаборыДанных.ТекущаяСтрока;
	ЗаполнитьПоляНабораДанныхНаСервере(Идентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляНабораДанныхНаСервере(Идентификатор)
	
	СтрокаНабора = НаборыДанных.НайтиПоИдентификатору(Идентификатор);
	Если НЕ ЗначениеЗаполнено(СтрокаНабора.ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;

	СхемаЗапроса = Новый СхемаЗапроса;
	Если ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.14") Тогда
		СхемаЗапроса.РежимКомпоновкиДанных = Истина;
	КонецЕсли;
	
	СхемаЗапроса.УстановитьТекстЗапроса(СтрокаНабора.ТекстЗапроса);
	
	ЗапросПакета = ИТК_КонструкторСКД.ПоследнийЗапросВыборкиПакета(СхемаЗапроса);
	Если ЗапросПакета = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	// Добавляем/обновлеяем поля набора
	Для Каждого Колонка Из ЗапросПакета.Колонки Цикл
		
		ДобавитьОбновитьПолеНабора(СтрокаНабора.Поля, Колонка);
		
	КонецЦикла;
	
	УдалитьНеиспользуемыеПоляНаборовДанных(СтрокаНабора.Поля, ЗапросПакета.Колонки);
		
КонецПроцедуры

&НаСервере
Функция ДобавитьОбновитьПолеНабора(Приемник, ПолеНабора)
	
	ЭтоКолонкаВложеннаяТаблицаСхемыЗапроса = (ТипЗнч(ПолеНабора) = Тип("КолонкаВложеннаяТаблицаСхемыЗапроса"));
	ЭтоКолонкаСхемыЗапроса = (ТипЗнч(ПолеНабора) = Тип("КолонкаСхемыЗапроса"));
	ЭтоПолеНабораДанныхСхемыКомпоновкиДанных = (ТипЗнч(ПолеНабора) = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ЭтоВложенныйНаборДанныхСхемыКомпоновкиДанных = (ТипЗнч(ПолеНабора) = Тип("ВложенныйНаборДанныхСхемыКомпоновкиДанных"));
	ЭтоПапкаПолейНабораДанныхСхемыКомпоновкиДанных = (ТипЗнч(ПолеНабора) = Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных"));
	
	Если ЭтоКолонкаВложеннаяТаблицаСхемыЗапроса
			ИЛИ ЭтоВложенныйНаборДанныхСхемыКомпоновкиДанных Тогда
		
		Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхНабор();
		
	ИначеЕсли ЭтоПапкаПолейНабораДанныхСхемыКомпоновкиДанных Тогда
		
		Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа();
		
	ИначеЕсли ЭтоКолонкаСхемыЗапроса
				ИЛИ ЭтоПолеНабораДанныхСхемыКомпоновкиДанных Тогда
		
		Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхПоле();
		
	КонецЕсли;
	
	ИмяНабораГруппы = "";
	Если ЭтоПолеНабораДанныхСхемыКомпоновкиДанных
			ИЛИ ЭтоВложенныйНаборДанныхСхемыКомпоновкиДанных Тогда
			
		ИмяПоля = ПолеНабора.Поле;
		
		ЧастиПутьКДанным = СтрРазделить(ПолеНабора.ПутьКДанным, ".");
		Если ЧастиПутьКДанным.Количество() = 1 Тогда
			
			ИмяПоля = ПолеНабора.Поле;
			
		Иначе
			
			ИмяНабораГруппы = ЧастиПутьКДанным[0];
			ИмяПоля = ЧастиПутьКДанным[1];
			
		КонецЕсли;
		
	ИначеЕсли ЭтоКолонкаСхемыЗапроса
			ИЛИ ЭтоКолонкаВложеннаяТаблицаСхемыЗапроса Тогда
			
		ИмяПоля = ПолеНабора.Псевдоним;
		
	ИначеЕсли ЭтоПапкаПолейНабораДанныхСхемыКомпоновкиДанных Тогда
		
		ИмяПоля = ПолеНабора.ПутьКДанным;
		
	КонецЕсли;
	
	Родитель = Приемник;
	Если ЗначениеЗаполнено(ИмяНабораГруппы) Тогда
		
		СтрокаГруппа = НайтиСтрокуПолеНабораВДереве(Приемник, ИмяНабораГруппы);
		Если СтрокаГруппа = Неопределено Тогда
			
			СтрокаГруппа = Приемник.ПолучитьЭлементы().Добавить();
			СтрокаГруппа.Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа();
			СтрокаГруппа.Картинка = ИТК_КонструкторСКДКлиентСервер.КартинкаПоляНабораДанных(СтрокаГруппа.Вид);
			СтрокаГруппа.Поле = ИмяНабораГруппы;
			
		КонецЕсли;
		
		Родитель = СтрокаГруппа;
		
	КонецЕсли;
	
	СтрокаПоле = НайтиСтрокуПолеНабораВДереве(Приемник, ИмяПоля, ИмяНабораГруппы);
	Если ЗначениеЗаполнено(ИмяНабораГруппы) 
			И СтрокаПоле = Неопределено Тогда
			
		СтрокаПоле = НайтиСтрокуПолеНабораВДереве(Приемник, ИмяПоля);
		Если СтрокаПоле <> Неопределено Тогда
			
			// Это поле есть его нужно занести в группу и удалить старое
			СтрокаНовоеПоле = СтрокаГруппа.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНовоеПоле, СтрокаПоле);
			
			Приемник.ПолучитьЭлементы().Удалить(СтрокаПоле);
			СтрокаПоле = СтрокаНовоеПоле;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновлениеПоля = (СтрокаПоле <> Неопределено);
	Если НЕ ОбновлениеПоля Тогда
		СтрокаПоле = Родитель.ПолучитьЭлементы().Добавить();
	КонецЕсли;
	
	СтрокаПоле.Вид = Вид;
	СтрокаПоле.Картинка = ИТК_КонструкторСКДКлиентСервер.КартинкаПоляНабораДанных(Вид);
	СтрокаПоле.Поле = ИмяПоля;
	
	// Заполнение других полей
	ТипЗначенияВЗапросе = Неопределено;
	ВыражениеПредставления = "";
	ВыраженияУпорядочивания = ЗначениеВыраженияУпорядочивания();
	НаборДанныхПроверкиИерархии = Неопределено;
	ПараметрНабораДанныхПроверкиИерархии = Неопределено;
	ТипЗначения = Неопределено;
	ДоступныеЗначения = Неопределено;
	Оформление = Неопределено;
	ПараметрыРедактирования = Неопределено;
	
	ОграничениеИспользованияПоле = Неопределено;
	ОграничениеИспользованияУсловие = Неопределено;
	ОграничениеИспользованияГруппировка = Неопределено;
	ОграничениеИспользованияПорядок = Неопределено;
	
	ОграничениеИспользованияРеквизитовПоле = Неопределено;
	ОграничениеИспользованияРеквизитовУсловие = Неопределено;
	ОграничениеИспользованияРеквизитовГруппировка = Неопределено;
	ОграничениеИспользованияРеквизитовПорядок = Неопределено;
			
	Если ОбновлениеПоля Тогда
		
		ЗаголовокПоля = СтрокаПоле.Заголовок;
		
		Роль = СтрокаПоле.Роль;
		ВыражениеПредставления = СтрокаПоле.ВыражениеПредставления;
		ВыраженияУпорядочивания = СтрокаПоле.ВыраженияУпорядочивания;
		
		НаборДанныхПроверкиИерархии = СтрокаПоле.НаборДанныхПроверкиИерархии;
		ПараметрНабораДанныхПроверкиИерархии = СтрокаПоле.ПараметрНабораДанныхПроверкиИерархии;
		
		ТипЗначения = СтрокаПоле.ТипЗначения;
		ДоступныеЗначения = СтрокаПоле.ДоступныеЗначения;
		
		ОграничениеИспользованияПоле = СтрокаПоле.ОграничениеИспользованияПоле;
		ОграничениеИспользованияУсловие = СтрокаПоле.ОграничениеИспользованияУсловие;
		ОграничениеИспользованияГруппировка = СтрокаПоле.ОграничениеИспользованияГруппировка;
		ОграничениеИспользованияПорядок = СтрокаПоле.ОграничениеИспользованияПорядок;
		
		ОграничениеИспользованияРеквизитовПоле = СтрокаПоле.ОграничениеИспользованияРеквизитовПоле;
		ОграничениеИспользованияРеквизитовУсловие = СтрокаПоле.ОграничениеИспользованияРеквизитовУсловие;
		ОграничениеИспользованияРеквизитовГруппировка = СтрокаПоле.ОграничениеИспользованияРеквизитовГруппировка;
		ОграничениеИспользованияРеквизитовПорядок = СтрокаПоле.ОграничениеИспользованияРеквизитовПорядок;
		
		Если ЭтоПолеНабораДанныхСхемыКомпоновкиДанных
				ИЛИ ЭтоКолонкаСхемыЗапроса Тогда
				
			ТипЗначенияВЗапросе = ПолеНабора.ТипЗначения;
				
		КонецЕсли;
		
	Иначе
		
		Если ЭтоКолонкаВложеннаяТаблицаСхемыЗапроса Тогда
			
			// Добавление полей набора
			Для Каждого ВложеннаяКолонка Из ПолеНабора.Колонки Цикл
				ДобавитьОбновитьПолеНабора(СтрокаПоле, ВложеннаяКолонка);
			КонецЦикла;
			
		ИначеЕсли ЭтоКолонкаСхемыЗапроса Тогда
			
			ЗаголовокПоля = ИТК_Строки.ПредставлениеИдентификатора(ПолеНабора.Псевдоним);
			Роль = ИТК_СКДКлиентСервер.ПустоеОписаниеРолиПоляНабораДанных();
			ТипЗначенияВЗапросе = ПолеНабора.ТипЗначения;
			
		ИначеЕсли ЭтоПолеНабораДанныхСхемыКомпоновкиДанных Тогда
			
			ЗаголовокПоля = ПолеНабора.Заголовок;
			Роль = ИТК_СКД.ОписаниеРолиПоляНабораДанных(ПолеНабора.Роль);
			ВыражениеПредставления = ПолеНабора.ВыражениеПредставления;
			ТипЗначенияВЗапросе = Ложь;
			
			НаборДанныхПроверкиИерархии = ПолеНабора.НаборДанныхПроверкиИерархии;
			ПараметрНабораДанныхПроверкиИерархии = ПолеНабора.ПараметрНабораДанныхПроверкиИерархии;
			
			ТипЗначения = ПолеНабора.ТипЗначения;
			ДоступныеЗначения = ПолеНабора.ПолучитьДоступныеЗначения();
			Оформление = ПолеНабора.Оформление;
			ПараметрыРедактирования = ПолеНабора.ПараметрыРедактирования;
			
			ВыраженияУпорядочивания = ЗначениеВыраженияУпорядочивания(ПолеНабора.ВыраженияУпорядочивания);
			
		КонецЕсли;
		
		Если ЭтоПапкаПолейНабораДанныхСхемыКомпоновкиДанных
				ИЛИ ЭтоПолеНабораДанныхСхемыКомпоновкиДанных Тогда
			
			ОграничениеИспользования = ПолеНабора.ОграничениеИспользования;
			ОграничениеИспользованияПоле = ОграничениеИспользования.Поле;
			ОграничениеИспользованияУсловие = ОграничениеИспользования.Условие;
			ОграничениеИспользованияГруппировка = ОграничениеИспользования.Группировка;
			ОграничениеИспользованияПорядок = ОграничениеИспользования.Порядок;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Заголовок поля
	Если Не ЗначениеЗаполнено(ЗаголовокПоля) Тогда
		ЗаголовокПоля = ИТК_Строки.ПредставлениеИдентификатора(ИмяПоля);
	КонецЕсли;
	СтрокаПоле.Заголовок = ЗаголовокПоля;
	
	// Роль
	СтрокаПоле.Роль = Роль;
	ПредставлениеРоли = ИТК_СКД.ПредставлениеОписанияРолиПоляНабораДанных(Роль);
	СтрокаПоле.РольПредставление = ПредставлениеРоли;
	
	СтрокаПоле.ВыражениеПредставления = ВыражениеПредставления;
	СтрокаПоле.ВыраженияУпорядочивания = ВыраженияУпорядочивания;
	СтрокаПоле.ВыраженияУпорядочиванияПредставление = ИТК_СКДКлиентСервер.ПредставлениеВыраженийУпорядочивания(ВыраженияУпорядочивания);
	
	СтрокаПоле.НаборДанныхПроверкиИерархии = НаборДанныхПроверкиИерархии;
	СтрокаПоле.ПараметрНабораДанныхПроверкиИерархии = ПараметрНабораДанныхПроверкиИерархии;
	
	СтрокаПоле.ТипЗначения = ТипЗначения;
	СтрокаПоле.ДоступныеЗначения = ДоступныеЗначения;
	
	ИТК_СКД.СкопироватьСтруктурноеПоле(СтрокаПоле.Оформление, Оформление);
	ИТК_СКД.СкопироватьСтруктурноеПоле(СтрокаПоле.ПараметрыРедактирования, ПараметрыРедактирования);
	
	// Тип значения и определяемые по нему
	Если ТипЗначенияВЗапросе = Неопределено Тогда
		
		ПолеСРеквизитами = Ложь;
		ПолеТолькоДляВыбора = Ложь;
		
	ИначеЕсли ТипЗначенияВЗапросе = Ложь Тогда
		
		ПолеСРеквизитами = Истина;
		ПолеТолькоДляВыбора = Ложь;
		
	Иначе 
		
		ПолеСРеквизитами = ИТК_КонструкторСКД.ПолеСРеквизитами(ТипЗначенияВЗапросе);
		ПолеТолькоДляВыбора = ИТК_КонструкторСКД.ПолеТолькоДляВыбора(ТипЗначенияВЗапросе);
		
	КонецЕсли;
	СтрокаПоле.ТипЗначенияВЗапросе = ТипЗначенияВЗапросе;
	СтрокаПоле.ПолеСРеквизитами = ПолеСРеквизитами;
	СтрокаПоле.ПолеТолькоДляВыбора = ПолеТолькоДляВыбора;
	
	Если ПолеТолькоДляВыбора Тогда
		
		ОграничениеИспользованияУсловие = Истина;
		ОграничениеИспользованияГруппировка = Истина;
		ОграничениеИспользованияПорядок = Истина;
		
	КонецЕсли;
	
	СтрокаПоле.ОграничениеИспользованияПоле = ОграничениеИспользованияПоле;
	СтрокаПоле.ОграничениеИспользованияУсловие = ОграничениеИспользованияУсловие;
	СтрокаПоле.ОграничениеИспользованияГруппировка = ОграничениеИспользованияГруппировка;
	СтрокаПоле.ОграничениеИспользованияПорядок = ОграничениеИспользованияПорядок;
	
	Если НЕ ПолеСРеквизитами Тогда
		
		ОграничениеИспользованияРеквизитовПоле = Истина;
		ОграничениеИспользованияРеквизитовУсловие = Истина;
		ОграничениеИспользованияРеквизитовГруппировка = Истина;
		ОграничениеИспользованияРеквизитовПорядок = Истина;
		
	КонецЕсли;
	
	СтрокаПоле.ОграничениеИспользованияРеквизитовПоле = ОграничениеИспользованияРеквизитовПоле;
	СтрокаПоле.ОграничениеИспользованияРеквизитовУсловие = ОграничениеИспользованияРеквизитовУсловие;
	СтрокаПоле.ОграничениеИспользованияРеквизитовГруппировка = ОграничениеИспользованияРеквизитовГруппировка;
	СтрокаПоле.ОграничениеИспользованияРеквизитовПорядок = ОграничениеИспользованияРеквизитовПорядок;
	
	Возврат СтрокаПоле;
	
КонецФункции

&НаСервере
Функция НайтиСтрокуПолеНабораВДереве(Строка, Имя, ИмяНабораГруппы = "")
	
	Результат = Неопределено;
	КоллекцияСтрок = Строка;
	
	Если ЗначениеЗаполнено(ИмяНабораГруппы) Тогда
		
		Для Каждого СтрокаПоле Из КоллекцияСтрок.ПолучитьЭлементы() Цикл 
			
			Если СтрокаПоле.Поле <> ИмяНабораГруппы Тогда
				Продолжить;
			КонецЕсли;
				
			КоллекцияСтрок = СтрокаПоле;
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого СтрокаПоле Из КоллекцияСтрок.ПолучитьЭлементы() Цикл 
		
		Если СтрокаПоле.Поле = Имя Тогда
			
			Результат = СтрокаПоле;
			Прервать;
			
		КонецЕсли;
		
		Если СтрокаПоле.Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа() Тогда
			
			Результат = НайтиСтрокуПолеНабораВДереве(СтрокаПоле, Имя, ИмяНабораГруппы);
			Если Результат <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УдалитьНеиспользуемыеПоляНаборовДанных(Коллекция, Колонки)
	
	КоллекцияСтрок = Коллекция.ПолучитьЭлементы();
	
	УдаляемыеПоля = Новый Массив;
	Для Каждого Строка Из КоллекцияСтрок Цикл 
		
		Колонка = Колонки.Найти(Строка.Поле);
		Если ТипЗнч(Колонка) = Тип("КолонкаВложеннаяТаблицаСхемыЗапроса") Тогда
			УдалитьНеиспользуемыеПоляНаборовДанных(Строка, Колонка.Колонки);
		КонецЕсли;
		
		Если Колонка <> Неопределено
				ИЛИ Строка.Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа() Тогда
			Продолжить;
		КонецЕсли;
		
		УдаляемыеПоля.Добавить(Строка);

	КонецЦикла;
	
	Для Каждого УдаляемоеПоле Из УдаляемыеПоля Цикл 
		КоллекцияСтрок.Удалить(УдаляемоеПоле);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборыДанныхПоляРольЗавершениеРедактирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	ТекущиеДанные.Роль = Результат.ОписаниеРоли;
	ТекущиеДанные.РольПредставление = Результат.Представление;

КонецПроцедуры

&НаКлиенте
Функция ДоступныеПоляНабораДанных(Данные = Неопределено)
	
	Если Данные = Неопределено Тогда
		Данные = Элементы.НаборыДанных.ТекущиеДанные;
	КонецЕсли;
	
	Если Данные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый СписокЗначений;
	
	Если ТипЗнч(Данные) = Тип("ДанныеФормыДерево") Тогда
		
		Для Каждого СтрокаНабора Из Данные.ПолучитьЭлементы() Цикл 
			
			ДобавитьДоступныеПоляНабораДанныхОбход(Результат, СтрокаНабора.Поля);
			
		КонецЦикла;
		
	Иначе 
		
		КоллекцияПолей = Данные.Поля;
		ДобавитьДоступныеПоляНабораДанныхОбход(Результат, КоллекцияПолей);
		
	КонецЕсли;
	
	// Добавление вычисляемых полей
	Для Каждого СтрокаВычисляемоеПоле Из ВычисляемыеПоля.ПолучитьЭлементы() Цикл 
		Результат.Добавить(СтрокаВычисляемоеПоле.ТипЗначения, СтрокаВычисляемоеПоле.Поле, Истина);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ДобавитьДоступныеПоляНабораДанныхОбход(Результат, Знач Строка) 

	Для Каждого ПолеНабораДанных Из Строка.ПолучитьЭлементы() Цикл 
		
		Если ПолеНабораДанных.Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхНабор() Тогда
			
			ПоляВложенногоНабора = Новый СписокЗначений;
			ДобавитьДоступныеПоляНабораДанныхОбход(ПоляВложенногоНабора, ПолеНабораДанных);
			Результат.Добавить(ПоляВложенногоНабора, ПолеНабораДанных.Поле);
			
		ИначеЕсли ПолеНабораДанных.Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхПоле() Тогда
			
			ТипЗначения = ПолеНабораДанных.ТипЗначения;
			Если НЕ ЗначениеЗаполнено(ТипЗначения) Тогда
				ТипЗначения = ПолеНабораДанных.ТипЗначенияВЗапросе;
			КонецЕсли;
			
			Результат.Добавить(ТипЗначения, ПолеНабораДанных.Поле);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборыДанныхПоляВыраженияУпорядочиванияЗавершениеРедактирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	ТекущиеДанные.ВыраженияУпорядочивания = Результат;
	ТекущиеДанные.ВыраженияУпорядочиванияПредставление = ИТК_СКДКлиентСервер.ПредставлениеВыраженийУпорядочивания(Результат);

КонецПроцедуры

&НаКлиенте
Процедура ИсточникиДанныхЗавершениеРедактирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникиДанных.Очистить();
	
	Для Каждого ЭлементИсточникДанных Из Результат Цикл 
		
		НоваяСтрока = ИсточникиДанных.Добавить();
		НоваяСтрока.Имя = ЭлементИсточникДанных.Представление;
		
	КонецЦикла;
	
	ОбновитьСписокДоступныхИсточников();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДоступныхИсточников()
	
	СписокВыбора = Элементы.Источник.СписокВыбора;
	СписокВыбора.Очистить();
	
	Для Каждого ОписаниеИсточникаДанных Из ИсточникиДанных Цикл 
		
		
		СписокВыбора.Добавить(ОписаниеИсточникаДанных.Имя);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбработчикСПроверкойНаСохранностьДанных(ОписаниеОбработчика)
	
	Если Модифицированность Тогда
		
		// Список вариантов ответа
		ВариантыОтвета = Новый СписокЗначений;
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Да,		НСтр("ru = 'Сохранить';
																	|en = 'Save'"));
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Нет,		НСтр("ru = 'Нет';
																	|en = 'No'"));
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Отмена,	НСтр("ru = 'Отмена';
																	|en = 'Cancel'"));
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросСохраненияЗавершение", ЭтотОбъект, ОписаниеОбработчика),
								НСтр("ru = 'Схема компоновки данных изменена. Сохранить схему?';
									|en = 'Data composition schema changed. Save schematic?'"), ВариантыОтвета, , КодВозвратаДиалога.Да,
								ИТК_ТуллкитКлиентСервер.КонструкторСКДПредставление());
		
	Иначе 
		
		ВыполнитьОбработкуОповещения(ОписаниеОбработчика);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросСохраненияЗавершение(Результат, ОписаниеОбработчика) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОбработчика, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытиеРазрешеноЗакрыть(Результат, ДополнительныеПараметры) Экспорт
	
	ЗакрытиеРазрешено = Истина;
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция СобратьСхемуКомпоновкиДанныхИзДанныхФормы()
	
	Результат = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	// Источники
	Для Каждого ОписаниеИсточникаДанных Из ИсточникиДанных Цикл 
		
		НовыйИсточник = Результат.ИсточникиДанных.Добавить();
		НовыйИсточник.Имя = ОписаниеИсточникаДанных.Имя;
		НовыйИсточник.ТипИсточникаДанных = "Local";
		
	КонецЦикла;
	
	ЗагрузитьИсточникиДанныхВСхему(Результат.ИсточникиДанных);
	ЗагрузитьНаборДанныхВСхему(Результат.НаборыДанных, НаборыДанных);
	ЗагрузитьСвязиНаборовДанныхВСхему(Результат.СвязиНаборовДанных);
	ЗагрузитьВычисляемыеПоляВСхему(Результат.ВычисляемыеПоля);
	ЗагрузитьРесурсыВСхему(Результат.ПоляИтога);
	ЗагрузитьПараметрыВСхему(Результат.Параметры);
	ЗагрузитьМакетВСхему(Результат);
	ЗагрузитьВложенныеСхемыВСхему(Результат.ВложенныеСхемыКомпоновкиДанных);
	ЗагрузитьВариантыНастроекВСхему(Результат.ВариантыНастроек);
	
	ЗагрузитьПредставленияЗаголовковВСхему(Результат);
	
	Возврат ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьИсточникиДанныхВСхему(ИсточникиДанныхСКД)
	
	ИсточникиДанныхСКД.Очистить();
	
	Для Каждого СтрокаИсточникДанных Из ИсточникиДанных Цикл 
		
		НовыйИсточникДанных = ИсточникиДанныхСКД.Добавить();
		НовыйИсточникДанных.Имя = СтрокаИсточникДанных.Имя;
		НовыйИсточникДанных.ТипИсточникаДанных = "Local";
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаборДанныхВСхему(КоллекцияНаборовДанныхСКД, Родитель)
	
	КоллекцияНаборовДанныхСКД.Очистить();
	
	Для Каждого ОписаниеНабораДанных Из Родитель.ПолучитьЭлементы() Цикл 
		
		ТипНабораДанных = ИТК_СКД.ТипНабораДанныхСхемыКомпоновкиДанных(ОписаниеНабораДанных.Вид);
		НовыйНаборДанных = КоллекцияНаборовДанныхСКД.Добавить(ТипНабораДанных);
		
		НовыйНаборДанных.Имя = ОписаниеНабораДанных.Представление;
		
		Если ТипНабораДанных = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			
			НовыйНаборДанных.ИсточникДанных = ОписаниеНабораДанных.Источник;
			НовыйНаборДанных.Запрос = ОписаниеНабораДанных.ТекстЗапроса;
			НовыйНаборДанных.АвтоЗаполнениеДоступныхПолей = ОписаниеНабораДанных.АвтоЗаполнение;
			
			Если ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.14") Тогда
				НовыйНаборДанных.ИспользоватьГруппировкиЗапросаЕслиВозможно = ОписаниеНабораДанных.ИспользоватьГруппировкиЗапросаЕслиВозможно;
			КонецЕсли;
			
		ИначеЕсли ТипНабораДанных = Тип("НаборДанныхОбъектСхемыКомпоновкиДанных") Тогда
			
			НовыйНаборДанных.ИмяОбъекта = ОписаниеНабораДанных.ИмяОбъекта;
			НовыйНаборДанных.ИсточникДанных = ОписаниеНабораДанных.Источник;
			
		ИначеЕсли ТипНабораДанных = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных") Тогда
			
			ЗагрузитьНаборДанныхВСхему(НовыйНаборДанных.Элементы, ОписаниеНабораДанных);
			
		КонецЕсли;
		
		ЗагрузитьНаборПолейДанныхВСхему(НовыйНаборДанных.Поля, ОписаниеНабораДанных.Поля);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаборПолейДанныхВСхему(КоллекцияПолейНаборовДанныхСКД, Родитель, ПрефиксПутьКДанным = "")
	
	Для Каждого ОписаниеПоляНабораДанных Из Родитель.ПолучитьЭлементы() Цикл 
		
		Поле = ОписаниеПоляНабораДанных.Поле;
		ТипПоляНабораДанных = ИТК_СКД.ТипПоляНабораДанныхСхемыКомпоновкиДанных(ОписаниеПоляНабораДанных.Вид);
		НовоеПолеНабораДанных = КоллекцияПолейНаборовДанныхСКД.Добавить(ТипПоляНабораДанных);
		
		АвтоЗаголовокПоля = ИТК_Строки.ПредставлениеИдентификатора(Поле);
		Если АвтоЗаголовокПоля <> ОписаниеПоляНабораДанных.Заголовок Тогда
			НовоеПолеНабораДанных.Заголовок = ОписаниеПоляНабораДанных.Заголовок;
		КонецЕсли;
		
		ПутьКДанным = Поле;
		Если ЗначениеЗаполнено(ПрефиксПутьКДанным) Тогда
			ПутьКДанным = ПрефиксПутьКДанным + "." + ПутьКДанным;
		КонецЕсли;
		НовоеПолеНабораДанных.ПутьКДанным = ПутьКДанным;
		
		Если ТипПоляНабораДанных = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
			
			НовоеПолеНабораДанных.Поле = Поле;
			НовоеПолеНабораДанных.ВыражениеПредставления = ОписаниеПоляНабораДанных.ВыражениеПредставления;
			
			ОграничениеИспользования = НовоеПолеНабораДанных.ОграничениеИспользования;
			ОграничениеИспользования.Поле = ОписаниеПоляНабораДанных.ОграничениеИспользованияПоле;
			ОграничениеИспользования.Условие = ОписаниеПоляНабораДанных.ОграничениеИспользованияУсловие;
			ОграничениеИспользования.Группировка = ОписаниеПоляНабораДанных.ОграничениеИспользованияГруппировка;
			ОграничениеИспользования.Порядок = ОписаниеПоляНабораДанных.ОграничениеИспользованияПорядок;
			
			Если ОписаниеПоляНабораДанных.ПолеСРеквизитами Тогда
				ОграничениеИспользованияРеквизитов = НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов;
				ОграничениеИспользованияРеквизитов.Поле = ОписаниеПоляНабораДанных.ОграничениеИспользованияРеквизитовПоле;
				ОграничениеИспользованияРеквизитов.Условие = ОписаниеПоляНабораДанных.ОграничениеИспользованияРеквизитовУсловие;
				ОграничениеИспользованияРеквизитов.Группировка = ОписаниеПоляНабораДанных.ОграничениеИспользованияРеквизитовГруппировка;
				ОграничениеИспользованияРеквизитов.Порядок = ОписаниеПоляНабораДанных.ОграничениеИспользованияРеквизитовПорядок;
			КонецЕсли;
			
			ИТК_СКД.ЗаполнитьРольПолеНабораДанныхПоОписанию(НовоеПолеНабораДанных.Роль, ОписаниеПоляНабораДанных.Роль);
			
			// ВыраженияУпорядочивания
			ВыраженияУпорядочивания = НовоеПолеНабораДанных.ВыраженияУпорядочивания;
			Для Каждого ЭлементВыраженияУпорядочивания Из ОписаниеПоляНабораДанных.ВыраженияУпорядочивания Цикл 
				
				НовыйЭлементУпорядочивания = ВыраженияУпорядочивания.Добавить();
				НовыйЭлементУпорядочивания.Автоупорядочивание = ЭлементВыраженияУпорядочивания.Пометка;
				НовыйЭлементУпорядочивания.Выражение = ЭлементВыраженияУпорядочивания.Представление;
				НовыйЭлементУпорядочивания.ТипУпорядочивания = ЭлементВыраженияУпорядочивания.Значение;

			КонецЦикла;
			
			// Проверка Иерархии
			НовоеПолеНабораДанных.НаборДанныхПроверкиИерархии = ОписаниеПоляНабораДанных.НаборДанныхПроверкиИерархии;
			НовоеПолеНабораДанных.ПараметрНабораДанныхПроверкиИерархии = ОписаниеПоляНабораДанных.ПараметрНабораДанныхПроверкиИерархии;
			
			// Тип значения и доступные значения
			НовоеПолеНабораДанных.ТипЗначения = ОписаниеПоляНабораДанных.ТипЗначения;
			НовоеПолеНабораДанных.УстановитьДоступныеЗначения(ОписаниеПоляНабораДанных.ДоступныеЗначения);
			
			// Оформление и параметры редактирования
			ИТК_СКД.СкопироватьСтруктурноеПоле(НовоеПолеНабораДанных.Оформление, ОписаниеПоляНабораДанных.Оформление);
			ИТК_СКД.СкопироватьСтруктурноеПоле(НовоеПолеНабораДанных.ПараметрыРедактирования, ОписаниеПоляНабораДанных.ПараметрыРедактирования);
			
		ИначеЕсли ТипПоляНабораДанных = Тип("ВложенныйНаборДанныхСхемыКомпоновкиДанных") Тогда
			
			НовоеПолеНабораДанных.Поле = ПутьКДанным;
			ЗагрузитьНаборПолейДанныхВСхему(КоллекцияПолейНаборовДанныхСКД, ОписаниеПоляНабораДанных, НовоеПолеНабораДанных.Поле);
			
		ИначеЕсли ТипПоляНабораДанных = Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных") Тогда
			
			НовоеПолеНабораДанных.ПутьКДанным = ПутьКДанным;
			
			ОграничениеИспользования = НовоеПолеНабораДанных.ОграничениеИспользования;
			ОграничениеИспользования.Поле = ОписаниеПоляНабораДанных.ОграничениеИспользованияПоле;
			ОграничениеИспользования.Условие = ОписаниеПоляНабораДанных.ОграничениеИспользованияУсловие;
			ОграничениеИспользования.Группировка = ОписаниеПоляНабораДанных.ОграничениеИспользованияГруппировка;
			ОграничениеИспользования.Порядок = ОписаниеПоляНабораДанных.ОграничениеИспользованияПорядок;
			
			ЗагрузитьНаборПолейДанныхВСхему(КоллекцияПолейНаборовДанныхСКД, ОписаниеПоляНабораДанных, ПутьКДанным);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВариантыНастроекВСхему(ВариантыНастроекСКД)
	
	ВариантыНастроекСКД.Очистить();
	
	Для Каждого СтрокаВариантНастроек Из ВариантыНастроек Цикл 
		
		НовыйВариантНастроек = ВариантыНастроекСКД.Добавить();
		НовыйВариантНастроек.Имя = СтрокаВариантНастроек.Имя;
		НовыйВариантНастроек.Представление = СтрокаВариантНастроек.Заголовок;
		
		ВариантНастроек = ИТК_СКД.ВариантНастроек(СтрокаВариантНастроек.Значение);
		ИТК_СКД.СкопироватьВариантНастроек(НовыйВариантНастроек.Настройки, ВариантНастроек);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСвязиНаборовДанныхВСхему(СвязиНаборовДанныхСКД)
	
	СвязиНаборовДанныхСКД.Очистить();
	
	Для Каждого СтрокаСвязьНаборовДанных Из СвязиНаборовДанных Цикл 
		
		НоваяСвязьНаборовДанных = СвязиНаборовДанныхСКД.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСвязьНаборовДанных, СтрокаСвязьНаборовДанных); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВычисляемыеПоляВСхему(ВычисляемыеПоляСКД)
	
	ВычисляемыеПоляСКД.Очистить();
	
	Для Каждого СтрокаВычисляемоеПоле Из ВычисляемыеПоля.ПолучитьЭлементы() Цикл 
		
		НовоеВычисляемоеПоле = ВычисляемыеПоляСКД.Добавить();
		НовоеВычисляемоеПоле.ПутьКДанным = СтрокаВычисляемоеПоле.Поле;
		
		ЗаполнитьЗначенияСвойств(НовоеВычисляемоеПоле, СтрокаВычисляемоеПоле, "Заголовок, Выражение, ВыражениеПредставления");
		
		ОграничениеИспользования = НовоеВычисляемоеПоле.ОграничениеИспользования;
		ОграничениеИспользования.Поле = СтрокаВычисляемоеПоле.ОграничениеИспользованияПоле;
		ОграничениеИспользования.Условие = СтрокаВычисляемоеПоле.ОграничениеИспользованияУсловие;
		ОграничениеИспользования.Группировка = СтрокаВычисляемоеПоле.ОграничениеИспользованияГруппировка;
		ОграничениеИспользования.Порядок = СтрокаВычисляемоеПоле.ОграничениеИспользованияПорядок;
		
		// ВыраженияУпорядочивания
		ВыраженияУпорядочивания = НовоеВычисляемоеПоле.ВыраженияУпорядочивания;
		Для Каждого ЭлементВыраженияУпорядочивания Из СтрокаВычисляемоеПоле.ВыраженияУпорядочивания Цикл 
			
			НовыйЭлементУпорядочивания = ВыраженияУпорядочивания.Добавить();
			НовыйЭлементУпорядочивания.Автоупорядочивание = ЭлементВыраженияУпорядочивания.Пометка;
			НовыйЭлементУпорядочивания.Выражение = ЭлементВыраженияУпорядочивания.Представление;
			НовыйЭлементУпорядочивания.ТипУпорядочивания = ЭлементВыраженияУпорядочивания.Значение;
			
		КонецЦикла;
		
		// Тип значения и доступные значения
		НовоеВычисляемоеПоле.ТипЗначения = СтрокаВычисляемоеПоле.ТипЗначения;
		НовоеВычисляемоеПоле.УстановитьДоступныеЗначения(СтрокаВычисляемоеПоле.ДоступныеЗначения);
		
		// Оформление и параметры редактирования
		ИТК_СКД.СкопироватьСтруктурноеПоле(НовоеВычисляемоеПоле.Оформление, СтрокаВычисляемоеПоле.Оформление);
		ИТК_СКД.СкопироватьСтруктурноеПоле(НовоеВычисляемоеПоле.ПараметрыРедактирования, СтрокаВычисляемоеПоле.ПараметрыРедактирования);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРесурсыВСхему(ПоляИтогаСКД)
	
	ПоляИтогаСКД.Очистить();
	
	Для Каждого СтрокаРесурс Из Ресурсы Цикл 
		
		ПолеИтога = ПоляИтогаСКД.Добавить();
		
		ПолеИтога.ПутьКДанным = СтрокаРесурс.Поле;
		ПолеИтога.Выражение = СтрокаРесурс.Выражение;
		
		Группировки = СтрокаРесурс.Группировки.ВыгрузитьЗначения();
		Группировки = ПолеИтога.Группировки;
		Для Каждого ПолеГруппировки Из СтрокаРесурс.Группировки Цикл 
			Группировки.Добавить(ПолеГруппировки.Значение);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПараметрыВСхему(ТаблицаПараметровСКД)
	
	ТаблицаПараметровСКД.Очистить();
	
	Для Каждого СтрокаПараметр Из ПараметрыСКД Цикл 
		
		Параметр = ТаблицаПараметровСКД.Добавить();
		ЗаполнитьЗначенияСвойств(Параметр, СтрокаПараметр);
		
		Если СтрокаПараметр.ИспользоватьВсегда Тогда
			Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		Иначе
			Использование = ИспользованиеПараметраКомпоновкиДанных.Авто;
		КонецЕсли;
		Параметр.Использование = Использование;
		
		Параметр.УстановитьДоступныеЗначения(СтрокаПараметр.ДоступныеЗначения);
		ИТК_СКД.СкопироватьСтруктурноеПоле(Параметр.ПараметрыРедактирования, СтрокаПараметр.ПараметрыРедактирования);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьМакетВСхему(СхемаКомпоновкиДанных)
	
	Для Каждого МакетСКД Из СхемаКомпоновкиДанных.Макеты Цикл 
		
		Если МакетСКД.Макет = Неопределено Тогда
			МакетСКД.Макет = Новый МакетОбластиКомпоновкиДанных;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВложенныеСхемыВСхему(ВложенныеСхемыСКД)
	
	ВложенныеСхемыСКД.Очистить();
	
	Для Каждого СтрокаВложеннаяСхема Из ВложенныеСхемы Цикл 
		
		ВложеннаяСхема = ВложенныеСхемыСКД.Добавить();
		ВложеннаяСхема.Имя = СтрокаВложеннаяСхема.Имя;
		ВложеннаяСхема.Заголовок = СтрокаВложеннаяСхема.Заголовок;
		
		ВложеннаяСхема.Схема = ИТК_СКД.СхемаКомпоновкиДанных(СтрокаВложеннаяСхема.Схема);
		
		Настройки = ИТК_СКД.ВариантНастроек(СтрокаВложеннаяСхема.Настройки);
		ИТК_СКД.СкопироватьВариантНастроек(ВложеннаяСхема.Настройки, Настройки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПредставленияЗаголовковВСхему(СхемаКомпоновкиДанных)
	
	СхемаXDTO = СериализаторXDTO.ЗаписатьXDTO(СхемаКомпоновкиДанных);
	
	// Поля наборов данных
	Для Каждого ОбъектXDTOНаборДанных Из СхемаXDTO["dataSet"] Цикл 
		
		НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти(ОбъектXDTOНаборДанных.name);
		ЗагрузитьЗаголовкиКоллекцииВСхемуXDTO(ОбъектXDTOНаборДанных, "field", "dataPath", "title", НаборДанных.Поля, "Заголовок")

	КонецЦикла;
	
	ЗагрузитьЗаголовкиКоллекцииВСхемуXDTO(СхемаXDTO, "calculatedField", "dataPath", "title", СхемаКомпоновкиДанных.ВычисляемыеПоля, "Заголовок");
	ЗагрузитьЗаголовкиКоллекцииВСхемуXDTO(СхемаXDTO, "parameter", "name", "title", СхемаКомпоновкиДанных.Параметры, "Заголовок");
	ЗагрузитьЗаголовкиКоллекцииВСхемуXDTO(СхемаXDTO, "nestedSchema", "name", "title", СхемаКомпоновкиДанных.ВложенныеСхемыКомпоновкиДанных, "Заголовок");
	ЗагрузитьЗаголовкиКоллекцииВСхемуXDTO(СхемаXDTO, "settingsVariant", "name", "presentation", СхемаКомпоновкиДанных.ВариантыНастроек, "Представление");
	
	СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СхемаXDTO);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗаголовкиКоллекцииВСхемуXDTO(СхемаXDTO, ИмяКоллекцииXDTO, ИмяПоляПоискаXDTO, ИмяПоляXDTO, КоллекцияСхемы, ИмяПоляСхемы)
	
	Для Каждого ЭлементСхемы Из СхемаXDTO[ИмяКоллекцииXDTO] Цикл 
		
		СтрокаКоллекции = КоллекцияСхемы.Найти(ЭлементСхемы[ИмяПоляПоискаXDTO]);
		Если СтрокаКоллекции = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаголовокНСтр = СтрокаКоллекции[ИмяПоляСхемы];
		ИТК_СКД.ЛокализированнаяСтрокаЗаписатьНСтрВСхемуXDTO(ЭлементСхемы, ИмяПоляXDTO, ЗаголовокНСтр);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСхемуКомпоновкиДанныхИзТекста(Текст)

	СхемаКомпоновкиДанных = ИТК_СКД.СхемаКомпоновкиДанных(Текст);
	АдресСхемыКомпоновкиДанных = ИТК_ВременноеХранилище.Поместить(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных, УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСхемуКомпоновкиДанныхВДанныеФормы()
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	// Источники
	Для Каждого ИсточникДанных Из СхемаКомпоновкиДанных.ИсточникиДанных Цикл 
		
		НовыйИсточник = ИсточникиДанных.Добавить();
		НовыйИсточник.Имя = ИсточникДанных.Имя;
		
	КонецЦикла;
	
	ЗагрузитьИсточникиДанныхСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных);
	
	НаборыДанных.ПолучитьЭлементы().Очистить();
	ЗагрузитьНаборыДанныхСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных.НаборыДанных, НаборыДанных);
	
	ЗагрузитьСвязиНаборовДанныхСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных);
	ЗагрузитьВычисляемыеПоляСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных);
	ЗагрузитьРесурсыСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных);
	ЗагрузитьПараметрыСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных);
	ЗагрузитьМакетыСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных);
	ЗагрузитьВложенныеСхемыСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных);
	ЗагрузитьВариантыНастроекСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИсточникиДанныхСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных)
	
	ИсточникиДанных.Очистить();
	
	Для Каждого ИсточникДанных Из СхемаКомпоновкиДанных.ИсточникиДанных Цикл 
		
		НоваяСтрокаИсточник = ИсточникиДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИсточник, ИсточникДанных);

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаборыДанныхСхемыКомпоновкиДанныхВДанныеФормы(КоллекцияНаборовДанных, Родитель)
	
	Для Каждого НаборДанных Из КоллекцияНаборовДанных Цикл 
		
		ТипНабораДанных = ИТК_СКД.ПеречислениеТипНабораДанных(ТипЗнч(НаборДанных));
		ТипНабораДанныхЗапрос = (ТипНабораДанных = ИТК_Перечисления.СКДНаборДанныхЗапрос());
		
		НовыйНаборДанных = Родитель.ПолучитьЭлементы().Добавить();
		
		НовыйНаборДанных.Вид = ТипНабораДанных;
		НовыйНаборДанных.Картинка = ИТК_КонструкторСКДКлиентСервер.КартинкаНабораДанных(ТипНабораДанных);
		НовыйНаборДанных.Представление = НаборДанных.Имя;
		
		Если ТипНабораДанныхЗапрос Тогда
			
			НовыйНаборДанных.Источник = НаборДанных.ИсточникДанных;
			НовыйНаборДанных.ТекстЗапроса = НаборДанных.Запрос;
			
			АвтоЗаполнениеДоступныхПолей = НаборДанных.АвтоЗаполнениеДоступныхПолей;
			НовыйНаборДанных.АвтоЗаполнение = АвтоЗаполнениеДоступныхПолей;
			Если ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.14") Тогда
				НовыйНаборДанных.ИспользоватьГруппировкиЗапросаЕслиВозможно = НаборДанных.ИспользоватьГруппировкиЗапросаЕслиВозможно;
			КонецЕсли;
			
		ИначеЕсли ТипНабораДанных = ИТК_Перечисления.СКДНаборДанныхОбъект() Тогда
			
			НовыйНаборДанных.Источник = НаборДанных.ИсточникДанных;
			НовыйНаборДанных.ИмяОбъекта = НаборДанных.ИмяОбъекта;
			
		ИначеЕсли ТипНабораДанных = ИТК_Перечисления.СКДНаборДанныхОбъединение() Тогда
			
			ЗагрузитьНаборыДанныхСхемыКомпоновкиДанныхВДанныеФормы(НаборДанных.Элементы, НовыйНаборДанных)
			
		КонецЕсли;
		
		ЗагрузитьНаборПолейСхемыКомпоновкиДанныхВДанныеФормы(НаборДанных.Поля, НовыйНаборДанных.Поля);
		
		Если ТипНабораДанныхЗапрос Тогда
			
			Если АвтоЗаполнениеДоступныхПолей Тогда
				
				Идентификатор = НовыйНаборДанных.ПолучитьИдентификатор();
				ЗаполнитьПоляНабораДанныхНаСервере(Идентификатор);
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаборПолейСхемыКомпоновкиДанныхВДанныеФормы(КоллекцияПолейНаборовДанных, Родитель)
	
	Для Каждого ПолеНабораДанных Из КоллекцияПолейНаборовДанных Цикл 
		
		СтрокаПоле = ДобавитьОбновитьПолеНабора(Родитель, ПолеНабораДанных);
		
		ЛокализированнаяСтрокаНСтр = ИТК_СКД.ЛокализированнаяСтрокаНСтрИзXDTO(ПолеНабораДанных, "title");
		СтрокаПоле.Заголовок = ЛокализированнаяСтрокаНСтр;
		СтрокаПоле.ЗаголовокПредставление = ПредставлениеЗаголовкаПоляКоллекции(ЛокализированнаяСтрокаНСтр, СтрокаПоле.Поле);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВариантыНастроекСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных)
	
	ВариантыНастроек.Очистить();
	
	Для Каждого ВариантНастроек Из СхемаКомпоновкиДанных.ВариантыНастроек Цикл 
		
		ИмяВариантаНастроек = ВариантНастроек.Имя;
		
		НовыйВариантНастроек = ВариантыНастроек.Добавить();
		НовыйВариантНастроек.Имя = ИмяВариантаНастроек;
		
		ЛокализированнаяСтрокаНСтр = ИТК_СКД.ЛокализированнаяСтрокаНСтрИзXDTO(ВариантНастроек, "presentation");
		НовыйВариантНастроек.Заголовок = ЛокализированнаяСтрокаНСтр;
		НовыйВариантНастроек.ЗаголовокПредставление = ПредставлениеЗаголовкаПоляКоллекции(ЛокализированнаяСтрокаНСтр, ИмяВариантаНастроек);
		
		НовыйВариантНастроек.Значение = ИТК_СКД.XMLТекст(ВариантНастроек.Настройки);

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСвязиНаборовДанныхСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных)
	
	СвязиНаборовДанных.Очистить();
	
	Для Каждого СвязьНаборовДанных Из СхемаКомпоновкиДанных.СвязиНаборовДанных Цикл 
		
		НоваяСвязьНаборовДанных = СвязиНаборовДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСвязьНаборовДанных, СвязьНаборовДанных);

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВычисляемыеПоляСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных)
	
	ВычисляемыеПоля.ПолучитьЭлементы().Очистить();
	
	Для Каждого ВычисляемоеПоле Из СхемаКомпоновкиДанных.ВычисляемыеПоля Цикл 
		
		Результат = АнализироватьПутьКДаннымПоля(ВычисляемыеПоля, ВычисляемоеПоле.ПутьКДанным);
		ИмяПоля = Результат.Поле;
		
		СтрокаВычисляемоеПоле = Результат.Родитель.ПолучитьЭлементы().Добавить();
		
		СтрокаВычисляемоеПоле.Поле = ИмяПоля;
		ЗаполнитьЗначенияСвойств(СтрокаВычисляемоеПоле, ВычисляемоеПоле, "ТипЗначения, Выражение, ВыражениеПредставления");
		
		ЛокализированнаяСтрокаНСтр = ИТК_СКД.ЛокализированнаяСтрокаНСтрИзXDTO(ВычисляемоеПоле, "title");
		СтрокаВычисляемоеПоле.Заголовок = ЛокализированнаяСтрокаНСтр;
		СтрокаВычисляемоеПоле.ЗаголовокПредставление = ПредставлениеЗаголовкаПоляКоллекции(ЛокализированнаяСтрокаНСтр, ИмяПоля);
		
		ВидПоле = ИТК_Перечисления.СКДВидыПолейНаборовДанныхПоле();
		СтрокаВычисляемоеПоле.Вид = ВидПоле;
		СтрокаВычисляемоеПоле.Картинка = ИТК_КонструкторСКДКлиентСервер.КартинкаПоляНабораДанных(ВидПоле);
		
		ВыраженияУпорядочивания = ЗначениеВыраженияУпорядочивания(ВычисляемоеПоле.ВыраженияУпорядочивания);
		СтрокаВычисляемоеПоле.ВыраженияУпорядочивания = ВыраженияУпорядочивания;
		СтрокаВычисляемоеПоле.ВыраженияУпорядочиванияПредставление = ИТК_СКДКлиентСервер.ПредставлениеВыраженийУпорядочивания(ВыраженияУпорядочивания);
		
		// ОграничениеИспользования
		СтрокаВычисляемоеПоле.ОграничениеИспользованияПоле = ВычисляемоеПоле.ОграничениеИспользования.Поле;
		СтрокаВычисляемоеПоле.ОграничениеИспользованияУсловие = ВычисляемоеПоле.ОграничениеИспользования.Условие;
		СтрокаВычисляемоеПоле.ОграничениеИспользованияГруппировка = ВычисляемоеПоле.ОграничениеИспользования.Группировка;
		СтрокаВычисляемоеПоле.ОграничениеИспользованияПорядок = ВычисляемоеПоле.ОграничениеИспользования.Порядок;
		
		ИТК_СКД.СкопироватьСтруктурноеПоле(СтрокаВычисляемоеПоле.ПараметрыРедактирования, ВычисляемоеПоле.ПараметрыРедактирования);
		ИТК_СКД.СкопироватьСтруктурноеПоле(СтрокаВычисляемоеПоле.Оформление, ВычисляемоеПоле.Оформление);

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРесурсыСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных)
	
	Ресурсы.Очистить();
	
	Для Каждого ПолеИтога Из СхемаКомпоновкиДанных.ПоляИтога Цикл 
		
		НовыйРесурс = Ресурсы.Добавить();
		
		НовыйРесурс.Поле = ПолеИтога.ПутьКДанным;
		НовыйРесурс.Выражение = ПолеИтога.Выражение;
		
		Группировки = Новый СписокЗначений;
		Группировки.ЗагрузитьЗначения(ПолеИтога.Группировки);
		НовыйРесурс.Группировки = Группировки;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПараметрыСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных)
	
	ПараметрыСКД.Очистить();
	
	Для Каждого Параметр Из СхемаКомпоновкиДанных.Параметры Цикл 
		
		ИмяПараметра = Параметр.Имя;
		
		НовыйПараметр = ПараметрыСКД.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйПараметр, Параметр, , "Имя, Заголовок");
		
		НовыйПараметр.Имя = ИмяПараметра;
		
		ЛокализированнаяСтрокаНСтр = ИТК_СКД.ЛокализированнаяСтрокаНСтрИзXDTO(Параметр, "title");
		НовыйПараметр.Заголовок = ЛокализированнаяСтрокаНСтр;
		НовыйПараметр.ЗаголовокПредставление = ПредставлениеЗаголовкаПоляКоллекции(ЛокализированнаяСтрокаНСтр, ИмяПараметра);
		
		НовыйПараметр.ИспользоватьВсегда = (Параметр.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда);
		ИТК_СКД.СкопироватьСтруктурноеПоле(НовыйПараметр.ПараметрыРедактирования, Параметр.ПараметрыРедактирования);

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьМакетыСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных)
	
	Макет.Очистить();
	
	ДобавитьЭлементыМакетов(СхемаКомпоновкиДанных.Макеты, СхемаКомпоновкиДанных.МакетыПолей);
	ДобавитьЭлементыМакетов(СхемаКомпоновкиДанных.Макеты, СхемаКомпоновкиДанных.МакетыГруппировок);
	ДобавитьЭлементыМакетов(СхемаКомпоновкиДанных.Макеты, СхемаКомпоновкиДанных.МакетыЗаголовковГруппировок, Истина);
	ДобавитьЭлементыМакетов(СхемаКомпоновкиДанных.Макеты, СхемаКомпоновкиДанных.МакетыПолейИтога);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыМакетов(МакетыСКД, КоллекцияМакетов, Заголовки = Ложь)
	
	Для Каждого ОписаниеМакета Из КоллекцияМакетов Цикл 
		
		Вид  = ИТК_СКД.ПеречислениеВидМакета(ОписаниеМакета, Заголовки);
		Значение = ИТК_СКД.ЗначениеМакета(Вид, ОписаниеМакета);
		
		НовыйМакет = Макеты.Добавить();
		
		НовыйМакет.Вид = Вид;
		НовыйМакет.Картинка = ИТК_КонструкторСКДКлиентСервер.КартинкаМакета(Вид);
		НовыйМакет.Представление = ИТК_СКДКлиентСервер.ПредставлениеМакета(Значение);
		НовыйМакет.Значение = Значение;
		
		ПодробноеОписаниеМакета = МакетыСКД.Найти(ОписаниеМакета.Макет);
		МакетОбласти = ПодробноеОписаниеМакета.Макет;
		
		Если МакетОбласти = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Заполнение областей
		НомерСтроки = 1;
		Для Каждого СтрокаОбластиТаблицы Из МакетОбласти Цикл 
			
			ОбластьСтрока = Новый ТабличныйДокумент;
			
			НомерКолонки = 1;
			Для Каждого ЯчейкаОбластиТаблицы Из СтрокаОбластиТаблицы.Ячейки Цикл 
				
				ОбластьЯчейка = Новый ТабличныйДокумент;
				ДанныеОбластиЯчейка = ОбластьЯчейка.Область(1, 1);
				
				// Содержимое области
				Для Каждого ЯчейкаОбластиТаблицы Из ЯчейкаОбластиТаблицы.Элементы Цикл 
					ДанныеОбластиЯчейка.Текст = ЯчейкаОбластиТаблицы.Значение;
				КонецЦикла;
				
				// Оформление области
				Для Каждого ЭлементОформления Из ЯчейкаОбластиТаблицы.Оформление.Элементы Цикл 
					
					Если НЕ ЭлементОформления.Использование Тогда
						Продолжить;
					КонецЕсли;
					
					ИмяОформления = Строка(ЭлементОформления.Параметр);
					Если ИмяОформления = "МинимальнаяШирина" 
							ИЛИ ИмяОформления = "МаксимальнаяШирина" Тогда
						Продолжить;
					КонецЕсли;
					
					ДанныеОбластиЯчейка[ИмяОформления] = ЭлементОформления.Значение;

				КонецЦикла;
				
				ВыводимаяОбластьЯчейки = ОбластьЯчейка.ПолучитьОбласть(1, 1);
				ОбластьСтрока.Присоединить(ВыводимаяОбластьЯчейки);
				
				НомерКолонки = НомерКолонки + 1;
				
			КонецЦикла;
			
			Макет.Вывести(ОбластьСтрока);
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		// Заполнение параметров
		Для Каждого ПараметрМакета Из ПодробноеОписаниеМакета.Параметры Цикл 
			
			НовыйПараметр = НовыйМакет.ПараметрыМакета.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйПараметр, ПараметрМакета);

		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВложенныеСхемыСхемыКомпоновкиДанныхВДанныеФормы(СхемаКомпоновкиДанных)
	
	ВложенныеСхемы.Очистить();
	
	Для Каждого ВложеннаяСхема Из СхемаКомпоновкиДанных.ВложенныеСхемыКомпоновкиДанных Цикл 
		
		ИмяВложеннойСхемы = ВложеннаяСхема.Имя;
		
		НоваяВложеннаяСхема = ВложенныеСхемы.Добавить();
		НоваяВложеннаяСхема.Имя = ИмяВложеннойСхемы;
		
		ЛокализированнаяСтрокаНСтр = ИТК_СКД.ЛокализированнаяСтрокаНСтрИзXDTO(ВложеннаяСхема, "title");
		НоваяВложеннаяСхема.Заголовок = ЛокализированнаяСтрокаНСтр;
		НоваяВложеннаяСхема.ЗаголовокПредставление = ПредставлениеЗаголовкаПоляКоллекции(ЛокализированнаяСтрокаНСтр, ИмяВложеннойСхемы);
		
		НоваяВложеннаяСхема.Схема = ИТК_СКД.XMLТекст(ВложеннаяСхема.Схема);
		НоваяВложеннаяСхема.Настройки = ИТК_СКД.XMLТекст(ВложеннаяСхема.Настройки);
		
		ИдентификаторСтроки = НоваяВложеннаяСхема.ПолучитьИдентификатор();
		ЗаполнитьПредставлениеСтрокиВложеннаяСхема(ИдентификаторСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеСтрокиВложеннаяСхема(Идентификатор)
	
	Строка = ВложенныеСхемы.НайтиПоИдентификатору(Идентификатор);
	
	Строка.СхемаПредставление = НСтр("ru = 'Схема';
									|en = 'Scheme'");
	Строка.НастройкиПредставление = НСтр("ru = 'Настройки';
										|en = 'Settings'");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуКомпоновкиДанныхИзФайлаПослеПомещенияФайлов(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьФайлСхемыКомпоновкиДанныхНаСервере(ПомещенныеФайлы[0].Хранение);
	ПослеЗагрузкиСхемыКомпоновкиДанных();
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлСхемыКомпоновкиДанныхНаСервере(Адрес)
	
	ИсточникиДанных.Очистить();
	НаборыДанных.ПолучитьЭлементы().Очистить();
	
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	
	ЧтениеТекста = Новый ЧтениеТекста(Данные.ОткрытьПотокДляЧтения());
	СхемаКомпоновкиДанныхXML = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	ЗагрузитьСхемуКомпоновкиДанныхИзТекста(СхемаКомпоновкиДанныхXML);
	ЗагрузитьСхемуКомпоновкиДанныхВДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСхемуКомпоновкиДанныхВФайлЗавершениеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьОсновнуюСхемуКомпоновкиДанныхИзДанныхФормы();
	
	ПолноеИмяФайла = ВыбранныеФайлы[0];
	
	СхемаКомпоновкиДанныхXML =  ИТК_СКД.XMLТекстИзАдреса(АдресСхемыКомпоновкиДанных);
	ИТК_ФайлыКлиентСервер.ЗаписатьТекст(ПолноеИмяФайла, СхемаКомпоновкиДанныхXML);

КонецПроцедуры

&НаКлиенте
Функция ВложенВОбъединение(Строка)
	
	Результат = Ложь;
	
	Родитель = Строка;
	Пока Истина Цикл
		
		Родитель = Родитель.ПолучитьРодителя();
		
		Если Родитель = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если Родитель.Вид = ИТК_Перечисления.СКДНаборДанныхОбъединение() Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;

	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоляНабораДанныхОбъединение(Идентификатор)
	
	// Собрать поля объединений
	ДобавляемыеПоля = Новый Массив;
	СтрокаНаборДанных = НаборыДанных.НайтиПоИдентификатору(Идентификатор);
	
	СобратьПоляНабораДанныхОбъединениеРекурсивно(СтрокаНаборДанных, ДобавляемыеПоля);
	
	ЭлементыПоля = СтрокаНаборДанных.Поля.ПолучитьЭлементы();
	
	// Удаляем неиспользуемые поля
	УдаляемыеСтрокиПоля = Новый Массив;
	Для Каждого Поле Из ЭлементыПоля Цикл 
		
		НайденныйИндекс = ДобавляемыеПоля.Найти(Поле.Поле);
		Если НайденныйИндекс = Неопределено Тогда
			УдаляемыеСтрокиПоля.Добавить(Поле);
		Иначе
			ДобавляемыеПоля.Удалить(НайденныйИндекс);
		КонецЕсли;

	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтрокиПоля Цикл 
		ЭлементыПоля.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	// Добавляем поля
	Для Каждого ИмяПоля Из ДобавляемыеПоля Цикл 
		
		НовоеПоле = ЭлементыПоля.Добавить();
		НовоеПоле.Поле = ИмяПоля;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СобратьПоляНабораДанныхОбъединениеРекурсивно(Строка, Результат)
	
	Для Каждого ВложеннаяСтрока Из Строка.ПолучитьЭлементы() Цикл 
		
		Если ВложеннаяСтрока.Вид = ИТК_Перечисления.СКДНаборДанныхОбъединение() Тогда
			СобратьПоляНабораДанныхОбъединениеРекурсивно(ВложеннаяСтрока, Результат);
			Продолжить;
		КонецЕсли;
		
		Для Каждого Поле Из ВложеннаяСтрока.Поля.ПолучитьЭлементы() Цикл 
			
			Если Поле.Вид <> ИТК_Перечисления.СКДВидыПолейНаборовДанныхПоле() Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяПоля = Поле.Поле;
			Если Результат.Найти(ИмяПоля) = Неопределено Тогда
				Результат.Добавить(ИмяПоля);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораНабораДанныхИзСписка(Элемент, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Элемент.СписокВыбора;
	СписокВыбора.Очистить();

	ИсключитьТекущий = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "ИсключитьТекущий", Ложь);
	СписокНаборовДанных = СписокНаборовДанных(ИсключитьТекущий);
	
	Для Каждого НаборДанных Из СписокНаборовДанных Цикл 
		СписокВыбора.Добавить(НаборДанных.Значение, , , НаборДанных.Картинка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СписокНаборовДанных(ИсключитьТекущий)
	
	Результат = Новый СписокЗначений;
	Для Каждого НаборДанных Из НаборыДанных.ПолучитьЭлементы() Цикл 
		
		Если ИсключитьТекущий 
				И НаборДанных = Элементы.НаборыДанных.ТекущиеДанные Тогда
				
			Продолжить;
			
		КонецЕсли;
		
		Результат.Добавить(НаборДанных.Представление, , , НаборДанных.Картинка);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НайтиНаборовДанныхПоИмени(Имя)
	
	Результат = Неопределено;
	Для Каждого НаборДанных Из НаборыДанных.ПолучитьЭлементы() Цикл 
		
		Если НаборДанных.Представление = Имя Тогда
			
			Результат = НаборДанных;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РедактированиеТипаЗначенияПоляНабораДанныхЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	ТекущиеДанные.ТипЗначения = Результат;

КонецПроцедуры

&НаКлиенте
Процедура РедактированиеДоступныхЗначенийПоляНабораДанныхЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	ТекущиеДанные.ДоступныеЗначения = Результат;

КонецПроцедуры

&НаКлиенте
Процедура РедактированиеПараметровРедактированияПоляНабораДанныхЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ПоляНаборовДанных.ТекущиеДанные;
	ИТК_СКД.СкопироватьСтруктурноеПоле(ТекущиеДанные.ПараметрыРедактирования, Результат);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененныеДанныеСтрокиВариантаНастроек()
	
	Если ВариантыИдентификаторПоследнейВыделеннойСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка = ВариантыНастроек.НайтиПоИдентификатору(ВариантыИдентификаторПоследнейВыделеннойСтроки);
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресЗначения = ПоместитьВоВременноеХранилище(КомпоновщикНастроек.Настройки);
	Строка.Значение = ИТК_СКД.XMLТекстИзАдреса(АдресЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВариантаНастроек()
	
	Если ВариантыИдентификаторПоследнейВыделеннойСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка = ВариантыНастроек.НайтиПоИдентификатору(ВариантыИдентификаторПоследнейВыделеннойСтроки);
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанныеВариантаВКомпоновщикНастроек(Строка.Значение);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеВариантаВКомпоновщикНастроек(ВариантНастроекXML)
	
	ОбновитьОсновнуюСхемуКомпоновкиДанныхИзДанныхФормы();
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	
	Если ЗначениеЗаполнено(ВариантНастроекXML) Тогда
		НастройкиВарианта = ИТК_СКД.ВариантНастроек(ВариантНастроекXML);
	Иначе
		НастройкиВарианта = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КонецЕсли;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
	
КонецПроцедуры

&НаСервере
Функция АнализироватьПутьКДаннымПоля(Коллекция, ПутьКДанным)
	
	Результат = Новый Структура;
	
	Родитель = Коллекция;
	
	ЧастиПутьКДанным = СтрРазделить(ПутьКДанным, ".");
	ИндексПоследнего = ЧастиПутьКДанным.ВГраница();
	
	Для Индекс = 0 По ИндексПоследнего - 1 Цикл
		
		ЧастьПутьКДанным = ЧастиПутьКДанным[Индекс];
		Родитель = НайтиСоздатьПолеГруппу(Родитель, ЧастьПутьКДанным);
		
	КонецЦикла;
	
	Результат.Вставить("Родитель", Родитель);
	Результат.Вставить("Поле", ЧастиПутьКДанным[ИндексПоследнего]);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьПолеГруппу(Родитель, Поле)
	
	Результат = НайтиПолеГруппу(Родитель, Поле);
	Если Результат = Неопределено Тогда
		
		ВидГруппа = ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа();
		
		Результат = Родитель.ПолучитьЭлементы().Добавить();
		Результат.Вид = ВидГруппа;
		Результат.Картинка = ИТК_КонструкторСКДКлиентСервер.КартинкаПоляНабораДанных(ВидГруппа);
		Результат.Поле = Поле;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НайтиПолеГруппу(Родитель, Поле)
	
	Результат = Неопределено;
	
	Для Каждого СтрокаПоле Из Родитель.ПолучитьЭлементы() Цикл 
		
		Если СтрокаПоле.Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхГруппа()
				И СтрокаПоле.Поле = Поле Тогда
				
			Результат = СтрокаПоле;
			Прервать;
			
		КонецЕсли;

	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗначениеВыраженияУпорядочивания(ВыраженияУпорядочивания = Неопределено)
	
	Результат = Новый СписокЗначений;
	
	Если ВыраженияУпорядочивания = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ВыражениеУпорядочивания Из ВыраженияУпорядочивания Цикл 
		
		Результат.Добавить(ВыражениеУпорядочивания.ТипУпорядочивания, ВыражениеУпорядочивания.Выражение, ВыражениеУпорядочивания.Автоупорядочивание);
		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ДобавитьВычисляемоеПоле(Активировать = Истина)
	
	ЭлементКоллекция = Элементы.ВычисляемыеПоля;
	
	НоваяСтрока = ВычисляемыеПоля.ПолучитьЭлементы().Добавить();
	
	Вид = ИТК_Перечисления.СКДВидыПолейНаборовДанныхПоле();
	НоваяСтрока.Вид = Вид;
	НоваяСтрока.Картинка = ИТК_КонструкторСКДКлиентСервер.КартинкаПоляНабораДанных(Вид);

	// Имя поля
	ЗанятыеИдентификаторы = ИспользуемыеИдентификаторыКоллекции(ЭлементКоллекция, ВычисляемыеПоля);
	ПрефиксИмени = ИТК_КонструкторСКДКлиентСервер.ПрефиксИмениНовогоПоляНабораДанных(Вид);
	
	ИмяПоля = ИТК_Строки.НовыйИдентификатор(ПрефиксИмени, ЗанятыеИдентификаторы);
	НоваяСтрока.Поле = ИмяПоля;
	
	Если Активировать Тогда
		ЭлементКоллекция.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	//
	ОбновитьКоличествоВЗаголовке(ЭлементКоллекция);
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура ВычисляемыеПоляВыраженияУпорядочиванияЗавершениеРедактирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ВычисляемыеПоля.ТекущиеДанные;
	ТекущиеДанные.ВыраженияУпорядочивания = Результат;
	ТекущиеДанные.ВыраженияУпорядочиванияПредставление = ИТК_СКДКлиентСервер.ПредставлениеВыраженийУпорядочивания(Результат);

КонецПроцедуры

&НаКлиенте
Процедура РедактированиеТипаЗначенияВычисляемогоПоляЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ВычисляемыеПоля.ТекущиеДанные;
	ТекущиеДанные.ТипЗначения = Результат;

КонецПроцедуры

&НаКлиенте
Процедура РедактированиеДоступныхЗначенийВычисляемогоПоляЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ВычисляемыеПоля.ТекущиеДанные;
	ТекущиеДанные.ДоступныеЗначения = Результат;

КонецПроцедуры

&НаКлиенте
Процедура РедактированиеПараметровРедактированияВычисляемогоПоляЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ВычисляемыеПоля.ТекущиеДанные;
	ИТК_СКД.СкопироватьСтруктурноеПоле(ТекущиеДанные.ПараметрыРедактирования, Результат);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступныеПоляРесурсов()
	
	ДоступныеПоля = ДоступныеПоляНабораДанных(НаборыДанных);
	
	Если ЗначениеЗаполнено(ДоступныеПоля) Тогда
		ОбновитьДоступныеПоляРесурсовСервер(ДоступныеПоля);
	КонецЕсли;
	
	// Очистка более несуществующих полей
	УдаляемыеРесурсы = Новый Массив;
	Для Каждого Ресурс Из Ресурсы Цикл 
		
		ДоступноеПолеРесурсов = ИТК_ОбщийКлиентСервер.СписокЗначенийНайтиПоПредставлению(ДоступныеПоля, Ресурс.Поле);
		Если ДоступноеПолеРесурсов = Неопределено Тогда
			УдаляемыеРесурсы.Добавить(Ресурс);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого УдаляемыйРесурс Из УдаляемыеРесурсы Цикл 
		Ресурсы.Удалить(УдаляемыйРесурс);
	КонецЦикла;
	
	ОбновитьКоличествоВЗаголовке(Элементы.Ресурсы);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступныеПоляРесурсовСервер(ДоступныеПоля)
	
	ДоступныеПоляРесурсов.Очистить();
	
	// Добавление полей
	Для Каждого ДоступноеПоле Из ДоступныеПоля Цикл 
		
		ДобавитьСтрокуДоступноеПолеРесурсов(ДоступноеПоле.Представление, ДоступноеПоле.Значение, ДоступноеПоле.Пометка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуДоступноеПолеРесурсов(Поле, ТипЗначения, Вычисляемое = Ложь)
	
	НоваяСтрока = ДоступныеПоляРесурсов.Добавить();
	НоваяСтрока.Поле = Поле;
	НоваяСтрока.КартинкаТип = ИТК_Типы.КартинкаОписания(ТипЗначения);
	НоваяСтрока.ТипЗначения = ТипЗначения;
	
	Если ТипЗначения.СодержитТип(Тип("Число")) Тогда
		Картинка = БиблиотекаКартинок.ПроизвольноеВыражение;
	Иначе
		Картинка = БиблиотекаКартинок.Реквизит;
	КонецЕсли;
	НоваяСтрока.Картинка = Картинка;
	
КонецПроцедуры

&НаКлиенте
Функция КонтекстВыражения(ЗаполнитьДоступныеПоля = Истина) Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("Параметры", ДоступныеПараметрыСКД());
	
	ДоступныеПоля = Неопределено;
	Если ЗаполнитьДоступныеПоля Тогда
		ДоступныеПоля = ДоступныеПоляНабораДанных();
	КонецЕсли;
	Результат.Вставить("ДоступныеПоля", ДоступныеПоля);
	
	Возврат Результат
	
КонецФункции

&НаКлиенте
Функция ВариантыИменРолиОстаток(Данные = Неопределено)
	
	Если Данные = Неопределено Тогда
		Данные = Элементы.НаборыДанных.ТекущиеДанные;
	КонецЕсли;
	
	Результат = Новый Массив;
	
	ПостфиксыНачальногоОстатка = СтрРазделить("НачальныйОстаток,НачОст", ",");
	ПостфиксыКонечногоОстатка = СтрРазделить("КонечныйОстаток,КонОст", ",");
	Для Каждого СтрокаПолеНабора Из Данные.Поля.ПолучитьЭлементы() Цикл 
		
		ИмяПоля = СтрокаПолеНабора.Поле;
		
		ВариантИмениНачальныйОстаток = ВариантИмениРолиОстатокПоИмениПоля(ИмяПоля, ПостфиксыНачальногоОстатка);
		ДобавитьВариантИмениРолиОстаток(Результат, ВариантИмениНачальныйОстаток);
		
		ВариантИмениКонечныйОстаток = ВариантИмениРолиОстатокПоИмениПоля(ИмяПоля, ПостфиксыКонечногоОстатка);
		ДобавитьВариантИмениРолиОстаток(Результат, ВариантИмениКонечныйОстаток);
		
		ОписаниеРоли = СтрокаПолеНабора.Роль;
		
		РольОстаток = ИТК_ОбщийКлиентСервер.Свойство(ОписаниеРоли, "Остаток", Ложь);
		Если РольОстаток Тогда
			ДобавитьВариантИмениРолиОстаток(Результат, ОписаниеРоли.ГруппаОстатка);
		КонецЕсли;

	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьВариантИмениРолиОстаток(Варианты, Имя)
	
	Если НЕ ЗначениеЗаполнено(Имя) Тогда
		Возврат;
	КонецЕсли;
	
	ВариантИмени = Варианты.Найти(Имя);
	Если ВариантИмени <> Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Варианты.Добавить(Имя);
	
КонецПроцедуры

&НаКлиенте
Функция ВариантИмениРолиОстатокПоИмениПоля(Имя, Постфиксы)
	
	Результат = "";
	
	Для Каждого Постфикс Из Постфиксы Цикл 
		
		Если СтрЗаканчиваетсяНа(Имя, Постфикс) Тогда
			Результат = Лев(Имя, СтрДлина(Имя) - СтрДлина(Постфикс));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьРедактированиеВыражения(Элемент, Контекст, Поле, СтандартнаяОбработка)
	
	ЭлементКоллекция = ИТК_ФормаКлиент.КоллекцияРодитель(Элемент);
	ТекущиеДанные = ЭлементКоллекция.ТекущиеДанные;
	
	ИТК_СКДКлиент.ОткрытьРедактированиеВыражения(Элемент, Контекст, СтандартнаяОбработка, ТекущиеДанные[Поле]);
	
КонецПроцедуры

&НаКлиенте
Функция ПоляГруппировкиРесурсаСтроки(Строка)
	
	Результат = Новый СписокЗначений;
	ТекущиеГруппировки = Строка.Группировки;
	
	ДоступныеПоля = ДоступныеПоляНабораДанных();
	
	ДобавитьПоляИерархииРесурсов(ДоступныеПоля);
	
	// Добавим Общий итог
	ИмяПоляИтогаОбщийИтог = ИТК_СКДКлиентСервер.ИмяПоляИтогаОбщийИтог();
	ДоступныеПоля.Добавить( , ИмяПоляИтогаОбщийИтог);
	
	Для Каждого ПолеГруппировки Из ДоступныеПоля Цикл  
		
		Поле = ПолеГруппировки.Представление;
		
		// Определение пометки
		НайденнаяГруппировка = ТекущиеГруппировки.НайтиПоЗначению(Поле);
		Пометка = (НайденнаяГруппировка <> Неопределено);
		
		Результат.Добавить(ПолеГруппировки.Значение, ПолеГруппировки.Представление, Пометка);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьРесурсИзДоступныхПолей(ВыбраннаяСтрока)
	
	Поле = ВыбраннаяСтрока.Поле;
	
	НоваяСтрока = Ресурсы.Добавить();
	НоваяСтрока.Поле = Поле;
	
	АгрегатныеФункцииРесурса = АгрегатныеФункцииРесурса(Поле, ВыбраннаяСтрока.ТипЗначения);
	НоваяСтрока.Выражение = АгрегатныеФункцииРесурса[0];
	
КонецПроцедуры

&НаКлиенте
Функция СуммируемоеДоступноеПолеРесурсов(Строка)
	
	Возврат Строка.ТипЗначения.СодержитТип(Тип("Число"));
	
КонецФункции

&НаКлиенте
Функция АгрегатныеФункцииРесурса(Имя, ТипЗначения)
	
	Результат = Новый Массив;
	
	ПрисутствуетТипЧисло = ТипЗначения.СодержитТип(Тип("Число"));
	ПрисутствуетТипДата = ТипЗначения.СодержитТип(Тип("Дата"));
	ПрисутствуетТипСтрока = ТипЗначения.СодержитТип(Тип("Строка"));
	ПрисутствуетТипБулево = ТипЗначения.СодержитТип(Тип("Булево"));
	ПрисутствуетТипДругие = НЕ (ПрисутствуетТипЧисло ИЛИ ПрисутствуетТипДата ИЛИ ПрисутствуетТипСтрока ИЛИ ПрисутствуетТипБулево);
	
	Если ПрисутствуетТипЧисло Тогда
		
		ДобавитьАгрегатнуюФункциюРесурса(Результат, Имя, НСтр("ru = 'Сумма(%1)';
																|en = 'Sum(%1)'"));
		ДобавитьАгрегатнуюФункциюРесурса(Результат, Имя, НСтр("ru = 'Среднее(%1)';
																|en = 'Avg(%1)'"));
		
	КонецЕсли;	
	
	Если ПрисутствуетТипСтрока Тогда
		
		ДобавитьАгрегатнуюФункциюРесурса(Результат, Имя, НСтр("ru = 'СоединитьСтроки(%1)';
																|en = 'JoinStrings(%1)'"));
		
	КонецЕсли;	
	
	Если ПрисутствуетТипБулево Тогда
		
		ДобавитьАгрегатнуюФункциюРесурса(Результат, Имя, НСтр("ru = 'Каждый(%1)';
																|en = 'Every(%1)'"));
		ДобавитьАгрегатнуюФункциюРесурса(Результат, Имя, НСтр("ru = 'Любой(%1)';
																|en = 'Any(%1)'"));
		
	КонецЕсли;	
	
	Если ПрисутствуетТипДругие Тогда
	
		ДобавитьАгрегатнуюФункциюРесурса(Результат, Имя, НСтр("ru = 'Количество(%1)';
																|en = 'Count(%1)'"));
		ДобавитьАгрегатнуюФункциюРесурса(Результат, Имя, НСтр("ru = 'Количество(Различные %1)';
																|en = 'Count(Distinct %1)'"));
	
	КонецЕсли;
	
	Если ПрисутствуетТипЧисло
			ИЛИ ПрисутствуетТипДата
			ИЛИ ПрисутствуетТипДругие Тогда
			
		ДобавитьАгрегатнуюФункциюРесурса(Результат, Имя, НСтр("ru = 'Максимум(%1)';
																|en = 'Max(%1)'"));
		
	КонецЕсли;
	
	Если ПрисутствуетТипЧисло
			ИЛИ ПрисутствуетТипДата Тогда
			
		ДобавитьАгрегатнуюФункциюРесурса(Результат, Имя, НСтр("ru = 'Минимум(%1)';
																|en = 'Min(%1)'"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьАгрегатнуюФункциюРесурса(Список, Поле, Шаблон)
	
	Текст = СтрШаблон(Шаблон, Поле);
	Список.Добавить(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметры()
	
	ОбновитьПараметрыНаСервере();
	ОбновитьКоличествоВЗаголовке(Элементы.ПараметрыСКД);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыНаСервере()
	
	ОбновитьОсновнуюСхемуКомпоновкиДанныхИзДанныхФормы();
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	// Добавим используемые параметры
	ИспользуемыеПараметры = ИТК_СКД.ИспользуемыеПараметры(СхемаКомпоновкиДанных);
	Для Каждого Параметр Из ИспользуемыеПараметры Цикл 
		ДобавитьОбновитьСтрокуПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	// Удалим неиспользуемые
	УдаляемыеПараметры = Новый Массив;
	Для Каждого Параметр Из ПараметрыСКД Цикл 
		
		ИспользуетсяПараметр = ИспользуемыеПараметры.Свойство(Параметр.Имя);
		Если Параметр.ДобавленАвтоматически
				И НЕ ИспользуетсяПараметр Тогда
				
			УдаляемыеПараметры.Добавить(Параметр);
				
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Параметр Из УдаляемыеПараметры Цикл 
		ПараметрыСКД.Удалить(Параметр);
	КонецЦикла;
	
	// Заполним список выбора Параметр функциональных опций
	СписокВыбора = Элементы.ПараметрыСКДПараметрФункциональныхОпций.СписокВыбора;
	
	СписокВыбора.Очистить();
	Для Каждого ОписаниеПараметраФункциональныхОпций Из Метаданные.ПараметрыФункциональныхОпций Цикл 
		СписокВыбора.Добавить(ОписаниеПараметраФункциональныхОпций.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОбновитьСтрокуПараметр(Имя, ТипЗначения) 
	
	Отбор = Новый Структура("Имя", Имя);
	НайденныеСтроки = ПараметрыСКД.НайтиСтроки(Отбор);
	
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		
		Строка = НайденныеСтроки[0];
		ДобавленАвтоматически = Строка.ДобавленАвтоматически;
		ОграничениеИспользования = Строка.ОграничениеИспользования;
		
	Иначе
		
		ДобавленАвтоматически = Истина;
		ОграничениеИспользования = Истина;
		
		Строка = ПараметрыСКД.Добавить();
		Строка.Имя = Имя;
		Строка.ВключатьВДоступныеПоля = Истина;
		
	КонецЕсли;
	
	Строка.ТипЗначения = ТипЗначения;
	
	Если НЕ Строка.ДоступенСписокЗначений Тогда
		Строка.Значение = ТипЗначения.ПривестиЗначение(Строка.Значение);
	КонецЕсли;
	
	Строка.ОграничениеИспользования = ОграничениеИспользования;
	Строка.ДобавленАвтоматически = ДобавленАвтоматически;
	
КонецПроцедуры

&НаКлиенте
Функция ВыделеныПараметрыКоторыеМожноУдалить()
	
	Результат = Ложь;
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ПараметрыСКД.ВыделенныеСтроки Цикл 
		
		ВыделеннаяСтрока = ПараметрыСКД.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		
		Если НЕ ВыделеннаяСтрока.ДобавленАвтоматически Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РедактированиеТипаЗначенияПараметраСКДЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ПараметрыСКД.ТекущиеДанные;
	ТекущиеДанные.ТипЗначения = Результат;
	
	ПривестиЗначениеПараметраСКДВТекущейСтроке();

КонецПроцедуры

&НаКлиенте
Процедура РедактированиеПараметровРедактированияПараметрыСКДЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ПараметрыСКД.ТекущиеДанные;
	ИТК_СКД.СкопироватьСтруктурноеПоле(ТекущиеДанные.ПараметрыРедактирования, Результат);

КонецПроцедуры

&НаКлиенте
Процедура РедактированиеЗначениеПараметраСКДВСпискеЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ПараметрыСКД.ТекущиеДанные;
	ТекущиеДанные.Значение = Результат;

КонецПроцедуры

&НаКлиенте
Процедура РедактированиеДоступныхЗначенийПараметраСКДВСпискеЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ПараметрыСКД.ТекущиеДанные;
	ТекущиеДанные.ДоступныеЗначения = Результат;

КонецПроцедуры

&НаКлиенте
Процедура ПривестиЗначениеПараметраСКДВТекущейСтроке()
	
	ТекущиеДанные = Элементы.ПараметрыСКД.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ДоступенСписокЗначений Тогда
		
		ОграничениеТипа = ИТК_ТипыКлиентСервер.ОписаниеТиповПоТипу(Тип("СписокЗначений"))
		
	Иначе
		
		ОграничениеТипа = ТекущиеДанные.ТипЗначения;
		ТекущиеДанные.Значение = ОграничениеТипа.ПривестиЗначение(ТекущиеДанные.Значение); 

	КонецЕсли;

	Элементы.ПараметрыСКДЗначение.ОграничениеТипа = ОграничениеТипа;
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьМакет(Вид, Активировать = Истина)
	
	НоваяСтрока = Макеты.Добавить();
	НоваяСтрока.Вид = Вид;
	НоваяСтрока.Картинка = ИТК_КонструкторСКДКлиентСервер.КартинкаМакета(Вид);
	НоваяСтрока.Представление = "123";
	
	Если Активировать Тогда
		Элементы.Макеты.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
	ОбновитьКоличествоВЗаголовке(Элементы.Макеты);
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура РедактированияЗаголовкаПоляКоллекцииВОтдельнойФорме(Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ЭлементКоллекция = ИТК_ФормаКлиент.КоллекцияРодитель(Элемент);
	ТекущиеДанные = ЭлементКоллекция.ТекущиеДанные;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", ЭлементКоллекция);
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("РедактированияЗаголовкаПоляКоллекцииВОтдельнойФормеЗавершено", ЭтотОбъект, ДополнительныеПараметры);
	
	ИТК_ФормаКлиент.ОткрытьКонструкторСтрокНаРазныхЯзыках(ЭтотОбъект, ОписаниеОповещенияЗавершение, ТекущиеДанные.Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированияЗаголовкаПоляКоллекцииВОтдельнойФормеЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ЭлементКоллекция = ДополнительныеПараметры.Элемент;
	ИмяПоля = ИмяПоляИдентификатораКоллекции(ЭлементКоллекция);
	
	ТекущиеДанные = ЭлементКоллекция.ТекущиеДанные;
	ТекущиеДанные["Заголовок"] = Результат;
	ТекущиеДанные["ЗаголовокПредставление"] = ПредставлениеЗаголовкаПоляКоллекции(Результат, ТекущиеДанные[ИмяПоля]);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаконченоИзменениеЗаголовкаИзПоляКоллекции(Элемент)
	
	ЭлементКоллекция = ИТК_ФормаКлиент.КоллекцияРодитель(Элемент);
	ТекущиеДанные = ЭлементКоллекция.ТекущиеДанные;
	
	ИТК_Строки.ЛокализированнаяСтрокаОбновитьПредставление(ТекущиеДанные["Заголовок"], ТекущиеДанные["ЗаголовокПредставление"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаконченоИзменениеИмяПоляКоллекцииСЗаголовком(Элемент)
	
	ЭлементКоллекция = ИТК_ФормаКлиент.КоллекцияРодитель(Элемент);
	ТекущиеДанные = ЭлементКоллекция.ТекущиеДанные;
	
	ИмяПоля = ИмяПоляИдентификатораКоллекции(ЭлементКоллекция);
	ИмяПоля = ТекущиеДанные[ИмяПоля];
	НовыйЗаголовок = ИТК_Строки.ПредставлениеИдентификатора(ИмяПоля);
	
	ИТК_Строки.ЛокализированнаяСтрокаОбновитьПредставление(ТекущиеДанные["Заголовок"], НовыйЗаголовок);
	ТекущиеДанные["ЗаголовокПредставление"] = ПредставлениеЗаголовкаПоляКоллекции(ТекущиеДанные["Заголовок"], ИмяПоля);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеЗаголовкаПоляКоллекции(ЛокализированнаяСтрока, ИмяПоля)
	
	ПредставлениеНаТекущемЯзыке = ИТК_Строки.ЛокализированнаяСтрокаПредставлениеНаТекущемЯзыке(ЛокализированнаяСтрока);
	
	Результат = ПредставлениеНаТекущемЯзыке;
	Если НЕ ИТК_Строки.ЛокализированнаяСтрокаНаНесколькихЯзыках(ЛокализированнаяСтрока)
			И ПредставлениеНаТекущемЯзыке = ИТК_Строки.ПредставлениеИдентификатора(ИмяПоля) Тогда
			
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьСкрываемыхПолейКоллекций(Элемент, Поля, Видимость = Истина)
	
	ИмяКоллекции = Элемент.Имя;
	Если Элемент = Элементы.ПоляНаборовДанных Тогда
		Коллекция = Элементы.НаборыДанных.ТекущиеДанные.Поля;
	Иначе
		Коллекция = ЭтотОбъект[ИмяКоллекции];
	КонецЕсли;
	
	ИмяПоказыватьПодробно = ИмяКоллекции + "Подробно";
	ПоказыватьПодробно = ЭтотОбъект[ИмяПоказыватьПодробно];
	Элементы[ИмяПоказыватьПодробно].Пометка = ПоказыватьПодробно;
	
	ЗаполненныеПоля = ИТК_ФормаКлиент.ПрисутствуютЗаполненныеЗначенияКоллекции(Коллекция, Поля);
	Для Каждого ИмяПоля Из Поля Цикл 
		
		Элементы[ИмяКоллекции + ИмяПоля].Видимость = Видимость 
														И (ПоказыватьПодробно
															ИЛИ ЗаполненныеПоля.Свойство(ИмяПоля));
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиСхемыКомпоновкиДанных()
	
	ОбновитьКоличествоВоВсехЗаголовках();
	ОбновитьОсновнойВариантНастроек();
	
	// Активируем первый набор данных
	НаборыДанныхЭлменты = НаборыДанных.ПолучитьЭлементы();
	Если ЗначениеЗаполнено(НаборыДанныхЭлменты) Тогда
		
		ПервыйНаборДанных = НаборыДанныхЭлменты[0];
		Элементы.НаборыДанных.ТекущаяСтрока = ПервыйНаборДанных.ПолучитьИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоВоВсехЗаголовках()
	
	ОбновитьКоличествоВЗаголовке(Элементы.НаборыДанных);
	ОбновитьКоличествоВЗаголовке(Элементы.ВычисляемыеПоля);
	ОбновитьКоличествоВЗаголовке(Элементы.СвязиНаборовДанных);
	ОбновитьКоличествоВЗаголовке(Элементы.Ресурсы);
	ОбновитьКоличествоВЗаголовке(Элементы.ПараметрыСКД);
	ОбновитьКоличествоВЗаголовке(Элементы.Макеты);
	ОбновитьКоличествоВЗаголовке(Элементы.ВложенныеСхемы);
	ОбновитьКоличествоВЗаголовке(Элементы.ВариантыНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоВЗаголовке(Элемент)
	
	Коллекция = ЭтотОбъект[Элемент.Имя];
	
	Если ТипЗнч(Коллекция) = Тип("ДанныеФормыДерево") Тогда
		
		Отбор = Неопределено;
		Если Элемент = Элементы.ВычисляемыеПоля Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Вид", ИТК_Перечисления.СКДВидыПолейНаборовДанныхПоле());
		КонецЕсли;
		
		КоличествоВКоллекции = ИТК_ФормаКлиент.КоличествоСтрокВДереве(Коллекция, Отбор);
		
	Иначе
		
		КоличествоВКоллекции = Коллекция.Количество();
		
	КонецЕсли;
	
	ЭтотОбъект[Элемент.Имя + "Количество"] = КоличествоВКоллекции;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОсновнойВариантНастроек()
	
	Для Индекс = 0 По ВариантыНастроек.Количество() - 1 Цикл 
		
		ВариантНастроек = ВариантыНастроек[Индекс];
		ВариантНастроек.Основной = (Индекс = 0);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораОформления(Элемент, ИмяПоля)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ТекущиеДанные[ИмяПоля];
	
	ЭлементКолонка = Элементы[Элемент.Имя + "Оформление"];
	СписокВыбора = ЭлементКолонка.СписокВыбора;
	СписокВыбора.Очистить();
	
	Если ТипЗначения.СодержитТип(Тип("Число")) Тогда
		
		КвалификаторыЧисла = ТипЗначения.КвалификаторыЧисла;
		
		Если КвалификаторыЧисла.Разрядность >= 5 Тогда
			
			Если ЗначениеЗаполнено(КвалификаторыЧисла.РазрядностьДробнойЧасти) Тогда
				
				Оформление = Новый Структура;
				Оформление.Вставить("Формат", "ЧЦ=15; ЧДЦ=2");
				СписокВыбора.Добавить(Оформление, "Формат: денежный (15, 2)");
				
				Оформление = Новый Структура;
				Оформление.Вставить("Формат", "ЧЦ=10; ЧДЦ=3");
				СписокВыбора.Добавить(Оформление, "Формат: количество (10, 3)");
				
			КонецЕсли;
			
			Если КвалификаторыЧисла.ДопустимыйЗнак = ДопустимыйЗнак.Любой Тогда
				
				Оформление = Новый Структура;
				Оформление.Вставить("ВыделятьОтрицательные", Истина);
				СписокВыбора.Добавить(Оформление, "Выделять отрицательные");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗначения.СодержитТип(Тип("Дата")) Тогда
		
		КвалификаторыДаты = ТипЗначения.КвалификаторыДаты;
		
		Если КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
			
			Оформление = Новый Структура;
			Оформление.Вставить("Формат", "ДФ=HH:mm");
			СписокВыбора.Добавить(Оформление, "Формат: время кратко ЧЧ:мм");
			
		КонецЕсли;
		
		Если КвалификаторыДаты.ЧастиДаты = ЧастиДаты.ДатаВремя Тогда
			
			Оформление = Новый Структура;
			Оформление.Вставить("Формат", "ДЛФ=D");
			СписокВыбора.Добавить(Оформление, "Формат: дата без времени(локальный)");
			
			Оформление = Новый Структура;
			Оформление.Вставить("Формат", "ДФ='dd.MM.yyyy HH:mm'");
			СписокВыбора.Добавить(Оформление, "Формат: дата и время кратко дд.ММ.гггг ЧЧ:мм");
			
		КонецЕсли;
		
	КонецЕсли;
	
	КнопкаСпискаВыбора = ЗначениеЗаполнено(СписокВыбора);
	ЭлементКолонка.КнопкаВыпадающегоСписка = КнопкаСпискаВыбора;
	ЭлементКолонка.КнопкаСпискаВыбора = КнопкаСпискаВыбора;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПоляИерархииРесурсов(ОписаниеПолей)
	
	ИерархическиеРесурсы = Новый Массив;
	Для Каждого ОписаниеПоля Из ОписаниеПолей Цикл 
		
		СсылочныеТипы = ИТК_ТипыКлиентСервер.СсылочныеТипы(ОписаниеПоля.Значение);
		Если НЕ ЗначениеЗаполнено(СсылочныеТипы) Тогда
			Продолжить;
		КонецЕсли;
		
		Иерархический = Ложь;
		Для Каждого Тип Из СсылочныеТипы.Типы() Цикл 
			
			ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
			Если ИТК_Метаданные.ОбъектСИерархией(ОбъектМетаданных) Тогда
				
				Иерархический = Истина;
				Прервать;
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		ИерархическиеРесурсы.Добавить(ОписаниеПоля.Представление);
		
	КонецЦикла;
	
	Для Каждого ИмяРесурса Из ИерархическиеРесурсы Цикл 
		
		ЭлементРесурс = ИТК_ОбщийКлиентСервер.СписокЗначенийНайтиПоПредставлению(ОписаниеПолей, ИмяРесурса);
		
		ИндексВставки = ОписаниеПолей.Индекс(ЭлементРесурс);
		ОписаниеПолей.Вставить(ИндексВставки + 1, ЭлементРесурс.Значение, ИмяРесурса + " Иерархия");

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ДоступныеПараметрыСКД()
	
	Результат = Новый Соответствие;
	
	Для Каждого СтрокаПараметрСКД Из ПараметрыСКД Цикл 
		
		Результат.Вставить(СтрокаПараметрСКД.Имя, СтрокаПараметрСКД.ТипЗначения);

	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьОсновнуюСхемуКомпоновкиДанныхИзДанныхФормы()
	
	АдресСхемыКомпоновкиДанных = СобратьСхемуКомпоновкиДанныхИзДанныхФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйЗагрузитьСостояниеРедактораЗапроса()
	
	ТекущиеДанные = Элементы.НаборыДанных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.ТекстЗапроса;
	ИТК_РедакторКодаКлиент.УстановитьТекст(ЭтотОбъект, Элемент, ТекущиеДанные.ТекстЗапроса);
	
	Если НЕ ИТК_РедакторКодаКлиент.Инициализирован(Элемент) Тогда
		
		ПодключитьОбработчикОжидания("ПодключаемыйЗагрузитьСостояниеРедактораЗапроса", 0.1, Истина);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяПоляИдентификатораКоллекции(Элемент)
	
	Если Элемент = Элементы.ВычисляемыеПоля
			ИЛИ Элемент = Элементы.ПоляНаборовДанных Тогда
		Результат = "Поле";
	Иначе
		Результат = "Имя";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция КоллекцияПоЭлементуКоллекции(Элемент)
	
	Если Элемент = Элементы.ПоляНаборовДанных Тогда
		Результат = Элементы.НаборыДанных.ТекущиеДанные.Поля;
	ИначеЕсли Элемент = Элементы.ВычисляемыеПоля Тогда
		Результат = ВычисляемыеПоля;
	ИначеЕсли Элемент = Элементы.ПараметрыСКД Тогда
		Результат = ПараметрыСКД;
	ИначеЕсли Элемент = Элементы.ВложенныеСхемы Тогда
		Результат = ВложенныеСхемы;
	ИначеЕсли Элемент = Элементы.ВариантыНастроек Тогда
		Результат = ВариантыНастроек;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверкаИдентификатораПриНачалеРедактирования(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ИмяПоля = ИмяПоляИдентификатораКоллекции(Элемент);
	ПредыдущийИдентификатор = ТекущиеДанные[ИмяПоля];
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИдентификатораПередОкончаниемРедактирования(Элемент, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ИмяПоля = ИмяПоляИдентификатораКоллекции(Элемент);
	Если ОтменаРедактирования Тогда
		ТекущиеДанные[ИмяПоля] = ПредыдущийИдентификатор;
		Возврат;
	КонецЕсли;
	
	НовыйИдентификатор = ТекущиеДанные[ИмяПоля];
	Если ИТК_Строки.НекорректныйИдентификатор(НовыйИдентификатор) Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение( , НСтр("ru = 'Некорректный идентификатор';
										|en = 'Invalid identifier'"));
		Возврат;
		
	КонецЕсли;
	
	Коллекция = КоллекцияПоЭлементуКоллекции(Элемент);
	ЗанятыеИдентификаторы = ИспользуемыеИдентификаторыКоллекции(Элемент, Коллекция, ТекущиеДанные.ПолучитьИдентификатор());
	Если ЗанятыеИдентификаторы.Найти(НовыйИдентификатор) <> Неопределено Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение( , НСтр("ru = 'Идентификатор уже используется';
										|en = 'The identifier is already in use'"));
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИспользуемыеИдентификаторыКоллекции(Элемент, Коллекция, ИдентификаторИсключения = Неопределено)
	
	Результат = Новый Массив;
	
	ИмяПоля = ИмяПоляИдентификатораКоллекции(Элемент);
	
	Если ТипЗнч(Коллекция) = Тип("ДанныеФормыДерево") Тогда
		ИсточникПолей = Коллекция.ПолучитьЭлементы();
	Иначе
		ИсточникПолей = Коллекция;
	КонецЕсли;
	
	Для Каждого Поле Из ИсточникПолей Цикл 
		
		Если ИдентификаторИсключения = Поле.ПолучитьИдентификатор() Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(Поле[ИмяПоля]);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаПереименованияНабораДанных(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		НаборыДанныхСтароеИмя = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаборыДанныхСтароеИмя) Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
			
			НовоеИмя = ТекущиеДанные["Представление"];
			Если НаборыДанныхСтароеИмя <> НовоеИмя Тогда
				
				Для Каждого СтрокаСвязьНабораДанных Из СвязиНаборовДанных Цикл 
					
					Если СтрокаСвязьНабораДанных.НаборДанныхИсточник = НаборыДанныхСтароеИмя Тогда
						СтрокаСвязьНабораДанных.НаборДанныхИсточник = НовоеИмя;
					КонецЕсли;
					
					Если СтрокаСвязьНабораДанных.НаборДанныхПриемник = НаборыДанныхСтароеИмя Тогда
						СтрокаСвязьНабораДанных.НаборДанныхПриемник = НовоеИмя;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	НаборыДанныхСтароеИмя = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаУдалениеНабораДанных(СтрокаНабораДанных)
	
	Если СтрокаНабораДанных.ПолучитьРодителя() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяНабораДанных = СтрокаНабораДанных["Представление"];

	УдаляемыеСвязиНаборовДанных = Новый Массив;
	Для Каждого СтрокаСвязьНабораДанных Из СвязиНаборовДанных Цикл 
		
		Если СтрокаСвязьНабораДанных.НаборДанныхИсточник = ИмяНабораДанных
				ИЛИ СтрокаСвязьНабораДанных.НаборДанныхПриемник = ИмяНабораДанных Тогда
				
			УдаляемыеСвязиНаборовДанных.Добавить(СтрокаСвязьНабораДанных);
				
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого УдаляемаяСвязьНаборовДанных Из УдаляемыеСвязиНаборовДанных Цикл 
		
		СвязиНаборовДанных.Удалить(УдаляемаяСвязьНаборовДанных);
		
	КонецЦикла;
	
	ОбновитьКоличествоВЗаголовке(Элементы.СвязиНаборовДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПослеИзмененияЗапросаНабораДанных()
	
	ОбновитьДоступныеПоляРесурсов();
	ОбновитьПараметры();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПослеУдаленияПоляНабораОбъект()
	
	ОбновитьДоступныеПоляРесурсов();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупрежденияНекорректноеИмяОбъектаНабораДанных(ДополнительныеПараметры) Экспорт
	
	ТекущийЭлемент = Элементы.НаборыДанныхИмяОбъекта;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокВыбораПараметраСвязейНаборов()
	
	ДанныеВыбора = Новый Массив;
	Для Каждого СтрокаПараметр Из ПараметрыСКД Цикл 
		ДанныеВыбора.Добавить(СтрокаПараметр.Имя);
	КонецЦикла;
	
	ЭлементПараметрСвязейВыбора = Элементы.СвязиНаборовДанныхПараметр;
	
	ЭлементПараметрСвязейВыбора.СписокВыбора.ЗагрузитьЗначения(ДанныеВыбора);
	ЭлементПараметрСвязейВыбора.КнопкаВыпадающегоСписка = ЗначениеЗаполнено(ДанныеВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияРедактораЗапроса()
	
	ДополнительныеСвойства = Новый Структура;
	ДополнительныеСвойства.Вставить("ТипЯзыка", ИТК_Перечисления.ТипЯзыкаРедактораЗапросы());
	ДополнительныеСвойства.Вставить("РежимКомпоновкиДанных", Истина);
	
	ИТК_РедакторКода.Инициализация(ЭтотОбъект, "ТекстЗапроса", ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти