
////////////////////////////////////////////////////////////////////////////////
// Механизм получения данных
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс


#Область РаботаСПолемТаблицаПараметров

// Процедура обновляет таблицу параметров для источника или способа компоновки источников.
// 
// Параметры:
//  Источник          - СправочникСсылка.бит_ИсточникиДанных, СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  ТаблицаПараметры  - ТаблицаЗначений.
//  Очищать           - Булево.
//  ПулСоединений     - Неопределено.
// 
Процедура ОбновитьТаблицуПараметров(Источник, ТаблицаПараметры, Очищать = Ложь, ПулСоединений = Неопределено) Экспорт
	
	МассивЗапросов = Новый Массив;
	ПолучитьЗапросыИсточников(Источник,МассивЗапросов);
	
	Исключения  = КонструкторПредопределенныхПараметров();
	// Исключим "технологические параметры"
	ДополнитьСписокИсключений(Источник, Исключения);
	
	СписокПараметров = Справочники.бит_ИсточникиДанных.ПолучитьПараметрыЗапросов(МассивЗапросов, Исключения, ПулСоединений);
		
	Справочники.бит_ИсточникиДанных.ОбновитьТаблицуПараметров(ТаблицаПараметры, СписокПараметров, Очищать);
	
	УстановитьЗначенияПараметровИзИсточника(ТаблицаПараметры, Источник);
		
КонецПроцедуры

// Процедура заполняет таблицу параметров значениями из источников.
// 
// Параметры:
//  СпособКомпоновки  - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  ТаблицаПараметры  - ТаблицаЗначений.
// 
Процедура ЗаполнитьТаблицуПараметров(СпособКомпоновки, ТаблицаПараметры) Экспорт

		
	Для каждого СтрокаТчИсточники Из СпособКомпоновки.ИсточникиДанных Цикл
		
		ИсточникДанных = СтрокаТчИсточники.ИсточникДанных;
		ИсточникОбъект = ИсточникДанных.ПолучитьОбъект();
		
		Если ИсточникОбъект <> Неопределено Тогда
			
			НастройкиИсточника = ИсточникОбъект.ПолучитьНастройкиИсточника();
			Если НастройкиИсточника = Неопределено Тогда
				Продолжить;				
			КонецЕсли;
			СтруктураЗначПарам = НастройкиИсточника.ПараметрыПостроителя;
			
			Для каждого СтрокаТаблицы Из ТаблицаПараметры Цикл
				
				Если Не СтруктураЗначПарам.Свойство(СтрокаТаблицы.ИмяПараметра) 
					ИЛИ ЗначениеЗаполнено(СтрокаТаблицы.ЗначениеПараметра) Тогда
					Продолжить;
				КонецЕсли; 					
				
				// Запись значения в таблицу
				СтрокаТаблицы.ЗначениеПараметра = СтруктураЗначПарам[СтрокаТаблицы.ИмяПараметра];		
				
			КонецЦикла; // По таблице параметров
			
		КонецЕсли;		
	
	КонецЦикла; // По источникам данных
	 
КонецПроцедуры // ЗаполнитьТаблицуПараметров()

// Процедура обрабатывает изменение вида параметра в строке таблицы параметров.
// 
// Параметры:
//  ТекущаяСтрока  - СтрокаТаблицыЗначений.
//  ПредыдущийВидПараметра  - ПеречислениеСсылка.бит_ВидыПараметровЗапроса.
// 
Процедура ИзменениеВидаПараметра(ТекущаяСтрока, ПредыдущийВидПараметра) Экспорт

	Если ТекущаяСтрока = Неопределено Тогда	
		Возврат;	
	КонецЕсли; 
	
	Если ТекущаяСтрока.ВидПараметра = Перечисления.бит_ВидыПараметровЗапроса.Выражение Тогда
		
		ТекущаяСтрока.ЗначениеПараметра = Строка(ТекущаяСтрока.ЗначениеПараметра);
		
	ИначеЕсли ТекущаяСтрока.ВидПараметра = Перечисления.бит_ВидыПараметровЗапроса.Список Тогда	
		
		Список = Новый СписокЗначений();
		
		Если ПредыдущийВидПараметра = Перечисления.бит_ВидыПараметровЗапроса.Значение Тогда
			
			// Создадим список
			ТекЗначение = ТекущаяСтрока.ЗначениеПараметра; 			  			
			Если ЗначениеЗаполнено(ТекЗначение) Тогда 				
				Список.Добавить(ТекЗначение);  				
			КонецЕсли; 
			ТекущаяСтрока.ЗначениеПараметра = Список;
			
		ИначеЕсли ПредыдущийВидПараметра = Перечисления.бит_ВидыПараметровЗапроса.Выражение Тогда
			
			ТекущаяСтрока.ЗначениеПараметра = Список;
						
		КонецЕсли; 
		
		// Ограничим типы значений для списка
		Список.ТипЗначения = ТекущаяСтрока.ДоступныеТипы;
		
	Иначе
		
		Если ПредыдущийВидПараметра = Перечисления.бит_ВидыПараметровЗапроса.Список Тогда
			
			// Уничтожим список
			Если ТипЗнч(ТекущаяСтрока.ЗначениеПараметра) = Тип("СписокЗначений") Тогда
				
				Список = ТекущаяСтрока.ЗначениеПараметра;
				Если Список.Количество() > 0 Тогда
					ТекущаяСтрока.ЗначениеПараметра = Список[0].Значение;
				Иначе	
					ТекущаяСтрока.ЗначениеПараметра = ТекущаяСтрока.ДоступныеТипы.ПривестиЗначение(ТекущаяСтрока.ЗначениеПараметра);
				КонецЕсли; 
				
			КонецЕсли; 			
			
		ИначеЕсли ПредыдущийВидПараметра = Перечисления.бит_ВидыПараметровЗапроса.Выражение Тогда
			
			ТекущаяСтрока.ЗначениеПараметра = ТекущаяСтрока.ДоступныеТипы.ПривестиЗначение(ТекущаяСтрока.ЗначениеПараметра);
			
		КонецЕсли; 
		
	КонецЕсли; 
	

КонецПроцедуры // ИзменениеВидаПараметра()

#КонецОбласти

#Область ПроцедурыФункцииПолученияДанных

// Процедура устанавливает в построитель отбор, сохраненный в элементе данных.
// 
// Параметры:
//  ПостроительЗапроса   - ПостроительЗапроса.
//  СохраненнаяНастройка - Структура.
// 
Процедура УстановитьОтборЭлементаДанных(ПостроительЗапроса,СохраненнаяНастройка)  Экспорт

	// Отбор заполняем по элементу данных
	Если ТипЗнч(СохраненнаяНастройка)=Тип("Структура") Тогда
		
		Для каждого ЭлементОтбора Из СохраненнаяНастройка.Отбор Цикл
			
			Попытка
				ОписаниеЭлемента = ЭлементОтбора.ПутьКДанным;
				НовыйЭлОтбора    = ПостроительЗапроса.Отбор.Добавить(ОписаниеЭлемента);
				бит_ОбщегоНазначения.ЗаполнитьЭлементОтбора(ЭлементОтбора,НовыйЭлОтбора);
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); 
			КонецПопытки;
			
		КонецЦикла; // По элементам отбора
		
	КонецЕсли; // Настройка - структура

КонецПроцедуры // УстановитьОтборЭлементаДанных()

// Процедура устанавливаем в построитель отбор, установленный в отчете в поле Отбор.
// 
// Параметры:
//  ПостроительЗапроса  - Построитель.
//  ОтборВОтчете        - ТаблицаЗначений.
// 
Процедура УстановитьОтборОтчета(ПостроительЗапроса,ОтборВОтчете)  Экспорт

		// Заполним отборы, установленные в форме отчета.
	Если ОтборВОтчете <> Неопределено Тогда
		
		Для каждого СтрокаОтбор Из ОтборВОтчете Цикл
			
			Если СтрокаОтбор.Использование Тогда
				ИмяПоля       = СтрокаОтбор.Имя;
				ПолеНастройки = ПостроительЗапроса.ДоступныеПоля.Найти(ИмяПоля);
				Если ПолеНастройки <> Неопределено И ПолеНастройки.Отбор Тогда
					НовыйЭлОтбора = ПостроительЗапроса.Отбор.Добавить(ИмяПоля);
					НовыйЭлОтбора.ВидСравнения  = СтрокаОтбор.ВидСравнения;
					НовыйЭлОтбора.Значение      = СтрокаОтбор.Значение;
					НовыйЭлОтбора.Использование = Истина;
				КонецЕсли; 
			КонецЕсли; // Использование 
			
		КонецЦикла; // По строкам отборов отчета
		
	КонецЕсли; // Отбор установлен

КонецПроцедуры // УстановитьОтборОтчета()

// Процедура восстанавливает настройки измерения строк построителя отчета/запроса.
// 
// Параметры:
//  ИзмеренияСтроки  - Массив.
//  Построитель      - ПостроительОтчета,ПостроительЗапроса.
//  Очищать          - Булево.
//  Соединение       - ComObject.
// 
Процедура УстановитьИзмеренияСтроки(ИзмеренияСтроки, Построитель, Очищать = Ложь, Соединение = Неопределено) Экспорт
	
	Если Очищать Тогда		
		Построитель.ИзмеренияСтроки.Очистить();		
	КонецЕсли; 
	
	Для каждого ТекНастройка Из ИзмеренияСтроки Цикл
		
		Если ТипЗнч(Построитель) = Тип("ПостроительЗапроса") ИЛИ Соединение <> Неопределено Тогда
			 
			Если Соединение = Неопределено Тогда
				ТипИзмерения = ТипИзмеренияПостроителяЗапроса.Элементы;
			Иначе	
				ТипИзмерения = Соединение.ТипИзмеренияПостроителяЗапроса.Элементы;
			КонецЕсли;  			
				
			Попытка					
				Построитель.Измерения.Добавить(ТекНастройка.ПутьКДанным,, ТипИзмерения);					
			Исключение					
				ТекстСообщения = НСтр("ru = 'Не удалось добавить измерение построителя ""%1"". По причине: %2.';
		      						  |en = 'Failed to add builder dimension ""%1"". For reason: %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекНастройка.ПутьКДанным, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));																								  
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 					
			КонецПопытки;
			
		Иначе	
			
			ТипИзмерения = ТипИзмеренияПостроителяОтчета.Элементы;
				
			Попытка					
				Построитель.ИзмеренияСтроки.Добавить(ТекНастройка.ПутьКДанным,, ТипИзмерения);					
			Исключение					
				ТекстСообщения = НСтр("ru = 'Не удалось добавить измерение построителя ""%1"". По причине: %2.';
			  						  |en = 'Failed to add builder dimension ""%1"". Because of: %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекНастройка.ПутьКДанным, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));																								  
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 				
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // УстановитьИзмеренияСтроки()

// Процедура добавляет элемент порядка построителя на основании настройки порядка в ИсточникеДанных.
// 
// Параметры:
//  НастройкаПорядка - ТабличнаяЧасть.
//  Построитель      - ПостроительЗапроса, ComObject.
//  НаправленияСортировки - СистемноеПеречисление.НаправленияСортировки, ComObject.
//  Очищать - Булево.
//  ВыводитьСообщения - Булево.
// 
Процедура УстановитьПорядокПостроителя(НастройкаПорядка, Построитель, НаправленияСортировки, Очищать = Ложь, ВыводитьСообщения = Истина) Экспорт

	Если Очищать Тогда
	
		Построитель.Порядок.Очистить();
	
	КонецЕсли; 
	
	Для каждого ТекНастройка Из НастройкаПорядка Цикл
		
		Если ТекНастройка.НаправлениеСортировки = Перечисления.бит_НаправленияСортировки.Убывание Тогда			
			ТекНаправление = НаправленияСортировки.Убыв;			
		Иначе			
			ТекНаправление = НаправленияСортировки.Возр;		
		КонецЕсли; 
		
		Попытка			
			Построитель.Порядок.Добавить(ТекНастройка.ПутьКДанным, "", ТекНастройка.ПутьКДанным, ТекНаправление);			
		Исключение			
			Если ВыводитьСообщения Тогда				
				ТекстСообщения = НСтр("ru='Не удалось добавить элемент порядка %1. Описание ошибки: %2.';
									  |en='Failed to add item of order %1. Error description: %2'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекНастройка.ПутьКДанным, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));										
			КонецЕсли;			
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры // УстановитьПорядокПостроителя()

// Процедура устанавливает обязательные параметры построителя запроса.
// 
// Параметры:
//  ПостроительЗапроса - ПостроительЗапроса,ComObject.
//  ГраницаНач - Дата,Граница,ComObject.
//  ГраницаКон - Дата,Граница,ComObject.
//  КонецГраница - Булево.
// 
Процедура УстановитьОбязательныеПараметры(ПостроительЗапроса,ГраницаНач,ГраницаКон,КонецГраница) Экспорт

	ПостроительЗапроса.Параметры.Вставить("НачалоПериода",ГраницаНач);
	ПостроительЗапроса.Параметры.Вставить("КонецПериода" ,ГраницаКон);
	ПостроительЗапроса.Параметры.Вставить("МоментВремени",ГраницаКон);
	
	Если КонецГраница Тогда
		ПостроительЗапроса.Параметры.Вставить("КонецПериодаДата",ГраницаКон.Значение);
	Иначе	
		ПостроительЗапроса.Параметры.Вставить("КонецПериодаДата",ГраницаКон);
	КонецЕсли; 

	ПостроительЗапроса.Параметры.Вставить("ТекущаяДата", ТекущаяДатаСеанса());
	ПостроительЗапроса.Параметры.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	
КонецПроцедуры // УстановитьОбязательныеПараметры()

// Функция конструктор структуры параметров для функции получения данных по источнику.
// 
// Параметры:
//  ГраницаНач - Дата, Граница - начало периода извлечения данных.
//  ГраницаКон - Дата, Граница - конец периода извлечения данных.
//  Параметры  - Структура - параметры построителя запроса.
//  Настройка  - Настройка построителя отчета.
//  Поля       - Массив    - выбранные поля построителя.
//  Измерения  - Массив    - измерения, по которым будет производиться расшифровка
//  ОтборВОтчете               - ТаблицаЗначений - Отборы установленные непосредственно в отчете.
//  ВозвращатьРезультатЗапроса - Булево - Используется при в обработке расшифровки.
//  НастройкаПодключения       - СправочникСсылка.бит_мпд_НастройкиВнешнийПодключений.
//  НастройкаПулаПодключений   - СправочникСсылка.бит_мпд_НастройкиПуловПодключений 
//                               позволяет переопределить настройки подключения для вид ИБ
//  ПулПодключений - Соответствие - Содержит активные подключения, ключ - НастройкаПодключения, значение - ComObject.
// 
// Возвращаемое значение:
//  Результат - СтрПар.
// 
Функция НовыеПараметрыПолучитьДанныеПоИсточнику() Экспорт

	СтрПар = Новый Структура;
	СтрПар.Вставить("Параметры",				 Неопределено);
	СтрПар.Вставить("Настройка",				 Неопределено);
	СтрПар.Вставить("Поля",						 Неопределено);
	СтрПар.Вставить("Измерения",				 Неопределено);
	СтрПар.Вставить("ОтборВОтчете",				 Неопределено);
	СтрПар.Вставить("ВозвращатьРезультатЗапроса",Ложь);
	СтрПар.Вставить("НастройкаПодключения",		 Неопределено);
	СтрПар.Вставить("НастройкаПулаПодключений",	 Неопределено);	
	СтрПар.Вставить("ПулПодключений",			 Неопределено);

	Возврат СтрПар;
	
КонецФункции

// Функция конструктор структуры параметров для функции получения данных по источнику.
// 
// Параметры:
//  МассивЭлементов - Массив - Массив элементов данных.
//  Параметры       - Структура - Параметры построителя запроса.
//  ПоказыватьИндикатор - Булево.
//  НастройкаПулаПодключений - СправочникСсылка.бит_мпд_НастройкиПуловПодключений.
// 
// Возвращаемое значение:
//  СтрПар - Структура.
// 
Функция НовыеПараметрыПолучитьДанныеПоСпособуКомпоновки() Экспорт

	СтрПар = Новый Структура;
	СтрПар.Вставить("МассивЭлементов"         ,Неопределено);
	СтрПар.Вставить("Параметры"               ,Неопределено);
	СтрПар.Вставить("ОтборВОтчете"            ,Неопределено);
	СтрПар.Вставить("ПоказыватьИндикатор"     ,Ложь);
	СтрПар.Вставить("НастройкаПулаПодключений",Неопределено);
	СтрПар.Вставить("НастройкаПодключения",	   Неопределено);

	Возврат СтрПар;
	
КонецФункции
// Процедура получает данные по источнику.
// 
// Параметры:
//  ИсточникДанных  - СправочникСсылка.ИсточникиДанныхДляРасчетовБюджетирования.
//  ГраницаНач      - Дата,Граница.
//  ГраницаКон      - Дата,Граница.
//  СтрПар          - Структура.
// 
// Возвращаемое значение:
//   ТаблицаРезультат  - ТаблицаЗначений.
// 
Функция ПолучитьДанныеПоИсточнику(ИсточникДанных, ГраницаНач, ГраницаКон, Дополнительно) Экспорт

	 
	 НастройкиПодключений = ОпределитьНеобходимыеПодключения(Дополнительно.НастройкаПулаПодключений, 
	 							ИсточникДанных, Дополнительно.НастройкаПодключения);
	 
	 // Получим данные по настройкам подключений
	 КолонкиГруппировок  = "";
	 КолонкиСуммирования = "";
	 КоличествоНастроек  = НастройкиПодключений.Количество();
	 Ном = 1;
	 
	 Если Дополнительно.ВозвращатьРезультатЗапроса Тогда
	 	ТаблицаРезультат = Новый Соответствие;
	 КонецЕсли; 

	 Для каждого НастройкаПодключения Из НастройкиПодключений Цикл
	 	Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
	    	 // Текущая информационная база
			ТекущиеНастройки = НовыеПараметрыПолучитьДанныеПоИсточнику();
			ЗаполнитьЗначенияСвойств(ТекущиеНастройки, Дополнительно);
			
			Попытка
	    		ТаблицаДанных = ПолучитьДанныеПоИсточникуТекущаяБаза(ИсточникДанных, ГраницаНач, ГраницаКон, ТекущиеНастройки);	    	 
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось получить данные из настройки ""%1"" по причине: %2.'; 
										|en = 'Could not get the data for setting ""%1"" for the reason: %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ИсточникДанных, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ИсточникДанных); 
				ТаблицаДанных = Неопределено;
			КонецПопытки;			
	    Иначе	
	    	// Внешняя информационная база
			ТекущиеНастройки = НовыеПараметрыПолучитьДанныеПоИсточнику();
			ЗаполнитьЗначенияСвойств(ТекущиеНастройки,Дополнительно);
			ТекущиеНастройки.НастройкаПодключения = НастройкаПодключения;
			Попытка
	    		ТаблицаДанных = бит_ПолучениеДанныхВнешниеИсточникиСервер.ПолучитьДанныеПоИсточникуВнешняяБаза(
									ИсточникДанных, ГраницаНач, ГраницаКон, ТекущиеНастройки);
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось получить данные из настройки ""%1"" по причине: %2.'; 
									|en = 'Could not get the data for setting ""%1"" for the reason: %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ИсточникДанных, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ИсточникДанных); 
				ТаблицаДанных = Неопределено;
			КонецПопытки;						
		КонецЕсли; 
																							  
		Если ТаблицаДанных = Неопределено Тогда
			Возврат Неопределено;		
		КонецЕсли;
		
		Если Дополнительно.ВозвращатьРезультатЗапроса Тогда
			Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
				ТаблицаРезультат.Вставить(Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза, ТаблицаДанных);
			Иначе	
				ТаблицаРезультат.Вставить(НастройкаПодключения, ТаблицаДанных);
			КонецЕсли; 
		Иначе	
			
			Если Ном = 1 Тогда
				
				// Инициализация результирующей таблицы
				ТаблицаРезультат = Новый ТаблицаЗначений;
				ОписаниеЧисло    = Новый ОписаниеТипов("Число");
				
				Для каждого Колонка Из ТаблицаДанных.Колонки Цикл
					Если КолонкаСодержитТолькоЧисловыеЗначения(Колонка, ТаблицаДанных) Тогда
						ТаблицаРезультат.Колонки.Добавить(Колонка.Имя, ОписаниеЧисло);
						КолонкиСуммирования = бит_СтрокиКлиентСервер.ДобавитьСтрокуСРазделителем(
												КолонкиСуммирования, Колонка.Имя, ",");
					Иначе
						// Для не числовых колонок тип устанавливать не будем, т.к. если значения не удалось сконвертировать
						// в ссылки текущей базы, то будут записаны элементы списка значений.
						ТаблицаРезультат.Колонки.Добавить(Колонка.Имя);
						КолонкиГруппировок = бит_СтрокиКлиентСервер.ДобавитьСтрокуСРазделителем(
												КолонкиГруппировок, Колонка.Имя, ",");
					КонецЕсли; 
				КонецЦикла;  // ТаблицаДанных.Колонки
			КонецЕсли;
		
			Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
				// Копируем данные в таблицу-результат
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			КонецЦикла; // ТаблицаДанных
		КонецЕсли;  // Количество настроек
	    Ном = Ном+1;
	 КонецЦикла; // НастройкиПодключений
	 
	 Если КоличествоНастроек > 1 И НЕ Дополнительно.ВозвращатьРезультатЗапроса Тогда
	 	// Необходимо выполнить свертку
		ТаблицаРезультат.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	 КонецЕсли; 
	 	 
	 // Применение соответствий 
	 Если НЕ Дополнительно.ВозвращатьРезультатЗапроса 
		  И (ИсточникДанных.СоотвСтатьиРегл_Применить 
		     ИЛИ ИсточникДанных.СоотвПодразделения_Применить 
			 ИЛИ ИсточникДанных.СоотвНомГруппы_Применить 
			 ИЛИ ИсточникДанных.НастройкиСоответствий.Количество() > 0) Тогда
			 
			 Если ЗначениеЗаполнено(ГраницаКон) Тогда
			 	Если ТипЗнч(ГраницаКон)  = Тип("Граница") Тогда
					Период = ГраницаКон.Значение;
				Иначе	
					Период = ГраницаКон;
				КонецЕсли;
			 Иначе	
			 	Период = ТекущаяДатаСеанса();
			 КонецЕсли;
	 	  ПрименитьСоответствия(ТаблицаРезультат, ИсточникДанных, Период);
	 КонецЕсли; 
	 
	 // Обработчик после получения данных
	 Если НЕ ПустаяСтрока(ИсточникДанных.КодПослеПолученияДанных) Тогда
		 
		 Параметры = Новый Структура; 
		 НастройкаИсточника = ИсточникДанных.НастройкиПостроителя.Получить();
		 Если ТипЗнч(НастройкаИсточника) = Тип("Структура") Тогда
			 Для Каждого Параметр Из НастройкаИсточника.ПараметрыПостроителя Цикл
				 Параметры.Вставить(Параметр.Ключ, Параметр.Значение);
			 КонецЦикла;
		 КонецЕсли;
		 Попытка
		 // АПК:487-выкл ВыполнитьВБезопасномРежиме не используется, т.к. выполняется безопасный код.
		 Выполнить(ИсточникДанных.КодПослеПолученияДанных);
		 // АПК:487-вкл
		Исключение
			ТекстСообщения = НСтр("ru='Ошибка выполнения обработчика ""После получения данных"" по причине: %1.';
								  |en='Error executing the handler ""After receiving data"" due to: %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		 	ВызватьИсключение ТекстСообщения;
		 КонецПопытки; 
	 КонецЕсли; 
	 
	Возврат ТаблицаРезультат;
	
КонецФункции // ПолучитьДанные()

// Процедура добавляет выбранные поля построителя.
// 
// Параметры:
//  Построитель - построитель запроса.
// 
Процедура ЗаполнитьВыбранныеПоля(Построитель, ИсточникДанных, Очищать = Истина)  Экспорт
	
	Если Очищать Тогда
		
		Построитель.ВыбранныеПоля.Очистить();	
		
	КонецЕсли; 
	
	Для каждого Поле Из ИсточникДанных.Поля Цикл
		
		ИмяПоля = ?(НЕ ПустаяСтрока(Поле.Синоним),Поле.Синоним,Поле.Имя);
		ИмяПоля = СтрЗаменить(ИмяПоля,".","");
		
		Если Поле.Использование  Тогда
			
			Попытка
				ВыбранноеПоле = Построитель.ВыбранныеПоля.Добавить(Поле.Имя,ИмяПоля);
				ВыбранноеПоле.Представление = ИмяПоля;
			Исключение
				ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьВыбранныеПоля()

// Процедура заменяет имена колонок на синонимы источника данных.
// 
// Параметры:
//  ТаблицаДанных - ТаблицаЗначений.
//  ИсточникДанных- СправочникСсылка.бит_ИсточникиДанных.
// 
Процедура ПодставитьСинонимыИсточника(ТаблицаДанных,ИсточникДанных) Экспорт

	Для каждого Поле Из ИсточникДанных.Поля Цикл
		
		Если НЕ Поле.Использование Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Если ПустаяСтрока(Поле.Синоним) Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		КолонкаТаблицы = ТаблицаДанных.Колонки.Найти(Поле.Имя);
		КолонкаТаблицыСиноним = ТаблицаДанных.Колонки.Найти(Поле.Синоним);
		Если КолонкаТаблицы <> Неопределено И КолонкаТаблицыСиноним = Неопределено Тогда
			
			КолонкаТаблицы.Имя = Поле.Синоним;
			
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры // ПодставитьСинонимыИсточника()

// Функция получает данные по настройкам, указанным в способе компоновки источников данных.
// 
// Параметры
//  СпособКомпоновки  - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  ГраницаНач        - Дата,МоментВремени,Граница.
//  ГраницаКон        - Дата,МоментВремени,Граница.
//  СтрПар            - Структура.
// 
// Возвращаемое значение:
//   ТаблицаРезультат   - ТаблицаЗначений.
// 
Функция ПолучитьДанныеПоИсточникам(СпособКомпоновки, ГраницаНач, ГраницаКон, СтрПар) Экспорт
	
	Параметры                = СтрПар.Параметры;
	МассивЭлементов          = СтрПар.МассивЭлементов;
	ОтборВОтчете             = СтрПар.ОтборВОтчете;
	ПоказыватьИндикатор      = СтрПар.ПоказыватьИндикатор;
	НастройкаПулаПодключений = СтрПар.НастройкаПулаПодключений;
	
	// Соответствие для хранения результатов вложенных способов компоновки.
	ВложенныеРезультаты = Новый Соответствие;
	
	СоотвИсточников = СформироватьСоответствияПолейДляСпособа(СпособКомпоновки);
	
	МассивРесурсов = бит_МеханизмПолученияДанныхКлиентСервер.ПоляДляСпособаКомпоновки(СпособКомпоновки, "Ресурс");
	Поля           = бит_МеханизмПолученияДанныхКлиентСервер.ПоляДляСпособаКомпоновки(СпособКомпоновки, "Поле");
	
	ТаблицаРезультат = ИнициализироватьТаблицуРезультат(СпособКомпоновки,МассивРесурсов);
	
	// Выберем элементы данных
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭлементыДанных.Ссылка КАК ЭлементДанных,
	|	ЭлементыДанных.Родитель КАК ГруппаЭлементДанных,
	|	ЭлементыДанных.ИсточникДанных КАК ИсточникДанных,
	|	ЭлементыДанных.НастройкиПостроителя КАК НастройкиПостроителя,
	|	ЭлементыДанных.Коэффициент КАК Коэффициент,
	|	ЭлементыДанных.ВидСубконто1 КАК ВидСубконто1,
	|	ЭлементыДанных.ВидСубконто2 КАК ВидСубконто2,
	|	ЭлементыДанных.ВидСубконто3 КАК ВидСубконто3,
	|	ЭлементыДанных.ВидСубконто4 КАК ВидСубконто4,
	|	ЭлементыДанных.Наименование КАК Наименование,
	|	ЭлементыДанных.Родитель.Комментарий КАК Комментарий,
	|	ЭлементыДанных.ВидИнформационнойБазы КАК ВидИнформационнойБазы,
	|	ЭлементыДанных.НастройкаПодключения КАК НастройкаПодключения,
	|	ЭлементыДанных.Кодификатор КАК Кодификатор,
	|	ЭлементыДанных.ВидГруппы КАК ВидГруппы
	|ИЗ
	|	Справочник.бит_ЭлементыДанных КАК ЭлементыДанных
	|ГДЕ
	|	ЭлементыДанных.Владелец = &СпособКомпоновки
	|	И ЭлементыДанных.ВидГруппы = ЗНАЧЕНИЕ(Перечисление.бит_ВидыГруппДанных.ВыборкаДанных)
	|	И ВЫБОР
	|			КОГДА &ФильтроватьПоМассиву
	|				ТОГДА ЭлементыДанных.Ссылка В (&МассивЭлементов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ ЭлементыДанных.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("СпособКомпоновки", СпособКомпоновки);				 
	Если МассивЭлементов <> Неопределено Тогда
		Запрос.УстановитьПараметр("МассивЭлементов",      МассивЭлементов);
		Запрос.УстановитьПараметр("ФильтроватьПоМассиву", Истина);		
	Иначе
		Запрос.УстановитьПараметр("ФильтроватьПоМассиву", Ложь);
		Запрос.УстановитьПараметр("МассивЭлементов",      Новый Массив);		
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	
	// При необходимости выполним подключения к информационным базам, из которых следует извлекать данные.
	ТаблицаПодключений = Результат.Выгрузить();
	ТаблицаПодключений.Свернуть("ВидИнформационнойБазы,НастройкаПодключения");
	
	ПулСоединений = Новый Соответствие;
	Для каждого СтрокаТаблицы Из ТаблицаПодключений Цикл
		
		МассивПодключений = ОпределитьНеобходимыеПодключения(НастройкаПулаПодключений, СтрокаТаблицы, Неопределено);
		
		Для каждого ТекНастройкаПодключения Из МассивПодключений Цикл
			
			Если ЗначениеЗаполнено(ТекНастройкаПодключения) Тогда
				
				Если ПулСоединений[ТекНастройкаПодключения] = Неопределено Тогда 
					
					Если  ТекНастройкаПодключения.РасположениеБазы = Перечисления.бит_мпд_ВидыРасположенияИнформационныхБаз.RestСервис Тогда
						
						// HTTP
						ПулСоединений.Вставить(ТекНастройкаПодключения, Неопределено);
						
					Иначе	
						
						// Com
						НовоеПодключение = бит_ПолучениеДанныхСерверПовтИсп.ПодключитьКОМ(ТекНастройкаПодключения);						
						Если НовоеПодключение <> Неопределено Тогда							
							ПулСоединений.Вставить(ТекНастройкаПодключения, НовоеПодключение);							
						КонецЕсли; 
						
					КонецЕсли; // Расположение базы
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; // МассивПодключений
		
	КонецЦикла; // ТаблицаПодключений
	
	Если ПулСоединений.Количество() = 0 Тогда	
		ПулСоединений = Неопределено;	
	КонецЕсли; 
	
	ВыборкаЭД = Результат.Выбрать();
	
	КоличествоЭлементовДанных = ВыборкаЭД.Количество();
	
	Если ПоказыватьИндикатор Тогда
		
		ПР = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
		Пр.ОтображатьПроцентВывода=Истина ; 
		Эл = Новый ЭлементРезультатаКомпоновкиДанных; 	
		ПР.НачатьВывод(); 	
		Ном = 1;
		
	КонецЕсли; 
	
	Пока ВыборкаЭД.Следующий() Цикл
		
		Если ПоказыватьИндикатор Тогда			
			Эл.ПроцентВывода = 100*?(КоличествоЭлементовДанных = 0, 0,Ном/КоличествоЭлементовДанных); 
			ПР.ВывестиЭлемент(Эл); 
			Ном = Ном+1;			
		КонецЕсли; 
		
		ТаблицаПоИсточнику = Неопределено;
		
		СоотвКолонок = СоотвИсточников[ВыборкаЭД.ИсточникДанных];
				
		Если ТипЗнч(ВыборкаЭД.ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
			
			// Заполним массив субконто для расчета развернутого сальдо.
			МассивСубконто = Новый Массив;
			Для Н=1 По 4 Цикл
				Если ЗначениеЗаполнено(ВыборкаЭД["ВидСубконто"+Н]) Тогда
			       МассивСубконто.Добавить(ВыборкаЭД["ВидСубконто"+Н]);
				КонецЕсли; 
			КонецЦикла; 
			
			Если Параметры = Неопределено Тогда
				Параметры = Новый Структура;
			КонецЕсли;
			
			Если МассивСубконто.Количество() > 0 Тогда
			    Параметры.Вставить("МассивСубконто",МассивСубконто);
			КонецЕсли;
			
			// В выбранные поля необходимо добавить субконто по которому идет разворот.
			ВыбранныеПоля = Новый Массив;
			Для Каждого Элемент Из Поля Цикл
				ВыбранныеПоля.Добавить(Элемент);
			КонецЦикла;	
			Для Н=1 По 4 Цикл
				Если ЗначениеЗаполнено(ВыборкаЭД["ВидСубконто"+Н]) Тогда
					ВыбранныеПоля.Добавить("Субконто"+Н);
				КонецЕсли; 
			КонецЦикла; 
			
			Настройка = ВыборкаЭД.НастройкиПостроителя.Получить();
			
			// Получим результат по источнику
			СтрПар = НовыеПараметрыПолучитьДанныеПоИсточнику();
			СтрПар.Параметры            = Параметры;
			СтрПар.Настройка            = Настройка;
			СтрПар.Поля                 = ВыбранныеПоля;
			СтрПар.ОтборВОтчете         = ОтборВОтчете;
			СтрПар.НастройкаПодключения = ВыборкаЭД.НастройкаПодключения;
			СтрПар.ПулПодключений       = ПулСоединений;
			СтрПар.НастройкаПулаПодключений = НастройкаПулаПодключений;
			
			ТаблицаПоИсточнику = ПолучитьДанныеПоИсточнику(ВыборкаЭД.ИсточникДанных, ГраницаНач, ГраницаКон, СтрПар);			
			
		ИначеЕсли ТипЗнч(ВыборкаЭД.ИсточникДанных) = Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных") Тогда	
			
			// Получаем вложенную таблицу
			ТаблицаВложенная = ВложенныеРезультаты[ВыборкаЭД.ИсточникДанных];			
			Если ТаблицаВложенная = Неопределено Тогда
			
				 // Вызываем вложенный способ компоновки
				 
				 НовыеПараметры = НовыеПараметрыПолучитьДанныеПоСпособуКомпоновки();
				 НовыеПараметры.Параметры           = Параметры;
				 НовыеПараметры.ОтборВОтчете        = ОтборВОтчете;
				 НовыеПараметры.ПоказыватьИндикатор = Ложь;
				 
				 ТаблицаВложенная = ПолучитьДанныеПоИсточникам(ВыборкаЭД.ИсточникДанных,
				 						ГраницаНач, ГраницаКон, НовыеПараметры);
																
				 ДополнитьРезультатИВыполнитьРасчет(ВыборкаЭД.ИсточникДанных, ТаблицаВложенная);												
																
                 ВложенныеРезультаты.Вставить(ВыборкаЭД.ИсточникДанных,ТаблицаВложенная);																
				 
			КонецЕсли; // Вложенная таблица неопределена
			
			ПостроительЗапроса = Новый ПостроительЗапроса;
			ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаВложенная);
			
			// Применяем ко вложенной таблице отборы элемента данных и отчета.
			Настройка = ВыборкаЭД.НастройкиПостроителя.Получить();			
	        УстановитьОтборЭлементаДанных(ПостроительЗапроса,Настройка);
			УстановитьОтборОтчета(ПостроительЗапроса,ОтборВОтчете);
			
			// Фильтруем данные с помощью построителя
			ПостроительЗапроса.Выполнить();			
			ТаблицаПоИсточнику = ПостроительЗапроса.Результат.Выгрузить();			
			
		КонецЕсли; 
		
		Если ТаблицаПоИсточнику <> Неопределено Тогда
			
			КолонкиИсточника = ТаблицаПоИсточнику.Колонки;
			
			// Добавим результат по источнику в результирующую таблицу.
			Для каждого СтрокаПоИсточнику Из ТаблицаПоИсточнику Цикл
				
				НоваяСтрока = ТаблицаРезультат.Добавить();
				НоваяСтрока.ЭлементДанных       = ВыборкаЭД.ЭлементДанных;
				НоваяСтрока.ГруппаЭлементДанных = ВыборкаЭД.ГруппаЭлементДанных;
				НоваяСтрока.Кодификатор         = ВыборкаЭД.Кодификатор;
				НоваяСтрока.Коэффициент         = ВыборкаЭД.Коэффициент;
				НоваяСтрока.ВидГруппы           = ВыборкаЭД.ВидГруппы;
				
				Если СоотвКолонок <> Неопределено Тогда		
				
					Для каждого Колонка Из КолонкиИсточника Цикл					
			
						ИмяКолонкиРезультат = СоотвКолонок[Колонка.Имя];						
						Если ИмяКолонкиРезультат <> Неопределено Тогда
							
							Если МассивРесурсов.Найти(ИмяКолонкиРезультат) <> Неопределено Тогда
								ЗначениеПоИсточнику = СтрокаПоИсточнику[Колонка.Имя];
								Если ТипЗнч(ЗначениеПоИсточнику) <> Тип("Число") Тогда
									ЗначениеПоИсточнику = 0;
								КонецЕсли; 
								НоваяСтрока[ИмяКолонкиРезультат] = ЗначениеПоИсточнику * НоваяСтрока.Коэффициент;
								НоваяСтрока[ИмяКолонкиРезультат+"Исходный"] = ЗначениеПоИсточнику;
							Иначе	
								НоваяСтрока[ИмяКолонкиРезультат] = СтрокаПоИсточнику[Колонка.Имя];
							КонецЕсли;
						
						КонецЕсли; // Нашли колонку-результат
					
					КонецЦикла; // По колонкам таблицы источника
				КонецЕсли;
			
			КонецЦикла; // По строкам таблицы источника
			
		КонецЕсли; // Таблица источник есть
		
		
		// ТаблицаПоИсточнику.ВыбратьСтроку();
	КонецЦикла; // по элементам данных
	
	Если ПоказыватьИндикатор Тогда
        ПР.ЗакончитьВывод(); 		
	КонецЕсли;
	
	ПересчитатьРесурсыПоКурсам(СпособКомпоновки, ГраницаНач, ГраницаКон, СтрПар, ТаблицаРезультат);
	
	Возврат ТаблицаРезультат;
	
КонецФункции // ПолучитьДанныеПоИсточникам()

// Процедура формирует список источников, используемых в данном способе компоновки.
// 
// 
// Параметры:
//  СпособКомпоновки  - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
// 
// Возвращаемое значение:
//  РезСписок   - СписокЗначений.
// 
Функция СформироватьСписокИсточники(СпособКомпоновки) Экспорт
	
	РезСписок = Новый СписокЗначений;
	
	Для каждого СтрокаТаблицы Из СпособКомпоновки.ИсточникиДанных Цикл
		
		РезСписок.Добавить(СтрокаТаблицы.ИсточникДанных);
		
	КонецЦикла; 
	
	
	Возврат РезСписок;
КонецФункции // СформироватьСписокИсточники()

// Инициализирует таблицу в которой будут собираться результирующие данные.
// 
// 
// Параметры:
//  СпособКомпоновки  - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  МассивРесурсов    - Массив.
// 
// Возвращаемое значение:
//  ТаблицаЗначений   - ТаблицаРезультат.
// 
Функция ИнициализироватьТаблицуРезультат(СпособКомпоновки,МассивРесурсов)  Экспорт

	ТаблицаРезультат = Новый ТаблицаЗначений;
	 
	ОписаниеЭлементДанных = Новый ОписаниеТипов("СправочникСсылка.бит_ЭлементыДанных");
	ОписаниеЧисло         = Новый ОписаниеТипов("Число");
	ОписаниеСтрока        = Новый ОписаниеТипов("Строка"); 
	ОписаниеЛюбыхТипов    = бит_ОбщегоНазначения.ОписаниеПроизвольногоТипа();
	 
	// Обязательные колонки
	ТаблицаРезультат.Колонки.Добавить("ГруппаЭлементДанных", ОписаниеЭлементДанных);	 
	ТаблицаРезультат.Колонки.Добавить("ЭлементДанных"		, ОписаниеЭлементДанных);
	ТаблицаРезультат.Колонки.Добавить("Кодификатор"		, ОписаниеСтрока);
	ТаблицаРезультат.Колонки.Добавить("Коэффициент"		, ОписаниеЧисло);
	ТаблицаРезультат.Колонки.Добавить("ВидГруппы"			, Новый ОписаниеТипов("ПеречислениеСсылка.бит_ВидыГруппДанных"));                                                        	 
	 
	Для каждого СтрокаТаблицы Из СпособКомпоновки.КолонкиТаблицы Цикл
		 
		Если МассивРесурсов.Найти(СтрокаТаблицы.ИмяКолонки)<>Неопределено Тогда
			// Для ресурсов сохраним первоначальное значение и значение с коэффициентом.
			ТаблицаРезультат.Колонки.Добавить(СтрокаТаблицы.ИмяКолонки + "Исходный", ОписаниеЧисло);
			ТаблицаРезультат.Колонки.Добавить(СтрокаТаблицы.ИмяКолонки, ОписаниеЧисло);
		Иначе
		 	// Получим описание типов для колонки
			ТекОписание = Неопределено;
			Если ТипЗнч(СтрокаТаблицы.ОписаниеТипов) = Тип("ХранилищеЗначения") Тогда   				 
				ТекОписание = СтрокаТаблицы.ОписаниеТипов.Получить();                   				 
			КонецЕсли; 
			// Добавим колонку в таблицу значений
			Если ТипЗнч(ТекОписание) <> Тип("ОписаниеТипов") Или ТекОписание.Типы().Количество() = 0 Тогда
				ТаблицаРезультат.Колонки.Добавить(СтрокаТаблицы.ИмяКолонки, ОписаниеЛюбыхТипов);
			Иначе	
				ТаблицаРезультат.Колонки.Добавить(СтрокаТаблицы.ИмяКолонки, ТекОписание);	 
			КонецЕсли; // Для колонки установлено описание
			 
		 КонецЕсли; // Это ресурс 
		 
	 КонецЦикла; // По колонкам таблицы
                              	 
	 Возврат ТаблицаРезультат;
	 
КонецФункции // ИнициализироватьТаблицуРезультат()

// Функция сворачивает результат по измерениям. 
// Если имена измерений не переданы, то сворачивает только по группе элемента данных и иерархическому коду.
// 
// Параметры
//  ВходящаяТаблица  - ТаблицаЗначений.
//  МассивРесурсов   - Массив.
//  МассивИзмерений  - Массив.
// 
// Возвращаемое значение:
//   ТаблицаРезультат   - ТаблицаЗначений.
// 
Функция СвернутьРезультат(ВходящаяТаблица,МассивРесурсов,МассивИзмерений=Неопределено) Экспорт

	ТаблицаРезультат = ВходящаяТаблица.Скопировать();
	КолонкиТаблицы   = ТаблицаРезультат.Колонки;
	
	ИменаРесурсов = "";
	Для каждого Ресурс Из МассивРесурсов Цикл
		Если НЕ КолонкиТаблицы.Найти(Ресурс) = Неопределено Тогда
			ИменаРесурсов = ИменаРесурсов + ?(ПустаяСтрока(ИменаРесурсов),"",",") + Ресурс;			
		КонецЕсли; 
	КонецЦикла; 
	
	ИменаИзмерений = "ГруппаЭлементДанных,ЭлементДанных,Кодификатор";
	Если МассивИзмерений <> Неопределено Тогда
		Для каждого Измерение Из МассивИзмерений Цикл
			Если НЕ КолонкиТаблицы.Найти(Измерение) = Неопределено Тогда
				ИменаИзмерений = ИменаИзмерений+?(ПустаяСтрока(ИменаИзмерений),"",",")+Измерение;	
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 
	
	Попытка
		ТаблицаРезультат.Свернуть(ИменаИзмерений,ИменаРесурсов);	
	Исключение
		ТекстСообщения = НСтр("ru='Невозможно сформировать отчет. Измените настройку.';
							  |en='Unable to generate report. Change settings.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 	
	
	Возврат ТаблицаРезультат;
	
КонецФункции // СвернутьРезультатПоГруппам()

// Процедура выполняет расчет по формулам для способа компоновки и дополняет результат 
// элементами типа группа.
// 
// Параметры:
//  СпособКомпоновки  - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  ТаблицаРезультат  - ТаблицаЗначений - Содержит данные полученные запросами по элементам данных.
// 
Процедура ДополнитьРезультатИВыполнитьРасчет(СпособКомпоновки,ТаблицаРезультат) Экспорт
	
	Ресурсы        = бит_МеханизмПолученияДанныхКлиентСервер.ПоляДляСпособаКомпоновки(СпособКомпоновки,"Ресурс");
	
	ТаблицаРезультат.Колонки.Добавить("Обработана",Новый ОписаниеТипов("Булево"));
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ЭлементыДанных.Ссылка КАК Группа,
	               |	бит_ЭлементыДанных.Кодификатор КАК Кодификатор,
	               |	бит_ЭлементыДанных.ВидГруппы,
	               |	бит_ЭлементыДанных.Коэффициент,
	               |	бит_ЭлементыДанных.Родитель,
	               |	ЛОЖЬ КАК Обработана
	               |ИЗ
	               |	Справочник.бит_ЭлементыДанных КАК бит_ЭлементыДанных
	               |ГДЕ
	               |	(бит_ЭлементыДанных.ВидГруппы = ЗНАЧЕНИЕ(Перечисление.бит_ВидыГруппДанных.Группировка)
	               |			ИЛИ бит_ЭлементыДанных.ВидГруппы = ЗНАЧЕНИЕ(Перечисление.бит_ВидыГруппДанных.Формула))
	               |	И бит_ЭлементыДанных.Владелец = &Владелец
	               |	И (НЕ бит_ЭлементыДанных.ПометкаУдаления)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Группа ИЕРАРХИЯ,
				   |    Кодификатор";
	
	Запрос.УстановитьПараметр("Владелец",СпособКомпоновки);
	
	Результат = Запрос.Выполнить();
	
	Дерево = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	// Дерево.ВыбратьСтроку();
	
	// Выполним расчеты по формулам
	СтрИзмеренияСвертки = "";
	СтрРесурсы          = "";
	СформироватьСтрокиИзмеренияРесурсы(СпособКомпоновки,Ресурсы,СтрИзмеренияСвертки,СтрРесурсы);
	
	// Сворачиваем таблицу
	ТаблицаДляФормул = ТаблицаРезультат.Скопировать();               
	ТаблицаДляФормул.Свернуть(СтрИзмеренияСвертки,СтрРесурсы);
	
	// Вычисляем формулы
	ОбойтиИерархию(Дерево,ТаблицаДляФормул,Ресурсы);
	
	// Добавим результаты расчета в ТаблицуРезультат.
	Для каждого СтрокаРезВычислений Из ТаблицаДляФормул Цикл
		
		Если СтрокаРезВычислений.ВидГруппы = Перечисления.бит_ВидыГруппДанных.Формула Тогда
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРезВычислений);
			
		ИначеЕсли СтрокаРезВычислений.ВидГруппы = Перечисления.бит_ВидыГруппДанных.Группировка Тогда	
			
			СтрокаПоиска = ТаблицаРезультат.Найти(СтрокаРезВычислений.ЭлементДанных,"ЭлементДанных");
			Если СтрокаПоиска = Неопределено Тогда
				
				НоваяСтрока = ТаблицаРезультат.Добавить();			
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРезВычислений);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// В случае, когда выводим данные по группировкам с помощью компоновки, то не суммировать по группировкам не нужно.
	Если СпособКомпоновки.НеРассчитыватьИтогиПоГруппам Тогда
		
		СтрОтбор = Новый Структура;
		СтрОтбор.Вставить("ВидГруппы",Перечисления.бит_ВидыГруппДанных.Группировка);
		
		МассивСтрок = ТаблицаРезультат.НайтиСтроки(СтрОтбор);
		
		Для каждого СтрокаРезультат Из МассивСтрок Цикл
			Для каждого ИмяРесурса Из Ресурсы Цикл
				СтрокаРезультат[ИмяРесурса+"Исходный"] = 0;
				СтрокаРезультат[ИмяРесурса]            = 0;						
			КонецЦикла;
		КонецЦикла; 
		
	КонецЕсли; 
	
	ТаблицаРезультат.Сортировать("Кодификатор, ЭлементДанных");
	
	// Дерево.ВыбратьСтроку();
	
КонецПроцедуры	

// Процедура дополняет таблицу компоновки элементами данных с видом группировки "Текст".
// 
// Параметры:
// Параметры:
//  СпособКомпоновки  - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  ТаблицаРезультат  - ТаблицаЗначений.
// 
Процедура ДополнитьТаблицуКомпоновкиТекстовымиЭлементами(СпособКомпоновки, ТаблицаРезультат) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", СпособКомпоновки);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	бит_ЭлементыДанных.Ссылка 		КАК ЭлементДанных,
	|	бит_ЭлементыДанных.Кодификатор  КАК Кодификатор,
	|	бит_ЭлементыДанных.ВидГруппы,
	|	бит_ЭлементыДанных.Коэффициент,
	|	ЛОЖЬ КАК Обработана
	|ИЗ
	|	Справочник.бит_ЭлементыДанных КАК бит_ЭлементыДанных
	|ГДЕ
	|	бит_ЭлементыДанных.ВидГруппы = ЗНАЧЕНИЕ(Перечисление.бит_ВидыГруппДанных.Текст)
	|	И (НЕ бит_ЭлементыДанных.ПометкаУдаления)
	|	И бит_ЭлементыДанных.Владелец = &Владелец
	|				   
	|	УПОРЯДОЧИТЬ ПО
	|	Кодификатор
	|";
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	
	КонецЦикла;	

КонецПроцедуры // ДополнитьТаблицуКомпоновкиТекстовымиЭлементами()

// Функция формирует имя области табличного документа.
// 
// Параметры:
//  Префикс      - Строка
//  НомерОбласти - Число
//  Постфикс     - Строка
// 
// Возвращаемое значение:
//   ИмяОбласти   - Строка
// 
Функция СформироватьИмяОбласти(Префикс,НомерОбласти,Длина,Постфикс="")  Экспорт
	
	Длина      = ?(Длина=0,9,Длина);
	СтрФормат  = "ЧЦ="+Длина+"; ЧВН=; ЧГ=";
	ИмяОбласти = Префикс+Формат(НомерОбласти,СтрФормат)+Постфикс;
	
	Возврат ИмяОбласти;
	
КонецФункции // СформироватьИмяОбласти()

// Функция инициализирует структуру настроек расшифровки произвольного отчета.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура.
// 
Функция КонструкторНастройкиРасшифровкиПроизвольногоОтчета()  Экспорт

	СтруктураНастроек = Новый Структура("Заголовок
	                                       |,ИмяОбласти
	                                       |,ЭлементДанных
										   |,НастройкаПодключения
										   |,НастройкаПулаПодключений
										   |,ВидИнформационнойБазы
										   |,ИсточникДанных
										   |,ИмяРесурса
										   |,ВидЯчейки
										   |,ВидЭлементаДанных
										   |,Формула
										   |,ФорматЧисел");
	
	

	Возврат СтруктураНастроек;
	
КонецФункции // КонструкторНастройкиРасшифровкиПроизвольногоОтчета()

// Функция формирует настройку расшифровки произвольного отчета.
// 
// Параметры:
//  СтрокаТаблицы  - СтрокаТабличнойЧасти.
// 
// Возвращаемое значение:
//   СтруктураНастроек   - Структура.
// 
Функция СформироватьНастройкуРасшифровкиПроизвольногоОтчета(СтрокаТаблицы, НастройкаПулаПодключений) Экспорт
	
	СтруктураНастроек = КонструкторНастройкиРасшифровкиПроизвольногоОтчета();	
										   
    СтруктураНастроек.Заголовок                = "";										   
	СтруктураНастроек.ИмяОбласти               = СтрокаТаблицы.Код;
	СтруктураНастроек.ЭлементДанных            = СтрокаТаблицы.ЭлементДанных;
	СтруктураНастроек.НастройкаПодключения     = СтрокаТаблицы.ЭлементДанных.НастройкаПодключения;
	СтруктураНастроек.НастройкаПулаПодключений = НастройкаПулаПодключений;
	СтруктураНастроек.ВидИнформационнойБазы= СтрокаТаблицы.ЭлементДанных.ВидИнформационнойБазы;
	СтруктураНастроек.ИсточникДанных       = СтрокаТаблицы.ЭлементДанных.ИсточникДанных;
	СтруктураНастроек.ИмяРесурса           = СтрокаТаблицы.ИмяРесурса;
	СтруктураНастроек.ВидЯчейки            = СтрокаТаблицы.ВидЯчейки;
	СтруктураНастроек.ВидЭлементаДанных    = СтрокаТаблицы.ЭлементДанных.ВидГруппы;
	СтруктураНастроек.Формула              = СтрокаТаблицы.Формула;
	СтруктураНастроек.ФорматЧисел          = СтрокаТаблицы.ФорматЧисел;

	Возврат СтруктураНастроек;
	
КонецФункции // СформироватьНастройкуРасшифровкиПроизвольногоОтчета()

#КонецОбласти

#Область ФормированиеПроизвольногоОтчета

// Функция заполняет структуру параметров из таблицы значений.
// 
// Параметры:
//  ТаблицаПараметров - ТаблицаЗначений.
//  
// Возвращаемое значение:
//   Структура
// 
Функция ЗаполнитьСтруктуруПараметровИзТаблицы(ТаблицаПараметры) Экспорт

	СтруктураПараметров = Новый Структура;
	
	Для каждого СтрокаТаблицы Из ТаблицаПараметры Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ИмяПараметра) Тогда			
			Продолжить;			
		КонецЕсли;
		
		Попытка
			НайденПараметр = СтруктураПараметров.Свойство(СтрокаТаблицы.ИмяПараметра);		
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если НЕ НайденПараметр Тогда
			Если СтрокаТаблицы.ВидПараметра = Перечисления.бит_ВидыПараметровЗапроса.Выражение Тогда
				Попытка
					// АПК:488-выкл ВычислитьВБезопасномРежиме не используется, чтобы избежать вызова ОбщийМодуль рекурсивно.
					ТекЗначение = Вычислить(СтрокаТаблицы.ЗначениеПараметра);
					// АПК:488-вкл
				Исключение  					
					ТекЗначение = Неопределено;					
				КонецПопытки;	
			Иначе
				ТекЗначение = СтрокаТаблицы.ЗначениеПараметра
			КонецЕсли; 
			СтруктураПараметров.Вставить(СтрокаТаблицы.ИмяПараметра, ТекЗначение); 			
		КонецЕсли; // Параметр еще не добавлен
	КонецЦикла;  // ТаблицаПараметры

	Возврат СтруктураПараметров;
	
КонецФункции // ЗаполнитьСтруктуруПараметровИзТаблицы()

// Процедура дополняет структуру параметров, параметрами,
// обязательными к использованию в произвольном отчете.
// 
// Параметры:
//  ТекОбъект - ОтчетОбъект.бит_ПроизвольныйОбъект, СправочникСсылка.бит_ЭкземплярыПроизвольныхОтчетов.
//  Параметры - Структура.
// 
Процедура ДобавитьОбязательныеПараметрыПроизвольногоОтчета(ТекОбъект, Параметры) Экспорт
	
	ПрочитатьНастройку = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекОбъект, "НастройкаОтчета");
	
	Если ПрочитатьНастройку И ЗначениеЗаполнено(ТекОбъект.НастройкаОтчета) Тогда
		ТипОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекОбъект.НастройкаОтчета, "ТипОтчета");	
		Если ТипОтчета = Перечисления.бит_ТипыПроизвольныхОтчетов.ОтчетностьМСФО Тогда
			// Как параметр организация передается только для отчетов МСФО, в остальных случаях можно воспользоваться отборами.
			Параметры.Вставить("Организация", ТекОбъект.Организация);
		КонецЕсли;
	КонецЕсли;
	
	// См. КонструкторПредопределенныхПараметров().
	
	Параметры.Вставить("ВалютаОтчета"   , ТекОбъект.ВалютаДокумента);
	Параметры.Вставить("КурсОтчета"     , ТекОбъект.КурсДокумента);
	Параметры.Вставить("КратностьОтчета", ТекОбъект.КратностьДокумента);
	
	КонецПериодаПрошлый 	= ДобавитьМесяц(КонецДня(ТекОбъект.ДатаОкончания), -12);
	КонецПериодаПозапрошлый = ДобавитьМесяц(КонецДня(ТекОбъект.ДатаОкончания), -24);
	
	Параметры.Вставить("КонецПериодаПрошлый"    ,	 Новый Граница(КонецПериодаПрошлый, ВидГраницы.Включая));
	Параметры.Вставить("КонецПериодаПрошлыйДата",	 КонецПериодаПрошлый);
	Параметры.Вставить("КонецПериодаПозапрошлый"    ,Новый Граница(КонецПериодаПозапрошлый, ВидГраницы.Включая));
	Параметры.Вставить("КонецПериодаПозапрошлыйДата",КонецПериодаПозапрошлый);
	Параметры.Вставить("КонецПрошлогоГода",			 Новый Граница(КонецГода(КонецПериодаПрошлый), ВидГраницы.Включая));
	Параметры.Вставить("КонецПрошлогоГодаДата",		 КонецГода(КонецПериодаПрошлый));
	Параметры.Вставить("КонецПозапрошлогоГода",		 Новый Граница(КонецГода(КонецПериодаПозапрошлый), ВидГраницы.Включая));
	Параметры.Вставить("КонецПозапрошлогоГодаДата",	 КонецГода(КонецПериодаПозапрошлый));
	
КонецПроцедуры // ДобавитьОбязательныеПараметрыПроизвольногоОтчета()

// Процедура выполняет формирование произвольного отчета.
// 
// Параметры:
//  ТекОбъект          - СправочникСсылка.бит_НастройкиПроизвольныхОтчетов.
//  ТабличныйДокумент  - ТабличныйДокумент.
//  ОтборВОтчете       - ТаблицаЗначений.
//  ТаблицаПараметры   - ТаблицаЗначений.
//  ТаблицаДанныеОтчета- ТаблицаЗначений.
//  НастройкаПулаПодключений - СправочникСсылка.бит_мпд_НастройкиПуловПодключений.
// 
Процедура СформироватьПроизвольныйОтчет(ТекОбъект, ТабличныйДокумент, ОтборВОтчете, ТаблицаПараметры,
				ТаблицаДанныеОтчета, НастройкаПулаПодключений = Неопределено) Экспорт

	НастройкаОтчета 				 = ТекОбъект.НастройкаОтчета;
	ОтборПоАналитикаПравилЗаполнения = НастройкаОтчета.УстанавливатьОтборПоАналитикеПравилЗаполнения;
	
	Если НЕ ЗначениеЗаполнено(НастройкаОтчета) Тогда
		ТабличныйДокумент.Очистить();
		ТекстСообщения = НСтр("ru='Не заполнена настройка отчета.';en='Not filled Report setting.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	СписокРеквизитовНастройки = "ТипОтчета, ХранилищеМакета, СпособКомпоновки, ОтображатьПериод";
	РеквизитыНастройки 		  = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаОтчета, СписокРеквизитовНастройки); 
	
	// Если отчет предназначен для МСФО принудительно установим дату начала.
	ТекОбъект.ДатаНачала = бит_МеханизмПолученияДанныхКлиентСервер.ОпределитьДатуНачалаДляМСФО(РеквизитыНастройки.ТипОтчета,ТекОбъект.ДатаНачала,ТекОбъект.ДатаОкончания);
	
	// Получим макет отчета
	СохраненныйМакет = РеквизитыНастройки.ХранилищеМакета.Получить();
	
	Если СохраненныйМакет = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ГраницаНач = ТекОбъект.ДатаНачала;
	ГраницаКон = Новый Граница(КонецДня(ТекОбъект.ДатаОкончания), ВидГраницы.Включая);
	
	Параметры = ЗаполнитьСтруктуруПараметровИзТаблицы(ТаблицаПараметры);
	ДобавитьОбязательныеПараметрыПроизвольногоОтчета(ТекОбъект,Параметры);
	
	СпособКомпоновки = РеквизитыНастройки.СпособКомпоновки;
	
	// Получаем результирующую таблицу с данными.
	ПоказыватьИндикатор = Не бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("НеОтображатьИндикаторКомпоновкиИсточников",
								Пользователи.ТекущийПользователь());	
								
	СтрПар = НовыеПараметрыПолучитьДанныеПоСпособуКомпоновки();
	СтрПар.Параметры                = Параметры;
	СтрПар.ОтборВОтчете             = ОтборВОтчете;
	СтрПар.ПоказыватьИндикатор      = ПоказыватьИндикатор;
	СтрПар.НастройкаПулаПодключений = НастройкаПулаПодключений;
	
	ТаблицаРезультат = ПолучитьДанныеПоИсточникам(СпособКомпоновки
	                                                                           ,ГраницаНач
																			   ,ГраницаКон
																			   ,СтрПар);
																			   
	ДополнитьРезультатИВыполнитьРасчет(СпособКомпоновки,ТаблицаРезультат);
	
	// Выполняем свертку
	МассивРесурсов  = бит_МеханизмПолученияДанныхКлиентСервер.ПоляДляСпособаКомпоновки(СпособКомпоновки,"Ресурс");
	ПоляАналитики   = Справочники.бит_НастройкиПроизвольныхОтчетов.ПолучитьПоляАналитики(НастройкаОтчета);
	АналитикиПоля	= Новый Соответствие;
	МассивИзмерений = Новый Массив;
	
	Для каждого КиЗ Из ПоляАналитики Цикл
		МассивИзмерений.Добавить(КиЗ.Ключ);
		АналитикиПоля.Вставить(КиЗ.Значение, КиЗ.Ключ);
	КонецЦикла; 
	
	ЕстьПериод = (ТаблицаРезультат.Колонки.Найти("Период")<>Неопределено);
	ЕстьПериод = ЕстьПериод И РеквизитыНастройки.ОтображатьПериод;
	
	Если ЕстьПериод Тогда
		МассивИзмерений.Добавить("Период");
	КонецЕсли; 
	
	ТаблицаРезультат = СвернутьРезультат(ТаблицаРезультат,МассивРесурсов,МассивИзмерений);
	
	// По таблице будет выполняется поиск - надо подготовиться.
	Если ТаблицаРезультат.Количество() > 1000 Тогда
	
		ТаблицаРезультат.Индексы.Очистить();
		Поля = "ЭлементДанных";
		Если НЕ ТаблицаРезультат.Колонки.Найти("Период") = Неопределено Тогда
			Поля = Поля + ", Период";
		КонецЕсли; 
		ТаблицаРезультат.Индексы.Добавить(Поля);
	КонецЕсли; 
	
	ТабличныйДокумент.Очистить();
    ТабличныйДокумент.Вывести(СохраненныйМакет);
	
	УстановитьПараметрыВДокРезультат(ТекОбъект,ТабличныйДокумент,ОтборВОтчете, ТаблицаПараметры);
	
	// Заполним значения
	ПоказателиПроизвольныхОтчетов = Справочники.бит_НастройкиПроизвольныхОтчетов.ПолучитьПоказателиВида(НастройкаОтчета, 
										Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Значение);
	ТаблицаДанныеОтчета.Очистить();
	
	Для каждого ПоказательОтчета Из ПоказателиПроизвольныхОтчетов Цикл
		
		// Проверим на тип, т.к. далее будем обращаться к свойствам.
		Если НЕ ТипЗнч(ПоказательОтчета.ЭлементДанных) = Тип("СправочникСсылка.бит_ЭлементыДанных") Тогда
			Продолжить;
		КонецЕсли; 
		
		Фильтр = Новый Структура("ЭлементДанных",ПоказательОтчета.ЭлементДанных);
		Если ОтборПоАналитикаПравилЗаполнения Тогда
			
			// дополнительный отбор по аналитике правил заполнения
			Если НЕ ТаблицаРезультат.Колонки.Найти("Период") = Неопределено Тогда
				Фильтр.Вставить("Период", ПоказательОтчета.ПериодДанных);
			КонецЕсли; 
			
			Если ТипЗнч(ПоказательОтчета.ЗначенияПоУмолчанию) = Тип("ТаблицаЗначений") Тогда
				
				Для каждого СтрокаТаблицы Из ПоказательОтчета.ЗначенияПоУмолчанию Цикл
					ИмяПоля = АналитикиПоля[СтрокаТаблицы.ИмяАналитики];
					
					Если НЕ ИмяПоля = Неопределено И НЕ ТаблицаРезультат.Колонки.Найти(ИмяПоля) = Неопределено Тогда
						Фильтр.Вставить(ИмяПоля, СтрокаТаблицы.ЗначениеАналитики);
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
		
		СтрокиРезультат  = ТаблицаРезультат.НайтиСтроки(Фильтр);
		КолонкиРезультат = ТаблицаРезультат.Колонки;
		
		ИтогЗначениеПоказателя = 0;
		Для каждого СтрокаРезультат Из СтрокиРезультат Цикл
			
			ЗначениеКУстановке = СтрокаРезультат[ПоказательОтчета.ИмяРесурса];
			Если ТипЗнч(ЗначениеКУстановке) <> Тип("Число") Тогда
				ЗначениеКУстановке = 0;
			КонецЕсли; 
			
			ИтогЗначениеПоказателя = ИтогЗначениеПоказателя + ЗначениеКУстановке;
			
			СтрокаДанныеОтчета = ТаблицаДанныеОтчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДанныеОтчета, ПоказательОтчета);
			
			СтрокаДанныеОтчета.ЗначениеПоказателя   = ЗначениеКУстановке;
			СтрокаДанныеОтчета.ИД                   = Строка(Новый УникальныйИдентификатор);
			
			Если ЕстьПериод Тогда
				СтрокаДанныеОтчета.ПериодДанных = СтрокаРезультат.Период;
			КонецЕсли; 
			
			// Заполним аналитику
			Для каждого КиЗ Из ПоляАналитики Цикл
				Если НЕ КолонкиРезультат.Найти(КиЗ.Ключ) = Неопределено Тогда
					СтрокаДанныеОтчета[КиЗ.Значение] = СтрокаРезультат[КиЗ.Ключ];
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
		
		УстановитьЗначениеВТабличныйДокумент(ТабличныйДокумент, ПоказательОтчета.ИмяОбласти, ИтогЗначениеПоказателя);
	КонецЦикла;  // По таблице правил
	
	// Расчет формул, заданных в настройках произвольного отчета.
	ВыполнитьРасчет(ТекОбъект.НастройкаОтчета, ТабличныйДокумент, ТаблицаДанныеОтчета);
	УстановитьФорматВывода(НастройкаОтчета,ТабличныйДокумент,ТекОбъект.ФорматЧисел, ТекОбъект.Язык);
	
	Если ЕстьПериод Тогда
		ТаблицаДанныеОтчета.Сортировать("ПериодДанных");
	КонецЕсли; 
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
КонецПроцедуры // СформироватьОтчет()

// Процедура выполняет расчет значений ячеек, рассчитываемых по формулам.
// 
// Параметры:
//  ТабличныйДокумент  - ТабличныйДокумент.
// 
Процедура ВыполнитьРасчет(НастройкаОтчета,ТабличныйДокумент,ТаблицаДанныеОтчета) Экспорт
	
	// Очистим аргументы формулы
	СтрОтбор = Новый Структура;
	СтрОтбор.Вставить("ВидЯчейки",Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Формула);
	
	Формулы = ТаблицаДанныеОтчета.НайтиСтроки(СтрОтбор);
	
	Для каждого СтрокаАргумент Из Формулы Цикл
		ТаблицаДанныеОтчета.Удалить(СтрокаАргумент);
	КонецЦикла; 
	
	НастройкиАналитик  = Справочники.бит_НастройкиПроизвольныхОтчетов.ПолучитьНастройкуАналитик(НастройкаОтчета);
	
	Если НастройкаОтчета.ОтображатьПериод Тогда
		
	  СтрНастроек = бит_МеханизмДопИзмерений.КонструкторНастроекАналитик();
	  СтрНастроек.ТипЗначения = Новый ОписаниеТипов("Дата");
	  
	  НастройкиАналитик.Вставить("ПериодДанных", СтрНастроек);
	
	КонецЕсли; 
	
	// Отбираем из настроек заполнения формулы
	Формулы = Справочники.бит_НастройкиПроизвольныхОтчетов.ПолучитьПоказателиВида(НастройкаОтчета,"Формула");
	
	ПравилаЗаполнения = Справочники.бит_НастройкиПроизвольныхОтчетов.ПолучитьПоказателиОтчета(НастройкаОтчета);
	
	// Выполним расчеты по формулам
	Для каждого СтрокаПравил Из Формулы Цикл
		
		Результат = ВыполнитьРасчетПоФормуле(СтрокаПравил,ПравилаЗаполнения,ТаблицаДанныеОтчета,НастройкиАналитик);
		УстановитьЗначениеВТабличныйДокумент(ТабличныйДокумент,СтрокаПравил.ИмяОбласти,Результат);
		
	КонецЦикла; // По таблице правил 

КонецПроцедуры // ВыполнитьРасчет()

// Процедура устанавливает значение в область табличного документа.
// 
// Параметры:
//  ТабличныйДокумент  - ТабличныйДокумент.
//  ИмяОбласти         - Строка.
//  Значение           - Число.
// 
Процедура УстановитьЗначениеВТабличныйДокумент(ТабличныйДокумент,ИмяОбласти,Значение,Прибавлять = Ложь) Экспорт

	ОблМакета = ПолучитьОбластьЯчеек(ТабличныйДокумент, ИмяОбласти);
	Если ОблМакета = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Не удалось найти область макета по имени: ""%1"".';
						 	  |en = 'Could not find layout area by name: ""%1"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяОбласти);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	Иначе
		
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			
			// Для вывода ошибок.
			ОблМакета.ТипЗначения = Новый ОписаниеТипов("Строка");
			ОблМакета.Значение = Значение;
			ОблМакета.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
			ОблМакета.ОтметкаНезаполненного = Истина;
			ПримечаниеТекст = ОблМакета.Примечание.Текст + " " + НСтр("ru='!Ошибка [%1]!';en='!Error [%1]!'");
			ОблМакета.Примечание.Текст = СтрШаблон(ПримечаниеТекст, ИмяОбласти);
			ОблМакета.Примечание.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
					
		ИначеЕсли ОблМакета.СодержитЗначение <> Неопределено Тогда
			
			Если ОблМакета.СодержитЗначение Тогда				
				Если Прибавлять Тогда					
					// Если макет копировался из EXCEL,то бывают ошибки, сбросим в ноль.
					Если ТипЗнч(ОблМакета.Значение) <> Тип("Число") Тогда					
						ОблМакета.Значение = 0;					
					КонецЕсли; 					
					ОблМакета.Значение = ОблМакета.Значение+Значение;	
				Иначе
					ОблМакета.Значение = Значение;					
				КонецЕсли;					
			Иначе	
				ОблМакета.Текст = Значение; 
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 

КонецПроцедуры // УстановитьЗначениеВТабличныйДокумент()

// Процедура устанавливает формат чисел в табличном документе.
// 
// Параметры:
//  ТабличныйДокумент  - ТабличныйДокумент.
// 
Процедура УстановитьФорматВывода(НастройкаОтчета, ТабличныйДокумент, ТекущийФормат, ТекущийЯзык) Экспорт
	
	ПравилаЗаполнения = Справочники.бит_НастройкиПроизвольныхОтчетов.ПолучитьПоказателиОтчета(НастройкаОтчета);	
	
	Для каждого СтрокаПравил Из ПравилаЗаполнения Цикл
		
		СтрФормат = ОпределитьФорматПоСтрокеПравил(СтрокаПравил,ТекущийФормат,ТекущийЯзык);
		
		ОблМакета = ПолучитьОбластьЯчеек(ТабличныйДокумент,СтрокаПравил.ИмяОбласти);
		Если ОблМакета <> Неопределено Тогда
			
			ОблМакета.Формат = СтрФормат;
			
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры // УстановитьФорматВывода()

// Функция определяет формат для строки правил. Первый приоритет настройка формата из строки,
// далее из шапки, если формат не задан, то Число(15,2).
// 
// Параметры:
//  СтрокаПравил  - СтрокаТабличнойЧасти.ПравилаЗаполнения.
//  ФорматЧисел   - Строка - Формат по -умолчанию.
// 
// Возвращаемое значение:
//   СтрФормат   - Строка.
// 
Функция ОпределитьФорматПоСтрокеПравил(СтрокаПравил,ФорматЧисел,Язык) Экспорт
	
	// Определим, какую настройку формата применять.
	Если НЕ ПустаяСтрока(СтрокаПравил.ФорматЧисел) Тогда
		СтрФормат = СтрокаПравил.ФорматЧисел;
	Иначе	
		Если НЕ ПустаяСтрока(ФорматЧисел) Тогда
			СтрФормат = ФорматЧисел;
		Иначе	
			СтрФормат = "ЧЦ=15; ЧДЦ=2";
		КонецЕсли; 
	КонецЕсли; 
	
	// Если язык не установлен установки из шапки отчета.
	Если Найти(СтрокаПравил.ФорматЧисел,"Л=")=0 Тогда
		КодСтраны = Справочники.бит_Языки.ПолучитьКодЯзыкСтрана(Язык);
		СтрФормат = "Л="+КодСтраны+";"+СтрФормат;
	КонецЕсли; 
	
	Возврат СтрФормат;
	
КонецФункции // ОпределитьФорматПоСтрокеПравил()

// Процедура - фрагмент процедуры "СформироватьОтчет"
// в части заполнения параметров.  
// Применяется для заполнения параметров пустого отчета.
// 
Процедура УстановитьПараметрыВДокРезультат(ТекОбъект, ТабличныйДокумент, ОтборВОтчете, ПараметрыЗапроса) Экспорт 
	
	Язык            = ТекОбъект.Язык;
	ФорматЧисел     = ТекОбъект.ФорматЧисел;
	ДатаНачала      = ТекОбъект.ДатаНачала;
	ДатаОкончания   = ТекОбъект.ДатаОкончания;
	Организация     = ТекОбъект.Организация;
	НастройкаОтчета = ТекОбъект.НастройкаОтчета;	
	
	КодЯзыка = Справочники.бит_Языки.ПолучитьКодЯзыка(Язык);	
	
	// Подготовим структуру параметров отчета
	ПараметрыПодстановки 					   = НовыеСтандартныеПараметрыМСФО();
	ПараметрыПодстановки.ДатаНачала 		   = ДатаНачала;
	ПараметрыПодстановки.ДатаОкончания         = ДатаОкончания;
	ПараметрыПодстановки.ДатаНачалаФормат      = ФорматДеньМесяцПрописьюГод(ДатаНачала, КодЯзыка);
	ПараметрыПодстановки.ДатаОкончанияФормат   = ФорматДеньМесяцПрописьюГод(ДатаОкончания, КодЯзыка);
	ПараметрыПодстановки.ДеньНач               = ФорматДень(ДатаНачала, КодЯзыка);
	ПараметрыПодстановки.ДеньКон               = ФорматДень(ДатаОкончания, КодЯзыка);
	ПараметрыПодстановки.МесяцНач              = ФорматМесяцПрописью(ДатаНачала, КодЯзыка);
	ПараметрыПодстановки.МесяцКон              = ФорматМесяцПрописью(ДатаОкончания, КодЯзыка);
	ПараметрыПодстановки.ГодНач                = ФорматГод(ДатаНачала, КодЯзыка);
	ПараметрыПодстановки.ГодКон                = ФорматГод(ДатаОкончания, КодЯзыка);
	ПараметрыПодстановки.ОписаниеПериода       = ОписаниеПериода(ДатаНачала,ДатаОкончания);
	ПараметрыПодстановки.ОписаниеПериодаМСФО   = ОписаниеПериодаМСФО(ДатаОкончания,Язык);
	ПараметрыПодстановки.КонецПрошлогоГода	   = ФорматДеньМесяцПрописьюГод(КонецГода(ДобавитьМесяц(ДатаОкончания, -12)), КодЯзыка); 
	ПараметрыПодстановки.КонецПозапрошлогоГода = ФорматДеньМесяцПрописьюГод(КонецГода(ДобавитьМесяц(ДатаОкончания, -24)), КодЯзыка);
	ПараметрыПодстановки.ИнформационнаяБаза    = СтрокаСоединенияИнформационнойБазы();
	ПараметрыПодстановки.ДатаВремяФормирования = Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
	ПараметрыПодстановки.Пользователь		   = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(Организация) <> Тип("СправочникСсылка.Организации") Тогда
		ПараметрыПодстановки.КонсолидированныйОтчет = НСтр("ru='Консолидированный';en='Consolidated'" + " ", КодЯзыка);
	КонецЕсли;	
		
	Для каждого СтрокаОтбор Из ОтборВОтчете Цикл
		ПараметрыПодстановки.Вставить(СтрокаОтбор.Имя,СтрокаОтбор.Значение);
		ПараметрыПодстановки.Вставить(СтрокаОтбор.Имя+"_ВидСравнения",СтрокаОтбор.ВидСравнения);			 
	КонецЦикла; 
	
	Для каждого СтрокаТаблицы Из ПараметрыЗапроса Цикл
		ПараметрыПодстановки.Вставить(СтрокаТаблицы.ИмяПараметра,СтрокаТаблицы.ЗначениеПараметра);
	КонецЦикла; 
		
	Для каждого ТекущаяСтрока Из НастройкаОтчета.Параметры Цикл
		Если ТекущаяСтрока.ВидПараметра = Перечисления.бит_ВидыПараметровПроизвольныхОтчетов.ТекстНаРазныхЯзыках 
		 ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВидПараметра) Тогда
			
			ПараметрыПодстановки.Вставить(ТекущаяСтрока.Параметр, НСтр(ТекущаяСтрока.Значение, КодЯзыка));
			
		КонецЕсли; 
	КонецЦикла;
	
	// Обработаем шаблоны	
	Шаблоны = Справочники.бит_НастройкиПроизвольныхОтчетов.ПолучитьПоказателиВида(НастройкаОтчета,"Шаблон");
	
	Для каждого СтрокаШаблон Из Шаблоны Цикл
		
		ИмяОбласти   = СтрокаШаблон.ИмяОбласти;
		ОблМакета    = ПолучитьОбластьЯчеек(ТабличныйДокумент,ИмяОбласти,Истина);
		Если ОблМакета = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
        ТекстШаблона = ОблМакета.Текст;
		
		МассивПодстановок = Подстановки(ТекстШаблона);
		
		Для Каждого ТекПодстановка Из МассивПодстановок Цикл
			Попытка
				Если ПараметрыПодстановки.Свойство(ТекПодстановка) Тогда
					Продолжить;
				КонецЕсли;
			Исключение
				ТекстСообщения = НСтр("ru = 'Обработка не требуется.'") 
			КонецПопытки;
			
			ТекЗначениеПодстановки = "";
			Попытка
				// АПК:487-выкл ВыполнитьВБезопасномРежиме не используется, т.к. выполняется безопасный код.
				Выполнить("ТекЗначениеПодстановки = " + ТекПодстановка + ";");
				// АПК:487-вкл
			Исключение
				Продолжить;
			КонецПопытки;
			
			ТипЗначения = ТипЗнч(ТекЗначениеПодстановки);
			Если ТипЗначения = Тип("Число") 
				ИЛИ ТипЗначения = Тип("Дата") 
				ИЛИ ТипЗначения = Тип("Булево") Тогда
				
				СтрФормат = ОпределитьФорматПоСтрокеПравил(СтрокаШаблон, ФорматЧисел, Язык); 
				СтрПредставление = Формат(ТекЗначениеПодстановки, СтрФормат);
			Иначе
				СтрПредставление = Строка(ТекЗначениеПодстановки);
			КонецЕсли; 
			
			ТекстШаблона = СтрЗаменить(ТекстШаблона, "[" + ТекПодстановка + "]", СтрПредставление);
			
		КонецЦикла;
		
		Для каждого КлючИЗначение Из ПараметрыПодстановки Цикл
			
			ТипЗначения = ТипЗнч(КлючИЗначение.Значение);
			Если ТипЗначения = Тип("Число") 
				 ИЛИ ТипЗначения = Тип("Дата") 
				 ИЛИ ТипЗначения = Тип("Булево") Тогда
				 
				СтрФормат = ОпределитьФорматПоСтрокеПравил(СтрокаШаблон, ФорматЧисел, Язык); 
				СтрПредставление = Формат(КлючИЗначение.Значение,СтрФормат);
			Иначе
				СтрПредставление = Строка(КлючИЗначение.Значение);
			КонецЕсли; 
			ТекстШаблона = СтрЗаменить(ТекстШаблона,"["+КлючИЗначение.Ключ+"]",СтрПредставление);
			
			
		КонецЦикла; // По параметрам
		ОблМакета.Текст  = ТекстШаблона;
		
	КонецЦикла; // По шаблонам
	
КонецПроцедуры

// Процедура заполняет строку таблицы данных произвольного отчета значениями по-умолчанию.
// 
// Параметры:
//  ТекущаяСтрока
//  ИмяОбласти
//  ТаблицаДанныеОтчета
//  НастройкаОтчета
//  ФорматЧисел
//  Язык
// 
Процедура ЗаполнитьНовуюСтрокуТаблицыДанных(ТекущаяСтрока
	                                         ,ИмяОбласти
											 ,ТаблицаДанныеОтчета
											 ,НастройкаОтчета
											 ,ФорматЧисел
											 ,Язык) Экспорт

	ТекущаяСтрока.ИД = Строка(Новый  УникальныйИдентификатор);					
	
	СписокСвойств = "ПоказательОтчета, ВидЯчейки, ФорматЧисел, КоличественныйУчет, ИмяОбласти"; 
	
	СтрОтбор    = Новый Структура("ИмяОбласти", ИмяОбласти);
	МассивСтрок = ТаблицаДанныеОтчета.НайтиСтроки(СтрОтбор);
		
	Если МассивСтрок.Количество() > 0 Тогда
		СтрокаЭталон = МассивСтрок[0];
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаЭталон, СписокСвойств);
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиПроизвольныхОтчетов.Код КАК ИмяОбласти,
		|	ПоказателиПроизвольныхОтчетов.ВидЯчейки КАК ВидЯчейки,
		|	ПоказателиПроизвольныхОтчетов.Ссылка КАК ПоказательОтчета,
		|	ПоказателиПроизвольныхОтчетов.ФорматЧисел КАК ФорматЧисел,
		|	ПоказателиПроизвольныхОтчетов.КоличественныйУчет КАК КоличественныйУчет
		|ИЗ
		|	Справочник.бит_ПоказателиПроизвольныхОтчетов КАК ПоказателиПроизвольныхОтчетов
		|ГДЕ
		|	ПоказателиПроизвольныхОтчетов.Код = &Код
		|	И ПоказателиПроизвольныхОтчетов.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", НастройкаОтчета);
		Запрос.УстановитьПараметр("Код", ИмяОбласти);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка		     = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка, СписокСвойств);
			ТекущаяСтрока.ФорматЧисел = ОпределитьФорматПоСтрокеПравил(Выборка, ФорматЧисел, Язык);
		КонецЕсли; 
	КонецЕсли; 
	
	// Заполним аналитики по умолчанию в строке
	ЗаполнитьЗначенияПоУмолчаниюСтрокиТаблицыДанных(ТекущаяСтрока); 		

КонецПроцедуры // ЗаполнитьНовуюСтрокуТаблицыДанных()

#КонецОбласти

#Область РаботаСПолемТаблицаОтбор

// Функция возвращает список доступных видов сравнения в зависимости от типа значения.
// 
// Параметры:
//  ИсточникТипов - ОписаниеТипов ИЛИ ДанныеФормыЭлементКоллекции.
// 
Функция СписокВыбораВидаСравнения(ИсточникТипов) Экспорт
	
	ЕстьПримитивные = Ложь;
	ЕстьСтрока      = Ложь;
	ЕстьСсылочные   = Ложь;
	ЕстьИерархия    = Ложь;
	
	// Определение типов, возможных в данной строке.
	Примитивные = Новый Массив;
	Примитивные.Добавить(Тип("Строка"));
	Примитивные.Добавить(Тип("Число"));
	Примитивные.Добавить(Тип("Дата"));
	Примитивные.Добавить(Тип("Булево"));
	Примитивные.Добавить(Тип("ХранилищеЗначения"));
	
	ОписаниеПримитивные = Новый ОписаниеТипов(Примитивные);
	
	Если ТипЗнч(ИсточникТипов) = Тип("ОписаниеТипов") Тогда
		МассивТипов = ИсточникТипов.Типы();
		ТолькоБулево = ?(ИсточникТипов = Новый ОписаниеТипов("Булево"), Истина, Ложь);
	ИначеЕсли НЕ ИсточникТипов = Неопределено Тогда
		МассивТипов = ИсточникТипов.ТипЗначения.Типы();
	    ТолькоБулево = ?(ИсточникТипов.ТипЗначения = Новый ОписаниеТипов("Булево"), Истина, Ложь);		
	Иначе
		МассивТипов = Новый Массив;
	КонецЕсли;
	
	Для каждого ТекТип Из МассивТипов Цикл
		
		Если ТекТип = Тип("Строка") Тогда 			
			ЕстьСтрока = Истина; 			
		КонецЕсли; 
		
		Если ОписаниеПримитивные.СодержитТип(ТекТип) Тогда			
			ЕстьПримитивные = Истина;  			
		Иначе	                         			
			ЕстьСсылочные   = Истина;
			Попытка 		
				ОбъектМета = Метаданные.НайтиПоТипу(ТекТип);
				Если Метаданные.ПланыСчетов.Содержит(ОбъектМета) ИЛИ ОбъектМета.Иерархический Тогда
				 	ЕстьИерархия = Истина;
				КонецЕсли;
			Исключение 	
				ТекстСообщения = НСтр("ru = 'Обработка не требуется.'") 
			КонецПопытки;
		КонецЕсли; 
		
	КонецЦикла; 
	
	// Формирование списка доступных видов сравнения.
	СписокВидов = Новый СписокЗначений;
	СписокВидов.Добавить(ВидСравнения.Равно);
	СписокВидов.Добавить(ВидСравнения.НеРавно);
	
	Если НЕ ТолькоБулево Тогда
		
		СписокВидов.Добавить(ВидСравнения.ВСписке);
		СписокВидов.Добавить(ВидСравнения.НеВСписке);
		
	КонецЕсли; 
	
	Если ЕстьИерархия Тогда
		СписокВидов.Добавить(ВидСравнения.ВИерархии);
		СписокВидов.Добавить(ВидСравнения.НеВИерархии);
		СписокВидов.Добавить(ВидСравнения.ВСпискеПоИерархии);
		СписокВидов.Добавить(ВидСравнения.НеВСпискеПоИерархии);
		
	КонецЕсли; 	
	
	Если ЕстьПримитивные И НЕ ТолькоБулево Тогда
		
		СписокВидов.Добавить(ВидСравнения.Больше);
		СписокВидов.Добавить(ВидСравнения.БольшеИлиРавно);
		СписокВидов.Добавить(ВидСравнения.Интервал);
		СписокВидов.Добавить(ВидСравнения.ИнтервалВключаяГраницы);
		СписокВидов.Добавить(ВидСравнения.ИнтервалВключаяНачало);
		СписокВидов.Добавить(ВидСравнения.ИнтервалВключаяОкончание);
		СписокВидов.Добавить(ВидСравнения.Меньше);
		СписокВидов.Добавить(ВидСравнения.МеньшеИлиРавно);
		
	КонецЕсли; 
	
	Если ЕстьСтрока Тогда
		
		СписокВидов.Добавить(ВидСравнения.Содержит);
		СписокВидов.Добавить(ВидСравнения.НеСодержит);
		
	КонецЕсли; 
	
	Возврат СписокВидов;
	
КонецФункции

// Процедура обрабатывает изменение вида сравнения в таблице отборов.
// 
// Параметры:
//  ТекущийСтрока - СтрокаТабличнойЧасти.
// 
Процедура ИзменениеВидаСравнения(ТекущаяСтрока)  Экспорт

	СписокДоступен = СписокДоступен(ТекущаяСтрока.ВидСравнения);
	
	Если СписокДоступен Тогда
		ТипЗначения = ТипЗнч(ТекущаяСтрока.Значение);			
		Если ТипЗначения <> Тип("СписокЗначений") Тогда
			ЗначениеСписком = Новый СписокЗначений;
			ЗначениеСписком.Добавить(ТекущаяСтрока.Значение);
			ЗначениеСписком.ТипЗначения = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗначения));
			ТекущаяСтрока.Значение = ЗначениеСписком;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущаяСтрока.Значение) = Тип("СписокЗначений") Тогда	
		Значение = ТекущаяСтрока.Значение; 
		СписокСтарый = ТекущаяСтрока.Значение;
		Если СписокСтарый.Количество() > 0 Тогда // Проверка на заполненость значения не подходит.
			Значение = ТекущаяСтрока.Значение[0].Значение;
		Иначе
			Если ТекущаяСтрока.Свойство("ЗначениеПараметра") И ТекущаяСтрока.Свойство("ДоступныеТипы") Тогда
				Значение = ТекущаяСтрока.ДоступныеТипы.ПривестиЗначение(ТекущаяСтрока.ЗначениеПараметра);
			ИначеЕсли ТекущаяСтрока.Свойство("Значение") И ТекущаяСтрока.Свойство("ТипЗначения") Тогда
				Значение = ТекущаяСтрока.ТипЗначения.ПривестиЗначение(ТекущаяСтрока.Значение);
			Иначе
				Значение = Неопределено;
			КонецЕсли;
		КонецЕсли;
		ТекущаяСтрока.Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Значение" табличного поля "ОтборВОтчете".
// 
// Параметры:
//  ТекущийСтрока          - СтрокаТабличнойЧасти.
// 
Процедура ОтборВОтчетеЗначениеПриИзменении(ТекущаяСтрока) Экспорт
	
	Если  ТипЗнч(ТекущаяСтрока.Значение) = Тип("СписокЗначений") И НЕ СписокДоступен(ТекущаяСтрока.ВидСравнения)  Тогда
		
		ТекущаяСтрока.Значение = Неопределено;	
		ТекстСообщения = НСтр("ru='Для вида сравнения ""%1"" список недоступен.';
							  |en='List is not available for comparison type ""%1""'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущаяСтрока.ВидСравнения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли; 
	
	Если  НЕ ТипЗнч(ТекущаяСтрока.Значение) = Тип("СписокЗначений") И СписокДоступен(ТекущаяСтрока.ВидСравнения)  Тогда
		
		ТекущаяСтрока.Значение = Новый СписокЗначений();	
		Возврат;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Значение) Тогда
		ТекущаяСтрока.Использование = Истина;
	КонецЕсли; 
	
	
КонецПроцедуры // ОтборВОтчетеЗначениеПриИзменении()

// Процедура устанавливает УсловноеОформление для полей Значение,ЗначениеС,ЗначениеПо таблицы отбор.
// 
// Параметры:
//  УсловноеОформление      - УсловноеОформлениеКомпоновкиДанных.
//  ИмяТаблицы              - Строка (По умолчанию = "ТаблицаОтбор").
//  ПредставлениеОформления - Строка.
// 
Процедура УстановитьОформлениеТаблицыОтбор(УсловноеОформление, ИмяТаблицы = "ТаблицаОтбор", ПредставлениеОформления = "ОформлениеТаблицаОтбор") Экспорт
		
	// Очистка элементов представления
	бит_РаботаСДиалогамиСервер.УдалитьЭлементыОформленияПоПредставлению(ПредставлениеОформления, УсловноеОформление);
	
	ЦветНеопределено       = ЦветаСтиля.бит_ЦветНедоступногоПоля;	
	ЦветТекстаНеопределено = ЦветаСтиля.бит_ТекстНедоступнойНадписи;
	
	// Запрет редактировать значение если вид сравнения предполагает использование интервала.
	МассивПолей = Новый Массив;
	МассивПолей.Добавить(ИмяТаблицы + "Значение");
	
	СписокВидовСравнения = Новый СписокЗначений;
	СписокВидовСравнения.Добавить(ВидСравнения.Интервал);
	СписокВидовСравнения.Добавить(ВидСравнения.ИнтервалВключаяГраницы);
	СписокВидовСравнения.Добавить(ВидСравнения.ИнтервалВключаяНачало);
	СписокВидовСравнения.Добавить(ВидСравнения.ИнтервалВключаяОкончание);
	
	СтрУсловия = Новый Структура;
	СтрУсловия.Вставить("УсловиеЛевое" , ИмяТаблицы + ".ВидСравнения");	
	СтрУсловия.Вставить("УсловиеПравое", СписокВидовСравнения);
	СтрУсловия.Вставить("ВидСравнения" , ВидСравненияКомпоновкиДанных.ВСписке);
	
	
	СтрОформления = Новый Структура;
	СтрОформления.Вставить("Видимость", Ложь);
	
	СтруктураУО = Новый Структура("СтруктураОформления, СтруктураУсловия, МассивОформляемыхПолей",
	СтрОформления, СтрУсловия, МассивПолей);    								  
	бит_РаботаСДиалогамиСервер.ДобавитьЭлементУсловногоОформления(УсловноеОформление, ПредставлениеОформления, СтруктураУО);				
	
	// Запрет редактировать значенияС, значениеПо если вид сравнения не предполагает использование интервала.
	МассивПолей = Новый Массив;
	МассивПолей.Добавить(ИмяТаблицы + "ЗначениеС");
	МассивПолей.Добавить(ИмяТаблицы + "ЗначениеПо");
	
	СписокВидовСравнения = Новый СписокЗначений;
	СписокВидовСравнения.Добавить(ВидСравнения.Больше);
	СписокВидовСравнения.Добавить(ВидСравнения.БольшеИлиРавно);
	СписокВидовСравнения.Добавить(ВидСравнения.ВИерархии);
	СписокВидовСравнения.Добавить(ВидСравнения.ВСписке);
	СписокВидовСравнения.Добавить(ВидСравнения.ВСпискеПоИерархии);
	СписокВидовСравнения.Добавить(ВидСравнения.Меньше);
	СписокВидовСравнения.Добавить(ВидСравнения.МеньшеИлиРавно);
	СписокВидовСравнения.Добавить(ВидСравнения.НеВИерархии);
	СписокВидовСравнения.Добавить(ВидСравнения.НеВСписке);
	СписокВидовСравнения.Добавить(ВидСравнения.НеВСпискеПоИерархии);
	СписокВидовСравнения.Добавить(ВидСравнения.НеРавно);
	СписокВидовСравнения.Добавить(ВидСравнения.НеСодержит);
	СписокВидовСравнения.Добавить(ВидСравнения.Равно);
	СписокВидовСравнения.Добавить(ВидСравнения.Содержит);
	
	СтрУсловия = Новый Структура;
	СтрУсловия.Вставить("УсловиеЛевое" , ИмяТаблицы + ".ВидСравнения");	
	СтрУсловия.Вставить("УсловиеПравое", СписокВидовСравнения);
	СтрУсловия.Вставить("ВидСравнения" , ВидСравненияКомпоновкиДанных.ВСписке);
	
	СтрОформления = Новый Структура;
	СтрОформления.Вставить("Видимость", Ложь);
	
	СтруктураУО = Новый Структура("СтруктураОформления, СтруктураУсловия, МассивОформляемыхПолей",
	СтрОформления, СтрУсловия, МассивПолей);    								  
	бит_РаботаСДиалогамиСервер.ДобавитьЭлементУсловногоОформления(УсловноеОформление, ПредставлениеОформления, СтруктураУО);				
	
	// Вывод текста периодичности
	СписокПериодичность = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодичности();
	
	Для каждого Элемент Из СписокПериодичность Цикл
		
		// Новый элемент условного оформления
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = ПредставлениеОформления;
		ЭлементУО.Использование = Истина;
		
		УсловиеУО 				 = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".ЭтоПериодичность");
		УсловиеУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		УсловиеУО.ПравоеЗначение = Истина;
		
		УсловиеУО 				 = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".Значение");
		УсловиеУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		УсловиеУО.ПравоеЗначение = Элемент.Значение;
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Элемент.Представление);		
		ОформляемоеПоле 	 = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "Значение");
		
	КонецЦикла; 
	
КонецПроцедуры // УстановитьОформлениеТаблицыОтбор()

#КонецОбласти

// Функция создает массив параметров имен "предопределенных" параметров, 
// которые заполняются при вызове механизма из кода и не должны появляться в списке параметров источника.
// 
// Возвращаемое значение:
//   ПредопределенныеПараметры   - Массив.
// 
Функция КонструкторПредопределенныхПараметров() Экспорт
	
	ПредопределенныеПараметры = Новый Массив;
	ПредопределенныеПараметры.Добавить("НачалоПериода");
	ПредопределенныеПараметры.Добавить("КонецПериода");
	ПредопределенныеПараметры.Добавить("КонецПериодаДата");
	ПредопределенныеПараметры.Добавить("ТекущаяДата");
	ПредопределенныеПараметры.Добавить("ТекущаяДатаСеанса");
	ПредопределенныеПараметры.Добавить("МоментВремени");
	ПредопределенныеПараметры.Добавить("ВалютаОтчета");
	ПредопределенныеПараметры.Добавить("КурсОтчета");
	ПредопределенныеПараметры.Добавить("КратностьОтчета");
	ПредопределенныеПараметры.Добавить("КонецПериодаПрошлый");
	ПредопределенныеПараметры.Добавить("КонецПериодаПрошлыйДата");
	ПредопределенныеПараметры.Добавить("КонецПрошлогоГода");
	ПредопределенныеПараметры.Добавить("КонецПрошлогоГодаДата");
	ПредопределенныеПараметры.Добавить("КонецПозапрошлогоГода");
	ПредопределенныеПараметры.Добавить("КонецПозапрошлогоГодаДата");

	Возврат ПредопределенныеПараметры;
	
КонецФункции

// Формирует текстовое представление отбора построителя отчета.
// 
// Параметры:
// ПостроительОтчетаОтбор - Отбор.
// 
// ВозвращаемоеЗначение:
// ПредставлениеОтборы - Строка.
// 
Функция СформироватьТекстНастроек(ПостроительОтчетаОтбор)   Экспорт
	// Отборы
	ПредставлениеОтборы = "";
	
	Для каждого Отбор Из ПостроительОтчетаОтбор Цикл
		
		Если ТипЗнч(Отбор) = Тип("Структура") Тогда		
			Выполнять = Отбор.Использование И Отбор.ПутьКДанным <> "Периодичность";			
		Иначе		
			Выполнять = Отбор.Использование И Отбор.Имя <> "Периодичность";			
		КонецЕсли; 
		
		Если Выполнять Тогда
			
			// АПК:1297-выкл Текст построителя.
			ПредставлениеОтборы = ПредставлениеОтборы +?(ПустаяСтрока(ПредставлениеОтборы), "", " ")+ Отбор.Представление + " ";			
			Если Отбор.ВидСравнения = ВидСравнения.Интервал Тогда				
				ПредставлениеОтборы = СтрШаблон("%1 > %2 И < %3", ПредставлениеОтборы, Отбор.ЗначениеС, Отбор.ЗначениеПо);								
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы Тогда				
				ПредставлениеОтборы = СтрШаблон("%1 >= %2 И <= %3", ПредставлениеОтборы, Отбор.ЗначениеС, Отбор.ЗначениеПо);								
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ИнтервалВключаяНачало Тогда				
				ПредставлениеОтборы = СтрШаблон("%1 >= %2 И < %3", ПредставлениеОтборы, Отбор.ЗначениеС, Отбор.ЗначениеПо);								
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ИнтервалВключаяОкончание Тогда				
				ПредставлениеОтборы = СтрШаблон("%1 > %2 И <= %3", ПредставлениеОтборы, Отбор.ЗначениеС, Отбор.ЗначениеПо);				
			ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ВСписке ИЛИ Отбор.ВидСравнения = ВидСравнения.ВСпискеПоИерархии 
				ИЛИ Отбор.ВидСравнения = ВидСравнения.НеВСписке ИЛИ Отбор.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
				ПредставлениеОтборы = СтрШаблон("%1%2 (%3)", ПредставлениеОтборы, Отбор.ВидСравнения, Отбор.Значение);				
			Иначе				
				ПредставлениеОтборы = ПредставлениеОтборы + Отбор.ВидСравнения + " " + Отбор.Значение;				
			КонецЕсли;			
			ПредставлениеОтборы = ПредставлениеОтборы + ";";
			// АПК:1297-вкл Текст построителя.
			
		КонецЕсли;
	КонецЦикла;

	Возврат ПредставлениеОтборы;		
	
КонецФункции

// Функция получает область ячеек табличного документа по имени.
// 
// Параметры:
// ТабличныйДокумент - ТабличныйДокумент.
// ИмяОбласти        - Строка.
// 
Функция ПолучитьОбластьЯчеек(ТабличныйДокумент,ИмяОбласти,ВыводитьСообщения = Ложь)  Экспорт
	
	Результат = Неопределено;
	
	Попытка
		Область = ТабличныйДокумент.Область(ИмяОбласти);
		Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Результат = Область;
		КонецЕсли; 
	Исключение
		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru='Не удалось найти область макета по имени: %1.'; 
								  |en='Could not find layout area by name: %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяОбласти);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ПолучитьОбластьЯчеек()

// Процедура заполняет таблицу отбора в отчете, исходя из настройки источника. 
// В источнике имена параметров должны быть указаны на закладке ОтборВОтчете.
// 
// Параметры:
//  ИсточникДанных  - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  ТаблицаОтбор    - ТаблицаЗначений.
// 
Процедура ЗаполнитьОтборВОтчете(ИсточникДанных, ТаблицаОтбор) Экспорт

	Если НЕ ЗначениеЗаполнено(ИсточникДанных) Тогда
		Возврат;
	КонецЕсли; 
	
	 ОтборКопия = ТаблицаОтбор.Скопировать();
	 ТаблицаОтбор.Очистить();
	
	 Запрос = Новый Запрос;
	 Запрос.УстановитьПараметр("ИсточникДанных",ИсточникДанных);
	 
	 Если ТипЗнч(ИсточникДанных) = Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных") Тогда
		 
		 Запрос.Текст = "ВЫБРАТЬ
		                |	бит_ИсточникиДанныхОтборВОтчете.Имя,
		                |	бит_ИсточникиДанныхОтборВОтчете.ТипЗначения,
		                |	бит_ИсточникиДанныхОтборВОтчете.ТипЗначенияСтр КАК ТипЗначенияСтр
		                |ИЗ
		                |	Справочник.бит_ИсточникиДанных.ОтборВОтчете КАК бит_ИсточникиДанныхОтборВОтчете
		                |ГДЕ
		                |	бит_ИсточникиДанныхОтборВОтчете.Ссылка В
		                |			(ВЫБРАТЬ
		                |				бит_СпособыКомпоновкиИсточниковДанныхИсточникиДанных.ИсточникДанных
		                |			ИЗ
		                |				Справочник.бит_СпособыКомпоновкиИсточниковДанных.ИсточникиДанных КАК бит_СпособыКомпоновкиИсточниковДанныхИсточникиДанных
		                |			ГДЕ
		                |				бит_СпособыКомпоновкиИсточниковДанныхИсточникиДанных.Ссылка = &ИсточникДанных)";
		 
	 ИначеЕсли ТипЗнч(ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		 
		 Запрос.Текст = "ВЫБРАТЬ
		                |	бит_ИсточникиДанныхОтборВОтчете.Имя,
		                |	бит_ИсточникиДанныхОтборВОтчете.ТипЗначения,
		                |	бит_ИсточникиДанныхОтборВОтчете.ТипЗначенияСтр
		                |ИЗ
		                |	Справочник.бит_ИсточникиДанных.ОтборВОтчете КАК бит_ИсточникиДанныхОтборВОтчете
		                |ГДЕ
		                |	бит_ИсточникиДанныхОтборВОтчете.Ссылка = &ИсточникДанных";
		 
	ИначеЕсли ТипЗнч(ИсточникДанных) = Тип("Массив") Тогда	 
		 
		 Запрос.Текст = "ВЫБРАТЬ
		                |	бит_ИсточникиДанныхОтборВОтчете.Имя,
		                |	бит_ИсточникиДанныхОтборВОтчете.ТипЗначения,
		                |	бит_ИсточникиДанныхОтборВОтчете.ТипЗначенияСтр
		                |ИЗ
		                |	Справочник.бит_ИсточникиДанных.ОтборВОтчете КАК бит_ИсточникиДанныхОтборВОтчете
		                |ГДЕ
		                |	бит_ИсточникиДанныхОтборВОтчете.Ссылка В(&ИсточникДанных)";
		 
	 КонецЕсли; 
	
	Результат = Запрос.Выполнить();	
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		НайденнаяСтрока = ТаблицаОтбор.Найти(Выборка.Имя,"Имя");
		Если НайденнаяСтрока = Неопределено Тогда
		
			НоваяСтрока     = ТаблицаОтбор.Добавить();
			НоваяСтрока.Использование = Ложь;
			НоваяСтрока.Имя           = Выборка.Имя;
			НоваяСтрока.ВидСравнения  = ВидСравнения.Равно;
			
			Если НЕ ПустаяСтрока(Выборка.ТипЗначенияСтр) Тогда
			
				ОписаниеТипов = бит_ОбщегоНазначенияКлиентСервер.ПолучитьОписаниеИзСтроки(Выборка.ТипЗначенияСтр);
				Если ОписаниеТипов <> Неопределено Тогда
					НоваяСтрока.Значение = ОписаниеТипов.ПривестиЗначение(НоваяСтрока.Значение);
				КонецЕсли;
			
			ИначеЕсли ТипЗнч(Выборка.ТипЗначения) = Тип("ХранилищеЗначения") Тогда
				
				ОписаниеТипов = Выборка.ТипЗначения.Получить();
				Если ОписаниеТипов <> Неопределено Тогда
					НоваяСтрока.Значение = ОписаниеТипов.ПривестиЗначение(НоваяСтрока.Значение);
				КонецЕсли;
				
			КонецЕсли; 
			
		   // Восстановим значения предыдущей настройки, если имя поля совпадает.
		   НайденнаяСтрока = ОтборКопия.Найти(Выборка.Имя,"Имя");
		   Если НайденнаяСтрока <> Неопределено Тогда
			   НоваяСтрока.ВидСравнения = НайденнаяСтрока.ВидСравнения;
			   НоваяСтрока.Значение     = НайденнаяСтрока.Значение;
		   КонецЕсли; 
			
			
		КонецЕсли; 
	
	КонецЦикла; // По выборке

КонецПроцедуры

// Функция формируем список выбора для отбора в отчете.
// 
// Параметры:
//   ТипРезультата - Строка ("СписокЗначений" или "Массив").
// 
// Возвращаемое значение:
//   СписокВыбора   - СписокЗначений.
// 
Функция СформироватьСписокВыбораДляОтборовВОтчете(ТипРезультата = "СписокЗначений") Экспорт

	Если ТипРезультата = "СписокЗначений" Тогда
		СписокВыбора = Новый СписокЗначений;	
	Иначе	
	    СписокВыбора = Новый Массив;
	КонецЕсли;
	
	СписокВыбора.Добавить(ВидСравнения.Равно);
	СписокВыбора.Добавить(ВидСравнения.НеРавно);
	СписокВыбора.Добавить(ВидСравнения.ВИерархии);
	СписокВыбора.Добавить(ВидСравнения.НеВИерархии);
	СписокВыбора.Добавить(ВидСравнения.ВСписке);
	СписокВыбора.Добавить(ВидСравнения.НеВСписке);
	
    Возврат СписокВыбора;
	
КонецФункции // СформироватьСписокВыбораДляОтборовВОтчете()

// Процедура выполняет копирование отбора компоновки данных.
// 
// Параметры:
//  КоллекцияИсточник - КоллекцияЭлементовОтбораКомпоновкиДанных.
//  КоллекцияПриемник - КоллекцияЭлементовОтбораКомпоновкиДанных.
// 
Процедура КопироватьКоллекциюЭлементовОтбора(КоллекцияИсточник, КоллекцияПриемник) Экспорт

	Для каждого ЭлОтбор Из КоллекцияИсточник Цикл
		
		Если ТипЗнч(ЭлОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			ЭлОтборНовый = КоллекцияПриемник.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ЭлОтборНовый, ЭлОтбор);
			
		ИначеЕсли ТипЗнч(ЭлОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда	
			
			ГрОтборНовый = КоллекцияПриемник.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ГрОтборНовый, ЭлОтбор);
			КопироватьКоллекциюЭлементовОтбора(ЭлОтбор.Элементы, ГрОтборНовый.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры // КопироватьКоллекциюЭлементовОтбора()

// Функция-конструктор структуры, моделирующей элемент отбора.
// 
// Возвращаемое значение:
//  ЭО - Структура.
// 
Функция ЭлементОтбора() Экспорт
	
	ЭО = Новый Структура("ИмяКласса
	                      |, ПутьКДанным
						  |, Использование
						  |, ВидСравнения
						  |, Значение
						  |, ЗначениеС
						  |, ЗначениеПо
						  |, ТипЗначения
						  |, Представление"
						  , "ЭлементОтбора");
	
	Возврат ЭО;
	
КонецФункции // ЭлементОтбора()

// Функция создает схему компоновки данных по тексту запроса.
// 
// Параметры:
// ТекстЗапроса - Строка
// ИмяНабораДанных - Строка
// 
// Возвращаемое значение:
//  СКД - СхемаКомпоновкиДанных.
// 
Функция СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса, ИмяНабораДанных = "НаборДанныхОсновной") Экспорт
	
	СКД = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СКД.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя 				  = "ИсточникДанных";
	ИсточникДанных.ТипИсточникаДанных = "local";
	
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя 						 = ИмяНабораДанных; 
	НаборДанных.ИсточникДанных 				 = "ИсточникДанных";
	НаборДанных.Запрос 						 = ТекстЗапроса;
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.Текст = ТекстЗапроса;
	Построитель.ЗаполнитьНастройки();
	
	Для каждого ПолеПостроителя Из Построитель.ДоступныеПоля Цикл
		
		Если ПолеПостроителя.Поле Тогда
			ВыбранноеПоле = СКД.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(ПолеПостроителя.Имя);
		КонецЕсли; 
		
		// BF-3951. В случае добавления полей после создания скд, 
		// необходимо проанализировать эти места и реализовать по общему принципу.
		ПолеНабораДанныхСхемыКомпоновкиДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабораДанныхСхемыКомпоновкиДанных.Поле =        ПолеПостроителя.Имя;
		ПолеНабораДанныхСхемыКомпоновкиДанных.ПутьКДанным = ПолеПостроителя.Имя;
		ПолеНабораДанныхСхемыКомпоновкиДанных.Заголовок =   ПолеПостроителя.Имя;

	КонецЦикла; 
	
	ГруппировкаКомпоновки = СКД.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ВыбранноеПоле         = ГруппировкаКомпоновки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	
	Возврат СКД
	
КонецФункции // СоздатьСхемуКомпоновкиПоЗапросу()

// Процедура выполняет конвертацию отбора построителя в отбор компоновщика. 
// 
// Параметры:
//  СтрНастроек - Структура.
//  Компоновщик - КомпоновщикНастроекКомпоновкиДанных
//  ТекстЗапроса - Строка - Текст запроса для инициализации построителя.
// 
Процедура КонвертацияОтборПостроителяОтборКомпоновщика(СтрНастроек, Компоновщик, ТекстЗапроса = "") Экспорт

	ОтборПостроителя = Неопределено;
	
	Если СтрНастроек.Свойство("Отбор") Тогда
		
		ОтборПостроителя = СтрНастроек.Отбор;
		
	ИначеЕсли СтрНастроек.Свойство("НастройкиПостроителя") И НЕ ПустаяСтрока(ТекстЗапроса) Тогда	
		
		Построитель = Новый ПостроительОтчета;
		
		Попытка			
			Построитель.Текст = ТекстЗапроса;			
		Исключение			
			ТекстСообщения = НСтр("ru='Не удалось установить текст запроса. Описание ошибки: %1.';
		      					  |en='Failed to set request text. Error description: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);			
		КонецПопытки;
		
		Построитель.УстановитьНастройки(СтрНастроек.НастройкиПостроителя);
		
		ОтборПостроителя = Построитель.Отбор;
		
	КонецЕсли; 
	
	Если НЕ ОтборПостроителя = Неопределено Тогда
		
		Для каждого ЭлементОтбора Из ОтборПостроителя Цикл
			
			СтрВид = КонвертацияВидаСравнения(ЭлементОтбора.ВидСравнения);
			
			Если СтрВид.Группа = "НЕТ" Тогда
				
				НовыйЭлемент = Компоновщик.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйЭлемент.Использование  = ЭлементОтбора.Использование;				   
				НовыйЭлемент.ВидСравнения   = СтрВид.ВидыСравнения[0];
				НовыйЭлемент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ЭлементОтбора.ПутьКДанным);
				НовыйЭлемент.ПравоеЗначение = ЭлементОтбора.Значение;
				
			Иначе	
				
				// Интервальные виды сравнения для которых в компоновке нет соответствующих видов сравнения
				// для конвертации используем группы элементов отбора компоновки.
				НоваяГруппа = Компоновщик.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				НоваяГруппа.Использование = ЭлементОтбора.Использование;
				
				Если СтрВид.Группа = "И" Тогда
					
					НоваяГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
					
				ИначеЕсли СтрВид.Группа = "ИЛИ" Тогда
					
					НоваяГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
					
				ИначеЕсли СтрВид.Группа = "НЕ" Тогда	  
					
					НоваяГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;
					
				Иначе	  
					
					НоваяГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
					
				КонецЕсли; 
				
				// ЗначениеС
				НовыйЭлемент = НоваяГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйЭлемент.Использование = ЭлементОтбора.Использование;
				НовыйЭлемент.ВидСравнения  = СтрВид.ВидыСравнения[0];
				НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ЭлементОтбора.ПутьКДанным);
				НовыйЭлемент.ПравоеЗначение= ЭлементОтбора.ЗначениеС;
				
				// ЗначениеПО
				НовыйЭлемент = НоваяГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйЭлемент.Использование = ЭлементОтбора.Использование;
				НовыйЭлемент.ВидСравнения  = СтрВид.ВидыСравнения[1];
				НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ЭлементОтбора.ПутьКДанным);
				НовыйЭлемент.ПравоеЗначение= ЭлементОтбора.ЗначениеПО;
				
				
			КонецЕсли; 
		КонецЦикла; // СтрНастроек.Отбор 
	КонецЕсли;  // Есть отбор построителя
	
КонецПроцедуры

// Функция выполняет адаптацию текста запроса
// , используемого с построителем запроса для работы с компоновкой данных.
// 
// Параметры:
//  ТекстЗапроса - Строка
// 
// Возвращаемое значение:
//  ТекстЗапроса - Строка.
// 
Функция АдаптироватьТекстПостроителяДляКомпоновки(Знач ТекстЗапроса) Экспорт

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АВТОУПОРЯДОЧИВАНИЕ", "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса  , "СпрЭлементы.Ссылка.* КАК Ссылка", "Ссылка.*");

	Возврат ТекстЗапроса;
	
КонецФункции // АдаптироватьТекстПостроителяДляКомпоновки()

Функция НовыеСтандартныеПараметры() Экспорт

	СтандартныеПараметры = Новый Структура;
	СтандартныеПараметры.Вставить("ДатаНачала", 		   '0001-01-01');
	СтандартныеПараметры.Вставить("ДатаОкончания", 		   '0001-01-01');
	СтандартныеПараметры.Вставить("ДатаНачалаФормат", 	   '0001-01-01');
	СтандартныеПараметры.Вставить("ДатаОкончанияФормат",   '0001-01-01');
	СтандартныеПараметры.Вставить("ДеньНач", 			   '0001-01-01');
	СтандартныеПараметры.Вставить("ДеньКон", 			   '0001-01-01');
	СтандартныеПараметры.Вставить("МесяцНач",			   '0001-01-01');
	СтандартныеПараметры.Вставить("МесяцКон",			   '0001-01-01');
	СтандартныеПараметры.Вставить("ГодНач",				   '0001-01-01');
	СтандартныеПараметры.Вставить("ГодКон",				   '0001-01-01');
	СтандартныеПараметры.Вставить("ОписаниеПериода", 	   "");
	СтандартныеПараметры.Вставить("ДатаВремяФормирования", '0001-01-01');
	СтандартныеПараметры.Вставить("ИнформационнаяБаза",    СтрокаСоединенияИнформационнойБазы());
	СтандартныеПараметры.Вставить("Пользователь", 	 	   Пользователи.ТекущийПользователь());
	
	Возврат СтандартныеПараметры;
	
КонецФункции

Функция НовыеСтандартныеПараметрыМСФО() Экспорт

	СтандартныеПараметрыМСФО = НовыеСтандартныеПараметры();
	СтандартныеПараметрыМСФО.Вставить("ОписаниеПериодаМСФО", 	"");
	СтандартныеПараметрыМСФО.Вставить("КонсолидированныйОтчет", "");
	СтандартныеПараметрыМСФО.Вставить("КонецПрошлогоГода", 		"");
	СтандартныеПараметрыМСФО.Вставить("КонецПозапрошлогоГода", 	"");
	
	Возврат СтандартныеПараметрыМСФО;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура получает данные по источнику.
// 
// Параметры:
//  ИсточникДанных  - СправочникСсылка.ИсточникиДанныхДляРасчетовБюджетирования.
//  ГраницаНач      - Дата,Граница.
//  ГраницаКон      - Дата,Граница.
//  СтрПар          - Структура.
// 
// Возвращаемое значение:
//   ТаблицаДанных  - ТаблицаЗначений, РезультатЗапроса.
// 
Функция ПолучитьДанныеПоИсточникуТекущаяБаза(ИсточникДанных,ГраницаНач,ГраницаКон,ВсеПараметры)

	Параметры                  = ВсеПараметры.Параметры;
	Настройка                  = ВсеПараметры.Настройка;
	Поля                       = ВсеПараметры.Поля;
	ОтборВОтчете               = ВсеПараметры.ОтборВОтчете;
	ВозвращатьРезультатЗапроса = ВсеПараметры.ВозвращатьРезультатЗапроса;
											  
	ПостроительЗапроса = Новый ПостроительЗапроса;
	
	Попытка
		ПостроительЗапроса.Текст = ИсточникДанных.ЗапросБД.ТекстЗапроса;
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка в тексте запроса: %1.'; en = 'Error in the request text: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	ПостроительЗапроса.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	
	Если ИсточникДанных.ЗапросБД.АвтозаполнениеНастроек Тогда
		 ПостроительЗапроса.ЗаполнитьНастройки();
	КонецЕсли; 
	
	// Сохраненные настройки построителя
	НастройкаИсточника = ИсточникДанных.НастройкиПостроителя.Получить();
	
	Если Настройка = Неопределено Тогда
		СохраненнаяНастройка=НастройкаИсточника;
	Иначе
		СохраненнаяНастройка=Настройка;
	КонецЕсли; 
		
	Если ТипЗнч(НастройкаИсточника) = Тип("Структура") Тогда
	
		Для Каждого Параметр Из НастройкаИсточника.ПараметрыПостроителя Цикл
			ПостроительЗапроса.Параметры.Вставить(Параметр.Ключ,Параметр.Значение);
		КонецЦикла;
	
	КонецЕсли; 
	
	// Заполнение выбранных полей построителя по настройке источника данных.
	ЗаполнитьВыбранныеПоля(ПостроительЗапроса, ИсточникДанных);
	
	// Заполним параметры построителя
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		Для каждого КлючИЗначение Из Параметры Цикл
			ПостроительЗапроса.Параметры.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
		КонецЦикла; 
	КонецЕсли; 
	
	КонецГраница = ТипЗнч(ГраницаКон) = Тип("Граница");	
	УстановитьОбязательныеПараметры(ПостроительЗапроса, ГраницаНач, ГраницаКон, КонецГраница);
	
	// Отбор заполняем по элементу данных
	УстановитьОтборЭлементаДанных(ПостроительЗапроса,СохраненнаяНастройка);
	
	// Заполним отборы, установленные в форме отчета.
	УстановитьОтборОтчета(ПостроительЗапроса,ОтборВОтчете);
	
	Если НЕ ВсеПараметры.Измерения = Неопределено Тогда
	
		УстановитьИзмеренияСтроки(ВсеПараметры.Измерения, ПостроительЗапроса);
	
	КонецЕсли; 
	
	УстановитьПорядокПостроителя(ИсточникДанных.Порядок, ПостроительЗапроса, НаправлениеСортировки);
	
	// Выполнение запроса
	Попытка
		ПостроительЗапроса.Выполнить();
		Результат = ПостроительЗапроса.Результат;
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении запроса: %1.'; en = 'Request execution error: %1.'");
		ТекстСообщения = СтрШаблон(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Если ВозвращатьРезультатЗапроса Тогда
		
		ТаблицаДанных = Результат;
		
	Иначе	
		
		// Замена имен на синонимы в результирующей таблице.
		ТаблицаДанных= Результат.Выгрузить();
		ПодставитьСинонимыИсточника(ТаблицаДанных,ИсточникДанных);
		
	КонецЕсли; 
	
	Возврат ТаблицаДанных;
	
КонецФункции

// Функция формирует массив подключений, необходимых для получения данных. 
// Учитывается возможность переопределения подключений в настройке пулов.
// 
// Параметры:
//  НастройкаПулаПодключений - СправочникСсылка.бит_мпд_НастройкиПуловПодключений.
//  ИсточникДанных           - СправочникСсылка.бит_ИсточникиДанных.
//  НастройкаПодключения     - СправочникСсылка.бит_мпд_НастройкиПодключений.
// 
// Возвращаемое значение:
//  НастройкиПодключений - Массив.
// 
Функция ОпределитьНеобходимыеПодключения(НастройкаПулаПодключений, ИсточникДанных, НастройкаПодключения)

	НастройкиПодключений = Новый Массив;							  
	
	Если ЗначениеЗаполнено(НастройкаПулаПодключений) Тогда
		
		// Подключения для видов ИБ переопределяются в настройке пулов подключений.
		СтрОтбор = Новый Структура("ВидИнформационнойБазы",ИсточникДанных.ВидИнформационнойБазы);
		
		МассивСтрок = НастройкаПулаПодключений.НастройкиПодключений.НайтиСтроки(СтрОтбор);
		
		Для каждого СтрокаТаблицы Из МассивСтрок Цикл
			
			НастройкиПодключений.Добавить(СтрокаТаблицы.НастройкаПодключения);
			
		КонецЦикла; 
		
	КонецЕсли; 							  
	
	Если НастройкиПодключений.Количество() = 0 Тогда
		
		// Подключение передано как параметр или берется из источника.
		Если ЗначениеЗаполнено(НастройкаПодключения) Тогда
			НастройкиПодключений.Добавить(НастройкаПодключения); 
		Иначе	
			НастройкиПодключений.Добавить(ИсточникДанных.НастройкаПодключения); 
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат НастройкиПодключений;
	
КонецФункции // ОпределитьНеобходимыеПодключения()

// Процедура применяет соответствия к ТаблицеРезультат, полученной источником данных.
// 
// Параметры:
//  ТаблицаРезультат - ТаблицаЗначений.
//  Источник    - СправочникСсылка.бит_ИсточникиДанных.
//  Период		- Дата. Перод среза регистра "бит_СоответствияАналитик".
// 
Процедура ПрименитьСоответствия(ТаблицаРезультат, Источник, Период)

	// Подготовим параметры для работы с фиксированными соответствиями.
	СтрСоотв = Новый Структура("СоотвСтатьиРегл,СоотвПодразделения,СоотвНомГруппы");
	
	Для каждого КиЗ Из СтрСоотв Цикл
		
		ВидСоотв         = КиЗ.Ключ;
		ИмяПоляПрименить = ВидСоотв+"_Применить";
		
		Если Источник[ИмяПоляПрименить] Тогда
			
			Если ВидСоотв = "СоотвСтатьиРегл" Тогда
				Соотв = бит_МеханизмТрансляции.ПолучитьСоответствиеСтатьиРеглСтатьи();
			ИначеЕсли ВидСоотв = "СоотвПодразделения" Тогда
				Соотв =  бит_МеханизмТрансляции.ПолучитьСоответствиеПодразделенияЦФО();
			ИначеЕсли ВидСоотв = "СоотвНомГруппы" Тогда 	
				Соотв = бит_МеханизмТрансляции.ПолучитьСоответствиеНомГруппыСтатьи();
			КонецЕсли; 
			
			СтрПар = Новый Структура;
			СтрПар.Вставить("Соотв", Соотв);
			
			ИмяПолеПриемник = ВидСоотв+"_ПолеПриемник";
			СтрПар.Вставить("ПолеПриемник",Источник[ИмяПолеПриемник]);
			
			ИмяПоляИсточники = ВидСоотв+"_ПоляИсточники";
			СтрПоляИсточники = Источник[ИмяПоляИсточники];
			МассивПоляИсточники = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(СтрПоляИсточники,"/");
			СтрПар.Вставить("ПоляИсточники",МассивПоляИсточники);
			
			СтрСоотв[КиЗ.Ключ] = СтрПар;
		КонецЕсли; 
	КонецЦикла; // По видам фиксированным соответствиям
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствияАналитик.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	СоответствияАналитик.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	СоответствияАналитик.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	СоответствияАналитик.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	СоответствияАналитик.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	СоответствияАналитик.ПраваяАналитика_3 КАК ПраваяАналитика_3,
	|	СоответствияАналитик.ВидСоответствия.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.бит_СоответствияАналитик.СрезПоследних(&Период, ВидСоответствия = &ВидСоответствия) КАК СоответствияАналитик
	|ГДЕ
	|	СоответствияАналитик.Используется";
	
	// Подготовка параметров для работы с универсальными соответствиями.
	НастройкиСоотв = Новый Массив;
	МаксКолАналитик = Справочники.бит_ВидыСоответствийАналитик.МаксКоличествоАналитик();
	Для каждого СтрокаСоотв Из Источник.НастройкиСоответствий Цикл
		
		ТекНастройка 	= Новый Структура("ТабСоотв, ПоляИсточники, ПоляПриемники");
		ВидСоответствия = СтрокаСоотв.ВидСоответствия;
		
		Запрос.УстановитьПараметр("ВидСоответствия", ВидСоответствия);
		Запрос.УстановитьПараметр("Период", 		 Период);
		Результат = Запрос.Выполнить();
		
		ТекНастройка.Вставить("ТабСоотв", Результат.Выгрузить());			   
		
		МассивПолейИсточник = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(СтрокаСоотв.ПоляИсточники, "/");
		МассивПолейПриемник = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(СтрокаСоотв.ПоляПриемники, "/");

		ПоляИсточники = Новый Структура;
		ПоляПриемники = Новый Структура;
		
		Для й = 1 По МаксКолАналитик Цикл
		
			ИмяПоляСоотв = "ЛеваяАналитика_"+й;
			ВидАналитики = ВидСоответствия[ИмяПоляСоотв];
			
			Если ЗначениеЗаполнено(ВидАналитики) Тогда
				
				ИмяАналитики = СокрЛП(ВидАналитики.Код);
				Если НЕ МассивПолейИсточник.Найти(ИмяАналитики) = Неопределено Тогда
					ПоляИсточники.Вставить(ИмяАналитики, ИмяПоляСоотв);
				КонецЕсли; 
			КонецЕсли; 
			
			ИмяПоляСоотв = "ПраваяАналитика_"+й;
			ВидАналитики = ВидСоответствия[ИмяПоляСоотв];
			
			Если ЗначениеЗаполнено(ВидАналитики) Тогда
				
				ИмяАналитики = СокрЛП(ВидАналитики.Код);
				Если НЕ МассивПолейПриемник.Найти(ИмяАналитики) = Неопределено Тогда
					ПоляПриемники.Вставить(ИмяПоляСоотв, ИмяАналитики);
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		
		ТекНастройка.Вставить("ПоляИсточники", ПоляИсточники);
		ТекНастройка.Вставить("ПоляПриемники", ПоляПриемники);
		
		НастройкиСоотв.Добавить(ТекНастройка);
		
	КонецЦикла; // По универсальным соответствиям
	
	ЕстьСчетУчетаБУ = ?(ТаблицаРезультат.Колонки.Найти("СчетУчетаБУ") = Неопределено, Ложь, Истина);
	
	// Применим соответствия к ТаблицеРезультат
	Для каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		
		// Подбор по фиксированным соответствиям
		Для каждого КиЗ Из СтрСоотв Цикл
			
			СтрПар = КиЗ.Значение;
			Если ТипЗнч(СтрПар) = Тип("Структура") Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрПар.ПолеПриемник) Тогда
					Продолжить;
				КонецЕсли; 
				
				Если НЕ ТипЗнч(СтрокаТаблицы[СтрПар.ПолеПриемник]) = Тип("ЭлементСпискаЗначений")
					 И НЕ ЗначениеЗаполнено(СтрокаТаблицы[СтрПар.ПолеПриемник]) Тогда
					
					Для каждого ПолеИсточник Из КиЗ.Значение.ПоляИсточники Цикл
						
						Если ЗначениеЗаполнено(ПолеИсточник) Тогда
							
							ЗначениеПоиска = СтрокаТаблицы[ПолеИсточник];
							СчетПоиска = ?(ЕстьСчетУчетаБУ, СтрокаТаблицы["СчетУчетаБУ"], ПланыСчетов.Хозрасчетный.ПустаяСсылка());
							
							РезЗначение = бит_МеханизмТрансляции.ИзвлечьИзСоответствия(ЗначениеПоиска, СчетПоиска, СтрПар.Соотв);
							Если НЕ РезЗначение = Неопределено Тогда
								Прервать;
							КонецЕсли; 
						КонецЕсли; 
					КонецЦикла; // Поля источники
					
					СтрокаТаблицы[СтрПар.ПолеПриемник] = РезЗначение;
					
				КонецЕсли;  // Приемник пустой
			КонецЕсли; // Соответствие применяется
		КонецЦикла; // Фиксированные виды соответствий
		
		// Подбор по универсальным соответствиям		
		Для каждого Настройка Из НастройкиСоотв Цикл
			
			СтрОтбор = Новый Структура;
			
			Для каждого КиЗ Из Настройка.ПоляИсточники Цикл
				
				ИмяПоляСоотв = КиЗ.Значение;
				ИмяАналитики = КиЗ.Ключ;
				СтрОтбор.Вставить(ИмяПоляСоотв, СтрокаТаблицы[ИмяАналитики]);
				
			КонецЦикла; // По полям источникам
			
			// Выполняем поиск в соответствии
			НайденныеСтроки = Настройка.ТабСоотв.НайтиСтроки(СтрОтбор);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				ПерваяСтрока = НайденныеСтроки[0];
				
				Для каждого КиЗ Из Настройка.ПоляПриемники Цикл
					
					ИмяПоляСоотв = КиЗ.Ключ;
					ИмяАналитики = КиЗ.Значение;
					
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ИмяАналитики]) Тогда
						
						СтрокаТаблицы[ИмяАналитики] = ПерваяСтрока[ИмяПоляСоотв];
						
					КонецЕсли; 
					
				КонецЦикла; // По полям приемникам
				
			КонецЕсли;  
			
		КонецЦикла; // По универсальным используемым соответствиям.
		
		
	КонецЦикла; // ТаблицаРезультат

КонецПроцедуры // ПрименитьСоответствия()

// Функция выполняет конвертацию вида сравнения построителя в вид сравнения компоновки данных. 
// 
// Параметры:
//  ВидСравненияПостроителя - ВидСравнения.
// 
// Возвращаемое значение;
//  СтрВид - Структура
// 
Функция КонвертацияВидаСравнения(ВидСравненияПостроителя)

	СтрВид = Новый Структура("Группа, ВидыСравнения", "НЕТ", Новый Массив);
	
	Если ВидСравненияПостроителя = ВидСравнения.Больше Тогда
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Больше);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.БольшеИлиРавно Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.БольшеИлиРавно);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ВИерархии Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВИерархии);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ВСписке Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ВСпискеПоИерархии Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.Интервал Тогда	
		
		СтрВид.Группа = "И";
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Больше);	
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Меньше);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ИнтервалВключаяГраницы Тогда	
		
		СтрВид.Группа = "И";
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.БольшеИлиРавно);	
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ИнтервалВключаяНачало Тогда	
		
		СтрВид.Группа = "И";
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.БольшеИлиРавно);	
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Меньше);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.ИнтервалВключаяОкончание Тогда	
		
		СтрВид.Группа = "И";
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Больше);	
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);				
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.Меньше Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Меньше);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.МеньшеИлиРавно Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.НеВИерархии Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВИерархии);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.НеВСписке Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.НеВСпискеПоИерархии Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.НеРавно Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.НеСодержит Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеСодержит);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.Равно Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Равно);		
		
	ИначеЕсли ВидСравненияПостроителя = ВидСравнения.Содержит Тогда	
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Содержит);		
		
	Иначе
		
		СтрВид.ВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Равно);
		
	КонецЕсли; 

	Возврат СтрВид;
	
КонецФункции // КонвертацияВидаСравнения()

// Функция определяет доступен ли данному виду сравнения список.
// 
// Параметры:
//  ТекВидСравнения  - ВидСравнения.
// 
// Возвращаемое значение:
//   СписокДоступен   - Булево.
// 
Функция СписокДоступен(ТекВидСравнения)
	
	СписокДоступен = Ложь;
	
	Если ТекВидСравнения = ВидСравнения.ВСписке 
		ИЛИ ТекВидСравнения = ВидСравнения.НеВСписке
		ИЛИ ТекВидСравнения = ВидСравнения.НеВСпискеПоИерархии
		ИЛИ ТекВидСравнения = ВидСравнения.ВСпискеПоИерархии Тогда
		
		СписокДоступен = Истина;	
		
	КонецЕсли; 
	
	Возврат СписокДоступен;
	
КонецФункции // СписокДоступен()

// Процедура позволяет получить запросы источника данных либо способа компоновки источников данных.
// Рекурсивный вызов.
// 
// Параметры:
//  Источник  - СправочникСсылка.бит_ИсточникиДанных,СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных
//  МассивЗапросов  - Массив.
// 
Процедура ПолучитьЗапросыИсточников(Источник,МассивЗапросов)
	
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.бит_ИсточникиДанных") 
		 ИЛИ ТипЗнч(Источник) = Тип("СправочникОбъект.бит_ИсточникиДанных")  Тогда
		
		Если МассивЗапросов.Найти(Источник.ЗапросБД) = Неопределено Тогда
			
			МассивЗапросов.Добавить(Источник.ЗапросБД);
			
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных") 
		      ИЛИ ТипЗнч(Источник) = Тип("СправочникОбъект.бит_СпособыКомпоновкиИсточниковДанных") Тогда
		
		Для каждого СтрокаТаблицы Из Источник.ИсточникиДанных Цикл
			
			ПолучитьЗапросыИсточников(СтрокаТаблицы.ИсточникДанных,МассивЗапросов);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура дополняет массив параметров - исключений параметрами
// , помеченными флагом "ОграничениеДоступности".
// Рекурсивный вызов.
// 
// Параметры:
//  Источник  - СправочникСсылка.бит_ИсточникиДанных,СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  Исключения  - Массив.
// 
Процедура ДополнитьСписокИсключений(Источник, Исключения)

	Если ТипЗнч(Источник) = Тип("СправочникСсылка.бит_ИсточникиДанных") 
		 ИЛИ ТипЗнч(Источник) = Тип("СправочникОбъект.бит_ИсточникиДанных")  Тогда
		 
		 СохраненнаяНастройка = Источник.НастройкиПостроителя.Получить();
		 Если ТипЗнч(СохраненнаяНастройка) = Тип("Структура") Тогда
			 
			 // Восстанавливаем сохраненные параметры
			 Если СохраненнаяНастройка.Свойство("НастройкиПараметров") Тогда
				 
				 Для Каждого КиЗ Из СохраненнаяНастройка.НастройкиПараметров Цикл

					 ИмяПараметра = КиЗ.Ключ;
					 ОграничениеДоступности = КиЗ.Значение.ОграничениеДоступности;
					 
					 Если ОграничениеДоступности Тогда
						 Если Исключения.Найти(ИмяПараметра) = Неопределено Тогда
						 	Исключения.Добавить(ИмяПараметра);
						 КонецЕсли; 
					 КонецЕсли; // ОграничениеДоступности
				 КонецЦикла; // по параметрам
				 
			 КонецЕсли; 
		 КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных") 
		      ИЛИ ТипЗнч(Источник) = Тип("СправочникОбъект.бит_СпособыКомпоновкиИсточниковДанных") Тогда
		
		Для каждого СтрокаТаблицы Из Источник.ИсточникиДанных Цикл
			
			ДополнитьСписокИсключений(СтрокаТаблицы.ИсточникДанных, Исключения);
			
		КонецЦикла; 
		
	КонецЕсли; 

КонецПроцедуры // ДополнитьСписокИсключений()

// Процедура устанавливает значение параметра таблицы "Параметры" по данным
// настроек Источника данных.
//
Процедура УстановитьЗначенияПараметровИзИсточника(СписокПараметров, Источник)
	
	Если Источник <> Неопределено Тогда
		Если Источник.Метаданные() = Метаданные.Справочники.бит_ИсточникиДанных Тогда
			
			Если ТипЗнч(Источник) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
				РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "НастройкиПостроителя");
	        Иначе
				РеквизитыИсточника = Источник;
			КонецЕсли;

			СохраненнаяНастройка = РеквизитыИсточника.НастройкиПостроителя.Получить();
			
			Если ТипЗнч(СохраненнаяНастройка) = Тип("Структура") Тогда
				Если СохраненнаяНастройка.Свойство("ПараметрыПостроителя") Тогда
					Для каждого СтрокаПараметры Из СписокПараметров Цикл
						Если СохраненнаяНастройка.ПараметрыПостроителя.Свойство(СтрокаПараметры.ИмяПараметра) Тогда
							СтрокаПараметры.ЗначениеПараметра = СохраненнаяНастройка.ПараметрыПостроителя[СтрокаПараметры.ИмяПараметра];
						КонецЕсли; 
					КонецЦикла;
				КонецЕсли; 
			КонецЕсли;
			
		ИначеЕсли Источник.Метаданные() = Метаданные.Справочники.бит_СпособыКомпоновкиИсточниковДанных Тогда

			Если ТипЗнч(Источник) = Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных") Тогда
				РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "ИсточникиДанных");
	        Иначе
				РеквизитыИсточника = Источник;
			КонецЕсли;
			Выборка = РеквизитыИсточника.ИсточникиДанных.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				УстановитьЗначенияПараметровИзИсточника(СписокПараметров, Выборка.ИсточникДанных);		
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Процедура устанавливает настройки пересчетов по курсам для элементов данных с учетом иерархии.
// 
// Параметры:
//  СтрокаВерх - СтрокаДереваЗначений.
//  НастройкиПересчета - Соответствие.
//  НастройкаПоУмолчанию - Структура.
// 
Процедура ОпределитьНастройкиПересчетаИерархически(СтрокаВерх, НастройкиПересчета, НастройкаПоУмолчанию)

	 Для каждого СтрокаДерева Из СтрокаВерх.Строки Цикл
		 
		ТекНастройка = НастройкиПересчета[СтрокаДерева.ЭлементДанных];
		Если ТекНастройка = Неопределено Тогда
			
			// Настройка для данного элемента данных не определена
			// применяем настройки по умолчанию.
			ТекНастройка = Новый Структура;
		    ТекНастройкаПоУмолчанию = Новый Структура; 
			
			Для каждого КиЗ Из НастройкаПоУмолчанию Цикл
			
				ТекНастройка.Вставить(КиЗ.Ключ, КиЗ.Значение);
				ТекНастройкаПоУмолчанию.Вставить(КиЗ.Ключ, КиЗ.Значение);
			
			КонецЦикла; 
			
			НастройкиПересчета.Вставить(СтрокаДерева.ЭлементДанных, ТекНастройка);
			
		Иначе	
			
			// Проверяем для всех ли ресурсов заданы настройки, 
			// для ресурсов у которых нет настроек применяем настройки по-умолчанию.
			
			Для каждого КиЗ Из НастройкаПоУмолчанию Цикл
			
				Если НЕ ТекНастройка.Свойство(КиЗ.Ключ) Тогда
				
					ТекНастройка.Вставить(КиЗ.Ключ, КиЗ.Значение);
				
				КонецЕсли; 
			
			КонецЦикла; 
			
			// Для вложенных элементов данных настройкой по умолчанию становится текущая настройка.
			ТекНастройкаПоУмолчанию = Новый Структура;
			Для каждого КиЗ Из ТекНастройка Цикл
			
				ТекНастройкаПоУмолчанию.Вставить(КиЗ.Ключ, КиЗ.Значение);
			
			КонецЦикла; 
			
		КонецЕсли; 
		
		// Устанавливаем настройки для вложенных элементов данных.
	 	ОпределитьНастройкиПересчетаИерархически(СтрокаДерева, НастройкиПересчета, ТекНастройкаПоУмолчанию);
	 
	 КонецЦикла; 

КонецПроцедуры // ОпределитьНастройкиПересчетаИерархически()

// Функция получает структуру ресурсов для пересчетов по курсам.
// В таблицу результата добавляются колонки со способами пересчетов по курсам для ресурсов.
// 
// Параметры:
//  СпособКомпоновки - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  ТаблицаРезультат - ТаблицаЗначений.
//  МассивСпособов   - Массив (заполняется возможными способами пересчета ресурсов по курсу).
//  МассивВалют		 - Массив (заполняется возможными валютами).
//  
// Возвращаемое значение:
//   Структура: Ключ - Ресурс, Значение - ИмяВалютыИсходной.
// 
Функция РесурсыДляПересчетовПоКурсам(СпособКомпоновки, ТаблицаРезультат, МассивСпособов, МассивВалют)

	СтруктураРесурсов = Новый Структура;
	
	НастройкиПересчета = Новый Соответствие;
	// Определим установленные способы пересчета по курсам.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СпособКомпоновки", СпособКомпоновки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпособыПересчета.Ссылка КАК ЭлементДанных,
	|	СпособыПересчета.ИмяКолонки,
	|	СпособыПересчета.СпособПересчетаПоКурсам
	|ИЗ
	|	Справочник.бит_ЭлементыДанных.СпособыПересчетаПоКурсам КАК СпособыПересчета
	|ГДЕ
	|	СпособыПересчета.Ссылка.Владелец = &СпособКомпоновки
	|ИТОГИ ПО
	|	ЭлементДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЭлементыДанных.Ссылка КАК ЭлементДанных
	|ИЗ
	|	Справочник.бит_ЭлементыДанных КАК бит_ЭлементыДанных
	|ГДЕ
	|	бит_ЭлементыДанных.Владелец = &СпособКомпоновки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭлементДанных ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// Извлекаем установленные настройки пересчетов по курсам.
	ВыборкаЭД = МассивРезультатов[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЭД.Следующий() Цикл
	
		Выборка = ВыборкаЭД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТекНастройка = Новый Структура;
		Пока Выборка.Следующий() Цикл
		
			  ТекНастройка.Вставить(Выборка.ИмяКолонки, Выборка.СпособПересчетаПоКурсам);
		
		КонецЦикла; 
		
		НастройкиПересчета.Вставить(ВыборкаЭД.ЭлементДанных, ТекНастройка);
		
	КонецЦикла; 
	
	НайденныеСтрокиРесурсов = СпособКомпоновки.КолонкиТаблицы.НайтиСтроки(Новый Структура("ВидКолонки", "Ресурс"));
	
	НастройкаПоУмолчанию = Новый Структура;
	Для каждого СтрокаРесурса Из НайденныеСтрокиРесурсов Цикл
	
		НастройкаПоУмолчанию.Вставить(СтрокаРесурса.ИмяКолонки, СтрокаРесурса.СпособПересчетаПоКурсам);
		// Новая колонка в таблице результата для записи способа пересчета.
		ИмяРесурса = СтрокаРесурса.ИмяКолонки;				
		ИмяКолонкиСпособа = "Ресурс_" + ИмяРесурса + "_СпособПересчетаПоКурсам";
		ТаблицаРезультат.Колонки.Добавить(ИмяКолонкиСпособа);		
		
		// Поиск имени поля - исходной валюты
		ИмяВалюты = "Валюта" + СтрокаРесурса.ИмяКолонки;
		НайденныеСтрокиВалюта = СпособКомпоновки.КолонкиТаблицы.НайтиСтроки(Новый Структура("ИмяКолонки", ИмяВалюты));
		ИмяВалютыИсходной     = ?(НайденныеСтрокиВалюта.Количество() = 0, Неопределено, НайденныеСтрокиВалюта[0].ИмяКолонки);
		
		Если ИмяВалютыИсходной <> Неопределено Тогда 
			
			// Заполнение массива валют
			ТаблицаВалют = ТаблицаРезультат.Скопировать();
			ТаблицаВалют.Свернуть(ИмяВалютыИсходной);
			Для каждого СтрТаб Из ТаблицаВалют Цикл
				ТекВалюта = СтрТаб[ИмяВалютыИсходной];
			 	Если МассивВалют.Найти(ТекВалюта) = Неопределено Тогда
					МассивВалют.Добавить(ТекВалюта);		
				КонецЕсли;			
			КонецЦикла;
			
		КонецЕсли;
		
		// Структура ресурсов
		СтруктураРесурсов.Вставить(ИмяРесурса, ИмяВалютыИсходной);
		
	КонецЦикла; 	
	
	// Определяем способ пересчета по курсам для всех элементов данных.
	ДеревоЭД = МассивРезультатов[1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ОпределитьНастройкиПересчетаИерархически(ДеревоЭД, НастройкиПересчета, НастройкаПоУмолчанию);
	
	// Устанавливаем в таблицу результат способ пересчета по курсам.
	Для каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		
		ТекЭлементДанных = СтрокаТаблицы.ЭлементДанных;
		ТекНастройка     = НастройкиПересчета[ТекЭлементДанных];
		
		Для каждого СтрокаРесурса Из НайденныеСтрокиРесурсов Цикл
			
			ИмяРесурса = СтрокаРесурса.ИмяКолонки;	
		    ИмяКолонкиСпособа = "Ресурс_" + ИмяРесурса + "_СпособПересчетаПоКурсам";			
			
			Если ТипЗнч(ТекНастройка) = Тип("Структура") Тогда
				
				Если ТекНастройка.Свойство(ИмяРесурса) Тогда
					
					СпособПересчетаПоКурсам = ТекНастройка[ИмяРесурса];
					
				Иначе
					
					СпособПересчетаПоКурсам = Перечисления.бит_СпособыПересчетаПоКурсам.НеПересчитывается;
					
				КонецЕсли; 
				
			Иначе	
				
				СпособПересчетаПоКурсам = Перечисления.бит_СпособыПересчетаПоКурсам.НеПересчитывается;
				
			КонецЕсли; 
			
			Если СпособПересчетаПоКурсам = Перечисления.бит_СпособыПересчетаПоКурсам.НеПересчитывается
				Или Не ЗначениеЗаполнено(СпособПересчетаПоКурсам) Тогда
				// Если ресурс пересчитывать по курсам не нужно, то не записываем его в структуру.
				СтрокаТаблицы[ИмяКолонкиСпособа] = Перечисления.бит_СпособыПересчетаПоКурсам.НеПересчитывается;
				Продолжить;
			Иначе
				СтрокаТаблицы[ИмяКолонкиСпособа] = СпособПересчетаПоКурсам;
			КонецЕсли;
			
			Если МассивСпособов.Найти(СпособПересчетаПоКурсам) = Неопределено Тогда
				МассивСпособов.Добавить(СпособПересчетаПоКурсам);			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла; 	

	Возврат СтруктураРесурсов;
	
КонецФункции // ПолучитьСтруктуруРесурсовДляПересчетовПоКурсам()

// Процедура пересчитывает ресурсы в таблице по курсам.
// 
// Параметры:
//  СпособКомпоновки  - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  ГраницаНач        - Дата,МоментВремени,Граница.
//  ГраницаКон        - Дата,МоментВремени,Граница.
//  СтрПар            - Структура.
//  ТаблицаРезультат  - ТаблицаЗначений.
// 
Процедура ПересчитатьРесурсыПоКурсам(СпособКомпоновки, ГраницаНач, ГраницаКон, ВсеПараметры, ТаблицаРезультат)

	СпособыПересчета = Перечисления.бит_СпособыПересчетаПоКурсам;
	
	// Массив способов пересчета по курсам
	МассивСпособов = Новый Массив;
	МассивВалют    = Новый Массив;
	// Структура ресурсов, для которых нужен пересчет (Ключ - Ресурс, Значение - ИмяВалютыИсходной).
	РесурсыДляПересчетов = РесурсыДляПересчетовПоКурсам(СпособКомпоновки, ТаблицаРезультат, МассивСпособов, МассивВалют);
	Если РесурсыДляПересчетов.Количество() = 0 Тогда
		// Нет ресурсов, для которых нужно выполнить пересчет.
		Возврат;	
	КонецЕсли;
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	СтруктураВалютыРегл = Новый Структура("Валюта, Курс, Кратность", ВалютаРегл, 1, 1);
	
	// Валюта отчета
	Если ВсеПараметры.Параметры.Свойство("ВалютаОтчета") Тогда
		ВалютаОтчета = ВсеПараметры.Параметры.ВалютаОтчета;
		Если Не ЗначениеЗаполнено(ВалютаОтчета) Тогда
			ВалютаОтчета = ВалютаРегл;	
		КонецЕсли;
	Иначе
		ВалютаОтчета = ВалютаРегл;
	КонецЕсли;  	
	
	Если МассивВалют.Найти(ВалютаОтчета) = Неопределено Тогда
		МассивВалют.Добавить(ВалютаОтчета);		
	КонецЕсли;
	
	// Формирование курсов
	ИмяКурсВалюты    		= "КурсыВалют";
	ИмяКурсВалютыОтчетности = "бит_КурсыВалютОтчетности";
	Для каждого ТекСпособ Из МассивСпособов Цикл
		Если ТекСпособ = СпособыПересчета.СреднийКурсЗаПериод Тогда
			// Средние курсы
			СоответствиеКурсовВалют_С = бит_КурсыВалют.СредниеКурсыВалютЗаПериод(МассивВалют, ГраницаНач, ГраницаКон, ИмяКурсВалюты);
		ИначеЕсли ТекСпособ = СпособыПересчета.КурсНаНачалоПериода Тогда
			// Курсы на начало
			СоответствиеКурсовВалют_Н = бит_КурсыВалют.КурсыВалютНаДату(ИмяКурсВалюты, МассивВалют, ГраницаНач);
		ИначеЕсли ТекСпособ = СпособыПересчета.КурсНаКонецПериода Тогда
			// Курсы на конец
			СоответствиеКурсовВалют_К = бит_КурсыВалют.КурсыВалютНаДату(ИмяКурсВалюты, МассивВалют, ГраницаКон);
		ИначеЕсли ТекСпособ = СпособыПересчета.СреднийКурсОтчетностиЗаПериод Тогда
			// Средние курсы отчетности
			СоответствиеКурсовВалют_Со = бит_КурсыВалют.СредниеКурсыВалютЗаПериод(МассивВалют, ГраницаНач, ГраницаКон, ИмяКурсВалютыОтчетности);
		ИначеЕсли ТекСпособ = СпособыПересчета.КурсОтчетностиНаНачалоПериода Тогда
			// Курсы отчетности на начало
			СоответствиеКурсовВалют_Но = бит_КурсыВалют.КурсыВалютНаДату(ИмяКурсВалютыОтчетности, МассивВалют, ГраницаНач);
		ИначеЕсли ТекСпособ = СпособыПересчета.КурсОтчетностиНаКонецПериода Тогда
			// Курсы отчетности на конец
			СоответствиеКурсовВалют_Ко = бит_КурсыВалют.КурсыВалютНаДату(ИмяКурсВалютыОтчетности, МассивВалют, ГраницаКон);
		Иначе
			Продолжить;
		КонецЕсли;	
	КонецЦикла;
	
	Для каждого КлючЗначение Из РесурсыДляПересчетов Цикл
		
		ИмяРесурса 		  = КлючЗначение.Ключ;
		ИмяВалютыИсходной = КлючЗначение.Значение;
		
		Для каждого СтрокаТабл Из ТаблицаРезультат Цикл
			
			СпособПересчетаПоКурсам = СтрокаТабл["Ресурс_" + ИмяРесурса + "_СпособПересчетаПоКурсам"];
			Если СпособПересчетаПоКурсам = Перечисления.бит_СпособыПересчетаПоКурсам.НеПересчитывается Тогда
			 	// Если способ = "НеПересчитывается", тогда значение не пересчитывается.
				Продолжить;		
			КонецЕсли;
			
			Если СпособПересчетаПоКурсам = СпособыПересчета.СреднийКурсЗаПериод Тогда
				СоответствиеКурсовВалют = СоответствиеКурсовВалют_С;
			ИначеЕсли СпособПересчетаПоКурсам = СпособыПересчета.КурсНаНачалоПериода Тогда
				СоответствиеКурсовВалют = СоответствиеКурсовВалют_Н;
			ИначеЕсли СпособПересчетаПоКурсам = СпособыПересчета.КурсНаКонецПериода Тогда
				СоответствиеКурсовВалют = СоответствиеКурсовВалют_К;
			ИначеЕсли СпособПересчетаПоКурсам = СпособыПересчета.СреднийКурсОтчетностиЗаПериод Тогда
				СоответствиеКурсовВалют = СоответствиеКурсовВалют_Со;
			ИначеЕсли СпособПересчетаПоКурсам = СпособыПересчета.КурсОтчетностиНаНачалоПериода Тогда
				СоответствиеКурсовВалют = СоответствиеКурсовВалют_Но;
			ИначеЕсли СпособПересчетаПоКурсам = СпособыПересчета.КурсОтчетностиНаКонецПериода Тогда
				СоответствиеКурсовВалют = СоответствиеКурсовВалют_Ко;
			Иначе
				Продолжить;
			КонецЕсли;
			
			// Структура валюты исходной
			Если ИмяВалютыИсходной = Неопределено Или СтрокаТабл[ИмяВалютыИсходной] = ВалютаРегл Тогда
				СтруктураВалНачало = СтруктураВалютыРегл;
			Иначе 	
				СтруктураВалНачало = СоответствиеКурсовВалют.Получить(СтрокаТабл[ИмяВалютыИсходной]);
			КонецЕсли;
			// Структура валюты исходной
			Если ВалютаОтчета = ВалютаРегл Тогда
				СтруктураВалКонец = СтруктураВалютыРегл;
			Иначе 	
				СтруктураВалКонец = СоответствиеКурсовВалют.Получить(ВалютаОтчета);
			КонецЕсли;
			
			Если СтруктураВалНачало = Неопределено Или СтруктураВалКонец = Неопределено Тогда
				ТекстСообщения = НСтр("ru='Обнаружен нулевой курс';en='Detected zero rate'");
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);					
				Продолжить;
			КонецЕсли;
			
			Если ВалютаОтчета = СтруктураВалНачало.Валюта Тогда
				// Если валюты совпадают, то нет смысла пересчитывать.
				Продолжить;
			КонецЕсли; 			
			
			// Пересчет 
			СтрокаТабл[ИмяРесурса] = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТабл[ИмяРесурса]
																			, СтруктураВалНачало.Валюта
																			, СтруктураВалКонец.Валюта 
																			, СтруктураВалНачало.Курс
																			, СтруктураВалКонец.Курс
																			, СтруктураВалНачало.Кратность
																			, СтруктураВалКонец.Кратность);
		КонецЦикла;
																		
	КонецЦикла;																	

КонецПроцедуры // ПересчитатьРесурсыПоКурсам()

//  Процедура формирует соответствие между источниками данных и соответствием колонок 
// источников и таблицы результата.
// 
// Параметры:
//  СпособКомпоновки  - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
// 
// Возвращаемое значение:
//  СоотвИсточников   - Соответствие.
// 
Функция СформироватьСоответствияПолейДляСпособа(СпособКомпоновки)
	
	СоотвИсточников = Новый Соответствие;
	Для каждого СтрокаТаблицы Из СпособКомпоновки.ИсточникиДанных Цикл
		
		СоотвКолонок = СформироватьСоответствиеПолейПоИсточнику(СтрокаТаблицы.ИсточникДанных,СпособКомпоновки.СоответствиеКолонок);
		
		СоотвИсточников.Вставить(СтрокаТаблицы.ИсточникДанных,СоотвКолонок);
		
	КонецЦикла; 
	
	Возврат СоотвИсточников;
КонецФункции // БитСформироватьСоответствияПолейПоИсточникам()

// Процедура формирует соответствие колонок источника и таблицы результата 
// 
// Параметры:
//  ИсточникДанных  - СправочникСсылка.бит_ИсточникиДанныхДляРасчетовБюджетирования.
//  СоответствиеКолонок  - ТабличнаяЧасть.СоответствиеКолонок.
// 
// Возвращаемое значение:
//   СоотвКолонок   - Соответствие.
// 
Функция СформироватьСоответствиеПолейПоИсточнику(ИсточникДанных,СоответствиеКолонок)

	 СоотвКолонок = Новый Соответствие;
	
	 Отбор = Новый Структура;
	 Отбор.Вставить("ИсточникДанных",ИсточникДанных);
	 
	 МассивСтрок = СоответствиеКолонок.НайтиСтроки(Отбор);
	 
	Для каждого СтрокаТаблицы Из МассивСтрок Цикл
	
		СоотвКолонок.Вставить(СтрокаТаблицы.ИмяКолонкиИсточника,СтрокаТаблицы.ИмяКолонки);
	
	КонецЦикла; 

	Возврат СоотвКолонок;
КонецФункции // БитСформироватьСоответствиеПолейПоИсточнику()

// Процедура формирует строки измерений и ресурсов для свертки и вычисления формул.
// 
// Параметры:
//  СпособКомпоновки - СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных.
//  Ресурсы          - Массив.
//  СтрИзмеренияСвертки - Строка.
//  СтрРесурсы          - Строка.
// 
Процедура СформироватьСтрокиИзмеренияРесурсы(СпособКомпоновки,Ресурсы,СтрИзмеренияСвертки,СтрРесурсы)
	
	// Сформируем массив имен измерений для вычислений.
	ИзмеренияДляВычислений = Новый Массив;
	// Обязательные
	ИзмеренияДляВычислений.Добавить("ЭлементДанных");
	ИзмеренияДляВычислений.Добавить("ГруппаЭлементДанных");
	ИзмеренияДляВычислений.Добавить("ВидГруппы");
	ИзмеренияДляВычислений.Добавить("Кодификатор");
	ИзмеренияДляВычислений.Добавить("Коэффициент");
	ИзмеренияДляВычислений.Добавить("Обработана");
	// Настраиваемые
	Для каждого СтрокаИзмерения Из СпособКомпоновки.КолонкиТаблицы Цикл
		
		Если ВРег(СтрокаИзмерения.ВидКолонки) = ВРег("Ресурс") Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Если НЕ СтрокаИзмерения.ИспользоватьВРасчетах Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		ИзмеренияДляВычислений.Добавить(СтрокаИзмерения.ИмяКолонки);
		
	КонецЦикла; 
	
	// Сформируем строку со списком измерений по которым выполняем свертку.
	СтрИзмеренияСвертки = "";
	Для каждого Элемент Из ИзмеренияДляВычислений Цикл
		
		СтрИзмеренияСвертки = бит_СтрокиКлиентСервер.ДобавитьСтрокуСРазделителем(СтрИзмеренияСвертки,Элемент,",");
		
	КонецЦикла; 
	
	// Строка список ресурсов
	СтрРесурсы = "";
	Для каждого Элемент Из Ресурсы  Цикл
		
		СтрРесурсы = бит_СтрокиКлиентСервер.ДобавитьСтрокуСРазделителем(СтрРесурсы,Элемент,",");
		СтрРесурсы = бит_СтрокиКлиентСервер.ДобавитьСтрокуСРазделителем(СтрРесурсы,Элемент+"Исходный",",");		 
		
	КонецЦикла; 
	
КонецПроцедуры // СформироватьСтрокиИзмеренияРесурсы()

// Процедура выполняет обход по иерархии дерева с группами и формулами.
// 
// Параметры:
//  СтрокаДереваВерх  - СтрокаДереваЗначений.
//  ТаблицаРезультат  - ТаблицаЗначений.
//  Ресурсы           - Массив.
// 
Процедура ОбойтиИерархию(СтрокаДереваВерх,ТаблицаРезультат,Ресурсы)

	Для каждого СтрокаДерева Из СтрокаДереваВерх.Строки Цикл
		
		Если СтрокаДерева.ВидГруппы = Перечисления.бит_ВидыГруппДанных.Группировка Тогда
			ДобавитьГруппуВТаблицуРезультат(СтрокаДерева,ТаблицаРезультат,Ресурсы);
		ИначеЕсли СтрокаДерева.ВидГруппы = Перечисления.бит_ВидыГруппДанных.Формула Тогда	
			ВыполнитьРасчетСтрокиПоФормуле(СтрокаДерева,ТаблицаРезультат,Ресурсы);
		КонецЕсли; 
		
	КонецЦикла; 
	 
КонецПроцедуры // ОбойтиГруппировкуПоИерархии()

// Процедура добавляет в таблицу-результат группы, соответствующие элементам данных вида "Группировка".
// Производится вычисление сумм по иерархии.
// 
// Параметры:
//  СтрокаДереваВерх  - СтрокаДереваЗначений.
//  ТаблицаРезультат  - ТаблицаЗначений.
//  Ресурсы           - Массив.
// 
Процедура ДобавитьГруппуВТаблицуРезультат(СтрокаДереваВерх,ТаблицаРезультат,Ресурсы)

	Если СтрокаДереваВерх = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если СтрокаДереваВерх.Обработана Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущаяГруппа = СтрокаДереваВерх.Группа;
	
	СтрокаРезультат = ТаблицаРезультат.Найти(ТекущаяГруппа,"ЭлементДанных");
	
	Если СтрокаРезультат = Неопределено Тогда
		СтрокаРезультат = ТаблицаРезультат.Добавить();
		СтрокаРезультат.ГруппаЭлементДанных = ТекущаяГруппа.Родитель;
		СтрокаРезультат.ЭлементДанных       = ТекущаяГруппа;
		СтрокаРезультат.Кодификатор         = ТекущаяГруппа.Кодификатор;
		СтрокаРезультат.Коэффициент         = ТекущаяГруппа.Коэффициент;
		СтрокаРезультат.ВидГруппы           = ТекущаяГруппа.ВидГруппы;
	КонецЕсли; 
	
	Если СтрокаРезультат.Обработана Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	ОбойтиИерархию(СтрокаДереваВерх,ТаблицаРезультат,Ресурсы);
	
	Итоги          = Новый Структура;
	Для каждого ИмяРесурса Из Ресурсы Цикл
		Итоги.Вставить(ИмяРесурса,0);
	КонецЦикла; 	
	
	СтрОтбор = Новый Структура;
	СтрОтбор.Вставить("ГруппаЭлементДанных",ТекущаяГруппа);
	
	МассивСтрок = ТаблицаРезультат.НайтиСтроки(СтрОтбор);
	
	
	Для каждого СтрокаТаблицы Из МассивСтрок Цикл
		
		Для каждого ИмяРесурса Из Ресурсы Цикл
			
			Итоги[ИмяРесурса] = Итоги[ИмяРесурса]+СтрокаТаблицы[ИмяРесурса];			
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Для каждого ИмяРесурса Из Ресурсы Цикл
		СтрокаРезультат[ИмяРесурса+"Исходный"] = Итоги[ИмяРесурса];
		СтрокаРезультат[ИмяРесурса]            = Итоги[ИмяРесурса]*СтрокаРезультат.Коэффициент;		
	КонецЦикла;

	СтрокаРезультат.Обработана  = Истина;
	СтрокаДереваВерх.Обработана = Истина;
	
КонецПроцедуры // ДобавитьГруппу()

// Функция формирует имя колонки аргумента.
// 
// Параметры:
//  КодЭлементаДанных - Строка
// 
// Возвращаемое значение:
//  ИмяКолонки - Строка.
// 
Функция ИмяКолонкиАргумента(КодЭлементаДанных)
	
	ИмяКолонки = "Аргумент_"+СтрЗаменить(КодЭлементаДанных,"-","_");
	
	Возврат ИмяКолонки;
	
КонецФункции // ИмяКолонкиАргумента()

// Выполняет расчет по строке расчета по формуле. Вызывается рекурсивно.
// 
// Параметры:
// 
// СтрокаРасчета - СправочникСсылка.бит_ЭлементыДанных - группа.
// ТаблицаРезультат - ТаблицаЗначений.
// Ресурсы          - Массив - Содержит имена ресурсов способа компоновки .
// 
Процедура ВыполнитьРасчетСтрокиПоФормуле(СтрокаДереваВерх,ТаблицаРезультат,Ресурсы)
	
	Если СтрокаДереваВерх = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если СтрокаДереваВерх.Обработана Тогда
		Возврат;
	КонецЕсли; 
	
	СтрокаРасчета = СтрокаДереваВерх.Группа;
	
	ОписаниеТиповЧисла20 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(20,4));
		
	ТаблицаЗначенийАргументов = Новый ТаблицаЗначений;
	ТаблицаЗначенийАргументов.Колонки.Добавить("ИмяРесурса");
	
	Измерения = Новый Массив;
	
	Для Каждого Колонка Из ТаблицаРезультат.Колонки Цикл
		Если Ресурсы.Найти(Колонка.Имя)=Неопределено
             И Найти(Колонка.Имя,"Исходный")= 0	
			 И Колонка.Имя <> "Обработана" 	
			 И Колонка.Имя <> "ВидГруппы" 			 			 
			 И Колонка.Имя <> "ГруппаЭлементДанных" 
			 И Колонка.Имя <> "ЭлементДанных"
			 И Колонка.Имя <> "Коэффициент"
			 И Колонка.Имя <> "Кодификатор" Тогда
			ТаблицаЗначенийАргументов.Колонки.Добавить(Колонка.Имя);
			Измерения.Добавить(Колонка.Имя);
		КонецЕсли; 
	КонецЦикла;	
	
	// Формируем колонки для хранения аргрументов расчета. 
	Для каждого Аргумент Из СтрокаРасчета.СтрокиРасчетаДляФормулы Цикл
		Если Аргумент.СтрокаРасчета.ВидГруппы = Перечисления.бит_ВидыГруппДанных.Формула Тогда
			// Выполняем расчет сначала для строк-аргументов.
			ДеревоДанных = СтрокаДереваВерх.Владелец();
			СтрокаДерева = ДеревоДанных.Строки.Найти(Аргумент.СтрокаРасчета,"Группа",Истина);
			ВыполнитьРасчетСтрокиПоФормуле(СтрокаДерева,ТаблицаРезультат,Ресурсы);
		ИначеЕсли Аргумент.СтрокаРасчета.ВидГруппы = Перечисления.бит_ВидыГруппДанных.Группировка Тогда
			// Добавляем аргументы - группы
			ДеревоДанных = СтрокаДереваВерх.Владелец();
			СтрокаДерева = ДеревоДанных.Строки.Найти(Аргумент.СтрокаРасчета,"Группа",Истина);						
			ДобавитьГруппуВТаблицуРезультат(СтрокаДерева,ТаблицаРезультат,Ресурсы);
		КонецЕсли;
		
		ИмяКолонки = ИмяКолонкиАргумента(Аргумент.СтрокаРасчета.Код);
		ТаблицаЗначенийАргументов.Колонки.Добавить(ИмяКолонки,ОписаниеТиповЧисла20);
		
	КонецЦикла;
	
	// Заполним таблицу аргрументов
	
	Для каждого Аргумент Из СтрокаРасчета.СтрокиРасчетаДляФормулы Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЭлементДанных",Аргумент.СтрокаРасчета);
		
		МассивСтрок = ТаблицаРезультат.НайтиСтроки(СтруктураОтбора);
		
		Для каждого СтрокаДанные Из МассивСтрок Цикл
			
			Для каждого Ресурс Из Ресурсы Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("ИмяРесурса",Ресурс);
				Для каждого Измерение Из Измерения Цикл
				
					Отбор.Вставить(Измерение,СтрокаДанные[Измерение]);
				
				КонецЦикла; // По измерениям
				
				МассивСтрокАргументы = ТаблицаЗначенийАргументов.НайтиСтроки(Отбор);
				Если МассивСтрокАргументы.Количество()>0 Тогда
					СтрокаАргумент = МассивСтрокАргументы[0];
				Иначе	
					СтрокаАргумент = ТаблицаЗначенийАргументов.Добавить();
					СтрокаАргумент.ИмяРесурса = Ресурс;
					Для каждого Измерение Из Измерения Цикл
					
						СтрокаАргумент[Измерение] = СтрокаДанные[Измерение];
					
					КонецЦикла; // По измерениям
				КонецЕсли; 
				
				ИмяКолонки = ИмяКолонкиАргумента(Аргумент.СтрокаРасчета.Код);
				СтрокаАргумент[ИмяКолонки] = СтрокаАргумент[ИмяКолонки]+СтрокаДанные[Ресурс];
				
			КонецЦикла; 
			
		КонецЦикла; // По строкам данных
		
	КонецЦикла; // По аргументам - группам, которые участвуют в формуле.
	
	
	
	// Выполним вычисления и занесем данные в ТаблицуРезультат.
	Для каждого СтрокаТабл Из ТаблицаЗначенийАргументов Цикл
		Формула   = СтрокаРасчета.Формула;
		
		// На случай, если элементы данных кодируются с префиксами ИБ.
		Аргументы = бит_МеханизмПолученияДанныхКлиентСервер.РазобратьФормулу(Формула);
		
		Для каждого ЧтоЗаменить Из Аргументы Цикл
			
			НаЧтоЗаменить = СтрЗаменить(ЧтоЗаменить,"-","_");
			Формула   	  = СтрЗаменить(Формула,ЧтоЗаменить,НаЧтоЗаменить);
			
		КонецЦикла; 
		
		Для каждого КолонкаТабл Из ТаблицаЗначенийАргументов.Колонки Цикл
			Если КолонкаТабл.Имя = "ИмяРесурса" Тогда
				Продолжить;
			КонецЕсли;
			Формула = СтрЗаменить(Формула,"["+Сред(КолонкаТабл.Имя,10)+"]",Формат(СтрокаТабл[КолонкаТабл.Имя],"ЧРД=.; ЧН=0; ЧГ=0"));
			
		КонецЦикла;
		Формула = СтрЗаменить(Формула,"@",",");					
		Попытка
			// АПК:488-выкл ВычислитьВБезопасномРежиме не используется, чтобы избежать вызова ОбщийМодуль рекурсивно.
			Результат = Вычислить(Формула);
			// АПК:488-вкл
		Исключение
			Результат = 0;
			
			ТекстСообщения = НСтр("ru='Ошибка вычисления выражения ""%1"", до обработки ""%2"", элемент данных ""%3"". Причина: %4.';
							 	  |en='Error evaluating expression ""%1"", before processing ""%2"", data item ""%3"". Reason: %4.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Формула, СтрокаРасчета.Формула, СтрокаРасчета.Наименование, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЭлементДанных",СтрокаРасчета);
		Для каждого Измерение Из Измерения Цикл
			Отбор.Вставить(Измерение,СтрокаТабл[Измерение]);
		КонецЦикла; // По измерениям
		
		МассивСтрок = ТаблицаРезультат.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество()>0 Тогда
			СтрокаРезультат = МассивСтрок[0];
		Иначе
			СтрокаРезультат = ТаблицаРезультат.Добавить();
			СтрокаРезультат.ГруппаЭлементДанных = СтрокаРасчета.Родитель;
			СтрокаРезультат.Кодификатор         = СтрокаРасчета.Кодификатор;
			СтрокаРезультат.Коэффициент         = СтрокаРасчета.Коэффициент;
			СтрокаРезультат.ЭлементДанных       = СтрокаРасчета;
			СтрокаРезультат.ВидГруппы           = СтрокаРасчета.ВидГруппы;
			Для каждого Измерение Из Измерения Цикл
				
				СтрокаРезультат[Измерение] = СтрокаТабл[Измерение];
				
			КонецЦикла; // По измерениям
		КонецЕсли; 
		
		Если СтрокаРезультат <> Неопределено Тогда
			
			СтрокаРезультат[СтрокаТабл.ИмяРесурса+"Исходный"] = Результат;
			СтрокаРезультат[СтрокаТабл.ИмяРесурса]            = Результат*СтрокаРезультат.Коэффициент;
			СтрокаРезультат.Обработана                        = Истина;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	СтрокаДереваВерх.Обработана = Истина;
	
КонецПроцедуры

// Функция выполняет расчет значения по формуле в произвольном отчете.
// 
// Параметры:
//  СтрокаПравил - СтрокаТабличнойЧасти.ПравилаЗаполнения.
//  Формула 	 - Строка.
//  ЕстьОшибки 	 - Булево.
//  Заголовок 	 - Строка.
// 
// ВозвращаемоеЗначение:
//  Число - результат выполнения формулы.
// 
Функция РезультатФормулы(СтрокаПравил, Формула, ЕстьОшибки, Заголовок)

	// Вычисление результата по формуле.
	Попытка
		// АПК:488-выкл ВычислитьВБезопасномРежиме не используется, чтобы избежать вызова ОбщийМодуль рекурсивно.
		Результат = Вычислить(Формула);
		// АПК:488-вкл
	Исключение
		Результат = 0;
		ЕстьОшибки = Истина;
		ТекстСообщения = НСтр("ru='Ошибка вычисления выражения - %1, выражение - %2. По причине: %3';
							  |en='Error evaluating the expression -%1 expression -%2. For a reason: %3'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Формула, СтрокаПравил.Формула, 
								   ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ТекстСообщения = Заголовок + ?(ПустаяСтрока(Заголовок), ТекстСообщения, Символы.ПС + ТекстСообщения); 												
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;		
		
	Возврат Результат;
			
КонецФункции

// Процедура сохраняет значение формулы в таблицу "ТаблицаДанныеОтчета".
// 
// Параметры:
//  ТаблицаДанныеОтчета - ТаблицаЗначений.
//  Результат			- Число.
//  СтрокаПравил 		- СтрокаТабличнойЧасти.ПравилаЗаполнения.
//  СтрокаАргумент 	 	- СтрокаТаблицыЗначений.
//  НастройкиАналитик 	- Структура.
// 
Процедура СохранитьРезультатФормулы(ТаблицаДанныеОтчета, Результат, СтрокаПравил, СтрокаАргумент = Неопределено, НастройкиАналитик = Неопределено)
	
	// Сохранение значение формулы в таблицу "ТаблицаДанныеОтчета".
	СтрОтбор = Новый Структура;
	СтрОтбор.Вставить("ИмяОбласти", СтрокаПравил.ИмяОбласти);
	НайденныеСтроки = ТаблицаДанныеОтчета.НайтиСтроки(СтрОтбор);		
	Если НайденныеСтроки.Количество() = 0 Тогда			
		// Добавим вычисленное значение в таблицу аргументов.
		НоваяСтрока = ТаблицаДанныеОтчета.Добавить();
		НоваяСтрока.ИмяОбласти           = СтрокаПравил.ИмяОбласти;			
		НоваяСтрока.ВидЯчейки            = СтрокаПравил.ВидЯчейки;
		НоваяСтрока.ПоказательОтчета     = СтрокаПравил.Ссылка;
		НоваяСтрока.ЗначениеПоказателя   = Результат;
		НоваяСтрока.ИД                   = Строка(Новый УникальныйИдентификатор);			
		ЗаполнитьЗначенияПоУмолчаниюСтрокиТаблицыДанных(НоваяСтрока);
		Если СтрокаАргумент <> Неопределено Тогда
			Для каждого КиЗ Из НастройкиАналитик Цикл
				ИмяАналитики = КиЗ.Ключ;
				Если НЕ ЗначениеЗаполнено(НоваяСтрока[ИмяАналитики]) Тогда
					НоваяСтрока[ИмяАналитики] = СтрокаАргумент[ИмяАналитики];
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли;
	Иначе
		НайденныеСтроки[0].ЗначениеПоказателя = НайденныеСтроки[0].ЗначениеПоказателя + Результат;
	КонецЕсли;
				
КонецПроцедуры
		
// Функция выполняет расчет значения по формуле в произвольном отчете.
// 
// Параметры:
//  СтрокаПравил  	  - СтрокаТабличнойЧасти.ПравилаЗаполнения.
//  ПравилаЗаполнения - ТабличнаяЧасть.ПравилаЗаполнения.
// 
// ВозвращаемоеЗначение:
//  Число или строка - результат выполнения формулы или строка об ошибке.
// 
Функция ВыполнитьРасчетПоФормуле(СтрокаПравил, ПравилаЗаполнения, ТаблицаДанныеОтчета, НастройкиАналитик, УровеньРекурсии=0)
	
	Заголовок = НСтр("ru = 'Ошибка при вычислении формулы показателя ""%1"":'; 
							|en = 'Error calculating formula of indicator ""%1"":'");
	Заголовок = СтрШаблон(Заголовок, СтрокаПравил.ИмяОбласти) + " "; 
	
	СуммаИтог  = 0;
	ЕстьОшибки = Ложь;
		
	// Защита от зацикливания
	Если УровеньРекурсии > 1000 Тогда	
		ТекстСообщения = НСтр("ru='Превышен уровень рекурсии. Проверьте настройки формул на зацикливание.';
						 	  |en='Recursion level exceeded. Check your formula settings for looping.'");
		ТекстСообщения = Заголовок + ?(ПустаяСтрока(Заголовок), "", Символы.ПС) + ТекстСообщения;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Заголовок = "";
	    Возврат СуммаИтог;		
	КонецЕсли; 
	УровеньРекурсии = УровеньРекурсии + 1;
		
	Если СтрокаПравил.ВидЯчейки <> Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Формула Тогда
		Возврат СуммаИтог;
	КонецЕсли;
	
	// Если значение уже вычислено выходим 
	СтрокаАргумент = Неопределено;
	СтрОтбор = Новый Структура;
	СтрОтбор.Вставить("ИмяОбласти",СтрокаПравил.ИмяОбласти);
	
	НайденныеСтроки = ТаблицаДанныеОтчета.НайтиСтроки(СтрОтбор);
	Если НайденныеСтроки.Количество() > 0 Тогда		
		Для каждого СтрокаДанные Из НайденныеСтроки Цикл
			СуммаИтог = СуммаИтог + СтрокаДанные.ЗначениеПоказателя;
		КонецЦикла; 	
		Возврат СуммаИтог;
	КонецЕсли; 
		
	Формула 			 = СтрокаПравил.Формула; 
	МассивИменАргументов = бит_МеханизмПолученияДанныхКлиентСервер.РазобратьФормулу(Формула);
	// BF-5643. Массив аргументов должен быть без повторов.
	МассивИменАргументов = бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивИменАргументов);
	Если МассивИменАргументов.Количество() = 0 Тогда
		
		Результат = РезультатФормулы(СтрокаПравил, Формула, ЕстьОшибки, Заголовок); 		
		СуммаИтог = СуммаИтог + Результат;
		
		СохранитьРезультатФормулы(ТаблицаДанныеОтчета, Результат, СтрокаПравил);
		
	Иначе
		
		// Инициализация таблицы аргументов
		ОписаниеЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(20,4));
		
		// Формирование таблицы аргументов
		ТаблицаАргументы = Новый ТаблицаЗначений;
		Для каждого КиЗ Из НастройкиАналитик Цикл
			ТаблицаАргументы.Колонки.Добавить(КиЗ.Ключ,КиЗ.Значение.ТипЗначения);
		КонецЦикла; 
		
		Для каждого ИмяАргумента Из МассивИменАргументов Цикл
			ИмяКолонки = "Аргумент_" + ИмяАргумента;
			Если ТаблицаАргументы.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
				ТаблицаАргументы.Колонки.Добавить(ИмяКолонки,ОписаниеЧисло);
			КонецЕсли;
		КонецЦикла; 
		
		АналитикиПоУмолчанию = Новый Соответствие;
		Для каждого СтрокаАналитики Из СтрокаПравил.Ссылка.ЗначенияПоУмолчанию  Цикл
			АналитикиПоУмолчанию.Вставить(СтрокаАналитики.ИмяАналитики, СтрокаАналитики.ЗначениеАналитики);
		КонецЦикла; 
		
		// Заполняем таблицу аргументов
		Для каждого ИмяАргумента Из МассивИменАргументов Цикл
		
			СтрОтбор = Новый Структура;
			СтрОтбор.Вставить("ИмяОбласти",ИмяАргумента);
			НайденныеДанные = ТаблицаДанныеОтчета.НайтиСтроки(СтрОтбор);
			
	        Если НайденныеДанные.Количество()=0 Тогда
				
				// Не удалось найти аргументы для расчета
				// возможно, аргументом является другая формула, которую нужно вычислить.
				СтрокаПравилФормула = ПравилаЗаполнения.Найти(ИмяАргумента,"ИмяОбласти");
				Если СтрокаПравилФормула <> Неопределено  Тогда
					
					ВыполнитьРасчетПоФормуле(СтрокаПравилФормула, ПравилаЗаполнения, 
											 ТаблицаДанныеОтчета, НастройкиАналитик, УровеньРекурсии);
				Иначе
														  
					СуммаИтог = 0;
					ТекстСообщения = НСтр("ru='Не найдена строка правил для расчета аргумента ""%1"", аргументу присвоено значение 0.';
										  |en='Cant find calculating rules for argument ""%1"", the value was set to 0.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяАргумента);
					ТекстСообщения = Заголовок + ?(ПустаяСтрока(Заголовок), "", Символы.ПС) + ТекстСообщения;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
					Заголовок = "";
				КонецЕсли; 

				// После вычисления повторяем поиск аргументов.
			    НайденныеДанные = ТаблицаДанныеОтчета.НайтиСтроки(СтрОтбор);
			КонецЕсли; 
			
			Для каждого СтрокаДанные Из НайденныеДанные Цикл
				// Заполним значения аргумента
				Если ТаблицаАргументы.Количество() = 0 Тогда
					СтрокаАргументы = ТаблицаАргументы.Добавить();
				Иначе	
					СтрокаАргументы = ТаблицаАргументы[0];
				КонецЕсли; 
				СтрокаАргументы["Аргумент_" + ИмяАргумента] = СтрокаАргументы["Аргумент_" + ИмяАргумента] + СтрокаДанные.ЗначениеПоказателя;
			КонецЦикла; // По найденным данным
			
		КонецЦикла; // По аргументам
			
		// Производим вычисления независимо для каждой комбинации аналитик.
		Для каждого СтрокаАргумент Из ТаблицаАргументы Цикл
			
			ВремФормула = Формула;
			
			Для каждого ИмяАргумента Из МассивИменАргументов Цикл
				ЧтоЗаменить   = "[" + ИмяАргумента + "]";
				НаЧтоЗаменить = Формат(СтрокаАргумент["Аргумент_" + ИмяАргумента], "ЧРД=.; ЧН=0; ЧГ=0");
				ВремФормула   = СтрЗаменить(ВремФормула, ЧтоЗаменить, НаЧтоЗаменить);
			КонецЦикла; 
			
			ВремФормула = СтрЗаменить(ВремФормула, "@", ",");
			
			// Вычисляем результат по формуле.
			Результат = РезультатФормулы(СтрокаПравил, ВремФормула, ЕстьОшибки, Заголовок); 		
			СуммаИтог = СуммаИтог + Результат;	
			
			СохранитьРезультатФормулы(ТаблицаДанныеОтчета, Результат, СтрокаПравил, СтрокаАргумент, НастройкиАналитик);
			
		КонецЦикла; // По таблице аргументов
					
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		СуммаИтог = СтрШаблон(НСтр("ru='%1Ошибка%1';en='%1Error%1'"), "!");
	КонецЕсли;
	
	Возврат СуммаИтог;
	
КонецФункции // ВыполнитьРасчетПоФормуле() 

// Получим представление периода отчета.
// 
Функция ОписаниеПериода(ДатаНачала,ДатаОкончания)

	ОписаниеПериода = "";
	
	Если ДатаНачала = '00010101000000' И ДатаОкончания = '00010101000000' Тогда
		ОписаниеПериода = НСтр("ru='Период: без ограничения.'en='Period: unlimited.'");
	Иначе
		Если ДатаНачала = '00010101000000' ИЛИ ДатаОкончания = '00010101000000' Тогда
			ПредставлениеПустойДаты = НСтр("ru='без ограничения';en='unlimited'");
			ФорматнаяСтрока         = "ДЛФ='дд.ММ.гггг'; ДП=<%1>";
			ФорматнаяСтрока         = СтрШаблон(ФорматнаяСтрока, ПредставлениеПустойДаты);			
			ОписаниеПериода = НСтр("ru='Период: %1 - %2';en='Period: %1 - %2'");
			ОписаниеПериода = СтрШаблон(ОписаниеПериода, Формат(ДатаНачала, ФорматнаяСтрока), Формат(ДатаОкончания, ФорматнаяСтрока));
		Иначе
			ОписаниеПериода = НСтр("ru='Период: %1';en='Period: %1'");
			ОписаниеПериода = СтрШаблон(ОписаниеПериода, ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания), "ФП = Истина"));
		КонецЕсли;
	КонецЕсли;

	Возврат ОписаниеПериода;

КонецФункции // ОписаниеПериода()

// Получим представление периода отчета.
// 
Функция ОписаниеПериодаМСФО(ДатаОкончания,Язык)

	ОписаниеПериода = "";
	
	КодЯзыка = Справочники.бит_Языки.ПолучитьКодЯзыка(Язык);
	
	Если НачалоДня(ДатаОкончания) = Дата(Год(ДатаОкончания), 12, 31) Тогда
		// АПК:1299-выкл Локализация определяется по переданному параметру.
		ОписаниеПериода = НСтр("ru = ' год, окончившийся'; en = ' year ended'", КодЯзыка);
		// АПК:1299-вкл
	ИначеЕсли НачалоДня(ДатаОкончания) = Дата(Год(ДатаОкончания), 03, 31) Тогда
		// АПК:1299-выкл Локализация определяется по переданному параметру.
		ОписаниеПериода = НСтр("ru = ' три месяца, окончившихся'; en = ' three months ending'", КодЯзыка);
		// АПК:1299-вкл
	ИначеЕсли НачалоДня(ДатаОкончания) = Дата(Год(ДатаОкончания), 06, 30) Тогда
		// АПК:1299-выкл Локализация определяется по переданному параметру.
		ОписаниеПериода = НСтр("ru = ' шесть месяцев, окончившихся'; en = ' six months ending'", КодЯзыка);
		// АПК:1299-вкл
	ИначеЕсли НачалоДня(ДатаОкончания) = Дата(Год(ДатаОкончания), 09, 30) Тогда
		// АПК:1299-выкл Локализация определяется по переданному параметру.
		ОписаниеПериода = НСтр("ru = ' девять месяцев, окончившихся'; en = ' nine months ending'", КодЯзыка);
		// АПК:1299-вкл
	Иначе
		// АПК:1299-выкл Локализация определяется по переданному параметру.
		ОписаниеПериода = Формат(ДатаОкончания,"Л=" + КодЯзыка + ";ДЛФ=D");
		// АПК:1299-вкл
	КонецЕсли;
	
	Возврат ОписаниеПериода;
	
КонецФункции // ОписаниеПериодаМСФО()
	
// Процедура заполняет значения по умолчанию в строке таблицы данных.
// 
// Параметры:
//  ТекущаяСтрока
// 
Процедура ЗаполнитьЗначенияПоУмолчаниюСтрокиТаблицыДанных(ТекущаяСтрока)
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ПоказательОтчета) Тогда
		
		Показатель = ТекущаяСтрока.ПоказательОтчета;
		
		ТекущаяСтрока.ПериодДанных = Показатель.ПериодДанных;
		
		ТекущаяСтрока.ФормироватьДвиженияПоБюджету = Показатель.ФормироватьДвиженияПоБюджету;
		
		Для каждого СтрокаТаблицы Из Показатель.ЗначенияПоУмолчанию Цикл
			
			ТекущаяСтрока[СтрокаТаблицы.ИмяАналитики] = СтрокаТаблицы.ЗначениеАналитики;
			
		КонецЦикла; // Показатель.ЗначенияПоУмолчанию
		
	КонецЕсли; 
	
КонецПроцедуры // ЗаполнитьЗначенияПоУмолчаниюСтрокиТаблицыДанных()	

Функция КолонкаСодержитТолькоЧисловыеЗначения(Колонка, ТаблицаДанных)
	
	ОписаниеЧисла = Тип("Число");
	
	ОписаниеТиповКолонки = Колонка.ТипЗначения;
	Если НЕ ОписаниеТиповКолонки.СодержитТип(ОписаниеЧисла) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КоличествоТипов       = ОписаниеТиповКолонки.Типы().Количество();
	НеобходимоИДостаточно = 1;
	
	Если КоличествоТипов = НеобходимоИДостаточно Тогда
		Возврат Истина; // Единственный тип - число.
	КонецЕсли;
	
	Если ОписаниеТиповКолонки.СодержитТип(Тип("NULL")) Тогда 
		НеобходимоИДостаточно = НеобходимоИДостаточно + 1;
	КонецЕсли;
	Если ОписаниеТиповКолонки.СодержитТип(Тип("Неопределено")) Тогда 
		НеобходимоИДостаточно = НеобходимоИДостаточно + 1;
	КонецЕсли;
	
	Если КоличествоТипов = НеобходимоИДостаточно Тогда
		Возврат Истина; // Только числа, либо незаполненные значения.
	КонецЕсли;
	
	// В противном случае требуется перебор значений.
	Для каждого СтрокаДанных Из ТаблицаДанных Цикл
		ПроверяемоеЗначения = СтрокаДанных[Колонка.Имя];
		Если ЗначениеЗаполнено(ПроверяемоеЗначения)
			И ТипЗнч(ПроверяемоеЗначения) <> ОписаниеЧисла Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ФорматДеньМесяцПрописьюГод(Дата, КодЯзыка)
	
	Возврат Формат(Дата, НСтр("ru='Л=ru; ДФ=''dd MMMM yyyy''';en='Л=en; ДФ=''dd MMMM yyyy'''", КодЯзыка)); 
	
КонецФункции

// Возвращает представление месяца в национальном формате
//
Функция ФорматМесяцПрописью(Дата, КодЯзыка)
	
	Возврат Формат(Дата, НСтр("ru='Л=ru; ДФ=ММММ';en='Л=en; ДФ=ММММ'", КодЯзыка));
	
КонецФункции

Функция ФорматДень(Дата, КодЯзыка)
	
	Возврат Формат(Дата, НСтр("ru='ДФ=''dd''';en='ДФ=''dd'''", КодЯзыка));
КонецФункции

Функция ФорматГод(Дата, КодЯзыка)
	
	Возврат Формат(Дата, НСтр("ru='ДФ=''yyyy''';en='ДФ=''yyyy'''", КодЯзыка));
	
КонецФункции

// Функция получает массив подстановок
// 
// Параметры: 
//  ПарамСтрока       - Строка                   Строка для получения массива подстановок.
// 
// Возвращаемое значение:
//  Возврат МассивПодстановок - Массив              Массив подстановок.
// 
Функция Подстановки(ПарамСтрока, ОткрывающийТэг = "[", ЗакрывающийТэг = "]")
	
	МассивПодстановок = Новый Массив();
	ДлинаОткрывающегоТэга = СтрДлина(ОткрывающийТэг);
	
	ВремСтрока = ПарамСтрока;
	Поз = Найти(ВремСтрока, ОткрывающийТэг);
	Пока НЕ Поз = 0 Цикл
		ВремСтрока = Сред(ВремСтрока, Поз + ДлинаОткрывающегоТэга);
		Поз = Найти(ВремСтрока, ЗакрывающийТэг);
		МассивПодстановок.Добавить(Лев(ВремСтрока, Поз - 1));
		Поз = Найти(ВремСтрока, ОткрывающийТэг);
	КонецЦикла;
	
	Возврат МассивПодстановок;
	
КонецФункции

#КонецОбласти