
&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("НастроитьЗависимыеЭлементыФормы")
Процедура бит_НастроитьЗависимыеЭлементыФормы(Форма, СписокРеквизитов)

	Элементы = Форма.Элементы;

	Инициализация = ПустаяСтрока(СписокРеквизитов);
	СтруктураРеквизитов = Новый Структура(СписокРеквизитов);

	Если Инициализация
		Или СтруктураРеквизитов.Свойство("Количество") Тогда

		ОбновитьКоличествоКРаспределению(Форма);
		
		#Удаление // {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] +        
		
		Элементы.КоличествоБрак.МаксимальноеЗначение      = Форма.КоличествоБрак + Форма.КоличествоКРаспределению;
		Элементы.КоличествоГотово.МаксимальноеЗначение    = Форма.КоличествоГотово + Форма.КоличествоКРаспределению;
		Элементы.КоличествоОтменено.МаксимальноеЗначение  = Форма.КоличествоОтменено + Форма.КоличествоКРаспределению; 
		
		#КонецУдаления // }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] -
		
		Элементы.ГруппаБыстрыеКоманды.Доступность         = Форма.КоличествоКРаспределению > 0;
		Элементы.ФормаПрименить.Доступность = (Форма.КоличествоГотово > 0 ИЛИ Форма.КоличествоБрак > 0 ИЛИ Форма.КоличествоОтменено > 0);

	КонецЕсли;

	Если Инициализация
		Или СтруктураРеквизитов.Свойство("ИнформационнаяПанель") Тогда

		Элементы.ГруппаИнформационнаяПанель.Видимость = ЗначениеЗаполнено(Элементы.ИнформационнаяПанельНадпись.Заголовок);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПроверитьЗаполнениеРеквизитов")
Функция бит_ПроверитьЗаполнениеРеквизитов()
	
	ЕстьОшибки = Ложь;
	
	#Удаление // {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] +
	
	Если (КоличествоБрак + КоличествоГотово + КоличествоОтменено) > КоличествоКВыполнению Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Превышено доступное к выполнению количество';
		|en = 'The quantity available for execution is exceeded'"),,"КоличествоКВыполнению",,ЕстьОшибки);
	КонецЕсли;
	
	#КонецУдаления // }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] -
	
	Возврат НЕ ЕстьОшибки;
		
КонецФункции

&НаКлиенте
Процедура бит_КоличествоГотовоПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] +        
	
	ПересчитатьНормативы = Истина; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] -
	
КонецПроцедуры
