#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// {{ПервыйБИТ ЛистТребований [ЛТ6.9] [Микляев К.А.] [03.06.2026] +

&После("ДобавитьКомандыПечати")
Процедура бит_ДобавитьКомандыПечати(КомандыПечати)
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_ПечатьБегункаЭтапаПроизводства";
	КомандаПечати.Представление = "Печать бегунка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

&После("Печать")
Процедура бит_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "бит_ПечатьБегункаЭтапаПроизводства") Тогда
		ТабличныйДокумент = бит_ПечатьПроизводственныхЗаданийСервер.СформироватьПечатнуюФормуЭтапов(МассивОбъектов, ПараметрыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"бит_ПечатьБегункаЭтапаПроизводства",
			"Печать бегунка",
			ТабличныйДокумент,
			Неопределено,
			"ОбщийМакет.бит_ПФ_Основная");
	КонецЕсли;
	
КонецПроцедуры

// }}ПервыйБИТ ЛистТребований [ЛТ6.9] [Микляев К.А.] [03.06.2026] -
#КонецЕсли
