#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  МассивРеквизитов - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить("СтруктурнаяЕдиницаРегл");
	
	Возврат МассивРеквизитов;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция РеквизитыКонтролируемыеПриСинхронизации() Экспорт

	Реквизиты = Метаданные.Справочники.Подразделения.Реквизиты;
	
	КонтролируемыеРеквизиты = Новый Структура;
	КонтролируемыеРеквизиты.Вставить("Наименование", 		   НСтр("ru = 'Наименование'"));
	КонтролируемыеРеквизиты.Вставить("СтруктурнаяЕдиницаРегл", Реквизиты.СтруктурнаяЕдиницаРегл.Представление());
	КонтролируемыеРеквизиты.Вставить("ПометкаУдаления", 	   НСтр("ru = 'Пометка удаления'"));
	КонтролируемыеРеквизиты.Вставить("ЯвляетсяЮрЛицом", 	   Реквизиты.ЯвляетсяЮрЛицом.Представление());
	КонтролируемыеРеквизиты.Вставить("Родитель", 			   НСтр("ru = 'Группа'"));
	
	Возврат КонтролируемыеРеквизиты;

КонецФункции

#КонецОбласти

#КонецЕсли
