Процедура УстановитьКоличествоХодовИВремя(Операции, КоличествоХодов = Неопределено, ВремяВыполнения = Неопределено, Количество = Неопределено, Коэффициент = 1) Экспорт 

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Операции.Подразделение КАК Подразделение,
	|	Операции.Этап КАК Этап,
	|	Операции.Операция КАК Операция,
	|	Операции.ИдентификаторОперации КАК ИдентификаторОперации,
	|	Операции.СменноеЗадание КАК СменноеЗадание,
	|	Операции.Исполнитель КАК Исполнитель,
	|	Операции.РабочийЦентр КАК РабочийЦентр,
	|	Операции.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	Операции.НазначатьНеРанее КАК НазначатьНеРанее,
	|	Операции.Порядок КАК Порядок
	|ПОМЕСТИТЬ ВТОперацииНазначение
	|ИЗ
	|	&Операции КАК Операции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацииНазначение.Подразделение КАК Подразделение,
	|	ОперацииНазначение.Этап КАК Этап,
	|	ОперацииНазначение.Операция КАК Операция,
	|	ОперацииНазначение.ИдентификаторОперации КАК ИдентификаторОперации,
	|	ОперацииНазначение.СменноеЗадание КАК СменноеЗадание,
	|	ОперацииНазначение.Исполнитель КАК Исполнитель,
	|	ОперацииНазначение.РабочийЦентр КАК РабочийЦентр,
	|	ОперацииНазначение.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	ОперацииНазначение.НазначатьНеРанее КАК НазначатьНеРанее,
	|	ЕСТЬNULL(ОперацииКСозданиюСменныхЗаданий.Количество, 1) КАК Количество,
	|	ОперацииКСозданиюСменныхЗаданий.ВремяШтучное КАК ВремяШтучное,
	|	ОперацииКСозданиюСменныхЗаданий.ВремяПЗ КАК ВремяПЗ,
	|	ОперацииКСозданиюСменныхЗаданий.ВремяЕдИзм КАК ВремяЕдИзм,
	|	ОперацииКСозданиюСменныхЗаданий.МожноНазначать КАК МожноНазначать,
	|	ОперацииКСозданиюСменныхЗаданий.НужноНазначать КАК НужноНазначать,
	|	ОперацииКСозданиюСменныхЗаданий.НарушенПорядокНазначения КАК НарушенПорядокНазначения,
	|	ОперацииКСозданиюСменныхЗаданий.Распоряжение КАК Распоряжение,
	|	ОперацииКСозданиюСменныхЗаданий.НомерОперации КАК НомерОперации,
	|	ОперацииКСозданиюСменныхЗаданий.НомерСледующейОперации КАК НомерСледующейОперации,
	|	ОперацииКСозданиюСменныхЗаданий.Порядок КАК ПорядокСтарый,
	|	ОперацииНазначение.Порядок КАК ПорядокНовый
	|ИЗ
	|	ВТОперацииНазначение КАК ОперацииНазначение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК ОперацииКСозданиюСменныхЗаданий
	|		ПО ОперацииНазначение.Подразделение = ОперацииКСозданиюСменныхЗаданий.Подразделение
	|			И ОперацииНазначение.Этап = ОперацииКСозданиюСменныхЗаданий.Этап
	|			И ОперацииНазначение.Операция = ОперацииКСозданиюСменныхЗаданий.Операция
	|			И ОперацииНазначение.ИдентификаторОперации = ОперацииКСозданиюСменныхЗаданий.ИдентификаторОперации
	|			И ОперацииНазначение.СменноеЗадание = ОперацииКСозданиюСменныхЗаданий.СменноеЗадание
	|			И ОперацииНазначение.Исполнитель = ОперацииКСозданиюСменныхЗаданий.Исполнитель
	|			И ОперацииНазначение.РабочийЦентр = ОперацииКСозданиюСменныхЗаданий.РабочийЦентр
	|			И ОперацииНазначение.ВидРабочегоЦентра = ОперацииКСозданиюСменныхЗаданий.ВидРабочегоЦентра
	|			И ОперацииНазначение.НазначатьНеРанее = ОперацииКСозданиюСменныхЗаданий.НазначатьНеРанее");
	
	Запрос.УстановитьПараметр("Операции", Операции);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		//Если ЗначениеЗаполнено(ВремяВыполнения)
		//	И ЗначениеЗаполнено(Количество) Тогда
		//	Запись.ВремяШтучное = ВремяВыполнения / Количество;
		//КонецЕсли;
		
		//Если ЗначениеЗаполнено(КоличествоХодов) Тогда
		//	Запись.бит_КоличествоХодовОперация = КоличествоХодов;
		//КонецЕсли;
		
		Запись.Записать(Истина);
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Операции.Подразделение КАК Подразделение,
	|	Операции.Этап КАК Этап,
	|	Операции.Операция КАК Операция,
	|	Операции.ИдентификаторОперации КАК ИдентификаторОперации,
	|	Операции.СменноеЗадание КАК СменноеЗадание,
	|	Операции.Исполнитель КАК Исполнитель,
	|	Операции.РабочийЦентр КАК РабочийЦентр,
	|	Операции.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	Операции.НазначатьНеРанее КАК НазначатьНеРанее,
	|	Операции.Порядок КАК Порядок
	|ПОМЕСТИТЬ ВТОперацииНазначение
	|ИЗ
	|	&Операции КАК Операции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацииНазначение.Подразделение КАК Подразделение,
	|	ОперацииНазначение.Этап КАК Этап,
	|	ОперацииНазначение.Операция КАК Операция,
	|	ОперацииНазначение.ИдентификаторОперации КАК ИдентификаторОперации,
	|	ОперацииНазначение.СменноеЗадание КАК СменноеЗадание,
	|	ОперацииНазначение.Исполнитель КАК Исполнитель,
	|	ОперацииНазначение.РабочийЦентр КАК РабочийЦентр,
	|	ОперацииНазначение.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	ОперацииНазначение.НазначатьНеРанее КАК НазначатьНеРанее,
	|	ОперацииНазначение.Порядок КАК ПорядокНовый,
	|	ОчередьПроизводственныхОпераций.Требуется КАК Требуется,
	|	ОчередьПроизводственныхОпераций.Запланировано КАК Запланировано,
	|	ОчередьПроизводственныхОпераций.Создано КАК Создано,
	|	ОчередьПроизводственныхОпераций.ОжиданиеПредшествующих КАК ОжиданиеПредшествующих,
	|	ОчередьПроизводственныхОпераций.НачатыПредшествующие КАК НачатыПредшествующие,
	|	ОчередьПроизводственныхОпераций.МожноВыполнять КАК МожноВыполнять,
	|	ОчередьПроизводственныхОпераций.Выполняется КАК Выполняется,
	|	ОчередьПроизводственныхОпераций.Выполнено КАК Выполнено,
	|	ОчередьПроизводственныхОпераций.ТребуетПовторения КАК ТребуетПовторения,
	|	ОчередьПроизводственныхОпераций.Пропущено КАК Пропущено,
	|	ОчередьПроизводственныхОпераций.НаКонтроле КАК НаКонтроле,
	|	ОчередьПроизводственныхОпераций.НаДоработке КАК НаДоработке,
	|	ОчередьПроизводственныхОпераций.Брак КАК Брак,
	|	ОчередьПроизводственныхОпераций.Распоряжение КАК Распоряжение,
	|	ОчередьПроизводственныхОпераций.МаршрутнаяКарта КАК МаршрутнаяКарта,
	|	ОчередьПроизводственныхОпераций.КоэффициентМаршрутнойКарты КАК КоэффициентМаршрутнойКарты,
	|	ОчередьПроизводственныхОпераций.ВремяОбщее КАК ВремяОбщее,
	|	ОчередьПроизводственныхОпераций.ВремяШтучное КАК ВремяШтучное,
	|	ОчередьПроизводственныхОпераций.ВремяПЗ КАК ВремяПЗ,
	|	ОчередьПроизводственныхОпераций.ВремяЕдИзм КАК ВремяЕдИзм,
	|	ОчередьПроизводственныхОпераций.ИдентификаторКонтрольнойОперации КАК ИдентификаторКонтрольнойОперации,
	|	ОчередьПроизводственныхОпераций.НомерОперации КАК НомерОперации,
	|	ОчередьПроизводственныхОпераций.НомерСледующейОперации КАК НомерСледующейОперации,
	|	ОчередьПроизводственныхОпераций.Порядок КАК Порядок,
	|	ОчередьПроизводственныхОпераций.ВАрхиве КАК ВАрхиве
	//|	ЕстьNull(ОперацииКСозданиюСменныхЗаданий.бит_КоличествоХодовОперация, 0) КАК бит_КоличествоХодовОперация
	|ИЗ
	|	ВТОперацииНазначение КАК ОперацииНазначение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПроизводственныхОпераций КАК ОчередьПроизводственныхОпераций
	|		ПО ОперацииНазначение.Подразделение = ОчередьПроизводственныхОпераций.Подразделение
	|			И ОперацииНазначение.Этап = ОчередьПроизводственныхОпераций.Этап
	|			И ОперацииНазначение.Операция = ОчередьПроизводственныхОпераций.Операция
	|			И ОперацииНазначение.ИдентификаторОперации = ОчередьПроизводственныхОпераций.ИдентификаторОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК ОперацииКСозданиюСменныхЗаданий
	|		ПО ОперацииНазначение.Подразделение = ОперацииКСозданиюСменныхЗаданий.Подразделение
	|			И ОперацииНазначение.Этап = ОперацииКСозданиюСменныхЗаданий.Этап
	|			И ОперацииНазначение.Операция = ОперацииКСозданиюСменныхЗаданий.Операция
	|			И ОперацииНазначение.ИдентификаторОперации = ОперацииКСозданиюСменныхЗаданий.ИдентификаторОперации");
	
	Запрос.УстановитьПараметр("Операции", Операции);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.ОчередьПроизводственныхОпераций.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		//Если ЗначениеЗаполнено(ВремяВыполнения) 
		//	И ЗначениеЗаполнено(Количество) Тогда
		//	Запись.ВремяШтучное = ВремяВыполнения / Количество;
		//	Запись.ВремяОбщее = ВремяВыполнения / Количество * Запись.Требуется;
		//КонецЕсли;
		
		//Если ЗначениеЗаполнено(КоличествоХодов)	Тогда
		//	Запись.бит_КоличествоХодовОперация = КоличествоХодов;
		//КонецЕсли;
		
		//Если НЕ ЗначениеЗаполнено(Запись.бит_КоличествоХодовОперация) Тогда
		//	Запись.бит_КоличествоХодовОперация = Выборка.бит_КоличествоХодовОперация;
		//КонецЕсли;
		
		Запись.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры