///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаПеренаправления = Параметры.СсылкаПеренаправления;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	РезультатПроверки = СистемаБыстрыхПлатежейКлиентСервер.СтруктураURLФункциональнойСсылки(
		СсылкаПеренаправления,
		Ложь);
	
	Если Не РезультатПроверки.URLВалиден Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Передан некорректный URL: %1';
					|en = 'Incorrect URL is passed: %1'"),
				СсылкаПеренаправления));
		Возврат;
	КонецЕсли;
	
	Закрыть(СсылкаПеренаправленияURL(СсылкаПеренаправления));
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СсылкаПеренаправленияURL (Знач Ссылка)
	
	Возврат КодироватьСтроку(Ссылка, СпособКодированияСтроки.URLВКодировкеURL);
	
КонецФункции

#КонецОбласти
