
#Область ПрограммныйИнтерфейс

// Процедура управляет видимостью полей ввода дополнительных измерений. 
// Выводит синонимы назначенные измерениям и скрывает неиспользуемые дополнительные измерения.
// 
// Параметры:
//  ТекущаяФорма       - ФормаКлиентскогоПриложения.
//  Измерения          - Структура - см. бит_Бюджетирование.ПолучитьИзмеренияБюджетирования().
//  НастройкиИзмерений - Соответствие - бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений().
//  СоответствиеИмен   - Соответствие - соответствие имен измерений регистра и имен элементов управления на форме
// 								Ключ - Строка - имя измерения в регистре
// 								Значение - Структура - (ИмяНадписи, ИмяПоляВвода, Префикс, Постфикс).
//  ПрефиксПоляВвода   - Строка (По умолчанию = "").
// 
Процедура ПоказатьДополнительныеИзмеренияНаФорме(ТекущаяФорма, Измерения, НастройкиИзмерений, 
				СоответствиеИмен = Неопределено, ПрефиксПоляВвода = "") Экспорт
	
	Если СоответствиеИмен = Неопределено Тогда
		СоответствиеИмен = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из Измерения Цикл
		ИмяИзмерения = КлючИЗначение.Ключ;
		Если НЕ СоответствиеИмен[ИмяИзмерения] = Неопределено Тогда
			СтруктураДанных = СоответствиеИмен[ИмяИзмерения];
			ИмяНадписи 		= СтруктураДанных.ИмяНадписи;
			ИмяПоляВвода 	= СтруктураДанных.ИмяПоляВвода;
			Префикс			= СтруктураДанных.Префикс;
			Постфикс		= СтруктураДанных.Постфикс;
		Иначе
			ИмяНадписи 		= "Надпись" + ИмяИзмерения;
			ИмяПоляВвода 	= ПрефиксПоляВвода + ИмяИзмерения;
			Префикс			= "";
			Постфикс		= "";
		КонецЕсли;
		
		НайденноеПолеВвода = ТекущаяФорма.Элементы.Найти(ИмяПоляВвода);
		ТекущаяНастройка = НастройкиИзмерений[ИмяИзмерения];
		Если ТекущаяНастройка = Неопределено Тогда
			Если НЕ НайденноеПолеВвода = Неопределено Тогда
				НайденноеПолеВвода.Видимость = Ложь;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		Если Не НайденноеПолеВвода = Неопределено Тогда
			НайденноеПолеВвода.Заголовок				= Префикс + ТекущаяНастройка.Синоним + Постфикс;
			Если НЕ ПустаяСтрока(Префикс) ИЛИ НЕ ПустаяСтрока(Постфикс) Тогда
				НайденноеПолеВвода.Подсказка				= ТекущаяНастройка.Синоним;
			КонецЕсли;
			НайденноеПолеВвода.АвтоОтметкаНезаполненного= ТекущаяНастройка.Обязательное;
		    НайденноеПолеВвода.ОграничениеТипа			= ТекущаяНастройка.ТипЗначения;
		    НайденноеПолеВвода.ДоступныеТипы			= ТекущаяНастройка.ТипЗначения;
			НайденноеПолеВвода.Видимость				= Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполнит дополнительную аналитику по данным документа.
//
// Параметры:
//  Данные				 - Произвольный	 - данные, поддерживающие установку значений по имени.
//  Значение			 - Произвольный	 - устанавливаемое значение.
//  ПараметрыУстановки	 - Структура	 - см. бит_МеханизмДопИзмеренийКлиентСервер.ПараметрыУстановкиСвойствАналитикПоШаблону
//
Процедура ЗаполнитьДопАналитикуПоДаннымДокумента(Данные, Значение, ПараметрыУстановки) Экспорт

	Настройки 	= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	ВГраница 	= ПолучитьМаксимальноеКоличествоДополнительныхИзмерений();
	
	ЗаполнятьЗаполненные = бит_ОбщегоНазначенияПовтИсп.ЭтоСемействоERP();
	
	ПоляОбъекта    = ПараметрыУстановки.ПоляОбъекта;   
	СвойстваСтатьи = бит_БюджетированиеПовтИспСервер.ПолучитьСвойстваСтатьи(Данные[ПоляОбъекта.СтатьяОборотов]);
	
	Для Индекс = 1 По ВГраница Цикл
		
		Настройка = Настройки["Аналитика_" + Индекс];
		Если Настройка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВЭтомРазрезеУчетВедется = СвойстваСтатьи["Аналитика_" + Индекс];
		Если ВЭтомРазрезеУчетВедется Тогда
			Если НЕ Настройка.ЭтоСоставнойТип Тогда
				ПолеОбъекта = "";
				Если ПоляОбъекта.Свойство("Аналитика_" + Индекс, ПолеОбъекта) Тогда
					МожноЗаполнить = ?(ЗаполнятьЗаполненные, Истина, НЕ ЗначениеЗаполнено(Данные[ПолеОбъекта]));
					Если Настройка.ТипЗначения.СодержитТип(ТипЗнч(Значение)) И МожноЗаполнить Тогда
						Данные[ПолеОбъекта] = Настройка.ТипЗначения.ПривестиЗначение(Значение);
					КонецЕсли;  
				КонецЕсли; 
			КонецЕсли; 
		Иначе	
			ПолеОбъекта = "";
			Если ПоляОбъекта.Свойство("Аналитика_" + Индекс, ПолеОбъекта) Тогда
				Данные[ПолеОбъекта] = Неопределено;
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ТекстСоответствуетШаблону

// Универсальный функционал проверки текста по критерю шаблона.
// 
Функция ТекстСоответствуетШаблону(ПроверяемыйТекст, Шаблон) Экспорт

	СоответствуетШаблону = Истина;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК Поле1
	|ГДЕ
	|	&ТекстУсловия";
	
	ТекстУсловия = УсловиеПроверкиТекстСоответствуетШаблону(Шаблон);
	Если ПустаяСтрока(ТекстУсловия) Тогда
		ТекстСообщения = НСтр("ru = 'Текст шаблона не содержит операторов.'");
		ВызватьИсключение ТекстСообщения;	
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстУсловия", ТекстУсловия);
	Запрос		 = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ПроверяемыйТекст", ПроверяемыйТекст);
	
	Попытка
		РезультатПроверки	 = Запрос.Выполнить();
		СоответствуетШаблону = НЕ РезультатПроверки.Пустой();
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось выполнить проверку по причине: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;

	Возврат СоответствуетШаблону;

КонецФункции

#КонецОбласти 

#Область ЗаполнениеДополнительныхАналитикВДокументах

// АПК:581-выкл. Используется в ЕРП.

// Функция получает значения дополнительных аналитик.
// 
// Параметры:
//  ТекущийОбъект   - ДокументОбъект, ДокументСсылка.
//  ЗаполнениеШапки - Булево (По умолчанию = Истина).
// 
// Возвращаемое значение:
//   ЗначенияПоУмолчанию   - Соответствие.
// 
Функция ЗначенияАналитикПоУмолчанию(ТекущийОбъект, ЗаполнениеШапки = Истина) Экспорт
	
	// Для корректной обработки заполнения аналитик под ограниченным правами необходим полный доступ к данным.
	УстановитьПривилегированныйРежим(Истина);
	
	ЗначенияПоУмолчанию = Новый Соответствие; 	
	МетаданныеОбъекта  	= ТекущийОбъект.Метаданные();
	Если Пользователи.ЭтоСеансВнешнегоПользователя() Тогда
		ТекПользователь = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		ТекПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Аналитики = Новый Структура; 
	Аналитики.Вставить("ЦФО", 					 Неопределено);
	Аналитики.Вставить("СтатьяОборотов", 		 Неопределено);
	Аналитики.Вставить("Проект", 				 Неопределено);
	Аналитики.Вставить("НоменклатурнаяГруппа",   Неопределено);
	Аналитики.Вставить("ДоговорКонтрагента",     Неопределено);
	Аналитики.Вставить("НаправлениеДеятельности",Неопределено);

	Аналитики.ДоговорКонтрагента = ЗначениеАналитикиДоговор(Аналитики, ТекущийОбъект);
	
	// Предварительная версия аналитик по договору.	
	АналитикиПоДоговору = ОбщегоНазначения.СкопироватьРекурсивно(Аналитики);
	АналитикиПоДоговору.Вставить("ВысокийПриоритет", Ложь);
	АналитикиПоДоговору.Вставить("ДоговорКонтрагента", Аналитики.ДоговорКонтрагента);

	ПодготовитьЗначенияАналитикПоДоговору(АналитикиПоДоговору, ТекущийОбъект);
	
	АналитикиПоСоглашению = ОбщегоНазначения.СкопироватьРекурсивно(Аналитики);
	АналитикиПоСоглашению.Вставить("ВысокийПриоритет", Ложь);
	
	ПодготовитьЗначенияАналитикПоСоглашению(АналитикиПоСоглашению, ТекущийОбъект);
	
	Если АналитикиПоДоговору.ВысокийПриоритет И ЗначениеЗаполнено(АналитикиПоДоговору.ЦФО) Тогда
		Аналитики.ЦФО = АналитикиПоДоговору.ЦФО; 
	ИначеЕсли АналитикиПоСоглашению.ВысокийПриоритет И ЗначениеЗаполнено(АналитикиПоСоглашению.ЦФО) Тогда
		Аналитики.ЦФО = АналитикиПоСоглашению.ЦФО;
	Иначе
		Аналитики.ЦФО = ЗначениеАналитикиЦФО(Аналитики, ТекущийОбъект);
	КонецЕсли; 
	
	Если АналитикиПоДоговору.ВысокийПриоритет И ЗначениеЗаполнено(АналитикиПоДоговору.СтатьяОборотов) Тогда
		Аналитики.СтатьяОборотов = АналитикиПоДоговору.СтатьяОборотов 
	ИначеЕсли АналитикиПоСоглашению.ВысокийПриоритет И ЗначениеЗаполнено(АналитикиПоСоглашению.СтатьяОборотов) Тогда
		Аналитики.СтатьяОборотов = АналитикиПоСоглашению.СтатьяОборотов
	Иначе	
		Аналитики.СтатьяОборотов = ЗначениеАналитикиСтатьяОборотов(Аналитики, ТекущийОбъект);
	КонецЕсли;
	
	Если АналитикиПоДоговору.ВысокийПриоритет И ЗначениеЗаполнено(АналитикиПоДоговору.Проект) Тогда
		Аналитики.Проект = АналитикиПоДоговору.Проект
	ИначеЕсли АналитикиПоСоглашению.ВысокийПриоритет И ЗначениеЗаполнено(АналитикиПоСоглашению.Проект) Тогда
		Аналитики.Проект = АналитикиПоСоглашению.Проект
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Аналитики.НоменклатурнаяГруппа) Тогда
		Аналитики.НоменклатурнаяГруппа = ЗначениеАналитикиНоменклатурнаяГруппа(Аналитики, ТекущийОбъект);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Аналитики.НаправлениеДеятельности) Тогда
		Аналитики.НаправлениеДеятельности = ЗначениеАналитикиНаправлениеДеятельности(Аналитики, ТекущийОбъект);
	КонецЕсли;

	// По предварительным данным договора, если обычный приоритет и не заполнено.
	Если НЕ ЗначениеЗаполнено(Аналитики.СтатьяОборотов) Тогда
		Аналитики.СтатьяОборотов = АналитикиПоДоговору.СтатьяОборотов;
	КонецЕсли;    
	
	Если НЕ ЗначениеЗаполнено(Аналитики.СтатьяОборотов) Тогда
		Аналитики.СтатьяОборотов = АналитикиПоСоглашению.СтатьяОборотов;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Аналитики.ЦФО) Тогда
		Аналитики.ЦФО = АналитикиПоДоговору.ЦФО;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Аналитики.ЦФО) Тогда
		Аналитики.ЦФО = АналитикиПоСоглашению.ЦФО;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Аналитики.Проект) Тогда
		Аналитики.Проект = АналитикиПоДоговору.Проект;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Аналитики.Проект) Тогда
		Аналитики.Проект = АналитикиПоСоглашению.Проект;
	КонецЕсли;  
	
	// По настройкам пользователя.
	Если НЕ ЗначениеЗаполнено(Аналитики.СтатьяОборотов) Тогда
		ОтборДляСтатьи = ОтборДляСтатьиОборотовПоДокументу(ТекущийОбъект);
		Если ОтборДляСтатьи.ЗаполнятьСтатью Тогда
			ТипСтатьи   = ОтборДляСтатьи.ТипСтатьиСтр;
			РасходДоход = ОтборДляСтатьи.РасходДоходСтр;
			ИмяОсновнойСтатьи = "ОсновнаяСтатья" + РасходДоход + ТипСтатьи;
			ЗаполнитьЗначениеДопАналитикиИзНастройкиПользователя(Аналитики.СтатьяОборотов,
				ИмяОсновнойСтатьи, ТекПользователь);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Аналитики.ЦФО) Тогда
		ЗаполнитьЗначениеДопАналитикиИзНастройкиПользователя(Аналитики.ЦФО,
		"ОсновнойЦФО", ТекПользователь);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Аналитики.Проект) Тогда
		ЗаполнитьЗначениеДопАналитикиИзНастройкиПользователя(Аналитики.Проект,
		"ОсновнойПроект", ТекПользователь);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Аналитики.НоменклатурнаяГруппа) Тогда
		ЗаполнитьЗначениеДопАналитикиИзНастройкиПользователя(Аналитики.НоменклатурнаяГруппа,
		"ОсновнаяНоменклатурнаяГруппа", ТекПользователь);
	КонецЕсли; 

	ПВХ = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик;
	ВидыАналитик = Новый Массив(); 
	ВидыАналитик.Добавить(ПВХ.ЦФО);
	ВидыАналитик.Добавить(ПВХ.СтатьяОборотов);
	ВидыАналитик.Добавить(ПВХ.Проект);
	ВидыАналитик.Добавить(ПВХ.НоменклатурнаяГруппа);
	// ++ ЕРП
	ВидыАналитик.Добавить(ПВХ.НаправлениеДеятельности);
	// -- ЕРП

	ДопустимыеТипы = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ВидыАналитик, "ТипЗначения");
	
	// Результаты.
	Если ЗначениеЗаполнено(Аналитики.ЦФО) Тогда
		ОписаниеТипа = ДопустимыеТипы.Получить(ПВХ.ЦФО).ТипЗначения;
		ЗначенияПоУмолчанию.Вставить(ПВХ.ЦФО, ОписаниеТипа.ПривестиЗначение(Аналитики.ЦФО));  	
	КонецЕсли;
	Если ЗначениеЗаполнено(Аналитики.СтатьяОборотов) Тогда
		ОписаниеТипа = ДопустимыеТипы.Получить(ПВХ.СтатьяОборотов).ТипЗначения;
		ЗначенияПоУмолчанию.Вставить(ПВХ.СтатьяОборотов, ОписаниеТипа.ПривестиЗначение(Аналитики.СтатьяОборотов));
	КонецЕсли;
	Если ЗначениеЗаполнено(Аналитики.Проект) Тогда
		ОписаниеТипа = ДопустимыеТипы.Получить(ПВХ.Проект).ТипЗначения;
		ЗначенияПоУмолчанию.Вставить(ПВХ.Проект, ОписаниеТипа.ПривестиЗначение(Аналитики.Проект));
	КонецЕсли;
	Если ЗначениеЗаполнено(Аналитики.НоменклатурнаяГруппа) Тогда
		ОписаниеТипа = ДопустимыеТипы.Получить(ПВХ.НоменклатурнаяГруппа).ТипЗначения;
		ЗначенияПоУмолчанию.Вставить(ПВХ.НоменклатурнаяГруппа, ОписаниеТипа.ПривестиЗначение(Аналитики.НоменклатурнаяГруппа));	
	КонецЕсли;
	
	// ++ ЕРП
	Если ЗначениеЗаполнено(Аналитики.НаправлениеДеятельности) Тогда
		ОписаниеТипа = ДопустимыеТипы.Получить(ПВХ.НаправлениеДеятельности).ТипЗначения;
		ЗначенияПоУмолчанию.Вставить(ПВХ.НаправлениеДеятельности, ОписаниеТипа.ПривестиЗначение(Аналитики.НаправлениеДеятельности));	
	КонецЕсли;
	// -- ЕРП

 	Возврат ЗначенияПоУмолчанию;	
	
КонецФункции

// Функция находит назначенные дополнительные аналитики.
//
// Параметры:
// 	МетаданныеОбъекта.
//
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция НазначенныеДополнительныеАналитики(МетаданныеОбъекта) Экспорт

	ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаданныеОбъекта);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ОбъектСистемы);		
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	НазначениеДополнительныхАналитик.Аналитика КАК Аналитика,
	|	ЕСТЬNULL(НазначениеДополнительныхИзмерений.ИмяИзмерения,  НазначениеДополнительныхАналитик.Аналитика.Код) КАК ИмяКолонки,
	|	НазначениеДополнительныхАналитик.Объект КАК Объект,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	РегистрСведений.бит_НазначениеДополнительныхАналитик КАК НазначениеДополнительныхАналитик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НазначениеДополнительныхИзмерений КАК НазначениеДополнительныхИзмерений
	|		ПО НазначениеДополнительныхАналитик.Аналитика = НазначениеДополнительныхИзмерений.Аналитика
	|ГДЕ
	|	НазначениеДополнительныхАналитик.Объект = &Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НазначениеДополнительныхАналитик.Аналитика,
	|	ЕСТЬNULL(НазначениеДополнительныхИзмерений.ИмяИзмерения,  НазначениеДополнительныхАналитик.Аналитика.Код),
	|	НазначениеДополнительныхАналитик.Объект,
	|	1
	|ИЗ
	|	РегистрСведений.бит_НазначениеДополнительныхАналитик КАК НазначениеДополнительныхАналитик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НазначениеДополнительныхИзмерений КАК НазначениеДополнительныхИзмерений
	|		ПО НазначениеДополнительныхАналитик.Аналитика = НазначениеДополнительныхИзмерений.Аналитика
	|ГДЕ
	|	НазначениеДополнительныхАналитик.Объект = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Аналитика КАК Аналитика,
	|	ВременнаяТаблица.ИмяКолонки КАК ИмяКолонки,
	|	МИНИМУМ(ВременнаяТаблица.Приоритет) КАК Приоритет
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблица.Аналитика,
	|	ВременнаяТаблица.ИмяКолонки";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

// АПК:581-вкл.

// Процедура заполняет перечень дополнительных аналитиков по-умолчанию.
// 
// Параметры:
//  ТекущийОбъект  			- ДокументОбъект.
//  НаборЗаписей   		   	- РегистрСведенийНаборЗаписей.бит_ДополнительныеАналитики (По умолчанию = Неопределено)
//								ИЛИ ДанныеФормыКоллекция (При заполнении тч из обработки бит_ГрупповоеРедактированиеДополнительныхАналитик).
//  ЗаполнятьАналитикиШапки - Булево (По умолчанию = Ложь).
//  ЗаполнятьАналитикиТч 	- Булево (По умолчанию = Ложь).
// 
Процедура ЗаполнитьДополнительныеАналитикиПоУмолчанию(ТекущийОбъект, НаборЗаписей = Неопределено, 
	ЗаполнятьАналитикиШапки = Ложь, ЗаполнятьАналитикиТч = Ложь) Экспорт	
	
	Если ЗаполнятьАналитикиШапки Тогда
		ЗаполнитьДополнительныеАналитикиШапки(ТекущийОбъект, НаборЗаписей);
	КонецЕсли;
	
	Если ЗаполнятьАналитикиТч Тогда
		ДокументыСРасшифровкой 			 = бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ДокументыСРасшифровкой();	
		ИспользуетсяРаспределениеБюджета = ДокументыСРасшифровкой.Найти(ТипЗнч(ТекущийОбъект.Ссылка)) <> Неопределено;
		Если ИспользуетсяРаспределениеБюджета Тогда
			ЗаполнитьДополнительныеАналитикиРаспределенияБюджета(ТекущийОбъект, НаборЗаписей);
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

// Функция проверяет включен ли режим заполнения аналитик "Заполнять всегда".
//  
// Возвращаемое значение:
//   Булево.
// 
Функция ВключенРежимЗаполнятьВсегда() Экспорт
	
	// ++ ЕРП 
	РежимЗаполнения = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_РежимАвтоЗаполненияАналитик");	
	Возврат РежимЗаполнения = Перечисления.бит_РежимыАвтоЗаполненияАналитик.Заполнять;
	// -- ЕРП 
	
КонецФункции

// Обработчик подписки "бит_ПередЗаписьюДокументаСАналитиками".
// См.  Синтакс-помощник: ДокументОбъект.ПередЗаписью().
//
Процедура бит_ПередЗаписьюДокументаСАналитиками(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда 		
	    // Функционал БФ может работать только в узлах, созданных с помощью ПО бит_Полный.
		Возврат;   	
	КонецЕсли; 
	
	Если Источник.ДополнительныеСвойства.Свойство("ЗаписьДоговора") Тогда
		Возврат;	
	КонецЕсли; 
	
	Если НЕ Источник.ЭтоНовый() Тогда
		// При установке пометки удаления, ни чего не делаем.
		ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ПометкаУдаления");	
		Если Источник.ПометкаУдаления И НЕ ПометкаУдаления Тогда
			Источник.ДополнительныеСвойства.Вставить("УстановкаПометкиУдаления", Истина);
			Возврат;
		КонецЕсли; 		
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		ИЛИ бит_ОбщегоНазначения.ЭтоСемействоERP()
		ИЛИ Не РазрешеноПерезаполнениеАналитик(Источник) Тогда
		// Ничего не делаем, если режим записи документа - отмена проведения.
	 	Возврат;	
	КонецЕсли;
	
	ЗаполнятьТаблицу = Ложь;
	
	ЕстьРасшифровкаПлатежа = бит_РаботаСМетаданными.ЕстьТабЧасть("РасшифровкаПлатежа", Источник.Метаданные());
	Если ЕстьРасшифровкаПлатежа Тогда
		ЗаполнятьТаблицу = Источник.РасшифровкаПлатежа.Количество() > 1;
	КонецЕсли; 
	
	ЗаполнитьДополнительныеАналитикиПоУмолчанию(Источник, Неопределено, Ложь, ЗаполнятьТаблицу);																																						
   																			
КонецПроцедуры

// Обработчик подписки "бит_ПриЗаписиДокументаСАналитиками".
// См.  Синтакс-помощник: ДокументОбъект.ПриЗаписи().
//
Процедура бит_ПриЗаписиДокументаСАналитиками(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда		
	    // Функционал БФ может работать только в узлах, созданных с помощью ПО бит_Полный.
		Возврат; 	
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ЗаписьДоговора") Тогда
		Возврат;	
	КонецЕсли; 
	
	Если Источник.ДополнительныеСвойства.Свойство("УстановкаПометкиУдаления")
	   И Источник.ДополнительныеСвойства.УстановкаПометкиУдаления Тогда
		Возврат;
	КонецЕсли; 

	// В зависимости от режима заполнения и решения устанавливается флаг "ЗапретитьПерезаполнениеАналитик".
	УстановитьЗапретитьПерезаполнениеАналитикНовому(Источник);

	Если НЕ РазрешеноПерезаполнениеАналитик(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.бит_ДополнительныеАналитики.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
	
	ЗаполнитьДополнительныеАналитикиПоУмолчанию(Источник, НаборЗаписей, Истина, Ложь);
	
	Если Не бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборЗаписей) Тогда
		Отказ = Истина;
	КонецЕсли; 	
	
КонецПроцедуры

// Возвращает значения субконто по данным счета.
//
// Параметры:
//  Данные				 - Произвольный - любые данные свойство, которых можно получить через []. 
//  ПараметрыПолучения	 - Структура - см. НовыеПараметрыПолученияЗначенийИзСубконто().
// 
// Возвращаемое значение:
// Значения субконто  - соответствие. Ключи - значения видов субконто, значения - найденные значения.
//
Функция ЗначенияИзСубконтоПоПараметрам(Данные, ПараметрыПолучения) Экспорт
	
	// ++ ЕРП 
	Совместимо = Истина;
	Возврат Неопределено;
	// -- ЕРП 
	
КонецФункции

// Конструктор параметров для ЗначенияИзСубконтоПоПараметрам().
// 
// Возвращаемое значение:
// Параметры  - структура. 
//
Функция НовыеПараметрыПолученияЗначенийИзСубконто() Экспорт
	
	// ++ ЕРП 
	Совместимо = Истина;
	Возврат Неопределено;
	// -- ЕРП 
	
КонецФункции

Функция ПараметрыОбъектаДляОчисткиНеиспользуемыхРеквизитов() Экспорт

	ПоляОбъекта = Новый Структура; 
	ПоляОбъекта.Вставить("Аналитика_1","Аналитика_1");
	ПоляОбъекта.Вставить("Аналитика_2","Аналитика_2");
	ПоляОбъекта.Вставить("Аналитика_3","Аналитика_3");
	ПоляОбъекта.Вставить("Аналитика_4","Аналитика_4");
	ПоляОбъекта.Вставить("Аналитика_5","Аналитика_5");
	ПоляОбъекта.Вставить("Аналитика_6","Аналитика_6");
	ПоляОбъекта.Вставить("Аналитика_7","Аналитика_7");
	// ++ ЕРП 	
	ПоляОбъекта.Вставить("Аналитика_8","Аналитика_8");
	ПоляОбъекта.Вставить("Аналитика_9","Аналитика_9");
	ПоляОбъекта.Вставить("Аналитика_10","Аналитика_10");
	ПоляОбъекта.Вставить("Аналитика_11","Аналитика_11");
	ПоляОбъекта.Вставить("Аналитика_12","Аналитика_12");
	// -- ЕРП 

	ПараметрыОбъекта = Новый Структура("ПоляОбъекта, СтатьяОборотов", 
						ПоляОбъекта, Справочники.бит_СтатьиОборотов.ПустаяСсылка()); 
	
	Возврат ПараметрыОбъекта;

КонецФункции

Функция ПараметрыОчисткиНеиспользуемыхРеквизитов(ПараметрыОбъекта) Экспорт

	ПоляОбъекта = ПараметрыОбъекта.ПоляОбъекта;
	
	Если ТипЗнч(ПараметрыОбъекта.СтатьяОборотов) = Тип("Массив") Тогда
		Статьи = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОбъекта.СтатьяОборотов);
	Иначе	
		Статьи = Новый Массив; 
		Статьи.Добавить(ПараметрыОбъекта.СтатьяОборотов);
	КонецЕсли; 
	
	Индекс = Статьи.ВГраница();
	Пока Индекс >= 0 Цикл
		Если НЕ ЗначениеЗаполнено(Статьи.Получить(Индекс)) Тогда
			Статьи.Удалить(Индекс);		
		КонецЕсли; 
		Индекс = Индекс - 1;
	КонецЦикла;  
	
	ПараметрыПоиска = НовыеПараметрыПоискаПолейОчисткиНеиспользуемыхРеквизитов();
	РеквизитыСтатьи = Новый Массив; 
	Для каждого КлючЗначение Из ПараметрыПоиска Цикл
		ПолеОбъекта = Неопределено;
		Если ПоляОбъекта.Свойство(КлючЗначение.Значение, ПолеОбъекта) Тогда
			Если ЗначениеЗаполнено(ПолеОбъекта) Тогда
				РеквизитыСтатьи.Добавить(КлючЗначение.Ключ);
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 

	ДанныеПоУмолчанию = Новый Структура();
	Для каждого Ключ Из РеквизитыСтатьи Цикл
		ДанныеПоУмолчанию.Вставить(Ключ, Ложь);
	КонецЦикла; 

	Если Статьи.Количество() > 0 Тогда
		ПараметрыДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Статьи, РеквизитыСтатьи);
	Иначе
		ПараметрыДанных = Новый Соответствие;
	КонецЕсли; 
	ПараметрыДанных.Вставить(Справочники.бит_СтатьиОборотов.ПустаяСсылка(), ДанныеПоУмолчанию);
	
	ПараметрыОчистки = Новый Структура("ПараметрыПоиска, ПараметрыДанных", 
							ПараметрыПоиска, ПараметрыДанных);
	
	Возврат ПараметрыОчистки;
	
КонецФункции

Процедура ОчиститьНеиспользуемыеРеквизитыНабора(НаборДанных, ПараметрыОчистки) Экспорт 
	
	Для каждого СтрокаТаблицы Из НаборДанных Цикл
		ОчиститьНеиспользуемыеРеквизитыДанных(СтрокаТаблицы, ПараметрыОчистки);
	КонецЦикла; 

КонецПроцедуры
 
Процедура ОчиститьНеиспользуемыеРеквизитыДанных(Данные, ПараметрыОчистки) Экспорт

	ПараметрыПоиска = ПараметрыОчистки.ПараметрыПоиска;
	ПараметрыДанных = ПараметрыОчистки.ПараметрыДанных;
	
	ДанныеСтатьи = ПараметрыДанных.Получить(Данные.СтатьяОборотов);
	Если ДанныеСтатьи = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	Для каждого КлючЗначение Из ДанныеСтатьи Цикл
		
		ПолеДанных = ПараметрыПоиска[КлючЗначение.Ключ];
		Если НЕ КлючЗначение.Значение Тогда
			Данные[ПолеДанных] = Неопределено;
		Иначе
			Если НЕ ЗначениеЗаполнено(Данные[ПолеДанных]) Тогда
				Данные[ПолеДанных] = Неопределено;
			КонецЕсли; 	
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

// Функция проверяет разрешено ли заполнение аналитик.
// 
// Параметры:
//  Источник - ДокументОбъект.
//  
// Возвращаемое значение:
//   Булево - разрешено.
// 
Функция РазрешеноПерезаполнениеАналитик(Источник)

	Разрешено = Истина;
	
	Если Источник.ДополнительныеСвойства.Свойство("бит_НеЗаполнятьАналитикиПоУмолчанию") 
		И Источник.ДополнительныеСвойства.бит_НеЗаполнятьАналитикиПоУмолчанию Тогда
	
		Разрешено = Ложь;
	Иначе		
		// ++ЕРП
		РежимЗаполнения     = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_РежимАвтоЗаполненияАналитик");
		ПеречисленияРежимов = Перечисления.бит_РежимыАвтоЗаполненияАналитик;
		Если РежимЗаполнения = ПеречисленияРежимов.НеЗаполнять Тогда
			// Заполнение запрещено, если режим автозаполнения аналитик установлен в значение "НеЗаполнять".
			Разрешено = Ложь; 		
		ИначеЕсли РежимЗаполнения = ПеречисленияРежимов.Заполнять Тогда
			// Заполнение запрещено, если режим = "ЗаполнятьВсегда" и для документа установлен запрет на перезаполнение аналитик.
			Разрешено = Не ПолучитьЗначениеДополнительногоПараметраОбъекта(Источник.Ссылка, "ЗапретитьПерезаполнениеАналитик");
		Иначе	
			Разрешено = Ложь;
		КонецЕсли;
		// --ЕРП
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("бит_НеЗаполнятьАналитикиПоУмолчанию", НЕ Разрешено);
	
	Возврат Разрешено;
	
КонецФункции

#Область УстановкаСвойствАналитик

// Процедура устанавливает начальные свойства аналитик шапки при изменении статьи оборотов.
//
// Параметры:
//  Форма.
//  Объект.
//  ПараметрыУстановки.
//
Процедура УстановитьСвойстваАналитикШапкиПриИзмененииСтатьиОборотов(Форма, Объект, ПараметрыУстановки) Экспорт
		
	ДанныеОбъекта = бит_МеханизмДопИзмеренийКлиентСервер.ДанныеУстановкиПараметровАналитик(Объект, ПараметрыУстановки);
	
	бит_МеханизмДопИзмеренийКлиентСервер.УстановитьПараметрыВыбораАналитик(Форма, Объект, ПараметрыУстановки, ДанныеОбъекта);
	
КонецПроцедуры

// Процедура устанавливает начальные свойства аналитик строки таблицы при изменении статьи оборотов.
//
// Параметры:
//  Форма.
//  СтрокаТаблицы.
//  ПараметрыУстановки.
//
Процедура УстановитьСвойстваАналитикСтрокиПриИзмененииСтатьиОборотов(Форма, СтрокаТаблицы, ПараметрыУстановки) Экспорт
			
	ДанныеОбъекта = бит_МеханизмДопИзмеренийКлиентСервер.ДанныеУстановкиПараметровАналитик(СтрокаТаблицы, ПараметрыУстановки);
	
	бит_МеханизмДопИзмеренийКлиентСервер.УстановитьПараметрыВыбораАналитик(Форма, СтрокаТаблицы, ПараметрыУстановки, ДанныеОбъекта);
	
КонецПроцедуры

// Процедура устанавливает начальные свойства аналитик шапки при изменении организации.
//
// Параметры:
//  Форма.
//  Объект.
//  ПараметрыУстановки.
//
Процедура УстановитьСвойстваАналитикШапкиПриИзмененииОрганизации(Форма, Объект, ПараметрыУстановки) Экспорт
	
	ОчиститьАналитикиПриИзмененииОрганизации(Объект, ПараметрыУстановки);
	
	ДанныеОбъекта = бит_МеханизмДопИзмеренийКлиентСервер.ДанныеУстановкиПараметровАналитик(Объект, ПараметрыУстановки);
	
	бит_МеханизмДопИзмеренийКлиентСервер.УстановитьПараметрыВыбораАналитик(Форма, Объект, ПараметрыУстановки, ДанныеОбъекта);
	
КонецПроцедуры

// Процедура устанавливает начальные свойства аналитик таблицы при изменении организации.
//
// Параметры:
//  Таблица.
//  ПараметрыУстановки.
//
Процедура УстановитьСвойстваАналитикТаблицыПриИзмененииОрганизации(Таблица, ПараметрыУстановки) Экспорт
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		
		ОчиститьАналитикиПриИзмененииОрганизации(СтрокаТаблицы, ПараметрыУстановки);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура устанавливает начальные свойства аналитик шапки.
//
// Параметры:
//  Форма.
//  Объект.
//  ПараметрыУстановки.
//
Процедура УстановитьНачальныеСвойстваАналитикШапки(Форма, Объект, ПараметрыУстановки) Экспорт
		
	ДанныеОбъекта = бит_МеханизмДопИзмеренийКлиентСервер.ДанныеУстановкиПараметровАналитик(Объект, ПараметрыУстановки);
	
	бит_МеханизмДопИзмеренийКлиентСервер.УстановитьПараметрыВыбораАналитик(Форма, Объект, ПараметрыУстановки, ДанныеОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ДополнительныеАналитикиВОбработках

// Процедура заполняет дополнительные аналитики по документу БИТ.
// 
// Параметры:
//  НаборЗаписей - РегистрСведенийНаборЗаписей.бит_ДополнительныеАналитики.
//  ОбъектСсылка - ДокументСсылка.*.
//  ДокументБит  - ДокументСсылка.бит_ПлатежнаяПозиция 
// 					или ДокументСсылка.бит_РасходнаяПозиция 
// 					или ДокументСсылка.бит_ПланируемоеПоступлениеДенежныхСредств.
// 
Процедура ЗаполнитьДополнительныеАналитикиПоДокументуБит(НаборЗаписей, ОбъектСсылка, Знач ДокументБит) Экспорт
	
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
	
КонецПроцедуры

#КонецОбласти 

#Область ДополнительныеПараметрыОбъектов

// Функция получает значение дополнительного параметра объекта.
// 
// Параметры:
//  СсылкаНаОбъект - Любая ссылка.
//  ИмяПараметра   - Строка.
//  
// Возвращаемое значение:
//   Тип.Вид   - описание.
// 
Функция ПолучитьЗначениеДополнительногоПараметраОбъекта(СсылкаНаОбъект, ИмяПараметра) Экспорт
	
	МетаПараметра = Метаданные.РегистрыСведений.бит_ДополнительныеПараметрыОбъектов.Ресурсы.Найти(ИмяПараметра);
	Если МетаПараметра = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Не найден дополнительный параметр в структуре регистра.';
							  |en='Additional parameter is not found in the structure of the register.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		ЗначениеПараметра = Неопределено;	
	Иначе
		РезультатЗапроса  = ПолучитьРезультатЗапросаНаДополнительныеПараметрыОбъекта(СсылкаНаОбъект);	
		ЗначениеПараметра = ПолучитьЗначениеДополнительногоПараметраОбъектаПоРезультатуЗапроса(РезультатЗапроса, ИмяПараметра, МетаПараметра);
	КонецЕсли;

	Возврат ЗначениеПараметра;
	
КонецФункции

// Процедура записывает дополнительные параметры объекта 
// в регистр сведений бит_ДополнительныеПараметрыОбъектов.
// 
// Параметры:
//  СсылкаНаОбъект 		- Любая ссылка.
//  СтруктураПараметров - Структура (Ключ = имя параметра, Значение = значение параметра).
// 
Процедура ЗаписатьДополнительныеПараметрыОбъекта(СсылкаНаОбъект, СтруктураПараметров) Экспорт

	НаборЗаписей = РегистрыСведений.бит_ДополнительныеПараметрыОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(СсылкаНаОбъект);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();	 
	
	Запись = НаборЗаписей.Добавить();
	Запись.Объект = СсылкаНаОбъект;
	Для каждого КлЗнч Из СтруктураПараметров Цикл
		ИмяПараметра = КлЗнч.Ключ;
		Запись[ИмяПараметра] = СтруктураПараметров[ИмяПараметра];	
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#Область ПроизвольныеПараметры

// Функция получить максимально доступное количество.
// 
// Параметры:
//  Нет.
//  
// Возвращаемое значение:
//  Число.
// 
Функция ПолучитьМаксимальноеКоличествоИзмеренийПроизвольныхПараметров() Экспорт

	Результат = 0;
	ИзмеренияРегистра = Метаданные.РегистрыСведений.бит_ЗначенияПроизвольныхПараметров.Измерения;
	Для каждого Измерение Из ИзмеренияРегистра Цикл
		Если Лев(Измерение.Имя, 10) = "Аналитика_" Тогда
			Результат = Результат + 1;		
		КонецЕсли;
	КонецЦикла;                   		

	Возврат Результат;
	
КонецФункции

// Функция формирует соответствие настроек измерений по параметру.
// 
// Параметры:
//  ТекущийПараметр - ПланВидовХарактеристикСсылка.бит_ВидыПроизвольныхПараметров.
//  
// Возвращаемое значение:
//   Соответствие.
// 
Функция ПолучитьНастройкиИзмеренийПроизвольногоПараметра(ТекущийПараметр) Экспорт

	НастройкиИзмерений = Новый Соответствие;
	Если ЗначениеЗаполнено(ТекущийПараметр) Тогда
		Для каждого СтрокаТабЧасти Из ТекущийПараметр.ИспользованиеАналитики Цикл
			ТекущаяАналитика = СтрокаТабЧасти.Аналитика;
			СтруктураАналитики = Новый Структура;
			СтруктураАналитики.Вставить("Аналитика",			ТекущаяАналитика);
			СтруктураАналитики.Вставить("Синоним",				ТекущаяАналитика.Наименование);
			СтруктураАналитики.Вставить("Обязательное",			Ложь);
			СтруктураАналитики.Вставить("ТипЗначения",			ТекущаяАналитика.ТипЗначения);
			СтруктураАналитики.Вставить("ЭтоСоставнойТип",		ТекущаяАналитика.ТипЗначения.Типы().Количество() > 1);
			СтруктураАналитики.Вставить("ИмяТипаПоУмолчанию",	СтрокаТабЧасти.ИмяТипаПоУмолчанию);
			СтруктураАналитики.Вставить("ЗначениеПоУмолчанию",	Неопределено);
			ОпределитьЗначениеПоУмолчанию(СтруктураАналитики);
			НастройкиИзмерений.Вставить(СтрокаТабЧасти.ИмяИзмерения, СтруктураАналитики);
		КонецЦикла;
	КонецЕсли;

	Возврат НастройкиИзмерений;
	
КонецФункции

// Процедура очищает значения дополнительных измерений, если тип не подходит.
// 
// Параметры:
//  ЭлементыФормы  		- Элементы формы.
//  Измерения			- Структура.
//  НастройкиИзмерений  - Соответствие.
// 
Процедура ОчиститьЗначенияНеподходящихТипов(ТекущийОбъект, Измерения, НастройкиИзмерений) Экспорт

	Для каждого КлючЗначение Из Измерения Цикл
		НайденныйЭлемент = ТекущийОбъект[КлючЗначение.Ключ];
		Если НайденныйЭлемент = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		СтруктураАналитики = НастройкиИзмерений.Получить(КлючЗначение.Ключ);
		Если СтруктураАналитики = Неопределено Тогда
			ТекущийОбъект[КлючЗначение.Ключ] = Неопределено;
		Иначе
			ТипАналитики = СтруктураАналитики.ТипЗначения;
			ТипЭлемента  = ТипЗнч(НайденныйЭлемент);
			Если Не ТипАналитики.СодержитТип(ТипЭлемента) Тогда
				ТекущийОбъект[КлючЗначение.Ключ] = Неопределено;	
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти  

// Функция определяет назначено ли в системе доп измерение, содержащее тип Организация.
//  
// Возвращаемое значение:
//  Имя - Строка.
// 
Функция ЕстьДопИзмерениеОрганизация(Настройки = Неопределено) Экспорт
	
	Имя = ИмяДопИзмененияОрганизация(Настройки);
	Есть = ?(ЗначениеЗаполнено(Имя), Истина, Ложь);
	Возврат Есть;
	
КонецФункции

// Функция определяет имя дополнительного измерения, содержащего тип Организация.
//  
// Возвращаемое значение:
//  Имя - Строка.
// 
Функция ИмяДопИзмененияОрганизация(Настройки = Неопределено) Экспорт
	
	Имя = "";
	
	Если Настройки = Неопределено Тогда
		НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	Иначе
		НастройкиИзмерений = Настройки;
	КонецЕсли;
	
	Для Каждого КиЗ Из НастройкиИзмерений Цикл
		 ТекНастройка = КиЗ.Значение;
		 Если ТекНастройка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Организации")) Тогда
			 Имя = КиЗ.Ключ;
			 Прервать;
		 КонецЕсли;	 
	КонецЦикла;	
	
	Возврат Имя;
	
КонецФункции

// Функция получить максимально доступное количество дополнительных измерений БИТ.
//  
// Возвращаемое значение:
//  Результат - Число.
// 
Функция ПолучитьМаксимальноеКоличествоДополнительныхИзмерений() Экспорт

	Возврат бит_МеханизмДопИзмеренийКлиентСерверПереопределяемый.КоличествоДополнительныхИзмерений();
	
КонецФункции

// Функция получает настройки отображения дополнительных измерений.
// 
// Возвращаемое значение:
//   Настройки   - Соответствие - Ключ: имя измерения, Значение: структура настроек измерения.
// 
Функция ПолучитьНастройкиДополнительныхИзмерений(Ключ = "")  Экспорт
	
	Настройки = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсточникНастроек.ИмяИзмерения КАК ИмяИзмерения,
	|	ИсточникНастроек.Синоним КАК Синоним,
	|	ИсточникНастроек.Аналитика КАК Аналитика,
	|	ИсточникНастроек.Обязательное КАК Обязательное,
	|	ИсточникНастроек.ИмяТипаПоУмолчанию КАК ИмяТипаПоУмолчанию,
	|	ИсточникНастроек.Аналитика.Предопределенный КАК Предопределенная
	|ИЗ
	|	РегистрСведений.бит_НазначениеДополнительныхИзмерений КАК ИсточникНастроек";
				   
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		СтрНастроек						= КонструкторНастроекАналитик();
		СтрНастроек.Синоним				= СокрЛП(Выборка.Синоним);
		СтрНастроек.Аналитика			= Выборка.Аналитика;
		СтрНастроек.Предопределенная	= Выборка.Предопределенная;
		СтрНастроек.ТипЗначения			= Выборка.Аналитика.ТипЗначения;
		СтрНастроек.Обязательное		= Выборка.Обязательное;
		СтрНастроек.ЭтоСоставнойТип		= ЭтоАналитикаСоставногоТипа(Выборка.Аналитика);
		СтрНастроек.ИмяТипаПоУмолчанию	= Выборка.ИмяТипаПоУмолчанию;
		СтрНастроек.ИмяИзмерения		= Выборка.ИмяИзмерения;
		ОпределитьЗначениеПоУмолчанию(СтрНастроек);
		
		Если ВРег(Ключ) = ВРег("Аналитика") Тогда
			Настройки.Вставить(Выборка.Аналитика, СтрНастроек);
		Иначе	
			Настройки.Вставить(СокрЛП(Выборка.ИмяИзмерения), СтрНастроек);
		КонецЕсли; 
	КонецЦикла; 
				   
	Возврат Настройки;
	
КонецФункции

// Функция получает настройки всех дополнительных аналитик.
// 
// Возвращаемое значение:
//  Настройки - Соответствие.
// 
Функция ПолучитьНастройкиДополнительныхАналитик() Экспорт

	Настройки = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ВидыДополнительныхАналитик.Код КАК ИмяИзмерения,
	               |	бит_ВидыДополнительныхАналитик.Наименование КАК Синоним,
	               |	бит_ВидыДополнительныхАналитик.ТипЗначения КАК ТипЗначения,
	               |	бит_ВидыДополнительныхАналитик.Ссылка КАК Аналитика,
	               |	ЛОЖЬ КАК Обязательное,
	               |	"""" КАК ИмяТипаПоУмолчанию,
	               |	бит_ВидыДополнительныхАналитик.Предопределенный КАК Предопределенная
	               |ИЗ
	               |	ПланВидовХарактеристик.бит_ВидыДополнительныхАналитик КАК бит_ВидыДополнительныхАналитик";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрНастроек						= КонструкторНастроекАналитик();
		СтрНастроек.Синоним				= СокрЛП(Выборка.Синоним);
		СтрНастроек.Аналитика			= Выборка.Аналитика;
		СтрНастроек.Предопределенная	= Выборка.Предопределенная;
		СтрНастроек.ТипЗначения			= Выборка.ТипЗначения;
		СтрНастроек.Обязательное		= Выборка.Обязательное;
		СтрНастроек.ЭтоСоставнойТип		= ЭтоАналитикаСоставногоТипа(Выборка.Аналитика);
		СтрНастроек.ИмяТипаПоУмолчанию	= Выборка.ИмяТипаПоУмолчанию;
		ОпределитьЗначениеПоУмолчанию(СтрНастроек);
		Настройки.Вставить(СокрЛП(Выборка.ИмяИзмерения), СтрНастроек);
	КонецЦикла; 
				   
	Возврат Настройки;
	
КонецФункции

Функция КонструкторНастроекАналитик()  Экспорт

	Настройки = Новый Структура;
	Настройки.Вставить("Аналитика",			Неопределено);
	Настройки.Вставить("Предопределенная",	Ложь);
	Настройки.Вставить("Синоним",				"");
	Настройки.Вставить("Обязательное",		Ложь);
	Настройки.Вставить("ТипЗначения",			Неопределено);
	Настройки.Вставить("ЭтоСоставнойТип",		Ложь);
	Настройки.Вставить("ЗначениеПоУмолчанию",	Ложь);
	Настройки.Вставить("ИмяТипаПоУмолчанию",	"");
	Настройки.Вставить("ИмяКласса",			"НастройкиАналитики");	
	Настройки.Вставить("ИмяАналитики",		"");
	Настройки.Вставить("ИмяПоля", 			"");
	Настройки.Вставить("ИмяИзмерения", 		"");
										
	Возврат Настройки;
	
КонецФункции

// Функция определяет значение дополнительной аналитики по-умолчанию.
// 
// Параметры:
//  СтрНастроек  - Структура.
// 
Процедура ОпределитьЗначениеПоУмолчанию(СтрНастроек)  Экспорт

	Если ЗначениеЗаполнено(СтрНастроек.Аналитика) Тогда
		Если СтрНастроек.ЭтоСоставнойТип Тогда
			Если ЗначениеЗаполнено(СтрНастроек.ИмяТипаПоУмолчанию) Тогда
				// Заполним значение по умолчанию для составного типа.
				НайденныйОбъект = Метаданные.НайтиПоПолномуИмени(СтрНастроек.ИмяТипаПоУмолчанию);
				Если НайденныйОбъект <> Неопределено Тогда
					ПозицияТочки = Найти(СтрНастроек.ИмяТипаПоУмолчанию,".");
					Если ПозицияТочки > 0 Тогда
						ИмяТипа = СтрЗаменить(СтрНастроек.ИмяТипаПоУмолчанию,".","Ссылка.");
						Описание = Новый ОписаниеТипов(ИмяТипа);
						СтрНастроек.ЗначениеПоУмолчанию = Описание.ПривестиЗначение();
					КонецЕсли; 
				КонецЕсли;
			Иначе
				СтрНастроек.ЗначениеПоУмолчанию = Неопределено;	
			КонецЕсли; // Заполнено имя типа.
		Иначе	
			СтрНастроек.ЗначениеПоУмолчанию = СтрНастроек.Аналитика.ТипЗначения.ПривестиЗначение();
		КонецЕсли; // Составной/не составной.
	КонецЕсли; // Аналитика заполнена.
	
КонецПроцедуры

// Функция определяет, является ли аналитика составного типа или нет.
// 
// Параметры:
//  Аналитика  - ПланВидовХарактеристик.Ссылка.
// 
// Возвращаемое значение:
//   ЭтоСоставной   - Булево.
// 
Функция ЭтоАналитикаСоставногоТипа(Аналитика) Экспорт

	ЭтоСоставной = Ложь;
	Если ЗначениеЗаполнено(Аналитика) 
		И Аналитика.ТипЗначения.Типы().Количество()>1 Тогда
		
		ЭтоСоставной = Истина;
	КонецЕсли; 
	
	Возврат ЭтоСоставной;

КонецФункции

// Процедура инициализирует значения дополнительных измерений.
// 
// Параметры:
//  Контейнер   - СтрокаТабличнойЧасти,ДокументОбъект.
//  Измерения   - Структура.
//  НастройкиИзмерений - Соответствие.
// 
Процедура ИнициализироватьЗначенияДопИзмерений(Контейнер,Измерения = Неопределено,НастройкиИзмерений = Неопределено) Экспорт

	Если Контейнер = Неопределено Тогда
		Возврат; 
	КонецЕсли; 
	
	Если Измерения = Неопределено Тогда
		Измерения = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
	КонецЕсли; 
	
	Если НастройкиИзмерений = Неопределено Тогда
		НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	КонецЕсли; 
	
	Для каждого КлючИЗначение Из Измерения Цикл
		ИмяИзмерения = КлючИЗначение.Ключ;
		ТекущаяНастройка = НастройкиИзмерений[ИмяИзмерения];
		Если ТекущаяНастройка <> Неопределено Тогда
			Если Контейнер[ИмяИзмерения] = Неопределено Тогда
            	Контейнер[ИмяИзмерения] = ТекущаяНастройка.ЗначениеПоУмолчанию;
			КонецЕсли;	
		КонецЕсли;   		
	КонецЦикла; 	

КонецПроцедуры

// Процедура обрабатывает событие очистки дополнительного измерения.
// 
// Параметры:
//  Контейнер				   - СтрокаТабличнойЧасти,ДокументОбъект.
//  ИмяПоля					   - Строка.
//  СтандартнаяОбработка 	   - Ложь.
//  НастройкиИзмерений 		   - Соответствие.
// 
//  ИмяКлючаНастройкиИзмерений - Строка. По умолчанию "".
//     Когда ИмяПоля указано с префиксом "бит_" 				 	   например: бит_Аналитика_1,
//     тогда значение параметра необходимо указать без префикса "бит_" например: Аналитика_1.
// 
Процедура ОбработкаОчисткиДополнительногоИзмерения(Контейнер
												  ,ИмяПоля
												  ,СтандартнаяОбработка
												  ,НастройкиИзмерений = Неопределено
												  ,ИмяКлючаНастройкиИзмерений = "") Экспорт

	Если Контейнер = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НастройкиИзмерений = Неопределено Тогда
		НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	КонецЕсли;  
	
	Если ПустаяСтрока(ИмяКлючаНастройкиИзмерений) Тогда
		ИмяКлючаНастройкиИзмерений = ИмяПоля;
	КонецЕсли;
	
	ТекущаяНастройка = НастройкиИзмерений[ИмяКлючаНастройкиИзмерений];
	
	Если ТекущаяНастройка <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Если ТекущаяНастройка.ЭтоСоставнойТип Тогда
			Контейнер[ИмяПоля]   = Неопределено;
		Иначе	
			Контейнер[ИмяПоля]   = ТекущаяНастройка.ЗначениеПоУмолчанию;
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

// Функция проверяет наличие движений по дополнительной аналитике в регистрах подсистем БИТ:ФИНАНС.
// 
// Параметры:
//  ИмяАналитики      - Строка.
//  ВыводитьСообщения - Булево.
//  ТекстСообщения	  - Строка, в которую будет помещено диагностическое сообщение.
// 
// Возвращаемое значение:
//   Булево.
// 
Функция ЕстьДвиженияПоАналитике(ИмяАналитики, ВыводитьСообщения, ТекстСообщения = "") Экспорт 

	УстановитьПривилегированныйРежим(Истина);
	
	ЕстьДвижения = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекстОборотыПоБюджетам", 		  НСтр("ru = 'Обороты по бюджетам'"));
	Запрос.УстановитьПараметр("ТекстКонтрольныеЗначенияБюджетов", НСтр("ru = 'Контрольные значения бюджетов'"));
	Запрос.УстановитьПараметр("ТекстЗависимыеОбороты", 			  НСтр("ru = 'Зависимые обороты'"));
	Запрос.УстановитьПараметр("ТекстПланируемоеПоступление", 	  НСтр("ru = 'Планируемое поступление денежных средств'"));
	Запрос.УстановитьПараметр("ТекстПланируемыйРасход", 		  НСтр("ru = 'Планируемый расход денежных средств'"));
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	&ТекстОборотыПоБюджетам КАК ИмяРегистра,
	|	бит_ОборотыПоБюджетамОбороты.%ИмяАналитики%
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(, , Период, %ИмяАналитики% <> НЕОПРЕДЕЛЕНО) КАК бит_ОборотыПоБюджетамОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	&ТекстКонтрольныеЗначенияБюджетов,
	|	бит_КонтрольныеЗначенияБюджетовОбороты.%ИмяАналитики%
	|ИЗ
	|	РегистрНакопления.бит_КонтрольныеЗначенияБюджетов.Обороты(, , , %ИмяАналитики% <> НЕОПРЕДЕЛЕНО) КАК бит_КонтрольныеЗначенияБюджетовОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	&ТекстЗависимыеОбороты,
	|	бит_ЗависимыеОбороты.%ИмяАналитики%
	|ИЗ
	|	РегистрСведений.бит_ЗависимыеОбороты КАК бит_ЗависимыеОбороты
	|ГДЕ
	|	(бит_ЗависимыеОбороты.%ИмяАналитики% <> НЕОПРЕДЕЛЕНО
	|			ИЛИ бит_ЗависимыеОбороты.%ИмяАналитики%_Зависимый <> НЕОПРЕДЕЛЕНО)
	|
	|";
	Если Метаданные.РегистрыНакопления.Найти("бит_ПланируемоеПоступлениеДенежныхСредств") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	&ТекстПланируемоеПоступление,
		|	бит_ПланируемоеПоступлениеДенежныхСредствОбороты.%ИмяАналитики%
		|ИЗ
		|	РегистрНакопления.бит_ПланируемоеПоступлениеДенежныхСредств.Обороты(, , , %ИмяАналитики% <> НЕОПРЕДЕЛЕНО) КАК бит_ПланируемоеПоступлениеДенежныхСредствОбороты
		|
		|";
	КонецЕсли;
	Если Метаданные.РегистрыНакопления.Найти("бит_ПланируемыйРасходДенежныхСредств") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	&ТекстПланируемыйРасход,
		|	бит_ПланируемыйРасходДенежныхСредствОбороты.%ИмяАналитики%
		|ИЗ
		|	РегистрНакопления.бит_ПланируемыйРасходДенежныхСредств.Обороты(, , , %ИмяАналитики% <> НЕОПРЕДЕЛЕНО) КАК бит_ПланируемыйРасходДенежныхСредствОбороты
		|
		|";
	КонецЕсли;
				   
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяАналитики%", ИмяАналитики);			   
				   
	Результат 	 = Запрос.Выполнить();	
	ЕстьДвижения = НЕ Результат.Пустой();
	
	Если ВыводитьСообщения И ЕстьДвижения Тогда
		Ошибки 		   = Новый Массив; 
		Выборка 	   = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл				 
			Ошибки.Добавить(Выборка.ИмяРегистра);
		КонецЦикла; 
		ТекстСообщения = НСтр("ru='Обнаружены движения по аналитике ""%1"" в регистрах: ';
							  |en='Detect movement of intelligence ""%1"" in registers:'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяАналитики); 

		ТекстСообщения = ТекстСообщения + Символы.ПС + "-" + СтрСоединить(Ошибки, Символы.ПС + "-");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
	КонецЕсли; 

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЕстьДвижения;
	
КонецФункции

// Процедура контролирует совпадение типов дополнительных аналитик в наборе записей с типами аналитик, 
// назначенными в регистре сведений "бит_Назначение дополнительных измерений".
// 
// Параметры:
//  НаборЗаписей  - РегистрНакопленияНаборЗаписей.
// 
Процедура КонтрольТиповДополнительныАналитик(НаборЗаписей) Экспорт
	
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	ИзмеренияДоп = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
	
	Для каждого Запись Из НаборЗаписей Цикл
		Для каждого КлючИЗначение Из ИзмеренияДоп Цикл
			ИмяИзмерения      = КлючИЗначение.Ключ;
			ТекущаяНастройка  = НастройкиИзмерений[ИмяИзмерения];
			ЗначениеИзмерения = Запись[ИмяИзмерения];
			Если НЕ ЗначениеЗаполнено(ЗначениеИзмерения) Тогда
				// Согласно стандарту пустые значения составного типа - приводим к неопределено.
				Запись[ИмяИзмерения] = Неопределено;
			Иначе	
				Если ТекущаяНастройка = Неопределено Тогда
					Если ЗначениеИзмерения <> Неопределено Тогда
						// Настройки нет - приводим к неопределено.
						Запись[ИмяИзмерения] = Неопределено;
					КонецЕсли; 
				Иначе	
					Если НЕ ТекущаяНастройка.Аналитика.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеИзмерения)) Тогда
						// Тип значения не соответствует настройке доп. измерения - приводим к неопределено.
						Запись[ИмяИзмерения] = Неопределено
					КонецЕсли; 
				КонецЕсли; // Заполнена настройка для измерения.
			КонецЕсли; // Заполнено значение измерения.
		КонецЦикла; // По дополнительным измерениям.
	КонецЦикла; // По записям набора.
	
КонецПроцедуры

// Функция формирует текст для конкретного поля отбора построителя отчета.
// 
// Параметры:
// 	ИмяРегистра - строка - имя таблицы запроса, поле которой будет использоваться в отборе.
// 	Аналитика - строка - имя поля таблицы, которое используется в отборе.
// 	СтруктураНастройки - структура - содержит настройки отображения дополнительных измерений регистра.
// 
// Возвращаемое значение:
//   СтрокаПоляОтбора   - Строка.
// 
Функция СформироватьТекстПоляОтбора(ИмяРегистра, Аналитика, СтруктураНастройки)  Экспорт
	
	СтрокаПоляОтбора = "";
	
	Если НЕ СтруктураНастройки.ЭтоСоставнойТип Тогда
		// Определим полное имя объекта.
		Если НЕ бит_ОбщегоНазначения.ЭтоПримитивныйТип(СтруктураНастройки.Аналитика.ТипЗначения.ПривестиЗначение()) Тогда
			
			ПустоеЗначение = СтруктураНастройки.Аналитика.ТипЗначения.ПривестиЗначение();
			
			МетаданныеОбъекта = ПустоеЗначение.Метаданные();
			
			ИмяОбъекта = МетаданныеОбъекта.Имя;
			
			Если бит_ОбщегоНазначения.ЗначениеПринадлежитКоллекцииМетаданных("Перечисления",ПустоеЗначение) Тогда
				ИмяОбъектаПолное = "Перечисление."+ИмяОбъекта;
			Иначе	
				ВидОбъекта = бит_ПраваДоступа.ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);	
				ИмяОбъектаПолное = бит_ПраваДоступа.ПолучитьПолноеИмяОбъекта(ИмяОбъекта,ВидОбъекта);
			КонецЕсли; 
		Иначе
			ИмяОбъектаПолное = Строка(СтруктураНастройки.Аналитика.ТипЗначения);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяОбъектаПолное) Тогда
			СтрокаПоляОтбора = ",
			|Выразить("+ИмяРегистра+"."+Аналитика + " КАК "+ИмяОбъектаПолное+").* КАК "+Аналитика;
		Иначе
			СтрокаПоляОтбора = ",
			|"+ИмяРегистра+"."+Аналитика;	
		КонецЕсли;
		
	Иначе
		СтрокаПоляОтбора = ",
		|"+ИмяРегистра+"."+Аналитика;	
	КонецЕсли; 
	
	Возврат СтрокаПоляОтбора;
	
КонецФункции

// Устарела. Следует использовать бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияНаФорме(). 
Процедура ОтобразитьДополнительныеИзмеренияНаФорме_Управляемая(ТекущаяФорма, Измерения, НастройкиИзмерений, СоответствиеИмен = Неопределено) Экспорт
	
	ПоказатьДополнительныеИзмеренияНаФорме(ТекущаяФорма, Измерения, НастройкиИзмерений, 
				СоответствиеИмен);
	
КонецПроцедуры

// Устарела. Следует использовать бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(). 
Процедура ОтобразитьДополнительныеИзмеренияВТабличномПоле_Управляемая(ТекущаяФорма
	                                                      ,ИмяТабличногоПоля
														  ,Измерения = Неопределено
														  ,НастройкиИзмерений = Неопределено
														  ,СоответствиеИмен = Неопределено) Экспорт

	ПоказатьДополнительныеИзмеренияВТабличномПоле(ТекущаяФорма, ИмяТабличногоПоля,
				Измерения, НастройкиИзмерений, СоответствиеИмен);

КонецПроцедуры

// Процедура управляет видимостью колонок дополнительных измерений. 
// Выводит синонимы назначенные измерениям.
// 
// Параметры:
//  ТекущаяФорма       - Форма.
//  ИмяТабличногоПоля  - Строка.
//  Измерения          - Структура.
//  НастройкиИзмерений - Соответствие.
//  СоответствиеИмен   - Соответствие.
//
Процедура ПоказатьДополнительныеИзмеренияВТабличномПоле(ТекущаяФорма, ИмяТабличногоПоля,
				Измерения = Неопределено, НастройкиИзмерений = Неопределено, СоответствиеИмен = Неопределено) Экспорт

	Если Измерения = Неопределено Тогда
		Измерения = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
	КонецЕсли; 
	
	Если НастройкиИзмерений = Неопределено Тогда
		НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	КонецЕсли;
	
	// Текущая реализация не учитывает объединение элементов в группы.
	КолонкиТабПоля = ТекущаяФорма.Элементы;
		
	Если СоответствиеИмен = Неопределено Тогда
		СоответствиеИмен = Новый Соответствие;
	КонецЕсли;
	
	Для каждого КлючИЗначение Из Измерения Цикл
		ИмяИзмерения = КлючИЗначение.Ключ;
		Если НЕ СоответствиеИмен[ИмяИзмерения] = Неопределено Тогда
			СтруктураДанных	= СоответствиеИмен[ИмяИзмерения];
			ИмяКолонки		= СтруктураДанных.ИмяПоля;
			Префикс			= СтруктураДанных.Префикс;
			Постфикс		= СтруктураДанных.Постфикс;
		Иначе
			ИмяКолонки	= ИмяТабличногоПоля + ИмяИзмерения;
			Префикс		= "";
			Постфикс	= "";
		КонецЕсли;
		
		ТекущаяКолонка = КолонкиТабПоля.Найти(ИмяКолонки);
		Если ТекущаяКолонка <> Неопределено Тогда
			ТекущаяНастройка = НастройкиИзмерений[ИмяИзмерения];
			Если ТекущаяНастройка <> Неопределено Тогда
				ТекущаяКолонка.Видимость = Истина;				
				ТекущаяКолонка.Заголовок = Префикс + ТекущаяНастройка.Синоним + Постфикс;
				Если ТекущаяКолонка.Вид = ВидПоляФормы.ПолеВвода Тогда					
					ТекущаяКолонка.АвтоОтметкаНезаполненного = ТекущаяНастройка.Обязательное;
					ТекущаяКолонка.ОграничениеТипа 			 = ТекущаяНастройка.Аналитика.ТипЗначения; 				 
				КонецЕсли; 
			Иначе
				ТекущаяКолонка.Видимость = Ложь;
			КонецЕсли;
			// N. B.
			Если бит_МеханизмДопИзмеренийКлиентСервер.ЭтоАналитикаБанковскийСчет(ИмяИзмерения, НастройкиИзмерений)
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяКолонка, "БыстрыйВыбор") Тогда
				ТекущаяКолонка.БыстрыйВыбор = Ложь;
			КонецЕсли;
		КонецЕсли; // Есть колонка с заданным именем.
	КонецЦикла;

КонецПроцедуры
        
// Процедура если по статье не было движений и удаляют назначенную доп. аналитику.
// Необходимо удалить во всех справочниках статьи оборотов обязательность заполнения по данной аналитике,
// чтобы не возникало ошибок.
// 
// Параметры
// 	ИмяАналитики - строка.
// 
Процедура УдалитьОбязательностьЗаполненияВСтатьеОборотов(ИмяАналитики) Экспорт 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РасширениеАналитик", Неопределено);
	Запрос.УстановитьПараметр("РасширениеСвойствАналитик", Неопределено);
	Запрос.УстановитьПараметр("РасширениеУсловияАналитик", Ложь);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Наименование КАК Наименование,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.Учет_Аналитика_1 КАК Учет_Аналитика_1,
	|	Таблица.Учет_Аналитика_2 КАК Учет_Аналитика_2,
	|	Таблица.Учет_Аналитика_3 КАК Учет_Аналитика_3,
	|	Таблица.Учет_Аналитика_4 КАК Учет_Аналитика_4,
	|	Таблица.Учет_Аналитика_5 КАК Учет_Аналитика_5,
	|	Таблица.Учет_Аналитика_6 КАК Учет_Аналитика_6,
	|	Таблица.Учет_Аналитика_7 КАК Учет_Аналитика_7,
	|	Таблица.Обязательный_Аналитика_1 КАК Обязательный_Аналитика_1,
	|	Таблица.Обязательный_Аналитика_2 КАК Обязательный_Аналитика_2,
	|	Таблица.Обязательный_Аналитика_3 КАК Обязательный_Аналитика_3,
	|	Таблица.Обязательный_Аналитика_4 КАК Обязательный_Аналитика_4,
	|	Таблица.Обязательный_Аналитика_5 КАК Обязательный_Аналитика_5,
	|	Таблица.Обязательный_Аналитика_6 КАК Обязательный_Аналитика_6,
	|	Таблица.Обязательный_Аналитика_7 КАК Обязательный_Аналитика_7,
	|	&РасширениеАналитик,
	|	&РасширениеСвойствАналитик
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК Таблица
	|ГДЕ
	|	(Таблица.Обязательный_Аналитика_1 = ИСТИНА
	|			ИЛИ Таблица.Учет_Аналитика_2 = ИСТИНА
	|			ИЛИ Таблица.Учет_Аналитика_3 = ИСТИНА
	|			ИЛИ Таблица.Учет_Аналитика_4 = ИСТИНА
	|			ИЛИ Таблица.Учет_Аналитика_5 = ИСТИНА
	|			ИЛИ Таблица.Учет_Аналитика_6 = ИСТИНА
	|			ИЛИ Таблица.Учет_Аналитика_7 = ИСТИНА
	|			ИЛИ &РасширениеУсловияАналитик)";
	
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		
		РасширениеАналитик = 
		"
		|	Таблица.Учет_Аналитика_8 КАК Учет_Аналитика_8,
		|	Таблица.Учет_Аналитика_9 КАК Учет_Аналитика_9,
		|	Таблица.Учет_Аналитика_10 КАК Учет_Аналитика_10,
		|	Таблица.Учет_Аналитика_11 КАК Учет_Аналитика_11,
		|	Таблица.Учет_Аналитика_12 КАК Учет_Аналитика_12";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РасширениеАналитик", РасширениеАналитик);
		
		РасширениеСвойствАналитик = 
		"
		|	Таблица.Обязательный_Аналитика_8 КАК Обязательный_Аналитика_8,
		|	Таблица.Обязательный_Аналитика_9 КАК Обязательный_Аналитика_9,
		|	Таблица.Обязательный_Аналитика_10 КАК Обязательный_Аналитика_10,
		|	Таблица.Обязательный_Аналитика_11 КАК Обязательный_Аналитика_11,
		|	Таблица.Обязательный_Аналитика_12 КАК Обязательный_Аналитика_12";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РасширениеСвойствАналитик", РасширениеСвойствАналитик);
		
		РасширениеУсловияАналитик =
		"
		|	Таблица.Учет_Аналитика_8
		|	ИЛИ Таблица.Учет_Аналитика_9
		|	ИЛИ Таблица.Учет_Аналитика_10
		|	ИЛИ Таблица.Учет_Аналитика_11
		|	ИЛИ Таблица.Учет_Аналитика_12";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РасширениеУсловияАналитик", РасширениеУсловияАналитик);
	КонецЕсли; 
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	
	СтрОтбор = Новый Структура("Обязательный_"+ИмяАналитики, Истина);
	МассивСтрок = ТЗ.НайтиСтроки(СтрОтбор);
	
	Если МассивСтрок.Количество() > 0 Тогда
		Для каждого СтрокаТЗ Из МассивСтрок Цикл
			СпрОб = СтрокаТЗ.Ссылка.ПолучитьОбъект();
			СпрОб["Обязательный_"+ИмяАналитики] = Ложь;
			СпрОб["Учет_"+ИмяАналитики] = Ложь;
			бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОб,,"Ошибки");
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

// Функция получает значение аналитики.
// 
// Параметры:
//  Объект             	- Объект, доп. аналитика, которого получается.
//  ИмяАналитики       	- Строка или значение ПВХ "бит_ВидыДополнительныхАналитик".
//  ЗначениеПоУмолчанию	- Значение, которое нужно вернуть, если в регистре нет такой аналитики.
//
// Возвращаемое значение:
//   Значение аналитики.
//
Функция ПолучитьЗначениеДопАналитики(Объект, ИмяАналитики, ЗначениеПоУмолчанию = Неопределено) Экспорт

	Если ТипЗнч(ИмяАналитики) = Тип("Строка") Тогда
	     Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик[ИмяАналитики];
	Иначе	
	     Аналитика = ИмяАналитики;
	КонецЕсли; 
	
	Значение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ДополнительныеАналитики.ЗначениеАналитики КАК ЗначениеАналитики
	|ИЗ
	|	РегистрСведений.бит_ДополнительныеАналитики КАК бит_ДополнительныеАналитики
	|ГДЕ
	|	бит_ДополнительныеАналитики.Объект = &Объект
	|	И бит_ДополнительныеАналитики.Аналитика = &Аналитика";
	
	Запрос.УстановитьПараметр("Аналитика", Аналитика);
	Запрос.УстановитьПараметр("Объект",    Объект);
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
	    Значение = Выборка.ЗначениеАналитики;
	Иначе
		Значение = ЗначениеПоУмолчанию;
	КонецЕсли; 
	
	Возврат Значение;
	
КонецФункции

// Процедура формирует заголовки полей схемы компоновки данных связанных с дополнительными
// 	измерениями регистра в соответствии с указанными настройками доп.измерений.
// 
// Параметры:
// 	СхемаКомпоновкиДанных - СхемаКомпоновкиДанных.
// 	ИмяНабораДанных - Строка - набор данных переданной схемы компоновки данных,
// 					в котором необходимо сформировать заголовки полей связанных с дополнительными измерениями.
// 	НастройкиИзмерений - Соответствие - настройки используемых дополнительных измерений.
// 	ДопИзмерения - Структура - содержит дополнительные измерения регистра накопления "бит_ОборотыПоБюджетам".
// 	Исключения - Массив - содержит типы аналитик, которые дублируются с реквизитами документа.
//  Префиксы - Массив - Строка, префикс в пути к данным у поля. На пример: Обороты.Аналитика_1. "Обороты" - префикс.
// 
// АПК:142-выкл 4 необязательных параметра для совместимости с предыдущими версиями библиотеки.
Процедура СформироватьЗаголовкиПолейДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, ИмяНабораДанных, 
				НастройкиИзмерений = Неопределено, ДопИзмерения = Неопределено, Исключения = Неопределено, Префиксы = Неопределено) Экспорт
// АПК:142-вкл
	Если ДопИзмерения = Неопределено Тогда
		ДопИзмерения = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
	КонецЕсли;
	
	Если НастройкиИзмерений = Неопределено Тогда
		НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	КонецЕсли;
	
	НастройкиДопИзмерений = Новый Структура("НастройкиИзмерений, ДопИзмерения", НастройкиИзмерений, ДопИзмерения);

	Если Исключения = Неопределено Тогда
		Исключения = Новый Массив; 	
	КонецЕсли;
	
	Если Префиксы = Неопределено Тогда
		Префиксы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(""); 	
	КонецЕсли;
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти(ИмяНабораДанных);
	Если НаборДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(НаборДанных) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных") Тогда

		НастроитьПоляДополнительныхИзмерений(НаборДанных, НастройкиДопИзмерений, Исключения, Префиксы);
		
		ПрефиксЭлементов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(""); 
		Для каждого Элемент Из НаборДанных.Элементы Цикл
			НастроитьПоляДополнительныхИзмерений(Элемент, НастройкиДопИзмерений, Исключения, ПрефиксЭлементов);
		КонецЦикла;
	Иначе 	
		НастроитьПоляДополнительныхИзмерений(НаборДанных, НастройкиДопИзмерений, Исключения, Префиксы)
	КонецЕсли;

КонецПроцедуры

// Процедура формирует заголовки полей схемы компоновки данных связанных с дополнительными
// 	измерениями регистра в соответствии с указанными настройками доп.измерений. 
//  Данная модификация процедуры используется в настройках формы ввода.
// 
// Параметры:
// 	СхемаКомпоновкиДанных - СхемаКомпоновкиДанных.
// 	ИмяНабораДанных - Строка - набор данных переданной схемы компоновки данных,
// 					в котором необходимо сформировать заголовки полей связанных с дополнительными измерениями.
// 	НастройкиИзмерений - Соответствие - настройки используемых дополнительных измерений.
// 	ДопИзмерения - Структура - содержит дополнительные измерения регистра накопления "бит_ОборотыПоБюджетам".
// 
Процедура СформироватьЗаголовкиПолейДополнительныхИзмеренийНастройкиФормыВвода(СхемаКомпоновкиДанных
	                                                                            , ИмяНабораДанных
																				, НастройкиИзмерений=Неопределено
																				, ДопИзмерения=Неопределено
																				, УстанавливатьТипы = Истина) Экспорт
	
	Если ДопИзмерения = Неопределено Тогда
		ДопИзмерения = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
	КонецЕсли;
	
	Если НастройкиИзмерений = Неопределено Тогда
		НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	КонецЕсли;
	
	Поля = СхемаКомпоновкиДанных.НаборыДанных[ИмяНабораДанных].Поля;
	
	Для Каждого ТекущаяНастройка Из ДопИзмерения Цикл
		
		// Сами измерения.
		НайденноеПоле = Поля.Найти(ТекущаяНастройка.Ключ);
		Если НЕ НайденноеПоле = Неопределено Тогда
			Если НастройкиИзмерений[ТекущаяНастройка.Ключ] = Неопределено Тогда
				НайденноеПоле.Заголовок = НСтр("ru='Не используется';en='Ǹot in use'");
			Иначе
				НайденноеПоле.Заголовок = НастройкиИзмерений[ТекущаяНастройка.Ключ].Синоним;
				Если УстанавливатьТипы Тогда
					МассивТипов = Новый Массив;
					МассивТипов.Добавить(ТипЗнч(НастройкиИзмерений[ТекущаяНастройка.Ключ].ЗначениеПоУмолчанию));
					НайденноеПоле.ТипЗначения 	= Новый ОписаниеТипов(МассивТипов);
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		
		// Кодификаторы.
		ИмяПоля = ТекущаяНастройка.Ключ+"_Кодификатор";
		НайденноеПоле = Поля.Найти(ИмяПоля);
		Если НЕ НайденноеПоле = Неопределено Тогда
			Если НастройкиИзмерений[ТекущаяНастройка.Ключ] = Неопределено Тогда
				НайденноеПоле.Заголовок = НСтр("ru='Не используется';en='Ǹot in use'");
			Иначе
				НайденноеПоле.Заголовок = НастройкиИзмерений[ТекущаяНастройка.Ключ].Синоним + "_Кодификатор";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция получает значение полонительных аналитик.
// 
// Параметры:
//  Объект        - Объект, доп. аналитика, которого получается.
//  ИменаАналитик - Строка имен аналитик, разделенных запятой, или массив, значение которых требуется определеить.
//
// Возвращаемое значение:
//	Структруа - значение дополнительных аналитик.
//
Функция ЗначенияДополнительныхАналитик(Объект, Знач ИменаАналитик) Экспорт
	
	Если ТипЗнч(ИменаАналитик) = Тип("Строка") Тогда
		Если ПустаяСтрока(ИменаАналитик) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		ИменаАналитик = СтрРазделить(ИменаАналитик, ",", Ложь);
		Для Индекс = 0 По ИменаАналитик.ВГраница() Цикл
			ИменаАналитик[Индекс] = СокрЛП(ИменаАналитик[Индекс]);
		КонецЦикла; 
	ИначеЕсли ТипЗнч(ИменаАналитик) <> Тип("Массив") Тогда
		ТекстСообщения = НСтр("ru = 'Неверный тип второго параметра %1 в функции %2: %3.';
							|en = 'Invalid type of parameter %1 in function %2: %3.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, "ИменаАналитик", 
							"бит_МеханизмДопИзмерений.ЗначенияДополнительныхАналитик", Строка(ТипЗнч(ИменаАналитик)));
		
		ВызватьИсключение ТекстСообщения;	
	КонецЕсли; 
	
	ЗначенияАналитик = Новый Структура(СтрСоединить(ИменаАналитик,","));
	ВидыАналитик	 = Новый Массив;   
	
	Для каждого ЭлементАналитики Из ЗначенияАналитик Цикл 
		Попытка
			ВидыАналитик.Добавить(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик[ЭлементАналитики.Ключ]);
		Исключение
		    ТекстСообщения = НСтр("ru = 'Неверное имя вида дополнительной аналитики во втором параметре %1 в функции %2: %3.';
									|en = 'The name of the additional analytics type is incorrect in the second parameter %1 in the function %2: %3.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, "ИменаАналитик", "бит_МеханизмДопИзмерений.ЗначенияДополнительныхАналитик", 
								ЭлементАналитики.Ключ);  
			ВызватьИсключение ТекстСообщения;					
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначениеАналитик.Аналитика.ИмяПредопределенныхДанных КАК ИмяАналитики,
	|	ЗначениеАналитик.ЗначениеАналитики КАК Значение
	|ИЗ
	|	РегистрСведений.бит_ДополнительныеАналитики КАК ЗначениеАналитик
	|ГДЕ
	|	ЗначениеАналитик.Объект = &Объект
	|	И ЗначениеАналитик.Аналитика В(&ВидыАналитик)";
	Запрос.УстановитьПараметр("ВидыАналитик", ВидыАналитик);
	Запрос.УстановитьПараметр("Объект", Объект);   
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗначенияАналитик.Вставить(Выборка.ИмяАналитики, Выборка.Значение);
	КонецЦикла;
	
	Возврат ЗначенияАналитик;
	
КонецФункции

// Функция получает соответствие значений аналитик по договору контрагента.
// 
// Параметры:
//  ДокументОбъект  - ДокументОбъект.
//  
// Возвращаемое значение:
//   Соответствие - значения аналитик по договору контрагента.
// 
Функция ПолучитьСтатьюПоДоговору(ДокументОбъект, ДоговорКонтрагента) Экспорт

	ОсновнаяСтатья = Неопределено;
	
	// Статья оборотов.
	СтруктураОтбораСтатьи = ОтборДляСтатьиОборотовПоДокументу(ДокументОбъект);
	Если СтруктураОтбораСтатьи.ЗаполнятьСтатью Тогда // Если для документа нужно заполянть статью по договору.
		
		ТипСтатьи   = СтруктураОтбораСтатьи.ТипСтатьи;
		РасходДоход = СтруктураОтбораСтатьи.РасходДоход;
					
		// Найдем основную статью в договоре контрагента по типу статьи.
		ОсновнаяСтатья = ?(ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.БДР,
							ДоговорКонтрагента.бит_ОсновнаяСтатьяОборотовБДР,
							ДоговорКонтрагента.бит_ОсновнаяСтатьяОборотов);
							
		// Если статья не найдена или она не совпадает по типу и направлению Расход/Доход
		// тогда обходим табличную часть.
		Если Не ЗначениеЗаполнено(ОсновнаяСтатья) 
			ИЛИ ОсновнаяСтатья.РасходДоход <> РасходДоход
			ИЛИ ОсновнаяСтатья.ТипСтатьи <> ТипСтатьи Тогда
			
			ТабЧастьСтатьиОборотов = ДоговорКонтрагента.бит_СтатьиОборотов;
			
		    ОтборПоНаправлению = Новый Структура("РасходДоход", РасходДоход);
			НайденныеСтроки = ТабЧастьСтатьиОборотов.НайтиСтроки(ОтборПоНаправлению);
			Для каждого СтрокаТч Из НайденныеСтроки Цикл
				ТекущаяСтатья = СтрокаТч.СтатьяОборотов;
				Если ТекущаяСтатья.ТипСтатьи = ТипСтатьи Тогда
					ОсновнаяСтатья = ТекущаяСтатья;
					Прервать;					
				КонецЕсли;  				
			КонецЦикла; 
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ОсновнаяСтатья;
	
КонецФункции

// Процедура заполняет данные выбора во время автоподбора аналитики по введенному тексту.
//
// Параметры:
//  ДанныеВыбора - СписокЗначений - Список значений для заполнения.
//  Текст - Строка - Текст, введенный в поле.
//  Отбор - Структура - Отбор по реквизитам справочников договоров.
//  ТипДоговора - Тип - Тип ссылки договора.
//
Процедура ЗаполнитьДанныеВыбораАналитикиДоговоров(ДанныеВыбора, Текст, Отбор, ТипДоговора) Экспорт
	
	// NB Перенести в платежную позицию.
	НомерОтбора  = 0;
	ТекстУсловий = "";
	ПустаяСсылка = Новый(ТипДоговора);
	ИмяТаблицы	 = ОбщегоНазначения.ИмяТаблицыПоСсылке(ПустаяСсылка); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтрокаПоиска", Текст + "%");
	Запрос.УстановитьПараметр("ПустаяСсылка", Новый(ТипДоговора));
	Для Каждого ТекущийОтбор Из Отбор Цикл
		НомерОтбора = НомерОтбора + 1;
		ТекстУсловий = ТекстУсловий + "
		|	И Договоры." + ТекущийОтбор.Ключ + " В (&ЗначениеОтбора" + СокрЛП(НомерОтбора) + ")";
		Запрос.УстановитьПараметр("ЗначениеОтбора" + СокрЛП(НомерОтбора), ТекущийОтбор.Значение);
	КонецЦикла;
	
	// Не сохранять конструктором запроса, будет потерян ТекстУсловий.
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Договоры.Ссылка КАК Ссылка,
	|	Договоры.Наименование КАК Наименование,
	|	Договоры.Наименование КАК Совпадение,
	|	1 КАК Порядок
	|ПОМЕСТИТЬ ДоговорыПоиск
	|ИЗ
	|	#Таблица КАК Договоры
	|ГДЕ
	|	Договоры.Наименование ПОДОБНО &СтрокаПоиска
	|	//ТекстУсловий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Договоры.Ссылка,
	|	Договоры.Наименование,
	|	Договоры.Номер,
	|	2
	|ИЗ
	|	#Таблица КАК Договоры
	|ГДЕ
	|	Договоры.Номер ПОДОБНО &СтрокаПоиска
	|	//ТекстУсловий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыПоиск.Ссылка КАК Ссылка,
	|	МИНИМУМ(ДоговорыПоиск.Порядок) КАК Порядок
	|ПОМЕСТИТЬ ДоговорыПоПорядку
	|ИЗ
	|	ДоговорыПоиск КАК ДоговорыПоиск
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыПоиск.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДоговорыПоиск.Ссылка, &ПустаяСсылка) КАК Ссылка,
	|	ЕСТЬNULL(ДоговорыПоиск.Наименование, """") КАК Наименование,
	|	ЕСТЬNULL(ДоговорыПоиск.Совпадение, """") КАК Совпадение,
	|	ЕСТЬNULL(ДоговорыПоиск.Порядок, 0) КАК Порядок
	|ИЗ
	|	ДоговорыПоПорядку КАК ДоговорыПоПорядку
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыПоиск КАК ДоговорыПоиск
	|		ПО ДоговорыПоПорядку.Ссылка = ДоговорыПоиск.Ссылка
	|			И ДоговорыПоПорядку.Порядок = ДоговорыПоиск.Порядок
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕСТЬNULL(ДоговорыПоиск.Порядок, 0),
	|	ЕСТЬNULL(ДоговорыПоиск.Совпадение, """"),
	|	ЕСТЬNULL(ДоговорыПоиск.Наименование, """")";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#Таблица", ИмяТаблицы);
	Если Не ПустаяСтрока(ТекстУсловий) Тогда
		ТекстУсловий = Сред(ТекстУсловий, 3);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ТекстУсловий", ТекстУсловий);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстЗначение = ?(Выборка.Порядок = 1,
						Выборка.Наименование,
						СокрП(Выборка.Совпадение) + " (" + Выборка.Наименование + ")");
		
		ДанныеВыбора.Добавить(Выборка.Ссылка, ТекстЗначение);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстСоответствуетШаблону

Функция УсловиеПроверкиТекстСоответствуетШаблону(Шаблон)

	ШаблонОператора = "&ПроверяемыйТекст ПОДОБНО ""%1""";
	
	Результат 		= "";
	Выражение		= "";
	ЧтениеВыражения = Ложь;
	ЧтениеБлока		= Ложь;
	
	Для НомерСтроки = 1 По СтрЧислоСтрок(Шаблон) Цикл
		ТекущаяСтрока = СтрПолучитьСтроку(Шаблон, НомерСтроки);
		ДлинаСтроки   = СтрДлина(ТекущаяСтрока);
		Позиция 	  = 1;
		Пока Позиция <= ДлинаСтроки Цикл
			
			Символ = Сред(ТекущаяСтрока, Позиция, 1);
			Если Символ = "/" И Сред(ТекущаяСтрока, Позиция, 2) = "//" Тогда
				// Дальше идет комментарий.
				Прервать;			
			КонецЕсли;
			
			Если ЭтоНачалоВыражения(Символ) И НЕ ЧтениеВыражения Тогда
				ЧтениеВыражения = Истина;
				Выражение = Выражение + Символ;
			ИначеЕсли ЭтоКонецВыражения(Символ) И ЧтениеВыражения Тогда
				ЧтениеВыражения = Ложь;
				Выражение = Выражение + Символ;
				Результат = Результат + СтрШаблон(ШаблонОператора, Выражение);
				Выражение = "";
			ИначеЕсли ЧтениеВыражения Тогда
				Выражение = Выражение + Символ;
			ИначеЕсли ЭтоНачалоБлока(Символ) Тогда
				ЧтениеБлока = Истина;
				Результат = Результат + "(";
			ИначеЕсли ЭтоКонецБлока(Символ) Тогда
				Результат = Результат + ")";
			Иначе
				ЛогическийОператор = ЛогическийОператор(Символ);
				Если ЗначениеЗаполнено(ЛогическийОператор) Тогда
					Результат = Результат + ЛогическийОператор;	
				КонецЕсли;
			КонецЕсли;
			
			Позиция = Позиция + 1;
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоНачалоБлока(ЧтоИскать)

	Возврат ЧтоИскать = "{";

КонецФункции

Функция ЭтоКонецБлока(ЧтоИскать)

	Возврат ЧтоИскать = "}";

КонецФункции

Функция ЭтоНачалоВыражения(ЧтоИскать)

	ГдеИскать = "%,[";
	Возврат СтрНайти(ГдеИскать, ЧтоИскать) <> 0;

КонецФункции

Функция ЭтоКонецВыражения(ЧтоИскать)

	ГдеИскать = "%,]";
	Возврат СтрНайти(ГдеИскать, ЧтоИскать) <> 0;

КонецФункции

Функция ЛогическийОператор(ЧтоИскать)

	ЛогическийОператор = "";
	Если ЧтоИскать = "&" Тогда
		ЛогическийОператор = " И ";
	ИначеЕсли ЧтоИскать = "~" Тогда
		ЛогическийОператор = " ИЛИ ";
	ИначеЕсли ЧтоИскать = "-" Тогда
		ЛогическийОператор = " НЕ ";
	КонецЕсли;
	
	Возврат ЛогическийОператор;
	
КонецФункции

#КонецОбласти

#Область УстановкаСвойствАналитик

Процедура ОчиститьАналитикиПриИзмененииОрганизации(Объект, ПараметрыУстановки)
	
	Если бит_ОбщегоНазначенияВызовСервера.ЭтоУТ() Тогда
		Возврат;
	КонецЕсли;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		МодульБухгалтерскийУчетВызовСервераПовтИсп = ОбщегоНазначения.ОбщийМодуль("БухгалтерскийУчетВызовСервераПовтИсп");
	#Иначе
		МодульБухгалтерскийУчетВызовСервераПовтИсп = ОбщегоНазначенияКлиент.ОбщийМодуль("БухгалтерскийУчетВызовСервераПовтИсп");
	#КонецЕсли
		
	ВсеТипыСвязанныхСубконто   = МодульБухгалтерскийУчетВызовСервераПовтИсп.ВсеТипыСвязанныхСубконто();
	ТипыСвязанныеСОрганизацией = ВсеТипыСвязанныхСубконто["Организация"];
	
	ПоляОбъекта = ПараметрыУстановки.ПоляОбъекта;
	
	Для каждого ПолеОбъекта Из ПоляОбъекта Цикл
		ИмяПоля = ПолеОбъекта.Значение;
		Если ЗначениеЗаполнено(ИмяПоля)
			И ЗначениеЗаполнено(Объект[ИмяПоля]) Тогда
			ТипПоля = ТипЗнч(Объект[ИмяПоля]);
			Если ТипыСвязанныеСОрганизацией.СодержитТип(ТипПоля) Тогда
				Объект[ИмяПоля] = Новый (ТипПоля);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура НастроитьПоляДополнительныхИзмерений(НаборДанных, НастройкиПрограммы, Исключения, Префиксы)

	НастройкиИзмерений = НастройкиПрограммы.НастройкиИзмерений;
	ДопИзмерения	   = НастройкиПрограммы.ДопИзмерения;
	ПоляНабора		   = НаборДанных.Поля;
	
	ШаблонСинонима = НСтр("ru = '%1 (аналитика)'; en = '%1 (analytics)'");
	
	Для каждого КлючЗначение Из ДопИзмерения Цикл
		Для каждого Префикс Из Префиксы Цикл
			
			ПутьКДанным   = ?(ПустаяСтрока(Префикс), Префикс, Префикс + ".") + КлючЗначение.Ключ;
			НайденноеПоле = ПоляНабора.Найти(ПутьКДанным);
			
			Если НайденноеПоле = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НастройкаАналитики = НастройкиИзмерений[КлючЗначение.Ключ];
			
			Если НастройкаАналитики = Неопределено Тогда
				НайденноеПоле.Заголовок = НСтр("ru = 'Не используется'; en = 'Not use'");
				
				НайденноеПоле.ОграничениеИспользования.Группировка = Истина;
				НайденноеПоле.ОграничениеИспользования.Поле        = Истина;
				НайденноеПоле.ОграничениеИспользования.Условие     = Истина;
				НайденноеПоле.ОграничениеИспользования.Порядок     = Истина;
				
				НайденноеПоле.ОграничениеИспользованияРеквизитов.Группировка = Истина;
				НайденноеПоле.ОграничениеИспользованияРеквизитов.Поле        = Истина;
				НайденноеПоле.ОграничениеИспользованияРеквизитов.Условие     = Истина;
				НайденноеПоле.ОграничениеИспользованияРеквизитов.Порядок     = Истина;
				
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(НастройкаАналитики.ЗначениеПоУмолчанию));
				
				НайденноеПоле.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
				
				Если НастройкаАналитики.ЭтоСоставнойТип = Ложь
					И Исключения.Найти(НастройкаАналитики.ТипЗначения.типы()[0]) <> Неопределено Тогда
					
					НайденноеПоле.ОграничениеИспользования.Группировка = Истина;
					НайденноеПоле.ОграничениеИспользования.Поле        = Истина;
					НайденноеПоле.ОграничениеИспользования.Условие     = Истина;
					НайденноеПоле.ОграничениеИспользования.Порядок     = Истина;
					
					НайденноеПоле.ОграничениеИспользованияРеквизитов.Группировка = Истина;
					НайденноеПоле.ОграничениеИспользованияРеквизитов.Поле        = Истина;
					НайденноеПоле.ОграничениеИспользованияРеквизитов.Условие     = Истина;
					НайденноеПоле.ОграничениеИспользованияРеквизитов.Порядок     = Истина;
					
				КонецЕсли;
				НайденноеПоле.Заголовок = СтрШаблон(ШаблонСинонима, НастройкаАналитики.Синоним);
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;

КонецПроцедуры

// Процедура добавляет аналитику в набор дополнительных аналитик.
// 
// Параметры:
//  ТекущийОбъект  		- ДокументОбъект.
//  НаборЗаписей   		- ДанныеФормыКоллекция, ДанныеФормыСтруктураСКоллекцией, 
//						  РегистрСведенийНаборЗаписей.бит_ДополнительныеАналитики.
//  Аналитика      		- Характеристика.бит_ВидыДополнительныхАналитик.
//  ЗначенияПоУмолчанию - Соответствие.
//
Процедура УстановитьЗначениеАналитики(ТекущийОбъект, НаборЗаписей, Аналитика, ЗначенияПоУмолчанию)

	НоваяЗапись = НаборЗаписей.Добавить();
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяЗапись, "Объект") Тогда
		НоваяЗапись.Объект = ТекущийОбъект.Ссылка;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяЗапись, "Документ") Тогда
		НоваяЗапись.Документ = ТекущийОбъект.Ссылка;
	КонецЕсли;
	
	НоваяЗапись.Аналитика = Аналитика;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяЗапись, "ИмяАналитики") Тогда
		НоваяЗапись.ИмяАналитики = СокрЛП(Аналитика.Код);	
	КонецЕсли;
		
	ЗначениеИзДанныхОбъекта = Неопределено;
	Если Аналитика.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Организации")) Тогда
		ЕстьОрганизация = ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", ТекущийОбъект.Метаданные());
		Если ЕстьОрганизация Тогда
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ТекущийОбъект)) Тогда
				ЗначениеИзДанныхОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "Организация");
			Иначе	
				ЗначениеИзДанныхОбъекта = ТекущийОбъект.Организация;
			КонецЕсли;
		КонецЕсли;
	// ++ ERP
	ИначеЕсли Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Контрагент Тогда
		ЕстьКонтрагент = ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", ТекущийОбъект.Метаданные());
		Если ЕстьКонтрагент Тогда
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ТекущийОбъект)) Тогда
				ЗначениеИзДанныхОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "Контрагент");
			Иначе	
				ЗначениеИзДанныхОбъекта = ТекущийОбъект.Контрагент;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ДоговорКонтрагента Тогда
		ЕстьДоговор = ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", ТекущийОбъект.Метаданные());
		ЕстьДоговорКонтрагента = ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКонтрагента", ТекущийОбъект.Метаданные());
		Если ЕстьДоговор Тогда
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ТекущийОбъект)) Тогда
				ЗначениеИзДанныхОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "Договор");
			Иначе	
				ЗначениеИзДанныхОбъекта = ТекущийОбъект.Договор;
			КонецЕсли;
		ИначеЕсли ЕстьДоговорКонтрагента Тогда
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ТекущийОбъект)) Тогда
				ЗначениеИзДанныхОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "ДоговорКонтрагента");
			Иначе	
				ЗначениеИзДанныхОбъекта = ТекущийОбъект.ДоговорКонтрагента;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.НаправлениеДеятельности Тогда
		ЕстьНаправлениеДеятельности = ОбщегоНазначения.ЕстьРеквизитОбъекта("НаправлениеДеятельности", ТекущийОбъект.Метаданные());
		Если ЕстьНаправлениеДеятельности Тогда
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ТекущийОбъект)) Тогда
				ЗначениеИзДанныхОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "НаправлениеДеятельности");
			Иначе	
				ЗначениеИзДанныхОбъекта = ТекущийОбъект.НаправлениеДеятельности;
			КонецЕсли;
		КонецЕсли;
	// -- ERP
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеИзДанныхОбъекта) Тогда
		ЗначениеАналитики = ЗначениеИзДанныхОбъекта;
	Иначе	
		ЗначениеАналитики = ЗначенияПоУмолчанию[Аналитика];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеАналитики) Тогда
	    НоваяЗапись.ЗначениеАналитики = ЗначениеАналитики;
	Иначе	
	    НоваяЗапись.ЗначениеАналитики = Аналитика.ТипЗначения.ПривестиЗначение();
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяЗапись, "ЗначениеАналитикиСтарое") Тогда
		НоваяЗапись.ЗначениеАналитикиСтарое = НоваяЗапись.ЗначениеАналитики;		
	КонецЕсли;
	
КонецПроцедуры
 
Функция ЗначениеАналитикиНаправлениеДеятельности(Аналитики, ТекущийОбъект)
	
	НаправлениеДеятельности = Неопределено;
	
	// ++ ЕРП
	Если ЗначениеЗаполнено(Аналитики.НаправлениеДеятельности) Тогда
		Возврат Аналитики.НаправлениеДеятельности;	
	КонецЕсли; 
	
	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("НаправлениеДеятельности");
	ИменаРеквизитов.Добавить("Субконто1");
	ИменаРеквизитов.Добавить("Субконто2");
	ИменаРеквизитов.Добавить("Субконто3");
	
	// Оценка возможности применимости имен.
	Индекс = ИменаРеквизитов.ВГраница();
	Пока Индекс >= 0 Цикл
		Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта(ИменаРеквизитов.Получить(Индекс), МетаданныеОбъекта) Тогда
			ИменаРеквизитов.Удалить(Индекс);
		КонецЕсли; 
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Если ИменаРеквизитов.Количество() = 0 Тогда
		Возврат Неопределено;	
	КонецЕсли; 
	
	НаправлениеДеятельности = Неопределено;
	
	// ТекущийОбъект может быть ссылкой или объектом. От этого зависит способ чтения данных.
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ТекущийОбъект)) Тогда
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект,
								СтрСоединить(ИменаРеквизитов, ","));
	Иначе			
		РеквизитыОбъекта = Новый Структура(СтрСоединить(ИменаРеквизитов, ","));
		ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ТекущийОбъект);
	КонецЕсли; 
	
	ТипНаправлениеДеятельности = Тип("СправочникСсылка.НаправленияДеятельности");
	Для каждого КлючЗначение Из РеквизитыОбъекта Цикл
		Если ЗначениеЗаполнено(КлючЗначение.Значение) 
			И ТипЗнч(КлючЗначение.Значение) = НаправлениеДеятельности Тогда
			НаправлениеДеятельности = КлючЗначение.Значение; 
			Прервать;			
		КонецЕсли; 
	КонецЦикла;
	// -- ЕРП

	Возврат НаправлениеДеятельности;
	
КонецФункции

Функция ЗначениеАналитикиНоменклатурнаяГруппа(Аналитики, ТекущийОбъект)
	
	Если ЗначениеЗаполнено(Аналитики.НоменклатурнаяГруппа) Тогда
		Возврат Аналитики.НоменклатурнаяГруппа;	
	КонецЕсли; 
	
	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("НоменклатурнаяГруппа");
	ИменаРеквизитов.Добавить("Субконто1");
	ИменаРеквизитов.Добавить("Субконто2");
	ИменаРеквизитов.Добавить("Субконто3");
	
	// Оценка возможности применимости имен.
	Индекс = ИменаРеквизитов.ВГраница();
	Пока Индекс >= 0 Цикл
		Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта(ИменаРеквизитов.Получить(Индекс), МетаданныеОбъекта) Тогда
			ИменаРеквизитов.Удалить(Индекс);
		КонецЕсли; 
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Если ИменаРеквизитов.Количество() = 0 Тогда
		Возврат Неопределено;	
	КонецЕсли; 
	
	НоменклатурнаяГруппа = Неопределено;
	
	// ТекущийОбъект может быть ссылкой или объектом. От этого зависит способ чтения данных.
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ТекущийОбъект)) Тогда
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект,
								СтрСоединить(ИменаРеквизитов, ","));
	Иначе			
		РеквизитыОбъекта = Новый Структура(СтрСоединить(ИменаРеквизитов, ","));
		ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ТекущийОбъект);
	КонецЕсли; 
	
	ТипНоменклатурнаяГруппа = Тип(бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ИмяТипаНоменклатурныеГруппы());
	Для каждого КлючЗначение Из РеквизитыОбъекта Цикл
		Если ЗначениеЗаполнено(КлючЗначение.Значение) 
			И ТипЗнч(КлючЗначение.Значение) = ТипНоменклатурнаяГруппа Тогда
			НоменклатурнаяГруппа = КлючЗначение.Значение; 
			Прервать;			
		КонецЕсли; 
	КонецЦикла;
	
	Возврат НоменклатурнаяГруппа;
	
КонецФункции

Функция ЗначениеАналитикиСтатьяОборотов(Аналитики, ТекущийОбъект)
	
	Если ЗначениеЗаполнено(Аналитики.СтатьяОборотов) Тогда
		Возврат Аналитики.СтатьяОборотов;	
	КонецЕсли; 
	
	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	
	ЕстьСтатьяДДС 		   = ОбщегоНазначения.ЕстьРеквизитОбъекта("СтатьяДвиженияДенежныхСредств", МетаданныеОбъекта);
	ЕстьСтатьяДДСВТаблице  = бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("СтатьяДвиженияДенежныхСредств", 
								МетаданныеОбъекта, "РасшифровкаПлатежа");
	
	РеквизитыОбъекта = Новый Массив(); 
	РеквизитыОбъекта.Добавить("Ссылка");
	
	Если ЕстьСтатьяДДС Тогда
		РеквизитыОбъекта.Добавить("СтатьяДвиженияДенежныхСредств");
	КонецЕсли; 
	Если ЕстьСтатьяДДСВТаблице Тогда
		РеквизитыОбъекта.Добавить("РасшифровкаПлатежа");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ТекущийОбъект)) Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект, РеквизитыОбъекта);
	Иначе	
		Реквизиты = Новый Структура(СтрСоединить(РеквизитыОбъекта, ","));
		ЗаполнитьЗначенияСвойств(Реквизиты, ТекущийОбъект);
	КонецЕсли; 
	
	Если ЕстьСтатьяДДСВТаблице Тогда
		Реквизиты.Вставить("РасшифровкаПлатежа", Реквизиты.РасшифровкаПлатежа.Выгрузить());
	КонецЕсли; 

	// Статья оборотов уточняется по реквизитам шапки или ТЧ "Расшифровка платежа", если кол-во строк = 1.
	СтатьяОборотов = Неопределено;
	СтатьяДДС 	   = Неопределено; 
	Если ЕстьСтатьяДДСВТаблице И Реквизиты.РасшифровкаПлатежа.Количество() = 1 Тогда
		СтатьяДДС = Реквизиты.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(СтатьяДДС) И ЕстьСтатьяДДС Тогда
		СтатьяДДС = Реквизиты.СтатьяДвиженияДенежныхСредств;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтатьяДДС) Тогда
		СоответствиеСтатей = бит_Бюджетирование.СвязанныеСтатьиОборотовИСтатьиРегл(СтатьяДДС);
		Если СоответствиеСтатей.Количество() = 1 
				И ТипЗнч(СоответствиеСтатей[0]) = Тип("СправочникСсылка.бит_СтатьиОборотов") Тогда 	
			СтатьяОборотов = СоответствиеСтатей[0];  					 
		КонецЕсли;
	КонецЕсли; 
	
	// По остальным реквизитам через соответствия.
	Если Не ЗначениеЗаполнено(СтатьяОборотов) Тогда
		// Заполним структуру типов с массивами реквизитов.
		СтруктураТипов = Новый Структура;
		Типы = Новый Массив;
		Типы.Добавить("СтатьяДвиженияДенежныхСредств");
		СтруктураТипов.Вставить("СтатьиДвиженияДенежныхСредств", Типы);
		
		Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
			Типы = Новый Массив;
			Типы.Добавить("СтатьяЗатрат");
			СтруктураТипов.Вставить("СтатьиЗатрат", Типы);
		КонецЕсли; 
		
		Для каждого КлючЗначение Из СтруктураТипов Цикл
			Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
				Прервать; // Если значение уже заполнено - не продолжаем поиск.
			Иначе
				ИменаРеквизитов = КлючЗначение.Значение;
				Для каждого ИмяРеквизита Из ИменаРеквизитов Цикл
					ЗаполнитьЗначениеДопАналитикиСтатьиОборотовПоРеквизиту(СтатьяОборотов, ИмяРеквизита, ТекущийОбъект, МетаданныеОбъекта);
				КонецЦикла; 
				
				ТребуемыйТип = Тип("СправочникСсылка." + КлючЗначение.Ключ);			
				ЗаполнитьЗначениеДопАналитикиСтатьиОборотовПоНаборуРеквизитов(СтатьяОборотов, "Субконто", ТекущийОбъект, МетаданныеОбъекта, ТребуемыйТип);    		 		
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
	Возврат СтатьяОборотов;
	
КонецФункции

Функция ЗначениеАналитикиЦФО(Аналитики, ТекущийОбъект)
	
	Если ЗначениеЗаполнено(Аналитики.ЦФО) Тогда
		Возврат Аналитики.ЦФО;
	КонецЕсли; 

	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	
	РеквизитыСтрокой = Новый Массив;
	РеквизитыСтрокой.Добавить("Организация");
	Если Не бит_ОбщегоНазначения.ЭтоУТ() Тогда
		РеквизитыСтрокой.Добавить("ПодразделениеОрганизации");
	КонецЕсли;
	// ++ ЕРП 
	ЕстьСоглашение = ОбщегоНазначения.ЕстьРеквизитОбъекта("Соглашение", МетаданныеОбъекта);
	Если ЕстьСоглашение Тогда
		РеквизитыСтрокой.Добавить("Соглашение");
	КонецЕсли;
	// -- ЕРП 
	
	// Оценка возможности применимости имен.
	Индекс = РеквизитыСтрокой.ВГраница();
	Пока Индекс >= 0 Цикл
		Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта(РеквизитыСтрокой.Получить(Индекс), МетаданныеОбъекта) Тогда
			РеквизитыСтрокой.Удалить(Индекс);
		КонецЕсли; 
		Индекс = Индекс - 1;
	КонецЦикла;
	
	ЕстьДата = ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта);
	Период 	 = ТекущаяДатаСеанса();
	
	// ТекущийОбъект может быть ссылкой или объектом. От этого зависит способ чтения данных.
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ТекущийОбъект)) Тогда
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект, СтрСоединить(РеквизитыСтрокой, ","));
		Если ЕстьДата Тогда
			Период = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект, "Дата");
		КонецЕсли;
	Иначе			
		РеквизитыОбъекта = Новый Структура(СтрСоединить(РеквизитыСтрокой, ","));
		ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ТекущийОбъект);
		Период = ТекущийОбъект.Дата;
	КонецЕсли; 
	
	ЦФО = Неопределено;
	// Обход, полученных данных.
	Для каждого КлючЗначение Из РеквизитыОбъекта Цикл
		Если ЗначениеЗаполнено(КлючЗначение.Значение) 
			И (ТипЗнч(КлючЗначение.Значение) = Тип("СправочникСсылка.Организации")
			ИЛИ Не бит_ОбщегоНазначения.ЭтоУТ() 
				И ТипЗнч(КлючЗначение.Значение) = Тип("СправочникСсылка.ПодразделенияОрганизаций")) Тогда
			
			ЗначенияПодстановки = бит_Бюджетирование.СвязанныеЦФОИПодразделения(КлючЗначение.Значение, Период);		
			Если ЗначенияПодстановки.Количество() <> 0 Тогда
				Если ТипЗнч(ЗначенияПодстановки[0]) = Тип("СправочникСсылка.Подразделения") Тогда				
					ЦФО = ЗначенияПодстановки[0];				
				КонецЕсли; 
			КонецЕсли;	
			Если ЗначениеЗаполнено(ЦФО) Тогда
				Прервать;			
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	// ++ ERP
	Если НЕ ЗначениеЗаполнено(ЦФО) И ЕстьСоглашение Тогда
		ЦФОСоглашения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыОбъекта.Соглашение, "бит_ЦФО");
		Если ЗначениеЗаполнено(ЦФОСоглашения) Тогда
			ЦФО = ЦФОСоглашения;
		КонецЕсли;
	КонецЕсли;
	// -- ERP

	Возврат ЦФО;
	
КонецФункции

Функция ЗначениеАналитикиДоговор(Аналитики, ТекущийОбъект)
	
	Если ЗначениеЗаполнено(Аналитики.ДоговорКонтрагента) Тогда
		Возврат Аналитики.ДоговорКонтрагента;
	КонецЕсли;
	
	ДоговорКонтрагента = Аналитики.ДоговорКонтрагента;
	МетаданныеОбъекта  = ТекущийОбъект.Метаданные();
	ПолеДоговора 	   = "";
	
	РеквизитыСтрокой = Новый Массив(); 
	РеквизитыСтрокой.Добавить("ДоговорКонтрагента");
	РеквизитыСтрокой.Добавить("Договор");
	Индекс = РеквизитыСтрокой.ВГраница();
	Пока Индекс >= 0 Цикл
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта(РеквизитыСтрокой.Получить(Индекс), МетаданныеОбъекта) Тогда
			ПолеДоговора = РеквизитыСтрокой.Получить(Индекс);
		Иначе
			РеквизитыСтрокой.Удалить(Индекс);
		КонецЕсли; 
		Индекс = Индекс - 1;
	КонецЦикла; 
	
	ЕстьРасшифровкаПлатежа  = бит_РаботаСМетаданными.ЕстьТабЧасть("РасшифровкаПлатежа", МетаданныеОбъекта);
	ЕстьДоговорВРасшифровке	= Ложь;
	
	Если ЕстьРасшифровкаПлатежа Тогда
		ЕстьДоговорВРасшифровке = ОбщегоНазначения.ЕстьРеквизитОбъекта("ДоговорКонтрагента", МетаданныеОбъекта.ТабличныеЧасти.РасшифровкаПлатежа);
		Если ЕстьДоговорВРасшифровке Тогда
			РеквизитыСтрокой.Добавить("РасшифровкаПлатежа");
		Иначе
			// Если нет реквизита, таблица нас не интересует.
			ЕстьРасшифровкаПлатежа = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ТекущийОбъект)) Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект, СтрСоединить(РеквизитыСтрокой, ","));
	Иначе	
		Реквизиты = Новый Структура(СтрСоединить(РеквизитыСтрокой, ","));
		ЗаполнитьЗначенияСвойств(Реквизиты, ТекущийОбъект);
	КонецЕсли; 
	
	Если ЕстьРасшифровкаПлатежа Тогда
		Реквизиты.Вставить("РасшифровкаПлатежа", Реквизиты.РасшифровкаПлатежа.Выгрузить());
	КонецЕсли; 
	
	// Договор уточняется по реквизитам шапки или ТЧ "Расшифровка платежа", если кол-во строк = 1.
	ДоговорКандидат = Неопределено;
	Если ЕстьРасшифровкаПлатежа И Реквизиты.РасшифровкаПлатежа.Количество() = 1 Тогда
		ДоговорКандидат = Реквизиты.РасшифровкаПлатежа[0].ДоговорКонтрагента;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ДоговорКандидат) И НЕ ПустаяСтрока(ПолеДоговора) Тогда
		ДоговорКандидат = Реквизиты[ПолеДоговора];
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДоговорКандидат) Тогда
		// ++ ЕРП 
		ДоговорКонтрагента = ДоговорКандидат;
		// -- ЕРП 
	Иначе
		ДоговорКонтрагента = Аналитики.ДоговорКонтрагента;
	КонецЕсли;

	Возврат ДоговорКонтрагента;
	
КонецФункции

Процедура ПодготовитьЗначенияАналитикПоНазначениюПлатежа(Аналитики, ЗначенияПоУмолчанию, ТекущийОбъект)
	
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 

КонецПроцедуры

Процедура ПодготовитьЗначенияАналитикПоДоговору(Аналитики, ТекущийОбъект)

	Если НЕ ЗначениеЗаполнено(Аналитики.ДоговорКонтрагента) Тогда
		Возврат;	
	КонецЕсли; 
	
	Договор = Аналитики.ДоговорКонтрагента;
	
	ИменаРеквизитов = Новый Массив; 
	ИменаРеквизитов.Добавить("бит_ЦФО");
	ИменаРеквизитов.Добавить("бит_Проект");
	ИменаРеквизитов.Добавить("бит_ВысокийПриоритетПриЗаполненииАналитик");
	
	ИмяСвойстваКонтрагент = бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ИмяСвойстваКонтрагентДоговора();
	ЕстьКонтрагент		  = ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяСвойстваКонтрагент, Договор.Метаданные());
	Если ЕстьКонтрагент Тогда
		ИменаРеквизитов.Добавить(ИмяСвойстваКонтрагент);
	КонецЕсли;
		
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Аналитики.ДоговорКонтрагента, СтрСоединить(ИменаРеквизитов, ","));
	
	Аналитики.Вставить("ЦФО",	 		   Реквизиты.бит_ЦФО);
	Аналитики.Вставить("Проект", 		   Реквизиты.бит_Проект);
	Аналитики.Вставить("ВысокийПриоритет", Реквизиты.бит_ВысокийПриоритетПриЗаполненииАналитик);	
	Аналитики.Вставить("СтатьяОборотов",   ОсновнаяСтатьяПоДоговору(ТекущийОбъект, Аналитики.ДоговорКонтрагента));
	
	Если ЕстьКонтрагент Тогда
		Аналитики.Вставить("Контрагент",Реквизиты[ИмяСвойстваКонтрагент]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьЗначенияАналитикПоСоглашению(Аналитики, ТекущийОбъект)
	
	ЕстьРеквизитОбъекта = ОбщегоНазначения.ЕстьРеквизитОбъекта("Соглашение", ТекущийОбъект.Метаданные());
	Если НЕ ЕстьРеквизитОбъекта Тогда
		Возврат;
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Соглашение) Тогда
		Возврат;	
	КонецЕсли;  

	ИменаРеквизитов = Новый Массив; 
	ИменаРеквизитов.Добавить("бит_ЦФО");
	ИменаРеквизитов.Добавить("бит_Проект");
	ИменаРеквизитов.Добавить("бит_ВысокийПриоритетПриЗаполненииАналитик"); 
	ИменаРеквизитов.Добавить("Контрагент");
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект.Соглашение, ИменаРеквизитов);
	
	Аналитики.Вставить("ЦФО",	 		   Реквизиты.бит_ЦФО);
	Аналитики.Вставить("Проект", 		   Реквизиты.бит_Проект);
	Аналитики.Вставить("ВысокийПриоритет", Реквизиты.бит_ВысокийПриоритетПриЗаполненииАналитик);	
	Аналитики.Вставить("СтатьяОборотов",   ОсновнаяСтатьяПоДоговору(ТекущийОбъект, ТекущийОбъект.Соглашение));
	Аналитики.Вставить("Контрагент",	   Реквизиты.Контрагент);
	
КонецПроцедуры

Функция ОсновнаяСтатьяПоДоговору(ДокументОбъект, ДоговорКонтрагента)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОсновнаяСтатья = Неопределено;
	Если ТипЗнч(ДоговорКонтрагента) = Тип("Структура") Тогда
		Договор = ДоговорКонтрагента.Ссылка;
	Иначе	
		Договор = ДоговорКонтрагента;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Возврат ОсновнаяСтатья;
	КонецЕсли; 
	
	// Статья оборотов.
	СтруктураОтбораСтатьи = ОтборДляСтатьиОборотовПоДокументу(ДокументОбъект);
	Если СтруктураОтбораСтатьи.ЗаполнятьСтатью Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&СтатьяОборотов КАК СтатьяОборотов,
		|	0 КАК ПорядокВыборки
		|ПОМЕСТИТЬ СтатьиОборотов
		|ИЗ
		|	#Реквизиты КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатьиОборотовДоговора.СтатьяОборотов,
		|	1
		|ИЗ
		|	#Реквизиты.бит_СтатьиОборотов КАК СтатьиОборотовДоговора
		|ГДЕ
		|	СтатьиОборотовДоговора.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатьиОборотов.СтатьяОборотов КАК СтатьяОборотов
		|ИЗ
		|	СтатьиОборотов КАК СтатьиОборотов
		|ГДЕ
		|	СтатьиОборотов.СтатьяОборотов.ТипСтатьи = &ТипСтатьи
		|	И СтатьиОборотов.СтатьяОборотов.РасходДоход = &РасходДоход
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтатьиОборотов.ПорядокВыборки";
		
		// В различных локализациях БИТ.ФИНАНС имя таблицы меняется.
		// Поэтому используем универсальный текст запроса.
		ЧтоЗаменить = "#Реквизиты";
		НаЧтоЗаменить = Договор.Метаданные().ПолноеИмя();
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
		
		ЧтоЗаменить = "&СтатьяОборотов";
		Если СтруктураОтбораСтатьи.ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.БДР Тогда
			НаЧтоЗаменить = "бит_ОсновнаяСтатьяОборотовБДР";
		Иначе	
			НаЧтоЗаменить = "бит_ОсновнаяСтатьяОборотов";
		КонецЕсли; 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", 	 Договор);
		Запрос.УстановитьПараметр("ТипСтатьи", 	 СтруктураОтбораСтатьи.ТипСтатьи);
		Запрос.УстановитьПараметр("РасходДоход", СтруктураОтбораСтатьи.РасходДоход);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ОсновнаяСтатья = Выборка.СтатьяОборотов;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ОсновнаяСтатья;
	
КонецФункции

Процедура ЗаполнитьДополнительныеАналитикиШапки(ТекущийОбъект, НаборЗаписей)
		
	ЗначенияПоУмолчанию		= ЗначенияАналитикПоУмолчанию(ТекущийОбъект, Истина);
	ДополнительныеАналитики = НазначенныеДополнительныеАналитики(ТекущийОбъект.Метаданные());
	
	Для каждого СтрокаТаблицы Из ДополнительныеАналитики Цикл
		УстановитьЗначениеАналитики(ТекущийОбъект, НаборЗаписей, СтрокаТаблицы.Аналитика, ЗначенияПоУмолчанию);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДополнительныеАналитикиРаспределенияБюджета(НаборЗаписей, ТекущийОбъект)

	ТекПользователь     = Пользователи.ТекущийПользователь();
	ЗначенияПоУмолчанию = ЗначенияАналитикПоУмолчанию(ТекущийОбъект, Ложь);
	
	СоответствиеСтатейПоДоговорам = Новый Соответствие;
	СоответствиеСтатейПоСтатьямРг = Новый Соответствие;
	
	СтрокаСвойствПоДоговору = "бит_ЦФО, бит_Проект";
	
	// Заполним аналитики в табличной части.
	МетаданныеОбъекта  = ТекущийОбъект.Метаданные();
	ЕстьДоговорВТч	   = бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("ДоговорКонтрагента", 
							МетаданныеОбъекта, "РасшифровкаПлатежа");
	РасшифровкаПлатежа = ТекущийОбъект.РасшифровкаПлатежа;
	
	РеквизитыТабЧасти = Новый Структура;
	РеквизитыТабЧасти.Вставить("бит_ЦФО"		   		 , ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО);
	РеквизитыТабЧасти.Вставить("бит_СтатьяОборотов"		 , ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов);
	РеквизитыТабЧасти.Вставить("бит_Проект"			   	 , ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Проект);
	РеквизитыТабЧасти.Вставить("бит_НоменклатурнаяГруппа", ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.НоменклатурнаяГруппа);
	
	// Не заполнять аналитику (заполненную в шапке) в тч, если в тч одна строка(и в шапке заполнена).
	ОднострочныйДокумент = РасшифровкаПлатежа.Количество() = 1;
	МассивНезаполняемых = Новый Массив;
	Если ОднострочныйДокумент Тогда
		// Заполним массив имен аналитик, которые не надо заполнять в тч, так как они уже заполнены в шапке. 				
		Если НаборЗаписей <> Неопределено Тогда 
			Для каждого ТекЗап Из НаборЗаписей Цикл
				Если ЗначениеЗаполнено(ТекЗап.ЗначениеАналитики) Тогда
					МассивНезаполняемых.Добавить(ТекЗап.Аналитика);					
				КонецЕсли;				
			КонецЦикла;
		Иначе
			ЗначенияПоУмолчаниюДляШапки = ЗначенияАналитикПоУмолчанию(ТекущийОбъект, Истина);
			Для каждого КлЗнч Из ЗначенияПоУмолчаниюДляШапки Цикл
				Если ЗначениеЗаполнено(КлЗнч.Значение) Тогда
					МассивНезаполняемых.Добавить(КлЗнч.Ключ);					
				КонецЕсли;				
			КонецЦикла; 	
		КонецЕсли; 			
	КонецЕсли;
	
	Для каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
		
		// Очистка аналитик табличной части значениями по умолчанию.
		Для каждого КлючИЗначение Из РеквизитыТабЧасти Цикл
			ИмяРеквизита = КлючИЗначение.Ключ;
			СтрокаРасшифровки[ИмяРеквизита] = КлючИЗначение.Значение.ТипЗначения.ПривестиЗначение(Неопределено);
		КонецЦикла;
		
		// Заполнение аналитик табличной части по договору, если у него высокий приоритет.
		Если ЕстьДоговорВТч Тогда
			ТекущийДоговор = СтрокаРасшифровки.ДоговорКонтрагента;
			Если ТекущийДоговор.бит_ВысокийПриоритетПриЗаполненииАналитик 
				Или Не ЗначениеЗаполнено(СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств) Тогда
				
				Если ТекущийДоговор.бит_ВысокийПриоритетПриЗаполненииАналитик Тогда
					// ЦФО, проект
					Если Не ОднострочныйДокумент ИЛИ МассивНезаполняемых.Найти(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО) = Неопределено Тогда
						СтрокаРасшифровки.бит_ЦФО = ТекущийДоговор.бит_ЦФО;
					КонецЕсли;
					Если Не ОднострочныйДокумент ИЛИ МассивНезаполняемых.Найти(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Проект) = Неопределено Тогда
						СтрокаРасшифровки.бит_Проект = ТекущийДоговор.бит_Проект;
					КонецЕсли;
				КонецЕсли;
				
				// Статья оборотов
				Если Не ОднострочныйДокумент ИЛИ МассивНезаполняемых.Найти(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов) = Неопределено Тогда
					СтатьяОборотовПоДог = СоответствиеСтатейПоДоговорам.Получить(СтрокаРасшифровки.ДоговорКонтрагента);
					Если СтатьяОборотовПоДог = Неопределено Тогда
						ОсновнаяСтатья = ПолучитьСтатьюПоДоговору(ТекущийОбъект, ТекущийДоговор);
						Если ОсновнаяСтатья <> Неопределено Тогда
							СтрокаРасшифровки.бит_СтатьяОборотов = ОсновнаяСтатья;
							СоответствиеСтатейПоДоговорам.Вставить(СтрокаРасшифровки.ДоговорКонтрагента, ОсновнаяСтатья);
						КонецЕсли;
					Иначе
						СтрокаРасшифровки.бит_СтатьяОборотов = СтатьяОборотовПоДог;	
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		// Заполнение статью оборотов по соответсвию.
		Если Не ОднострочныйДокумент ИЛИ МассивНезаполняемых.Найти(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов) = Неопределено Тогда
			Если Не ЗначениеЗаполнено(СтрокаРасшифровки.бит_СтатьяОборотов) Тогда
				СтатьяОборотовПоСоотв = СоответствиеСтатейПоСтатьямРг.Получить(СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств);
				Если СтатьяОборотовПоСоотв = Неопределено Тогда
					РезМассив = бит_Бюджетирование.СвязанныеСтатьиОборотовИСтатьиРегл(СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств);
					Если РезМассив.Количество() = 1 Тогда 	 							
						Если ТипЗнч(РезМассив[0]) = Тип("СправочникСсылка.бит_СтатьиОборотов") Тогда 					 
							СтрокаРасшифровки.бит_СтатьяОборотов = РезМассив[0];
							СоответствиеСтатейПоСтатьямРг.Вставить(СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств, СтрокаРасшифровки.бит_СтатьяОборотов);
						КонецЕсли; // Значение типа СтатьяОборотов. 							  
					КонецЕсли;
				Иначе
					СтрокаРасшифровки.бит_СтатьяОборотов = СтатьяОборотовПоСоотв;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Заполнение аналитик табличной части значениями по умолчанию.
		Для каждого КлючИЗначение Из РеквизитыТабЧасти Цикл
			ИмяРеквизита = КлючИЗначение.Ключ;
			ТекАналитика = КлючИЗначение.Значение;
			// Не заполнять в ТЧ аналитики, заполненные в шапке, если в тч одна строка.
			Если ОднострочныйДокумент И МассивНезаполняемых.Найти(ТекАналитика) <> Неопределено Тогда
				Продолжить;						
			КонецЕсли;
			ЗначениеАналитики = ЗначенияПоУмолчанию[КлючИЗначение.Значение];
			Если ЗначениеЗаполнено(ЗначениеАналитики) И Не ЗначениеЗаполнено(СтрокаРасшифровки[ИмяРеквизита]) Тогда
				СтрокаРасшифровки[ИмяРеквизита] = ЗначениеАналитики;													
			КонецЕсли;
		КонецЦикла; 				
		
		// Заполнение аналитик табличной части по договору, если у него низкий приоритет.
		Если ЕстьДоговорВТч И Не ТекущийДоговор.бит_ВысокийПриоритетПриЗаполненииАналитик Тогда					
			// ЦФО.
			Если Не ОднострочныйДокумент ИЛИ МассивНезаполняемых.Найти(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО) = Неопределено Тогда
				Если Не ЗначениеЗаполнено(СтрокаРасшифровки.бит_ЦФО) Тогда
					СтрокаРасшифровки.бит_ЦФО = ТекущийДоговор.бит_ЦФО;
				КонецЕсли;
			КонецЕсли;
			// Статья оборотов.
			Если Не ОднострочныйДокумент ИЛИ МассивНезаполняемых.Найти(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов) = Неопределено Тогда
				Если Не ЗначениеЗаполнено(СтрокаРасшифровки.бит_СтатьяОборотов) Тогда
					ОсновнаяСтатья = ПолучитьСтатьюПоДоговору(ТекущийОбъект, ТекущийДоговор);
					Если ОсновнаяСтатья <> Неопределено Тогда
						СтрокаРасшифровки.бит_СтатьяОборотов = ОсновнаяСтатья;					
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			// Проект.
			Если Не ОднострочныйДокумент ИЛИ МассивНезаполняемых.Найти(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Проект) = Неопределено Тогда
				Если ЗначениеЗаполнено(ТекущийДоговор.бит_Проект) Тогда
					СтрокаРасшифровки.бит_Проект = ТекущийДоговор.бит_Проект;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Из настроек пользователя.
		Если Не ОднострочныйДокумент ИЛИ МассивНезаполняемых.Найти(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО) = Неопределено Тогда
			ЗаполнитьЗначениеДопАналитикиИзНастройкиПользователя(СтрокаРасшифровки.бит_ЦФО, "ОсновнойЦФО", ТекПользователь);
		КонецЕсли;
		Если Не ОднострочныйДокумент ИЛИ МассивНезаполняемых.Найти(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Проект) = Неопределено Тогда
			ЗаполнитьЗначениеДопАналитикиИзНастройкиПользователя(СтрокаРасшифровки.бит_Проект, "ОсновнойПроект", ТекПользователь);
		КонецЕсли;
		Если Не ОднострочныйДокумент ИЛИ МассивНезаполняемых.Найти(ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.НоменклатурнаяГруппа) = Неопределено Тогда
			ЗаполнитьЗначениеДопАналитикиИзНастройкиПользователя(СтрокаРасшифровки.бит_НоменклатурнаяГруппа, "ОсновнаяНоменклатурнаяГруппа", ТекПользователь);
		КонецЕсли;
	КонецЦикла;  			

КонецПроцедуры

// Процедура заполняет значение дополнительной аналитики по реквизиту объекта.
// 
// Параметры:
//  ДопАн_СтатьяОборотов  - Неопределено или СправочникСсылка.бит_СтатьиОборотов.
//  ИмяРеквизита  		  - Строка.
//  ТекущийОбъект         - ДокументОбъект.
//  МетаданныеОбъекта     - Коллекция метаданных объекта.
//  ТребуемыйТип 		  - Строка.
// 
Процедура ЗаполнитьЗначениеДопАналитикиСтатьиОборотовПоРеквизиту(ДопАн_СтатьяОборотов, ИмяРеквизита, ТекущийОбъект, МетаданныеОбъекта, ТребуемыйТип = Неопределено)

	Если Не ЗначениеЗаполнено(ДопАн_СтатьяОборотов) И бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, МетаданныеОбъекта) Тогда
		
		Если ТребуемыйТип = Неопределено 
			ИЛИ ТипЗнч(ТекущийОбъект[ИмяРеквизита]) = ТребуемыйТип Тогда
			
			ЗначениеИсточник = ТекущийОбъект[ИмяРеквизита];
		
			Если бит_ОбщегоНазначенияКлиентСервер.ЭтоУказанныйТип(ТипЗнч(ЗначениеИсточник), бит_ОбщегоНазначения.ПолучитьИмяТипаНоменклатурныеГруппы()) Тогда
				РезМассив = бит_Бюджетирование.СвязанныеСтатьиОборотовИНоменклатурныеГруппы(ЗначениеИсточник);
			Иначе	
				РезМассив = бит_Бюджетирование.СвязанныеСтатьиОборотовИСтатьиРегл(ЗначениеИсточник);
			КонецЕсли;
		
			Если РезМассив.Количество() <> 0 Тогда  			
				Если ТипЗнч(РезМассив[0]) = Тип("СправочникСсылка.бит_СтатьиОборотов") Тогда				
					ДопАн_СтатьяОборотов = РезМассив[0];				
				КонецЕсли;  			
			КонецЕсли;			
		КонецЕсли;    		 
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет значение дополнительной аналитики по набору реквизитов объекта
// типа: Субконто1, Субконто2, Субконто3 (ПрефиксРеквизитов = "Субконто").
// 
// Параметры:
//  ДопАн_СтатьяОборотов  - Неопределено или СправочникСсылка.бит_СтатьиОборотов.
//  ПрефиксРеквизитов	  - Строка.
//  ТекущийОбъект         - ДокументОбъект.
//  МетаданныеОбъекта     - Коллекция метаданных объекта.
//  ТребуемыйТип 		  - Строка.
// 
Процедура ЗаполнитьЗначениеДопАналитикиСтатьиОборотовПоНаборуРеквизитов(ДопАн_СтатьяОборотов, ПрефиксРеквизитов, ТекущийОбъект, МетаданныеОбъекта, ТребуемыйТип)

	Если Не ЗначениеЗаполнено(ДопАн_СтатьяОборотов) Тогда
		Для Сч = 1 По 3 Цикл
			ИмяРеквизита = ПрефиксРеквизитов + Сч;
			ЗаполнитьЗначениеДопАналитикиСтатьиОборотовПоРеквизиту(ДопАн_СтатьяОборотов, ИмяРеквизита, ТекущийОбъект, МетаданныеОбъекта, ТребуемыйТип);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет значение дополнительной аналитики по значению пользователя.
// 
// Параметры:
//  ЗначениеДопАн   - Произвольное значение.
//  ИмяНастройки    - Строка.
//  ТекПользователь - СправочникСсылка.Пользователи.
// 
Процедура ЗаполнитьЗначениеДопАналитикиИзНастройкиПользователя(ЗначениеДопАн, ИмяНастройки, ТекПользователь)

	Если Не ЗначениеЗаполнено(ЗначениеДопАн) Тогда
		ТекЗначение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(ИмяНастройки, ТекПользователь);
		Если ЗначениеЗаполнено(ТекЗначение) Тогда
			ЗначениеДопАн = ТекЗначение;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры
              
// Функция заполняет структуру поиска статьи оборотов.
// 
// Параметры:
//  ТекущийОбъект  - ДокументОбъект, ДокументСсылка.
//  
// Возвращаемое значение:
//   Структура("ЗаполнятьСтатью, ТипСтатьи, РасходДоход").
// 
Функция ОтборДляСтатьиОборотовПоДокументу(ТекущийОбъект)

	// ++ ЕРП 
	БДРРасходование = Новый Массив;
	БДРРасходование.Добавить(Метаданные.Документы.ЗаказПоставщику); 
	БДРРасходование.Добавить(Метаданные.Документы.ПриобретениеТоваровУслуг);
	БДРРасходование.Добавить(Метаданные.Документы.ПриобретениеУслугПрочихАктивов);

	БДРПоступление = Новый Массив; 
	БДРПоступление.Добавить(Метаданные.Документы.ЗаказКлиента);
	БДРПоступление.Добавить(Метаданные.Документы.РеализацияТоваровУслуг);
	БДРПоступление.Добавить(Метаданные.Документы.РеализацияУслугПрочихАктивов);
	БДРПоступление.Добавить(Метаданные.Документы.АктВыполненныхРабот);
	
	БДДСРасходование = Новый Массив; 
	
	БДДСПоступление = Новый Массив; 
	БДДСПоступление.Добавить(Метаданные.Документы.СчетНаОплатуКлиенту);
	// -- ЕРП 
		
	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	
	Если БДРРасходование.Найти(МетаданныеОбъекта) <> Неопределено Тогда
		ТипСтатьи      	= Перечисления.бит_ТипыСтатейОборотов.БДР;
		РасходДоход    	= Перечисления.бит_РасходДоход.Расходование;
		ТипСтатьиСтр   	= "БДР";
		РасходДоходСтр 	= "Расходование"; 
		ЗаполнятьСтатью = Истина;
	ИначеЕсли БДРПоступление.Найти(МетаданныеОбъекта) <> Неопределено Тогда
		ТипСтатьи      	= Перечисления.бит_ТипыСтатейОборотов.БДР;
		РасходДоход    	= Перечисления.бит_РасходДоход.Поступление;
		ТипСтатьиСтр   	= "БДР";
		РасходДоходСтр 	= "Поступление";  
		ЗаполнятьСтатью = Истина;
	ИначеЕсли БДДСРасходование.Найти(МетаданныеОбъекта) <> Неопределено Тогда
		ТипСтатьи      	= Перечисления.бит_ТипыСтатейОборотов.БДДС;
		РасходДоход    	= Перечисления.бит_РасходДоход.Расходование;
		ТипСтатьиСтр   	= "БДДС";
		РасходДоходСтр 	= "Расходование"; 
		ЗаполнятьСтатью = Истина;	
	ИначеЕсли БДДСПоступление.Найти(МетаданныеОбъекта) <> Неопределено Тогда
		ТипСтатьи      	= Перечисления.бит_ТипыСтатейОборотов.БДДС;
		РасходДоход    	= Перечисления.бит_РасходДоход.Поступление;
		ТипСтатьиСтр   	= "БДДС";
		РасходДоходСтр 	= "Поступление"; 
		ЗаполнятьСтатью = Истина;
	Иначе
		ТипСтатьи      	= Перечисления.бит_ТипыСтатейОборотов.БДДС;
		РасходДоход    	= Перечисления.бит_РасходДоход.Расходование;
		ТипСтатьиСтр   	= "";
		РасходДоходСтр 	= "";
		ЗаполнятьСтатью = Ложь;
	КонецЕсли;
	
	НастройкиОтбора = Новый Структура;
	НастройкиОтбора.Вставить("ЗаполнятьСтатью",	ЗаполнятьСтатью);
	НастройкиОтбора.Вставить("ТипСтатьи",    	ТипСтатьи); 	
	НастройкиОтбора.Вставить("РасходДоход",    	РасходДоход);
	НастройкиОтбора.Вставить("ТипСтатьиСтр", 	ТипСтатьиСтр); 	
	НастройкиОтбора.Вставить("РасходДоходСтр", 	РасходДоходСтр);

	Возврат НастройкиОтбора;
	
КонецФункции

Процедура УстановитьЗапретитьПерезаполнениеАналитикНовому(Источник)

	ЭтоНовый = Ложь;
	Если НЕ Источник.ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый) Тогда
		Возврат;	
	КонецЕсли; 
	
	Если НЕ ЭтоНовый Тогда
		Возврат;
	КонецЕсли; 
	
	РежимЗаполнения     = Константы.бит_РежимАвтоЗаполненияАналитик.Получить();
	ПеречисленияРежимов = Перечисления.бит_РежимыАвтоЗаполненияАналитик;
	// ++ ЕРП 
	Если РежимЗаполнения = ПеречисленияРежимов.НеЗаполнять Тогда
		Возврат;
	КонецЕсли; 	
	// -- ЕРП 	
	НаборЗаписей = РегистрыСведений.бит_ДополнительныеПараметрыОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Объект = Источник.Ссылка;
	Запись.ЗапретитьПерезаполнениеАналитик = Истина;
	
	НаборЗаписей.Записать();

КонецПроцедуры

// Функция получает результат запроса на данные из регистра бит_ДополнительныеПараметрыОбъектов.
// 
// Параметры:
//  СсылкаНаОбъект  - Любая ссылка.
//  
// Возвращаемое значение:
//   Результат выполнения запроса.
// 
Функция ПолучитьРезультатЗапросаНаДополнительныеПараметрыОбъекта(СсылкаНаОбъект)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	бит_ДополнительныеПараметрыОбъектов.Объект,
	|	бит_ДополнительныеПараметрыОбъектов.ЗапретитьПерезаполнениеАналитик
	|ИЗ
	|	РегистрСведений.бит_ДополнительныеПараметрыОбъектов КАК бит_ДополнительныеПараметрыОбъектов
	|ГДЕ
	|	бит_ДополнительныеПараметрыОбъектов.Объект = &СсылкаНаОбъект
	|";
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;
	
КонецФункции

// Функция получает значение дополнительного параметра объекта.
// 
// Параметры:
//  СсылкаНаОбъект - Любая ссылка.
//  ИмяПараметра   - Строка.
//  
// Возвращаемое значение:
//   Тип.Вид   - описание.
// 
Функция ПолучитьЗначениеДополнительногоПараметраОбъектаПоРезультатуЗапроса(РезультатЗапроса, ИмяПараметра, МетаПараметра)
	
	Если РезультатЗапроса.Пустой() Тогда
		ЗначениеПараметра = Неопределено;
		ЗначениеПараметра = МетаПараметра.Тип.ПривестиЗначение(ЗначениеПараметра);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗначениеПараметра = Выборка[ИмяПараметра];
	КонецЕсли;

	Возврат ЗначениеПараметра;
	
КонецФункции

Функция НовыеПараметрыПоискаПолейОчисткиНеиспользуемыхРеквизитов()

	// Ключ - это реквизит статьи, значение - это ключ структуры, описывающей поля объекта.
	
	ПоляОбъекта = Новый Структура; 
	ПоляОбъекта.Вставить("Учет_Аналитика_1","Аналитика_1");
	ПоляОбъекта.Вставить("Учет_Аналитика_2","Аналитика_2");
	ПоляОбъекта.Вставить("Учет_Аналитика_3","Аналитика_3");
	ПоляОбъекта.Вставить("Учет_Аналитика_4","Аналитика_4");
	ПоляОбъекта.Вставить("Учет_Аналитика_5","Аналитика_5");
	ПоляОбъекта.Вставить("Учет_Аналитика_6","Аналитика_6");
	ПоляОбъекта.Вставить("Учет_Аналитика_7","Аналитика_7");
	// ++ ЕРП 	
	ПоляОбъекта.Вставить("Учет_Аналитика_8","Аналитика_8");
	ПоляОбъекта.Вставить("Учет_Аналитика_9","Аналитика_9");
	ПоляОбъекта.Вставить("Учет_Аналитика_10","Аналитика_10");
	ПоляОбъекта.Вставить("Учет_Аналитика_11","Аналитика_11");
	ПоляОбъекта.Вставить("Учет_Аналитика_12","Аналитика_12");
	// -- ЕРП 

	Возврат ПоляОбъекта;

КонецФункции

#КонецОбласти