
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоэффициентКоличество = Параметры.КоэффициентКоличество;
	КоэффициентСумма 	  = Параметры.КоэффициентСумма;
	
	ФорматКоэффициентаСуммы = Документы.бит_УстановкаЗависимыхОборотов.ФорматКоэффициентаСуммы(Параметры.ТочностьКоэффициентаСуммы, Истина);
	Элементы.КоэффициентСумма.Формат = ФорматКоэффициентаСуммы;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КоэффициентКоличество"	, КоэффициентКоличество);
	ПараметрыФормы.Вставить("КоэффициентСумма"		, КоэффициентСумма);
	Закрыть(ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
