
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность =
			ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
		
		Если Элементы.Найти("ФормаОбщаяКомандаИнтеграцияС1СДокументооборотСоздатьБизнесПроцесс") <> Неопределено Тогда
			Элементы.Переместить(
				Элементы.ФормаОбщаяКомандаИнтеграцияС1СДокументооборотСоздатьБизнесПроцесс,
				Элементы.ФормаГруппаСоздатьНаОсновании);
		КонецЕсли;
		Если Элементы.Найти("ФормаОбщаяКомандаИнтеграцияС1СДокументооборотСоздатьПисьмо") <> Неопределено Тогда
			Элементы.Переместить(
				Элементы.ФормаОбщаяКомандаИнтеграцияС1СДокументооборотСоздатьПисьмо,
				Элементы.ФормаГруппаСоздатьНаОсновании);
		КонецЕсли;
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	ВзаиморасчетыСервер.ФормаПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
		
	АдресДанныхДляКорректировки = ПоместитьВоВременноеХранилище(
										Неопределено, Новый УникальныйИдентификатор());
			
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
		
	Если Параметры.Ключ.Пустая() Тогда	
		ПозицияИсточник = Неопределено;
		Если  ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")  Тогда
		    ПозицияИсточник = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.ЗначенияЗаполнения, "Позиция", Неопределено);
		КонецЕсли; 
		
		МожноИзменятьПеречислениеВБюджет = Истина;
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			МожноИзменятьПеречислениеВБюджет = Ложь;
		ИначеЕсли ЗначениеЗаполнено(ПозицияИсточник) Тогда	
			МожноИзменятьПеречислениеВБюджет = Ложь;
		КонецЕсли;                                  
		
		ЗаполнитьПоказателиПлатежаВБюджетПоУмолчаниюСервер(МожноИзменятьПеречислениеВБюджет);
		КодВидаДоходаПоУмолчанию();
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	ОтображатьБюджетПриОткрытии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователя",
																					"ОтображатьБюджетПриОткрытии",
																					Ложь);
	Если ОтображатьБюджетПриОткрытии Тогда
		ОтображатьБюджет = Истина;
	КонецЕсли;
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущаяДата = Объект.Дата;
		ПрименениеПриказа107н = Объект.Дата >= ДатаНачалаПримененияПриказа107н;
		
		Если ПериодАвансовогоОтчета = НСтр("ru = 'Через неделю';
											|en = 'In a week'") Тогда
			Объект.ДатаАвансовогоОтчета = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()) + 7 * 24 * 3600;
		КонецЕсли;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойств
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.РанееСовершенныеПлатежи" Тогда
		
		Если Объект.БанковскийСчет <> ВыбранноеЗначение.БанковскийСчет Тогда
			Объект.БанковскийСчет = ВыбранноеЗначение.БанковскийСчет;
			БанковскийСчетОбработкаВыбора(Элементы.БанковскийСчет, ВыбранноеЗначение.БанковскийСчет, Истина);
		КонецЕсли;
		
		ЗаполнитьПоРанееСовершенномуПлатежу(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ВедомостиНаВыплатуЗарплаты" Тогда
		
		Модифицированность = Истина;
		Объект.Ведомость	  = ВыбранноеЗначение.Ведомость;	
		Объект.СуммаДокумента = ВыбранноеЗначение.Сумма;
		
		Если ХозОперацияУП = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета") 
		 Или ХозОперацияУП = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту")  Тогда
			Объект.КодВидаДохода = ВыбранноеЗначение.КодВидаДохода;
		КонецЕсли;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.СписаниеБезналичныхДенежныхСредств.Форма.РеквизитыПлательщика" Тогда
		
		Модифицированность = Истина;
		ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		УстановитьНадписьРеквизитыПлательщика();
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатус" Тогда
		Если НЕ ЗначениеЗаполнено(Источник)
			ИЛИ Источник = УникальныйИдентификатор Тогда
			ОбработкаОповещенияИзмененияСтатуса();
		КонецЕсли;
		
		ОбработкаОповещенияИзмененияСтатуса();
		
	ИначеЕсли ИмяСобытия = "Запись_Файл"
		И Параметр.Свойство("ВладелецФайла")
		И Параметр.ВладелецФайла = ВыбранныйВладелецФайла
		И Параметр.ЭтоНовый
		И ДобавляетсяФайлПодтверждающегоДокумента Тогда
		
		Элементы.ПодтверждающиеДокументы.ТекущиеДанные.Файл = Источник[0];
		ДобавляетсяФайлПодтверждающегоДокумента = Ложь;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ВзаиморасчетыСервер.ФормаПриЧтенииНаСервере(ЭтотОбъект);
	
	ПодготовитьФормуНаСервере();
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	#Если НЕ ВебКлиент Тогда
		
		// Надо отследить момент окончания проведения или отказа от него
		// в веб-клиенте функциональность отключена, т.к. приводит к возникновению исключения.
		ПодключитьОбработчикОжидания("ОжиданиеПроведенияДокумента", 0.1, Истина);
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность =
			ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект,
																						ТекущийОбъект,
																						ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ЭтоРежимЗаявки
			И ТекущийОбъект.ДокументПланирования.Проведен = Ложь Тогда	
		ТекстСообщения = НСтр("ru='В режиме списка платежную позицию разрешено проводить только после проведения заявки.';
							  |en='In list mode payment position is allowed only after the application.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);				
	ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И НЕ ЭтоРежимЗаявки
			И ТекущийОбъект.ДокументПланирования.Проведен = Истина Тогда			
		ТекстСообщения = НСтр("ru='В режиме списка запрещено отменять проведение платежной позиции.';
							  |en='In list mode it is prohibited to cancel the holding of payment position.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);		
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Получим адрес, где будет храниться массив строк по которым прошло превышение бюджета.
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("АдресДанныхДляКорректировки",
			АдресДанныхДляКорректировки);
		
	КонецЕсли;
	
	//++ НЕ УТ
	НастройкаСчетовУчетаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	//-- НЕ УТ
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//++ НЕ УТ
	НастройкаСчетовУчетаСервер.ПослеЗаписиНаСервере(ЭтотОбъект);
	//-- НЕ УТ
	
	УстановитьЗаголовокФормыДокумента();
	
	ВзаиморасчетыСервер.ФормаПослеЗаписиНаСервере(ЭтотОбъект);
	
	ПодготовитьФормуНаСервере();
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой();

КонецПроцедуры
  
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОповеститьОбИзменении(Объект.ДокументПланирования);
	Оповестить("ВыполненаЗаписьДокумента", Новый Структура("ДокументСсылка", Объект.ДокументПланирования));	
	
	ПараметрПередачи = Новый Структура();
	ПараметрПередачи.Вставить("Ссылка"				, Объект.Ссылка);
	ПараметрПередачи.Вставить("ДокументПланирования", Объект.ДокументПланирования);
	ПараметрПередачи.Вставить("Сумма"			 	, Объект.СуммаДокумента);
	ПараметрПередачи.Вставить("Важность"			, Объект.Важность);
		
	Оповестить("бит_ИзменениеДокументаПлатежнаяПозиция", ПараметрПередачи, ВладелецФормы);
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование)
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда	
		Оповестить("бит_ИзмененСтатус");	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбъектРасчетов

&НаКлиенте
Процедура ОбъектРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбъектРасчетов = ПредопределенноеЗначение("Справочник.ОбъектыРасчетов.ПустаяСсылка");
	
	ВзаиморасчетыКлиент.ОбъектРасчетовНачалоВыбора(ЭтотОбъект, Элемент, СтандартнаяОбработка,, Объект.ОбъектРасчетов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ОбъектРасчетовОбработкаВыбораНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбъектРасчетовПриИзменении(Элемент)
	
	ОбъектРасчетовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ВзаиморасчетыКлиент.ОбъектРасчетовОснованиеПлатежаАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетовОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ВзаиморасчетыКлиент.ОбъектРасчетовОснованиеПлатежаАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, Ложь, Истина);

КонецПроцедуры

#КонецОбласти

#Область Договор

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация", Объект.Организация);
	СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
	
	Если ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
		СтруктураОтбора.Вставить("ВалютаВзаиморасчетов", Объект.ВалютаВзаиморасчетов);
	КонецЕсли;
	
	СтруктураПараметровВыбора = Новый Структура;
	СтруктураПараметровВыбора.Вставить("РежимВыбора", Истина);
	СтруктураПараметровВыбора.Вставить("РазрешитьВыборФилиальныхДоговоров", Истина);
	СтруктураПараметровВыбора.Вставить("ДоступныеПорядкиРасчетов", ДоступныеПорядкиРасчетов());
	
	Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию") 
		ИЛИ Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию") Тогда
		
		Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию") Тогда
			СтруктураОтбора.Организация = ОрганизацияПолучатель;
			СтруктураОтбора.Вставить("ОрганизацияПолучатель", Объект.Организация);
		Иначе
			СтруктураОтбора.Вставить("ОрганизацияПолучатель", ОрганизацияПолучатель);
		КонецЕсли;
		
		СтруктураПараметровВыбора.Вставить("Отбор",СтруктураОтбора);
		ОткрытьФорму("Справочник.ДоговорыМеждуОрганизациями.Форма.ФормаВыбора",
			СтруктураПараметровВыбора,
			Элемент,
			Элемент,)
	Иначе
		СтруктураОтбора.Вставить("Контрагент", Объект.Контрагент);
		
		Если ФинансыКлиент.ЭтоРасчетыСКлиентами(ХозОперацияУП) Тогда
			СтруктураПараметровВыбора.Вставить("ТипыДоговоров", ВзаиморасчетыКлиентСервер.ТипыДоговоровСКлиентом());
		Иначе
			СтруктураПараметровВыбора.Вставить("ТипыДоговоров", ВзаиморасчетыКлиентСервер.ТипыДоговоровСПоставщиком());
		КонецЕсли;
		
		СтруктураПараметровВыбора.Вставить("Отбор",СтруктураОтбора);
			ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора",
			СтруктураПараметровВыбора,
			Элемент,
			Элемент,)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Отбор.Вставить("ПорядокРасчетов", ДоступныеПорядкиРасчетов());
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Отбор.Вставить("ПорядокРасчетов", ДоступныеПорядкиРасчетов());
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольБюджетаИВзаиморасчетов

&НаКлиенте
Процедура ДекорацияОтобразитьБюджетКартинкаНажатие(Элемент)
	
	ОтображатьБюджет = НЕ ОтображатьБюджет;
	УправлениеФормой();
	ОтобразитьБюжет();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтобразитьБюджетНажатие(Элемент)
	
	ОтображатьБюджет = НЕ ОтображатьБюджет;
	УправлениеФормой();
	ОтобразитьБюжет();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтображатьБюджетПриОткрытииНажатие(Элемент)
	
	УстановитьОтображениеБюджетаПриОткрытии(ЭтотОбъект, НЕ ОтображатьБюджетПриОткрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОшибкаРасчетаБюджетаНажатие(Элемент)
	
	Если ПустаяСтрока(ИдентификаторОшибкиРасшифровкиБюджета) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторОшибкиРасшифровкиБюджета = "НеУказанаСтатьяОборотов" Тогда
		Возврат;
	ИначеЕсли ИдентификаторОшибкиРасшифровкиБюджета = "НеКонтролировать_Заявки" Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Объект.СтатьяОборотов);
		ПараметрыФормы.Вставить("АктивныйЭлементПоУмолчанию", "НеКонтролировать_Заявки");
		ОткрытьФорму("Справочник.бит_СтатьиОборотов.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБюджетСуммаБюджетаПоСтатьеНажатие(Элемент)
	
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаБюджетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСуммаБюджетаБезЗаявкиНажатие(Элемент)
	
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетОстатокБюджетаПоСтатьеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетСуммаИсполненныхЗаявокНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетСуммаСверхЛимитаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	Открытьформу("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаКлиенте
Процедура СверхБюджетаПриИзменении(Элемент)
	
	Если НЕ Объект.СверхБюджета Тогда
		Объект.СписатьЛимиты = Ложь;	
	КонецЕсли;
	УстановитьВидимостьКнопкиОплатитьЗаСчет();

	УправлениеФормой();
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура СписатьЛимитыПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	
	ФормаОплатыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ХозяйственнаяОперация) Тогда
		Объект.ХозяйственнаяОперация = КонтролируемыеРеквизиты.ХозяйственнаяОперация;
	КонецЕсли; 
	
	Если Объект.ХозяйственнаяОперация <> КонтролируемыеРеквизиты.ХозяйственнаяОперация Тогда
		ХозяйственнаяОперацияПриИзмененииНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	Если Объект.ВалютаВзаиморасчетов <> Объект.ВалютаДокумента Тогда
		Объект.СуммаВзаиморасчетов = 0;
	Иначе
		Объект.СуммаВзаиморасчетов = Объект.СуммаДокумента;
	КонецЕсли;
	
	ОбработатьИзмененииСуммыДокумента();
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	Если НЕ ОперацияБезНДС Тогда
		РассчитатьСуммуНДС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
		
	ОбновитьКонтролируемыеРеквизиты("Организация", ЭтотОбъект);
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	
	ЦФОПриИзмененииНаСервере();
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_ДокументОплатыНажатие(Элемент)

	ДокументыОплаты = НайтиДокументыОплаты();

    Для Каждого Документ Из ДокументыОплаты Цикл
		Если Строка(Документ) = Элемент.Заголовок Тогда
			ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Документ));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяОборотовПриИзменении(Элемент)
	
	СтатьяОборотовПриИзмененииНаСервере();
	ОтобразитьБюджетСПаузой();
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаРасходаПриИзменении(Элемент)
		
	ОбработатьИзменениеПериодаРассчетов();
	УправлениеФормой();	

КонецПроцедуры

&НаКлиенте
Процедура ДатаПлатежаКрайняяПриИзменении(Элемент)
	
	ОбработатьИзменениеПериодаРассчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если КонтролируемыеРеквизиты.ВалютаДокумента = Объект.ВалютаДокумента Тогда
		Возврат;	
	КонецЕсли;

	ОбработатьИзмененииВалюты();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаВзаиморасчетовПриИзменении(Элемент)
	
	ОбработатьИзменениеВалютыВзаиморасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УстановитьПараметрыВыбораОрганизацияКонтрагент(Элемент.Имя);
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект,
			Элемент, Объект, Элемент.Имя, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
																   
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
    
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект,
			Элемент, Объект, Элемент.Имя, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
			
	ТипДоговора = ТипЗнч(Объект[Элемент.Имя]); 
	Если ЗначениеЗаполнено(Текст) 
		И (ТипДоговора = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		ИЛИ (бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды()
			 И ТипДоговора = Тип("СправочникСсылка.ДоговорыАренды"))
		ИЛИ ТипДоговора = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов")) Тогда
		
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("Организация, Контрагент", Объект.Организация, Объект.Контрагент);
		АналитикаПолучениеДанныхВыбора(ДанныеВыбора, Текст, Отбор, ТипДоговора);
		
	КонецЕсли;
															   															   
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект,
			Элемент, Объект, Элемент.Имя, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
			
	ТипДоговора = ТипЗнч(Объект[Элемент.Имя]); 
	Если ЗначениеЗаполнено(Текст)
		И (ТипДоговора = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		ИЛИ (бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды()
			 И ТипДоговора = Тип("СправочникСсылка.ДоговорыАренды"))
		ИЛИ ТипДоговора = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов")) Тогда
		
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("Организация, Контрагент", Объект.Организация, Объект.Контрагент);
		АналитикаПолучениеДанныхВыбора(ДанныеВыбора, Текст, Отбор, ТипДоговора);
		
	КонецЕсли;
															   															   
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_1ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_2ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_3ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_4ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_5ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_6ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_7ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_8ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_9ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_10ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_11ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_12ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикаОчистка(Элемент, СтандартнаяОбработка)
	
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, 
			Объект, Элемент.Имя, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.БанковскийСчет = ВыбранноеЗначение;
	Модифицированность = Истина;
	ОбновитьКонтролируемыеРеквизиты("БанковскийСчет", ЭтотОбъект);
	БанковскийСчетПриИзмененииНаСервере();
	
	УстановитьНадписьРеквизитыПлательщика();
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетОчистка(Элемент, СтандартнаяОбработка)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	
	БанковскийСчетПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДоговорКредитаДепозитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДоговорКредитаДепозитаНачалоВыбораНаСервере();
	
КонецПроцедуры

//  Процедура обработчик "НачалоВыбора" поля ДоговорКредитаДепозита.
//
&НаСервере
Процедура ДоговорКредитаДепозитаНачалоВыбораНаСервере()
	
	ХарактерДоговора = Справочники.ДоговорыКредитовИДепозитов.ХарактерДоговораПоОперации(ХозОперацияУП);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ХарактерДоговора", ХарактерДоговора));
	Элементы.ДоговорКредитаДепозита.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипНалогаПриИзменении(Элемент)
	
	ТипНалогаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОтраженияВРеглУчетеНажатие(Элемент, СтандартнаяОбработка)
	
	//++ НЕ УТ
	НастройкаСчетовУчетаКлиент.ПриНажатии(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	//-- НЕ УТ
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРеквизитыПлатежаВБюджетНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПросмотр",         ТолькоПросмотр);
	ПараметрыФормы.Вставить("ВидПеречисленияВБюджет", Объект.ВидПеречисленияВБюджет);
	ПараметрыФормы.Вставить("КодБК",                  Объект.КодБК);
	ПараметрыФормы.Вставить("КодОКАТО",               Объект.КодОКАТО);
	ПараметрыФормы.Вставить("ПоказательДаты",         Объект.ПоказательДаты);
	ПараметрыФормы.Вставить("ПоказательНомера",       Объект.ПоказательНомера);
	ПараметрыФормы.Вставить("ПоказательОснования",    Объект.ПоказательОснования);
	ПараметрыФормы.Вставить("ПоказательПериода",      Объект.ПоказательПериода);
	ПараметрыФормы.Вставить("ПоказательТипа",         Объект.ПоказательТипа);
	ПараметрыФормы.Вставить("СтатусСоставителя",      Объект.СтатусСоставителя);
	ПараметрыФормы.Вставить("ХозяйственнаяОперация",  ХозОперацияУП);
	ПараметрыФормы.Вставить("ПрименениеПриказа107н",  ПрименениеПриказа107н);
	ПараметрыФормы.Вставить("ПрименениеПриказа126н",  ПрименениеПриказа126н);
	ПараметрыФормы.Вставить("ТекущаяДата",            ТекущаяДата);
	
	Оповещение = Новый ОписаниеОповещения("НадписьРеквизитыПлатежаВБюджетНажатиеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.РеквизитыПлатежаВБюджет", ПараметрыФормы, ЭтотОбъект,,,,
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура НадписьРеквизитыПлатежаВБюджетНажатиеЗавершение(РеквизитыПлатежаВБюджет, ДополнительныеПараметры) Экспорт
	
	Если РеквизитыПлатежаВБюджет <> Неопределено Тогда		
		Модифицированность = Истина;		
		ЗаполнитьЗначенияСвойств(Объект, РеквизитыПлатежаВБюджет);		
		УправлениеПоказателямиПлатежаВБюджет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречислениеВБюджетПриИзменении(Элемент)
	
	ПеречислениеВБюджетПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура НДФЛПоВедомостямПриИзменении(Элемент)
	
	НДФЛПоВедомостямПриИзмененииСервер();	
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторПлатежаПриИзменении(Элемент)
	
	Если Объект.ПеречислениеВБюджет Тогда
		ОчиститьСообщения();
		ПроверитьРеквизитыБюджетаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить("Почтой");
	ДанныеВыбора.Добавить("Телеграфом");
	ДанныеВыбора.Добавить("Срочно");
	
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)

	ФизЛицоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если Объект.Контрагент = КонтролируемыеРеквизиты.Контрагент Тогда
		Возврат;
	КонецЕсли;

	КонтрагентПриИзмененииНаСервере();
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетПолучателяПриИзменении(Элемент)
	
	БанковскийСчетПолучателяПриИзмененииСервер();

КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	КассаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомостьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Источник", ПредопределенноеЗначение("Документ.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка"));// Объект.Ссылка);
	ПараметрыФормы.Вставить("ИсключатьОплаченные", Истина);
	ПараметрыФормы.Вставить("КодВидаДохода", Объект.КодВидаДохода);
	
	ОтборВедомостей = Новый Структура;
	ОтборВедомостей.Вставить("Организация", Объект.Организация);
	
	Если ХозОперацияУП = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу") Тогда
		Операции = Новый Массив;
		Операции.Добавить(ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыРаздатчиком"));
		Операции.Добавить(ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу"));
		ОтборВедомостей.Вставить("МассивОпераций", Операции);
	Иначе
		ОтборВедомостей.Вставить("ХозяйственнаяОперация", ХозОперацияУП);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ОтборВедомостей", ОтборВедомостей);
	
	ОткрытьФорму("ОбщаяФорма.ВедомостиНаВыплатуЗарплаты", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежиПо275ФЗПриИзменении(Элемент)
	
	//++ Локализация
	//++ НЕ УТ
	ПлатежиПо275ФЗПриИзмененииНаСервере();
	//-- НЕ УТ
	//-- Локализация
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПлатежаФЗ275ПриИзменении(Элемент)

	//++ Локализация
	//++ НЕ УТ
	ПараметрыПроверки = РаботаСТабличнымиЧастямиКлиент.ПараметрыПроверкиЗаполнения();
	ПараметрыПроверки.ТабличнаяЧасть            = Объект.ПодтверждающиеДокументы;
	ПараметрыПроверки.ЗаголовокТабличнойЧасти   = НСтр("ru = 'Подтверждающие документы';
														|en = 'Justification documents'");
	ПараметрыПроверки.ПроверятьРаспроведенность = Ложь;
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПодтверждающиеДокументыЗавершение", ЭтотОбъект);
	РаботаСТабличнымиЧастямиКлиент.ПроверитьВозможностьЗаполнения(ЭтотОбъект, Оповещение, ПараметрыПроверки);
	
	ТипПлатежаФЗ275ПриИзмененииНаСервере();
	//-- НЕ УТ
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорСЗаказчикомПриИзменении(Элемент)
	
	ДоговорСЗаказчикомПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРеквизитыПлательщикаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	СтруктураПараметров.Вставить("Объект",         Объект);
	СтруктураПараметров.Вставить("ЮрФизЛицо",      ЮрФизЛицо);
	
	ОткрытьФорму("Документ.СписаниеБезналичныхДенежныхСредств.Форма.РеквизитыПлательщика", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвансовогоОтчетаПриИзменении(Элемент)
	
	Объект.ДатаАвансовогоОтчета =
		ДенежныеСредстваКлиент.ПересчитатьДатуАвансовогоОтчета(ПериодАвансовогоОтчета, Объект.Дата);
	Элементы.ДатаАвансовогоОтчета.ТолькоПросмотр = НЕ ПериодАвансовогоОтчетаДата;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвансовогоОтчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораДаты", ЭтотОбъект);
	
	ДенежныеСредстваКлиент.ПериодАвансовогоОтчетаОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ЭтотОбъект, Объект.Дата, Оповещение);
	
	ПериодАвансовогоОтчетаДата = (ТипЗнч(ВыбранноеЗначение) = Тип("Дата") Или ВыбранноеЗначение = "ДоДаты");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораДаты(ВыбраннаяДата, Параметры) Экспорт
	
	ПериодАвансовогоОтчетаДата = (ТипЗнч(ПериодАвансовогоОтчета) = Тип("Дата"));
	
	Элементы.ДатаАвансовогоОтчета.ТолькоПросмотр = НЕ ПериодАвансовогоОтчетаДата;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбработатьИзменениеПериодаРассчетов();
	
	Объект.ДатаАвансовогоОтчета =
		ДенежныеСредстваКлиент.ПересчитатьДатуАвансовогоОтчета(ПериодАвансовогоОтчета, Объект.Дата);
		
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.СтатьяРасходов) Тогда
		Статья = Объект.СтатьяРасходов;
	Иначе
		Статья = ПредопределенноеЗначение("ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка");
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья",          Статья);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элемент.ПараметрыВыбора);
	ПараметрыФормы.Вставить("ОграничениеТипа", Элемент.ОграничениеТипа);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовПриИзменении(Элемент)
	
	СтатьяРасходовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречислениеСотрудникуЧерезБанкПриИзменении()

	ПеречислениеСотрудникуЧерезБанкПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.Подразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФизЛицПриИзменении(Элемент)
	
	Объект.СписокФизЛиц = (СписокФизЛиц = 1);
	УправлениеФормой();

КонецПроцедуры

&НаКлиенте
Процедура РеквизитДоговораСБанкомПриИзменении(Элемент)
	
	РеквизитДоговораСБанкомПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорАрендыПриИзменении(Элемент)
	
	ДоговорАрендыПриИзмененииНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПолучательПриИзменении(Элемент)
	
	ОрганизацияПолучательПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеСуммыПриИзменении(Элемент)
	
	ПланированиеСуммыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВалютыИКурсПлатежаНажатие(Элемент)
				
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПросмотр",          		 ТолькоПросмотр);
	ПараметрыФормы.Вставить("ВалютаДокумента",         		 Объект.ВалютаДокумента);
	ПараметрыФормы.Вставить("СуммаДокумента",          		 Объект.СуммаДокумента);
	ПараметрыФормы.Вставить("ВалютаВзаиморасчетов",    		 Объект.ВалютаВзаиморасчетов);
	ПараметрыФормы.Вставить("СуммаВзаиморасчетов",     		 Объект.СуммаВзаиморасчетов);
	ПараметрыФормы.Вставить("КурсЧислительВзаиморасчетов",   Объект.КурсЧислительВзаиморасчетов);
	ПараметрыФормы.Вставить("КурсЗнаменательВзаиморасчетов", Объект.КурсЗнаменательВзаиморасчетов);
	ПараметрыФормы.Вставить("ВалютаРеглУчета",         		 ВалютаРеглУчета);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("ПараметрыФормы", ПараметрыФормы);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДекорацияВалютыИКурсПлатежаНажатиеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ВалютыИКурсПлатежа", ПараметрыФормы, ЭтотОбъект,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура ДекорацияВалютыИКурсПлатежаНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	РезультатыОбработки = Новый Структура;
		
	ПараметрыФормы = ДополнительныеПараметры.ПараметрыФормы;
	
	ИзмененныеРеквизиты = Новый Массив;
	Для каждого КлючИЗначение Из Результат Цикл
		Если КлючИЗначение.Значение <> ПараметрыФормы[КлючИЗначение.Ключ] Тогда
			ИзмененныеРеквизиты.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	РезультатыОбработки.Вставить("ИзмененныеРеквизиты", ИзмененныеРеквизиты);
	
	ИзмененаСумма = Ложь;
	Если ИзмененныеРеквизиты.Количество() Тогда
		
		Модифицированность = Истина;
		
		Если ИзмененныеРеквизиты.Найти("КурсЧислительВзаиморасчетов") <> Неопределено Тогда
			Объект.КурсЧислительВзаиморасчетов = Результат.КурсЧислительВзаиморасчетов;
		КонецЕсли;
		
		Если ИзмененныеРеквизиты.Найти("КурсЗнаменательВзаиморасчетов") <> Неопределено Тогда
			Объект.КурсЗнаменательВзаиморасчетов = Результат.КурсЗнаменательВзаиморасчетов;
		КонецЕсли;
		
		Если ИзмененныеРеквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			Объект.СуммаДокумента = Результат.СуммаДокумента;
			ИзмененаСумма		  = Истина;
			Если Объект.ВалютаВзаиморасчетов <> Объект.ВалютаДокумента Тогда
				Объект.СуммаВзаиморасчетов = 0;
			Иначе
				Объект.СуммаВзаиморасчетов = Объект.СуммаДокумента;
			КонецЕсли;
		КонецЕсли;
		
		Если ИзмененныеРеквизиты.Найти("СуммаДокумента") <> Неопределено
			И ИзмененныеРеквизиты.Найти("СуммаВзаиморасчетов") = Неопределено Тогда
			РассчитатьСуммуВзаиморасчетов();
		КонецЕсли;
		
		Если ИзмененныеРеквизиты.Найти("СуммаВзаиморасчетов") <> Неопределено
			ИЛИ Объект.СуммаВзаиморасчетов <> Результат.СуммаВзаиморасчетов Тогда
			Объект.СуммаВзаиморасчетов = Результат.СуммаВзаиморасчетов;
		КонецЕсли;
	КонецЕсли;
	
	ДекорацияВалютыИКурсПлатежаНажатиеЗавершениеНаСервере(ИзмененаСумма);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВзаиморасчетовПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СуммаВзаиморасчетов)
		И Объект.ВалютаВзаиморасчетов = Объект.ВалютаДокумента
		И Объект.СуммаВзаиморасчетов <> Объект.СуммаДокумента Тогда
		Объект.СуммаВзаиморасчетов = Объект.СуммаДокумента;
	Иначе
		СуммаВзаиморасчетовПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВариантКурсаДоговораНажатие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Новый Структура;
	ТекущиеДанные.Вставить("ВариантКурсаДоговора", ВариантКурсаДоговора);
	ТекущиеДанные.Вставить("ОбъектРасчетов",	   Объект.ОбъектРасчетов);
	
	ВзаиморасчетыКлиент.РасшифровкаПлатежаВариантКурсаДоговораНажатие(ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КурсЧислительВзаиморасчетовПриИзменении(Элемент)
	
	КурсЧислительВзаиморасчетовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаФинансовогоУчетаПриИзменении(Элемент)
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.ГруппаФинансовогоУчета);

КонецПроцедуры

&НаКлиенте
Процедура НаправлениеДеятельностиПриИзменении(Элемент)

	ПриИзмененииПоставляемыхРеквизитов(Объект.НаправлениеДеятельности);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодтверждающиеДокументы

&НаКлиенте
Процедура ПодтверждающиеДокументыФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//++ Локализация
	//++ НЕ УТ
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждающиеДокументыФайлНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПунктыМеню = Новый СписокЗначений;
	ПунктыМеню.Добавить("ВыборИзПрисоединенныхФайлов",
		НСтр("ru = 'Выбрать из присоединенных файлов ...';
			|en = 'Select from attached files ...'"),, БиблиотекаКартинок.ВыбратьЗначение);
	ПунктыМеню.Добавить("ДобавлениеФайлаСДиска",
		НСтр("ru = 'Добавить файл с диска ...';
			|en = 'Add file from disk ...'"),, БиблиотекаКартинок.ОткрытьФайл);
	
	ПоказатьВыборИзМеню(ОписаниеОповещения, ПунктыМеню, Элементы.ПодтверждающиеДокументыФайл);
	//-- НЕ УТ
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыФайлНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ОбновитьСписокВладельцевПодтверждающихДокументов();
		
		ДополнительныеПараметрыВыбораВладельца = Новый Структура("Действие", Результат.Значение);
		Если ВладельцыПодтверждающихДокументов.Количество() > 1 Тогда
			
			СписокВыбора = Новый СписокЗначений;
			СписокВыбора.ЗагрузитьЗначения(ВладельцыПодтверждающихДокументов.ВыгрузитьЗначения());
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборВладельцаФайлаЗавершение", ЭтотОбъект, ДополнительныеПараметрыВыбораВладельца);
			СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Выбор договора для создания файла';
																		|en = 'Select a contract for creating a file'")); 
			
		ИначеЕсли ВладельцыПодтверждающихДокументов.Количество() = 1 Тогда
			
			ВыборВладельцаФайлаЗавершение(Новый Структура("Значение", ВладельцыПодтверждающихДокументов[0].Значение), ДополнительныеПараметрыВыбораВладельца);
			
		Иначе
			
			Если Результат.Значение = "ДобавлениеФайлаСДиска" Тогда
				ПоказатьПредупреждение(, НСтр("ru = 'В документе не указан ни один договор. Добавление файла невозможно.';
												|en = 'No contract is specified in the document. Cannot add a file.'"));
			ИначеЕсли Результат.Значение = "ВыборИзПрисоединенныхФайлов" Тогда
				ПоказатьПредупреждение(, НСтр("ru = 'В документе не указан ни один договор. Выбор файла невозможен.';
												|en = 'No contract is specified in the document. Cannot select a file.'"));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВладельцаФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ВыбранныйВладелецФайла = Результат.Значение;
		Если ДополнительныеПараметры.Действие = "ДобавлениеФайлаСДиска" Тогда
			ИдентификаторФайла = Новый УникальныйИдентификатор;
			ДобавляетсяФайлПодтверждающегоДокумента = Истина;
			РаботаСФайламиКлиент.ДобавитьФайлы(ВыбранныйВладелецФайла, ИдентификаторФайла);
		ИначеЕсли ДополнительныеПараметры.Действие = "ВыборИзПрисоединенныхФайлов" Тогда
			РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(ВыбранныйВладелецФайла, Элементы.ПодтверждающиеДокументыФайл);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЛицевыеСчетаСотрудников

&НаКлиенте
Процедура ЛицевыеСчетаСотрудниковПриИзменении(Элемент)
	
	Объект.СуммаДокумента = Объект.ЛицевыеСчетаСотрудников.Итог("Сумма");
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда,
																											ЭтотОбъект,
																											Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

&НаКлиенте
Процедура КомандаСписок(Команда)
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		ПредложитьЗаписатьДокумент();
	Иначе
		ОткрытьФормуЗаявкиНаРасходованиеДС();
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура КомандаНаСогласование(Команда)
	
	Если НЕ ЭтоРежимЗаявки И НЕ Элементы.ФормаКомандаНаСогласование.Заголовок = НСтр("ru='Отозвать';en='Revoke'") Тогда
		ТекстСообщения = НСтр("ru='В режиме списка платежную позицию запрещено отправлять на согласование.';
						  	  |en='In list mode, the position of payment allowed to send for approval.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	Иначе 
		
		Объект.ОтправленНаСогласование = НЕ Объект.ОтправленНаСогласование;
		Попытка			
			Записано = Записать();			
		Исключение			
			Записано = Ложь;			
		КонецПопытки;
		
		Если Записано Тогда			
			Если НЕ Объект.ОтправленНаСогласование Тогда				
				ОчиститьВсеВизы();				
			КонецЕсли;			
		Иначе			
		 	// Объект не удалось записать - возвращаем признак в исходное состояние.
		 	Объект.ОтправленНаСогласование = НЕ Объект.ОтправленНаСогласование;			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПлатежныйДокумент(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Данные были изменены. Сохраните изменения.'"); 
		ПоказатьПредупреждение(,ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	НовыеДокументы = СоздатьПлатежныйДокумент();
	
	Для каждого Документ Из НовыеДокументы Цикл
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Документ);
		ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСкопировать(Команда)
	
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		ТекстСообщения =  НСтр("ru='Объект не записан.';en='The object is not recorded.'");
		ПоказатьПредупреждение(, ТекстСообщения,, "Копирование");	
	Иначе		
		ПараметрыФормы = Новый Структура;
		Если ЭтоРежимЗаявки Тогда
			ПараметрыФормыПозиции = ПараметрыФормыПриКопировании(Объект.ДокументПланирования);
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыФормыПозиции.ЗначенияЗаполнения);
		Иначе	
			ПараметрыФормы.Вставить("ЗначениеКопирования", Объект.Ссылка);
		КонецЕсли;
		ОткрытьФорму("Документ.бит_кзн_ПлатежнаяПозиция.ФормаОбъекта", ПараметрыФормы);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНазначениеПлатежа(Команда)
	
	ЗаполнитьНазначениеПлатежаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодтверждающиеДокументы(Команда)
	
	ЗаполнитьПодтверждающиеДокументыЛокализация();
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьПодтверждающийДокумент(Команда)
	
	ПросмотретьПодтверждающийДокументЛокализация();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаЗаСчет(Команда)
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресДанныхДляКорректировки) Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда		
		Оповещение = Новый ОписаниеОповещения("ОплатаЗаСчетПродолжение", ЭтотОбъект); 
		ТекстВопроса = НСтр("ru = 'Операция возможна только после записи документа. Записать?'; 
							  |en = 'This operation is only possible after writing the document. Write it down?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);			
	Иначе		
		ОплатаЗаСчетЗавершение();		
	КонецЕсли;	
		
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте 
Процедура ОплатаЗаСчетПродолжение(Результат, ДополнительныеДанные) Экспорт
		
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПроверитьЗаполнение() Тогда
		Попытка
			Записать();		
		Исключение
			ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки; 
	КонецЕсли; 
	
	ОплатаЗаСчетЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПредыдущемуПлатежу(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка",                  Объект.Ссылка);
	ПараметрыФормы.Вставить("БанковскийСчет",          Объект.БанковскийСчет);
	ПараметрыФормы.Вставить("ПрименениеПриказа107н",   ПрименениеПриказа107н);
	ПараметрыФормы.Вставить("ПрименениеПриказа126н",   ПрименениеПриказа126н);
	
	Если ЗначениеЗаполнено(Объект.ТипНалога) Тогда
		ПараметрыФормы.Вставить("ТипНалога", Объект.ТипНалога);
	КонецЕсли; 
	
	ОткрытьФорму("ОбщаяФорма.РанееСовершенныеПлатежи", ПараметрыФормы, ЭтотОбъект,);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемыСвойства

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область УправлениеДопАналитиками

&НаСервере
Процедура УстановитьВидимостьАналитик()
	
	ПараметрыУстановки = ПараметрыУстановкиСвойствАналитик(ЭтотОбъект);
	бит_Казначейство.УстановитьВидимостьНазначенныхАналитик(ЭтотОбъект, ПараметрыУстановки);	

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПоставляемыхРеквизитов(Значение)
	
	ПараметрыУстановки = ПараметрыУстановкиСвойствАналитик(ЭтотОбъект);
	бит_МеханизмДопИзмерений.ЗаполнитьДопАналитикуПоДаннымДокумента(Объект, Значение, ПараметрыУстановки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыУстановкиСвойствАналитик(Форма, Префикс = "")

	Результат = бит_МеханизмДопИзмеренийКлиентСервер.ПараметрыУстановкиСвойствАналитикПоШаблону(
		Префикс + "Аналитика_", "Аналитика_", "СтатьяОборотов");
		
	Результат.ДопРеквизиты.Вставить("Организация", Форма.Объект.Организация);
	
	Возврат Результат;

КонецФункции
	
#КонецОбласти

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти 

#Область ПлатежиПо275ФЗ

&НаКлиенте
Процедура ЗаполнитьПодтверждающиеДокументыЛокализация()
	
	//++ НЕ УТ
	ПараметрыПроверки = РаботаСТабличнымиЧастямиКлиент.ПараметрыПроверкиЗаполнения();
	ПараметрыПроверки.ТабличнаяЧасть            = Объект.ПодтверждающиеДокументы;
	ПараметрыПроверки.ПроверятьРаспроведенность = Ложь;
	ПараметрыПроверки.ПроверяемыеРеквизиты.Вставить("ТипПлатежаФЗ275", НСтр("ru = 'Тип платежа 275-ФЗ';
																			|en = 'Payment type 275-FZ'"));
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПодтверждающиеДокументыЗавершение", ЭтотОбъект);
	РаботаСТабличнымиЧастямиКлиент.ПроверитьВозможностьЗаполнения(ЭтотОбъект, Оповещение, ПараметрыПроверки);
	//-- НЕ УТ
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодтверждающиеДокументыЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	//++ НЕ УТ
	ЗаполнитьПодтверждающиеДокументыНаСервере();
	//-- НЕ УТ

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждающиеДокументыНаСервере()
	
	//++ НЕ УТ
	Объект.ПодтверждающиеДокументы.Загрузить(
		ПолучитьИзВременногоХранилища(ДенежныеСредстваСерверЛокализация.ПодтверждающиеДокументыФЗ275(
			Объект.ТипПлатежаФЗ275, УникальныйИдентификатор, Объект.ДоговорСЗаказчиком)));
	//-- НЕ УТ
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиОплатыЗасчетСредствГОЗ()
	
	//++ НЕ УТ
	Элементы.ПредметОплаты.СписокВыбора.Очистить();
	Если Объект.ТипПлатежаФЗ275 = Справочники.ТипыПлатежейФЗ275.ОплатаТоваровРаботУслугПоРегулируемымЦенам Тогда
		Для каждого ПредметОплаты Из ТоварыРаботыУслугиСТарифнымРегулированием Цикл
			Элементы.ПредметОплаты.СписокВыбора.Добавить(ПредметОплаты.Наименование);
		КонецЦикла;
	КонецЕсли;
	//-- НЕ УТ
	
КонецПроцедуры
	
//++ НЕ УТ
//  Процедура при изменении флага ПлатежиПо275ФЗ на сервере. 
//
&НаСервере
Процедура ПлатежиПо275ФЗПриИзмененииНаСервере()

	Если Объект.ПлатежиПо275ФЗ Тогда
		Объект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
	КонецЕсли;
	
	УстановитьПараметрыВыбораДоговораСЗаказчиком(Истина);
	
	Если Объект.ПлатежиПо275ФЗ И ЗначениеЗаполнено(Объект.ДоговорСЗаказчиком)
		И ТипЗнч(Объект.ДоговорСЗаказчиком) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДоговорСЗаказчиком,
			"ДоговорСУчастникомГОЗ, ОплатаРасходовПоТарифамСГосрегулированием,
			|ГосударственныйКонтракт, ИностранныйИсполнительВУтвержденномПеречнеГОЗ");
		ЗаполнитьЗначенияСвойств(Объект, ЗначенияРеквизитов, "ДоговорСУчастникомГОЗ");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов,
			"ОплатаРасходовПоТарифамСГосрегулированием, ИностранныйИсполнительВУтвержденномПеречнеГОЗ, ГосударственныйКонтракт");
	КонецЕсли;
	ПроверитьЗаполнитьТипПлатежа275ФЗ();
	УправлениеЭлементамиОплатыЗасчетСредствГОЗ();
	УправлениеФормой();
	
КонецПроцедуры //-- НЕ УТ

//  Процедура получает реквизиты объекта подтверждающего документа. 
//
&НаСервере
Функция РеквизитыПодтверждающегоДокумента(ПодтверждающийДокумент)
	
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПодтверждающийДокумент, "Зашифрован, Редактирует");
	
	ФайлРедактируется = ЗначениеЗаполнено(РеквизитыОбъекта.Редактирует)
		И РеквизитыОбъекта.Редактирует = Пользователи.ТекущийПользователь();
	РеквизитыОбъекта.Вставить("ФайлРедактируется", ФайлРедактируется);
	
	Возврат РеквизитыОбъекта;
	
КонецФункции

//  Процедура получает данные файла в подтвеждающем документе.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(Знач ПрисоединенныйФайл, Знач ИдентификаторФормы = Неопределено,
                            Знач ПолучатьСсылкуНаДвоичныеДанные = Истина)
	
	Возврат РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(
		ПрисоединенныйФайл, ИдентификаторФормы, ПолучатьСсылкуНаДвоичныеДанные);
	
КонецФункции

&НаСервере
Процедура ДоговорСЗаказчикомПриИзмененииСервер()
	
	Если Объект.ПлатежиПо275ФЗ
		И ТипЗнч(Объект.ДоговорСЗаказчиком) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДоговорСЗаказчиком,
			"ДоговорСУчастникомГОЗ, ОплатаРасходовПоТарифамСГосрегулированием,
			|ГосударственныйКонтракт, ИностранныйИсполнительВУтвержденномПеречнеГОЗ");
		ЗаполнитьЗначенияСвойств(Объект, ЗначенияРеквизитов, "ДоговорСУчастникомГОЗ");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов,
			"ОплатаРасходовПоТарифамСГосрегулированием, ИностранныйИсполнительВУтвержденномПеречнеГОЗ, ГосударственныйКонтракт");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДоговораСЗаказчиком(СброситьЗначение = Ложь)
	
	Если НЕ Объект.ПлатежиПо275ФЗ Тогда
		Возврат;	
	КонецЕсли;
	
	НаборПараметров = Новый Массив;

	Если ХозОперацияУП = Перечисления.ХозяйственныеОперации.ОплатаПоКредитам
	 ИЛИ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты
	 ИЛИ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыдачаЗаймов Тогда
		
		Если СброситьЗначение Тогда
			Объект.ДоговорКредитаДепозита = Справочники.ДоговорыКредитовИДепозитов.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ Объект.Организация.Пустая() Тогда
			НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.Организация", Объект.Организация));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ФормаОплаты) Тогда
			Если Объект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
				НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.ФормаОплаты", Перечисления.ФормыОплаты.Безналичная));
			ИначеЕсли Объект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Наличные Тогда	
				НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.ФормаОплаты", Перечисления.ФормыОплаты.Наличная));
			КонецЕсли;
		КонецЕсли;
		НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.Статус", Перечисления.СтатусыДоговоровКонтрагентов.Действует));
		НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.ХарактерДоговора",
		Справочники.ДоговорыКредитовИДепозитов.ХарактерДоговораПоОперации(ХозОперацияУП)));
		НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления",Ложь));
		
		Если НЕ Объект.Контрагент.Пустая() Тогда
			НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", Объект.Контрагент));
		КонецЕсли;
		НовыеПараметрыВыбора = Новый ФиксированныйМассив(НаборПараметров);
		Элементы.ДоговорКредитаДепозита.ПараметрыВыбора = НовыеПараметрыВыбора;
	КонецЕсли;
	
	Если СброситьЗначение Тогда
		Объект.ДоговорСЗаказчиком = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ Объект.Организация.Пустая() Тогда
		НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.Организация", Объект.Организация));
	КонецЕсли;
	
	НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.Статус", Перечисления.СтатусыДоговоровКонтрагентов.Действует));
	НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.ДоговорСУчастникомГОЗ",Истина));
	НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления",Ложь));
	
	Если НЕ Объект.Контрагент.Пустая() Тогда
		НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", Объект.Контрагент));
	КонецЕсли;
	НовыеПараметрыВыбора = Новый ФиксированныйМассив(НаборПараметров);
	
	Элементы.ДоговорСЗаказчиком.ПараметрыВыбора = НовыеПараметрыВыбора;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораСтатьиРасходов()

	НаборПараметров = Новый Массив;
	НаборПараметров.Добавить(Новый ПараметрВыбора("Отбор.ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств));
	НаборПараметров.Добавить(Новый ПараметрВыбора("ДополнитьСтатьямиРасходов", Истина));
	НаборПараметров.Добавить(Новый ПараметрВыбора("ДополнитьСтатьямиДоходов", Ложь));
	НаборПараметров.Добавить(Новый ПараметрВыбора("ДополнитьСтатьямиАктивовПассивов", Истина));
	
	Элементы.СтатьяРасходов.ПараметрыВыбора = Новый ФиксированныйМассив(НаборПараметров);

КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьСписокВладельцевПодтверждающихДокументов()
	
	ОбъектОбъектаРасчетов = Неопределено;
	
	ВладельцыПодтверждающихДокументов.Очистить();

	Если ЗначениеЗаполнено(Объект.ОбъектРасчетов) Тогда
		ОбъектОбъектаРасчетов = ОбъектОбъектаРасчетов(Объект.ОбъектРасчетов);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДоговорКредитаДепозита) Тогда
		ВладельцыПодтверждающихДокументов.Добавить(Объект.ДоговорКредитаДепозита);
	Иначе 	
		Если (ТипЗнч(ОбъектОбъектаРасчетов) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		  ИЛИ ТипЗнч(ОбъектОбъектаРасчетов) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")) Тогда
			
			ВладельцыПодтверждающихДокументов.Добавить(ОбъектОбъектаРасчетов);
			
		ИначеЕсли ЗначениеЗаполнено(Объект.Договор) Тогда
			ВладельцыПодтверждающихДокументов.Добавить(Объект.Договор);
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ТипПлатежаФЗ275 = ПредопределенноеЗначение("Справочник.ТипыПлатежейФЗ275.ПеречислениеПрибылиГоловномуИсполнителю")
	 ИЛИ Объект.ТипПлатежаФЗ275 = ПредопределенноеЗначение("Справочник.ТипыПлатежейФЗ275.ПеречисленияПрибылиИсполнителю")
	 ИЛИ Объект.ТипПлатежаФЗ275 = ПредопределенноеЗначение("Справочник.ТипыПлатежейФЗ275.СписаниеНаВозмещениеЗатратЗаСчетСобственныхСредств") Тогда
		
		Если ЗначениеЗаполнено(Объект.ДоговорСЗаказчиком) Тогда
			ВладельцыПодтверждающихДокументов.Добавить(Объект.ДоговорСЗаказчиком);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбъектОбъектаРасчетов(Знач ОбъектРасчетов)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРасчетов, "Объект");

КонецФункции

//++ НЕ УТ
&НаСервере
Процедура ТипПлатежаФЗ275ПриИзмененииНаСервере()
	
	Элементы.ПредметОплаты.СписокВыбора.Очистить();
	Если Объект.ТипПлатежаФЗ275 = Справочники.ТипыПлатежейФЗ275.ОплатаТоваровРаботУслугПоРегулируемымЦенам Тогда
		Для каждого ПредметОплаты Из ТоварыРаботыУслугиСТарифнымРегулированием Цикл
			Элементы.ПредметОплаты.СписокВыбора.Добавить(ПредметОплаты.Наименование);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //-- НЕ УТ

&НаКлиенте
Процедура ПросмотретьПодтверждающийДокументЛокализация()
	
	//++ НЕ УТ
	Если Элементы.ПодтверждающиеДокументы.ТекущаяСтрока <> Неопределено Тогда
		Файл = Элементы.ПодтверждающиеДокументы.ТекущиеДанные.Файл;
		
		Если Файл = Неопределено Или Файл.Пустая() Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Файл не указан.';
										|en = 'File is not specified.'"));
			Возврат;
		КонецЕсли;
		
		РеквизитыФайла = РеквизитыПодтверждающегоДокумента(Файл);
		
		Если РеквизитыФайла.Зашифрован Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеФайла = ПолучитьДанныеФайла(Файл, УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, РеквизитыФайла.ФайлРедактируется);
	КонецЕсли;
	//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти 

#Область ПеречисленияВБюджет

&НаСервере
Процедура ТипНалогаПриИзмененииНаСервере()
	
	//++ НЕ УТ
	Если ИспользоватьНачислениеЗарплаты И Объект.ТипНалога <> Справочники.ВидыНалоговВзносов.НДФЛ И Объект.ТипНалога <> Справочники.ВидыНалоговВзносов.НДФЛСПревышения Тогда
		Объект.НДФЛПоВедомостям = Ложь;
		ОплатаНДСВБюджетПоОтдельнымОперациям = (Объект.ТипНалога = Справочники.ВидыНалоговВзносов.НДС_ВвозимыеТовары
			ИЛИ Объект.ТипНалога = Справочники.ВидыНалоговВзносов.НДС_НалоговыйАгент);
	КонецЕсли;
	//-- НЕ УТ

	УстановитьСчетУчетаНалогов();
	НастроитьСчетаУчета();
	
	Если Элементы.НадписьРеквизитыПлатежаВБюджет.Видимость Тогда
		ПлатежиВБюджет.РеквизитыПлатежаВБюджетПоУмолчанию(Объект);
		ПлатежиВБюджет.УстановитьНадписьРеквизитовПлатежаВБюджет(ЭтотОбъект);
	КонецЕсли;

	ПроверитьКорректностьЗаполненияПлатежаВБюджет();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСчетаУчета()
	
	//++ НЕ УТ 
	ПараметрыНастройки = Документы.бит_кзн_ПлатежнаяПозиция.ПараметрыНастройкиСчетовУчета(
							Объект.ХозяйственнаяОперация, Объект.ТипНалога);
	НастройкаСчетовУчетаСервер.ПриИзмененииПараметровНастройки(ЭтотОбъект, ПараметрыНастройки);
	//-- НЕ УТ 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСчетУчетаНалогов()
	
	//++ НЕ УТ 
	СчетУчетДоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.НастройкаСчетовУчета, "СчетУчета");
	СчетПоТипуНалога 	= РеглУчетСервер.СчетУчетаПоТипуНалога(Объект.ТипНалога);
	
	Если СчетУчетДоИзменения <> СчетПоТипуНалога Тогда
		НоваяНастройка = НастройкаСчетовУчетаКлиентСервер.СоставНастройкиСчетовУчета();
		НоваяНастройка.СчетУчета = СчетПоТипуНалога;
		Объект.НастройкаСчетовУчета = НастройкаСчетовУчетаСервер.НоваяНастройкаСчетовУчета(
			НоваяНастройка, ЭтотОбъект);
	КонецЕсли;
	//-- НЕ УТ
	
КонецПроцедуры

&НаСервере
Процедура ПеречислениеВБюджетПриИзмененииСервер()
	
	Если Объект.ПеречислениеВБюджет Тогда
		
		МассивОпераций = ДенежныеСредстваСерверЛокализация.МассивОперацийПеречисленияВБюджет();
		
		Если ХозОперацияУП = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
			Объект.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.НалоговыйПлатеж;
		ИначеЕсли ХозОперацияУП = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне Тогда
			Объект.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ТаможенныйПлатеж;
		ИначеЕсли МассивОпераций.Найти(ХозОперацияУП) <> Неопределено Тогда
			Объект.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ИнойПлатеж;
		КонецЕсли;
		УстановитьЗначенияПоказателейПлатежаВБюджетПоВиду();
		
		Если ПустаяСтрока(Объект.КодОКАТО) Тогда
			Реквизиты = Справочники.Организации.ПолучитьРеквизитыОрганизации(Объект.Организация);
			Если ПрименениеПриказа107н Тогда
				Объект.КодОКАТО = Реквизиты.КодПоОКТМО;
			Иначе
				Объект.КодОКАТО = Реквизиты.КодПоОКАТО;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	УправлениеПоказателямиПлатежаВБюджет();
	
КонецПроцедуры

&НаСервере
Процедура НДФЛПоВедомостямПриИзмененииСервер()
	
	Если Объект.НДФЛПоВедомостям Тогда
		Объект.ТипНалога = Справочники.ВидыНалоговВзносов.НДФЛ;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПоказателейПлатежаВБюджетПоВиду()
	
	Если Объект.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.НалоговыйПлатеж Тогда
		
		Объект.СтатусСоставителя 	= "01";
		Объект.ПоказательОснования 	= "";
		Объект.ПоказательПериода 	= "";
		Объект.ПоказательТипа 		= "";
		
	ИначеЕсли Объект.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ТаможенныйПлатеж Тогда
		
		Объект.СтатусСоставителя 	= "06";
		Объект.ПоказательОснования 	= "";
		Объект.ПоказательПериода 	= "";
		Объект.ПоказательТипа 		= "";
		
	ИначеЕсли Объект.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ИнойПлатеж Тогда
		
		Объект.СтатусСоставителя 	= "08";
		Объект.ПоказательОснования 	= "0";
		Объект.ПоказательПериода 	= "0";
		Объект.ПоказательНомера 	= "0";
		Объект.ПоказательДаты 		= "0";
		Объект.ПоказательТипа 		= ?(ПрименениеПриказа126н, "", "0");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеПоказателямиПлатежаВБюджет()
	
	// См. СписаниеБезналичныхДенежныхСредствЛокализация.ЗаполнитьНастройкиПолейФормы().
	
	ЭтоПеречислениеНалога = (ХозОперацияУП = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет);
	ОплатаЧерезБанк 	  = (Объект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные);
	
	ОперацииПеречисленияВБюджет = ДенежныеСредстваСерверЛокализация.МассивОперацийПеречисленияВБюджет();

	Элементы.ЗаполнитьПоПредыдущемуПлатежу.Видимость 	= ЭтоПеречислениеНалога;
	Элементы.ТипНалога.Видимость 					 	= ЭтоПеречислениеНалога;
	
	// Перечисление в бюджет.
	ВидимостьПеречислениеВБюджет = ОплатаЧерезБанк И ОперацииПеречисленияВБюджет.Найти(ХозОперацияУП) <> Неопределено;
	Элементы.ПеречислениеВБюджет.Видимость = ВидимостьПеречислениеВБюджет;
	
	// Идентификатор платежа.
	Если ВидимостьПеречислениеВБюджет Тогда		
		Если Объект.ПеречислениеВБюджет Тогда
			Элементы.ИдентификаторПлатежа.Заголовок = НСтр("ru='УИН';en='UIN'");
			Элементы.ИдентификаторПлатежа.Подсказка = НСтр("ru='Уникальный идентификатор начисления указывается, если предоставлен получателем (администратором) платежа.';
														   |en='The unique charging identifier indicated if provided by the recipient (administrator) payment.'");
		Иначе
			Элементы.ИдентификаторПлатежа.Заголовок = НСтр("ru='УИП';en='UIP'");
			Элементы.ИдентификаторПлатежа.Подсказка = НСтр("ru='Уникальный идентификатор платежа указывается, если это предусмотрено договором с получателем платежа.';
														   |en='Unique identifier of payment is specified, if it is stipulated in the contract with the beneficiary.'");
		КонецЕсли;
	КонецЕсли;
	Элементы.ИдентификаторПлатежа.Видимость = ОплатаЧерезБанк;
	
	// Надпись "Реквизиты платежа в бюджет".
	Элементы.НадписьРеквизитыПлатежаВБюджет.Видимость = ВидимостьПеречислениеВБюджет И Объект.ПеречислениеВБюджет;
	Если Элементы.НадписьРеквизитыПлатежаВБюджет.Видимость Тогда
		ПлатежиВБюджет.УстановитьНадписьРеквизитовПлатежаВБюджет(ЭтотОбъект);
		ПроверитьРеквизитыБюджетаНаСервере();
	КонецЕсли;
	
	Элементы.ВидПлатежа.Видимость 		  = ОплатаЧерезБанк;
	Элементы.ОчередностьПлатежа.Видимость = ОплатаЧерезБанк;
	
	// Код вида дохода.	
	ТекущаяДата		  = ?(ЗначениеЗаполнено(Объект.ДатаПлан), Объект.ДатаПлан, Объект.Дата);
	ВозможноВзыскание = ВозможноВзысканиеСПеречисленияФизлицу(ТекущаяДата, ХозОперацияУП, Неопределено);
	
	Элементы.КодВидаДохода.Видимость = ОплатаЧерезБанк;
	
	// Код выплат.
	Элементы.КодВыплат.Видимость = ОплатаЧерезБанк;
	
	Если Объект.ПеречислениеВБюджет Тогда
		// Оставим информацию об КБК и ОКТМО.
		РеквизитыПлатежа = СтрРазделить(НадписьРеквизитыПлатежаВБюджет,";");
		Если РеквизитыПлатежа.Количество() <> 0 Тогда
			Индекс = РеквизитыПлатежа.ВГраница();
			Пока Индекс > 1 Цикл
				РеквизитыПлатежа.Удалить(Индекс);
				Индекс = Индекс - 1;
			КонецЦикла;
			ТекстСообщения = СтрСоединить(РеквизитыПлатежа, ";"); 
			ТекстСообщения = НСтр("ru='Перечисление в бюджет: ';en='Transfer to the budget:'") + ТекстСообщения;
		Иначе
			ТекстСообщения = НСтр("ru='Перечисление в бюджет';en='Taxes and Dues Transfer'");
		КонецЕсли; 
	Иначе	
		ТекстСообщения = НСтр("ru='Перечисление в бюджет';en='Taxes and Dues Transfer'");
	КонецЕсли;
	
	УстановитьЗаголовокГруппы(ЭтотОбъект, "ГруппаНалоги", ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРеквизитыБюджетаНаСервере()
	
	НомерСчетаКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.БанковскийСчетПолучателя, "НомерСчета");
	Ошибка = ПлатежиВБюджетКлиентСервер.ПроверитьУИН(Объект.ИдентификаторПлатежа,
		ПлатежиВБюджетКлиентСервер.АдминистраторНачисленияФедеральныйОрганГосударственнойВласти(НомерСчетаКонтрагента));
		
	Если Не ПустаяСтрока(Ошибка) Тогда
		ШаблонТекста = НСтр("ru='%1 
								|Если УИН достоверно не известен, не указывайте его (очистите поле).';
							|en='%1
								|If UIN not reliably known, do not enter it (clear field).'");
		Ошибка = СтрШаблон(ШаблонТекста, Ошибка);
		ОбщегоНазначения.СообщитьПользователю(Ошибка, , "ИдентификаторПлатежа", "Объект");
	КонецЕсли;
	
	// Проверяем дубли УИН.
	ДублиУИН = Документы.бит_кзн_ПлатежнаяПозиция.ПроверитьДублиУИН(Объект.ИдентификаторПлатежа, Объект.Ссылка);
	
	Если ДублиУИН.Количество() > 0 Тогда
		// Информацию о дублях УИН выводим отдельно.
		Для Каждого ОписаниеОшибки Из ДублиУИН Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки.ТекстОшибки,, 
				"ИдентификаторПлатежа", "Объект");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРанееСовершенномуПлатежу(РезультатВыбора)
	
	Объект.ПеречислениеВБюджет = Истина;
	
	Если Не ЗначениеЗаполнено(Объект.ТипНалога) Тогда
		Объект.ТипНалога = РезультатВыбора.АналитикаАктивовПассивов;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, РезультатВыбора,, "БанковскийСчет");
	
	//++ НЕ УТ
	Если Не ОплатаНДСВБюджетПоОтдельнымОперациям Тогда
		НоваяНастройка = НастройкаСчетовУчетаКлиентСервер.СоставНастройкиСчетовУчета();
		ЗаполнитьЗначенияСвойств(НоваяНастройка, РезультатВыбора, "СчетУчета, Субконто1, Субконто2, Субконто3");
		Объект.НастройкаСчетовУчета = НастройкаСчетовУчетаСервер.НоваяНастройкаСчетовУчета(НоваяНастройка, ЭтотОбъект);
										НастроитьСчетаУчета();
										
		ПараметрыНастройки = Документы.бит_кзн_ПлатежнаяПозиция.ПараметрыНастройкиСчетовУчета(
							Объект.ХозяйственнаяОперация, Объект.ТипНалога);
		НастройкаСчетовУчетаСервер.ПриИзмененииПараметровНастройки(ЭтотОбъект, ПараметрыНастройки);
	КонецЕсли;
	//-- НЕ УТ
	
	УправлениеПоказателямиПлатежаВБюджет();
	УстановитьНадписьРеквизитыПлательщика();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиПлатежаВБюджетПоУмолчаниюСервер(МожноИзменятьПеречислениеВБюджет)
	
	Если МожноИзменятьПеречислениеВБюджет Тогда
		
		ОперацийПеречисленияВБюджет = ДенежныеСредстваСерверЛокализация.МассивОперацийПеречисленияВБюджет();
		
		Если ХозОперацияУП = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
			
			Объект.ПеречислениеВБюджет = Истина;
			Объект.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.НалоговыйПлатеж;
			
			Периодичность = "МС";
			НомерПериода = Месяц(ТекущаяДата);
			ГодПериода = Год(ТекущаяДата);
			Объект.ПоказательПериода = Периодичность
						+ "." 
						+ ?(СтрДлина(СокрЛП(НомерПериода)) = 1, "0" + НомерПериода, НомерПериода)
						+ "." 
						+ СтрЗаменить(Строка(ГодПериода), Символы.НПП, "");
					
		ИначеЕсли ХозОперацияУП = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне Тогда
			
			Объект.ПеречислениеВБюджет = Истина;
			Объект.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ТаможенныйПлатеж;
			Объект.ПоказательПериода = "";
			
		ИначеЕсли ОперацийПеречисленияВБюджет.Найти(ХозОперацияУП) <> Неопределено Тогда
			
			Объект.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ИнойПлатеж;
			Объект.ПеречислениеВБюджет    = Ложь;
			
		Иначе
			Объект.ПеречислениеВБюджет = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЗначенияПоказателейПлатежаВБюджетПоВиду();
	
КонецПроцедуры

&НаСервере 
Процедура БанковскийСчетПолучателяПриИзмененииСервер()
	
	УстановитьПараметрыВыбораДоговораСЗаказчиком(Истина);
	Если Объект.ПлатежиПо275ФЗ Тогда
		ПроверитьЗаполнитьТипПлатежа275ФЗ();
		УправлениеЭлементамиОплатыЗасчетСредствГОЗ();
	КонецЕсли;
	ПриИзмененииПоставляемыхРеквизитов(Объект.БанковскийСчетПолучателя);
	
КонецПроцедуры
 
&НаСервере
Процедура ПроверитьЗаполнитьТипПлатежа275ФЗ()
	
	Если Не ЗначениеЗаполнено(Объект.ТипПлатежаФЗ275) Тогда
		ПараметрыПлатежа = Новый Структура;
		ПараметрыПлатежа.Вставить("ПлатежиПо275ФЗ", Объект.ПлатежиПо275ФЗ);
		ПараметрыПлатежа.Вставить("ХозяйственнаяОперация", ХозОперацияУП);
		ПараметрыПлатежа.Вставить("ДоговорСУчастникомГОЗ", Объект.ДоговорСУчастникомГОЗ);
		ПараметрыПлатежа.Вставить("ОплатаРасходовПоТарифамСГосрегулированием", ОплатаРасходовПоТарифамСГосрегулированием);
		ПараметрыПлатежа.Вставить("ИностранныйИсполнительВУтвержденномПеречнеГОЗ", ИностранныйИсполнительВУтвержденномПеречнеГОЗ);
		ПараметрыПлатежа.Вставить("БанковскийСчет", Объект.БанковскийСчетПолучателя);
	
		ДоступныеТипыПлатежа275ФЗ = Справочники.ТипыПлатежейФЗ275.ДоступныеТипыПлатежа275ФЗ(ПараметрыПлатежа);
		Если ДоступныеТипыПлатежа275ФЗ.Количество() Тогда
			Объект.ТипПлатежаФЗ275 = ДоступныеТипыПлатежа275ФЗ[0];
			ЗаполнитьПодтверждающиеДокументыНаСервере();
		Иначе
			Объект.ТипПлатежаФЗ275 = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольБюджетаИВзаиморасчетов

&НаКлиенте
Процедура ОтобразитьБюджетСПаузой()
	
	ОтключитьОбработчикОжидания("ОтобразитьБюжет");
	ПодключитьОбработчикОжидания("ОтобразитьБюжет", 0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьБюжет()
	
	Если НЕ ОтображатьБюджет Тогда
		Возврат;
	КонецЕсли;
	
	ОтобразитьБюджетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьБюджетНаСервере()
	
	ВыводитьСведенияОЛимитах = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
								"ВыводитьСведенияОЛимитахДляЗаявки");
	ВывестиСведенияОЛимитах(ВыводитьСведенияОЛимитах);
	
	ВыводитьСведенияОВзаиморасчетах = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
										"ВыводитьСведенияОВзаиморасчетахДляЗаявки");
	ВывестиСведенияОВзаиморасчетах(ВыводитьСведенияОВзаиморасчетах);
	
	Если НЕ ВыводитьСведенияОЛимитах И НЕ ВыводитьСведенияОВзаиморасчетах Тогда
		ТекстСообщения = НСтр("ru='Вывод сведений о лимитах и взаиморасчетах отключен в настройках пользователя'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ОтображатьБюджет = Ложь;
		Если ОтображатьБюджетПриОткрытии Тогда
			УстановитьОтображениеБюджетаПриОткрытии(ЭтотОбъект, Ложь);	
		КонецЕсли;
		УправлениеФормой();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСведенияОЛимитах(ВыводитьСведенияОЛимитах)
	
	Если НЕ ВыводитьСведенияОЛимитах Тогда
		Элементы.ГруппаБюджет.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьВозможностьРасчетаБюджета() Тогда
		Элементы.ДекорацияОшибкаРасчетаБюджета.Видимость = Истина;
		Элементы.ГруппаБюджетШапка.Видимость             = Ложь;
		Элементы.ГруппаБюджетОсновнойРаздел.Видимость    = Ложь;
		Возврат;
	Иначе
		Элементы.ДекорацияОшибкаРасчетаБюджета.Видимость = Ложь;
		Элементы.ГруппаБюджетШапка.Видимость             = Истина;
		Элементы.ГруппаБюджетОсновнойРаздел.Видимость    = Истина;
	КонецЕсли;
	
	Если НЕ Модифицированность
		И НЕ Объект.Ссылка.Пустая() Тогда
		ПараметрыРасчетаБюджета = Документы.бит_кзн_ПлатежнаяПозиция.ПодготовитьПараметрыПроведения(Объект.Ссылка, Ложь);
	Иначе
		ПараметрыРасчетаБюджета = Документы.бит_кзн_ПлатежнаяПозиция.ПодготовитьПараметрыПроведения(
									РеквизитФормыВЗначение("Объект"), Ложь);
	КонецЕсли;
	
	СтрокаОстатка   = Неопределено;
	ПериодыКонтроля = Новый Массив;
	Если ПараметрыРасчетаБюджета.ИсполнениеБюджета.Количество() > 0 Тогда
		СтрокаИсполнения           = ПараметрыРасчетаБюджета.ИсполнениеБюджета[0];
		БюджетСуммаЗаявкиПоСтатье  = СтрокаИсполнения.Сумма;
		
		ИсполнениеБюджетаПоСтатье  = ПараметрыРасчетаБюджета.ИсполнениеБюджета.СкопироватьКолонки();
		ЗаполнитьЗначенияСвойств(ИсполнениеБюджетаПоСтатье.Добавить(), СтрокаИсполнения);
		
		ИнформацияОбОстатках       = бит_КонтрольИсполненияБюджета.ПрогнозИсполненияБюджета(
										ИсполнениеБюджетаПоСтатье,
										ПараметрыРасчетаБюджета.ИсполнениеБюджетаРеквизиты);
		ПериодыКонтроля            = ИнформацияОбОстатках.ПериодыКонтроля;
		ОстаткиКонтрольныхЗначений = ИнформацияОбОстатках.ОстаткиКонтрольныхЗначений;
		Если ОстаткиКонтрольныхЗначений.Количество() > 0 Тогда
			СтрокаОстатка = ОстаткиКонтрольныхЗначений[0];
		КонецЕсли;
	КонецЕсли;
	
	НачалоПериодаКонтроля    = Неопределено;
	ОкончаниеПериодаКонтроля = Неопределено;
	
	Если СтрокаОстатка <> Неопределено Тогда 
		СтрокаОстатка                = ОстаткиКонтрольныхЗначений[0];
		БюджетСуммаБюджетаБезЗаявки  = Макс(СтрокаОстатка.Сумма, 0);
		БюджетСуммаБюджетаПоСтатье   = Макс(СтрокаОстатка.СуммаКонтроль, 0);
		БюджетСуммаИсполненныхЗаявок = Макс(СтрокаОстатка.СуммаИсполнение, 0);
		БюджетСуммаСверхЛимита       = Макс(СтрокаОстатка.СуммаСверхЛимита, 0);
		
		ПрогнозИсполненияБюджета = ИнформацияОбОстатках.ПрогнозИсполненияБюджета;
		Если ПрогнозИсполненияБюджета.Количество() > 0 Тогда  
			БюджетОстатокБюджетаПоСтатье = Макс(ПрогнозИсполненияБюджета[0].СуммаКонОстаток, 0);
		Иначе
			БюджетОстатокБюджетаПоСтатье = Макс(СтрокаОстатка.Сумма, 0);
		КонецЕсли;
		
		Для каждого ЭлементПериода Из ПериодыКонтроля Цикл
			Если СтрокаОстатка.Период >= ЭлементПериода.НачалоПериода
				И СтрокаОстатка.Период <= ЭлементПериода.КонецПериода Тогда
				НачалоПериодаКонтроля    = ЭлементПериода.НачалоПериода;
				ОкончаниеПериодаКонтроля = ЭлементПериода.КонецПериода;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НачалоПериодаКонтроля = Неопределено ИЛИ ОкончаниеПериодаКонтроля = Неопределено Тогда
			ПериодичностьКонтроля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОстатка.Сценарий,
										"ПериодичностьКонтроля");
			ПараметрыПериода      = Перечисления.бит_ПериодичностьПланирования.ПараметрыДатыПоПериодичности(
										СтрокаОстатка.Период, ПериодичностьКонтроля);
			НачалоПериодаКонтроля    = ПараметрыПериода.ДатаНачала;
			ОкончаниеПериодаКонтроля = ПараметрыПериода.ДатаОкончания;
		КонецЕсли;
		ПредставлениеПериодаПрогноза = ПредставлениеПериода(НачалоПериодаКонтроля,
															ОкончаниеПериодаКонтроля);
		ШаблонЗаголовкаБюджета = НСтр("ru='Бюджет на %1:'");
		ЗаголовокБюджета       = СтрШаблон(ШаблонЗаголовкаБюджета, ПредставлениеПериодаПрогноза);
	Иначе
		БюджетСуммаБюджетаБезЗаявки  = 0;
		БюджетСуммаБюджетаПоСтатье   = 0;
		БюджетСуммаИсполненныхЗаявок = 0;
		БюджетОстатокБюджетаПоСтатье = 0;
		БюджетСуммаСверхЛимита       = 0;
		
		ЗаголовокБюджета             = НСтр("ru='Бюджет:'");
	КонецЕсли;
	
	Элементы.ДекорацияЗаголовокСуммаБюджетаПоСтатье.Заголовок = ЗаголовокБюджета;
	Элементы.ДекорацияБюджетСуммаБюджетаПоСтатье.Заголовок    = Формат(БюджетСуммаБюджетаПоСтатье, "ЧДЦ=2; ЧН=");
	Элементы.ДекорацияСуммаБюджетаБезЗаявки.Заголовок         = Формат(БюджетСуммаБюджетаБезЗаявки, "ЧДЦ=2; ЧН=");
	
	ЕстьСвехЛимит = (БюджетСуммаСверхЛимита > 0);
	Элементы.ДекорацияСуммаСверхЛимита.Видимость = ЕстьСвехЛимит;
	Элементы.БюджетСуммаСверхЛимита.Видимость    = ЕстьСвехЛимит;
	
	ПостроитьДиаграммуБюджета();
		
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграммуБюджета()
	
	ДиаграммаБюджета.Очистить();
	ДиаграммаБюджета.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	ДиаграммаБюджета.ОбластьПостроения.ЦветФона  = ЦветаСтиля.бит_ЦветФонаПодсказки;
	ДиаграммаБюджета.АвтоТранспонирование = Ложь;
	ДиаграммаБюджета.Обновление = Ложь;
	
	Точка = ДиаграммаБюджета.УстановитьТочку(Неопределено);
	
	Серия = ДиаграммаБюджета.Серии.Добавить("СуммаЗаявки");
	Серия.Текст      = НСтр("ru='Сумма заявки'");
	Серия.Цвет       = ЦветаСтиля.бит_ЦветТочекАлгоритма;
	Серия.Раздвигать = Истина;
	ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетСуммаЗаявкиПоСтатье);
	
	Серия            = ДиаграммаБюджета.Серии.Добавить("Исполнено");
	Серия.Текст      = НСтр("ru='Исполнено'");
	Серия.Цвет       = ЦветаСтиля.бит_ЦветНедоступногоПоля;
	Серия.Раздвигать = Ложь;
	ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетСуммаИсполненныхЗаявок);
	
	Серия            = ДиаграммаБюджета.Серии.Добавить("ОстатокБюджета");
	Серия.Текст      = НСтр("ru='Остаток бюджета'");
	Серия.Цвет       = ЦветаСтиля.бит_ЦветЗаголовкаСтатуса;
	Серия.Раздвигать = Ложь;
	ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетОстатокБюджетаПоСтатье);
	
	Если БюджетСуммаСверхЛимита > 0 Тогда
		Серия            = ДиаграммаБюджета.Серии.Добавить("СверхЛимита");
		Серия.Текст      = НСтр("ru='Сверх лимита'");
		Серия.Цвет       = ЦветаСтиля.ЦветОтрицательногоЧисла;
		Серия.Раздвигать = Ложь;
		ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетСуммаСверхЛимита);
	КонецЕсли;
	
	ДиаграммаБюджета.АвтоТранспонирование = Истина;
	ДиаграммаБюджета.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьРасчетаБюджета()
	
	ИдентификаторОшибкиРасшифровкиБюджета = "";
	Элементы.ДекорацияОшибкаРасчетаБюджета.Заголовок = "";
	
	СтатьяОборотов = Объект.СтатьяОборотов;
	Если НЕ ЗначениеЗаполнено(СтатьяОборотов) Тогда
		ИдентификаторОшибкиРасшифровкиБюджета = "НеУказанаСтатьяОборотов";
		Элементы.ДекорацияОшибкаРасчетаБюджета.Заголовок = НСтр("ru = 'Не указана статья оборотов.'");
		Возврат Ложь;
	КонецЕсли;
	
	НеКонтролировать = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяОборотов, "НеКонтролировать_Заявки");
	Если НеКонтролировать Тогда
		ИдентификаторОшибкиРасшифровкиБюджета = "ОтключенКонтрольПоСтатье";
		Элементы.ДекорацияОшибкаРасчетаБюджета.Заголовок = НСтр("ru = 'Не ведется контроль по статье.'");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ВывестиСведенияОВзаиморасчетах(ВыводитьСведенияОВзаиморасчетах)
	
	Если НЕ ВыводитьСведенияОВзаиморасчетах Тогда
		Элементы.ГруппаВзаиморасчеты.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	СтруктураЗадолженности = бит_Договоры.ДанныеЗадолженности(Объект.Договор,
																	Объект.Контрагент,
																	Объект.Организация);
	ВзаиморасчетыДебиторскаяЗадолженность  = СтруктураЗадолженности.ДебиторскаяЗадолженность;
	ВзаиморасчетыКредиторскаяЗадолженность = СтруктураЗадолженности.КредиторскаяЗадолженность;
	
	Элементы.ВзаиморасчетыДебиторскаяЗадолженность.Видимость  = ВзаиморасчетыДебиторскаяЗадолженность <> 0;
	Элементы.ВзаиморасчетыКредиторскаяЗадолженность.Видимость = ВзаиморасчетыКредиторскаяЗадолженность <> 0;
	Элементы.ДекорацияВзаиморасчетыЗадолженностьОтсутствует.Видимость = (ВзаиморасчетыДебиторскаяЗадолженность = 0
																			И ВзаиморасчетыКредиторскаяЗадолженность = 0);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтображениеДекорацииОтображенияБюджетаПриОткрытии(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ОтображатьБюджетПриОткрытии Тогда
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Подсказка = НСтр("ru='Не отображать при открытии'");
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Картинка  = БиблиотекаКартинок.Закрепить;
	Иначе
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Подсказка = НСтр("ru='Отображать при открытии'");
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Картинка  = БиблиотекаКартинок.Открепить;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеБюджетаПриОткрытии(Форма, НовоеЗначение)
	
	Форма.ОтображатьБюджетПриОткрытии = НовоеЗначение;
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиПользователя",
																"ОтображатьБюджетПриОткрытии",
																НовоеЗначение);
	ОтображениеДекорацииОтображенияБюджетаПриОткрытии(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБюджета()
	
	Отбор = Новый Структура;
	Отбор.Вставить("РежимКонтроля"         , ПредопределенноеЗначение("Перечисление.бит_РежимыКонтроляПоБюджету.Заявки"));
	Отбор.Вставить("СценарийКонтролируемый", Объект.Сценарий);
	
	АналитикиОтбора = Новый Структура;
	АналитикиОтбора.Вставить("ЦФО"           , ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка"));
	АналитикиОтбора.Вставить("СтатьяОборотов", ПредопределенноеЗначение("Справочник.бит_СтатьиОборотов.ПустаяСсылка"));
	ШаблонАналитики = "Аналитика_%1";
	Для НомерАналитики = 1 По 12 Цикл
		АналитикиОтбора.Вставить(СтрШаблон(ШаблонАналитики, НомерАналитики), Неопределено);
	КонецЦикла;
	
	Для каждого Аналитика Из АналитикиОтбора Цикл
		ИмяАналитики = Аналитика.Ключ;
		Если ЗначениеЗаполнено(Объект[ИмяАналитики]) Тогда
			ЗначенияОтбора = Новый СписокЗначений;
			ЗначенияОтбора.Добавить(Объект[ИмяАналитики]);
			ЗначенияОтбора.Добавить(Аналитика.Значение);
			Отбор.Вставить(ИмяАналитики, ЗначенияОтбора);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Отбор",                     Отбор);
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии",   Истина);
	ПараметрыОтчета.Вставить("Заголовок",                 НСтр("ru='Контрольные значения бюджета по заявкам'"));
	ДополнитьПараметрыРасшифровкиБюджета(ПараметрыОтчета, Отбор);
	
	ОткрытьФорму("Отчет.бит_КонтрольныеЗначенияБюджета.Форма", ПараметрыОтчета, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьПараметрыРасшифровкиБюджета(ПараметрыОтчета, Отбор)
	
	КомпоновщикНастроек = Отчеты.бит_КонтрольныеЗначенияБюджета.Создать().КомпоновщикНастроек;
	Настройки           = КомпоновщикНастроек.Настройки;
	
	ПериодКонтроля   = Новый СтандартныйПериод(НачалоПериодаКонтроля, ОкончаниеПериодаКонтроля);
	
	ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ЭлементНастройки.Значение = ПериодКонтроля;
	Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
									ЭлементНастройки.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = ЭлементНастройки.Значение;
		КонецЕсли;
	КонецЕсли;
	
	ОтборСотрудник = Новый ПолеКомпоновкиДанных("Сотрудник");
	Для каждого ЭлементНастройки Из Настройки.Отбор.Элементы Цикл
		ИмяПоляОтбора = Строка(ЭлементНастройки.ЛевоеЗначение);
		Если НЕ Отбор.Свойство(ИмяПоляОтбора) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеОтбора = Отбор[ИмяПоляОтбора];
		Если ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") Тогда
			ЭлементНастройки.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		Иначе
			ЭлементНастройки.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		ЭлементНастройки.ПравоеЗначение = ЗначениеОтбора;
		ЭлементНастройки.Использование  = Истина;
		
		Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
			ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
										ЭлементНастройки.ИдентификаторПользовательскойНастройки);
			Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				ПользовательскийПараметр.ВидСравнения   = ЭлементНастройки.ВидСравнения;
				ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение;
				ПользовательскийПараметр.Использование  = ЭлементНастройки.Использование;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОтчета.Вставить("Вариант",                   Настройки);
	ПараметрыОтчета.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ДокументДолженБытьОформленБезНДС()

	ОперацияБезНДС = бит_Казначейство.ОперацияБезНДС(Объект.ХозяйственнаяОперация);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОбъектаДляНазначенияПлатежа()
	
	РасшифровкаПлатежа.Очистить();
	НоваяСтрока = РасшифровкаПлатежа.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Объект);
	НоваяСтрока.Сумма = Объект.СуммаДокумента;
	
	ПараметрыОбъекта = Документы.бит_кзн_ПлатежнаяПозиция.НовыеПараметрыОбъектаДляНазначенияПлатежа();
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект,, "Ссылка");
	
	ПараметрыОбъекта.ХозяйственнаяОперация 	 = ХозОперацияУП;
	ПараметрыОбъекта.ПодотчетноеЛицо		 = Объект.ФизЛицо;
	ПараметрыОбъекта.Валюта					 = Объект.ВалютаДокумента;
	ПараметрыОбъекта.ПодтверждающиеДокументы = Объект.ПодтверждающиеДокументы.Выгрузить();
	ПараметрыОбъекта.РасшифровкаПлатежа 	 = РасшифровкаПлатежа;

	Возврат ПараметрыОбъекта;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНазначениеПлатежаСервер()

	ПараметрыОбъекта = ПараметрыОбъектаДляНазначенияПлатежа();
	ДенежныеСредстваСервер.ЗаполнитьТекстНазначенияПлатежа(ПараметрыОбъекта);
	
	Если Объект.НазначениеПлатежа <> ПараметрыОбъекта.НазначениеПлатежа Тогда
		Объект.НазначениеПлатежаУпр = ПараметрыОбъекта.НазначениеПлатежа;
	КонецЕсли;
	Объект.НазначениеПлатежа = ПараметрыОбъекта.НазначениеПлатежа;
	
КонецПроцедуры

&НаСервере
Процедура КодВидаДоходаПоУмолчанию()
	
	КонтрагентЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ЮрФизЛицо");
	бит_КазначействоКлиентСервер.КодВидаДоходаПоУмолчанию(Объект, ХозОперацияУП, КонтрагентЮрФизЛицо);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКодовВидаДохода()
	
	Элементы.КодВидаДохода.СписокВыбора.Очистить();
	
	ВыплатаЗарплаты = (ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета
						Или ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту);
	ДатаКодов = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	СписокВыбора = ПлатежиВБюджетКлиентСервер.КодыВидовДохода(ДатаКодов, ВыплатаЗарплаты);
		
	Для каждого ЭлементСписка Из СписокВыбора Цикл
		Элементы.КодВидаДохода.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКорректностьЗаполненияПлатежаВБюджет()
	
	ТекущаяДата = ?(ЗначениеЗаполнено(Объект.ДатаПлан), Объект.ДатаПлан, ТекущаяДатаСеанса());
	
	// Модель формы для совместимости с ЕРП.
	СвойстваФормы = Новый Структура;
	СвойстваФормы.Вставить("ГруппаТипНалога",			Элементы.ГруппаТипНалога);
	СвойстваФормы.Вставить("ТипНалога",					Элементы.ТипНалога);
	СвойстваФормы.Вставить("Контрагент",				Элементы.Контрагент);
	СвойстваФормы.Вставить("БанковскийСчетКонтрагента", Элементы.БанковскийСчетПолучателя);

	СвойстваОбъекта = Новый Структура;
	СвойстваОбъекта.Вставить("Организация", 			  Объект.Организация);
	СвойстваОбъекта.Вставить("ТипНалога", 				  Объект.ТипНалога);
	СвойстваОбъекта.Вставить("Контрагент", 				  Объект.Контрагент);
	СвойстваОбъекта.Вставить("БанковскийСчетКонтрагента", Объект.БанковскийСчетПолучателя);
	
	Форма = Новый Структура("Элементы, Объект", СвойстваФормы, СвойстваОбъекта);
	ПлатежиВБюджет.ПроверитьКорректностьЗаполненияПлатежаВБюджет(Форма, ТекущаяДата);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВозможноВзысканиеСПеречисленияФизлицу(Дата, ВидОперации, КонтрагентЮрФизЛицо)
	
	Возврат бит_КазначействоКлиентСервер.ВозможноВзысканиеСПеречисленияФизлицу(Дата, 
				ВидОперации, КонтрагентЮрФизЛицо);
	
КонецФункции
 
// Процедура является обработчиком ожидания, отслеживает окончание транзакции записи/проведения документа.
//
&НаКлиенте
Процедура ОжиданиеПроведенияДокумента()
	
	ОтключитьОбработчикОжидания("ОжиданиеПроведенияДокумента");
	
	УстановитьВидимостьКнопкиОплатитьЗаСчет();
	
КонецПроцедуры

//  Процедура выполняет окончательные действия процедуры "ОплатаЗаСчет".
//
&НаКлиенте
Процедура ОплатаЗаСчетЗавершение()

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", 	Объект.ДокументПланирования);
	ДанныеЗаполнения.Вставить("Сценарий", 			Объект.Сценарий);
	ДанныеЗаполнения.Вставить("ВидКорректировки", 	ПредопределенноеЗначение("Перечисление.бит_ВидыКорректировокКонтрольныхЗначений.ЗаСчет"));
	ДанныеЗаполнения.Вставить("АдресДанныхДляКорректировки", АдресДанныхДляКорректировки);
	
	ПараметрыФормы = Новый Структура("Основание", ДанныеЗаполнения);
	ОткрытьФорму("Документ.бит_КорректировкаКонтрольныхЗначений.ФормаОбъекта", ПараметрыФормы, 
		ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ЗаполнитьКонтролируемыеРеквизиты(Форма)
	
	НаборРеквизитов = Новый Структура;
	НаборРеквизитов.Вставить("ДатаПлан");
	НаборРеквизитов.Вставить("ДатаПланКрайняя");
	НаборРеквизитов.Вставить("ВалютаДокумента");
	НаборРеквизитов.Вставить("ОбъектРасчетов");
	НаборРеквизитов.Вставить("Организация");
	НаборРеквизитов.Вставить("БанковскийСчет");
	НаборРеквизитов.Вставить("ФормаОплаты");
	НаборРеквизитов.Вставить("ХозяйственнаяОперация");
	НаборРеквизитов.Вставить("Контрагент");

	ЗаполнитьЗначенияСвойств(НаборРеквизитов, Форма.Объект);
	
	Форма.КонтролируемыеРеквизиты = Новый ФиксированнаяСтруктура(НаборРеквизитов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ОбновитьКонтролируемыеРеквизиты(ИмяРеквизита, Форма)
	
	НаборРеквизитов = Новый Структура;
	Для каждого КлючЗначение Из Форма.КонтролируемыеРеквизиты Цикл
		НаборРеквизитов.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла; 
	НаборРеквизитов.Вставить(ИмяРеквизита, Форма.Объект[ИмяРеквизита]);
	
	Форма.КонтролируемыеРеквизиты = Новый ФиксированнаяСтруктура(НаборРеквизитов);	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормыДокумента()
	
	НомерДата			 = "";
	ПредставлениеОбъекта = "";
	
	РеквизитыЗаявки = Новый Структура("Номер, Дата", "", '0001-01-01');
	Если ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда
		РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументПланирования, "Номер, Дата");
	КонецЕсли;
	
	Если Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.Прогноз") Тогда 		
		Если ЭтоРежимЗаявки Тогда 			
			ПредставлениеОбъекта = НСтр("ru='Прогноз платежа%1';en='Payment Forecast%1'");
		Иначе	                                			
			ПредставлениеОбъекта = НСтр("ru='Платежная позиция%1';en='Payment Record%1'");			
		КонецЕсли; 
		НомерДата = НомерДата(Объект.Ссылка, Объект.Номер, Объект.Дата);
	ИначеЕсли Объект.ВидПлана = ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.План") Тогда		
		Если ЭтоРежимЗаявки Тогда  			
			ПредставлениеОбъекта = НСтр("ru='Заявка на расходование средств%1';en='Request for Disbursement%1'"); 
			НомерДата = НомерДата(Объект.Ссылка, РеквизитыЗаявки.Номер, Объект.Дата);
		Иначе	   			
			ПредставлениеОбъекта = НСтр("ru='Платежная позиция%1';en='Payment Record%1'");
			НомерДата = НомерДата(Объект.Ссылка, Объект.Номер, Объект.Дата);
		КонецЕсли;            		
	ИначеЕсли ЭтоЗаявкаНаПеремещение Тогда  		
		ПредставлениеОбъекта =  НСтр("ru='Заявка на перемещение денежных средств%1';en='Application for the movement of funds%1'");
		НомерДата = НомерДата(Объект.Ссылка, РеквизитыЗаявки.Номер, Объект.Дата);
	ИначеЕсли ЭтоЗаявкаНаПереводСредств Тогда   		
		ПредставлениеОбъекта =  НСтр("ru='Заявка на перевод денежных средств в другую организацию%1';
								 |en='Application for transfer of funds to another organization%1'");
		НомерДата = НомерДата(Объект.Ссылка, РеквизитыЗаявки.Номер, Объект.Дата);
	КонецЕсли; 
	ПредставлениеОбъекта = СтрШаблон(ПредставлениеОбъекта, НомерДата);

	ПараметрыЗаголовка = Новый Структура;
	ПараметрыЗаголовка.Вставить("ПредставлениеОбъекта", ПредставлениеОбъекта);
	ПараметрыЗаголовка.Вставить("СтрокаВидаОперации"  , "");
	ПараметрыЗаголовка.Вставить("ЭтоНовый"			  , Объект.Ссылка.Пустая());
	ПараметрыЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиентСервер.УстановитьЗаголовокФормыДокумента(ЭтотОбъект, ПараметрыЗаголовка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКнопкиОплатитьЗаСчет()
	
	ПоказатьОплатаЗаСчет = Ложь;
	
	Если ЭтоАдресВременногоХранилища(АдресДанныхДляКорректировки) Тогда
		Результат = ПолучитьИзВременногоХранилища(АдресДанныхДляКорректировки);
		Если ТипЗнч(Результат) = Тип("Структура") Тогда
			ЕстьДанныеКорректировки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, 
										"ЕстьДанныеКорректировки", Ложь);
			Если ЕстьДанныеКорректировки И НЕ Объект.СверхБюджета Тогда
				ПоказатьОплатаЗаСчет = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ОплатаЗаСчет.Видимость = ПоказатьОплатаЗаСчет;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ИзмеренияДоп"      , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним"));
	КэшЗначений.Вставить("НастройкиИзмерений", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НомерДата(Ссылка, Номер, Дата)

	НомерДата = "";
	Если ЗначениеЗаполнено(Ссылка) Тогда
		НомерДата = " " + НСтр("ru = '%1 от %2'; en = '%1 from %2'");
		НомерДата = СтрШаблон(НомерДата, Номер, Дата);
	КонецЕсли;
	
	Возврат НомерДата;

КонецФункции

&НаСервере
Процедура УправлениеФормой()
	
	бит_НастройкиДоступностиЭлементовФормКлиентСервер.РазблокироватьЭлементы(ЭтотОбъект);

	ДокументВВалюте = Объект.ВалютаДокумента <> ВалютаРеглУчета;	
	ОплатаЧерезБанк = (Объект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные);
	ХозОперация		= Объект.ХозяйственнаяОперация;

	// Платежи по 275-ФЗ
	Если ПоддержкаПлатежей275ФЗ И ЭтоРежимЗаявки Тогда		
		Элементы.ПлатежиПо275ФЗ.Видимость = Истина;
	Иначе	
		Элементы.ПлатежиПо275ФЗ.Видимость = Ложь;
	КонецЕсли; 
	
	Элементы.СтраницаОплатаЗаСчетСредств.Видимость	   = (Объект.ПлатежиПо275ФЗ И ЭтоРежимЗаявки);
	Элементы.СтраницаПодтверждающиеДокументы.Видимость = (Объект.ПлатежиПо275ФЗ И ЭтоРежимЗаявки);
	
	// Налоги.
	Элементы.ГруппаНалоги.Видимость = ЭтоЗаявкаНаРасходование;
	
	#Область НДС
	Элементы.СтавкаНДС.Видимость = НЕ ОперацияБезНДС;
	Элементы.СуммаНДС.Видимость	 = НЕ ОперацияБезНДС;
	Элементы.ВалютаНДС.Видимость = НЕ ОперацияБезНДС;
	
	Если НЕ ОперацияБезНДС Тогда
		Элементы.СтавкаНДС.Доступность = ЭтоЗаявкаНаРасходование;
		Элементы.СуммаНДС.Доступность  = ЭтоЗаявкаНаРасходование;
	КонецЕсли;
	#КонецОбласти 

	Элементы.НДФЛПоВедомостям.Видимость = (ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеВБюджет);
	
	ЭтоОперацияВыплатыЗП  = бит_КазначействоКлиентСервер.ЭтоОперацияВыплатыЗарплаты(ХозОперация);
	ЭтоВыдачаПодотчетнику = (ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствПодотчетнику);
	ЭтоПередачаДенег	  = бит_КазначействоКлиентСервер.ЭтоОперацияПередачиДенег(ХозОперация);
	
	ЭтоОперацияБезВалютыВзаиморасчетов = бит_КазначействоКлиентСервер.ЭтоОперацияБезВалютыВзаиморасчетов(ХозОперация);

	Элементы.ПериодАвансовогоОтчета.Видимость    = (ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствПодотчетнику);
	Элементы.ДатаАвансовогоОтчета.Видимость      = (ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствПодотчетнику);
	Элементы.ДатаАвансовогоОтчета.ТолькоПросмотр = НЕ ПериодАвансовогоОтчетаДата;
	
	Элементы.Ведомость.Видимость                       = (ЭтоОперацияВыплатыЗП И ИспользоватьНачислениеЗарплаты) ИЛИ Объект.НДФЛПоВедомостям;
	Элементы.НомерВедомостиНаВыплатуЗарплаты.Видимость = ЭтоОперацияВыплатыЗП И (НЕ ИспользоватьНачислениеЗарплаты);
	Элементы.ДатаВедомостиНаВыплатуЗарплаты.Видимость  = ЭтоОперацияВыплатыЗП И (НЕ ИспользоватьНачислениеЗарплаты);
									
	ПеречисленияГосОргану = Новый Массив;
	ПеречисленияГосОргану.Добавить(Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеВБюджет);
	ПеречисленияГосОргану.Добавить(Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеТаможне);
	ПеречисленияГосОргану.Добавить(Перечисления.бит_ВидыОперацийКазначейства.ПрочаяВыдачаДенежныхСредств);
	
	Элементы.НадписьРеквизитыПлательщика.Видимость = (ПеречисленияГосОргану.Найти(ХозОперация) <> Неопределено) И ОплатаЧерезБанк;
	
	#Область ГруппаПрочийРасход
	Элементы.ГруппаПрочийРасход.Видимость  = 
		(Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПрочаяВыдачаДенежныхСредств);
	Если ТипЗнч(Объект.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
		Элементы.АналитикаРасходов.Видимость 		= Ложь;
		Элементы.АналитикаАктивовПассивов.Видимость = Истина;
	Иначе
		Элементы.АналитикаРасходов.Видимость 		= Истина;
		Элементы.АналитикаАктивовПассивов.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.АналитикаРасходов.Доступность		  = ЗначениеЗаполнено(Объект.СтатьяРасходов);
	Элементы.АналитикаАктивовПассивов.Доступность = ЗначениеЗаполнено(Объект.СтатьяРасходов);

	Элементы.АналитикаРасходов.ОграничениеТипа = 
		Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(Объект.АналитикаРасходов)));
	Элементы.АналитикаАктивовПассивов.ОграничениеТипа = 
		Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(Объект.АналитикаАктивовПассивов)));
	#КонецОбласти 

	Элементы.ГруппаДекорацияПредупреждения.Видимость = ЗаявкаВключенаВРеестр;
	
	Если ЭтоЗаявкаНаРасходование Тогда
		
		ЭтоПрогноз     = Объект.ВидПлана = Перечисления.бит_кзн_ВидыПланов.Прогноз;
		ПарамВидимости = бит_Казначейство.ПодготовитьПараметрыВидимости(ХозОперация);
		
		ЕстьПравоНаСписание = ПравоДоступа("Редактирование", Метаданные.Документы.СписаниеБезналичныхДенежныхСредств)
			ИЛИ ПравоДоступа("Редактирование", Метаданные.Документы.РасходныйКассовыйОрдер);
		
		//Если ввод не списком, показываем номер заявки, а не позиции.
		Элементы.Номер.Видимость	   = НЕ ЭтоРежимЗаявки;
		Элементы.НомерЗаявки.Видимость = ЭтоРежимЗаявки;
		
		// Устанавливаем видимость команд группы СоздатьНаОсновании.
		Элементы.ФормаВвестиЗаявку.Видимость 			= ЭтоПрогноз;
		Элементы.ФормаВвестиПлатежныйДокумент.Видимость = НЕ ЭтоПрогноз И ЕстьПравоНаСписание;  
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"ФормаВозвратЛимита", "Видимость", НЕ ЭтоПрогноз);
		
		// Не даем возможность выбирать документ планирования.
		Элементы.ДокументПланирования.Видимость = НЕ ЭтоРежимЗаявки;
		
		Если Объект.ПлатежиПо275ФЗ И ЭтоРежимЗаявки Тогда
			Элементы.ФормаОплаты.ТолькоПросмотр = Истина;
		Иначе	
			Элементы.ФормаОплаты.ТолькоПросмотр = НЕ ЭтоРежимЗаявки;
		КонецЕсли;
		
		// Реквизиты, заполняемые в документе-основании.
		Элементы.Организация.ТолькоПросмотр       	  = НЕ ЭтоРежимЗаявки;
		Элементы.Контрагент.ТолькоПросмотр        	  = НЕ ЭтоРежимЗаявки;
		Элементы.Сценарий.ТолькоПросмотр          	  = НЕ ЭтоРежимЗаявки;
		Элементы.Важность.ТолькоПросмотр          	  = НЕ ЭтоРежимЗаявки;
		Элементы.Ответственный.ТолькоПросмотр     	  = НЕ ЭтоРежимЗаявки;
		Элементы.Инициатор.ТолькоПросмотр         	  = НЕ ЭтоРежимЗаявки;
		Элементы.ФизЛицо.ТолькоПросмотр       	  	  = НЕ ЭтоРежимЗаявки;
		Элементы.ХозяйственнаяОперация.ТолькоПросмотр = НЕ ЭтоРежимЗаявки;
		
		Элементы.СверхБюджета.ТолькоПросмотр 			= НЕ ЭтоРежимЗаявки;
		Элементы.СверхБюджета.ЦветТекстаЗаголовка		= ?(Объект.СверхБюджета, ЦветаСтиля.ЦветОсобогоТекста, Новый Цвет);
		Элементы.СверхБюджета.Видимость				    = НЕ ЭтоПрогноз;

		#Область Валюты
		ВалютыСовпадают 				   = Объект.ВалютаДокумента = Объект.ВалютаВзаиморасчетов;
		ЗаблокироватьВалюту 			   = Истина;
		ЗаблокироватьВалютуВзаиморасчетов  = Ложь;
		ИсточникВалютыВзаиморасчетовВыбран = ЗначениеЗаполнено(Объект.ОбъектРасчетов) 
										 ИЛИ ЗначениеЗаполнено(Объект.Договор);										 
		
		Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
			ЗаблокироватьВалюту = Истина;
		Иначе	
			Если НЕ ЭтоРежимЗаявки Тогда
				ЗаблокироватьВалюту = Истина;
			Иначе	
				ЗаблокироватьВалюту = ИсточникВалютыВзаиморасчетовВыбран;
			КонецЕсли;
		КонецЕсли;	
		
		Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов Тогда
			ЗаблокироватьВалютуВзаиморасчетов = Истина;	
		Иначе	
			ЗаблокироватьВалютуВзаиморасчетов = ИсточникВалютыВзаиморасчетовВыбран;
		КонецЕсли;		
		
		Элементы.СуммаВзаиморасчетов.ТолькоПросмотр    			= ВалютыСовпадают;
		Элементы.СуммаВзаиморасчетов.Видимость					= НЕ ЭтоОперацияБезВалютыВзаиморасчетов; 
		Элементы.Валюта.ТолькоПросмотр 							= ЗаблокироватьВалюту;
		Элементы.ВариантКурсаДоговора.Видимость 	   			= НЕ ВалютыСовпадают;
		Элементы.КурсЧислительВзаиморасчетов.Видимость 			= НЕ ВалютыСовпадают;
		Элементы.КурсЗнаменательВзаиморасчетовНадпись.Видимость = НЕ ВалютыСовпадают;
		Элементы.ДекорацияВалютыИКурсПлатежа.Видимость 			= НЕ ВалютыСовпадают;
		Элементы.ВалютаВзаиморасчетов.ТолькоПросмотр 			= ЗаблокироватьВалютуВзаиморасчетов;		
		Элементы.ВалютаВзаиморасчетов.Видимость		 			= НЕ ЭтоОперацияБезВалютыВзаиморасчетов;
		Элементы.ПланированиеСуммы.ТолькоПросмотр	 			= ЭтоОперацияБезВалютыВзаиморасчетов 
															  ИЛИ НЕ ЭтоРежимЗаявки;
		#КонецОбласти
		
		// Переход в список имеет смысл только если позиция открыта как псевдо-заявка.
		Элементы.ФормаКомандаСписок.Видимость = ЭтоРежимЗаявки;
		
		// Видимость Банк/Касса.
		Элементы.БанковскийСчет.Видимость = ОплатаЧерезБанк;
		Элементы.Касса.Видимость 		  = НЕ ОплатаЧерезБанк;
		
		Элементы.ОрганизацияПолучатель.Видимость 	= ЭтоПередачаДенег;
		Элементы.БанковскийСчетПолучатель.Видимость = ЭтоПередачаДенег И ОплатаЧерезБанк;
		Элементы.КассаПолучатель.Видимость 			= ЭтоПередачаДенег И НЕ ОплатаЧерезБанк;
		
		Если ЭтоПередачаДенег Тогда
			УстановитьПараметрыВыбораБанковскогоСчетаКассыПолучателя();
		КонецЕсли;

		// Видимость Контрагент/Договор/ФизЛицо.
		Элементы.Контрагент.Видимость	  = ПарамВидимости.ЕстьКонтрагент ИЛИ (ОплатаЧерезБанк И ПеречислениеСотрудникуЧерезБанк);
		Элементы.ОбъектРасчетов.Видимость = ПарамВидимости.ЕстьОбъектРасчетов;
		
		Элементы.Партнер.Видимость 	 = ИспользоватьПартнеровИКонтрагентов И ПарамВидимости.ЕстьПартнер;
		Элементы.Партнер.Доступность = НЕ (ЗначениеЗаполнено(Объект.ОбъектРасчетов)
										ИЛИ ЗначениеЗаполнено(Объект.ДоговорАренды)
										ИЛИ ЗначениеЗаполнено(Объект.ДоговорКредитаДепозита));		
		
		Если ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты
			ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоКредитам
			ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты   
			ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаЗаймов Тогда 			
			Элементы.ДоговорКредитаДепозита.Видимость = Истина;
			Элементы.ДоговорАренды.Видимость 	 	   = Ложь;	
			Элементы.ДоговорЭквайринга.Видимость 	   = Ложь;
		ИначеЕсли ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаАрендодателю Тогда			
			Элементы.ДоговорКредитаДепозита.Видимость = Ложь;
			Элементы.ДоговорАренды.Видимость		   = Истина;
			Элементы.ДоговорЭквайринга.Видимость 	   = Ложь;
		ИначеЕсли ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВозвратОплатыНаПлатежнуюКарту Тогда
			Элементы.ДоговорКредитаДепозита.Видимость = Ложь;
			Элементы.ДоговорАренды.Видимость		   = Ложь;
			Элементы.ДоговорЭквайринга.Видимость 	   = Истина;
		Иначе	
			Элементы.ДоговорКредитаДепозита.Видимость = Ложь;
			Элементы.ДоговорАренды.Видимость 		   = Ложь;
			Элементы.ДоговорЭквайринга.Видимость 	   = Ложь;
		КонецЕсли; 
		
		Элементы.ТипПлатежаПоАренде.Видимость = Элементы.ДоговорАренды.Видимость; 
		
		Если ИспользоватьПодразделения
			И (ЭтоВыдачаПодотчетнику
			ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыПоЗарплатномуПроекту 
			ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыНаЛицевыеСчета
			ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаЗаймаСотруднику 
			ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ПрочаяВыдачаДенежныхСредств) Тогда			
			Элементы.Подразделение.Видимость = Истина;			
		Иначе
			Элементы.Подразделение.Видимость = ИспользоватьПодразделения;
		КонецЕсли;	                                                      		
		
		Если ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаЗаймаСотруднику Тогда 			
			Элементы.ДоговорЗаймаСотруднику.Видимость = Истина;			
		Иначе
			Элементы.ДоговорЗаймаСотруднику.Видимость = Ложь;
		КонецЕсли;	
		
		// Видимость Банковский счет получателя.
		Если ОплатаЧерезБанк Тогда
			Если ПарамВидимости.ЕстьКонтрагент
			 ИЛИ ЭтоВыдачаПодотчетнику
			 ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыНаЛицевыеСчета 
	 		 ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаЗаймаСотруднику Тогда
				Элементы.БанковскийСчетПолучателя.Видимость = Истина;
			Иначе
				Элементы.БанковскийСчетПолучателя.Видимость = Ложь;
			КонецЕсли;
		Иначе	
			Элементы.БанковскийСчетПолучателя.Видимость = Ложь;	
		КонецЕсли;
		
		Если ОплатаЧерезБанк И ПарамВидимости.ФизЛицо Тогда
			 Если ПеречислениеСотрудникуЧерезБанк Тогда
				 ЗаголовокКонтрагент = НСтр("ru = 'Банк-получатель'; en = 'Recipient Bank'");
			 Иначе	
				 ЗаголовокКонтрагент = НСтр("ru = 'Получатель'; en = 'Recipient'");
			 КонецЕсли;
		Иначе	
			ЗаголовокКонтрагент = НСтр("ru = 'Получатель'; en = 'Recipient'");
		КонецЕсли;
		Элементы.Контрагент.Заголовок = ЗаголовокКонтрагент;
				
		Если ЭтоВыдачаПодотчетнику Тогда
			ЗаголовокФизЛица = НСтр("ru = 'Подотчетное лицо'; en = 'Accountable person'");
		Иначе	
			ЗаголовокФизЛица = НСтр("ru = 'Работник'; en = 'Worker'");
		КонецЕсли;
		Элементы.ФизЛицо.Заголовок 		= ЗаголовокФизЛица;
		Элементы.ФизЛицо.Видимость 		= ПарамВидимости.ФизЛицо;
		Элементы.ФизЛицо.ТолькоПросмотр = Объект.СписокФизЛиц;
		
		Элементы.ЛицевыеСчетаСотрудников.Видимость 		= Объект.СписокФизЛиц;
		Элементы.СписокФизЛицОтключено.Видимость   		= ЭтоВыдачаПодотчетнику И ПеречислениеСотрудникуЧерезБанк;
		Элементы.СписокФизЛицВключено.Видимость	  		= ЭтоВыдачаПодотчетнику И ПеречислениеСотрудникуЧерезБанк;
		Элементы.ГруппаРеквизитыОбменаСБанком.Видимость	= Объект.СписокФизЛиц;
		ОтображениеЗаголовкаПоляПодотчетноеЛицо();
		
		Элементы.ПеречислениеСотрудникуЧерезБанк.Видимость 		= ПарамВидимости.ФизЛицо И ОплатаЧерезБанк;
		Элементы.ПеречислениеСотрудникуЧерезБанк.ТолькоПросмотр = Объект.СписокФизЛиц;
				
		Элементы.ФормаПровестиИЗакрыть.Видимость         = РазрешеноПроводить И ЭтоРежимЗаявки;
		Элементы.ФормаПровести.Видимость                 = РазрешеноПроводить И ЭтоРежимЗаявки;
		Элементы.ФормаПровестиИЗакрыть.КнопкаПоУмолчанию = РазрешеноПроводить И ЭтоРежимЗаявки;
		
		ТекстЗаголовка = ?(Объект.ОтправленНаСогласование, 
						   НСтр("ru='Отозвать';en='Revoke'"), НСтр("ru='На согласование';en='For Approval'"));
		
		Элементы.ФормаКомандаНаСогласование.Видимость         = НЕ РазрешеноПроводить И ЭтоРежимЗаявки;
		Элементы.ФормаКомандаНаСогласование.КнопкаПоУмолчанию = НЕ РазрешеноПроводить И ЭтоРежимЗаявки;
		Элементы.ФормаКомандаНаСогласование.Заголовок         = ТекстЗаголовка;
		Элементы.ФормаКомандаНаСогласование.Доступность       = НЕ Объект.Проведен;	

		// Управление доступностью команды создать на основании.
		Если ТипСтатуса <> Перечисления.бит_ТипыСтатусовОбъектов.Утвержден
			И ТипСтатуса <> Перечисления.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен 
			И ТипСтатуса <> Перечисления.бит_ТипыСтатусовОбъектов.ВРеестре Тогда
			Элементы.ФормаВвестиПлатежныйДокумент.Доступность = Ложь;
			Элементы.ФормаВвестиЗаявку.Доступность			  = Ложь;
		Иначе
			Элементы.ФормаВвестиПлатежныйДокумент.Доступность = Истина И НЕ ЭтоПрогноз;
			Элементы.ФормаВвестиЗаявку.Доступность			  = ЭтоПрогноз; 
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
				"ФормаВозвратЛимита", "Доступность", НЕ ЭтоПрогноз);
		КонецЕсли;
		
		// Проверка заполнения Банковского счета.
		ДоговорОбъектаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчетов, "Договор");
		Элементы.БанковскийСчет.АвтоОтметкаНезаполненного = НЕ ЗначениеЗаполнено(ДоговорОбъектаРасчетов);
		Элементы.БанковскийСчет.ОтметкаНезаполненного     = НЕ ЗначениеЗаполнено(ДоговорОбъектаРасчетов);
				
		УправлениеПоказателямиПлатежаВБюджет();
		
	Иначе
		
		Элементы.БанковскийСчет.ТолькоПросмотр  =  Истина;
		Элементы.Касса.ТолькоПросмотр			=  Истина;
		
		Элементы.БанковскийСчет.Видимость = ОплатаЧерезБанк;
		Элементы.БанковскийСчет.Заголовок = НСтр("ru = 'Отправитель'");
		Элементы.Касса.Видимость 		  = НЕ ОплатаЧерезБанк;
		Элементы.Касса.Заголовок		  = НСтр("ru = 'Отправитель'");
		
		Элементы.БанковскийСчет.АвтоОтметкаНезаполненного = Истина;
		Элементы.Касса.АвтоОтметкаНезаполненного		  = Истина;
		
		Элементы.ОрганизацияПолучатель.Видимость 	= Ложь;
		Элементы.БанковскийСчетПолучатель.Видимость = Ложь;
		Элементы.КассаПолучатель.Видимость 			= Ложь;

		// Синхронизируемые реквизиты.
		Элементы.ДокументПланирования.ТолькоПросмотр  =  Истина;
		Элементы.ХозяйственнаяОперация.ТолькоПросмотр =  Истина;
		Элементы.Организация.ТолькоПросмотр			  =  Истина;
		Элементы.Важность.ТолькоПросмотр 			  =  Истина;
		
		Элементы.СуммаДокумента.ТолькоПросмотр		 			=  Истина;
		Элементы.СуммаВзаиморасчетов.Видимость    				= Ложь;
		Элементы.ВариантКурсаДоговора.Видимость 	   			= Ложь;
		Элементы.КурсЧислительВзаиморасчетов.Видимость 			= Ложь;
		Элементы.КурсЗнаменательВзаиморасчетовНадпись.Видимость = Ложь;
		Элементы.ДекорацияВалютыИКурсПлатежа.Видимость 			= Ложь;
		Элементы.ВалютаВзаиморасчетов.Видимость		 			= Ложь;
		Элементы.ПланированиеСуммы.Видимость	 				= Ложь;		
		Элементы.Валюта.ТолькоПросмотр	 						= Истина;	
		
		Элементы.ЦФО.ТолькоПросмотр					=  НЕ ЭтоЗаявкаНаПереводСредств;
		Элементы.ФормаОплаты.ТолькоПросмотр			= Истина;
		Элементы.Сценарий.Видимость 				= Ложь;
		Элементы.СверхБюджета.ТолькоПросмотр 		= Истина;
		Элементы.СписатьЛимиты.ТолькоПросмотр 		= Истина;
		Элементы.Контрагент.Видимость				= Ложь;
		Элементы.Партнер.Видимость					= Ложь;
		Элементы.БанковскийСчетПолучателя.Видимость = Ложь;
		Элементы.ОбъектРасчетов.Видимость 			= Ложь;
		Элементы.ТипПлатежа.Видимость 				= Ложь;
		Элементы.ФизЛицо.Видимость 					= Ложь;
		Элементы.ДоговорКредитаДепозита.Видимость 	= Ложь;
		Элементы.ДоговорАренды.Видимость 			= Ложь;
		Элементы.ТипПлатежаПоАренде.Видимость 		= Ложь;
		Элементы.ДоговорЭквайринга.Видимость		= Ложь;
		Элементы.Подразделение.Видимость 			= Ложь;
		
		Элементы.ПеречислениеСотрудникуЧерезБанк.Видимость 	 = Ложь;
		
		Элементы.СписокФизЛицОтключено.Видимость    	= ЭтоВыдачаПодотчетнику;
		Элементы.СписокФизЛицВключено.Видимость	    	= ЭтоВыдачаПодотчетнику;
		Элементы.ЛицевыеСчетаСотрудников.Видимость		= ЭтоВыдачаПодотчетнику;
		Элементы.ГруппаРеквизитыОбменаСБанком.Видимость	= Объект.СписокФизЛиц;

		// Скрываем команды.
		Элементы.ФормаКомандаСписок.Видимость 			  = Ложь;
		Элементы.ФормаРезультатПроведенияКнопка.Видимость = Ложь;
		Элементы.ФормаКомандаНаСогласование.Видимость 	  = Ложь;
		Элементы.ФормаВвестиЗаявку.Видимость			  = Ложь;
		Элементы.ФормаВвестиПлатежныйДокумент.Видимость   = Ложь;
		Элементы.ФормаВвестиЗаявку.Доступность			  = Ложь;
		
		Элементы.ФормаПровестиИЗакрыть.Видимость         = Ложь;
		Элементы.ФормаПровести.Видимость                 = Ложь;
		Элементы.ФормаПровестиИЗакрыть.КнопкаПоУмолчанию = Ложь;

		Если НЕ ЭтоВыдачаПодотчетнику Тогда
			Счетчик 		  = 12;
			ПоказатьАналитики = Ложь;
			Пока Счетчик >= 1 Цикл
				ИмяЭлемента = "Аналитика_" + Счетчик;
				ПоказатьАналитики = Макс(Элементы[ИмяЭлемента].Видимость, ПоказатьАналитики);	
				Счетчик = Счетчик - 1;
			КонецЦикла;
			Если ПоказатьАналитики Тогда
				Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
			Иначе	
				Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
			КонецЕсли;
		Иначе
			Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.СписатьЛимиты.Видимость   		   = Элементы.СверхБюджета.Видимость И НеУчитыватьСверхБюджета;
	Элементы.СписатьЛимиты.Доступность 		   = Объект.СверхБюджета;
	Элементы.ТипСуммыКредитаДепозита.Видимость = (ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоКредитам);

	Если (ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию
		И ИспользоватьДоговорыМеждуОрганизациями 
	  ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ВозвратОплатыКлиенту 
		И ИспользоватьДоговорыСКлиентами 
  	  ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоставщику
		И ИспользоватьДоговорыСПоставщиками
	  ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию
		И ИспользоватьДоговорыМеждуОрганизациями
	  ИЛИ ХозОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеТаможне
		И ИспользоватьДоговорыСПоставщиками) Тогда
		
		Элементы.Договор.Видимость		= Истина;
		Элементы.Договор.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ОбъектРасчетов);	
	Иначе
		Элементы.Договор.Видимость = Ложь;
	КонецЕсли;
												  
	Элементы.ГруппаФинансовогоУчета.Видимость  = ИспользоватьГруппыФинансовогоУчета И Элементы.Договор.Видимость 
													И НЕ ЗначениеЗаполнено(Объект.ОбъектРасчетов);
	Элементы.НаправлениеДеятельности.Видимость = Элементы.Договор.Видимость И НЕ ЗначениеЗаполнено(Объект.ОбъектРасчетов);
												// И ИспользоватьУчетЗатратПоНаправлениямДеятельности;
	
	Элементы.ДокументОснование.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Элементы.ГруппаПлатежныеДокументы.Видимость = ПравоДоступа("Просмотр", Метаданные.Документы.СписаниеБезналичныхДенежныхСредств)
		ИЛИ ПравоДоступа("Просмотр", Метаданные.Документы.РасходныйКассовыйОрдер);
		
	Если ОтображатьБюджет Тогда
		Элементы.ДекорацияОтобразитьБюджетКартинка.Картинка     = БиблиотекаКартинок.бит_ПерейтиВниз;
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Видимость = Истина;
		Элементы.ГруппаБюджетИВзаиморасчетыРазделы.Видимость    = Истина;
	Иначе
		Элементы.ДекорацияОтобразитьБюджетКартинка.Картинка     = БиблиотекаКартинок.бит_ПерейтиВправо;
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Видимость = Ложь;
		Элементы.ГруппаБюджетИВзаиморасчетыРазделы.Видимость    = Ложь;
	КонецЕсли;
	ОтображениеДекорацииОтображенияБюджетаПриОткрытии(ЭтотОбъект);
		
	бит_НастройкиДоступностиЭлементовФормКлиентСервер.ЗаблокироватьЭлементы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокГруппы(Форма, НазваниеГруппы, ТекстЗаголовка)

	Форма.Элементы[НазваниеГруппы].ЗаголовокСвернутогоОтображения = ТекстЗаголовка;

КонецПроцедуры // УстановитьЗаголовокГруппы()
 
&НаСервере
Процедура ФормаОплатыПриИзмененииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ФормаОплаты) Тогда
		Объект.ФормаОплаты = КонтролируемыеРеквизиты.ФормаОплаты; 
	КонецЕсли; 

	Если КонтролируемыеРеквизиты.ФормаОплаты = Объект.ФормаОплаты Тогда
		Возврат;
	КонецЕсли; 

	УстановитьПараметрыВыбораВидаОперации(ЭтотОбъект);
		
	ДоступныеЗначения = ДоступныеЗначенияВидовОпераций();
	Если ДоступныеЗначения.НайтиПоЗначению(Объект.ХозяйственнаяОперация) = Неопределено Тогда
		Объект.ХозяйственнаяОперация = ДоступныеЗначения[0].Значение;
		ХозяйственнаяОперацияПриИзмененииНаСервере();
	Иначе
		УправлениеФормой();
	КонецЕсли; 

	ЗаполнитьКонтролируемыеРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ХозяйственнаяОперацияПриИзмененииНаСервере()

	ХозОперацияУП	= ХозяйственнаяОперацияУП();
	ОплатаЧерезБанк = (Объект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные);
	
	ВзаиморасчетыСервер.ПриИзмененииПараметровМеханизма(ЭтотОбъект);
	
	Объект.Партнер = Неопределено;
	
	ПарамВидимости = бит_Казначейство.ПодготовитьПараметрыВидимости(Объект.ХозяйственнаяОперация);
	Если НЕ ПарамВидимости.ЕстьКонтрагент Тогда	
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли; 
	
	Если ПарамВидимости.ЕстьПартнер Тогда
		Объект.Партнер = ДенежныеСредстваСервер.ПолучитьПартнераПоКонтрагенту(Объект.Контрагент, ХозОперацияУП);	
	КонецЕсли;
	
	Если НЕ ПарамВидимости.ЕстьДоговор Тогда	
		Объект.Договор		  = Неопределено;
	КонецЕсли;
	
	Если НЕ ПарамВидимости.ЕстьОбъектРасчетов Тогда
		Объект.ОбъектРасчетов = Неопределено;
	КонецЕсли;
			
	Если НЕ ПарамВидимости.ФизЛицо Тогда	
		Объект.ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли; 

	Если НЕ СчетСоответствуетВладельцу() Тогда
		Объект.БанковскийСчетПолучателя = Неопределено;
	КонецЕсли;
	
	ЭтоОперацияБезВалютыВзаиморасчетов = бит_КазначействоКлиентСервер.ЭтоОперацияБезВалютыВзаиморасчетов(Объект.ХозяйственнаяОперация);
	Если ЭтоОперацияБезВалютыВзаиморасчетов Тогда
		Объект.ПланированиеСуммы 		   	 = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа;	
		Объект.ВалютаВзаиморасчетов 	   	 = Объект.ВалютаДокумента;
		Объект.КурсЧислительВзаиморасчетов	 = 1;
		Объект.КурсЗнаменательВзаиморасчетов = 1;
		Объект.СуммаДокумента				 = Объект.СуммаВзаиморасчетов;

		ПланированиеСуммыПриИзмененииНаСервере();
	КонецЕсли;
	
	Объект.ОбъектРасчетов = Неопределено;
	ОбъектРасчетовПриИзмененииНаСервере();
	
	УстановитьПараметрыВыбораБанковскийСчетПолучателя();
	УстановитьПараметрыВыбораТипаНалогов();
	УстановитьПараметрыВыбораОрганизацииПолучателя();
	УстановитьПараметрыВыбораПартнера();
	УстановитьЗаголовокЭлементаПартнер();
	
	Объект.Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();

	Если ХозОперацияУП <> Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
		Объект.НДФЛПоВедомостям = Ложь;
	КонецЕсли;
	
	Если НЕ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
		И НЕ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию Тогда
		Объект.ДоговорСУчастникомГОЗ = Ложь;
	КонецЕсли;
	
	Если ОплатаЧерезБанк Тогда
		Если НЕ (ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту
			ИЛИ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета
			ИЛИ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
			ИЛИ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
			ИЛИ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств) Тогда
				Объект.КодВидаДохода = "";
		КонецЕсли;
	Иначе	
		Объект.КодВидаДохода = "";
	КонецЕсли;

	Если НЕ (ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту
		ИЛИ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета) Тогда
		Объект.КодВыплат = "";
	КонецЕсли;
		
	Если ХозОперацияУП <> Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств Тогда
		Объект.СтатьяРасходов 			= Неопределено;
		Объект.АналитикаРасходов 		= Неопределено;
		Объект.АналитикаАктивовПассивов = Неопределено;
	КонецЕсли;
	
	Объект.СписокФизЛиц = Ложь;
	СписокФизЛиц 		= 0;

	УстановитьВидимостьАналитик();
	
	ЗаполнитьРеквизитыПлательщика();
	УстановитьНадписьРеквизитыПлательщика();
	
	ЗаполнитьПоказателиПлатежаВБюджетПоУмолчаниюСервер(Истина);
	
	ДокументДолженБытьОформленБезНДС();
	ЗаполнитьСписокКодовВидаДохода();
	КодВидаДоходаПоУмолчанию();
    УправлениеФормой();
	
	Если НЕ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
		И НЕ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию Тогда
		Объект.ДоговорСУчастникомГОЗ = Ложь;
	КонецЕсли;
	
	ПроверитьЗаполнитьТипПлатежа275ФЗ();
	
	ПараметрыОбъекта = ПараметрыУстановитьСтавкуНДС();
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, ЭтотОбъект);
	УстановитьСтавкуНДС(ПараметрыОбъекта);
	Объект.СтавкаНДС = ПараметрыОбъекта.СтавкаНДС;
	РассчитатьСуммуНДС();
	
	ПроверитьИОчиститьОрганизациюПолучатель();

	НастроитьСчетаУчета();
	ОбновитьКонтролируемыеРеквизиты("ХозяйственнаяОперация", ЭтотОбъект);
	ОбновитьКонтролируемыеРеквизиты("ОбъектРасчетов", ЭтотОбъект);
	
КонецПроцедуры
 
&НаСервере
Функция ДоступныеЗначенияВидовОпераций()
	
	Модуль = Перечисления.бит_ВидыОперацийКазначейства;
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("ФормаОплаты", Объект.ФормаОплаты);
	ПараметрыПередачи.Вставить("ТипДокумента", ТипЗнч(Объект.ДокументПланирования));
	
	Возврат Модуль.ПолучитьДоступныеЗначения(ПараметрыПередачи).ДоступныеЗначения;
	
КонецФункции

&НаСервере
Функция ПараметрыУстановитьСтавкуНДС()

	ПараметрыУстановки = Новый Структура;
	ПараметрыУстановки.Вставить("СтавкаНДС", 			  Неопределено);
	ПараметрыУстановки.Вставить("СтатьяОборотов", 		  Неопределено);
	ПараметрыУстановки.Вставить("СтавкаНДСДоговора", 	  Неопределено);
	ПараметрыУстановки.Вставить("ОперацияБезНДС", 		  Ложь);
	ПараметрыУстановки.Вставить("ПричинаИзмененияСтатья", Ложь);
	
	Возврат ПараметрыУстановки; 

КонецФункции

&НаСервере
Процедура УстановитьСтавкуНДС(ПараметрыОбъекта)
	
	Если ПараметрыОбъекта.ОперацияБезНДС Тогда
		ПараметрыОбъекта.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	Иначе	
		Если ЗначениеЗаполнено(ПараметрыОбъекта.СтатьяОборотов) И ПараметрыОбъекта.ПричинаИзмененияСтатья Тогда
			ПараметрыОбъекта.СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОбъекта.СтатьяОборотов, "СтавкаНДС");
		КонецЕсли; 
		Если ЗначениеЗаполнено(ПараметрыОбъекта.СтавкаНДСДоговора) Тогда
			ПараметрыОбъекта.СтавкаНДС = ПараметрыОбъекта.СтавкаНДСДоговора;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуНДС()
	
	ЗначениеСтавки  = бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(Объект.СтавкаНДС);
	Объект.СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Объект.СуммаДокумента, 
						Истина, Истина, ЗначениеСтавки);

КонецПроцедуры

&НаСервере
Процедура СтатьяОборотовПриИзмененииНаСервере(ИзменитьСтавкуНДС = Истина)

	УстановитьВидимостьАналитик();
	
	РеквизитыОбъекта = РеквизитыОбъектаДляПодстановкиВАналитики();
	Для каждого Значение Из РеквизитыОбъекта Цикл
		ПриИзмененииПоставляемыхРеквизитов(Значение);
	КонецЦикла;
	ПриИзмененииПоставляемыхРеквизитов(Объект.СтатьяОборотов);
	
	Если ИзменитьСтавкуНДС Тогда
		ПараметрыОбъекта = ПараметрыУстановитьСтавкуНДС();
		ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
		ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, ЭтотОбъект);
		ПараметрыОбъекта.ПричинаИзмененияСтатья = ИзменитьСтавкуНДС;
		УстановитьСтавкуНДС(ПараметрыОбъекта);
		Объект.СтавкаНДС = ПараметрыОбъекта.СтавкаНДС;
		РассчитатьСуммуНДС();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РеквизитыОбъектаДляПодстановкиВАналитики()
		
	Возврат Документы.бит_кзн_ПлатежнаяПозиция.РеквизитыОбъектаДляПодстановкиВАналитики(Объект);	

КонецФункции

//  Выполняет очистку виз документа. 
//
&НаСервере
Процедура ОчиститьВсеВизы()
	
	Если ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда		
		бит_ВизированиеСервер.ОчиститьВсеВизыБезусловно(Объект.ДокументПланирования);		
	КонецЕсли; 
	
КонецПроцедуры // ОчиститьВсеВизы()

&НаСервере
Функция  СоздатьПлатежныйДокумент()
		
	ДанныеЗаполнения = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.НовыеПараметрыДокументаСоздатьПлатежныеДокументы(); 
	ДанныеЗаполнения.Дата = Объект.ДатаПлан;
	
	НоваяСтрока = ДанныеЗаполнения.Позиции.Добавить();
	НоваяСтрока.Позиция = Объект.Ссылка;	

	Результат = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.СоздатьДокументыНаОсновеВыделенных(
					Объект.ДокументПланирования, ДанныеЗаполнения);
					
	УстановитьСсылкиНаДокументыОплаты();
	
	Возврат Результат.ВыгрузитьКолонку("ДокументОплаты");
		
КонецФункции

//  Процедура определяет документы оплаты и устанвливает ссылки на них в форму.
//
// Параметры:
//
&НаСервере
Процедура УстановитьСсылкиНаДокументыОплаты()

	ДокументыОплаты = НайтиДокументыОплаты();
	
	ЭлементыКУдалению = Новый Массив;
	Для каждого Элемент Из Элементы.ГруппаПлатежныеДокументы.ПодчиненныеЭлементы Цикл
		ЭлементыКУдалению.Добавить(Элемент);
	КонецЦикла;
	
	Для каждого Элемент Из ЭлементыКУдалению Цикл
		Элементы.Удалить(Элемент);	
	КонецЦикла;
	
	Индекс = 1;
	Для Каждого Документ Из ДокументыОплаты Цикл
		ИмяЭлемента = "Документ" + Индекс;
		Элемент = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Элементы.ГруппаПлатежныеДокументы);
		Элемент.Гиперссылка = Истина;
		Элемент.Заголовок = Документ.Ссылка;
		Элемент.РастягиватьПоГоризонтали = Истина;
		Элемент.РастягиватьПоВертикали = Ложь;
		Элемент.ВысотаЗаголовка = 1;
		Элемент.УстановитьДействие("Нажатие", "Подключаемый_ДокументОплатыНажатие");
		Индекс = Индекс+1;
	КонецЦикла;
	
КонецПроцедуры // ОпределитьДокументыОплаты()

//  Функция возвращает массив с документами оплаты по позиции.
//
// Возвращаемое значение:
//  ДокументыОплаты - Массив.
//
&НаСервере
Функция НайтиДокументыОплаты()

	ДокументыОплаты = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		ДокументыОплаты = Документы.бит_кзн_ПлатежнаяПозиция.НайтиДокументыОплатыПоПозиции(Объект.Ссылка);	
	КонецЕсли; 

	Возврат ДокументыОплаты;
	
КонецФункции // НайтиДокументыОплаты()

// Процедура заполняет сценарий при изменении поля документа. 
// 
// Параметры: 
//  Имя - Строка.
//
&НаСервере
Процедура ЗаполнитьСценарий(Имя)

	СтруктураПараметров = Новый Структура;
	Если Имя = "Организация" Тогда		
		СтруктураПараметров.Вставить("Организация", Объект.Организация);		
	ИначеЕсли Имя = "ЦФО" Тогда 		
		СтруктураПараметров.Вставить("ЦФО", Объект.ЦФО);		
	КонецЕсли; 
	
	КонтролироватьЗаявку = бит_НастройкиПрограммы.КонтролироватьЗаявкуПоБюджету(СтруктураПараметров, Объект.Дата);
	Сценарий = бит_НастройкиПрограммы.КазначействоСценарийКонтроляПоБюджету(СтруктураПараметров, Объект.Дата);
	
	Если ЗначениеЗаполнено(Сценарий) И КонтролироватьЗаявку Тогда	
		Объект.Сценарий = Сценарий;	
	КонецЕсли; 
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.ЦФО);

КонецПроцедуры // ЗаполнитьСценарий()

&НаСервере
Процедура УстановитьПараметрыВыбораОрганизацияКонтрагент(ИмяЭлемента)

	Если ТипЗнч(Объект[ИмяЭлемента]) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		ИЛИ (бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды()
			 И ТипЗнч(Объект[ИмяЭлемента]) = Тип("СправочникСсылка.ДоговорыАренды"))
		ИЛИ ТипЗнч(Объект[ИмяЭлемента]) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
	
		НоваяСвязь1 = Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация");
		НоваяСвязь2 = Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.Контрагент");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь1);
		НовыйМассив.Добавить(НоваяСвязь2);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		Элементы[ИмяЭлемента].СвязиПараметровВыбора = НовыеСвязи;
	Иначе 
		НовыеСвязи = Новый ФиксированныйМассив(Новый Массив());
		Элементы[ИмяЭлемента].СвязиПараметровВыбора = НовыеСвязи;
	КонецЕсли;	
		
КонецПроцедуры

//  Процедура обрабатывает изменение договора. 
//
&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
								 
	РеквизитыДоговора = Новый Структура; 
	РеквизитыДоговора.Вставить("БанковскийСчет");
	РеквизитыДоговора.Вставить("бит_ЦФО");
	РеквизитыДоговора.Вставить("бит_ОсновнаяСтатьяОборотов");
	РеквизитыДоговора.Вставить("бит_Проект");
	РеквизитыДоговора.Вставить("ВалютаВзаиморасчетов");
	РеквизитыДоговора.Вставить("НаправлениеДеятельности");
	РеквизитыДоговора.Вставить("ГруппаФинансовогоУчета");
	
	Если ТипЗнч(Объект.Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
		РеквизитыДоговора.Вставить("ВариантКурсаДоговора");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, 
								Новый ФиксированнаяСтруктура(РеквизитыДоговора));
	КонецЕсли;
						 
	Если НЕ ЗначениеЗаполнено(Объект.ЦФО) 
		И ЗначениеЗаполнено(РеквизитыДоговора.бит_ЦФО) Тогда
		Объект.ЦФО = РеквизитыДоговора.бит_ЦФО; 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.СтатьяОборотов) 
		И ЗначениеЗаполнено(РеквизитыДоговора.бит_ОсновнаяСтатьяОборотов) Тогда
		Если РеквизитыДоговора.бит_ОсновнаяСтатьяОборотов.РасходДоход = Перечисления.бит_РасходДоход.Расходование Тогда
			Объект.СтатьяОборотов = РеквизитыДоговора.бит_ОсновнаяСтатьяОборотов;
			СтатьяОборотовПриИзмененииНаСервере(Ложь);
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектРасчетов) И ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.ВалютаВзаиморасчетов	   = РеквизитыДоговора.ВалютаВзаиморасчетов;
		Объект.НаправлениеДеятельности = РеквизитыДоговора.НаправлениеДеятельности;
		Объект.ГруппаФинансовогоУчета  = РеквизитыДоговора.ГруппаФинансовогоУчета;
		
		ЗаполнитьКурсВзаиморасчетов();
		РассчитатьСуммуВзаиморасчетов();
		СформироватьКурсЗнаменательТекстом();
		ЗаполнитьВалютуВзаиморасчетовДокумента();
		УстановитьПараметрыВыбораБанковскийСчетКасса();
		
		ПриИзмененииПоставляемыхРеквизитов(Объект.ГруппаФинансовогоУчета);
		ПриИзмененииПоставляемыхРеквизитов(Объект.НаправлениеДеятельности);

		Если ТипЗнч(Объект.Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
			ВариантКурсаДоговора = РеквизитыДоговора.ВариантКурсаДоговора;	
		КонецЕсли;
	Иначе
		Объект.ГруппаФинансовогоУчета  = Неопределено;
		Объект.НаправлениеДеятельности = Неопределено;
	КонецЕсли;
		
	// Заполним проект из договора.
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ПриИзмененииПоставляемыхРеквизитов(РеквизитыДоговора.бит_Проект);
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ПриИзмененииПоставляемыхРеквизитов(Объект.Договор);
	Иначе
		ПриИзмененииПоставляемыхРеквизитов(Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	КонецЕсли;
		
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораБанковскийСчетПолучателя()
	
	СвязиПараметровВыбора = Новый Массив;
	
	Если ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
	 ИЛИ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета 
	 ИЛИ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику Тогда		
		Если Объект.ПеречислениеСотрудникуЧерезБанк Тогда
			СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент"));
		Иначе
			СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.ФизЛицо"));
		КонецЕсли;
	Иначе	
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент"));
	КонецЕсли;	
	
	НовыеСвязи = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	Элементы.БанковскийСчетПолучателя.СвязиПараметровВыбора = НовыеСвязи;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораБанковскийСчетКасса()

	Если ТипЗнч(Объект.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		ОтборОрганизация = Новый Массив();
		ОтборОрганизация.Добавить(Объект.Организация);
		Если Объект.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию Тогда
			ОтборОрганизация.Добавить(Объект.Организация.ГоловнаяОрганизация);
		КонецЕсли; 
		ПараметрыОтбора = Новый ФиксированныйМассив(ОтборОрганизация);
		ПараметрВыбораОрганизация  = Новый ПараметрВыбора("Отбор.Владелец", ПараметрыОтбора);
		
		// Формирование итогового отбора.
		ОтборИтог = Новый Массив;
		ОтборИтог.Добавить(ПараметрВыбораОрганизация);
		
		Если НЕ ЭтоРежимЗаявки И Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
			ПараметрВыбораВалюта = Новый ПараметрВыбора("Отбор.ВалютаДенежныхСредств", Объект.ВалютаДокумента);		
			ОтборИтог.Добавить(ПараметрВыбораВалюта);	
		КонецЕсли;
		
		НовыеПараметры = Новый ФиксированныйМассив(ОтборИтог);

	Иначе	
		НовыеПараметры = бит_Казначейство.УстановитьОтборыДляБанковскихСчетовКасс(Объект.Организация, 
							Объект.ВалютаДокумента, Объект.ДокументПланирования, ВалютаРеглУчета);
	КонецЕсли;
	
	Элементы.БанковскийСчет.ПараметрыВыбора = НовыеПараметры;
	Элементы.Касса.ПараметрыВыбора			= НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораТипПлатежаПоАренде()

	// См. Документ.СписаниеБезналичныхДенежныхСредств.Форма.ФормаДокумента: 
	// РасшифровкаПлатежаДоговорАрендыПриИзмененииСервер().
	
	Элементы.ТипПлатежаПоАренде.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);

	НовыеПараметры = Новый Массив;
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Договор", Объект.ДоговорАренды);
	НовыеПараметры.Добавить(НовыйПараметр);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Платеж", Истина);
	НовыеПараметры.Добавить(НовыйПараметр);
	
	Элементы.ТипПлатежаПоАренде.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораТипаНалогов()
	
	ТекущаяДата = ?(ЗначениеЗаполнено(Объект.ДатаПлан), Объект.ДатаПлан, ТекущаяДатаСеанса());
	Если НЕ ПлатежиВБюджет.ИспользуетсяЕдиныйНалоговыйПлатеж(Объект.Организация, ТекущаяДата) Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеТипыНалогов = Новый Массив;
	ДоступныеТипыНалогов.Добавить(Справочники.ВидыНалоговВзносов.ПрочиеНалогиИСборы);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДоступныеТипыНалогов, ПлатежиВБюджет.ТипыНалоговУплачиваемыеОтдельно());
	
	ПараметрыВыбораНалогов = Новый Массив;
	ПараметрыВыбораНалогов.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ДоступныеТипыНалогов));
	Элементы.ТипНалога.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораНалогов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораОрганизацииПолучателя()
	
	НовыеПараметры = Новый Массив;
	
	Если Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВнутренняяПередачаДенежныхСредств Тогда
		
		НовыеПараметры.Добавить(Новый ПараметрВыбора("РежимВыбораВзаимосвязанныхОрганизаций", "ТолькоВзаимосвязанные"));
		НовыеПараметры.Добавить(Новый ПараметрВыбора("Организация", Объект.Организация));
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию
		ИЛИ Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию Тогда
		
		НовыеПараметры.Добавить(Новый ПараметрВыбора("РежимВыбораВзаимосвязанныхОрганизаций", "ТолькоНеВзаимосвязанные"));
		НовыеПараметры.Добавить(Новый ПараметрВыбора("Организация", Объект.Организация));
		
	КонецЕсли;
	
	Элементы.ОрганизацияПолучатель.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораПартнера()

	ПараметрыОбъекта = Новый Структура("ХозяйственнаяОперация", ХозОперацияУП);
	ДенежныеСредстваСервер.УстановитьПараметрыВыбораПартнера(Объект, Элементы.Партнер);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораГруппыФинансовогоУчета()
	
	НовыеПараметры = Новый Массив;
	НовыеПараметры.Добавить(Новый СвязьПараметраВыбора("Отбор.Договор", "Объект.Договор", РежимИзмененияСвязанногоЗначения.Очищать));
	НовыеПараметры.Добавить(Новый СвязьПараметраВыбора("Отбор.ХозяйственнаяОперация", "ХозОперацияУП", РежимИзмененияСвязанногоЗначения.Очищать));

	Элементы.ГруппаФинансовогоУчета.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыеПараметры);
	
КонецПроцедуры

// Заполняет данные выбора во время автоподбора аналитики по введенному тексту.
//
// Параметры:
//  ДанныеВыбора - СписокЗначений - Список значений для заполнения.
//  Текст 		 - Строка - Текст, введенный в поле.
//  Отбор 		 - Структура - Отбор по реквизитам справочников договоров.
//  ТипДоговора  - Тип - Тип ссылки договора.
//
&НаСервереБезКонтекста
Процедура АналитикаПолучениеДанныхВыбора(ДанныеВыбора, Текст, Отбор, ТипДоговора)
	
	ДанныеВыбора = Новый СписокЗначений;
	бит_МеханизмДопИзмерений.ЗаполнитьДанныеВыбораАналитикиДоговоров(ДанныеВыбора, Текст, Отбор, ТипДоговора);
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
		
	Объект.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
	Объект.Договор		  = Неопределено;
		
	УстановитьПараметрыВыбораДоговораСЗаказчиком(Истина);
	УстановитьПараметрыВыбораБанковскийСчетПолучателя();
	УправлениеЭлементамиОплатыЗасчетСредствГОЗ();
	УправлениеФормой();
	КодВидаДоходаПоУмолчанию();
	УстановитьПараметрыВыбораТипПлатежаПоАренде();
	
	Объект.Партнер = ДенежныеСредстваСервер.ПолучитьПартнераПоКонтрагенту(Объект.Контрагент, ХозОперацияУП);
	
	Если НЕ СчетСоответствуетВладельцу() Тогда
		Объект.БанковскийСчетПолучателя = Неопределено;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчетПолучателя) Тогда
		Объект.БанковскийСчетПолучателя =
				Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(Объект.Контрагент, Объект.ВалютаДокумента);		
	КонецЕсли;
		
	Объект.ПеречислениеСотрудникуЧерезБанк = ЗначениеЗаполнено(Объект.Контрагент)
												И (Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствПодотчетнику
												ИЛИ Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыНаЛицевыеСчета
												ИЛИ Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаЗаймаСотруднику);
	ПеречислениеСотрудникуЧерезБанк = Число(Объект.ПеречислениеСотрудникуЧерезБанк);
	
	ОбновитьКонтролируемыеРеквизиты("Контрагент", ЭтотОбъект);
	ОбновитьКонтролируемыеРеквизиты("ОбъектРасчетов", ЭтотОбъект);
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.Контрагент);
	ПриИзмененииПоставляемыхРеквизитов(Объект.ОбъектРасчетов);
	ПриИзмененииПоставляемыхРеквизитов(Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	ПриИзмененииПоставляемыхРеквизитов(Объект.БанковскийСчетПолучателя);
	ПроверитьКорректностьЗаполненияПлатежаВБюджет();
	
КонецПроцедуры

&НаСервере
Процедура ФизЛицоПриИзмененииНаСервере()
	
	//++ НЕ УТ
	Если НЕ СчетСоответствуетВладельцу() Тогда
		Объект.БанковскийСчетПолучателя = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчетПолучателя)
			И НЕ Объект.ПеречислениеСотрудникуЧерезБанк Тогда
			Объект.БанковскийСчетПолучателя =
				Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(Объект.ФизЛицо, Объект.ВалютаДокумента);
		КонецЕсли;
	КонецЕсли;
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.ФизЛицо);
	//-- НЕ УТ
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПлательщика()
	
	РеквизитыПлательщика = ДенежныеСредстваСерверЛокализация.РеквизитыПлательщика(Объект);
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыПлательщика);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьРеквизитыПлательщика()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		НадписьРеквизитыПлательщика = ДенежныеСредстваСерверЛокализация.НадписьРеквизитыПлательщика(
			Объект.ИННПлательщика, Объект.КПППлательщика, Объект.ТекстПлательщика, ЮрФизЛицо, ХозОперацияУП);
	Иначе
		НадписьРеквизитыПлательщика = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ХозяйственнаяОперацияУП()

	Возврат бит_КазначействоКлиентСервер.ХозяйственнаяОперацияУП(Объект.ХозяйственнаяОперация);
	
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗаполнитьКэшЗначений();

	Пользователь	   = Пользователи.ТекущийПользователь();
	РазрешеноПроводить = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(Пользователь, 
							ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноПроводитьЗаявкиНаРасходованиеДС);

	ТекущаяДата 					= ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	ДатаНачалаПримененияПриказа107н = Константы.ДатаНачалаПримененияПриказа107н.Получить();
	ПрименениеПриказа107н 			= ТекущаяДата >= ДатаНачалаПримененияПриказа107н;
	ДатаНачалаПримененияПриказа126н = Константы.ДатаНачалаПримененияПриказа126н.Получить();
	ПрименениеПриказа126н 			= ДатаНачалаПримененияПриказа126н <> '00010101' И ТекущаяДата >= ДатаНачалаПримененияПриказа126н;

	ЭтоЗаявкаНаПеремещение	  = ТипЗнч(Объект.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств");
	ЭтоЗаявкаНаПереводСредств = ТипЗнч(Объект.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию");
	ЭтоЗаявкаНаРасходование	  = НЕ ЭтоЗаявкаНаПеремещение И НЕ ЭтоЗаявкаНаПереводСредств;
	
	УстановитьЭтоРежимЗаявки();
			
	Если ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда		
		НомерЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументПланирования, "Номер");		
	КонецЕсли;
		
	ХозОперацияУП = ХозяйственнаяОперацияУП();
	Если НЕ бит_ОбщегоНазначения.ЭтоУТ() Тогда
		ИспользоватьНачислениеЗарплаты = ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплатыУТ");
		// Изменено наименование функциональной опции для релиза 2.5.10.
		ПоддержкаПлатежей275ФЗ = ПолучитьФункциональнуюОпцию("ПоддержкаБанковскогоИКазначейскогоСопровожденияГосконтрактов");
		
		ОплатаНДСВБюджетПоОтдельнымОперациям = (Объект.ТипНалога = Справочники.ВидыНалоговВзносов.НДС_ВвозимыеТовары
			ИЛИ Объект.ТипНалога = Справочники.ВидыНалоговВзносов.НДС_НалоговыйАгент);
	КонецЕсли;

	ТоварыРаботыУслугиСТарифнымРегулированием.Загрузить(ОбщегоНазначения.ПрочитатьXMLВТаблицу(
		Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолучитьМакет("ТоварыРаботыУслугиСТарифнымРегулированием").ПолучитьТекст()).Данные);
	
	Если Объект.ПлатежиПо275ФЗ И ЗначениеЗаполнено(Объект.ДоговорСЗаказчиком)
		И ТипЗнч(Объект.ДоговорСЗаказчиком) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДоговорСЗаказчиком,
			"ОплатаРасходовПоТарифамСГосрегулированием, ИностранныйИсполнительВУтвержденномПеречнеГОЗ, ГосударственныйКонтракт");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов);
	КонецЕсли;	
	
	ЗаполнитьСписокКодовВидаДохода();
	УстановитьПараметрыВыбораВидаОперации(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо", Истина);
	КонецЕсли;
	УстановитьНадписьРеквизитыПлательщика();
	
	СписокФизЛиц = Число(Объект.СписокФизЛиц);
	
	//++ НЕ УТ 
	ПараметрыНастройки = Документы.бит_кзн_ПлатежнаяПозиция.ПараметрыНастройкиСчетовУчета(
							Объект.ХозяйственнаяОперация, Объект.ТипНалога);
	НастройкаСчетовУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ПараметрыНастройки);
	//-- НЕ УТ 

	ДенежныеСредстваСервер.ЗаполнитьСписокВыбораПериодовАвансовогоОтчета(ЭтотОбъект, Объект.Дата);
	ПериодАвансовогоОтчетаДата = (ТипЗнч(ПериодАвансовогоОтчета) = Тип("Дата"));

	Если ЭтоЗаявкаНаПереводСредств Тогда
		ОрганизацияПолучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументПланирования, "ОрганизацияПолучатель");
	КонецЕсли;
	
	ИспользоватьДоговорыСПоставщиками	   = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками");
	ИспользоватьДоговорыМеждуОрганизациями = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыМеждуОрганизациями");
	ИспользоватьДоговорыСКлиентами		   = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	ИспользоватьПодразделения			   = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	НоваяАрхитектураВзаиморасчетов 		   = ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	ИспользоватьПартнеровИКонтрагентов	   = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов");
	ИспользоватьГруппыФинансовогоУчета	   = ПолучитьФункциональнуюОпцию("ИспользоватьГруппыФинансовогоУчета");
	НеУчитыватьСверхБюджета				   = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	ВалютаРеглУчета						   = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ИспользоватьУчетЗатратПоНаправлениямДеятельности = ПолучитьФункциональнуюОпцию("ИспользоватьУчетЗатратПоНаправлениямДеятельности");

	ПеречислениеСотрудникуЧерезБанк = Число(Объект.ПеречислениеСотрудникуЧерезБанк);

	ЗаполнитьКурсВзаиморасчетов(Истина);
	ДокументДолженБытьОформленБезНДС();
	
	// Найти документы оплаты если таковые имеются.
	УстановитьСсылкиНаДокументыОплаты();
			
	УстановитьПараметрыВыбораБанковскийСчетКасса();
	УстановитьПараметрыВыбораБанковскийСчетПолучателя();
	УстановитьПараметрыВыбораТипПлатежаПоАренде();
	УстановитьПараметрыВыбораТипаНалогов();
	УстановитьПараметрыВыбораОрганизацииПолучателя();
	УстановитьПараметрыВыбораПартнера();
	УстановитьЗаголовокЭлементаПартнер();
	УстановитьПараметрыВыбораГруппыФинансовогоУчета();
	
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияНаФорме(ЭтотОбъект,
		КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	                                                                             	
	УстановитьВидимостьАналитик();
	
	УстановитьПараметрыВыбораДоговораСЗаказчиком();
	УстановитьПараметрыВыбораСтатьиРасходов();
	
	ЗаполнитьКонтролируемыеРеквизиты(ЭтотОбъект);

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ПолучитьФункциональнуюОпцию("бит_ЗапретитьИзменениеЗаявкиВключеннойВРеестр") Тогда
			ЗаявкаВключенаВРеестр = бит_Казначейство.ЗаявкаВключенаВРеестр(Объект.ДокументПланирования);
		Иначе
			ЗаявкаВключенаВРеестр = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЗаголовокГруппыДанныеОбменаСБанком();	
	УстановитьСостояниеДокумента();
	УстановитьЗаголовокФормыДокумента();
	ПроверитьКорректностьЗаполненияПлатежаВБюджет();
	
	ЗаполнитьВалютуВзаиморасчетовДокумента();
	
	Элементы.ГруппаБюджетИВзаиморасчеты.Видимость = ВидимостьПанелиКонтроля();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭтоРежимЗаявки()
	
	Перем РезультатПоиска;
	
	Если ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда
		Если ТипЗнч(Объект.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
			РезультатПоиска = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(Объект.ДокументПланирования);
			Если РезультатПоиска.КоличествоПозиций = 0 Тогда
				ЭтоРежимЗаявки = Истина;
			Иначе	
				Если ЗначениеЗаполнено(Объект.Ссылка) И РезультатПоиска.КоличествоПозиций = 1 Тогда
					ЭтоРежимЗаявки = Истина;
				Иначе	
					ЭтоРежимЗаявки = Ложь;
				КонецЕсли;
			КонецЕсли;
		Иначе	
			ЭтоРежимЗаявки = Ложь;
		КонецЕсли;
	Иначе	
		ЭтоРежимЗаявки = Истина;	
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьПараметрыВыбораВидаОперации(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	НовыеПараметры = Новый Массив; 
	НовыеПараметры.Добавить(Новый ПараметрВыбора("Отбор.ФормаОплаты", Объект.ФормаОплаты));
	Если Объект.ДокументПланирования <> Неопределено Тогда
		НовыеПараметры.Добавить(Новый ПараметрВыбора("Отбор.ТипДокумента", ТипЗнч(Объект.ДокументПланирования)));
	КонецЕсли;
	
	Элементы.ХозяйственнаяОперация.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Функция ДоступныеПорядкиРасчетов()
	СписокПорядков = Новый СписокЗначений;
	СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказам"));
	СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным"));
	СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным"));
	СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамНакладным"));
	Если ХозОперацияУП = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту")
		ИЛИ ХозОперацияУП = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию") Тогда
		СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов"));
	КонецЕсли;
	Возврат СписокПорядков;
КонецФункции

&НаСервереБезКонтекста
Функция НеУчитыватьСверхБюджета(Организация, ЦФО, Период)

	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("Организация", Организация);
	ПараметрыНастройки.Вставить("ЦФО",		   ЦФО);
								
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету(ПараметрыНастройки, 
									Период);
	Возврат НеУчитыватьСверхБюджета;
	
КонецФункции

&НаСервере
Процедура ДатаПриИзмененииНаСервере()

	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	УправлениеФормой();	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗаполнитьСценарий("Организация");
	
	Если КонтролируемыеРеквизиты.Организация <> Объект.Организация Тогда
		Объект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
		Объект.Касса 		  = Справочники.Кассы.ПустаяСсылка();
		Объект.ОбъектРасчетов = Неопределено;
		Объект.Договор		  = Неопределено;
		
		ОбновитьКонтролируемыеРеквизиты("ОбъектРасчетов", ЭтотОбъект);
		ОбновитьКонтролируемыеРеквизиты("БанковскийСчет", ЭтотОбъект);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Если Объект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
			
			ПараметрыПередачи = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
			ПараметрыПередачи.Организация    = Объект.Организация;
			ПараметрыПередачи.ФормаОплаты	 = Перечисления.ФормыОплаты.Безналичная;
			ПараметрыПередачи.БанковскийСчет = Объект.БанковскийСчет;
			
			Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
				ПараметрыПередачи.Валюта = Объект.ВалютаДокумента;
			КонецЕсли;
			Объект.БанковскийСчет = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ПараметрыПередачи);
			ОбновитьКонтролируемыеРеквизиты("БанковскийСчет", ЭтотОбъект);
		Иначе	
			
			ПараметрыПередачи = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
			ПараметрыПередачи.Организация = Объект.Организация;
			ПараметрыПередачи.ФормаОплаты = Перечисления.ФормыОплаты.Наличная;
			ПараметрыПередачи.Касса       = Объект.Касса;
			Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
				ПараметрыПередачи.Валюта = Объект.ВалютаДокумента;
			КонецЕсли;
			Объект.Касса = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(ПараметрыПередачи);
		КонецЕсли;
	КонецЕсли;

	УстановитьПараметрыВыбораДоговораСЗаказчиком(Истина);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо", Истина);
	КонецЕсли;
	
	ЗаполнитьРеквизитыПлательщика();
	УстановитьНадписьРеквизитыПлательщика();
	
	ПроверитьИОчиститьОрганизациюПолучатель();
	УстановитьПараметрыВыбораОрганизацииПолучателя();
	УстановитьПараметрыВыбораБанковскийСчетПолучателя();

	ВзаиморасчетыСервер.ФормаПриИзмененииРеквизитов(ЭтотОбъект, "Организация");

	УстановитьПараметрыВыбораБанковскийСчетКасса();
		
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ЦФОПриИзмененииНаСервере()

	ЗаполнитьСценарий("ЦФО");
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура СтатьяРасходовПриИзмененииНаСервере()
	
	Если ТипЗнч(Объект.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
		ПриИзмененииСтатьиАктивовПассивов();
		Если ЗначениеЗаполнено(Объект.АналитикаРасходов) Тогда
			Объект.АналитикаРасходов = Неопределено;
		КонецЕсли;
	Иначе
		ПриИзмененииСтатьиРасходов();
		Если ЗначениеЗаполнено(Объект.АналитикаАктивовПассивов) Тогда
			Объект.АналитикаАктивовПассивов = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСтатьиРасходов()
	
	РеквизитыСтатьи = Новый Структура("ТипЗначения", Новый ОписаниеТипов); 
	Если ЗначениеЗаполнено(Объект.СтатьяРасходов) Тогда
		РеквизитыСтатьи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СтатьяРасходов, "ТипЗначения")
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.АналитикаРасходов) Тогда
		Если ЗначениеЗаполнено(Объект.СтатьяРасходов) Тогда
			ОписаниеТипов 	  = РеквизитыСтатьи.ТипЗначения;
			ОчиститьАналитику = НЕ ОписаниеТипов.СодержитТип(ТипЗнч(Объект.АналитикаРасходов)); 
		Иначе
			ОчиститьАналитику = Истина;
		КонецЕсли;
		Если ОчиститьАналитику Тогда
			Объект.АналитикаРасходов = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.АналитикаРасходов) И ЗначениеЗаполнено(Объект.СтатьяРасходов) Тогда
		Объект.АналитикаРасходов = ДоходыИРасходыКлиентСервер.ПолучитьАналитикуПоУмолчанию(РеквизитыСтатьи, Объект);
	Иначе
		ОчиститьАналитикуПрочихРасходов(Объект.СтатьяРасходов, Объект.АналитикаРасходов);
	КонецЕсли;

КонецПроцедуры
 
&НаСервере
Процедура ОчиститьАналитикуПрочихРасходов(СтатьяРасходов, АналитикаРасходов)
	
	Если ТипЗнч(АналитикаРасходов) = Тип("СправочникСсылка.ПрочиеРасходы") Тогда
	
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ИСТИНА КАК ОчиститьАналитику
		|ИЗ
		|	Справочник.ПрочиеРасходы КАК ДанныеСправочника
		|ГДЕ
		|	ДанныеСправочника.Ссылка = &АналитикаРасходов
		|	И ДанныеСправочника.Владелец <> &СтатьяРасходов
		|");
		Запрос.УстановитьПараметр("СтатьяРасходов", СтатьяРасходов);
		Запрос.УстановитьПараметр("АналитикаРасходов", АналитикаРасходов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ОчиститьАналитику Тогда
				АналитикаРасходов = Справочники.ПрочиеРасходы.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСтатьиАктивовПассивов()
	
	РеквизитыСтатьи = Новый Структура("ТипЗначения", Новый ОписаниеТипов); 
	Если ЗначениеЗаполнено(Объект.СтатьяРасходов) Тогда
		РеквизитыСтатьи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СтатьяРасходов, "ТипЗначения")
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.АналитикаАктивовПассивов) Тогда
		Если ЗначениеЗаполнено(Объект.СтатьяРасходов) Тогда
			ОписаниеТипов 	  = РеквизитыСтатьи.ТипЗначения;
			ОчиститьАналитику = НЕ ОписаниеТипов.СодержитТип(ТипЗнч(Объект.АналитикаАктивовПассивов)); 
		Иначе
			ОчиститьАналитику = Истина;
		КонецЕсли;
		Если ОчиститьАналитику Тогда
			Объект.АналитикаАктивовПассивов = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.АналитикаАктивовПассивов) И ЗначениеЗаполнено(Объект.СтатьяРасходов) Тогда
		Объект.АналитикаАктивовПассивов = ДоходыИРасходыКлиентСервер.ПолучитьАналитикуПоУмолчанию(РеквизитыСтатьи, Объект);
	Иначе
		ОчиститьАналитикуПрочихАктивовПассивов(Объект.СтатьяРасходов, Объект.АналитикаАктивовПассивов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьАналитикуПрочихАктивовПассивов(СтатьяАктивовПассивов, АналитикаАктивовПассивов)
	
	Если ТипЗнч(АналитикаАктивовПассивов) = Тип("СправочникСсылка.ПрочиеАктивыПассивы") Тогда
	
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ИСТИНА КАК ОчиститьАналитику
		|ИЗ
		|	Справочник.ПрочиеАктивыПассивы КАК ДанныеСправочника
		|ГДЕ
		|	ДанныеСправочника.Ссылка = &АналитикаАктивовПассивов
		|	И ДанныеСправочника.Владелец <> &СтатьяАктивовПассивов
		|");
		Запрос.УстановитьПараметр("СтатьяАктивовПассивов", СтатьяАктивовПассивов);
		Запрос.УстановитьПараметр("АналитикаАктивовПассивов", АналитикаАктивовПассивов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ОчиститьАналитику Тогда
				АналитикаАктивовПассивов = Справочники.ПрочиеАктивыПассивы.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаписатьДокумент()

	Оповещение 	   = Новый ОписаниеОповещения("ПредложитьЗаписатьДокументЗавершение", ЭтотОбъект);
	ТекстСообщения = НСтр("ru='Для перехода в режим списка необходимо записать документ.';
							  |en='To go to the list mode you want to record the document.'");

	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПредложитьЗаписатьДокументЗавершение(Результат, Дополнительно) Экспорт

	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	Если ПроверитьЗаполнение() Тогда
		Попытка
			Записать();		
		Исключение
			ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки; 
		ОткрытьФормуЗаявкиНаРасходованиеДС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаявкиНаРасходованиеДС()

	Если НЕ ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда
		Возврат;
	КонецЕсли; 
	
	// Открываем заявку для возможности работы в списке позиций.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ" , Объект.ДокументПланирования);
	ПараметрыФормы.Вставить("Режим", "ОткрытиеСпискаПозиций");
	
	ОткрытьФорму("Документ.бит_кзн_ЗаявкаНаРасходованиеСредств.ФормаОбъекта", ПараметрыФормы);
	
	Закрыть();

КонецПроцедуры

&НаСервере
Процедура ОбъектРасчетовОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	ДополнитьВыбранноеЗначение(ВыбранноеЗначение);

	// Известные свойства.
	ИсключаяСвойства = Новый Массив;
	ИсключаяСвойства.Добавить("Дата");
	ИсключаяСвойства.Добавить("Номер");
	ИсключаяСвойства.Добавить("СтавкаНДС");
	ИсключаяСвойства.Добавить("СуммаНДС");
	
	Индекс = ИсключаяСвойства.ВГраница();
	Пока Индекс >= 0 Цикл
		Если НЕ ВыбранноеЗначение.Свойство(ИсключаяСвойства[Индекс]) Тогда
			ИсключаяСвойства.Удалить(Индекс);		
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение, , СтрСоединить(ИсключаяСвойства, ","));
	
	//++ НЕ УТ
	Если ПоддержкаПлатежей275ФЗ И ВыбранноеЗначение.ПлатежиПо275ФЗ Тогда
		// ++ NB  ЗаполнитьПоДоговору(ВыбранноеЗначение.Договор);
	КонецЕсли;
	//-- НЕ УТ
	
	ОбновитьКонтролируемыеРеквизиты("ОбъектРасчетов", ЭтотОбъект);
	Модифицированность = Истина;
		
	ДоговорПриИзмененииНаСервере();
	
	ПараметрыОбъекта = ПараметрыУстановитьСтавкуНДС();
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, ЭтотОбъект);
	ПараметрыОбъекта.СтавкаНДСДоговора = ВыбранноеЗначение.СтавкаНДС;
	
	УстановитьСтавкуНДС(ПараметрыОбъекта);
	Объект.СтавкаНДС = ПараметрыОбъекта.СтавкаНДС;
	
	ВалютаДляСравнения = ВалютаПланированияДенежныхСредств();
	Если КонтролируемыеРеквизиты.ВалютаДокумента <> ВалютаДляСравнения Тогда
		Объект.ВалютаДокумента = ВалютаДляСравнения;
		ОбработатьИзмененииВалюты();
	Иначе
		ЗаполнитьКурсВзаиморасчетов();
		РассчитатьСуммуВзаиморасчетов();
		ЗаполнитьВалютуВзаиморасчетовДокумента();
	КонецЕсли;

	УстановитьПараметрыВыбораБанковскийСчетКасса();
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.ОбъектРасчетов);
	
КонецПроцедуры

&НаСервере
Процедура ОбъектРасчетовПриИзмененииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектРасчетов) Тогда
		Объект.Договор = Неопределено;	
		ДоговорПриИзмененииНаСервере();
	КонецЕсли;
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.ОбъектРасчетов);
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура ДополнитьВыбранноеЗначение(ВыбранноеЗначение)
	
	//++ НЕ УТ
	Если ЗначениеЗаполнено(ВыбранноеЗначение.Договор) Тогда
		ПлатежиПо275ФЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение.Договор, "ПлатежиПо275ФЗ");
	Иначе
		ПлатежиПо275ФЗ = Ложь;
	КонецЕсли;
	ВыбранноеЗначение.Вставить("ПлатежиПо275ФЗ", ПлатежиПо275ФЗ);
	//-- НЕ УТ
	
	ВыбранноеЗначение.Вставить("СтавкаНДС");
	ВыбранноеЗначение.Вставить("СуммаНДС");
	
	Если НЕ ОперацияБезНДС Тогда
		ОбъектыРасчетов = Новый Массив;
		ОбъектыРасчетов.Добавить(ВыбранноеЗначение.ОбъектРасчетов);
		
		ТаблицаНДС = ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(Объект.Организация, Неопределено, 
		Неопределено, ОбъектыРасчетов, ВыбранноеЗначение.ЭтоРасчетыСКлиентами);
		Если ТаблицаНДС.Количество() = 1 Тогда
			ВыбранноеЗначение.Вставить("СтавкаНДС", ТаблицаНДС[0].СтавкаНДС);
			Если ВыбранноеЗначение.СуммаПлатежа = ВыбранноеЗначение.СуммаЗаказа Тогда
				ВыбранноеЗначение.Вставить("СуммаНДС", ТаблицаНДС[0].СуммаНДС);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение.ВалютаВзаиморасчетов) Тогда
		КурсВалюты = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(ВыбранноеЗначение.ВалютаВзаиморасчетов, Неопределено, ВалютаРеглУчета);
		ВыбранноеЗначение.Вставить("КурсЧислительВзаиморасчетов", КурсВалюты.КурсЧислитель);
		ВыбранноеЗначение.Вставить("КурсЗнаменательВзаиморасчетов", КурсВалюты.КурсЗнаменатель);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура БанковскийСчетПриИзмененииНаСервере()
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.БанковскийСчет);
	ЗаполнитьРеквизитыПлательщика();
	УстановитьНадписьРеквизитыПлательщика();
	
	Объект.ВалютаДокумента = ВалютаПланированияДенежныхСредств();
	ОбработатьИзмененииВалюты();
	
	ПроверитьКорректностьЗаполненияПлатежаВБюджет();
	ЗаполнитьДанныеОбменаСБанком();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура КассаПриИзмененииНаСервере()
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.Касса);
	Объект.ВалютаДокумента = ВалютаПланированияДенежныхСредств();
	ОбработатьИзмененииВалюты();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПеречислениеСотрудникуЧерезБанкПриИзмененииНаСервере()

	// См. ДенежныеСредстваСервер.ПеречислениеСотрудникуЧерезБанкПриИзмененииНаСервере(Объект, ЭтотОбъект);	
	Объект.ПеречислениеСотрудникуЧерезБанк = Булево(ПеречислениеСотрудникуЧерезБанк);
	УстановитьПараметрыВыбораБанковскийСчетПолучателя();
	
	Если НЕ Объект.ПеречислениеСотрудникуЧерезБанк Тогда
		
		Если ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
			ИЛИ ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику
			ИЛИ (ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты
			И ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета) Тогда
			Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		
		Объект.БанковскийСчетПолучателя = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(Объект.ФизЛицо, Объект.ВалютаДокумента);
		
	Иначе
		Объект.БанковскийСчетПолучателя = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(Объект.Контрагент, Объект.ВалютаДокумента);
	КонецЕсли;
	
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Функция СчетСоответствуетВладельцу()
	
	Результат = Ложь;
	
	Если бит_КазначействоКлиентСервер.ЭтоРасчетыСФизЛицами(Объект.ХозяйственнаяОперация) Тогда
		Если Объект.ПеречислениеСотрудникуЧерезБанк Тогда
			Результат = Справочники.БанковскиеСчетаКонтрагентов.ПроверитьВладельцаБанковскогоСчета(
							Объект.БанковскийСчетПолучателя, Объект.Контрагент);
		Иначе
			Результат = Справочники.БанковскиеСчетаКонтрагентов.ПроверитьВладельцаБанковскогоСчета(
							Объект.БанковскийСчетПолучателя, Объект.ФизЛицо);
		КонецЕсли;
	Иначе	
		Результат = Справочники.БанковскиеСчетаКонтрагентов.ПроверитьВладельцаБанковскогоСчета(
			Объект.БанковскийСчетПолучателя, Объект.Контрагент);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПараметрыФормыПриКопировании(ДокументПланирования)

	Возврат Документы.бит_кзн_ПлатежнаяПозиция.ПараметрыФормыПриКопировании(ДокументПланирования);

КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеПериодаРассчетов()
	
	ТекущаяДатаПлан = Объект.ДатаПлан;
	
	Если ЗначениеЗаполнено(Объект.ДатаПлан) Тогда		
		ПараметрыПроверки = бит_КазначействоКлиентСервер.НовыеПараметрыПериодЗаданКорректно();
		ПараметрыПроверки.ПоляОбъекта.ДатаНачала	= "Дата";
		ПараметрыПроверки.ПоляОбъекта.ДатаОкончания = "ДатаПлан";
		
		ПараметрыПроверки.ПоляФормы.ДатаНачала	  = НСтр("ru = 'Дата'; en = 'Date'");
		ПараметрыПроверки.ПоляФормы.ДатаОкончания = НСтр("ru = 'Дата платежа'; en = 'Payment Date'");
		
		ПериодЗаданКорректно = бит_КазначействоКлиентСервер.ПериодЗаданКорректно(Объект, ПараметрыПроверки);
		Если НЕ ПериодЗаданКорректно Тогда
			Объект.ДатаПлан = Объект.Дата;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ДатаПлан) И КонтролируемыеРеквизиты.ДатаПлан <> Объект.ДатаПлан Тогда
		ПараметрыПроверки = бит_КазначействоКлиентСервер.НовыеПараметрыПериодЗаданКорректно();
		ПараметрыПроверки.ПоляОбъекта.ДатаНачала	= "Дата";
		ПараметрыПроверки.ПоляОбъекта.ДатаОкончания = "ДатаПлан";
		
		ПараметрыПроверки.ПоляФормы.ДатаНачала	  = НСтр("ru = 'Дата'; en = 'Date'");
		ПараметрыПроверки.ПоляФормы.ДатаОкончания = НСтр("ru = 'Дата платежа'; en = 'Payment Date'");
		
		ПериодЗаданКорректно = бит_КазначействоКлиентСервер.ПериодЗаданКорректно(Объект, ПараметрыПроверки);
		Если НЕ ПериодЗаданКорректно Тогда
			Объект.ДатаПлан = Объект.Дата;
		КонецЕсли;

		Если ЗначениеЗаполнено(Объект.ДатаПланКрайняя) Тогда
			РазностьДат = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(КонтролируемыеРеквизиты.ДатаПлан, Объект.ДатаПлан, "День");
			Объект.ДатаПланКрайняя = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(
										КонтролируемыеРеквизиты.ДатаПланКрайняя, РазностьДат, "День");
			ОбновитьКонтролируемыеРеквизиты("ДатаПланКрайняя", ЭтотОбъект);							
		КонецЕсли;

		Если КонтролируемыеРеквизиты.ДатаПлан <> Объект.ДатаПлан Тогда
			УправлениеФормой();
		КонецЕсли;

		ОбновитьКонтролируемыеРеквизиты("ДатаПлан", ЭтотОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаПланКрайняя) И КонтролируемыеРеквизиты.ДатаПланКрайняя <> Объект.ДатаПланКрайняя Тогда
		
		ПараметрыПроверки = бит_КазначействоКлиентСервер.НовыеПараметрыПериодЗаданКорректно();
		ПараметрыПроверки.ПоляОбъекта.ДатаНачала	= "ДатаПлан";
		ПараметрыПроверки.ПоляОбъекта.ДатаОкончания = "ДатаПланКрайняя";
		
		ПараметрыПроверки.ПоляФормы.ДатаНачала	  = НСтр("ru = 'Дата платежа'; en = 'Payment Date'");
		ПараметрыПроверки.ПоляФормы.ДатаОкончания = НСтр("ru = 'Не позднее'; en = 'on or before'");
		
		ПериодЗаданКорректно = бит_КазначействоКлиентСервер.ПериодЗаданКорректно(Объект, ПараметрыПроверки);
		Если НЕ ПериодЗаданКорректно Тогда
			Объект.ДатаПланКрайняя = КонтролируемыеРеквизиты.ДатаПланКрайняя;
		КонецЕсли;

		ОбновитьКонтролируемыеРеквизиты("ДатаПланКрайняя", ЭтотОбъект);
	КонецЕсли;	
	
	УстановитьПараметрыВыбораТипаНалогов();
	ПроверитьКорректностьЗаполненияПлатежаВБюджет();
	
	Если Объект.ДатаПлан <> ТекущаяДатаПлан Тогда
		ЗаполнитьКурсВзаиморасчетов();
		РассчитатьСуммуВзаиморасчетов();
		ЗаполнитьВалютуВзаиморасчетовДокумента();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОтображениеЗаголовкаПоляПодотчетноеЛицо()
	
	Если Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствПодотчетнику
		И Объект.ПеречислениеСотрудникуЧерезБанк
		И ПолучитьФункциональнуюОпцию("ИспользоватьПеречислениеДенежныхСредствСпискуСотрудников") Тогда
		Элементы.ФизЛицо.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Иначе
		Элементы.ФизЛицо.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокГруппыДанныеОбменаСБанком()

	ТекстЗаголовка = НСтр("ru = 'Договор обмена с банком № %1 от %2, отделение банка: %3, филиал: %4';
									|en = 'The contract of EDI with the bank No. %1 dated %2, bank branch: %3, branch office: %4'");
								
	ПредставлениеНомерДоговораСБанком = ?(Объект.НомерДоговораСБанком = "", "-", Объект.НомерДоговораСБанком);
	ПредставлениеДатаДоговораСБанком  = Формат(Объект.ДатаДоговораСБанком, "ДЛФ=D; ДП=-");
	ПредставлениеОтделениеБанка		  = ?(Объект.ОтделениеБанка = "", "-", Объект.ОтделениеБанка);
	ПредставлениеФилиалОтделенияБанка = ?(Объект.ФилиалОтделенияБанка = "", "-", Объект.ФилиалОтделенияБанка);

	ТекстЗаголовка = СтрШаблон(ТекстЗаголовка, ПредставлениеНомерДоговораСБанком, ПредставлениеДатаДоговораСБанком,
								ПредставлениеОтделениеБанка, ПредставлениеФилиалОтделенияБанка);
	
	Элементы.ГруппаРеквизитыОбменаСБанком.Заголовок = ТекстЗаголовка;

КонецПроцедуры

&НаСервере
Процедура РеквизитДоговораСБанкомПриИзмененииНаСервере()
	
	УстановитьЗаголовокГруппыДанныеОбменаСБанком();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбменаСБанком()

	Документы.бит_кзн_ПлатежнаяПозиция.ЗаполнитьДанныеОбменаСБанком(Объект);
	УстановитьЗаголовокГруппыДанныеОбменаСБанком();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорАрендыПриИзмененииНаСервере()
	
	// См. Документ.СписаниеБезналичныхДенежныхСредств.Форма.ФормаДокумента: 
	// РасшифровкаПлатежаДоговорАрендыПриИзмененииСервер().
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УсловияДоговоровАренды.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Справочник.ДоговорыАренды КАК ДоговорыАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровАренды.СрезПоследних(, Договор = &ДоговорАренды) КАК УсловияДоговоровАренды
	|		ПО УсловияДоговоровАренды.Договор = &ДоговорАренды
	|ГДЕ
	|	ДоговорыАренды.Ссылка = &ДоговорАренды";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДоговорАренды", Объект.ДоговорАренды);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
	КонецЕсли;	
	
	Объект.ТипПлатежаПоАренде = Перечисления.ТипыПлатежейПоАренде.УслугаПоАренде;

	УстановитьПараметрыВыбораТипПлатежаПоАренде();
	
	РассчитатьСуммуНДС();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИОчиститьОрганизациюПолучатель()
		
	Если ЗначениеЗаполнено(Объект.Организация)
		И Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВнутренняяПередачаДенежныхСредств
		И НЕ Справочники.Организации.ОрганизацииВзаимосвязаныПоОрганизационнойСтруктуре(
			Объект.Организация, Объект.ОрганизацияПолучатель) Тогда
		Объект.ОрганизацияПолучатель 	= Неопределено;
		Объект.БанковскийСчетПолучатель = Неопределено;
		Объект.КассаПолучатель 			= Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПолучательПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(Объект.ОрганизацияПолучатель) Тогда
		Объект.БанковскийСчетПолучатель = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(
											Объект.ОрганизацияПолучатель, Объект.ВалютаДокумента);
		УправлениеФормой();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораБанковскогоСчетаКассыПолучателя()

	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("ХозяйственнаяОперация", ХозОперацияУП);
	ДанныеОбъекта.Вставить("ОрганизацияПолучатель", Объект.ОрганизацияПолучатель);
	ДанныеОбъекта.Вставить("Организация", 			Объект.Организация);
	ДанныеОбъекта.Вставить("ПланированиеСуммы", 	Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов);

	ДенежныеСредстваСервер.УстановитьПараметрыВыбораБанковскогоСчетаКассыПолучателя(ДанныеОбъекта, Элементы.БанковскийСчетПолучатель);
	ДенежныеСредстваСервер.УстановитьПараметрыВыбораБанковскогоСчетаКассыПолучателя(ДанныеОбъекта, Элементы.КассаПолучатель);

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененииВалюты()

	ИзмениласьВалюта = КонтролируемыеРеквизиты.ВалютаДокумента <> Объект.ВалютаДокумента;
	Если НЕ ИзмениласьВалюта Тогда
		Возврат;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов Тогда
			Объект.ВалютаВзаиморасчетов			 = Объект.ВалютаДокумента;
			Объект.КурсЧислительВзаиморасчетов 	 = 1;
			Объект.КурсЗнаменательВзаиморасчетов = 1;
			Объект.СуммаДокумента 				 = Объект.СуммаВзаиморасчетов;
		Иначе
			Если НЕ ЗначениеЗаполнено(Объект.ОбъектРасчетов) И НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
				Объект.ВалютаВзаиморасчетов			 = Объект.ВалютаДокумента;
				Объект.КурсЧислительВзаиморасчетов	 = 1;
				Объект.КурсЗнаменательВзаиморасчетов = 1;
				Объект.СуммаДокумента				 = Объект.СуммаВзаиморасчетов;
			Иначе	
				РасшифровкаПлатежа.Очистить();
				НоваяСтрока = РасшифровкаПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Объект);
				НоваяСтрока.Сумма = Объект.СуммаДокумента;
				
				Контекст = Новый Структура;
				Контекст.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
				Контекст.Вставить("СуммаДокумента", 	Объект.СуммаДокумента);
				Контекст.Вставить("Дата",				Объект.ДатаПлан);
				
				ДенежныеСредстваСервер.ПересчетСуммДокументаВВалюту(Контекст, КонтролируемыеРеквизиты.ВалютаДокумента, 
					Объект.ВалютаДокумента);
					
				Объект.СуммаДокумента = Контекст.СуммаДокумента;
				
				ЗаполнитьКурсВзаиморасчетов();
				ЗаполнитьКурсКратностьТекстом();
				ЗаполнитьВалютуВзаиморасчетовДокумента();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбработатьИзмененииСуммыДокумента(Истина);
	
	ОбновитьКонтролируемыеРеквизиты("ВалютаДокумента", ЭтотОбъект);
	УстановитьПараметрыВыбораБанковскийСчетКасса();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененииСуммыДокумента(ИзмененаВалюта = Ложь)
	
	Если НЕ ОперацияБезНДС Тогда
		РассчитатьСуммуНДС();
	КонецЕсли;
	
	Если НЕ ИзмененаВалюта Тогда
		ЗаполнитьКурсВзаиморасчетов();
		РассчитатьСуммуВзаиморасчетов();
		ЗаполнитьВалютуВзаиморасчетовДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКурсВзаиморасчетов(ТолькоДанныеФормы = Ложь)

	ПараметрыЗаполнения = ДенежныеСредстваСервер.ПараметрыЗаполненияКурсаИКратности();

	ПараметрыЗаполнения.Валюта 				 = Объект.ВалютаДокумента;
	ПараметрыЗаполнения.Договор				 = Объект.Договор;
	ПараметрыЗаполнения.ВалютаВзаиморасчетов = Объект.ВалютаВзаиморасчетов;
	
	ПараметрыЗаполнения.ВалютаРегламентированногоУчета = ВалютаРеглУчета;
	ПараметрыЗаполнения.Дата						   = Объект.ДатаПлан;
	
	Данные = Новый Структура;
	Данные.Вставить("КурсЧислительВзаиморасчетов",  0);
	Данные.Вставить("КурсЗнаменательВзаиморасчетов",0);
	Данные.Вставить("ВариантКурсаДоговора", 		Перечисления.ВариантыКурсаДоговора.ПустаяСсылка());
	Данные.Вставить("ТипОбъектаРасчетов", 			Перечисления.ТипыОбъектовРасчетов.ПустаяСсылка());
	
	ЗаполнитьЗначенияСвойств(Данные, Объект);
	ЗаполнитьЗначенияСвойств(Данные, ЭтотОбъект);
	
	ДенежныеСредстваСервер.ЗаполнитьКурсИКратностьВСтрокеРасшифровки(Данные, ПараметрыЗаполнения);
	
	Если ТолькоДанныеФормы Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Данные, "ВариантКурсаДоговора");
	Иначе	
		ЗаполнитьЗначенияСвойств(Объект, Данные);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Данные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуВзаиморасчетов()
	
	Данные = Новый Структура;
	Данные.Вставить("Сумма", 						 Объект.СуммаДокумента);
	Данные.Вставить("КурсЧислительВзаиморасчетов",	 Объект.КурсЧислительВзаиморасчетов);
	Данные.Вставить("КурсЗнаменательВзаиморасчетов", Объект.КурсЗнаменательВзаиморасчетов);
	Данные.Вставить("СуммаВзаиморасчетов",			 Объект.СуммаВзаиморасчетов);
	
	ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
			Данные, Объект.ВалютаДокумента, ВалютаРеглУчета);
			
	Объект.СуммаВзаиморасчетов = Данные.СуммаВзаиморасчетов; 		
		
КонецПроцедуры
		
&НаСервере
Процедура ЗаполнитьВалютуВзаиморасчетовДокумента()
		
	Элементы.ДекорацияВалютыИКурсПлатежа.Заголовок = НадписьВалютыИКурсПлатежа();
	
КонецПроцедуры

&НаСервере
Процедура ПланированиеСуммыПриИзмененииНаСервере()
	
	Объект.ВалютаДокумента = ВалютаПланированияДенежныхСредств();
	ОбработатьИзмененииВалюты();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Функция ВалютаПланированияДенежныхСредств()

	Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
		ВалютаПланирования = Объект.ВалютаДокумента;
		Если Объект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Наличные Тогда
			Если ЗначениеЗаполнено(Объект.Касса) Тогда
				ВалютаПланирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Касса, "ВалютаДенежныхСредств");
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
				ВалютаПланирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.БанковскийСчет, "ВалютаДенежныхСредств");
			КонецЕсли;
		КонецЕсли;
	Иначе
		ВалютаПланирования = Объект.ВалютаВзаиморасчетов;
	КонецЕсли;

	Возврат ВалютаПланирования;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКурсКратностьТекстом()
	
	СформироватьКурсЗнаменательТекстом();
		
КонецПроцедуры

&НаСервере
Процедура ДекорацияВалютыИКурсПлатежаНажатиеЗавершениеНаСервере(Знач ИзмененаСумма)
	
	ЗаполнитьКурсКратностьТекстом();
	ЗаполнитьВалютуВзаиморасчетовДокумента();
	
	Если ИзмененаСумма Тогда
		ОбработатьИзмененииСуммыДокумента(Истина);
		ОбновитьКонтролируемыеРеквизиты("СуммаДокумента", ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СуммаВзаиморасчетовПриИзмененииНаСервере()
	
	ТекущаяСуммаДокумента = Объект.СуммаДокумента;
	
	Если Объект.СуммаДокумента = 0 Тогда
		Если Объект.ВалютаДокумента = ВалютаРеглУчета Тогда
			Если Объект.КурсЗнаменательВзаиморасчетов <> 0 Тогда
				Объект.СуммаДокумента = Объект.СуммаВзаиморасчетов * Объект.КурсЧислительВзаиморасчетов / Объект.КурсЗнаменательВзаиморасчетов;
			Иначе
				Объект.СуммаДокумента = 0;
			КонецЕсли;
		Иначе
			Если Объект.КурсЧислительВзаиморасчетов <> 0 Тогда
				Объект.СуммаДокумента = Объект.СуммаВзаиморасчетов / Объект.КурсЧислительВзаиморасчетов * Объект.КурсЗнаменательВзаиморасчетов;
			Иначе
				Объект.СуммаДокумента = 0;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Объект.ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
			
			Объект.КурсЧислительВзаиморасчетов = 1;
			
		ИначеЕсли Объект.ВалютаДокумента = ВалютаРеглУчета Тогда
			Если Объект.СуммаВзаиморасчетов <> 0 Тогда
				Объект.КурсЧислительВзаиморасчетов = Объект.СуммаДокумента / Объект.СуммаВзаиморасчетов * Объект.КурсЗнаменательВзаиморасчетов;
			Иначе
				Объект.КурсЧислительВзаиморасчетов = 1;
			КонецЕсли;
		Иначе
			Если Объект.СуммаДокумента <> 0 Тогда
				Объект.КурсЧислительВзаиморасчетов = Объект.СуммаВзаиморасчетов / Объект.СуммаДокумента * Объект.КурсЗнаменательВзаиморасчетов;
			Иначе
				Объект.КурсЧислительВзаиморасчетов = 0;
			КонецЕсли;
		КонецЕсли;
		СформироватьКурсЗнаменательТекстом();
	КонецЕсли;
	
	Если Объект.СуммаДокумента <> ТекущаяСуммаДокумента Тогда
		ОбработатьИзмененииСуммыДокумента(Истина);	
	КонецЕсли;
	
	ЗаполнитьВалютуВзаиморасчетовДокумента();
		
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеВалютыВзаиморасчетов()

	Объект.ВалютаДокумента = ВалютаПланированияДенежныхСредств();
	
	ЗаполнитьКурсВзаиморасчетов();
	
	РассчитатьСуммуВзаиморасчетов();
	СформироватьКурсЗнаменательТекстом();
	ЗаполнитьВалютуВзаиморасчетовДокумента();

	ОбновитьКонтролируемыеРеквизиты("ВалютаДокумента", ЭтотОбъект);
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура КурсЧислительВзаиморасчетовПриИзмененииНаСервере()
	
	// ++ NB См. РасшифровкаПлатежаКурсЧислительВзаиморасчетовПриИзмененииНаСервере 
	
	РассчитатьСуммуВзаиморасчетов();
	СформироватьКурсЗнаменательТекстом();
	ЗаполнитьВалютуВзаиморасчетовДокумента();
	
КонецПроцедуры

// См. ДенежныеСредстваСервер.НадписьВалютыИКурсПлатежа().
//
&НаСервере
Функция НадписьВалютыИКурсПлатежа()
		
	ШаблонКурса = "(%1 %2 = %3 %4)";
	СтрокиНадписи = Новый Массив;
	СтрокиНадписи.Добавить(НСтр("ru = 'Расчеты';
								|en = 'AR/AP accounting'"));

	СтрокиНадписи.Добавить(Строка(Объект.СуммаВзаиморасчетов));
	СтрокиНадписи.Добавить(Строка(Объект.ВалютаВзаиморасчетов));
		
	Если Объект.КурсЧислительВзаиморасчетов <> 0 Тогда
		Если Объект.ВалютаДокумента = ВалютаРеглУчета Тогда
			
			СтрокиНадписи.Добавить(СтрШаблон(ШаблонКурса,
				Объект.КурсЗнаменательВзаиморасчетов,
				Объект.ВалютаВзаиморасчетов,
				Строка(Формат(Объект.КурсЧислительВзаиморасчетов, "ЧДЦ=4")),
				Объект.ВалютаДокумента));
		Иначе
			СтрокиНадписи.Добавить(СтрШаблон(ШаблонКурса,
				Объект.КурсЗнаменательВзаиморасчетов,
				Объект.ВалютаДокумента,
				Строка(Формат(Объект.КурсЧислительВзаиморасчетов, "ЧДЦ=4")),
				Объект.ВалютаВзаиморасчетов));
		КонецЕсли;
	КонецЕсли;

	Возврат СтрСоединить(СтрокиНадписи, " ");
	
КонецФункции

&НаСервере
Процедура СформироватьКурсЗнаменательТекстом()

	Данные = Новый Структура;
	Данные.Вставить("КурсЗнаменательВзаиморасчетовНадпись", КурсЗнаменательВзаиморасчетовНадпись);
	Данные.Вставить("КурсЧислительВзаиморасчетов", 			Объект.КурсЧислительВзаиморасчетов);
	Данные.Вставить("КурсЗнаменательВзаиморасчетов", 		Объект.КурсЗнаменательВзаиморасчетов);
	Данные.Вставить("ВалютаВзаиморасчетов",					Объект.ВалютаВзаиморасчетов);
	Данные.Вставить("КурсЧислительВзаиморасчетовТекст",		"");
	
	ДенежныеСредстваКлиентСервер.СформироватьКурсЗнаменательТекстом(Данные, Объект.ВалютаДокумента, ВалютаРеглУчета);

	КурсЗнаменательВзаиморасчетовНадпись = Данные.КурсЗнаменательВзаиморасчетовНадпись;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокЭлементаПартнер()

	ПартнерыИКонтрагенты.ЗаголовокЭлементаПартнерВЗависимостиОтХозяйственнойОперации(
		ЭтотОбъект, "Партнер", ХозОперацияУП);

КонецПроцедуры

&НаСервере
Функция ВидимостьПанелиКонтроля()
	
	Если ЭтоРежимЗаявки И Объект.ВидПлана = Перечисления.бит_кзн_ВидыПланов.Прогноз Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти