
#Область СлужебныйПрограммныйИнтерфейс

#Область СвойстваСчетов

Функция СчетаВИерархии(СчетГруппа) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СчетГруппа) Тогда
		Возврат Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;
	
	Если ТипЗнч(СчетГруппа) = Тип("ПланСчетовСсылка.бит_Бюджетирование") Тогда
		Возврат СчетаВИерархииБюджетирование(СчетГруппа);
	ИначеЕсли ТипЗнч(СчетГруппа) = Тип("ПланСчетовСсылка.бит_Дополнительный_1") Тогда
		Возврат СчетаВИерархииУправленческий(СчетГруппа);
	ИначеЕсли ТипЗнч(СчетГруппа) = Тип("ПланСчетовСсылка.бит_Дополнительный_2") Тогда
		Возврат СчетаВИерархииМеждународный(СчетГруппа);
	ИначеЕсли ТипЗнч(СчетГруппа) = Тип("ПланСчетовСсылка.бит_Дополнительный_3") Тогда
		Возврат СчетаВИерархииДополнительный3(СчетГруппа);
	ИначеЕсли ТипЗнч(СчетГруппа) = Тип("ПланСчетовСсылка.бит_Дополнительный_4") Тогда
		Возврат СчетаВИерархииДополнительный4(СчетГруппа);
	ИначеЕсли ТипЗнч(СчетГруппа) = Тип("ПланСчетовСсылка.бит_Дополнительный_5") Тогда
		Возврат СчетаВИерархииДополнительный5(СчетГруппа);
	Иначе	
		Возврат Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли; 

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СчетаВИерархииБюджетирование(СчетГруппа)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетГруппа", СчетГруппа);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланСчетов.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.бит_Бюджетирование КАК ПланСчетов
	|ГДЕ
	|	ПланСчетов.Ссылка В ИЕРАРХИИ(&СчетГруппа)";
	Субсчета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Новый ФиксированныйМассив(Субсчета);

КонецФункции

Функция СчетаВИерархииУправленческий(СчетГруппа)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетГруппа", СчетГруппа);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланСчетов.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.бит_Дополнительный_1 КАК ПланСчетов
	|ГДЕ
	|	ПланСчетов.Ссылка В ИЕРАРХИИ(&СчетГруппа)";
	Субсчета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Новый ФиксированныйМассив(Субсчета);

КонецФункции

Функция СчетаВИерархииМеждународный(СчетГруппа)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетГруппа", СчетГруппа);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланСчетов.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.бит_Дополнительный_2 КАК ПланСчетов
	|ГДЕ
	|	ПланСчетов.Ссылка В ИЕРАРХИИ(&СчетГруппа)";
	Субсчета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Новый ФиксированныйМассив(Субсчета);

КонецФункции 

Функция СчетаВИерархииДополнительный3(СчетГруппа)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетГруппа", СчетГруппа);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланСчетов.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.бит_Дополнительный_3 КАК ПланСчетов
	|ГДЕ
	|	ПланСчетов.Ссылка В ИЕРАРХИИ(&СчетГруппа)";
	Субсчета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Новый ФиксированныйМассив(Субсчета);

КонецФункции

Функция СчетаВИерархииДополнительный4(СчетГруппа)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетГруппа", СчетГруппа);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланСчетов.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.бит_Дополнительный_4 КАК ПланСчетов
	|ГДЕ
	|	ПланСчетов.Ссылка В ИЕРАРХИИ(&СчетГруппа)";
	Субсчета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Новый ФиксированныйМассив(Субсчета);

КонецФункции

Функция СчетаВИерархииДополнительный5(СчетГруппа)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетГруппа", СчетГруппа);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланСчетов.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.бит_Дополнительный_5 КАК ПланСчетов
	|ГДЕ
	|	ПланСчетов.Ссылка В ИЕРАРХИИ(&СчетГруппа)";
	Субсчета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Новый ФиксированныйМассив(Субсчета);

КонецФункции

#КонецОбласти
