#Область ПрограммныйИнтерфейс

Процедура ДополнитьВидыКоманд(Результат) Экспорт
	
	Если НЕ ИТК_ИнтеграцияВКонфигурацию.Используется() Тогда
		Возврат;
	КонецЕсли;
	
	// Добавляем наше подменю
	ПолеВидГруппыФормы = "ВидГруппыФормы";
	ПолеИмя = "Имя";
	ПолеИмяПодменю = "ИмяПодменю";
	ПолеЗаголовок = "Заголовок";
	ПолеКартинка = "Картинка";
	ПолеОтображение = "Отображение";
	ПолеПолеИмяПодменю = "Порядок";

	Если ИТК_БСППовтИсп.АнглийскаяБСП() Тогда
		
		ПолеВидГруппыФормы = "FormGroupType";
		ПолеИмя = "Name";
		ПолеИмяПодменю = "SubmenuName";
		ПолеЗаголовок = "Title";
		ПолеКартинка = "Picture";
		ПолеОтображение = "Representation";
		ПолеПолеИмяПодменю = "Order";
		
	КонецЕсли;
	
	НовыйВидКоманды = Результат.Добавить();
	Попытка
		НовыйВидКоманды[ПолеВидГруппыФормы] = ВидГруппыФормы.Подменю;
	Исключение
		// Ошибка на БСП 2.3 при открытии документа Анкета
	КонецПопытки;
	
	ИдентификаторПодменю = ИТК_ИнтеграцияВКонфигурациюКлиентСервер.ИдентификаторПодменю();
	НовыйВидКоманды[ПолеИмя] = ИдентификаторПодменю;
	НовыйВидКоманды[ПолеИмяПодменю] = ИдентификаторПодменю;
	
	НовыйВидКоманды[ПолеЗаголовок] = ИТК_ТуллкитКлиентСервер.Представление();
	НовыйВидКоманды[ПолеКартинка] = БиблиотекаКартинок.ИТК_Подсистема;
	НовыйВидКоманды[ПолеОтображение] = ОтображениеКнопки.Картинка;
	НовыйВидКоманды[ПолеПолеИмяПодменю] = 1000;
	
КонецПроцедуры

Процедура ДополнитьКоманды(Команды) Экспорт
	
	Если НЕ ИТК_ИнтеграцияВКонфигурацию.Используется() Тогда
		Возврат;
	КонецЕсли;
	
	// Добавляем наши команды
	ИдентификаторПодменю = ИТК_ИнтеграцияВКонфигурациюКлиентСервер.ИдентификаторПодменю();
	
	ОписаниеИнструментов = ИТК_ТуллкитПовтИсп.СоответствиеОписаниеИнструментов();
	Для Каждого КлючЗначение Из ОписаниеИнструментов Цикл 
		
		ОписаниеИнструмента = КлючЗначение.Значение;
		
		Если НЕ (ОписаниеИнструмента["Доступ"]
					И ЗначениеЗаполнено(ОписаниеИнструмента["ОбработчикБСПИнтеграции"])) Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьКоманду(Команды, ИдентификаторПодменю, ОписаниеИнструмента["Представление"],
							ОписаниеИнструмента["ОбработчикБСПИнтеграции"], ОписаниеИнструмента["Порядок"],
							ОписаниеИнструмента["Картинка"], ОписаниеИнструмента["Множественный"]);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКоманду(Команды, ИдентификаторПодменю, Представление, Обработчик, Порядок, Картинка = Неопределено, МножественныйВыбор = Ложь)
	
	ПолеВид = "Вид";
	ПолеПредставление = "Представление";
	ПолеОбработчик = "Обработчик";
	ПолеКартинка = "Картинка";
	ПолеМножественныйВыбор = "МножественныйВыбор";
	ПолеРежимЗаписи = "РежимЗаписи";
	ПолеИзменяетВыбранныеОбъекты = "ИзменяетВыбранныеОбъекты";
	ПолеПорядок = "Порядок";
	
	Если ИТК_БСППовтИсп.АнглийскаяБСП() Тогда
		
		ПолеВид = "Kind";
		ПолеПредставление = "Presentation";
		ПолеОбработчик = "Handler";
		ПолеКартинка = "Picture";
		ПолеМножественныйВыбор = "MultipleChoice";
		ПолеРежимЗаписи = "WriteMode";
		ПолеИзменяетВыбранныеОбъекты = "ChangesSelectedObjects";
		ПолеПорядок = "Order";
		
	КонецЕсли;
	
	НоваяКоманда = Команды.Добавить();
	НоваяКоманда[ПолеВид] = ИдентификаторПодменю;
	НоваяКоманда[ПолеПредставление] = Представление;
	НоваяКоманда[ПолеОбработчик] = Обработчик;
	НоваяКоманда[ПолеКартинка] = Картинка;
	НоваяКоманда[ПолеМножественныйВыбор] = МножественныйВыбор;
	НоваяКоманда[ПолеРежимЗаписи] = "Запись";
	НоваяКоманда[ПолеИзменяетВыбранныеОбъекты] = Ложь;
	НоваяКоманда[ПолеПорядок] = Порядок;
	
КонецПроцедуры

#КонецОбласти
