
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПравоПриИзменении(Элемент)
	
	Если ЭтотТипБулево(Запись.Право) Тогда
		Запись.Значение = Истина;	
	КонецЕсли; 
	
КонецПроцедуры // ПравоПриИзменении()

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("СправочникСсылка.ГруппыПользователей"));
	СписокТипов.Добавить(Тип("СправочникСсылка.Пользователи"));
	
	ВыбранныйТип = ЭтотОбъект.ВыбратьИзСписка(СписокТипов);
	
	Если ВыбранныйТип <> Неопределено Тогда
		
		МассивТипов = Новый Массив;
  		МассивТипов.Добавить(ВыбранныйТип.Значение);
 		Описание = Новый ОписаниеТипов(МассивТипов);
        Элемент.ОграничениеТипа = Описание;

		Элемент.ВыбиратьТип = Ложь;
 	КонецЕсли; 

КонецПроцедуры // ПользовательНачалоВыбора()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтотТипБулево(Право)

	Результат = Право.ТипЗначения = Новый ОписаниеТипов("Булево");

	Возврат Результат;
	
КонецФункции // ЭтотТипБулево()

#КонецОбласти

