#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция АлгоритмГотовКРаботе(Алгоритм, СообщатьОбОшибках = Истина) Экспорт

	Результат1 = ЕстьТочкиСтартаИЗвершения(Алгоритм);
	Результат2 = ВсеТочкиЗаполнены(Алгоритм);
	Отказ 	   = Ложь;
	
	Если НЕ Результат1.ЕстьТочкиСтартаИЗвершения Тогда
		Отказ = Истина;
		Если СообщатьОбОшибках Тогда
			ОбщегоНазначения.СообщитьПользователю(Результат1.Ошибки, Алгоритм,,,Отказ);
		КонецЕсли;
	КонецЕсли; 
	
	Если НЕ Результат2.ВсеТочкиЗаполнены Тогда
		Отказ = Истина;
		Если СообщатьОбОшибках Тогда
			ОбщегоНазначения.СообщитьПользователю(Результат2.Ошибки, Алгоритм,,,Отказ); 
		КонецЕсли;
	КонецЕсли; 

	Возврат НЕ Отказ;
	
КонецФункции
 
Функция АлгоритмИспользуется(Алгоритм) Экспорт
	
	Результат = Новый Структура; 
	Результат.Вставить("АлгоритмИспользуется", Ложь);
	Результат.Вставить("МестоИспользования", "");
	
	Если Алгоритм.Пустая() Тогда
		Возврат Результат;
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаИспользования.Используется КАК Используется,
	|	МестаИспользования.МестоИспользования КАК МестоИспользования
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ИСТИНА КАК Используется,
	|		&ПричинаВизы КАК МестоИспользования
	|	ИЗ
	|		РегистрСведений.бит_УстановленныеВизы КАК бит_УстановленныеВизы
	|	ГДЕ
	|		бит_УстановленныеВизы.Алгоритм = &Алгоритм
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		ИСТИНА,
	|		&ПричинаПроцесс
	|	ИЗ
	|		БизнесПроцесс.бит_Процесс КАК бит_Процесс
	|	ГДЕ
	|		(бит_Процесс.Стартован
	|				ИЛИ бит_Процесс.Завершен)
	|		И бит_Процесс.Алгоритм = &Алгоритм) КАК МестаИспользования
	|ГДЕ
	|	ЕСТЬNULL(МестаИспользования.Используется, ЛОЖЬ)";
	
	Запрос.УстановитьПараметр("Алгоритм"	  , Алгоритм);
	Запрос.УстановитьПараметр("ПричинаВизы"   , НСтр("ru='в процессе согласования';
												  	 |en='in the process of harmonization'"));
	Запрос.УстановитьПараметр("ПричинаПроцесс", НСтр("ru='в начатых или завершенных бизнес-процессах';
													 |en='in developed or completed business processes'"));
	
	Используется = Ложь;
	МестоИспользования = Новый Массив(); 
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Используется = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МестоИспользования.Добавить(Выборка.МестоИспользования);
		КонецЦикла;
	КонецЕсли; 
	
	Результат.Вставить("АлгоритмИспользуется", Используется);
	Результат.Вставить("МестоИспользования", СтрСоединить(МестоИспользования, ", "));
	
	Возврат Результат;

КонецФункции
 
Процедура КопироватьДействияВТочкиМаршрута(Источник, Приемник) Экспорт

	ГруппаДействий = Справочники.бит_ПользовательскиеДействия.СоздатьГруппу();
	ГруппаДействий.Наименование = Строка(Приемник);
	ГруппаДействий.Записать();
	
	СсылкиДействия = Новый Соответствие(); 
	
	Запрос = Новый Запрос;   	
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользовательскиеДействия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ПользовательскиеДействия КАК ПользовательскиеДействия
	|ГДЕ
	|	НЕ ПользовательскиеДействия.ПометкаУдаления
	|	И ПользовательскиеДействия.Алгоритм = &Источник";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекущийОбъект = Выборка.Ссылка.Скопировать(); 
		ТекущийОбъект.Алгоритм = Приемник;
		ТекущийОбъект.Родитель = ГруппаДействий.Ссылка;
		ТекущийОбъект.Записать();
		СсылкиДействия.Вставить(Выборка.Ссылка, ТекущийОбъект.Ссылка);
	КонецЦикла;
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("Приемник", Приемник);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТочкиАлгоритмовПриемник.Ссылка КАК Ссылка,
	|	ТочкиАлгоритмовИсточник.ПользовательскоеДействие КАК ПользовательскоеДействие
	|ИЗ
	|	Справочник.бит_ТочкиАлгоритмов КАК ТочкиАлгоритмовПриемник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ТочкиАлгоритмов КАК ТочкиАлгоритмовИсточник
	|		ПО ТочкиАлгоритмовПриемник.ВидТочки = ТочкиАлгоритмовИсточник.ВидТочки
	|			И ТочкиАлгоритмовПриемник.ИдентификаторТочки = ТочкиАлгоритмовИсточник.ИдентификаторТочки
	|			И ТочкиАлгоритмовПриемник.КодТочки = ТочкиАлгоритмовИсточник.КодТочки
	|			И (ТочкиАлгоритмовИсточник.Владелец = &Источник)
	|			И (ТочкиАлгоритмовПриемник.Владелец = &Приемник)";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ТекущийОбъект.Заблокировать();
			ТекущийОбъект.ПользовательскоеДействие = СсылкиДействия.Получить(Выборка.ПользовательскоеДействие);
			ТекущийОбъект.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось скопировать действия. Объект редактируется другим пользователем.'")
							+ Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 				
		КонецПопытки; 
	КонецЦикла;

КонецПроцедуры
	
// Выполняет поиск по наименованию группы справочника бит_АлгоритмыПроцессов. 
// Если найти не удалось, создается новая группа. Используется при первоначальном заполнении ИБ.
// 
// Параметры:
//  Наименование - Строка
// 
// Возвращаемое значение:
//  Группа - СправочникСсылка.бит_АлгоритмыПроцессов.
// 
Функция СоздатьГруппуАлгоритмов(Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Спр.Ссылка
	               |ИЗ
	               |	Справочник.бит_АлгоритмыПроцессов КАК Спр
	               |ГДЕ
	               |	Спр.ЭтоГруппа
	               |	И Спр.Наименование ПОДОБНО &Наименование";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Группа = Справочники.бит_АлгоритмыПроцессов.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		
		 Группа = Выборка.Ссылка;
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Группа) Тогда
	
		ГруппаОб = Справочники.бит_АлгоритмыПроцессов.СоздатьГруппу();
		ГруппаОб.Наименование = Наименование;
		ГруппаОб.УстановитьНовыйКод();
		
		флВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(ГруппаОб, "", "Ошибки", Истина);
		
		Если флВыполнено Тогда
		
			Группа = ГруппаОб.Ссылка;
		
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Группа;
	
КонецФункции // СоздатьГруппуАлгоритмов()

// Выполняет создание элемента справочника алгоритмы. Перед созданием элемента 
// справочника выполняется поиск уже созданных элементов по наименованию.
// 
// Параметры:
//   Наименование - Строка
//   Группа       - СправочникСсылка.бит_АлгоритмыПроцессов
//   Вид          - ПеречислениеСсылка.бит_ВидыАлгоритмов
//   СтрПар       - Структура.
// 
// Возвращаемое значение:
//  Алгоритм - СправочникСсылка.бит_АлгоритмыПроцессов.
// 
Функция СоздатьАлгоритм(Наименование, Группа, Вид, СтрПар = Неопределено, ПервоначальноеЗаполнение = Ложь) Экспорт

	Алгоритм = АлгоритмПоНаименованию(Наименование, Группа);
	
	Если НЕ ЗначениеЗаполнено(Алгоритм) Тогда
	
		СпрОб = Справочники.бит_АлгоритмыПроцессов.СоздатьЭлемент();
		СпрОб.Заполнить(Неопределено);
		СпрОб.Наименование     = Наименование;
		СпрОб.Родитель         = Группа;
		СпрОб.ВидАлгоритма     = Вид;
		СпрОб.СпособВыполнения = Перечисления.бит_СпособыВыполненияАлгоритма.Сразу;
		СпрОб.ДополнительныеСвойства.Вставить("СоздатьТочкуСтарта", Истина);
		
		Если ТипЗнч(СтрПар) = Тип("Структура") И СтрПар.Свойство("Реквизиты") Тогда
		
			Для каждого КиЗ Из СтрПар.Реквизиты Цикл
			
				СпрОб[КиЗ.Ключ] = КиЗ.Значение;
			
			КонецЦикла; // СтрПар.Реквизиты
		
		КонецЕсли;
		
		Если ТипЗнч(СтрПар) = Тип("Структура") И СтрПар.Свойство("ПараметрыАлгоритма") Тогда
			 Для каждого МодельСтроки Из СтрПар.ПараметрыАлгоритма Цикл
			 	НоваяСтрока = СпрОб.ПараметрыАлгоритма.Добавить();
				НоваяСтрока.Имя          = МодельСтроки.Имя;
				НоваяСтрока.Обязательный = МодельСтроки.Обязательный;
				НоваяСтрока.СтрТип       = МодельСтроки.Тип;
				ТекОписание = бит_ОбщегоНазначенияКлиентСервер.ПолучитьОписаниеИзСтроки(НоваяСтрока.СтрТип);
				НоваяСтрока.ЗначениеПоУмолчанию = ТекОписание.ПривестиЗначение();
			 КонецЦикла; 
		КонецЕсли; 
		
		СпрОб.УстановитьНовыйКод();
		СпрОб.ДополнительныеСвойства.Вставить("ПервоначальноеЗаполнение", ПервоначальноеЗаполнение);
		
		флВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОб, "", "Ошибки", Ложь);
		
		Если флВыполнено Тогда
			 Алгоритм = СпрОб.Ссылка;
		КонецЕсли; 
	КонецЕсли; 

	Возврат Алгоритм;
	
КонецФункции

// Выполняет поиск последней созданной точки в алгоритме. 
// Анализ структуры алгоритма не выполняется, возвращается именно последняя созданная точка. 
// Используется при первоначальном заполнении ИБ. 
// 
// Параметры:
//  Алгоритм - СправочникСсылка.бит_АлгоритмыПроцессов.
// 
// Возвращаемое значение:
//  Точка - СправочникСсылка.бит_ТочкиАлгоритмов.
// 
Функция НайтиПоследнююТочку(Алгоритм) Экспорт

	Точка = Справочники.бит_ТочкиАлгоритмов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Алгоритм", Алгоритм);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТочкиАлгоритмов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ТочкиАлгоритмов КАК ТочкиАлгоритмов
	|ГДЕ
	|	ТочкиАлгоритмов.Владелец = &Алгоритм
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";
				   
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Точка = Выборка.Ссылка;
	
	КонецЕсли; 

	Возврат Точка;
	
КонецФункции // НайтиПоследнююТочку()

// Функция определяем входит ли пользовательское действие в указанный алгоритм.
//
// Параметры:
//   Алгоритм - СправочникСсылка.бит_АлгоритмыПроцессов.
//   ПользовательскоеДействие - СправочникСсылка.бит_ПользовательскиеДействия.
//
// Возвращаемое значение:
//  Булево.
//
Функция ДействиеВАлгоритме(Алгоритм, ПользовательскоеДействие) Экспорт

	Входит = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Алгоритм", Алгоритм);
	Запрос.УстановитьПараметр("ПользовательскоеДействие", ПользовательскоеДействие);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТочкиАлгоритмов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ТочкиАлгоритмов КАК ТочкиАлгоритмов
	|ГДЕ
	|	ТочкиАлгоритмов.Владелец = &Алгоритм
	|	И ТочкиАлгоритмов.ПользовательскоеДействие = &ПользовательскоеДействие";
				   
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
	
		Входит = Истина;
	
	КонецЕсли; 

	Возврат Входит;
	
КонецФункции // ДействиеВАлгоритме()

// Назначает алгоритм объекту системы.
// 
// Параметры:
//  Алгоритм - СправочникСсылка.бит_АлгоритмыПроцессов.
//  ОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы.
//  ДатаНачала - Дата.
//  ПользовательскоеУсловие - СправочникСсылка.бит_ПользовательскиеУсловия.
// 
// Возвращаемое значение:
//  флВыполнено - Булево.
// 
Функция НазначитьАлгоритм(Алгоритм, ОбъектСистемы,  ДатаНачала, ПользовательскоеУсловие = Неопределено) Экспорт

	Отказ = Ложь;
	ВидАлгоритма = Неопределено;
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
		ВидАлгоритма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Алгоритм, "ВидАлгоритма");
	Иначе
		ТекстСообщения = НСтр("ru='Не заполнен алгоритм.';
							  |en='Algorithm is not full.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , ,Отказ); 
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура; 
	ДанныеЗаполнения.Вставить("ОбъектСистемы", 			 ОбъектСистемы);
	ДанныеЗаполнения.Вставить("ВидАлгоритма",  			 ВидАлгоритма);
	ДанныеЗаполнения.Вставить("ПользовательскоеУсловие", ПользовательскоеУсловие);
	ДанныеЗаполнения.Вставить("Алгоритм", 				 Алгоритм);
	ДанныеЗаполнения.Вставить("Период", 				 ДатаНачала);
	
	Запись = РегистрыСведений.бит_НазначениеАлгоритмов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ДанныеЗаполнения);
	
	Отказ = Ложь;
	Если НЕ Запись.ПроверитьЗаполнение() Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось назначить алгоритм %1.';
									    |en='Unable to assign an algorithm %1.'"), 
								   Алгоритм);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Алгоритм, , ,Отказ); 
	Иначе
		Запись.Записать();
	КонецЕсли; 
		
	Возврат НЕ Отказ;
	
КонецФункции

// Процедура определяет есть ли динамические параметры у алгоритма.
// 
Функция ЕстьДинамическиеПараметры(Алгоритм)  Экспорт

	флЕсть = Ложь;
	
	Если Алгоритм.ВидАлгоритма = Перечисления.бит_ВидыАлгоритмов.Прочее Тогда
	
		 СтрОтбор = Новый Структура("Динамический", Истина);
		 МассивСтрок = Алгоритм.ПараметрыАлгоритма.НайтиСтроки(СтрОтбор);
		 
		 флЕсть = ?(МассивСтрок.Количество()>0,Истина,Ложь);
	
	КонецЕсли; 
	
	Возврат флЕсть;

КонецФункции // ЕстьДинамическиеПараметры()

Процедура ДобавитьТочкиЗавершения(Алгоритм = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Завершение", Перечисления.бит_ВидыТочекАлгоритмов.Завершение);
	Запрос.УстановитьПараметр("Алгоритм",   Алгоритм);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ТочкиАлгоритмов.Ссылка КАК Ссылка,
	|	ТочкиАлгоритмов.Владелец КАК Владелец,
	|	ТочкиАлгоритмов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.бит_ТочкиАлгоритмов КАК ТочкиАлгоритмов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ТочкиАлгоритмов.ИсходящиеТочки КАК ПустаяИсходящиеТочки
	|		ПО (ПустаяИсходящиеТочки.Ссылка = ТочкиАлгоритмов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВходящиеТочки.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.бит_ТочкиАлгоритмов.ВходящиеТочки КАК ВходящиеТочки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВходящиеТочки.Ссылка) КАК ЗаполненнаяВходящиеТочки
	|		ПО ТочкиАлгоритмов.Ссылка = ЗаполненнаяВходящиеТочки.Ссылка
	|ГДЕ
	|	&Алгоритм
	|	И ПустаяИсходящиеТочки.Ссылка ЕСТЬ NULL
	|	И НЕ ТочкиАлгоритмов.ВидТочки = &Завершение
	|	И НЕ ЗаполненнаяВходящиеТочки.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Владелец,
	|	Наименование";
	
	ЧтоЗаменить   = "&Алгоритм";
	НаЧтоЗаменить = ?(Алгоритм = Неопределено, "ИСТИНА", "Владелец = &Алгоритм");
	ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
	
	Запрос.Текст = ТекстЗапроса;	
	Результат 	 = Запрос.Выполнить();
	
	НачатьТранзакцию();
	Попытка
		Выборка  = Результат.Выбрать();
		Владелец = Неопределено;
		Индекс   = 0;
		Пока Выборка.Следующий() Цикл
			Точка = Выборка.Ссылка.ПолучитьОбъект();
			Точка.Заблокировать();
			
			Если Владелец <> Выборка.Владелец Тогда
				Индекс = 0;
				Владелец = Выборка.Владелец;
			Иначе	
				Индекс = Индекс + 1;
			КонецЕсли;
			
			ДанныеЗаполнения = Новый Структура; 
			ДанныеЗаполнения.Вставить("Владелец", Выборка.Владелец);
			ДанныеЗаполнения.Вставить("Наименование", СтрШаблон(НСтр("ru='Завершение %1';en='Completion %1'"), Формат(Индекс, "ЧГ=")));
			ДанныеЗаполнения.Вставить("ВидТочки", Перечисления.бит_ВидыТочекАлгоритмов.Завершение);
			
			Завершение = Справочники.бит_ТочкиАлгоритмов.СоздатьЭлемент();
			Завершение.Заполнить(ДанныеЗаполнения);
			НоваяСтрока = Завершение.ВходящиеТочки.Добавить();
			НоваяСтрока.Точка = Выборка.Ссылка;
			НоваяСтрока.Направление = Перечисления.бит_Направление.Вертикаль;
			Завершение.АктивнаяТочкаМаршрута = Истина;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Завершение);
			
			НоваяСтрока = Точка.ИсходящиеТочки.Добавить();
			НоваяСтрока.Точка = Завершение.Ссылка;
			НоваяСтрока.Направление = Перечисления.бит_Направление.Вертикаль;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Точка);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось добавить точки завершения. По причине:'")
					   + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()); 
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.бит_ТочкиАлгоритмов,,ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

// Формирует графическую схему на основании описания точек алгоритма.
//
// Параметры:
//   Алгоритм - СправочникСсылка.бит_АлгоритмыПроцессов.
//
// Возвращаемое значение:
//  ГрафическаяСхема.
//
Функция КартаМаршрутаПоТочкамАлгоритма(Алгоритм) Экспорт
	
	ГрафическаяСхема = Новый ГрафическаяСхема;
	
	Если ТранзакцияАктивна() Тогда
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.бит_ТочкиАлгоритмов.ПолноеИмя());
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		Блокировка.Заблокировать();
	КонецЕсли;
	
	ТаблицаТочек = ТочкиАлгоритма(Алгоритм);
	Если ТаблицаТочек.Количество() = 0 Тогда
		Возврат ГрафическаяСхема;
	КонецЕсли;
	
	СчетчикИндекс     = 0;
	СтрокаТочкиСтарта = Неопределено;
	
	Для каждого СтрокаТочки Из ТаблицаТочек Цикл
		СчетчикИндекс = Макс(СчетчикИндекс, СтрокаТочки.ИдентификаторТочки);
		Если СтрокаТочки.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Старт Тогда
			СтрокаТочкиСтарта = СтрокаТочки;
		КонецЕсли;
	КонецЦикла;
	Если СтрокаТочкиСтарта = Неопределено Тогда
		Возврат ГрафическаяСхема;
	КонецЕсли;
	
	ЭлементыПоИдентификаторам = Новый Соответствие;
	ПараметрыРазмещения       = бит_ГрафическиеСхемы.НовыеПараметрыРазмещенияЭлементовСхемы();
	ТаблицаСвязей             = бит_ГрафическиеСхемы.НоваяТаблицаСвязейЭлементовГрафическойСхемы();
	СхемаXDTO                 = СериализаторXDTO.ЗаписатьXDTO(ГрафическаяСхема);
	ЭлементыСхемы             = СхемаXDTO.item;	
	НомерСтроки               = 1;
	СчетчикИндекс             = СчетчикИндекс + 1;
	
	// Создадим точку старта.
	ИдентификаторТочки        = СтрокаТочкиСтарта.ИдентификаторТочки;
	Если ИдентификаторТочки = 0 Тогда
		ИдентификаторТочки = СчетчикИндекс;
		ТочкаОбъект        = СтрокаТочкиСтарта.ТочкаАлгоритма.ПолучитьОбъект();
		ТочкаОбъект.ИдентификаторТочки = ИдентификаторТочки;
		ТочкаОбъект.Записать();
		СчетчикИндекс      = СчетчикИндекс + 1;
	КонецЕсли;
	ТипЭлементаСтарт          = 2; 
	ЭлементТочкаСтарта        = бит_ГрафическиеСхемы.НовыйЭлементСхемы(Перечисления.бит_ЭлементыГрафическойСхемы.Старт,
																		ИдентификаторТочки, СтрокаТочкиСтарта.Наименование);
	ЭлементыПоИдентификаторам.Вставить(ИдентификаторТочки, ЭлементТочкаСтарта);
	ГраницыРазмещения         = бит_ГрафическиеСхемы.ГраницыРазмещенияЭлементаСхемы(ПараметрыРазмещения, НомерСтроки, 1);
	бит_ГрафическиеСхемы.РазместитьЭлементНаСхеме(ЭлементТочкаСтарта, ГраницыРазмещения, ПараметрыРазмещения);
	ЭлементыСхемы.Добавить(ЭлементТочкаСтарта);
	
	ЭлементИсточник = ЭлементТочкаСтарта; 
	
	ТекущаяТочка = СтрокаТочкиСтарта.ИсходящаяТочка;
	Пока ЗначениеЗаполнено(ТекущаяТочка) Цикл
		// Создадим исходящий элемент.
		НомерСтроки         = НомерСтроки + 1;
		СтрокаТекущейТочки  = ТаблицаТочек.Найти(ТекущаяТочка, "ТочкаАлгоритма");
		
		ИдентификаторТочки        = СтрокаТекущейТочки.ИдентификаторТочки;
		Если ИдентификаторТочки = 0 Тогда
			ИдентификаторТочки = СчетчикИндекс;
			ТочкаОбъект        = СтрокаТекущейТочки.ТочкаАлгоритма.ПолучитьОбъект();
			ТочкаОбъект.ИдентификаторТочки = ИдентификаторТочки;
			ТочкаОбъект.Записать();
			СчетчикИндекс      = СчетчикИндекс + 1;
		КонецЕсли;
		
		ТипЭлемента           = ?(СтрокаТекущейТочки.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Завершение,
									Перечисления.бит_ЭлементыГрафическойСхемы.Завершение,
									Перечисления.бит_ЭлементыГрафическойСхемы.Действие);
		ЭлементТекущейТочки   = бит_ГрафическиеСхемы.НовыйЭлементСхемы(ТипЭлемента,
																	  	ИдентификаторТочки,
																	  	СтрокаТекущейТочки.Наименование);
		ЭлементыПоИдентификаторам.Вставить(ИдентификаторТочки, ЭлементТекущейТочки);
		ГраницыРазмещения = бит_ГрафическиеСхемы.ГраницыРазмещенияЭлементаСхемы(ПараметрыРазмещения, НомерСтроки, 1);
		бит_ГрафическиеСхемы.РазместитьЭлементНаСхеме(ЭлементТекущейТочки, ГраницыРазмещения, ПараметрыРазмещения);
		ЭлементыСхемы.Добавить(ЭлементТекущейТочки);
		
		// Свяжем элемент с прошлым соединительной линией.
		СоединительнаяЛиния = бит_ГрафическиеСхемы.НовыйЭлементСхемы(Перечисления.бит_ЭлементыГрафическойСхемы.Линия,
																		СчетчикИндекс);
		ЭлементыПоИдентификаторам.Вставить(СчетчикИндекс, СоединительнаяЛиния);
		СчетчикИндекс       = СчетчикИндекс + 1;
		ЭлементыСхемы.Добавить(СоединительнаяЛиния);
		бит_ГрафическиеСхемы.УстановитьПривязкуСоединительнойЛинии(СоединительнаяЛиния, ТаблицаСвязей, ЭлементИсточник, ЭлементТекущейТочки);
		
		ЭлементИсточник = ЭлементТекущейТочки;
		ТекущаяТочка    = СтрокаТекущейТочки.ИсходящаяТочка;
	КонецЦикла;
	
	бит_ГрафическиеСхемы.РазместитьЛинииСвязей(ТаблицаСвязей, ЭлементыПоИдентификаторам);
	
	Возврат СериализаторXDTO.ПрочитатьXDTO(СхемаXDTO);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьТочкиСтартаИЗвершения(Алгоритм)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Алгоритм",Алгоритм);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Алгоритмы.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТочкиСтарта.Ссылка) КАК Старт,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТочкиЗавершения.Ссылка) КАК Завершение
	|ИЗ
	|	Справочник.бит_АлгоритмыПроцессов КАК Алгоритмы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ТочкиАлгоритмов КАК ТочкиСтарта
	|		ПО (ТочкиСтарта.Владелец = Алгоритмы.Ссылка)
	|			И (ТочкиСтарта.ВидТочки = ЗНАЧЕНИЕ(Перечисление.бит_ВидыТочекАлгоритмов.Старт))
	|			И (ТочкиСтарта.АктивнаяТочкаМаршрута)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ТочкиАлгоритмов КАК ТочкиЗавершения
	|		ПО (ТочкиЗавершения.Владелец = Алгоритмы.Ссылка)
	|			И (ТочкиЗавершения.ВидТочки = ЗНАЧЕНИЕ(Перечисление.бит_ВидыТочекАлгоритмов.Завершение))
	|			И (ТочкиЗавершения.АктивнаяТочкаМаршрута)
	|ГДЕ
	|	Алгоритмы.Ссылка = &Алгоритм
	|
	|СГРУППИРОВАТЬ ПО
	|	Алгоритмы.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	Ошибки 			 = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Старт = 0 Тогда
			Ошибки.Добавить(НСтр("ru='Нет точки старта.';
								 |en='There is no starting point.'"));
		ИначеЕсли Выборка.Старт > 1 Тогда	
			Ошибки.Добавить(НСтр("ru='Несколько точек старта не поддерживается.';
								 |en='Several start points is not supported.'"));
		КонецЕсли; 
		Если Выборка.Завершение = 0 Тогда
			Ошибки.Добавить(НСтр("ru='Нет точки завершения.';
								 |en='No completion points.'"));
		КонецЕсли; 
	КонецЦикла;

	Результат = Новый Структура; 
	Результат.Вставить("ЕстьТочкиСтартаИЗвершения", Ошибки.Количество() = 0);
	Результат.Вставить("Ошибки", СтрСоединить(Ошибки, Символы.ПС));
	
	Возврат Результат;
	
КонецФункции
 
Функция ВсеТочкиЗаполнены(Алгоритм)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Алгоритм", Алгоритм);
	Запрос.УстановитьПараметр("Действие", Перечисления.бит_ВидыТочекАлгоритмов.Действие);
	Запрос.УстановитьПараметр("Процесс",  Перечисления.бит_ВидыТочекАлгоритмов.ПодчиненныйПроцесс);
	Запрос.УстановитьПараметр("Условие",  Перечисления.бит_ВидыТочекАлгоритмов.Условие);
	Запрос.УстановитьПараметр("ПустоеДействие", Справочники.бит_ПользовательскиеДействия.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустоеУсловие",  Справочники.бит_ПользовательскиеУсловия.ПустаяСсылка());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТочкиАлгоритмов.Ссылка КАК Точка,
	|	ТочкиАлгоритмов.Представление КАК Представление
	|ИЗ
	|	Справочник.бит_ТочкиАлгоритмов КАК ТочкиАлгоритмов
	|ГДЕ
	|	ТочкиАлгоритмов.Владелец = &Алгоритм
	|	И ВЫБОР
	|			КОГДА ТочкиАлгоритмов.ВидТочки = &Действие
	|					И ТочкиАлгоритмов.ПользовательскоеДействие = &ПустоеДействие
	|				ТОГДА ИСТИНА
	|			КОГДА ТочкиАлгоритмов.ВидТочки = &Процесс
	|					И ТочкиАлгоритмов.ПользовательскоеДействие = &ПустоеДействие
	|				ТОГДА ИСТИНА
	|			КОГДА ТочкиАлгоритмов.ВидТочки = &Условие
	|					И ТочкиАлгоритмов.ПользовательскоеУсловие = &ПустоеУсловие
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ТочкиАлгоритмов.АктивнаяТочкаМаршрута";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТекстСообщения = СтрШаблон(НСтр("ru='Работа со схемой алгоритма ""%1"" не завершена. Не заполнены свойства выделенных точек.';
									|en='Work with the chart of ""%1"" is not complete. Not filled properties of the selected points.'"),
							  Алгоритм);
				
	Результат = Новый Структура; 
	Результат.Вставить("ВсеТочкиЗаполнены", РезультатЗапроса.Пустой());
	Результат.Вставить("Ошибки", 	ТекстСообщения);
	
	Возврат Результат;
	
КонецФункции

Функция ТочкиАлгоритма(Алгоритм)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТочкиАлгоритмов.Ссылка КАК ТочкаАлгоритма,
	|	ТочкиАлгоритмов.ВидТочки КАК ВидТочки,
	|	ТочкиАлгоритмов.ИдентификаторТочки КАК ИдентификаторТочки,
	|	ТочкиАлгоритмов.Наименование КАК Наименование
	|ПОМЕСТИТЬ ТочкиАлгоритмов
	|ИЗ
	|	Справочник.бит_ТочкиАлгоритмов КАК ТочкиАлгоритмов
	|ГДЕ
	|	ТочкиАлгоритмов.Владелец = &Алгоритм
	|	И НЕ ТочкиАлгоритмов.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТочкаАлгоритма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТочкиАлгоритмов.ТочкаАлгоритма КАК ТочкаАлгоритма,
	|	МАКСИМУМ(ТочкиАлгоритмов.ВидТочки) КАК ВидТочки,
	|	МАКСИМУМ(ТочкиАлгоритмов.ИдентификаторТочки) КАК ИдентификаторТочки,
	|	МАКСИМУМ(ТочкиАлгоритмов.Наименование) КАК Наименование,
	|	МАКСИМУМ(ЕСТЬNULL(ИсходящиеТочкиАлгоритма.Точка, ЗНАЧЕНИЕ(Справочник.бит_ТочкиАлгоритмов.ПустаяСсылка))) КАК ИсходящаяТочка
	|ИЗ
	|	ТочкиАлгоритмов КАК ТочкиАлгоритмов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ТочкиАлгоритмов.ИсходящиеТочки КАК ИсходящиеТочкиАлгоритма
	|		ПО ТочкиАлгоритмов.ТочкаАлгоритма = ИсходящиеТочкиАлгоритма.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТочкиАлгоритмов.ТочкаАлгоритма";
	Запрос.УстановитьПараметр("Алгоритм", Алгоритм);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция АлгоритмПоНаименованию(Наименование, Группа)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АлгоритмыПроцессов.Ссылка КАК Алгоритм
	|ИЗ
	|	Справочник.бит_АлгоритмыПроцессов КАК АлгоритмыПроцессов
	|ГДЕ
	|	АлгоритмыПроцессов.Наименование = &Наименование
	|	И АлгоритмыПроцессов.Ссылка В ИЕРАРХИИ(&Группа)
	|	И НЕ АлгоритмыПроцессов.ПометкаУдаления
	|	И НЕ АлгоритмыПроцессов.ЭтоГруппа";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Группа", Группа);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Алгоритм;
	КонецЕсли;
	
	Возврат Справочники.бит_АлгоритмыПроцессов.ПустаяСсылка();
	
КонецФункции

#КонецОбласти 

#КонецЕсли
