
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДоступныеОбъектыВизирования();
	
	Элементы.Представление.СписокВыбора.Добавить(Запись.Представление);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектВизированияПриИзменении(Элемент)
	
	Запись.Идентификатор        = Неопределено;
	Запись.Представление        = Неопределено;
	Запись.ВнешняяОбработка     = Неопределено;
	Запись.МенеджерПечати       = Неопределено;
	Запись.ЕстьУсловияВидимости = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.Представление.СписокВыбора.Очистить();
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора         = ПечатныеФормыОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Запись, ВыбранноеЗначение);
	
	Элементы.Представление.СписокВыбора.Очистить();
	Элементы.Представление.СписокВыбора.Добавить(ВыбранноеЗначение.Представление);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДоступныеОбъектыВизирования()
	
	Элементы.ОбъектВизирования.СписокВыбора.Очистить();
	
	Идентификаторы = ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(Метаданные.ОпределяемыеТипы.бит_ОбъектыВизирования.Тип.Типы());
	
	Для каждого ЭлементСоответствия Из Идентификаторы Цикл
		Элементы.ОбъектВизирования.СписокВыбора.Добавить(ЭлементСоответствия.Значение, Строка(ЭлементСоответствия.Значение));
	КонецЦикла;
	
	Элементы.ОбъектВизирования.СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаСервере
Функция ПечатныеФормыОбъекта()
	
	ПечатныеФормы = Новый СписокЗначений;
	
	ИдентификаторОбъектаВизирования = Запись.ОбъектВизирования;
	Если НЕ ЗначениеЗаполнено(ИдентификаторОбъектаВизирования) Тогда
		Возврат ПечатныеФормы;
	КонецЕсли;
	
	ИменаОбъектов = Справочники.ИдентификаторыОбъектовМетаданных.ПолныеИменаОбъектовМетаданныхВключаяУдаленные(
						ИдентификаторОбъектаВизирования);
	ПолноеИмяОбъектаВизирования = ИменаОбъектов.Получить(ИдентификаторОбъектаВизирования);
	
	КэшФормы = ПодключаемыеКомандыПовтИсп.КэшФормы(ИмяФормы, ПолноеИмяОбъектаВизирования, Истина);
	Для каждого КомандаОбъекта Из КэшФормы.Команды Цикл
		Если КомандаОбъекта.Вид <> "Печать" Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеПечатнойФормы = Новый Структура("Идентификатор, Представление, МенеджерПечати, ВнешняяОбработка, ЕстьУсловияВидимости");
		ЗаполнитьЗначенияСвойств(ДанныеПечатнойФормы, КомандаОбъекта);
		
		ДополнительныеПараметрыКоманды = КомандаОбъекта.ДополнительныеПараметры;
		Если ДополнительныеПараметрыКоманды.МенеджерПечати <> ПолноеИмяОбъектаВизирования Тогда
			ДанныеПечатнойФормы.МенеджерПечати = ДополнительныеПараметрыКоманды.МенеджерПечати;
		КонецЕсли;
		
		ДополнительныеПараметры = ДополнительныеПараметрыКоманды.ДополнительныеПараметры;
		Если ДополнительныеПараметры.Свойство("Ссылка")
			И ТипЗнч(ДополнительныеПараметры.Ссылка) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки")
			И ЗначениеЗаполнено(ДополнительныеПараметры.Ссылка) Тогда
			ДанныеПечатнойФормы.ВнешняяОбработка = ДополнительныеПараметры.Ссылка;
		КонецЕсли;
		
		ПечатныеФормы.Добавить(ДанныеПечатнойФормы, КомандаОбъекта.Представление);
	КонецЦикла;
	
	Возврат ПечатныеФормы;
	
КонецФункции

#КонецОбласти