
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	// Заполним структуру параметров
	фСтруктураПараметров = Новый Структура;
	Если Параметры.Свойство("СтруктураПараметров") Тогда
		Для каждого ТекПараметр Из Параметры.СтруктураПараметров Цикл
			фСтруктураПараметров.Вставить(ТекПараметр.Ключ, ТекПараметр.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ фСтруктураПараметров.Свойство("ИмяМакета") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКэшЗначений();
	
	// Инициализируем настройки компоновщика
	АдресСхемыКомпоновкиДанных = Обработки.бит_пз_ПодборЗаявокНаЗатраты.ИнициализироватьКомпоновщик(Объект.Компоновщик, УникальныйИдентификатор, "СКД");
	
	Элементы.КомпоновщикПользовательскиеНастройки.РежимОтображения = РежимОтображенияНастроекКомпоновкиДанных.БыстрыйДоступ;	
	
	// Установим заголовок формы
	ЭтотОбъект.АвтоЗаголовок = Ложь;
	
	УстановитьЗначенияПоУмолчанию();
	
	ЗаполнитьПользовательскиеНастройкиМакета();
	
	// Настроим отображение полей доп. аналитик в табличном поле Результат.
	бит_МеханизмДопИзмерений.ОтобразитьДополнительныеИзмеренияВТабличномПоле_Управляемая(ЭтотОбъект
																							,"Товары"
																							,фКэшЗначений.ИзмеренияДоп
																							,фКэшЗначений.НастройкиИзмерений);
																							
	ВидимостьНазначенныхАналитик();
	
	// Сразу получаем результат запроса
	ПолучитьРезультатЗапроса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ПолучитьРезультатЗапроса();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)

	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.Товары, "Изменить", 1, Элементы.Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.Товары, "Изменить", 0, Элементы.Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.Товары, "Изменить", 2, Элементы.Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаявки(Команда)
	
	ПеренестиЗаявки("Добавить");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаявки(Команда)
	
	ПеренестиЗаявки("Загрузить");
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСНастройками

//  Процедура - действие команды "КомандаСохранитьНастройки".
// 
&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	
	ПараметрыФормы     = Новый Структура;
	СтруктураНастройки = УпаковатьНастройкиВСтруктуру();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СтруктураНастройки);
	ПараметрыФормы.Вставить("ТипНастройки"		 , фКэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", фКэшЗначений.НастраиваемыйОбъект);
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
	
		ПараметрыФормы.Вставить("СохраненнаяНастройка",ТекущаяНастройка);
	
	КонецЕсли; 
		
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройки",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // КомандаСохранитьНастройки()

//  Процедура - обработчик оповещения о закрытии формы сохранения настроек. 
// 
&НаКлиенте
Процедура СохранитьНастройки(СохрНастройка, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(СохрНастройка) Тогда
		
		ТекущаяНастройка = СохрНастройка;
		УстановитьЗаголовокФормы();
		
	КонецЕсли;
	
КонецПроцедуры // СохранитьНастройки()

//  Процедура - действие команды "КомандаВосстановитьНастройки".
// 
&НаКлиенте
Процедура КомандаВосстановитьНастройки(Команда)
	
	ПараметрыФормы     = Новый Структура;
	ПараметрыФормы.Вставить("ТипНастройки"		 , фКэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", фКэшЗначений.НастраиваемыйОбъект);
	
	Оповещение = Новый ОписаниеОповещения("ПрименениеНастроек",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // КомандаВосстановитьНастройки()

//  Процедура - обработчик оповещения о закрытии формы применения настроек. 
// 
&НаКлиенте 
Процедура ПрименениеНастроек(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда        
		
		ПрименитьНастройки(Результат);
		
	КонецЕсли;	
	
КонецПроцедуры // ПрименениеНастроек

//  Функция готовит стуктуру с настройками для сохранения.
// 
// Возвращаемое значение:
//   СтруктураНастройки   - Структура
// 
&НаСервере
Функция УпаковатьНастройкиВСтруктуру()

	СтруктураНастройки = Новый Структура;
	
	СтруктураНастройки.Вставить("ПользовательскиеНастройки", Новый ХранилищеЗначения(Объект.Компоновщик.ПользовательскиеНастройки));
	
	Возврат СтруктураНастройки;
	
КонецФункции // УпаковатьНастройкиВСтруктуру()

//  Функция применяет сохраненные настройки.
// 
// Параметры:
//  ВыбНастройка  - СправочникСсылка.бит_СохраненныеНастройки
// 
&НаСервере
Функция ПрименитьНастройки(ВыбНастройка)

	Если ЗначениеЗаполнено(ВыбНастройка) Тогда
		
		СтруктураНастроек = ВыбНастройка.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			
			ПользовательскиеНастройки = СтруктураНастроек.ПользовательскиеНастройки.Получить();
			
			Объект.Компоновщик.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
			
			ТекущаяНастройка = ВыбНастройка;
			УстановитьЗаголовокФормыСервер();				
				
		КонецЕсли;	 
		
	КонецЕсли; 
	
КонецФункции // ПрименитьНастройки()

//  Процедура устанавливает настройку либо из последних использованных, 
// 	либо из настройки по умолчанию.
// 
&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	// Получим настройку по - умолчанию и последнюю использованную.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТипНастройки"			  , Перечисления.бит_ТипыСохраненныхНастроек.Обработки);
	СтруктураПараметров.Вставить("НастраиваемыйОбъект"    , фКэшЗначений.НастраиваемыйОбъект);
	СтруктураПараметров.Вставить("ИспользоватьПриОткрытии", Истина);
	СохрНастройка = Справочники.бит_СохраненныеНастройки.ПолучитьНастройкуПоУмолчанию(СтруктураПараметров);
	
	Если ЗначениеЗаполнено(СохрНастройка) Тогда
		
		ПрименитьНастройки(СохрНастройка);
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьЗначенияПоУмолчанию()

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

//  Процедура заполняет кэш значений, необходимый при работе на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	фКэшЗначений = Новый Структура;
	
	фКэшЗначений.Вставить("ТипНастройки", Перечисления.бит_ТипыСохраненныхНастроек.Обработки);
	фКэшЗначений.Вставить("НастраиваемыйОбъект", "Обработка.бит_пз_ПодборЗаявокНаЗатраты");
	
	фКэшЗначений.Вставить("ИзмеренияДоп"       , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним"));
	фКэшЗначений.Вставить("НастройкиИзмерений" , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

//  Процедура выполняет запрос и заполняет табличную часть "Результат".
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура ПолучитьРезультатЗапроса()

	ЭлементыУпорядочивания = Неопределено;
	Результат = Обработки.бит_пз_ПодборЗаявокНаЗатраты.ВыполнитьЗапросПоНастройке(Объект.Компоновщик, 
											АдресСхемыКомпоновкиДанных, ЭлементыУпорядочивания);
	
	Если Результат.Количество() = 0 Тогда
	
		ТекстСообщения = НСтр("ru='Нет данных, удовлетворяющих отбору';en='No data satisfying the selection'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	КонецЕсли; 
	
	Объект.Товары.Загрузить(Результат);

	// Если не заполнена НДС подставляем 20.
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтавкаНДС) Тогда		
			СтрокаТЧ.СтавкаНДС = бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);		
		КонецЕсли; 
		
		// Заполним сумму НДС.
		СтрокаТЧ.СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(
								СтрокаТЧ.Сумма, Истина, Ложь,
								бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(СтрокаТЧ.СтавкаНДС));
											
		СтрокаТЧ.СуммаСНДС = СтрокаТЧ.СуммаНДС + СтрокаТЧ.Сумма;									
											
	КонецЦикла;
	
	// Упорядочивание.
	Если ЭлементыУпорядочивания <> Неопределено Тогда
	
		Для каждого элУп Из ЭлементыУпорядочивания Цикл
		
			Если элУп.Использование Тогда
			
				Если элУп.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр Тогда
				
					Объект.Товары.Сортировать(Строка(элУп.Поле)+" Возр");
					
				Иначе 	
					Объект.Товары.Сортировать(Строка(элУп.Поле)+" Убыв");
				КонецЕсли; 
			
			КонецЕсли; 
		
		КонецЦикла; 
	
	КонецЕсли; 
	
КонецПроцедуры // ПолучитьРезультатЗапроса() 

//  Процедура устанавливает заголовок формы на клиенте.
// 
&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		
		ЭтотОбъект.Заголовок = "Подбор заявок на затраты ("+ТекущаяНастройка+")";
		
		
	Иначе	
		
		ЭтотОбъект.Заголовок = "Подбор заявок на затраты";
		
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьЗаголовокФормы()

//  Процедура устанавливает заголовок формы на сервере.
// 
&НаСервере
Процедура УстановитьЗаголовокФормыСервер()
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		
		ЭтотОбъект.Заголовок = "Подбор заявок на затраты ("+ТекущаяНастройка+")";
		
		
	Иначе	
		
		ЭтотОбъект.Заголовок = "Подбор заявок на затраты";
		
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьЗаголовокФормыСервер()

//  Процедура управляет видимостью полей назначенных аналитик.
// 
&НаСервере
Процедура ВидимостьНазначенныхАналитик()

	СовпадающиеАналитики = Новый Соответствие;
	
	МассивТипов = Новый Массив;
	
	Для каждого Реквизит Из Метаданные.Обработки.бит_пз_ПодборЗаявокНаЗатраты.ТабличныеЧасти.Товары.Реквизиты Цикл
	                         
		Если Найти(Реквизит.Имя, "Аналитика")=0 Тогда
		
			Для каждого ТипРек Из Реквизит.Тип.Типы() Цикл
			
				Если НЕ ТипРек = Тип("Булево")
					И НЕ ТипРек = Тип("Дата")
					И НЕ ТипРек = Тип("Строка")
					И НЕ ТипРек = Тип("Число") Тогда
					
					СтрРекв = Новый Структура("Имя, Тип", Реквизит.Имя, ТипРек);
					МассивТипов.Добавить(СтрРекв);
				
				КонецЕсли; 
			
			КонецЦикла; 
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Настр = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	Для каждого Аналит Из Настр Цикл
		
		Если НЕ Аналит.Значение.ЭтоСоставнойТип Тогда 
		
			Для каждого СтрРекв Из МассивТипов Цикл
				
				ТипРек = СтрРекв.Тип;
				Если Аналит.Значение.ТипЗначения.СодержитТип(ТипРек) Тогда 
					СовпадающиеАналитики.Вставить(Аналит.Ключ, СтрРекв.Имя);
					Прервать;
				КонецЕсли;
			
			КонецЦикла; 
			
		КонецЕсли;	
			
	КонецЦикла; 
	
	Для каждого Соотв Из СовпадающиеАналитики Цикл
	
		ИмяАналитики = Соотв.Ключ; 
		Элементы["Товары"+ИмяАналитики].Видимость = Ложь;
	
	КонецЦикла; 
	
КонецПроцедуры // ВидимостьНазначенныхАналитик()

//  Процедура переносит заявки на затраты.
// 
// Параметры:
//  ИмяКоманды - Строка.
// 
&НаКлиенте
Процедура ПеренестиЗаявки(ИмяКоманды)

	УпакованнаяТаблица = УпаковатьТаблицуЗначений();

	Если УпакованнаяТаблица <> Неопределено Тогда
		
		СтрПереноса = Новый Структура;
		СтрПереноса.Вставить("Хранилище", УпакованнаяТаблица);
		
		Если ИмяКоманды = "Загрузить" Тогда
		
			СтрПереноса.Вставить("ОчищатьТабЧасть", Истина);
			
		Иначе	
			СтрПереноса.Вставить("ОчищатьТабЧасть", Ложь);
		КонецЕсли; 
		
		Оповестить(фСтруктураПараметров.ИмяСобытия, СтрПереноса, ЭтотОбъект.ВладелецФормы);	
		
	КонецЕсли; 
	
КонецПроцедуры // ПеренестиЗаявки()

//  Процедура упаковывает в таблицу значений строки для переноса.
// 
&НаСервере
Функция УпаковатьТаблицуЗначений()

	СтрОтбора = Новый Структура("Изменить", Истина);
	СтрокиДляПереноса = Объект.Товары.НайтиСтроки(СтрОтбора);

	Если СтрокиДляПереноса.Количество() = 0 Тогда
		Возврат Неопределено;		
	КонецЕсли;	
		
	ТаблицаСтрок = Объект.Товары.Выгрузить(СтрокиДляПереноса);
	УпакованнаяТаблица = бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТаблицаСтрок);
	
	Возврат УпакованнаяТаблица;
	
КонецФункции // УпаковатьТаблицуЗначений()

//  Процедура заполняет пользовательские настройки из текущего документа.
// 
&НаСервере
Процедура ЗаполнитьПользовательскиеНастройкиМакета()

	ПользоватНастройки = Объект.Компоновщик.ПолучитьНастройки();
	
	Для каждого Настр Из ПользоватНастройки.Отбор.Элементы Цикл
	
		ИмяНастройки = Строка(Настр.ЛевоеЗначение);
		
		Если ИмяНастройки = "Организация" 
			И ЗначениеЗаполнено(фСтруктураПараметров.Документ["Организация"]) Тогда
		
			Настр.Использование = Истина;
			Настр.ПравоеЗначение = фСтруктураПараметров.Документ["Организация"];
		
		КонецЕсли; 
		
		Если ИмяНастройки = "Контрагент" 
			И ЗначениеЗаполнено(фСтруктураПараметров.Документ["Контрагент"]) Тогда
		
			Настр.Использование = Истина;
			Настр.ПравоеЗначение = фСтруктураПараметров.Документ["Контрагент"];
		
		КонецЕсли; 
		
		Если ИмяНастройки = "ВидОперации" 
			И ЗначениеЗаполнено(фСтруктураПараметров.Документ["ВидОперации"]) Тогда
		
			Настр.Использование = Истина;
			Настр.ПравоеЗначение = фСтруктураПараметров.Документ["ВидОперации"];
		
		КонецЕсли; 
		
		Если ИмяНастройки = "ВалютаДокумента" 
			И ЗначениеЗаполнено(фСтруктураПараметров.Документ["ВалютаДокумента"]) Тогда
		
			Настр.Использование = Истина;
			Настр.ПравоеЗначение = фСтруктураПараметров.Документ["ВалютаДокумента"];
		
		КонецЕсли; 
		
	КонецЦикла; 
	
	Объект.Компоновщик.ЗагрузитьНастройки(ПользоватНастройки);
	
КонецПроцедуры // ЗаполнитьПользовательскиеНастройкиМакета()

#КонецОбласти

