////////////////////////////////////////////////////////////////////////////////
// Даты запрета изменения: расширение функционал подсистемы БСП.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения().
//
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "бит_Бюджетирование";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("cb9767ea-9c3f-4328-9140-64b3ffea3089");
	Раздел.Представление = НСтр("ru = 'Бюджетирование (БИТ)'; en = 'Budget (BIT)'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.бит_ГруппыЗапретаИзмененияДанныхБюджетирования"));
	
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения().
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.ПолноеИмя(),
        "Период", "бит_Бюджетирование", "КлючСценарийЦФО.ГруппаЗапретаИзменения");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Метаданные.РегистрыБухгалтерии.бит_Бюджетирование.ПолноеИмя(),
        "Период", "бит_Бюджетирование", "КлючСценарийЦФО.ГруппаЗапретаИзменения");	
	
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ПередПроверкойЗапретаИзменения()
//  Проверяет дополнительное свойство объекта с ключом ОтключитьПроверкуДатыЗапретаИзменения.
//  Если значение свойства Истина, то проверка даты запрета изменения не производится.
//
Процедура ПередПроверкойЗапретаИзменения(Объект, ПроверкаЗапретаИзменения, УзелПланаОбмена, ВерсияОбъекта) Экспорт
	
	Если Объект.ДополнительныеСвойства.Свойство("ОтключитьПроверкуДатыЗапретаИзменения")
		И Объект.ДополнительныеСвойства.ОтключитьПроверкуДатыЗапретаИзменения Тогда
		
		ПроверкаЗапретаИзменения = Ложь;
		УзелПроверкиЗапретаЗагрузки = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
