
Перем мДатаНачДерево Экспорт;
Перем мДатаКонДерево Экспорт;

Перем мРазрешитьВыводСтраницРЦ Экспорт;

Перем мСтруНастройкиВнешнегоВызова Экспорт;

//--------------------------------------------------------------------------------------

#Если Клиент Тогда
	
Перем мЦветаСтатусовВыполнения Экспорт;
Перем мЦветаСтатусовОбеспечения Экспорт;
Перем мЦветаСтатусовОбеспеченияМатериалами Экспорт;

Перем мНазваниеОбработки;
Перем мТекущаяНастройка Экспорт; // текущая настройка формы
Перем мВосстанавливатьНастройкиПриОткрытии Экспорт;
Перем мСоответствиеСвойствКатегорийИИзмерений_ПостроительОтчета;

//==================== ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ПОСТРОИТЕЛЕМ ====================

Функция ДобавитьОтбор(ПутьКДанным, Использование = Неопределено, ВидСравнения = Неопределено, Значение = Неопределено, ЗначениеС = Неопределено, ЗначениеПо = Неопределено) Экспорт
	
	ДобавляемыйЭлементОтбора = Неопределено;
	
	Для Каждого ЭлементОтбора из ПостроительОтчета.Отбор Цикл
		Если ЭлементОтбора.ПутьКДанным = ПутьКДанным Тогда
			ДобавляемыйЭлементОтбора = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ДобавляемыйЭлементОтбора = Неопределено Тогда
		Попытка ДобавляемыйЭлементОтбора = ПостроительОтчета.Отбор.Добавить(ПутьКДанным) Исключение	Возврат Ложь КонецПопытки;
	КонецЕсли;
	
	Если Использование <> Неопределено Тогда
		ДобавляемыйЭлементОтбора.Использование = Использование;
	КонецЕсли;
	
	Если ВидСравнения <> Неопределено Тогда
		ДобавляемыйЭлементОтбора.ВидСравнения = ВидСравнения;
	КонецЕсли;
	
	Если Значение <> Неопределено Тогда
		ДобавляемыйЭлементОтбора.Значение = Значение;
	КонецЕсли;
	
	Если ЗначениеС <> Неопределено Тогда
		ДобавляемыйЭлементОтбора.ЗначениеС = ЗначениеС;
	КонецЕсли;
	
	Если ЗначениеПо <> Неопределено Тогда
		ДобавляемыйЭлементОтбора.ЗначениеПо = ЗначениеПо;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции 

Функция ПолеНачалоВыбора(Расшифровка = Неопределено, НачальноеЗначениеВыбора = Неопределено) Экспорт
	
	ФормаВыборПоля = ПолучитьОбщуюФорму("ПостроительОтчета_ФормаВыборПоля");
	
	ФормаВыборПоля.ПостроительОтчета 						= ПостроительОтчета;
	ФормаВыборПоля.мСоответствиеСвойствКатегорийИИзмерений 	= мСоответствиеСвойствКатегорийИИзмерений_ПостроительОтчета;
	
	ФормаВыборПоля.Расшифровка 								= Расшифровка;
	ФормаВыборПоля.НачальноеЗначениеВыбора 					= НачальноеЗначениеВыбора;
	
	ФормаВыборПоля.Измерение 								= Ложь;
	ФормаВыборПоля.Отбор 									= Ложь;
	ФормаВыборПоля.Поле 									= Ложь;
	ФормаВыборПоля.Порядок 									= Ложь;
	ФормаВыборПоля.ДочерниеПоля 							= Истина;
	
	Возврат ФормаВыборПоля.ОткрытьМодально();
	
КонецФункции 

Процедура ПолеОбработкаВыбора(Элемент, Выбор, ЭлементФормыТабличноеПоле, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Выбор = Неопределено ИЛИ Выбор.Количество() = 0 Тогда
		ЭлементФормыТабличноеПоле.ЗакончитьРедактированиеСтроки(Истина);
		Возврат;
	КонецЕсли;
		
	Если Выбор.Количество() = 1 И ТипЗнч(Выбор[0].ПутьКДанным) <> Тип("Массив") Тогда
				
		Элемент.Значение = Выбор[0].ПутьКДанным; 
		
		глУстановитьПредставлениеПараметра(ЭлементФормыТабличноеПоле.ТекущиеДанные);
		// переопределим представление 		
		Элемент.Значение = ЭлементФормыТабличноеПоле.ТекущиеДанные.Представление;
		
	Иначе
		
		Для Каждого ВыбранноеЗначение из Выбор Цикл
			Если ТипЗнч(ВыбранноеЗначение.ПутьКДанным) = Тип("Массив") Тогда
				Для Каждого ПутьКДанным из ВыбранноеЗначение.ПутьКДанным Цикл
					ДобавитьОтбор(ПутьКДанным);
				КонецЦикла;
			Иначе
				ДобавитьОтбор(ВыбранноеЗначение.ПутьКДанным);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//==================== ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ==============================

Функция СекундыВДниЧасы(ВхСекунды) Экспорт  
	
	Если ВхСекунды = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	_СтрДниЧасы = "";
	_ТекСекунды = ВхСекунды;
	
	_Час = 60*60;
	_Часов = Цел(_ТекСекунды/_Час);
	_ТекСекунды = _ТекСекунды - _Часов * _Час;
	_СтрДниЧасы = _СтрДниЧасы + Формат(_Часов, "ЧН=0") + ":";
	
	_Минута = 60;
	_Минут = Цел(_ТекСекунды/_Минута);
	_ТекСекунды = _ТекСекунды - _Минут * _Минута;
	_СтрДниЧасы = _СтрДниЧасы + Формат(_Минут, "ЧЦ=2; ЧН=00; ЧВН=") + ":";
	
	_СтрДниЧасы = _СтрДниЧасы + Формат(_ТекСекунды, "ЧЦ=2; ЧН=00; ЧВН=");
	
	Возврат _СтрДниЧасы;
	
КонецФункции

Процедура УстановитьЗначениеПометкиСтроки(ВхСтрока, ВхЗнач) Экспорт 
	
	Если ВхСтрока.ТипСоставляющей = "Период" И ВхСтрока.Строки.Количество() = 0 Тогда 
		Возврат;	
	КонецЕсли;
	
	Если ВхСтрока.ТипСоставляющей = "ДокЗаказНаПроизводство" Тогда 
		ТаблЗаказы.Найти(ВхСтрока.Составляющая, "ДокЗаказ").Пометка = ВхЗнач;	
	КонецЕсли;
	
	ВхСтрока.Пометка = ВхЗнач;
		
	ИзменитьЗначениеПометкиПодчинненыхСтрок(ВхСтрока, ВхЗнач);
	
	ИзменитьЗначениеПометкиРодительскойСтроки(ВхСтрока.Родитель);
	
КонецПроцедуры	

Процедура ИзменитьЗначениеПометкиПодчинненыхСтрок(ВхСтрока, ВхЗнач) 
		
	Для Каждого Строка Из ВхСтрока.Строки Цикл
		
		Если Строка.ТипСоставляющей = "ДокЗаказНаПроизводство" Тогда 
			ТаблЗаказы.Найти(Строка.Составляющая, "ДокЗаказ").Пометка = ВхЗнач;	
		КонецЕсли;

		Строка.Пометка = ВхЗнач;
		ИзменитьЗначениеПометкиПодчинненыхСтрок(Строка, ВхЗнач);
		
	КонецЦикла;	

КонецПроцедуры	

Процедура ИзменитьЗначениеПометкиРодительскойСтроки(ВхСтрока) 
	
	Если ВхСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли;
		
	ВхСтрока.Пометка = Истина;
	Для Каждого Строка Из ВхСтрока.Строки Цикл
		ВхСтрока.Пометка = ВхСтрока.Пометка И Строка.Пометка;	
	КонецЦикла; 	
	
	ИзменитьЗначениеПометкиРодительскойСтроки(ВхСтрока.Родитель);
	
КонецПроцедуры	


Процедура ОбработатьСвязанныеЗаказы_ОбновлениеТаблЗаказы() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗапроса.ДокЗаказОбеспечения,
	|	ТаблицаЗапроса.ДокЗаказПотребность,
	|	ТаблицаЗапроса.ДокЗаказОбеспечения.ДатаИсполнения КАК ДокЗаказОбеспеченияДатаИсполнения,
	|	ТаблицаЗапроса.ДокЗаказПотребность.ДатаИсполнения КАК ДокЗаказПотребностьДатаИсполнения,
	|	ТаблицаЗапроса.ДокЗаказОбеспечения.ДатаОбеспеченияПотребностей КАК ДокЗаказОбеспеченияДатаОбеспеченияПотребностей,
	|	ТаблицаЗапроса.ДокЗаказПотребность.ДатаОбеспеченияПотребностей КАК ДокЗаказПотребностьДатаОбеспеченияПотребностей
	|ИЗ
	|	(ВЫБРАТЬ
	|		РазмещениеЗаказовОстатки.ВЗаказе КАК ДокЗаказОбеспечения,
	|		РазмещениеЗаказовОстатки.ДокЗаказ КАК ДокЗаказПотребность
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказов.Остатки(
	|				,
	|				ДокЗаказ В (&СпЗаказы)
	|					ИЛИ ВЗаказе В (&СпЗаказы)) КАК РазмещениеЗаказовОстатки) КАК ТаблицаЗапроса";
	
	Запрос.УстановитьПараметр("СпЗаказы", ТаблЗаказы.ВыгрузитьКолонку("ДокЗаказ"));
	ТаблРез = Запрос.Выполнить().Выгрузить();
	
	Для Каждого строка_ТаблЗаказы Из ТаблЗаказы Цикл
		
		// 1. поиск проблемных заказов по иерархии вверх ("Заказы потребность")
		стру_Отбор = Новый Структура("ДокЗаказОбеспечения", строка_ТаблЗаказы.ДокЗаказ);
		масс_ТаблЗаказыПотребность = ТаблРез.НайтиСтроки(стру_Отбор);
		
		Для Каждого строка_ТаблЗаказыПотребность Из масс_ТаблЗаказыПотребность Цикл
			
			Если глПустоеЗначение(строка_ТаблЗаказыПотребность.ДокЗаказПотребность) Тогда
				Продолжить;	
			КонецЕсли;	
			
			Если глПустоеЗначение(строка_ТаблЗаказыПотребность.ДокЗаказПотребностьДатаОбеспеченияПотребностей)
				ИЛИ строка_ТаблЗаказы.ДатаИсполнения >  строка_ТаблЗаказыПотребность.ДокЗаказПотребностьДатаОбеспеченияПотребностей Тогда
				
				строка_ТаблЗаказы.ЕстьОшибкиВЗаказахПотребность = Истина;
				Прервать;
				
			КонецЕсли;				 
			
		КонецЦикла;	
		
		// 2. поиск проблемных заказов по иерархии вниз ("Заказы обеспечения")
		стру_Отбор = Новый Структура("ДокЗаказПотребность", строка_ТаблЗаказы.ДокЗаказ);
		масс_ТаблЗаказыОбеспечения = ТаблРез.НайтиСтроки(стру_Отбор);
		
		Для Каждого строка_ТаблЗаказыОбеспечения Из масс_ТаблЗаказыОбеспечения Цикл
			
			Если глПустоеЗначение(строка_ТаблЗаказыОбеспечения.ДокЗаказОбеспечения) Тогда
				Продолжить;	
			КонецЕсли;	

			Если глПустоеЗначение(строка_ТаблЗаказыОбеспечения.ДокЗаказОбеспеченияДатаИсполнения)
				ИЛИ строка_ТаблЗаказы.ДатаОбеспеченияПотребностей < строка_ТаблЗаказыОбеспечения.ДокЗаказОбеспеченияДатаИсполнения Тогда
				
				строка_ТаблЗаказы.ЕстьОшибкиВЗаказахОбеспечения = Истина;
				Прервать;
				
			КонецЕсли;				 
			
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьДополнительныеПоляПоЗаказуПокупателя() Экспорт 
	
	_ТаблЗаказыВрем = Неопределено;
    _ДатаИсполнения = '00010101';
	
	_ИндСтр = 0;
	Пока _ИндСтр < ТаблЗаказы.Количество() Цикл
		
		СтрокаТаблЗаказы = ТаблЗаказы[_ИндСтр];
		
		Если глПустоеЗначение(СтрокаТаблЗаказы.ДокЗаказПокупателя) Тогда
			
			СтрокаТаблЗаказы.ДокЗаказПокупателя					= глПолучитьЗаказПокупателя(СтрокаТаблЗаказы.ДокЗаказ, _ТаблЗаказыВрем, _ДатаИсполнения);
			СтрокаТаблЗаказы.ДокЗаказПокупателяДатаИсполнения	= _ДатаИсполнения;
			
		КонецЕсли;	

		Если ПостроительОтчета.Отбор.ДокЗаказПокупателя.Использование Тогда
			
			ВидСравненияОтбора	= ПостроительОтчета.Отбор.ДокЗаказПокупателя.ВидСравнения; 
			ЗначениеОтбора		= ПостроительОтчета.Отбор.ДокЗаказПокупателя.Значение;
			
			Если (ВидСравненияОтбора = ВидСравнения.Равно И НЕ ЗначениеОтбора = СтрокаТаблЗаказы.ДокЗаказПокупателя)
					ИЛИ (ВидСравненияОтбора = ВидСравнения.НеРавно	 И ЗначениеОтбора = СтрокаТаблЗаказы.ДокЗаказПокупателя)
		 			ИЛИ (ВидСравненияОтбора = ВидСравнения.ВСписке	 И ЗначениеОтбора.НайтиПоЗначению(СтрокаТаблЗаказы.ДокЗаказПокупателя) = Неопределено)
					ИЛИ (ВидСравненияОтбора = ВидСравнения.НеВСписке И НЕ ЗначениеОтбора.НайтиПоЗначению(СтрокаТаблЗаказы.ДокЗаказПокупателя) = Неопределено) Тогда
				
				ТаблЗаказы.Удалить(СтрокаТаблЗаказы);
				
				Продолжить;
				
			КонецЕсли;	
				
		КонецЕсли;	
		
		_ИндСтр = _ИндСтр + 1;
		
	КонецЦикла;	

	// добавим индекс
	ТаблЗаказы.Индексы.Добавить("ДокЗаказПокупателя");
	
КонецПроцедуры	

Процедура РедактироватьСтатусВыполненияЗаказа(ВхЗаказ, ВхСтатус) Экспорт 
	
	запись_СтатусыВыполненияЗаказов = РегистрыСведений.СтатусыВыполненияЗаказов.СоздатьМенеджерЗаписи();
	запись_СтатусыВыполненияЗаказов.Заказ = ВхЗаказ;
	запись_СтатусыВыполненияЗаказов.Прочитать();
	
	_СтарыйСтатус = запись_СтатусыВыполненияЗаказов.Статус;
	
	запись_СтатусыВыполненияЗаказов.Статус 	= ВхСтатус;
	запись_СтатусыВыполненияЗаказов.Заказ 	= ВхЗаказ;
	
	запись_СтатусыВыполненияЗаказов.Записать();
	
	запись_СтатусыВыполненияЗаказов.Прочитать();
	Если НЕ запись_СтатусыВыполненияЗаказов.Статус = _СтарыйСтатус Тогда
		
		СтатусыЗаказов.ПроверитьСтатусыЗаказа(ВхЗаказ.Ссылка);
		
	КонецЕсли;
	
	//Если все таки изменение статуса валидно, то проверяем установку утвержденности
	запись_СтатусыВыполненияЗаказов.Прочитать();
	Если НЕ запись_СтатусыВыполненияЗаказов.Статус = _СтарыйСтатус Тогда
		
		Если НЕ ВхЗаказ.Утвержден = запись_СтатусыВыполненияЗаказов.Статус.УтверждатьЗаказ Тогда
			
			_ДокЗаказОбъект = ВхЗаказ.ПолучитьОбъект();
			
			_ДокЗаказОбъект.Утвержден = запись_СтатусыВыполненияЗаказов.Статус.УтверждатьЗаказ;
			_ДокЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗначениеДеревоАльтернативныеРЦ(ВхИмяКолонки, ВхЗначение, ВхСтрокаДерева)
	
	_КолонкаДеревоАльтернативныеРЦ = ДеревоАльтернативныеРЦ.Колонки.Найти(ВхИмяКолонки);		
	Если _КолонкаДеревоАльтернативныеРЦ = Неопределено Тогда 
		_КолонкаДеревоАльтернативныеРЦ = ДеревоАльтернативныеРЦ.Колонки.Добавить(ВхИмяКолонки);
	КонецЕсли;
	
	ВхСтрокаДерева[ВхИмяКолонки] = ВхЗначение;

КонецПроцедуры

Процедура ДобавитьИнтервалыВЗначениеДГОтносительные(ВхЗначение, ВхЗначениеПоказателя, ВхПериодНачалаПостроения, ВхПоказательЦветовыхСхем)
	
	// Левая часть
	Если ВхЗначениеПоказателя < 0 Тогда
		
		_ИнтервалЗаливки = ВхПериодНачалаПостроения + 100 + Макс(ВхЗначениеПоказателя, -100);
		
		_Интервал = ВхЗначение.Добавить();	
		_Интервал.Начало 		= ВхПериодНачалаПостроения;	
		_Интервал.Конец 		= _ИнтервалЗаливки;
		_Интервал.Цвет 			= ЦветаСтиля.ЦветФонаКнопки; 
		
		_Интервал = ВхЗначение.Добавить();	
		_Интервал.Начало 		= _ИнтервалЗаливки;	
		_Интервал.Конец 		= ВхПериодНачалаПостроения + 100;
		
		стру_ЦветоваяСхема 	= РегистрыСведений.ЦветовыеСхемы.ПолучитьЦветовуюСхему(ВхПоказательЦветовыхСхем, ВхЗначениеПоказателя);
		_Интервал.Цвет 		= стру_ЦветоваяСхема.ЦветФона;
		
	Иначе //Если ВхЗначениеПоказателя >= 0 Тогда
		
		_Интервал = ВхЗначение.Добавить();	
		_Интервал.Начало 		= ВхПериодНачалаПостроения;	
		_Интервал.Конец 		= ВхПериодНачалаПостроения + 100;
		_Интервал.Цвет 			= ЦветаСтиля.ЦветФонаКнопки;
		
	КонецЕсли;
	
	// Разделитель	
	_Интервал = ВхЗначение.Добавить();	
	_Интервал.Начало 		= ВхПериодНачалаПостроения + 100;	
	_Интервал.Конец 		= ВхПериодНачалаПостроения + 101;
	_Интервал.Цвет 			= ЦветаСтиля.ЦветОтрицательногоЧисла;
		
	// Правая часть
	Если ВхЗначениеПоказателя >= 0 Тогда
		
		_ИнтервалЗаливки = ВхПериодНачалаПостроения + 101 + Мин(ВхЗначениеПоказателя, 100);
		
		Если ВхЗначениеПоказателя > 0 Тогда 
			
			_Интервал = ВхЗначение.Добавить();	
			_Интервал.Начало 		= ВхПериодНачалаПостроения + 101;	
			_Интервал.Конец 		= _ИнтервалЗаливки;
			
			стру_ЦветоваяСхема 	= РегистрыСведений.ЦветовыеСхемы.ПолучитьЦветовуюСхему(ВхПоказательЦветовыхСхем, ВхЗначениеПоказателя);
			_Интервал.Цвет 		= стру_ЦветоваяСхема.ЦветФона;
		
		КонецЕсли;
		
		_Интервал = ВхЗначение.Добавить();	
		_Интервал.Начало 		= _ИнтервалЗаливки;	
		_Интервал.Конец 		= _ИнтервалЗаливки + 100 - Макс(ВхЗначениеПоказателя, 0);
		_Интервал.Цвет 			= ЦветаСтиля.ЦветФонаКнопки;
		
		
	Иначе //Если ВхЗначениеПоказателя < 0 Тогда
		
		_Интервал = ВхЗначение.Добавить();	
		_Интервал.Начало 		= ВхПериодНачалаПостроения + 101;	
		_Интервал.Конец 		= ВхПериодНачалаПостроения + 201;
		_Интервал.Цвет 			= ЦветаСтиля.ЦветФонаКнопки;
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьИспользованиеПоказателя(ВхПоказатель)
	
	_Результат = Ложь;
	
	эл_Показатель = СписокПоказателей.НайтиПоЗначению(ВхПоказатель);
	
	Если НЕ эл_Показатель = Неопределено Тогда 
		_Результат = эл_Показатель.Пометка;	
	КонецЕсли;
	
	Возврат _Результат;
	
КонецФункции

Функция ПолучитьСтрокуПакетногоЗаказа(ВхСтрокаДерева, ВхСтрокаДанных)
	
	Если глПустоеЗначение(ВхСтрокаДанных.ПакетныйЗаказНаПроизводство) Тогда
		Возврат ВхСтрокаДерева; //Возвращаем саму строку получателя
	КонецЕсли;	
		
	масс_ДеревоПакетныйЗаказ = ВхСтрокаДерева.Строки.НайтиСтроки(Новый Структура("ТипСоставляющей, ПакетныйЗаказНаПроизводство", 
																					"ПакетныйЗаказНаПроизводство",
																					ВхСтрокаДанных.ПакетныйЗаказНаПроизводство));
																					
	Если масс_ДеревоПакетныйЗаказ.Количество() = 1 Тогда 		
		строка_ДеревоПакетныйЗаказ = масс_ДеревоПакетныйЗаказ[0];	
	Иначе
		
		строка_ДеревоПакетныйЗаказ = ВхСтрокаДерева.Строки.Добавить();
		строка_ДеревоПакетныйЗаказ.ТипСоставляющей				= "ПакетныйЗаказНаПроизводство";
		строка_ДеревоПакетныйЗаказ.Составляющая					= ВхСтрокаДанных.ПакетныйЗаказНаПроизводство;
		строка_ДеревоПакетныйЗаказ.ПакетныйЗаказНаПроизводство	= ВхСтрокаДанных.ПакетныйЗаказНаПроизводство;
		строка_ДеревоПакетныйЗаказ.РабочийЦентр					= ВхСтрокаДанных.ПакетныйЗаказНаПроизводствоРабочийЦентр;
		строка_ДеревоПакетныйЗаказ.ТехнологическаяОперация		= ВхСтрокаДанных.ПакетныйЗаказНаПроизводствоТехнологическаяОперация;
		строка_ДеревоПакетныйЗаказ.Пометка						= ВхСтрокаДанных.Пометка;
		строка_ДеревоПакетныйЗаказ.Период		    			= ВхСтрокаДанных.ДатаДняИсполнения;
		строка_ДеревоПакетныйЗаказ.Начало						= ВхСтрокаДерева.Начало;
		строка_ДеревоПакетныйЗаказ.Окончание					= ВхСтрокаДерева.Окончание;
		строка_ДеревоПакетныйЗаказ.Приоритет					= ВхСтрокаДанных.ПакетныйЗаказНаПроизводствоПриоритет;
		
	КонецЕсли;	
	
	Возврат строка_ДеревоПакетныйЗаказ;
	
КонецФункции

Функция ОбъединитьВПакет() Экспорт
	
	
	
КонецФункции

Процедура УстановитьУровеньСверткиДерева(ВхЭлФормы, ВхДеревоЗаказы, ВхУровеньСвертки, ВхТекУровень = 1) Экспорт
	
	Если УровеньСверткиДерева = 0 Тогда
		УровеньСверткиДерева = ВхУровеньСвертки;
	КонецЕсли;
	
	Для Каждого строка_ДеревоЗаказы Из ВхДеревоЗаказы.Строки Цикл
		
		Если ВхТекУровень < ВхУровеньСвертки
			Или (ВхУровеньСвертки = 3 И строка_ДеревоЗаказы.ТипСоставляющей = "ПакетныйЗаказНаПроизводство") Тогда
			ВхЭлФормы.Развернуть(строка_ДеревоЗаказы);
		Иначе
			ВхЭлФормы.Свернуть(строка_ДеревоЗаказы);
		КонецЕсли;
		
		УстановитьУровеньСверткиДерева(ВхЭлФормы, строка_ДеревоЗаказы, ВхУровеньСвертки, ВхТекУровень + 1);
			
	КонецЦикла;
	
КонецПроцедуры


// =================== ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ ============================

Процедура ИнициализацияОбработки() Экспорт
	
	// ИНИЦИАЛИЗАЦИЯ РЕКВИЗИТОВ ОБРАБОТКИ
	//---------------------------------------------
	
	ИспользоватьДатаНач                                 = Истина;
	КолДней												= 1;
	ДатаНач 											= ТекущаяДата();
	мДатаНачДерево										= ДатаНач;
	мДатаКонДерево										= глДобавитьДень(ДатаНач, КолДней);
	
	ПанельНастройкиРазвернута							= Истина; 
	ПоказыватьСостояниеЗаказа							= Истина;
	Автообновление										= Ложь;

	// инициализация таблицы заказов (структура )
	ТаблЗаказы.Колонки.Добавить("РабочийЦентр",							Новый ОписаниеТипов("СправочникСсылка.РабочиеЦентры"));
	ТаблЗаказы.Колонки.Добавить("ДокЗаказ",								Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство"));							// Заказ на про-во
	ТаблЗаказы.Колонки.Добавить("ДокЗаказНомер",						Новый ОписаниеТипов("Строка",	Новый КвалификаторыСтроки(8)));             		// Номер заказа на про-во
	ТаблЗаказы.Колонки.Добавить("ДокЗаказДата",							Новый ОписаниеТипов("Дата",		Новый КвалификаторыДаты(ЧастиДаты.Дата)));  		// Дата заказа на про-во
	ТаблЗаказы.Колонки.Добавить("ДатаДняИсполнения",					Новый ОписаниеТипов("Дата",		Новый КвалификаторыДаты(ЧастиДаты.Дата)));  		// День исполнения заказа на про-во
	ТаблЗаказы.Колонки.Добавить("ДатаИсполнения",						Новый ОписаниеТипов("Дата",		Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));  	// Дата исполнения заказа на про-во
	ТаблЗаказы.Колонки.Добавить("ДатаОбеспеченияПотребностей",			Новый ОписаниеТипов("Дата",		Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));  	// Дата исполнения заказа на про-во
    ТаблЗаказы.Колонки.Добавить("ДатаНеделиЗапуска",					Новый ОписаниеТипов("Дата",		Новый КвалификаторыДаты(ЧастиДаты.Дата)));  		// Дата начала недели в которой запущен заказ на про-во
	ТаблЗаказы.Колонки.Добавить("ДатаНеделиИсполнения",					Новый ОписаниеТипов("Дата",		Новый КвалификаторыДаты(ЧастиДаты.Дата)));  		// Дата начала недели в которой исполняется заказ на про-во
	ТаблЗаказы.Колонки.Добавить("ДокЗаказПокупателя",					Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));                     		// Заказ покупателя
	ТаблЗаказы.Колонки.Добавить("ДокЗаказПокупателяДатаИсполнения",		Новый ОписаниеТипов("Дата",		Новый КвалификаторыДаты(ЧастиДаты.Дата)));  		// Дата исполнения заказа покупателя
	ТаблЗаказы.Колонки.Добавить("СтатусВыполнения",						Новый ОписаниеТипов("СправочникСсылка.СтатусыВыполненияЗаказов"));          		// Статус выполнения заказа на про-во
	ТаблЗаказы.Колонки.Добавить("СтатусОбеспечения",					Новый ОписаниеТипов("СправочникСсылка.СтатусыОбеспеченияЗаказов")); 				// Статус обеспечения заказа на про-во
	ТаблЗаказы.Колонки.Добавить("СтатусОбеспеченияМатериалами",			Новый ОписаниеТипов("СправочникСсылка.СтатусыОбеспеченияМатериалами"));   			// Статус обеспечения заказов закупаемыми материалами
	ТаблЗаказы.Колонки.Добавить("Состав",								Новый ОписаниеТипов("Строка",	Новый КвалификаторыСтроки(8)));             		// Информационная строка о составе ТЧ "Продукция" заказа на про-во(для отображения в форме списка документов)
	ТаблЗаказы.Колонки.Добавить("Свойства",								Новый ОписаниеТипов("Строка",	Новый КвалификаторыСтроки(8)));             		// Информационная строка о составе ТЧ "Свойства" заказа на про-во
	ТаблЗаказы.Колонки.Добавить("Проведен", 							Новый ОписаниеТипов("Булево"));
	ТаблЗаказы.Колонки.Добавить("ПометкаУдаления",						Новый ОписаниеТипов("Булево"));
	ТаблЗаказы.Колонки.Добавить("Пометка",								Новый ОписаниеТипов("Булево"));
	ТаблЗаказы.Колонки.Добавить("ЕстьОшибкиВЗаказахПотребность",		Новый ОписаниеТипов("Булево"));                                             		// Есть ошибки в заказах потребность (ошибки в хронологии обеспечения)
	ТаблЗаказы.Колонки.Добавить("ЕстьОшибкиВЗаказахОбеспечения",		Новый ОписаниеТипов("Булево"));                                             		// Есть ошибки в заказах обеспечения (ошибки в хронологии обеспечения)
	ТаблЗаказы.Колонки.Добавить("ТехнологическаяОперация",				Новый ОписаниеТипов("СправочникСсылка.ТехнологическиеОперации"));
	ТаблЗаказы.Колонки.Добавить("ПакетныйЗаказНаПроизводство", 			Новый ОписаниеТипов("ДокументСсылка.ПакетныйЗаказНаПроизводство"));
	ТаблЗаказы.Колонки.Добавить("Приоритет", 							Новый ОписаниеТипов("СправочникСсылка.ПриоритетыЗаказовНаПроизводство"));
	
	// инициализация дерева заказов (интерфейс)
	ДеревоЗаказы.Колонки.Добавить("ТипСоставляющей");
	ДеревоЗаказы.Колонки.Добавить("Составляющая");
	ДеревоЗаказы.Колонки.Добавить("Период");
	ДеревоЗаказы.Колонки.Добавить("ДокЗаказПокупателя");
	ДеревоЗаказы.Колонки.Добавить("ДокЗаказНаПроизводство");
	ДеревоЗаказы.Колонки.Добавить("РабочийЦентр");
	ДеревоЗаказы.Колонки.Добавить("ПакетныйЗаказНаПроизводство");
	ДеревоЗаказы.Колонки.Добавить("Пометка");
	ДеревоЗаказы.Колонки.Добавить("Начало");
	ДеревоЗаказы.Колонки.Добавить("Окончание");
	ДеревоЗаказы.Колонки.Добавить("ДоступнаяМощность", 					Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 3)));
	ДеревоЗаказы.Колонки.Добавить("ЗагрузкаМощностей", 					Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 3)));
	ДеревоЗаказы.Колонки.Добавить("ЗагрузкаМощностейПриход", 			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 3)));
	ДеревоЗаказы.Колонки.Добавить("ЗагрузкаМощностейПолная", 			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 3)));
	ДеревоЗаказы.Колонки.Добавить("КоэффициентДоступности", 			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(6, 2)));
	ДеревоЗаказы.Колонки.Добавить("СтатусВыполнения",					Новый ОписаниеТипов("СправочникСсылка.СтатусыВыполненияЗаказов"));
	ДеревоЗаказы.Колонки.Добавить("СтатусОбеспечения",					Новый ОписаниеТипов("СправочникСсылка.СтатусыОбеспеченияЗаказов"));
	ДеревоЗаказы.Колонки.Добавить("СтатусОбеспеченияМатериалами",		Новый ОписаниеТипов("СправочникСсылка.СтатусыОбеспеченияМатериалами"));
	ДеревоЗаказы.Колонки.Добавить("ТехнологическаяОперация",			Новый ОписаниеТипов("СправочникСсылка.ТехнологическиеОперации"));
	ДеревоЗаказы.Колонки.Добавить("Приоритет", 							Новый ОписаниеТипов("СправочникСсылка.ПриоритетыЗаказовНаПроизводство"));
	
	ИнициализацияСпискаСтатусов();
	ИнициализацияПостроителя();
	
	// Список показателей	
	СписокПоказателей.Добавить("ПлановаяМощность", 				"Плановая мощность", 				Истина);
	СписокПоказателей.Добавить("ПлановаяЗагрузка", 				"Плановая загрузка", 				Истина);
	СписокПоказателей.Добавить("ТекущаяМощность", 				"Текущая мощность", 				Истина);
	СписокПоказателей.Добавить("ОсталосьВыполнить", 			"Осталось выполнить", 				Истина);
	СписокПоказателей.Добавить("ИсполнениеПлана", 				"Исполнение плана", 				Истина);
	СписокПоказателей.Добавить("ОтклонениеОтПлана", 			"Отклонение от плана", 				Истина);
	СписокПоказателей.Добавить("ОтклонениеПроизводительности", 	"Отклонение производительности", 	Истина);

КонецПроцедуры

Процедура ИнициализацияСпискаСтатусов() Экспорт
	
	мЦветаСтатусовВыполнения = Новый Соответствие;
	
	Запр_Статусы = Новый Запрос;
	Запр_Статусы.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыВыполненияЗаказов.Ссылка,
	|	СтатусыВыполненияЗаказов.Представление,
	|	СтатусыВыполненияЗаказов.ВидЗаказа,
	|	ВЫБОР
	|		КОГДА СтатусыВыполненияЗаказов.ВидЗаказа = ""ЗаказНаПроизводство""
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК СортировкаПоВиду
	|ИЗ
	|	Справочник.СтатусыВыполненияЗаказов КАК СтатусыВыполненияЗаказов
	|ГДЕ
	|	СтатусыВыполненияЗаказов.ПометкаУдаления = ЛОЖЬ
	|	И (СтатусыВыполненияЗаказов.ВидЗаказа = ""ЗаказНаПроизводство"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	СортировкаПоВиду,
	|	СтатусыВыполненияЗаказов.ИД_Порядок"
	;
	
	ЗапрВыб_Статусы = Запр_Статусы.Выполнить().Выбрать();
	
	СписокСтатусы.Очистить();
	Пока ЗапрВыб_Статусы.Следующий() Цикл
		
		СписокСтатусы.Добавить(ЗапрВыб_Статусы.Ссылка, "Пр-во: " + ЗапрВыб_Статусы.Представление);
		
		// заполняем массив цветов статусов
		_ЦветаСтатуса = Новый Структура;
		_ЦветаСтатуса.Вставить("ЦветТекста", 	глЦветТекста(ЗапрВыб_Статусы.Ссылка));
		_ЦветаСтатуса.Вставить("ЦветФона", 		глЦветФона(ЗапрВыб_Статусы.Ссылка));
		
		мЦветаСтатусовВыполнения.Вставить(ЗапрВыб_Статусы.Ссылка, _ЦветаСтатуса);
    		
	КонецЦикла;
	
	Если НЕ СписокСтатусы.Количество() = 0 Тогда
		СписокСтатусы.Вставить(0,Справочники.СтатусыВыполненияЗаказов.ПустаяСсылка(), "<статус не указан>");
	Конецесли;
	
	
	// Статусы обеспечения
	мЦветаСтатусовОбеспечения = Новый Соответствие;
	
	Запр_Статусы = Новый Запрос;
	Запр_Статусы.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыОбеспеченияЗаказов.Ссылка,
	|	СтатусыОбеспеченияЗаказов.Представление,
	|	СтатусыОбеспеченияЗаказов.ВидЗаказа
	|ИЗ
	|	Справочник.СтатусыОбеспеченияЗаказов КАК СтатусыОбеспеченияЗаказов
	|ГДЕ
	|	СтатусыОбеспеченияЗаказов.ПометкаУдаления = ЛОЖЬ
	|	И (СтатусыОбеспеченияЗаказов.ВидЗаказа = ""ЗаказНаПроизводство"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыОбеспеченияЗаказов.ИД_Порядок"
	;
	
	ЗапрВыб_Статусы = Запр_Статусы.Выполнить().Выбрать();
	
	Пока ЗапрВыб_Статусы.Следующий() Цикл
		
		СписокСтатусы.Добавить(ЗапрВыб_Статусы.Ссылка, ?(ЗапрВыб_Статусы.ВидЗаказа = "ЗаказНаПроизводство", "Пр-во (обесп.): ", "Резка (обесп.): ") + ЗапрВыб_Статусы.Представление);
		
		// заполняем массив цветов статусов
		_ЦветаСтатуса = Новый Структура;
		_ЦветаСтатуса.Вставить("ЦветТекста", 	глЦветТекста(ЗапрВыб_Статусы.Ссылка));
		_ЦветаСтатуса.Вставить("ЦветФона", 		глЦветФона(ЗапрВыб_Статусы.Ссылка));
		
		мЦветаСтатусовОбеспечения.Вставить(ЗапрВыб_Статусы.Ссылка, _ЦветаСтатуса);
    		
	КонецЦикла;
	
	
	// Статусы обеспечения дерева
	мЦветаСтатусовОбеспеченияМатериалами = Новый Соответствие;
	
	Запр_Статусы = Новый Запрос;
	Запр_Статусы.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыОбеспеченияМатериалами.Ссылка,
	|	СтатусыОбеспеченияМатериалами.Представление,
	|	СтатусыОбеспеченияМатериалами.ВидЗаказа
	|ИЗ
	|	Справочник.СтатусыОбеспеченияМатериалами КАК СтатусыОбеспеченияМатериалами
	|ГДЕ
	|	СтатусыОбеспеченияМатериалами.ПометкаУдаления = ЛОЖЬ
	|	И (СтатусыОбеспеченияМатериалами.ВидЗаказа = ""ЗаказНаПроизводство"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыОбеспеченияМатериалами.ИД_Порядок"
	;
	
	ЗапрВыб_Статусы = Запр_Статусы.Выполнить().Выбрать();
	
	Пока ЗапрВыб_Статусы.Следующий() Цикл
		
		СписокСтатусы.Добавить(ЗапрВыб_Статусы.Ссылка, ?(ЗапрВыб_Статусы.ВидЗаказа = "ЗаказНаПроизводство", "Пр-во (обесп. мат.): ", "Резка (обесп. мат.): ") + ЗапрВыб_Статусы.Представление);
		
		// заполняем массив цветов статусов
		_ЦветаСтатуса = Новый Структура;
		_ЦветаСтатуса.Вставить("ЦветТекста", 	глЦветТекста(ЗапрВыб_Статусы.Ссылка));
		_ЦветаСтатуса.Вставить("ЦветФона", 		глЦветФона(ЗапрВыб_Статусы.Ссылка));
		
		мЦветаСтатусовОбеспеченияМатериалами.Вставить(ЗапрВыб_Статусы.Ссылка, _ЦветаСтатуса);
    		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ИнициализацияПостроителя() Экспорт 
	
	УниверсальныйОтчет = Отчеты.УниверсальныйОтчет.Создать();
	
	// построитель отчета -> будем использовать для настройки отборов
	_ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыНаПроизводство.ДокЗаказ КАК ДокЗаказ,
	|	ЗНАЧЕНИЕ(Документ.ПакетныйЗаказНаПроизводство.ПустаяСсылка) КАК ПакетныйЗаказНаПроизводство
	|	//ПОЛЯ_СВОЙСТВА
	|{ВЫБРАТЬ
	|	ЗаказыНаПроизводство.ДокЗаказ.*,
	|	ЗаказыНаПроизводство.Номенклатура.*,
	|	ЗаказыНаПроизводство.ВариантИсполнения.*,
	|	ПакетныйЗаказНаПроизводство.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА}
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Остатки КАК ЗаказыНаПроизводство
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	ЗаказыНаПроизводство.ДокЗаказ.* КАК ДокЗаказ,
	|	ЗаказыНаПроизводство.Номенклатура.* КАК Номенклатура,
	|	ЗаказыНаПроизводство.ВариантИсполнения.* КАК ВариантИсполнения,
	|	ЗаказыНаПроизводство.ДокЗаказ.Утвержден КАК Утвержден,
	|	ЗаказыНаПроизводство.ВариантИсполнения.ДокЗаказПокупателя КАК ДокЗаказПокупателя,
	|	(ЗНАЧЕНИЕ(Документ.ПакетныйЗаказНаПроизводство.ПустаяСсылка)).* КАК ПакетныйЗаказНаПроизводство
	|	//УСЛОВИЯ_СВОЙСТВА}";

	УниверсальныйОтчет.ДобавитьВТекстЗапросаПараметрыНоменклатуры(_ТекстЗапроса, "ЗаказыНаПроизводство", "ВариантИсполнения, ДокЗаказ");	
	мСоответствиеСвойствКатегорийИИзмерений_ПостроительОтчета = УниверсальныйОтчет.мСоответствиеСвойствКатегорийИИзмерений;

	ПостроительОтчета.Текст 				= _ТекстЗапроса;
  	ПостроительОтчета.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	ПостроительОтчета.ТекстЗаголовка 		= "Список заказов";
	
	ТаблицаПолей = Новый ТаблицаЗначений;
	ТаблицаПолей.Колонки.Добавить("ПутьКДанным");   // описание поля запроса, для которого добавляются свойства и категории
	ТаблицаПолей.Колонки.Добавить("ИмяИзмерения");  // имя поля запроса, для которого добавляются свойства и категории
	ТаблицаПолей.Колонки.Добавить("Представление"); // представление поля, для которого добавляются свойства и категории
	ТаблицаПолей.Колонки.Добавить("Назначение");    // назначение свойств/категорий объектов для данного поля
	
	стру_ПредставленияПолей = Новый Структура;  	
	
	стру_ПредставленияПолей.Вставить("ДокЗаказ",            			"Заказ на производство");
	стру_ПредставленияПолей.Вставить("Номенклатура",        			"Номенклатура");
	стру_ПредставленияПолей.Вставить("ВариантИсполнения",   			"Вариант исполнения");
	стру_ПредставленияПолей.Вставить("ДокЗаказПокупателя",  			"Заказ покупателя");
	стру_ПредставленияПолей.Вставить("ПакетныйЗаказНаПроизводство",  	"Пакетный заказ на производство");
	
	ЗакрытыйМодуль_ОперативноеУпрПроизводством_MES.УправлениеЗаказамиНаПроизводство_ДобавитьВТекстЗапросаСвойства(ПостроительОтчета.Текст, ПостроительОтчета.Параметры, стру_ПредставленияПолей);
		
	ЗаполнитьПредставленияПолей(стру_ПредставленияПолей, ПостроительОтчета);
	ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	// добавление быстрых отборов
	ДобавитьОтбор("Номенклатура",						Ложь,   ВидСравнения.Равно);
    ДобавитьОтбор("ВариантИсполнения",					Ложь,   ВидСравнения.Равно);
    ДобавитьОтбор("ДокЗаказПокупателя",					Ложь,   ВидСравнения.Равно);
    ДобавитьОтбор("Утвержден",  						Ложь,   ВидСравнения.Равно, Истина);
	ДобавитьОтбор("ПакетныйЗаказНаПроизводство",		Ложь,   ВидСравнения.Равно);

КонецПроцедуры	

Процедура ОбновитьТаблЗаказыПоСтатусам() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧЗаказов.ДокЗаказ КАК ДокЗаказ,
		|	ТЧЗаказов.СтатусВыполнения КАК СтатусВыполнения,
		|	ТЧЗаказов.СтатусОбеспечения КАК СтатусОбеспечения,
		|	ТЧЗаказов.СтатусОбеспеченияМатериалами КАК СтатусОбеспеченияМатериалами
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	&ТЧЗаказов КАК ТЧЗаказов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ДокЗаказ КАК ДокЗаказ,
		|	ВложенныйЗапрос.СтатусВыполненияНовый КАК СтатусВыполнения,
		|	ВложенныйЗапрос.СтатусОбеспеченияНовый КАК СтатусОбеспечения,
		|	ВложенныйЗапрос.СтатусОбеспеченияМатериаламиНовый КАК СтатусОбеспеченияМатериалами
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Заказы.ДокЗаказ КАК ДокЗаказ,
		|		ВТ_Заказы.СтатусВыполнения КАК СтатусВыполнения,
		|		ВТ_Заказы.СтатусОбеспечения КАК СтатусОбеспечения,
		|		ВТ_Заказы.СтатусОбеспеченияМатериалами КАК СтатусОбеспеченияМатериалами,
		|		ЕСТЬNULL(СтатусыВыполненияЗаказов.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыВыполненияЗаказов.ПустаяСсылка)) КАК СтатусВыполненияНовый,
		|		ЕСТЬNULL(СтатусыОбеспеченияЗаказов.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыОбеспеченияЗаказов.ПустаяСсылка)) КАК СтатусОбеспеченияНовый,
		|		ЕСТЬNULL(СтатусыОбеспеченияМатериалами.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыОбеспеченияМатериалами.ПустаяСсылка)) КАК СтатусОбеспеченияМатериаламиНовый
		|	ИЗ
		|		ВТ_Заказы КАК ВТ_Заказы
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыВыполненияЗаказов КАК СтатусыВыполненияЗаказов
		|			ПО ВТ_Заказы.ДокЗаказ = СтатусыВыполненияЗаказов.Заказ
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбеспеченияЗаказов КАК СтатусыОбеспеченияЗаказов
		|			ПО ВТ_Заказы.ДокЗаказ = СтатусыОбеспеченияЗаказов.Заказ
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбеспеченияМатериалами КАК СтатусыОбеспеченияМатериалами
		|			ПО ВТ_Заказы.ДокЗаказ = СтатусыОбеспеченияМатериалами.Заказ) КАК ВложенныйЗапрос
		|ГДЕ
		|	(НЕ ВложенныйЗапрос.СтатусВыполнения = ВложенныйЗапрос.СтатусВыполненияНовый
		|			ИЛИ НЕ ВложенныйЗапрос.СтатусОбеспечения = ВложенныйЗапрос.СтатусОбеспеченияНовый
		|			ИЛИ НЕ ВложенныйЗапрос.СтатусОбеспеченияМатериалами = ВложенныйЗапрос.СтатусОбеспеченияМатериаламиНовый)";
	
	Запрос.УстановитьПараметр("ТЧЗаказов", ТаблЗаказы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзмененныеСтатусы = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаИзмененныеСтатусы.Следующий() Цикл
		
		строка_ТаблЗаказы = ТаблЗаказы.Найти(ВыборкаИзмененныеСтатусы.ДокЗаказ, "ДокЗаказ");
		
		Если НЕ глПустоеЗначение(строка_ТаблЗаказы) Тогда 
			ЗаполнитьЗначенияСвойств(строка_ТаблЗаказы, ВыборкаИзмененныеСтатусы);	
		КонецЕсли;	
		
		строка_ДеревоЗаказы = ДеревоЗаказы.Строки.Найти(ВыборкаИзмененныеСтатусы.ДокЗаказ, "ДокЗаказНаПроизводство", Истина);
		
		Если НЕ глПустоеЗначение(строка_ДеревоЗаказы) Тогда 
			ЗаполнитьЗначенияСвойств(строка_ДеревоЗаказы, ВыборкаИзмененныеСтатусы);	
		КонецЕсли;	
		
	КонецЦикла;

КонецПроцедуры	

Процедура ЗаполнитьИсходнымиДанными(ВхЭлемФормы) Экспорт
	
	//==========================================================================================================
    // 1. Заполнение ТЧ "ЗАКАЗЫ" (без детализации до номенклатуры) 
	//==========================================================================================================
	ЗакрытыйМодуль_ОперативноеУпрПроизводством_MES.УправлениеЗаказамиНаПроизводство_ЗаполнитьИсходнымиДанными(ЭтотОбъект, ВхЭлемФормы);
	
	//==========================================================================================================
	// 2. Получение цепочек для выявления проблем с хронологией дат исполнения (постобработка)
	//==========================================================================================================
    ОбработатьСвязанныеЗаказы_ОбновлениеТаблЗаказы();
	
	//========================================================================================================================
    // 3. Получение и вывод рабочих центров по закладкам (по соответсвующей настройке) + автовывод дерева заказы 
	//========================================================================================================================

	Если НЕ ВывестиСтраницыРабочихЦентров(ВхЭлемФормы) Тогда
		ДеревоЗаказы.Строки.Очистить();
		ТаблЗаказы.Очистить();
		Сообщить("Ошибка при получении рабочих центров. Проверьте отборы.", СтатусСообщения.Информация);
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры

Функция ВывестиСтраницыРабочихЦентров(ВхЭлемФормы) Экспорт 
	
	мРазрешитьВыводСтраницРЦ = Ложь; // програмное отключение обработчка "ПанельРабочиеЦентрыПриСменеСтраницы" 
	
	// тут запомним имя страницы текущего позиционирования
	_ИмяСтраницыДоОбновления = Неопределено;
	Если НЕ ВхЭлемФормы.ПанельРабочиеЦентры.ТекущаяСтраница = Неопределено Тогда
		_ИмяСтраницыДоОбновления = ВхЭлемФормы.ПанельРабочиеЦентры.ТекущаяСтраница.Значение;
	КонецЕсли;
	
	_СтраницыРабочихЦентров = ВхЭлемФормы.ПанельРабочиеЦентры.Страницы;

	// сначало удалим все страницы кроме 0-й, т.к. 0-я - это шаблон
	Пока _СтраницыРабочихЦентров.Количество() > 1 Цикл
		_СтраницыРабочихЦентров.Удалить(0);		
	КонецЦикла;	
	
	// установка нулевой страницы (по умолчанию)
	_СтраницаРабочегоЦентра = _СтраницыРабочихЦентров[0];	
	_СтраницаРабочегоЦентра.Имя       	= "РабочийЦентр";
	_СтраницаРабочегоЦентра.Заголовок 	= "Рабочий центр";
	_СтраницаРабочегоЦентра.Значение 	= Неопределено;
	
	Если НЕ ВыводитьВРазрезеРЦ Тогда
		
		мРазрешитьВыводСтраницРЦ 			= Истина;
		ВхЭлемФормы.ПанельРабочиеЦентры.ТекущаяСтраница = _СтраницаРабочегоЦентра;
		
		Возврат Истина;
		
	КонецЕсли;	
	
	// получим список РЦ
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РабочиеЦентры.Ссылка КАК РабочийЦентр
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|ГДЕ
	|	РабочиеЦентры.ЭтоГруппа = ЛОЖЬ
	|	И РабочиеЦентры.Ссылка В(&масс_РабочийЦентр)
	|{ГДЕ
	|	РабочиеЦентры.Ссылка.* КАК РабочийЦентр,
	|	РабочиеЦентры.ГруппаРЦ.*,
	|	РабочиеЦентры.ТипРЦ.*,
	|	РабочиеЦентры.Владелец.* КАК Филиал}
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочиеЦентры.Наименование";
	
	табл_РЦ = ТаблЗаказы.Скопировать(, "РабочийЦентр");
	табл_РЦ.Свернуть("РабочийЦентр");
	ПостроительЗапроса.Параметры.Вставить("масс_РабочийЦентр", табл_РЦ.ВыгрузитьКолонку("РабочийЦентр"));
	
	Если НЕ глПустоеЗначение(РабочийЦентр) Тогда
		
		Если ТипЗнч(РабочийЦентр) = Тип("СправочникСсылка.РабочиеЦентры") Тогда
			
			список_РЦ = Новый СписокЗначений;
			список_РЦ.Добавить(РабочийЦентр);
			
		Иначе		
			список_РЦ = РабочийЦентр;		
		КонецЕсли;
		
		_ЭлементОтбора               = ПостроительЗапроса.Отбор.Добавить("РабочийЦентр");	
		_ЭлементОтбора.Использование = Истина;
		_ЭлементОтбора.ВидСравнения  = ВидСравнения.ВСписке;
		_ЭлементОтбора.Значение      = список_РЦ;
		
	КонецЕсли;
	
	Если НЕ глПустоеЗначение(ГруппаРЦ) Тогда
		
		_ЭлементОтбора               = ПостроительЗапроса.Отбор.Добавить("ГруппаРЦ");	
		_ЭлементОтбора.Использование = Истина;
		_ЭлементОтбора.ВидСравнения  = ВидСравнения.Равно;
		_ЭлементОтбора.Значение      = ГруппаРЦ;
		
	КонецЕсли;
	
	Если НЕ глПустоеЗначение(ТипРЦ) Тогда
		
		_ЭлементОтбора               = ПостроительЗапроса.Отбор.Добавить("ТипРЦ");	
		_ЭлементОтбора.Использование = Истина;
		_ЭлементОтбора.ВидСравнения  = ВидСравнения.Равно;
		_ЭлементОтбора.Значение      = ТипРЦ;
		
	КонецЕсли;
	
	Если НЕ глПустоеЗначение(Филиал) Тогда
		
		_ЭлементОтбора               = ПостроительЗапроса.Отбор.Добавить("Филиал");	
		_ЭлементОтбора.Использование = Истина;
		_ЭлементОтбора.ВидСравнения  = ВидСравнения.Равно;
		_ЭлементОтбора.Значение      = Филиал;
		
	КонецЕсли;
	
	ПостроительЗапроса.Выполнить();
	ТаблРабочиеЦентры = ПостроительЗапроса.Результат.Выгрузить();
	
	Если ТаблРабочиеЦентры.Количество() = 0 Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Для Каждого _СтрокаТаблРабочиеЦентры Из ТаблРабочиеЦентры Цикл
		
		_СтраницаРабочегоЦентра           = ?(ТаблРабочиеЦентры.Индекс(_СтрокаТаблРабочиеЦентры) = 0, _СтраницыРабочихЦентров[0], _СтраницыРабочихЦентров.Добавить());	
		_СтраницаРабочегоЦентра.Имя       = СокрЛП(_СтрокаТаблРабочиеЦентры.РабочийЦентр);
		_СтраницаРабочегоЦентра.Заголовок = "РЦ: " + СокрЛП(_СтрокаТаблРабочиеЦентры.РабочийЦентр);
		_СтраницаРабочегоЦентра.Значение  = _СтрокаТаблРабочиеЦентры.РабочийЦентр;
		
	КонецЦикла;
	
	мРазрешитьВыводСтраницРЦ = Истина;
	
	// установка текущей страницы
	_СтраницаРабочегоЦентра = ?(_ИмяСтраницыДоОбновления = Неопределено, Неопределено, _СтраницыРабочихЦентров.Найти(_ИмяСтраницыДоОбновления));
	Если НЕ _СтраницаРабочегоЦентра = Неопределено Тогда
		ВхЭлемФормы.ПанельРабочиеЦентры.ТекущаяСтраница = _СтраницаРабочегоЦентра;
	Иначе
		ВхЭлемФормы.ПанельРабочиеЦентры.ТекущаяСтраница = _СтраницыРабочихЦентров[0];
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции	

Процедура ВывестиДеревоЗаказы(ВхЭлемФормы, ВхРабочийЦентр = Неопределено, ВхТекДанныеПозиционирования = Неопределено) Экспорт 
	
	// получение рабочего центра, для которого выводится дерево
	Если ВхРабочийЦентр = Неопределено Тогда
		ВхРабочийЦентр = ВхЭлемФормы.ПанельРабочиеЦентры.ТекущаяСтраница.Значение;		
	КонецЕсли;	
	
	// попытка получить текущее позиционирование
	Если ВхТекДанныеПозиционирования = Неопределено И НЕ глПустоеЗначение(ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные) Тогда
		
		ВхТекДанныеПозиционирования = Новый Структура;
		Если ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные.ТипСоставляющей = "Период" Тогда
			ВхТекДанныеПозиционирования.Вставить("Период", ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные.Период);
		ИначеЕсли ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные.ТипСоставляющей = "ДокЗаказПокупателя" Тогда
			
			ВхТекДанныеПозиционирования.Вставить("Период", 						ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные.Период);
			ВхТекДанныеПозиционирования.Вставить("ДокЗаказПокупателя",			ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные.ДокЗаказПокупателя);
			
		ИначеЕсли ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные.ТипСоставляющей = "ДокЗаказНаПроизводство" Тогда	
            ВхТекДанныеПозиционирования.Вставить("ДокЗаказНаПроизводство",		ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные.ДокЗаказНаПроизводство);
		ИначеЕсли ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные.ТипСоставляющей = "ПакетныйЗаказНаПроизводство" Тогда
			
		    ВхТекДанныеПозиционирования.Вставить("Период", 						ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные.Период);
		    ВхТекДанныеПозиционирования.Вставить("ПакетныйЗаказНаПроизводство",	ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные.ПакетныйЗаказНаПроизводство);
			
		КонецЕсли;	

	КонецЕсли;
	
	ДеревоЗаказы.Строки.Очистить();
	
	Если глПустоеЗначение(ВхРабочийЦентр)
		И ВыводитьВРазрезеРЦ Тогда
		Возврат;	
	КонецЕсли;	
	
	
	мДатаКонДерево = глДобавитьДень(?(глПустоеЗначение(ДатаНач), ТекущаяДата(), ДатаНач), КолДней - 1);
	
	// запомним во временных переменных фактический период вывода в дерево		
	мДатаКонДерево = ?(НЕ глПустоеЗначение(мДатаКонДерево), КонецДня(мДатаКонДерево), КонецДня(глДобавитьДень(ТекущаяДата(), 30)));
	
	//Определение начальной даты для построения дерева периодов
	_ТекДата = ?(НЕ глПустоеЗначение(ДатаНач), НачалоДня(ДатаНач), НачалоДня(ТекущаяДата()));
	
	стру_Отбор = Новый Структура;
	стру_Отбор.Вставить("РазмещенВПроизводственномРасписании", Истина);
	масс_ТаблЗаказы_РазмещеныВРасписании = ТаблЗаказы.НайтиСтроки(стру_Отбор);
	Если масс_ТаблЗаказы_РазмещеныВРасписании.Количество() > 0 Тогда
		_ТекДата = Мин(_ТекДата, масс_ТаблЗаказы_РазмещеныВРасписании[0].ДатаДняИсполнения);		
	КонецЕсли;
	мДатаНачДерево = _ТекДата;
	
	//Предупреждение, что виды не все заказы
	стру_Отбор = Новый Структура;
	стру_Отбор.Вставить("РазмещенВПроизводственномРасписании", Истина);
	Если НЕ глПустоеЗначение(ВхРабочийЦентр) Тогда
		стру_Отбор.Вставить("РабочийЦентр", ВхРабочийЦентр);
	КонецЕсли;
	масс_ТаблЗаказы = ТаблЗаказы.НайтиСтроки(стру_Отбор);
	
	//ТаблПериоды
	
	Если масс_ТаблЗаказы.Количество() > 0 И мДатаКонДерево < ТаблЗаказы[ТаблЗаказы.Количество()-1].ДатаДняИсполнения Тогда
		Сообщить("Обратите внимание, в дерево выведены не все заказы, т.к. дата (момент) исполнения этих заказов более поздний, чем максимальная выводимая дата в дерево.", СтатусСообщения.Внимание); 
	КонецЕсли;
	
	Если ЕстьДоступ.ОУП_ГрафикиРаботыРЦ() Тогда 	
		
		_ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ГрафикиРаботыРЦ.Период КАК Период,
		|	ГрафикиРаботыРЦ.Начало КАК Начало,
		|	ГрафикиРаботыРЦ.Окончание КАК Окончание,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА ГрафикиРаботыРЦ.Период >= &ТекДата
		|				ТОГДА ГрафикиРаботыРЦ.ДоступнаяМощность
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДоступнаяМощность,
		|	МИНИМУМ(ГрафикиРаботыРЦ.КоэффициентДоступности) КАК КоэффициентДоступности
		|ИЗ
		|	РегистрСведений.ГрафикиРаботыРЦ КАК ГрафикиРаботыРЦ
		|ГДЕ
		|	ГрафикиРаботыРЦ.Период МЕЖДУ &ПериодНач И &ПериодКон
		|	И (ГрафикиРаботыРЦ.РабочийЦентр = &РабочийЦентр
		|			ИЛИ НЕ &ОтборПоРЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикиРаботыРЦ.Период,
		|	ГрафикиРаботыРЦ.Окончание,
		|	ГрафикиРаботыРЦ.Начало
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	Начало";
		
	Иначе
		
		_ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПроизводственныйКалендарь.ДатаКалендаря КАК Период,
		|	0 КАК ДоступнаяМощность,
		|	0 КАК КоэффициентДоступности
		|ИЗ
		|	РегистрСведений.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
		|ГДЕ
		|	ПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ПериодНач И &ПериодКон";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =_ТекстЗапроса;
		
	Запрос.УстановитьПараметр("ПериодНач", 		НачалоДня(_ТекДата)); // баг при сравнении Периода и даты
	Запрос.УстановитьПараметр("ПериодКон", 		мДатаКонДерево);
	Запрос.УстановитьПараметр("ТекДата", 		НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("РабочийЦентр", 	ВхРабочийЦентр);
	Запрос.УстановитьПараметр("ОтборПоРЦ", 		НЕ глПустоеЗначение(ВхРабочийЦентр));
	
	Результат = Запрос.Выполнить();
	ТаблПериоды = Результат.Выгрузить();
	
	_ЕстьНеразмещенныеВРасписанииЗаказы = НЕ ТаблЗаказы.Найти(Ложь, "РазмещенВПроизводственномРасписании") = Неопределено;
	Если _ЕстьНеразмещенныеВРасписанииЗаказы 
		ИЛИ Константы.АвтоформированиеПроизводственногоРасписания.Получить() Тогда
		
		строка_ТаблПериоды = ТаблПериоды.Вставить(0);
		строка_ТаблПериоды.Период 					= '00010101';
		строка_ТаблПериоды.ДоступнаяМощность 		= 0;
		строка_ТаблПериоды.КоэффициентДоступности 	= 0;
		
		строка_ДереваЗаказы_Период = ДеревоЗаказы.Строки.Добавить();
		строка_ДереваЗаказы_Период.ТипСоставляющей 	= "Период";
		строка_ДереваЗаказы_Период.Составляющая    	= '00010101';
		строка_ДереваЗаказы_Период.Период		   	= '00010101';
		строка_ДереваЗаказы_Период.Пометка         	= Ложь; // исходное значение пометки
		строка_ДереваЗаказы_Период.Окончание 		= '00010101';
		
		строка_ДеревоЗаказыНеОпределено = строка_ДереваЗаказы_Период.Строки.Вставить(0);
		строка_ДеревоЗаказыНеОпределено.ТипСоставляющей = "Период";
		строка_ДеревоЗаказыНеОпределено.Составляющая    = "Не определено";
		строка_ДеревоЗаказыНеОпределено.Период		    = '00010101';
		строка_ДеревоЗаказыНеОпределено.Пометка         = Ложь;
		
	КонецЕсли;
	
	ТаблПотребностьМощностейСводно = Неопределено;	
	Если ЕстьДоступ.УПМ_ПроизводственныеМощности_Базовый() Тогда 	
		
		_ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗаказыНаПроизводствоОстатки.ДокЗаказ.ДатаИсполнения КАК Период,
		|	СУММА(ЗаказыНаПроизводствоОстатки.ПотребностьВМощностяхОстаток) КАК ПотребностьВМощностяхОстаток
		|ИЗ
		|	РегистрНакопления.ЗаказыНаПроизводство.Остатки(
		|			,
		|			РабочийЦентр = &РабочийЦентр
		|				И (ДокЗаказ.ДатаИсполнения МЕЖДУ &ПериодНач И &ПериодКон)) КАК ЗаказыНаПроизводствоОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыНаПроизводствоОстатки.ДокЗаказ.ДатаИсполнения";
		
		Запрос = Новый Запрос;
		Запрос.Текст =_ТекстЗапроса;
		
		Запрос.УстановитьПараметр("ПериодНач", 		_ТекДата);
		Запрос.УстановитьПараметр("ПериодКон", 		мДатаКонДерево);
		Запрос.УстановитьПараметр("РабочийЦентр", 	ВхРабочийЦентр);
		
		Результат = Запрос.Выполнить();
		ТаблПотребностьМощностейСводно = Результат.Выгрузить();
		ТаблПотребностьМощностейСводно.Индексы.Добавить("Период");
		
	КонецЕсли;
					
	Пока _ТекДата <= мДатаКонДерево Цикл
		
		стру_Отбор = Новый Структура;
		Если НЕ глПустоеЗначение(ВхРабочийЦентр) Тогда 
			стру_Отбор.Вставить("РабочийЦентр", ВхРабочийЦентр);
		КонецЕсли;
		стру_Отбор.Вставить("ДатаДняИсполнения", _ТекДата);
		
		масс_ТаблЗаказы = ТаблЗаказы.НайтиСтроки(стру_Отбор);
		
		Если _ТекДата < НачалоДня(ТекущаяДата()) И масс_ТаблЗаказы.Количество() = 0 Тогда // в прошлых периодах выводим только даты, в которых есть заказы
			_ТекДата  = НачалоДня(глДобавитьДень(_ТекДата, 1));
			Продолжить;	
		КонецЕсли;
		
		// группировка "Период" (День/Неделя) 
		строка_ДереваЗаказы_Период = ДеревоЗаказы.Строки.Добавить();
		строка_ДереваЗаказы_Период.ТипСоставляющей 	= "Период";
		строка_ДереваЗаказы_Период.Составляющая    	= _ТекДата;
		строка_ДереваЗаказы_Период.Период		   	= _ТекДата;
		строка_ДереваЗаказы_Период.Пометка         	= Ложь; // исходное значение пометки
		строка_ДереваЗаказы_Период.Окончание 		= КонецДня(_ТекДата);
		
		масс_ТаблПериоды = ТаблПериоды.НайтиСтроки(Новый Структура("Период", _ТекДата));
		
		Для Каждого строка_ТаблПериоды Из масс_ТаблПериоды Цикл
			
			Если ЕстьДоступ.ОУП_ГрафикиРаботыРЦ() Тогда
				
				_Начало 	= строка_ТаблПериоды.Начало;
				_Окончание 	= строка_ТаблПериоды.Окончание;
				
			Иначе
				
				_Начало 	= НачалоДня(строка_ТаблПериоды.Период);
				_Окончание 	= КонецДня(строка_ТаблПериоды.Период);
				
			КонецЕсли;
				
			СтрокаДерева_ПроизводственныйПериод = строка_ДереваЗаказы_Период.Строки.Добавить();
			
			СтрокаДерева_ПроизводственныйПериод.ТипСоставляющей 			= "ПроизводственныйПериод";
			СтрокаДерева_ПроизводственныйПериод.Составляющая    			= Формат(_Начало, "ДЛФ=T") + " : " + Формат(_Окончание, "ДЛФ=T");
			СтрокаДерева_ПроизводственныйПериод.Период		    			= _ТекДата;
			СтрокаДерева_ПроизводственныйПериод.Пометка         			= Ложь;
			СтрокаДерева_ПроизводственныйПериод.Начало       				= _Начало;
			СтрокаДерева_ПроизводственныйПериод.Окончание       			= _Окончание;
			СтрокаДерева_ПроизводственныйПериод.ДоступнаяМощность   		= строка_ТаблПериоды.ДоступнаяМощность * строка_ТаблПериоды.КоэффициентДоступности;
			СтрокаДерева_ПроизводственныйПериод.КоэффициентДоступности   	= строка_ТаблПериоды.КоэффициентДоступности;
			
			Если НЕ ТаблПотребностьМощностейСводно = Неопределено Тогда 
				
				строка_ТаблПотребностьМощностейСводно = ТаблПотребностьМощностейСводно.Найти(_Окончание, "Период");
				
				Если НЕ строка_ТаблПотребностьМощностейСводно = Неопределено Тогда 
					СтрокаДерева_ПроизводственныйПериод.ЗагрузкаМощностейПолная = строка_ТаблПотребностьМощностейСводно.ПотребностьВМощностяхОстаток;	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//ВхЭлемФормы.ДеревоЗаказы.Развернуть(строка_ДереваЗаказы_Период, Истина);
		
		_ТекДата  = НачалоДня(глДобавитьДень(_ТекДата, 1));
		
	КонецЦикла;
	
	Если глПустоеЗначение(ВхРабочийЦентр) Тогда
		масс_ТаблЗаказы = ТаблЗаказы;
	Иначе
		
		стру_Отбор = Новый Структура;
		стру_Отбор.Вставить("РабочийЦентр", ВхРабочийЦентр);
		масс_ТаблЗаказы = ТаблЗаказы.НайтиСтроки(стру_Отбор);
		
	КонецЕсли;
	
	Для Каждого строка_ТаблЗаказы Из масс_ТаблЗаказы Цикл
		
		_ДатаДняИсполнения = строка_ТаблЗаказы.ДатаДняИсполнения;
		строка_ДеревоЗаказы = ДеревоЗаказы.Строки.Найти(_ДатаДняИсполнения, "Период");
		
		Если строка_ДеревоЗаказы = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		_СтрокаДобавлена = Ложь;
		
		_СтрокиПроизводственныйПериод = строка_ДеревоЗаказы.Строки.НайтиСтроки(Новый Структура("ТипСоставляющей", "ПроизводственныйПериод"));
		
		Для Каждого строка_ПроизводственныйПериод Из _СтрокиПроизводственныйПериод Цикл 
		
			// группировка "Заказ на производство"
			
			Если ЕстьДоступ.ОУП_ГрафикиРаботыРЦ() Тогда 
				_ДатаИсполнения = строка_ТаблЗаказы.ДатаИсполнения;
			Иначе
				_ДатаИсполнения = КонецДня(строка_ТаблЗаказы.ДатаИсполнения);
			КонецЕсли;
			
			Если строка_ПроизводственныйПериод.Окончание = _ДатаИсполнения Тогда 
				
				строка_ДеревоЗаказы_ПакетныйЗаказ = ПолучитьСтрокуПакетногоЗаказа(строка_ПроизводственныйПериод, строка_ТаблЗаказы);		
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство = строка_ДеревоЗаказы_ПакетныйЗаказ.Строки.Добавить();
				
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ТипСоставляющей	= "ДокЗаказНаПроизводство";
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Составляющая						= строка_ТаблЗаказы.ДокЗаказ;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Пометка							= строка_ТаблЗаказы.Пометка;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Период		    				= строка_ТаблЗаказы.ДатаДняИсполнения;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ДокЗаказПокупателя 				= строка_ТаблЗаказы.ДокЗаказПокупателя;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ДокЗаказНаПроизводство			= строка_ТаблЗаказы.ДокЗаказ;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.РабочийЦентр						= строка_ТаблЗаказы.РабочийЦентр;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ТехнологическаяОперация			= строка_ТаблЗаказы.ТехнологическаяОперация;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ПакетныйЗаказНаПроизводство		= строка_ТаблЗаказы.ПакетныйЗаказНаПроизводство;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Начало							= строка_ПроизводственныйПериод.Начало;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Окончание						= строка_ПроизводственныйПериод.Окончание;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.СтатусВыполнения 				= строка_ТаблЗаказы.СтатусВыполнения;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.СтатусОбеспечения				= строка_ТаблЗаказы.СтатусОбеспечения;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.СтатусОбеспеченияМатериалами		= строка_ТаблЗаказы.СтатусОбеспеченияМатериалами;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Приоритет						= строка_ТаблЗаказы.Приоритет;
				
				// Мощности		
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ЗагрузкаМощностей 		= строка_ТаблЗаказы.ЗагрузкаМощностейИсх;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ДоступнаяМощность		= строка_ПроизводственныйПериод.ДоступнаяМощность * строка_ПроизводственныйПериод.КоэффициентДоступности;
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ЗагрузкаМощностейПриход 	= строка_ТаблЗаказы.ЗагрузкаМощностейПриход;
				
				// зафиксируем в таблице для статистики
				строка_ТаблЗаказы.ЗагрузкаМощностей = строка_ТаблЗаказы.ЗагрузкаМощностейИсх;
				
				строка_ПроизводственныйПериод.ЗагрузкаМощностей = строка_ПроизводственныйПериод.ЗагрузкаМощностей + строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ЗагрузкаМощностей;
				строка_ДеревоЗаказы.ЗагрузкаМощностей 			= строка_ДеревоЗаказы.ЗагрузкаМощностей + строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ЗагрузкаМощностей;
				
				_СтрокаДобавлена = Истина;
				
				строка_ПроизводственныйПериод.Пометка = строка_ПроизводственныйПериод.Пометка И строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Пометка;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Не определен производственный период, положим в ветку Не определено
		Если _СтрокаДобавлена = Ложь Тогда
			
			строка_ДеревоЗаказыНеОпределено = строка_ДеревоЗаказы.Строки.Найти("Не определено", "Составляющая");
			Если строка_ДеревоЗаказыНеОпределено = Неопределено Тогда
				
				строка_ДеревоЗаказыНеОпределено = строка_ДеревоЗаказы.Строки.Вставить(0);
				строка_ДеревоЗаказыНеОпределено.ТипСоставляющей = "Период";
				строка_ДеревоЗаказыНеОпределено.Составляющая    = "Не определено";
				строка_ДеревоЗаказыНеОпределено.Период		    = _ДатаДняИсполнения;
				строка_ДеревоЗаказыНеОпределено.Пометка         = Ложь;
				
			КонецЕсли;
			
			строка_ДеревоЗаказы_ПакетныйЗаказ = ПолучитьСтрокуПакетногоЗаказа(строка_ДеревоЗаказыНеОпределено, строка_ТаблЗаказы);		
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство = строка_ДеревоЗаказы_ПакетныйЗаказ.Строки.Добавить();
			
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ТипСоставляющей					= "ДокЗаказНаПроизводство";
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Составляющая						= строка_ТаблЗаказы.ДокЗаказ;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Пометка							= строка_ТаблЗаказы.Пометка;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Период		    				= строка_ТаблЗаказы.ДатаДняИсполнения;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ДокЗаказПокупателя 				= строка_ТаблЗаказы.ДокЗаказПокупателя;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ДокЗаказНаПроизводство			= строка_ТаблЗаказы.ДокЗаказ;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.РабочийЦентр						= строка_ТаблЗаказы.РабочийЦентр;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ТехнологическаяОперация			= строка_ТаблЗаказы.ТехнологическаяОперация;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ПакетныйЗаказНаПроизводство		= строка_ТаблЗаказы.ПакетныйЗаказНаПроизводство;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Окончание						= Неопределено;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.СтатусВыполнения 				= строка_ТаблЗаказы.СтатусВыполнения;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.СтатусОбеспечения				= строка_ТаблЗаказы.СтатусОбеспечения;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.СтатусОбеспеченияМатериалами		= строка_ТаблЗаказы.СтатусОбеспеченияМатериалами;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Приоритет						= строка_ТаблЗаказы.Приоритет;
			
			// Коэффициент доступности не определить
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ЗагрузкаМощностей 		= строка_ТаблЗаказы.ЗагрузкаМощностейИсх;
			строка_ДеревоЗаказы_ДокЗаказНаПроизводство.ЗагрузкаМощностейПриход 	= строка_ТаблЗаказы.ЗагрузкаМощностейПриход;
			строка_ТаблЗаказы.ЗагрузкаМощностей 								= строка_ТаблЗаказы.ЗагрузкаМощностейИсх;
			
			строка_ДеревоЗаказы.ЗагрузкаМощностей = строка_ДеревоЗаказы.ЗагрузкаМощностей + строка_ТаблЗаказы.ЗагрузкаМощностей;
			
			Если НЕ мСтруНастройкиВнешнегоВызова = Неопределено 
				И мСтруНастройкиВнешнегоВызова.Период = НачалоДня(строка_ТаблЗаказы.ДатаИсполнения)
				И мСтруНастройкиВнешнегоВызова.РабочийЦентр = строка_ТаблЗаказы.РабочийЦентр Тогда
				
				_ТЧСвойство = строка_ТаблЗаказы.ДокЗаказ.ТЧСвойства;
				
				Если мСтруНастройкиВнешнегоВызова.Свойство("Значение") Тогда 
					_Пометка = НЕ _ТЧСвойство.Найти(мСтруНастройкиВнешнегоВызова.Значение, "Значение") = Неопределено;
					Если мСтруНастройкиВнешнегоВызова.Значение = Неопределено
						И _ТЧСвойство.Количество() = 0 Тогда 
						_Пометка = Истина;	
					КонецЕсли;
				Иначе 
					_Пометка = Истина;
				КонецЕсли;
				
				строка_ДеревоЗаказы_ДокЗаказНаПроизводство.Пометка 	= _Пометка;
				строка_ТаблЗаказы.Пометка 							= _Пометка;
				
			КонецЕсли;
			
			//ВхЭлемФормы.ДеревоЗаказы.Развернуть(строка_ДеревоЗаказыНеОпределено, Истина); // Уровень Про период "Не определено"
			
		КонецЕсли;
		
		//ВхЭлемФормы.ДеревоЗаказы.Развернуть(строка_ДеревоЗаказы, Истина); // Уровень Про период, где есть заказы
		
	КонецЦикла;
	
	Если ВхЭлемФормы.ДеревоЗаказы.ТекущаяСтрока = Неопределено И ДеревоЗаказы.Строки.Количество() > 0 Тогда
		ВхЭлемФормы.ДеревоЗаказы.ТекущаяСтрока = ДеревоЗаказы.Строки[0];	
	КонецЕсли;
	
	УстановитьУровеньСверткиДерева(ВхЭлемФормы.ДеревоЗаказы, ДеревоЗаказы, ?(УровеньСверткиДерева = 0, 2, УровеньСверткиДерева));		
	
	Если НЕ ВхТекДанныеПозиционирования = Неопределено Тогда
				
		_МстрСтрокДерева = ДеревоЗаказы.Строки.НайтиСтроки(ВхТекДанныеПозиционирования, Истина);
	
		Если _МстрСтрокДерева.Количество() > 0 Тогда
			ВхЭлемФормы.ДеревоЗаказы.ТекущаяСтрока = _МстрСтрокДерева[0];
		КонецЕсли;	
		
	КонецЕсли;	
	
	// Вывод Альтернативных рабочих центров
	ВывестиАльтернативныеРЦ(ВхЭлемФормы, ВхРабочийЦентр, мДатаНачДерево, мДатаКонДерево);
	
КонецПроцедуры

Процедура ВывестиАльтернативныеРЦ(ВхЭлемФормы, ВхРабочийЦентр = Неопределено, ВхДатаНач = Неопределено, ВхДатаКон = Неопределено) Экспорт 
	
	Если НЕ АльтернативныеРЦ Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьДоступ.ОУП_ГрафикиРаботыРЦ() Тогда 
		Возврат;
	КонецЕсли;
	
	// получение рабочего центра, для которого выводится дерево
	Если ВхРабочийЦентр = Неопределено Тогда
		ВхРабочийЦентр = ВхЭлемФормы.ПанельРабочиеЦентры.ТекущаяСтраница.Значение;		
	КонецЕсли;
	
	Если ВхРабочийЦентр = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	_ДатаНач = ВхДатаНач;
	_ДатаКон = ВхДатаКон;
	
	Если _ДатаНач = Неопределено Тогда 
		_ДатаНач = мДатаНачДерево;	
	КонецЕсли;
	
	Если _ДатаКон = Неопределено Тогда 
		_ДатаКон = мДатаКонДерево;	
	КонецЕсли;
	
	_ТекГруппаРЦ = Неопределено;
	Если АльтернативныеРЦТолькоПоТекГруппеРЦ Тогда 
		_ТекГруппаРЦ = ВхРабочийЦентр.ГруппаРЦ;	
	КонецЕсли;
	
	_ИспользуютсяПроизводственныеМощности = ЕстьДоступ.УПМ_ПроизводственныеМощности_Базовый();
	
	ДеревоАльтернативныеРЦ = Новый ДеревоЗначений;
	ДеревоАльтернативныеРЦ.Колонки.Добавить("Период");
	ДеревоАльтернативныеРЦ.Колонки.Добавить("Начало");
	ДеревоАльтернативныеРЦ.Колонки.Добавить("Окончание");
	ДеревоАльтернативныеРЦ.Колонки.Добавить("ТипСоставляющей");
		
	_ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СоответствиеРЦТехОперациям.РабочийЦентр КАК РЦ
	|ПОМЕСТИТЬ ВТ_ДоступныеРЦ
	|ИЗ
	|	РегистрСведений.СоответствиеРЦТехОперациям КАК СоответствиеРЦТехОперациям
	|ГДЕ
	|	СоответствиеРЦТехОперациям.ТехнологическаяОперация В(&массТехнологическаяОперация)
	|	И &ТекстУсловияСоответствияРЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка КАК ДокЗаказНаПроизводство,
	|	ЗаказНаПроизводство.РабочийЦентр КАК РабочийЦентр,
	|	ЗаказНаПроизводство.ДатаИсполнения КАК ДатаИсполнения
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.ДатаИсполнения МЕЖДУ &ДатаНач И &ДатаКон
	|	И &ТекстУсловияЗаказыНаПроизводствоДокументы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РабочийЦентр,
	|	ДатаИсполнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботыРЦ.РабочийЦентр КАК РабочийЦентр,
	|	ГрафикиРаботыРЦ.Период КАК Период,
	|	ГрафикиРаботыРЦ.Начало КАК Начало,
	|	ГрафикиРаботыРЦ.Окончание КАК Окончание,
	|	ВЫБОР
	|		КОГДА ГрафикиРаботыРЦ.Период >= &ТекДата
	|			ТОГДА ГрафикиРаботыРЦ.ДоступнаяМощность
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоступнаяМощность,
	|	ГрафикиРаботыРЦ.КоэффициентДоступности,
	|	ВТ_Заказы.ДокЗаказНаПроизводство КАК ДокЗаказ
	|ПОМЕСТИТЬ ВТ_ГрафикиЗаказы
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыРЦ КАК ГрафикиРаботыРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДоступныеРЦ КАК ВТ_ДоступныеРЦ
	|		ПО ГрафикиРаботыРЦ.РабочийЦентр = ВТ_ДоступныеРЦ.РЦ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО ГрафикиРаботыРЦ.РабочийЦентр = ВТ_Заказы.РабочийЦентр
	|			И ГрафикиРаботыРЦ.Окончание = ВТ_Заказы.ДатаИсполнения
	|ГДЕ
	|	ГрафикиРаботыРЦ.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И &ТекстУсловияГрафикиРаботыРЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокЗаказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГрафикиЗаказы.РабочийЦентр КАК РабочийЦентр,
	|	ВТ_ГрафикиЗаказы.Период КАК Период,
	|	ВТ_ГрафикиЗаказы.Начало КАК Начало,
	|	ВТ_ГрафикиЗаказы.Окончание КАК Окончание,
	|	ВТ_ГрафикиЗаказы.ДоступнаяМощность КАК ДоступнаяМощность,
	|	ВТ_ГрафикиЗаказы.КоэффициентДоступности КАК КоэффициентДоступности,
	|	ВТ_ГрафикиЗаказы.ДокЗаказ,
	|	ЕСТЬNULL(ЗаказыНаПроизводствоОстатки.ПотребностьВМощностяхОстаток, 0) КАК ПотребностьВМощностях
	|ИЗ
	|	ВТ_ГрафикиЗаказы КАК ВТ_ГрафикиЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПроизводство.Остатки(, &ТекстУсловияЗаказыНаПроизводствоОстатки) КАК ЗаказыНаПроизводствоОстатки
	|		ПО ВТ_ГрафикиЗаказы.ДокЗаказ = ЗаказыНаПроизводствоОстатки.ДокЗаказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Начало,
	|	Окончание,
	|	ВТ_ГрафикиЗаказы.РабочийЦентр.Наименование
	|ИТОГИ
	|	МАКСИМУМ(ДоступнаяМощность),
	|	МАКСИМУМ(КоэффициентДоступности)
	|ПО
	|	Период,
	|	Начало,
	|	Окончание,
	|	РабочийЦентр";
	 
	Запрос = Новый Запрос;
	Запрос.Текст = _ТекстЗапроса;
	
	_ТекстУсловияСоответствияРЦ 				= "";
	_ТекстУсловияЗаказыНаПроизводствоДокументы 	= "";
	_ТекстУсловияГрафикиРаботыРЦ 				= "";
	_ТекстУсловияЗаказыНаПроизводствоОстатки 	= "ИСТИНА";
	
	_ТекстУсловияЗаказыНаПроизводствоДокументы = _ТекстУсловияЗаказыНаПроизводствоДокументы + ?(НЕ ПоказыватьПредварительныеЗапускиВПроизводство, " И НЕ ЗаказНаПроизводство.ПредварительныйЗаказ", "");
	
	Если НЕ глПустоеЗначение(Филиал)
		И НЕ ПоказыватьРЦДругихФилиалов Тогда 
		_ТекстУсловияСоответствияРЦ 				= " И СоответствиеРЦТехОперациям.РабочийЦентр.Владелец = &Филиал";
		_ТекстУсловияЗаказыНаПроизводствоДокументы 	= " И ЗаказНаПроизводство.Филиал = &Филиал";
		_ТекстУсловияГрафикиРаботыРЦ 				= " И ГрафикиРаботыРЦ.РабочийЦентр.Владелец = &Филиал";
		_ТекстУсловияЗаказыНаПроизводствоОстатки 	= _ТекстУсловияЗаказыНаПроизводствоОстатки + " И ДокЗаказ.Филиал = &Филиал";
	КонецЕсли;
	
	Если НЕ глПустоеЗначение(_ТекГруппаРЦ) Тогда 
		_ТекстУсловияСоответствияРЦ 				= _ТекстУсловияСоответствияРЦ 					+ " И СоответствиеРЦТехОперациям.РабочийЦентр.ГруппаРЦ = &ТекГруппаРЦ";
		_ТекстУсловияЗаказыНаПроизводствоДокументы 	= _ТекстУсловияЗаказыНаПроизводствоДокументы 	+ " И ЗаказНаПроизводство.РабочийЦентр.ГруппаРЦ = &ТекГруппаРЦ";
		_ТекстУсловияГрафикиРаботыРЦ 				= _ТекстУсловияГрафикиРаботыРЦ 					+ " И ГрафикиРаботыРЦ.РабочийЦентр.ГруппаРЦ = &ТекГруппаРЦ";
		_ТекстУсловияЗаказыНаПроизводствоОстатки 	= _ТекстУсловияЗаказыНаПроизводствоОстатки 		+ " И ДокЗаказ.РабочийЦентр.ГруппаРЦ = &ТекГруппаРЦ";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ТекстУсловияСоответствияРЦ", 					_ТекстУсловияСоответствияРЦ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ТекстУсловияЗаказыНаПроизводствоДокументы", 	_ТекстУсловияЗаказыНаПроизводствоДокументы);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ТекстУсловияГрафикиРаботыРЦ", 					_ТекстУсловияГрафикиРаботыРЦ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловияЗаказыНаПроизводствоОстатки", 		_ТекстУсловияЗаказыНаПроизводствоОстатки);
	
	
	Если глПустоеЗначение(ВхРабочийЦентр) Тогда
		табл_ТехОперации = ТаблЗаказы.Скопировать(, "ТехнологическаяОперация");		
	Иначе
		
		стру_Отбор = Новый Структура;
		стру_Отбор.Вставить("РабочийЦентр", ВхРабочийЦентр);
		табл_ТехОперации = ТаблЗаказы.Скопировать(стру_Отбор, "ТехнологическаяОперация");
		
	КонецЕсли;
	
	табл_ТехОперации.Свернуть("ТехнологическаяОперация");
		
	Запрос.УстановитьПараметр("массТехнологическаяОперация", 	табл_ТехОперации);
	Запрос.УстановитьПараметр("Филиал", 						Филиал);
	Запрос.УстановитьПараметр("ДатаНач", 						_ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", 						КонецДня(_ДатаКон));
	Запрос.УстановитьПараметр("ТекДата", 						НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ТекГруппаРЦ", 					_ТекГруппаРЦ);
	
	Результат = Запрос.Выполнить();
	ЗапрВыб_Период = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	// Период
	Пока ЗапрВыб_Период.Следующий() Цикл
		
		период_ДеревоАльтернативныеРЦ = ДеревоАльтернативныеРЦ.Строки.Добавить();
		период_ДеревоАльтернативныеРЦ.Период 			= ЗапрВыб_Период.Период;
		период_ДеревоАльтернативныеРЦ.ТипСоставляющей 	= "Период";
		
		ЗапрВыб_Начало = ЗапрВыб_Период.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		// Начало
		Пока ЗапрВыб_Начало.Следующий() Цикл
			
			ЗапрВыб_Окончание = ЗапрВыб_Начало.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			
			// Окончание
			Пока ЗапрВыб_Окончание.Следующий() Цикл
				
				периодПроизв_ДеревоАльтернативныеРЦ = период_ДеревоАльтернативныеРЦ.Строки.Добавить();
				периодПроизв_ДеревоАльтернативныеРЦ.Период 			= Формат(ЗапрВыб_Окончание.Начало, "ДЛФ=T") + " : " + Формат(ЗапрВыб_Окончание.Окончание, "ДЛФ=T");
				периодПроизв_ДеревоАльтернативныеРЦ.Начало 			= ЗапрВыб_Окончание.Начало;
				периодПроизв_ДеревоАльтернативныеРЦ.Окончание 		= ЗапрВыб_Окончание.Окончание;
				периодПроизв_ДеревоАльтернативныеРЦ.ТипСоставляющей = "ПроизводственныйПериод";
				
				ЗапрВыб_РЦ = ЗапрВыб_Окончание.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
				
				// РЦ
				Пока ЗапрВыб_РЦ.Следующий() Цикл
					
					_РабочийЦентр 						= ЗапрВыб_РЦ.РабочийЦентр;
					// РЦ
					_ИмяКолонкиГруппа 					= "РЦГруппа_" 		+  _РабочийЦентр.Код;
					// Данные
					_ИмяКолонкиПотребность 				= "РЦПотребность_" 	+  _РабочийЦентр.Код;
					_ИмяКолонкиДоступно 				= "РЦДоступно_" 	+  _РабочийЦентр.Код;
					
					_КолонкаДеревоАльтернативныеРЦ = ДеревоАльтернативныеРЦ.Колонки.Найти(_ИмяКолонкиГруппа);		
					Если _КолонкаДеревоАльтернативныеРЦ = Неопределено Тогда 
						ДеревоАльтернативныеРЦ.Колонки.Добавить(_ИмяКолонкиГруппа,,  _РабочийЦентр.Наименование);
					КонецЕсли;
					
					// Количество потребность
					
					// По заказам соберем потребность в мощностях, коэффициент эффективности можем получить только алгоритмом
					_ПотребностьВМощностях 	= 0;
					_КолЗаказов 			= 0;
					ЗапрВыб_Детально = ЗапрВыб_РЦ.Выбрать();
					
					// Детально
					Пока ЗапрВыб_Детально.Следующий() Цикл
						
						_ДокЗаказНаПроизводство = ЗапрВыб_Детально.ДокЗаказ;
						Если НЕ глПустоеЗначение(_ДокЗаказНаПроизводство) Тогда
							
							_ПотребностьВМощностях 		= _ПотребностьВМощностях + ЗапрВыб_Детально.ПотребностьВМощностях;		
							_ПотребностьВМощностях 		= Окр(_ПотребностьВМощностях, 3, РежимОкругления.Окр15как20);
							_КолЗаказов 				= _КолЗаказов + 1;
							
						КонецЕсли;
						
					КонецЦикла; // Детально
					
					Если _ИспользуютсяПроизводственныеМощности Тогда 
						                                              					
						УстановитьЗначениеДеревоАльтернативныеРЦ(_ИмяКолонкиПотребность, _ПотребностьВМощностях, периодПроизв_ДеревоАльтернативныеРЦ);
					
						// Количество доступно
						
						УстановитьЗначениеДеревоАльтернативныеРЦ(_ИмяКолонкиДоступно, ЗапрВыб_РЦ.ДоступнаяМощность * ЗапрВыб_РЦ.КоэффициентДоступности, периодПроизв_ДеревоАльтернативныеРЦ);
						
					Иначе //Если НЕ _ИспользуютсяПроизводственныеМощности Тогда
						
						УстановитьЗначениеДеревоАльтернативныеРЦ(_ИмяКолонкиДоступно, ?(_КолЗаказов = 0, "-", _КолЗаказов), периодПроизв_ДеревоАльтернативныеРЦ);	
					
					КонецЕсли;		
					
					
				КонецЦикла; // РЦ
				
				ВхЭлемФормы.ДеревоАльтернативныеРЦ.Развернуть(периодПроизв_ДеревоАльтернативныеРЦ);
				
			КонецЦикла; // Окончание
			
		КонецЦикла; // Начало
		
		ВхЭлемФормы.ДеревоАльтернативныеРЦ.Развернуть(период_ДеревоАльтернативныеРЦ);
	
	КонецЦикла; // Период
	
	ВхЭлемФормы.ДеревоАльтернативныеРЦ.СоздатьКолонки();
	ВхЭлемФормы.ДеревоАльтернативныеРЦ.Колонки.ТипСоставляющей.Видимость 	= Ложь;
	ВхЭлемФормы.ДеревоАльтернативныеРЦ.Колонки.Начало.Видимость 			= Ложь;
	ВхЭлемФормы.ДеревоАльтернативныеРЦ.Колонки.Окончание.Видимость 			= Ложь;
	ВхЭлемФормы.ДеревоАльтернативныеРЦ.Колонки.Период.Ширина 				= 25;
	ВхЭлемФормы.ДеревоАльтернативныеРЦ.ФиксацияСлева 						= 1;
	
	Для Каждого _Колонка Из ВхЭлемФормы.ДеревоАльтернативныеРЦ.Колонки Цикл 
		Если Найти(_Колонка.Имя, "РЦПотребность_") > 0 
				ИЛИ Найти(_Колонка.Имя, "РЦДоступно_") > 0 Тогда 
			_Колонка.Видимость 			= Ложь;
			_Колонка.ИзменятьВидимость 	= Ложь;
		ИначеЕсли Найти(_Колонка.Имя, "РЦГруппа_") > 0 Тогда
			_Колонка.ГоризонтальноеПоложениеВКолонке = ГоризонтальноеПоложение.Право;
		Иначе
			_Колонка.ИзменятьВидимость 	= Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Смещение текущего РЦ в начало таблицы
	Если НЕ глПустоеЗначение(ВхРабочийЦентр) Тогда
		
		_ИмяКолонкиТекущегоРЦ = "РЦГруппа_" + ВхРабочийЦентр.Код;
		_КолонкаТекущегоРЦ = ВхЭлемФормы.ДеревоАльтернативныеРЦ.Колонки.Найти(_ИмяКолонкиТекущегоРЦ);
		Если НЕ _КолонкаТекущегоРЦ = Неопределено Тогда 
			_Индекс = ВхЭлемФормы.ДеревоАльтернативныеРЦ.Колонки.Индекс(_КолонкаТекущегоРЦ);
			ВхЭлемФормы.ДеревоАльтернативныеРЦ.Колонки.Сдвинуть(_Индекс, -(_Индекс - 1));
		КонецЕсли;
	
	КонецЕсли;
	
	// Установка текущей строки
	Если ВхЭлемФормы.ДеревоАльтернативныеРЦ.ТекущаяСтрока = Неопределено Тогда
		
		_ДанныеПозиции = Новый Структура("Период", НачалоДня(ТекущаяДата()));
		
		масс_СтрокДерева = ДеревоАльтернативныеРЦ.Строки.НайтиСтроки(_ДанныеПозиции, Истина);
	
		Если НЕ масс_СтрокДерева.Количество() = 0 Тогда
			ВхЭлемФормы.ДеревоАльтернативныеРЦ.ТекущаяСтрока = масс_СтрокДерева[0];
		КонецЕсли;
				
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВывестиСоставЗаказа(ВхДокЗаказ, ВхТаблДок) Экспорт 
	
	ВхТаблДок.Очистить();

	Если ВхДокЗаказ = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
		
	//==========================================================================================================
	//   1. Данные с Рег. "Заказы на производство"
	//==========================================================================================================

	Запрос = Новый Запрос;
	Запрос.Текст = 
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ТаблицаЗапроса.ДокЗаказ                 КАК ДокЗаказ,
    |	ТаблицаЗапроса.РабочийЦентр             КАК РабочийЦентр,
    |	ТаблицаЗапроса.Номенклатура             КАК Номенклатура,
    |	ТаблицаЗапроса.ВариантИсполнения           КАК ВариантИсполнения,
    |	ТаблицаЗапроса.Спецификация             КАК Спецификация,
    |	СУММА(ТаблицаЗапроса.КолВсего)          КАК КолВсего,
    |	СУММА(ТаблицаЗапроса.КолВыполнено)      КАК КолВыполнено,
    |	СУММА(ТаблицаЗапроса.КолОсталось)       КАК КолОсталось
    |ИЗ
    |	(ВЫБРАТЬ
    |		ТаблВсего.ДокЗаказ                  КАК ДокЗаказ,
    |		ТаблВсего.РабочийЦентр              КАК РабочийЦентр,
    |		ТаблВсего.Номенклатура              КАК Номенклатура,
    |		ТаблВсего.ВариантИсполнения            КАК ВариантИсполнения,
    |		ТаблВсего.Спецификация              КАК Спецификация,
    |		ТаблВсего.КолПриход                 КАК КолВсего,
    |		0                                   КАК КолВыполнено,
    |		0                                   КАК КолОсталось
    |	ИЗ
    |		РегистрНакопления.ЗаказыНаПроизводство.Обороты(, , Регистратор, ) КАК ТаблВсего
    |	ГДЕ
    |		ТаблВсего.Регистратор = &ДокЗаказ И ТаблВсего.ДокЗаказ = &ДокЗаказ
    |	
    |	ОБЪЕДИНИТЬ ВСЕ
    |	
    |	ВЫБРАТЬ
    |		ТаблВыполнено.ДокЗаказ,
    |		ТаблВыполнено.РабочийЦентр,
    |		ТаблВыполнено.Номенклатура,
    |		ТаблВыполнено.ВариантИсполнения,
    |		ТаблВыполнено.Спецификация,
    |		0,
    |		ТаблВыполнено.КолРасход,
    |		0
    |	ИЗ
    |		РегистрНакопления.ЗаказыНаПроизводство.Обороты(, , Регистратор, ) КАК ТаблВыполнено
    |	ГДЕ
    |		ТаблВыполнено.ДокЗаказ = &ДокЗаказ И ТаблВыполнено.Регистратор ССЫЛКА Документ.ВыпускПродукции
    |	
    |	ОБЪЕДИНИТЬ ВСЕ
    |	
    |	ВЫБРАТЬ
    |		ТаблОсталось.ДокЗаказ,
    |		ТаблОсталось.РабочийЦентр,
    |		ТаблОсталось.Номенклатура,
    |		ТаблОсталось.ВариантИсполнения,
    |		ТаблОсталось.Спецификация,
    |		0,
    |		0,
    |		ТаблОсталось.КолОстаток
    |	ИЗ
    |		РегистрНакопления.ЗаказыНаПроизводство.Остатки КАК ТаблОсталось
    |	ГДЕ
    |		ТаблОсталось.ДокЗаказ = &ДокЗаказ) КАК ТаблицаЗапроса
    |
    |СГРУППИРОВАТЬ ПО
    |	ТаблицаЗапроса.ДокЗаказ,
    |	ТаблицаЗапроса.РабочийЦентр,
    |	ТаблицаЗапроса.ВариантИсполнения,
    |	ТаблицаЗапроса.Номенклатура,
    |	ТаблицаЗапроса.Спецификация";

	Запрос.УстановитьПараметр("ДокЗаказ",  ВхДокЗаказ);
	ТаблЗаказыНаПроизводство = Запрос.Выполнить().Выгрузить();
    
	Макет = ПолучитьМакет("СоставЗаказа");
	
	// 1. ВЫВОД ШАПКИ
		
	// "Шапка|Начало"
    Область = Макет.ПолучитьОбласть("Шапка|Начало");
	Область.Параметры.ПечГрСтр   = "Продукция / Вариант исполнения"; // список группировок строкой
	
	ВхТаблДок.Вывести(Область); 
	    	
	// "Шапка|Всего"
	Область = Макет.ПолучитьОбласть("Шапка|Всего");
    ВхТаблДок.Присоединить(Область); 
	
	// "Шапка|Выполнено"
	Область = Макет.ПолучитьОбласть("Шапка|Выполнено");
    ВхТаблДок.Присоединить(Область);

	// "Шапка|Коррект"
	Область = Макет.ПолучитьОбласть("Шапка|Коррект");
    ВхТаблДок.Присоединить(Область);

	// "Шапка|Осталось"
	Область = Макет.ПолучитьОбласть("Шапка|Осталось");
    ВхТаблДок.Присоединить(Область); 
	
		
	// 2. ВЫВОД СТРОК ДЕРЕВА	
	ВхТаблДок.НачатьАвтогруппировкуСтрок();
	
	Для Каждого СтрокаТаблЗаказыНаПроизводство Из ТаблЗаказыНаПроизводство Цикл
		
		// "Гр0|Начало"
		Область = Макет.ПолучитьОбласть("Гр0|Начало");
		Область.Параметры.ЗначениеГрСтр = СокрЛП(СтрокаТаблЗаказыНаПроизводство.Номенклатура) + ", " + СокрЛП(СтрокаТаблЗаказыНаПроизводство.ВариантИсполнения); 
		Область.Параметры.Расшифровка   = ?(глПустоеЗначение(СтрокаТаблЗаказыНаПроизводство.ВариантИсполнения), СтрокаТаблЗаказыНаПроизводство.Номенклатура, СтрокаТаблЗаказыНаПроизводство.ВариантИсполнения); 
		Область.Параметры.Спецификация  = СтрокаТаблЗаказыНаПроизводство.Спецификация;
		ВхТаблДок.Вывести(Область, 1); 
		
		// "Гр0|Всего"
		Область = Макет.ПолучитьОбласть("Гр0|Всего");
		Область.Параметры.КолВсего = СтрокаТаблЗаказыНаПроизводство.КолВсего; 
		ВхТаблДок.Присоединить(Область); 
		
		// "Гр0|Выполнено"
		Область = Макет.ПолучитьОбласть("Гр0|Выполнено");
		Область.Параметры.КолВыполнено = СтрокаТаблЗаказыНаПроизводство.КолВыполнено; 
    	ВхТаблДок.Присоединить(Область);
		
		// "Гр0|Коррект"
		Область = Макет.ПолучитьОбласть("Гр0|Коррект");
		Область.Параметры.КолКоррект = СтрокаТаблЗаказыНаПроизводство.КолВсего - СтрокаТаблЗаказыНаПроизводство.КолВыполнено - СтрокаТаблЗаказыНаПроизводство.КолОсталось; 
        ВхТаблДок.Присоединить(Область);
		
		// "Гр0|Осталось"
		Область = Макет.ПолучитьОбласть("Гр0|Осталось");
		Область.Параметры.КолОсталось = СтрокаТаблЗаказыНаПроизводство.КолОсталось; 
    	ВхТаблДок.Присоединить(Область); 
			
	КонецЦикла;

	ВхТаблДок.ЗакончитьАвтогруппировкуСтрок();
	
	
	// 3. ПОДВАЛ
	
	// "Подвал|Начало"
    Область = Макет.ПолучитьОбласть("Подвал|Начало");
	ВхТаблДок.Вывести(Область); 
	    	
	// "Подвал|Всего"
	Область = Макет.ПолучитьОбласть("Подвал|Всего");
    ВхТаблДок.Присоединить(Область); 
	
	// "Подвал|Выполнено"
	Область = Макет.ПолучитьОбласть("Подвал|Выполнено");
    ВхТаблДок.Присоединить(Область);
	
	// "Подвал|Коррект"
	Область = Макет.ПолучитьОбласть("Подвал|Коррект");
    ВхТаблДок.Присоединить(Область);
	
	// "Подвал|Осталось"
	Область = Макет.ПолучитьОбласть("Подвал|Осталось");
    ВхТаблДок.Присоединить(Область); 

	
	ВхТаблДок.ФиксацияСверху      = 4;
	ВхТаблДок.ОтображатьСетку     = Ложь;
	ВхТаблДок.Защита              = Ложь;
	ВхТаблДок.ТолькоПросмотр      = Истина;
	ВхТаблДок.ОтображатьЗаголовки = Ложь;
	
	ВхТаблДок.Показать();

КонецПроцедуры

Процедура ВывестиМатериальноеОбеспечениеЗаказа(ВхДокЗаказ, ВхТаблДок) Экспорт 

	ВхТаблДок.Очистить();

	Если ВхДокЗаказ = Неопределено Тогда
		Возврат;	
	КонецЕсли;	

	АнализОбеспеченияЗаказа.ЗаказПотребность = ВхДокЗаказ;

	АнализОбеспеченияЗаказа.СформироватьОтчет(ВхТаблДок);
	
КонецПроцедуры

Процедура ВывестиДГЦепочкаЗаказов(ВхДокЗаказ, ВхДГ) Экспорт 
	
	ВхДГ.Очистить();
	
	Если ВхДокЗаказ = Неопределено
			ИЛИ (НЕ ТипЗнч(ВхДокЗаказ) = Тип("ДокументСсылка.ЗаказНаПроизводство")) Тогда
		Возврат;	
	КонецЕсли;
	
	// Корень дерева (заказ покупателя тоже учитывается)
	_СсылкаКорень = глПолучитьГоловнойЗаказПотребность(ВхДокЗаказ);
	
	масс_Заказы = Новый Массив;
	ДобавитьПодчиненныеЗаказы(масс_Заказы, _СсылкаКорень);
		
	
	_ОтборОстатков = Новый Соответствие;
	_ОтборОстатков.Вставить("ДокЗаказ", масс_Заказы);
	_ОтборОстатков.Вставить("КолЗаказано > 0");
	
	табл_ЗаказыНаПроизводство = глПолучитьОстатки_ЗаказыНаПроизводство( ТекущаяДата(), 
																		Неопределено,
																		_ОтборОстатков);
	
	серия_ДГ = ВхДГ.УстановитьСерию(Неопределено);
	соотв_ИнтервалыЗаказов = Новый Соответствие;
	Для Каждого ДокЗаказ Из масс_Заказы Цикл
		
		Если ДГТолькоНеПомеченные И ДокЗаказ.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		
		точка_ДГ = ВхДГ.УстановитьТочку(ДокЗаказ);
		точка_ДГ.Расшифровка 	= ДокЗаказ;
		точка_ДГ.ПриоритетЦвета = Истина;
		
		Если ТипЗнч(ДокЗаказ) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
				
			точка_ДГ.Текст 			= "№ <" + ДокЗаказ.Номер + "> РЦ <" + ДокЗаказ.РабочийЦентр + "> Состав <" + ДокЗаказ.ПродукцияСтр + ">";
			
			Если ВхДокЗаказ = ДокЗаказ Тогда
				точка_ДГ.Цвет = Новый Цвет(0, 0, 255);
			ИначеЕсли табл_ЗаказыНаПроизводство.Найти(ДокЗаказ, "ДокЗаказ") = Неопределено Тогда 
				точка_ДГ.Цвет = Новый Цвет(220, 220, 220);
			Иначе
				точка_ДГ.Цвет = Новый Цвет(128, 128, 128);
			КонецЕсли;
			
			_Значение = ВхДГ.ПолучитьЗначение(точка_ДГ, серия_ДГ);
			_Значение.Расшифровка = ДокЗаказ;
			
			стру_ПроизводственныйПериод = глПроизводственныйПериод_ПолучитьПоследний(ДокЗаказ.РабочийЦентр, ДокЗаказ.ДатаИсполнения);
			
			Если стру_ПроизводственныйПериод.Получен Тогда 
			
				_Интервал = _Значение.Добавить();	
				_Интервал.Начало 		= стру_ПроизводственныйПериод.Начало;	
				_Интервал.Конец 		= стру_ПроизводственныйПериод.Окончание;
				_Интервал.Расшифровка 	= ДокЗаказ;
				
				_Интервал.Значение.Редактирование = Истина;
				
				соотв_ИнтервалыЗаказов.Вставить(ДокЗаказ, _Интервал);
			
			КонецЕсли;
			
		ИначеЕсли НЕ глПустоеЗначение(ДокЗаказ.ДатаОбеспеченияПотребностей) Тогда
			
			точка_ДГ.Текст 			= глПредставлениеОбъекта(ДокЗаказ);
			точка_ДГ.Цвет 			= Новый Цвет(0, 0, 0);
			
			_Значение = ВхДГ.ПолучитьЗначение(точка_ДГ, серия_ДГ);
			_Значение.Расшифровка = ДокЗаказ;
			
			_Интервал = _Значение.Добавить();	
			_Интервал.Начало 		= ДокЗаказ.ДатаОбеспеченияПотребностей;	
			_Интервал.Конец 		= ДокЗаказ.ДатаОбеспеченияПотребностей + 7200;
			_Интервал.Расшифровка 	= ДокЗаказ;
			
			_Интервал.Значение.Редактирование = Истина;
			
			соотв_ИнтервалыЗаказов.Вставить(ДокЗаказ, _Интервал);	
			
		КонецЕсли;
				
	КонецЦикла;
	
	Для Каждого эл_ИнтервалыЗаказов Из соотв_ИнтервалыЗаказов Цикл
		
		Если НЕ ТипЗнч(эл_ИнтервалыЗаказов.Ключ) = Тип("ДокументСсылка.ЗаказНаПроизводство")
			И НЕ  ТипЗнч(эл_ИнтервалыЗаказов.Ключ) = Тип("ДокументСсылка.ЗаказНаПеремещениеТМЦМеждуФилиалами") Тогда 
			Продолжить;
		КонецЕсли;
		
		_ИнтервалРодителя = соотв_ИнтервалыЗаказов.Получить(эл_ИнтервалыЗаказов.Ключ.ПодЗаказ);		
		Если НЕ _ИнтервалРодителя = Неопределено Тогда	
			связь_ДГ = эл_ИнтервалыЗаказов.Значение.Добавить(_ИнтервалРодителя);			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ВывестиМониторПроизводственныхЗаказов(ВхДокЗаказ, ВхТаблДок) Экспорт 

	ВхТаблДок.Очистить();

	Если глПустоеЗначение(ВхДокЗаказ) Тогда
		Возврат;	
	КонецЕсли;	

	МониторПроизводственныхЗаказов.СпРабочийЦентрГруппаРЦ = ВхДокЗаказ.РабочийЦентр;
	МониторПроизводственныхЗаказов.ДобавитьОтбор("ЗаказНаПроизводство", Истина, ВидСравнения.Равно, ВхДокЗаказ);
	МониторПроизводственныхЗаказов.РассчитатьИЗаполнитьТЧ();

	_ВыводитьЗаголовок = Ложь;
	МониторПроизводственныхЗаказов.ВывестиРезультаты(ВхТаблДок, _ВыводитьЗаголовок);
	
КонецПроцедуры

Процедура ДобавитьПодчиненныеЗаказы(ВхМассЗаказы, ВхГоловнойЗаказПотребность)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодчиненныеЗаказы.Ссылка КАК ДокЗаказ,
		|	ПодчиненныеЗаказы.ПодЗаказ КАК ПодЗаказ,
		|	ПодчиненныеЗаказы.ДатаИсполненияПредельная КАК ДатаИсполненияПредельная
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказНаПроизводство.Ссылка КАК Ссылка,
		|		ЗаказНаПроизводство.ДатаИсполненияПредельная КАК ДатаИсполненияПредельная,
		|		ЗаказНаПроизводство.ПодЗаказ КАК ПодЗаказ
		|	ИЗ
		|		Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|	ГДЕ
		|		ЗаказНаПроизводство.ГоловнойЗаказПотребность = &ГоловнойЗаказПотребность
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказНаПеремещениеТМЦМеждуФилиалами.Ссылка,
		|		ЗаказНаПеремещениеТМЦМеждуФилиалами.ДатаИсполненияПредельная,
		|		ЗаказНаПеремещениеТМЦМеждуФилиалами.ПодЗаказ
		|	ИЗ
		|		Документ.ЗаказНаПеремещениеТМЦМеждуФилиалами КАК ЗаказНаПеремещениеТМЦМеждуФилиалами
		|	ГДЕ
		|		ЗаказНаПеремещениеТМЦМеждуФилиалами.ГоловнойЗаказПотребность = &ГоловнойЗаказПотребность) КАК ПодчиненныеЗаказы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаИсполненияПредельная УБЫВ";
	
	Запрос.УстановитьПараметр("ГоловнойЗаказПотребность", ВхГоловнойЗаказПотребность);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ВхМассЗаказы.Добавить(ВхГоловнойЗаказПотребность); // Головной заказ
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ДокЗаказ = ВхГоловнойЗаказПотребность Тогда 
			Продолжить;
		КонецЕсли;
		
		_ИндексПодЗаказ = ВхМассЗаказы.Найти(Выборка.ПодЗаказ);
		
		Если _ИндексПодЗаказ = Неопределено Тогда 
			ВхМассЗаказы.Вставить(0, Выборка.ДокЗаказ);
		Иначе	
			ВхМассЗаказы.Вставить(_ИндексПодЗаказ, Выборка.ДокЗаказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПанельМониторинг(ВхЭлемФормы) Экспорт 
	
	элформы_ДГПоказатели = ВхЭлемФормы.ДГПоказатели;
	
	// Сброс
	ВхЭлемФормы.ТаблСтатистикаМатОбеспечения.Значение.Очистить();
	ВхЭлемФормы.ТаблТекПериод.Значение.Очистить();
	элформы_ДГПоказатели.Очистить();
	ВхЭлемФормы.НадписьМониторингРабочийЦентрЗначение.Значение = "";
	ВхЭлемФормы.НадписьМониторингНетДанных.Видимость = Ложь;
	
	Если НЕ ВыводитьМониторинг Тогда 
		Возврат;
	КонецЕсли;
	
	_ТекДата = ТекущаяДата();
	
	Если НачалоДня(ДатаНач) < НачалоДня(_ТекДата) Тогда
		ВхЭлемФормы.НадписьМониторингНетДанных.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеДеревоЗаказы = ВхЭлемФормы.ДеревоЗаказы.ТекущиеДанные;
	Если глПустоеЗначение(ТекущиеДанныеДеревоЗаказы) Тогда
		ВхЭлемФормы.НадписьМониторингНетДанных.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	_РабочийЦентр = ВхЭлемФормы.ПанельРабочиеЦентры.ТекущаяСтраница.Значение;
	ВхЭлемФормы.НадписьМониторингРабочийЦентрЗначение.Значение = ?(глПустоеЗначение(_РабочийЦентр), "", _РабочийЦентр.Наименование);
	стру_Период = глПроизводственныйПериод_ПолучитьТекущий(_РабочийЦентр, _ТекДата);		
	
	_ПериодНачало 		= Неопределено;
	_ПериодОкончание 	= Неопределено;
	
	Если НЕ стру_Период = Неопределено Тогда 
		_ПериодНачало 		= стру_Период.Начало;
		_ПериодОкончание 	= стру_Период.Окончание;
	КонецЕсли;
	
	Если глПустоеЗначение(_ПериодНачало)
			ИЛИ глПустоеЗначение(_ПериодОкончание) Тогда
		ВхЭлемФормы.НадписьМониторингНетДанных.Видимость = Истина;
		Возврат;	
	КонецЕсли;
	
	_ВыводитьПлановуюМощность 				= ПолучитьИспользованиеПоказателя("ПлановаяМощность");
	_ВыводитьПлановуюЗагрузку 				= ПолучитьИспользованиеПоказателя("ПлановаяЗагрузка");
	_ВыводитьТекущуюМощность 				= ПолучитьИспользованиеПоказателя("ТекущаяМощность");
	_ВыводитьОстатокВыполнения 				= ПолучитьИспользованиеПоказателя("ОсталосьВыполнить");
	_ВыводитьИсполнениеПлана 				= ПолучитьИспользованиеПоказателя("ИсполнениеПлана");
	_ВыводитьОтклонениеОтПлана 				= ПолучитьИспользованиеПоказателя("ОтклонениеОтПлана");
	_ВыводитьОтклонениеПроизводительности 	= ПолучитьИспользованиеПоказателя("ОтклонениеПроизводительности");
	
	стру_Отбор = Новый Структура;
	стру_Отбор.Вставить("РабочийЦентр", 	_РабочийЦентр);
	стру_Отбор.Вставить("ДатаИсполнения", 	_ПериодОкончание);
	масс_ТаблЗаказы = ТаблЗаказы.НайтиСтроки(стру_Отбор);
			
	_ПотребностьВМощностяхОстаток 	= 0;
	_ПотребностьВМощностяхПриход 	= 0;
	
	табл_СтатистикаМатОбеспечение = Новый ТаблицаЗначений;
	табл_СтатистикаМатОбеспечение.Колонки.Добавить("Статус", 				Новый ОписаниеТипов("СправочникСсылка.СтатусыОбеспеченияЗаказов"));
	табл_СтатистикаМатОбеспечение.Колонки.Добавить("КолЗаказов", 			Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(12,0)));
	табл_СтатистикаМатОбеспечение.Колонки.Добавить("КолЗагрузкаМощностей", 	Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(12,3)));
	
	Для Каждого строка_ТаблЗаказы Из масс_ТаблЗаказы Цикл
		
		_ПотребностьВМощностяхОстаток 	= _ПотребностьВМощностяхОстаток + строка_ТаблЗаказы.ЗагрузкаМощностей;
		_ПотребностьВМощностяхПриход 	= _ПотребностьВМощностяхПриход + строка_ТаблЗаказы.ЗагрузкаМощностейПриход;
		
		строка_ТаблСтатистикаМатОбеспечение = табл_СтатистикаМатОбеспечение.Добавить();
		строка_ТаблСтатистикаМатОбеспечение.Статус 					= строка_ТаблЗаказы.СтатусОбеспечения;
		строка_ТаблСтатистикаМатОбеспечение.КолЗаказов 				= 1;
		строка_ТаблСтатистикаМатОбеспечение.КолЗагрузкаМощностей 	= строка_ТаблЗаказы.ЗагрузкаМощностей;
		
	КонецЦикла;
	
	табл_СтатистикаМатОбеспечение.Свернуть("Статус", "КолЗаказов, КолЗагрузкаМощностей");
	ВхЭлемФормы.ТаблСтатистикаМатОбеспечения.Значение = табл_СтатистикаМатОбеспечение;
	
	_ПотребностьВМощностяхРасход 	= _ПотребностьВМощностяхПриход - _ПотребностьВМощностяхОстаток;
	_ДоступнаяМощностьПлан 			= стру_Период.ДоступнаяМощность * стру_Период.КоэффициентДоступности;		
	
	// загрузка текущая и производительность                                              
	_ПрошлоВремени 					= Макс((_ТекДата - _ПериодНачало) / 3600, 0);	
	_ПродолжительностьПроПериода 	= (_ПериодОкончание - _ПериодНачало) / 3600;
	
	_ОсталосьВремени 				= Макс(_ПродолжительностьПроПериода - _ПрошлоВремени, 0);
	_ПропорцияПоВремени 			= _ОсталосьВремени / _ПродолжительностьПроПериода;
	
	_ОстатокДоступнойМощности 		= _ДоступнаяМощностьПлан * _ПропорцияПоВремени;
		
	_Производительность = ?(_ДоступнаяМощностьПлан = 0, 0, 100 * ((_ПотребностьВМощностяхРасход - _ПрошлоВремени * стру_Период.КоэффициентДоступности) / _ДоступнаяМощностьПлан));
	_Производительность = Окр(_Производительность, 0, РежимОкругления.Окр15как10);
	
	
	// Тек период
	_ТаблТекПериод = ВхЭлемФормы.ТаблТекПериод.Значение;
	строка_ТаблТекПериод = _ТаблТекПериод.Добавить();
	строка_ТаблТекПериод.ТекущийПериод 	= Формат(_ПериодНачало, "ДФ=dd.MM.yyyy") + "  " +Формат(_ПериодНачало, "ДФ=HH:mm") + " : " + Формат(_ПериодОкончание, "ДФ=HH:mm; ДП=0:00");
	строка_ТаблТекПериод.ПланМощность 	= _ДоступнаяМощностьПлан;
	строка_ТаблТекПериод.Прошло 		= Формат(Дата("000101010000") + _ПрошлоВремени * 3600, "ДФ=HH:mm; ДП=0:00");
	
	строка_ТаблТекПериод.Осталось 		= Формат(Дата("000101010000") + Окр(_ОсталосьВремени, 1, РежимОкругления.Окр15как10) * 3600, "ДФ=HH:mm; ДП=0:00");
		
	// Исполнение плана абсолютное
	_ИсполнениеПланаАбсолютное = Окр(?(_ПотребностьВМощностяхПриход = 0, 0, _ПотребностьВМощностяхРасход * 100 / _ПотребностьВМощностяхПриход), 0, РежимОкругления.Окр15как20);	
	
	// План относительный
	_ИсполнениеПланаОтносительное = ?(_ПотребностьВМощностяхПриход = 0 ИЛИ _ДоступнаяМощностьПлан = 0, 
															0, 
															Окр(100 * (_ПотребностьВМощностяхРасход / _ПотребностьВМощностяхПриход - _ПрошлоВремени / _ДоступнаяМощностьПлан), 0, РежимОкругления.Окр15как10));
	
	_ПериодНачалоДГ = НачалоДня(_ПериодНачало);
	
	_ПериодОкончаниеДоступнаяМощность 	= _ДоступнаяМощностьПлан * 3600;
	_ПериодЗагрузка 					= _ПотребностьВМощностяхПриход * 3600;
	_ПериодТекущаяМощность 				= _ОстатокДоступнойМощности * 3600;
	_ПериодВыполнить 					= _ПотребностьВМощностяхОстаток * 3600;
	
	_ЦенностьДеления = 0;
	_ЦенностьДеления = Макс(_ЦенностьДеления, _ПериодОкончаниеДоступнаяМощность, _ПериодЗагрузка, _ПериодТекущаяМощность, _ПериодВыполнить);
	
	_ЦенностьДеления = _ЦенностьДеления / 201;
	
	_ПериодОкончаниеДоступнаяМощность 	= _ПериодНачалоДГ + ?(_ЦенностьДеления = 0, 0, _ПериодОкончаниеДоступнаяМощность / _ЦенностьДеления);
	_ПериодЗагрузка 					= _ПериодНачалоДГ + ?(_ЦенностьДеления = 0, 0, _ПериодЗагрузка / _ЦенностьДеления);
	_ПериодТекущаяМощность 				= _ПериодНачалоДГ + ?(_ЦенностьДеления = 0, 0, _ПериодТекущаяМощность / _ЦенностьДеления);
	_ПериодВыполнить 					= _ПериодНачалоДГ + ?(_ЦенностьДеления = 0, 0, _ПериодВыполнить / _ЦенностьДеления);
	
	// Показатели загрузки
	_ЭлементФормы_ДГПоказатели = ВхЭлемФормы.ДГПоказатели;
	
	серия_ДГ1 = _ЭлементФормы_ДГПоказатели.УстановитьСерию(Неопределено);
	
	Если _ВыводитьПлановуюМощность Тогда
		
		точка_ДГ1 = _ЭлементФормы_ДГПоказатели.УстановитьТочку("1");
		точка_ДГ1.Текст = "Плановая мощность:";
		
		_Значение = _ЭлементФормы_ДГПоказатели.ПолучитьЗначение(точка_ДГ1, серия_ДГ1);
		_Значение.Текст = Строка(Окр(_ДоступнаяМощностьПлан, 1, РежимОкругления.Окр15как10)) + " н/ч, 100%";
		
		_Интервал = _Значение.Добавить();	
		_Интервал.Начало 		= _ПериодНачалоДГ;	
		_Интервал.Конец 		= _ПериодОкончаниеДоступнаяМощность;
		_Интервал.Цвет 			= WebЦвета.НасыщенноНебесноГолубой;
	
	КонецЕсли;

	Если _ВыводитьПлановуюЗагрузку Тогда
		
		точка_ДГ2 = _ЭлементФормы_ДГПоказатели.УстановитьТочку("2");
		точка_ДГ2.Текст = "Плановая загрузка:";
		
		_Значение = _ЭлементФормы_ДГПоказатели.ПолучитьЗначение(точка_ДГ2, серия_ДГ1);
		
		_Процент = Окр(?(_ДоступнаяМощностьПлан = 0, 0, _ПотребностьВМощностяхПриход * 100 / _ДоступнаяМощностьПлан), 0, РежимОкругления.Окр15как20);	
		_Значение.Текст = Строка(Окр(_ПотребностьВМощностяхПриход, 1, РежимОкругления.Окр15как10)) + " н/ч, " + _Процент + "%";
		
		_Интервал = _Значение.Добавить();	
		_Интервал.Начало 		= _ПериодНачалоДГ;	
		_Интервал.Конец 		= _ПериодЗагрузка;
		
		стру_ЦветоваяСхема 	= РегистрыСведений.ЦветовыеСхемы.ПолучитьЦветовуюСхему(Перечисления.ПоказателиЦветовыхСхем.ЗагрузкаПроизводственныхМощностей, _Процент);
		_Интервал.Цвет 		= стру_ЦветоваяСхема.ЦветФона;
			
	КонецЕсли;

	Если _ВыводитьТекущуюМощность Тогда
		
		точка_ДГ3 = _ЭлементФормы_ДГПоказатели.УстановитьТочку("3");
		точка_ДГ3.Текст = "Остаток мощности:";
		
		_Значение = _ЭлементФормы_ДГПоказатели.ПолучитьЗначение(точка_ДГ3, серия_ДГ1);
		
		_Процент = Окр(?(_ДоступнаяМощностьПлан = 0, 0, _ОстатокДоступнойМощности * 100 / _ДоступнаяМощностьПлан), 0, РежимОкругления.Окр15как20);
		_Значение.Текст = Строка(Окр(_ОстатокДоступнойМощности, 1, РежимОкругления.Окр15как10)) + " н/ч, " + _Процент + "%";
		
		_Интервал = _Значение.Добавить();	
		_Интервал.Начало 	= _ПериодНачалоДГ;	
		_Интервал.Конец 	= _ПериодТекущаяМощность;
		_Интервал.Цвет 		= WebЦвета.НасыщенноНебесноГолубой;
		
	КонецЕсли;
		
	Если _ВыводитьОстатокВыполнения Тогда
		
		точка_ДГ4 = _ЭлементФормы_ДГПоказатели.УстановитьТочку("4");
		точка_ДГ4.Текст = "Осталось выполнить:";
		
		_Значение = _ЭлементФормы_ДГПоказатели.ПолучитьЗначение(точка_ДГ4, серия_ДГ1);
		
		_Процент = Окр(?(_ПотребностьВМощностяхПриход = 0, 0, _ПотребностьВМощностяхОстаток * 100 / _ПотребностьВМощностяхПриход), 0, РежимОкругления.Окр15как20);
		_Значение.Текст = Строка(Окр(_ПотребностьВМощностяхОстаток, 1, РежимОкругления.Окр15как10)) + " н/ч, " + _Процент + "%";
		
		_Интервал = _Значение.Добавить();	
		_Интервал.Начало 		= _ПериодНачалоДГ;	
		_Интервал.Конец 		= _ПериодВыполнить;
		
		стру_ЦветоваяСхема 	= РегистрыСведений.ЦветовыеСхемы.ПолучитьЦветовуюСхему(Перечисления.ПоказателиЦветовыхСхем.ЗагрузкаПроизводственныхМощностей, _Процент);
		_Интервал.Цвет 		= стру_ЦветоваяСхема.ЦветФона;
		
	КонецЕсли;
	
	
	// Показатели производительности
	
	Если _ВыводитьИсполнениеПлана Тогда
		
		точка_ДГ5 = _ЭлементФормы_ДГПоказатели.УстановитьТочку("5");
		точка_ДГ5.Текст = "Исполнение плана:";
		
		_Значение = _ЭлементФормы_ДГПоказатели.ПолучитьЗначение(точка_ДГ5, серия_ДГ1);
		_Значение.Текст = Строка(_ИсполнениеПланаАбсолютное) + "%";
		
		_Интервал = _Значение.Добавить();	
		_Интервал.Начало 		= _ПериодНачалоДГ;	
		_Интервал.Конец 		= _ПериодНачалоДГ + _ИсполнениеПланаАбсолютное * 2 + ?(_ИсполнениеПланаАбсолютное = 100, 1, 0);
		
		стру_ЦветоваяСхема 	= РегистрыСведений.ЦветовыеСхемы.ПолучитьЦветовуюСхему(Перечисления.ПоказателиЦветовыхСхем.МониторРЦИсполнениеПлана, _ИсполнениеПланаАбсолютное);
		_Интервал.Цвет 		= стру_ЦветоваяСхема.ЦветФона;
		
	КонецЕсли;
	
	Если _ВыводитьОтклонениеОтПлана Тогда
		
		точка_ДГ6 = _ЭлементФормы_ДГПоказатели.УстановитьТочку("6");
		точка_ДГ6.Текст = "Отклонение от плана:";
		
		_Значение = _ЭлементФормы_ДГПоказатели.ПолучитьЗначение(точка_ДГ6, серия_ДГ1);
		_Значение.Текст = ?(_ИсполнениеПланаОтносительное > 0, "+", "") + Строка(_ИсполнениеПланаОтносительное) + "%";
		
		ДобавитьИнтервалыВЗначениеДГОтносительные(_Значение, _ИсполнениеПланаОтносительное, _ПериодНачалоДГ, Перечисления.ПоказателиЦветовыхСхем.МониторРЦОтклонениеОтПлана);
		
	КонецЕсли;
	
	Если _ВыводитьОтклонениеПроизводительности Тогда
		
		точка_ДГ7 = _ЭлементФормы_ДГПоказатели.УстановитьТочку("7");
		точка_ДГ7.Текст = "Отклонение производительности:";
		
		_Значение = _ЭлементФормы_ДГПоказатели.ПолучитьЗначение(точка_ДГ7, серия_ДГ1);
		_Значение.Текст = ?(_Производительность > 0, "+", "") + Строка(_Производительность) + "%";
		
		ДобавитьИнтервалыВЗначениеДГОтносительные(_Значение, _Производительность, _ПериодНачалоДГ, Перечисления.ПоказателиЦветовыхСхем.МониторРЦОтклонениеПроизводительности);	
			
	КонецЕсли;
	
	_ЭлементФормы_ДГПоказатели.АвтоОпределениеПолногоИнтервала = Ложь;
	_ЭлементФормы_ДГПоказатели.УстановитьПолныйИнтервал(_ПериодНачалоДГ, _ПериодНачалоДГ + 201 + 50);
		
КонецПроцедуры

// Помещает реквизиты объекта в единую структуру для сохранения на регистре "Сохраненные настройки"
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками, ВключаяОперативныеРеквизиты = Ложь) Экспорт
	
	Если НЕ ТипЗнч(СтруктураСНастройками) = Тип("Структура") Тогда
		СтруктураСНастройками = Новый Структура;
	КонецЕсли;
	
	СтруктураСНастройками.Вставить("НастройкиПостроителя", ПостроительОтчета.ПолучитьНастройки());
	
	СтруктураСНастройками.Вставить("Филиал",       Филиал);
	СтруктураСНастройками.Вставить("ГруппаРЦ",     ГруппаРЦ);
	СтруктураСНастройками.Вставить("ТипРЦ",        ТипРЦ);
	СтруктураСНастройками.Вставить("РабочийЦентр", РабочийЦентр);
	
	СтруктураСНастройками.Вставить("ВыводитьГруппировкуЗаказПокупателя", ВыводитьГруппировкуЗаказПокупателя);
	СтруктураСНастройками.Вставить("ВыводитьЗагрузкуМощностей",          ВыводитьЗагрузкуМощностей);
	СтруктураСНастройками.Вставить("ВыводитьМониторинг",                 ВыводитьМониторинг);
	СтруктураСНастройками.Вставить("ДГТолькоНеПомеченные",               ДГТолькоНеПомеченные);
	
	СтруктураСНастройками.Вставить("ОтключитьАвтообновление",            ОтключитьАвтообновление);
	
	СтруктураСНастройками.Вставить("СписокСтатусы",     	СписокСтатусы);
	СтруктураСНастройками.Вставить("ИспользоватьДатаНач",	ИспользоватьДатаНач);
	СтруктураСНастройками.Вставить("КолДней",           	КолДней);
	СтруктураСНастройками.Вставить("ПакетнаяОбработка", 	ПакетнаяОбработка);
	СтруктураСНастройками.Вставить("АльтернативныеРЦ",  	АльтернативныеРЦ);
	СтруктураСНастройками.Вставить("ВыводитьВРазрезеРЦ",  	ВыводитьВРазрезеРЦ);
	
	Если ВключаяОперативныеРеквизиты Тогда
		
		СтруктураСНастройками.Вставить("ДатаНач", ДатаНач);
		
	КонецЕсли;
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

Процедура ОбработкаРасшифровки_ТабДокМонитор(ВхФорма, ВхТабДок, ВхРасшифровка, ВхКоманда, ВыхМодифицированность) Экспорт  		
				
	_Заказ 			= ВхРасшифровка.П[0];
	_Номенклатура 	= ВхРасшифровка.П[1];
	
	Если ВхКоманда = "РасшифровкаЗаказа" Тогда
		
		МониторПроизводственныхЗаказов.ЗаказДляАнализа = _Заказ;
		
		_Форма = МониторПроизводственныхЗаказов.ПолучитьФорму("ФормаРасшифровка", ВхФорма);
		_Форма.ЭлементыФормы.ДействияФормы.Кнопки.Заголовок.Пометка = Истина;
		_Форма.Открыть();
		
		МониторПроизводственныхЗаказов.ВывестиРашифровкуЗаказа(_Форма.ЭлементыФормы.ТабДок, Истина);
		
	КонецЕсли;	
	
КонецПроцедуры

// =================== ПРОЦЕДУРЫ И ФУНКЦИИ СОХРАНЕНИЯ И ВОССТАНОВЛЕНИЯ НАСТРОЕК =========

// Восстанавливает значения интерфейсных реквизитов объекта перед началом работы с формой
Процедура ВосстановитьДополнительныеНастройки() Экспорт
	
	_ИмяОбъекта = СтрЗаменить(Строка(ЭтотОбъект), ".", "_");
	
	ПанельНастройкиРазвернута = ?(ВосстановитьЗначение(_ИмяОбъекта + "_" + "ПанельНастройкиРазвернута") = Истина, Истина, Ложь);
	ПоказыватьСостояниеЗаказа = ?(ВосстановитьЗначение(_ИмяОбъекта + "_" + "ПоказыватьСостояниеЗаказа") = Истина, Истина, Ложь);
	
	СкрыватьСостояниеПриСменеЗаказа              = ?(ВосстановитьЗначение(_ИмяОбъекта + "_" + "СкрыватьСостояниеПриСменеЗаказа")              = Истина, Истина, Ложь);
	ПоказыватьПредварительныеЗапускиВПроизводство = ?(ВосстановитьЗначение(_ИмяОбъекта + "_" + "ПоказыватьПредварительныеЗапускиВПроизводство") = Истина, Истина, Ложь);
	
КонецПроцедуры // ВосстановитьДополнительныеНастройки()

// Сохраняет значения интерфейсных реквизитов объекта при завершении работы с формой
Процедура СохранитьДополнительныеНастройки() Экспорт
	
	_ИмяОбъекта = СтрЗаменить(Строка(ЭтотОбъект), ".", "_");
	
	СохранитьЗначение(_ИмяОбъекта + "_" + "ПанельНастройкиРазвернута", 						ПанельНастройкиРазвернута);
	СохранитьЗначение(_ИмяОбъекта + "_" + "ПоказыватьСостояниеЗаказа", 						ПоказыватьСостояниеЗаказа);
	СохранитьЗначение(_ИмяОбъекта + "_" + "СкрыватьСостояниеПриСменеЗаказа", 				СкрыватьСостояниеПриСменеЗаказа);
	СохранитьЗначение(_ИмяОбъекта + "_" + "ПоказыватьПредварительныеЗапускиВПроизводство", 	ПоказыватьПредварительныеЗапускиВПроизводство);
	
КонецПроцедуры // СохранитьДополнительныеНастройки()

// Восстанавливает значения реквизитов объекта из единой структуры
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Если НЕ ТипЗнч(СтруктураСНастройками) = Тип("Структура") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Попытка
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураСНастройками);
		
		Если Не ИспользоватьДатаНач Тогда
			ДатаНач = Дата(1,1,1);	
		КонецЕсли;
		
		Если СтруктураСНастройками.Свойство("НастройкиПостроителя") Тогда
			ПостроительОтчета.УстановитьНастройки(СтруктураСНастройками.НастройкиПостроителя);
		КонецЕсли;
		
		Если СтруктураСНастройками.Свойство("НастройкиПостроителяОтбор") Тогда
			
			_НастройкиПостроителяОтбор = СтруктураСНастройками.НастройкиПостроителяОтбор;
			Для Каждого _ЭлементОтбора Из _НастройкиПостроителяОтбор Цикл
				Если _ЭлементОтбора.Использование Тогда
					ДобавитьОтбор(_ЭлементОтбора.ПутьКДанным, Истина, _ЭлементОтбора.ВидСравнения, _ЭлементОтбора.Значение, _ЭлементОтбора.ЗначениеС, _ЭлементОтбора.ЗначениеПо);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		
		глСообщить(ЭтотОбъект, "Не удалось восстановить сохраненные настройки: " + ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

Процедура УстановитьЗаголовокФормы(Форма) Экспорт
	
	Форма.Заголовок = мНазваниеОбработки;
	
	Если мТекущаяНастройка <> Неопределено И мТекущаяНастройка.Свойство("НаименованиеНастройки") И мТекущаяНастройка.НаименованиеНастройки <> Неопределено Тогда
		
		Форма.Заголовок = Форма.Заголовок + ". Настройка: " + СокрЛП(мТекущаяНастройка.НаименованиеНастройки);
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьЗаголовокФормы()

// ----------------------------------------------------------------------------------
// ИНИЦИАЛИЗАЦИЯ 
// ----------------------------------------------------------------------------------

ИнициализацияОбработки();

мВосстанавливатьНастройкиПриОткрытии 	= Истина;
ВыводитьВРазрезеРЦ 						= Истина;

мНазваниеОбработки = "Управление заказами на производство (MES)";

#КонецЕсли                       		