#Область ПрограммныйИнтерфейс

Процедура РедакторОбъекта(Ссылка, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментРедакторОбъекта();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылка);
	
КонецПроцедуры

Процедура НайтиСсылкиНаОбъект(Ссылка, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментПоискСсылокНаОбъект();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылка);
	
КонецПроцедуры

Процедура ПоискИЗаменаСсылок(Ссылки, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментПоискИЗаменаСсылок();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылки);
	
КонецПроцедуры

Процедура ЖурналРегистрации(Ссылка, ПараметрыВыполнения) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Данные", Ссылка);
	
	ИТК_ФормаКлиент.ОткрытьЖурналРегистрации(Параметры);
	
КонецПроцедуры

Процедура ПодпискиНаСобытия(Ссылки, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментПодпискиНаСобытия();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылки);
	
КонецПроцедуры

Процедура СвойстваМетаданныхОбъекта(Ссылка, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментМетаданные();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылка);
	
КонецПроцедуры

Процедура СтруктураХраненияОбъекта(Ссылка, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментСтруктураХранения();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылка);
	
КонецПроцедуры

Процедура АнализПравДоступа(Ссылки, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментАнализПравДоступа();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылки);
	
КонецПроцедуры

Процедура СравнениеОбъектов(Ссылки, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментСравнениеОбъектов();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылки);
	
КонецПроцедуры

Процедура ОбработкаВКонсолиКода(Ссылки, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментОбработкаВКонсолиКода();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылки);
	
КонецПроцедуры

#КонецОбласти
