#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных
	
Перем мТаблицаИзменений; // Служит для передачи изменений между обработчиками.
 
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПолучитьФункциональнуюОпцию("бит_ИспользоватьМеханизмОповещений") Тогда
		ТаблицаОповещений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_фн_АктивныеОповещения");
	Иначе
		ТаблицаОповещений = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(мТаблицаИзменений) = Тип("ТаблицаЗначений") Тогда
		Для каждого СтрокаТаблицы Из мТаблицаИзменений Цикл
			СохранитьИсторию(СтрокаТаблицы);
			Если Не ТаблицаОповещений = Неопределено Тогда
				ЗарегистрироватьСобытиеПринятоРешение(СтрокаТаблицы,ТаблицаОповещений);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 
	
	Если ТаблицаОповещений <> Неопределено И НЕ ДополнительныеСвойства.Свойство("ОтключитьРегистрациюОповещений") Тогда
		ЗарегистрироватьСобытиеДоступныеВизы(ТаблицаОповещений); 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		
		ТаблицаЗаписей = ЭтотОбъект.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаЗаписей", ТаблицаЗаписей);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЗаписей.Объект КАК Объект,
		|	ТаблицаЗаписей.Виза КАК Виза,
		|	ТаблицаЗаписей.ИД КАК ИД,
		|	ТаблицаЗаписей.Решение КАК Решение,
		|	ТаблицаЗаписей.Пользователь КАК Пользователь,
		|	ТаблицаЗаписей.Комментарий КАК Комментарий,
		|	ТаблицаЗаписей.ДатаКрайняя КАК ДатаКрайняя,
		|	ТаблицаЗаписей.ДатаУстановки КАК ДатаУстановки
		|ПОМЕСТИТЬ ТаблицаЗаписей
		|ИЗ
		|	&ТаблицаЗаписей КАК ТаблицаЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗаписей.Объект КАК Объект,
		|	ТаблицаЗаписей.Виза КАК Виза,
		|	ТаблицаЗаписей.ИД КАК ИД,
		|	ТаблицаЗаписей.Пользователь КАК Пользователь,
		|	ТаблицаЗаписей.Комментарий КАК Комментарий,
		|	ТаблицаЗаписей.ДатаКрайняя КАК ДатаКрайняя,
		|	ТаблицаЗаписей.ДатаУстановки КАК ДатаУстановки,
		|	ЕСТЬNULL(ТаблицаДо.Решение, ЗНАЧЕНИЕ(Справочник.бит_ВидыРешенийСогласования.ПустаяСсылка)) КАК РешениеНачальное,
		|	ТаблицаЗаписей.Решение КАК РешениеКонечное
		|ИЗ
		|	ТаблицаЗаписей КАК ТаблицаЗаписей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_УстановленныеВизы КАК ТаблицаДо
		|		ПО ТаблицаЗаписей.Объект = ТаблицаДо.Объект
		|			И ТаблицаЗаписей.ИД = ТаблицаДо.ИД
		|			И ТаблицаЗаписей.Виза = ТаблицаДо.Виза
		|ГДЕ
		|	(ЕСТЬNULL(ТаблицаДо.Решение, ЗНАЧЕНИЕ(Справочник.бит_ВидыРешенийСогласования.ПустаяСсылка)) <> ТаблицаЗаписей.Решение
		|			ИЛИ ЕСТЬNULL(ТаблицаДо.Комментарий, """") <> ТаблицаЗаписей.Комментарий)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаЗаписей";
					   
		мТаблицаИзменений = Запрос.Выполнить().Выгрузить();	
	
		Для каждого СтрокаТаблицы Из мТаблицаИзменений Цикл

			Если ЗначениеЗаполнено(СтрокаТаблицы.РешениеКонечное)
				И ОпределитьНеобходимостьКомментарияЗадачи(СтрокаТаблицы) Тогда
		
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ИД", СтрокаТаблицы.ИД);
				СтруктураОтбора.Вставить("Виза", СтрокаТаблицы.Виза);
				СтруктураОтбора.Вставить("Объект", СтрокаТаблицы.Объект);
				
				НайденныеСтроки = ТаблицаЗаписей.НайтиСтроки(СтруктураОтбора);				
				Если НайденныеСтроки.Количество()>0 Тогда
					Индекс = ТаблицаЗаписей.Индекс(НайденныеСтроки[0]);
					ШаблонСообщения = НСтр("ru='Для принятия решения ""%1"" необходимо заполнить комментарий или создать задачу по данной визе.';
										   |en='To make a decision, ""%1"" to fill in a comment, or create a task for this visa.'");
					ШаблонСообщения = СтрШаблон(ШаблонСообщения, СтрокаТаблицы.РешениеКонечное);
					ИмяПоля = СтрШаблон("УстановленныеВизы[%1].Комментарий", Индекс);
					
					Если ДополнительныеСвойства.Свойство("СообщенияПользователю") Тогда
						Отказ = Истина;
						ДополнительныеСвойства.СообщенияПользователю.Добавить(ШаблонСообщения);
					Иначе
						ОбщегоНазначения.СообщитьПользователю(ШаблонСообщения,, ИмяПоля,, Отказ);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;				
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура сохраняет историю изменения статусов.
// 
// Параметры:
//  Запись - РегистрСведенийЗапис.бит_СтатусыОбъектов.
// 
Процедура СохранитьИсторию(СтрокаТаблицы)
	
	// Сохраним историю изменения статуса.
	МенеджерЗаписи = РегистрыСведений.бит_ИсторияИзмененияВиз.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтрокаТаблицы);
	Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаУстановки) Тогда
		МенеджерЗаписи.Период = СтрокаТаблицы.ДатаУстановки;
	Иначе
		МенеджерЗаписи.Период = ТекущаяДатаСеанса(); 
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(МенеджерЗаписи.Пользователь) Тогда
		МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли; 
	МенеджерЗаписи.Решение = СтрокаТаблицы.РешениеКонечное;
	
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		ШаблонСообщения = НСтр("ru='Не удалось сохранить историю изменения решений по визе ""%1"". По причине: %2';
							   |en='Unable to save the history of changes in visa decisions ""%1"". For a reason:%2'");
		Кратко 	 = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(СтрокаТаблицы.Виза), Кратко);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Визирование'; en = 'Visioning'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.бит_УстановленныеВизы,,ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры // СохранитьИсторию()

// Процедура регистрирует события для последующих оповещений.
// 
// Параметры:
//  Запись            - РегистрСведенийЗапис.бит_СтатусыОбъектов.
//  ТаблицаОповещений - ТаблицаЗначений.
// 
Процедура ЗарегистрироватьСобытиеПринятоРешение(Запись,ТаблицаОповещений)
	
	Если НЕ ЗначениеЗаполнено(Запись.Объект) Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Запись.РешениеКонечное) Тогда
		Возврат;
	КонецЕсли; 
	
	// Обработаем оповещения.
	Если ТаблицаОповещений <> Неопределено И НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("бит_ОтключитьРегистрациюОповещений") Тогда
		
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Запись.Объект.Метаданные());
		
		Фильтр = Новый Структура;
		Фильтр.Вставить("ВидСобытия", 	 Перечисления.бит_фн_ВидыСобытийОповещений.ПринятоРешение);
		Фильтр.Вставить("ОбъектСистемы", ОбъектСистемы);
		
		ДоступныеОповещения = ТаблицаОповещений.НайтиСтроки(Фильтр);
		
		Для каждого СтрокаОповещения Из ДоступныеОповещения Цикл
			
			ВизаСоответствует = Ложь;
			// Проверим "быстрые" условия.
			Если НЕ ЗначениеЗаполнено(СтрокаОповещения.Виза) 
			 ИЛИ СтрокаОповещения.Виза = Запись.Виза Тогда
				ВизаСоответствует = Истина;
			КонецЕсли; 
			
			РешениеСоответствует = Ложь;
			// Проверим "быстрые" условия.
			Если НЕ ЗначениеЗаполнено(СтрокаОповещения.Решение) 
			 ИЛИ СтрокаОповещения.Решение = Запись.РешениеКонечное Тогда
				РешениеСоответствует = Истина;
			КонецЕсли; 
			
			УсловиеВыполнено = РешениеСоответствует И ВизаСоответствует;
			// Если задано пользовательское условие, проверим его.
			Если УсловиеВыполнено И ЗначениеЗаполнено(СтрокаОповещения.ПользовательскоеУсловие) Тогда
				
				КонтекстУсловия = Новый Структура("ТекущийОбъект, НаборВизы");
				КонтекстУсловия.Вставить("ТекущийОбъект",Запись.Объект);
				
				СтруктураОтбор = Новый Структура;
				СтруктураОтбор.Вставить("Объект",Запись.Объект);
				
				НаборВизы = бит_ВизированиеСервер.ПрочитатьНаборВиз(СтруктураОтбор);
				КонтекстУсловия.Вставить("НаборВизы"    ,НаборВизы);
				
				УсловиеВыполнено = бит_УправлениеПроцессами.ПроверитьПользовательскоеУсловие(
									СтрокаОповещения.ПользовательскоеУсловие,КонтекстУсловия);
			КонецЕсли; 
			
			Если УсловиеВыполнено Тогда
				
				ПараметрыСобытия			= бит_ОповещенияСервер.НовыеПараметрыСобытия();
				ПараметрыСобытия.ВидСобытия	= Перечисления.бит_фн_ВидыСобытийОповещений.ПринятоРешение;
				ПараметрыСобытия.Оповещение	= СтрокаОповещения.Оповещение;
				ПараметрыСобытия.Объект		= Запись.Объект;
				ПараметрыСобытия.Виза		= Запись.Виза;
				ПараметрыСобытия.Решение	= Запись.РешениеКонечное;
				ПараметрыСобытия.Комментарий= Запись.Комментарий;
				бит_ОповещенияСервер.ЗарегистрироватьСобытиеДляОповещений(ПараметрыСобытия);
				
			КонецЕсли;  // Событие соответствует отборам
		КонецЦикла; // По массиву оповещений
	КонецЕсли; // Есть оповещения, нужно выполнять регистрацию.
	
КонецПроцедуры // ЗарегистироватьСобытияОповещений()

Процедура ЗарегистрироватьСобытиеДоступныеВизы(ТаблицаОповещений)
	
	Если ЭтотОбъект.Количество() > 0 И ТипЗнч(ТаблицаОповещений) = Тип("ТаблицаЗначений") Тогда
		
		ОбъектВизирования = Отбор.Объект.Значение;
		ОбъектСистемы 	  = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(ОбъектВизирования.Метаданные());
		ВыполнитьВФоне 	  = Ложь;
		
		// Кеширование результатов выполнения функций.
		ПользовательскиеУсловия = Новый Соответствие(); 
		
		Фильтр = Новый Структура;
		Фильтр.Вставить("ВидСобытия", Перечисления.бит_фн_ВидыСобытийОповещений.ДоступнаВиза);
		Фильтр.Вставить("ОбъектСистемы", ОбъектСистемы);
		
		ДостуныеОповещения = ТаблицаОповещений.НайтиСтроки(Фильтр);
		Индекс 			   = ДостуныеОповещения.ВГраница();	
		Пока Индекс >= 0 Цикл
			
			СтрокаОповещения = ДостуныеОповещения[Индекс];
			УсловиеВыполнено = Истина;
			
			Если ЗначениеЗаполнено(СтрокаОповещения.ПользовательскоеУсловие) Тогда
				
				РезультатИзКеша = ПользовательскиеУсловия.Получить(СтрокаОповещения.ПользовательскоеУсловие);
				Если РезультатИзКеша = Неопределено Тогда
					// Проверка пользовательского условия из оповещения.
					КонтекстУсловия = Новый Структура("ТекущийОбъект, Статус",
											ОбъектВизирования, Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
					
					УсловиеВыполнено = бит_УправлениеПроцессами.ПроверитьПользовательскоеУсловие(СтрокаОповещения.ПользовательскоеУсловие, 
											КонтекстУсловия);
											
					ПользовательскиеУсловия.Вставить(СтрокаОповещения.ПользовательскоеУсловие, УсловиеВыполнено);					
				Иначе	
					УсловиеВыполнено = РезультатИзКеша;
				КонецЕсли; 
				
				Если НЕ УсловиеВыполнено Тогда
					ДостуныеОповещения.Удалить(Индекс);
				КонецЕсли;
			КонецЕсли; 
			
			Если УсловиеВыполнено И СтрокаОповещения.ФоновыйРежим Тогда
				ВыполнитьВФоне = Истина;
			КонецЕсли;
			
			Индекс = Индекс - 1;
		КонецЦикла; 

		Если ДостуныеОповещения.Количество() > 0 Тогда
			
			// Получим общую таблицу точек алгоритма и виз.
			ТаблицаВизы          = ЭтотОбъект.Выгрузить();
			ТаблицаВизы.Колонки.Добавить("ДоступностьВизы", Новый ОписаниеТипов("Булево"));
			
			ТаблицаВизы.ЗаполнитьЗначения(Истина, "ДоступностьВизы");
			
			Если ВыполнитьВФоне Тогда
				
				МассивПараметров = Новый Массив;
				МассивПараметров.Добавить(ОбъектВизирования);
				МассивПараметров.Добавить(ТаблицаВизы);
				
				// Массив строк табличной части не удается передать в фоновое задание,
				// поэтому моделируем строки таб. части структурами.
				МодельМассива = Новый Массив;
				Для каждого СтрокаОповещение Из ДостуныеОповещения Цикл
					МодельСтроки = Новый Структура;
					МодельСтроки.Вставить("Виза"         , СтрокаОповещение.Виза);
					МодельСтроки.Вставить("ВидСобытия"   , СтрокаОповещение.ВидСобытия);
					МодельСтроки.Вставить("Оповещение"   , СтрокаОповещение.Оповещение);
					МодельМассива.Добавить(МодельСтроки);
				КонецЦикла; 
				
				МассивПараметров.Добавить(МодельМассива);
		        ТекстСообщения = НСтр("ru = 'Регистрация события ""ДоступнаВиза""'; 
									  |en = 'Registration of the event "" Visa Available""'"); 
				ТекФоновоеЗадание = ФоновыеЗадания.Выполнить("бит_ОповещенияСервер.ЗарегистрироватьСобытиеДоступныеВизы",
										МассивПараметров,, ТекстСообщения);
			Иначе	
				бит_ОповещенияСервер.ЗарегистрироватьСобытиеДоступныеВизы(ОбъектВизирования, ТаблицаВизы, ДостуныеОповещения);
			КонецЕсли; 
		КонецЕсли; //  МассивОповещений не пустой
	КонецЕсли; // Набор записей не пустой
	
КонецПроцедуры

Функция ОпределитьНеобходимостьКомментарияЗадачи(СтрокаТаблицы)
	
	Возврат РегистрыСведений.бит_УстановленныеВизы.НуженКомментарий(СтрокаТаблицы);
	
КонецФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли