
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники.бит_ПравилаТрансляции);
	Элементы.ФормаКомандаКомпилироватьПравила.Видимость = МожноРедактировать;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитИсполняемыйКод(Команда)
	
	ТекстЗаголовка = НСтр("ru='Обновить исполняемый код';en='Update executable code'");
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Нет выделенных строк.';en='No rows selected.'");		
		ПоказатьПредупреждение(, ТекстСообщения,, ТекстЗаголовка);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ВопросПередОбновлениемКодаЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Будет выполнено обновление исполняемого кода выделенных элементов. Продолжить?'; 
							|en = 'The executable code of the selected elements will be updated. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, ТекстЗаголовка);
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "ВопросПередОбновлениемКодаЗавершение".
// 
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура ВопросПередОбновлениемКодаЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ДлительнаяОперация = ПараметрыОбновленияИсполняемогоКода();
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Обновление исполняемого кода'; 
											    |en = 'Updates of the executable code'"); 
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииОбновленияКода", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазначениеПравилТрансляции(Команда)
	Если Элементы.Список.ВыделенныеСтроки.Количество()>0 Тогда
		ЭлементыОтбора = Новый Структура;
		ЭлементыОтбора.Вставить("МассивПравил", Элементы.Список.ВыделенныеСтроки);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
		ОткрытьФорму("Документ.бит_НазначениеПравилТрансляции.ФормаОбъекта", ПараметрыФормы,,ЭтотОбъект);
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обраборка оповещения процедуры "ПриЗавершенииОбновленияКода".
//
// Параметры:
//  Результат				 - Структура - См. общий модуль ДлительныеОпрации.
//  ДополнительныеПараметры	 - Произвольный - произвольные данные, переданные в обработку оповещения. 
//
&НаКлиенте
Процедура ПриЗавершенииОбновленияКода(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка при выполнении: %1';
																   |en = 'Execution error: %1'"),
													Результат.КраткоеПредставлениеОшибки));
	Иначе	
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если РезультатВыполнения.Статус = "Ошибка" Тогда
			ОчиститьСообщения();
			Для каждого Элемент Из РезультатВыполнения.Ошибки Цикл
				ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Значение, Элемент.Ключ);
			КонецЦикла;
		КонецЕсли;
		ПоказатьОповещениеПользователя(НСтр("ru = 'Обновление исполняемого кода';en = 'Executable code update'"),
									  "e1cib/list/Справочник.бит_ПравилаТрансляции",
									   НСтр("ru = 'Завершено.';en = 'Completed.'"),
									   БиблиотекаКартинок.Информация32);	
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ПараметрыОбновленияИсполняемогоКода()

	НаименованиеЗадания = НСтр("ru='Обновление исполняемого кода правил трансляции.';
							   |en='Update executable code translation rules.'");
	ВыполняемыйМетод = "Справочники.бит_ПравилаТрансляции.ОбновитьИсполняемыйКод";
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	// Заполнение пераметов длительной операции.
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ВыделенныеСтроки, ПараметрыВыполнения);

КонецФункции

#КонецОбласти

