&После("ПриСозданииНаСервере")
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//Первыйбит ЛТ1 ЛапшовГ "GVLapshov@1cbit.ru" 31.01.2025 +
	НовыйЭлемент = Элементы.Добавить("бит_ИдентификаторГосконтракта", Тип("ПолеФормы"), Элементы.ГруппаШапка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ИдентификаторГосконтракта";
	
	НовыйЭлемент = Элементы.Добавить("бит_СчетОткрытПоДоговору", Тип("ПолеФормы"), Элементы.ГруппаШапка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СчетОткрытПоДоговору";
	//Первыйбит ЛТ1 ЛапшовГ "GVLapshov@1cbit.ru" 31.01.2025 -
			
КонецПроцедуры  
