
&ИзменениеИКонтроль("ОбработкаПроведенияПлатежногоДокумента")
Процедура бит_ОбработкаПроведенияПлатежногоДокумента(Источник, Отказ, РежимПроведения)

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
		Возврат;
	КонецЕсли; 			
	
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ4.1] [ASHolyavko@1cbit.ru] [08.07.2026] +        
	
	//Заглушка отшибки проведения 
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетБанкаПоОперациямЭквайринга") Тогда
		//Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ4.1] [ASHolyavko@1cbit.ru] [08.07.2026] -
	
	бит_Казначейство.ОбработкаПроведенияПлатежногоДокумента(Источник, Отказ, РежимПроведения, Ложь);

КонецПроцедуры
