
#Область ПрограммныйИнтерфейс

#Область ПроцедурыИФункцииВыборИнтервала

// Функция формирует представление периода в зависимости от периодичности планирования.
// 
// Параметры:
//  ДатаНачала		  - Дата. 
//  ЗнчПериодичность  - ПеречислениеСсылка.бит_ПериодичностьПланирования. 
// 
// Возвращаемое значение:
//  Представление - Строка. 
// 
Функция СформироватьПредставлениеПериода(ДатаНачала, ЗнчПериодичность) Экспорт

	СтрФрм_День    = "ДЛФ=D";  		                         // Строка для форматирования дня.
	СтрФрм_Месяц   = НСтр("ru='ДФ=''MMMM yyyy''';
					 	  |en='ДФ=''MMMM yyyy'''");          // Строка для форматирования месяца.
	СтрФрм_Квартал = НСтр("ru='ДФ=''q ""квартал"" yyyy''';
					 	  |en='ДФ=''q ""quarter"" yyyy'''"); // Строка для форматирования квартала.
	СтрФрм_Год     = НСтр("ru='ДФ=yyyy';en='ДФ=yyyy'");  // Строка для форматирования года.
	
	
	Если ЗнчПериодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.День") Тогда
		
		Представление = НСтр("ru='День';en='Day'") + " (" + Формат(ДатаНачала, СтрФрм_День) + ")";
		
	ИначеЕсли ЗнчПериодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Неделя") Тогда
		
		Представление = НСтр("ru='Неделя';en='Week'") + " (" + Формат(НачалоНедели(ДатаНачала), СтрФрм_День)
							+ " - " + Формат(КонецНедели(ДатаНачала), СтрФрм_День) + ")";
		
	ИначеЕсли ЗнчПериодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Декада") Тогда
		
		Представление = НСтр("ru='Декада';en='Decade'") + " ("
							+ Формат(бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(ДатаНачала, ЗнчПериодичность), СтрФрм_День) 
							+ " - " + Формат(бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(ДатаНачала, ЗнчПериодичность), СтрФрм_День) + ")";		
		
	ИначеЕсли ЗнчПериодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Месяц") Тогда	
		
		Представление = Формат(ДатаНачала, СтрФрм_Месяц);
		
	ИначеЕсли ЗнчПериодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Квартал") Тогда
		
		Представление = Формат(ДатаНачала, СтрФрм_Квартал);
		
	ИначеЕсли ЗнчПериодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Полугодие") Тогда
		
		Если Формат(ДатаНачала, "ДФ=q") = "3" ИЛИ Формат(ДатаНачала, "ДФ=q") = "4" Тогда
			Представление = НСтр("ru='2-ое полугодие %1 г.';en='2nd half year %1 y.'");
			Представление = СтрШаблон(Представление, Формат(ДатаНачала, СтрФрм_Год));
		Иначе                                                                     			
			Представление = НСтр("ru='1-ое полугодие %1 г.';en='1st half year %1 y.'");
			Представление = СтрШаблон(Представление, Формат(ДатаНачала, СтрФрм_Год));
		КонецЕсли;
		
	ИначеЕсли ЗнчПериодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Год") Тогда	
		
		Представление = Формат(ДатаНачала, СтрФрм_Год);
		
	КонецЕсли; 

   Возврат Представление;
   
КонецФункции // СформироватьПредставлениеПериода()

#КонецОбласти
	
// Формирует и устанавливает текст заголовка формы документа.
// 
// Параметры:
//  ФормаДокумента 	   - УправляемаяФорма, ФормаОбычная.
//  СтруктураЗаголовка - Структура:
// 							ЭтоНовый 			 - Булево
// 							ПредставлениеОбъекта - Строка
// 							СтрокаВидаОперации 	 - Строка (По умолчанию = "")
// 							ДокументПроведен 	 - Булево (По умолчанию = Ложь)
// 							ПроведениеРазрешено  - Булево (По умолчанию = Истина)
// 
Процедура УстановитьЗаголовокФормыДокумента(ФормаДокумента, СтруктураЗаголовка) Экспорт

	ФормаДокумента.АвтоЗаголовок = Ложь; // Заголовок будем писать сами.
	
	// Получим обязательные параметры.
	флЭтоНовый		   	   = СтруктураЗаголовка.ЭтоНовый;
	ПредставлениеДокумента = СтруктураЗаголовка.ПредставлениеОбъекта;
	Если ПредставлениеДокумента = Неопределено Тогда
		ПредставлениеДокумента = "";	
	КонецЕсли;
	
	// Получим необязательные параметры.
	СтрокаВидаОперации = ?(СтруктураЗаголовка.Свойство("СтрокаВидаОперации"), СтруктураЗаголовка.СтрокаВидаОперации, "");
	
	ДокументПроведен = ?(СтруктураЗаголовка.Свойство("ДокументПроведен"), СтруктураЗаголовка.ДокументПроведен, Ложь);
	ПроведениеРазрешено = ?(СтруктураЗаголовка.Свойство("ПроведениеРазрешено"), СтруктураЗаголовка.ПроведениеРазрешено, Истина);
		
	// Получим заголовок формы документа.
	Если ПустаяСтрока(СтрокаВидаОперации) Тогда
		Заголовок = ПредставлениеДокумента + ": ";
	Иначе
		Заголовок = ПредставлениеДокумента + ": " + СтрокаВидаОперации + ". ";
	КонецЕсли;
		
	Если флЭтоНовый Тогда  
		Заголовок = Заголовок +  НСтр("ru='Новый';en='New'");
	Иначе
		
		Если ДокументПроведен Тогда
			Заголовок = Заголовок +  НСтр("ru='Проведен';en='Posted'");
		ИначеЕсли ПроведениеРазрешено Тогда
			Заголовок = Заголовок +  НСтр("ru='Не проведен';en='Not posted'");
		Иначе
			Заголовок = Заголовок +  НСтр("ru='Записан';en='Saved'");
		КонецЕсли;
		
	КонецЕсли;
	
	// Установим полученный заголовок.
	ФормаДокумента.Заголовок = Заголовок;

КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

#КонецОбласти 


