#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

//Экспортные процедуры и функции, вызываемые другими объектами и программами 

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

//Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИнициализироватьКомпоновщик(Компоновщик, ВыбранныеТипы, НастройкиКомпоновкиДанных) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьМакет("СхемаПодбора");

	ИзменитьСхемуКомпоновки(СхемаКомпоновкиДанных, ВыбранныеТипы);
		
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	Попытка
		Компоновщик.Инициализировать(ИсточникНастроек);	
	Исключение 
		ТекстСообщения = НСтр("ru='Невозможно применить настройки. По причине: %1';
							  |en='It is impossible to apply the settings. Due to: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		 
	КонецПопытки;
	
	Если НастройкиКомпоновкиДанных.Выбор.Элементы.Количество() = 0 Тогда
		Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе	
		Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);		
		
		НастройкиИсточник = НастройкиКомпоновкиДанных;
		НастройкиПриемник = Компоновщик.ПолучитьНастройки();
		
		бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(НастройкиПриемник.Отбор, НастройкиИсточник.Отбор);
		бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(НастройкиПриемник.Порядок, НастройкиИсточник.Порядок);
		
		Компоновщик.ЗагрузитьНастройки(НастройкиПриемник);
		Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	КонецЕсли;
	
	Возврат АдресСхемыКомпоновкиДанных;
	
КонецФункции

Функция ВыбранныеТипы(ТипыДокументов) Экспорт

	ВыбранныеТипы = Новый Массив;
	Для каждого СтрокаТаблицы Из ТипыДокументов Цикл
		Если СтрокаТаблицы.Пометка Тогда
			ВыбранныеТипы.Добавить(СтрокаТаблицы.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыбранныеТипы;
	
КонецФункции

Процедура ЗаполнитьТипыДокументов(ТипыДокументов) Экспорт
	
	ТипыДокументов.Очистить();
	
	ТипыОбъектовДляЗаполнения = Метаданные.Документы.бит_кзн_ПлатежнаяПозиция.Реквизиты.ДокументОснование.Тип.Типы();
	Для каждого Элемент Из ТипыОбъектовДляЗаполнения Цикл
		Если Метаданные.ОпределяемыеТипы.бит_ОбъектыБитФинанс.Тип.СодержитТип(Элемент) Тогда
			Продолжить;		
		КонецЕсли;
		МетаданныеОснования = Метаданные.НайтиПоТипу(Элемент);
		Если ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеОснования)
		   И ПравоДоступа("Просмотр", МетаданныеОснования) Тогда
		   
		   НоваяСтрока = ТипыДокументов.Добавить();
		   НоваяСтрока.Пометка		 = Истина;
		   НоваяСтрока.Значение	  	 = МетаданныеОснования.ПолноеИмя();
		   НоваяСтрока.Представление = МетаданныеОснования.Представление();
		КонецЕсли;
	КонецЦикла;
	
	МетаданныеЗНРДС = Метаданные.Документы.бит_кзн_ЗаявкаНаРасходованиеСредств;
	Если ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(МетаданныеЗНРДС)
	   И ПравоДоступа("Просмотр", МетаданныеЗНРДС) Тогда
		   
	   НоваяСтрока = ТипыДокументов.Добавить();
	   НоваяСтрока.Пометка		 = Истина;
	   НоваяСтрока.Значение	     = "Документ.бит_кзн_ЗаявкаНаРасходованиеСредств";
	   НоваяСтрока.Представление = НСтр("ru = 'Прогноз платежа'; en = 'Prediction payment'");
	КонецЕсли;
		
	ТипыДокументов.СортироватьПоПредставлению();
	
КонецПроцедуры

Функция ПрименитьНастройки(НастройкаПодбораДокументов, ТипыДокументов, Обработка) Экспорт
	
	ШаблонНастроек = НовыеСохраняемыеНастройки();

	Если ЗначениеЗаполнено(НастройкаПодбораДокументов) Тогда
		
		РеквизитыНастройки 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаПодбораДокументов, "ХранилищеНастроек");
		СохраненныеНастройки = РеквизитыНастройки.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ШаблонНастроек, СохраненныеНастройки);
		КонецЕсли;  		
	КонецЕсли;
		
	ВыбранныеТипы = ШаблонНастроек.ВыбранныеТипы;
	Если ЗначениеЗаполнено(ВыбранныеТипы) Тогда
		ТипыДокументов.ЗаполнитьПометки(Ложь);
		Для каждого Элемент Из ВыбранныеТипы Цикл
			РезультатПоиска = ТипыДокументов.НайтиПоЗначению(Элемент);
			Если РезультатПоиска <> Неопределено Тогда
				РезультатПоиска.Пометка = Истина;				
			КонецЕсли;		
		КонецЦикла;
		ВыбранныеТипы = ВыбранныеТипы(ТипыДокументов);
	Иначе
		ВыбранныеТипы = ТипыДокументов.ВыгрузитьЗначения();	
	КонецЕсли;	
	
	АдресСКД = ИнициализироватьКомпоновщик(Обработка.КомпоновщикНастроек, 
						ВыбранныеТипы, ШаблонНастроек.НастройкиКомпоновкиДанных);
							
	Обработка.Период = Новый СтандартныйПериод(ШаблонНастроек.ВариантПериода);

	Возврат АдресСКД;
	
КонецФункции

Функция НовыеСохраняемыеНастройки() Экспорт 

	СохраняемыеНастройки = Новый Структура;
	СохраняемыеНастройки.Вставить("ВариантПериода", ВариантСтандартногоПериода.Сегодня);
	СохраняемыеНастройки.Вставить("НастройкиКомпоновкиДанных", Новый НастройкиКомпоновкиДанных);
	СохраняемыеНастройки.Вставить("ВыбранныеТипы", Новый Массив);
	
	Возврат СохраняемыеНастройки;

КонецФункции

Функция ЗаполнитьПереченьДокументов(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных) Экспорт
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,
							Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаПереченьПолный = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаПереченьПолный);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаПереченьПолный;
	
КонецФункции

Функция НовыеПараметрыСоздатьДокументы() Экспорт
	
	ПараметрыИсполнения = Новый Структура;
	ПараметрыИсполнения.Вставить("АдресРезультата", "");
	
	Возврат ПараметрыИсполнения;

КонецФункции

Процедура СоздатьДокументы(ТаблицаДокументов, Параметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТаблицаДокументов) Тогда
		Возврат;
	КонецЕсли;
	
	СписокДокументов = Новый Массив;
	
	Для каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
		Если НЕ СтрокаТаблицы.Пометка Тогда
			Продолжить;		
		КонецЕсли;
		
		ДокументПланирования = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ДокументПоДаннымЗаполнения(
									СтрокаТаблицы.Документ);
		СписокДокументов.Добавить(ДокументПланирования);
	КонецЦикла;
	
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		ПоместитьВоВременноеХранилище(СписокДокументов, Параметры.АдресРезультата);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьСхемуКомпоновки(СхемаКомпоновкиДанных, ВыбранныеТипы)
	
	// Поля, используемые для отборов, которые требуется удалить, 
	// если таких нет в метаданных.
	РеквизитыШапки = Новый Структура; 
	РеквизитыШапки.Вставить("Контрагент", Ложь);

	// Изменим текст запроса:
	ШаблонТекстаЗапроса = СхемаКомпоновкиДанных.НаборыДанных.Документы.Запрос; 
	ТекстЗапроса 		= ТекстЗапросаДокументы(ШаблонТекстаЗапроса, РеквизитыШапки, ВыбранныеТипы);	
	СхемаКомпоновкиДанных.НаборыДанных.Документы.Запрос = ТекстЗапроса;
	
	Если ВыбранныеТипы.Количество() <> 0 Тогда
		Индекс = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор.Элементы.Количество() - 1;
		Пока Индекс >= 0  Цикл
			ЭлементОтбора = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор.Элементы.Получить(Индекс);
			Ключ = Строка(СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор.Элементы.Получить(Индекс).ЛевоеЗначение);
			Если СтрНачинаетсяС(Ключ, "Документ.") Тогда
				Ключ = СтрЗаменить(Ключ, "Документ.","");
				Пометка = Ложь;
				Если РеквизитыШапки.Свойство(Ключ, Пометка) И Пометка = Ложь Тогда
					СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор.Элементы.Удалить(Индекс);				
				КонецЕсли; 
			КонецЕсли; 
			Индекс = Индекс - 1;
		КонецЦикла;  
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаДокументы(ШаблонТекстаЗапроса, РеквизитыШапки, ВыбранныеТипы)

	Если ВыбранныеТипы.Количество() = 0 Тогда
		Возврат ШаблонТекстаЗапроса;
	КонецЕсли; 
	
	// Описание полей, где: 
	// Значение, Представление, Пометка - это "Имя", "Синоним", "Выбор реквизитов".
	ФиксированныеПоля = Новый СписокЗначений;
	ФиксированныеПоля.Добавить("Ссылка",		  "Документ", Истина);
	ФиксированныеПоля.Добавить("Номер", 		  "Номер");
	ФиксированныеПоля.Добавить("Дата", 			  "Дата");
	ФиксированныеПоля.Добавить("Проведен", 		  "Проведен");
	ФиксированныеПоля.Добавить("ПометкаУдаления", "ПометкаУдаления");
	ФиксированныеПоля.Добавить("Организация", 	  "Организация", Истина);
	ФиксированныеПоля.Добавить("Контрагент", 	  "Контрагент", Истина);
	ФиксированныеПоля.Добавить("Валюта",		  "Валюта", Истина);
	ФиксированныеПоля.Добавить("СуммаДокумента",  "СуммаДокумента");
		
	СтрокаНеограниченнойДлинны = ОбщегоНазначения.ОписаниеТипаСтрока(0); 
	
	СхемаЗапроса					   = Новый СхемаЗапроса;
	СхемаЗапроса.РежимКомпоновкиДанных = Истина;
	
	Запрос = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Запрос.ВыбиратьРазрешенные = Истина;
	Запрос.ТаблицаДляПомещения = "ТабДокументы";
	
	Индекс = 0;
	Для Каждого ВыбранныйТип Из ВыбранныеТипы Цикл
				
		Если Индекс = 0 Тогда
			Оператор = Запрос.Операторы[0];
		Иначе	
			Оператор = Запрос.Операторы.Добавить();
			Оператор.ТипОбъединения = ТипОбъединенияСхемыЗапроса.ОбъединитьВсе;
		КонецЕсли; 		

		Источник = Оператор.Источники.Добавить(ВыбранныйТип);	
		Таблица  = Источник.Источник;
		Для Каждого ФиксированноеПоле Из ФиксированныеПоля Цикл
			ИндексКолонки = ФиксированныеПоля.Индекс(ФиксированноеПоле);
			
			ЗначениеПоля = ФиксированноеПоле.Значение;
			Если ЗначениеПоля = "Валюта" Тогда
				ВариантыИмен = Новый Массив;
				ВариантыИмен.Добавить("ВалютаДокумента");
				ВариантыИмен.Добавить("Валюта");
				Для каждого ВариантИмени Из ВариантыИмен Цикл
					ДоступноеПоле = Таблица.ДоступныеПоля.Найти(ВариантИмени);
					Если ДоступноеПоле <> Неопределено Тогда
						Прервать;					
					КонецЕсли;				
				КонецЦикла;
			Иначе	
				ДоступноеПоле = Таблица.ДоступныеПоля.Найти(ФиксированноеПоле.Значение);
			КонецЕсли;
			
			Если ДоступноеПоле <> Неопределено Тогда
				Если ДоступноеПоле.ТипЗначения = СтрокаНеограниченнойДлинны Тогда
					// Обрежем поля неограниченной длины.
					Выражение = СтрШаблон("ВЫРАЗИТЬ(%1 КАК Строка (210))", ДоступноеПоле.Имя);
					Оператор.ВыбираемыеПоля.Добавить(Выражение, ИндексКолонки);
				Иначе
					Оператор.ВыбираемыеПоля.Добавить(ДоступноеПоле, ИндексКолонки);
					
					ВыраженияОтбора = Оператор.ВыраженияОтбораКомпоновкиДанных;
					ВыражениеОтбора = ВыраженияОтбора.Добавить(ДоступноеПоле);
					ВыражениеОтбора.ИспользоватьРеквизиты = ФиксированноеПоле.Пометка;
					ВыражениеОтбора.Псевдоним			  = ФиксированноеПоле.Представление;
				КонецЕсли;
			Иначе	
				Оператор.ВыбираемыеПоля.Добавить("NULL", ИндексКолонки);
			КонецЕсли; 
			
			// Выявляем хотя бы одну таблицу с доступным реквизитом шапки.
			Ключ = ФиксированноеПоле.Значение;
			Если РеквизитыШапки.Свойство(Ключ) Тогда
				Если ДоступноеПоле = Неопределено Тогда
					РеквизитыШапки[Ключ] = Макс(Ложь, РеквизитыШапки[Ключ]);
				Иначе	
					РеквизитыШапки[Ключ] = Макс(Истина, РеквизитыШапки[Ключ]);
				КонецЕсли; 
			КонецЕсли; 

			Если Индекс = 0 Тогда
				Запрос.Колонки[ИндексКолонки].Псевдоним = ФиксированноеПоле.Представление;
			КонецЕсли;	
		КонецЦикла;
		
		Оператор.Отбор.Добавить("Дата Между &ДатаНачала И &ДатаОкончания");
		Оператор.Отбор.Добавить("НЕ ПометкаУдаления");
		Если ВыбранныйТип = "Документ.бит_кзн_ЗаявкаНаРасходованиеСредств" Тогда
			Оператор.Отбор.Добавить("ВидПлана = ЗНАЧЕНИЕ(Перечисление.бит_кзн_ВидыПланов.Прогноз)");		
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла; 
	// Заменим "эталонный запрос".
	ИсходнаяСхема						= Новый СхемаЗапроса;
	ИсходнаяСхема.РежимКомпоновкиДанных = Истина;
	ИсходнаяСхема.УстановитьТекстЗапроса(ШаблонТекстаЗапроса);
	ИсходнаяСхема.ПакетЗапросов[0].УстановитьТекстЗапроса(СхемаЗапроса.ПолучитьТекстЗапроса());
	
	ТекстЗапроса = ИсходнаяСхема.ПолучитьТекстЗапроса();
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли