#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Основание 			= ДанныеЗаполнения;

	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипДанныхЗаполнения <> Тип("Структура")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "Проведен")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Проведен") = Ложь 
		И НЕ ТипДанныхЗаполнения = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") Тогда
			ТекстСообщения = НСтр("ru='Необходимо провести документ перед созданием заявки.';
								|en='It is necessary to hold the document before creating the application.'");
			ВызватьИсключение ТекстСообщения;		
	КонецЕсли;
		
	// В отдельных случаях данные заполнения и документы формируются отдельно:
	// 1. На клиенте для открытия формы см. бит_КазначействоКлиент.СоздатьЗаявкуНаРасходованиеСредств().
	// 2. Если требуется получить записанный результат - позицию (заявку с позициями), тогда
	//	  Результат = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ДокументПоДаннымЗаполнения(Основание);	
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ОжидаемыеДанные = Новый Структура("ДокументПланирования, ДокументОснование");
		ЗаполнитьЗначенияСвойств(ОжидаемыеДанные, ДанныеЗаполнения);
		ДокументПланирования = ОжидаемыеДанные.ДокументПланирования;
		ДокументОснование 	 = ОжидаемыеДанные.ДокументОснование;
		
		Если ЗначениеЗаполнено(ДокументПланирования) 
		   И ТипЗнч(ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
			 ЗаполнитьНаОснованииЗаявкиНаРасходованиеСредств(ДокументПланирования);
		ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
			ТипДанныхЗаполнения = ТипЗнч(ДокументОснование);
			Основание 			= ДокументОснование;
		КонецЕсли;
		бит_ОбщегоНазначения.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
		ЛицевыеСчета = Неопределено;
		Если ДанныеЗаполнения.Свойство("ЛицевыеСчетаСотрудников", ЛицевыеСчета) И ЗначениеЗаполнено(ЛицевыеСчета) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ЛицевыеСчета, ЛицевыеСчетаСотрудников);	
		КонецЕсли;
	КонецЕсли;
		
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.АвансовыйОтчет") Тогда 
		ЗаполнитьНаОснованииАвансовогоОтчета(Основание);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда	
		ЗаполнитьНаОснованииЗаявкиНаВозвратТоваровОтКлиента(Основание);
	// ++ НЕ УТ
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВКассу")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыРаздатчиком")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ВедомостьПрочихДоходовВКассу")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением")
	// -- НЕ УТ
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ВозвратТоваровОтКлиента")
	// ++ НЕ УТ
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ВыкупПринятыхНаХранениеТоваров")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ДоговорЗаймаСотруднику")
	// -- НЕ УТ
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ОперацияПоЯндексКассе")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетКомиссионера")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетКомитентуОСписании")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациями")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациямиОСписании")
	// ++ НЕ УТ
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетПереработчика")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетПереработчика2_5")
	// -- НЕ УТ
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями")
	// ++ НЕ УТ
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ПоступлениеДенежныхДокументов")
	// -- НЕ УТ
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетОСписанииТоваровСХранения")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.СчетФактураНалоговыйАгент")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт")
	ИЛИ ТипДанныхЗаполнения = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция")
	ИЛИ ТипДанныхЗаполнения = Тип("СправочникСсылка.ДоговорыКонтрагентов")
	ИЛИ ТипДанныхЗаполнения = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
		ЗаполнитьПоОснованию(Основание);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
		ЗаполнитьНаОснованииПоступленияУслугИВнеоборотныхАктивов(Основание);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		ЗаполнитьНаОснованииОтчетаКомитенту(Основание);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ЗаполнитьНаОснованииЗаказаПоставщику(Основание)
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.бит_пз_ЗаявкаНаЗатраты") Тогда
		ЗаполнитьНаОснованииЗаявкиНаЗатраты(Основание);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.бит_пз_СводнаяЗаявкаНаЗатраты") Тогда
		ЗаполнитьНаОснованииСводнойЗаявкиНаЗатраты(Основание);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		ЗаполнитьНаОснованииПриобретенияТоваровУслуг(Основание);
	// ++ НЕ УТ
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПереработчику2_5") Тогда
		ЗаполнитьНаОснованииЗаказаПереработчику2_5(Основание);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПереработчику") Тогда
		ЗаполнитьНаОснованииЗаказаПереработчику(Основание);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ДоговорыАренды") Тогда
		ЗаполнитьНаОснованииДоговораАренды(Основание);		
	// -- НЕ УТ
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") Тогда
		ЗаполнитьНаОснованииЗаявкиНаПеремещения(Основание);
	КонецЕсли;
		
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
		
	Если ЗначениеЗаполнено(ОбъектКопирования.ДокументПланирования) Тогда
		Если ТипЗнч(ОбъектКопирования.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") Тогда		
			ТекстСообщения = НСтр("ru='В заявке на перемещение платежную позицию копировать запрещено.';
								|en='The proposal to move the position of the copy prohibited payment.'");
			ВызватьИсключение ТекстСообщения;			
		ИначеЕсли ТипЗнч(ОбъектКопирования.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию") Тогда		
			ТекстСообщения = НСтр("ru='В заявке на перевод средств платежную позицию копировать запрещено.';
								|en='In the application for the transfer of funds payment position copy prohibited.'");
			ВызватьИсключение ТекстСообщения;		
		КонецЕсли;  
	КонецЕсли;

	// Важно!!!
	// Флаг "СверхБюджета" копируется при добавлении позиции (копированием)
	// в форме "многострочной" заявки.
	// СверхБюджета = Ложь;

	Дата 					= ТекущаяДатаСеанса();
	ДатаПлан          		= Макс(Дата, ДатаПлан);
	ДатаПланКрайняя   		= ?(ЗначениеЗаполнено(ДатаПланКрайняя), Макс(Дата, ДатаПланКрайняя), ДатаПланКрайняя);
	СписатьЛимиты			= Ложь;
	ОтправленНаСогласование = Ложь;	
	Ответственный 			= Пользователи.ТекущийПользователь();
		
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		Если бит_Казначейство.ОперацияБезНДС(ХозяйственнаяОперация) Тогда
			СтавкаНДС = Неопределено;
			СуммаНДС  = 0;
		КонецЕсли;
	КонецЕсли;
	
	ДействовалФЗ = СписаниеБезналичныхДенежныхСредствЛокализация.ДействуетФедеральныйЗакон345ФЗ(ОбъектКопирования.Дата);
	ДействуетФЗ  = СписаниеБезналичныхДенежныхСредствЛокализация.ДействуетФедеральныйЗакон345ФЗ(ТекущаяДатаСеанса());
	Если ДействовалФЗ <> ДействуетФЗ Тогда
		Если ОбъектКопирования.ОчередностьПлатежа = 6 ИЛИ ОбъектКопирования.ОчередностьПлатежа = 0 Тогда
			ОчередностьПлатежа = 5;
		Иначе
			ОчередностьПлатежа = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Перем Ошибки;
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если ЗначениеЗаполнено(ДатаПлан) Тогда
		ПараметрыПроверки = бит_КазначействоКлиентСервер.НовыеПараметрыПериодЗаданКорректно();
		ПараметрыПроверки.ПоляОбъекта.ДатаНачала	= "Дата";
		ПараметрыПроверки.ПоляОбъекта.ДатаОкончания = "ДатаПлан";
		
		ПараметрыПроверки.ПоляФормы.ДатаНачала	  = НСтр("ru = 'Дата'; en = 'Date'");
		ПараметрыПроверки.ПоляФормы.ДатаОкончания = НСтр("ru = 'Дата платежа'; en = 'Payment Date'");
		
		ПериодЗаданКорректно = бит_КазначействоКлиентСервер.ПериодЗаданКорректно(ЭтотОбъект, ПараметрыПроверки);
		Если НЕ ПериодЗаданКорректно Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаПлан) И ЗначениеЗаполнено(ДатаПланКрайняя) Тогда
		ПараметрыПроверки = бит_КазначействоКлиентСервер.НовыеПараметрыПериодЗаданКорректно();
		ПараметрыПроверки.ПоляОбъекта.ДатаНачала	= "ДатаПлан";
		ПараметрыПроверки.ПоляОбъекта.ДатаОкончания = "ДатаПланКрайняя";
		
		ПараметрыПроверки.ПоляФормы.ДатаНачала	  = НСтр("ru = 'Дата платежа'; en = 'Payment Date'");
		ПараметрыПроверки.ПоляФормы.ДатаОкончания = НСтр("ru = 'Не позднее'; en = 'on or before'");
		
		ПериодЗаданКорректно = бит_КазначействоКлиентСервер.ПериодЗаданКорректно(ЭтотОбъект, ПараметрыПроверки);
		Если НЕ ПериодЗаданКорректно Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Планирование = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов И ВалютаДокумента <> ВалютаВзаиморасчетов Тогда
		ТекстУточнения = НСтр("ru = 'Валюта взаиморасчетов не соответствует валюте документа %1'");
		ТекстУточнения = СтрШаблон(ТекстУточнения, ВалютаДокумента);
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", "Корректность", 
							НСтр("ru = 'Валюта взаиморасчетов'; en = 'AR/AP currency'"),,, ТекстУточнения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВалютаВзаиморасчетов", ,Отказ);
	КонецЕсли;
	
	Если ХозяйственнаяОперация <>  Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоКредитам Тогда
		НепроверяемыеРеквизиты.Добавить("ТипСуммыКредитаДепозита");
	КонецЕсли;
	
	Если ХозяйственнаяОперация <> Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеВБюджет Тогда
		НепроверяемыеРеквизиты.Добавить("ТипНалога"); 		
	КонецЕсли; 
	
	Если ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Наличные Тогда 		
		НепроверяемыеРеквизиты.Добавить("ОчередностьПлатежа"); 		
	КонецЕсли;    			
	
	Если ТипЗнч(ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") Тогда 
	
		Если ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда 		
			НепроверяемыеРеквизиты.Добавить("Касса"); 			
		Иначе    			
			НепроверяемыеРеквизиты.Добавить("БанковскийСчет"); 		
		КонецЕсли; 
		
		НепроверяемыеРеквизиты.Добавить("ЦФО"); 
		НепроверяемыеРеквизиты.Добавить("СтавкаНДС");
		НепроверяемыеРеквизиты.Добавить("Сценарий");
	ИначеЕсли ТипЗнч(ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию") Тогда 
	
		Если ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда 		
			НепроверяемыеРеквизиты.Добавить("Касса"); 			
		Иначе    			
			НепроверяемыеРеквизиты.Добавить("БанковскийСчет"); 		
		КонецЕсли; 
		НепроверяемыеРеквизиты.Добавить("СтавкаНДС");
		НепроверяемыеРеквизиты.Добавить("Сценарий");
	Иначе
		
		Если ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Наличные Тогда
			НепроверяемыеРеквизиты.Добавить("БанковскийСчет");
		Иначе
			НепроверяемыеРеквизиты.Добавить("Касса"); 
			Если ЗначениеЗаполнено(Договор) Тогда
				НепроверяемыеРеквизиты.Добавить("БанковскийСчет");
			КонецЕсли;
		КонецЕсли;
		
		Если бит_Казначейство.ОперацияБезНДС(ХозяйственнаяОперация) Тогда
			НепроверяемыеРеквизиты.Добавить("СтавкаНДС");
		КонецЕсли;
		
		РезультатПоиска = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(ДокументПланирования);
		Если РезультатПоиска.КоличествоПозиций > 1 Тогда
			КоличествоПозиций = 0;
			РеквизитыОбъектов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(РезультатПоиска.МассивПозиций, "ПометкаУдаления");
			Для каждого КлючЗначение Из РеквизитыОбъектов Цикл
				Если КлючЗначение.Ключ = Ссылка Тогда
					КоличествоПозиций = КоличествоПозиций + 1;
				ИначеЕсли НЕ КлючЗначение.Значение.ПометкаУдаления Тогда 
					КоличествоПозиций = КоличествоПозиций + 1;
				КонецЕсли; 
			КонецЦикла; 
		Иначе
			КоличествоПозиций = 1;
		КонецЕсли; 
		Если КоличествоПозиций > 1 Тогда
			Пояснение = НСтр("ru = 'Не совпадает валютой документа планирования.'; 
							|en = 'The currency of the planning document does not match'");
			Если ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов Тогда
				Если ВалютаВзаиморасчетов <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПланирования, "ВалютаДокумента") Тогда						
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", 
										"Корректность", Нстр("ru = 'Валюта взаиморасчетов'; en = 'AR/AP currency'"),,,Пояснение);	
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВалютаВзаиморасчетов", ,Отказ);
				КонецЕсли;		
			КонецЕсли;
			Если ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
				Если ВалютаДокумента <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПланирования, "ВалютаДокумента") Тогда						
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", 
										"Корректность", Нстр("ru = 'Валюта'; en = 'Currency'"),,,Пояснение);	
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВалютаДокумента", ,Отказ);
				КонецЕсли;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СписокФизЛиц Тогда
		НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников");
		НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников.ФизическоеЛицо");
		НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников.ЛицевойСчет");
		НепроверяемыеРеквизиты.Добавить("ЛицевыеСчетаСотрудников.Сумма");
	КонецЕсли;

	Если НЕ ПеречислениеВБюджет Тогда
		НепроверяемыеРеквизиты.Добавить("КодБК"); 
		НепроверяемыеРеквизиты.Добавить("КодОКАТО");
		НепроверяемыеРеквизиты.Добавить("ПоказательОснования");
		НепроверяемыеРеквизиты.Добавить("ПоказательПериода");
		НепроверяемыеРеквизиты.Добавить("ПоказательНомера");
		НепроверяемыеРеквизиты.Добавить("ПоказательДаты");
		НепроверяемыеРеквизиты.Добавить("СтатусСоставителя");
	КонецЕсли; 
			
	//++ НЕ УТ
	Если ПлатежиПо275ФЗ Тогда
		
		Если ДоговорСУчастникомГОЗ И ЗначениеЗаполнено(БанковскийСчетПолучателя) Тогда
			ОтдельныйСчетГОЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчетПолучателя, "ОтдельныйСчетГОЗ");
			Если Не ОтдельныйСчетГОЗ Тогда
				ТекстСообщения = НСтр("ru='Должен быть выбран отдельный банковский счет ГОЗ';
						 |en='Separate SDO bank account must be selected'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "БанковскийСчетПолучателя",, Отказ);
			КонецЕсли;
		КонецЕсли;

		Если ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПрочаяВыдачаДенежныхСредств Тогда
			
			НепроверяемыеРеквизиты.Добавить("ПодтверждающиеДокументы.ВидДокумента");
			НепроверяемыеРеквизиты.Добавить("ПодтверждающиеДокументы.Файл");
			
		Иначе
			// См. ДенежныеСредстваСерверЛокализация.ОбработкаПроверкиЗаполненияПодтверждающиеДокументы().
			Документы.бит_кзн_ПлатежнаяПозиция.ОбработкаПроверкиЗаполненияПодтверждающиеДокументы(ЭтотОбъект,
				Отказ, ПроверяемыеРеквизиты, Ошибки);
		КонецЕсли;
				
		// См. ДенежныеСредстваСерверЛокализация.ПроверитьЗаполнениеРеквизитовПлатежаГОЗ().
		Документы.бит_кзн_ПлатежнаяПозиция.ПроверитьЗаполнениеРеквизитовПлатежаГОЗ(ЭтотОбъект, Отказ);
		
		РасшифровкаБезРазбиения = Истина;
		// См. ЗаявкаНаРасходованиеДенежныхСредствЛокализация.ПроверитьЗаполнениеДоговоровГОЗ().
		Документы.бит_кзн_ПлатежнаяПозиция.ПроверитьЗаполнениеДоговоровГОЗ(ЭтотОбъект, Отказ, РасшифровкаБезРазбиения);
		
		// См. ЗаявкаНаРасходованиеДенежныхСредствЛокализация.ПроверитьЗаполнениеТипаСуммыКредитаДепозита().
		Документы.бит_кзн_ПлатежнаяПозиция.ПроверитьЗаполнениеТипаСуммыКредитаДепозита(ЭтотОбъект, Отказ, РасшифровкаБезРазбиения);
	Иначе
	//-- НЕ УТ
		НепроверяемыеРеквизиты.Добавить("ПодтверждающиеДокументы");
		НепроверяемыеРеквизиты.Добавить("ДоговорСУчастникомГОЗ");
		НепроверяемыеРеквизиты.Добавить("ТипПлатежаФЗ275");
		НепроверяемыеРеквизиты.Добавить("ПредметОплаты");
		НепроверяемыеРеквизиты.Добавить("ВариантОплаты");
		НепроверяемыеРеквизиты.Добавить("ПодтверждающиеДокументы.ВидДокумента");
		НепроверяемыеРеквизиты.Добавить("ПодтверждающиеДокументы.Файл");
	//++ НЕ УТ
	КонецЕсли;


	ЭтоПередачаДенег = бит_КазначействоКлиентСервер.ЭтоОперацияПередачиДенег(ХозяйственнаяОперация);
	Если ЭтоПередачаДенег Тогда
		Если ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда 		
			НепроверяемыеРеквизиты.Добавить("КассаПолучатель"); 			
		Иначе    			
			НепроверяемыеРеквизиты.Добавить("БанковскийСчетПолучатель"); 		
		КонецЕсли; 
	Иначе
		НепроверяемыеРеквизиты.Добавить("ОрганизацияПолучатель");
		НепроверяемыеРеквизиты.Добавить("БанковскийСчетПолучатель");
		НепроверяемыеРеквизиты.Добавить("КассаПолучатель");
	КонецЕсли;

	ЭтоОперацияСПартнером = бит_КазначействоКлиентСервер.ЭтоОперацияСПартнером(ХозяйственнаяОперация);
	Если НЕ ЭтоОперацияСПартнером ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов") Тогда
		НепроверяемыеРеквизиты.Добавить("Партнер");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("УстановкаПометкиУдаления", ПометкаУдаления <> Ссылка.ПометкаУдаления);

	Если НЕ ДополнительныеСвойства.УстановкаПометкиУдаления И НЕ ДополнительныеСвойства.ЭтоНовый Тогда
		Если ПолучитьФункциональнуюОпцию("бит_ЗапретитьИзменениеЗаявкиВключеннойВРеестр") Тогда
			ЗаявкаВключенаВРеестр = РегистрыСведений.бит_РеестрыПлатежей.ПозицияВключенаВРеестр(Ссылка);
		Иначе
			ЗаявкаВключенаВРеестр = Ложь;
		КонецЕсли;

		Если ЗаявкаВключенаВРеестр Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось записать %1. Документ включен в реестр платежей.';
								|en = 'Failed to write to %1. The document is included in the payment register.'") ;
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ссылка);
			ВызватьИсключение ТекстСообщения;		
		КонецЕсли;	
	КонецЕсли;

	ИзмененаДатаПлатежа = Ложь;
	Если НЕ ЭтоНовый()
		И ПолучитьФункциональнуюОпцию("бит_ИспользоватьМеханизмОповещений") Тогда
		ПредыдущаяДатаРасхода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДатаПлан");
		ИзмененаДатаПлатежа   = ПредыдущаяДатаРасхода <> ДатаПлан;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ИзмененаДатаПлатежа", ИзмененаДатаПлатежа);
	
	Реквизиты = Новый Структура("Организация"); 
	ЗаполнитьЗначенияСвойств(Реквизиты, ЭтотОбъект);

	бит_Казначейство.ЗаполнитьДопАналитикуПоДаннымДокумента(ЭтотОбъект, Реквизиты);
	
	ОчиститьНеиспользуемыеРеквизиты();
	
	ПроверитьСоответствиеФизЛицаИВедомости(РежимЗаписи, Отказ);
	
	// ++ НЕ УТ
	//Настройка счетов учета
	НастройкаСчетовУчетаСервер.ПередЗаписью(ЭтотОбъект,
		Документы.бит_кзн_ПлатежнаяПозиция.ПараметрыНастройкиСчетовУчета(ХозяйственнаяОперация, ТипНалога));
	// -- НЕ УТ
	
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("Организация", Организация);
	ПараметрыНастройки.Вставить("ЦФО",		   ЦФО);
								
	ОтражатьСверхБюджета = НЕ бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету(
									ПараметрыНастройки, Дата);
									
	Если ОтражатьСверхБюджета ИЛИ НЕ СверхБюджета Тогда
		СписатьЛимиты = Ложь;	
	КонецЕсли;	

	Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ДатаПлан) Тогда
		ПредставлениеПоля = Метаданные().Реквизиты.ДатаПлан.Представление();
		ТекстСообщения	  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,ПредставлениеПоля);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДатаПлан", ,Отказ);
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОтправленНаСогласование = Ложь;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ДокументПланирования) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		// Если создание начинается с платежной позиции - при записи создаем заявку.
		НовыйДокумент = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(НовыйДокумент, ЭтотОбъект);
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.УстановитьНовыйНомер();
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда		
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда			
				НовыйДокумент.ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДокументПланирования");
			КонецЕсли;		
		КонецЕсли; 

		Результат = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(НовыйДокумент, РежимЗаписиДокумента.Запись, "", "Ошибки");
		
		Если Результат Тогда
			ДокументПланирования = НовыйДокумент.Ссылка;
		Иначе
			Отказ = Истина;
		КонецЕсли; 
		
		УстановитьПривилегированныйРежим(Ложь);		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат; 	
	КонецЕсли; 
	
	РежимЗаписи = ДополнительныеСвойства.РежимЗаписи;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	 ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьПравоПроведения(Отказ);
	КонецЕсли; 	
	
	Если Отказ Тогда	
		Возврат;  	
	КонецЕсли; 
	
	ВыполнитьСинхронизацию(РежимЗаписи);
	Документы.бит_кзн_ПлатежнаяПозиция.ЗаполнитьДанныеДокументовКазначейства(Ссылка);
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьПравоПроведения(Отказ);
	
	ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
	бит_Казначейство.ПроверитьВозможностьПроведения(Ссылка, ТекущийСтатус, Отказ);
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект, Ложь);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.бит_кзн_ПлатежнаяПозиция.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 
	
	АдресВХранилище = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
							ДополнительныеСвойства, "АдресДанныхДляКорректировки", "");
		
	ТаблицаИсполнениеБюджета = бит_КонтрольИсполненияБюджета.ПодготовитьТаблицуИсполнениеБюджета(
									ПараметрыПроведения.ИсполнениеБюджета,
									ПараметрыПроведения.ИсполнениеБюджетаРеквизиты,
									Отказ, АдресВХранилище);

	Реквизиты = ПараметрыПроведения.Реквизиты;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Реквизиты.Организация);
	Отбор.Вставить("ЦФО", 		  Реквизиты.ЦФО); 	
	
	КакКонтролироватьОстатки = бит_НастройкиПрограммы.КонтролироватьОстаткиПоПрогнозуПлатежа(Отбор, Реквизиты.Дата);
	Контролировать			 = КакКонтролироватьОстатки <> Перечисления.бит_ВидыКонтроля.НеКонтролировать;
	
	ПропуститьКонтрольПоПрогнозу = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, 
											"ПропуститьКонтрольПоПрогнозу", Ложь);
	
	Если НЕ ПропуститьКонтрольПоПрогнозу И Контролировать 
	   И ЗначениеЗаполнено(ПараметрыПроведения.ПланируемыйРасходСписание) Тогда
		РеквизитыПрогноза = ПараметрыПроведения.ПланируемыйРасходСписаниеРеквизиты[0];
		КонтрольОстатковПоПрогнозу(Реквизиты, РеквизитыПрогноза, КакКонтролироватьОстатки, Отказ);
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;  
	
	Документы.бит_кзн_ПлатежнаяПозиция.СформироватьПланируемыйРасходДенежныхСредств(
		ПараметрыПроведения.ПланируемыйРасходСписание, Движения, Отказ);
		
	Документы.бит_кзн_ПлатежнаяПозиция.СформироватьПланируемыйРасходДенежныхСредств(
		ПараметрыПроведения.ПланируемыйРасходПоступление, Движения, Отказ);	
		
	Документы.бит_кзн_ПлатежнаяПозиция.СформироватьПланируемыйРасходДенежныхСредствСАналитиками(
		ПараметрыПроведения.ПланируемыйРасходПоступлениеСАналитиками, Движения, Отказ);	
		
	Документы.бит_кзн_ПлатежнаяПозиция.СформироватьПланируемыйРасходДенежныхСредствСАналитиками(
		ПараметрыПроведения.ПланируемыйРасходСписаниеСАналитиками, Движения, Отказ);	
		
	бит_КонтрольИсполненияБюджета.СформироватьДвиженияКонтрольныеЗначенияБюджетов(
		ТаблицаИсполнениеБюджета, Движения);
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
		
    Если ЗначениеЗаполнено(ДокументОснование)
		И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
	
		ДокПрогноз = ДокументОснование.ПолучитьОбъект();
		бит_ВизированиеСервер.УстановитьСтатус(ДокПрогноз);
		
		ЗаявкаПрогноза = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДокументПланирования");
		Если ЗначениеЗаполнено(ЗаявкаПрогноза) Тогда
			ДокЗаявки      = ЗаявкаПрогноза.ПолучитьОбъект();
			бит_ВизированиеСервер.УстановитьСтатус(ДокЗаявки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства,
				"УстановитьСтатусДокументаПланированияПриПроведении", Ложь) Тогда
		ДокПланирования = ДокументПланирования.ПолучитьОбъект();
		Для каждого ДопСвойство Из ДополнительныеСвойства.ДополнительныеСвойстваДокументаПланирования Цикл
			Если ДопСвойство.Ключ = "НеУстанавливатьСтатусПриЗаписи" Тогда
				Продолжить;
			КонецЕсли;
			ДокПланирования.ДополнительныеСвойства.Вставить(ДопСвойство.Ключ, ДопСвойство.Значение);
		КонецЦикла;
		бит_ВизированиеСервер.бит_ПередЗаписьюДокументаДляУстановкиСтатуса(ДокПланирования,
																			Отказ,
																			РежимЗаписиДокумента.Проведение,
																			РежимПроведения);
		бит_ВизированиеСервер.бит_ПриЗаписиДляУстановкиСтатуса(ДокПланирования, Отказ);
		ДополнительныеСвойства.УстановитьСтатусДокументаПланированияПриПроведении = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроверитьПравоПроведения(Отказ);
	ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
	бит_Казначейство.ПроверитьВозможностьПроведения(Ссылка, ТекущийСтатус, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗаполнитьСценарий() Экспорт 

	Перем СценарийКандидат;
	
	Отборы = Новый Структура;
	Отборы.Вставить("ЦФО", ЦФО);
	Отборы.Вставить("Организация", Организация);
	
	Период = ?(ЗначениеЗаполнено(Дата), Дата, НачалоДня(ТекущаяДатаСеанса()));
	
	// Сценарий из настроек пользователя.
	СценарийКандидат = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
							ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойСценарий);
		
	Если НЕ ЗначениеЗаполнено(СценарийКандидат) Тогда
		КонтролироватьЗаявку = бит_НастройкиПрограммы.КонтролироватьЗаявкуПоБюджету(Отборы, Период);
		Если КонтролироватьЗаявку Тогда
			Если НЕ ЗначениеЗаполнено(СценарийКандидат) Тогда
				// Сценарий из настроек программы.
				СценарийКандидат = бит_НастройкиПрограммы.КазначействоСценарийКонтроляПоБюджету(Отборы, Период);
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
												
	Если НЕ ЗначениеЗаполнено(СценарийКандидат) И ЗначениеЗаполнено(Сценарий) Тогда
		СценарийКандидат = Сценарий;
	КонецЕсли;
								
	Возврат СценарийКандидат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьПоОснованию(Основание)

	ИсключаемыеСвойства = "Дата,Номер,Проведен,ПометкаУдаления,ДокументОснование,ДокументПланирования,ВидПлана,ОтправленНаСогласование";
	ЗначенияИсключаемыхСвойств = Новый Структура(ИсключаемыеСвойства);
	ЗаполнитьЗначенияСвойств(ЗначенияИсключаемыхСвойств, ЭтотОбъект);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
	// Восстановим незаполняемые реквизиты.
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияИсключаемыхСвойств);
	
	ДокументОснование = Основание;
	ТипОснования      = ТипЗнч(Основание);
	Если ТипОснования = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция")  Тогда
		Если ВидПлана = Перечисления.бит_кзн_ВидыПланов.Прогноз Тогда
			ДокументОснование = Неопределено;	
		КонецЕсли;
		СтрОплата = Документы.бит_кзн_ПлатежнаяПозиция.ПолучитьОстаток(Основание);
		СуммаДокумента = СтрОплата.Остаток;
	// ++ НЕ УТ
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк") Тогда
		ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
		Если НДФЛПоВедомостям Тогда
			ВидОперации    = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет;
			ТипНалога      = Справочники.ВидыНалоговВзносов.НДФЛ;
			СуммаДокумента = СуммаНДФЛОснования(Основание);
		Иначе
			ВидОперации    = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту;
			СуммаДокумента = Основание.СуммаПоДокументу;
		КонецЕсли;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(ВидОперации);
		Ведомость	  = Основание;
		КодВидаДохода = ИнтеграцияБЗК.ПолучитьКодВидаДохода(Основание.ВидДоходаИсполнительногоПроизводства);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением") Тогда
		ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
		Если НДФЛПоВедомостям Тогда
			ВидОперации    = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет;
			ТипНалога      = Справочники.ВидыНалоговВзносов.НДФЛ;
			СуммаДокумента = СуммаНДФЛОснования(Основание);
		Иначе
			ВидОперации    = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета;
			СуммаДокумента = Основание.СуммаПоДокументу;
		КонецЕсли;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(ВидОперации);
		Ведомость	          = Основание;	
		КодВидаДохода         = ИнтеграцияБЗК.ПолучитьКодВидаДохода(Основание.ВидДоходаИсполнительногоПроизводства);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВКассу") Тогда
		Касса = Основание.Касса;
		Если НДФЛПоВедомостям Тогда
			ФормаОплаты    = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
			ВидОперации    = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет;
			ТипНалога      = Справочники.ВидыНалоговВзносов.НДФЛ;
			СуммаДокумента = СуммаНДФЛОснования(Основание);
		Иначе
			ФормаОплаты    = Перечисления.бит_ВидыДенежныхСредств.Наличные;
			ВидОперации    = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу;
			СуммаДокумента = Основание.СуммаПоДокументу;
		КонецЕсли;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(ВидОперации);
		Ведомость	          = Основание;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыРаздатчиком") Тогда
		Если НДФЛПоВедомостям Тогда
			ФормаОплаты    = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
			ВидОперации    = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет;
			ТипНалога      = Справочники.ВидыНалоговВзносов.НДФЛ;
			СуммаДокумента = СуммаНДФЛОснования(Основание);
		Иначе
			ФормаОплаты    = Перечисления.бит_ВидыДенежныхСредств.Наличные;
			ВидОперации    = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыРаздатчиком;
			СуммаДокумента = Основание.СуммаПоДокументу;
		КонецЕсли;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(ВидОперации);
		ФизЛицо               = Основание.Раздатчик;
		Ведомость	          = Основание;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк") Тогда
		Если НДФЛПоВедомостям Тогда
			ФормаОплаты    = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
			ВидОперации    = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет;
			ТипНалога      = Справочники.ВидыНалоговВзносов.НДФЛ;
			СуммаДокумента = СуммаНДФЛОснования(Основание);
		Иначе
			ФормаОплаты    = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
			ВидОперации    = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту;
			СуммаДокумента = Основание.СуммаПоДокументу;
		КонецЕсли;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(ВидОперации);
		Ведомость	          = Основание;
		КодВидаДохода         = ИнтеграцияБЗК.ПолучитьКодВидаДохода(Основание.ВидДоходаИсполнительногоПроизводства);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВедомостьПрочихДоходовВКассу") Тогда
		Если НДФЛПоВедомостям Тогда
			ФормаОплаты    = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
			ВидОперации    = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет;
			ТипНалога      = Справочники.ВидыНалоговВзносов.НДФЛ;
			СуммаДокумента = СуммаНДФЛОснования(Основание);
		Иначе
			ФормаОплаты    = Перечисления.бит_ВидыДенежныхСредств.Наличные;
			ВидОперации    = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу;
			СуммаДокумента = Основание.СуммаПоДокументу;
		КонецЕсли;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(ВидОперации);
		Ведомость	          = Основание;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
		Если НДФЛПоВедомостям Тогда
			ФормаОплаты    = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
			ВидОперации    = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет;
			ТипНалога      = Справочники.ВидыНалоговВзносов.НДФЛ;
			СуммаДокумента = СуммаНДФЛОснования(Основание);
		Иначе
			ФормаОплаты    = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
			ВидОперации    = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета;
			СуммаДокумента = Основание.СуммаПоДокументу;
		КонецЕсли;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(ВидОперации);
		Ведомость	          = Основание;
		КодВидаДохода         = ИнтеграцияБЗК.ПолучитьКодВидаДохода(Основание.ВидДоходаИсполнительногоПроизводства);
	// -- НЕ УТ
	ИначеЕсли ТипОснования = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ФормаОплаты           = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(
									Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
		ПорядокРасчетов       = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ПорядокРасчетов");
		Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
			ОбъектРасчетов = Документы.бит_кзн_ПлатежнаяПозиция.ОбъектРасчетовПоИсточнику(Основание);
		Иначе
			Договор = Основание;
		КонецЕсли;
		БанковскийСчетПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "БанковскийСчетКонтрагента");
	ИначеЕсли ТипОснования = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов")	Тогда
		ФормаОплаты				= Перечисления.бит_ВидыДенежныхСредств.Безналичные;
		ХозяйственнаяОперация	= бит_Казначейство.ХозяйственнаяОперацияБФ(
									Перечисления.ХозяйственныеОперации.ОплатаПоКредитам);
		ОбъектРасчетов			= Документы.бит_кзн_ПлатежнаяПозиция.ОбъектРасчетовПоИсточнику(Основание);
		ДоговорКредитаДепозита	= Основание;
		БанковскийСчетПолучателя= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "БанковскийСчетКонтрагента");
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВозвратТоваровОтКлиента")
		ИЛИ ТипОснования = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		ФормаОплаты           = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(
									Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
		ОбъектРасчетов        = Документы.бит_кзн_ПлатежнаяПозиция.ОбъектРасчетовПоИсточнику(Основание);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтчетКомитентуОСписании") Тогда
		ФормаОплаты           = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(
									Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
		ОбъектРасчетов        = Документы.бит_кзн_ПлатежнаяПозиция.ОбъектРасчетовПоИсточнику(Основание);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		ФормаОплаты           = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(
									Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику);
		ОбъектРасчетов        = Документы.бит_кзн_ПлатежнаяПозиция.ОбъектРасчетовПоИсточнику(Основание);
		
		СуммаДокумента = Основание.СуммаИзрасходовано;
		ФизЛицо = Основание.ПодотчетноеЛицо;
		ВалютаДокумента = Основание.Валюта;
		
		Если Основание.Мультивалютный Тогда
			ТекстСообщения = НСтр("ru = 'Ввод на основании мультивалютного документа не поддерживается.'"); 
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ДоговорЗаймаСотруднику") Тогда
		ФормаОплаты				= Перечисления.бит_ВидыДенежныхСредств.Безналичные;
		ВидОперации				= Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику;
		ХозяйственнаяОперация	= бит_Казначейство.ХозяйственнаяОперацияБФ(
									Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику);
		ОбъектРасчетов			= Документы.бит_кзн_ПлатежнаяПозиция.ОбъектРасчетовПоИсточнику(Основание);
		ДоговорЗаймаСотруднику	= Основание;
		
		СуммаДокумента = Основание.Сумма;
		ФизЛицо = Основание.ФизическоеЛицо;
	// ++ НЕ УТ
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтчетПереработчика") 
		  ИЛИ ТипОснования = Тип("ДокументСсылка.ОтчетПереработчика2_5") Тогда
		ФормаОплаты           = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
		ХозяйственнаяОперация = бит_Казначейство.ХозяйственнаяОперацияБФ(
									Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
		ОбъектРасчетов        = Документы.бит_кзн_ПлатежнаяПозиция.ОбъектРасчетовПоИсточнику(Основание);
		
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация, Контрагент, Договор, СуммаДокумента");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыОснования);
	// -- НЕ УТ
	КонецЕсли;
	
	ЗначениеСтавки = бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(СтавкаНДС);
	СуммаНДС       = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(СуммаДокумента,Истина,
																			Истина,ЗначениеСтавки);

КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаявкиНаРасходованиеСредств(ДанныеЗаполнения)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеСредств.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ЗаявкаНаРасходованиеСредств.ФормаОплаты КАК ФормаОплаты,
	|	ЗаявкаНаРасходованиеСредств.Организация КАК Организация,
	|	ЗаявкаНаРасходованиеСредств.Контрагент КАК Контрагент,
	|	ЗаявкаНаРасходованиеСредств.Сценарий КАК Сценарий,
	|	ЗаявкаНаРасходованиеСредств.СверхБюджета КАК СверхБюджета,
	|	ЗаявкаНаРасходованиеСредств.СписатьЛимиты КАК СписатьЛимиты,
	|	ЗаявкаНаРасходованиеСредств.ДокументОснование КАК ДокументОснование,
	|	ЗаявкаНаРасходованиеСредств.ВидПлана КАК ВидПлана,
	|	ЗаявкаНаРасходованиеСредств.Важность КАК Важность,
	|	ЗаявкаНаРасходованиеСредств.Ссылка КАК ДокументПланирования,
	|	ЗаявкаНаРасходованиеСредств.Инициатор КАК Инициатор,
	|	ЗаявкаНаРасходованиеСредств.НазначениеПлатежаУпр КАК НазначениеПлатежаУпр,
	|	ЗаявкаНаРасходованиеСредств.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ЗаявкаНаРасходованиеСредств.ФизЛицо КАК ФизЛицо,
	|	ЗаявкаНаРасходованиеСредств.ПлатежиПо275ФЗ КАК ПлатежиПо275ФЗ,
	|	ЗаявкаНаРасходованиеСредств.ДоговорСЗаказчиком КАК ДоговорСЗаказчиком,
	|	ЗаявкаНаРасходованиеСредств.ПредметОплаты КАК ПредметОплаты,
	|	ЗаявкаНаРасходованиеСредств.ПунктКонтрактаПредмета КАК ПунктКонтрактаПредмета,
	|	ЗаявкаНаРасходованиеСредств.ПунктКонтрактаОплаты КАК ПунктКонтрактаОплаты,
	|	ЗаявкаНаРасходованиеСредств.ВариантОплаты КАК ВариантОплаты,
	|	ЗаявкаНаРасходованиеСредств.ТипПлатежаФЗ275 КАК ТипПлатежаФЗ275,
	|	ЗаявкаНаРасходованиеСредств.ДоговорСУчастникомГОЗ КАК ДоговорСУчастникомГОЗ,
	|	ЗаявкаНаРасходованиеСредств.ПодтверждающиеДокументы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ВидДокумента КАК ВидДокумента,
	|		Номер КАК Номер,
	|		Дата КАК Дата,
	|		Сумма КАК Сумма,
	|		Файл КАК Файл
	|	) КАК ПодтверждающиеДокументы,
	|	ЗаявкаНаРасходованиеСредств.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.бит_кзн_ЗаявкаНаРасходованиеСредств КАК ЗаявкаНаРасходованиеСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеСредств.Ссылка = &Ссылка";
	
	РезультатЗапроса 	   = Запрос.Выполнить();
	ВыборкаРеквизиты = РезультатЗапроса.Выбрать();
	ВыборкаРеквизиты.Следующий();
	
	Если ВыборкаРеквизиты.ПометкаУдаления Тогда
		ТекстСообщения = НСтр("ru = 'Выполнить не могу. По причине: Заявка помеченна на удаление.';
								|en = 'I can''t do it. For the reason: The application is marked for deletion.'");
		ВызватьИсключение ТекстСообщения;	
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаРеквизиты);
	Если ЗначениеЗаполнено(ВыборкаРеквизиты.ПодтверждающиеДокументы) Тогда
		ПодтверждающиеДокументы.Загрузить(ВыборкаРеквизиты.ПодтверждающиеДокументы.Выгрузить());
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииОтчетаКомитенту(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.бит_кзн_ВидыПланов.План) КАК ВидПлана,
	|	Реквизиты.Ссылка КАК ДокументОснование,
	|	Реквизиты.Контрагент КАК Контрагент,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.СуммаДокумента КАК СуммаДокумента,
	|	Реквизиты.Валюта КАК ВалютаДокумента,
	|	Реквизиты.ДатаПлатежа КАК ДатаПлатежа
	|ИЗ
	|	Документ.ОтчетКомитенту КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДанныеЗаполнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ТЧДокумента.СуммаНДС) КАК СуммаНДС,
	|	МАКСИМУМ(ТЧДокумента.СтавкаНДС) КАК СтавкаНДС
	|ИЗ
	|	Документ.ОтчетКомитенту.Товары КАК ТЧДокумента
	|ГДЕ
	|	ТЧДокумента.Ссылка = &ДанныеЗаполнения";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаРеквизиты = РезультатЗапроса[0].Выбрать();
	ВыборкаРеквизиты.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаРеквизиты);
	
	ВыборкаНДС = РезультатЗапроса[1].Выбрать();
	Если ВыборкаНДС.Следующий() Тогда
		СуммаНДС = ВыборкаНДС.СуммаНДС; 
		СтавкаНДС = ВыборкаНДС.СтавкаНДС;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаказаПоставщику(ДанныеЗаполнения)

	// См. Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПараметрыФормыВводНаОсновании();

КонецПроцедуры

Процедура ЗаполнитьНаОснованииДоговораАренды(ДанныеЗаполнения)
	// ++ НЕ УТ 
	// См. Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПараметрыФормыВводНаОсновании();
	// -- НЕ УТ 
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПоступленияУслугИВнеоборотныхАктивов(ДанныеЗаполнения)
	
	// См. Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПараметрыФормыВводНаОсновании();

КонецПроцедуры

Процедура ЗаполнитьНаОснованииАвансовогоОтчета(ДанныеЗаполнения)

	// См. Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПараметрыФормыВводНаОсновании();

КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаявкиНаВозвратТоваровОтКлиента(ДанныеЗаполнения)

	// См. Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПараметрыФормыВводНаОсновании();

КонецПроцедуры

Процедура ЗаполнитьНаОснованииПриобретенияТоваровУслуг(ДанныеЗаполнения)

	// См. Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПараметрыФормыВводНаОсновании();

КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаказаПереработчику2_5(ДанныеЗаполнения)
	
	// ++ НЕ УТ 
	// См. Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПараметрыФормыВводНаОсновании();
	// -- НЕ УТ 
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаказаПереработчику(ДанныеЗаполнения)
	
	// ++ НЕ УТ 
	// См. Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПараметрыФормыВводНаОсновании();
	// -- НЕ УТ 
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаявкиНаЗатраты(ДанныеЗаполнения)
	
	Исключения = "Дата,Номер,Проведен,ПометкаУдаления,Важность";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,Исключения);
	
	Дата                = ТекущаяДатаСеанса();
	ДокументОснование 	= ДанныеЗаполнения;
	ДатаПлан 			= ДанныеЗаполнения.ЖелаемаяДатаПоступления;
	
	Если ДокументОснование.ВидОперации = Перечисления.бит_пз_ВидыОперацийЗаявокНаЗатраты.Товары Тогда
		СуммаДокумента  = ДанныеЗаполнения.Товары.Итог("Сумма");
		СуммаНДС 		= ДанныеЗаполнения.Товары.Итог("СуммаНДС");
		СтавкаНДС 		= ДанныеЗаполнения.Товары[0].СтавкаНДС;
	Иначе	
		СуммаДокумента  = ДанныеЗаполнения.Сумма;
		СуммаНДС 		= ДанныеЗаполнения.СуммаНДС;
		СтавкаНДС 		= ДанныеЗаполнения.СтавкаНДС;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииСводнойЗаявкиНаЗатраты(ДанныеЗаполнения)
	
	Исключения = "Дата,Номер,Проведен,ПометкаУдаления,Важность";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,Исключения);
	
	Дата                 = ТекущаяДатаСеанса();
	ДокументОснование    = ДанныеЗаполнения;
	
	ДатаПлан		= ДанныеЗаполнения.ЖелаемаяДатаПоступления;
	СуммаДокумента  = ДанныеЗаполнения.ЗаявкиНаЗатраты.Итог("Сумма");
	СуммаНДС 		= ДанныеЗаполнения.ЗаявкиНаЗатраты.Итог("СуммаНДС");
	СтавкаНДС 		= ДанныеЗаполнения.ЗаявкиНаЗатраты[0].СтавкаНДС;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаявкиНаПеремещения(ДанныеЗаполнения) 
	
	Результат = Документы.бит_кзн_ПлатежнаяПозиция.ДанныеЗаполненияИзОснования(ДанныеЗаполнения);
	Если ЗначениеЗаполнено(Результат) Тогда
		бит_ОбщегоНазначения.ЗаполнитьПоСтруктуре(ЭтотОбъект, Результат[0]); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения)

	Перем Соглашение;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ТекущаяДатаПлан = ДатаПлан;
	
	Если НЕ ЗначениеЗаполнено(ДатаПлан) Тогда
		ДатаПлан = Макс(Дата, ТекущаяДатаСеанса());
	Иначе
		ДатаПлан = Макс(ДатаПлан, ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидПлана) Тогда
		ВидПлана = Перечисления.бит_кзн_ВидыПланов.План;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФормаОплаты) Тогда
		ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
	КонецЕсли;
	
	ПараметрыВидимости = бит_Казначейство.ПодготовитьПараметрыВидимости(ХозяйственнаяОперация);
	
	Если ЗначениеЗаполнено(ХозяйственнаяОперация) 
	   И ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствПодотчетнику
	   И ЗначениеЗаполнено(ФизЛицо)
	   И НЕ ЗначениеЗаполнено(Подразделение) Тогда
		
		Подразделение = ФизическиеЛицаУТ.ПодразделениеФизическогоЛица(ФизЛицо);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
		Сценарий = ЗаполнитьСценарий();
	КонецЕсли;
				
	Если ЗначениеЗаполнено(ХозяйственнаяОперация) И НЕ ЗначениеЗаполнено(Ведомость) Тогда
		ВидХозяйственнойОперации = бит_Казначейство.ХозяйственнаяОперацияУП(ХозяйственнаяОперация);
		КонтрагентЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ЮрФизЛицо");
		бит_КазначействоКлиентСервер.КодВидаДоходаПоУмолчанию(ЭтотОбъект, ВидХозяйственнойОперации, КонтрагентЮрФизЛицо);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ХозяйственнаяОперация) И ЗначениеЗаполнено(Контрагент) И НЕ ЗначениеЗаполнено(Партнер) Тогда
		
		ЭтоОперацияСПартнером = бит_КазначействоКлиентСервер.ЭтоОперацияСПартнером(ХозяйственнаяОперация);
		Если ЭтоОперацияСПартнером И ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов") Тогда			
			ХозОперацияУП = бит_КазначействоКлиентСервер.ХозяйственнаяОперацияУП(ХозяйственнаяОперация);
			Партнер 	  = ДенежныеСредстваСервер.ПолучитьПартнераПоКонтрагенту(Контрагент, ХозОперацияУП);
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОчередностьПлатежа) Тогда
		Если СписаниеБезналичныхДенежныхСредствЛокализация.ДействуетФедеральныйЗакон345ФЗ(Дата) Тогда
			ОчередностьПлатежа = 5;
		Иначе
			ОчередностьПлатежа = 6;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		СверхБюджета  = Ложь;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Инициатор = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
					ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойИнициаторКазначейства);
	
	Если НЕ ЗначениеЗаполнено(Инициатор) Тогда
		Инициатор = Ответственный;
	КонецЕсли;

	РеквизитыДоговора = Новый Структура;
	РеквизитыДоговора.Вставить("БанковскийСчет");
	РеквизитыДоговора.Вставить("БанковскийСчетКонтрагента");
	РеквизитыДоговора.Вставить("бит_ЦФО");
	РеквизитыДоговора.Вставить("бит_ОсновнаяСтатьяОборотов");
	
	Если ЗначениеЗаполнено(Договор) Тогда
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, Новый ФиксированнаяСтруктура(РеквизитыДоговора));	
	КонецЕсли;                                                                                
	
	Если ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
		Если НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда
			Если ЗначениеЗаполнено(Договор) Тогда
				БанковскийСчет = РеквизитыДоговора.БанковскийСчет;
			Иначе	
				БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(
									Организация, ВалютаДокумента);
			КонецЕсли;
		КонецЕсли;	

		Если ЗначениеЗаполнено(БанковскийСчет) Тогда
			РеквизитыБанковскогоСчета = Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(БанковскийСчет);
			Если Организация <> РеквизитыБанковскогоСчета.Организация Тогда
				БанковскийСчет = Неопределено;
			Иначе
				Организация 	= РеквизитыБанковскогоСчета.Организация;
				Если ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
					ВалютаДокумента = РеквизитыБанковскогоСчета.Валюта;				
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(БанковскийСчетПолучателя) Тогда
			БанковскийСчетПолучателя = РеквизитыДоговора.БанковскийСчетКонтрагента;		
		КонецЕсли;
	Иначе	
		Если НЕ ЗначениеЗаполнено(Касса) Тогда
			Касса = Справочники.Кассы.ПолучитьКассуПоУмолчанию(Организация, ВалютаДокумента);
		КонецЕсли;
		Если ЗначениеЗаполнено(Касса) Тогда
			РеквизитыКассы = Справочники.Кассы.ПолучитьРеквизитыКассы(Касса);
			Если Организация <> РеквизитыКассы.Организация Тогда
				Касса = Неопределено;
			Иначе
				Организация 	= РеквизитыКассы.Организация;
				Если ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
					ВалютаДокумента = РеквизитыКассы.Валюта;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	КонецЕсли;
	
	СтатьяПроверена = Ложь;
	Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
		ПроверитьИПодобратьСтатьюПриСоздании(); 
		СтатьяПроверена = Истина;
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(Договор) 
		И (НЕ ЗначениеЗаполнено(ЦФО) ИЛИ НЕ ЗначениеЗаполнено(СтатьяОборотов)) Тогда		
		Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
			ЦФО = РеквизитыДоговора.бит_ЦФО;	
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтатьяОборотов) Тогда
			СтатьяОборотов = РеквизитыДоговора.бит_ОсновнаяСтатьяОборотов;	
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЦФО) ИЛИ НЕ ЗначениеЗаполнено(СтатьяОборотов) Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			Соглашение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Соглашение", Неопределено);
		КонецЕсли;                                                 
		
		РеквизитыСоглашения = Новый Структура;
		РеквизитыСоглашения.Вставить("бит_ЦФО");
		РеквизитыСоглашения.Вставить("бит_ОсновнаяСтатьяОборотов");		
		Если ЗначениеЗаполнено(Соглашение) Тогда
			РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение, 
									Новый ФиксированнаяСтруктура(РеквизитыСоглашения));				
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
			ЦФО = РеквизитыСоглашения.бит_ЦФО;	
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СтатьяОборотов) Тогда
			СтатьяОборотов = РеквизитыСоглашения.бит_ОсновнаяСтатьяОборотов;	
		КонецЕсли;								
	КонецЕсли;                                                             

	Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
		РезультатПодбора = Новый Массив;
		Если ЗначениеЗаполнено(Подразделение) Тогда
			РезультатПодбора = бит_Бюджетирование.СвязанныеЦФОИПодразделения(Подразделение, 
									ТекущаяДатаСеанса());
		ИначеЕсли ЗначениеЗаполнено(Организация) Тогда
			РезультатПодбора = бит_Бюджетирование.СвязанныеЦФОИПодразделения(Организация, 
									ТекущаяДатаСеанса());
		КонецЕсли;
		Если ЗначениеЗаполнено(РезультатПодбора) Тогда
			ЦФО = РезультатПодбора[0];
		КонецЕсли;								
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
		ЦФО = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
				ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойЦФО);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтатьяОборотов) Тогда
		СтатьяОборотов = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
							ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнаяСтатьяРасходованиеБДДС);		
	КонецЕсли; 

	Если НЕ СтатьяПроверена Тогда
		ПроверитьИПодобратьСтатьюПриСоздании();
		СтатьяПроверена = Истина;
	КонецЕсли;             
	
	Если ПараметрыВидимости.ЕстьОбъектРасчетов И ЗначениеЗаполнено(Договор) И НЕ ЗначениеЗаполнено(ОбъектРасчетов) Тогда
		ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(Договор, Организация);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
		ВалютаВзаиморасчетов = ВалютаДокумента;
		КурсЗнаменательВзаиморасчетов = 1;
		КурсЗнаменательВзаиморасчетов = 1;
		СуммаВзаиморасчетов			  = СуммаДокумента;
	КонецЕсли;
	
	ОперацияБезНДС = бит_КазначействоКлиентСервер.ОперацияБезНДС(ХозяйственнаяОперация);
	
	Если ОперацияБезНДС Тогда
		СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		СуммаНДС  = 0;
	Иначе	
		Если НЕ ЗначениеЗаполнено(СтавкаНДС) И ЗначениеЗаполнено(СтатьяОборотов) Тогда
			СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяОборотов, "СтавкаНДС");	
			Если ЗначениеЗаполнено(СтавкаНДС) И СуммаДокумента <> 0 Тогда
				ЗначениеСтавки = бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(СтавкаНДС);
				СуммаНДС       = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(СуммаДокумента, Истина,
									Истина, ЗначениеСтавки);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПланированиеСуммы) Тогда
		ВалютаДенежныхСредств = ВалютаДокумента;
		Если ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Наличные И ЗначениеЗаполнено(Касса) Тогда
			ВалютаДенежныхСредств = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Касса, "ВалютаДенежныхСредств");	
		ИначеЕсли ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные И ЗначениеЗаполнено(БанковскийСчет) Тогда 	
			ВалютаДенежныхСредств = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчет, "ВалютаДенежныхСредств");	
		КонецЕсли;
		
		Если ВалютаДокумента = ВалютаДенежныхСредств Тогда
			ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа;	
		Иначе
			ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов;	
		КонецЕсли;		
	КонецЕсли;
	
	Если ДатаПлан <> ТекущаяДатаПлан ИЛИ ВалютаДокумента <> ВалютаВзаиморасчетов Тогда
		ЗаполнитьКурсВзаиморасчетов(ДатаПлан);
		РассчитатьСуммуВзаиморасчетов();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументПланирования) Тогда
		// Заполним пустой ссылкой на "Заявку". Это нужно для корректного контроля прикрепелнных файлов.
		ДокументПланирования = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПустаяСсылка();
	КонецЕсли;
	
	Если ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствПодотчетнику
		И ЗначениеЗаполнено(БанковскийСчет)
		И НЕ ЗначениеЗаполнено(НомерДоговораСБанком) Тогда
		Документы.бит_кзн_ПлатежнаяПозиция.ЗаполнитьДанныеОбменаСБанком(ЭтотОбъект);
	КонецЕсли;
	
	// Заполнение реквизитов "Аналитика_n".
	ПараметрыУстановки = бит_МеханизмДопИзмеренийКлиентСервер.ПараметрыУстановкиСвойствАналитикПоШаблону("", 
							"Аналитика_", "СтатьяОборотов");		
	ПараметрыУстановки.ДопРеквизиты.Вставить("Организация", Организация);
	
	РеквизитыОбъекта = Документы.бит_кзн_ПлатежнаяПозиция.РеквизитыОбъектаДляПодстановкиВАналитики(ЭтотОбъект);
	
	Для каждого Значение Из РеквизитыОбъекта Цикл 
		Если ЗначениеЗаполнено(Значение) Тогда
			бит_МеханизмДопИзмерений.ЗаполнитьДопАналитикуПоДаннымДокумента(ЭтотОбъект, Значение, ПараметрыУстановки);	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры	

Функция СуммаНДФЛОснования(Основание)
	
	// ++ НЕ УТ
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СУММА(НДФЛВедомости.Сумма) КАК СуммаНДФЛ
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк.НДФЛ КАК НДФЛВедомости
	|ГДЕ
	|	НДФЛВедомости.Ссылка = &Ссылка";
	
	ИмяДокументаОснования = Основание.Метаданные().Имя;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВедомостьНаВыплатуЗарплатыВБанк", ИмяДокументаОснования);
	Запрос.Текст = ТекстЗапроса;
	Запрос.	УстановитьПараметр("Ссылка", Основание);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаНДФЛ;
	КонецЕсли;
	// -- НЕ УТ
	
	Возврат 0;
	
КонецФункции

Процедура ЗаполнитьКурсВзаиморасчетов(ДатаЗаполнения)

	// См. форму документа.
	
	ПараметрыЗаполнения = ДенежныеСредстваСервер.ПараметрыЗаполненияКурсаИКратности();

	ПараметрыЗаполнения.Валюта 				 		   = ВалютаДокумента;
	ПараметрыЗаполнения.ВалютаВзаиморасчетов 		   = ВалютаВзаиморасчетов;
	ПараметрыЗаполнения.ОбъектРасчетов		 		   = ОбъектРасчетов;
	ПараметрыЗаполнения.ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ПараметрыЗаполнения.Дата						   = ДатаЗаполнения;
	
	Если НЕ ЗначениеЗаполнено(ОбъектРасчетов) Тогда
		ПараметрыЗаполнения.Договор = Договор;
	КонецЕсли;	
	
	Данные = Новый Структура;
	Данные.Вставить("КурсЧислительВзаиморасчетов",  0);
	Данные.Вставить("КурсЗнаменательВзаиморасчетов",0);
	Данные.Вставить("ВариантКурсаДоговора", 		Перечисления.ВариантыКурсаДоговора.ПустаяСсылка());
	Данные.Вставить("ТипОбъектаРасчетов", 			Перечисления.ТипыОбъектовРасчетов.ПустаяСсылка());
	
	ЗаполнитьЗначенияСвойств(Данные, ЭтотОбъект);
	
	ДенежныеСредстваСервер.ЗаполнитьКурсИКратностьВСтрокеРасшифровки(Данные, ПараметрыЗаполнения);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Данные);
	
КонецПроцедуры

Процедура РассчитатьСуммуВзаиморасчетов()
	
	Данные = Новый Структура;
	Данные.Вставить("Сумма", 						 СуммаДокумента);
	Данные.Вставить("КурсЧислительВзаиморасчетов",	 КурсЧислительВзаиморасчетов);
	Данные.Вставить("КурсЗнаменательВзаиморасчетов", КурсЗнаменательВзаиморасчетов);
	Данные.Вставить("СуммаВзаиморасчетов",			 СуммаВзаиморасчетов);
	
	ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
			Данные, ВалютаДокумента, Константы.ВалютаРегламентированногоУчета.Получить());
			
	СуммаВзаиморасчетов = Данные.СуммаВзаиморасчетов; 		
		
КонецПроцедуры

#КонецОбласти

//  Процедура выполняет синхронизацию позиции и заявки на расходование,
//  если позиция одна. 
//
Процедура ВыполнитьСинхронизацию(РежимЗаписи)

	НеСинхронизировать = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "НеСинхронизировать", Ложь);
	
	Если НеСинхронизировать Тогда
		Возврат;
	КонецЕсли; 
	
    РезультатПоиска = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(ДокументПланирования, Ложь);
	// Теперь платежные позиции не удаляются непосредственно. Поэтому возникла необходимость
	// анализировать состав и реквизиты свящанных с заявкой документов.
	// Синхронизация выполняется у единственного документа или у последнего непомеченного на удаление,
	// или последнего помечаемого на удаление.
	Если РезультатПоиска.КоличествоПозиций > 1 Тогда
		КоличествоПозиций = 0;
		РеквизитыОбъектов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(РезультатПоиска.МассивПозиций, "ПометкаУдаления");
		Для каждого КлючЗначение Из РеквизитыОбъектов Цикл
			Если КлючЗначение.Ключ = Ссылка Тогда
				КоличествоПозиций = КоличествоПозиций + 1;
			ИначеЕсли НЕ КлючЗначение.Значение.ПометкаУдаления Тогда 
				КоличествоПозиций = КоличествоПозиций + 1;
			КонецЕсли; 
		КонецЦикла; 
	Иначе
		КоличествоПозиций = 1;
	КонецЕсли; 
	
	Если КоличествоПозиций = 1
		И ТипЗнч(ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		
		ИменаСинхр = Документы.бит_кзн_ПлатежнаяПозиция.СинхронизируемыеРеквизиты();
		
		ЗаявкаОбъект = ДокументПланирования.ПолучитьОбъект();
		
		// Признак того, что дальнейшая синхронизация не нужна, необходимо, чтобы не было циклических синхронизаций.
		ЗаявкаОбъект.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
		
		// Синхронизация пометки удаления.
		Если ПометкаУдаления <> ЗаявкаОбъект.ПометкаУдаления Тогда
			ЗаявкаОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
		КонецЕсли; 
		
		ЕстьИзменения = Ложь;
		
		// Синхронизация реквизитов.
		Для каждого Имя Из ИменаСинхр Цикл
			Если Имя = "ПодтверждающиеДокументы" Тогда
				ТЗ = ЭтотОбъект[Имя].Выгрузить();
				ЗаявкаОбъект[Имя].Загрузить(ТЗ);
				ЕстьИзменения = Истина;
				Продолжить;
			КонецЕсли; 
			
			Если ЭтотОбъект[Имя] <> ЗаявкаОбъект[Имя] Тогда
				ЗаявкаОбъект[Имя] = ЭтотОбъект[Имя];			
				ЕстьИзменения = Истина;
			КонецЕсли; 
		КонецЦикла; 
		
		// Синхронизируем дату, если ее изменили с помощью механизма изменения доступности элементов.
		Если Дата <> ЗаявкаОбъект.Дата Тогда
			ЗаявкаОбъект.Дата = Дата;
			ЕстьИзменения = Истина;
		КонецЕсли; 
		
		ЗаявкаОбъект.ДополнительныеСвойства.Вставить("НеУстанавливатьСтатусПриЗаписи",
													(РежимЗаписи = РежимЗаписиДокумента.Проведение));
													
		НадоЗаписатьВРежиме = Неопределено;
		
		Если (Проведен И НЕ ЗаявкаОбъект.Проведен) 
			  ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			НадоЗаписатьВРежиме = РежимЗаписиДокумента.Проведение;
		ИначеЕсли (НЕ Проведен И ЗаявкаОбъект.Проведен) 
			  ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда	
			НадоЗаписатьВРежиме = РежимЗаписиДокумента.ОтменаПроведения;
		ИначеЕсли ЕстьИзменения Тогда
			НадоЗаписатьВРежиме = РежимЗаписиДокумента.Запись;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НадоЗаписатьВРежиме) Тогда
			ПредставлениеЗаявки = Строка(ДокументПланирования);
			Попытка
				ЗаявкаОбъект.Записать(НадоЗаписатьВРежиме);

				ДополнительныеСвойства.Вставить("УстановитьСтатусДокументаПланированияПриПроведении",
													(РежимЗаписи = РежимЗаписиДокумента.Проведение));
				ДополнительныеСвойства.Вставить("ДополнительныеСвойстваДокументаПланирования",
											ЗаявкаОбъект.ДополнительныеСвойства);
				
			Исключение	
				ТекстСообщения = НСтр("ru = 'Ошибка при записи документа планирования ""%1"" по причине: %2.'; 
										|en = 'Error when writing the planning document ""%1"" for the reason: %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ПредставлениеЗаявки, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));

				ВызватьИсключение ТекстСообщения;
			КонецПопытки;	
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры

Процедура ОчиститьНеиспользуемыеРеквизиты()
	
	ПарамВидимости = бит_Казначейство.ПодготовитьПараметрыВидимости(ХозяйственнаяОперация);
	Если ПарамВидимости.ФизЛицо = Ложь Тогда
		ФизЛицо = Неопределено;
	КонецЕсли;
	
	ОплатаЧерезБанк = (ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные);
	Если ОплатаЧерезБанк Тогда
	   	Касса = Справочники.Кассы.ПустаяСсылка();
	Иначе	
	    БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Договор = Неопределено;
	КонецЕсли;
	
	ЭтоПередачаДенег = бит_КазначействоКлиентСервер.ЭтоОперацияПередачиДенег(ХозяйственнаяОперация);
	Если НЕ ЭтоПередачаДенег Тогда
		ОрганизацияПолучатель	 = Неопределено;
		БанковскийСчетПолучатель = Неопределено;
		КассаПолучатель 		 = Неопределено;
	КонецЕсли;
	
	ЭтоОперацияСПартнером = бит_КазначействоКлиентСервер.ЭтоОперацияСПартнером(ХозяйственнаяОперация);
	Если НЕ ЭтоОперацияСПартнером ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов") Тогда
		Партнер = Неопределено;
	КонецЕсли;
	
	// Очистка разрезов бюджетирования, по которым не ведется учет.
	ПараметрыОбъекта = бит_МеханизмДопИзмерений.ПараметрыОбъектаДляОчисткиНеиспользуемыхРеквизитов();
	ПараметрыОбъекта.СтатьяОборотов = СтатьяОборотов;
	
	ПараметрыОчистки = бит_МеханизмДопИзмерений.ПараметрыОчисткиНеиспользуемыхРеквизитов(ПараметрыОбъекта);
	
	бит_МеханизмДопИзмерений.ОчиститьНеиспользуемыеРеквизитыДанных(ЭтотОбъект, ПараметрыОчистки);

	ХозяйственнаяОперацияУП = бит_Казначейство.ХозяйственнаяОперацияУП(ХозяйственнаяОперация);

	Если НЕ СписокФизЛиц Тогда
		ЛицевыеСчетаСотрудников.Очистить();	
		НомерДоговораСБанком = "";
		ДатаДоговораСБанком  = '0001-01-01';
		ОтделениеБанка		 = "";
		ФилиалОтделенияБанка = "";
	КонецЕсли;

	// См. СписаниеБезналичныхДенежныхСредствЛокализация.ПередЗаписью().
	Если Лев(ПоказательДаты, 1) = "0" И Сред(ПоказательДаты, 2, 2) = " ." Тогда
		ПоказательДаты = "0";
	КонецЕсли;
	
	Если ПустаяСтрока(СтрЗаменить(ПоказательДаты, ".", "")) Тогда
		ПоказательДаты = "";
	КонецЕсли;
	
	Если ПеречислениеВБюджет И НЕ ЗначениеЗаполнено(ИдентификаторПлатежа) Тогда
		ИдентификаторПлатежа = "0";
	КонецЕсли;
	
	Если ОплатаЧерезБанк Тогда
		Если НЕ (ХозяйственнаяОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту
			ИЛИ ХозяйственнаяОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета
			ИЛИ ХозяйственнаяОперацияУП = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
			ИЛИ ХозяйственнаяОперацияУП = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
			ИЛИ ХозяйственнаяОперацияУП = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств) Тогда
				КодВидаДохода = "";
		КонецЕсли;
	Иначе	
		КодВидаДохода = "";
	КонецЕсли;

	Если НЕ (ХозяйственнаяОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту
		ИЛИ ХозяйственнаяОперацияУП = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета) Тогда
		КодВыплат = "";
	КонецЕсли;
		
	//++ НЕ УТ
	Если НЕ ПеречислениеВБюджет И ЗначениеЗаполнено(БанковскийСчет) Тогда
		РеквизитыБанковскогоСчета =
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БанковскийСчет, "ОтдельныйСчетГОЗ, ГосударственныйКонтракт.Код");
		Если РеквизитыБанковскогоСчета.ОтдельныйСчетГОЗ Тогда
			ИдентификаторПлатежа = РеквизитыБанковскогоСчета.ГосударственныйКонтрактКод;
		КонецЕсли;
	КонецЕсли;
	//-- НЕ УТ

	Если ХозяйственнаяОперация <> Перечисления.бит_ВидыОперацийКазначейства.ПрочаяВыдачаДенежныхСредств Тогда
		СтатьяРасходов 			 = Неопределено;
		АналитикаРасходов 		 = Неопределено;
		АналитикаАктивовПассивов = Неопределено;
	КонецЕсли;
	
	ОперацияБезНДС = бит_Казначейство.ОперацияБезНДС(ХозяйственнаяОперация);
	Если ОперацияБезНДС Тогда
		СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		СуммаНДС  = 0;	
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет наличие у пользователя права проводить заявки.
//
// Параметры:
//  Отказ - Булево.
//
Процедура ПроверитьПравоПроведения(Отказ)
	
	Если ТипЗнч(ДокументПланирования) <> Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств")
		И ТипЗнч(ДокументПланирования) <> Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию") Тогда
	
		ТекПользователь = Пользователи.ТекущийПользователь();
		РазрешеноПроводить = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(ТекПользователь,
			ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноПроводитьЗаявкиНаРасходованиеДС);
		
		Если НЕ РазрешеноПроводить Тогда
			ТекстСообщения =  НСтр("ru='У пользователя отсутствует дополнительное право на проведение заявок.';
								   |en='The user has no additional right to host applications.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура КонтрольОстатковПоПрогнозу(Шапка, ШапкаОснование, КакКонтролироватьОстатки, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидПланаПрогноз", 	  Перечисления.бит_кзн_ВидыПланов.Прогноз);
	Запрос.УстановитьПараметр("Организация", 	  	  ШапкаОснование.Организация);
	Запрос.УстановитьПараметр("Позиция", 			  ШапкаОснование.Позиция);
	Запрос.УстановитьПараметр("ДокументПланирования", ШапкаОснование.ДокументПланирования);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиПрогноз.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств.Остатки(
	|			,
	|			ВидПлана = &ВидПланаПрогноз
	|				И Организация = &Организация
	|				И Позиция = &Позиция
	|				И ДокументПланирования = &ДокументПланирования) КАК ОстаткиПрогноз";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	СуммаОстаток = 0;
	Если Выборка.Следующий() Тогда		
		СуммаОстаток = Выборка.СуммаОстаток;
	КонецЕсли; 
	
	Если Шапка.ВалютаДокумента = ШапкаОснование.Валюта Тогда
		ТекСумма = Шапка.СуммаДокумента;
	Иначе	
		// Пересчет суммы текущего документа в валюту прогноза.
		
		// По данным основания.
		БазоваяВалюта   = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ШапкаОснование.Организация);
		ВалютыДокумента = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ШапкаОснование.Валюта); 

		Если ЗначениеЗаполнено(ШапкаОснование.ОбъектРасчетов) Тогда
			ОбъектыРасчетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ШапкаОснование.ОбъектРасчетов); 
		Иначе	
			ОбъектыРасчетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ШапкаОснование.Договор); 
		КонецЕсли;
		
		
		КурсыВалютПрогноза = бит_Казначейство.ПолучитьКурсВалютыПоОбъектамРасчетов(ВалютыДокумента, 
									Шапка.Дата, БазоваяВалюта, ОбъектыРасчетов);
									
		Если НЕ ЗначениеЗаполнено(КурсыВалютПрогноза) Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось получить курс валюты документа ""%1"".';
								|en= 'It was not possible to get the currency exchange rate of the document ""%1""'.");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ШапкаОснование.Позиция);
		    ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ШапкаОснование.Позиция, , ,Отказ);   
			Возврат;
		КонецЕсли;	
		
		// По данным документа.							
		БазоваяВалюта   = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Шапка.Организация);
		ВалютыДокумента = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Шапка.Валюта); 

		Если ЗначениеЗаполнено(Шапка.ОбъектРасчетов) Тогда
			ОбъектыРасчетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Шапка.ОбъектРасчетов); 
		Иначе	
			ОбъектыРасчетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Шапка.Договор); 
		КонецЕсли;
		
		КурсыВалютДокумента = бит_Казначейство.ПолучитьКурсВалютыПоОбъектамРасчетов(ВалютыДокумента, 
									Шапка.Дата, БазоваяВалюта, ОбъектыРасчетов);
									
		ТекСумма = РаботаСКурсамивалютУТ.ПересчитатьПоКурсу(Шапка.СуммаДокумента, КурсыВалютДокумента[0], КурсыВалютПрогноза[0]);							

	КонецЕсли; 
	
	// Выполнение контроля.
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Шапка.Организация);
	Отбор.Вставить("ЦФО", 		  Шапка.ЦФО); 	

	ПроцентПревышения = бит_НастройкиПрограммы.ДопустимыйПроцентПревышенияСуммыПрогнозаПлатежа(Отбор, Шапка.Дата);
	СуммаКонтроль = СуммаОстаток * (1 + ПроцентПревышения / 100) - ТекСумма;
	
	Если СуммаКонтроль < 0 Тогда
		
		ТекстСообщения = НСтр("ru='Превышена сумма прогноза %1. Остаток по прогнозу: %2, сумма документа %3, не достаточно: %4.';
							  |en='Exceed the sum of the forecast of %1. The residue forecast %2, amount document %3, is not sufficient: %4.'");
		Если ПроцентПревышения = 0 Тогда
			ТекстПроцент = "";
		Иначе 		
			ТекстПроцент = НСтр("ru = 'более чем на %1%%';en = 'more than %1%%'");
			ТекстПроцент = СтрШаблон(ТекстПроцент, Формат(ПроцентПревышения,"ЧЦ=10; ЧДЦ=4"));
		КонецЕсли; 
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстПроцент,  
							бит_ОбщегоНазначения.ФорматСумм(СуммаОстаток, ШапкаОснование.Валюта),
							бит_ОбщегоНазначения.ФорматСумм(ТекСумма, ШапкаОснование.Валюта),
							бит_ОбщегоНазначения.ФорматСумм(-СуммаКонтроль,ШапкаОснование.Валюта));  
							
		Если КакКонтролироватьОстатки = Перечисления.бит_ВидыКонтроля.Контролировать Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);																			 
		ИначеЕсли КакКонтролироватьОстатки = Перечисления.бит_ВидыКонтроля.Предупреждать Тогда	
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
		КонецЕсли;					
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроверитьСоответствиеФизЛицаИВедомости(РежимЗаписи, Отказ)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		ИЛИ ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФизЛицо)
		ИЛИ НЕ ЗначениеЗаполнено(Ведомость)
		ИЛИ ТипЗнч(Ведомость) <> Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением") Тогда
		Возврат;
	КонецЕсли;
		
	Если ХозяйственнаяОперация <> Перечисления.бит_ВидыОперацийКазначейства.ВыплатаЗарплатыНаЛицевыеСчета Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачисленияПоЗарплате.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Зарплата КАК НачисленияПоЗарплате
	|ГДЕ
	|	НачисленияПоЗарплате.Ссылка = &Ведомость
	|	И НачисленияПоЗарплате.ФизическоеЛицо = &ФизическоеЛицо";
	Запрос.УстановитьПараметр("Ведомость",      Ведомость);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = НСтр("ru='Физическое лицо %1 отсутствует в ведомости %2.';en='Еmployee %1 not found in paysheet %2.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ФизЛицо, Ведомость);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИПодобратьСтатьюПриСоздании()

	Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
		ТипСтатьи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяОборотов, "ТипСтатьи");
	    Если ТипСтатьи <> Перечисления.бит_ТипыСтатейОборотов.БДДС Тогда
			Модуль		    = РегистрыСведений.бит_СоответствияАналитик;
			ВидСоответствия = Справочники.бит_ВидыСоответствийАналитик.СтатьиОборотовБДР_СтатьиОборотовБДДС;
			СтатьяОборотов	= Модуль.ПолучитьПравуюАналитику(ВидСоответствия, СтатьяОборотов, ТекущаяДатаСеанса());
		КонецЕсли;  
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли