
Процедура бит_ОбработкаПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] +  
		Если Источник.бит_ВоеннаяПриемка и Не Источник.ДополнительныеСвойства.Свойство("ПропуститьОбработкуБитСтатусаЗаказа") Тогда
			НЗ = РегистрыСведений.бит_КонтрольВыполненияВП.СоздатьНаборЗаписей();
			НЗ.Отбор.ЗаказКлиента.Установить(Источник.Ссылка);
			Для каждого стр из Источник.Товары Цикл  
				нов = НЗ.Добавить();
				нов.ЗаказКлиента 	= Источник.Ссылка;
				нов.Номенклатура 	= стр.Номенклатура;
				нов.Изготовлено 	= стр.бит_Изготовлено;
				нов.ДатаИзготовления = стр.бит_ДатаИзготовления;
				нов.Проверено 		= стр.бит_Проверено;
				нов.ДатаПроверки 	= стр.бит_ДатаПроверки;
				нов.НомерСтрокиТЧ	= стр.НомерСтроки;
			КонецЦикла;
			НЗ.Записать();
		КонецЕсли;
		Обработка = Обработки.бит_АРМЗаказыКлиентовВПv1.Создать();
		Обработка.ОбработатьСтатусЗаказа(Источник);  
		// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] -
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда
		// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] +  
		Обработка = Обработки.бит_АРМЗаказыКлиентовВПv1.Создать();
		Обработка.УстановитьСтатусЗаказаПоОплате(Источник.Ссылка);
    	// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] -
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] +  
		Обработка = Обработки.бит_АРМЗаказыКлиентовВПv1.Создать();
		Обработка.УстановитьСтатусЗаказаПоОплате(Источник.Ссылка); 
		// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] -
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаПроизводство") Тогда
		// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] +  
		Если Не Источник.ДополнительныеСвойства.Свойство("бит_ПредварительныйРасчет") Тогда
			Обработка = Обработки.бит_АРМЗаказыКлиентовВПv1.Создать();
			Обработка.УстановитьСтатусЗаказаПоЗаказуНаПроизводство(Источник.Ссылка);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаПроизводство2_2") Тогда
		// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] +  
		Если Не Источник.ДополнительныеСвойства.Свойство("бит_ПредварительныйРасчет") Тогда
			Обработка = Обработки.бит_АРМЗаказыКлиентовВПv1.Создать();
			Обработка.УстановитьСтатусЗаказаПоЗаказуНаПроизводство(Источник.Ссылка); 
		КонецЕсли;
		// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] -
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Тогда
		// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] +  
		Обработка = Обработки.бит_АРМЗаказыКлиентовВПv1.Создать();
		Обработка.УстановитьГотовностьКОтгрузке(Источник.Ссылка); 
		// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] - 
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда
		// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] +  
		Обработка = Обработки.бит_АРМЗаказыКлиентовВПv1.Создать();
		Обработка.ПроверитьИУстановитьСтатусОтгруженоЛибоЧастичноОтгружено(Источник.Ссылка); 
		// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:52] -
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		// {{ПервыйБИТ ЛистТребований [ЛТ9.7]  [VUVaynula@1cbit.ru] [04.08.2025 12:00:48] +        
		Документы.ЗаявкаНаВозвратТоваровОтКлиента.ПолучитьНомерАктаСрезки(Источник, Отказ);
		// }}ПервыйБИТ ЛистТребований [ЛТ9.7]  [VUVaynula@1cbit.ru] [04.08.2025 12:00:48] -
	КонецЕсли; 
	
КонецПроцедуры

Процедура бит_ДокументыПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 16:23:24] +        
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаПроизводство2_2") Тогда
		Если Источник.ПометкаУдаления = Истина Тогда
			УдалитьЗаписьИзРСПереносЗаказовНаПроизводство(Источник.Ссылка);
		КонецЕсли;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 16:23:24] -
КонецПроцедуры

Процедура бит_ОтменаПроведенияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:05] +        
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		НЗ = РегистрыСведений.бит_КонтрольВыполненияВП.СоздатьНаборЗаписей();
		НЗ.Отбор.ЗаказКлиента.Установить(Источник.Ссылка);
		НЗ.Прочитать();
		Если НЗ.Количество() Тогда
			НЗ.Очистить();
			НЗ.Записать();
		КонецЕсли;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [24.03.2025 12:37:05] -	
КонецПроцедуры

Процедура бит_ДокументыПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказКлиента") Тогда 
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ПроверитьНаличиеПлановойКалькуляции(Источник, Отказ);  
			ПроверитьРазнуюТаруДляОдинаковойНоменклатуры(Источник, Отказ);
		КонецЕсли;
		ЗаполнитьРеквизитыВП(Источник, Отказ);	
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.СменноеЗадание") Тогда
		
		ПроверкаВозможностиЗакрытияСменногоЗадания(Источник, Отказ);	
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЭтапПроизводства2_2") Тогда
		
		ПроверкаВозможностиЗакрытияЭтапПроизводства2_2(Источник, Отказ);	
		
	КонецЕсли; 

КонецПроцедуры 

Процедура ПроверитьРазнуюТаруДляОдинаковойНоменклатуры(Источник, Отказ)
	// {{ПервыйБИТ ЛистТребований [УПО12427]  [VUVaynula@1cbit.ru] [04.08.2026 19:56:14] +        
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	тз.Номенклатура КАК Номенклатура,
	                      |	тз.бит_Тара КАК Тара
	                      |ПОМЕСТИТЬ вт
	                      |ИЗ
	                      |	&тз КАК тз
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт.Номенклатура КАК Номенклатура,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт.Тара) КАК Тара
	                      |ИЗ
	                      |	вт КАК вт
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	вт.Номенклатура
	                      |
	                      |ИМЕЮЩИЕ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт.Тара) > 1");
	Запрос.УстановитьПараметр("тз", Источник.Товары.Выгрузить(, "Номенклатура, бит_Тара"));
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение запрещено. Для следующей номенклатуры указано несколько разных значений `(бит) Тара`. Укажите одинаковое значение тары");
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Выборка.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [УПО12427]  [VUVaynula@1cbit.ru] [04.08.2026 19:56:14] -
КонецПроцедуры

Процедура ПроверитьНаличиеПлановойКалькуляции(Знач Источник, Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВЫРАЗИТЬ(ВТ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВТ.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	&ВТ КАК ВТ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПлановыеМатериальныеЗатратыОбороты.Регистратор КАК Регистратор,
	                      |	ПлановыеМатериальныеЗатратыОбороты.ПартияСпецификация.ОсновноеИзделиеНоменклатура КАК Номенклатура,
	                      |	ПлановыеМатериальныеЗатратыОбороты.ПартияСпецификация.ОсновноеИзделиеХарактеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ПлановаяКальк
	                      |ИЗ
	                      |	РегистрНакопления.ПлановыеМатериальныеЗатраты.Обороты(
	                      |			,
	                      |			,
	                      |			Запись,
	                      |			(ПартияСпецификация.ОсновноеИзделиеНоменклатура, ПартияСпецификация.ОсновноеИзделиеХарактеристика) В
	                      |				(ВЫБРАТЬ
	                      |					вт.Номенклатура,
	                      |					вт.Характеристика
	                      |				ИЗ
	                      |					вт КАК вт)) КАК ПлановыеМатериальныеЗатратыОбороты
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПлановыеМатериальныеЗатратыОбороты.Регистратор,
	                      |	ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура,
	                      |	ПроизводствоБезЗаказаВыходныеИзделия.Характеристика
	                      |ИЗ
	                      |	РегистрНакопления.ПлановыеМатериальныеЗатраты.Обороты(, , Запись, ) КАК ПлановыеМатериальныеЗатратыОбороты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
	                      |		ПО ПлановыеМатериальныеЗатратыОбороты.ПартияСпецификация = ПроизводствоБезЗаказаВыходныеИзделия.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПлановыеМатериальныеЗатратыОбороты.Регистратор,
	                      |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура,
	                      |	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика
	                      |ИЗ
	                      |	РегистрНакопления.ПлановыеМатериальныеЗатраты.Обороты(, , Запись, ) КАК ПлановыеМатериальныеЗатратыОбороты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	                      |		ПО ПлановыеМатериальныеЗатратыОбороты.ПартияСпецификация = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВТ.Номенклатура КАК Номенклатура,
	                      |	ВТ.Характеристика КАК Характеристика
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ПлановаяКальк КАК ПлановаяКальк
	                      |		ПО ВТ.Номенклатура = ПлановаяКальк.Номенклатура
	                      |			И ВТ.Характеристика = ПлановаяКальк.Характеристика
	                      |ГДЕ
	                      |	ПлановаяКальк.Регистратор ЕСТЬ NULL
	                      |	И ВТ.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)");
	Запрос.УстановитьПараметр("ВТ", Источник.Товары.Выгрузить(, "Номенклатура, Характеристика"));	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для " + Выборка.Номенклатура 
															 + ?(ЗначениеЗаполнено(Выборка.Характеристика), " " + Выборка.Характеристика, "")
															 + " не найдена плановая калькуляция");
		КонецЦикла; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение запрещено", , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыВП(Источник, Отказ)
	// {{ПервыйБИТ ЛистТребований [ЛТ 3.17]  [VUVaynula@1cbit.ru] [20.03.2025 17:32:51] +
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИтогИзготовлено = "";
	ИтогПроверено = "";                    
	Изготовлено = 0;
	Проверено = 0;
	
	Источник.бит_ПроцентВыполненияЗаказа = 0;
	Источник.бит_ПроцентПроверкиЗаказа = 0;
	ЗаказВыполнен = Истина;
	ЗаказПроверен = Истина;
	ДатаОкончанияЗаказа = Дата("00010101"); 
	ДатаОкончанияПроверки = Дата("00010101"); 
	
	Источник.бит_ДатаОкончанияЗаказа = ДатаОкончанияЗаказа; 
	Источник.бит_ДатаОкончанияПроверки = ДатаОкончанияПроверки;
	Если Источник.бит_ВоеннаяПриемка Тогда
		
		Для Каждого стр Из Источник.Товары Цикл
			Если стр.бит_Изготовлено Тогда 
				Изготовлено = Изготовлено + 1;
				ДатаОкончанияЗаказа = Макс(ДатаОкончанияЗаказа, стр.бит_ДатаИзготовления); 
			Иначе
				ЗаказВыполнен = Ложь;
			КонецЕсли;
			Если стр.бит_Проверено Тогда
				Проверено = Проверено + 1;
				ДатаОкончанияПроверки = Макс(ДатаОкончанияПроверки, стр.бит_ДатаПроверки);
			Иначе
				ЗаказПроверен = Ложь;
			КонецЕсли;
		КонецЦикла;	
		
		ВсегоСтрок = Источник.Товары.Количество(); 
		
		// Рассчитывается как отношение количества номенклатурных позиций с установленным признаком «Изготовлено» 
		// к общему количеству строк в табличной части.
		//  Формула: (Количество строк с признаком "Изготовлено" / Общее количество строк) * 100.
		Источник.бит_ПроцентВыполненияЗаказа = Окр((Изготовлено / ВсегоСтрок) * 100, 2);
		Источник.бит_ПроцентПроверкиЗаказа 	= Окр((Проверено   / ВсегоСтрок) * 100, 2);     
		Если ЗаказВыполнен Тогда
			Источник.бит_ДатаОкончанияЗаказа = ДатаОкончанияЗаказа;
		КонецЕсли; 
		Если ЗаказПроверен Тогда
			Источник.бит_ДатаОкончанияПроверки = ДатаОкончанияПроверки;	
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры

Процедура УдалитьЗаписьИзРСПереносЗаказовНаПроизводство(Документ)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 16:25:20] +
	// При пометке на удаление "Заказа на производство" удаляется запись из регистра
	НЗ = РегистрыСведений.бит_ПереносЗаказовНаПроизводство.СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаПроизводство.Установить(Документ);
	НЗ.Записать();
	// }}ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 16:25:20] -
КонецПроцедуры

Процедура ПроверкаВозможностиЗакрытияСменногоЗадания(СменноеЗаданиеОбъект, Отказ)
// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 5:17:26] +        
	Если Отказ Или СменноеЗаданиеОбъект.Статус <> Перечисления.СтатусыСменныхЗаданий.Закрыто Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПроизводственнаяОперация2_2.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ПроизводственнаяОперация2_2.ВыходныеИзделия КАК ПроизводственнаяОперация2_2ВыходныеИзделия
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
	                      |		ПО ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка = ПроизводственнаяОперация2_2.Ссылка
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	                      |		ПО ПроизводственнаяОперация2_2ВыходныеИзделия.Серия = СерииНоменклатуры.Ссылка
	                      |ГДЕ
	                      |	ПроизводственнаяОперация2_2.СменноеЗадание = &СменноеЗадание
	                      |	И ПроизводственнаяОперация2_2ВыходныеИзделия.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	                      |	И СерииНоменклатуры.бит_Завешено = ЛОЖЬ");
	Запрос.УстановитьПараметр("СменноеЗадание", СменноеЗаданиеОбъект.Ссылка);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перевод в статус 'Закрыто' невозможен. В операции присутствуют незавешенные серии:");
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + Выборка.Ссылка, Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 5:17:26] -	
КонецПроцедуры

Процедура ПроверкаВозможностиЗакрытияЭтапПроизводства2_2(ЭтапОбъект, Отказ)
// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 6:04:33] +        
// задача 4                                                                
	Если ЭтапОбъект.Статус <> Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда
		Возврат;
	КонецЕсли;
	Для каждого стр из ЭтапОбъект.ВыходныеИзделия Цикл
		Если ЗначениеЗаполнено(стр.Серия) и стр.Серия.бит_Завешено = Ложь Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перевод в статус 'Завершен' невозможен. В табличной части 'Выпуск' - 'Изделия по рассчитываемой стоимости' присутствуют незавешенные серии", ЭтапОбъект.Ссылка);
			Прервать;	
		КонецЕсли;
	КонецЦикла;
// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 6:04:33] -	
КонецПроцедуры                                          

Процедура бит_СправочникиПередЗаписьюПередЗаписью(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ВидыНоменклатуры") Тогда
		Если Не Отказ И Не ЗначениеЗаполнено(Источник.бит_Код) И Источник.ЭтоГруппа = Ложь Тогда
			СгенерироватьНовыйКодВидаНоменклатуры(Источник);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Сотрудники") Тогда
		ПроверитьУникальностьШтампаКонтроллера(Источник, Отказ);  
		ПроверитьУникальностьШтампаЭмалировщика(Источник, Отказ);
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ВидыРабочихЦентров") Тогда
		// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [26.04.2026 14:04:36] +        
		ПроверитьУникальностьРеквизитаОсновнойХодВГруппе(Источник, Отказ);		
		// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [26.04.2026 14:04:36] -
	КонецЕсли;
	
КонецПроцедуры

Процедура СгенерироватьНовыйКодВидаНоменклатуры(Источник)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [29.11.2025 15:52:59] +        
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ВидыНоменклатуры.бит_Код КАК бит_Код
	                      |ИЗ
	                      |	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	бит_Код УБЫВ");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КодЧислом = Число("0" + Выборка.бит_Код);
		ОчереднойНомер = КодЧислом + 1;
		Источник.бит_Код = Прав("00000" + Формат(ОчереднойНомер, "ЧГ=0"), 5);
	Иначе               
		Источник.бит_Код = "00001";
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [29.11.2025 15:52:59] -
КонецПроцедуры

Процедура ПроверитьУникальностьШтампаКонтроллера(Источник, Отказ)
	
	Значение = Неопределено;
	ШтампКонтроллера = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ШтампКонтроллера, , Истина); 
	Для каждого стр из Источник.ДополнительныеРеквизиты Цикл
		Если стр.Свойство = ШтампКонтроллера И ЗначениеЗаполнено(стр.Значение) Тогда
			Значение = стр.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Сотрудники.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Сотрудники.ДополнительныеРеквизиты КАК Сотрудники
	                      |ГДЕ
	                      |	Сотрудники.Свойство = &Свойство
	                      |	И Сотрудники.Значение = &Значение
	                      |"); 
	
	Запрос.УстановитьПараметр("Свойство", ШтампКонтроллера);
	Запрос.УстановитьПараметр("Значение", Значение);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если Источник.ЭтоНовый() И ТЗ.Количество() <> 0 Тогда
		Ошибка = Истина;
	ИначеЕсли Источник.ЭтоНовый() = Ложь и ТЗ.Количество() > 1 Тогда
		Ошибка = Истина;
	Иначе
		Ошибка = Ложь;
	КонецЕсли;
	
	Если Ошибка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранное значение `Штамп контролера` не уникально");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПроверитьУникальностьШтампаЭмалировщика(Источник, Отказ)
	
	Значение = Неопределено;
	ШтампЭмалировщика = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ШтампЭмалировщика, , Истина); 
	Для каждого стр из Источник.ДополнительныеРеквизиты Цикл
		Если стр.Свойство = ШтампЭмалировщика И ЗначениеЗаполнено(стр.Значение) Тогда
			Значение = стр.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Сотрудники.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Сотрудники.ДополнительныеРеквизиты КАК Сотрудники
	                      |ГДЕ
	                      |	Сотрудники.Свойство = &Свойство
	                      |	И Сотрудники.Значение = &Значение
	                      |"); 
	
	Запрос.УстановитьПараметр("Свойство", ШтампЭмалировщика);
	Запрос.УстановитьПараметр("Значение", Значение);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если Источник.ЭтоНовый() И ТЗ.Количество() <> 0 Тогда
		Сотрудник = ТЗ[0].Ссылка;
		Ошибка = Истина;
	ИначеЕсли Источник.ЭтоНовый() = Ложь и ТЗ.Количество() > 1 Тогда
		Для каждого стр из ТЗ Цикл
			Если стр.Ссылка = Источник.Ссылка Тогда
				Продолжить;
			КонецЕсли;
			Сотрудник = стр.Ссылка;
			Прервать;
		КонецЦикла;
		
		Ошибка = Истина;
	Иначе
		Ошибка = Ложь;
	КонецЕсли;
	
	Если Ошибка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранное значение `Штамп контролера` уже указано у сотрудника " + Сотрудник, Сотрудник);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьУникальностьРеквизитаОсновнойХодВГруппе(Источник, Отказ)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [26.04.2026 14:06:04] +        
	Если Не Источник.ЭтоГруппа 
		И Источник.бит_ОсновнойХод Тогда 
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВРЦ.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.ВидыРабочихЦентров КАК ВРЦ
		                      |ГДЕ
		                      |	ВРЦ.Родитель = &Родитель
		                      |	И ВРЦ.бит_ОсновнойХод
		                      |	И ВРЦ.Ссылка <> &текВРЦ");	
		Запрос.УстановитьПараметр("текВРЦ", Источник.Ссылка);
		Запрос.УстановитьПараметр("Родитель", Источник.Родитель);
		Если Не Запрос.Выполнить().Пустой() Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено наличие более одного элемента справочника  с реквизитом `Основной Ход`=Истина в группе", , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [26.04.2026 14:06:04] -
КонецПроцедуры
