
#Область СлужебныеПроцедурыИФункции

Функция ВидыКомпенсируемыхОтпусков() Экспорт
	
	Возврат ЗаявкиСотрудниковРасширенный.ВидыКомпенсируемыхОтпусков();
	
КонецФункции

Процедура ЗаполнитьДанныеЗаполненияДокументаОтпуск(ДанныеЗаполнения, ДанныеЗаявки) Экспорт

	ЗаявкиСотрудниковРасширенный.ЗаполнитьДанныеЗаполненияДокументаОтпуск(ДанныеЗаполнения, ДанныеЗаявки);

КонецПроцедуры

Процедура ЗаполнитьДанныеЗаполненияДокументаОтпускПоВидамОтпусков(ДанныеЗаполнения, ДанныеЗаявки) Экспорт

	ЗаявкиСотрудниковРасширенный.ЗаполнитьДанныеЗаполненияДокументаОтпускПоВидамОтпусков(ДанныеЗаполнения, ДанныеЗаявки);

КонецПроцедуры

Процедура ЗаполнитьДанныеЗаполненияДокументаОтпускБезОплаты(ДанныеЗаполнения, ДанныеЗаявки) Экспорт

	ЗаявкиСотрудниковРасширенный.ЗаполнитьДанныеЗаполненияДокументаОтпускБезОплаты(ДанныеЗаполнения, ДанныеЗаявки);

КонецПроцедуры

Функция ЗначенияДляВыбораВидаДокументаОтсутствиеБолезнь() Экспорт

	ЗначенияДляВыбора = Новый СписокЗначений;
	ЗначенияДляВыбора.Добавить("Неявка", 		Метаданные.Документы.ПрогулНеявка.Синоним);
	ЗначенияДляВыбора.Добавить("Больничный", 	Метаданные.Документы.БольничныйЛист.Синоним);
	
	Возврат ЗначенияДляВыбора;

КонецФункции

Функция ЗначенияДляВыбораДокументаПоОтсутствию(ПричинаОтсутствия) Экспорт
	
	ЗначенияДляВыбора = Новый СписокЗначений;
	
	Если ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.Болезнь Тогда
		ЗначенияДляВыбора.Добавить(Метаданные.Документы.ПрогулНеявка.ПолноеИмя(), Метаданные.Документы.ПрогулНеявка.Синоним);
		ЗначенияДляВыбора.Добавить(Метаданные.Документы.БольничныйЛист.ПолноеИмя(), Метаданные.Документы.БольничныйЛист.Синоним);
	ИначеЕсли ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.ОтпускПоБеременностиИРодам Тогда
		ЗначенияДляВыбора.Добавить(Метаданные.Документы.БольничныйЛист.ПолноеИмя(), Метаданные.Документы.БольничныйЛист.Синоним);
	ИначеЕсли ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.ОтпускПоУходуЗаРебенком Тогда
		ЗначенияДляВыбора.Добавить(Метаданные.Документы.ОтпускПоУходуЗаРебенком.ПолноеИмя(), Метаданные.Документы.ОтпускПоУходуЗаРебенком.Синоним);
	ИначеЕсли ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.Отгул Тогда
		ЗначенияДляВыбора.Добавить(Метаданные.Документы.Отгул.ПолноеИмя(), Метаданные.Документы.Отгул.Синоним);
	ИначеЕсли ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.Командировка Тогда
		ЗначенияДляВыбора.Добавить(Метаданные.Документы.Командировка.ПолноеИмя(),	Метаданные.Документы.Командировка.Синоним);
	ИначеЕсли ПричинаОтсутствия = Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.ДниУходаЗаДетьмиИнвалидами Тогда
		ЗначенияДляВыбора.Добавить(Метаданные.Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.ПолноеИмя(), Метаданные.Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.Синоним);
	КонецЕсли;
	
	Возврат ЗначенияДляВыбора;

КонецФункции


#КонецОбласти