
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбъектСистемы = ПолучитьОбъектДоступаРегистрМСФО();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ОбъектСистемы", ОбъектСистемы));
	
	ОткрытьФорму("РегистрСведений.бит_НачалоОткрытогоПериода.ФормаСписка", ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьОбъектДоступаРегистрМСФО()
	
	МетаРегистрМСФО = Метаданные.РегистрыБухгалтерии.бит_Дополнительный_2;
	ОбъектРегистрМСФО = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаРегистрМСФО);
	
	Возврат ОбъектРегистрМСФО;
	
КонецФункции // ПолучитьОбъектДоступаРегистрМСФО()

#КонецОбласти
