
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокументОтражение = НайтиДокументОтражения(ПараметрКоманды);	
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", ДокументОтражение);
	Попытка			
		ОткрытьФорму("Документ.бит_ОтражениеФактаДДС.ФормаОбъекта", 
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	Исключение						   
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));			
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НайтиДокументОтражения(ПараметрКоманды)

	Возврат бит_Казначейство.НайтиДокументОтражения(ПараметрКоманды);

КонецФункции
 
#КонецОбласти
