#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
#Область ДляВызоваИзДругихПодсистем
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт  

	КомандаОтчет = Отчеты.бит_РасшифровкаПремииЗаМногостаночноеОбслуживание.ДобавитьКомандуОтчета(КомандыОтчетов, Параметры);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.ВидимостьВФормах = "ФормаДокумента, ФормаСписка"; 
		КомандаОтчет.Порядок = 1;
	КонецЕсли;
	
	КомандаОтчет = Отчеты.бит_РасшифровкаПремииЗаСложностьОборудования.ДобавитьКомандуОтчета(КомандыОтчетов, Параметры);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.ВидимостьВФормах = "ФормаДокумента, ФормаСписка"; 
		КомандаОтчет.Порядок = 1;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти 

#Область Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВедомостьРаспределенияПремии";
	КомандаПечати.Представление = НСтр("ru = 'Ведомость распределения премии'"); 
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ВедомостьРаспределенияПремии");
	
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Ведомость распределения премии'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ВедомостьРаспределенияПремии", 
		Заголовок,
		СформироватьПечатнуюФормуВедомостьРаспределенияПремии(МассивОбъектов),
		,
		"Документ.бит_РасчетПремии.ВедомостьРаспределенияПремии");
		
	КонецЕсли; 

КонецПроцедуры   

Функция СформироватьПечатнуюФормуВедомостьРаспределенияПремии(МассивОбъектов)
	
	УстановитьПривилегированныйРежим(Истина);  
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСлева= 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	
	ТабличныйДокумент.КлючПараметровПечати = "ВедомостьРаспределенияПремии";
	
	Для Каждого ЭлМассива Из МассивОбъектов Цикл
		
		Макет = ПолучитьМакет("ВедомостьРаспределенияПремии");
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьПодразделение = Макет.ПолучитьОбласть("Подразделение");
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			
		ОбластьШапка.Параметры.Организация = ЭлМассива.Организация;
		
		ОтветственныеЛица = ОтветственныеЛицаСервер.ПолучитьДанныеОтветственногоЛица(ЭлМассива.Организация, ЭлМассива.Дата, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		
		Если ЗначениеЗаполнено(ОтветственныеЛица.ФизическоеЛицо) Тогда
		
			ОбластьШапка.Параметры.ФИООтветственного = ОтветственныеЛица.ФизическоеЛицо.Инициалы + " " + ОтветственныеЛица.ФизическоеЛицо.Фамилия;
			
		КонецЕсли;
	
		ИмяТаблицы = "";
		ПолеПодразделение = "";
		ПолеДолжность = "";
		ПолеСумма = "";
		
		Если ЭлМассива.ВидРасчетаПремии = Перечисления.бит_ВидыРасчетаПремии.Нормативная Тогда
			
			ОбластьШапка.Параметры.НаименованиеВедомости = "распределения премии руководителя по подразделению";
			ИмяТаблицы = "ДанныеНормативнойПремии";
			ПолеПодразделение = "Служба";
			ПолеДолжность = "Таблица.Должность КАК Профессия,";
			ПолеСумма = "НормативнаяПремияИтого"; 
			
		ИначеЕсли ЭлМассива.ВидРасчетаПремии = Перечисления.бит_ВидыРасчетаПремии.ЗаМногостаночноеОбслуживание Тогда
			
			ОбластьШапка.Параметры.НаименованиеВедомости = "распределения премии за многостаночное обслуживание";
			ИмяТаблицы = "ДанныеПремииЗаМногостаночноеОбслуживание";
			ПолеПодразделение = "Подразделение";
			ПолеСумма = "Сумма"; 
			
		ИначеЕсли ЭлМассива.ВидРасчетаПремии = Перечисления.бит_ВидыРасчетаПремии.ЗаСложность Тогда
			
			ОбластьШапка.Параметры.НаименованиеВедомости = "распределения премии за сложность оборудования";
			ИмяТаблицы = "ДанныеПремииЗаСложность";
			ПолеПодразделение = "Подразделение";
			ПолеСумма = "Сумма";
			
		КонецЕсли;
		
		ОбластьШапка.Параметры.НаименованиеВедомости = ОбластьШапка.Параметры.НаименованиеВедомости + " за " + Формат(ЭлМассива.ДатаНачала, "ДФ='MMMM yyyy'");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Сотрудник КАК ФИО,
		|	Таблица.Сотрудник.Код КАК ТабНомер,
		|	" + ПолеДолжность + "
		|	Таблица." + ПолеПодразделение + " КАК Подразделение,
		|	Таблица." + ПолеСумма + " КАК Сумма
		|ИЗ
		|	Документ.бит_РасчетПремии." + ИмяТаблицы + " КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка
		|	И Таблица.Сотрудник <> Значение(Справочник.Сотрудники.ПустаяСсылка) 
		|	И Таблица." + ПолеСумма + " <> 0
		|ИТОГИ ПО
		|	Подразделение";
		
		Запрос.УстановитьПараметр("Ссылка", ЭлМассива.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаПодразделение = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СуммаИтого = 0;
		
		Пока ВыборкаПодразделение.Следующий() Цикл
			
			ОбластьПодразделение.Параметры.Подразделение = ВыборкаПодразделение.Подразделение;
			
			ТабличныйДокумент.Вывести(ОбластьПодразделение);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
			
			ВыборкаДетальныеЗаписи = ВыборкаПодразделение.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				СуммаИтого = СуммаИтого +ВыборкаДетальныеЗаписи.Сумма;
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, ВыборкаДетальныеЗаписи);
				
				Если ЭлМассива.ВидРасчетаПремии <> Перечисления.бит_ВидыРасчетаПремии.Нормативная Тогда
					ОбластьСтрокаТаблицы.Параметры.Профессия = ПолучитьПрофесиюСотрудника(ВыборкаДетальныеЗаписи.ФИО, ЭлМассива.ДатаОкончания);
				КонецЕсли;
					
				ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
				
			КонецЦикла;	
			
		КонецЦикла;
		
		ОбластьПодвал.Параметры.СуммаИтого = СуммаИтого;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
		
КонецФункции

Функция ПолучитьПрофесиюСотрудника(Сотрудник, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадроваяИсторияСотрудниковИнтервальный.Сотрудник КАК Сотрудник,
		|	КадроваяИсторияСотрудниковИнтервальный.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК КадроваяИсторияСотрудниковИнтервальный
		|ГДЕ
		|	&Дата МЕЖДУ КадроваяИсторияСотрудниковИнтервальный.ДатаНачала И КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания
		|	И КадроваяИсторияСотрудниковИнтервальный.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Должность;
	КонецЦикла;
		
	Возврат "";
	
КонецФункции

#КонецОбласти
#КонецОбласти
#КонецЕсли  
