
Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ДанныеНормативнойПремии.Очистить();
	ЭтотОбъект.Расшифровка.Очистить();
	
	ЭтотОбъект.ДанныеПремииЗаМногостаночноеОбслуживание.Очистить();
	ЭтотОбъект.ДанныеПремииЗаМногостаночноеОбслуживаниеДополнительноеВремя.Очистить();
	ЭтотОбъект.ПремииЗаМногостаночноеОбслуживаниеРасшифровка.Очистить();
	
	ЭтотОбъект.ДанныеПремииЗаСложность.Очистить();
	ЭтотОбъект.ДанныеПремииЗаСложностьДополнительноеВремя.Очистить();	
	ЭтотОбъект.ПремииЗаСложностьРасшифровка.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр бит_ДанныеПремииЗаМногостаночноеОбслуживание 
	Движения.бит_ДанныеПремииЗаМногостаночноеОбслуживание.Записывать = Истина;
	Для Каждого ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка Из ПремииЗаМногостаночноеОбслуживаниеРасшифровка Цикл
		Движение = Движения.бит_ДанныеПремииЗаМногостаночноеОбслуживание.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка.Подразделение;
		Движение.Сотрудник = ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка.Сотрудник;
		Движение.СменноеЗадание = ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка.СменноеЗадание;
		Движение.ВидРабочегоЦентра = ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка.ВидРабочегоЦентра;
		Движение.Номенклатура = ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка.Номенклатура;
		Движение.ВесПлан = ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка.ВесПлан;
		Движение.ВесФакт = ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка.ВесФакт;
		Движение.ЧТСДляПремии = ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка.ЧТСДляПремии;
		Движение.НормоЧасы = ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка.НормоЧасы;
		Движение.Сумма = ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка.Сумма;
		Движение.ДополнительноеВремя = ТекСтрокаПремииЗаМногостаночноеОбслуживаниеРасшифровка.ДополнительноеВремя;
	КонецЦикла;

	// регистр бит_ДанныеПремииЗаСложностьОборудования 
	Движения.бит_ДанныеПремииЗаСложностьОборудования.Записывать = Истина;
	Для Каждого ТекСтрокаПремииЗаСложностьРасшифровка Из ПремииЗаСложностьРасшифровка Цикл
		Движение = Движения.бит_ДанныеПремииЗаСложностьОборудования.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаПремииЗаСложностьРасшифровка.Сотрудник;
		Движение.СменноеЗадание = ТекСтрокаПремииЗаСложностьРасшифровка.СменноеЗадание;
		Движение.ВидРабочегоЦентра = ТекСтрокаПремииЗаСложностьРасшифровка.ВидРабочегоЦентра;
		Движение.КоличествоНормочасов = ТекСтрокаПремииЗаСложностьРасшифровка.КоличествоНормочасов;
		Движение.Сумма = ТекСтрокаПремииЗаСложностьРасшифровка.Сумма;
		Движение.ДополнительноеВремя = ТекСтрокаПремииЗаСложностьРасшифровка.ДополнительноеВремя;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
