
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства	
	
	ВзаиморасчетыСервер.ФормаПриСозданииНаСервере(ЭтотОбъект);
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);	
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ПодготовитьФормуНаСервере(СтандартнаяОбработка);
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойств
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатус" Тогда
		
		ОбработкаОповещенияИзмененияСтатуса();		
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ВзаиморасчетыСервер.ФормаПриЧтенииНаСервере(ЭтотОбъект);
	
	ПодготовитьФормуНаСервере();
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ЭтоРежимЗаявки
			И ТекущийОбъект.ДокументПланирования.Проведен = Ложь Тогда
	
		ТекстСообщения = НСтр("ru='В режиме списка позицию поступления разрешено проводить только после проведения заявки.';
							  |en='In list mode receipt position is allowed only after the application.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
	ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И НЕ ЭтоРежимЗаявки
			И ТекущийОбъект.ДокументПланирования.Проведен = Истина Тогда
			
		ТекстСообщения = НСтр("ru='В режиме списка запрещено отменять проведение позиции поступления.';
							  |en='In list mode it is prohibited to cancel the holding of receipt position.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
	КонецЕсли; 
	
	СовпадающиеАналитики = Документы.бит_кзн_ПозицияПоступления.НайтиАналитикиСовпадающиеСРеквизитами(Объект.Ссылка.метаданные());
	
	Для каждого Соотв Из СовпадающиеАналитики Цикл
		ИмяАналитики = Соотв.Ключ;
		ИмяРеквизита = Соотв.Значение;
		ТекущийОбъект[ИмяАналитики] = ТекущийОбъект[ИмяРеквизита];
	КонецЦикла;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//++ НЕ УТ
	НастройкаСчетовУчетаСервер.ПослеЗаписиНаСервере(ЭтотОбъект);
	//-- НЕ УТ
	
	УстановитьЗаголовокФормыДокумента();
	
	ВзаиморасчетыСервер.ФормаПослеЗаписиНаСервере(ЭтотОбъект);
	
	ПодготовитьФормуНаСервере();
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОповеститьОбИзменении(Объект.ДокументПланирования);
	Оповестить("ВыполненаЗаписьДокумента", Новый Структура("ДокументСсылка", Объект.ДокументПланирования));
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование)
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.бит_кзн_ПозицияПоступления") Тогда	
		Оповестить("бит_ИзмененСтатус");	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбъектРасчетов

&НаКлиенте
Процедура ОбъектРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбъектРасчетов = Неопределено;
	
	ВзаиморасчетыКлиент.ОбъектРасчетовНачалоВыбора(ЭтотОбъект, Элемент, СтандартнаяОбработка,, Объект.ОбъектРасчетов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ОбъектРасчетовОбработкаВыбораНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбъектРасчетовПриИзменении(Элемент)
	
	ОбъектРасчетовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ВзаиморасчетыКлиент.ОбъектРасчетовОснованиеПлатежаАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетовОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ВзаиморасчетыКлиент.ОбъектРасчетовОснованиеПлатежаАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, Ложь, Истина);

КонецПроцедуры

#КонецОбласти

#Область Договор

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Отбор.Вставить("ПорядокРасчетов", ДоступныеПорядкиРасчетов());
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Отбор.Вставить("ПорядокРасчетов", ДоступныеПорядкиРасчетов());
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	Открытьформу("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	
	ФормаОплатыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	Если Объект.ВалютаВзаиморасчетов <> Объект.ВалютаДокумента Тогда
		Объект.СуммаВзаиморасчетов = 0;
	Иначе
		Объект.СуммаВзаиморасчетов = Объект.СуммаДокумента;
	КонецЕсли;
	
	ОбработатьИзмененииСуммыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	Если НЕ ОперацияБезНДС Тогда
		РассчитатьСуммуНДС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
		
	ОбновитьКонтролируемыеРеквизиты("Организация", ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяОборотовПриИзменении(Элемент)
	
	СтатьяОборотовПриИзмененииНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаРасходаПриИзменении(Элемент)
		
	ОбработатьИзменениеПериодаРассчетов();
	УправлениеФормой();	

КонецПроцедуры

&НаКлиенте
Процедура ДатаПлатежаКрайняяПриИзменении(Элемент)
	
	ОбработатьИзменениеПериодаРассчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если КонтролируемыеРеквизиты.ВалютаДокумента = Объект.ВалютаДокумента Тогда
		Возврат;	
	КонецЕсли;

	ОбработатьИзмененииВалюты();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаВзаиморасчетовПриИзменении(Элемент)
	
	ОбработатьИзменениеВалютыВзаиморасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УстановитьПараметрыВыбораОрганизацияКонтрагент(Элемент.Имя);
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект,
			Элемент, Объект, Элемент.Имя, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
																   
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    
    УстановитьПараметрыВыбораОрганизацияКонтрагент(Элемент.Имя);
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект,
		Элемент, Объект, Элемент.Имя, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
                                                               
КонецПроцедуры

&НаКлиенте
Процедура АналитикаОчистка(Элемент, СтандартнаяОбработка)
	
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, 
			Объект, Элемент.Имя, СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.БанковскийСчет = ВыбранноеЗначение;
	Модифицированность = Истина;
	ОбновитьКонтролируемыеРеквизиты("БанковскийСчет", ЭтотОбъект);
	БанковскийСчетПриИзмененииНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетОчистка(Элемент, СтандартнаяОбработка)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	
	БанковскийСчетПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если Объект.Контрагент = КонтролируемыеРеквизиты.Контрагент Тогда
		Возврат;
	КонецЕсли;

	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетПолучателяПриИзменении(Элемент)
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.БанковскийСчетПолучателя);
	
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	КассаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбработатьИзменениеПериодаРассчетов();
		
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеСуммыПриИзменении(Элемент)
	
	ПланированиеСуммыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВалютыИКурсПлатежаНажатие(Элемент)
				
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПросмотр",          		 ТолькоПросмотр);
	ПараметрыФормы.Вставить("ВалютаДокумента",         		 Объект.ВалютаДокумента);
	ПараметрыФормы.Вставить("СуммаДокумента",          		 Объект.СуммаДокумента);
	ПараметрыФормы.Вставить("ВалютаВзаиморасчетов",    		 Объект.ВалютаВзаиморасчетов);
	ПараметрыФормы.Вставить("СуммаВзаиморасчетов",     		 Объект.СуммаВзаиморасчетов);
	ПараметрыФормы.Вставить("КурсЧислительВзаиморасчетов",   Объект.КурсЧислительВзаиморасчетов);
	ПараметрыФормы.Вставить("КурсЗнаменательВзаиморасчетов", Объект.КурсЗнаменательВзаиморасчетов);
	ПараметрыФормы.Вставить("ВалютаРеглУчета",         		 ВалютаРеглУчета);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("ПараметрыФормы", ПараметрыФормы);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДекорацияВалютыИКурсПлатежаНажатиеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ВалютыИКурсПлатежа", ПараметрыФормы, ЭтотОбъект,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура ДекорацияВалютыИКурсПлатежаНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	РезультатыОбработки = Новый Структура;
		
	ПараметрыФормы = ДополнительныеПараметры.ПараметрыФормы;
	
	ИзмененныеРеквизиты = Новый Массив;
	Для каждого КлючИЗначение Из Результат Цикл
		Если КлючИЗначение.Значение <> ПараметрыФормы[КлючИЗначение.Ключ] Тогда
			ИзмененныеРеквизиты.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	РезультатыОбработки.Вставить("ИзмененныеРеквизиты", ИзмененныеРеквизиты);
	
	ИзмененаСумма = Ложь;
	Если ИзмененныеРеквизиты.Количество() Тогда
		
		Модифицированность = Истина;
		
		Если ИзмененныеРеквизиты.Найти("КурсЧислительВзаиморасчетов") <> Неопределено Тогда
			Объект.КурсЧислительВзаиморасчетов = Результат.КурсЧислительВзаиморасчетов;
		КонецЕсли;
		
		Если ИзмененныеРеквизиты.Найти("КурсЗнаменательВзаиморасчетов") <> Неопределено Тогда
			Объект.КурсЗнаменательВзаиморасчетов = Результат.КурсЗнаменательВзаиморасчетов;
		КонецЕсли;
		
		Если ИзмененныеРеквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			Объект.СуммаДокумента = Результат.СуммаДокумента;
			ИзмененаСумма		  = Истина;
			Если Объект.ВалютаВзаиморасчетов <> Объект.ВалютаДокумента Тогда
				Объект.СуммаВзаиморасчетов = 0;
			Иначе
				Объект.СуммаВзаиморасчетов = Объект.СуммаДокумента;
			КонецЕсли;
		КонецЕсли;
		
		Если ИзмененныеРеквизиты.Найти("СуммаДокумента") <> Неопределено
			И ИзмененныеРеквизиты.Найти("СуммаВзаиморасчетов") = Неопределено Тогда
			РассчитатьСуммуВзаиморасчетов();
		КонецЕсли;
		
		Если ИзмененныеРеквизиты.Найти("СуммаВзаиморасчетов") <> Неопределено
			ИЛИ Объект.СуммаВзаиморасчетов <> Результат.СуммаВзаиморасчетов Тогда
			Объект.СуммаВзаиморасчетов = Результат.СуммаВзаиморасчетов;
		КонецЕсли;
	КонецЕсли;
	
	ДекорацияВалютыИКурсПлатежаНажатиеЗавершениеНаСервере(ИзмененаСумма);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВзаиморасчетовПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СуммаВзаиморасчетов)
		И Объект.ВалютаВзаиморасчетов = Объект.ВалютаДокумента
		И Объект.СуммаВзаиморасчетов <> Объект.СуммаДокумента Тогда
		Объект.СуммаВзаиморасчетов = Объект.СуммаДокумента;
	Иначе
		СуммаВзаиморасчетовПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВариантКурсаДоговораНажатие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Новый Структура;
	ТекущиеДанные.Вставить("ВариантКурсаДоговора", ВариантКурсаДоговора);
	ТекущиеДанные.Вставить("ОбъектРасчетов",	   Объект.ОбъектРасчетов);
	
	ВзаиморасчетыКлиент.РасшифровкаПлатежаВариантКурсаДоговораНажатие(ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КурсЧислительВзаиморасчетовПриИзменении(Элемент)
	
	КурсЧислительВзаиморасчетовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация", Объект.Организация);
	СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
	
	Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		СтруктураОтбора.Вставить("ВалютаВзаиморасчетов", Объект.ВалютаДокумента);
	КонецЕсли;
	
	СтруктураПараметровВыбора = Новый Структура;
	СтруктураПараметровВыбора.Вставить("РежимВыбора", Истина);
	СтруктураПараметровВыбора.Вставить("ДоступныеПорядкиРасчетов", ДоступныеПорядкиРасчетов());
	
	Если ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ПоступлениеДенежныхСредствИзДругойОрганизации") 
		ИЛИ ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствОтДругойОрганизации") Тогда
		
		Если ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствОтДругойОрганизации") Тогда
			СтруктураОтбора.Организация = ОрганизацияПлательщик;
			СтруктураОтбора.Вставить("ОрганизацияПолучатель", Объект.Организация);
		Иначе
			СтруктураОтбора.Вставить("ОрганизацияПолучатель", ОрганизацияПлательщик);
		КонецЕсли;
		
		СтруктураПараметровВыбора.Вставить("Отбор",СтруктураОтбора);
		ОткрытьФорму("Справочник.ДоговорыМеждуОрганизациями.Форма.ФормаВыбора",
			СтруктураПараметровВыбора,
			Элемент,
			Элемент,)
	Иначе
		СтруктураОтбора.Вставить("Контрагент", Объект.Контрагент);
		
		Если ФинансыКлиент.ЭтоРасчетыСКлиентами(ХозОперацияУП) Тогда
			СтруктураПараметровВыбора.Вставить("ТипыДоговоров", ВзаиморасчетыКлиентСервер.ТипыДоговоровСКлиентом());
		Иначе
			СтруктураПараметровВыбора.Вставить("ТипыДоговоров", ВзаиморасчетыКлиентСервер.ТипыДоговоровСПоставщиком());
		КонецЕсли;
		
		СтруктураПараметровВыбора.Вставить("Отбор",СтруктураОтбора);
			ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора",
			СтруктураПараметровВыбора,
			Элемент,
			Элемент,)
	КонецЕсли;

КонецПроцедуры
	
&НаКлиенте
Процедура ОснованиеПлатежаПриИзменении(Элемент)
	
	Объект.СуммаВзаиморасчетов = 0;
	
	Если НЕ ЗначениеЗаполнено(Объект.ОснованиеПлатежа) Тогда
		Объект.ОбъектРасчетов = ПредопределенноеЗначение("Справочник.ОбъектыРасчетов.ПустаяСсылка");
	КонецЕсли;
	
	ОбъектРасчетовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВзаиморасчетыКлиент.ОбъектРасчетовНачалоВыбора(ЭтотОбъект, Элемент, СтандартнаяОбработка, Истина, Объект.ОснованиеПлатежа);

КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПлатежаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ОснованиеПлатежаОбработкаВыбораНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПлатежаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ВзаиморасчетыКлиент.ОбъектРасчетовОснованиеПлатежаАвтоПодбор(ЭтотОбъект, Элементы, Текст, ДанныеВыбора, СтандартнаяОбработка, Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПлатежаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ВзаиморасчетыКлиент.ОбъектРасчетовОснованиеПлатежаАвтоПодбор(ЭтотОбъект, Элементы, Текст, ДанныеВыбора, СтандартнаяОбработка, Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.Подразделение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодтверждающиеДокументы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЛицевыеСчетаСотрудников
	
#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

&НаКлиенте
Процедура КомандаСписок(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		ПредложитьЗаписатьДокумент();
	Иначе
		ОткрытьФормуПланируемоеПоступлениеДС();
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура КомандаНаСогласование(Команда)
	
	Если НЕ ЭтоРежимЗаявки И НЕ Элементы.ФормаКомандаНаСогласование.Заголовок = НСтр("ru='Отозвать';en='Revoke'") Тогда
		ТекстСообщения = НСтр("ru='В режиме списка платежную позицию запрещено отправлять на согласование.';
						  	  |en='In list mode, the position of payment allowed to send for approval.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	Иначе 
		
		Объект.ОтправленНаСогласование = НЕ Объект.ОтправленНаСогласование;
		Попытка			
			Записано = Записать();			
		Исключение			
			Записано = Ложь;			
		КонецПопытки;
		
		Если Записано Тогда			
			Если НЕ Объект.ОтправленНаСогласование Тогда				
				ОчиститьВсеВизы();				
			КонецЕсли;			
		Иначе			
		 	// Объект не удалось записать - возвращаем признак в исходное состояние.
		 	Объект.ОтправленНаСогласование = НЕ Объект.ОтправленНаСогласование;			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкопировать(Команда)
	
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		ТекстСообщения =  НСтр("ru='Объект не записан.';en='The object is not recorded.'");
		Предупреждение(ТекстСообщения, 15);	
	Иначе		
		ПараметрыФормы = Новый Структура;
		Если ЭтоРежимЗаявки Тогда
			ПараметрыФормыПозиции = ПараметрыФормыПриКопировании(Объект.ДокументПланирования);
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыФормыПозиции.ЗначенияЗаполнения);
		Иначе	
			ПараметрыФормы.Вставить("ЗначениеКопирования", Объект.Ссылка);
		КонецЕсли;
		ОткрытьФорму("Документ.бит_кзн_ПозицияПоступления.ФормаОбъекта", ПараметрыФормы);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДокументПоступленияДС(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Данные были изменены. Сохраните изменения.'"); 
		ПоказатьПредупреждение(,ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	НовыеДокументы = СоздатьДокументПоступления();
	
	Для каждого Документ Из НовыеДокументы Цикл
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Документ);
		ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемыСвойства

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область УправлениеДопАналитиками

&НаСервере
Процедура УстановитьВидимостьАналитик()
	
	ПараметрыУстановки = ПараметрыУстановкиСвойствАналитик(ЭтотОбъект);
	бит_Казначейство.УстановитьВидимостьНазначенныхАналитик(ЭтотОбъект, ПараметрыУстановки);	

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПоставляемыхРеквизитов(Значение)
	
	ПараметрыУстановки = ПараметрыУстановкиСвойствАналитик(ЭтотОбъект);
	бит_МеханизмДопИзмерений.ЗаполнитьДопАналитикуПоДаннымДокумента(Объект, Значение, ПараметрыУстановки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыУстановкиСвойствАналитик(Форма, Префикс = "")

	Результат = бит_МеханизмДопИзмеренийКлиентСервер.ПараметрыУстановкиСвойствАналитикПоШаблону(
		Префикс + "Аналитика_", "Аналитика_", "СтатьяОборотов");
		
	Результат.ДопРеквизиты.Вставить("Организация", Форма.Объект.Организация);
	
	Возврат Результат;

КонецФункции
	
#КонецОбласти

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти 

#Область ПлатежиПо275ФЗ

#КонецОбласти 

#Область ПеречисленияВБюджет

#КонецОбласти 

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ЗаполнитьКонтролируемыеРеквизиты(Форма)

	НаборРеквизитов = Новый Структура;
	НаборРеквизитов.Вставить("Организация");
	НаборРеквизитов.Вставить("ОбъектРасчетов");
	НаборРеквизитов.Вставить("БанковскийСчет");
	НаборРеквизитов.Вставить("ВалютаДокумента");
	НаборРеквизитов.Вставить("ФормаОплаты");
	НаборРеквизитов.Вставить("Контрагент");
	НаборРеквизитов.Вставить("ДатаПлан");
	НаборРеквизитов.Вставить("ДатаПланКрайняя");
	
	ЗаполнитьЗначенияСвойств(НаборРеквизитов, Форма.Объект);
	
	Форма.КонтролируемыеРеквизиты = Новый ФиксированнаяСтруктура(НаборРеквизитов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ОбновитьКонтролируемыеРеквизиты(ИмяРеквизита, Форма)
	
	НаборРеквизитов = Новый Структура;
	Для каждого КлючЗначение Из Форма.КонтролируемыеРеквизиты Цикл
		НаборРеквизитов.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла; 
	НаборРеквизитов.Вставить(ИмяРеквизита, Форма.Объект[ИмяРеквизита]);
	
	Форма.КонтролируемыеРеквизиты = Новый ФиксированнаяСтруктура(НаборРеквизитов);	
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьЗаголовокФормыДокумента()

	НомерДата			 = "";
	ПредставлениеОбъекта = "";
	
	РеквизитыЗаявки = Новый Структура("Номер, Дата", "", '0001-01-01');
	Если ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда
		РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументПланирования, "Номер, Дата");
	КонецЕсли;
	
	Если Объект.ВидПлана = Перечисления.бит_кзн_ВидыПланов.Прогноз Тогда  		
		Если ЭтоРежимЗаявки Тогда 			
			ПредставлениеОбъекта = НСтр("ru='Прогноз поступления%1';en='Forecast revenue%1'"); 			
		Иначе				
			ПредставлениеОбъекта = НСтр("ru='Позиция поступления%1';en='Revenue position%1'"); 			
		КонецЕсли; 	
		НомерДата = НомерДата(Объект.Ссылка, Объект.Номер, Объект.Дата);
	ИначеЕсли Объект.ВидПлана = Перечисления.бит_кзн_ВидыПланов.План Тогда	 		
		Если ЭтоРежимЗаявки Тогда 			
			ПредставлениеОбъекта = НСтр("ru='Планируемое поступление средств%1';en='Planned Receipt%1'");
			НомерДата = НомерДата(Объект.Ссылка, РеквизитыЗаявки.Номер, Объект.Дата);
		Иначе    			
			ПредставлениеОбъекта = НСтр("ru='Позиция поступления%1';en='Revenue position%1'");
			НомерДата = НомерДата(Объект.Ссылка, Объект.Номер, Объект.Дата);
		КонецЕсли;  
	ИначеЕсли ЭтоЗаявкаНаПеремещение Тогда  		
		ПредставлениеОбъекта =  НСтр("ru='Заявка на перемещение денежных средств%1';en='Application for the movement of funds%1'");
		НомерДата = НомерДата(Объект.Ссылка, РеквизитыЗаявки.Номер, Объект.Дата);
	ИначеЕсли ЭтоЗаявкаНаПереводСредств Тогда   		
		ПредставлениеОбъекта =  НСтр("ru='Заявка на перевод денежных средств в другую организацию%1';
								 |en='Application for transfer of funds to another organization%1'");
		НомерДата = НомерДата(Объект.Ссылка, РеквизитыЗаявки.Номер, Объект.Дата);
	КонецЕсли;  	
	ПредставлениеОбъекта = СтрШаблон(ПредставлениеОбъекта, НомерДата);
	
	ПараметрыЗаголовка = Новый Структура;
	ПараметрыЗаголовка.Вставить("ПредставлениеОбъекта",ПредставлениеОбъекта);
	ПараметрыЗаголовка.Вставить("СтрокаВидаОперации", "");
	ПараметрыЗаголовка.Вставить("ЭтоНовый", 		  Параметры.Ключ.Пустая());
	ПараметрыЗаголовка.Вставить("ДокументПроведен",   Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиентСервер.УстановитьЗаголовокФормыДокумента(ЭтотОбъект, ПараметрыЗаголовка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ИзмеренияДоп"      , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним"));
	КэшЗначений.Вставить("НастройкиИзмерений", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НомерДата(Ссылка, Номер, Дата)

	НомерДата = "";
	Если ЗначениеЗаполнено(Ссылка) Тогда
		НомерДата = " " + НСтр("ru = '%1 от %2'");
		НомерДата = СтрШаблон(НомерДата, Номер, Дата);
	КонецЕсли;
	
	Возврат НомерДата;

КонецФункции

&НаСервере
Процедура ФормаОплатыПриИзмененииНаСервере()

	Если НЕ ЗначениеЗаполнено(Объект.ФормаОплаты) Тогда
		Объект.ФормаОплаты = КонтролируемыеРеквизиты.ФормаОплаты; 
	КонецЕсли; 

	Если КонтролируемыеРеквизиты.ФормаОплаты = Объект.ФормаОплаты Тогда
		Возврат;
	КонецЕсли; 
	
	УправлениеФормой();
	ЗаполнитьКонтролируемыеРеквизиты(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция ПараметрыУстановитьСтавкуНДС()

	ПараметрыУстановки = Новый Структура;
	ПараметрыУстановки.Вставить("СтавкаНДС", 			  Неопределено);
	ПараметрыУстановки.Вставить("СтатьяОборотов", 		  Неопределено);
	ПараметрыУстановки.Вставить("СтавкаНДСДоговора", 	  Неопределено);
	ПараметрыУстановки.Вставить("ОперацияБезНДС", 		  Ложь);
	ПараметрыУстановки.Вставить("ПричинаИзмененияСтатья", Ложь);
	
	Возврат ПараметрыУстановки; 

КонецФункции

&НаСервере
Процедура УстановитьСтавкуНДС(ПараметрыОбъекта)
	
	Если ПараметрыОбъекта.ОперацияБезНДС Тогда
		ПараметрыОбъекта.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	Иначе	
		Если ЗначениеЗаполнено(ПараметрыОбъекта.СтатьяОборотов) И ПараметрыОбъекта.ПричинаИзмененияСтатья Тогда
			ПараметрыОбъекта.СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОбъекта.СтатьяОборотов, "СтавкаНДС");
		КонецЕсли; 
		Если ЗначениеЗаполнено(ПараметрыОбъекта.СтавкаНДСДоговора) Тогда
			ПараметрыОбъекта.СтавкаНДС = ПараметрыОбъекта.СтавкаНДСДоговора;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуНДС()
	
	ЗначениеСтавки  = бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(Объект.СтавкаНДС);
	Объект.СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Объект.СуммаДокумента, 
						Истина, Истина, ЗначениеСтавки);

КонецПроцедуры
					
&НаСервере
Функция СоздатьДокументПоступления()
	
	ДанныеЗаполнения = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.НовыеПараметрыДокументаСоздатьПлатежныеДокументы(); 
	ДанныеЗаполнения.Дата = Объект.ДатаПлан;
	
	НоваяСтрока = ДанныеЗаполнения.Позиции.Добавить();
	НоваяСтрока.Позиция = Объект.Ссылка;	

	Результат = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.СоздатьДокументыНаОсновеВыделенных(
					Объект.ДокументПланирования, ДанныеЗаполнения);
					
	УстановитьСсылкиНаДокументыОплаты();
	
	Возврат Результат.ВыгрузитьКолонку("ДокументОплаты");

КонецФункции

&НаСервере
Процедура СтатьяОборотовПриИзмененииНаСервере(ИзменитьСтавкуНДС = Истина)

	УстановитьВидимостьАналитик();
	ПриИзмененииПоставляемыхРеквизитов(Объект.СтатьяОборотов);
	Если ИзменитьСтавкуНДС Тогда
		ПараметрыОбъекта = ПараметрыУстановитьСтавкуНДС();
		ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
		ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, ЭтотОбъект);
		ПараметрыОбъекта.ПричинаИзмененияСтатья = ИзменитьСтавкуНДС;
		УстановитьСтавкуНДС(ПараметрыОбъекта);
		Объект.СтавкаНДС = ПараметрыОбъекта.СтавкаНДС;
		РассчитатьСуммуНДС();
	КонецЕсли;

КонецПроцедуры

//  Выполняет очистку виз документа. 
//
&НаСервере
Процедура ОчиститьВсеВизы()
	
	Если ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда		
		бит_ВизированиеСервер.ОчиститьВсеВизыБезусловно(Объект.ДокументПланирования);		
	КонецЕсли; 
	
КонецПроцедуры // ОчиститьВсеВизы()

&НаСервере
Процедура УстановитьСсылкиНаДокументыОплаты()

	ДокументыОплаты = НайтиДокументыОплаты();
	
	ЭлементыКУдалению = Новый Массив;
	Для каждого Элемент Из Элементы.ГруппаДокументыПоступления.ПодчиненныеЭлементы Цикл
		ЭлементыКУдалению.Добавить(Элемент);
	КонецЦикла;
	
	Для каждого Элемент Из ЭлементыКУдалению Цикл
		Элементы.Удалить(Элемент);	
	КонецЦикла;

	Индекс = 1;
	Для Каждого Документ Из ДокументыОплаты Цикл
		ИмяЭлемента = "Документ" + Индекс;
		Элемент = ЭтотОбъект.Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Элементы.ГруппаДокументыПоступления);
		Элемент.Гиперссылка = Истина;
		Элемент.Заголовок = Документ.Ссылка;
		Элемент.РастягиватьПоГоризонтали = Истина;
		Элемент.РастягиватьПоВертикали = Ложь;
		Элемент.ВысотаЗаголовка = 1;
		Элемент.УстановитьДействие("Нажатие", "ДокументОплатыНажатие");
		Индекс = Индекс+1;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция НайтиДокументыОплаты()

	ДокументыОплаты = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		ДокументыОплаты = Документы.бит_кзн_ПозицияПоступления.НайтиДокументыОплатыПоПозиции(Объект.Ссылка);
	КонецЕсли;
	
	Возврат ДокументыОплаты;
	
КонецФункции // НайтиДокументыОплаты()

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	ЕстьБанковскиеСчета = (ТипЗнч(Объект.ОбъектРасчетов) <> Тип("СправочникСсылка.СоглашенияСКлиентами")
							 И ТипЗнч(Объект.ОбъектРасчетов) <> Тип("СправочникСсылка.СоглашенияСПоставщиками"));
							 
	РеквизитыДоговора = Новый Структура; 
	РеквизитыДоговора.Вставить("БанковскийСчет");
	РеквизитыДоговора.Вставить("бит_ЦФО");
	РеквизитыДоговора.Вставить("бит_ОсновнаяСтатьяОборотов");
	РеквизитыДоговора.Вставить("бит_Проект");
	РеквизитыДоговора.Вставить("ВалютаВзаиморасчетов");
	
	Если ТипЗнч(Объект.Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
		РеквизитыДоговора.Вставить("ВариантКурсаДоговора");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, 
								Новый ФиксированнаяСтруктура(РеквизитыДоговора));
	КонецЕсли;
						 
	Если НЕ ЗначениеЗаполнено(Объект.ЦФО) 
		И ЗначениеЗаполнено(РеквизитыДоговора.бит_ЦФО) Тогда
		Объект.ЦФО = РеквизитыДоговора.бит_ЦФО; 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.СтатьяОборотов) 
		И ЗначениеЗаполнено(РеквизитыДоговора.бит_ОсновнаяСтатьяОборотов) Тогда
		Если РеквизитыДоговора.бит_ОсновнаяСтатьяОборотов.РасходДоход = Перечисления.бит_РасходДоход.Поступление Тогда
			Объект.СтатьяОборотов = РеквизитыДоговора.бит_ОсновнаяСтатьяОборотов;
			СтатьяОборотовПриИзмененииНаСервере();
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектРасчетов) И ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.ВалютаВзаиморасчетов = РеквизитыДоговора.ВалютаВзаиморасчетов;
		ЗаполнитьКурсВзаиморасчетов();
		РассчитатьСуммуВзаиморасчетов();
		СформироватьКурсЗнаменательТекстом();
		ЗаполнитьВалютуВзаиморасчетовДокумента();
		УстановитьПараметрыВыбораБанковскийСчетКасса();
		Если ТипЗнч(Объект.Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
			ВариантКурсаДоговора = РеквизитыДоговора.ВариантКурсаДоговора;	
		КонецЕсли;
	КонецЕсли;
	
	// Заполним проект из договора.
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ПриИзмененииПоставляемыхРеквизитов(РеквизитыДоговора.бит_Проект);
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ПриИзмененииПоставляемыхРеквизитов(Объект.Договор);
	Иначе
		ПриИзмененииПоставляемыхРеквизитов(Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	КонецЕсли;
			
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораБанковскийСчетПолучателя()
	
	СвязиПараметровВыбора = Новый Массив;
	
	СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент"));
	
	НовыеСвязи = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	Элементы.БанковскийСчетПолучателя.СвязиПараметровВыбора = НовыеСвязи;
		
КонецПроцедуры

//  Процедура устанавливает отборы для аналитик по организации и контрагенту. 
//
// Параметры:
//  ИмяЭлемента - Строка.
//
&НаСервере
Процедура УстановитьПараметрыВыбораОрганизацияКонтрагент(ИмяЭлемента)

	Если ТипЗнч(Объект[ИмяЭлемента]) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		ИЛИ (бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды()
			 И ТипЗнч(Объект[ИмяЭлемента]) = Тип("СправочникСсылка.ДоговорыАренды"))
		ИЛИ ТипЗнч(Объект[ИмяЭлемента]) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
	
		НоваяСвязь1 = Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация");
		НоваяСвязь2 = Новый СвязьПараметраВыбора("Отбор.Контрагент" , "Объект.Контрагент");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь1);
		НовыйМассив.Добавить(НоваяСвязь2);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		Элементы[ИмяЭлемента].СвязиПараметровВыбора = НовыеСвязи;
	
	Иначе 
		
		НовыеСвязи = Новый ФиксированныйМассив(Новый Массив());
		Элементы[ИмяЭлемента].СвязиПараметровВыбора = НовыеСвязи;

	КонецЕсли;	
		
КонецПроцедуры // УстановитьОтборыОрганизацияКонтрагент()


&НаСервере
Процедура УстановитьПараметрыВыбораБанковскийСчетКасса()

	Если ТипЗнч(Объект.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
		ОтборОрганизация = Новый Массив();
		ОтборОрганизация.Добавить(Объект.Организация);
		Если Объект.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию Тогда
			ОтборОрганизация.Добавить(Объект.Организация.ГоловнаяОрганизация);
		КонецЕсли; 
		ПараметрыОтбора = Новый ФиксированныйМассив(ОтборОрганизация);
		ПараметрВыбораОрганизация  = Новый ПараметрВыбора("Отбор.Владелец", ПараметрыОтбора);
		
		// Формирование итогового отбора.
		ОтборИтог = Новый Массив;
		ОтборИтог.Добавить(ПараметрВыбораОрганизация);
		
		Если НЕ ЭтоРежимЗаявки И Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
			ПараметрВыбораВалюта = Новый ПараметрВыбора("Отбор.ВалютаДенежныхСредств", Объект.ВалютаДокумента);		
			ОтборИтог.Добавить(ПараметрВыбораВалюта);	
		КонецЕсли;
		
		НовыеПараметры = Новый ФиксированныйМассив(ОтборИтог);

	Иначе	
		НовыеПараметры = бит_Казначейство.УстановитьОтборыДляБанковскихСчетовКасс(Объект.Организация, 
							Объект.ВалютаДокумента, Объект.ДокументПланирования, ВалютаРеглУчета);
	КонецЕсли;
	
	Элементы.БанковскийСчет.ПараметрыВыбора = НовыеПараметры;
	Элементы.Касса.ПараметрыВыбора			= НовыеПараметры;
	
КонецПроцедуры

// Заполняет данные выбора во время автоподбора аналитики по введенному тексту.
//
// Параметры:
//  ДанныеВыбора - СписокЗначений - Список значений для заполнения.
//  Текст 		 - Строка - Текст, введенный в поле.
//  Отбор 		 - Структура - Отбор по реквизитам справочников договоров.
//  ТипДоговора  - Тип - Тип ссылки договора.
//
&НаСервереБезКонтекста
Процедура АналитикаПолучениеДанныхВыбора(ДанныеВыбора, Текст, Отбор, ТипДоговора)
	
	ДанныеВыбора = Новый СписокЗначений;
	бит_МеханизмДопИзмерений.ЗаполнитьДанныеВыбораАналитикиДоговоров(ДанныеВыбора, Текст, Отбор, ТипДоговора);
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
		
	Объект.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
	Объект.Договор		  = Неопределено;
		
	УстановитьПараметрыВыбораБанковскийСчетПолучателя();
	УправлениеФормой();
	
	Если НЕ СчетСоответствуетВладельцу() Тогда
		Объект.БанковскийСчетПолучателя = Неопределено;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчетПолучателя) Тогда
		Объект.БанковскийСчетПолучателя =
				Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(Объект.Контрагент, Объект.ВалютаДокумента);		
	КонецЕсли;
		
	
	ОбновитьКонтролируемыеРеквизиты("Контрагент", ЭтотОбъект);
	ОбновитьКонтролируемыеРеквизиты("ОбъектРасчетов", ЭтотОбъект);
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.Контрагент);
	ПриИзмененииПоставляемыхРеквизитов(Объект.ОбъектРасчетов);
	ПриИзмененииПоставляемыхРеквизитов(Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	ПриИзмененииПоставляемыхРеквизитов(Объект.БанковскийСчетПолучателя);
	
КонецПроцедуры

&НаСервере
Функция ХозяйственнаяОперацияУП()

	Возврат бит_Казначейство.ХозяйственнаяОперацияУП(ХозяйственнаяОперация);
	
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере(СтандартнаяОбработка = Ложь)

	ЗаполнитьКэшЗначений();
	
	Пользователь       = Пользователи.ТекущийПользователь();
	РазрешеноПроводить = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(Пользователь, 
							ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноПроводитьПланируемыеПоступленияДС);
							
	ЭтоЗаявкаНаПеремещение	  	= ТипЗнч(Объект.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств");
	ЭтоЗаявкаНаПереводСредств 	= ТипЗнч(Объект.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию");
	ЭтоПланируемоеПоступление = НЕ ЭтоЗаявкаНаПеремещение И НЕ ЭтоЗаявкаНаПереводСредств;
	
	УстановитьЭтоРежимЗаявки();
	
	Если ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда		
		НомерЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументПланирования, "Номер");		
	КонецЕсли;
	
	ХозОперацияУП = ХозяйственнаяОперацияУП();
	
	ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПоступлениеОплатыОтКлиента;
	Если ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда
		ЕстьВидОперации = ОбщегоНазначения.ЕстьРеквизитОбъекта("ХозяйственнаяОперация", Объект.ДокументПланирования.Метаданные());
		Если ЕстьВидОперации Тогда
			ХозяйственнаяОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументПланирования, "ХозяйственнаяОперация");	
		КонецЕсли;
	КонецЕсли;
	
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();

	Если ХозОперацияУП = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации
		Или ХозОперацияУП = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации
	Тогда
		СтруктураРеквизитов = Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(Объект.БанковскийСчет);
		Если ЗначениеЗаполнено(СтруктураРеквизитов.Организация) Тогда
			ОрганизацияПлательщик = СтруктураРеквизитов.Организация;
		КонецЕсли;
	КонецЕсли;

	ИспользоватьДоговорыСПоставщиками	   = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками");
	ИспользоватьДоговорыМеждуОрганизациями = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыМеждуОрганизациями");
	ИспользоватьДоговорыСКлиентами		   = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	ИспользоватьПодразделения			   = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");

	ЗаполнитьКурсВзаиморасчетов(Истина);
	
	// Найти документы оплаты если таковые имеются.
	УстановитьСсылкиНаДокументыОплаты();
	
	УстановитьПараметрыВыбораБанковскийСчетКасса();
	
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияНаФорме(ЭтотОбъект,
		КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
		
	УстановитьВидимостьАналитик();
	
	ЗаполнитьКонтролируемыеРеквизиты(ЭтотОбъект);
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	УправлениеФормой();
	
	УстановитьСостояниеДокумента();
	УстановитьЗаголовокФормыДокумента();
	
	ЗаполнитьВалютуВзаиморасчетовДокумента();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭтоРежимЗаявки()
	
	Перем РезультатПоиска;
	
	Если ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда
		Если ТипЗнч(Объект.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
			РезультатПоиска = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(Объект.ДокументПланирования);
			Если РезультатПоиска.КоличествоПозиций = 0 Тогда
				ЭтоРежимЗаявки = Истина;
			Иначе	
				Если ЗначениеЗаполнено(Объект.Ссылка) И РезультатПоиска.КоличествоПозиций = 1 Тогда
					ЭтоРежимЗаявки = Истина;
				Иначе	
					ЭтоРежимЗаявки = Ложь;
				КонецЕсли;
			КонецЕсли;
		Иначе	
			ЭтоРежимЗаявки = Ложь;
		КонецЕсли;
	Иначе	
		ЭтоРежимЗаявки = Истина;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Функция ДоступныеПорядкиРасчетов()
	
	СписокПорядков = Новый СписокЗначений;
	СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказам"));
	СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным"));
	СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным"));
	СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамНакладным"));
	Если ХозОперацияУП = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика")
		ИЛИ ХозОперацияУП = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации") Тогда
		СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов"));
	КонецЕсли;
	Возврат СписокПорядков;
	
КонецФункции

&НаСервере
Процедура ДатаПриИзмененииНаСервере()

	УправлениеФормой();	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
		
	Если КонтролируемыеРеквизиты.Организация <> Объект.Организация Тогда
		Объект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
		Объект.Касса 		  = Справочники.Кассы.ПустаяСсылка();
		Объект.ОбъектРасчетов = Неопределено;
		Объект.Договор		  = Неопределено;
		
		ОбновитьКонтролируемыеРеквизиты("ОбъектРасчетов", ЭтотОбъект);
		ОбновитьКонтролируемыеРеквизиты("БанковскийСчет", ЭтотОбъект);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Если Объект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
			
			ПараметрыПередачи = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
			ПараметрыПередачи.Организация    = Объект.Организация;
			ПараметрыПередачи.ФормаОплаты	 = Перечисления.ФормыОплаты.Безналичная;
			ПараметрыПередачи.БанковскийСчет = Объект.БанковскийСчет;
			
			Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
				ПараметрыПередачи.Валюта = Объект.ВалютаДокумента;
			КонецЕсли;
			Объект.БанковскийСчет = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ПараметрыПередачи);
			ОбновитьКонтролируемыеРеквизиты("БанковскийСчет", ЭтотОбъект);
		Иначе	
			
			ПараметрыПередачи = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
			ПараметрыПередачи.Организация = Объект.Организация;
			ПараметрыПередачи.ФормаОплаты = Перечисления.ФормыОплаты.Наличная;
			ПараметрыПередачи.Касса       = Объект.Касса;
			Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
				ПараметрыПередачи.Валюта = Объект.ВалютаДокумента;
			КонецЕсли;
			Объект.Касса = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(ПараметрыПередачи);
		КонецЕсли;
	КонецЕсли;

	ВзаиморасчетыСервер.ФормаПриИзмененииРеквизитов(ЭтотОбъект, "Организация");

	УстановитьПараметрыВыбораБанковскийСчетКасса();
		
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаписатьДокумент()

	Оповещение 	   = Новый ОписаниеОповещения("ПредложитьЗаписатьДокументЗавершение", ЭтотОбъект);
	ТекстСообщения = НСтр("ru='Для перехода в режим списка необходимо записать документ.';
							  |en='To go to the list mode you want to record the document.'");

	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПредложитьЗаписатьДокументЗавершение(Результат, Дополнительно) Экспорт

	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	Если ПроверитьЗаполнение() Тогда
		Попытка
			Записать();		
		Исключение
			ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки; 
		ОткрытьФормуПланируемоеПоступлениеДС();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбъектРасчетовОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	ДополнитьВыбранноеЗначение(ВыбранноеЗначение);

	// Известные свойства.
	ИсключаяСвойства = Новый Массив;
	ИсключаяСвойства.Добавить("Дата");
	ИсключаяСвойства.Добавить("Номер");
	ИсключаяСвойства.Добавить("СтавкаНДС");
	ИсключаяСвойства.Добавить("СуммаНДС");
	
	Индекс = ИсключаяСвойства.ВГраница();
	Пока Индекс >= 0 Цикл
		Если НЕ ВыбранноеЗначение.Свойство(ИсключаяСвойства[Индекс]) Тогда
			ИсключаяСвойства.Удалить(Индекс);		
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение, , СтрСоединить(ИсключаяСвойства, ","));
		
	ОбновитьКонтролируемыеРеквизиты("ОбъектРасчетов", ЭтотОбъект);
	Модифицированность = Истина;
		
	ДоговорПриИзмененииНаСервере();
	
	ПараметрыОбъекта = ПараметрыУстановитьСтавкуНДС();
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, ЭтотОбъект);
	ПараметрыОбъекта.СтавкаНДСДоговора = ВыбранноеЗначение.СтавкаНДС;
	
	УстановитьСтавкуНДС(ПараметрыОбъекта);
	Объект.СтавкаНДС = ПараметрыОбъекта.СтавкаНДС;
	
	ВалютаДляСравнения = ВалютаПланированияДенежныхСредств();
	Если КонтролируемыеРеквизиты.ВалютаДокумента <> ВалютаДляСравнения Тогда
		Объект.ВалютаДокумента = ВалютаДляСравнения;
		ОбработатьИзмененииВалюты();
	Иначе
		ЗаполнитьКурсВзаиморасчетов();
		РассчитатьСуммуВзаиморасчетов();
		ЗаполнитьВалютуВзаиморасчетовДокумента();
	КонецЕсли;

	УстановитьПараметрыВыбораБанковскийСчетКасса();
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.ОбъектРасчетов);
	
КонецПроцедуры

&НаСервере
Процедура ОбъектРасчетовПриИзмененииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектРасчетов) Тогда
		Объект.Договор = Неопределено;	
		ДоговорПриИзмененииНаСервере();
	КонецЕсли;
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.ОбъектРасчетов);
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура ДополнитьВыбранноеЗначение(ВыбранноеЗначение)
		
	ВыбранноеЗначение.Вставить("СтавкаНДС");
	ВыбранноеЗначение.Вставить("СуммаНДС");
	
	Если НЕ ОперацияБезНДС Тогда
		ОбъектыРасчетов = Новый Массив;
		ОбъектыРасчетов.Добавить(ВыбранноеЗначение.ОбъектРасчетов);
		
		ТаблицаНДС = ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(Объект.Организация, Неопределено, 
		Неопределено, ОбъектыРасчетов, ВыбранноеЗначение.ЭтоРасчетыСКлиентами);
		Если ТаблицаНДС.Количество() = 1 Тогда
			ВыбранноеЗначение.Вставить("СтавкаНДС", ТаблицаНДС[0].СтавкаНДС);
			Если ВыбранноеЗначение.СуммаПлатежа = ВыбранноеЗначение.СуммаЗаказа Тогда
				ВыбранноеЗначение.Вставить("СуммаНДС", ТаблицаНДС[0].СуммаНДС);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение.ВалютаВзаиморасчетов) Тогда
		КурсВалюты = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(ВыбранноеЗначение.ВалютаВзаиморасчетов, Неопределено, ВалютаРеглУчета);
		ВыбранноеЗначение.Вставить("КурсЧислительВзаиморасчетов", КурсВалюты.КурсЧислитель);
		ВыбранноеЗначение.Вставить("КурсЗнаменательВзаиморасчетов", КурсВалюты.КурсЗнаменатель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура БанковскийСчетПриИзмененииНаСервере()
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.БанковскийСчет);
	
	Объект.ВалютаДокумента = ВалютаПланированияДенежныхСредств();
	ОбработатьИзмененииВалюты();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура КассаПриИзмененииНаСервере()
	
	ПриИзмененииПоставляемыхРеквизитов(Объект.Касса);
	Объект.ВалютаДокумента = ВалютаПланированияДенежныхСредств();
	ОбработатьИзмененииВалюты();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Функция СчетСоответствуетВладельцу()
	
	Результат = Справочники.БанковскиеСчетаКонтрагентов.ПроверитьВладельцаБанковскогоСчета(
			Объект.БанковскийСчетПолучателя, Объект.Контрагент);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПараметрыФормыПриКопировании(ДокументПланирования)

	Возврат Документы.бит_кзн_ПозицияПоступления.ПараметрыФормыПриКопировании(ДокументПланирования);

КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеПериодаРассчетов()
	
	ТекущаяДатаПлан = Объект.ДатаПлан;
	
	Если ЗначениеЗаполнено(Объект.ДатаПлан) Тогда		
		ПараметрыПроверки = бит_КазначействоКлиентСервер.НовыеПараметрыПериодЗаданКорректно();
		ПараметрыПроверки.ПоляОбъекта.ДатаНачала	= "Дата";
		ПараметрыПроверки.ПоляОбъекта.ДатаОкончания = "ДатаПлан";
		
		ПараметрыПроверки.ПоляФормы.ДатаНачала	  = НСтр("ru = 'Дата'; en = 'Date'");
		ПараметрыПроверки.ПоляФормы.ДатаОкончания = НСтр("ru = 'Дата платежа'; en = 'Payment Date'");
		
		ПериодЗаданКорректно = бит_КазначействоКлиентСервер.ПериодЗаданКорректно(Объект, ПараметрыПроверки);
		Если НЕ ПериодЗаданКорректно Тогда
			Объект.ДатаПлан = Объект.Дата;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ДатаПлан) И КонтролируемыеРеквизиты.ДатаПлан <> Объект.ДатаПлан Тогда
		ПараметрыПроверки = бит_КазначействоКлиентСервер.НовыеПараметрыПериодЗаданКорректно();
		ПараметрыПроверки.ПоляОбъекта.ДатаНачала	= "Дата";
		ПараметрыПроверки.ПоляОбъекта.ДатаОкончания = "ДатаПлан";
		
		ПараметрыПроверки.ПоляФормы.ДатаНачала	  = НСтр("ru = 'Дата'; en = 'Date'");
		ПараметрыПроверки.ПоляФормы.ДатаОкончания = НСтр("ru = 'Дата платежа'; en = 'Payment Date'");
		
		ПериодЗаданКорректно = бит_КазначействоКлиентСервер.ПериодЗаданКорректно(Объект, ПараметрыПроверки);
		Если НЕ ПериодЗаданКорректно Тогда
			Объект.ДатаПлан = Объект.Дата;
		КонецЕсли;

		Если ЗначениеЗаполнено(Объект.ДатаПланКрайняя) Тогда
			РазностьДат = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(КонтролируемыеРеквизиты.ДатаПлан, Объект.ДатаПлан, "День");
			Объект.ДатаПланКрайняя = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(
										КонтролируемыеРеквизиты.ДатаПланКрайняя, РазностьДат, "День");
			ОбновитьКонтролируемыеРеквизиты("ДатаПланКрайняя", ЭтотОбъект);							
		КонецЕсли;

		Если КонтролируемыеРеквизиты.ДатаПлан <> Объект.ДатаПлан Тогда
			УправлениеФормой();
		КонецЕсли;

		ОбновитьКонтролируемыеРеквизиты("ДатаПлан", ЭтотОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаПланКрайняя) И КонтролируемыеРеквизиты.ДатаПланКрайняя <> Объект.ДатаПланКрайняя Тогда
		
		ПараметрыПроверки = бит_КазначействоКлиентСервер.НовыеПараметрыПериодЗаданКорректно();
		ПараметрыПроверки.ПоляОбъекта.ДатаНачала	= "ДатаПлан";
		ПараметрыПроверки.ПоляОбъекта.ДатаОкончания = "ДатаПланКрайняя";
		
		ПараметрыПроверки.ПоляФормы.ДатаНачала	  = НСтр("ru = 'Дата платежа'; en = 'Payment Date'");
		ПараметрыПроверки.ПоляФормы.ДатаОкончания = НСтр("ru = 'Не позднее'; en = 'on or before'");
		
		ПериодЗаданКорректно = бит_КазначействоКлиентСервер.ПериодЗаданКорректно(Объект, ПараметрыПроверки);
		Если НЕ ПериодЗаданКорректно Тогда
			Объект.ДатаПланКрайняя = КонтролируемыеРеквизиты.ДатаПланКрайняя;
		КонецЕсли;

		ОбновитьКонтролируемыеРеквизиты("ДатаПланКрайняя", ЭтотОбъект);
	КонецЕсли;	
		
	Если Объект.ДатаПлан <> ТекущаяДатаПлан Тогда
		ЗаполнитьКурсВзаиморасчетов();
		РассчитатьСуммуВзаиморасчетов();
		ЗаполнитьВалютуВзаиморасчетовДокумента();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораБанковскогоСчетаКассыПолучателя()

	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("ХозяйственнаяОперация", ХозОперацияУП);
	ДанныеОбъекта.Вставить("ОрганизацияПолучатель", Объект.ОрганизацияПолучатель);
	ДанныеОбъекта.Вставить("Организация", 			Объект.Организация);
	ДанныеОбъекта.Вставить("ПланированиеСуммы", 	Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов);

	ДенежныеСредстваСервер.УстановитьПараметрыВыбораБанковскогоСчетаКассыПолучателя(ДанныеОбъекта, Элементы.БанковскийСчетПолучатель);
	ДенежныеСредстваСервер.УстановитьПараметрыВыбораБанковскогоСчетаКассыПолучателя(ДанныеОбъекта, Элементы.КассаПолучатель);

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененииВалюты()

	ИзмениласьВалюта = КонтролируемыеРеквизиты.ВалютаДокумента <> Объект.ВалютаДокумента;
	Если НЕ ИзмениласьВалюта Тогда
		Возврат;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов Тогда
			Объект.ВалютаВзаиморасчетов = Объект.ВалютаДокумента;
			Объект.КурсЧислительВзаиморасчетов = 1;
			Объект.КурсЗнаменательВзаиморасчетов = 1;
			Объект.СуммаДокумента = Объект.СуммаВзаиморасчетов;
		Иначе
			Если НЕ ЗначениеЗаполнено(Объект.ОбъектРасчетов) И НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
				Объект.ВалютаВзаиморасчетов			 = Объект.ВалютаДокумента;
				Объект.КурсЧислительВзаиморасчетов	 = 1;
				Объект.КурсЗнаменательВзаиморасчетов = 1;
				Объект.СуммаДокумента				 = Объект.СуммаВзаиморасчетов;
			Иначе	
				РасшифровкаПлатежа.Очистить();
				НоваяСтрока = РасшифровкаПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Объект);
				НоваяСтрока.Сумма = Объект.СуммаДокумента;
				
				Контекст = Новый Структура;
				Контекст.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
				Контекст.Вставить("СуммаДокумента", 	Объект.СуммаДокумента);
				Контекст.Вставить("Дата",				Объект.ДатаРасхода);
				
				ДенежныеСредстваСервер.ПересчетСуммДокументаВВалюту(Контекст, КонтролируемыеРеквизиты.ВалютаДокумента, 
					Объект.ВалютаДокумента);
					
				Объект.СуммаДокумента = Контекст.СуммаДокумента;
				
				ЗаполнитьКурсВзаиморасчетов();
				ЗаполнитьКурсКратностьТекстом();
				ЗаполнитьВалютуВзаиморасчетовДокумента();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбработатьИзмененииСуммыДокумента(Истина);
	
	ОбновитьКонтролируемыеРеквизиты("ВалютаДокумента", ЭтотОбъект);
	УстановитьПараметрыВыбораБанковскийСчетКасса();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененииСуммыДокумента(ИзмененаВалюта = Ложь)
	
	Если НЕ ОперацияБезНДС Тогда
		РассчитатьСуммуНДС();
	КонецЕсли;
	
	Если НЕ ИзмененаВалюта Тогда
		ЗаполнитьКурсВзаиморасчетов();
		РассчитатьСуммуВзаиморасчетов();
		ЗаполнитьВалютуВзаиморасчетовДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКурсВзаиморасчетов(ТолькоДанныеФормы = Ложь)

	ПараметрыЗаполнения = ДенежныеСредстваСервер.ПараметрыЗаполненияКурсаИКратности();

	ПараметрыЗаполнения.Валюта 				 = Объект.ВалютаДокумента;
	ПараметрыЗаполнения.Договор				 = Объект.Договор;
	ПараметрыЗаполнения.ВалютаВзаиморасчетов = Объект.ВалютаВзаиморасчетов;
	
	ПараметрыЗаполнения.ВалютаРегламентированногоУчета = ВалютаРеглУчета;
	ПараметрыЗаполнения.Дата						   = Объект.ДатаПлан;
	
	Данные = Новый Структура;
	Данные.Вставить("КурсЧислительВзаиморасчетов",  0);
	Данные.Вставить("КурсЗнаменательВзаиморасчетов",0);
	Данные.Вставить("ВариантКурсаДоговора", 		Перечисления.ВариантыКурсаДоговора.ПустаяСсылка());
	Данные.Вставить("ТипОбъектаРасчетов", 			Перечисления.ТипыОбъектовРасчетов.ПустаяСсылка());
	
	ЗаполнитьЗначенияСвойств(Данные, Объект);
	ЗаполнитьЗначенияСвойств(Данные, ЭтотОбъект);
	
	ДенежныеСредстваСервер.ЗаполнитьКурсИКратностьВСтрокеРасшифровки(Данные, ПараметрыЗаполнения);
	
	Если ТолькоДанныеФормы Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Данные, "ВариантКурсаДоговора");
	Иначе	
		ЗаполнитьЗначенияСвойств(Объект, Данные);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Данные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуВзаиморасчетов()
	
	Данные = Новый Структура;
	Данные.Вставить("Сумма", 						 Объект.СуммаДокумента);
	Данные.Вставить("КурсЧислительВзаиморасчетов",	 Объект.КурсЧислительВзаиморасчетов);
	Данные.Вставить("КурсЗнаменательВзаиморасчетов", Объект.КурсЗнаменательВзаиморасчетов);
	Данные.Вставить("СуммаВзаиморасчетов",			 Объект.СуммаВзаиморасчетов);
	
	ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
			Данные, Объект.ВалютаДокумента, ВалютаРеглУчета);
			
	Объект.СуммаВзаиморасчетов = Данные.СуммаВзаиморасчетов; 		
		
КонецПроцедуры
		
&НаСервере
Процедура ЗаполнитьВалютуВзаиморасчетовДокумента()
		
	Элементы.ДекорацияВалютыИКурсПлатежа.Заголовок = НадписьВалютыИКурсПлатежа();
	
КонецПроцедуры

&НаСервере
Процедура ПланированиеСуммыПриИзмененииНаСервере()
	
	Объект.ВалютаДокумента = ВалютаПланированияДенежныхСредств();
	ОбработатьИзмененииВалюты();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Функция ВалютаПланированияДенежныхСредств()

	Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
		ВалютаПланирования = Объект.ВалютаДокумента;
		Если Объект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Наличные Тогда
			Если ЗначениеЗаполнено(Объект.Касса) Тогда
				ВалютаПланирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Касса, "ВалютаДенежныхСредств");
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
				ВалютаПланирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.БанковскийСчет, "ВалютаДенежныхСредств");
			КонецЕсли;
		КонецЕсли;
	Иначе
		ВалютаПланирования = Объект.ВалютаВзаиморасчетов;
	КонецЕсли;

	Возврат ВалютаПланирования;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКурсКратностьТекстом()
	
	СформироватьКурсЗнаменательТекстом();
		
КонецПроцедуры

&НаСервере
Процедура ДекорацияВалютыИКурсПлатежаНажатиеЗавершениеНаСервере(Знач ИзмененаСумма)
	
	ЗаполнитьКурсКратностьТекстом();
	ЗаполнитьВалютуВзаиморасчетовДокумента();
	
	Если ИзмененаСумма Тогда
		ОбработатьИзмененииСуммыДокумента(Истина);
		ОбновитьКонтролируемыеРеквизиты("СуммаДокумента", ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СуммаВзаиморасчетовПриИзмененииНаСервере()
	
	ТекущаяСуммаДокумента = Объект.СуммаДокумента;
	
	Если Объект.СуммаДокумента = 0 Тогда
		Если Объект.ВалютаДокумента = ВалютаРеглУчета Тогда
			Если Объект.КурсЗнаменательВзаиморасчетов <> 0 Тогда
				Объект.СуммаДокумента = Объект.СуммаВзаиморасчетов * Объект.КурсЧислительВзаиморасчетов / Объект.КурсЗнаменательВзаиморасчетов;
			Иначе
				Объект.СуммаДокумента = 0;
			КонецЕсли;
		Иначе
			Если Объект.КурсЧислительВзаиморасчетов <> 0 Тогда
				Объект.СуммаДокумента = Объект.СуммаВзаиморасчетов / Объект.КурсЧислительВзаиморасчетов * Объект.КурсЗнаменательВзаиморасчетов;
			Иначе
				Объект.СуммаДокумента = 0;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Объект.ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
			
			Объект.КурсЧислительВзаиморасчетов = 1;
			
		ИначеЕсли Объект.ВалютаДокумента = ВалютаРеглУчета Тогда
			Если Объект.СуммаВзаиморасчетов <> 0 Тогда
				Объект.КурсЧислительВзаиморасчетов = Объект.СуммаДокумента / Объект.СуммаВзаиморасчетов * Объект.КурсЗнаменательВзаиморасчетов;
			Иначе
				Объект.КурсЧислительВзаиморасчетов = 1;
			КонецЕсли;
		Иначе
			Если Объект.СуммаДокумента <> 0 Тогда
				Объект.КурсЧислительВзаиморасчетов = Объект.СуммаВзаиморасчетов / Объект.СуммаДокумента * Объект.КурсЗнаменательВзаиморасчетов;
			Иначе
				Объект.КурсЧислительВзаиморасчетов = 0;
			КонецЕсли;
		КонецЕсли;
		СформироватьКурсЗнаменательТекстом();
	КонецЕсли;
	
	Если Объект.СуммаДокумента <> ТекущаяСуммаДокумента Тогда
		ОбработатьИзмененииСуммыДокумента(Истина);	
	КонецЕсли;
	
	ЗаполнитьВалютуВзаиморасчетовДокумента();
		
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеВалютыВзаиморасчетов()

	Объект.ВалютаДокумента = ВалютаПланированияДенежныхСредств();
	
	ЗаполнитьКурсВзаиморасчетов();
	
	РассчитатьСуммуВзаиморасчетов();
	СформироватьКурсЗнаменательТекстом();
	ЗаполнитьВалютуВзаиморасчетовДокумента();

	ОбновитьКонтролируемыеРеквизиты("ВалютаДокумента", ЭтотОбъект);
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура КурсЧислительВзаиморасчетовПриИзмененииНаСервере()
	
	РассчитатьСуммуВзаиморасчетов();
	СформироватьКурсЗнаменательТекстом();
	ЗаполнитьВалютуВзаиморасчетовДокумента();
	
КонецПроцедуры

// См. ДенежныеСредстваСервер.НадписьВалютыИКурсПлатежа().
//
&НаСервере
Функция НадписьВалютыИКурсПлатежа()
		
	ШаблонКурса = "(%1 %2 = %3 %4)";
	СтрокиНадписи = Новый Массив;
	СтрокиНадписи.Добавить(НСтр("ru = 'Расчеты';
								|en = 'AR/AP accounting'"));

	СтрокиНадписи.Добавить(Строка(Объект.СуммаВзаиморасчетов));
	СтрокиНадписи.Добавить(Строка(Объект.ВалютаВзаиморасчетов));
		
	Если Объект.КурсЧислительВзаиморасчетов <> 0 Тогда
		Если Объект.ВалютаДокумента = ВалютаРеглУчета Тогда
			
			СтрокиНадписи.Добавить(СтрШаблон(ШаблонКурса,
				Объект.КурсЗнаменательВзаиморасчетов,
				Объект.ВалютаВзаиморасчетов,
				Строка(Формат(Объект.КурсЧислительВзаиморасчетов, "ЧДЦ=4")),
				Объект.ВалютаДокумента));
		Иначе
			СтрокиНадписи.Добавить(СтрШаблон(ШаблонКурса,
				Объект.КурсЗнаменательВзаиморасчетов,
				Объект.ВалютаДокумента,
				Строка(Формат(Объект.КурсЧислительВзаиморасчетов, "ЧДЦ=4")),
				Объект.ВалютаВзаиморасчетов));
		КонецЕсли;
	КонецЕсли;

	Возврат СтрСоединить(СтрокиНадписи, " ");
	
КонецФункции

&НаСервере
Процедура СформироватьКурсЗнаменательТекстом()

	Данные = Новый Структура;
	Данные.Вставить("КурсЗнаменательВзаиморасчетовНадпись", КурсЗнаменательВзаиморасчетовНадпись);
	Данные.Вставить("КурсЧислительВзаиморасчетов", 			Объект.КурсЧислительВзаиморасчетов);
	Данные.Вставить("КурсЗнаменательВзаиморасчетов", 		Объект.КурсЗнаменательВзаиморасчетов);
	Данные.Вставить("ВалютаВзаиморасчетов",					Объект.ВалютаВзаиморасчетов);
	Данные.Вставить("КурсЧислительВзаиморасчетовТекст",		"");
	
	ДенежныеСредстваКлиентСервер.СформироватьКурсЗнаменательТекстом(Данные, Объект.ВалютаДокумента, ВалютаРеглУчета);

	КурсЗнаменательВзаиморасчетовНадпись = Данные.КурсЗнаменательВзаиморасчетовНадпись;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()

	бит_НастройкиДоступностиЭлементовФорм.РазблокироватьЭлементы(ЭтотОбъект);
	
	ДокументВВалюте = Объект.ВалютаДокумента <> ВалютаРеглУчета;
	ОплатаЧерезБанк = (Объект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные);
	ЭтоОперацияБезВалютыВзаиморасчетов = бит_КазначействоКлиентСервер.ЭтоОперацияБезВалютыВзаиморасчетов(ХозяйственнаяОперация);
	
	#Область НДС
	Если ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда
		ОперацияБезНДС = бит_Казначейство.ОперацияБезНДС(ХозяйственнаяОперация);
	Иначе
		ОперацияБезНДС = Ложь;
	КонецЕсли;
	
	Элементы.СтавкаНДС.Видимость = НЕ ОперацияБезНДС;
	Элементы.СуммаНДС.Видимость	 = НЕ ОперацияБезНДС;
	Элементы.ВалютаНДС.Видимость = НЕ ОперацияБезНДС;
	
	Если НЕ ОперацияБезНДС Тогда
		Элементы.СтавкаНДС.Доступность = ЭтоПланируемоеПоступление;
		Элементы.СуммаНДС.Доступность  = ЭтоПланируемоеПоступление;
	КонецЕсли;
	#КонецОбласти 
	
	Если ЭтоПланируемоеПоступление Тогда
	
		ЕстьОснование  = ЗначениеЗаполнено(Объект.ДокументПланирования);
		ЭтоПрогноз     = Объект.ВидПлана = Перечисления.бит_кзн_ВидыПланов.Прогноз;
		
		// Если ввод не списком, показываем номер заявки, а не позиции.
		Элементы.Номер.Видимость 	   = НЕ ЭтоРежимЗаявки;
		Элементы.НомерЗаявки.Видимость = ЭтоРежимЗаявки;
		
		// Устанавливаем видимость команд группы СоздатьНаОсновании.
		Элементы.ФормаВвестиПланируемоеПоступленияДС.Видимость = ЭтоПрогноз;
		Элементы.ФормаВвестиДокументПоступленияДС.Видимость = Не ЭтоПрогноз;
		
		// Не даем возможность выбирать документ планирования.
		Элементы.ДокументПланирования.Видимость = НЕ ЭтоРежимЗаявки;

		// Реквизиты, заполняемые в документе-основании.
		Элементы.Организация.ТолькоПросмотр       = НЕ ЭтоРежимЗаявки;
		Элементы.Контрагент.ТолькоПросмотр        = НЕ ЭтоРежимЗаявки;
		Элементы.ФормаОплаты.ТолькоПросмотр       = НЕ ЭтоРежимЗаявки;
		Элементы.Ответственный.ТолькоПросмотр     = НЕ ЭтоРежимЗаявки;
		Элементы.Инициатор.ТолькоПросмотр         = НЕ ЭтоРежимЗаявки;
		
		#Область Валюты
		ВалютыСовпадают 				   = Объект.ВалютаДокумента = Объект.ВалютаВзаиморасчетов;
		ЗаблокироватьВалюту 			   = Истина;
		ЗаблокироватьВалютуВзаиморасчетов  = Ложь;
		ИсточникВалютыВзаиморасчетовВыбран = ЗначениеЗаполнено(Объект.ОбъектРасчетов) 
										 ИЛИ ЗначениеЗаполнено(Объект.Договор);										 
		
		Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
			ЗаблокироватьВалюту = Истина;
		Иначе	
			Если НЕ ЭтоРежимЗаявки Тогда
				ЗаблокироватьВалюту = Истина;
			Иначе	
				ЗаблокироватьВалюту = ИсточникВалютыВзаиморасчетовВыбран;
			КонецЕсли;
		КонецЕсли;	
		
		Если Объект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов Тогда
			ЗаблокироватьВалютуВзаиморасчетов = Истина;	
		Иначе	
			ЗаблокироватьВалютуВзаиморасчетов = ИсточникВалютыВзаиморасчетовВыбран;
		КонецЕсли;		
		
		Элементы.СуммаВзаиморасчетов.ТолькоПросмотр    			= ВалютыСовпадают;
		Элементы.СуммаВзаиморасчетов.Видимость					= НЕ ЭтоОперацияБезВалютыВзаиморасчетов; 
		Элементы.Валюта.ТолькоПросмотр 							= ЗаблокироватьВалюту;
		Элементы.ВариантКурсаДоговора.Видимость 	   			= НЕ ВалютыСовпадают;
		Элементы.КурсЧислительВзаиморасчетов.Видимость 			= НЕ ВалютыСовпадают;
		Элементы.КурсЗнаменательВзаиморасчетовНадпись.Видимость = НЕ ВалютыСовпадают;
		Элементы.ДекорацияВалютыИКурсПлатежа.Видимость 			= НЕ ВалютыСовпадают;
		Элементы.ВалютаВзаиморасчетов.ТолькоПросмотр 			= ЗаблокироватьВалютуВзаиморасчетов;
		Элементы.ВалютаВзаиморасчетов.Видимость		 			= НЕ ЭтоОперацияБезВалютыВзаиморасчетов;
		Элементы.ПланированиеСуммы.ТолькоПросмотр	 			= ЭтоОперацияБезВалютыВзаиморасчетов ИЛИ НЕ ЭтоРежимЗаявки;
		#КонецОбласти
		
		// Переход в список имеет смысл только если позиция открыта как псевдо-заявка.
		Элементы.ФормаКомандаСписок.Видимость = ЭтоРежимЗаявки;
		
		// Видимость Назначения платежа если позиция открыта как псевдо-заявка.
		Элементы.НазначениеПлатежа.Видимость = ЭтоРежимЗаявки;
		Элементы.НазначениеПлатежаУпр.Видимость = ЭтоРежимЗаявки;
		
		// Видимость Банк/Касса.
		Элементы.БанковскийСчет.Видимость = ОплатаЧерезБанк;
		Элементы.Касса.Видимость 		  = НЕ ОплатаЧерезБанк;
		
		// Видимость Контрагент/Договор.
		Элементы.Контрагент.Видимость = Истина;
				
		Элементы.ФормаПровестиИЗакрыть.Видимость         = РазрешеноПроводить И ЭтоРежимЗаявки;
		Элементы.ФормаПровести.Видимость                 = РазрешеноПроводить И ЭтоРежимЗаявки;
		Элементы.ФормаПровестиИЗакрыть.КнопкаПоУмолчанию = РазрешеноПроводить И ЭтоРежимЗаявки;
		
		ТекстЗаголовка = ?(Объект.ОтправленНаСогласование, 
							НСтр("ru='Отозвать';en='Revoke'"), НСтр("ru='На согласование';en='For Approval'"));
							
		Элементы.ФормаКомандаНаСогласование.Видимость         = НЕ РазрешеноПроводить И ЭтоРежимЗаявки;
		Элементы.ФормаКомандаНаСогласование.КнопкаПоУмолчанию = НЕ РазрешеноПроводить И ЭтоРежимЗаявки;		
		Элементы.ФормаКомандаНаСогласование.Заголовок         = ТекстЗаголовка;
		Элементы.ФормаКомандаНаСогласование.Доступность       = НЕ Объект.Проведен;	
		
		Если ТипСтатуса <> Перечисления.бит_ТипыСтатусовОбъектов.Утвержден
			И ТипСтатуса <> Перечисления.бит_ТипыСтатусовОбъектов.НаСогласовании
			И ТипСтатуса <> Перечисления.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен Тогда
			Элементы.ФормаВвестиДокументПоступленияДС.Доступность = Ложь;
		Иначе
			Элементы.ФормаВвестиДокументПоступленияДС.Доступность = Истина;
		КонецЕсли;
		
		Элементы.Подразделение.Видимость = ИспользоватьПодразделения;
		
		// Проверка заполнения Банковского счета.
		ДоговорОбъектаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчетов, "Договор");
		Элементы.БанковскийСчет.АвтоОтметкаНезаполненного = НЕ ЗначениеЗаполнено(ДоговорОбъектаРасчетов);
		Элементы.БанковскийСчет.ОтметкаНезаполненного     = НЕ ЗначениеЗаполнено(ДоговорОбъектаРасчетов);
		
	Иначе
		
		Элементы.БанковскийСчет.ТолькоПросмотр  =  Истина;
		Элементы.Касса.ТолькоПросмотр 			=  Истина;
	
		Элементы.БанковскийСчет.Видимость = ОплатаЧерезБанк;
		Элементы.БанковскийСчет.Заголовок = НСтр("ru = 'Получатель'");
		Элементы.Касса.Видимость		  = НЕ ОплатаЧерезБанк;
		Элементы.Касса.Заголовок		  = НСтр("ru = 'Получатель'");
		
		Элементы.БанковскийСчет.АвтоОтметкаНезаполненного = Истина;
		Элементы.Касса.АвтоОтметкаНезаполненного		  = Истина;
		
		Элементы.ДокументПланирования.ТолькоПросмотр  =  Истина;
		Элементы.Организация.ТолькоПросмотр			  =  Истина;
		Элементы.ЦФО.ТолькоПросмотр					  =  НЕ ЭтоЗаявкаНаПереводСредств;
		Элементы.СуммаДокумента.ТолькоПросмотр		  =  Истина;
		Элементы.Подразделение.Видимость 			  = Ложь;
		
		#Область Валюты
		Элементы.СуммаВзаиморасчетов.Видимость    				= Ложь;
		Элементы.ВариантКурсаДоговора.Видимость 	   			= Ложь;
		Элементы.КурсЧислительВзаиморасчетов.Видимость 			= Ложь;
		Элементы.КурсЗнаменательВзаиморасчетовНадпись.Видимость = Ложь;
		Элементы.ДекорацияВалютыИКурсПлатежа.Видимость 			= Ложь;
		Элементы.ВалютаВзаиморасчетов.Видимость		 			= Ложь;
		Элементы.ПланированиеСуммы.Видимость	 				= Ложь;		
		Элементы.Валюта.ТолькоПросмотр	 						= Истина;		
		#КонецОбласти
		
		Элементы.ФормаОплаты.ТолькоПросмотр			= Истина;
		Элементы.Контрагент.Видимость				= Ложь;
		Элементы.ОбъектРасчетов.Видимость 			= Ложь;
		Элементы.Договор.Видимость 					= Ложь;
		Элементы.ОснованиеПлатежа.Видимость 		= Ложь;
		Элементы.ТипПлатежа.Видимость 				= Ложь;
		Элементы.ДоговорКредитаДепозита.Видимость	= Ложь;
		Элементы.БанковскийСчетПолучателя.Видимость	= Ложь;

		Элементы.ФормаКомандаСписок.Видимость = Ложь;
		Элементы.ФормаОбработкабит_РезультатПроведенияРезультатПроведенияКнопка.Видимость = Ложь;
		Элементы.ФормаКомандаНаСогласование.Видимость = Ложь;
		Элементы.ФормаВвестиПланируемоеПоступленияДС.Видимость = Ложь;
		Элементы.ФормаВвестиДокументПоступленияДС.Видимость = Ложь;
		
		Элементы.ФормаПровестиИЗакрыть.Видимость         = Ложь;
		Элементы.ФормаПровести.Видимость                 = Ложь;
		Элементы.ФормаПровестиИЗакрыть.КнопкаПоУмолчанию = Ложь;
		
		Счетчик 		  = 12;
		ПоказатьАналитики = Ложь;
		Пока Счетчик >= 1 Цикл
			ИмяЭлемента = "Аналитика_" + Счетчик;
			ПоказатьАналитики = Макс(Элементы[ИмяЭлемента].Видимость, ПоказатьАналитики);	
			Счетчик = Счетчик - 1;
		КонецЦикла;
		Если ПоказатьАналитики Тогда
			Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		Иначе	
			Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		КонецЕсли;
	КонецЕсли;	

	Если (ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию
		И ИспользоватьДоговорыМеждуОрганизациями 
	  ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию
		И ИспользоватьДоговорыМеждуОрганизациями
	ИЛИ (ИспользоватьДоговорыСКлиентами ИЛИ ИспользоватьДоговорыСПоставщиками)) Тогда
		
		Элементы.Договор.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ОбъектРасчетов);	
	Иначе
		Элементы.Договор.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ДокументОснование.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Элементы.ГруппаДокументыПоступления.Видимость = ПравоДоступа("Просмотр", Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств)
		ИЛИ ПравоДоступа("Просмотр", Метаданные.Документы.ПриходныйКассовыйОрдер);
		
	бит_НастройкиДоступностиЭлементовФорм.ЗаблокироватьЭлементы(ЭтотОбъект);
	
КонецПроцедуры // УправлениеЭлементамиФормы()

&НаСервере
Процедура ОснованиеПлатежаОбработкаВыбораНаСервере(ВыбранноеЗначение)

	ДополнитьВыбранноеЗначение(ВыбранноеЗначение);
	
	ИсключаемыеСвойства = Новый Массив;
	Если ВыбранноеЗначение.Свойство("Дата") Тогда
		ИсключаемыеСвойства.Добавить("Дата");	
	КонецЕсли;
	Если ВыбранноеЗначение.Свойство("Номер") Тогда
		ИсключаемыеСвойства.Добавить("Номер");	
	КонецЕсли;
	
	ТекущийДоговор = Объект.Договор;
	ТекущаяВалюта  = Объект.ВалютаДокумента;
	
	ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение, , СтрСоединить(ИсключаемыеСвойства, ","));
	
	Модифицированность = Истина;
	
	Если ТекущийДоговор <> Объект.Договор Тогда
		ДоговорПриИзмененииНаСервере();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение.ВалютаВзаиморасчетов) 
	   И ТекущаяВалюта <> ВыбранноеЗначение.ВалютаВзаиморасчетов Тогда
		Объект.ВалютаДокумента = ВыбранноеЗначение.ВалютаВзаиморасчетов;
		ОбработатьИзмененииВалюты();
	КонецЕсли;
	
	РассчитатьСуммуНДС();
	ПриИзмененииПоставляемыхРеквизитов(Объект.ОбъектРасчетов);

КонецПроцедуры

&НаКлиенте
Процедура ДокументОплатыНажатие(Элемент)

	ДокументыОплаты = НайтиДокументыОплаты();

    Для Каждого Документ Из ДокументыОплаты Цикл
		Если Строка(Документ) = Элемент.Заголовок Тогда
			ОткрытьЗначение(Документ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ДокументОплатыНажатие() 

&НаКлиенте
Процедура ОткрытьФормуПланируемоеПоступлениеДС()

	Если НЕ ЗначениеЗаполнено(Объект.ДокументПланирования) Тогда
		Возврат;
	КонецЕсли; 
	
	// Открываем заявку для возможности работы в списке позиций.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ" , Объект.ДокументПланирования);
	ПараметрыФормы.Вставить("Режим", "ОткрытиеСпискаПозиций");
	
	ОткрытьФорму("Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ФормаОбъекта", ПараметрыФормы);
	
	Закрыть();

КонецПроцедуры

#КонецОбласти
