
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Успех = ПроверкаВозможностиСозданияОтраженияФактаЗатрат(ПараметрКоманды);
	
	Если Не Успех Тогда		
		ТекстСообщения = НСтр("ru='Создание Отражения факта затрат возможно только в статусах Рабочая, Утверждена, Частично исполнена и Включена в сводную заявку.';
							  |en='Creating a reflection of the fact the cost is only possible in the status of the Working claiming partially performed and included in the consolidated application.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;	
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОснование", ПараметрКоманды);
	
	ОткрытьФорму("Документ.бит_пз_ОтражениеФактаЗатрат.ФормаОбъекта"
	              , ПараметрыФормы
				  , ПараметрыВыполненияКоманды.Источник
				  , ПараметрыВыполненияКоманды.Уникальность
				  , ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

//  Функция проверки возможности создания Отражения факта затрат. 
// 
&НаСервере
Функция ПроверкаВозможностиСозданияОтраженияФактаЗатрат(ПараметрКоманды)

	Разрешено = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрСтатусыОбъектов.Статус КАК Статус,
	|	РегистрСтатусыОбъектов.Объект КАК Заявка,
	|	СправочникСтатусыОбъектов.ТипСтатуса КАК ТипСтатуса
	|ИЗ
	|	РегистрСведений.бит_СтатусыОбъектов КАК РегистрСтатусыОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_СтатусыОбъектов КАК СправочникСтатусыОбъектов
	|		ПО РегистрСтатусыОбъектов.Статус = СправочникСтатусыОбъектов.Ссылка
	|			И (РегистрСтатусыОбъектов.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус))
	|			И (РегистрСтатусыОбъектов.Объект = &МассивЗаявок)";
	
	Запрос.УстановитьПараметр("МассивЗаявок", ПараметрКоманды);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипСтатуса = Перечисления.бит_ТипыСтатусовОбъектов.НаСогласовании
			ИЛИ Выборка.ТипСтатуса = Перечисления.бит_ТипыСтатусовОбъектов.Утвержден
			ИЛИ Выборка.ТипСтатуса = Перечисления.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен
			ИЛИ Выборка.Статус = Справочники.бит_СтатусыОбъектов.ЗаявкаНаЗатраты_ВключенаВСводнуюЗаявку Тогда
		
			Разрешено = Истина;
		
		КонецЕсли; 
	
	КонецЦикла;

	Возврат Разрешено;
	
КонецФункции // ПроверкаВозможностиСозданияОтраженияФактаЗатрат()
