
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Вызов механизма защиты
	бит_ОбщегоНазначения.ПроверитьДоступностьПроформ(Объект.Назначение, Отказ);	
	
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли; 		
	
	// Настройка формы в зависимости от назначения.
	ЭтоФСД = ?(Объект.Назначение = Перечисления.бит_НазначенияПроформ.ПроизвольнаяФорма, Ложь, Истина);
	
	Если ЭтоФСД Тогда		
		Заголовок =  НСтр("ru='Вид формы сбора данных';en='Data Collection Form Type'");		
	Иначе		
		Заголовок =  НСтр("ru='Вид произвольной формы';en='Type of a custom form'");		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Записан_ВидПроформы");	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Назначение" , Объект.Назначение);
	ПараметрыФормы.Вставить("ТекЗначение", Объект.Родитель);
	
	ОткрытьФорму("Справочник.бит_ВидыПроформ.ФормаВыбораГруппы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти