
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	ПодготовитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаСогласованиеВыбор(Элемент)
	
	ОбработатьВыбор(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаБюджетныйПроцессВыбор(Элемент)
	
	ОбработатьВыбор(Элемент);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыбор(Элемент)
	
	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	НавигационнаяСсылкаБлока = Неопределено;
	Если НавигационныеСсылки.Свойство(ИмяЭлемента, НавигационнаяСсылкаБлока) 
		И ЗначениеЗаполнено(НавигационнаяСсылкаБлока) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаБлока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФорму()
	
	// Готовим структуру из метаданных, чтобы проверка конфигурации реагировала на изменения.
	ОбъектыПодсистемы = Новый Структура;
	
	// Справочники.
	ОбъектыПодсистемы.Вставить("СтатусыОбъектов",			Метаданные.Справочники.бит_СтатусыОбъектов);
	ОбъектыПодсистемы.Вставить("Визы",						Метаданные.Справочники.бит_Визы);
	ОбъектыПодсистемы.Вставить("ПользовательскиеДействия",	Метаданные.Справочники.бит_ПользовательскиеДействия);
	ОбъектыПодсистемы.Вставить("ПользовательскиеУсловия",	Метаданные.Справочники.бит_ПользовательскиеУсловия);
	ОбъектыПодсистемы.Вставить("АлгоритмыПроцессов",		Метаданные.Справочники.бит_АлгоритмыПроцессов);
	ОбъектыПодсистемы.Вставить("РолиИсполнителей",			Метаданные.Справочники.бит_РолиИсполнителей);
	
	// Регистры сведений.
	ОбъектыПодсистемы.Вставить("ПраваУстановкиВиз",		Метаданные.РегистрыСведений.бит_ПраваУстановкиВиз);
	ОбъектыПодсистемы.Вставить("ИсполнителиЗадач",		Метаданные.РегистрыСведений.бит_ИсполнителиЗадач);
	ОбъектыПодсистемы.Вставить("НазначениеАлгоритмов",	Метаданные.РегистрыСведений.бит_НазначениеАлгоритмов);
	
	// Обработки.
	ОбъектыПодсистемы.Вставить("НазначениеЗаместителей", Метаданные.Обработки.бит_НазначениеЗаместителей);
	
	// Планы видов характеристик.
	ОбъектыПодсистемы.Вставить("ВидыОбъектовАдресацииЗадач", Метаданные.ПланыВидовХарактеристик.бит_ВидыОбъектовАдресацииЗадач);
	
	// Бизнес процессы.
	ОбъектыПодсистемы.Вставить("Процесс", Метаданные.БизнесПроцессы.бит_Процесс);
	
	// Задачи.
	ОбъектыПодсистемы.Вставить("Задача", Метаданные.Задачи.бит_Задача);
	
	// Формирование навигационных ссылок и проверка доступа по функциональным опциям.
	НедоступныеОбъекты = Новый Массив;
	Для Каждого ОбъектПодсистемы Из ОбъектыПодсистемы Цикл
		НавигационнаяСсылкаБлока = ""; 
		ОбъектДоступен = ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОбъектПодсистемы.Значение);
		Если ОбъектДоступен Тогда
			НавигационнаяСсылкаБлока = ПолучитьНавигационнуюСсылку(ОбъектПодсистемы.Значение);
		Иначе
			НедоступныеОбъекты.Добавить(ОбъектПодсистемы.Ключ);	
		КонецЕсли;
		ОбъектыПодсистемы[ОбъектПодсистемы.Ключ] = НавигационнаяСсылкаБлока;
	КонецЦикла;
	
	НавигационныеСсылки = Новый ФиксированнаяСтруктура(ОбъектыПодсистемы);
	
	СхемаСогласование		= Обработки.бит_ПанельФункций_УправлениеПроцессами.ПолучитьМакет("СхемаСогласование");
	СхемаБюджетныйПроцесс	= Обработки.бит_ПанельФункций_УправлениеПроцессами.ПолучитьМакет("СхемаБюджетныйПроцесс");
	
	// Ссылка может быть одновременно на разных схемах.
	Для Каждого НедоступныйОбъект Из НедоступныеОбъекты Цикл
		ЭлементыСхемы = СхемаСогласование.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
		ЭлементыСхемы = СхемаБюджетныйПроцесс.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект)
	
	ЭлементСхемы = ЭлементыСхемы[НедоступныйОбъект];
	ЭлементСхемы.ЦветФона = ЦветаСтиля.бит_ЦветНедоступногоПоля;
	
КонецПроцедуры

#КонецОбласти