
Процедура Инициализировать_СхемуКомпоновкиДанныхОтбора(ВхСхемаКомпоновки) Экспорт
	
	//ВхСхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	_ИсточникДанных = ВхСхемаКомпоновки.ИсточникиДанных.Добавить();
	_ИсточникДанных.Имя = "ИсточникДанных";
	_ИсточникДанных.ТипИсточникаДанных = "Local";
	
	_ТекстЗапроса 	= "";
		
	// к ИсточникуДанных-Справочнику добавляется еще 1 элемент - пустая ссылка на элемент справочника (через временную таблицу с 1 строкой)
	// для того чтобы можно было указывать пустую ссылку на элемент справочника в качестве валидного проверяемого значения параметра номенклатуры
	_ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаРесурса.Ссылка КАК Номенклатура,
	|	NULL КАК ВидНоменклатуры,
	|	NULL КАК Характеристика
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаРесурса
	//|{ГДЕ
	//|	ТаблицаРесурса.Ссылка.*}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	ВидыНоменклатуры.Ссылка,
	|	NULL
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	//|{ГДЕ
	//|	ВидыНоменклатуры.Ссылка.*}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	Характеристика.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК Характеристика
	//|{ГДЕ
	//|	ДополнительныеРеквизитыИСведения.Ссылка.*}
	|"
	;
	
	//_ИмяСправочника = Метаданные.НайтиПоТипу(ВхТипЗначенияРесурса).Имя;
	//_ТекстЗапроса = СтрЗаменить(_ТекстЗапроса, "Номенклатура", _ИмяСправочника);
	
	_НаборДанных = ВхСхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	_НаборДанных.Имя 			= "НаборДанных_01";
	_НаборДанных.ИсточникДанных = "ИсточникДанных";
	_НаборДанных.Запрос 		= _ТекстЗапроса;
	
	_Поле1 = _НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	_Поле1.Поле 		= "Номенклатура";
	_Поле1.ПутьКДанным 	= "Номенклатура";
	_Поле1.Заголовок 	= "Номенклатура";
	
	_Поле2 = _НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	_Поле2.Поле 		= "ВидНоменклатуры";
	_Поле2.ПутьКДанным 	= "ВидНоменклатуры";
	_Поле2.Заголовок 	= "Вид номенклатуры";
	
	_Поле3 = _НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	_Поле3.Поле 		= "ЗначенияХарактеристик";
	_Поле3.ПутьКДанным 	= "ЗначенияХарактеристик";
	_Поле3.Заголовок 	= "Значения характеристик";
	
КонецПроцедуры

Процедура Инициализировать_СхемуКомпоновкиДанныхЗначений(ВхСхемаКомпоновки, Владелец) Экспорт
	
	ВхСхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	Если Владелец.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
		
		ИмяСправочника = "ЗначенияСвойствОбъектов"; 
		
		ПараметрВладелец = ВхСхемаКомпоновки.Параметры.Добавить(); 
		ПараметрВладелец.Имя = "Владелец";
		ПараметрВладелец.Заголовок = "Владелец";                            
		ПараметрВладелец.ТипЗначения = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения");
		ПараметрВладелец.ОграничениеИспользования = Ложь;
		ПараметрВладелец.Значение = Владелец;
		ПараметрВладелец.Использование =ИспользованиеПараметраКомпоновкиданных.Всегда;
		ПараметрВладелец.ВключатьВДоступныеПоля = Истина;
		
		_ИсточникДанных = ВхСхемаКомпоновки.ИсточникиДанных.Добавить();
		_ИсточникДанных.Имя = "ИсточникДанных";
		_ИсточникДанных.ТипИсточникаДанных = "Local";
		
		_ТекстЗапроса 	= "";
		
		// к ИсточникуДанных-Справочнику добавляется еще 1 элемент - пустая ссылка на элемент справочника (через временную таблицу с 1 строкой)
		// для того чтобы можно было указывать пустую ссылку на элемент справочника в качестве валидного проверяемого значения параметра номенклатуры
		_ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Ссылка КАК ЗначениеСвойства
		|ИЗ
		|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		//|";
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Владелец = &Владелец";
		
		//_ИмяСправочника = Метаданные.НайтиПоТипу(ВхТипЗначенияРесурса).Имя;
		//_ТекстЗапроса = СтрЗаменить(_ТекстЗапроса, "Номенклатура", _ИмяСправочника);
		
		_НаборДанных = ВхСхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		_НаборДанных.Имя 			= "НаборДанных_01";
		_НаборДанных.ИсточникДанных = "ИсточникДанных";
		_НаборДанных.Запрос 		= _ТекстЗапроса;
		
		_Поле1 = _НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		_Поле1.Поле 		= "ЗначенияСвойства";
		_Поле1.ПутьКДанным 	= "ЗначенияСвойства";
		_Поле1.Заголовок 	= "Значение свойства";
		
	Иначе
		
		ИмяСправочника = "Номенклатура";
				
		ПараметрВладелец = ВхСхемаКомпоновки.Параметры.Добавить(); 
		ПараметрВладелец.Имя = "Владелец";
		ПараметрВладелец.Заголовок = "Владелец";                            
		ПараметрВладелец.ТипЗначения = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения");
		ПараметрВладелец.ОграничениеИспользования = Ложь;
		ПараметрВладелец.Значение = Владелец;
		ПараметрВладелец.Использование =ИспользованиеПараметраКомпоновкиданных.Всегда;
		ПараметрВладелец.ВключатьВДоступныеПоля = Истина;
		
		_ИсточникДанных = ВхСхемаКомпоновки.ИсточникиДанных.Добавить();
		_ИсточникДанных.Имя = "ИсточникДанных";
		_ИсточникДанных.ТипИсточникаДанных = "Local";
		
		_ТекстЗапроса 	= "";
		
		// к ИсточникуДанных-Справочнику добавляется еще 1 элемент - пустая ссылка на элемент справочника (через временную таблицу с 1 строкой)
		// для того чтобы можно было указывать пустую ссылку на элемент справочника в качестве валидного проверяемого значения параметра номенклатуры
		_ТекстЗапроса =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК ЗначениеСвойства
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";
		
		//_ИмяСправочника = Метаданные.НайтиПоТипу(ВхТипЗначенияРесурса).Имя;
		//_ТекстЗапроса = СтрЗаменить(_ТекстЗапроса, "Номенклатура", _ИмяСправочника);
		
		_НаборДанных = ВхСхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		_НаборДанных.Имя 			= "НаборДанных_01";
		_НаборДанных.ИсточникДанных = "ИсточникДанных";
		_НаборДанных.Запрос 		= _ТекстЗапроса;
		
		_Поле1 = _НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		_Поле1.Поле 		= "ЗначенияСвойства";
		_Поле1.ПутьКДанным 	= "ЗначенияСвойства";
		_Поле1.Заголовок 	= "Значение свойства";
				
	КонецЕсли;
			
КонецПроцедуры
