////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Обработчик расшифровки табличного документа формы отчета.
//
// Параметры:
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма отчета.
//  Элемент     - ПолеФормы        - табличный документ.
//  Расшифровка - Произвольный     - значение расшифровки точки, серии или значения диаграммы.
//  СтандартнаяОбработка - Булево  - признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаРасшифровки(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	ИмяОтчета = СтрЗаменить(ЭтаФорма.НастройкиОтчета.ПолноеИмя, "Отчет.", "");
	КлючТекущегоВарианта = ЭтаФорма.КлючТекущегоВарианта;
 
	Если ЭтоСтандартныйОтчет(ИмяОтчета) Тогда
		
		СтандартнаяОбработка = Ложь;
		РасшифровкаСтандартногоОтчета(ЭтаФорма, Элемент, Расшифровка, ИмяОтчета, КлючТекущегоВарианта);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РасшифровкаСтандартногоОтчета(ФормаОтчета, Элемент, ИдентификаторРасшифровки, ИмяОтчета, КлючТекущегоВарианта)
		
	ПараметрыФормыРасшифровки = ПолучитьРасшифровкуОтчета(ФормаОтчета, ИдентификаторРасшифровки); 
	КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
	
	ЗначенияСчета = Новый Структура("Счет,СчетДт,СчетКт", "", "", "");
	СтороныСчета = Новый Массив;
	СтороныСчета.Добавить("");
	СтороныСчета.Добавить("Дт");
	СтороныСчета.Добавить("Кт");
	
	Для каждого СторонаСчета Из СтороныСчета Цикл 	
		Если ПараметрыФормыРасшифровки.Поля.Свойство("Счет"+СторонаСчета) Тогда	
			ЗначенияСчета["Счет"+СторонаСчета] = ПараметрыФормыРасшифровки.Поля["Счет"+СторонаСчета];
		ИначеЕсли ПараметрыФормыРасшифровки.Отборы.Свойство("Счет"+СторонаСчета) Тогда
			ЗначенияСчета["Счет"+СторонаСчета] = ПараметрыФормыРасшифровки.Отборы["Счет"+СторонаСчета].ПравоеЗначение; 
		КонецЕсли;		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ЗначенияСчета.Счет) И ЗначениеЗаполнено(ЗначенияСчета.СчетДт) Тогда
		ЗначенияСчета.Счет = ЗначенияСчета.СчетДт;
	КонецЕсли;
	
	ВозможныеРасшифровки = ВозможныеРасшифровки(ИмяОтчета, КлючТекущегоВарианта, ЗначенияСчета); 	
	Если ВозможныеРасшифровки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВозможныеРасшифровки.Количество() = 1 Тогда
		ПодготовитьРасшифровку(ВозможныеРасшифровки[0].Значение, ПараметрыФормыРасшифровки, КомпоновщикНастроек);
	Иначе
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыФормыРасшифровки",	ПараметрыФормыРасшифровки);
		ДополнительныеПараметры.Вставить("КомпоновщикНастроек",			КомпоновщикНастроек);
		
		Оповещение = Новый ОписаниеОповещения("РасшифровкаСтандартногоОтчетаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ФормаОтчета.ПоказатьВыборИзМеню(Оповещение, ВозможныеРасшифровки, Элемент);
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывается выбор пункта действий расшифровки.
//
// Параметры:
//  ВыбранныйЭлемент - ЭлементСпискаЗначений - Выбранный пункт из списка действий расшифровки.
//  ДополнительныеПараметры - Структура - Дополнительные параметры содержат:
//		* ПараметрыФормыРасшифровки - Структура - Настройки расшифровки.
//  	* КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - Компоновщик настроек расшифровываемого отчета.
//
Процедура РасшифровкаСтандартногоОтчетаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		ПодготовитьРасшифровку(ВыбранныйЭлемент.Значение,
			ДополнительныеПараметры.ПараметрыФормыРасшифровки,
			ДополнительныеПараметры.КомпоновщикНастроек);
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ПолучитьРасшифровкуОтчета(ФормаОтчета, ИдентификаторРасшифровки)
	
	ПоляРасшифровки  = Новый Массив;
	ПоляРасшифровки.Добавить("Счет");
	ПоляРасшифровки.Добавить("Субконто1");
	ПоляРасшифровки.Добавить("Субконто2");
	ПоляРасшифровки.Добавить("Субконто3");
	ПоляРасшифровки.Добавить("Субконто4");
	ПоляРасшифровки.Добавить("КорСчет");
	ПоляРасшифровки.Добавить("КорСубконто1");
	ПоляРасшифровки.Добавить("КорСубконто2");
	ПоляРасшифровки.Добавить("КорСубконто3");
	ПоляРасшифровки.Добавить("КорСубконто4");
	ПоляРасшифровки.Добавить("СчетДт");
	ПоляРасшифровки.Добавить("СчетКт");
	ПоляРасшифровки.Добавить("Регистратор");
	
	ПараметрыРасшифровки = Новый Массив;
	
	ПараметрыФормыРасшифровки = бит_УправленческийУчетВызовСервера.ПараметрыСтандартногоОтчета(
									ИдентификаторРасшифровки, 
									ФормаОтчета.ОтчетДанныеРасшифровки,
									ПараметрыРасшифровки, 
									ПоляРасшифровки);
									
	Возврат ПараметрыФормыРасшифровки;
	
КонецФункции

// Формирует список расшифровок для стандартного отчета.
//
// Параметры:
//  ПолноеИмяОтчета - Строка - Имя расшифровываемого отчета.
//  КлючТекущегоВарианта - Строка - Вариант расшифровываемого отчета.
//	ЗначенияСчета - Структура - Счета, участвующие в расшифровке.
//
// Возвращаемое значение:
//  СписокЗначений - Содержит имя отчета, имя варианта, представление для пользователя
Функция ВозможныеРасшифровки(ПолноеИмяОтчета, КлючТекущегоВарианта, ЗначенияСчета)
	
	ВозможныеРасшифровки = Новый СписокЗначений;
	СтруктураРасшифровки = Новый Структура("ИмяОтчета, ИмяВарианта, ДополнительныеПараметры");
	
	Если ПолноеИмяОтчета = "бит_БухгалтерскийОтчетУправленческийБезКорреспонденции" Тогда
						
		Если КлючТекущегоВарианта = "ОСВПоСчетуУправленческий" Тогда
			
			//СтруктураРасшифровки.ИмяОтчета 		= "бит_БухгалтерскийОтчетУправленческийСКорреспонденцией";
			//СтруктураРасшифровки.ИмяВарианта 	= "ОСВПоСчетуСКорреспонденциейУправленческий";
			//Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			//										НСтр("ru = 'ОСВ по счету %1 с корреспонденцией';
			//											|en = 'Trial balance for the account %1 with correspondence'"), ЗначенияСчета.Счет);
			//ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
			
			СтруктураРасшифровки.ИмяОтчета 		= "бит_КарточкаСчетаУправленческий";
			СтруктураРасшифровки.ИмяВарианта 	= "КарточкаСчетаУправленческий";
			Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'Карточка счета %1';
														|en = 'Account card %1'"), ЗначенияСчета.Счет);
			ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);

		ИначеЕсли КлючТекущегоВарианта = "ОСВУправленческий" Тогда
			
			СтруктураРасшифровки.ИмяОтчета 		= "бит_БухгалтерскийОтчетУправленческийБезКорреспонденции";
			СтруктураРасшифровки.ИмяВарианта 	= "ОСВПоСчетуУправленческий";
			Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'ОСВ по счету %1';
														|en = 'Trial balance on %1 account'"), ЗначенияСчета.Счет);
			ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
			
			СтруктураРасшифровки.ИмяОтчета 		= "бит_КарточкаСчетаУправленческий";
			СтруктураРасшифровки.ИмяВарианта 	= "КарточкаСчетаУправленческий";
			Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'Карточка счета %1';
														|en = 'Account card %1'"), ЗначенияСчета.Счет);
			ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
					
			СтруктураРасшифровки.ИмяОтчета 		= "бит_БухгалтерскийОтчетУправленческийСКорреспонденцией";
			СтруктураРасшифровки.ИмяВарианта 	= "АнализСчетаУправленческий";
			Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'Анализ счета %1';
														|en = 'Analysis of account %1'"), ЗначенияСчета.Счет);
			ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
			
			СтруктураРасшифровки.ИмяОтчета 		= "бит_БухгалтерскийОтчетУправленческийСКорреспонденцией";
			СтруктураРасшифровки.ИмяВарианта 	= "ОСВПоСчетуСКорреспонденциейУправленческий";
			Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'ОСВ по счету %1 с корреспонденцией';
														|en = 'Trial balance for the account %1 with correspondence'"), ЗначенияСчета.Счет);
			ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
			
		ИначеЕсли КлючТекущегоВарианта = "АнализСубконтоУправленческий" Тогда
			
			СтруктураРасшифровки.ИмяОтчета 		= "бит_КарточкаСчетаУправленческий";
			СтруктураРасшифровки.ИмяВарианта 	= "КарточкаСчетаУправленческий";
			Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'Карточка счета %1';
														|en = 'Account card %1'"), ЗначенияСчета.Счет);
			ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
			
		КонецЕсли;
	ИначеЕсли ПолноеИмяОтчета = "бит_БухгалтерскийОтчетУправленческийСКорреспонденцией" Тогда
		
		Если КлючТекущегоВарианта = "АнализСчетаУправленческий" Тогда
			
			СтруктураРасшифровки.ИмяОтчета 		= "бит_КарточкаСчетаУправленческий";
			СтруктураРасшифровки.ИмяВарианта 	= "ОтчетПоПроводкамУправленческий";
			Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'Отчет по проводкам %1';
														|en = 'Entry report %1'"), ЗначенияСчета.Счет);
			ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
			
			СтруктураРасшифровки.ИмяОтчета 		= "бит_БухгалтерскийОтчетУправленческийСКорреспонденцией";
			СтруктураРасшифровки.ИмяВарианта 	= "ОСВПоСчетуСКорреспонденциейУправленческий";
			Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'ОСВ по счету %1 с корреспонденцией';
														|en = 'Trial balance for the account %1 with correspondence'"), ЗначенияСчета.Счет);
			ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
		
		ИначеЕсли КлючТекущегоВарианта = "ОСВПоСчетуСКорреспонденциейУправленческий" Тогда
			
			СтруктураРасшифровки.ИмяОтчета 		= "бит_КарточкаСчетаУправленческий";
			СтруктураРасшифровки.ИмяВарианта 	= "ОтчетПоПроводкамУправленческий";
			Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'Отчет по проводкам %1';
														|en = 'Entry report %1'"), ЗначенияСчета.Счет);
			ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
		КонецЕсли;
	
	ИначеЕсли ПолноеИмяОтчета = "бит_ШахматнаяВедомостьУправленческий" Тогда
		
		СтруктураРасшифровки.ИмяОтчета 		= "бит_БухгалтерскийОтчетУправленческийСКорреспонденцией";
		СтруктураРасшифровки.ИмяВарианта 	= "ОСВПоСчетуСКорреспонденциейУправленческий";
		СтруктураРасшифровки.ДополнительныеПараметры = Новый Структура("ДтКт", "Дт");
		Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'ОСВ по счету %1 с корреспонденцией';
														|en = 'Trial balance for the account %1 with correspondence'"), ЗначенияСчета.СчетДт);
		ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
		
		СтруктураРасшифровки.ИмяОтчета 		= "бит_БухгалтерскийОтчетУправленческийСКорреспонденцией";
		СтруктураРасшифровки.ИмяВарианта 	= "ОСВПоСчетуСКорреспонденциейУправленческий";
		СтруктураРасшифровки.ДополнительныеПараметры = Новый Структура("ДтКт", "Кт");
		Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'ОСВ по счету %1 с корреспонденцией';
														|en = 'Trial balance for the account %1 with correspondence'"), ЗначенияСчета.СчетКт);
		ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
		
	ИначеЕсли ПолноеИмяОтчета = "бит_КарточкаСчетаУправленческий" Тогда
		
		Если КлючТекущегоВарианта = "СводныеПроводки" Тогда
			
			СтруктураРасшифровки.ИмяОтчета 		= "бит_КарточкаСчетаУправленческий";
			СтруктураРасшифровки.ИмяВарианта 	= "ОтчетПоПроводкамУправленческий";
			Представление						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													НСтр("ru = 'Отчет по проводкам %1';
														|en = 'Entry report %1'"), ЗначенияСчета.Счет);
			ВозможныеРасшифровки.Добавить(Новый ФиксированнаяСтруктура(СтруктураРасшифровки), Представление);
			
		Иначе
			
			ВозможныеРасшифровки.Добавить("Регистратор", "Регистратор");
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат ВозможныеРасшифровки;
	
КонецФункции

Процедура ПодготовитьРасшифровку(ЗначениеРасшифровки, ПараметрыФормыРасшифровки, Знач КомпоновщикНастроек) 
	
	Если ТипЗнч(ЗначениеРасшифровки) = Тип("Строка") Тогда
		Если ПараметрыФормыРасшифровки.Поля.Свойство(ЗначениеРасшифровки) Тогда
			ПоказатьЗначение(, ПараметрыФормыРасшифровки.Поля[ЗначениеРасшифровки]);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ПараметрыСчетов = Новый Массив;
	
	Если ЗначениеЗаполнено(ЗначениеРасшифровки.ДополнительныеПараметры) Тогда
		Если ЗначениеРасшифровки.ДополнительныеПараметры.Свойство("ДтКт") Тогда
			
			СторонаСчета = ЗначениеРасшифровки.ДополнительныеПараметры.ДтКт;
			СторонаКорСчета = СтрЗаменить("ДтКт", СторонаСчета, "");
			
			Если ПараметрыФормыРасшифровки.Поля.Свойство("Счет" + СторонаСчета) Тогда
				ПараметрыФормыРасшифровки.Поля.Вставить("Счет", ПараметрыФормыРасшифровки.Поля["Счет" + СторонаСчета]);
				ПараметрыФормыРасшифровки.Поля.Удалить("Счет" + СторонаСчета);
			КонецЕсли;
			Если ПараметрыФормыРасшифровки.Поля.Свойство("Счет" + СторонаКорСчета) Тогда
				ПараметрыФормыРасшифровки.Поля.Вставить("КорСчет", ПараметрыФормыРасшифровки.Поля["Счет" + СторонаКорСчета]);
				ПараметрыФормыРасшифровки.Поля.Удалить("Счет" + СторонаКорСчета);
			КонецЕсли;
			
			Если ПараметрыФормыРасшифровки.Отборы.Свойство("Счет" + СторонаСчета) Тогда
				ПараметрыФормыРасшифровки.Отборы.Вставить("Счет", ПараметрыФормыРасшифровки.Отборы["Счет" + СторонаСчета]);
				ПараметрыФормыРасшифровки.Отборы.Счет.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Счет");
				ПараметрыФормыРасшифровки.Отборы.Удалить("Счет" + СторонаСчета);
			КонецЕсли;
			Если ПараметрыФормыРасшифровки.Отборы.Свойство("Счет" + СторонаКорСчета) Тогда
				ПараметрыФормыРасшифровки.Отборы.Вставить("КорСчет", ПараметрыФормыРасшифровки.Отборы["Счет" + СторонаКорСчета]);
				ПараметрыФормыРасшифровки.Отборы.КорСчет.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорСчет");
				ПараметрыФормыРасшифровки.Отборы.Удалить("Счет" + СторонаКорСчета);
			КонецЕсли;
			
			ПолеСчета 	 = Новый ПолеКомпоновкиДанных("Счет" + СторонаСчета);
			ПолеКорСчета = Новый ПолеКомпоновкиДанных("Счет" + СторонаКорСчета);
			Для каждого ЭлементПользовательскихНастроек Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				Если ТипЗнч(ЭлементПользовательскихНастроек) = Тип("ЭлементОтбораКомпоновкиДанных")
						И ЭлементПользовательскихНастроек.Использование
						И (ЭлементПользовательскихНастроек.ЛевоеЗначение = ПолеСчета 
							ИЛИ ЭлементПользовательскихНастроек.ЛевоеЗначение = ПолеКорСчета) Тогда
					ЭлементПользовательскихНастроек.Использование = Ложь;
					ПараметрыСчетов.Добавить(ЭлементПользовательскихНастроек);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли; 
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяОтчета",			  ЗначениеРасшифровки.ИмяОтчета);
	Параметры.Вставить("КлючВарианта", 		  ЗначениеРасшифровки.ИмяВарианта);
	Параметры.Вставить("КомпоновщикНастроек", КомпоновщикНастроек);
	Параметры.Вставить("ПоляРасшифровки", 	  ПараметрыФормыРасшифровки.Поля);
	Параметры.Вставить("Отбор", 			  ПараметрыФормыРасшифровки.Отборы);
		
	НастройкаОтчета = бит_УправленческийУчетВызовСервера.НастроитьОтчетРасшифровки(Параметры);
	
	ФиксированныеНастройки = НастройкаОтчета.ФиксированныеНастройки;
	ФиксированныеНастройки.ДополнительныеСвойства.Вставить("ВариантНаименование", ЗначениеРасшифровки.ИмяВарианта);
	
	КлючНастроек = "РасшифровкаСтандартногоОтчета"; 
	ОткрытьРасшифровку(ЗначениеРасшифровки, НастройкаОтчета, КлючНастроек, КлючНастроек);
	
	Для каждого ПараметрСчета Из ПараметрыСчетов Цикл
		ПараметрСчета.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры

Функция ОткрытьРасшифровку(ЗначениеРасшифровки, НастройкиОтчета, КлючНазначенияИспользования = Неопределено, КлючПользовательскихНастроек = Неопределено)
	
	ПрименяемыеНастройки = Новый Структура("ПрименяемыеНастройки",НастройкиОтчета.ФиксированныеНастройки);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", 			ЗначениеРасшифровки.ИмяВарианта);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки",НастройкиОтчета.ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("ФиксированныеНастройки", 	НастройкиОтчета.ФиксированныеНастройки);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", 	Истина);
	ПараметрыФормы.Вставить("Расшифровка", 				Истина); // ++ NB Используется формой отчета БСП.
	
	Если КлючНазначенияИспользования <> Неопределено Тогда
		ПараметрыФормы.Вставить("КлючНазначенияИспользования", 	КлючНазначенияИспользования);
	КонецЕсли;
	Если КлючПользовательскихНастроек <> Неопределено Тогда
		ПараметрыФормы.Вставить("КлючПользовательскихНастроек", КлючПользовательскихНастроек);
	КонецЕсли;
		
	ОткрытьФорму("Отчет." + ЗначениеРасшифровки.ИмяОтчета + ".Форма", ПараметрыФормы,, Истина);
			
КонецФункции

Функция ЭтоСтандартныйОтчет(ИмяОтчета)
	
	СписокОтчетов = Новый Массив;
	СписокОтчетов.Добавить("бит_БухгалтерскийОтчетУправленческийСКорреспонденцией");
	СписокОтчетов.Добавить("бит_БухгалтерскийОтчетУправленческийБезКорреспонденции");
	СписокОтчетов.Добавить("бит_КарточкаСчетаУправленческий");
	СписокОтчетов.Добавить("бит_ШахматнаяВедомостьУправленческий");
		
	Возврат СписокОтчетов.Найти(ИмяОтчета) <> Неопределено;
	
КонецФункции

#КонецОбласти
