
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДополнительногоПоля_СчетДт = "ДополнительноеПоле_СчетДт";
	ИмяДополнительногоПоля_СчетКт = "ДополнительноеПоле_СчетКт";
	
	ИмяПоляПриемника_СчетДт = "СчетДт";
	ИмяПоляПриемника_СчетКт = "СчетКт";
	
	ШаблонВыражения = 
	"// добавление новой проводки в приемник
	|Если НЕ Отказ  Тогда
	|
	| 	СтруктураИменДоп = Новый Структура;
	| 	СтруктураИменДоп.Вставить(""ИмяДополнительногоПоля_СчетДт"",""%ИмяДополнительногоПоля_СчетДт%"");
	| 	СтруктураИменДоп.Вставить(""ИмяДополнительногоПоля_СчетКт"",""%ИмяДополнительногоПоля_СчетКт%"");
	| 	СтруктураИменДоп.Вставить(""ИмяПоляПриемника_СчетДт"",""%ИмяПоляПриемника_СчетДт%"");
	| 	СтруктураИменДоп.Вставить(""ИмяПоляПриемника_СчетКт"",""%ИмяПоляПриемника_СчетКт%"");
	|
	| 	НоваяПроводка = ДобавитьДополнительнуюПроводку(НаборПриемник, ЗаписьИсточник, ЗаписьПриемник, ДополнительныеДанные, СтруктураИменДоп);
	| 	Если НЕ НоваяПроводка = Неопределено Тогда
	|		ПараметрыЗаписи = НовыеПараметрыЗаписиСоответствияДвижений();
	|		ПараметрыЗаписи.Реквизиты 			 = СтруктураШапкиДокумента;
	|		ПараметрыЗаписи.СтороныТрансляции 	 = СтруктураПараметров; 
	|		ПараметрыЗаписи.НомерСтрокиИсточника = Ном;
	|		ПараметрыЗаписи.НомерСтрокиПриемника = НомПриемник;
	|		ПараметрыЗаписи.Активность 			 = ЗаписьИсточник.Активность;
	|		// Можно добавить комментарий:
	|		ПараметрыЗаписи.СлужебнаяОтметкаДт   = """"; // В контексте доступна заполненная переменная СлужебнаяОтметкаДт;
	|		ПараметрыЗаписи.СлужебнаяОтметкаКт	 = """"; // В контексте доступна заполненная переменная СлужебнаяОтметкаКт;
	|
	|		Подключаемый_ДобавитьЗаписьСоответствияДвижений(НаборСоответствие, ПараметрыЗаписи);
	|   	НомПриемник = НомПриемник + 1;
	| 	КонецЕсли;   
	|
	|КонецЕсли;";
	
	ОбновитьВыражениеРезультат(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяДополнительногоПоля_СчетДтПриИзменении(Элемент)
	
	ОбновитьВыражениеРезультат(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяДополнительногоПоля_СчетКтПриИзменении(Элемент)
	
	ОбновитьВыражениеРезультат(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПоляПриемника_СчетДтПриИзменении(Элемент)
	
	ОбновитьВыражениеРезультат(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПоляПриемника_СчетКтПриИзменении(Элемент)
	
	ОбновитьВыражениеРезультат(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - действие команды "КомандаОК".
// 
&НаКлиенте
Процедура КомандаОК(Команда)
	
	ОбновитьВыражениеРезультат(ЭтотОбъект);
	Закрыть(ВыражениеРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста 
Процедура ОбновитьВыражениеРезультат(Форма)

	ВыражениеРезультат = Форма.ШаблонВыражения;
	ВыражениеРезультат = СтрЗаменить(ВыражениеРезультат, "%ИмяДополнительногоПоля_СчетДт%", Форма.ИмяДополнительногоПоля_СчетДт);
	ВыражениеРезультат = СтрЗаменить(ВыражениеРезультат, "%ИмяДополнительногоПоля_СчетКт%", Форма.ИмяДополнительногоПоля_СчетКт);
	
	ВыражениеРезультат = СтрЗаменить(ВыражениеРезультат, "%ИмяПоляПриемника_СчетДт%"      , Форма.ИмяПоляПриемника_СчетДт);
	ВыражениеРезультат = СтрЗаменить(ВыражениеРезультат, "%ИмяПоляПриемника_СчетКт%"      , Форма.ИмяПоляПриемника_СчетКт);
	
	Форма.ВыражениеРезультат = ВыражениеРезультат;
	
КонецПроцедуры // ОбновитьВыражениеРезультат()

#КонецОбласти

