
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ТекстОшибки = НСтр("ru='Общая форма ""Предупреждение системы лицензирования БИТ.ФИНАНС"" является вспомогательной и открывается из служебных механизмов программы.';
						   |en='The general form of ""Warning BIT.FINANS licensing system"" is auxiliary and is opened from the official program mechanisms.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	ТекущаяВерсия        = " " + Параметры.ТекущаяВерсия;
	ПоддерживающаяВерсия = Параметры.ПоддерживающаяВерсия;
	ПредставлениеОбъекта = Параметры.ПредставлениеОбъекта;
	
	Элементы.ДекорацияПоддерживающаяВерсия.Заголовок = ПоддерживающаяВерсия;
	
	КлючНазначенияИспользования = Параметры.Ключ;
	КлючСохраненияПоложенияОкна = Параметры.Ключ;

	Элементы.ДекорацияИзменитьВерсию.Видимость = бит_ПолныеПрава.ДоступностьОбщихНастроек();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияИзменитьВерсиюНажатие(Элемент)
	
	Закрыть();
	ОткрытьФорму("ОбщаяФорма.бит_Константы"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияГиперСсылкаНажатие(Элемент)
	
	ФайловаяСистемаКлиент.ЗапуститьПрограмму("http://www.bitfinance.ru/products/");
	
КонецПроцедуры

#КонецОбласти
