
#Область ОбработчикиСобытийФормы
									 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_УправлениеДоступомБФ.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность =
			ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	ПрофДоступен = бит_ЛицензированиеБФСерверПереопределяемый.СборкаДоступна("ПРОФ");
	Элементы.БДДСКомандаПолучениеДанныхБюджета.Видимость 			 = ПрофДоступен;
	Элементы.БДДСКомандаКопированиеДанныхГрафиковДоговоров.Видимость = ПрофДоступен И Метаданные.РегистрыНакопления.Найти("бит_ГрафикиДоговоров") <> Неопределено;
	
	Элементы.БДДСПолучениеДанныхПоКурсовымРазницам.Видимость = НЕ бит_ОбщегоНазначения.ЭтоУТ();
		
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
		
	ЗаполнитьКэшЗначений();
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	ИспользоватьНормы = ПолучитьФункциональнуюОпцию("бит_ИспользоватьНормыВБюджетировании");
	фИменаПараметраНорм = ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ПодготовитьСтруктурыСвязи(Объект.ПараметрНорм);	
		
	ПереключательЦеновойПолитики = Объект.ЗаполнятьПоЦенамНоменклатуры;
	
	// Элементы управления для измерений несуществующих в смежном решении	
	// создаются программно для унификации кода.
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправления(Элементы, "БДДС", "БДДС",
		Элементы.БДДСКоличество);
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправления(Элементы, "ЗависимыеОбороты", "ЗависимыеОбороты", 
		Элементы.ЗависимыеОборотыКоличество);
	
	// Отображение дополнительных измерений в табличных полях.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, "БДДС",
		фКэшЗначений.ИзмеренияДоп, фКэшЗначений.НастройкиИзмерений);
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, "ЗависимыеОбороты",
		фКэшЗначений.ИзмеренияДоп, фКэшЗначений.НастройкиИзмерений);
	      	
	// Оформление таблиц.
	ОформитьТаблицу("БДДС");
	УстановитьПривилегированныйРежим(Истина);
	ОформитьТаблицу("ЗависимыеОбороты");
	УстановитьПривилегированныйРежим(Ложь);
	
	// Проверка наличия зафиксированных бюджетных данных.
	Если Объект.Проведен Тогда
		УстановитьПривилегированныйРежим(Истина);
		бит_Бюджетирование.ПроверитьФиксациюВФорме(ЭтотОбъект, Объект.Ссылка, Истина);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	ЭтоУХ = бит_ЛицензированиеБФСерверПереопределяемый.СборкаДоступна("УХ");
	Элементы.БДДСКомандаЗагрузитьИзПроформы.Видимость = ЭтоУХ;
	Элементы.БДДСКомандаДобавитьИзПроформы.Видимость = ЭтоУХ;
		
	// Видимость элементов управления по-умолчанию
	Элементы.ЗависимыеОборотыИтогСумма.Видимость = Ложь;
	Элементы.ЗависимыеОборотыИтогКоличество.Видимость = Ложь;
	
	УстановитьУсловноеОформление();
	
	ПодготовитьФормуНаСервере(СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = УникальныйИдентификатор Тогда
		Если ИмяСобытия = "ИзмененСтатус" Тогда
			
			ОбработкаОповещенияИзмененияСтатуса();
			
		ИначеЕсли ИмяСобытия = "ВосстановитьЗагруженныеИзExcelДанные" Тогда
			
			ВосстановитьЗагруженныеИзExcelДанные(Параметр.ИмяТабЧасти, Параметр.Ссылка);
						
		ИначеЕсли ИмяСобытия = "ПолучениеДанныхБюджета" Тогда
			
			ОбработкаПодбораБюджета(Параметр);
			
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
		
	НаименованиеТаблицы = НСтр("ru = 'БДДС'; en = 'BDDS'");
	бит_УправлениеДоступомБФ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект.БДДС, НаименованиеТаблицы);
	
	Если бит_НастройкиДоступностиЭлементовФормКлиентСервер.ФормаПодготовлена(ЭтотОбъект) Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Автовидимость колонок.
	Элементы.ФормаАвтовидимостьКолонок.Пометка = фАвтовидимостьКолонок; 	
	УстановитьАвтовидимостьКолонок(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_БюджетнаяОперация";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
 	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность =
			ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект,
																						ТекущийОбъект,
																						ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
		
	ДобавитьВКэш("Дата");
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)

	ПересчитатьСуммы   = Ложь;
	ПерезаполнитьНормы = Ложь;
	
	ИзменитсяВалюта = ИзменитсяВалюта();
	СпроситьОНормах = ИспользоватьНормы И Объект.БДДС.Количество() > 0
							И (НЕ Объект.ЗаполнятьПоЦенамНоменклатуры)
							И ЗначениеЗаполнено(Объект.ПараметрНорм);
	
	Если ИзменитсяВалюта ИЛИ СпроситьОНормах Тогда
	
		ПараметрыФормы = Новый Структура("ИзменитсяВалюта, СпроситьОНормах", ИзменитсяВалюта, СпроситьОНормах);
		
		ОповещениеЗакрытиеФормы = Новый ОписаниеОповещения("ЗакрытиеФормыВопросПриИзмененииСценария", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.бит_ВопросПриИзмененииСценария", ПараметрыФормы, ЭтотОбъект,,,, ОповещениеЗакрытиеФормы);
		
	Иначе
		
		// Изменяем валюту документа на валюту из сценария.
		Если ЗначениеЗаполнено(Объект.Сценарий) Тогда
			ИзменениеСценарияСервер(ПересчитатьСуммы, ПерезаполнитьНормы);
		КонецЕсли;   
		ДобавитьВКэш("Сценарий");
		ДобавитьВКэш("ВалютаДокумента");

	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияСуммПриИзменении(Элемент)
	
	СтараяЕдиницаИзмеренияСумм = КонтролируемыеРеквизиты.ЕдиницаИзмеренияСумм;
	
	Если СтараяЕдиницаИзмеренияСумм <> Объект.ЕдиницаИзмеренияСумм Тогда
		Если Объект.БДДС.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru='Изменилась единица измерения сумм. Пересчитать суммы в документе?';
								|en='Unit of measuring the totals was changed. Recalculate documents’s total?'");
			ОповещениеВопрос = Новый ОписаниеОповещения("ВопросЕдиницаИзмеренияСуммПриИзменении", ЭтотОбъект, СтараяЕдиницаИзмеренияСумм);
			ТекстЗаголовка = НСтр("ru='Изменение единицы измерения сумм';en='Change units of measuring the totals'");
			ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 15, КодВозвратаДиалога.Отмена, ТекстЗаголовка); 
		Иначе
			ДобавитьВКэш("ЕдиницаИзмеренияСумм");
		КонецЕсли; 	
	КонецЕсли;
			
КонецПроцедуры

// Обработка оповещения вопроса пользователю. 
// 
// Параметры:
//  Ответ - Строка.
// 
&НаКлиенте
Процедура ВопросЕдиницаИзмеренияСуммПриИзменении(Ответ, СтараяЕдиницаИзмеренияСумм) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ИзменениеЕдиницыИзмерения(СтараяЕдиницаИзмеренияСумм);
		ДобавитьВКэш("ЕдиницаИзмеренияСумм");
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ДобавитьВКэш("ЕдиницаИзмеренияСумм");
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		Объект.ЕдиницаИзмеренияСумм = СтараяЕдиницаИзмеренияСумм;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	Если Объект.БДДС.Количество() > 0 И Объект.ВалютаДокумента <> КонтролируемыеРеквизиты.ВалютаДокумента Тогда
		ТекстВопроса = НСтр("ru='Изменена валюта документа. Пересчитать суммы в документе?';
							|en='Currency of the document was changed. Recalculate document total?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросВалютаДокументаПриИзменении", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 15, КодВозвратаДиалога.Нет);
	Иначе
		ИзменениеВалютыСервер(Ложь, КонтролируемыеРеквизиты.ВалютаДокумента);
		ДобавитьВКэш("ВалютаДокумента");
	КонецЕсли; 
		
КонецПроцедуры

// Обработка оповещения вопроса пользователю. 
// 
// Параметры:
//  Ответ - Строка.
// 
&НаКлиенте
Процедура ВопросВалютаДокументаПриИзменении(Ответ, ДопПараметры) Экспорт
		
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ИзменениеВалютыСервер(Истина, КонтролируемыеРеквизиты.ВалютаДокумента);
		ДобавитьВКэш("ВалютаДокумента");
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ИзменениеВалютыСервер(Ложь, КонтролируемыеРеквизиты.ВалютаДокумента);
		ДобавитьВКэш("ВалютаДокумента");
	Иначе	 
		ИзвлечьИзКэша("ВалютаДокумента");
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура РежимЗависимыхОборотовПриИзменении(Элемент)
	
	ТекущийРежимЗависимыхОборотов = КонтролируемыеРеквизиты.РежимЗависимыхОборотов;
	Если ТекущийРежимЗависимыхОборотов = Объект.РежимЗависимыхОборотов Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ЗависимыеОбороты.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Зависимые обороты будут очищены. Продолжить?';
							|en='Dependent speed will be cleared. Continue?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросРежимЗависимыхОборотовПриИзменении", ЭтотОбъект, ТекущийРежимЗависимыхОборотов);
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
	Иначе
		ДобавитьВКэш("РежимЗависимыхОборотов");
	КонецЕсли;
	
КонецПроцедуры

// Обработка оповещения вопроса пользователю. 
// 
// Параметры:
//  Ответ - Строка.
// 
&НаКлиенте
Процедура ВопросРежимЗависимыхОборотовПриИзменении(Ответ, ТекущийРежимЗависимыхОборотов) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда 			
		Объект.ЗависимыеОбороты.Очистить();  					
	Иначе
		РежимЗависимыхОборотов = ТекущийРежимЗависимыхОборотов;
	КонецЕсли;

	ДобавитьВКэш("РежимЗависимыхОборотов");

КонецПроцедуры

&НаКлиенте
Процедура РежимЗависимыхОборотовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_РежимыЗависимыхОборотов.Автоматический"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_РежимыЗависимыхОборотов.НеФормировать"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрНормПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПараметрНорм) И Объект.БДДС.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Перезаполнить нормы согласно выбранного параметра?';
							|en='Refill rates according to the selected option?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросПараметрНормПриИзменении", ЭтотОбъект, Ложь);
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 15, КодВозвратаДиалога.Отмена);
	Иначе
		ИзменениеПараметраНорм(Ложь);
		ДобавитьВКэш("ПараметрНорм");
	КонецЕсли; 
		
КонецПроцедуры

// Обработка оповещения вопроса пользователю. 
// 
// Параметры:
//  Ответ - Строка.
//  флПерезаполнить - Булево.
// 
&НаКлиенте
Процедура ВопросПараметрНормПриИзменении(Ответ, Дополнительно) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		Дополнительно = Истина;
		ИзменениеПараметраНорм(Дополнительно);
		ДобавитьВКэш("ПараметрНорм");
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Дополнительно = Ложь;			 
		ИзменениеПараметраНорм(Дополнительно);
		ДобавитьВКэш("ПараметрНорм");
	Иначе	 
		ИзвлечьИзКэша("ПараметрНорм");
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура ПереключательЦеновойПолитикиПриИзменении(Элемент)
	
	Объект.ЗаполнятьПоЦенамНоменклатуры = ПереключательЦеновойПолитики;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	
	Объект.ЗаполнятьПоЦенамНоменклатуры = Истина;
	
	Перезаполнить = Ложь;
	Если ЗначениеЗаполнено(Объект.ТипЦен) И Объект.БДДС.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Перезаполнить цены по выбранному типу цен?';
							|en='Refill prise according to the selected option?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросТипЦенПриИзменении", ЭтотОбъект, Перезаполнить);
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 15, КодВозвратаДиалога.Отмена);
	Иначе
		ИзменениеТипаЦен(Перезаполнить);
		ДобавитьВКэш("ТипЦен");
	КонецЕсли;
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ВопросТипЦенПриИзменении(Ответ, Дополнительно) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		Дополнительно = Истина;
		ИзменениеТипаЦен(Дополнительно);
		ДобавитьВКэш("ТипЦен");
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Дополнительно = Ложь;			 
		ИзменениеТипаЦен(Дополнительно);
		ДобавитьВКэш("ТипЦен");
	Иначе	 
		ИзвлечьИзКэша("ТипЦен");
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура ПанельОсновнаяПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекущаяСтраницаЗависимые = ?(ТекущаяСтраница.Имя = "СтраницаЗависимыеОбороты", Истина, Ложь);
	Элементы.ЗависимыеОборотыИтогСумма.Видимость = ТекущаяСтраницаЗависимые;
	Элементы.ЗависимыеОборотыИтогКоличество.Видимость = ТекущаяСтраницаЗависимые;
	Элементы.БДДСИтогСумма.Видимость = НЕ ТекущаяСтраницаЗависимые;
	Элементы.БДДСИтогКоличество.Видимость = НЕ ТекущаяСтраницаЗависимые;
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И НЕ ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	
	ЦФОПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СверхБюджетаПриИзменении(Элемент)
	
	Если НЕ Объект.СверхБюджета Тогда
		Объект.СписатьЛимиты = Ложь;	
	КонецЕсли;
	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБДДС

&НаКлиенте
Процедура БДДСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;	
	
	Если НоваяСтрока Тогда 
		Если НЕ Копирование Тогда
			бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(ТекущиеДанные, фКэшЗначений.ИзмеренияДоп,
				фКэшЗначений.НастройкиИзмерений);
			ТекущиеДанные.Период = НачалоТекущегоПериода();
		КонецЕсли;
	КонецЕсли;															
	
КонецПроцедуры

&НаКлиенте
Процедура БДДСПослеУдаления(Элемент)
	
	ПослеУдаленияСтрокиТаблицыБДДС();

КонецПроцедуры

&НаКлиенте
Процедура БДДСПериодПриИзменении(Элемент)
	 
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;
	// Выбранный период приводится на начало периода в зависимости от реквизита "Периодичность" выбранного сценария.
	ИзменениеПериодаТабличнойЧасти(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура БДДССтатьяОборотовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;
	бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(ТекущиеДанные, фКэшЗначений.ИзмеренияДоп, фКэшЗначений.НастройкиИзмерений);
	ИзменениеСтатьиОборотовТабличнойЧасти(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура БДДСКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.БДДС.ТекущиеДанные;
	бит_БюджетированиеКлиентСервер.РассчитатьПоНорме(ТекущаяСтрока, ИспользоватьНормы);
	
КонецПроцедуры

&НаКлиенте
Процедура БДДСНормаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.БДДС.ТекущиеДанные;
	бит_БюджетированиеКлиентСервер.РассчитатьПоНорме(ТекущаяСтрока, ИспользоватьНормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗависимыеОбороты

&НаКлиенте
Процедура ЗависимыеОборотыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Объект.ЗависимыеОбороты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Поле.Имя = "ЗависимыеОборотыКомментарийРасчета" И НЕ ПустаяСтрока(ТекущиеДанные.КомментарийРасчета) Тогда
		СтандартнаяОбработка = Ложь;		
		ПараметрыФормы = Новый Структура("КомментарийРасчета", ТекущиеДанные.КомментарийРасчета);
		ОткрытьФорму("ОбщаяФорма.бит_ФормаКомментарияРасчетаЗависимыхОборотов", ПараметрыФормы, ЭтотОбъект);
	Иначе
		Если НЕ ТекущиеДанные = Неопределено Тогда
			ИмяРеквизита = СтрЗаменить(Поле.Имя, "ЗависимыеОбороты", "");
			ТекЗнч = ТекущиеДанные[ИмяРеквизита];
			Если ЗначениеЗаполнено(ТекЗнч) Тогда
				ПоказатьЗначение(,ТекЗнч);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда,
																											ЭтотОбъект,
																											Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область ПодключаемыеКомандыЭлементовТаблицФормы

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля  = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	ЗаполнитьНорму(ТекущиеДанные.ПолучитьИдентификатор(), ИмяПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля  = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	Если бит_МеханизмДопИзмеренийКлиент.ЭтоАналитикаБанковскийСчет(ИмяПоля, фКэшЗначений.НастройкиИзмерений) Тогда
	  	бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(ТекущиеДанные, СтандартнаяОбработка, ИмяПоля);	
	Иначе	
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
			СтандартнаяОбработка, фКэшЗначений.НастройкиИзмерений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, фКэшЗначений.НастройкиИзмерений);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля  = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, фКэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры
	
#КонецОбласти 

&НаКлиенте
Процедура АвтовидимостьКолонок(Команда)
	
	фАвтовидимостьКолонок = Не фАвтовидимостьКолонок;	
	Элементы.ФормаАвтовидимостьКолонок.Пометка = фАвтовидимостьКолонок;
	УстановитьАвтовидимостьКолонок(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеОборотыЗаполнить(Команда)
	
	Если Объект.ЗависимыеОбороты.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Зависимые обороты будут очищены. Продолжить?';
							|en='Dependent speed will be cleared. Continue?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросЗависимыеОборотыЗаполнить", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьЗависимыеОборотыСервер();
	КонецЕсли; 
		
КонецПроцедуры

// Обработка оповещения вопроса пользователю.
// 
// Параметры:
//  Ответ - Строка.
// 
&НаКлиенте
Процедура ВопросЗависимыеОборотыЗаполнить(Ответ, ДопПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьЗависимыеОборотыСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКопированиеДанныхБюджета(Команда)
	
	ОткрытьОбработкуПолучения("КопированиеБюджета");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучениеДанныхБюджета(Команда)
	
	ОткрытьОбработкуПолучения("ПолучениеБюджета");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКопированиеДанныхГрафиковДоговоров(Команда)
	
	ОткрытьОбработкуПолучения("ГрафикДоговоров");
	                            
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСвязанномуСценарию(Команда)
	
	ОткрытьОбработкуПолучения("ЗаполнениеПоСвязанномуСценарию");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхПоКурсовымРазницам(Команда)
	
	ОчиститьСообщения(); 
	
	Если НЕ ЗначениеЗаполнено(Объект.Сценарий) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ" , "Заполнение", НСтр("ru = 'Сценарий'; en = 'scenario'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Сценарий", "Объект"); 
		Возврат;
	КонецЕсли;

	Если Объект.БДДС.Количество() <> 0 Тогда
		ТекстВопроса = НСтр("ru='Данные бюджета будут очищены. Продолжить?';
							|en='Budget data will be cleared. Continue?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("ПолучениеДанныхПоКурсовымРазницамЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьДанныеБюджетаПоКурсовымРазницам();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
// 
&НаКлиенте
Процедура ПолучениеДанныхПоКурсовымРазницамЗавершение(Ответ, ДопПараметры) Экспорт
		
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		ЗаполнитьДанныеБюджетаПоКурсовымРазницам();
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ИзменитьТабЧасть(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьИзменениеТабличнойЧасти", ЭтотОбъект);
	
	ПараметрыФормы = ПараметрыИзмененияТаблицыДокумента();
	ОткрытьФорму("Обработка.бит_ИзменениеТабличнойЧастиДокументаБюджетирования.Форма", 
		ПараметрыФормы, ЭтотОбъект,,,,Оповещение);
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ОбработатьИзменениеТабличнойЧасти(Результат, Дополнительно) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ИмяТабличнойЧасти		  = Результат.ИмяТабличнойЧасти;
	АдресВоВременномХранилище = Результат.АдресВоВременномХранилище;
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресВоВременномХранилище) Тогда
		Возврат;
	КонецЕсли; 
	
	ОбработатьИзменениеТабличнойЧастиНаСервере(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьИзПроформы(Команда)
	
	ЗагрузитьДанныеПроформы("Добавить");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьИзПроформы(Команда)
	
	Если Объект.БДДС.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзПроформыВопросЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Табличная часть будет очищена. Продолжить?';en='Tabular section will be cleaned. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	Иначе	
		ЗагрузитьДанныеПроформы("Загрузить");
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "ЗагрузитьИзПроформыВопросЗавершение".
//
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура ЗагрузитьИзПроформыВопросЗавершение(Ответ, ДополнительныеДанные) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗагрузитьДанныеПроформы("Загрузить");
	КонецЕсли; 
	
КонецПроцедуры

// Процедура загружает данные из проформы. 
//
&НаКлиенте
Процедура ЗагрузитьДанныеПроформы(Режим)

	ДополнительныеДанные = Новый Структура("Режим", Режим);
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьДанныеПроформыВыборФайлаЗавершение", ЭтотОбъект, ДополнительныеДанные);
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Фильтр = "Все файлы Excel (*.xls, *.xlsx)|*.xls; *.xlsx";
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, ДиалогВыбора);
	
КонецПроцедуры

// См. ФайловаяСистемаКлиент.ПоказатьДиалогВыбора().
//
&НаКлиенте 
Процедура ЗагрузитьДанныеПроформыВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеДанные) Экспорт

	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		
		ПолноеИмя = ВыбранныеФайлы[0];
		ТекстСостояние = НСтр("ru='Загрузка данных...';en='Loading data ...'");
		Состояние(ТекстСостояние);
		Отказ = Ложь;		
		
		Файл = бит_ОбменДаннымиКлиент.InitExcel(Ложь, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
		
		Книга = бит_ОбменДаннымиКлиент.OpenExcelFile(Файл, ПолноеИмя, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		ИмяПроформы = "";
		// Чтение данных шапки.
		ЛистШапка = Неопределено;
		Для каждого Лист Из Книга.Sheets Цикл
			// Найдем лист с данными шапки требуемой проформы.
			ПараметрыЛиста = бит_ПроформыКлиент.GetHiddenParams(Лист);
			Если ПараметрыЛиста.ВидЛиста = "Шапка"  Тогда
				ИмяПроформы = ПараметрыЛиста.ИмяПроформы;
				ЛистШапка = Лист;
			КонецЕсли; 
		КонецЦикла; 
		
		Если НЕ ЗначениеЗаполнено(ИмяПроформы) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru='Не удалось определить имя проформы. Возможно данный файл не является шаблоном проформы.';
								  |en='Could not determine the name of the pro forma. Maybe this is the template file is not pro forma.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли; 
		
		РезДанныеВидаПроформы = ДанныеВидаПроформы(ИмяПроформы);
		КомплектДанных = Новый Структура;
		КомплектДанных.Вставить("ИмяПроформы", ИмяПроформы);
		КомплектДанных.Вставить("ПсевдоМетаданные"   , РезДанныеВидаПроформы.ПсевдоМетаданные);
		КомплектДанных.Вставить("ВидФормыСбораДанных", РезДанныеВидаПроформы.ВидФормыСбораДанных);
		КомплектДанных.Вставить("ИмяТаблицыДанных   ", РезДанныеВидаПроформы.ИмяТаблицыДанных);
		
		// Чтение источников выпадающих списков.
		СпискиИсточники     = бит_ПроформыКлиентСервер.ПрочитатьСпискиИсточники(Книга);
		КомплектДанных.Вставить("СпискиИсточники", СпискиИсточники);
		
		МодельДокумента = Новый Структура;
		
		// Чтение данных шапки.
		ЛистШапка = Неопределено;
		Для каждого Лист Из Книга.Sheets Цикл
			// Найдем лист с данными шапки требуемой проформы.
			ПараметрыЛиста = бит_ПроформыКлиент.GetHiddenParams(Лист);
			Если ПараметрыЛиста.ВидЛиста = "Шапка" И ПараметрыЛиста.ИмяПроформы = ИмяПроформы Тогда
				ЛистШапка = Лист;
			КонецЕсли; 
		КонецЦикла; 
		
		Если НЕ ЛистШапка = Неопределено Тогда
			бит_ПроформыКлиент.ПрочитатьДанныеШапки(Книга, ЛистШапка, КомплектДанных.ПсевдоМетаданные, ИмяПроформы, МодельДокумента);
		КонецЕсли; 
		
		// Чтение данных табличных частей.
		бит_ПроформыКлиент.ПрочитатьДанныеТабЧастей(Книга, КомплектДанных.ПсевдоМетаданные, МодельДокумента, ИмяПроформы);
		КомплектДанных.Вставить("МодельДокумента", МодельДокумента);
		бит_ОбменДаннымиКлиент.CloseExcelFile(Книга, Ложь);
		бит_ОбменДаннымиКлиент.QuitExcel(Файл);		
		ТекстСостояние = НСтр("ru='Преобразование данных...';en='Data conversion ...'");
		Состояние(ТекстСостояние);
		ОбработатьЗагруженныеДанные(КомплектДанных, ДополнительныеДанные.Режим);
		
	КонецЕсли; 
	
КонецПроцедуры

// Функция получает настройки статьи оборотов.
//
// Параметры:
//  ТекСтатья - СправочникСсылка.бит_СтатьиОборотов.
//
// Возвращаемое значение:
//  ТекНастройка - Структура.
//
&НаСервере
Функция ПолучитьНастройкиСтатьи(Знач ТекСтатья) 

	НастройкиСтатей = Новый Соответствие;
	бит_Бюджетирование.ПолучитьНастройкиСтатейОборотов(ТекСтатья, НастройкиСтатей);
	ТекНастройка = НастройкиСтатей[ТекСтатья];
	Возврат ТекНастройка;
	
КонецФункции

&НаКлиенте
Процедура КомандаРаспределить(Команда)
	
    ТекЭлемент = Элементы.БДДС.ТекущийЭлемент;
	Если ТекЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = СтрЗаменить(ТекЭлемент.Имя, "БДДС", "");
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;
	
	Если НЕ РаспределениеПоддерживается(ТекущиеДанные, ТекЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекЭлемент = Элементы.БДДСПериод Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Вид", ПредопределенноеЗначение("Перечисление.бит_ВидыПрофилейРаспределения.ПоПериодам"));
		ПараметрыФормы.Вставить("Сценарий", Объект.Сценарий);
		
		Оповещение = Новый ОписаниеОповещения("РаспределитьПоАналитикеЗавершение", ЭтотОбъект);
		РежимОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		
	Иначе
		ТекущееЗначение = ТекущиеДанные[ИмяКолонки];

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Вид", ПредопределенноеЗначение("Перечисление.бит_ВидыПрофилейРаспределения.ПоАналитике"));
		ПараметрыФормы.Вставить("ИмяКолонки", ИмяКолонки);
		ПараметрыФормы.Вставить("ТекущееЗначение", ТекущееЗначение);
		
		Оповещение = Новый ОписаниеОповещения("РаспределитьПоАналитикеЗавершение", ЭтотОбъект);
		РежимОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	КонецЕсли; 
	
	ОткрытьФорму("Обработка.бит_РаспределениеБюджетныхДанныхПоПрофилю.Форма",ПараметрыФормы,ЭтотОбъект,,,,Оповещение,РежимОкна);
	
КонецПроцедуры

// Процедура обработчик оповещения "РаспределитьПоАналитикеЗавершение".
//
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура РаспределитьПоАналитикеЗавершение(РезДанные, ДополнительныеДанные) Экспорт

	Если ТипЗнч(РезДанные) = Тип("Структура") Тогда
		МассивСтрок = Элементы.БДДС.ВыделенныеСтроки;
		ВыполнитьРаспределение(МассивСтрок, РезДанные);
	КонецЕсли; 
	
КонецПроцедуры

#Область РаботаСExcel

&НаКлиенте
Процедура ЗагрузитьЧерезТабДокДанныеБюджета(Команда)
    
    ОткрытьФормуЗагрузкиДанныхЧерезТабДок("БДДС");
	
КонецПроцедуры // ЗагрузитьЧерезТабДокДанныеБюджета()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемыСвойства

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойств

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбщиеСлужебныеПроцедурыИФункции

// Функция определяет вариант решения.
// 
// Параметры:
// 
// 
// Возвращаемое значение:
//  Результат - Булево.
// 
&НаСервереБезКонтекста
Функция ЭтоБП()

	Результат = Ложь;
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	МетаданныеОбъекта = Метаданные.Документы.бит_БюджетнаяОперация;
	фКэшЗначений = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	фКэшЗначений.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
	// Данные по дополнительным аналитикам.
	фКэшЗначений.Вставить("НастройкиИзмерений", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	фКэшЗначений.Вставить("ИзмеренияДоп"      , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним"));
	
	// Произвольные измерения.
	фКэшЗначений.Вставить("Измерения"         , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Произвольные", "Синоним"));
	
	// Параметры, используемые для управления автовидимостью колонок.
	фКэшЗначений.Вставить("НастройкаВидимостиКолонок"	 , Новый Структура);
	фКэшЗначений.Вставить("МассивСтатей_БДДС"			 , Новый Массив);
	фКэшЗначений.Вставить("МассивСтатей_ЗависимыеОбороты", Новый Массив);
	фКэшЗначений.Вставить("СтруктураДопПолей", Новый Структура("Учет_Сумма, Учет_Количество", "Норма","Норма"));
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;
	
	бит_НастройкиДоступностиЭлементовФормКлиентСервер.РазблокироватьЭлементы(Форма);
	
	Если Форма.ИспользоватьНормы Тогда
		Элементы.ПараметрНорм.Видимость = НЕ Объект.ЗаполнятьПоЦенамНоменклатуры;
		Элементы.ТипЦен.Видимость       = Объект.ЗаполнятьПоЦенамНоменклатуры;
	Иначе
		Элементы.ПереключательЦеновойПолитики.Видимость = Ложь;
		Элементы.ПараметрНорм.Видимость                 = Ложь;
		Элементы.ТипЦен.Видимость                       = Истина;
		Элементы.ТипЦен.Заголовок                       = НСтр("ru = 'Заполнять по ценам номенклатуры';
															   |en = 'Fill in by item prices'");
	КонецЕсли;
	
	Элементы.СписатьЛимиты.Видимость   = Форма.НеУчитыватьСверхБюджета;
	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;
	
	Если Форма.ПроводитьПослеУтверждения 
		И Объект.Проведен И Объект.ОтправленНаСогласование
		И Объект.РежимПринятияКУчету = 1
		И Форма.ТипСтатуса <> ПредопределенноеЗначение("Перечисление.бит_ТипыСтатусовОбъектов.Утвержден") Тогда
		Элементы.ПредупреждениеОПринятиеКУчетуПослеУтверждения.Видимость = Истина;
	Иначе
		Элементы.ПредупреждениеОПринятиеКУчетуПослеУтверждения.Видимость = Ложь;
	КонецЕсли;

	бит_НастройкиДоступностиЭлементовФормКлиентСервер.ЗаблокироватьЭлементы(Форма);

КонецПроцедуры

// Процедура оформляет табличное поле.
// 
// Параметры:
//  ИмяТаблицы 		- Строка
//  СтатьяОборотов 	- СправочникСсылка.бит_СтатьиОборотов.
// 
&НаСервере
Процедура ОформитьТаблицу(ПрефиксТаблицы, СтатьяОборотов = Неопределено) 
	
	// ----------------------------------------------------------------------
	// Оформление реквизитов строк по статьям оборотов.
	ПрефиксКонтейнера = "Объект.";
	
	Если СтатьяОборотов = Неопределено Тогда
		// Формирование массива статей, по которым нужно добавить элементы УО.
		ТаблицаПоиска = Объект[ПрефиксТаблицы].Выгрузить();
		МассивСтатей = ТаблицаПоиска.ВыгрузитьКолонку("СтатьяОборотов");
		бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСтатей);
		ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].ЗагрузитьЗначения(МассивСтатей);
	Иначе // Работаем только с одной статьей оборотов.		
		МассивСтатей = Новый Массив; 		
		НайденноеЗначение = ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].НайтиПоЗначению(СтатьяОборотов);
		Если НайденноеЗначение = Неопределено Тогда	
			МассивСтатей.Добавить(СтатьяОборотов);
			ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].Добавить(СтатьяОборотов);		
		КонецЕсли;  		
	КонецЕсли;	
	
	ПараметрыОформления = бит_РаботаСДиалогамиСервер.НовыеПараметрыОформленияСтатей();
	ПараметрыОформления.ПрефиксКонтейнера                 = ПрефиксКонтейнера;
	ПараметрыОформления.ПрефиксТаблицы                    = ПрефиксТаблицы;
	ПараметрыОформления.ОтметитьОбязательныеРазрезыСтатей = Истина;
	ПараметрыОформления.ПоляОформления                    = фКэшЗначений.СтруктураДопПолей;
	бит_РаботаСДиалогамиСервер.ОформитьТаблицуПоСтатьямОборотов(УсловноеОформление, МассивСтатей, ПараметрыОформления);
	
КонецПроцедуры

// Процедура устанавливает автоматически видимость колонок таблицы БДДС.
// 
// Параметры:
//  ОбновлятьБезусловно - Булево (по умолчанию = Ложь).
// 
&НаСервере
Процедура УстановитьАвтовидимостьКолонок(Знач ОбновлятьБезусловно = Ложь)
	
	ИмяТабличнойЧасти = "БДДС";
	ИмяМассива = "МассивСтатей_" + ИмяТабличнойЧасти;
	Если фАвтовидимостьКолонок Тогда
		ТаблРез = Объект[ИмяТабличнойЧасти].Выгрузить();
		МассивСтатей = ТаблРез.ВыгрузитьКолонку("СтатьяОборотов");
		НеобходимоИзменение = бит_РаботаСДиалогамиСервер.НужноИзменитьВидимостьКолонокБюджета(МассивСтатей, фКэшЗначений[ИмяМассива],
			фКэшЗначений.НастройкаВидимостиКолонок);
		Если НеобходимоИзменение Тогда
			бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы, фКэшЗначений.НастройкаВидимостиКолонок,
				ИмяТабличнойЧасти);
		КонецЕсли; 
	Иначе
		Если ОбновлятьБезусловно Тогда
			НеобходимоИзменение = бит_РаботаСДиалогамиСервер.НужноИзменитьВидимостьКолонокБюджета(Новый Массив, фКэшЗначений[ИмяМассива],
				фКэшЗначений.НастройкаВидимостиКолонок);
																		
			бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы, фКэшЗначений.НастройкаВидимостиКолонок,
				ИмяТабличнойЧасти);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеУдаленияСтрокиТаблицыБДДС()
	
	УстановитьАвтовидимостьКолонок();
	
КонецПроцедуры

// Процедура обрабатывает изменение валюты документа.
// 
// 
&НаСервере
Процедура ИзменениеВалютыСервер(Знач ПересчитатьСуммы, Знач ВалютаНач = Неопределено)
	
	СтрНач = бит_КурсыВалют.СтруктураКурса(ВалютаНач, Объект.КурсДокумента, Объект.КратностьДокумента);
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ИзменениеВалютыОбъект();
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	Если ПересчитатьСуммы И ЗначениеЗаполнено(ВалютаНач) Тогда
		СтрКон = бит_КурсыВалют.СтруктураКурса(Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);
		КурсыДок = Новый Структура("Нач, Кон", СтрНач, СтрКон);
		ПересчитатьТабличныеЧастиПоВалюте(КурсыДок);
	КонецЕсли; // Пересчитать.
	
КонецПроцедуры

// Процедура обрабатывает изменение сценария.
// 
&НаСервере
Процедура ИзменениеСценарияСервер(Знач ПересчитатьСуммы, Знач ПерезаполнитьНормы)
	
	ВалютаНач = Объект.ВалютаДокумента;
	СтрНач = бит_КурсыВалют.СтруктураКурса(ВалютаНач, Объект.КурсДокумента, Объект.КратностьДокумента);	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ИзменениеСценарияОбъект();
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	СтрКон = бит_КурсыВалют.СтруктураКурса(Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);
	Если ПересчитатьСуммы И ЗначениеЗаполнено(ВалютаНач) Тогда
		КурсыДок = Новый Структура("Нач, Кон", СтрНач, СтрКон);
		ПересчитатьТабличныеЧастиПоВалюте(КурсыДок);
	КонецЕсли; // Пересчитать.
	Если ПерезаполнитьНормы И НЕ Объект.ЗаполнятьПоЦенамНоменклатуры Тогда
		бит_Бюджетирование.ПерезаполнитьНормыТабЧасти(Объект.ПараметрНорм, Объект.Сценарий, Объект.БДДС, СтрКон, фИменаПараметраНорм, Объект.ЕдиницаИзмеренияСумм);
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеЕдиницыИзмерения(Знач ТекущаяЕдиницаИзмеренияСумм)

	ВыполнитьПересчетРазмерностиСумм(ТекущаяЕдиницаИзмеренияСумм);
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеПериодаТабличнойЧасти(Знач ИдентификаторСтроки)
	
	ТекущиеДанные = Объект.БДДС.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьНорму(ТекущиеДанные, "Период");
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСтатьиОборотовТабличнойЧасти(Знач ИдентификаторСтроки)
	
	Если ТипЗнч(ИдентификаторСтроки) = Тип("Число") Тогда
		ТекущиеДанные = Объект.БДДС.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе
		ТекущиеДанные = ИдентификаторСтроки;
	КонецЕсли; 
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДанныеПоСтатье(ТекущиеДанные);
	ОформитьТаблицу("БДДС", ТекущиеДанные.СтатьяОборотов);		
	УстановитьАвтовидимостьКолонок();
	
КонецПроцедуры

// Процедура устанавливает данные в строке табличной 
// части в зависимости от настроек статьи оборотов. 
//
// Параметры:
//  ТекущиеДанные - СтрокаТабличнойЧасти.
//
&НаСервере
Процедура УстановитьДанныеПоСтатье(ТекущиеДанные)

	ЗаполнитьНорму(ТекущиеДанные, "СтатьяОборотов");
	НастройкиСтатьи = Справочники.бит_СтатьиОборотов.ПолучитьНастройки(ТекущиеДанные.СтатьяОборотов);
	бит_Бюджетирование.УстановитьИспользованиеРесурсов(ТекущиеДанные, НастройкиСтатьи);
	бит_Бюджетирование.УстановитьИспользованиеАналитики(ТекущиеДанные, НастройкиСтатьи, фКэшЗначений.Измерения);
	
КонецПроцедуры

// Процедура выполняет пересчет размерности сумм в документе.
// 
// Параметры:
//  НачЕдиницаИзмеренияСумм - ПеречислениеСсылка.бит_ЕдиницыИзмеренияСумм.
// 
&НаСервере
Процедура ВыполнитьПересчетРазмерностиСумм(НачЕдиницаИзмеренияСумм)
	
	РазмерностьНач = бит_ОбщегоНазначения.ПолучитьРазмерностьЕдиницыИзмеренияСумм(НачЕдиницаИзмеренияСумм);
	РазмерностьКон = бит_ОбщегоНазначения.ПолучитьРазмерностьЕдиницыИзмеренияСумм(Объект.ЕдиницаИзмеренияСумм);
	Для каждого ТекСтрока Из Объект.БДДС Цикл
		Если ТекСтрока.СтатьяОборотов.ЭтоКоэффициент Тогда
			// Безразмерные величины не пересчитываем.
			Продолжить;
		КонецЕсли; 

		ТекСтрока.Сумма = бит_ОбщегоНазначенияКлиентСервер.ПересчитатьИзРазмерностиВРазмерность(ТекСтрока.Сумма, РазмерностьНач,
								РазмерностьКон);
		ТекСтрока.Норма = бит_ОбщегоНазначенияКлиентСервер.ПересчитатьИзРазмерностиВРазмерность(ТекСтрока.Норма, РазмерностьНач,
								РазмерностьКон);
	КонецЦикла;
	Для каждого СтрокаОборота Из Объект.ЗависимыеОбороты Цикл
		СтрокаОборота.Сумма = бит_ОбщегоНазначенияКлиентСервер.ПересчитатьИзРазмерностиВРазмерность(СтрокаОборота.Сумма,
								РазмерностьНач, РазмерностьКон);
	КонецЦикла;
	
КонецПроцедуры
  
// Процедура заполняет зависимые обороты.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура ЗаполнитьЗависимыеОборотыСервер()

	Объект.ЗависимыеОбороты.Очистить();
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьЗависимыеОбороты();
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	ОформитьТаблицу("ЗависимыеОбороты");
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ИзменениеПараметраНорм(Знач ПерезаполнитьНормы)

	фИменаПараметраНорм = ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ПодготовитьСтруктурыСвязи(Объект.ПараметрНорм);
	Если ПерезаполнитьНормы Тогда
		СтрКурсаДок = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);		
		бит_Бюджетирование.ПерезаполнитьНормыТабЧасти(Объект.ПараметрНорм, Объект.Сценарий, Объект.БДДС, СтрКурсаДок, фИменаПараметраНорм, Объект.ЕдиницаИзмеренияСумм);
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНорму(Знач ИдентификаторСтроки, ИмяПоля) 

	Если ТипЗнч(ИдентификаторСтроки) = Тип("Число") Тогда
		ТекущиеДанные = Объект.БДДС.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе	
		ТекущиеДанные = ИдентификаторСтроки;
	КонецЕсли; 
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчетаЦен = ПараметрыРасчетаЦен();
	
	Если ПараметрыРасчетаЦен.ЗаполнитьПоНорме Тогда
		Если бит_БюджетированиеКлиентСервер.ВыполнятьЗаполнениеНормы(Объект.ПараметрНорм, фИменаПараметраНорм, ИмяПоля, ИспользоватьНормы) Тогда
			Если Объект.Сценарий.ИспользоватьКурсыСценария Тогда
				СтрКурса    = бит_Бюджетирование.ПолучитьКурсПоСценарию(Объект.Сценарий, Объект.ВалютаДокумента, ТекущиеДанные.Период);
				СтрКурсаДок = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаДокумента, СтрКурса.Курс, СтрКурса.Кратность);
			Иначе
				СтрКурсаДок = ПараметрыРасчетаЦен.СтруктураКурсаДокумента;
			КонецЕсли; 
			бит_Бюджетирование.ЗаполнитьНормуВСтроке(ТекущиеДанные, Объект.ПараметрНорм, Объект.Сценарий, СтрКурсаДок, фИменаПараметраНорм, Объект.ЕдиницаИзмеренияСумм);
		КонецЕсли;
	ИначеЕсли ПараметрыРасчетаЦен.ЗаполнитьПоТипуЦен Тогда
		Если ИмяПоля = "Период" ИЛИ ИмяПоля = "СтатьяОборотов" ИЛИ ИмяПоля = ПараметрыРасчетаЦен.АналитикаНоменклатуры Тогда
			ЗаполнитьЦенуВСтрокеСервер(ТекущиеДанные, ПараметрыРасчетаЦен);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦенуВСтрокеСервер(ТекущиеДанные, ПараметрыРасчетаЦен)
	
	ДанныеСтрокиТаблицы	= Новый Структура("Номенклатура, Количество, Цена, Сумма, Период");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущиеДанные);
	ДанныеСтрокиТаблицы.Номенклатура = ТекущиеДанные[ПараметрыРасчетаЦен.АналитикаНоменклатуры];
	ДанныеСтрокиТаблицы.Цена         = ТекущиеДанные.Норма;
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущиеДанные);
	
	бит_Бюджетирование.ПерезаполнитьЦеныСтрокиТабличнойЧасти(ДанныеСтрокиТаблицы, ПараметрыРасчетаЦен, ТекущиеДанные.СтатьяОборотов);
	ТекущиеДанные.Норма = ДанныеСтрокиТаблицы.Цена;
	ТекущиеДанные.Сумма = ДанныеСтрокиТаблицы.Сумма;
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеТипаЦен(Знач ПерезаполнитьЦены)

	Если ПерезаполнитьЦены Тогда
		ПараметрыРасчетаЦен = ПараметрыРасчетаЦен();
		бит_Бюджетирование.ПерезаполнитьЦеныТабличнойЧасти(Объект.БДДС, ПараметрыРасчетаЦен);
	КонецЕсли; 

КонецПроцедуры

// Функция определяет изменится ли валюта при изменении сценария.
// 
// Возвращаемое значение:
//  флИзменится - Булево.
// 
&НаСервере
Функция ИзменитсяВалюта()

	Изменится = Ложь;
	Если ЗначениеЗаполнено(Объект.Сценарий)
		И Объект.Сценарий.Валюта <> Объект.ВалютаДокумента
		И Объект.БДДС.Количество() > 0 Тогда
		Изменится = Истина;
	КонецЕсли; 
	Возврат Изменится;
	
КонецФункции

// Выполняет пересчеты табличных частей при изменении валюты. 
// 
// Параметры:
//  КурсыДок - Структура.
// 
&НаСервере
Процедура ПересчитатьТабличныеЧастиПоВалюте(КурсыДок)
	
	ПоляПересчета = Новый Массив;
	ПоляПересчета.Добавить("Сумма");
	ПоляПересчета.Добавить("Норма");		
	бит_Бюджетирование.ПересчитатьТабЧастьПоВалюте(Объект.БДДС, Объект.Сценарий, КурсыДок, ПоляПересчета);
	
	ПоляПересчета = Новый Массив;
	ПоляПересчета.Добавить("Сумма");
	бит_Бюджетирование.ПересчитатьТабЧастьПоВалюте(Объект.ЗависимыеОбороты, Объект.Сценарий, КурсыДок, ПоляПересчета);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧасть(Знач ВыбранноеЗначение, Знач ОчищатьДанные)
	
	Модифицированность = Истина;
	Если ОчищатьДанные Тогда	
		Объект.БДДС.Очистить();	
	КонецЕсли; 
	
	ТаблицаДокумента         = Объект.БДДС.Выгрузить();
	ТаблицаОборотыПоБюджетам = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОборотовПоБюджетам);
	
	Если СтрСравнить(ВыбранноеЗначение.Режим, "Заменить") = 0 Тогда
		Обработки.бит_ПолучениеДанныхБюджета.ЗаполнитьТабЧастьСЗаменой(ТаблицаОборотыПоБюджетам, ТаблицаДокумента);
	Иначе
		Обработки.бит_ПолучениеДанныхБюджета.ЗаполнитьТабЧасть(ТаблицаОборотыПоБюджетам, ТаблицаДокумента);
	КонецЕсли;
	Объект.БДДС.Загрузить(ТаблицаДокумента);
	
	ОформитьТаблицу("БДДС");
	ТекстСообщения = НСтр("ru='Заполнение завершено.';en='Filling in completed.'");
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеБюджетаПоКурсовымРазницам()
		
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("Дата", 				Объект.Дата);
	ПараметрыФормы.Вставить("Сценарий", 			Объект.Сценарий);
	ПараметрыФормы.Вставить("КурсДокумента", 		Объект.КурсДокумента);
	ПараметрыФормы.Вставить("КратностьДокумента", 	Объект.КратностьДокумента);
	ПараметрыФормы.Вставить("ЕдиницаИзмеренияСумм", Объект.ЕдиницаИзмеренияСумм);
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьДанныеБюджетаПоКурсовымРазницамЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.бит_БюджетнаяОперация.Форма.ПолучениеДанныхПоКурсовымРазницам", ПараметрыФормы, 
		ЭтотОбъект, ЭтотОбъект,,, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеБюджетаПоКурсовымРазницамЗавершение(Результат, Дополнительно) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) ИЛИ НЕ ЭтоАдресВременногоХранилища(Результат) Тогда
		Возврат;	
	КонецЕсли;	
	
	ЗаполнитьДанныеБюджетаПоКурсовымРазницамЗавершениеНаСервере(Результат);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеБюджетаПоКурсовымРазницамЗавершениеНаСервере(АдресКурсовыхРазниц)

	КурсовыеРазницы = ПолучитьИзВременногоХранилища(АдресКурсовыхРазниц);
	Объект.БДДС.Загрузить(КурсовыеРазницы);
    ОформитьТаблицу("БДДС");
    Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеТабличнойЧастиНаСервере(Знач ПараметрыОповещения)

	ИмяТабличнойЧасти		  = ПараметрыОповещения.ИмяТабличнойЧасти;
	АдресВоВременномХранилище = ПараметрыОповещения.АдресВоВременномХранилище;
		
	Модифицированность = Истина;
	ДанныеЗаполнения   = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Индекс = 0;
	Для каждого СтрокаТаблицы Из ДанныеЗаполнения Цикл
		ТекущиеДанные		  = Объект.БДДС[Индекс];
		ТекущаяСтатьяОборотов = ТекущиеДанные.СтатьяОборотов;
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтрокаТаблицы);
		
		Если ТекущиеДанные.СтатьяОборотов <> ТекущаяСтатьяОборотов Тогда
			ИзменениеСтатьиОборотовТабличнойЧасти(ТекущиеДанные);
		КонецЕсли; 
		Индекс = Индекс + 1;
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораБюджета(ВыбранноеЗначение)
	
	Если ВыбранноеЗначение.Режим = "Заполнить" И Объект.БДДС.Количество() > 0 Тогда 
		// В режиме заполнения существующие данные следует очистить.
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
		бит_РаботаСДиалогамиКлиент.ЗапросПодтвержденияОчисткиДанных(ЭтотОбъект, ДопПараметры);
	Иначе
		ЗаполнитьТабЧасть(ВыбранноеЗначение, Ложь);
	КонецЕсли; // Режим заполнения.
	
КонецПроцедуры

// Оповещение на вопрос о подтверждение очистки.
//
// Параметры:
//  Результат    - КодВозвратаДиалога.
//  ДопПараметры - Структура.
//
&НаКлиенте
Процедура ОтветНаПотверждениеОчистки(РезультатОтвет, ДопПараметры) Экспорт
	
	ОчищатьДанные = РезультатОтвет = КодВозвратаДиалога.Да;    
    Если ОчищатьДанные Тогда
        ЗаполнитьТабЧасть(ДопПараметры.ВыбранноеЗначение, ОчищатьДанные);
    КонецЕсли;       
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеВидаПроформы(Знач ИмяПроформы)

	ДанныеВидаПроформы = Документы.бит_ФормаСбораДанных.ДанныеВидаПроформы(ИмяПроформы);
	Возврат ДанныеВидаПроформы;

КонецФункции

&НаСервере
Процедура ОбработатьЗагруженныеДанные(Знач КомплектДанных, Знач Режим)
	
	СпискиИсточники  = КомплектДанных.СпискиИсточники;
	ПсевдоМетаданные = КомплектДанных.ПсевдоМетаданные;
	МодельДокумента  = КомплектДанных.МодельДокумента;
	
	Если МодельДокумента.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Нет данных для загрузки. Возможно выбран файл, не соответствующий данному виду проформы.';
							  |en='No data to download. Perhaps selected file does not match this type of proforma.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Документы.бит_ФормаСбораДанных.РаспознатьДанные(МодельДокумента, ПсевдоМетаданные, СпискиИсточники);
	
	ИмяТаблицыДанных = Документы.бит_ФормаСбораДанных.ИмяТаблицыДляЗагрузкиДанныхБюджета(ПсевдоМетаданные);
	
	// Проверка состава обязательных колонок таблицы.	
	МетаТаб = КомплектДанных.ПсевдоМетаданные.ТабличныеЧасти[ИмяТаблицыДанных];
	
	ИменаРеквизитовТЧ = Новый Массив;
	Для каждого ОписаниеРеквизита Из МетаТаб.Реквизиты Цикл
		Если ТипЗнч(ОписаниеРеквизита) = Тип("Структура") И ОписаниеРеквизита.Свойство("Имя") Тогда
			ИменаРеквизитовТЧ.Добавить(ОписаниеРеквизита.Имя);
		Иначе
			ИменаРеквизитовТЧ.Добавить(ОписаниеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ИменаОбязательных = Новый Массив;
	ИменаОбязательных.Добавить("Период");
	ИменаОбязательных.Добавить("СтатьяОборотов");
	ИменаОбязательных.Добавить("ЦФО");
	ИменаОбязательных.Добавить("Сумма");
	
	ОтсутствуетПоле = Ложь;
	Для Каждого ИмяПоля Из ИменаОбязательных Цикл
		Если ИменаРеквизитовТЧ.Найти(ИмяПоля) = Неопределено Тогда
			ОтсутствуетПоле = Истина;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
    Отказ = Ложь;
	Если ОтсутствуетПоле Тогда
		ТекстСообщения = НСтр("ru='В шаблоне проформы отсутствуют обязательные поля: %1';
							  |en='The template proforma no mandatory fields: %1'");			 
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтрСоединить(ИменаОбязательных, ", "));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Режим = "Загрузить" Тогда
		Объект.БДДС.Очистить();
		Объект.ЗависимыеОбороты.Очистить();
	КонецЕсли; 
	
	ТаблицаДанныхБюджета = МодельДокумента[ИмяТаблицыДанных].ТаблицаДанных;
	
	// проверим существование колонок.
	КолонкиПроверены = Новый Структура;
	
	МетаДок = Объект.Ссылка.Метаданные();
	Для каждого Колонка Из ТаблицаДанныхБюджета.Колонки Цикл
		Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти(Колонка.Имя, МетаДок, "БДДС") Тогда
			 КолонкиПроверены.Вставить(Колонка.Имя, Истина);
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого СтрокаТаблицы Из ТаблицаДанныхБюджета  Цикл
		НоваяСтрока = Объект.БДДС.Добавить();
		Для каждого КиЗ Из КолонкиПроверены Цикл
			ИмяКолонки = КиЗ.Ключ;
			НоваяСтрока[ИмяКолонки] = СтрокаТаблицы[ИмяКолонки];
		КонецЦикла; 
		УстановитьДанныеПоСтатье(НоваяСтрока);
	КонецЦикла; 
	
	ОформитьТаблицу("БДДС");	
	УстановитьАвтовидимостьКолонок();
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРаспределение(Знач МассивИдСтрок, Знач НастройкиРаспределения)
	
	Для каждого ИдентификаторСтроки Из МассивИдСтрок Цикл
		СтрокаИсточник = Объект.БДДС.НайтиПоИдентификатору(ИдентификаторСтроки);	
		Если СтрокаИсточник <> Неопределено Тогда
			// Распределение по профилю.
			МассивСтрок = бит_Бюджетирование.РаспределитьПоПрофилюАналитики(НастройкиРаспределения, Объект.БДДС, СтрокаИсточник);
			Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла; // по ИД строк.
	
КонецПроцедуры

&НаСервере
Функция НачалоТекущегоПериода()
	
	ДатаОтсчета           = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	НачалоТекущегоПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(ДатаОтсчета, Объект.Сценарий.бит_Периодичность);
	
	Возврат НачалоТекущегоПериода;
	
КонецФункции

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

&НаСервере 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	НаборРеквизитов = Новый Структура;
	НаборРеквизитов.Вставить("Дата");
	НаборРеквизитов.Вставить("РежимЗависимыхОборотов");
	НаборРеквизитов.Вставить("ЕдиницаИзмеренияСумм");
	НаборРеквизитов.Вставить("ПараметрНорм");
	НаборРеквизитов.Вставить("ТипЦен");
	НаборРеквизитов.Вставить("ВалютаДокумента");
	НаборРеквизитов.Вставить("Сценарий");	

	ЗаполнитьЗначенияСвойств(НаборРеквизитов, Объект);
	
	КонтролируемыеРеквизиты = Новый ФиксированнаяСтруктура(НаборРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	НаборРеквизитов = Новый Структура;
	Для каждого КлючЗначение Из КонтролируемыеРеквизиты Цикл
		НаборРеквизитов.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла; 
	НаборРеквизитов.Вставить(ИмяРеквизита, Объект[ИмяРеквизита]);
	
	КонтролируемыеРеквизиты = Новый ФиксированнаяСтруктура(НаборРеквизитов);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзвлечьИзКэша(ИмяРеквизита)
	
	Объект[ИмяРеквизита] = КонтролируемыеРеквизиты[ИмяРеквизита];
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

// Обработка оповещения закрытия формы. 
// 
// Параметры:
//  РезСтруктура - Структура.
//  ДопПараметры - Структура.
// 
&НаКлиенте
Процедура ЗакрытиеФормыВопросПриИзмененииСценария(РезСтруктура, ДопПараметры) Экспорт

	Если ТипЗнч(РезСтруктура) = Тип("Структура") Тогда
		ПересчитатьСуммы   = РезСтруктура.ПересчитатьСуммы;
		ПерезаполнитьНормы = РезСтруктура.ПерезаполнитьНормы;
		// Изменяем валюту документа на валюту из сценария.
		Если ЗначениеЗаполнено(Объект.Сценарий) Тогда
			ИзменениеСценарияСервер(ПересчитатьСуммы, ПерезаполнитьНормы);
		КонецЕсли;   
		ДобавитьВКэш("Сценарий");
		ДобавитьВКэш("ВалютаДокумента")
	Иначе	
		ИзвлечьИзКэша("Сценарий");
	КонецЕсли;

КонецПроцедуры

// Процедура открывает обработку получения данных в различных режимах заполнения. 
// 
&НаКлиенте
Процедура ОткрытьОбработкуПолучения(РежимЗаполнения)

	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = НСтр("ru='Перед выполнением действия документ необходимо записать. Записать документ?';
							|en='Before performing an operation document must be saved. Save the document?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросОткрытьОбработкуПолучения", ЭтотОбъект, РежимЗаполнения);
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	Иначе
		ВызватьФормуПодбораБюджета(РежимЗаполнения); 
	КонецЕсли; 
	
КонецПроцедуры

// Обработка оповещения вопроса пользователю. 
// 
// Параметры:
//  Ответ - Строка.
// 
&НаКлиенте
Процедура ВопросОткрытьОбработкуПолучения(Ответ, РежимЗаполнения) Экспорт

	ЗаписатьПередВыполнением = (Ответ = КодВозвратаДиалога.Да);
	Если ЗаписатьПередВыполнением И Записать() Тогда
		ВызватьФормуПодбораБюджета(РежимЗаполнения);	
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область РаботаСExcel

&НаКлиенте
// Процедура открывает форму обработки бит_ЗагрузкаДанныхИзТабличногоДокумента проверяя записан ли документ. 
//
// Параметры:
//  ИмяТаблицы - Строка.
//
Процедура ОткрытьФормуЗагрузкиДанныхЧерезТабДок(ИмяТаблицы)
    
    ДопПараметры = Новый Структура("ИмяТаблицы", ИмяТаблицы);
       
    Если Параметры.Ключ.Пустая() Тогда        
        ТекстВопроса = НСтр("ru='Данные еще не записаны. 
								|Выполнение действия ""Загрузить через табличный документ"" возможно только после записи данных.
								|Записать?';
							|en='Data not saved. 
								|The execution of the action ""Download via a spreadsheet document"" possible only after writing data.
								|Do it?'");		
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросЗаписатьДокументДляЗагрузкиЧерезТД", 
						ЭтотОбъект, ДопПараметры), ТекстВопроса, РежимДиалогаВопрос.ДаНет);        
    Иначе        
        ОткрытьФормуЗагрузкиДанныхЧерезТабДокОкончание(ДопПараметры);        
    КонецЕсли;	
		
КонецПроцедуры // ОткрытьФормуЗагрузкиДанныхЧерезТабДок()

&НаКлиенте
// Обработка оповещения вопроса пользователю. 
//
// Параметры:
//  Результат               - Строка.
//  ДополнительныеПараметры - Структура.
//
Процедура ВопросЗаписатьДокументДляЗагрузкиЧерезТД(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
   	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
        
        ЗаписьВыполнена = Записать();        
        Если ЗаписьВыполнена Тогда
            
            // Флаг модифицированности автоматически не снимается.
            ОткрытьФормуЗагрузкиДанныхЧерезТабДокОкончание(ДополнительныеПараметры);
            
        КонецЕсли;
    
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
// Процедура открывает форму обработки бит_ЗагрузкаДанныхИзТабличногоДокумента. 
//
// Параметры:
//  ДополнительныеПараметры - Структура.
//
Процедура ОткрытьФормуЗагрузкиДанныхЧерезТабДокОкончание(ДополнительныеПараметры)

    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимЗагрузки",		ПредопределенноеЗначение("Перечисление.бит_РежимыЗагрузки.ТабличнаяЧасть"));
    ПараметрыФормы.Вставить("ОбъектМетаданных",		"Документ.бит_БюджетнаяОперация");
    ПараметрыФормы.Вставить("ОбъектДляЗаполнения",	Объект.Ссылка);
    ПараметрыФормы.Вставить("ИмяТабЧасти",			ДополнительныеПараметры.ИмяТаблицы);
    
    ОткрытьФорму("Обработка.бит_ЗагрузкаДанныхИзТабличногоДокумента.Форма", ПараметрыФормы, ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
  	                   
КонецПроцедуры 

// Процедура восстанавливает загруженные из Excel данные.
//
// Параметры:
//  ОбъектДляЗаполнения - ДанныеФормыСтруктура.
//  ИмяТабЧасти         - Строка.
//  
&НаСервере
Процедура ВосстановитьЗагруженныеИзExcelДанные(Знач ИмяТабЧасти, Знач ОбъектДляЗаполнения = Неопределено)
    
    Если ТипЗнч(ОбъектДляЗаполнения) = Тип("ДокументСсылка.бит_БюджетнаяОперация") Тогда
        ОбъектДляЗаполнения_Объект = ОбъектДляЗаполнения.ПолучитьОбъект();
		ЗначениеВДанныеФормы(ОбъектДляЗаполнения_Объект, Объект);   
    КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВызватьФормуПодбораБюджета(РежимЗаполнения)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ВалютаДокумента",      Объект.ВалютаДокумента);
	ПараметрыЗаполнения.Вставить("КурсДокумента",        Объект.КурсДокумента);
	ПараметрыЗаполнения.Вставить("КратностьДокумента",   Объект.КратностьДокумента);
	ПараметрыЗаполнения.Вставить("Сценарий",             Объект.Сценарий);
	ПараметрыЗаполнения.Вставить("ЕдиницаИзмеренияСумм", Объект.ЕдиницаИзмеренияСумм);
	ПараметрыЗаполнения.Вставить("ЕдиницаИзмеренияСуммДокумента", Объект.ЕдиницаИзмеренияСумм);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);
	ПараметрыФормы.Вставить("ДатаДок",             Объект.Дата);
	ПараметрыФормы.Вставить("ДокументЗаполнения",  Объект.Ссылка);
	ПараметрыФормы.Вставить("РежимЗаполнения",     РежимЗаполнения);
	
	ДанныеДокументаЗаполнения = бит_КазначействоКлиент.НовыеПараметрыДокументаДляПолученияДанныхБюджета();
	ЗаполнитьЗначенияСвойств(ДанныеДокументаЗаполнения, Объект);
	ДанныеДокументаЗаполнения.ЕдиницаИзмеренияСуммДокумента = Объект.ЕдиницаИзмеренияСумм;
	ПараметрыФормы.Вставить("ДанныеДокументаЗаполнения", ДанныеДокументаЗаполнения);
	
	ИмяОбработкиПолучения = "";
	Если РежимЗаполнения = "ЗаполнениеПоСвязанномуСценарию" Тогда
		ИмяОбработкиПолучения = "бит_ПолучениеДанныхБюджетаИзСвязанногоСценария";
	Иначе
		ИмяОбработкиПолучения = "бит_ПолучениеДанныхБюджета";
	КонецЕсли;
	ИмяФормыПолучения = СтрШаблон("Обработка.%1.Форма", ИмяОбработкиПолучения);
	
	ОткрытьФорму(ИмяФормыПолучения, ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция РаспределениеПоддерживается(ДанныеСтроки, ПолеФормы)
	
	Поддерживается = Истина;
	ТекстСообщения = "";
	Разрез  = СтрЗаменить(ПолеФормы.Имя, "БДДС", "");
	Представление = "";
	
	Если НЕ ПустаяСтрока(ПолеФормы.Заголовок) Тогда
		Представление = ПолеФормы.Заголовок;
	Иначе	
		Представление = Разрез;  
	КонецЕсли; 
	
	Если Поддерживается Тогда
		Исключения = Новый Массив;
		// Технологические.
		Исключения.Добавить(Элементы.БДДСНомерСтроки);
		// Значащие.
		Исключения.Добавить(Элементы.БДДССумма);
		Исключения.Добавить(Элементы.БДДСНорма);
		Исключения.Добавить(Элементы.БДДСКоличество);
		Исключения.Добавить(Элементы.БДДСКомментарий);
		Исключения.Добавить(Элементы.БДДССтатьяОборотов);

		Если Исключения.Найти(ПолеФормы) <> Неопределено Тогда
			Поддерживается = Ложь;
			ТекстСообщения = НСтр("ru='По этой колонке распределение не поддерживается.';
								  |en='For this column, the distribution is not supported.'");
		КонецЕсли;
	КонецЕсли; 
	
	Если Поддерживается И ПолеФормы <> Элементы.БДДСПериод Тогда
		// Если по статье не ведется учет по данной аналитике - распределение невозможно.		
		НастройкиСтатьи = ПолучитьНастройкиСтатьи(ДанныеСтроки.СтатьяОборотов);
		Если НастройкиСтатьи <> Неопределено Тогда
			ВедетсяУчет = Ложь;
			НастройкиСтатьи.Свойство("Учет_" + Разрез, ВедетсяУчет);
			Если ВедетсяУчет <> Истина Тогда
				Поддерживается = Ложь;
				ТекстСообщения = НСтр("ru='Для статьи ""%1"" по аналитике ""%2"" учет не ведется. Распределение не поддерживается.';
									  |en='For the article ""%1"" for analysis ""%2"" accounting is not conducted. Distribution is not supported.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ДанныеСтроки.СтатьяОборотов, Представление);
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
	
	Если НЕ Поддерживается Тогда
		ПоказатьПредупреждение(, ТекстСообщения,, НСтр("ru='Распределить по ...';en='Distribute ...'"));	
	КонецЕсли; 
	
	Возврат Поддерживается;
	
КонецФункции

&НаСервере
Функция ПараметрыИзмененияТаблицыДокумента()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Команда",			"бит_БюджетнаяОперация");
	ПараметрыФормы.Вставить("Объект",			Объект.Ссылка);
	ПараметрыФормы.Вставить("ИмяТабличнойЧасти","БДДС");
	ПараметрыФормы.Вставить("ТабличнаяЧасть",	 
		ПоместитьВоВременноеХранилище(Объект.БДДС.Выгрузить(), УникальныйИдентификатор));
		
	Возврат ПараметрыФормы;	
	
КонецФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	// ЗависимыеОборотыКомментарийРасчета
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЗависимыеОборотыКомментарийРасчета");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Таблица.АналитикиСтатьи", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст"	 , НСтр("ru='<Комментарий расчета>';en='<Calculation comment>'"));

КонецПроцедуры 

&НаСервере
Функция ПараметрыРасчетаЦен()
	
	ПараметрыРасчетаЦен = Новый Структура;
	ПараметрыРасчетаЦен.Вставить("ЗаполнитьПоТипуЦен", Ложь);
	ПараметрыРасчетаЦен.Вставить("ЗаполнитьПоНорме"  , Ложь);
	ПараметрыРасчетаЦен.Вставить("ТипЦен"); 
	ПараметрыРасчетаЦен.Вставить("АналитикаНоменклатуры");
	ПараметрыРасчетаЦен.Вставить("СтруктураКурсаДокумента");
	ПараметрыРасчетаЦен.Вставить("ДатаДокумента");
	ПараметрыРасчетаЦен.Вставить("ТолькоНулевыеСуммы", Ложь);
	ПараметрыРасчетаЦен.Вставить("ПараметрНорм"); 
	ПараметрыРасчетаЦен.Вставить("ИменаПараметраНорм");
	
	Если Объект.ЗаполнятьПоЦенамНоменклатуры И ЗначениеЗаполнено(Объект.ТипЦен) Тогда
		ПараметрыРасчетаЦен.ТипЦен  = Объект.ТипЦен;
		
		ТипНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		Для каждого НастройкаИзмерения Из фКэшЗначений.НастройкиИзмерений Цикл
			Если ТипЗнч(НастройкаИзмерения.Значение) <> Тип("Структура") Тогда
				Продолжить;
			КонецЕсли;
			
			Если НастройкаИзмерения.Значение.ТипЗначения = ТипНоменклатура Тогда
				ПараметрыРасчетаЦен.АналитикаНоменклатуры = НастройкаИзмерения.Ключ;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ПараметрыРасчетаЦен.АналитикаНоменклатуры) Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось определить аналитики для расчета цен.';
								  |en = 'Cant find match dimensions for price count.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе
			ПараметрыРасчетаЦен.ЗаполнитьПоТипуЦен = Истина;
		КонецЕсли;
	ИначеЕсли НЕ Объект.ЗаполнятьПоЦенамНоменклатуры И ЗначениеЗаполнено(Объект.ПараметрНорм) И ИспользоватьНормы Тогда
		ПараметрыРасчетаЦен.ПараметрНорм       = Объект.ПараметрНорм;
		ПараметрыРасчетаЦен.ЗаполнитьПоНорме   = Истина;
		ПараметрыРасчетаЦен.ИменаПараметраНорм = ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ПодготовитьСтруктурыСвязи(Объект.ПараметрНорм);
	КонецЕсли;
		
	СтруктураКурсаДокумента     = Новый Структура("Валюта, Курс, Кратность",
									Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);
	ПараметрыРасчетаЦен.СтруктураКурсаДокумента = СтруктураКурсаДокумента;	
	ПараметрыРасчетаЦен.ДатаДокумента           = Объект.Дата;
	
	Возврат ПараметрыРасчетаЦен;
	
КонецФункции

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеУчитыватьСверхБюджета(ЦФО, Период)

	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("ЦФО", ЦФО);
								
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(
								ПараметрыНастройки, Период);
								
	Возврат НеУчитыватьСверхБюджета;							

КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере(СтандартнаяОбработка = Истина)
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	
	НеУчитыватьСверхБюджета   = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);
	ПроводитьПослеУтверждения = ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения");
	
	бит_ВизированиеСервер.ЗаполнитьРеквизитыСтатусаВФорме(ЭтотОбъект, Объект);
	УстановитьСостояниеДокумента();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЦФОПриИзмененииНаСервере()
	
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере 
Процедура ДатаПриИзмененииНаСервере()
	
	ИзменениеВалютыСервер(Ложь);
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);

КонецПроцедуры

#КонецОбласти