#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
	 
	
	УдаленИзСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства,
						"УдаленИзСхемы", Ложь);
	
	Если ПометкаУдаления И УдаленИзСхемы Тогда
		КодТочки = "";
		ИдентификаторТочки = 0;
		ВходящиеТочки.Очистить();
		ИсходящиеТочки.Очистить();
	КонецЕсли;
	
	АктивнаяТочкаМаршрута = ВходящиеТочки.Количество() <> 0 ИЛИ ИсходящиеТочки.Количество() <> 0;
	
	Если Не ЭтоНовый() И НЕ ПометкаУдаления = Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;	
	
	ПроверитьЗаполнение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, 
									"ПроверитьЗаполнение", Истина);
	
	Если ПроверитьЗаполнение Тогда
		Если НЕ ПроверитьЗаполнение() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 
	
	// Сбросим флаг, что бы при повторном программном проведении, вызвать проверку. См. ОбработкаПроверкиЗаполнения().
	ДополнительныеСвойства.Вставить("ПроверитьЗаполнение", Истина);
	
	Если ЭтоНовый() И ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Старт Тогда
		СтруктураОформление = Новый Структура;
		СтруктураОформление.Вставить("ЦветФона"               ,ЦветаСтиля.бит_ЦветТочекАлгоритма);
		СтруктураОформление.Вставить("ЦветЛинии"              ,ЦветаСтиля.бит_ЦветТочекАлгоритма);	
		СтруктураОформление.Вставить("ЦветТекста"             ,ЦветаСтиля.бит_ЦветТочекАлгоритма);	
		СтруктураОформление.Вставить("ГоризонтальноеПоложение",ГоризонтальноеПоложение.Центр);
		СтруктураОформление.Вставить("ВертикальноеПоложение"  ,ВертикальноеПоложение.Центр);
		
		СохранитьОформление(СтруктураОформление);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Наименование = СтрШаблон(НСтр("ru='%1 (копия)';en='%1 (copy)'"), ОбъектКопирования.Наименование); 
	КодТочки = "";
	ИдентификаторТочки = 0;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ДополнительныеСвойства.Свойство("ПроверитьЗаполнение")
		И НЕ ДополнительныеСвойства.ПроверитьЗаполнение Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроверки = ПараметрыПроверкиЗаполнения();
	Справочники.бит_ТочкиАлгоритмов.ПроверитьЗаполнение(ЭтотОбъект, Отказ, ПараметрыПроверки);
	ДополнительныеСвойства.Вставить("ПроверитьЗаполнение", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура сохраняет настройки оформления в хранилище.
// 
// Параметры:
//  СтруктураОформление  - Структура.
// 
Процедура СохранитьОформление(СтруктураОформление) Экспорт

	ОформлениеТочки = Новый ХранилищеЗначения(СтруктураОформление);

КонецПроцедуры // СохранитьОформление()

// Функция считывает настройки оформления из структуры.
// 
// Возвращаемое значение:
//   СтруктураОформление   - Структура.
// 
Функция ПрочитатьОформление() Экспорт

	СтруктураОформление = ОформлениеТочки.Получить();

	Возврат СтруктураОформление;
	
КонецФункции // ПрочитатьОформление()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыПроверкиЗаполнения()
	
	ПараметрыПроверки = Справочники.бит_ТочкиАлгоритмов.НовыеПараметрыПроверкиЗаполнения();
	
	ПараметрыПроверки.Ссылка = ?(Ссылка.Пустая(), ПолучитьСсылкуНового(), Ссылка);
	ИсходящиеТочкиДляПроверкиЗацикливания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства,
												"ИсходящиеТочкиДляПроверкиЗацикливания");
	ПараметрыПроверки.ИсходящиеТочкиДляПроверкиЗацикливания   = ИсходящиеТочкиДляПроверкиЗацикливания;
	ПараметрыПроверки.ПроверятьЗацикливаниеПоВложеннойТаблице = (ИсходящиеТочкиДляПроверкиЗацикливания <> Неопределено);
	
	Возврат ПараметрыПроверки;
	
КонецФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли