
#Область СлужебныйПрограммныйИнтерфейс

// Заполняет описания поставляемых профилей пользователей в подсистеме БСП "Управление доступом".
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа()
//
// Параметры:
//  ОписаниеПрофиля		 - см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа() - заполняемая коллекция
//
Процедура ЗаполнитьПоставляемыеПрофилиПользователей(ОписанияПрофилей) Экспорт
	
	//----------------------------------------------------------------------
	// Доработка типовых профилей.
	
	ПрофильАудитор = Неопределено;
	
	Для каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		
		Если Не ОписаниеПрофиля.Свойство("Роли") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОписаниеПрофиля.Идентификатор = "84acd69c-4114-4d0a-82b2-226033948e12" Тогда			
			ОписаниеПрофиля.Роли.Добавить("бит_ФинансПользователь");
			ОписаниеПрофиля.Роли.Добавить("бит_БухгалтерДополнение");
			
		ИначеЕсли ОписаниеПрофиля.Идентификатор = "cb6d7df5-c9f9-11e2-88b6-e0cb4ed5f6a2" Тогда
			// См. ЗарплатыКадрыРасширенные.ОписаниеПрофиляАудитор()
			ПрофильАудитор = ОписаниеПрофиля;
			
			// Только просмотр			
			ОписаниеПрофиля.Роли.Добавить("бит_ФинансПользователь");
			
		Иначе
			ОписаниеПрофиля.Роли.Добавить("бит_ФинансПользователь");
		КонецЕсли;		
	КонецЦикла; // ОписанияПрофилей
	
	ИнтегрирумыеПрофили = ИнтегрирумыеПрофили(ОписанияПрофилей);
			
	ДобавитьПрофильФинансистПолныеПрава(ОписанияПрофилей, ИнтегрирумыеПрофили);
	
	ДобавитьПрофильФинансистРЛС(ОписанияПрофилей, ИнтегрирумыеПрофили);
	
	ДобавитьПрофильФинансистЦФО(ОписанияПрофилей, ИнтегрирумыеПрофили);
	
	ДобавитьПрофильУправлениеЗатратами(ОписанияПрофилей, ИнтегрирумыеПрофили);
	
	ДобавитьПрофильМСФОПолныеПрава(ОписанияПрофилей, ИнтегрирумыеПрофили);
	
	ДобавитьПрофильСпециалистМСФО(ОписанияПрофилей, ИнтегрирумыеПрофили);
	
	// ++ НЕ УТ
	ДобавитьПрофильНалоговыйМониторинг(ОписанияПрофилей, ПрофильАудитор); 
	ДобавитьПрофильТолькоПросмотр(ОписанияПрофилей, ПрофильАудитор);
	ДобавитьПрофильАудиторМСФО(ОписанияПрофилей, ПрофильАудитор);
	// -- НЕ УТ
	
	ДобавитьПрофильИсполнительКазначейства(ОписанияПрофилей);
		
    ДобавитьПрофильИсполнительЗаявокНаЗатраты(ОписанияПрофилей);	
	
	ДобавитьПрофильИсполнительБюджетирования(ОписанияПрофилей);
	
	ДобавитьПрофильИсполнительКазначей(ОписанияПрофилей);
	
	ДобавитьПрофильИнициаторНСИ(ОписанияПрофилей);	
	
КонецПроцедуры

// Функция получает настройки видов областей доступа.
// 
// Возвращаемое значение:
//   НастройкиВидовОбластей   - Соответствие.
// 
Функция ПолучитьНастройкиВидовОбластейДоступа() Экспорт

	ЕстьРазделитель_4       = Метаданные.РегистрыСведений.бит_рлс_ПраваДоступа.Измерения.Найти("Разделитель_4") <> Неопределено;
	МетаВидыОбластейДоступа = Метаданные.Перечисления.бит_рлс_ВидыОбластейДоступа.ЗначенияПеречисления;
	
	НастройкиВидовОбластей = Новый Соответствие;
	
	Если МетаВидыОбластейДоступа.Найти("Пользователи") <> Неопределено Тогда
	
		// Область "Пользователи"
		Разделители = Новый Структура;
		Разделители.Вставить("Разделитель_1", Неопределено);
		Разделители.Вставить("Разделитель_2", Неопределено);
		
		// Разделитель_3 - Пользователи
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.Пользователи"));
		
		Настройки = Новый Структура;  
		Настройки.Вставить("Типы"	  , МассивТипов);
		Настройки.Вставить("Заголовок", "Пользователь");
		
		Разделители.Вставить("Разделитель_3", Настройки);
		Если ЕстьРазделитель_4 Тогда
			Разделители.Вставить("Разделитель_4", Неопределено);		
		КонецЕсли;		
		
		НастройкиВидовОбластей.Вставить(Перечисления.бит_рлс_ВидыОбластейДоступа.Пользователи, Разделители);
	
	КонецЕсли;

	Если МетаВидыОбластейДоступа.Найти("ЦФОСтатьиОборотов") <> Неопределено Тогда
		
		// Область ЦФО & Статьи
		Разделители = Новый Структура;	
		
		// Разделитель_1 - ЦФО
		МассивТипов = Новый Массив;
		ИмяТипа = бит_ОбщегоНазначения.ПолучитьИмяТипаЦФО();
		МассивТипов.Добавить(Тип(ИмяТипа));
		
		Настройки = Новый Структура;  
		Настройки.Вставить("Типы"	  , МассивТипов);
		Настройки.Вставить("Заголовок", "ЦФО");
		Разделители.Вставить("Разделитель_1", Настройки);
		
		// Разделитель_2 - СтатьиОборотов
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.бит_СтатьиОборотов"));
		
		Настройки = Новый Структура;  
		Настройки.Вставить("Типы",МассивТипов);
		Настройки.Вставить("Заголовок"		, "Статья оборотов");
		Разделители.Вставить("Разделитель_2", Настройки);
		
		Разделители.Вставить("Разделитель_3", Неопределено);
		Если ЕстьРазделитель_4 Тогда
			Разделители.Вставить("Разделитель_4", Неопределено);		
		КонецЕсли;
		
		НастройкиВидовОбластей.Вставить(Перечисления.бит_рлс_ВидыОбластейДоступа.ЦФОСтатьиОборотов, Разделители);	                               
		
	КонецЕсли;

	Если МетаВидыОбластейДоступа.Найти("Проекты") <> Неопределено И ЕстьРазделитель_4 Тогда
	
		// Область Проекты
		Разделители = Новый Структура;	
		Разделители.Вставить("Разделитель_1" , Неопределено);
		Разделители.Вставить("Разделитель_2" , Неопределено);
		Разделители.Вставить("Разделитель_3" , Неопределено);
		
		// Разделитель_4 - Проект
		МассивТипов = Новый Массив;
		ИмяТипа = бит_ОбщегоНазначения.ПолучитьИмяТипаПроекты();
		МассивТипов.Добавить(Тип(ИмяТипа));
		
		Настройки = Новый Структура;  
		Настройки.Вставить("Типы"	  , МассивТипов);
		Настройки.Вставить("Заголовок", "Проект");
		Разделители.Вставить("Разделитель_4", Настройки);
		
		НастройкиВидовОбластей.Вставить(Перечисления.бит_рлс_ВидыОбластейДоступа.Проекты, Разделители);
	
	КонецЕсли;
	
	Возврат НастройкиВидовОбластей;

КонецФункции // ПолучитьНастройкиВидовОбластейДоступа()

// Процедура устанавливает параметры сеанса, необходимы при работе RLS.
// 
// 
Процедура ЗаполнитьПараметрыСеансаRLS() Экспорт

	// ++ ЕРП 
	ПараметрыСеанса.бит_ИспользоватьГруппыДоступаЦФОСтатьиОборотов = 
		Константы.бит_ИспользоватьГруппыДоступаЦФОСтатьиОборотов.Получить();
	// -- ЕРП 
	
КонецПроцедуры

#КонецОбласти    

#Область СозданиеПрофилейЕРП

Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля)         
	
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
		
	#Область БазовыеРолиБит
	ОписаниеПрофиля.Роли.Добавить("бит_ФинансПользователь");
	ОписаниеПрофиля.Роли.Добавить("бит_ИспользованиеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеШаблоновВводаНаОсновании");
	#КонецОбласти
	
	#Область ВспомогательныеРоли
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	
	// ++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОтраженияДокументовВРеглУчете");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплатПрочихДоходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплаты");	 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплатыРасширенная");   
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровАренды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаймовСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ");    
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекСчетовУчетаПрочихОпераций");
	// -- НЕ УТ
	#КонецОбласти
	
	#Область ОтчетыБСП
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	#КонецОбласти
	
КонецПроцедуры

Процедура ДобавитьПрофильФинансистПолныеПрава(ОписанияПрофилей, ИнтегрирумыеПрофили)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "f712fb91-6037-4a89-b61d-aa0202ad6f7d";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Финансист(полные права)';en='BIT.Finance(full permissions)'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДатЗапретаИзменения");
	ОписаниеПрофиля.Роли.Добавить("бит_ИспользованиеОбработкиСозданиеЗаявокНаОснованииЗаказов");
	ОписаниеПрофиля.Роли.Добавить("бит_ИспользованиеОбработкиФормированиеЗаявокНРДСПоПервичнымДокументам");
	ОписаниеПрофиля.Роли.Добавить("бит_ДобавлениеИзменениеНастройкиДоступностиЭлементов");
	ОписаниеПрофиля.Роли.Добавить("бит_ФинансистПолныеПрава");
	ОписаниеПрофиля.Роли.Добавить("бит_ДобавлениеИзменениеШаблоновПроводокБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("бит_ИспользованиеОбработкиФормированиеППДСПоПервичнымДокументам");
	ОписаниеПрофиля.Роли.Добавить("бит_ИспользованиеОбработкиФормированиеОтраженийФактаДДС");
	
	ПрофильБухгалтер          = ИнтегрирумыеПрофили.ПрофильБухгалтер;
	ПрофильКазначей           = ИнтегрирумыеПрофили.ПрофильКазначей;
	ПрофильКассир             = ИнтегрирумыеПрофили.ПрофильКассир;
	ПрофильМенеджерПоЗакупкам = ИнтегрирумыеПрофили.ПрофильМенеджерПоЗакупкам;
	ПрофильМенеджерПоПродажам = ИнтегрирумыеПрофили.ПрофильМенеджерПоПродажам;
		
	СкопироватьРолиПрофиля(ПрофильБухгалтер, ОписаниеПрофиля);
	СкопироватьРолиПрофиля(ПрофильКазначей, ОписаниеПрофиля);
	СкопироватьРолиПрофиля(ПрофильКассир, ОписаниеПрофиля);
	СкопироватьРолиПрофиля(ПрофильМенеджерПоЗакупкам, ОписаниеПрофиля);
    СкопироватьРолиПрофиля(ПрофильМенеджерПоПродажам, ОписаниеПрофиля);	
	
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль базируется на типовом профиле ""Бухгалтер"" и дополнительно обеспечивает полный доступ к объектам Казначейства и Бюджетирования.';
	                      |en='Profile is based on the standard profile ""Accountant"" and additionally provides full access to the objects of Treasury and Budgeting.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры   

Процедура ДобавитьПрофильФинансистРЛС(ОписанияПрофилей, ИнтегрирумыеПрофили)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "4fdbc592-023b-47c5-8849-5fd5de605af8";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Финансист(ограничения на уровне записей)';en='BIT.Finance(record level restrictions)'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_рлс_Финансист");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеУстановкиКонтрольныхЗначений");
	
	ПрофильБухгалтер = ИнтегрирумыеПрофили.ПрофильБухгалтер;
	ПрофильКазначей  = ИнтегрирумыеПрофили.ПрофильКазначей;
	ПрофильКассир    = ИнтегрирумыеПрофили.ПрофильКассир;
		
	СкопироватьРолиПрофиля(ПрофильБухгалтер, ОписаниеПрофиля);
	СкопироватьРолиПрофиля(ПрофильКазначей, ОписаниеПрофиля);
	СкопироватьРолиПрофиля(ПрофильКассир, ОписаниеПрофиля);
	
	// Удалим роль, которая дает полный доступ к организациям
	ИндексРоли = ОписаниеПрофиля.Роли.Найти("ОператорОтправкиОтчетностиЧерезПредставителя");
	Если ТипЗнч(ИндексРоли) = Тип("Число") Тогда
		ОписаниеПрофиля.Роли.Удалить(ИндексРоли);
	КонецЕсли;
		
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль базируется на типовом профиле ""Бухгалтер"" и дополнительно обеспечивает ввод объектов Казначейства и Бюджетирования. 
                                  |В профиле реализовано разделение RLS по ЦФО, статьям оборотов.'; 
							  |en='Profile is based on a typical profile ""Accountant"" and further provides input Object of the Treasury and Budgeting. 
                                  |The profile is implemented separation of RLS on the CFR, line items.'");
	
	ДобавитьВидыДоступа(ОписаниеПрофиля, Истина);
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
			
КонецПроцедуры

Процедура ДобавитьПрофильФинансистЦФО(ОписанияПрофилей, ИнтегрирумыеПрофили)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "b0c1d106-a80a-4311-bffe-d035b8d21d09";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Финансист_ЦФО(ограничения на уровне записей)';en='BIT.Finance_FRC(record level restrictions)'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_рлс_ФинансистЦФО");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеУстановкиКонтрольныхЗначений");
	
	ПрофильБухгалтер = ИнтегрирумыеПрофили.ПрофильБухгалтер;
	ПрофильКазначей  = ИнтегрирумыеПрофили.ПрофильКазначей;
	ПрофильКассир    = ИнтегрирумыеПрофили.ПрофильКассир;
		
	СкопироватьРолиПрофиля(ПрофильБухгалтер, ОписаниеПрофиля);
	СкопироватьРолиПрофиля(ПрофильКазначей, ОписаниеПрофиля);
	СкопироватьРолиПрофиля(ПрофильКассир, ОписаниеПрофиля);
	
	// Удалим роль, которая дает полный доступ к организациям
	ИндексРоли = ОписаниеПрофиля.Роли.Найти("ОператорОтправкиОтчетностиЧерезПредставителя");
	Если ТипЗнч(ИндексРоли) = Тип("Число") Тогда
		ОписаниеПрофиля.Роли.Удалить(ИндексРоли);
	КонецЕсли;
		
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль базируется на типовом профиле ""Бухгалтер"" и дополнительно обеспечивает ввод объектов Казначейства и Бюджетирования. 
							      |В профиле реализовано разделение RLS по Организации, ЦФО.';
							  |en='Profile is based on a typical profile ""Accounting"", and further provides input Treasury facilities and Budgeting. 
								  |The profile implements the separation of RLS by organization, CFR.'");
	
	ДобавитьВидыДоступа(ОписаниеПрофиля);
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
КонецПроцедуры

Процедура ДобавитьПрофильУправлениеЗатратами(ОписанияПрофилей, ИнтегрирумыеПрофили)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "f020d6bb-97ae-4f42-9796-10047cc65af2";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'БИТ.Управление закупками'; en = 'BIT.Purchase management'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_УправлениеЗакупками");
	
	ПрофильБухгалтер           = ИнтегрирумыеПрофили.ПрофильБухгалтер;
	ПрофильМенеджерПоЗакупкам  = ИнтегрирумыеПрофили.ПрофильМенеджерПоЗакупкам;
		
	СкопироватьРолиПрофиля(ПрофильБухгалтер, ОписаниеПрофиля);
	СкопироватьРолиПрофиля(ПрофильМенеджерПоЗакупкам, ОписаниеПрофиля);
			
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль базируется на типовом профиле ""Бухгалтер"" и дополнительно обеспечивает ввод всех объектов подсистемы Планирования затрат.';
							  |en='Profile is based on a typical profile ""accounting"" and further provides input all objects Planning subsystem costs.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
			
КонецПроцедуры

Процедура ДобавитьПрофильМСФОПолныеПрава(ОписанияПрофилей, ИнтегрирумыеПрофили)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "922b8c69-b10d-4418-8c2c-1a9c69946880";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.МСФО(полные права)';en='BIT.IFRS'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_му_ПолныеПрава");
    ОписаниеПрофиля.Роли.Добавить("бит_УправлениеПроцессами");
	
	ПрофильБухгалтер = ИнтегрирумыеПрофили.ПрофильБухгалтер;
	СкопироватьРолиПрофиля(ПрофильБухгалтер, ОписаниеПрофиля);
			
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль базируется на типовом профиле ""Бухгалтер"" и дополнительно обеспечивает полный доступ к объектам необходимым для настройки и ведения учета по МСФО';
								  |en='Profile is based on the standard profile ""Accountant"" and additionally provides full access to the objects required to set up and maintain accounting in accordance with IFRS'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
				
КонецПроцедуры

Процедура ДобавитьПрофильСпециалистМСФО(ОписанияПрофилей, ИнтегрирумыеПрофили)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "63BFB112-FDF3-491B-8DE3-DC2150088E26";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Специалист МСФО';en='BIT.Specialist IFRS'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_рлс_му_Специалист");
	
	ПрофильБухгалтер = ИнтегрирумыеПрофили.ПрофильБухгалтер;
	СкопироватьРолиПрофиля(ПрофильБухгалтер, ОписаниеПрофиля);
	
	// удалим роль, которая дает полный доступ к организациям
	ИндексРоли = ОписаниеПрофиля.Роли.Найти("ОператорОтправкиОтчетностиЧерезПредставителя");
	Если ТипЗнч(ИндексРоли) = Тип("Число") Тогда
		ОписаниеПрофиля.Роли.Удалить(ИндексРоли);
	КонецЕсли;
			
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль базируется на типовом профиле ""Бухгалтер"" и дополнительно обеспечивает доступ к объектам, необходимым для ведения учета по МСФО в рамках одной или нескольких организаций. 
									  |В профиле реализовано разделение RLS по Организации.';
								  |en='Profile is based on a typical profile ""Accountant"" and additionally provides access to facilities necessary for accounting under IFRS within one or more organizations. 
								      |The profile is implemented by the division of the RLS of organizations.'");
	
    ДобавитьВидыДоступа(ОписаниеПрофиля);
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
				
КонецПроцедуры

Процедура ДобавитьПрофильИсполнительКазначейства(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "47460347-28cc-40fb-95c7-a1f7f4a43883";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Исполнитель казначейства(ограничения на уровне записей)';
							   |en='BIT.Artist of the Treasury(restrictions on the level of records)'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_рлс_ИсполнительКазначейства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеУстановкиКонтрольныхЗначений");
	
	// ++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОтраженияДокументовВРеглУчете");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплатПрочихДоходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплаты");	 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплатыРасширенная");   
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровАренды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаймовСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ");    
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекСчетовУчетаПрочихОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДепонированнойЗарплаты"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗарплатныхПроектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНалоговИВзносов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменаСБанкамиПоЗачислениюЗарплаты");
	// -- НЕ УТ
			
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль обеспечивает ввод объектов Казначейства. 
							  |В профиле реализовано разделение RLS по Организации, ЦФО, статьям оборотов и пользователю.';
						  |en='Profile is based on a typical profile ""Accounting"", and further provides input Treasury facilities. 
						      |The profile implements the separation of RLS by organization, CFR, line items and user.'");
	
	ДобавитьВидыДоступа(ОписаниеПрофиля, Истина, Истина);
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
КонецПроцедуры

Процедура ДобавитьПрофильИсполнительЗаявокНаЗатраты(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "61e16ba9-245a-427e-9924-35c2362607c8";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Исполнитель заявок на закупки';
							   |en='BIT.Contractor of applications for purchases'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_ИсполнительПоЗаявкамНаЗакупку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	
	// ++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОтраженияДокументовВРеглУчете");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплатПрочихДоходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплаты");	 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплатыРасширенная");   
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровАренды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаймовСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ");    
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекСчетовУчетаПрочихОпераций");
	// -- НЕ УТ
			
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль обеспечивает ввод объектов Планирования затрат. 
							  |В профиле реализовано разделение RLS по организации, ЦФО, статьям оборотов.';
						            |en='Profile is based on a typical profile ""Accounting"" and further provides input Object Cost Planning. 
						      |The profile implements the separation of RLS by organization, CFR, line items'");
	
	ДобавитьВидыДоступа(ОписаниеПрофиля, Истина, Истина);
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
КонецПроцедуры

Процедура ДобавитьПрофильИсполнительБюджетирования(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "bfc79be0-1a63-4149-a224-d2a25c8739bd";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Исполнитель бюджетирования';en='BIT.Budgeting Artist'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_рлс_ИсполнительБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеУстановкиКонтрольныхЗначений");
	
	// ++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОтраженияДокументовВРеглУчете");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплатПрочихДоходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплаты");	 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплатыРасширенная");   
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровАренды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаймовСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ");    
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекСчетовУчетаПрочихОпераций");
	// -- НЕ УТ
			
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль  обеспечивает ввод объектов Бюджетирования. 
                              |В профиле реализовано разделение RLS по ЦФО, статьям оборотов, проектам и ответственным.'; 
						            |en='Profile provides input of Budgeting objects.
                              |The profile implements the separation of RLS by CFD and line items, projects and responsible.'");
	
	ДобавитьВидыДоступа(ОписаниеПрофиля, Истина, Истина);
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
КонецПроцедуры

Процедура ДобавитьПрофильИсполнительКазначей(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "3791868d-e683-4b79-8b79-6c335ea1699b";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Казначей';en='BIT.Cashier'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_рлс_Казначей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковБезналичныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковНаличныхДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовНаОплатуКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКредитовИДепозитов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеBankFeeds");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПоБанку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПоКассе");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеУстановкиКонтрольныхЗначений");
	
	// ++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОтраженияДокументовВРеглУчете");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплатПрочихДоходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплаты");	 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнойЗарплатыРасширенная");   
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровАренды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаймовСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГосударственныхКонтрактов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ");    
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекСчетовУчетаПрочихОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДепонированнойЗарплаты"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗарплатныхПроектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНалоговИВзносов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменаСБанкамиПоЗачислениюЗарплаты");
	// -- НЕ УТ
	
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль обеспечивает ввод основных документов Казначейства(""Заявка на расходование денежных средств"", ""Прогноз платежа"", ""Планируемое поступление денежных среств""). 
                              |В профиле реализовано разделение на уровне записей RLS по ЦФО и статьям оборотов, проектам и ответственным. 
                              |Имеет смысл только отдельное назначение данного профиля. 
                              |Совместное использование с другими профилями/ролями может привести к увеличению области доступа и сделает бессмысленным использование разделения доступа на уровне записей в рамках данного профиля.'; 
						  |en='Profile allows entry of basic documents of the Treasury (""Application for payment"", ""Payment Forecast"", ""Planned income"").
                              |The profile is implemented at the level of division records RLS by CFD and line items, projects and responsible.
                              |This only has a single purpose of this profile. 
                              |Sharing with other profiles / roles can lead to increase access and make use of the meaningless division record-level access within the profile.'");
	
	ДобавитьВидыДоступа(ОписаниеПрофиля, Истина);
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "ВначалеВсеРазрешены");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
КонецПроцедуры

Процедура ДобавитьПрофильИнициаторНСИ(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = НРег("FA409C64-36BA-4C27-AFB3-4344A4E7E406");
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Инициатор изменения НСИ';en='BIT.The initiator of change NSI'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_мдм_ИнициаторИзмененияНСИ");
	// ++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбщейБухгалтерскойНСИ");
	// -- НЕ УТ
				
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль обеспечивает возможность ввода заявок на изменение/удаление элементов НСИ.';
						  |en='Profile allows the entry of applications for change/delete items NSI.'");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("бит_мдм_ОписанияОбъектовОбмена");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
КонецПроцедуры

Процедура ДобавитьПрофильНалоговыйМониторинг(ОписанияПрофилей, ПрофильАудитор)
		
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "5f16b512-cb6c-4705-89dd-38bb7eb8c1a0";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Налоговый мониторинг';en='BIT.Tax monitoring'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_НалоговыйМониторинг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаПодтверждениеРасходовПоКазначейскомуСопровождению");
	ОписаниеПрофиля.Роли.Добавить("СверкаДанныхОУиБУ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорядкаОтраженияНаСчетахУчета"); 
	ОписаниеПрофиля.Роли.Добавить("ПросмотрРегистровНалоговогоУчета");   
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСправокРасчетов");
	
	СкопироватьРолиПрофиля(ПрофильАудитор, ОписаниеПрофиля, "РазделЗарплата;РазделКадры");
				
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль предоставляет доступ налоговому инспектору к данным бухгалтерского учета.
	                               |Не рекомендуется использовать данный профиль в сочетании с другими.'; 
							   |en='The profile gives the tax inspector access to accounting data.
	                               |It is not recommended to use this profile in combination with others.'");
	
    ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
			
КонецПроцедуры

Процедура ДобавитьПрофильАудиторМСФО(ОписанияПрофилей, ПрофильАудитор)
	
	// Аудитор МСФО.
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "c88379bb-8d24-4576-862f-56e23a456306";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Только просмотр МСФО';en='BIT.Just look IFRS'");   
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеМеждународныйУчет");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеУчетнойПолитикиМСФО");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеДанныхУправленческогоУчета");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеДанныхБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("бит_ПодсистемаКонсолидация");
	ОписаниеПрофиля.Роли.Добавить("бит_ПодсистемаПреобразованиеДанных");
	ОписаниеПрофиля.Роли.Добавить("бит_ПросмотрОтчетаИнтерактивнаяОСВ");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеЭкземпляровОтчетов");
	ОписаниеПрофиля.Роли.Добавить("бит_ПросмотрОтчетаПроизвольныйОтчет");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеПроизвольныеФормы");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеФормыСбораДанных");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеМеханизмаТрансляции");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеДополнительныхУсловийПоДоговорам");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеПорталаВГО");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеПереоценокВалютныхДенежныхСтатей");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеЗакрытияСчетов");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеТиповПроводок");

	СкопироватьРолиПрофиля(ПрофильАудитор, ОписаниеПрофиля);
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль базируется на типовом профиле ""Аудитор"" и дополнительно обеспечивает доступ к объектам МСФО.'; 
	                      |en='Profile is based on the standard profile ""Auditor"" and additionally provides access to the objects of IFRS.'");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыПроизвольныхФорм"); 
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыФормСбораДанных");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
					
КонецПроцедуры

Процедура ДобавитьПрофильТолькоПросмотр(ОписанияПрофилей, ПрофильАудитор)
	
	// Только просмотр БИТ.
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "00bd4d2c-7637-4fa0-bace-e3dc468e0b13";
	ОписаниеПрофиля.Наименование  = НСтр("ru='БИТ.Только просмотр';en='BIT.Just look'"); 
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеБюджетирование");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеКазначейство");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеУправленческогоУчет");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеДанныхМеждународногоУчета");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеУчетнойПолитикиМСФО");
	ОписаниеПрофиля.Роли.Добавить("бит_ПодсистемаПреобразованиеДанных");
	ОписаниеПрофиля.Роли.Добавить("бит_ПросмотрОтчетаИнтерактивнаяОСВ");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеМеханизмаТрансляции");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеЗакрытияСчетов");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеЭкземпляровОтчетов");
	ОписаниеПрофиля.Роли.Добавить("бит_ПросмотрОтчетаПроизвольныйОтчет");
	ОписаниеПрофиля.Роли.Добавить("бит_ПросмотрОтчетаСоответствиеАналитик");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеСтатейОборотов");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеЦФО");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеПорталаВГО");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеКонтрольныхЗначенийБюджетов");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеДоговоровЗакупки");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеДополнительныхУсловийПоДоговорам");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеПереоценокВалютныхДенежныхСтатей");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеЗакрытиеЗаявок");
	ОписаниеПрофиля.Роли.Добавить("бит_ЧтениеТиповПроводок");   
	
	СкопироватьРолиПрофиля(ПрофильАудитор, ОписаниеПрофиля);
	ОписаниеПрофиля.Описание = НСтр("ru='Профиль базируется на типовом профиле ""Аудитор"" и дополнительно обеспечивает доступ к объектам БИТ.'; 
	                      |en='Profile is based on the standard profile ""Auditor"" and additionally provides access to the objects of BIT.'");
	ДобавитьВидыДоступа(ОписаниеПрофиля, Истина);
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
						
КонецПроцедуры

Функция ИндексироватьПрофили(ОписанияПрофилей, ПолеПрофиля = "Имя")
	
	Результат = Новый Соответствие;
	Для Индекс = 0 По ОписанияПрофилей.ВГраница() Цикл
		
		Профиль = ОписанияПрофилей[Индекс];
		Результат.Вставить(Профиль[ПолеПрофиля], Индекс);
		
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция НайтиПрофиль(ИмяПрофиля, ОписанияПрофилей, ИндексПрофилей)

	ИндексПрофиля = ИндексПрофилей[ИмяПрофиля];
	Если ИндексПрофиля = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ОписанияПрофилей[ИндексПрофиля];
	
КонецФункции

Функция ИнтегрирумыеПрофили(ОписанияПрофилей)
	
	ИндексПрофилей = ИндексироватьПрофили(ОписанияПрофилей, "Имя");
	
	ПрофильБухгалтер          = НайтиПрофиль("Бухгалтер", ОписанияПрофилей, ИндексПрофилей);
	ПрофильКазначей           = НайтиПрофиль("Казначей", ОписанияПрофилей, ИндексПрофилей);
	ПрофильКассир             = НайтиПрофиль("Кассир", ОписанияПрофилей, ИндексПрофилей);
	ПрофильМенеджерПоЗакупкам = НайтиПрофиль("МенеджерПоЗакупкам", ОписанияПрофилей, ИндексПрофилей);
	ПрофильМенеджерПоПродажам = НайтиПрофиль("МенеджерПоПродажам", ОписанияПрофилей, ИндексПрофилей);
	
	ИнтегрирумыеПрофили = Новый Структура;
	ИнтегрирумыеПрофили.Вставить("ПрофильБухгалтер",          ПрофильБухгалтер);
	ИнтегрирумыеПрофили.Вставить("ПрофильКазначей",           ПрофильКазначей);
	ИнтегрирумыеПрофили.Вставить("ПрофильКассир",             ПрофильКассир);
	ИнтегрирумыеПрофили.Вставить("ПрофильМенеджерПоЗакупкам", ПрофильМенеджерПоЗакупкам);
	ИнтегрирумыеПрофили.Вставить("ПрофильМенеджерПоПродажам", ПрофильМенеджерПоПродажам);
	
	Возврат ИнтегрирумыеПрофили;
	
КонецФункции

// Процедура выполняет копирование ролей из описания одного профиля в другой.
// 
// Параметры:
//  Источник   - Структура.ОписаниеПрофиля.
//  Приемник   - Структура.ОписаниеПрофиля.
//  Исключения - Строка.
// 
Процедура СкопироватьРолиПрофиля(Источник, Приемник, Исключения  = "")
	
	Если Источник = Неопределено  Тогда  
		Возврат;
	КонецЕсли;  
	
	МассивИсключений = бит_СтрокиКлиентСервер.РазложитьСтрокуВМассивПодстрок(Исключения, ";");
	
	Для каждого СтрРоль Из Источник.Роли Цикл
	
		Если МассивИсключений.Найти(СтрРоль) = Неопределено Тогда 		
			Приемник.Роли.Добавить(СтрРоль);  		
		КонецЕсли;         		
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура добавляет виды доступа профилю.
// 
// Параметры:
//  ОписаниеПрофиля - Структура.
// 
Процедура ДобавитьВидыДоступа(ОписаниеПрофиля, ОграничениеПоСтатьям = Ложь, ОграничениеПоПользователю = Ложь)

	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ЦФО");
	ОписаниеПрофиля.ВидыДоступа.Добавить("КлючиДоступаЦФОСтатьиОборотов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "Предустановленный");
	Если ОграничениеПоСтатьям Тогда
		ОписаниеПрофиля.ВидыДоступа.Добавить("СтатьиОборотов");
	КонецЕсли;
	Если ОграничениеПоПользователю Тогда
		ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи");
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
