
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Операция") Тогда
		
		Операция = Параметры.Операция; 
		
		ВидНоменклатуры = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ВидыНоменклатурыГотовойПродукцииВПроизводственнойОперации, ЭтотОбъект);
		
		Запрос = Новый Запрос;
		// ЛТ5.26 добавил количество тары и нормативную массу
		Запрос.Текст =    
		"ВЫБРАТЬ
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка КАК Ссылка,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.НомерСтроки КАК НомерСтроки,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Номенклатура.ВидНоменклатуры.ИспользоватьСерии КАК ЕстьУчетПоСериям,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Характеристика КАК Характеристика,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Количество КАК Количество,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Упаковка КАК Упаковка,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Серия КАК Серия,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.КоличествоУпаковок КАК КоличествоИсходное,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_СерииЭтикетокВСменномЗадании.СерияНоменклатуры) КАК КоличествоТары,
		|	МАКСИМУМ(ЕстьNull(бит_СерииЭтикетокВСменномЗадании.СерияНоменклатуры.бит_НормативнаяМасса, 0)) КАК НормативнаяМасса
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2.ВыходныеИзделия КАК ПроизводственнаяОперация2_2ВыходныеИзделия
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СерииЭтикетокВСменномЗадании КАК бит_СерииЭтикетокВСменномЗадании
		|		ПО ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка = бит_СерииЭтикетокВСменномЗадании.ПроизводственнаяОперация
		|			И ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка.Этап.Спецификация.ОсновноеИзделиеНоменклатура = бит_СерииЭтикетокВСменномЗадании.Номенклатура
		|ГДЕ
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка = &Ссылка
		|	И ПроизводственнаяОперация2_2ВыходныеИзделия.Номенклатура.ВидНоменклатуры В(&ВидНоменклатуры)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.НомерСтроки,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Номенклатура,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Характеристика,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.КоличествоУпаковок,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Количество,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Упаковка,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Серия,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.СтатусУказанияСерий,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.КоличествоУпаковок,
		|	ПроизводственнаяОперация2_2ВыходныеИзделия.Номенклатура.ВидНоменклатуры.ИспользоватьСерии";
		
		Запрос.УстановитьПараметр("Ссылка", Параметры.Операция); 
		Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
		
		ВыходныеИзделия.Загрузить(Запрос.Выполнить().Выгрузить());
		
		РасчитатьПроцентВыполнения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОперациюНаСервере()
	
	ВидНоменклатуры = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ВидыНоменклатурыГотовойПродукцииВПроизводственнойОперации, ЭтотОбъект);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка КАК Ссылка,
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.НомерСтроки КАК НомерСтроки,
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.Характеристика КАК Характеристика,
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.КоличествоУпаковок * &ПроцентВыполнения КАК КоличествоУпаковок,
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.Количество * &ПроцентВыполнения КАК Количество,
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.Упаковка КАК Упаковка,
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.Серия КАК Серия,
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.КоличествоУпаковок КАК КоличествоИсходное
	|ИЗ
	|	Документ.ПроизводственнаяОперация2_2.ВыходныеИзделия КАК ПроизводственнаяОперация2_2ВыходныеИзделия
	|ГДЕ
	|	ПроизводственнаяОперация2_2ВыходныеИзделия.Ссылка = &Ссылка
	|	И НЕ ПроизводственнаяОперация2_2ВыходныеИзделия.Номенклатура.ВидНоменклатуры В(&ВидНоменклатуры)";
	
	Запрос.УстановитьПараметр("Ссылка", Операция); 
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("ПроцентВыполнения", ПроцентВыполнения / 100);
	
	ОперацияОбъект = Операция.ПолучитьОбъект();
	ОперацияОбъект.ВыходныеИзделия.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = ОперацияОбъект.ВыходныеИзделия.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
	КонецЦикла;
	
	
	Для Каждого СтрокаТЗ Из ВыходныеИзделия Цикл 
		Структура = новый Структура("Номенклатура, Количество", СтрокаТЗ.Номенклатура, СтрокаТЗ.Количество);
		РаспределитьНаСервере(Структура);
		Если РаспределениеГотовойПродукцииПоТаре.Количество() = 0 Тогда
			СтрокаТЧ = ОперацияОбъект.ВыходныеИзделия.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);	
		Иначе
			мСтрок = РаспределениеГотовойПродукцииПоТаре.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТЗ.Номенклатура));
			Если мСтрок.Количество() = 0 Тогда              
				СтрокаТЧ = ОперацияОбъект.ВыходныеИзделия.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);	
			Иначе
				Для каждого стр из мСтрок Цикл 
					Если стр.КоличествоКГ <> 0 Тогда             
						СтрокаТЧ = ОперацияОбъект.ВыходныеИзделия.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);	
						СтрокаТЧ.Серия = стр.Серия;
						СтрокаТЧ.Количество = стр.КоличествоКГ;
						СтрокаТЧ.СтатусУказанияСерий = 14;
						Если ЗначениеЗаполнено(СтрокаТЗ.Упаковка) Тогда
							СтрокаТЧ.КоличествоУпаковок = стр.КоличествоКГ / (СтрокаТЗ.Упаковка.Числитель / СтрокаТЗ.Упаковка.Знаменатель);
						Иначе
							СтрокаТЧ.КоличествоУпаковок = стр.КоличествоКГ;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из ОперацияОбъект.Трудозатраты Цикл
		СтрокаТЧ.Количество = СтрокаТЧ.Количество * ПроцентВыполнения / 100;	
	КонецЦикла;
		
	КоличествоИсходное = ВыходныеИзделия.Итог("КоличествоИсходное");
	Количество = ВыходныеИзделия.Итог("КоличествоУпаковок");
	
	ОперацияОбъект.ВремяВыполнения = ОперацияОбъект.ВремяВыполнения * ПроцентВыполнения / 100;
	
	ОперацияОбъект.Количество = КоличествоИсходное;
	
	Если ОперацияОбъект.Операция.Контроль = Перечисления.ВариантыКонтроляТехнологическихОпераций.Требуется Тогда
		
		Если Количество <= КоличествоИсходное Тогда 	
			ОперацияОбъект.КоличествоНаКонтроле = Количество;
			ОперацияОбъект.КоличествоОтменено = КоличествоИсходное - Количество;
		ИначеЕсли Количество > КоличествоИсходное Тогда
			ОперацияОбъект.КоличествоНаКонтроле = Количество;
		КонецЕсли;
		
	Иначе
		
		ОперацияОбъект.КоличествоНаКонтроле = 0;
		
		Если Количество <= КоличествоИсходное Тогда 	
			ОперацияОбъект.КоличествоФакт = Количество;
			ОперацияОбъект.КоличествоОтменено = КоличествоИсходное - Количество;
		ИначеЕсли Количество > КоличествоИсходное Тогда
			ОперацияОбъект.КоличествоФакт = Количество;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОперацияОбъект.НачалоВыполнения) Тогда
		ОперацияОбъект.НачалоВыполнения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ОперацияОбъект.ОкончаниеВыполнения = ТекущаяДатаСеанса();
	
	ОперацияОбъект.Статус = Перечисления.СтатусыПроизводственныхОпераций.Выполнена;
	
	Документы.ПроизводственнаяОперация2_2.РасчитатьПроцентВыполнениеПоВыпуску(ОперацияОбъект);
	Документы.ПроизводственнаяОперация2_2.РасчитатьПроцентВыполнениеПоВремени(ОперацияОбъект);

	ОперацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
	
	ВыполнитьОперациюНаСервере();
	
	Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьПроцентВыполнения()
	
	Если ВыходныеИзделия.Количество() <> 0 Тогда
		
		Для Каждого СтрокаТЧ Из ВыходныеИзделия Цикл
			СтрокаТЧ.ПроцентВыполнения = СтрокаТЧ.КоличествоУпаковок / СтрокаТЧ.КоличествоИсходное * 100;
			Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
				СтрокаТЧ.Количество = СтрокаТЧ.КоличествоУпаковок * СтрокаТЧ.Упаковка.Числитель / СтрокаТЧ.Упаковка.Знаменатель; 
			Иначе
				СтрокаТЧ.Количество = СтрокаТЧ.КоличествоУпаковок;
			КонецЕсли;
		КонецЦикла;
		
		ПроцентВыполнения = ВыходныеИзделия.Итог("ПроцентВыполнения") / ВыходныеИзделия.Количество();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыходныеИзделияКоличествоУпаковокПриИзменении(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:38:52] +        
	// "Количество, кг" изменять реквизит "Количество тары" = "Количество, кг" / "Нормативная масса, кг"
	ТД = Элементы.ВыходныеИзделия.ТекущиеДанные;                                                                                    
	Если ЗначениеЗаполнено(ТД.Упаковка) Тогда
		УпаковкаЧислитель = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТД.Упаковка, "Числитель");
		Если УпаковкаЧислитель = 0 Тогда
			УпаковкаЧислитель = 1;
		КонецЕсли;
		УпаковкаЗнаменатель = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТД.Упаковка, "Знаменатель");
		Если УпаковкаЗнаменатель = 0 Тогда
			УпаковкаЗнаменатель = 1;
		КонецЕсли;
		ТД.Количество = ТД.КоличествоУпаковок * (УпаковкаЧислитель / УпаковкаЗнаменатель);
		Если ТД.НормативнаяМасса = 0 Тогда
			ТД.НормативнаяМасса = 1;
		КонецЕсли;
		
		ТД.КоличествоТары = ТД.Количество / ТД.НормативнаяМасса;
		
	Иначе
		
		ТД.Количество = ТД.КоличествоУпаковок;
		Если ТД.НормативнаяМасса = 0 Тогда
			ТД.НормативнаяМасса = 1;
		КонецЕсли;
		ТД.КоличествоТары = бит_ОбщегоНазначенияСервер.ОкруглитьВверх(ТД.КоличествоУпаковок / ТД.НормативнаяМасса);
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:38:52] -
	РассчитатьРаспределение(ТД);
	
	РасчитатьПроцентВыполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыходныеИзделияКоличествоТарыПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:35:46] +        
	// Количество, кг" = "Количество тары" * "Нормативная масса, кг"
    ТД = Элементы.ВыходныеИзделия.ТекущиеДанные;
	ТД.Количество = ТД.КоличествоТары * ТД.НормативнаяМасса;
	Если ЗначениеЗаполнено(ТД.Упаковка) Тогда
		УпаковкаЧислитель = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТД.Упаковка, "Числитель");
		Если УпаковкаЧислитель = 0 Тогда
			УпаковкаЧислитель = 1;
		КонецЕсли;
		УпаковкаЗнаменатель = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТД.Упаковка, "Знаменатель");
		Если УпаковкаЗнаменатель = 0 Тогда
			УпаковкаЗнаменатель = 1;
		КонецЕсли;
		ТД.КоличествоУпаковок = ТД.Количество / (УпаковкаЧислитель / УпаковкаЗнаменатель);
	Иначе 
		ТД.КоличествоУпаковок = ТД.Количество;
	КонецЕсли;
	РассчитатьРаспределение(ТД);
	РасчитатьПроцентВыполнения();
	// }}ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:35:46] -
КонецПроцедуры

&НаКлиенте
Процедура ВыходныеИзделияПриАктивизацииСтроки(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:45:37] +        
	ТД = Элементы.ВыходныеИзделия.ТекущиеДанные;
	РассчитатьРаспределение(ТД); 
	// }}ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:45:37] -
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРаспределение(ТД)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:46:52] +        
	РаспределениеГотовойПродукцииПоТаре.Очистить();  
	Структура = Новый Структура;
	Для Каждого стр Из Элементы.ВыходныеИзделия.ПодчиненныеЭлементы Цикл
		Имя = СтрЗаменить(стр.имя, "ВыходныеИзделия", "");
		Структура.Вставить(Имя, ТД[Имя]);
	КонецЦикла;
	РаспределитьНаСервере(Структура);
	// }}ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:46:52] -
КонецПроцедуры

&НаСервере
Процедура РаспределитьНаСервере(Структура)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [30.11.2025 13:41:10] +        
	Если Структура.Номенклатура.ВидНоменклатуры.ИспользоватьСерии = Ложь Тогда
		Возврат;
	КонецЕсли;                         
	РаспределениеГотовойПродукцииПоТаре.Очистить();
	
	КоличествоКРаспределению = Структура.Количество;
	// берем все серии из регистра по операции и номенклатуре
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	бит_СерииЭтикетокВСменномЗадании.Номенклатура КАК Номенклатура,
	                      |	бит_СерииЭтикетокВСменномЗадании.СерияНоменклатуры КАК Серия,
	                      |	бит_СерииЭтикетокВСменномЗадании.СерияНоменклатуры.Номер КАК НомерСерии,
	                      |	бит_СерииЭтикетокВСменномЗадании.СерияНоменклатуры.бит_НормативнаяМасса КАК НормативнаяМасса,
	                      |	0 КАК КоличествоКГ
	                      |ИЗ
	                      |	РегистрСведений.бит_СерииЭтикетокВСменномЗадании КАК бит_СерииЭтикетокВСменномЗадании
	                      |ГДЕ
	                      |	бит_СерииЭтикетокВСменномЗадании.Номенклатура = &Номенклатура
	                      |	И бит_СерииЭтикетокВСменномЗадании.ПроизводственнаяОперация = &ПроизводственнаяОперация
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСерии");
	Запрос.УстановитьПараметр("Номенклатура", Структура.Номенклатура);
	Запрос.УстановитьПараметр("ПроизводственнаяОперация", Операция);
	ТЗ = Запрос.Выполнить().Выгрузить();                                       
	Для каждого стр из ТЗ Цикл
		Если КоличествоКРаспределению = 0 Тогда 
			Прервать;
		КонецЕсли;
		
		Если КоличествоКРаспределению >= стр.НормативнаяМасса Тогда
			стр.КоличествоКГ = стр.НормативнаяМасса;
			КоличествоКРаспределению = КоличествоКРаспределению - стр.НормативнаяМасса;
		Иначе
			стр.КоличествоКГ = КоличествоКРаспределению;
			КоличествоКРаспределению = 0;
		КонецЕсли;
	КонецЦикла;
	РаспределениеГотовойПродукцииПоТаре.Загрузить(ТЗ);
	// }}ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [30.11.2025 13:41:10] -
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:47:24] +        
	Если ВыходныеИзделия.Количество() Тогда
		ТД = ВыходныеИзделия[0];
		РассчитатьРаспределение(ТД);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [19.11.2025 22:47:24] -
КонецПроцедуры
