
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатыЗапретаИзмененияДоступны 	 = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ДатыЗапретаИзменения);
	ИспользоватьДатыЗапретаИзменения = ПолучитьФункциональнуюОпцию("ИспользоватьДатыЗапретаИзменения");
	
	Элементы.ГруппаДатыЗапретаИзменения.Видимость = ДатыЗапретаИзмененияДоступны;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьДатыЗапретаИзменения(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ДатыЗапретаИзменения") Тогда
		МодульДатыЗапретаИзмененияСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ДатыЗапретаИзмененияСлужебныйКлиент");
		МодульДатыЗапретаИзмененияСлужебныйКлиент.ОткрытьДатыЗапретаИзмененияДанных(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючиАналитик(Команда)
	
	ОткрытьФорму("Справочник.бит_КлючиСценарийЦФО.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыЗапретаИзменения(Команда)
	
	ОткрытьФорму("Справочник.бит_ГруппыЗапретаИзмененияДанныхБюджетирования.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти