
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БотТелеграм = Параметры.БотТелеграм;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	
	Если ПроверитьЗаполнение() Тогда
	
		бит_ТелеграмСервер.НовоеСообщениеЧатуИзБазы(СообщениеВЧат, Чат);
		СообщениеВЧат = "";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
