// Первыйбит ЛТ1 + ЛТ2 ЛапшовГ "GVLapshov@1cbit.ru" 09.09.2024 +  
#Область ОбщиеПроцедурыИФункции

Процедура ВыполнитьКоманду(ИмяКоманды, ОбъектыНазначения, ПараметрыВыполнения) Экспорт
	
	ПараметрыРегистрации = СведенияОВнешнейОбработке();
	ЭтаКоманда = ПараметрыРегистрации.Команды.Найти(ИмяКоманды, "бит_ГрупповаяЗагрузкаНачальныхДанных");
	Если ЭтаКоманда = Неопределено Тогда
		Выполнить(" ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			| НСтр(""ru = 'Команда ""%1"" не поддерживается обработкой ""%2""'""),
			| ИмяКоманды,
			| Метаданные().Представление()); ");	
	КонецЕсли;
	 
КонецПроцедуры

Функция СведенияОВнешнейОбработке() Экспорт
	
	Версия = СтандартныеПодсистемыВызовСервера.ВерсияБиблиотеки(); 
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(Версия);
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
	ПараметрыРегистрации.Наименование = "Групповая загрузка начальных данных (Бит)";
	ПараметрыРегистрации.Версия = "1.0.0"; 
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = "Обработка для создания элементов справочников из внешнего файла версия: " + ПараметрыРегистрации.Версия;
	
	ПараметрыРегистрации.Назначение.Добавить("Справочник.БанковскиеСчетаКонтрагентов");   
	ПараметрыРегистрации.Назначение.Добавить("Справочник.БанковскиеСчетаОрганизаций");
	ПараметрыРегистрации.Назначение.Добавить("Справочник.Контрагенты");
	ПараметрыРегистрации.Назначение.Добавить("Справочник.Партнеры"); 
	ПараметрыРегистрации.Назначение.Добавить("Справочник.ДоговорыКонтрагентов");
	ПараметрыРегистрации.Назначение.Добавить("Справочник.ВидыНоменклатуры");
	ПараметрыРегистрации.Назначение.Добавить("Справочник.Номенклатура");
	ПараметрыРегистрации.Назначение.Добавить("Справочник.Бит_ПризнакиНоменклатуры");
	ПараметрыРегистрации.Назначение.Добавить("Справочник.Бит_ПризнакиСертификацииНоменклатуры");
    ПараметрыРегистрации.Назначение.Добавить("Справочник.УпаковкиЕдиницыИзмерения");
    ПараметрыРегистрации.Назначение.Добавить("Справочник.КлассификаторБанков");

    
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Групповая загрузка начальных данных (Бит)'");
    НоваяКоманда.Идентификатор = "бит_ГрупповаяЗагрузкаНачальныхДанных";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
		
	Возврат ПараметрыРегистрации;
	
КонецФункции 

#КонецОбласти
// Первыйбит ЛТ1 + ЛТ2 ЛапшовГ "GVLapshov@1cbit.ru" 09.09.2024 -  
 