////////////////////////////////////////////////////////////////////////////////
// Расширение функционала ОМ.БухгалтерскиеОтчетыВызовСервера
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область НастройкаОтчета

// Дополняет список организаций для отбора.
//
// См. БухгалтерскиеОтчетыВызовСервера.ДобавитьОтборПоОрганизации()
//
Процедура ДополнитьСписокОрганизаций(СписокДоступныхОрганизаций, Знач ИмяОбъектаДанных) Экспорт

	Если ВРег(ИмяОбъектаДанных) = ВРег("РегистрБухгалтерии.бит_Бюджетирование") Тогда
		СписокДоступныхОрганизаций.Добавить(Справочники.Организации.ПустаяСсылка());	
	КонецЕсли;

КонецПроцедуры

// Добавляет в отчет отбор по сценарию.
//
// Параметры:
//	ПараметрыОтчета - Структура - Содержит ключи:
//		* Сценарий - СправочникСсылка.СценарииПланирования - Сценарий, по которому строится отчет.
//		* ВключатьОбособленныеПодразделения - Булево - Признак включения в отчет данных по обособленным подразделениям.
//	КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - Компоновщик настроек СКД.
//	ВПользовательскиеНастройки - Булево - Определяет место добавления отбора.
//		Если Истина, то в пользовательские настройки, иначе - в обычные.
//
Процедура ДобавитьОтборПоСценарию(ПараметрыОтчета, КомпоновщикНастроек, ВПользовательскиеНастройки = Истина) Экспорт
		
	// Добавляем отбор по списку доступных для пользователя организаций.
	ОтборПоСценарию = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоСценарию.ЛевоеЗначение 	 = Новый ПолеКомпоновкиДанных("Сценарий");
	ОтборПоСценарию.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборПоСценарию.ПравоеЗначение 	 = ПараметрыОтчета.Сценарий;
	ОтборПоСценарию.Использование 	 = ЗначениеЗаполнено(ПараметрыОтчета.Сценарий);
	ОтборПоСценарию.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Сценарий) Тогда
		
		// АПК:1297-выкл Не локализуется.
		НовыйОтбор = БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "Сценарий", 
			ПараметрыОтчета.Сценарий,,, ВПользовательскиеНастройки);
		НовыйОтбор.Представление = "###ОтборПоСценарию###";
		// АПК:1297-вкл.
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Проверки

// Функция устанавливает максимальное количество субконто для отчета.
//
// Параметры:
//  ДанныеПроверки - Структура или ОтчетОбъект.
//
Функция МаксимальноеКоличествоСубконтоОтчета(Знач ДанныеПроверки) Экспорт

	ОтчетБФ = Ложь;	
	Если ТипЗнч(ДанныеПроверки) = Тип("Структура") Тогда
		Если ДанныеПроверки.Свойство("ОтчетБФ") Тогда
			ОтчетБФ = ДанныеПроверки.ОтчетБФ;
		КонецЕсли;
	Иначе
		Если Найти(Строка(ДанныеПроверки), "бит_") <> 0 Тогда
			ОтчетБФ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ОтчетБФ ИЛИ бит_ОбщегоНазначения.ЭтоУТ() Тогда
		// Для отчетов БФ.
		МаксКоличествоСубконто = бит_БухгалтерскийУчет.МаксимальноеКоличествоСубконто();
	Иначе
		// Для типовых отчетов.
		МодульБухгалтерскийУчет = ОбщегоНазначения.ОбщийМодуль("БухгалтерскийУчет");
		МаксКоличествоСубконто  = МодульБухгалтерскийУчет.МаксимальноеКоличествоСубконто();
	КонецЕсли;
	
	Возврат МаксКоличествоСубконто;

КонецФункции

#КонецОбласти

#Область КонтрольИтогов

// Проверяет значение ключа фнового задания и меняет при необходимости.
// См. БухгалтерскиеОтчетыВызовСервера.ПересчитатьИтоги()
//
// Параметры:
//  КлючФоновогоЗадания - Строка - имя фонового задания.
//  ИмяОтчета           - Строка - имя отчета.
//
// Возвращаемое значение:
//  Ключ задания - Строка.
//
Функция ПроверитьКлючФоновогоЗадания(Знач КлючФоновогоЗадания, Знач ИмяОтчета) Экспорт

	КлючЗадания = КлючФоновогоЗадания;
	
	Если СтрНачинаетсяС(ИмяОтчета, "бит_") Тогда
		Если СтрЗаканчиваетсяНа(ИмяОтчета, "МУ") Тогда
			КлючЗадания = "ПересчетИтоговМУ";
		ИначеЕсли СтрЗаканчиваетсяНа(ИмяОтчета, "Бюджетирование") Тогда
			КлючЗадания = "ПересчетИтоговБюджетирование";
		КонецЕсли;
	КонецЕсли;
	
	Возврат КлючЗадания;

КонецФункции

#КонецОбласти

#КонецОбласти
