
&Вместо("ЗаполнитьСтоимости")
Процедура бит_ЗаполнитьСтоимости(ПараметрыРасчета)

	Если БылаОтменаПроведения(ПараметрыРасчета.Калькуляция) Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();

	Попытка

		ЗаблокироватьДанные(ПараметрыРасчета.Калькуляция);

		МенеджерВТ = Новый МенеджерВременныхТаблиц;


		ПодготовитьСлужебныеВременныеТаблицы(МенеджерВТ, ПараметрыРасчета.Калькуляция);
		// Расчет стоимости материалов.
		ЗаполнитьСтоимостьМатериалов(ПараметрыРасчета.Калькуляция, МенеджерВТ);

		// Расчет стоимости трудозатрат.
		ЗаполнитьСтоимостьТрудозатрат(ПараметрыРасчета.Калькуляция, МенеджерВТ);

		РассчитатьПредварительнуюСтоимость(ПараметрыРасчета.Калькуляция, МенеджерВТ);

		// Расчет постатейных расходов.
		ЗаполнитьСтоимостьПостатейных(ПараметрыРасчета.Калькуляция, МенеджерВТ);

		РассчитатьПредварительнуюСтоимость(ПараметрыРасчета.Калькуляция, МенеджерВТ);

		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Материалы.Период,
		|	Материалы.ПериодЗатрат,
		|	Материалы.Калькуляция,
		|	Материалы.ПартияСпецификация,
		|	Материалы.Подразделение,
		|	Материалы.СтатьяКалькуляции,
		|	Материалы.Номенклатура,
		|	Материалы.Характеристика,
		|	Материалы.ЭтоПолуфабрикат,
		|	Материалы.Количество,
		//#Вставка //ЛТ1.3.4.2
		|	Материалы.бит_КоэффициентУкрутки,
		|	Материалы.бит_КоличествоПозиции,
		//#КонецВставки
		|	Материалы.Стоимость
		|		+ Материалы.Трудозатраты
		|		+ Материалы.ПостатейныеПостоянные
		|		+ Материалы.ПостатейныеПеременные КАК Стоимость,
		|	Материалы.СтоимостьБезНДС
		|		+ Материалы.Трудозатраты
		|		+ Материалы.ПостатейныеПостоянныеБезНДС
		|		+ Материалы.ПостатейныеПеременныеБезНДС КАК СтоимостьБезНДС,
		|	Материалы.СтоимостьРегл
		|		+ Материалы.ТрудозатратыРегл
		|		+ Материалы.ПостатейныеПостоянныеРегл
		|		+ Материалы.ПостатейныеПеременныеРегл КАК СтоимостьРегл,
		|	Материалы.СтоимостьЗабалансовая,
		|	Материалы.СтоимостьЗабалансоваяРегл
		|ИЗ
		|	МатериальныеЗатратыВключаяПолуфабрикаты КАК Материалы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеТрудозатраты.Период,
		|	ПлановыеТрудозатраты.ПериодЗатрат,
		|	ПлановыеТрудозатраты.Калькуляция,
		|	ПлановыеТрудозатраты.ПартияСпецификация,
		|	ПлановыеТрудозатраты.Подразделение,
		|	ПлановыеТрудозатраты.СтатьяКалькуляции,
		|	ПлановыеТрудозатраты.ВидРабот,
		|	ПлановыеТрудозатраты.Количество,
		|	ПлановыеТрудозатраты.Стоимость,
		|	ПлановыеТрудозатраты.СтоимостьРегл
		|ИЗ
		|	ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеПрочиеЗатраты.Период,
		|	ПлановыеПрочиеЗатраты.Калькуляция,
		|	ПлановыеПрочиеЗатраты.ПартияСпецификация,
		|	ПлановыеПрочиеЗатраты.Подразделение,
		|	ПлановыеПрочиеЗатраты.СтатьяКалькуляции,
		|	ПлановыеПрочиеЗатраты.СтатьяРасходов,
		|	ПлановыеПрочиеЗатраты.Стоимость,
		|	ПлановыеПрочиеЗатраты.СтоимостьБезНДС,
		|	ПлановыеПрочиеЗатраты.СтоимостьРегл
		|ИЗ
		|	ПлановыеПрочиеЗатраты КАК ПлановыеПрочиеЗатраты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Множители.Период,
		|	Множители.Продукция,
		|	Множители.ПартияСпецификацияПродукции,
		|	Множители.Калькуляция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.Назначение,
		|	Множители.Стоимость,
		|	Множители.СтоимостьБезНДС,
		|	Множители.СтоимостьРегл,
		|	Множители.СтоимостьЗабалансовая,
		|	Множители.СтоимостьЗабалансоваяРегл,
		|	Множители.Трудозатраты,
		|	Множители.ТрудозатратыРегл,
		|	Множители.ПостатейныеПеременные,
		|	Множители.ПостатейныеПостоянныеБезНДС,
		|	Множители.ПостатейныеПостоянныеРегл,
		|	Множители.ПостатейныеПостоянные,
		|	Множители.ПостатейныеПеременныеБезНДС,
		|	Множители.ПостатейныеПеременныеРегл,
		|	Множители.ПартияСпецификацияПолуфабриката,
		|	Множители.Полуфабрикат,
		|	Множители.ХарактеристикаПолуфабриката,
		|	Множители.Порядок,
		|	Множители.Числитель,
		|	Множители.Знаменатель,
		|	Множители.КоличествоПолуфабриката,
		|	Множители.РасчетЗавершен,
		//#Вставка
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения,
		|	Множители.бит_АгрегирующийКоэффициент,
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
		//#КонецВставки
       	|	Множители.ПартияВыпущена
		|ИЗ
		|	МножителиПартийИПолуфабрикатов КАК Множители";

		Запрос.УстановитьПараметр("Калькуляция", ПараметрыРасчета.Калькуляция);

		МассивРезультатов = Запрос.ВыполнитьПакет();

		ДокументОбъект = ПараметрыРасчета.Калькуляция.ПолучитьОбъект();

		ДокументОбъект.Движения.ПлановыеМатериальныеЗатраты.Загрузить(МассивРезультатов[0].Выгрузить());
		ДокументОбъект.Движения.ПлановыеТрудозатраты.Загрузить(МассивРезультатов[1].Выгрузить());
		ДокументОбъект.Движения.ПлановыеПрочиеЗатраты.Загрузить(МассивРезультатов[2].Выгрузить());

		ДокументОбъект.Движения.ПлановыеМатериальныеЗатраты.Записывать = Истина;
		ДокументОбъект.Движения.ПлановыеТрудозатраты.Записывать = Истина;
		ДокументОбъект.Движения.ПлановыеПрочиеЗатраты.Записывать = Истина;

		УстановитьПривилегированныйРежим(Истина);
		ДокументОбъект.Движения.Записать();
		УстановитьПривилегированныйРежим(Ложь);

		ТаблицыДляДвижений = Новый Структура("Таблица" + "МножителиПартийИПолуфабрикатов", МассивРезультатов[3].Выгрузить());
		ЗаписатьМножителиДокумента(ПараметрыРасчета.Калькуляция, ТаблицыДляДвижений);

		Для Каждого НаборЗаписей Из ДокументОбъект.Движения Цикл
			ПараметрыРасчета.КоличествоДанных = ПараметрыРасчета.КоличествоДанных + НаборЗаписей.Количество();
		КонецЦикла;
			
		// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] + 
		Выгрузка = МассивРезультатов[0].Выгрузить(); 
		ВыгрузкаДляЗапроса = МассивРезультатов[0].Выгрузить().СкопироватьКолонки("Калькуляция, Номенклатура, Характеристика");
		ВыгрузкаДляЗапроса.Очистить();
		ВыгрузкаДляЗапроса.Колонки.Добавить("ГлубинаОтбора",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 0)));
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	бит_КонтрольАктуальностиЦен.ГруппаНоменклатуры КАК ГруппаНоменклатуры,
		               |	бит_КонтрольАктуальностиЦен.ГлубинаОтбора КАК ГлубинаОтбора,
		               |	бит_КонтрольАктуальностиЦен.УровеньИерархии КАК УровеньИерархии
		               |ИЗ
		               |	Справочник.бит_КонтрольАктуальностиЦен КАК бит_КонтрольАктуальностиЦен
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	УровеньИерархии";
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать(); 
		УстановитьПривилегированныйРежим(Ложь);
		ДобавитьДокументВНеактуальный = Ложь;
		Для Каждого СтрокаВыгрузки Из Выгрузка Цикл 
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл
				Если СтрокаВыгрузки.Номенклатура.ПринадлежитЭлементу(Выборка.ГруппаНоменклатуры) Тогда  
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Номенклатура", СтрокаВыгрузки.Номенклатура);
					НЗ = ВыгрузкаДляЗапроса.НайтиСтроки(ПараметрыОтбора);
					Если НЗ.Количество() > 0 Тогда
						НЗ[0].ГлубинаОтбора = Выборка.ГлубинаОтбора;
					Иначе 
						НоваяСтрока = ВыгрузкаДляЗапроса.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыгрузки);
						НоваяСтрока.ГлубинаОтбора = Выборка.ГлубинаОтбора;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Характеристика КАК Характеристика,
		|	&ВидЦены КАК ВидЦены,
		|	ТЗ.ГлубинаОтбора КАК ГлубинаОтбораЗаданная,
		|	&Период КАК Период
		|ПОМЕСТИТЬ ВТ1
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры.ХарактеристикаЦО КАК ХарактеристикаЦО,
		|	ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
		|	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
		|ПОМЕСТИТЬ МакимальныйПериодЦен
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25 КАК ЦеныНоменклатуры
		|ГДЕ
		|	ЦеныНоменклатуры.ВидЦены = &ВидЦены
		|	И ЦеныНоменклатуры.Номенклатура В
		|			(ВЫБРАТЬ
		|				ВТ1.Номенклатура
		|			ИЗ
		|				ВТ1)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатуры.Номенклатура,
		|	ЦеныНоменклатуры.ХарактеристикаЦО,
		|	ЦеныНоменклатуры.ВидЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МакимальныйПериодЦен.Номенклатура КАК Номенклатура,
		|	МакимальныйПериодЦен.ХарактеристикаЦО КАК ХарактеристикаЦО,
		|	МакимальныйПериодЦен.ВидЦены КАК ВидЦены,
		|	МакимальныйПериодЦен.Период КАК Период,
		|	РАЗНОСТЬДАТ(МакимальныйПериодЦен.Период, &Период, ДЕНЬ) КАК ГлубинаОтбораЦен
		|ПОМЕСТИТЬ ГлубинаОтбора
		|ИЗ
		|	МакимальныйПериодЦен КАК МакимальныйПериодЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ1.Номенклатура КАК Номенклатура,
		|	ВТ1.Характеристика КАК Характеристика,
		|	ВТ1.ВидЦены КАК ВидЦены,
		|	ВТ1.ГлубинаОтбораЗаданная КАК ГлубинаОтбораЗаданная,
		|	ГлубинаОтбора.ГлубинаОтбораЦен КАК ГлубинаОтбораЦен
		|ИЗ
		|	ВТ1 КАК ВТ1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГлубинаОтбора КАК ГлубинаОтбора
		|		ПО ВТ1.Номенклатура = ГлубинаОтбора.Номенклатура
		|			И ВТ1.ВидЦены = ГлубинаОтбора.ВидЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ1.Номенклатура,
		|	ВТ1.Характеристика,
		|	ВТ1.ВидЦены,
		|	ВТ1.ГлубинаОтбораЗаданная,
		|	ГлубинаОтбора.ГлубинаОтбораЦен
		|
		|ИМЕЮЩИЕ
		|	НЕ ГлубинаОтбора.ГлубинаОтбораЦен ЕСТЬ NULL";
		Запрос.УстановитьПараметр("ТЗ", ВыгрузкаДляЗапроса); 
		Запрос.УстановитьПараметр("Период", ПараметрыРасчета.Калькуляция.Дата);
		Запрос.УстановитьПараметр("ВидЦены", ПараметрыРасчета.Калькуляция.ВидЦены);
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		Пока Выборка.Следующий() Цикл
			Если Выборка.ГлубинаОтбораЗаданная < Выборка.ГлубинаОтбораЦен Тогда 
				ДобавитьДокументВНеактуальный = Истина; 
				УстановитьПривилегированныйРежим(Истина);
				МенеджерЗаписи = РегистрыСведений.бит_НеактуальныеЦеныВПлановойКалькуляции.СоздатьМенеджерЗаписи(); 
				МенеджерЗаписи.ПлановаяКалькуляция = ПараметрыРасчета.Калькуляция; 
				МенеджерЗаписи.Номенклатура = Выборка.Номенклатура; 
				//МенеджерЗаписи.Характеристика = Выборка.Характеристика; 
				МенеджерЗаписи.ГлубинаОтбора = Выборка.ГлубинаОтбораЗаданная; 
				МенеджерЗаписи.ГлубинаУстановленнойЦены = Выборка.ГлубинаОтбораЦен;
				МенеджерЗаписи.Записать(Истина); 
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		КонецЦикла;
		Если Не ДобавитьДокументВНеактуальный Тогда
			УстановитьПривилегированныйРежим(Истина);
			НаборЗаписей = РегистрыСведений.бит_НеактуальныеЦеныВПлановойКалькуляции.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.ПлановаяКалькуляция.Установить(ПараметрыРасчета.Калькуляция);
			НаборЗаписей.Записать(Истина); 
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
			
		// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] -
		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();

		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписатьСостояниеКалькуляции(ПараметрыРасчета.Калькуляция, 
		Перечисления.СостоянияРасчетаПлановойКалькуляции.ОшибкаРасчета);
		ОчиститьОчередьПоКалькуляции(ПараметрыРасчета.Калькуляция);
		ЗаписатьВЖурналОшибкуРассчета(ПараметрыРасчета.Калькуляция, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));

	КонецПопытки;

КонецПроцедуры

&ИзменениеИКонтроль("РазузловатьСпецификациюИзделий")
Процедура бит_РазузловатьСпецификациюИзделий(Калькуляция, Множители, Движения, ПараметрыРасчета)

	ПотребностиКРазузлованию = ПотребностиДляПолученияДанныхСпецификаций(Множители, ПараметрыРасчета);

	Если ПотребностиКРазузлованию.Количество() = 0 Тогда

		Движения.МножителиПартийИПолуфабрикатов = Множители;
		Возврат;

	КонецЕсли;

	// Разузлование спецификаций.
	ПараметрыВыборкиДанных = Справочники.РесурсныеСпецификации.ПараметрыВыборкиДанных();
	ПараметрыВыборкиДанных.ПереопределениеНастройкиПартииВыпуска.Использовать = Истина;
	ПараметрыВыборкиДанных.ОкруглятьКоличествоШтучныхТоваров = Ложь;
	ПараметрыВыборкиДанных.РассчитыватьДолиСтоимостиВыходныхИзделий = Истина;

	// Для разузлования ПФ, у которых в спецификации СпособПолучения = Обеспечивать
	// В регистре сведений "ВариантыОбеспеченияТоварами" должна быть запись для этого ПФ с способом обеспечения потребностей = "Собственное производство"
	// В функции ниже смотри запрос формирования после комментария // МатериалыИУслуги
	// Разузлование будет работать, если в данной таблице, для ПФ, колонка Запланировать = Истина
	Потребности = Справочники.РесурсныеСпецификации.ДанныеСпецификацииПоСпискуНоменклатуры(
	ПотребностиКРазузлованию,
	ПараметрыВыборкиДанных);

	// Заполнение дат производства в зависимости от длительности этапов.
	// Одновременное выполнение этапов не поддерживается.
	ПериодКалькуляции = Калькуляция.Дата;
	ЗаполнитьДатыПроизводства(Потребности, ПериодКалькуляции);

	РазузлованныеОбъекты = Новый Массив;
	КоличествоПолуфабрикатов = Потребности.Количество();
	Индекс = 0;

	Множители.Индексы.Добавить("ПартияСпецификацияПродукции, Продукция, ХарактеристикаПродукции, Полуфабрикат, РасчетЗавершен");
	Множители.Индексы.Добавить("ПартияСпецификацияПолуфабриката, Полуфабрикат, ХарактеристикаПолуфабриката, РасчетЗавершен");

	// Обработка результата разузлования.
	// Расчет множителей полуфабрикатов.
	Пока Индекс < КоличествоПолуфабрикатов Цикл

		ДанныеСпецификации = Потребности[Индекс];

		РасчетПланаПроизводства.ПроброситьПеремещения(ДанныеСпецификации.МатериалыИУслуги);

		ДолиСтоимости = ДанныеСпецификации.ВыходныеИзделия.Итог("ДоляСтоимости");

		Если ДолиСтоимости = 0 Тогда
			ДолиСтоимости = 1;
		КонецЕсли;

		Для Каждого ВыходноеИзделие Из ДанныеСпецификации.ВыходныеИзделия Цикл

			ДоляСтоимости = ?(ВыходноеИзделие.ДоляСтоимости = 0, 1, ВыходноеИзделие.ДоляСтоимости);

			ОтборПродукции = Новый Структура;
			ОтборПродукции.Вставить("ПартияСпецификацияПродукции", ДанныеСпецификации.Спецификация);
			Если ЗначениеЗаполнено(ВыходноеИзделие.Номенклатура) Тогда

				ОтборПродукции.Вставить("Продукция", ВыходноеИзделие.Номенклатура);
				Если Не ВыходноеИзделие.ЛюбаяХарактеристика Тогда
					ОтборПродукции.Вставить("ХарактеристикаПродукции", ВыходноеИзделие.Характеристика);
				КонецЕсли;

			Иначе

				ОтборПродукции.Вставить("Продукция", 
				Справочники.Номенклатура.ПустаяСсылка());
				ОтборПродукции.Вставить("ХарактеристикаПродукции", 
				Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());

			КонецЕсли;
			ОтборПродукции.Вставить("Полуфабрикат", Справочники.Номенклатура.ПустаяСсылка());
			ОтборПродукции.Вставить("РасчетЗавершен", Ложь);

			СтрокиМножителей = Множители.НайтиСтроки(ОтборПродукции);

			Если СтрокиМножителей.Количество() = 0 Тогда

				// Выходное изделие является полуфабрикатом.
				ОтборПолуфабриката = Новый Структура;
				ОтборПолуфабриката.Вставить("ПартияСпецификацияПолуфабриката", 	ДанныеСпецификации.Спецификация);
				Если ЗначениеЗаполнено(ВыходноеИзделие.Номенклатура) Тогда

					ОтборПолуфабриката.Вставить("Полуфабрикат",					ВыходноеИзделие.Номенклатура);
					ОтборПолуфабриката.Вставить("ХарактеристикаПолуфабриката",	ВыходноеИзделие.Характеристика);

				Иначе

					ОтборПолуфабриката.Вставить("Полуфабрикат", 
					Справочники.Номенклатура.ПустаяСсылка());
					ОтборПолуфабриката.Вставить("ХарактеристикаПолуфабриката", 
					Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());

				КонецЕсли;
				ОтборПолуфабриката.Вставить("РасчетЗавершен", Ложь);

				СтрокиМножителей = Множители.НайтиСтроки(ОтборПолуфабриката);

			Иначе

				Для Каждого СтрокаПродукции Из СтрокиМножителей Цикл
					СтрокаПродукции.Период = ДанныеСпецификации.Окончание;
				КонецЦикла;

			КонецЕсли;

			Для Каждого Множитель Из СтрокиМножителей Цикл

				Множитель.Числитель = Множитель.КоличествоПолуфабриката * ДоляСтоимости;
				Множитель.Знаменатель = ДолиСтоимости * ВыходноеИзделие.Количество;

				Множитель.РасчетЗавершен = Истина;

				#Вставка
				// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 + 
				Для Каждого СтрокаТрудозатрат Из ДанныеСпецификации.Трудозатраты Цикл
					Если СтрокаТрудозатрат.бит_ПроцентВыполненияОперации <> 0 Тогда
						Множитель.бит_ПроцентВыполнения = СтрокаТрудозатрат.бит_ПроцентВыполненияОперации;
					КонецЕсли;	
				КонецЦикла;
				Множитель.бит_ПроцентВыполнения = ?(Множитель.бит_ПроцентВыполнения = 0, 100,
				Множитель.бит_ПроцентВыполнения);
				// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
				#КонецВставки
				Для Каждого СтрокаМатериала Из ДанныеСпецификации.МатериалыИУслуги Цикл

					Если Не (СтрокаМатериала.Запланировать ИЛИ СтрокаМатериала.Производится) Тогда
						Продолжить;
					КонецЕсли;
					
					НовыйМножитель = Множители.Добавить();
					ЗаполнитьЗначенияСвойств(НовыйМножитель, Множитель, "ПартияСпецификацияПродукции, Продукция, ХарактеристикаПродукции, Назначение, Калькуляция");

					Если СтрокаМатериала.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации Тогда
						НовыйМножитель.ПартияСпецификацияПолуфабриката = СтрокаМатериала.Спецификация;
					Иначе
						НовыйМножитель.ПартияСпецификацияПолуфабриката = Неопределено;
					КонецЕсли;
					
					#Вставка
					// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
					НовыйМножитель.бит_АгрегирующийКоэффициент = ?(СтрокаМатериала.бит_АгрегирующийКоэффициент = 0, 1,
																		СтрокаМатериала.бит_АгрегирующийКоэффициент)*
																		?(Множитель.бит_АгрегирующийКоэффициент = 0, 1,
																		Множитель.бит_АгрегирующийКоэффициент);
					Если бит_ПризнакРасчетаАгрегирующегоК(СтрокаМатериала.Номенклатура) Тогда													
						НовыйМножитель.бит_КомпенсирующийКоэффициент = 0;
					Иначе
						НовыйМножитель.бит_КомпенсирующийКоэффициент = НовыйМножитель.бит_АгрегирующийКоэффициент;
					КонецЕсли;	
						// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
					#КонецВставки
					НовыйМножитель.Период = ДанныеСпецификации.Начало;
					НовыйМножитель.Полуфабрикат = СтрокаМатериала.Номенклатура;
					НовыйМножитель.ХарактеристикаПолуфабриката = СтрокаМатериала.Характеристика;
					НовыйМножитель.Порядок = Множитель.Порядок + 1;

					ОтборПозиций = Новый Структура("Период, ПартияСпецификацияПродукции, Продукция, ХарактеристикаПродукции, Назначение, ПартияСпецификацияПолуфабриката, Полуфабрикат, ХарактеристикаПолуфабриката, Порядок, РасчетЗавершен");	
					ЗаполнитьЗначенияСвойств(ОтборПозиций, НовыйМножитель);
					ОтборПозиций.РасчетЗавершен = Истина;
					РассчитанныеПозиции = Множители.НайтиСтроки(ОтборПозиций);
					Для Каждого РассчитаннаяПозиция Из РассчитанныеПозиции Цикл

						Если НовыйМножитель.Порядок > РассчитаннаяПозиция.Порядок Тогда
							Продолжить;
						КонецЕсли;

						НовыйМножитель.Порядок = РассчитаннаяПозиция.Порядок + 1;

					КонецЦикла;

					НовыйМножитель.Числитель =  1;
					НовыйМножитель.Знаменатель = 1;

					НовыйМножитель.Стоимость = 0;
					НовыйМножитель.СтоимостьБезНДС = 0;
					НовыйМножитель.СтоимостьРегл = 0;
					НовыйМножитель.Трудозатраты = 0;
					НовыйМножитель.ТрудозатратыРегл = 0;
					НовыйМножитель.ПостатейныеПостоянные = 0;
					НовыйМножитель.ПостатейныеПостоянныеБезНДС = 0;
					НовыйМножитель.ПостатейныеПостоянныеРегл = 0;
					НовыйМножитель.ПостатейныеПеременные = 0;
					НовыйМножитель.ПостатейныеПеременныеБезНДС = 0;
					НовыйМножитель.ПостатейныеПеременныеРегл = 0;
					НовыйМножитель.СтоимостьЗабалансовая = 0;
					НовыйМножитель.СтоимостьЗабалансоваяРегл = 0;
					НовыйМножитель.Приоритет = ?(ЗначениеЗаполнено(НовыйМножитель.Полуфабрикат), 1, 0);

					НовыйМножитель.РасчетЗавершен = Ложь;
					НовыйМножитель.ПартияВыпущена = Ложь;

					НовыйМножитель.КоличествоПолуфабриката = Окр(Множитель.Числитель * СтрокаМатериала.Количество / Множитель.Знаменатель, 7);
					
					#Вставка
					// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 + 
					//Для Каждого СтрокаТрудозатрат Из ДанныеСпецификации.Трудозатраты Цикл
					//	Если СтрокаТрудозатрат.бит_ПроцентВыполненияОперации <> 0 Тогда
					//		НовыйМножитель.бит_ПроцентВыполнения = СтрокаТрудозатрат.бит_ПроцентВыполненияОперации;
					//	КонецЕсли;	
					//КонецЦикла;
					//НовыйМножитель.бит_ПроцентВыполнения = ?(НовыйМножитель.бит_ПроцентВыполнения = 0, 100,
					//										НовыйМножитель.бит_ПроцентВыполнения);
					// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
					#КонецВставки
                КонецЦикла;
				
			КонецЦикла;

		КонецЦикла;

		Если Не РазузлованныеОбъекты.Найти(ДанныеСпецификации.Спецификация) = Неопределено Тогда

			Индекс = Индекс + 1;
			Продолжить;

		КонецЕсли;

		ПараметрыРасчетаПериода = ПараметрыРасчетаПериода();
		ПараметрыРасчетаПериода.Период = НачалоДня(ДанныеСпецификации.Начало);
		ПараметрыРасчетаПериода.Этапы = ДанныеСпецификации.Этапы;
		ПараметрыРасчетаПериода.ДлительностиЭтапов = ДанныеСпецификации.Этапы.ВыгрузитьКолонку("ДлительностьЭтапа");

		ЭтапыНаСтороне = ДанныеСпецификации.Этапы.НайтиСтроки(Новый Структура("ПроизводствоНаСтороне", Истина));
		Для Каждого ЭтапНаСтороне Из ЭтапыНаСтороне Цикл

			ПлановыеМатериальныеЗатраты = Движения.ПлановыеМатериальныеЗатраты; // ТаблицаЗначений

			ПараметрыРасчетаПериода.ТекущийЭтап = ЭтапНаСтороне.Этап;
			ПериодЗатратЭтапа = ПолучитьПериодЗатрат(ПараметрыРасчетаПериода);

			Для Каждого ТекУслуга Из ЭтапНаСтороне.УслугиПереработчика Цикл

				НоваяУслуга = ПлановыеМатериальныеЗатраты.Добавить();
				НоваяУслуга.Период 				= ПериодКалькуляции;
				НоваяУслуга.ПартияСпецификация 	= ДанныеСпецификации.Спецификация;
				НоваяУслуга.Подразделение 		= ЭтапНаСтороне.Подразделение;
				НоваяУслуга.СтатьяКалькуляции 	= ТекУслуга.СтатьяКалькуляции;
				НоваяУслуга.Номенклатура 		= ТекУслуга.Номенклатура;
				НоваяУслуга.Характеристика 		= ТекУслуга.Характеристика;
				НоваяУслуга.Количество 			= ТекУслуга.Количество;
				НоваяУслуга.ПериодЗатрат 		= ПериодЗатратЭтапа;

			КонецЦикла;

		КонецЦикла;

		ПроизводимыеПолуфабрикаты = ДанныеСпецификации.МатериалыИУслуги.СкопироватьКолонки("Номенклатура,Характеристика,СтатьяКалькуляции,Этап");
		Для Каждого СтрокаМатериала Из ДанныеСпецификации.МатериалыИУслуги Цикл

			ПлановыеМатериальныеЗатраты = Движения.ПлановыеМатериальныеЗатраты; // ТаблицаЗначений
			НовыйМатериал = ПлановыеМатериальныеЗатраты.Добавить();
			НовыйМатериал.Период = ПериодКалькуляции;
			НовыйМатериал.ПартияСпецификация = ДанныеСпецификации.Спецификация;
			НовыйМатериал.Подразделение = СтрокаМатериала.ПодразделениеЭтапа;
			НовыйМатериал.СтатьяКалькуляции = СтрокаМатериала.СтатьяКалькуляции;
			НовыйМатериал.Номенклатура = СтрокаМатериала.Номенклатура;
			НовыйМатериал.Характеристика = СтрокаМатериала.Характеристика;
			НовыйМатериал.Количество = СтрокаМатериала.КоличествоУпаковок
			* СтрокаМатериала.ДанныеУпаковки.Числитель / СтрокаМатериала.ДанныеУпаковки.Знаменатель;
			
			#Вставка //ЛТ 1.3.42
			НовыйМатериал.бит_КоличествоПозиции = СтрокаМатериала.бит_КоличествоПозиции;
			НовыйМатериал.бит_КоэффициентУкрутки = СтрокаМатериала.бит_КоэффициентУкрутки;
			#КонецВставки
			
			ПараметрыРасчетаПериода.ТекущийЭтап = СтрокаМатериала.Этап;
			НовыйМатериал.ПериодЗатрат = ПолучитьПериодЗатрат(ПараметрыРасчетаПериода);

			Если СтрокаМатериала.Запланировать ИЛИ СтрокаМатериала.Производится Тогда
				НовыйМатериал.ЭтоПолуфабрикат = Истина;
				Если СтрокаМатериала.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе Тогда
					НовыйПолуфабрикат = ПроизводимыеПолуфабрикаты.Добавить();
					НовыйПолуфабрикат.Номенклатура = СтрокаМатериала.Номенклатура;
					НовыйПолуфабрикат.Характеристика = СтрокаМатериала.Характеристика;
					НовыйПолуфабрикат.СтатьяКалькуляции = СтрокаМатериала.СтатьяКалькуляции;
					НовыйПолуфабрикат.Этап = СтрокаМатериала.ИсточникПолученияПолуфабриката;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;
		ПроизводимыеПолуфабрикаты.Индексы.Добавить("Номенклатура,Характеристика,СтатьяКалькуляции,Этап");

		Для Каждого СтрокаТрудозатрат Из ДанныеСпецификации.Трудозатраты Цикл

			ПлановыеТрудозатраты = Движения.ПлановыеТрудозатраты; // ТаблицаЗначений
			НоваяТрудозатрата = ПлановыеТрудозатраты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяТрудозатрата, СтрокаТрудозатрат);
			НоваяТрудозатрата.Период = ПериодКалькуляции;
			НоваяТрудозатрата.ПартияСпецификация = ДанныеСпецификации.Спецификация;
			НоваяТрудозатрата.Подразделение = СтрокаТрудозатрат.ПодразделениеЭтапа;
			НоваяТрудозатрата.Количество = СтрокаТрудозатрат.Количество;

			ПараметрыРасчетаПериода.ТекущийЭтап = СтрокаТрудозатрат.Этап;
			НоваяТрудозатрата.ПериодЗатрат = ПолучитьПериодЗатрат(ПараметрыРасчетаПериода);
			
		КонецЦикла;

		Для Каждого СтрокаМатериала Из ДанныеСпецификации.ВозвратныеОтходы Цикл

			ПлановыеМатериальныеЗатраты = Движения.ПлановыеМатериальныеЗатраты; // ТаблицаЗначений
			НоваяСтрока = ПлановыеМатериальныеЗатраты.Добавить();
			НоваяСтрока.Период = ПериодКалькуляции;
			НоваяСтрока.ПартияСпецификация = ДанныеСпецификации.Спецификация;
			НоваяСтрока.Подразделение = СтрокаМатериала.ПодразделениеЭтапа;
			НоваяСтрока.СтатьяКалькуляции = СтрокаМатериала.СтатьяКалькуляции;
			НоваяСтрока.Номенклатура = СтрокаМатериала.Номенклатура;
			НоваяСтрока.Характеристика = СтрокаМатериала.Характеристика;
			НоваяСтрока.Количество = -СтрокаМатериала.КоличествоУпаковок
			* СтрокаМатериала.ДанныеУпаковки.Числитель / СтрокаМатериала.ДанныеУпаковки.Знаменатель;

			ПараметрыРасчетаПериода.ТекущийЭтап = СтрокаМатериала.Этап;
			НоваяСтрока.ПериодЗатрат = ПолучитьПериодЗатрат(ПараметрыРасчетаПериода);

			УсловияПоиска = Новый Структура("Номенклатура,Характеристика,СтатьяКалькуляции,Этап", 
			СтрокаМатериала.Номенклатура, СтрокаМатериала.Характеристика, СтрокаМатериала.СтатьяКалькуляции, СтрокаМатериала.Этап);
			Если ПроизводимыеПолуфабрикаты.НайтиСтроки(УсловияПоиска).Количество() > 0 Тогда
				НоваяСтрока.ЭтоПолуфабрикат = Истина;
			КонецЕсли;

		КонецЦикла;		

		РазузлованныеОбъекты.Добавить(ДанныеСпецификации.Спецификация);
		Индекс = Индекс + 1;

	КонецЦикла;

	Множители.Индексы.Очистить();
	ПривестиМножителиКОбщемуЗнаменателю(Множители);

	Движения.МножителиПартийИПолуфабрикатов = Множители;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьСтоимостьМатериалов")
Процедура бит_ЗаполнитьСтоимостьМатериалов(Калькуляция, МенеджерВТ)

	ПолучитьЦеныНоменклатуры(Калькуляция, МенеджерВТ);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Калькуляция, "ВидЦены, Дата, Организация");

	Запрос.УстановитьПараметр("Калькуляция", Калькуляция);
	Запрос.УстановитьПараметр("ВидЦены", ЗначенияРеквизитов.ВидЦены);
	Запрос.УстановитьПараметр("Период", ЗначенияРеквизитов.Дата);
	Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ЗначенияРеквизитов.Организация));
	Запрос.УстановитьПараметр("СтранаРегистрации", ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(ЗначенияРеквизитов.Организация));

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатуры.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВалютыНоменклатуры
	|ИЗ
	|	ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВалютыНоменклатуры.Валюта КАК Валюта,
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.КурсЧислитель, 0) КАК КурсЧислитель,
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.КурсЗнаменатель, 0) КАК КурсЗнаменатель
	|ПОМЕСТИТЬ КурсыВалютНоменклатуры
	|ИЗ
	|	ВалютыНоменклатуры КАК ВалютыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
	|				&Период,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Валюты.Валюта КАК Валюта
	|					ИЗ
	|						ВалютыНоменклатуры КАК Валюты)
	|					И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютСрезПоследних
	|		ПО ВалютыНоменклатуры.Валюта = КурсыВалютСрезПоследних.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеМатериальныеЗатраты.Калькуляция КАК Калькуляция,
	|	ПлановыеМатериальныеЗатраты.ПартияСпецификация КАК ПартияСпецификация,
	|	ПлановыеМатериальныеЗатраты.Подразделение КАК Подразделение,
	|	ПлановыеМатериальныеЗатраты.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ПлановыеМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	ПлановыеМатериальныеЗатраты.Характеристика КАК Характеристика,
	|	ПлановыеМатериальныеЗатраты.Количество КАК Количество,
	#Вставка //ЛТ1.3.4.2
	|	ПлановыеМатериальныеЗатраты.бит_КоэффициентУкрутки КАК бит_КоэффициентУкрутки,
	|	ПлановыеМатериальныеЗатраты.бит_КоличествоПозиции КАК бит_КоличествоПозиции,
	#КонецВставки
	|	ПлановыеМатериальныеЗатраты.Период КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ ПлановыеМатериальныеЗатраты.Стоимость = 0
	|			И НЕ (ПлановыеМатериальныеЗатраты.Количество > 0 И ПлановыеМатериальныеЗатраты.Стоимость = -1)
	|			ТОГДА ПлановыеМатериальныеЗатраты.Стоимость
	|		ИНАЧЕ ПлановыеМатериальныеЗатраты.Количество * ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) * ВЫБОР
	|				КОГДА ЦеныНоменклатуры.Валюта = КурсыВалютУУ.Валюта
	|					ТОГДА 1
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(КурсыВалютНоменклатуры.КурсЗнаменатель, 0) * КурсыВалютУУ.КурсЧислитель = 0
	|							ТОГДА 1
	|						ИНАЧЕ КурсыВалютНоменклатуры.КурсЧислитель * КурсыВалютУУ.КурсЗнаменатель / (КурсыВалютНоменклатуры.КурсЗнаменатель * КурсыВалютУУ.КурсЧислитель)
	|					КОНЕЦ
	|			КОНЕЦ * ВЫБОР
	|				КОГДА Количество > 0
	|					И ПлановыеМатериальныеЗатраты.Стоимость = -1
	|					ТОГДА 1
	|				КОГДА ПлановыеМатериальныеЗатраты.Количество < 0
	|					ТОГДА 1
	|				КОГДА ВидыЦен.Ссылка ЕСТЬ NULL
	|					ТОГДА 1
	|				КОГДА ВидыЦен.ЦенаВключаетНДС
	|					ТОГДА 1
	|				ИНАЧЕ ВЫБОР
	|						КОГДА (ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка > 0
	|							ТОГДА ((ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка + 100) / 100
	|						ИНАЧЕ (ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Стоимость,
	|	ПлановыеМатериальныеЗатраты.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	|	ПлановыеМатериальныеЗатраты.ПериодЗатрат КАК ПериодЗатрат,
	|	ВЫБОР
	|		КОГДА НЕ ПлановыеМатериальныеЗатраты.СтоимостьРегл = 0
	|			И НЕ (ПлановыеМатериальныеЗатраты.Количество > 0 И ПлановыеМатериальныеЗатраты.СтоимостьРегл = -1)
	|			ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьРегл
	|		ИНАЧЕ ПлановыеМатериальныеЗатраты.Количество * ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	|	КОНЕЦ * ВЫБОР
	|		КОГДА ЦеныНоменклатуры.Валюта = КурсыВалютБУ.Валюта
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(КурсыВалютНоменклатуры.КурсЗнаменатель, 0) * КурсыВалютБУ.КурсЧислитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ КурсыВалютНоменклатуры.КурсЧислитель * КурсыВалютБУ.КурсЗнаменатель / (КурсыВалютНоменклатуры.КурсЗнаменатель * КурсыВалютБУ.КурсЧислитель)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА Количество > 0
	|			И ПлановыеМатериальныеЗатраты.СтоимостьРегл = -1
	|			ТОГДА 1
	|		КОГДА ПлановыеМатериальныеЗатраты.Количество < 0
	|			ТОГДА 1
	|		КОГДА ВидыЦен.Ссылка ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА НЕ ВидыЦен.ЦенаВключаетНДС
	|			ТОГДА 1
	|		ИНАЧЕ ((ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка + 100) / 100
	|	КОНЕЦ КАК СтоимостьРегл,
	|	ВЫБОР
	|		КОГДА НЕ ПлановыеМатериальныеЗатраты.СтоимостьБезНДС = 0
	|			И НЕ (ПлановыеМатериальныеЗатраты.Количество > 0 И ПлановыеМатериальныеЗатраты.СтоимостьБезНДС = -1)
	|			ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьБезНДС
	|		ИНАЧЕ ПлановыеМатериальныеЗатраты.Количество * ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	|	КОНЕЦ * ВЫБОР
	|		КОГДА ЦеныНоменклатуры.Валюта = КурсыВалютУУ.Валюта
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(КурсыВалютНоменклатуры.КурсЗнаменатель, 0) * КурсыВалютУУ.КурсЧислитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ КурсыВалютНоменклатуры.КурсЧислитель * КурсыВалютУУ.КурсЗнаменатель / (КурсыВалютНоменклатуры.КурсЗнаменатель * КурсыВалютУУ.КурсЧислитель)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА Количество > 0
	|			И ПлановыеМатериальныеЗатраты.СтоимостьБезНДС = -1
	|			ТОГДА 1
	|		КОГДА ПлановыеМатериальныеЗатраты.Количество < 0
	|			ТОГДА 1
	|		КОГДА ВидыЦен.Ссылка ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА НЕ ВидыЦен.ЦенаВключаетНДС
	|			ТОГДА 1
	|		ИНАЧЕ ((ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка + 100) / 100
	|	КОНЕЦ КАК СтоимостьБезНДС,
	|	ПлановыеМатериальныеЗатраты.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	ПлановыеМатериальныеЗатраты.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл
	|ПОМЕСТИТЬ МатериальныеЗатраты
	|ИЗ
	|	РегистрНакопления.ПлановыеМатериальныеЗатраты КАК ПлановыеМатериальныеЗатраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ПлановыеМатериальныеЗатраты.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ПлановыеМатериальныеЗатраты.Характеристика = ЦеныНоменклатуры.Характеристика
	|			И ПлановыеМатериальныеЗатраты.Период = ЦеныНоменклатуры.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютНоменклатуры КАК КурсыВалютНоменклатуры
	|		ПО (ЦеныНоменклатуры.Валюта = КурсыВалютНоменклатуры.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалютУУ
	|		ПО (КурсыВалютУУ.ВидВалюты = ""ВалютаУпрУчета"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалютБУ
	|		ПО (КурсыВалютБУ.ВидВалюты = ""ВалютаРеглУчета"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО (ВидыЦен.Ссылка = &ВидЦены)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(&Период,
	|			Страна = &СтранаРегистрации ИЛИ Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтавкиНДСНоменклатуры
	|		ПО ПлановыеМатериальныеЗатраты.Номенклатура = СтавкиНДСНоменклатуры.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&Период, Страна = &СтранаРегистрации) КАК ОсновныеСтавкиНДС
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ПлановыеМатериальныеЗатраты.Калькуляция = &Калькуляция
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Калькуляция,
	|	ПартияСпецификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЦеныНоменклатуры
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВалютыНоменклатуры";

	УстановитьПривилегированныйРежим(Истина);
	Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&ИзменениеИКонтроль("РассчитатьПредварительнуюСтоимость")
Процедура бит_РассчитатьПредварительнуюСтоимость(Калькуляция, МенеджерВТ)

	УдалитьТаблицуПрочихЗатрат = Ложь;

	Если МенеджерВТ.Таблицы.Найти("ПлановыеПрочиеЗатраты") = Неопределено Тогда

		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	*
		|ПОМЕСТИТЬ ПлановыеПрочиеЗатраты
		|ИЗ
		|	РегистрНакопления.ПлановыеПрочиеЗатраты";

		УстановитьПривилегированныйРежим(Истина);
		Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);

		УдалитьТаблицуПрочихЗатрат = Истина;

	КонецЕсли;

	РассчитатьЦеныМатериалов(Калькуляция, МенеджерВТ);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	МатериальныеЗатраты.Калькуляция КАК Калькуляция,
	|	МатериальныеЗатраты.ПартияСпецификация КАК ПартияСпецификация,
	|	МатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	МатериальныеЗатраты.Характеристика КАК Характеристика,
	|	МатериальныеЗатраты.Подразделение КАК Подразделение,
	|	МатериальныеЗатраты.Период КАК Период,
	|	МатериальныеЗатраты.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	МатериальныеЗатраты.Количество КАК Количество,
	#Вставка //ЛТ1.3.4.2
	|	МатериальныеЗатраты.бит_КоэффициентУкрутки КАК бит_КоэффициентУкрутки,
	|	МатериальныеЗатраты.бит_КоличествоПозиции КАК бит_КоличествоПозиции,
	#КонецВставки

	|	МатериальныеЗатраты.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаСтоимость
	|		ИНАЧЕ МатериальныеЗатраты.Стоимость
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаСтоимостьБезНДС
	|		ИНАЧЕ МатериальныеЗатраты.СтоимостьБезНДС
	|	КОНЕЦ КАК СтоимостьБезНДС,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаСтоимостьРегл
	|		ИНАЧЕ МатериальныеЗатраты.СтоимостьРегл
	|	КОНЕЦ КАК СтоимостьРегл,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаТрудозатраты
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Трудозатраты,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаТрудозатратыРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТрудозатратыРегл,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаПостатейныеПостоянные
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостатейныеПостоянные,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаПостатейныеПостоянныеБезНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостатейныеПостоянныеБезНДС,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаПостатейныеПостоянныеРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостатейныеПостоянныеРегл,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаПостатейныеПеременные
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостатейныеПеременные,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаПостатейныеПеременныеБезНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостатейныеПеременныеБезНДС,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаПостатейныеПеременныеРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостатейныеПеременныеРегл,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаСтоимостьЗабалансовая
	|		ИНАЧЕ МатериальныеЗатраты.СтоимостьЗабалансовая
	|	КОНЕЦ КАК СтоимостьЗабалансовая,
	|	ВЫБОР
	|		КОГДА МатериальныеЗатраты.ЭтоПолуфабрикат
	|			ТОГДА МатериальныеЗатраты.Количество * ЦеныМатериалов.ЦенаСтоимостьЗабалансоваяРегл
	|		ИНАЧЕ МатериальныеЗатраты.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ КАК СтоимостьЗабалансоваяРегл,
	|	МатериальныеЗатраты.ПериодЗатрат КАК ПериодЗатрат
	|ПОМЕСТИТЬ МатериальныеЗатратыВключаяПолуфабрикаты
	|ИЗ
	|	МатериальныеЗатраты КАК МатериальныеЗатраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныМатериалов КАК ЦеныМатериалов
	|		ПО МатериальныеЗатраты.Калькуляция = ЦеныМатериалов.Калькуляция
	|			И МатериальныеЗатраты.Номенклатура = ЦеныМатериалов.Номенклатура
	|			И МатериальныеЗатраты.Характеристика = ЦеныМатериалов.Характеристика
	|			И (МатериальныеЗатраты.ЭтоПолуфабрикат)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МатериальныеЗатраты.ПартияСпецификация,
	|	МатериальныеЗатраты.Калькуляция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МножителиПартийИПолуфабрикатов.Период КАК Период,
	|	МножителиПартийИПолуфабрикатов.Продукция КАК Продукция,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	МножителиПартийИПолуфабрикатов.Калькуляция КАК Калькуляция,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	МножителиПартийИПолуфабрикатов.Назначение КАК Назначение,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Полуфабрикат КАК Полуфабрикат,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Порядок КАК Порядок,
	|	МножителиПартийИПолуфабрикатов.Числитель КАК Числитель,
	|	МножителиПартийИПолуфабрикатов.Знаменатель КАК Знаменатель,
	|	МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката КАК КоличествоПолуфабриката,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	МножителиПартийИПолуфабрикатов.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
	|	МножителиПартийИПолуфабрикатов.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения,
	|	МножителиПартийИПолуфабрикатов.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	МножителиПартийИПолуфабрикатов.РасчетЗавершен КАК РасчетЗавершен
	|ПОМЕСТИТЬ ВТПродукция
	|ИЗ
	|	РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
	|ГДЕ
	|	МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
	|	И МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МножителиПартийИПолуфабрикатов.Период КАК Период,
	|	МножителиПартийИПолуфабрикатов.Калькуляция КАК Калькуляция,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	МножителиПартийИПолуфабрикатов.Продукция КАК Продукция,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	МножителиПартийИПолуфабрикатов.Назначение КАК Назначение,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Полуфабрикат КАК Полуфабрикат,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Порядок КАК Порядок,
	|	МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката КАК КоличествоПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.РасчетЗавершен КАК РасчетЗавершен,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.Стоимость * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК Материальные,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.СтоимостьБезНДС * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК МатериальныеБезНДС,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.СтоимостьРегл * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК МатериальныеРегл,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.Трудозатраты * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК Трудозатраты,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ТрудозатратыРегл * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК ТрудозатратыРегл,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПостоянные * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК ПостатейныеПостоянные,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПостоянныеБезНДС * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК ПостатейныеПостоянныеБезНДС,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПостоянныеРегл * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК ПостатейныеПостоянныеРегл,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПеременные * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК ПостатейныеПеременные,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПеременныеБезНДС * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК ПостатейныеПеременныеБезНДС,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПеременныеРегл * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК ПостатейныеПеременныеРегл,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.СтоимостьЗабалансовая * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК МатериальныеЗабаланс,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.СтоимостьЗабалансоваяРегл * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель) КАК МатериальныеЗабалансРегл,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	МножителиПартийИПолуфабрикатов.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
	|	МножителиПартийИПолуфабрикатов.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения,
	|	МножителиПартийИПолуфабрикатов.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	МножителиПартийИПолуфабрикатов.Числитель КАК Числитель,
	|	МножителиПартийИПолуфабрикатов.Знаменатель КАК Знаменатель
	|ПОМЕСТИТЬ Затраты
	|ИЗ
	|	РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МатериальныеЗатратыВключаяПолуфабрикаты КАК МатериальныеЗатратыВключаяПолуфабрикаты
	|		ПО МножителиПартийИПолуфабрикатов.Калькуляция = МатериальныеЗатратыВключаяПолуфабрикаты.Калькуляция
	|			И МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката = МатериальныеЗатратыВключаяПолуфабрикаты.ПартияСпецификация
	|ГДЕ
	|	МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
	|	И НЕ МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МножителиПартийИПолуфабрикатов.Период,
	|	МножителиПартийИПолуфабрикатов.Калькуляция,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции,
	|	МножителиПартийИПолуфабрикатов.Продукция,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции,
	|	МножителиПартийИПолуфабрикатов.Назначение,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Полуфабрикат,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Порядок,
	|	МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.РасчетЗавершен,
	|	0,
	|	0,
	|	0,
	|	ПлановыеТрудозатраты.Стоимость * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель),
	|	ПлановыеТрудозатраты.СтоимостьРегл * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	МножителиПартийИПолуфабрикатов.бит_КомпенсирующийКоэффициент,
	|	МножителиПартийИПолуфабрикатов.бит_ПроцентВыполнения,
	|	МножителиПартийИПолуфабрикатов.бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	МножителиПартийИПолуфабрикатов.Числитель,
	|	МножителиПартийИПолуфабрикатов.Знаменатель
	|ИЗ
	|	РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
	|		ПО МножителиПартийИПолуфабрикатов.Калькуляция = ПлановыеТрудозатраты.Калькуляция
	|			И МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката = ПлановыеТрудозатраты.ПартияСпецификация
	|ГДЕ
	|	МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
	|	И НЕ МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МножителиПартийИПолуфабрикатов.Период,
	|	МножителиПартийИПолуфабрикатов.Калькуляция,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции,
	|	МножителиПартийИПолуфабрикатов.Продукция,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции,
	|	МножителиПартийИПолуфабрикатов.Назначение,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Полуфабрикат,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Порядок,
	|	МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.РасчетЗавершен,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|			ТОГДА 0
	|		ИНАЧЕ ПлановыеПрочиеЗатраты.Стоимость * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|			ТОГДА 0
	|		ИНАЧЕ ПлановыеПрочиеЗатраты.СтоимостьБезНДС * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|			ТОГДА 0
	|		ИНАЧЕ ПлановыеПрочиеЗатраты.СтоимостьРегл * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|			ТОГДА ПлановыеПрочиеЗатраты.Стоимость * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|			ТОГДА ПлановыеПрочиеЗатраты.СтоимостьБезНДС * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Переменные)
	|			ТОГДА ПлановыеПрочиеЗатраты.СтоимостьРегл * (МножителиПартийИПолуфабрикатов.Числитель / МножителиПартийИПолуфабрикатов.Знаменатель)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	МножителиПартийИПолуфабрикатов.бит_КомпенсирующийКоэффициент,
	|	МножителиПартийИПолуфабрикатов.бит_ПроцентВыполнения,
	|	МножителиПартийИПолуфабрикатов.бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	МножителиПартийИПолуфабрикатов.Числитель,
	|	МножителиПартийИПолуфабрикатов.Знаменатель
	|ИЗ
	|	РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПлановыеПрочиеЗатраты КАК ПлановыеПрочиеЗатраты
	|		ПО МножителиПартийИПолуфабрикатов.Калькуляция = ПлановыеПрочиеЗатраты.Калькуляция
	|			И МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката = ПлановыеПрочиеЗатраты.ПартияСпецификация
	|ГДЕ
	|	МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
	|	И НЕ МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТПродукция.Период,
	|	ВТПродукция.Калькуляция,
	|	ВТПродукция.ПартияСпецификацияПродукции,
	|	ВТПродукция.Продукция,
	|	ВТПродукция.ХарактеристикаПродукции,
	|	ВТПродукция.Назначение,
	|	ВТПродукция.ПартияСпецификацияПолуфабриката,
	|	ВТПродукция.Полуфабрикат,
	|	ВТПродукция.ХарактеристикаПолуфабриката,
	|	ВТПродукция.Порядок,
	|	ВТПродукция.КоличествоПолуфабриката,
	|	ВТПродукция.РасчетЗавершен,
	|	МатериальныеЗатратыВключаяПолуфабрикаты.Стоимость * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.СтоимостьБезНДС * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.СтоимостьРегл * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.Трудозатраты * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ТрудозатратыРегл * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПостоянные * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПостоянныеБезНДС * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПостоянныеРегл * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПеременные * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПеременныеБезНДС * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.ПостатейныеПеременныеРегл * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.СтоимостьЗабалансовая * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	МатериальныеЗатратыВключаяПолуфабрикаты.СтоимостьЗабалансоваяРегл * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	ВТПродукция.бит_КомпенсирующийКоэффициент,
	|	ВТПродукция.бит_ПроцентВыполнения,
	|	ВТПродукция.бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	ВТПродукция.Числитель,
	|	ВТПродукция.Знаменатель
	|ИЗ
	|	ВТПродукция КАК ВТПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МатериальныеЗатратыВключаяПолуфабрикаты КАК МатериальныеЗатратыВключаяПолуфабрикаты
	|		ПО ВТПродукция.Калькуляция = МатериальныеЗатратыВключаяПолуфабрикаты.Калькуляция
	|			И ВТПродукция.ПартияСпецификацияПродукции = МатериальныеЗатратыВключаяПолуфабрикаты.ПартияСпецификация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТПродукция.Период,
	|	ВТПродукция.Калькуляция,
	|	ВТПродукция.ПартияСпецификацияПродукции,
	|	ВТПродукция.Продукция,
	|	ВТПродукция.ХарактеристикаПродукции,
	|	ВТПродукция.Назначение,
	|	ВТПродукция.ПартияСпецификацияПолуфабриката,
	|	ВТПродукция.Полуфабрикат,
	|	ВТПродукция.ХарактеристикаПолуфабриката,
	|	ВТПродукция.Порядок,
	|	ВТПродукция.КоличествоПолуфабриката,
	|	ВТПродукция.РасчетЗавершен,
	|	0,
	|	0,
	|	0,
	|	ПлановыеТрудозатраты.Стоимость * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	ПлановыеТрудозатраты.СтоимостьРегл * (ВТПродукция.Числитель / ВТПродукция.Знаменатель),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	ВТПродукция.бит_КомпенсирующийКоэффициент,
	|	ВТПродукция.бит_ПроцентВыполнения,
	|	ВТПродукция.бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	ВТПродукция.Числитель,
	|	ВТПродукция.Знаменатель
	|ИЗ
	|	ВТПродукция КАК ВТПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
	|		ПО ВТПродукция.Калькуляция = ПлановыеТрудозатраты.Калькуляция
	|			И ВТПродукция.ПартияСпецификацияПродукции = ПлановыеТрудозатраты.ПартияСпецификация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТПродукция.Период,
	|	ВТПродукция.Калькуляция,
	|	ВТПродукция.ПартияСпецификацияПродукции,
	|	ВТПродукция.Продукция,
	|	ВТПродукция.ХарактеристикаПродукции,
	|	ВТПродукция.Назначение,
	|	ВТПродукция.ПартияСпецификацияПолуфабриката,
	|	ВТПродукция.Полуфабрикат,
	|	ВТПродукция.ХарактеристикаПолуфабриката,
	|	ВТПродукция.Порядок,
	|	ВТПродукция.КоличествоПолуфабриката,
	|	ВТПродукция.РасчетЗавершен,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ПлановыеПрочиеЗатраты.Стоимость * (ВТПродукция.Числитель / ВТПродукция.Знаменатель)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ПлановыеПрочиеЗатраты.СтоимостьБезНДС * (ВТПродукция.Числитель / ВТПродукция.Знаменатель)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА ПлановыеПрочиеЗатраты.СтоимостьРегл * (ВТПродукция.Числитель / ВТПродукция.Знаменатель)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА 0
	|		ИНАЧЕ ПлановыеПрочиеЗатраты.Стоимость * (ВТПродукция.Числитель / ВТПродукция.Знаменатель)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА 0
	|		ИНАЧЕ ПлановыеПрочиеЗатраты.СтоимостьРегл * (ВТПродукция.Числитель / ВТПродукция.Знаменатель)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
	|			ТОГДА 0
	|		ИНАЧЕ ПлановыеПрочиеЗатраты.СтоимостьРегл * (ВТПродукция.Числитель / ВТПродукция.Знаменатель)
	|	КОНЕЦ,
	|	0,
	|	0,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	ВТПродукция.бит_КомпенсирующийКоэффициент,
	|	ВТПродукция.бит_ПроцентВыполнения,
	|	ВТПродукция.бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	ВТПродукция.Числитель,
	|	ВТПродукция.Знаменатель
	|ИЗ
	|	ВТПродукция КАК ВТПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПлановыеПрочиеЗатраты КАК ПлановыеПрочиеЗатраты
	|		ПО ВТПродукция.Калькуляция = ПлановыеПрочиеЗатраты.Калькуляция
	|			И ВТПродукция.ПартияСпецификацияПродукции = ПлановыеПрочиеЗатраты.ПартияСпецификация
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Затраты.Продукция КАК Продукция,
	|	Затраты.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	Затраты.Калькуляция КАК Калькуляция,
	|	Затраты.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	Затраты.Назначение КАК Назначение,
	|	Затраты.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
	|	Затраты.Полуфабрикат КАК Полуфабрикат,
	|	Затраты.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	Затраты.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
	|	Затраты.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения,
	|	Затраты.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
  	|	Затраты.Порядок КАК Порядок
	|ПОМЕСТИТЬ СводныеМножители
	|ИЗ
	|	Затраты КАК Затраты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Затраты.Продукция,
	|	Затраты.ПартияСпецификацияПродукции,
	|	Затраты.Калькуляция,
	|	Затраты.ХарактеристикаПродукции,
	|	Затраты.Назначение,
	|	Затраты.ПартияСпецификацияПолуфабриката,
	|	Затраты.Полуфабрикат,
	|	Затраты.ХарактеристикаПолуфабриката,
	|	Затраты.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Затраты.Период КАК Период,
	|	Затраты.Продукция КАК Продукция,
	|	Затраты.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	Затраты.Калькуляция КАК Калькуляция,
	|	Затраты.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	Затраты.Назначение КАК Назначение,
	|	СУММА(Затраты.Трудозатраты) КАК Трудозатраты,
	|	СУММА(Затраты.ТрудозатратыРегл) КАК ТрудозатратыРегл,
	|	СУММА(Затраты.ПостатейныеПеременные) КАК ПостатейныеПеременные,
	|	СУММА(Затраты.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(Затраты.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРегл,
	|	СУММА(Затраты.ПостатейныеПостоянные) КАК ПостатейныеПостоянные,
	|	СУММА(Затраты.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(Затраты.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРегл,
	|	СУММА(Затраты.Материальные + Затраты.Трудозатраты + Затраты.ПостатейныеПеременные + Затраты.ПостатейныеПостоянные) КАК Стоимость,
	|	СУММА(Затраты.МатериальныеБезНДС + Затраты.Трудозатраты + Затраты.ПостатейныеПеременныеБезНДС + Затраты.ПостатейныеПостоянныеБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Затраты.МатериальныеРегл + Затраты.ТрудозатратыРегл + Затраты.ПостатейныеПеременныеРегл + Затраты.ПостатейныеПостоянныеРегл) КАК СтоимостьРегл,
	|	СУММА(Затраты.МатериальныеЗабаланс) КАК СтоимостьЗабалансовая,
	|	СУММА(Затраты.МатериальныеЗабалансРегл) КАК СтоимостьЗабалансоваяРегл,
	|	Затраты.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
	|	Затраты.Полуфабрикат КАК Полуфабрикат,
	|	Затраты.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	|	Затраты.Порядок КАК Порядок,
	|	Затраты.Числитель КАК Числитель,
	|	Затраты.Знаменатель КАК Знаменатель,
	|	Затраты.КоличествоПолуфабриката КАК КоличествоПолуфабриката,
	|	Затраты.РасчетЗавершен КАК РасчетЗавершен,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	Затраты.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
	|	Затраты.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения,
	|	Затраты.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
    // Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	ЛОЖЬ КАК ПартияВыпущена
	|ПОМЕСТИТЬ МножителиПартийИПолуфабрикатов
	|ИЗ
	|	Затраты КАК Затраты
	|
	|СГРУППИРОВАТЬ ПО
	|	Затраты.Период,
	|	Затраты.Продукция,
	|	Затраты.ПартияСпецификацияПродукции,
	|	Затраты.Калькуляция,
	|	Затраты.ХарактеристикаПродукции,
	|	Затраты.Назначение,
	|	Затраты.ПартияСпецификацияПолуфабриката,
	|	Затраты.Полуфабрикат,
	|	Затраты.ХарактеристикаПолуфабриката,
	|	Затраты.Порядок,
	|	Затраты.Знаменатель,
	|	Затраты.Числитель,
	|	Затраты.КоличествоПолуфабриката,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	Затраты.бит_КомпенсирующийКоэффициент,
	|	Затраты.бит_ПроцентВыполнения,
	|	Затраты.бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	Затраты.РасчетЗавершен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МножителиПартийИПолуфабрикатов.Период,
	|	МножителиПартийИПолуфабрикатов.Продукция,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции,
	|	МножителиПартийИПолуфабрикатов.Калькуляция,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции,
	|	МножителиПартийИПолуфабрикатов.Назначение,
	|	МножителиПартийИПолуфабрикатов.Трудозатраты,
	|	МножителиПартийИПолуфабрикатов.ТрудозатратыРегл,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПеременные,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПеременныеБезНДС,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПеременныеРегл,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПостоянные,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПостоянныеБезНДС,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПостоянныеРегл,
	|	МножителиПартийИПолуфабрикатов.Стоимость,
	|	МножителиПартийИПолуфабрикатов.СтоимостьБезНДС,
	|	МножителиПартийИПолуфабрикатов.СтоимостьРегл,
	|	МножителиПартийИПолуфабрикатов.СтоимостьЗабалансовая,
	|	МножителиПартийИПолуфабрикатов.СтоимостьЗабалансоваяРегл,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Полуфабрикат,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Порядок,
	|	МножителиПартийИПолуфабрикатов.Числитель,
	|	МножителиПартийИПолуфабрикатов.Знаменатель,
	|	МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.РасчетЗавершен,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	МножителиПартийИПолуфабрикатов.бит_КомпенсирующийКоэффициент,
	|	МножителиПартийИПолуфабрикатов.бит_ПроцентВыполнения,
	|	МножителиПартийИПолуфабрикатов.бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	МножителиПартийИПолуфабрикатов.ПартияВыпущена
	|ИЗ
	|	РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
	|ГДЕ
	|	МножителиПартийИПолуфабрикатов.ПартияВыпущена
	|	И МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МножителиПартийИПолуфабрикатов.Период,
	|	МножителиПартийИПолуфабрикатов.Продукция,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции,
	|	МножителиПартийИПолуфабрикатов.Калькуляция,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции,
	|	МножителиПартийИПолуфабрикатов.Назначение,
	|	МножителиПартийИПолуфабрикатов.Трудозатраты,
	|	МножителиПартийИПолуфабрикатов.ТрудозатратыРегл,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПеременные,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПеременныеБезНДС,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПеременныеРегл,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПостоянные,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПостоянныеБезНДС,
	|	МножителиПартийИПолуфабрикатов.ПостатейныеПостоянныеРегл,
	|	МножителиПартийИПолуфабрикатов.Стоимость,
	|	МножителиПартийИПолуфабрикатов.СтоимостьБезНДС,
	|	МножителиПартийИПолуфабрикатов.СтоимостьРегл,
	|	МножителиПартийИПолуфабрикатов.СтоимостьЗабалансовая,
	|	МножителиПартийИПолуфабрикатов.СтоимостьЗабалансоваяРегл,
	|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Полуфабрикат,
	|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.Порядок,
	|	МножителиПартийИПолуфабрикатов.Числитель,
	|	МножителиПартийИПолуфабрикатов.Знаменатель,
	|	МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката,
	|	МножителиПартийИПолуфабрикатов.РасчетЗавершен,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	МножителиПартийИПолуфабрикатов.бит_КомпенсирующийКоэффициент,
	|	МножителиПартийИПолуфабрикатов.бит_ПроцентВыполнения,
	|	МножителиПартийИПолуфабрикатов.бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	МножителиПартийИПолуфабрикатов.ПартияВыпущена
	|ИЗ
	|	РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
	|		ЛЕВОЕ СОЕДИНЕНИЕ СводныеМножители КАК СводныеМножители
	|		ПО СводныеМножители.Калькуляция = МножителиПартийИПолуфабрикатов.Калькуляция 
	|			И СводныеМножители.ПартияСпецификацияПродукции = МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции 
	|			И СводныеМножители.Продукция = МножителиПартийИПолуфабрикатов.Продукция 
	|			И СводныеМножители.ХарактеристикаПродукции = МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции 
	|			И СводныеМножители.Назначение = МножителиПартийИПолуфабрикатов.Назначение 
	|			И СводныеМножители.ПартияСпецификацияПолуфабриката = МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката 
	|			И СводныеМножители.Полуфабрикат = МножителиПартийИПолуфабрикатов.Полуфабрикат 
	|			И СводныеМножители.ХарактеристикаПолуфабриката = МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката 
	|			И СводныеМножители.Порядок = МножителиПартийИПолуфабрикатов.Порядок 
	|ГДЕ
	|	МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката = 0
	|	И МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
	|	И СводныеМножители.Калькуляция ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СводныеМножители
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЦеныМатериалов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Затраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПродукция";

	Запрос.УстановитьПараметр("Калькуляция", Калькуляция);

	Запрос.ВыполнитьПакет();

	Если УдалитьТаблицуПрочихЗатрат Тогда

		Запрос.Текст =
		"УНИЧТОЖИТЬ ПлановыеПрочиеЗатраты";

		УстановитьПривилегированныйРежим(Истина);
		Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("АктуальныеДвиженияОчереди")
Функция бит_АктуальныеДвиженияОчереди(Калькуляция, МенеджерВременныхТаблиц)

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПлановыеМатериальныеЗатраты.Период,
	|	ПлановыеМатериальныеЗатраты.Регистратор,
	|	ПлановыеМатериальныеЗатраты.НомерСтроки,
	|	ПлановыеМатериальныеЗатраты.Активность,
	|	ПлановыеМатериальныеЗатраты.Калькуляция,
	|	ПлановыеМатериальныеЗатраты.ПартияСпецификация,
	|	ПлановыеМатериальныеЗатраты.Подразделение,
	|	ПлановыеМатериальныеЗатраты.СтатьяКалькуляции,
	|	ПлановыеМатериальныеЗатраты.Номенклатура,
	|	ПлановыеМатериальныеЗатраты.Характеристика,
	|	ПлановыеМатериальныеЗатраты.ЭтоПолуфабрикат,
	|	ПлановыеМатериальныеЗатраты.ПериодЗатрат,
	|	ПлановыеМатериальныеЗатраты.Количество,
	#Вставка //ЛТ1.3.4.2
	|	ПлановыеМатериальныеЗатраты.бит_КоличествоПозиции,
	|	ПлановыеМатериальныеЗатраты.бит_КоэффициентУкрутки,
	#КонецВставки 
	|	ПлановыеМатериальныеЗатраты.Стоимость,
	|	ПлановыеМатериальныеЗатраты.СтоимостьБезНДС,
	|	ПлановыеМатериальныеЗатраты.СтоимостьРегл		
	|ИЗ
	|	РегистрНакопления.ПлановыеМатериальныеЗатраты КАК ПлановыеМатериальныеЗатраты
	|ГДЕ
	|	ПлановыеМатериальныеЗатраты.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеТрудозатраты.Период,
	|	ПлановыеТрудозатраты.Регистратор,
	|	ПлановыеТрудозатраты.НомерСтроки,
	|	ПлановыеТрудозатраты.Активность,
	|	ПлановыеТрудозатраты.Калькуляция,
	|	ПлановыеТрудозатраты.ПартияСпецификация,
	|	ПлановыеТрудозатраты.Подразделение,
	|	ПлановыеТрудозатраты.СтатьяКалькуляции,
	|	ПлановыеТрудозатраты.ВидРабот,
	|	ПлановыеТрудозатраты.ПериодЗатрат,
	|	ПлановыеТрудозатраты.Количество,
	|	ПлановыеТрудозатраты.Стоимость,
	|	ПлановыеТрудозатраты.СтоимостьРегл
	|ИЗ
	|	РегистрНакопления.ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
	|ГДЕ
	|	ПлановыеТрудозатраты.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеПрочиеЗатраты.Период,
	|	ПлановыеПрочиеЗатраты.Регистратор,
	|	ПлановыеПрочиеЗатраты.НомерСтроки,
	|	ПлановыеПрочиеЗатраты.Активность,
	|	ПлановыеПрочиеЗатраты.Калькуляция,
	|	ПлановыеПрочиеЗатраты.ПартияСпецификация,
	|	ПлановыеПрочиеЗатраты.Подразделение,
	|	ПлановыеПрочиеЗатраты.СтатьяКалькуляции,
	|	ПлановыеПрочиеЗатраты.СтатьяРасходов,
	|	ПлановыеПрочиеЗатраты.АналитикаРасходов,
	|	ПлановыеПрочиеЗатраты.Стоимость,
	|	ПлановыеПрочиеЗатраты.СтоимостьБезНДС,
	|	ПлановыеПрочиеЗатраты.СтоимостьРегл
	|ИЗ
	|	РегистрНакопления.ПлановыеПрочиеЗатраты КАК ПлановыеПрочиеЗатраты
	|ГДЕ
	|	ПлановыеПрочиеЗатраты.Регистратор = &Регистратор";

	Запрос = Новый Запрос(ТекстЗапроса);

	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("Регистратор", Калькуляция);

	МассивРезультатов = Запрос.ВыполнитьПакет();

	Результат = Новый Структура;

	Результат.Вставить("ПлановыеМатериальныеЗатраты", МассивРезультатов[0].Выгрузить());

	Результат.Вставить("ПлановыеТрудозатраты", МассивРезультатов[1].Выгрузить());

	Результат.Вставить("ПлановыеПрочиеЗатраты", МассивРезультатов[2].Выгрузить());

	Возврат Результат;

КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаОчередьРазузлованияПродукции")
Функция бит_ТекстЗапросаОчередьРазузлованияПродукции()
	
	Возврат
		"ВЫБРАТЬ
		|	ОчередьРасчета.Калькуляция КАК Калькуляция,
		|	ОчередьРасчета.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	ОчередьРасчета.Продукция КАК Продукция,
		|	ОчередьРасчета.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ОчередьРасчета.Назначение КАК Назначение,
		|	ОчередьРасчета.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
		|	ОчередьРасчета.Полуфабрикат КАК Полуфабрикат,
		|	ОчередьРасчета.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
		|	ОчередьРасчета.Разделитель КАК Разделитель,
		|	ОчередьРасчета.ДатаПотребности КАК Период,
		|	ОчередьРасчета.Порядок КАК Порядок,
		|	ЛОЖЬ КАК ПартияВыпущена,
		|	ЕСТЬNULL(МножителиПартийИПолуфабрикатов.РасчетЗавершен, ЛОЖЬ) КАК РасчетЗавершен, 
		|	ЕСТЬNULL(МножителиПартийИПолуфабрикатов.Калькуляция.ПодразделениеДиспетчер, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение, 
		// Если знаменатель совпадает, то необходимо проссумировать ресурсные колонки и числитель
		// при использовании РАЗЛИЧНЫЕ и совпадении числителя и знаменателя, останется только 1 числитель. 
		|	ЕСТЬNULL(МножителиПартийИПолуфабрикатов.Знаменатель, 0) КАК Знаменатель,	
		|	ВЫБОР
		|		КОГДА МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Приоритет,
		|   СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.Числитель, 0)) КАК Числитель,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката, 0)) КАК КоличествоПолуфабриката,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.Стоимость, 0)) КАК Стоимость,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.СтоимостьБезНДС, 0)) КАК СтоимостьБезНДС,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.СтоимостьРегл, 0)) КАК СтоимостьРегл,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.Трудозатраты, 0)) КАК Трудозатраты,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.ТрудозатратыРегл, 0)) КАК ТрудозатратыРегл,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.ПостатейныеПостоянные, 0)) КАК ПостатейныеПостоянные,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.ПостатейныеПостоянныеБезНДС, 0)) КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.ПостатейныеПостоянныеРегл, 0)) КАК ПостатейныеПостоянныеРегл,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.ПостатейныеПеременные, 0)) КАК ПостатейныеПеременные,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.ПостатейныеПеременныеБезНДС, 0)) КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.ПостатейныеПеременныеРегл, 0)) КАК ПостатейныеПеременныеРегл,
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.СтоимостьЗабалансовая, 0)) КАК СтоимостьЗабалансовая,
		#Вставка
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
		|	МАКСИМУМ(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.бит_АгрегирующийКоэффициент, 1)) КАК бит_АгрегирующийКоэффициент,
		|	МАКСИМУМ(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.бит_ПроцентВыполнения, 100)) КАК бит_ПроцентВыполнения,
		|	МАКСИМУМ(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.бит_КомпенсирующийКоэффициент, 1)) КАК бит_КомпенсирующийКоэффициент,
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
		#КонецВставки
		|	СУММА(ЕСТЬNULL(МножителиПартийИПолуфабрикатов.СтоимостьЗабалансоваяРегл, 0)) КАК СтоимостьЗабалансоваяРегл
		|ИЗ
		|	ОчередьРасчета КАК ОчередьРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
		// Отбор данных требующих расчета.
		// Условия соединения должны совпадать с условиями в первом запросе процедуры ЗаписатьМножители
		|		ПО ОчередьРасчета.Калькуляция = МножителиПартийИПолуфабрикатов.Калькуляция
		|			И ОчередьРасчета.ПартияСпецификацияПродукции = МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции
		|			И ОчередьРасчета.Продукция = МножителиПартийИПолуфабрикатов.Продукция
		|			И ОчередьРасчета.ХарактеристикаПродукции = МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции
		|			И ОчередьРасчета.Назначение = МножителиПартийИПолуфабрикатов.Назначение
		|			И ОчередьРасчета.ПартияСпецификацияПолуфабриката = МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката
		|			И ОчередьРасчета.Полуфабрикат = МножителиПартийИПолуфабрикатов.Полуфабрикат
		|			И ОчередьРасчета.ХарактеристикаПолуфабриката = МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката
		|			И (ОчередьРасчета.ДатаПотребности = НАЧАЛОПЕРИОДА(МножителиПартийИПолуфабрикатов.Период, ДЕНЬ))
		|			И ОчередьРасчета.Порядок = МножителиПартийИПолуфабрикатов.Порядок
		|
		|СГРУППИРОВАТЬ ПО
		|	ОчередьРасчета.Калькуляция,
		|	ОчередьРасчета.ПартияСпецификацияПродукции,
		|	ОчередьРасчета.Продукция,
		|	ОчередьРасчета.ХарактеристикаПродукции,
		|	ОчередьРасчета.Назначение,
		|	ОчередьРасчета.ПартияСпецификацияПолуфабриката,
		|	ОчередьРасчета.Полуфабрикат,
		|	ОчередьРасчета.ХарактеристикаПолуфабриката,
		|	ОчередьРасчета.Разделитель,
		|	ОчередьРасчета.ДатаПотребности,
		|	ОчередьРасчета.Порядок,
		|	ЛОЖЬ,
		|	ЕСТЬNULL(МножителиПартийИПолуфабрикатов.РасчетЗавершен, ЛОЖЬ), 
		|	ЕСТЬNULL(МножителиПартийИПолуфабрикатов.Калькуляция.ПодразделениеДиспетчер, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)), 
		|	ЕСТЬNULL(МножителиПартийИПолуфабрикатов.Знаменатель, 0),
		|	ВЫБОР
		|		КОГДА МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ	
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
КонецФункции

&ИзменениеИКонтроль("ЗаписатьМножители")
Процедура бит_ЗаписатьМножители(Калькуляция, ДополнительныеСвойства, ПараметрыРасчета, МенеджерВременныхТаблиц)
	
	Множители = Неопределено;
	
	Если Не ДополнительныеСвойства.Свойство("МножителиПартийИПолуфабрикатов", Множители)
		И Не ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("Таблица" + "МножителиПартийИПолуфабрикатов", Множители) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МножителиПартийИПолуфабрикатов.Период КАК Период,
		|	МножителиПартийИПолуфабрикатов.Калькуляция КАК Калькуляция,
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	МножителиПартийИПолуфабрикатов.Продукция КАК Продукция,
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	МножителиПартийИПолуфабрикатов.Назначение КАК Назначение,
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
		|	МножителиПартийИПолуфабрикатов.Полуфабрикат КАК Полуфабрикат,
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
		|	МножителиПартийИПолуфабрикатов.Порядок КАК Порядок,
		|	МножителиПартийИПолуфабрикатов.Числитель КАК Числитель,
		|	МножителиПартийИПолуфабрикатов.Знаменатель КАК Знаменатель,
		|	МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката КАК КоличествоПолуфабриката,
		|	МножителиПартийИПолуфабрикатов.Стоимость КАК Стоимость,
		|	МножителиПартийИПолуфабрикатов.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	МножителиПартийИПолуфабрикатов.СтоимостьРегл КАК СтоимостьРегл,
		|	МножителиПартийИПолуфабрикатов.Трудозатраты КАК Трудозатраты,
		|	МножителиПартийИПолуфабрикатов.ТрудозатратыРегл КАК ТрудозатратыРегл,
		|	МножителиПартийИПолуфабрикатов.ПостатейныеПостоянные КАК ПостатейныеПостоянные,
		|	МножителиПартийИПолуфабрикатов.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
		|	МножителиПартийИПолуфабрикатов.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
		|	МножителиПартийИПолуфабрикатов.ПостатейныеПеременные КАК ПостатейныеПеременные,
		|	МножителиПартийИПолуфабрикатов.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
		|	МножителиПартийИПолуфабрикатов.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
		|	МножителиПартийИПолуфабрикатов.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
		|	МножителиПартийИПолуфабрикатов.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
		#Вставка
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
		|	МножителиПартийИПолуфабрикатов.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
		|	МножителиПартийИПолуфабрикатов.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения,
		|	МножителиПартийИПолуфабрикатов.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
		#КонецВставки
        |	МножителиПартийИПолуфабрикатов.РасчетЗавершен КАК РасчетЗавершен,
		|	МножителиПартийИПолуфабрикатов.ПартияВыпущена КАК ПартияВыпущена
		|	ИЗ
		|		РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОчередьРасчета КАК ОчередьРасчета
		// Отбор ранее рассчитанных данных, для дозаполнения ТЗ Множители.
		// Условия соединения должны совпадать с запросом в функции ТекстЗапросаОчередьРазузлованияПродукции
		|		ПО ОчередьРасчета.Калькуляция = МножителиПартийИПолуфабрикатов.Калькуляция
		|			И ОчередьРасчета.ПартияСпецификацияПродукции = МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции
		|			И ОчередьРасчета.Продукция = МножителиПартийИПолуфабрикатов.Продукция
		|			И ОчередьРасчета.ХарактеристикаПродукции = МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции
		|			И ОчередьРасчета.Назначение = МножителиПартийИПолуфабрикатов.Назначение
		|			И ОчередьРасчета.ПартияСпецификацияПолуфабриката = МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката
		|			И ОчередьРасчета.Полуфабрикат = МножителиПартийИПолуфабрикатов.Полуфабрикат
		|			И ОчередьРасчета.ХарактеристикаПолуфабриката = МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката
		|			И (ОчередьРасчета.ДатаПотребности = НАЧАЛОПЕРИОДА(МножителиПартийИПолуфабрикатов.Период, ДЕНЬ))
		|			И ОчередьРасчета.Порядок = МножителиПартийИПолуфабрикатов.Порядок
		|	ГДЕ
		|		МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
		|		И МножителиПартийИПолуфабрикатов.РасчетЗавершен
		|		И ОчередьРасчета.Калькуляция ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Калькуляция", Калькуляция);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = Результат.Выбрать();
	
	Множители.Индексы.Очистить();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Множители.Добавить(), Выборка);
	КонецЦикла;
	
	СвернутьМножители(Множители);
	
	ПривестиМножителиКОбщемуЗнаменателю(Множители);
	
	НаборЗаписей = РегистрыСведений.МножителиПартийИПолуфабрикатов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Калькуляция.Установить(Калькуляция);
	
	#Удаление
	Множители.Свернуть("Период, Калькуляция, ПартияСпецификацияПродукции, Продукция, ХарактеристикаПродукции, Назначение, ПартияСпецификацияПолуфабриката, Полуфабрикат, ХарактеристикаПолуфабриката, Порядок, Знаменатель, РасчетЗавершен, ПартияВыпущена", 
	#КонецУдаления
	#Вставка
	Множители.Свернуть("Период, Калькуляция, ПартияСпецификацияПродукции, Продукция, ХарактеристикаПродукции, Назначение, ПартияСпецификацияПолуфабриката, Полуфабрикат, ХарактеристикаПолуфабриката, Порядок, Знаменатель, РасчетЗавершен, ПартияВыпущена, бит_КомпенсирующийКоэффициент, бит_ПроцентВыполнения, бит_АгрегирующийКоэффициент", 
	#КонецВставки
    "Числитель, КоличествоПолуфабриката, Стоимость, СтоимостьБезНДС, СтоимостьРегл, Трудозатраты, ТрудозатратыРегл, ПостатейныеПостоянные, ПостатейныеПостоянныеБезНДС, ПостатейныеПостоянныеРегл, ПостатейныеПеременные, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеРегл, СтоимостьЗабалансовая, СтоимостьЗабалансоваяРегл");
	НаборЗаписей.Загрузить(Множители);
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыРасчета.КоличествоДанных = ПараметрыРасчета.КоличествоДанных + Множители.Количество();
	
КонецПроцедуры

&ИзменениеИКонтроль("СвернутьМножители")
Процедура бит_СвернутьМножители(Множители)
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Множители", Множители);
	Запрос.Текст = "ВЫБРАТЬ
	|	Множители.Период КАК Период,
	|	Множители.Калькуляция КАК Калькуляция,
	|	Множители.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	Множители.Продукция КАК Продукция,
	|	Множители.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	Множители.Назначение КАК Назначение,
	|	Множители.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
	|	Множители.Полуфабрикат КАК Полуфабрикат,
	|	Множители.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	|	Множители.Порядок КАК Порядок,
	|	Множители.Знаменатель КАК Знаменатель,
	|	Множители.РасчетЗавершен КАК РасчетЗавершен,
	|	Множители.ПартияВыпущена КАК ПартияВыпущена,
	|	Множители.Числитель КАК Числитель,
	|	Множители.КоличествоПолуфабриката КАК КоличествоПолуфабриката,
	|	Множители.Стоимость КАК Стоимость,
	|	Множители.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Множители.СтоимостьРегл КАК СтоимостьРегл,
	|	Множители.Трудозатраты КАК Трудозатраты,
	|	Множители.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|	Множители.ПостатейныеПостоянные КАК ПостатейныеПостоянные,
	|	Множители.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	Множители.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|	Множители.ПостатейныеПеременные КАК ПостатейныеПеременные,
	|	Множители.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|	Множители.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|	Множители.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	Множители.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
	|	Множители.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения,
	|	Множители.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	Множители.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл
	|ПОМЕСТИТЬ Множители
	|ИЗ
	|	&Множители КАК Множители
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Калькуляция,
	|	ПартияСпецификацияПродукции,
	|	Продукция,
	|	ХарактеристикаПродукции,
	|	Назначение,
	|	ПартияСпецификацияПолуфабриката,
	|	Полуфабрикат,
	|	ХарактеристикаПолуфабриката,
	|	Порядок
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Множители.Период КАК Период,
	|	Множители.Калькуляция КАК Калькуляция,
	|	Множители.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
	|	Множители.Продукция КАК Продукция,
	|	Множители.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	Множители.Назначение КАК Назначение,
	|	Множители.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
	|	Множители.Полуфабрикат КАК Полуфабрикат,
	|	Множители.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
	|	Множители.Порядок КАК Порядок,
	|	Множители.ПартияВыпущена КАК ПартияВыпущена,  
	|	Множители.Знаменатель КАК Знаменатель,
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	|	МАКСИМУМ(Множители.бит_КомпенсирующийКоэффициент),
	|	МИНИМУМ(Множители.бит_ПроцентВыполнения),
	|	МАКСИМУМ(Множители.бит_АгрегирующийКоэффициент),
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	МАКСИМУМ(Множители.РасчетЗавершен) КАК РасчетЗавершен,
	|	СУММА(Множители.Числитель) КАК Числитель,
	|	СУММА(Множители.КоличествоПолуфабриката) КАК КоличествоПолуфабриката,
	|	СУММА(Множители.Стоимость) КАК Стоимость,
	|	СУММА(Множители.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Множители.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Множители.Трудозатраты) КАК Трудозатраты,
	|	СУММА(Множители.ТрудозатратыРегл) КАК ТрудозатратыРегл,
	|	СУММА(Множители.ПостатейныеПостоянные) КАК ПостатейныеПостоянные,
	|	СУММА(Множители.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(Множители.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРегл,
	|	СУММА(Множители.ПостатейныеПеременные) КАК ПостатейныеПеременные,
	|	СУММА(Множители.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(Множители.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРегл,
	|	СУММА(Множители.СтоимостьЗабалансовая) КАК СтоимостьЗабалансовая,
	|	СУММА(Множители.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРегл
	|	
	|ИЗ
	|	Множители КАК Множители
	|
	|СГРУППИРОВАТЬ ПО
	|	Множители.Период,
	|	Множители.Продукция,
	|	Множители.Калькуляция,
	|	Множители.ПартияВыпущена,
	|	Множители.ПартияСпецификацияПолуфабриката,
	|	Множители.Назначение,
	|	Множители.ХарактеристикаПродукции,
	|	Множители.Порядок,
	|	Множители.Полуфабрикат,
	|	Множители.ПартияСпецификацияПродукции,	
	|	Множители.ХарактеристикаПолуфабриката, 
	#Вставка
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
	//|	Множители.бит_КомпенсирующийКоэффициент,
	//|	Множители.бит_ПроцентВыполнения,
	//|	Множители.бит_АгрегирующийКоэффициент,
	// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
	#КонецВставки
	|	Множители.Знаменатель";
	
	Множители = Запрос.Выполнить().Выгрузить();
КонецПроцедуры

Функция бит_ПризнакРасчетаАгрегирующегоК(Номенклатура);

	СписокПризнаков = Справочники.бит_ЗначенияПоУмолчанию.ПризнакиДляРасчетаАгрегКоэффициента.Значения;
	ПризнакРасчетаАгрегирующегоК = Новый Массив;
	Для Каждого Признак Из СписокПризнаков Цикл
		ПризнакРасчетаАгрегирующегоК.Добавить(Признак.Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК бит_Значение
		|ИЗ
		|	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
		|ГДЕ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &Номенклатура
		|	И бит_ЗначенияПризнаковНоменклатуры.бит_Признак В(&СписокПризнаков)";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СписокПризнаков", ПризнакРасчетаАгрегирующегоК);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий(); 
		Возврат ВыборкаДетальныеЗаписи.бит_Значение; 
	КонецЕсли;
	
КонецФункции