////////////////////////////////////////////////////////////////////////////////
// Модуль содержит процедуры/функции механизма визирования.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщийИнтерфейсПодсистемыВизирования

// Возвращает общий модуль, содержащий функциональность присущую текущей конфигурации.
//
// Возвращаемое значение:
//	ОбщийМодуль
//
Функция МодульВизированияПереопределяемый() Экспорт
	
	Возврат бит_ОбщегоНазначенияПереопределяемый.МодульВизирования();
	
КонецФункции

#КонецОбласти

#Область ИнтерфейсРаботыСоСтатусами

// Определяет новый статус объекта. Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_СтатусыОбъектов - новый статус объекта.
//
Функция НовыйСтатусПоСтандартномуАлгоритму(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Если Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ПараметрыУстановкиСтатуса.ТекущийСтатус,
			Перечисления.бит_ТипыСтатусовОбъектов.Закрыт) Тогда
		Возврат ПараметрыУстановкиСтатуса.ТекущийСтатус;
	КонецЕсли;
	
	РежимЗаписи = ПараметрыУстановкиСтатуса.РежимЗаписи;
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат Справочники.бит_СтатусыОбъектов.Черновик;
	КонецЕсли;
	
	МетаданныеОбъекта    = ТекущийОбъект.Метаданные();
	ЭтоДокумент          = ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта);
	ВизированиеОтключено = МеханизмВизированияОтключен(ТекущийОбъект);
	
	ЕстьОтправкаНаСогласование         = Ложь;
	ИмяРеквизитаОтправкаНаСогласование = "";
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ОтправленНаСогласование", МетаданныеОбъекта) Тогда
		ЕстьОтправкаНаСогласование         = Истина;
		ИмяРеквизитаОтправкаНаСогласование = "ОтправленНаСогласование";
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("бит_ОтправленНаСогласование", МетаданныеОбъекта) Тогда
		ЕстьОтправкаНаСогласование         = Истина;
		ИмяРеквизитаОтправкаНаСогласование = "бит_ОтправленНаСогласование";
	КонецЕсли;
	
	Если ЕстьОтправкаНаСогласование И НЕ ВизированиеОтключено Тогда
		Если НЕ ТекущийОбъект[ИмяРеквизитаОтправкаНаСогласование] Тогда
			Возврат Справочники.бит_СтатусыОбъектов.Черновик;
		КонецЕсли;
	ИначеЕсли ЭтоДокумент Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Запись
			И НЕ ТекущийОбъект.Проведен Тогда
			Возврат Справочники.бит_СтатусыОбъектов.Черновик;
		КонецЕсли;
	КонецЕсли;
	
	Если ВизированиеОтключено Тогда
		Возврат Справочники.бит_СтатусыОбъектов.Рабочий;
	КонецЕсли;
	
	СсылкаНаОбъект = ТекущийОбъект.Ссылка;
	
	Если ЕстьБлокирующиеРешения(СсылкаНаОбъект) Тогда
		Возврат Справочники.бит_СтатусыОбъектов.Отклонен;
	ИначеЕсли ВсеВизыСогласованы(СсылкаНаОбъект) Тогда
		Возврат Справочники.бит_СтатусыОбъектов.Утвержден;
	КонецЕсли;
	
	Возврат Справочники.бит_СтатусыОбъектов.НаСогласовании;
	
КонецФункции

// Получает текущий статус объекта.
// 
// Параметры:
//  Ссылка - ДокументСсылка, СправочникСсылка.
// 
// Возвращаемое значение:
//   СправочникСсылка.бит_СтатусыОбъектов.
// 
Функция ТекущийСтатус(Ссылка) Экспорт

	ТекущийСтатус = Справочники.бит_СтатусыОбъектов.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат ТекущийСтатус;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыОбъектов.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.бит_СтатусыОбъектов КАК СтатусыОбъектов
	|ГДЕ
	|	СтатусыОбъектов.Объект = &Объект
	|	И СтатусыОбъектов.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус)";
	Запрос.УстановитьПараметр("Объект", Ссылка);			   

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекущийСтатус = Выборка.Статус;
	КонецЕсли;
	
	Возврат ТекущийСтатус;
	
КонецФункции

// Получает текущие статусы объектов.
// 
// Параметры:
//  Объекты - Массив.
//	ВидСтатуса - ПеречислениеСсылка.бит_ВидыСтатусовОбъектов.
// 
// Возвращаемое значение:
//   Соответствие:
//		* Ключ - ДокументСсылка, СправочникСсылка.
//		* Значение - СправочникСсылка.бит_СтатусыОбъектов.
// 
Функция ТекущиеСтатусы(Объекты, ВидСтатуса) Экспорт

	ТекущиеСтатусы = Новый Соответствие;
	Для каждого Объект Из Объекты Цикл
		ТекущиеСтатусы.Вставить(Объект, Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   СтатусыОбъектов.Объект КАК Объект,
	|	СтатусыОбъектов.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.бит_СтатусыОбъектов КАК СтатусыОбъектов
	|ГДЕ
	|	СтатусыОбъектов.Объект В (&Объекты)
	|	И СтатусыОбъектов.ВидСтатуса = &ВидСтатуса";
	Запрос.УстановитьПараметр("Объекты",    Объекты);
	Запрос.УстановитьПараметр("ВидСтатуса", ВидСтатуса);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекущиеСтатусы.Вставить(Выборка.Объект, Выборка.Статус);
	КонецЕсли;
	
	Возврат ТекущиеСтатусы;
	
КонецФункции

// Получает параметры статусов объекта.
// 
// Параметры:
//  Ссылка - ДокументСсылка, СправочникСсылка.
// 
// Возвращаемое значение:
//   Структура - параметры статусов объекта:
//		* Статус - СправочникСсылка.бит_СтатусыОбъектов - Статус объекта,
//		* ОплатаСтатус - СправочникСсылка.бит_СтатусыОбъектов - Статус оплаты объекта.
// 
Функция СтатусыОбъекта(Ссылка) Экспорт

	ПараметрыСтатуса = Новый Структура;
	ПараметрыСтатуса.Вставить("Статус",			  Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
	ПараметрыСтатуса.Вставить("СтатусПредыдущий", Справочники.бит_СтатусыОбъектов.ПустаяСсылка());	
	ПараметрыСтатуса.Вставить("Дата",			  Дата('00010101'));
	ПараметрыСтатуса.Вставить("ОплатаСтатус",	  Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат ПараметрыСтатуса;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыОбъектов.ВидСтатуса КАК ВидСтатуса,
	|	СтатусыОбъектов.Статус КАК Статус,
	|	СтатусыОбъектов.СтатусПредыдущий КАК СтатусПредыдущий,
	|	СтатусыОбъектов.Пользователь КАК Пользователь,
	|	СтатусыОбъектов.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса
	|ИЗ
	|	РегистрСведений.бит_СтатусыОбъектов КАК СтатусыОбъектов
	|ГДЕ
	|	СтатусыОбъектов.Объект = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);			   

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидСтатуса = Перечисления.бит_ВидыСтатусовОбъектов.Статус Тогда
			 ПараметрыСтатуса.Статус           = Выборка.Статус;
			 ПараметрыСтатуса.СтатусПредыдущий = Выборка.СтатусПредыдущий;
			 ПараметрыСтатуса.Дата             = Выборка.ДатаИзмененияСтатуса;
		ИначеЕсли Выборка.ВидСтатуса = Перечисления.бит_ВидыСтатусовОбъектов.СостояниеОплаты Тогда	
			ПараметрыСтатуса.ОплатаСтатус      = Выборка.Статус;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат ПараметрыСтатуса;
	
КонецФункции

// Возвращает текущий статус объекта и дату его изменения.
//
// Параметры:
//  Объект - ДокументОбъект.
//
// Возвращаемое значение:
//   Структура - параметры содержащие текущий статус и дату его изменения.
//
Функция ТекущиеПараметрыСтатуса(Объект) Экспорт
	
	ПараметрыСтатуса = Новый Структура;
	ПараметрыСтатуса.Вставить("ТекущийСтатус");
	ПараметрыСтатуса.Вставить("ДатаИзмененияСтатуса");
	
	ДополнительныеСвойства = Объект.ДополнительныеСвойства;
	
	Если ДополнительныеСвойства.Свойство("ТекущийСтатус")
		И ДополнительныеСвойства.Свойство("ДатаИзмененияСтатуса") Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыСтатуса, ДополнительныеСвойства);
	Иначе
		ПараметрыРегистраВиз = СтатусыОбъекта(Объект.Ссылка);
		ПараметрыСтатуса.ТекущийСтатус        = ПараметрыРегистраВиз.Статус;
		ПараметрыСтатуса.ДатаИзмененияСтатуса = ПараметрыРегистраВиз.Дата;
		ДополнительныеСвойства.Вставить("ТекущийСтатус",        ПараметрыСтатуса.ТекущийСтатус);
		ДополнительныеСвойства.Вставить("ДатаИзмененияСтатуса", ПараметрыСтатуса.ДатаИзмененияСтатуса);
	КонецЕсли;
	
	Возврат ПараметрыСтатуса;
	
КонецФункции

// Заполняет реквизиты формы, связанные со статусом.
//
// Параметры:
//  Форма           - ФормаКлиентскогоПриложения.
//  ТекущийОбъект   - СправочникОбъект, ДокументОбъект.
//
Процедура ЗаполнитьРеквизитыСтатусаВФорме(Форма, ТекущийОбъект) Экспорт
	
	Если ТекущийОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыСтатуса 				  = ПараметрыТекущегоСтатуса(ТекущийОбъект.Ссылка);
	ПараметрыСтатуса.ИнформацияСтатус = СформироватьИнформациюСтатус(ПараметрыСтатуса);
	
	ЗаполнитьЗначенияСвойств(Форма, ПараметрыСтатуса);
	
КонецПроцедуры

// Установка статуса объектов визирования.
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект, ДокументОбъект.
//	ПараметрыУстановкиСтатуса - Структура (необязательное) - состав полей см. НовыеПараметрыУстановкиСтатуса.
//  КэшОпераций - Структура (необязательное).
//
Процедура УстановитьСтатус(ТекущийОбъект, ПараметрыУстановкиСтатуса = Неопределено, КэшОпераций = Неопределено) Экспорт

	Если ПараметрыУстановкиСтатуса = Неопределено Тогда
		ПараметрыРегистраВиз      = СтатусыОбъекта(ТекущийОбъект.Ссылка);
		ПараметрыУстановкиСтатуса = НовыеПараметрыУстановкиСтатуса();
		ПараметрыУстановкиСтатуса.ТекущийСтатус        = ПараметрыРегистраВиз.Статус;
		ПараметрыУстановкиСтатуса.ДатаИзмененияСтатуса = ПараметрыРегистраВиз.Дата;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("РежимЗаписи") Тогда
			ПараметрыУстановкиСтатуса.РежимЗаписи = ТекущийОбъект.ДополнительныеСвойства.РежимЗаписи;
		Иначе
			МетаданныеОбъекта = ТекущийОбъект.Метаданные();
			Если НЕ ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда
				ПараметрыУстановкиСтатуса.РежимЗаписи = РежимЗаписиДокумента.Проведение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаблокированоИзменениеСтатуса(ТекущийОбъект.Ссылка, ПараметрыУстановкиСтатуса) Тогда
		Возврат;
	КонецЕсли;
	
	АлгоритмИзмененияСтатуса = бит_УправлениеПроцессами.АлгоритмУстановкиСтатусаОбъекта(ТекущийОбъект);
	
	СтатусДоИзменения = ПараметрыУстановкиСтатуса.ТекущийСтатус;
	
	Если ЗначениеЗаполнено(АлгоритмИзмененияСтатуса) Тогда
		
		// Выполнение установки статуса согласно алгоритму изменения статусов.
		КомментироватьВыполнение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("КомментироватьХодВыполненияАлгоритмовПроцессов",
									Пользователи.ТекущийПользователь());
			
        РежимСообщений = ?(КомментироватьВыполнение, "Все", "Ошибки");			
			
		СтруктураКонтекст = Новый Структура;
		СтруктураКонтекст.Вставить("ТекущийОбъект", ТекущийОбъект);
		ПараметрыОплаты   = ПараметрыУстановкиСтатуса.ПараметрыОплаты;
		Если ПараметрыОплаты <> Неопределено Тогда
			СтруктураКонтекст.Вставить("ОплатаЗаявки", ПараметрыОплаты);
		КонецЕсли;
		
		бит_УправлениеПроцессами.ВыполнитьАлгоритм(АлгоритмИзмененияСтатуса, СтруктураКонтекст, РежимСообщений);
		
		ПараметрыРегистраВиз      = СтатусыОбъекта(ТекущийОбъект.Ссылка);
		ПараметрыУстановкиСтатуса.ТекущийСтатус        = ПараметрыРегистраВиз.Статус;
		ПараметрыУстановкиСтатуса.ДатаИзмененияСтатуса = ПараметрыРегистраВиз.Дата;
		
	Иначе
		
		ИмяПолное 		= ТекущийОбъект.Метаданные().ПолноеИмя();
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяПолное);
		Если бит_ОбщегоНазначения.ОбъектБИТ(ТекущийОбъект) Тогда
			НовыйСтатус = МенеджерОбъекта.НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса);
		Иначе
			// Механизм статусов подключен к типовому или новому проектному объекту. В этом случае наименование экспортной
			// функции должно содержать приставку "бит_" - для минимизации потери кода при обновлених. Подробнее см. файл
			// документации "Механизм визирования и статусов" в составе поставки.
			НовыйСтатус = МенеджерОбъекта.бит_НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса);
		КонецЕсли;
		
		Если НовыйСтатус <> ПараметрыУстановкиСтатуса.ТекущийСтатус Тогда
			ПараметрыУстановкиСтатуса.ДатаИзмененияСтатуса = ТекущаяДатаСеанса();
			ПараметрыУстановкиСтатуса.Объект               = ТекущийОбъект.Ссылка;
			ПараметрыУстановкиСтатуса.Статус               = НовыйСтатус;
			ПараметрыУстановкиСтатуса.СтатусПредыдущий     = ПараметрыУстановкиСтатуса.ТекущийСтатус;
			
			ДействиеВыполнено = УстановитьСтатусОбъекта(ПараметрыУстановкиСтатуса);
			Если ДействиеВыполнено Тогда
				ПараметрыУстановкиСтатуса.ТекущийСтатус = НовыйСтатус;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СтатусДоИзменения <> ПараметрыУстановкиСтатуса.ТекущийСтатус Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ТекущийСтатус",        ПараметрыУстановкиСтатуса.ТекущийСтатус);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДатаИзмененияСтатуса", ПараметрыУстановкиСтатуса.ДатаИзмененияСтатуса);
		
		Если КэшОпераций = Неопределено Тогда
			КэшОпераций = НовыйКэшОперацийУстановкиСтатусов();
		КонецЕсли;
		ДействияПослеУстановкиСтатуса(ТекущийОбъект, ПараметрыУстановкиСтатуса, КэшОпераций);
	КонецЕсли;
	
КонецПроцедуры

// Функция выполняет установку статуса для объекта.
// 
// Параметры:
//  ПараметрыУстановкиСтатуса - Структура - см. НовыеПараметрыУстановкиСтатуса().
// 
// Возвращаемое значение:
//   Булево - Признак успешной установки статуса.
// 
Функция УстановитьСтатусОбъекта(ПараметрыУстановкиСтатуса) Экспорт
	
	ДействиеВыполнено = Ложь;
	Если НЕ ЗначениеЗаполнено(ПараметрыУстановкиСтатуса.Объект) Тогда
		Возврат ДействиеВыполнено;
	КонецЕсли;
	
	РежимСообщений = ПараметрыУстановкиСтатуса.РежимСообщений;
	ТекущийОбъект  = ПараметрыУстановкиСтатуса.Объект;
	Статус         = ПараметрыУстановкиСтатуса.Статус;
	
	ВыводитьОшибки     = ?(РежимСообщений="Все" ИЛИ РежимСообщений="Ошибки",Истина,Ложь);
	ВыводитьИнформацию = ?(РежимСообщений="Все",Истина,Ложь);
	
	МенеджерЗаписи = РегистрыСведений.бит_СтатусыОбъектов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыУстановкиСтатуса);
	
	Попытка
		МенеджерЗаписи.Записать();
		ДействиеВыполнено = Истина;
	Исключение
		Если ВыводитьОшибки Тогда
			ТекстСообщения = НСтр("ru='Не удалось установить статус ""%1"" для объекта ""%2"" %3';
								  |en='Failed to set the status ""%1"" for the object ""%2"" %3'") ;
			ТекстСообщения = СтрШаблон(ТекстСообщения, Статус, ТекущийОбъект, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ТекущийОбъект); 
		КонецЕсли; 
		ИмяСобытия = НСтр("ru = 'бит_Визирование';en='бит_Визирование'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ТекущийОбъект, 
								 ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ДействиеВыполнено = Ложь;
	КонецПопытки;
	
	Возврат ДействиеВыполнено;
	
КонецФункции

// Выполняет проведение/отмену проведения документа в зависимости от статуса документа. 
// Используется в режиме "ПроводитьПослеУтверждения".
// 
// Параметры:
//  ДокОбъект - ДокументОбъект.
//  МетаОбъект - ОбъектМетаданных.
//  ПроводитьПослеУтверждения - Булево.
//  РежимСообщений - Строка.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПровестиВСтатусеУтверждено(ДокОбъект, МетаОбъект, ПроводитьПослеУтверждения, РежимСообщений) Экспорт
	
	Выполнено = Ложь;
	Если ПроводитьПослеУтверждения 
		И бит_РаботаСМетаданными.ЕстьРеквизит("ОтправленНаСогласование", МетаОбъект)
		И ДокОбъект.ОтправленНаСогласование
		И Метаданные.Документы.Содержит(МетаОбъект) Тогда
		
		ПараметрыСтатуса = СтатусыОбъекта(ДокОбъект.Ссылка);
		
		ТекущийСтатус = ПараметрыСтатуса.Статус;
		
		Отклонен	 = Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ТекущийСтатус,
							Перечисления.бит_ТипыСтатусовОбъектов.Отклонен);
		Утвержден	 = Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ТекущийСтатус,
							Перечисления.бит_ТипыСтатусовОбъектов.Утвержден);
		БылУтвержден = Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ПараметрыСтатуса.СтатусПредыдущий,
							Перечисления.бит_ТипыСтатусовОбъектов.Утвержден);
		
		ОбновитьДвижения = Ложь;
		Если Утвержден Тогда
			ОбновитьДвижения = Истина;
		ИначеЕсли ДокОбъект.Проведен И (Отклонен ИЛИ БылУтвержден) Тогда
			ОбновитьДвижения = Истина;
		КонецЕсли;
		
		Если ОбновитьДвижения Тогда
			ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьОбновлениеВизПриПроведении", Истина);
			Выполнено = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокОбъект, РежимЗаписиДокумента.Проведение, "", РежимСообщений, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Выполнено;
	
КонецФункции

#КонецОбласти

#Область ИнтерфейсРаботыСВизами

// Функция получает список ответственных, которым доступна установка виз.
// 
// Параметры:
//  НаборВиз - ТаблицаЗначений - Таблица виз, для которой необходимо определить ответственных.
//  ОтборОтветственные - Массив, СписокЗначений, Неопределено - Фильтр по списку ответственных.
//
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица ответственных за установку виз.
//
Функция ОтветственныеЗаУстановкуВиз(НаборВиз, ОтборОтветственные = Неопределено) Экспорт
	
	ТаблицаДоступа = Новый ТаблицаЗначений;
	ТаблицаДоступа.Колонки.Добавить("ОбъектВизирования", Метаданные.ОпределяемыеТипы.бит_ОбъектыВизирования.Тип);
	ТаблицаДоступа.Колонки.Добавить("Виза",              Новый ОписаниеТипов("СправочникСсылка.бит_Визы"));
	ТаблицаДоступа.Колонки.Добавить("Ответственный",     Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Получение списка объектов и виз, по которым необходимо получить ответственных.
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаборВиз.Объект КАК Объект,
	|	НаборВиз.Виза КАК Виза,
	|	АВТОНОМЕРЗАПИСИ() КАК Порядок
	|ПОМЕСТИТЬ НаборВиз
	|ИЗ
	|	&НаборВиз КАК НаборВиз";
	Запрос.УстановитьПараметр("НаборВиз", НаборВиз);
	Запрос.Выполнить();
	
	// Формирование матрицы доступа пользователей к визам.
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пользователи.Ссылка КАК Ответственный
	|ПОМЕСТИТЬ ВсеПользователи
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГруппыПользователейПользователиГруппы.Пользователь КАК Ответственный,
	|	ГруппыПользователейПользователиГруппы.Ссылка КАК ПользовательГруппа
	|ПОМЕСТИТЬ ПользователиИГруппы
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейПользователиГруппы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеПользователи.Ответственный,
	|	ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	|ИЗ
	|	ВсеПользователи КАК ВсеПользователи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеПользователи.Ответственный,
	|	ВсеПользователи.Ответственный
	|ИЗ
	|	ВсеПользователи КАК ВсеПользователи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВсеПользователи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПользователиИГруппы.Ответственный КАК Ответственный,
	|	ПользователиИГруппы.ПользовательГруппа КАК ПользовательГруппа,
	|	бит_ПраваУстановкиВиз.Виза КАК ВизаГруппа,
	|	бит_ПраваУстановкиВиз.ПользовательскоеУсловие КАК ПользовательскоеУсловие
	|ПОМЕСТИТЬ ПраваДоступаПоГруппам
	|ИЗ
	|	ПользователиИГруппы КАК ПользователиИГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПраваУстановкиВиз КАК бит_ПраваУстановкиВиз
	|		ПО ПользователиИГруппы.ПользовательГруппа = бит_ПраваУстановкиВиз.Пользователь
	|			И (&ОтборОтветственные)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ПользователиИГруппы.Ответственный = Пользователи.Ссылка
	|			И (НЕ Пользователи.ПометкаУдаления)
	|			И (НЕ Пользователи.Недействителен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПользователиИГруппы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПраваДоступаПоГруппам.Ответственный КАК Ответственный,
	|	НаборВиз.Виза КАК Виза,
	|	ВЫБОР
	|		КОГДА ПраваДоступаПоГруппам.ПользовательскоеУсловие = ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеУсловия.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолныйДоступ,
	|	ПраваДоступаПоГруппам.ПользовательскоеУсловие КАК ПользовательскоеУсловие
	|ПОМЕСТИТЬ МатицаДоступаКВизам
	|ИЗ
	|	ПраваДоступаПоГруппам КАК ПраваДоступаПоГруппам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборВиз КАК НаборВиз
	|		ПО (ПраваДоступаПоГруппам.ВизаГруппа = НаборВиз.Виза
	|				ИЛИ ПраваДоступаПоГруппам.ВизаГруппа = ЗНАЧЕНИЕ(Справочник.бит_ГруппыВиз.ВсеВизы))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПраваДоступаПоГруппам.Ответственный,
	|	НаборВиз.Виза,
	|	ВЫБОР
	|		КОГДА ПраваДоступаПоГруппам.ПользовательскоеУсловие = ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеУсловия.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ПраваДоступаПоГруппам.ПользовательскоеУсловие
	|ИЗ
	|	ПраваДоступаПоГруппам КАК ПраваДоступаПоГруппам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ГруппыВиз.ВизыГруппы КАК бит_ГруппыВизВизыГруппы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборВиз КАК НаборВиз
	|			ПО бит_ГруппыВизВизыГруппы.Виза = НаборВиз.Виза
	|		ПО ПраваДоступаПоГруппам.ВизаГруппа = бит_ГруппыВизВизыГруппы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПраваДоступаПоГруппам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаборВиз.Объект КАК ОбъектВизирования,
	|	НаборВиз.Виза КАК Виза,
	|	ЕСТЬNULL(МатицаДоступаКВизам.Ответственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Ответственный,
	|	ЕСТЬNULL(МатицаДоступаКВизам.ПолныйДоступ, ИСТИНА) КАК ПолныйДоступ,
	|	МатицаДоступаКВизам.ПользовательскоеУсловие КАК УсловиеДоступа
	|ИЗ
	|	НаборВиз КАК НаборВиз
	|		ЛЕВОЕ СОЕДИНЕНИЕ МатицаДоступаКВизам КАК МатицаДоступаКВизам
	|		ПО НаборВиз.Виза = МатицаДоступаКВизам.Виза
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаборВиз.Порядок
	|ИТОГИ
	|	МАКСИМУМ(ПолныйДоступ)
	|ПО
	|	ОбъектВизирования,
	|	Виза,
	|	Ответственный";
	
	Если ОтборОтветственные = Неопределено Тогда
		ТекстОтбораОтвественых = "ИСТИНА";
	Иначе
		ТекстОтбораОтвественых = "ПользователиИГруппы.Ответственный В (&Ответственные)";
		Запрос.УстановитьПараметр("Ответственные", ОтборОтветственные); 
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ОтборОтветственные", ТекстОтбораОтвественых);
	
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъектов.Следующий() Цикл
		ВыборкаВиз = ВыборкаОбъектов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВиз.Следующий() Цикл
			ВыборкаОтветственных = ВыборкаВиз.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаОтветственных.Следующий() Цикл
				ВизаДоступна         = Ложь;
				Если ВыборкаОтветственных.ПолныйДоступ Тогда
					ВизаДоступна = Истина;
				Иначе
					ВыборкаУсловий = ВыборкаОтветственных.Выбрать();
					Пока ВыборкаУсловий.Следующий() Цикл
						ПараметрыУсловия = Новый Структура;
						ПараметрыУсловия.Вставить("ТекущийОбъект",       ВыборкаУсловий.ОбъектВизирования);
						ПараметрыУсловия.Вставить("ТекущийПользователь", ВыборкаУсловий.Ответственный);
						УсловиеВыполнено = бит_УправлениеПроцессами.ПроверитьПользовательскоеУсловие(ВыборкаУсловий.УсловиеДоступа,
												ПараметрыУсловия,,,"Ошибки");
						Если УсловиеВыполнено Тогда
							ВизаДоступна = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если ВизаДоступна Тогда
					СтрокаДоступа = ТаблицаДоступа.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДоступа, ВыборкаОтветственных);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаДоступа;
	
КонецФункции

// Функция получает список возможных решений при визировании.
//
// Параметры:
//  СтруктураПараметров - Структура - см. НовыеПараметрыОпределенияСпискаРешений()
//
// Возвращаемое значение:
//   СписокЗначений - Список доступных решений.
// 
Функция ДоступныеРешения(СтруктураПараметров) Экспорт

	СписокРешений = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Если СтруктураПараметров.Свойство("Организация") Тогда
		Запрос.УстановитьПараметр("Организация",СтруктураПараметров.Организация);
	Иначе	
		Запрос.УстановитьПараметр("Организация",Справочники.Организации.ПустаяСсылка());
	КонецЕсли; 
	Если СтруктураПараметров.Свойство("ОбъектСистемы") Тогда
		Запрос.УстановитьПараметр("ОбъектСистемы",СтруктураПараметров.ОбъектСистемы);
	Иначе	
		Запрос.УстановитьПараметр("ОбъектСистемы",Справочники.бит_ОбъектыСистемы.ПустаяСсылка());
	КонецЕсли; 
	
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	НазначениеВидовРешений.ВидРешения КАК ВидРешения,
	|	МАКСИМУМ(НазначениеВидовРешений.КодСортировки) КАК КодСортировки,
	|	НазначениеВидовРешений.ВидРешения.Представление КАК ВидРешенияПредставление,
	|	НазначениеВидовРешений.ПользовательскоеУсловие КАК ПользовательскоеУсловие,
	|	НЕ НазначениеВидовРешений.ПользовательскоеУсловие = ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеУсловия.ПустаяСсылка) КАК ОграничениеИспользования
	|ИЗ
	|	РегистрСведений.бит_НазначениеВидовРешенийСогласования КАК НазначениеВидовРешений
	|ГДЕ
	|	(НазначениеВидовРешений.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ИЛИ НазначениеВидовРешений.Организация = &Организация)
	|	И (НазначениеВидовРешений.ОбъектСистемы = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПустаяСсылка)
	|			ИЛИ НазначениеВидовРешений.ОбъектСистемы = &ОбъектСистемы)
	|	И НЕ НазначениеВидовРешений.ВидРешения.Отключено
	|	И НЕ НазначениеВидовРешений.ВидРешения.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	НазначениеВидовРешений.ВидРешения,
	|	НазначениеВидовРешений.ВидРешения.Представление,
	|	НазначениеВидовРешений.ПользовательскоеУсловие
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСортировки,
	|	ОграничениеИспользования
	|ИТОГИ ПО
	|	ВидРешения";
	
	ПараметрыУсловия = Новый Структура;
	ПараметрыУсловия.Вставить("ТекущийПользователь", Пользователи.ТекущийПользователь());
	ПараметрыУсловия.Вставить("ТекущийОбъект",       СтруктураПараметров.ТекущийОбъект);
	
	
	ВыборкаРешений = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРешений.Следующий() Цикл
		Выборка = ВыборкаРешений.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ОграничениеИспользования
				И (СтруктураПараметров.ТекущийОбъект = Неопределено
					ИЛИ НЕ бит_УправлениеПроцессами.ПроверитьПользовательскоеУсловие(Выборка.ПользовательскоеУсловие, ПараметрыУсловия)) Тогда
				Продолжить;
			КонецЕсли;
			
			СписокРешений.Добавить(Выборка.ВидРешения, Выборка.ВидРешенияПредставление);
			Прервать;
		КонецЦикла;
	КонецЦикла;

	Возврат СписокРешений;
	
КонецФункции

// Функция возвращает структуру параметров определения доступного списка решений по визе.
// 
// Возвращаемое значение:
//   Структура.
//
Функция НовыеПараметрыОпределенияСпискаРешений() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОбъектСистемы", Справочники.бит_ОбъектыСистемы.ПустаяСсылка()); 
	СтруктураПараметров.Вставить("Организация",   Справочники.Организации.ПустаяСсылка());
	СтруктураПараметров.Вставить("ТекущийОбъект", Неопределено);
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Получает список объектов системы, на которые распространяется механизм визирования.
// 
// Возвращаемое значение:
//  СписокЗначений
// 
Функция ВизируемыеОбъектыСистемы() Экспорт

	ВизируемыеОбъекты = Новый СписокЗначений;
	МассивТипов = Метаданные.ОпределяемыеТипы.бит_ОбъектыВизирования.Тип.Типы();
	Для каждого ТекущийТип Из МассивТипов Цикл
		МетаОбъект = Метаданные.НайтиПоТипу(ТекущийТип);
		Если МетаОбъект <> Неопределено Тогда
			ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
			Если ЗначениеЗаполнено(ОбъектСистемы) Тогда			
				ВизируемыеОбъекты.Добавить(ОбъектСистемы);
				
				Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
					ПолноеИмяМетаданных = МетаОбъект.ПолноеИмя();
					ИмяВедомогоОбъекта  = "";
					Если ПолноеИмяМетаданных = "Документ.бит_кзн_ЗаявкаНаРасходованиеСредств" Тогда
						ИмяВедомогоОбъекта = "Документ.бит_кзн_ПлатежнаяПозиция";
					ИначеЕсли ПолноеИмяМетаданных = "Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств" Тогда
						ИмяВедомогоОбъекта = "Документ.бит_кзн_ПозицияПоступления";
					КонецЕсли;
					
					Если Не ПустаяСтрока(ИмяВедомогоОбъекта) Тогда
						ВедомыйОбъект = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(ИмяВедомогоОбъекта);
						Если ВедомыйОбъект <> Неопределено Тогда
							ВизируемыеОбъекты.Добавить(ВедомыйОбъект);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ВизируемыеОбъекты;
	
КонецФункции

// Проверяет признак отключенного механизма визирования для объекта.
// 
// Параметры:
//  Объект - ДокументОбъект; СправочникОбъект; ДокументСсылка; СправочникСсылка.
// 
// Возвращаемое значение:
//   Булево - Истина если механизм визирования не используется.
// 
Функция МеханизмВизированияОтключен(Объект) Экспорт
	
	ПолноеИмяМетаданных = Объект.Метаданные().ПолноеИмя();
	
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		Если ПолноеИмяМетаданных = "Документ.бит_кзн_ПлатежнаяПозиция" Тогда
			ПолноеИмяМетаданных = "Документ.бит_кзн_ЗаявкаНаРасходованиеСредств";
		ИначеЕсли ПолноеИмяМетаданных = "Документ.бит_кзн_ПозицияПоступления" Тогда
			ПолноеИмяМетаданных = "Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств";
		КонецЕсли;
	КонецЕсли;
	
	Возврат бит_ОбщегоНазначенияПовтИсп.МеханизмВизированияОтключен(ПолноеИмяМетаданных);
	
КонецФункции

// Возвращает настройки для объекта визирования из регистра сведений бит_НастройкиОбъектовВизирования.
// 
// Параметры:
//  Объект - Строка, ДокументОбъект, СправочникОбъект, ДокументСсылка, СправочникСсылка.
// 
// Возвращаемое значение:
//   Структура
//		* ИспользоватьВизирование - Булево, 
//		* РежимОбновленияВиз      - ПеречислениеСсылка.бит_РежимыОбновленияПеречняВиз.
//
Функция НастройкиОбъектаВизирования(Объект) Экспорт
	
	ПолноеИмяМетаданных = "";
	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		ПолноеИмяМетаданных = Объект;
	Иначе
		ПолноеИмяМетаданных = Объект.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	Если ПолноеИмяМетаданных = "Документ.бит_кзн_ПлатежнаяПозиция"
		Или ПолноеИмяМетаданных = "Документ.бит_кзн_ПозицияПоступления" Тогда
		ПолноеИмяМетаданных = "Документ.бит_кзн_ЗаявкаНаРасходованиеСредств";
	КонецЕсли;
	
	Возврат бит_ОбщегоНазначенияПовтИсп.НастройкиОбъектаВизирования(ПолноеИмяМетаданных);
	
КонецФункции

// Создает и назначает визы объектам визирования.
// 
// Параметры:
//  НазначатьВизы - Булево, по умолчанию Истина.
//  ВыполнятьВТранзакции - Булево.
//  ВыводитьСообщения    - Булево.
// 
Процедура СоздатьИНазначитьВизыПоУмолчанию(НазначатьВизы = Истина, ВыполнятьВТранзакции = Ложь, ВыводитьСообщения = Ложь) Экспорт
	
	Если ВыполнятьВТранзакции Тогда
		НачатьТранзакцию();
		Попытка
			СоздатьИНазначитьВизыПоУмолчаниюСлужебный(НазначатьВизы, ВыводитьСообщения);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	Иначе
		СоздатьИНазначитьВизыПоУмолчаниюСлужебный(НазначатьВизы, ВыводитьСообщения);
	КонецЕсли; 
	
КонецПроцедуры

// Очищает все визы в таб. части Визы независимо от наличия доступа у пользователя.
// 
// Параметры:
//  ТекущийОбъект  - ДокументСсылка.
// 
Процедура ОчиститьВсеВизыБезусловно(ТекущийОбъект) Экспорт

	Отбор = Новый Структура;
	Отбор.Вставить("Объект",ТекущийОбъект);
	
	НаборВизы = ПрочитатьНаборВиз(Отбор);
	НаборВизы.Очистить();
	
	бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборВизы);

КонецПроцедуры

// Возвращает список виз, доступных для установки данному  пользователю, либо группе пользователей.
// 
// Параметры:
//  ТекущийПользователь - СправочникСсылка.Пользователи,СправочникСсылка.ГруппыПользователей 
// 						- Пользователь для которого получаем список виз.
//  ТекущийОбъект       - ДокументОбъект, ДокументСсылка - объект.
// 
// Возвращаемое значение:
//	СписокЗначений - Список виз пользователя.
// 
Функция ВизыПользователя(ТекущийПользователь, ТекущийОбъект) Экспорт

	СписокВиз      = Новый СписокЗначений;
	РежимСообщений = "Нет";
	
	ИмяТабЧасти = бит_ОбщегоНазначения.ИмяТабЧастиГруппыПользователей();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА бит_ПраваУстановкиВиз.Виза ССЫЛКА Справочник.бит_ГруппыВиз
	|			ТОГДА ВЫБОР
	|					КОГДА бит_ПраваУстановкиВиз.Виза = ЗНАЧЕНИЕ(Справочник.бит_ГруппыВиз.ВсеВизы)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.бит_ГруппыВиз.ВсеВизы)
	|					ИНАЧЕ ЕСТЬNULL(бит_ГруппыВизВизыГруппы.Виза, ЗНАЧЕНИЕ(Справочник.бит_Визы.ПустаяСсылка))
	|				КОНЕЦ
	|		ИНАЧЕ бит_ПраваУстановкиВиз.Виза
	|	КОНЕЦ КАК Виза,
	|	бит_ПраваУстановкиВиз.ПользовательскоеУсловие
	|ИЗ
	|	РегистрСведений.бит_ПраваУстановкиВиз КАК бит_ПраваУстановкиВиз
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ГруппыВиз.ВизыГруппы КАК бит_ГруппыВизВизыГруппы
	|		ПО бит_ПраваУстановкиВиз.Виза = бит_ГруппыВизВизыГруппы.Ссылка
	|ГДЕ
	|	(бит_ПраваУстановкиВиз.Пользователь В
	|				(ВЫБРАТЬ
	|					ГруппыПользователейПользователиГруппы.Ссылка
	|				ИЗ
	|					Справочник.ГруппыПользователей.%ИмяТабЧасти% КАК ГруппыПользователейПользователиГруппы
	|				ГДЕ
	|					ГруппыПользователейПользователиГруппы.Пользователь = &ТекущийПользователь)
	|			ИЛИ бит_ПраваУстановкиВиз.Пользователь = &ТекущийПользователь
	|			ИЛИ бит_ПраваУстановкиВиз.Пользователь = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи))";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяТабЧасти%", ИмяТабЧасти);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ПользовательскоеУсловие) И НЕ ТекущийОбъект = Неопределено Тогда
			ПараметрыУсловия = Новый Структура;
			ПараметрыУсловия.Вставить("ТекущийОбъект",       ТекущийОбъект);
			ПараметрыУсловия.Вставить("ТекущийПользователь", ТекущийПользователь);
			ВизаДоступна = бит_УправлениеПроцессами.ПроверитьПользовательскоеУсловие(Выборка.ПользовательскоеУсловие
					                                                     ,ПараметрыУсловия
																		 ,
																		 ,
																		 ,РежимСообщений);
		Иначе	
			ВизаДоступна = Истина;
		КонецЕсли; 
		
		Если ВизаДоступна Тогда
			СписокВиз.Добавить(Выборка.Виза);	
		КонецЕсли; 
	КонецЦикла; 
			   
   Возврат СписокВиз;

КонецФункции

// Устанавливает крайние даты визирования.
// 
// Параметры:
//  ТекущийОбъект - ДокументСсылка.
//  НаборВизы     - РегистрСведенийНаборЗаписей.бит_УстановленныеВизы (По умолчанию = Неопределено).
//  Записывать 	  - Булево (По умолчанию = Истина).
// 
Процедура УстановитьКрайниеДатыВизирования(ТекущийОбъект, НаборВизы = Неопределено, Записывать = Истина) Экспорт

	Если НаборВизы = Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Объект", ТекущийОбъект.Ссылка);
		НаборВизы = ПрочитатьНаборВиз(Отбор);
	КонецЕсли; 
	
	ТаблицаВизы = НаборВизы.Выгрузить();
	
	ТаблицаВизы.Колонки.Добавить("ДоступностьВизы", Новый ОписаниеТипов("Булево"));
	ТаблицаВизы.ЗаполнитьЗначения(Истина, "ДоступностьВизы");
	
	Алгоритм = Справочники.бит_АлгоритмыПроцессов.ПустаяСсылка();
	
	Для Каждого СтрокаВизы Из ТаблицаВизы Цикл
		Если ЗначениеЗаполнено(СтрокаВизы.Алгоритм) Тогда
			Алгоритм = СтрокаВизы.Алгоритм;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	ТаблицаТочкиВизы = бит_УправлениеПроцессами.ОписаниеТочекАлгоритма(Алгоритм, ТаблицаВизы);
	
	// Определяем, какие точки алгоритма доступны.
	ДопПараметрыПроверкиУсловий = НовыеПараметрыПроверкиУсловия();
	ДопПараметрыПроверкиУсловий.ТекущийОбъект = ТекущийОбъект;
	ДопПараметрыПроверкиУсловий.Визы          = ТаблицаВизы;
	ДопПараметрыПроверкиУсловий.Алгоритм      = Алгоритм;
			
	ВыполнятьПоэтапно = бит_УправлениеПроцессами.ВыполнятьАлгоритмПоэтапно(Алгоритм);
	бит_УправлениеПроцессами.ОпределитьДоступностьТочек(ТаблицаТочкиВизы, ВыполнятьПоэтапно, ДопПараметрыПроверкиУсловий);

	ЕстьИзменения = Ложь;
	// Устанавливаем крайние даты и признак активности.
	Для каждого Запись Из НаборВизы Цикл
		СтрокаТаблицы = ТаблицаТочкиВизы.Найти(Запись.ИД,"ИД");
		Если СтрокаТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Запись.ВремяНаУстановку > 0 Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Решение) И НЕ СтрокаТаблицы.Доступность Тогда
				Запись.ДатаКрайняя = Дата("00010101");
				ЕстьИзменения    = Истина;
			ИначеЕсли СтрокаТаблицы.Доступность И НЕ ЗначениеЗаполнено(Запись.ДатаКрайняя) Тогда
				ПараметрыРасчетаСрока = НовыеПараметрыРасчетаСрокаИсполнения();
				ПараметрыРасчетаСрока.ОбъектРасчета    = ТекущийОбъект;
				ПараметрыРасчетаСрока.ДатаОтсчета      = ТекущаяДатаСеанса();
				ПараметрыРасчетаСрока.ВремяНаУстановку = Запись.ВремяНаУстановку;
				Запись.ДатаКрайняя = СрокИсполнения(ПараметрыРасчетаСрока);
				
				ЕстьИзменения    = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Запись.АктивнаяВиза <> СтрокаТаблицы.АктивнаяВиза Тогда
			Запись.АктивнаяВиза = СтрокаТаблицы.АктивнаяВиза;
			ЕстьИзменения     = Истина;
		КонецЕсли;
	КонецЦикла; // По набору виз.
	
	Если УпорядочитьВизыБезАнализаАлгоритма(НаборВизы) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;

	Если ЕстьИзменения И Записывать Тогда
		бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборВизы);
	КонецЕсли; 	
	
КонецПроцедуры

// Проверяет принято ли по всем утверждающим визам решение "Согласовано".
// 
// Параметры:
//  СсылкаНаОбъект  - СправочникСсылка,ДокументСсылка.
// 
// Возвращаемое значение:
//   ВсеВизыСогласованы - Булево.
// 
Функция ВсеВизыСогласованы(СсылкаНаОбъект) Экспорт
	
	Если МеханизмВизированияОтключен(СсылкаНаОбъект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УстановленныеВизы.Решение КАК Решение
	|ПОМЕСТИТЬ РешенияПоОбъекту
	|ИЗ
	|	РегистрСведений.бит_УстановленныеВизы КАК УстановленныеВизы
	|ГДЕ
	|	УстановленныеВизы.Объект = &Объект
	|	И УстановленныеВизы.Виза.Вид = ЗНАЧЕНИЕ(Перечисление.бит_ВидыВиз.Утверждающая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(РешенияПоОбъекту.Решение.ТипРешения, ЗНАЧЕНИЕ(Перечисление.бит_ТипыРешений.ПустаяСсылка))) КАК КоличествоВидовРешений,
	|	СУММА(ВЫБОР
	|			КОГДА РешенияПоОбъекту.Решение.ТипРешения = ЗНАЧЕНИЕ(Перечисление.бит_ТипыРешений.Согласующее)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоСогласовано
	|ИЗ
	|	РешенияПоОбъекту КАК РешенияПоОбъекту";
	Запрос.УстановитьПараметр("Объект",  СсылкаНаОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если Выборка.КоличествоВидовРешений <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (Выборка.КоличествоСогласовано > 0);
	
КонецФункции

// Определяет есть ли отклоняющие решения по указанному объекту.
// 
// Параметры:
//  СсылкаНаОбъект  - СправочникСсылка,ДокументСсылка.
// 
// Возвращаемое значение:
//   ЕстьБлокирующиеРешения - Булево.
// 
Функция ЕстьБлокирующиеРешения(СсылкаНаОбъект) Экспорт
	
	Если МеханизмВизированияОтключен(СсылкаНаОбъект) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УстановленныеВизы.Решение КАК Решение
	|ИЗ
	|	РегистрСведений.бит_УстановленныеВизы КАК УстановленныеВизы
	|ГДЕ
	|	УстановленныеВизы.Объект = &Объект
	|	И УстановленныеВизы.Решение.ТипРешения = ЗНАЧЕНИЕ(Перечисление.бит_ТипыРешений.Отклоняющее)";
	Запрос.УстановитьПараметр("Объект",  СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// Читает набор записей регистра сведений бит_УстановленныеВизы согласно отбору.
// 
// Параметры:
//  СтруктураОтбор  - Структура.
// 
// Возвращаемое значение:
//   РегистрСведенийНаборЗаписей.бит_УстановленныеВизы.
// 
Функция ПрочитатьНаборВиз(СтруктураОтбор) Экспорт
	
	Если СтруктураОтбор.Свойство("Объект") Тогда
		
		ИмяПолное 		= СтруктураОтбор.Объект.Метаданные().ПолноеИмя();
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяПолное);
		ПустаяСсылка 	= МенеджерОбъекта.ПустаяСсылка();

		Если Метаданные.РегистрыСведений.бит_УстановленныеВизы.Измерения.Объект.Тип.СодержитТип(ТипЗнч(ПустаяСсылка)) Тогда
		     НаборЗаписей = бит_ОбщегоНазначения.ПрочитатьНаборЗаписейРегистраСведений(СтруктураОтбор,"бит_УстановленныеВизы");
		Иначе	
			ВызватьИсключение НСтр("ru='Установленные визы: неизвестный тип объекта.';en='Established Visas: unknown object type.'");			
		КонецЕсли;	
	Иначе
		НаборЗаписей = бит_ОбщегоНазначения.ПрочитатьНаборЗаписейРегистраСведений(СтруктураОтбор,"бит_УстановленныеВизы");
	КонецЕсли; 
	
	Возврат НаборЗаписей;
	
КонецФункции

// Выполняет обновление набора виз для объекта.
// 
// Параметры:
//  ТекущийОбъект  - ДокументСсылка.
//  ДатаЗаполнения - Дата.
//  СтруктураПараметров - Структура.
// 
Процедура ОбновитьПереченьВиз(ТекущийОбъект, ДатаЗаполнения, СтруктураПараметров)  Экспорт

	Если НЕ СтруктураПараметров.Свойство("Алгоритм") Тогда
		Алгоритм = бит_УправлениеПроцессами.АлгоритмВизированияОбъекта(ТекущийОбъект);
	Иначе
		Алгоритм = СтруктураПараметров.Алгоритм;
	КонецЕсли; 												
	
	// Заполнение виз по алгоритму.												
	СтруктураПараметровАлгоритм = Новый Структура;
	СтруктураПараметров.Вставить("ТекущийОбъект"  ,ТекущийОбъект);
	СтруктураПараметров.Вставить("Алгоритм"       ,Алгоритм);
	СтруктураПараметров.Вставить("ОчищатьНабор"   ,Истина);
	СтруктураПараметров.Вставить("ЗаписыватьНабор",Истина);
	
	ЗаполнитьВизыПоАлгоритму(СтруктураПараметров);

КонецПроцедуры

// Конструктор параметров проверки условий выполнения алгоритма.
// 
// Возвращаемое значение:
//  Параметры - Структура.
//
Функция НовыеПараметрыРасчетаСрокаИсполнения() Экспорт
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ОбъектРасчета",    Неопределено);
	ПараметрыРасчета.Вставить("ДатаОтсчета",      '00010101');
	ПараметрыРасчета.Вставить("ВремяНаУстановку", 0); // Минуты.
	ПараметрыРасчета.Вставить("ПараметрыОбъекта", Неопределено);
	
	Возврат ПараметрыРасчета;
	
КонецФункции

// Функция вычисляет сроки установки визы на основании данных производственного календаря.
// 
// Параметры:
// 	ПараметрыРасчета - Структура. см. НовыеПараметрыРасчетаСрокаИсполнения().
// 
// Возвращаемое значение:
// 	Дата.
//
Функция СрокИсполнения(ПараметрыРасчета) Экспорт
	
	СекундВМинуте            = 60;
	СрокИсполнения           = ПараметрыРасчета.ДатаОтсчета;
	СтруктурноеПодразделение = СтруктурноеПодразделение(ПараметрыРасчета.ОбъектРасчета);
	ПараметрыРабочегоВремени = ПараметрыРабочегоВремени(СтруктурноеПодразделение, СрокИсполнения);
	
	СекундНаУстановку = ПараметрыРасчета.ВремяНаУстановку * СекундВМинуте;
	Если НЕ ПараметрыРабочегоВремени.ИспользуетсяГрафик
		И НЕ ПараметрыРабочегоВремени.ИспользуетсяКалендарь Тогда
		Возврат СрокИсполнения + СекундНаУстановку;
	КонецЕсли;
	
	СдвинутьСрокНаРабочийПериод(СрокИсполнения, ПараметрыРабочегоВремени);
	ДобавитьДниНаУстановку(СрокИсполнения, СекундНаУстановку, ПараметрыРабочегоВремени);	
	ДобавитьВремяНаУстановку(СрокИсполнения, СекундНаУстановку, ПараметрыРабочегоВремени);
	
	Возврат СрокИсполнения;	
	
КонецФункции

// Получает алгоритм визирования исходя из текущего набора виз для объекта.
// 
// Параметры:
//  НаборВизы  - РегистрыСведенийНаборЗаписей.бит_УстановленныеВизы.
// 
// Возвращаемое значение:
//  Алгоритм   - СправочникСсылка.бит_АлгоритмыПроцессов.
// 
Функция ПолучитьАлгоритмПоНаборуВиз(НаборВизы) Экспорт

	Алгоритм = Справочники.бит_АлгоритмыПроцессов.ПустаяСсылка();
	Для Каждого СтрокаВизы Из НаборВизы Цикл
		Если ЗначениеЗаполнено(СтрокаВизы.Алгоритм) Тогда
			Алгоритм = СтрокаВизы.Алгоритм;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 

	Возврат Алгоритм;
	
КонецФункции

// Продолжает выполнение алгоритма визирования.
// 
// Параметры:
//  ТекущийОбъект  - ДокументОбъект.
//  НаборВизы      - РегистрСведенийНаборЗаписей.бит_УстановленныеВизы (По умолчанию = Неопределено).
//  ЗаписыватьВизы - Булево (По умолчанию = Истина).
// 
Процедура ДовыполнитьАлгоритмВизирования(ТекущийОбъект, НаборВизы = Неопределено, ЗаписыватьВизы = Истина) Экспорт

	Если НаборВизы = Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Объект", ТекущийОбъект.Ссылка);		
		НаборВизы = ПрочитатьНаборВиз(Отбор);	
	КонецЕсли; 
	
	Алгоритм = ПолучитьАлгоритмПоНаборуВиз(НаборВизы);
	
	ВыполнятьПоэтапно = бит_УправлениеПроцессами.ВыполнятьАлгоритмПоэтапно(Алгоритм);
	
	ПараметрыКонтекста = Новый Структура;
	ПараметрыКонтекста.Вставить("Алгоритм",          Алгоритм);
	ПараметрыКонтекста.Вставить("ВыполнятьПоэтапно", ВыполнятьПоэтапно);
	ПараметрыКонтекста.Вставить("НаборВизы",         НаборВизы);
	ПараметрыКонтекста.Вставить("СтекОчистки",       Новый СписокЗначений);
	ПараметрыКонтекста.Вставить("ТекущийОбъект",     ТекущийОбъект);
	
	Если НЕ ВыполнятьПоэтапно Тогда
		Если НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущийОбъект.ДополнительныеСвойства,
															"РежимОчисткиРешения",
															Ложь) Тогда
			Пока АвтоустановкаРешенийНаборуВиз(ПараметрыКонтекста) Цикл
				ОпередитьКрайниеСрокиИАктивность(ПараметрыКонтекста);
			КонецЦикла;
			
			Если ЗаписыватьВизы И НаборВизы.Модифицированность() Тогда
				Если НаборВизы.ПроверитьЗаполнение() Тогда
					НаборВизы.Записать();
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтруктураКонтекст = Новый Структура;
	СтруктураКонтекст.Вставить("ТекущийОбъект", ТекущийОбъект);
	СтруктураКонтекст.Вставить("Визы"         , НаборВизы);
	
	КомментироватьВыполнение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("КомментироватьХодВыполненияАлгоритмовПроцессов",
								Пользователи.ТекущийПользователь());
		
	РежимСообщений = ?(КомментироватьВыполнение, "Все", "Ошибки");				
	
	бит_УправлениеПроцессами.ВыполнитьАлгоритм(Алгоритм, СтруктураКонтекст, РежимСообщений);
	Если НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущийОбъект.ДополнительныеСвойства,
															"РежимОчисткиРешения",
															Ложь) Тогда
		Пока АвтоустановкаРешенийНаборуВиз(ПараметрыКонтекста) Цикл
			бит_УправлениеПроцессами.ВыполнитьАлгоритм(Алгоритм, СтруктураКонтекст, РежимСообщений);
		КонецЦикла;
	КонецЕсли;

	ОпередитьКрайниеСрокиИАктивность(ПараметрыКонтекста);
    	
	Если ЗаписыватьВизы И НаборВизы.Модифицированность() Тогда
		Если НаборВизы.ПроверитьЗаполнение() Тогда
			НаборВизы.Записать();
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсПользовательскихУсловий

// Определяет есть ли решение определенного вида.
// Может вызываться при вычислении пользовательских условий.
// 
// Параметры:
//  ТекущийОбъект  - ДокументОбъект,ДокументСсылка.
//  Решение        - СправочникСсылка.бит_ВидыРешенийСогласования.
//  НаборВизы      - РегистрСведенийНаборЗаписей.бит_УстановленныеВизы,ТаблицаЗначений.
// 
// Возвращаемое значение:
//   Булево.
// 
Функция ПринятоРешение(ТекущийОбъект, Решение, НаборВизы = Неопределено) Экспорт

	Если МеханизмВизированияОтключен(ТекущийОбъект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	РешениеПринято = Ложь;
	
	Если НаборВизы = Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Объект",ТекущийОбъект);
		НаборВизы = ПрочитатьНаборВиз(Отбор);
	КонецЕсли; 

	Для каждого Запись Из НаборВизы Цикл
		Если Запись.Решение = Решение Тогда
			РешениеПринято = Истина;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат РешениеПринято;
	
КонецФункции

// Определяет какое решение было принято по визе.
// Может вызываться при вычислении пользовательских условий.
// 
// Параметры:
//  ТекущийОбъект  - ДокументОбъект,ДокументСсылка.
//  НаборВизы      - РегистрСведенийНаборЗаписей.бит_УстановленныеВизы,ТаблицаЗначений.
//  Виза           - СправочникСсылка.бит_Визы.
// 
// Возвращаемое значение:
//  СправочникСсылка.бит_ВидыРешенийСогласования.
// 
Функция ПринятоРешениеПоВизе(ТекущийОбъект, Виза, НаборВизы = Неопределено) Экспорт

	Если МеханизмВизированияОтключен(ТекущийОбъект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Решение = Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка();
	
	Если НаборВизы = Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Объект",ТекущийОбъект);
		НаборВизы = ПрочитатьНаборВиз(Отбор);
	КонецЕсли; 
	
	Для Каждого Запись Из НаборВизы Цикл
		Если Запись.Виза = Виза Тогда
			Решение = Запись.Решение;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 

	Возврат Решение;
	
КонецФункции

// Проверяет получены ли все утверждающие визы по данному объекту для перехода в данный статус. 
// Если статус не заполнен проверяется заполнение всех утверждающих виз. 
// Может вызываться при вычислении пользовательских условий.
// 
// Параметры:
//  ТекущийОбъект  - ДокументСсылка.
//  Статус         - СправочникСсылка.СтатусыОбъектов.
// 
// Возвращаемое значение:
//   Булево.
// 
Функция ВизыПолучены(ТекущийОбъект, Статус = Неопределено) Экспорт

	Если МеханизмВизированияОтключен(ТекущийОбъект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Визы.Виза КАК Виза,
	|	Визы.Статус КАК Статус,
	|	Визы.Решение КАК Решение,
	|	ВЫБОР
	|		КОГДА Визы.Решение.ТипРешения = ЗНАЧЕНИЕ(Перечисление.бит_ТипыРешений.Согласующее)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Согласовано
	|ИЗ
	|	РегистрСведений.бит_УстановленныеВизы КАК Визы
	|ГДЕ
	|	Визы.Объект = &Объект
	|	И &УсловиеСтатуса
	|	И Визы.Виза.Вид = ЗНАЧЕНИЕ(Перечисление.бит_ВидыВиз.Утверждающая)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Согласовано";
	Если ЗначениеЗаполнено(Статус) Тогда
		УсловиеСтатуса = "Визы.Статус = &Статус";
		Запрос.УстановитьПараметр("Статус", Статус);
	Иначе
		УсловиеСтатуса = "ИСТИНА";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСтатуса", УсловиеСтатуса);
	Запрос.УстановитьПараметр("Объект", ТекущийОбъект.Ссылка);
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Согласовано;
	
КонецФункции

// Проверяет все ли решения по вышестоящим визам совпадают с указанным.
// 
// Параметры:
//  ТекущийОбъект  - ДокументОбъект,ДокументСсылка.
//  Виза           - СправочникСсылка.бит_Визы.
//  Решение        - СправочникСсылка.бит_ВидыРешенийСогласования.
//  НаборВизы      - РегистрСведенийНаборЗаписей.бит_УстановленныеВизы,ТаблицаЗначений.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПринятоРешениеПоВышестоящимВизам(ТекущийОбъект, Виза, Решение, НаборВизы = Неопределено) Экспорт

	Если МеханизмВизированияОтключен(ТекущийОбъект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПринятоРешение = Ложь;
	
	Если НаборВизы = Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Объект",ТекущийОбъект);
		НаборВизы = ПрочитатьНаборВиз(Отбор);
	КонецЕсли; 
	
	ТаблицаВиз = НаборВизы.Выгрузить();
	СтрокаВизы = ТаблицаВиз.Найти(Виза, "Виза");
	Если СтрокаВизы = Неопределено Тогда
		// В случае поэтапного алгоритма проверяемой визы может еще не быть в наборе
		//	в таком случае проверяем решение по всем текущим визам.
		ПорядокПроверяемойВизы = 0;
	Иначе
		ПорядокПроверяемойВизы = СтрокаВизы.КодСортировки;
		ТаблицаВиз.Сортировать("КодСортировки");
	КонецЕсли;
	
	Для Каждого СтрокаВизы Из ТаблицаВиз Цикл
		Если ПорядокПроверяемойВизы > 0 И СтрокаВизы.КодСортировки >= ПорядокПроверяемойВизы Тогда
			// Текущая или последующие визы.
			Прервать;
		КонецЕсли;
		
		Если СтрокаВизы.Решение = Решение Тогда
			ПринятоРешение = Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат ПринятоРешение;
	
КонецФункции

// Проверяет приняты ли хоть какие-то решения по вышестоящим визам.
// 
// Параметры:
//  ТекущийОбъект  - ДокументОбъект,ДокументСсылка - документ.
//  Виза           - СправочникСсылка.бит_Визы - виза.
//  НаборВизы      - РегистрСведенийНаборЗаписей.бит_УстановленныеВизы.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПринятыРешенияПоВышестоящимВизам(ТекущийОбъект, Виза, НаборВизы = Неопределено) Экспорт

	Если МеханизмВизированияОтключен(ТекущийОбъект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПринятоРешение = Ложь;
	
	Если НаборВизы = Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Объект",ТекущийОбъект);
		НаборВизы = ПрочитатьНаборВиз(Отбор);
	КонецЕсли; 
	
	ТаблицаВиз = НаборВизы.Выгрузить();
	СтрокаВизы = ТаблицаВиз.Найти(Виза, "Виза");
	Если СтрокаВизы = Неопределено Тогда
		// В случае поэтапного алгоритма проверяемой визы может еще не быть в наборе
		//	в таком случае проверяем решение по всем текущим визам.
		ПорядокПроверяемойВизы = 0;
	Иначе
		ПорядокПроверяемойВизы = СтрокаВизы.КодСортировки;
		ТаблицаВиз.Сортировать("КодСортировки");
	КонецЕсли;
	
	Для Каждого СтрокаВизы Из ТаблицаВиз Цикл
		Если ПорядокПроверяемойВизы > 0 И СтрокаВизы.КодСортировки >= ПорядокПроверяемойВизы Тогда
			// Текущая или последующие визы.
			Прервать;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаВизы.Решение) Тогда
			ПринятоРешение = Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат ПринятоРешение;
	
КонецФункции

// Проверяет доступна ли пользователю роль исполнителя.
// 
// Параметры:
//  ТекущийОбъект   - ЛюбаяСсылка.
//  РольИсполнителя - СправочникСсылка.бит_РолиИсполнителей.
//	ТекущийПользователь - СправочникСсылка.Пользователи.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ДоступнаРольИсполнителя(ТекущийОбъект, РольИсполнителя, ТекущийПользователь) Экспорт

	РольДоступна = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя,
	|	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
	|	ОбъектыАдресации_1.Вид КАК ВидОбъекта_1,
	|	ОбъектыАдресации_1.Вид.Код КАК ИмяВида_1,
	|	ОбъектыАдресации_1.Вид.СпособПроверкиПринадлежности КАК СпособПроверки_1,
	|	ИсполнителиЗадач.ОбъектАдресации_1 КАК ОбъектАдресации_1,
	|	ОбъектыАдресации_2.Вид КАК ВидОбъекта_2,
	|	ОбъектыАдресации_2.Вид.Код КАК ИмяВида_2,
	|	ОбъектыАдресации_2.Вид.СпособПроверкиПринадлежности КАК СпособПроверки_2,
	|	ИсполнителиЗадач.ОбъектАдресации_2 КАК ОбъектАдресации_2,
	|	ОбъектыАдресации_3.Вид КАК ВидОбъекта_3,
	|	ОбъектыАдресации_3.Вид.Код КАК ИмяВида_3,
	|	ОбъектыАдресации_3.Вид.СпособПроверкиПринадлежности КАК СпособПроверки_3,
	|	ИсполнителиЗадач.ОбъектАдресации_3 КАК ОбъектАдресации_3
	|ИЗ
	|	РегистрСведений.бит_ИсполнителиЗадач КАК ИсполнителиЗадач
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_РолиИсполнителей.ОбъектыАдресации КАК ОбъектыАдресации_1
	|		ПО ИсполнителиЗадач.РольИсполнителя = ОбъектыАдресации_1.Ссылка
	|			И (ОбъектыАдресации_1.Имя = ""ОбъектАдресации_1"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_РолиИсполнителей.ОбъектыАдресации КАК ОбъектыАдресации_2
	|		ПО ИсполнителиЗадач.РольИсполнителя = ОбъектыАдресации_2.Ссылка
	|			И (ОбъектыАдресации_2.Имя = ""ОбъектАдресации_2"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_РолиИсполнителей.ОбъектыАдресации КАК ОбъектыАдресации_3
	|		ПО ИсполнителиЗадач.РольИсполнителя = ОбъектыАдресации_3.Ссылка
	|			И (ОбъектыАдресации_3.Имя = ""ОбъектАдресации_3"")
	|ГДЕ
	|	ИсполнителиЗадач.Исполнитель = &ТекущийПользователь
	|	И ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя";
	Запрос.УстановитьПараметр("РольИсполнителя"    , РольИсполнителя);
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	
	Выборка     = Запрос.Выполнить().Выбрать();
	МетаОбъект  = ТекущийОбъект.Метаданные();
	
	Пока Выборка.Следующий() Цикл
		 УсловиеВыполнено = ПроверитьПринадлежностьОбъектаВизирования(ТекущийОбъект, МетаОбъект, Выборка);
		 Если УсловиеВыполнено Тогда
		 	РольДоступна = Истина;
			Прервать;
		 КонецЕсли; 
	КонецЦикла; 
	
	Возврат РольДоступна;
	
КонецФункции

// Проверяет наличие назначенных исполнителей по роли.
// 
// Параметры:
//  ТекущийОбъект   - ЛюбаяСсылка.
//  РольИсполнителя - СправочникСсылка.бит_РолиИсполнителей.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция НазначеныИсполнители(ТекущийОбъект, РольИсполнителя) Экспорт

	НазначеныИсполнители = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя,
	|	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
	|	ОбъектыАдресации_1.Вид КАК ВидОбъекта_1,
	|	ОбъектыАдресации_1.Вид.Код КАК ИмяВида_1,
	|	ОбъектыАдресации_1.Вид.СпособПроверкиПринадлежности КАК СпособПроверки_1,
	|	ИсполнителиЗадач.ОбъектАдресации_1 КАК ОбъектАдресации_1,
	|	ОбъектыАдресации_2.Вид КАК ВидОбъекта_2,
	|	ОбъектыАдресации_2.Вид.Код КАК ИмяВида_2,
	|	ОбъектыАдресации_2.Вид.СпособПроверкиПринадлежности КАК СпособПроверки_2,
	|	ИсполнителиЗадач.ОбъектАдресации_2 КАК ОбъектАдресации_2,
	|	ОбъектыАдресации_3.Вид КАК ВидОбъекта_3,
	|	ОбъектыАдресации_3.Вид.Код КАК ИмяВида_3,
	|	ОбъектыАдресации_3.Вид.СпособПроверкиПринадлежности КАК СпособПроверки_3,
	|	ИсполнителиЗадач.ОбъектАдресации_3 КАК ОбъектАдресации_3
	|ИЗ
	|	РегистрСведений.бит_ИсполнителиЗадач КАК ИсполнителиЗадач
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_РолиИсполнителей.ОбъектыАдресации КАК ОбъектыАдресации_1
	|		ПО ИсполнителиЗадач.РольИсполнителя = ОбъектыАдресации_1.Ссылка
	|			И (ОбъектыАдресации_1.Имя = ""ОбъектАдресации_1"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_РолиИсполнителей.ОбъектыАдресации КАК ОбъектыАдресации_2
	|		ПО ИсполнителиЗадач.РольИсполнителя = ОбъектыАдресации_2.Ссылка
	|			И (ОбъектыАдресации_2.Имя = ""ОбъектАдресации_2"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_РолиИсполнителей.ОбъектыАдресации КАК ОбъектыАдресации_3
	|		ПО ИсполнителиЗадач.РольИсполнителя = ОбъектыАдресации_3.Ссылка
	|			И (ОбъектыАдресации_3.Имя = ""ОбъектАдресации_3"")
	|ГДЕ
	|	ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя";
	Запрос.УстановитьПараметр("РольИсполнителя", РольИсполнителя);
	
	Выборка     = Запрос.Выполнить().Выбрать();
	МетаОбъект  = ТекущийОбъект.Метаданные();
	
	Пока Выборка.Следующий() Цикл
		 УсловиеВыполнено = ПроверитьПринадлежностьОбъектаВизирования(ТекущийОбъект, МетаОбъект, Выборка);
		 Если УсловиеВыполнено Тогда
		 	НазначеныИсполнители = Истина;
			Прервать;
		 КонецЕсли; 
	КонецЦикла; 
	
	Возврат НазначеныИсполнители;
	
КонецФункции

#КонецОбласти

#Область ИнтерфейсОповещенийОНовыхВизах

// Устанавливает признак "Оповещено" для указанного способа транспорта.
//
// Параметры:
//  ТаблицаВиз - ТаблицаЗначений - Таблица обработанных виз, для которых необходимо установить признак. Обязательные колонки:
//		* Объект - ДокументСсылка, СправочникСсылка - Объект визирования.
//		* Виза   - СправочникСсылка.бит_Визы.
//	СпособТранспорта - ПеречислениеСсылка.бит_фн_СпособыТранспортаОповещений.
//
Процедура УстановитьОтметкуОповещения(ТаблицаВиз, СпособТранспорта) Экспорт
	
	Если ТаблицаВиз.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтметкаОповещения = "";
	Если СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.Telegram Тогда
		ОтметкаОповещения = "ОповещеноТелеграм";
	ИначеЕсли СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта1С Тогда
		ОтметкаОповещения = "ОповещеноПочта";
	Иначе
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВиз.Объект КАК Объект,
	|	ТаблицаВиз.Виза КАК Виза
	|ПОМЕСТИТЬ ТаблицаВиз
	|ИЗ
	|	&ТаблицаВиз КАК ТаблицаВиз";
	Запрос.УстановитьПараметр("ТаблицаВиз", ТаблицаВиз);
	Запрос.Выполнить();
		
	НачатьТранзакцию();
	
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.бит_УстановленныеВизы");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ТаблицаВиз;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Объект", "Объект");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Виза", "Виза");
		Блокировка.Заблокировать();
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УстановленныеВизы.Объект КАК Объект,
		|	УстановленныеВизы.Виза КАК Виза,
		|	УстановленныеВизы.ИД КАК ИД
		|ИЗ
		|	РегистрСведений.бит_УстановленныеВизы КАК УстановленныеВизы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВиз КАК ТаблицаВиз
		|		ПО УстановленныеВизы.Объект = ТаблицаВиз.Объект
		|			И УстановленныеВизы.Виза = ТаблицаВиз.Виза
		|			И УстановленныеВизы.АктивнаяВиза
		|			И НЕ &ФильтрСпособаТранспорта";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФильтрСпособаТранспорта", "УстановленныеВизы." + ОтметкаОповещения);
		Запрос.Текст = ТекстЗапроса;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборВиз = РегистрыСведений.бит_УстановленныеВизы.СоздатьНаборЗаписей();
			НаборВиз.Отбор.Объект.Установить(Выборка.Объект);
			НаборВиз.Отбор.Виза.Установить(Выборка.Виза);
			НаборВиз.Отбор.ИД.Установить(Выборка.ИД);
			НаборВиз.Прочитать();
			// Отключим регистрацию изменения регистра в механизм оповещений.
			НаборВиз.ДополнительныеСвойства.Вставить("ОтключитьРегистрациюОповещений", Истина);
			
			Для каждого ЗаписьНабора Из НаборВиз Цикл
				ЗаписьНабора[ОтметкаОповещения] = Истина;
			КонецЦикла;
			
			НаборВиз.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		Событие = НСтр("ru = 'Ошибка снятия отметки оповещения'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(
			Событие,
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Конструктор параметров, влияющих на установку статуса.
//
// Возвращаемое значение:
//	Структура - параметры для определения статуса.
//
Функция НовыеПараметрыУстановкиСтатуса() Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("РежимЗаписи",             РежимЗаписиДокумента.Запись);
	Параметры.Вставить("ТекущийСтатус",           Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
	Параметры.Вставить("ДатаИзмененияСтатуса",    '00010101');
	Параметры.Вставить("ПараметрыОплаты",         Неопределено);
	Параметры.Вставить("ВнешняяУстановкаСтатуса", Истина);
	
	Параметры.Вставить("Объект",                  Неопределено);
	Параметры.Вставить("ВидСтатуса",              Перечисления.бит_ВидыСтатусовОбъектов.Статус);
	Параметры.Вставить("Статус",                  Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
	Параметры.Вставить("СтатусПредыдущий",        Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
	Параметры.Вставить("Пользователь",	          Пользователи.ТекущийПользователь());
	Параметры.Вставить("Алгоритм",                Справочники.бит_АлгоритмыПроцессов.ПустаяСсылка());
	
	Параметры.Вставить("РежимСообщений",          "Все");
	
	Возврат Параметры;
	
КонецФункции

// Конструктор параметров проверки условий выполнения алгоритма.
// 
// Возвращаемое значение:
//  Параметры - Структура.
//
Функция НовыеПараметрыПроверкиУсловия() Экспорт
	
	ПараметрыПроверкиУсловий = Новый Структура;
	ПараметрыПроверкиУсловий.Вставить("ТекущийОбъект");
	ПараметрыПроверкиУсловий.Вставить("Визы");
	ПараметрыПроверкиУсловий.Вставить("Алгоритм");
	ПараметрыПроверкиУсловий.Вставить("ТипыРешенийПоТочкам", Новый Соответствие);
	
	КэшПроверок = Новый Структура;
	КэшПроверок.Вставить("ВышеНетНевыполнимыхУсловий", Новый Соответствие);
	КэшПроверок.Вставить("ВышеЕстьТочкиДействия",      Новый Соответствие);
	КэшПроверок.Вставить("ВышеНетТочекДействия",       Новый Соответствие);
	КэшПроверок.Вставить("ПринятыРешенияПоВышестоящимТочкам", Новый Соответствие);
	ПараметрыПроверкиУсловий.Вставить("КэшПроверок", КэшПроверок);
	
	Возврат ПараметрыПроверкиУсловий;
	
КонецФункции

// Обработчик подписки на событие "Перед записью" документов, поддерживающих механизм установки статусов.
//
Процедура бит_ПередЗаписьюДокументаДляУстановкиСтатуса(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДействияУстановкиСтатусаПередЗаписьюОбъекта(Источник, Отказ, РежимЗаписи);
	
КонецПроцедуры

// Обработчик подписки на событие "Перед записью" справочников, поддерживающих механизм установки статусов.
//
Процедура бит_ПередЗаписьюДляУстановкиСтатуса(Источник, Отказ) Экспорт
	
	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник.ДополнительныеСвойства,
		"ОтключитьОпределениеСтатуса", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ПометкаУдаления Тогда
		РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
	Иначе
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
	ДействияУстановкиСтатусаПередЗаписьюОбъекта(Источник, Отказ, РежимЗаписи);
	
КонецПроцедуры

// Обработчик подписки на событие "При записи" объектов, поддерживающих механизм установки статусов.
//
Процедура бит_ПриЗаписиДляУстановкиСтатуса(Источник, Отказ) Экспорт
	
	ДействияУстановкиСтатусаПриЗаписиОбъекта(Источник, Отказ);
	
КонецПроцедуры

// Конструктор параметров результатов выполнения операций при групповой установке статусов.
// 
// Возвращаемое значение:
//  Параметры - Структура.
//
Функция НовыйКэшОперацийУстановкиСтатусов() Экспорт
	
	КэшОпераций = Новый Структура;
	КэшОпераций.Вставить("ОбработанныеСтатусыРеестров", Новый Соответствие);
	
	Возврат КэшОпераций;
	
КонецФункции

// Операции внешней установки статуса.
//
// Параметры:
//  Объект			 - ДокументОбъект - Объект для которого устанавливается статус. 
//  ПараметрыОплаты	 - Соответствие - Параметры оплаты.
//  КэшОпераций      - Структура - см. бит_ВизированиеСервер.НовыйКэшОперацийУстановкиСтатусов().
//
Процедура ОперацииВнешнейУстановкиСтатуса(Объект, ПараметрыОплаты = Неопределено, КэшОпераций = Неопределено) Экспорт
	
	ЗаполнитьПараметрыОпределенияСтатусаПередЗаписьюОбъекта(Объект, РежимЗаписиДокумента.Запись, Истина);
	ДействияУстановкиСтатусаПриЗаписиОбъекта(Объект, Ложь, ПараметрыОплаты, КэшОпераций);
	
КонецПроцедуры

// Определяет принадлежность объекта к подсистеме
// и возвращает значение соответствующей подсистеме настройки "Принятие к учету после утверждения".
Функция ПриниматьКУчетуПослеУтверждения(Источник) Экспорт
	
	// ++
	// Временная загрушка до переноса функционала из БП.
	Возврат ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения");
	// --
	
	Результат = Ложь;
	ТипИсточника = ТипЗнч(Источник);
	Если Метаданные.ОпределяемыеТипы.бит_ОбъектыПринимаемыеКУчетуПослеУтвержденияБюджетирование.Тип.СодержитТип(ТипИсточника) Тогда
		Результат = ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения");
	ИначеЕсли Метаданные.ОпределяемыеТипы.бит_ОбъектыПринимаемыеКУчетуПослеУтвержденияУправлениеДоговорами.Тип.СодержитТип(ТипИсточника) Тогда
		Результат = ПолучитьФункциональнуюОпцию("бит_ПринятиеКУчетуПослеУтвержденияУправлениеДоговорами");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСоСтатусами

Процедура ДействияУстановкиСтатусаПередЗаписьюОбъекта(Источник, Отказ, РежимЗаписи)
	
	ЗаполнитьПараметрыОпределенияСтатусаПередЗаписьюОбъекта(Источник, РежимЗаписи);
	ПроверитьВозможностьРедактированияСтатуса(Источник, РежимЗаписи, Отказ);
	
КонецПроцедуры

Процедура ПроверитьВозможностьРедактированияСтатуса(Источник, РежимЗаписи, Отказ)
	
	МодульВизирования = МодульВизированияПереопределяемый();
	Если МодульВизирования.НеВыполнятьПроверкуСтатусаДляОбъекта(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		ТекущийСтатус = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник.ДополнительныеСвойства, "ТекущийСтатус");
		
		// Свойство "ПропуститьПроверкуДляУстановкиСтатуса" может отключать проверку.
		ОтключитьМеханизмПроверкиСтатуса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
													Источник.ДополнительныеСвойства, 
													"ОтключитьМеханизмПроверкиСтатуса", Ложь);
													
		Если ОтключитьМеханизмПроверкиСтатуса Тогда
			Возврат;		
		КонецЕсли;	
		
		Если Справочники.бит_СтатусыОбъектов.ЭтоБлокирующийСтатус(ТекущийСтатус) Тогда
			БлокироватьОперацию = Истина;
			
			НастройкиДоступности = бит_НастройкиДоступностиЭлементовФорм.НастройкиДоступностиЭлементов(Источник);
			Если НастройкиДоступности <> Неопределено Тогда
				НастройкаВсейФормы = НастройкиДоступности.Найти("ВсеЭлементыФормы", "ИмяЭлемента");
				Если НастройкаВсейФормы <> Неопределено Тогда
					БлокироватьОперацию = НастройкаВсейФормы.ТолькоПросмотр;
				КонецЕсли;
			КонецЕсли;
			
			Если БлокироватьОперацию Тогда
				ТекстСообщения = НСтр("ru='Объект в статусе ""%1"" не подлежит редактированию.';
										|en='Object in status ""%1"" can not be changed.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийСтатус);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Источник,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыТекущегоСтатуса(Ссылка)

	ПараметрыСтатуса = Новый Структура;
	ПараметрыСтатуса.Вставить("Статус", Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
	ПараметрыСтатуса.Вставить("ТипСтатуса", Перечисления.бит_ТипыСтатусовОбъектов.ПустаяСсылка());
	ПараметрыСтатуса.Вставить("ДатаИзмененияСтатуса", '00010101');
	ПараметрыСтатуса.Вставить("ИнформацияСтатус", 	  "");
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат ПараметрыСтатуса;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыОбъектов.Статус КАК Статус,
	|	СтатусыОбъектов.Статус.ТипСтатуса КАК ТипСтатуса,
	|	СтатусыОбъектов.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса
	|ИЗ
	|	РегистрСведений.бит_СтатусыОбъектов КАК СтатусыОбъектов
	|ГДЕ
	|	СтатусыОбъектов.Объект = &Объект
	|	И СтатусыОбъектов.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус)";
	Запрос.УстановитьПараметр("Объект", Ссылка);			   

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыСтатуса, Выборка);
	КонецЕсли;
	
	Возврат ПараметрыСтатуса;
	
КонецФункции

Функция ЗаблокированоИзменениеСтатуса(Ссылка, ПараметрыУстановкиСтатуса)
	
	СтатусДоИзменения = ПараметрыУстановкиСтатуса.ТекущийСтатус;
	
	Если НЕ Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(СтатусДоИзменения,
			Перечисления.бит_ТипыСтатусовОбъектов.Закрыт) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ДокументЗакрытия = "бит_ЗакрытиеЗаявок";
		Возврат Документы[ДокументЗакрытия].ПроведеноЗакрытиеДокумента(Ссылка);
	Иначе
		ДокументЗакрытия = "бит_кзн_ЗакрытиеДокументовПланирования";
		Возврат Ложь; // Реализовать в ERP.
	КонецЕсли;
	
КонецФункции

Процедура ДействияПослеУстановкиСтатуса(Объект, ПараметрыУстановкиСтатуса, КэшОпераций)
	
	МодульВизирование = МодульВизированияПереопределяемый();
	МодульВизирование.ДействияПослеУстановкиСтатуса(Объект, ПараметрыУстановкиСтатуса, КэшОпераций);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыОпределенияСтатусаПередЗаписьюОбъекта(Источник, РежимЗаписи, ВнешняяУстановкаСтатуса = Ложь)
	
	МетаданныеОбъекта           = Источник.Метаданные();
	ЭтоДокумент                 = ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта);
	НастройкиОбъектаВизирования = НастройкиОбъектаВизирования(Источник);
	ИспользоватьВизирование     = НастройкиОбъектаВизирования.ИспользоватьВизирование;
	
	ЕстьОтправкаНаСогласование         = Ложь;
	ИмяРеквизитаОтправкаНаСогласование = "";
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ОтправленНаСогласование", МетаданныеОбъекта) Тогда
		ЕстьОтправкаНаСогласование         = Истина;
		ИмяРеквизитаОтправкаНаСогласование = "ОтправленНаСогласование";
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("бит_ОтправленНаСогласование", МетаданныеОбъекта) Тогда
		ЕстьОтправкаНаСогласование         = Истина;
		ИмяРеквизитаОтправкаНаСогласование = "бит_ОтправленНаСогласование";
	КонецЕсли;

	ПриниматьКУчетуПослеУтверждения = ПриниматьКУчетуПослеУтверждения(Источник);
	
	ПроводитьПослеУтверждения = ИспользоватьВизирование И ЕстьОтправкаНаСогласование И ПриниматьКУчетуПослеУтверждения;
								   
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьОбновлениеВизПриПроведении")
		И Источник.ДополнительныеСвойства.ОтключитьОбновлениеВизПриПроведении Тогда
		ОбновлятьВизыПриПерепроведении = Ложь;
	Иначе
		РежимОбновленияВиз             = НастройкиОбъектаВизирования.РежимОбновленияВиз;
		ОбновлятьВизыПриПерепроведении = (РежимОбновленияВиз = Перечисления.бит_РежимыОбновленияПеречняВиз.ОбновлятьПриПерепроведении);
	КонецЕсли;
	
	ПризнакПроведения         = ?(ЭтоДокумент, Источник.Проведен, Истина);
	
	ТекущийСтатус = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник.ДополнительныеСвойства, "ТекущийСтатус");
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = ТекущийСтатус(Источник.Ссылка);
	КонецЕсли;
	
	ОбновитьПереченьВиз       = Ложь;
	ОчиститьВсеВизыБезусловно = Ложь;
	Если ИспользоватьВизирование И НЕ ВнешняяУстановкаСтатуса Тогда
		Если ЕстьОтправкаНаСогласование Тогда
			Если ЭтоДокумент Тогда
				Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
					Источник[ИмяРеквизитаОтправкаНаСогласование] = Истина;
				ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
					Источник[ИмяРеквизитаОтправкаНаСогласование] = Ложь;
				КонецЕсли;
			Иначе
				Если НЕ Источник[ИмяРеквизитаОтправкаНаСогласование]
					И ЗначениеЗаполнено(Источник.Ссылка)
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, ИмяРеквизитаОтправкаНаСогласование) Тогда
					// Снят с согласования.
					ОчиститьВсеВизыБезусловно = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ВизированиеБезПроведения = (ЕстьОтправкаНаСогласование И Источник[ИмяРеквизитаОтправкаНаСогласование]);
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение
			И ЭтоДокумент
			И (ОбновлятьВизыПриПерепроведении
				ИЛИ (НЕ ПризнакПроведения И НЕ ВизированиеБезПроведения)
				ИЛИ НЕ ВизыУстановлены(Источник.Ссылка)) Тогда
			ОбновитьПереченьВиз = Истина;
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись
			И НЕ Источник.ПометкаУдаления
			И МетаданныеОбъекта.Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить
			И НЕ ВизыУстановлены(Источник.Ссылка) Тогда
			ОбновитьПереченьВиз = Истина;
		ИначеЕсли ВизированиеБезПроведения Тогда
			Если НЕ ЗначениеЗаполнено(ТекущийСтатус)
				ИЛИ Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ТекущийСтатус,
						Перечисления.бит_ТипыСтатусовОбъектов.Черновик) Тогда
				ОбновитьПереченьВиз = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый"                   , Источник.ЭтоНовый());
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи"                , РежимЗаписи);
	Источник.ДополнительныеСвойства.Вставить("ОбновитьПереченьВиз"        , ОбновитьПереченьВиз);
	Источник.ДополнительныеСвойства.Вставить("ОчиститьВсеВизыБезусловно"  , ОчиститьВсеВизыБезусловно);
	Источник.ДополнительныеСвойства.Вставить("ПроводитьПослеУтверждения"  , ПроводитьПослеУтверждения);
	Источник.ДополнительныеСвойства.Вставить("ВнешняяУстановкаСтатуса"    , ВнешняяУстановкаСтатуса);
	Источник.ДополнительныеСвойства.Вставить("МеханизмВизированияОтключен", НЕ ИспользоватьВизирование);
	Источник.ДополнительныеСвойства.Вставить("ТекущийСтатус"              , ТекущийСтатус);
	
КонецПроцедуры

Процедура ДействияУстановкиСтатусаПриЗаписиОбъекта(Источник, Отказ, ПараметрыОплаты = Неопределено,
													КэшОпераций = Неопределено)
	
	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник.ДополнительныеСвойства,
		"ОтключитьОпределениеСтатуса", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства;
	
	РежимЗаписи = ДополнительныеСвойства.РежимЗаписи;
	
	Если НЕ Метаданные.ОпределяемыеТипы.бит_ОбъектыВизирования.Тип.СодержитТип(ТипЗнч(Источник.Ссылка)) Тогда
		// Для данного объекта не предусмотрено визирование.
	ИначеЕсли ДополнительныеСвойства.ОчиститьВсеВизыБезусловно
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОчиститьВсеВизыБезусловно(Источник.Ссылка);
	ИначеЕсли ДополнительныеСвойства.МеханизмВизированияОтключен Тогда
		// Для данного объекта визирование отключено.
	ИначеЕсли ДополнительныеСвойства.ОбновитьПереченьВиз Тогда
		РеквизитыОбъекта = Источник.Метаданные().Реквизиты;
		СтруктураПараметров = Новый Структура;
		Если РеквизитыОбъекта.Найти("Организация") <> Неопределено Тогда
			СтруктураПараметров.Вставить("СтруктурноеПодразделение", Источник.Организация);
		КонецЕсли;
		Если РеквизитыОбъекта.Найти("ЦФО") <> Неопределено Тогда
			СтруктураПараметров.Вставить("ЦФО", Источник.ЦФО);
		КонецЕсли;
		ОбновитьПереченьВиз(Источник.Ссылка, Источник.Дата, СтруктураПараметров);
	КонецЕсли;
	
	ВнешняяУстановкаСтатуса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ВнешняяУстановкаСтатуса", Истина);
	
	Если НЕ ВнешняяУстановкаСтатуса И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		// В отдельных случаях установка статуса при проведении выполняется после формирования движений.
		// При этом вызов установки статусов выполняется в процедуре модуля проведения самого объекта.
		Если бит_ОбщегоНазначения.ЭтоСемействоБП()
			И Источник.Метаданные().ПолноеИмя() = "Документ.бит_ЗаявкаНаРасходованиеСредств" Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыСтатуса  = СтатусыОбъекта(Источник.Ссылка);
	СтатусДоИзменения = ПараметрыСтатуса.Статус;
	
	ПараметрыУстановкиСтатуса = НовыеПараметрыУстановкиСтатуса();
	ПараметрыУстановкиСтатуса.РежимЗаписи          = РежимЗаписи;
	ПараметрыУстановкиСтатуса.ТекущийСтатус        = СтатусДоИзменения;
	ПараметрыУстановкиСтатуса.ДатаИзмененияСтатуса = ПараметрыСтатуса.Дата;
	ПараметрыУстановкиСтатуса.ПараметрыОплаты      = ПараметрыОплаты;
	Если ДополнительныеСвойства.Свойство("ВнешняяУстановкаСтатуса") Тогда
		ПараметрыУстановкиСтатуса.ВнешняяУстановкаСтатуса = ДополнительныеСвойства.ВнешняяУстановкаСтатуса;
	КонецЕсли;
	УстановитьСтатус(Источник, ПараметрыУстановкиСтатуса, КэшОпераций);
	
КонецПроцедуры

// Функция формирует информацию о статусе.
// 
// Параметры:
//  СтруктураПараметров - Структура
//                          Статус - СправочникСсылка.бит_СтатусыОбъектов.
//                          ДатаИзмененияСтатуса - Дата.
// 
// Возвращаемое значение:
//  Строка
// 
Функция СформироватьИнформациюСтатус(СтруктураПараметров)

	Результат = Строка(СтруктураПараметров.Статус);
	Если ЗначениеЗаполнено(СтруктураПараметров.ДатаИзмененияСтатуса) Тогда
		
		ТекстРезультат = НСтр("ru='%1 (изменен:%2)';en='%1 (changed:%2)'");
		Результат = СтрШаблон(ТекстРезультат, Результат, Формат(СтруктураПараметров.ДатаИзмененияСтатуса, "ДЛФ=DT"));
				
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСВизами

Процедура СоздатьИНазначитьВизыПоУмолчаниюСлужебный(НазначатьВизы = Истина, ВыводитьСообщения = Ложь)
	
	МодульВизирование = МодульВизированияПереопределяемый();
	
	// Создание виз и пользовательских действий.
	ТаблицаВиз = НоваяТаблицаЗаполненияВиз();
	МодульВизирование.ЗаполнитьВизыПоУмолчанию(ТаблицаВиз);
	
	ГруппаДействия = Справочники.бит_ПользовательскиеДействия.СоздатьГруппуДействий("Визирование.ДействияПоУмолчанию");
	ПараметрыВизы  = Новый Соответствие;
	
	Для каждого СтрокаВизы Из ТаблицаВиз Цикл
		Виза          = СоздатьВизу(СтрокаВизы.Наименование, СтрокаВизы.Литера);
		Действие      = Справочники.бит_ПользовательскиеДействия.СоздатьДействиеВизирования(Виза, ГруппаДействия);
		
		ОписаниеВизы  = Новый Структура("Виза, Действие", Виза, Действие);
		ПараметрыВизы.Вставить(СтрокаВизы.КлючВизы, ОписаниеВизы);
	КонецЦикла;
	
	// Создание алгоритмов.
	ДеревоАлгоримтов = НовоеДеревоЗаполненияАлгоритмов();
	МодульВизирование.ЗаполнитьАлгоритмыПоУмолчанию(ДеревоАлгоримтов);
	
	ТекстСообщения  = НСтр("ru='Алгоритмы визирования по умолчанию';en='Algorithms-of-sight by default'");
	ГруппаАлгоритмы = Справочники.бит_АлгоритмыПроцессов.СоздатьГруппуАлгоритмов(ТекстСообщения);
	
	ДатаНазначенияАлгоритма = Дата('19800101');
	НазначеныАлгоритмы      = Ложь;
	
	Для каждого СтрокаОбъекта Из ДеревоАлгоримтов.Строки Цикл
		ОбъектМетаданных       = СтрокаОбъекта.ОбъектКлючВизы;
		ПредставлениеАлгоритма = ОбъектМетаданных.Представление();
		Алгоритм               = Справочники.бит_АлгоритмыПроцессов.СоздатьАлгоритм(ПредставлениеАлгоритма,
																					ГруппаАлгоритмы,
																					Перечисления.бит_ВидыАлгоритмов.Визирование,
																					,
																					Истина);

		Если НЕ Справочники.бит_АлгоритмыПроцессов.АлгоритмГотовКРаботе(Алгоритм, Ложь) Тогда
			ПоследняяТочка = Справочники.бит_АлгоритмыПроцессов.НайтиПоследнююТочку(Алгоритм);
			
			Для каждого СтрокаВизы Из СтрокаОбъекта.Строки Цикл
				ОписаниеВизы = ПараметрыВизы[СтрокаВизы.ОбъектКлючВизы];
				Если Справочники.бит_АлгоритмыПроцессов.ДействиеВАлгоритме(Алгоритм, ОписаниеВизы.Действие) Тогда
					Продолжить;
				КонецЕсли;
				
				РеквизитыВизы  = Новый Структура("Наименование, ПользовательскоеДействие",
												Строка(ОписаниеВизы.Виза),
												ОписаниеВизы.Действие);
				Параметры      = Новый Структура("Реквизиты", РеквизитыВизы);
				ПоследняяТочка = бит_УправлениеПроцессами.ДобавитьТочкуАлгоритма(Алгоритм,
																	ПоследняяТочка,
																	Перечисления.бит_Направление.Вертикаль,
																	Перечисления.бит_ВидыТочекАлгоритмов.Действие,
																	0,
																	"Ошибки",
																	Параметры,
																	Истина);
			КонецЦикла;
			
			Справочники.бит_АлгоритмыПроцессов.ДобавитьТочкиЗавершения(Алгоритм);
			ГрафическаяСхема = Справочники.бит_АлгоритмыПроцессов.КартаМаршрутаПоТочкамАлгоритма(Алгоритм);
			АлгоритмОбъект   = Алгоритм.ПолучитьОбъект();
			АлгоритмОбъект.КартаМаршрута = Новый ХранилищеЗначения(ГрафическаяСхема, Новый СжатиеДанных(9));
			// АПК:1327-выкл Вызывается при обновлении ИБ в монопольном режиме.
			АлгоритмОбъект.Записать();
			// АПК:1327-вкл
		КонецЕсли;
		
		Если НазначатьВизы Тогда
			ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
			Если НЕ бит_ОбщегоНазначенияПовтИсп.МеханизмВизированияОтключен(ОбъектСистемы)
				И НетНазначенныхАлгоритмов(ОбъектСистемы) Тогда
				Справочники.бит_АлгоритмыПроцессов.НазначитьАлгоритм(Алгоритм, ОбъектСистемы, ДатаНазначенияАлгоритма);
				НазначеныАлгоритмы = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыводитьСообщения Тогда
		ТекстСообщения =  НСтр("ru='Созданы алгоритмы визирования по-умолчанию.';en='Default visa algorithms created.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 
	
	// Назначение алгоритмов.
	Если НазначеныАлгоритмы Тогда
		Если ВыводитьСообщения Тогда
			ТекстСообщения =  НСтр("ru='Назначены алгоритмы визирования по-умолчанию.';en='Default signing algorithms set'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Функция НоваяТаблицаЗаполненияВиз()
	
	ТипСтрока  = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));
	
	ТаблицаВиз = Новый ТаблицаЗначений;
	ТаблицаВиз.Колонки.Добавить("КлючВизы",     ТипСтрока);
	ТаблицаВиз.Колонки.Добавить("Наименование", ТипСтрока);
	ТаблицаВиз.Колонки.Добавить("Литера",       ТипСтрока);
	
	Возврат ТаблицаВиз;
	
КонецФункции

Функция НовоеДеревоЗаполненияАлгоритмов()
	
	ДеревоАлгоримтов = Новый ДеревоЗначений;
	ДеревоАлгоримтов.Колонки.Добавить("ОбъектКлючВизы");
	
	Возврат ДеревоАлгоримтов;
	
КонецФункции

// Создает элемент справочника визы.
// 
Функция СоздатьВизу(НаименованиеВизы, Литера)
	
	НайденныйСпр = Справочники.бит_Визы.НайтиПоНаименованию(НаименованиеВизы);
	Если НЕ ЗначениеЗаполнено(НайденныйСпр) Тогда
		СпрОбъект = Справочники.бит_Визы.СоздатьЭлемент();
		СпрОбъект.Вид = Перечисления.бит_ВидыВиз.Утверждающая;
		СпрОбъект.ВидСвязи     = Перечисления.бит_ВидыСвязиВиз.ФизическоеЛицо;
		СпрОбъект.ОбъектСвязи  = Справочники.ФизическиеЛица.ПустаяСсылка();
		СпрОбъект.Наименование = НаименованиеВизы;
		СпрОбъект.Литера       = Литера;
		СпрОбъект.РежимПечати  = Перечисления.бит_РежимПечатиВиз.Виза;
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.УстановитьНовыйКод();
		СпрОбъект.Записать();	
		ТекущаяВиза = СпрОбъект.Ссылка;
	Иначе
		ТекущаяВиза = НайденныйСпр;
	КонецЕсли; 
	
	Возврат ТекущаяВиза;
	
КонецФункции

// Выполняет заполнение виз согласно алгоритму визирования.
// 
// Параметры:
//  СтруктураПараметров  - Структура.
// 
Процедура ЗаполнитьВизыПоАлгоритму(СтруктураПараметров)

	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли; 

	// Получим алгоритм визирования, если необходимо.
	Если НЕ СтруктураПараметров.Свойство("Алгоритм") Тогда
		АлгоритмВизирования = бит_УправлениеПроцессами.АлгоритмВизированияОбъекта(СтруктураПараметров.ТекущийОбъект);
	Иначе
		АлгоритмВизирования = СтруктураПараметров.Алгоритм;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(АлгоритмВизирования) Тогда
		Возврат;
	КонецЕсли; 
	
	// Считаем набор виз, если необходимо.
	Если НЕ СтруктураПараметров.Свойство("НаборВизы") Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Объект",СтруктураПараметров.ТекущийОбъект.Ссылка);	
		НаборЗаписейВизы = ПрочитатьНаборВиз(Отбор);
		Если СтруктураПараметров.ОчищатьНабор Тогда
			НаборЗаписейВизы.Очистить();
		КонецЕсли; 
	Иначе	
		НаборЗаписейВизы = СтруктураПараметров.НаборВизы;
	КонецЕсли; 
	
    // Заполним визы согласно алгоритму визирования.
	СтруктураКонтекст = Новый Структура;
	СтруктураКонтекст.Вставить("ТекущийОбъект", СтруктураПараметров.ТекущийОбъект);
	СтруктураКонтекст.Вставить("Визы"         , НаборЗаписейВизы);
	
	КомментироватьВыполнение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("КомментироватьХодВыполненияАлгоритмовПроцессов",
									Пользователи.ТекущийПользователь());
		
	РежимСообщений = ?(КомментироватьВыполнение,"Все","Ошибки");				
	
	бит_УправлениеПроцессами.ВыполнитьАлгоритм(АлгоритмВизирования,СтруктураКонтекст,РежимСообщений);
	
	УпорядочитьВизыБезАнализаАлгоритма(НаборЗаписейВизы);
		
	Если СтруктураПараметров.ЗаписыватьНабор Тогда
		Попытка
			НаборЗаписейВизы.Записать();
		Исключение
			Событие = НСтр("ru = 'Ошибка заполенения виз по алгоритму'", ОбщегоНазначения.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(Событие
									,УровеньЖурналаРегистрации.Ошибка
									,
									,
									,
									ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры

Функция УпорядочитьВизыБезАнализаАлгоритма(НаборЗаписейВизы)
	
	ТаблицаВизы = НаборЗаписейВизы.Выгрузить();
	ТаблицаВизы.Колонки.Добавить("ПринятоРешение", Новый ОписаниеТипов("Булево"));
	
	Для каждого СтрокаВизы Из ТаблицаВизы Цикл
		СтрокаВизы.ПринятоРешение = ЗначениеЗаполнено(СтрокаВизы.Решение);
	КонецЦикла;
	ТаблицаВизы.Сортировать("ПринятоРешение Убыв, АктивнаяВиза Убыв, КодСортировки");
	
	СортировкаИзменена = Ложь;
	Порядок = 1;
	Для каждого СтрокаВизы Из ТаблицаВизы Цикл
		Если СтрокаВизы.КодСортировки <> Порядок Тогда
			СтрокаВизы.КодСортировки = Порядок;
			СортировкаИзменена       = Истина;
		КонецЕсли;
		Порядок = Порядок + 1;
	КонецЦикла;
	
	Если СортировкаИзменена Тогда
		НаборЗаписейВизы.Загрузить(ТаблицаВизы);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СтруктурноеПодразделение(ТекущийОбъект)
	
	СтруктурноеПодразделение = Новый Структура;
	Если ТекущийОбъект <> Неопределено Тогда
		МетаОбъект = ТекущийОбъект.Метаданные();
	
		ЕстьОрганизация = бит_РаботаСМетаданными.ЕстьРеквизит("Организация", МетаОбъект);
		ЕстьЦФО			= бит_РаботаСМетаданными.ЕстьРеквизит("ЦФО", МетаОбъект);
	
		Если ЕстьОрганизация Тогда
			СтруктурноеПодразделение.Вставить("Организация", ТекущийОбъект.Организация);
		КонецЕсли;
		Если ЕстьЦФО Тогда
			СтруктурноеПодразделение.Вставить("ЦФО", ТекущийОбъект.ЦФО);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктурноеПодразделение;
	
КонецФункции

Функция ПараметрыРабочегоВремени(СтруктурноеПодразделение, Период)
	
	ПустаяДата = '00010101';
	ПараметрыРабочегоВремени = Новый Структура;
	ПараметрыРабочегоВремени.Вставить("ИспользуетсяГрафик",          Ложь);
	ПараметрыРабочегоВремени.Вставить("ИспользуетсяКалендарь",       Ложь);
	ПараметрыРабочегоВремени.Вставить("УчитыватьПредпраздничныеДни", Ложь);
	ПараметрыРабочегоВремени.Вставить("НачалоРабочегоДня",           ПустаяДата);
	ПараметрыРабочегоВремени.Вставить("ВремяНачалаРабочегоДня",      0);
	ПараметрыРабочегоВремени.Вставить("ОкончаниеРабочегоДня",        ПустаяДата);
	ПараметрыРабочегоВремени.Вставить("ВремяОкончанияРабочегоДня",   0);
	ПараметрыРабочегоВремени.Вставить("РабочиеДни",                  Новый СписокЗначений);
	ПараметрыРабочегоВремени.Вставить("ПредпраздничныеДни",          Новый СписокЗначений);
	ПараметрыРабочегоВремени.Вставить("УчитыватьОбеденныйПерерыв",   Ложь);
	ПараметрыРабочегоВремени.Вставить("ВремяНачалаПерерыва",         0);
	ПараметрыРабочегоВремени.Вставить("ВремяОкончанияПерерыва",      0);
	
	ПараметрыРабочегоВремени.НачалоРабочегоДня =
		бит_НастройкиПрограммы.ВизированиеНачалоРабочегоДня(СтруктурноеПодразделение, Период);
	ПараметрыРабочегоВремени.ОкончаниеРабочегоДня =
		бит_НастройкиПрограммы.ВизированиеОкончаниеРабочегоДня(СтруктурноеПодразделение, Период);
	ПараметрыРабочегоВремени.ИспользуетсяГрафик = ЗначениеЗаполнено(ПараметрыРабочегоВремени.НачалоРабочегоДня)
													И ЗначениеЗаполнено(ПараметрыРабочегоВремени.ОкончаниеРабочегоДня);
	ПараметрыРабочегоВремени.ВремяНачалаРабочегоДня = ПараметрыРабочегоВремени.НачалоРабочегоДня
														- НачалоДня(ПараметрыРабочегоВремени.НачалоРабочегоДня);
	ПараметрыРабочегоВремени.ВремяОкончанияРабочегоДня = ПараметрыРабочегоВремени.ОкончаниеРабочегоДня
														- НачалоДня(ПараметрыРабочегоВремени.ОкончаниеРабочегоДня);
	Если ПараметрыРабочегоВремени.ИспользуетсяГрафик Тогда
		НачалоОбеденногоПерерыва    = бит_НастройкиПрограммы.НастройкаВизирования("бит_ВизированиеНачалоОбеденногоПерерыва",
										СтруктурноеПодразделение, Период, ПустаяДата);
		ОкончаниеОбеденногоПерерыва = бит_НастройкиПрограммы.НастройкаВизирования("бит_ВизированиеОкончаниеОбеденногоПерерыва",
										СтруктурноеПодразделение, Период, ПустаяДата);
		Если ЗначениеЗаполнено(НачалоОбеденногоПерерыва) И ЗначениеЗаполнено(ОкончаниеОбеденногоПерерыва) Тогда
			ПараметрыРабочегоВремени.УчитыватьОбеденныйПерерыв = Истина;
			ПараметрыРабочегоВремени.ВремяНачалаПерерыва    = НачалоОбеденногоПерерыва - НачалоДня(НачалоОбеденногоПерерыва);
			ПараметрыРабочегоВремени.ВремяОкончанияПерерыва =
				ОкончаниеОбеденногоПерерыва - НачалоДня(ОкончаниеОбеденногоПерерыва);
		КонецЕсли;
	КонецЕсли;
	
	РабочиеДни = РабочиеДниПодразделения(СтруктурноеПодразделение, Период);
	Если РабочиеДни <> Неопределено Тогда
		ПараметрыРабочегоВремени.ИспользуетсяКалендарь       = Истина;
		ПараметрыРабочегоВремени.РабочиеДни                  = РабочиеДни;
		ПараметрыРабочегоВремени.УчитыватьПредпраздничныеДни = бит_НастройкиПрограммы.НастройкаВизирования(
			"бит_ВизированиеУчитыватьПредпраздничныеДни", СтруктурноеПодразделение, Период, Ложь);
		Если ПараметрыРабочегоВремени.УчитыватьПредпраздничныеДни Тогда
			ПараметрыРабочегоВремени.ПредпраздничныеДни = РабочиеДниПодразделения(СтруктурноеПодразделение, Период, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыРабочегоВремени;
	
КонецФункции

Функция РабочиеДниПодразделения(СтруктурноеПодразделение, Период, ТолькоПредпраздничные = Ложь)
	
	ИспользоватьКалендарь = бит_НастройкиПрограммы.ИспользоватьКалендарьДляРасчетаКрайнейДаты(
								СтруктурноеПодразделение, Период);
	Календарь             = бит_НастройкиПрограммы.Календарь(СтруктурноеПодразделение, Период);

	Если НЕ ИспользоватьКалендарь
		ИЛИ НЕ ЗначениеЗаполнено(Календарь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РабочиеДни = Новый Массив;
	Если НЕ ТолькоПредпраздничные Тогда
		РабочиеДни.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	КонецЕсли;
	РабочиеДни.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеПроизводственногоКалендаря.Дата КАК РабочийДень
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &Календарь
	|	И ДанныеПроизводственногоКалендаря.ВидДня В(&РабочиеДни)
	|	И ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
	Запрос.УстановитьПараметр("Календарь"		, Календарь);
	Запрос.УстановитьПараметр("РабочиеДни"		, РабочиеДни);
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоДня(Период));
	Запрос.УстановитьПараметр("ОкончаниеПериода", ДобавитьМесяц(Период, 1));
	
	ТабилцаДней = Запрос.Выполнить().Выгрузить();
	РабочиеДни = Новый СписокЗначений;
	РабочиеДни.ЗагрузитьЗначения(ТабилцаДней.ВыгрузитьКолонку("РабочийДень"));
	
	Возврат РабочиеДни;
	
КонецФункции

Процедура СдвинутьСрокНаРабочийПериод(Период, ПараметрыРабочегоВремени, СчетчикВызова = 0)
	
	ГлубинаАнализаКалендаря = 30;	
	Если СчетчикВызова >= ГлубинаАнализаКалендаря Тогда
		Возврат;
	Иначе
		СчетчикВызова = СчетчикВызова + 1;
	КонецЕсли;
	
	Если ПараметрыРабочегоВремени.ИспользуетсяГрафик Тогда
		НачалоДняПериода          = НачалоДня(Период);
		ВремяПериода              = Период - НачалоДняПериода;
		ВремяНачалаРабочегоДня    = ПараметрыРабочегоВремени.ВремяНачалаРабочегоДня;
		ВремяОкончанияРабочегоДня = ВремяОкончанияРабочегоДня(Период, ПараметрыРабочегоВремени);
		
		Если ВремяПериода < ВремяНачалаРабочегоДня Тогда
			Период = НачалоДняПериода + ВремяНачалаРабочегоДня;
		ИначеЕсли ВремяПериода > ВремяОкончанияРабочегоДня Тогда
			Период = КонецДня(Период) + 1 + ВремяНачалаРабочегоДня;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыРабочегоВремени.ИспользуетсяКалендарь Тогда
		НачалоДняПериода = НачалоДня(Период);
		Если ПараметрыРабочегоВремени.РабочиеДни.НайтиПоЗначению(НачалоДняПериода) <> Неопределено Тогда
			Возврат;
		КонецЕсли;
			
		Период = КонецДня(Период) + 1;
		СдвинутьСрокНаРабочийПериод(Период, ПараметрыРабочегоВремени, СчетчикВызова);
	КонецЕсли;
	
КонецПроцедуры

Функция ВремяОкончанияРабочегоДня(Период, ПараметрыРабочегоВремени)
	
	ВремяОкончанияРабочегоДня = ПараметрыРабочегоВремени.ВремяОкончанияРабочегоДня;
	Если НЕ ПараметрыРабочегоВремени.УчитыватьПредпраздничныеДни
		ИЛИ НЕ ЗначениеЗаполнено(ВремяОкончанияРабочегоДня) Тогда
		Возврат ВремяОкончанияРабочегоДня;
	КонецЕсли;
	
	НачалоДняПериода = НачалоДня(Период);
	Если ПараметрыРабочегоВремени.ПредпраздничныеДни.НайтиПоЗначению(НачалоДняПериода) <> Неопределено Тогда
		ЧасВСекундах = 3600;
		ВремяОкончанияРабочегоДня = ВремяОкончанияРабочегоДня - ЧасВСекундах;
	КонецЕсли;
	
	Возврат ВремяОкончанияРабочегоДня;
	
КонецФункции

Процедура ДобавитьДниНаУстановку(Период, СекундНаУстановку, ПараметрыРабочегоВремени)
	
	СекундВДне     = 86400;
	КоличествоДней = Цел(СекундНаУстановку / СекундВДне);
	
	Если КоличествоДней = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РабочееВремяСдвигаемойДаты = Период - НачалоДня(Период);
	
	СекундНаУстановку = СекундНаУстановку % СекундВДне;
	Для Сч = 1 По КоличествоДней Цикл
		Период = КонецДня(Период) + 1;
		СдвинутьСрокНаРабочийПериод(Период, ПараметрыРабочегоВремени);
	КонецЦикла;
	
	Период = НачалоДня(Период) + РабочееВремяСдвигаемойДаты;
	СдвинутьСрокНаРабочийПериод(Период, ПараметрыРабочегоВремени);
	
КонецПроцедуры

Процедура ДобавитьВремяНаУстановку(СрокИсполнения, ВремяНаУстановку, ПараметрыРабочегоВремени)
	
	Если ВремяНаУстановку = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВремяОкончанияРабочегоДня = ВремяОкончанияРабочегоДня(СрокИсполнения, ПараметрыРабочегоВремени);
	ВремяПерерыва = ПараметрыРабочегоВремени.ВремяОкончанияПерерыва - ПараметрыРабочегоВремени.ВремяНачалаПерерыва;
	
	ОстатокРабочегоВремени = 0;
	Если ПараметрыРабочегоВремени.ИспользуетсяГрафик Тогда
		ТекущееВремя           = СрокИсполнения - НачалоДня(СрокИсполнения);
		ОстатокРабочегоВремени = ВремяОкончанияРабочегоДня - ТекущееВремя;
		Если ПараметрыРабочегоВремени.УчитыватьОбеденныйПерерыв Тогда
			Если ТекущееВремя < ПараметрыРабочегоВремени.ВремяНачалаПерерыва Тогда
				ОстатокРабочегоВремени = ОстатокРабочегоВремени - ВремяПерерыва;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ОстатокРабочегоВремени = КонецДня(СрокИсполнения) - СрокИсполнения;
	КонецЕсли;
	
	Если ВремяНаУстановку <= ОстатокРабочегоВремени Тогда
		СрокИсполнения = СрокИсполнения + ВремяНаУстановку;
		Если ПараметрыРабочегоВремени.УчитыватьОбеденныйПерерыв Тогда
			ТекущееВремя = СрокИсполнения - НачалоДня(СрокИсполнения);
			Если ТекущееВремя < ПараметрыРабочегоВремени.ВремяОкончанияПерерыва
				И ТекущееВремя > ПараметрыРабочегоВремени.ВремяНачалаПерерыва Тогда
				СрокИсполнения = СрокИсполнения + ВремяПерерыва;
			КонецЕсли;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ВремяНаУстановку = ВремяНаУстановку - ОстатокРабочегоВремени;
	СрокИсполнения   = КонецДня(СрокИсполнения) + 1;
	СдвинутьСрокНаРабочийПериод(СрокИсполнения, ПараметрыРабочегоВремени);
	ДобавитьВремяНаУстановку(СрокИсполнения, ВремяНаУстановку, ПараметрыРабочегоВремени);
	
КонецПроцедуры

// Удаляет из набора визы, подчиненные визам по которым не принято решение.
// 
// Параметры:
//  ТаблицаТочкиВизы  - ТаблицаЗначений.
//  НаборВизы         - РегистрСведенийНаборЗаписей.бит_УстановленныеВизы.
// 
Процедура УдалитьНижестоящиеВизы(ТаблицаТочкиВизы, НаборВизы)

	ВизыДляУдаления = Новый Массив;
	Для каждого СтрокаТаблицы Из ТаблицаТочкиВизы Цикл
		Если СтрокаТаблицы.ВходящиеТочки.Количество() = 0 Тогда
			// Начальные точки.
			НайтиВизыБезРешений(ВизыДляУдаления, СтрокаТаблицы, ТаблицаТочкиВизы);
		КонецЕсли;
	КонецЦикла;
	
	Если ВизыДляУдаления.Количество() > 0 Тогда
		УдалитьВизыПоМассиву(НаборВизы, ВизыДляУдаления);
	КонецЕсли;

КонецПроцедуры

// Удаляет из набора визы, указанные в массиве.
// 
// Параметры:
//  НаборВизы  - РегистрСведенийНаборЗаписей.бит_УстановленныеВизы.
//  МассивВиз  - Массив.
// 
Процедура УдалитьВизыПоМассиву(НаборВизы,МассивВиз)

	КоличествоНабор = НаборВизы.Количество();
	
	Для Сч = 1 По КоличествоНабор Цикл
		 // Индекс с конца.
		 ЧислоЙ = КоличествоНабор-Сч;
		 ЗаписьВизы = НаборВизы[ЧислоЙ];
		 Для Каждого Элемент Из МассивВиз Цикл
			// Поиск по ИД, т.к. одна виза может встречаться несколько раз.
		 	Если Элемент = ЗаписьВизы.ИД Тогда
				НаборВизы.Удалить(ЗаписьВизы);
				Прервать;
			КонецЕсли; 
		 КонецЦикла; // По массиву виз.
	КонецЦикла; // По набору виз. 

КонецПроцедуры

Функция ВизыУстановлены(Ссылка)
	
	Если Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВизыОбъекта.Виза КАК Виза
	|ИЗ
	|	РегистрСведений.бит_УстановленныеВизы КАК ВизыОбъекта
	|ГДЕ
	|	ВизыОбъекта.Объект = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура НайтиВизыБезРешений(ВизыДляУдаления, СтрокаВизы, ТаблицаТочкиВизы, Знач РодительБезРешения = Ложь, РезультатыПроверок = Неопределено)
	
	ТекущаяТочка = СтрокаВизы.Точка;
	
	Если РезультатыПроверок = Неопределено Тогда
		РезультатыПроверок = Новый Соответствие;
	Иначе
		Если РезультатыПроверок.Получить(ТекущаяТочка) <> Неопределено Тогда
			// Анализ данной точки уже выполнялся (цикличный алгоритм).
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаВизы.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Действие Тогда
		Если РодительБезРешения И ЗначениеЗаполнено(СтрокаВизы.Виза) Тогда
			// Т.к. визы могут повторяться для обработки необходим ИД.
			ВизыДляУдаления.Добавить(СтрокаВизы.ИД);
			СтрокаВизы.Виза = Справочники.бит_Визы.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаВизы.Решение) Тогда
			РодительБезРешения = Истина;
		КонецЕсли;
	КонецЕсли;
	
	РезультатыПроверок.Вставить(ТекущаяТочка, РодительБезРешения);
	
	Для каждого ИсходящаяТочка Из СтрокаВизы.ИсходящиеТочки Цикл
		СтрокаИсходящейТочки = ТаблицаТочкиВизы.Найти(ИсходящаяТочка.Точка, "Точка");
		
		Если СтрокаИсходящейТочки.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Слияние
			И РодительБезРешения Тогда
			
			ПропуститьПроверкуВетки = Ложь;
			// По текущей ветке не принято решение, однако решение может быть принято по другой ветке.
			Для каждого СтрокаВходящейТочкиСлияния Из СтрокаИсходящейТочки.ВходящиеТочки Цикл
				ВходящаяТочка     = СтрокаВходящейТочкиСлияния.Точка;
				РезультатПроверки = РезультатыПроверок.Получить(ВходящаяТочка);
				
				Если РезультатПроверки = Неопределено Тогда
					// Проверка заполнения решения по данной ветке не выполнялось.
					ПропуститьПроверкуВетки = Истина;
					Прервать;
				КонецЕсли;
				Если РезультатПроверки = Ложь Тогда
					// По данной ветке есть установленные решения.
					ПропуститьПроверкуВетки = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ПропуститьПроверкуВетки Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаИсходящейТочки <> Неопределено Тогда
			НайтиВизыБезРешений(ВизыДляУдаления, СтрокаИсходящейТочки, ТаблицаТочкиВизы, РодительБезРешения, РезультатыПроверок);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция АвтоустановкаРешенийНаборуВиз(ПараметрыКонтекста)
	
	РешенияУстановлены = Ложь;
	НаборВизы          = ПараметрыКонтекста.НаборВизы;
	
	Если НаборВизы.Количество() = 0 Тогда
		Возврат РешенияУстановлены;
	КонецЕсли;
	
	ТаблицаВиз = НаборВизы.Выгрузить();
	ТаблицаВиз.Колонки.Добавить("ИндексСтроки", Новый ОписаниеТипов("Число",
												Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	ТекущийИндекс = 0;
	Для каждого СтрокаВизы Из ТаблицаВиз Цикл
		СтрокаВизы.ИндексСтроки = ТекущийИндекс;
		ТекущийИндекс = ТекущийИндекс + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаВиз.Пользователь КАК Пользователь,
	|	ТаблицаВиз.Решение КАК Решение,
	|	ТаблицаВиз.КодСортировки КАК КодСортировки,
	|	ТаблицаВиз.Объект КАК Объект,
	|	ТаблицаВиз.Виза КАК Виза,
	|	ТаблицаВиз.ИндексСтроки КАК ИндексСтроки,
	|	ТаблицаВиз.ТочкаАлгоритма КАК ТочкаАлгоритма
	|ПОМЕСТИТЬ ТаблицаВиз
	|ИЗ
	|	&ТаблицаВиз КАК ТаблицаВиз";
	Запрос.УстановитьПараметр("ТаблицаВиз", ТаблицаВиз);
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаВиз.Объект КАК Объект,
	|	ТаблицаВиз.Виза КАК Виза,
	|	ТаблицаВиз.ИндексСтроки КАК ИндексСтроки
	|ПОМЕСТИТЬ ВизыДляАвтосогласования
	|ИЗ
	|	ТаблицаВиз КАК ТаблицаВиз
	|ГДЕ
	|	ТаблицаВиз.Решение = ЗНАЧЕНИЕ(Справочник.бит_ВидыРешенийСогласования.ПустаяСсылка)
	|	И НЕ ТаблицаВиз.ТочкаАлгоритма В (&СтекОчистки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВизыДляАвтосогласования.Объект КАК Объект,
	|	ВизыДляАвтосогласования.Виза КАК Виза
	|ИЗ
	|	ВизыДляАвтосогласования КАК ВизыДляАвтосогласования";
	Запрос.УстановитьПараметр("СтекОчистки", ПараметрыКонтекста.СтекОчистки); // Защита от зацикливания.
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		// Все визы согласованы.
		Возврат РешенияУстановлены;
	КонецЕсли;
	ВизыДляАвтосогласования = РезультатЗапроса.Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаВиз.Пользователь КАК Пользователь,
	|	МАКСИМУМ(ТаблицаВиз.КодСортировки) КАК КодСортировки
	|ПОМЕСТИТЬ ПоследниеСогласованныеПозиции
	|ИЗ
	|	ТаблицаВиз КАК ТаблицаВиз
	|ГДЕ
	|	ТаблицаВиз.Решение <> ЗНАЧЕНИЕ(Справочник.бит_ВидыРешенийСогласования.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВиз.Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеСогласованныеПозиции.Пользователь КАК Пользователь,
	|	МАКСИМУМ(ТаблицаВиз.Решение) КАК Решение
	|ПОМЕСТИТЬ ПоследниеРешения
	|ИЗ
	|	ПоследниеСогласованныеПозиции КАК ПоследниеСогласованныеПозиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВиз КАК ТаблицаВиз
	|		ПО ПоследниеСогласованныеПозиции.Пользователь = ТаблицаВиз.Пользователь
	|			И ПоследниеСогласованныеПозиции.КодСортировки = ТаблицаВиз.КодСортировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеСогласованныеПозиции.Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПоследниеСогласованныеПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеРешения.Пользователь КАК Пользователь,
	|	ПоследниеРешения.Решение КАК Решение
	|ИЗ
	|	ПоследниеРешения КАК ПоследниеРешения";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		// Нет согласованных позиций.
		Возврат РешенияУстановлены;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоследниеРешения.Пользователь КАК Пользователь,
	|	ПоследниеРешения.Решение КАК Решение
	|ПОМЕСТИТЬ РешенияАвтоустановки
	|ИЗ
	|	ПоследниеРешения КАК ПоследниеРешения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкиПользователей КАК НастройкиПользователей
	|		ПО ПоследниеРешения.Пользователь = НастройкиПользователей.Пользователь
	|			И (НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_НастройкиПользователей.АвтоустановкаВсехВизПриСогласовании))
	|			И (НастройкиПользователей.ЗначениеНастройки = ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПоследниеРешения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РешенияАвтоустановки.Пользователь КАК Пользователь
	|ИЗ
	|	РешенияАвтоустановки КАК РешенияАвтоустановки";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		// Нет согласующих с настройками автоустановки виз.
		Возврат РешенияУстановлены;
	КонецЕсли;
	ПользователиСАвтоустановкой = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	ТаблицаДоступа = ОтветственныеЗаУстановкуВиз(ВизыДляАвтосогласования, ПользователиСАвтоустановкой);
	Если ТаблицаДоступа.Количество() = 0 Тогда
		// Для пользователей нет доступных виз для автосогласования.
		Возврат РешенияУстановлены;
	КонецЕсли;
	
	АктивныеВизы = АктивныеВизы(ПараметрыКонтекста);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДоступа.Виза КАК Виза,
	|	ТаблицаДоступа.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ ДоступныеВизыПользователей
	|ИЗ
	|	&ТаблицаДоступа КАК ТаблицаДоступа
	|ГДЕ
	|	ТаблицаДоступа.Виза В (&АктивныеВизы)";
	Запрос.УстановитьПараметр("ТаблицаДоступа", ТаблицаДоступа);
	Запрос.УстановитьПараметр("АктивныеВизы"  , АктивныеВизы);
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВизыДляАвтосогласования.ИндексСтроки КАК ИндексСтроки,
	|	ДоступныеВизыПользователей.Виза КАК Виза,
	|	РешенияАвтоустановки.Пользователь КАК Пользователь,
	|	РешенияАвтоустановки.Решение КАК Решение
	|ИЗ
	|	ДоступныеВизыПользователей КАК ДоступныеВизыПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РешенияАвтоустановки КАК РешенияАвтоустановки
	|		ПО ДоступныеВизыПользователей.Ответственный = РешенияАвтоустановки.Пользователь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВизыДляАвтосогласования КАК ВизыДляАвтосогласования
	|		ПО ДоступныеВизыПользователей.Виза = ВизыДляАвтосогласования.Виза
	|ИТОГИ ПО
	|	ИндексСтроки";
	ВыборкаСтрок = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	АвтоСогласованныеТочки = Новый Массив;
	Пока ВыборкаСтрок.Следующий() Цикл
		ВыборкаРешений = ВыборкаСтрок.Выбрать();
		ВыборкаРешений.Следующий();
		
		ЗаписьВизы = НаборВизы[ВыборкаРешений.ИндексСтроки];
		ЗаписьВизы.Пользователь  = ВыборкаРешений.Пользователь;
		ЗаписьВизы.Решение       = ВыборкаРешений.Решение;
		ЗаписьВизы.Комментарий   = "Автосогласование";
		ЗаписьВизы.ДатаУстановки = ТекущаяДатаСеанса();
		
		АвтоСогласованныеТочки.Добавить(ЗаписьВизы.ТочкаАлгоритма);
		
		РешенияУстановлены       = Истина;
	КонецЦикла;
	
	ПараметрыПоследующихТочек = бит_УправлениеПроцессами.ТочкиДействияПослеТекущей(АвтоСогласованныеТочки,
																					ПараметрыКонтекста);
																					
	ТочкиОбработок = ПараметрыПоследующихТочек.ТочкиОбработок;
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(ТочкиОбработок);
	Справочники.бит_ПользовательскиеДействия.ВыполнитьТочкиОбработки(ТочкиОбработок, ПараметрыКонтекста);
	
	// Очистка решений по действиям цикличных процессов
	ОчищаемыеДействия = Новый СписокЗначений;
	ОчищаемыеДействия.ЗагрузитьЗначения(ПараметрыПоследующихТочек.ТочкиДействия);
	АвтоСогласованныеДействия = Новый СписокЗначений;
	АвтоСогласованныеДействия.ЗагрузитьЗначения(АвтоСогласованныеТочки);
	Если ОчищаемыеДействия.Количество() > 0 Тогда
		Для каждого СтрокаВизы Из НаборВизы Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаВизы.Решение) Тогда
				Продолжить;
			КонецЕсли;
			
			ТочкаАлгоритма = СтрокаВизы.ТочкаАлгоритма;
			
			Если ОчищаемыеДействия.НайтиПоЗначению(ТочкаАлгоритма) = Неопределено
				ИЛИ АвтоСогласованныеДействия.НайтиПоЗначению(ТочкаАлгоритма) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПараметрыКонтекста.СтекОчистки.НайтиПоЗначению(ТочкаАлгоритма) = Неопределено Тогда
				ПараметрыКонтекста.СтекОчистки.Добавить(ТочкаАлгоритма);
			КонецЕсли;
			
			СтрокаВизы.Пользователь  = Неопределено;
			СтрокаВизы.Решение       = Неопределено;
			СтрокаВизы.Комментарий   = "";
			СтрокаВизы.ДатаУстановки = Дата('00010101');
		КонецЦикла;
	КонецЕсли;
	
	Возврат РешенияУстановлены;
	
КонецФункции

Функция АктивныеВизы(ПараметрыКонтекста)
	
	Алгоритм    = ПараметрыКонтекста.Алгоритм;
	ТаблицаВизы = ПараметрыКонтекста.НаборВизы.Выгрузить();
	ТаблицаВизы.Колонки.Добавить("ДоступностьВизы", Новый ОписаниеТипов("Булево"));
    ТаблицаВизы.ЗаполнитьЗначения(Истина, "ДоступностьВизы");
	
	ТаблицаТочек = бит_УправлениеПроцессами.ОписаниеТочекАлгоритма(Алгоритм, ТаблицаВизы);
	УдалитьНижестоящиеВизы(ТаблицаТочек, ТаблицаВизы);
	
	ВыполнятьПоэтапно = бит_УправлениеПроцессами.ВыполнятьАлгоритмПоэтапно(Алгоритм);
	
	ДопПараметрыПроверкиУсловий = НовыеПараметрыПроверкиУсловия();
	ДопПараметрыПроверкиУсловий.ТекущийОбъект = ПараметрыКонтекста.ТекущийОбъект;
	ДопПараметрыПроверкиУсловий.Визы          = ТаблицаВизы;
	ДопПараметрыПроверкиУсловий.Алгоритм      = Алгоритм;
	
	бит_УправлениеПроцессами.ОпределитьДоступностьТочек(ТаблицаТочек, ВыполнятьПоэтапно, ДопПараметрыПроверкиУсловий);
	
	АктивныеВизы = Новый Массив;
	Для каждого СтрокаВизы Из ТаблицаТочек Цикл
		Если СтрокаВизы.АктивнаяВиза <> Истина Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаВизы.Виза) Тогда
			АктивныеВизы.Добавить(СтрокаВизы.Виза);
		КонецЕсли;
	КонецЦикла;
	Возврат АктивныеВизы;
	
КонецФункции

Функция НетНазначенныхАлгоритмов(ОбъектСистемы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НазначениеАлгоритмов.Алгоритм КАК Алгоритм
	|ИЗ
	|	РегистрСведений.бит_НазначениеАлгоритмов КАК НазначениеАлгоритмов
	|ГДЕ
	|	НазначениеАлгоритмов.ОбъектСистемы = &ОбъектСистемы";
	Запрос.УстановитьПараметр("ОбъектСистемы", ОбъектСистемы);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ОпередитьКрайниеСрокиИАктивность(ПараметрыКонтекста)
	
	Алгоритм          = ПараметрыКонтекста.Алгоритм;
	ВыполнятьПоэтапно = ПараметрыКонтекста.ВыполнятьПоэтапно;
	НаборВизы         = ПараметрыКонтекста.НаборВизы;
	ТекущийОбъект     = ПараметрыКонтекста.ТекущийОбъект;
	
	ТаблицаВизы = НаборВизы.Выгрузить();
	ТаблицаВизы.Колонки.Добавить("ДоступностьВизы", Новый ОписаниеТипов("Булево"));
	ТаблицаВизы.ЗаполнитьЗначения(Истина, "ДоступностьВизы");
	
	ТаблицаТочек = бит_УправлениеПроцессами.ОписаниеТочекАлгоритма(Алгоритм, ТаблицаВизы);
	
	Если ВыполнятьПоэтапно Тогда
		УдалитьНижестоящиеВизы(ТаблицаТочек, НаборВизы);
	КонецЕсли;
	
	ДопПараметрыПроверкиУсловий = НовыеПараметрыПроверкиУсловия();
	ДопПараметрыПроверкиУсловий.ТекущийОбъект = ТекущийОбъект;
	ДопПараметрыПроверкиУсловий.Визы          = НаборВизы;
	ДопПараметрыПроверкиУсловий.Алгоритм      = Алгоритм;
	
	бит_УправлениеПроцессами.ОпределитьДоступностьТочек(ТаблицаТочек, ВыполнятьПоэтапно, ДопПараметрыПроверкиУсловий);
	
	// Устанавливаем крайние даты и признак активности.
	Для каждого Запись Из НаборВизы Цикл
		СтрокаТаблицы = ТаблицаТочек.Найти(Запись.ИД,"ИД");
		Если СтрокаТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Запись.ВремяНаУстановку > 0 Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Решение) И НЕ СтрокаТаблицы.Доступность Тогда
				Запись.ДатаКрайняя = Дата("00010101");
			ИначеЕсли СтрокаТаблицы.Доступность И НЕ ЗначениеЗаполнено(Запись.ДатаКрайняя) Тогда
				ПараметрыРасчетаСрока = НовыеПараметрыРасчетаСрокаИсполнения();
				ПараметрыРасчетаСрока.ОбъектРасчета    = ТекущийОбъект;
				ПараметрыРасчетаСрока.ДатаОтсчета      = ТекущаяДатаСеанса();
				ПараметрыРасчетаСрока.ВремяНаУстановку = Запись.ВремяНаУстановку;
				Запись.ДатаКрайняя = СрокИсполнения(ПараметрыРасчетаСрока);
			КонецЕсли;
		КонецЕсли;
		
		Если Запись.АктивнаяВиза <> СтрокаТаблицы.АктивнаяВиза Тогда
			Запись.АктивнаяВиза = СтрокаТаблицы.АктивнаяВиза;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПользовательскимиУсловиями

// Проверяет удовлетворяет ли объект визирования настройкам адресации роли. 
// Используется при формировании перечня ролевых виз.
// 
// Параметры:
//  ТекущийОбъект - ДокументСсылка, ДокументОбъект.
//  МетаОбъект    - ОбъектМетаданных.
//  Выборка       - ВыборкаИзРезультатаЗапроса.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПроверитьПринадлежностьОбъектаВизирования(ТекущийОбъект, МетаОбъект,  Выборка) 
	
	Для Сч = 1 По 3 Цикл
		
		АдресацияВыполнена = Ложь;
		
		ИмяРеквизита    = Выборка["ИмяВида_" + Сч];
		ОбъектАдресации = Выборка["ОбъектАдресации_" + Сч];
		
		Если НЕ ЗначениеЗаполнено(ИмяРеквизита) Тогда
			АдресацияВыполнена = Истина;
			Продолжить;
		КонецЕсли;
			
		СпособПроверки = Выборка["СпособПроверки_" + Сч];
		Если НЕ ЗначениеЗаполнено(СпособПроверки) Тогда
			СпособПроверки = Перечисления.бит_СпособыПроверкиПринадлежностиОбъектаАдресации.Шапка;
		КонецЕсли;
		
		ПроверятьШапку    = Ложь;
		ПроверятьТабЧасть = Ложь;
		Если СпособПроверки = Перечисления.бит_СпособыПроверкиПринадлежностиОбъектаАдресации.ШапкаТабличныеЧасти Тогда
			ПроверятьШапку    = Истина;
			ПроверятьТабЧасть = Истина;
		ИначеЕсли СпособПроверки = Перечисления.бит_СпособыПроверкиПринадлежностиОбъектаАдресации.Шапка Тогда
			ПроверятьШапку    = Истина;
		ИначеЕсли СпособПроверки = Перечисления.бит_СпособыПроверкиПринадлежностиОбъектаАдресации.ТабличныеЧасти Тогда
			ПроверятьТабЧасть = Истина;
		КонецЕсли;
		
		Если ПроверятьШапку Тогда
			Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, МетаОбъект) Тогда
				// Проверка в реквизитах шапки.
				ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект, ИмяРеквизита);
				Если ЗначениеРеквизита = ОбъектАдресации Тогда
					АдресацияВыполнена = Истина;
					Продолжить;
				КонецЕсли;
			Иначе
				// Проверка в дополнительных реквизитах и сведениях.
				ЗначениеСвойства = УправлениеСвойствами.ЗначениеСвойства(ТекущийОбъект, ИмяРеквизита);
				Если ЗначениеСвойства = ОбъектАдресации Тогда
					АдресацияВыполнена = Истина;
					Продолжить;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
		
		Если ПроверятьТабЧасть Тогда
			ТабЧастьПодходит = Ложь;
			Для каждого МетаТабЧасть Из МетаОбъект.ТабличныеЧасти Цикл
				Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти(ИмяРеквизита ,МетаОбъект ,МетаТабЧасть.Имя) Тогда
					СтрОтбор = Новый Структура(ИмяРеквизита, ОбъектАдресации);
					ТЧ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект, МетаТабЧасть.Имя).Выгрузить();
					МассивСтрок = ТЧ.НайтиСтроки(СтрОтбор);
					ТабЧастьПодходит = ?(МассивСтрок.Количество() > 0, Истина, Ложь);
					Если ТабЧастьПодходит Тогда
						Прервать;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
			Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
				ИмяОбъекта = МетаОбъект.Имя; 
				Если ИмяОбъекта = "бит_кзн_ЗаявкаНаРасходованиеСредств" 
					ИЛИ ИмяОбъекта = "бит_кзн_ПланируемоеПоступлениеДенежныхСредств" 
					ИЛИ ИмяОбъекта = "бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств" Тогда
					
					МодульВизирование = МодульВизированияПереопределяемый();
					// АПК:287-выкл вызывается только в ЕРП, УТ, КА.
					Если МодульВизирование.ПозицияСодержитЗначение(ТекущийОбъект, ИмяРеквизита, ОбъектАдресации) Тогда
					// АПК:287-вкл
						ТабЧастьПодходит = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если ТабЧастьПодходит Тогда
				АдресацияВыполнена = Истина;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ АдресацияВыполнена Тогда
			// Если не выполнились условия по шапке или табличной части, значит объект не удовлетворяет адресации.
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти