
#Область СлужебныйПрограммныйИнтерфейс

Функция СервисОтвязатьДокумент(Документ, ИдентификаторЭДО) Экспорт
	
	Возврат СервисВзаимодействияМПЭПД.СервисОтвязатьДокумент(Документ, ИдентификаторЭДО);
	
КонецФункции

Процедура ОтправитьСообщениеОПереадресовке(Знач Документ) Экспорт
	
	СервисВзаимодействияМПЭПД.ОтправитьСообщениеОПереадресовке(Документ);
	
КонецПроцедуры

Процедура ОтправитьСообщениеОЗаменеТС(Знач Документ) Экспорт
	
	СервисВзаимодействияМПЭПД.ОтправитьСообщениеОЗаменеТС(Документ);
	
КонецПроцедуры

Процедура СервисОтправитьУведомления(ИдентификаторЭДО, ПараметрыОперации) Экспорт
	
	СервисОтправитьУведомления(ИдентификаторЭДО, ПараметрыОперации);

КонецПроцедуры

Функция ОжидатьФоновоеЗадание(Знач ИмяФункции, Знач ПараметрыПроцедуры, Знач УникальныйИдентификатор) Экспорт
	
	Возврат СервисВзаимодействияМПЭПД.ОжидатьВыполнениеФоновойФункции(ИмяФункции, УникальныйИдентификатор, ПараметрыПроцедуры);
	
КонецФункции

Процедура УдалитьЗаписьПодключенныхМПЭПД(Знач ИдентификаторЭДО, Знач Идентификатор) Экспорт
	
	СервисВзаимодействияМПЭПД.УдалитьЗаписьПодключенныхМПЭПД(ИдентификаторЭДО, Идентификатор);
	
КонецПроцедуры

Функция НеобходимыеДанныеДляРегистрацииУчетнойЗаписи(Знач ИдентификаторЭДО) Экспорт
	
	Возврат СервисВзаимодействияМПЭПД.НеобходимыеДанныеДляРегистрацииУчетнойЗаписи(ИдентификаторЭДО);
	
КонецФункции

Функция СписокПодключенныхМП(Отборы = Неопределено, ВключаяНеактивные = Ложь, ВернутьМассив = Ложь) Экспорт
	
	Возврат СервисВзаимодействияМПЭПД.СписокПодключенныхМП(Отборы, ВключаяНеактивные, ВернутьМассив);
	
КонецФункции

Процедура СервисОтправитьНастройкиДополнительныхПолей(МассивНастроек) Экспорт
	
	СервисВзаимодействияМПЭПД.СервисОтправитьНастройкиДополнительныхПолей(МассивНастроек);
	
КонецПроцедуры

#КонецОбласти



