
#Область ОписаниеПеременных

&НаКлиенте
Перем мТекущийТипОбъекта; // Хранит текущий тип объекта

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	фЭтоТолстыйКлиент = Ложь;


    #Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда	 
  	фЭтоТолстыйКлиент = Истина;	 
    #КонецЕсли  
	
	Если фЭтоТолстыйКлиент Тогда
		
		ТипОбъекта = ТекущийОбъект.ПолучитьТипЗначенияОбъекта();
		
	КонецЕсли; 
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
		
	Если фОтказ Тогда
		Возврат;
	КонецЕсли;
	
	фЭтоТолстыйКлиент = Ложь;
    #Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда	 
  	фЭтоТолстыйКлиент = Истина;	 
    #КонецЕсли  
    Элементы.ТипОбъекта.Видимость = фЭтоТолстыйКлиент;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	мТекущийТипОбъекта = ТипОбъекта;
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если фЭтоТолстыйКлиент Тогда
		
		ТекущийОбъект.СохранитьТип(ТипОбъекта);
		
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписьюНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	
	ТипИзменен = ИзменениеТипаОбъекта();
	Если ТипИзменен Тогда
		мТекущийТипОбъекта = ТипОбъекта;
	Иначе
		ТипОбъекта = мТекущийТипОбъекта;
		Возврат;
	КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИзменениеТипаОбъекта()

	Отказ = Ложь;
	
	МассивТипов = ТипОбъекта.Типы();	
	Если МассивТипов.Количество() = 1 Тогда

		МетаОбъект = Метаданные.НайтиПоТипу(МассивТипов[0]);		  
		Если МетаОбъект <> Неопределено Тогда

			Объект.Наименование     = МетаОбъект.Синоним;
			Объект.ИмяОбъекта       = МетаОбъект.Имя;
			Объект.ИмяОбъектаПолное = МетаОбъект.ПолноеИмя();
			Объект.ВидОбъекта       = бит_УправлениеОбъектамиСистемы.ПолучитьВидОбъектаПоМетаданным(МетаОбъект);

		Иначе	

			ТекстСообщения = НСтр("ru='Не удалось найти объект метаданных, соответствующий выбранному типу.';
			 				    |en='Unable to find metadata object corresponding to the selected type.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
		КонецЕсли; 

	Иначе

		// Выбор хотя бы одного типа контролируется платформой в системном диалоге выбора типа,
		// следовательно, данная ветка соответствует выбору составного типа.
		ТекстСообщения = НСтр("ru='Выбор составного типа недопустим.';
		 			   |en='Selecting the composite type is invalid.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			   
	КонецЕсли; 

	УправлениеЭлементамиФормы();
	
	Возврат НЕ Отказ;
	 
 КонецФункции
 
 // Процедура управляет видимостью/доступностью элементов формы. 
 //
 &НаСервере
 Процедура УправлениеЭлементамиФормы()
	 
	 ЭтоОбъектБИТ = ?(ВРег(Лев(Объект.ИмяОбъекта,4)) = ВРЕГ("бит_"), Истина, Ложь);
	 
	 ЭтоРБ  = ?(Объект.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии, Истина, Ложь);
	 ЭтоПС  = ?(Объект.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.ПланСчетов, Истина, Ложь);
	 ЭтоПВХ = ?(Объект.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.ПланВидовХарактеристик, Истина, Ложь);
	 
	 Элементы.ГруппаЗаголовки.Видимость = ЭтоОбъектБИТ И (ЭтоПВХ ИЛИ ЭтоПС ИЛИ ЭтоРБ);
	 Элементы.ЗаголовокЭлемента.Видимость = ЭтоОбъектБИТ И (ЭтоПВХ ИЛИ ЭтоПС);
	 
 КонецПроцедуры // УправлениеЭлементамиФормы()
 
#КонецОбласти

