////////////////////////////////////////////////////////////////////////////////
// Модуль содержит процедуры/функции подсистемы Бюджетирования доступные на клиенте.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСГрафамиРасчет

// Выполняет расчет зависимых формул
//
// Параметры:
//  ТабДокДанные	 - ТабличныйДокумент. 
//  ИмяОбласти		 - Строка - Имя области макета.
//  СписокСмежности	 - Структура - см. СписокСмежности. 
// 
// Возвращаемое значение:
//   Булево - Истина, если все расчеты выполнены. 
//
Функция РассчитатьЗависимыеФормулы(ТабДокДанные, ИмяОбласти, СписокСмежности = Неопределено) Экспорт

	Если СписокСмежности = Неопределено Тогда
		СписокСмежности = бит_БюджетированиеКлиентСервер.СписокСмежности(ТабДокДанные);
	КонецЕсли;
	Последовательность = Новый Массив();
	МаршрутЦикла 	   = Новый Массив();
	СтатусыВершин 	   = Новый Соответствие();
	ЕстьЦикл 		   = бит_БюджетированиеКлиентСервер.ПоискПоследовательностиРасчета(ИмяОбласти, СписокСмежности, 
							Последовательность, МаршрутЦикла, СтатусыВершин);
	СтатусыВершин 	   = Неопределено; // Освобождение памяти, соответствие может быть очень тяжелым.
	Результат = УдалосьРассчитатьПоследовательностьФормул(ТабДокДанные, МаршрутЦикла, Последовательность, ЕстьЦикл);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

// Функция - Пользовательское представление формулы
//
// Параметры:
//  ТабДокДанные - 	ТабличныйДокумент - данные таблицы.
//  Формула		 - 	Строка - формула.
// 
// Возвращаемое значение:
//  ФормулаПредставление - Строка.
//
Функция ПользовательскоеПредставлениеФормулы(ТабДокДанные, Формула) Экспорт
	
	ФормулаПредставление = Формула;
	
	МассивАргументы = бит_СтрокиКлиентСервер.РазобратьФормулу(Формула);
	Для Каждого Арг Из МассивАргументы Цикл
		
		ОблАрг = ТабДокДанные.Области.Найти(Арг);
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблАрг) Тогда
			
			ИмяАльт = бит_БюджетированиеКлиентСервер.ПользовательскоеПредставлениеОбласти(ОблАрг);
			ФормулаПредставление = СтрЗаменить(ФормулаПредставление, ОблАрг.Имя, ИмяАльт);
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат ФормулаПредставление;
	
КонецФункции

// Процедура выделяет аргументы формулы, на которой установлен курсор. 
// 
// Параметры:
//  ТабДокДанные - ТабличныйДокумент
//  Формула - Строка.
//  ВыделенныеОбласти - СписокЗначений.
// 
Процедура ВыделитьАргументыФормулы(ТабДокДанные, Формула, ВыделенныеОбласти, вхЦветАргументов = Неопределено) Экспорт
	
	Если вхЦветАргументов = Неопределено Тогда
		ЦветАргументов = WebЦвета.ДымчатоБелый;		
	Иначе	
		ЦветАргументов = вхЦветАргументов;		
	КонецЕсли; 
	
	МассивАргументы = бит_СтрокиКлиентСервер.РазобратьФормулу(Формула);
	Для Каждого Арг Из МассивАргументы Цикл
		ОблАрг = ТабДокДанные.Области.Найти(Арг);
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблАрг) Тогда
			ЛинияВыделения = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2,0);
			#Если НЕ ВебКлиент Тогда
				ОблАрг.Обвести(ЛинияВыделения,ЛинияВыделения,ЛинияВыделения,ЛинияВыделения);
			#КонецЕсли
			ОблАрг.Узор = ТипУзораТабличногоДокумента.Узор8;
			ОблАрг.ЦветУзора = ЦветАргументов;
			ОблАрг.ЦветРамки = WebЦвета.Черный;
			ВыделенныеОбласти.Добавить(Арг);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

// Процедура заполняет проценты равномерно по профилю. 
//
Процедура РавномерныйПрофиль(ТаблицаПрофиль) Экспорт

	Если ТаблицаПрофиль.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Коэффициенты = Новый Массив; 
	Для каждого СтрокаТаблицы Из ТаблицаПрофиль Цикл
		Коэффициенты.Добавить(1);
	КонецЦикла; 
	
	Коэффициенты = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
						100, Коэффициенты, 3);
	Индекс = 0;				
	Для каждого СтрокаТаблицы Из ТаблицаПрофиль Цикл
		СтрокаТаблицы.Процент = Коэффициенты[Индекс];
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВеделитьОбласть(ДокументРезультат, Области) Экспорт

	Для каждого Элемент Из Области Цикл
		Область = ДокументРезультат.Области.Найти(Элемент.Значение);
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Область)  Тогда
			ЛинияВыделения = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,3,0);
			#Если НЕ ВебКлиент Тогда
				Область.Обвести(ЛинияВыделения,ЛинияВыделения,ЛинияВыделения,ЛинияВыделения);
			#КонецЕсли
			Область.ЦветРамки = WebЦвета.Золотой;
		КонецЕсли; 
	КонецЦикла; 	

КонецПроцедуры

Функция ИмяВторойЯчейки(вхИмя) Экспорт
	
	Префикс = ПрефиксВторогоРесурса(Лев(вхИмя, 1));
	Имя = Префикс+Сред(вхИмя,2);
	
	Возврат Имя;
	
КонецФункции

Функция ПолучитьФормулуИзПредставления(ТабДокДанные, вхПредставлениеФормулы) Экспорт
	
	ПредставлениеФормулы = СтрЗаменить(вхПредставлениеФормулы, "[[", "[");
	ПредставлениеФормулы = СтрЗаменить(ПредставлениеФормулы, "]]", "]");	
	
	Формула = ПредставлениеФормулы;
	
	МассивАргументы = бит_СтрокиКлиентСервер.РазобратьФормулу(ПредставлениеФормулы);
	Для Каждого Арг Из МассивАргументы Цикл
		
		Если НЕ ЗначениеЗаполнено(Арг) Тогда		
			Продолжить;		
		КонецЕсли; 
		
		ИмяОбл = ТабДокДанные.Область(Арг).Имя;
		Формула = СтрЗаменить(Формула, Арг, ИмяОбл);
				
	КонецЦикла;	
	
	Возврат Формула;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция определяет префикс второго, связанного со строкой ресурса.
// 
// Параметры:
//  вхПрефикс - Строка
// 
// Возвращаемое значение:
//  Префикс - Строка.
// 
Функция ПрефиксВторогоРесурса(вхПрефикс)

	Если вхПрефикс = "К" Тогда	
		Префикс = "С";		
	Иначе		
		Префикс = "К";	
	КонецЕсли;

	Возврат Префикс;
	
КонецФункции

// Функция выполняет вычисление формулы в дереве.
// 
// Параметры:
//  ТабДокДанные - ТабличныйДокумент
//  Обл - ТабличныйДокумент - Область, для которой производятся вычисления по формулам.
// 
// Возвращаемое значение:
//  Рез - Число.
// 
Функция РассчитатьФормулу(ТабДокДанные, Обл)
	
	Рез = 0;
	СтрФормула = Обл.Расшифровка.Формула;
	Если НЕ ПустаяСтрока(СтрФормула) Тогда
		Арг = Новый Структура;
		Для каждого ИмяАрг Из Обл.Расшифровка.Аргументы Цикл
			ОблАрг = ТабДокДанные.Область(ИмяАрг);
			Если ОблАрг.Расшифровка.Вид = "Значение"
				ИЛИ ОблАрг.Расшифровка.Вид = "Формула" Тогда
				
				ЗнАрг = ОблАрг.Значение;
			Иначе
				ЗнАрг = 0;
			КонецЕсли; 
			СтрФормула = СтрЗаменить(СтрФормула, "["+ИмяАрг+"]", Формат(ЗнАрг,"ЧРД=.; ЧН=0; ЧГ="));
		КонецЦикла;
		
		Попытка
			Рез = Вычислить(СтрФормула);
		Исключение
			Рез = 0;	 
		КонецПопытки;
		Обл.Значение = Рез;
	КонецЕсли; 
	
	Возврат Рез;
	
КонецФункции

Функция УдалосьРассчитатьПоследовательностьФормул(ТабДокДанные, МаршрутЦикла, Последовательность, ЕстьЦикл)		
			
	Результат = Ложь;
	
	Если ЕстьЦикл Тогда
		ТекстСообщения = бит_БюджетированиеКлиентСервер.ТекстСообщенияОЦиклическихСсылках(МаршрутЦикла, ТабДокДанные);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		Сч = Последовательность.ВГраница();
		Пока Сч >= 0 Цикл
			Обл = ТабДокДанные.Область(Последовательность[Сч]);
			Расш = Обл.Расшифровка;
			Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Расш,"РасшифровкаЯчейкиФормыВвода") 
				И (Расш.Вид = "Формула" ИЛИ Расш.Вид = "Значение") Тогда
				
				РассчитатьФормулу(ТабДокДанные, Обл);
			КонецЕсли; 
			Сч = Сч - 1;
		КонецЦикла;
		Результат = Истина;	
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти
