#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

// Хранит валюту регламентированного учета
Перем мВалютаРегламентированногоУчета Экспорт;
// Хранит настройки БИТ
Перем мНастройкиПрограммы Экспорт;
// Хранит дополнительные измерения
Перем мИзмеренияДоп Экспорт;
// Хранит настройки дополнительных измерений.
Перем мНастройкиИзмерений Экспорт;

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Сумма = ЗаявкиНаЗатраты.Итог("СуммаСНДС");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	 // Проверка ручной корректировки
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	
	// Проверим допустимость проведения 
	ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
	
	Если ТекущийСтатус = Справочники.бит_СтатусыОбъектов.Закрыт
		ИЛИ ТекущийСтатус = Справочники.бит_СтатусыОбъектов.СводнаяЗаявкаНаЗатраты_Исполнена
		ИЛИ ТекущийСтатус = Справочники.бит_СтатусыОбъектов.СводнаяЗаявкаНаЗатраты_ЧастичноИсполнена Тогда
		
		ТекстСообщения = "Документ в статусе """ + СокрЛП(ТекущийСтатус) + """. Проведение невозможно.";
		Заголовок      = "Проведение документа: " + СокрЛП(Ссылка);
		ОбщегоНазначения.СообщитьПользователю(Заголовок);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		                          		
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	ТаблицаЗаявки = СформироватьТаблицуЗаявокНаЗатраты();
	
	// Выполним движения
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаЗаявки,Отказ,Заголовок);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		// Установка статусов заявкам на затраты.
		ТаблицаЗаявок = ЗаявкиНаЗатраты.Выгрузить();
		ТаблицаЗаявок.Свернуть("ЗаявкаНаЗатраты");
		Для каждого СтрокаТаблицы Из ТаблицаЗаявок Цикл
		
			Если ЗначениеЗаполнено(СтрокаТаблицы.ЗаявкаНаЗатраты) Тогда
				
				ЗаявкаОб = СтрокаТаблицы.ЗаявкаНаЗатраты.ПолучитьОбъект();
				бит_ВизированиеСервер.УстановитьСтатус(ЗаявкаОб);
					
			КонецЕсли; 
		
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
	// Проверим допустимость отмены проведения 
	ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
	
	Если ТекущийСтатус = Справочники.бит_СтатусыОбъектов.Закрыт
		ИЛИ ТекущийСтатус = Справочники.бит_СтатусыОбъектов.СводнаяЗаявкаНаЗатраты_Исполнена
		ИЛИ ТекущийСтатус = Справочники.бит_СтатусыОбъектов.СводнаяЗаявкаНаЗатраты_ЧастичноИсполнена Тогда
		
		ТекстСообщения = "Документ в статусе """ + СокрЛП(ТекущийСтатус) + """. Отмена проведения невозможна.";
		Заголовок      = "Отмена проведения документа: " + СокрЛП(Ссылка);
		ОбщегоНазначения.СообщитьПользователю(Заголовок);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		                          		
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		
		// Установка статусов заявкам на затраты.
		ТаблицаЗаявок = ЗаявкиНаЗатраты.Выгрузить();
		ТаблицаЗаявок.Свернуть("ЗаявкаНаЗатраты");
		Для каждого СтрокаТаблицы Из ТаблицаЗаявок Цикл
		
			Если ЗначениеЗаполнено(СтрокаТаблицы.ЗаявкаНаЗатраты) Тогда
				
				ЗаявкаОб = СтрокаТаблицы.ЗаявкаНаЗатраты.ПолучитьОбъект();
				ЗаявкаОб.ДополнительныеСвойства.Вставить("ОтменаСводнойЗаявки", Истина);
				бит_ВизированиеСервер.УстановитьСтатус(ЗаявкаОб);
					
			КонецЕсли; 
		
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_пз_ЗаявкаНаЗатраты") Тогда	
		ЗаполнитьПоОснованию(ДанныеЗаполнения);	
	Иначе	
		ЗаполнитьШапкуДокумента();		
	КонецЕсли;	
	
	ЭтотОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Желаемая дата поступления в шапке должна быть не меньше даты документа.
	Если ЗначениеЗаполнено(ЖелаемаяДатаПоступления) И ЖелаемаяДатаПоступления < НачалоДня(Дата) Тогда
		
		ТекстОшибки = НСтр("ru='Желаемая дата поступления должна быть не меньше даты документа %1';
						   |en='Desired arrival date should not be less than the date of the document %1'");
		ТекстСообщения = СтрШаблон(ТекстОшибки, Формат(Дата,"ДЛФ=DD"));		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ЖелаемаяДатаПоступления",, Отказ);
		
	КонецЕсли;
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

//  Процедура формирует структуру табличных частей документа.
//
Функция СформироватьТаблицуЗаявокНаЗатраты()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧЗаявкиНаЗатраты.Ссылка,
	               |	ТЧЗаявкиНаЗатраты.НомерСтроки,
	               |	ТЧЗаявкиНаЗатраты.СтатьяОборотов,
	               |	ТЧЗаявкиНаЗатраты.ЦФО,
	               |	ТЧЗаявкиНаЗатраты.Номенклатура,
	               |	ТЧЗаявкиНаЗатраты.Содержание,
	               |	ТЧЗаявкиНаЗатраты.Упаковка,
	               |	ТЧЗаявкиНаЗатраты.Количество,
	               |	ТЧЗаявкиНаЗатраты.Цена,
	               |	ТЧЗаявкиНаЗатраты.Сумма,
	               |	ТЧЗаявкиНаЗатраты.СтавкаНДС,
	               |	ТЧЗаявкиНаЗатраты.СуммаНДС,
	               |	ТЧЗаявкиНаЗатраты.СуммаСНДС,
	               |	ТЧЗаявкиНаЗатраты.ДатаПоступления,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_1,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_2,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_3,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_4,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_5,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_6,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_7,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_8,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_9,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_10,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_11,
	               |	ТЧЗаявкиНаЗатраты.Аналитика_12,
	               |	ТЧЗаявкиНаЗатраты.ЗаявкаНаЗатраты,
	               |	СводнаяЗаявкаНаЗатраты.ЖелаемаяДатаПоступления,
	               |	СводнаяЗаявкаНаЗатраты.Организация,
	               |	ТЧЗаявкиНаЗатраты.Характеристика
	               |ПОМЕСТИТЬ СводнаяЗаявка
	               |ИЗ
	               |	Документ.бит_пз_СводнаяЗаявкаНаЗатраты.ЗаявкиНаЗатраты КАК ТЧЗаявкиНаЗатраты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_пз_СводнаяЗаявкаНаЗатраты КАК СводнаяЗаявкаНаЗатраты
	               |		ПО ТЧЗаявкиНаЗатраты.Ссылка = СводнаяЗаявкаНаЗатраты.Ссылка
	               |ГДЕ
	               |	ТЧЗаявкиНаЗатраты.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СводнаяЗаявка.Ссылка,
	               |	СводнаяЗаявка.НомерСтроки,
	               |	СводнаяЗаявка.СтатьяОборотов,
	               |	СводнаяЗаявка.ЦФО,
	               |	СводнаяЗаявка.Номенклатура,
	               |	СводнаяЗаявка.Содержание,
	               |	СводнаяЗаявка.Упаковка,
	               |	СводнаяЗаявка.Количество,
	               |	СводнаяЗаявка.Цена,
	               |	СводнаяЗаявка.Сумма,
	               |	СводнаяЗаявка.СтавкаНДС,
	               |	СводнаяЗаявка.СуммаНДС,
	               |	СводнаяЗаявка.СуммаСНДС,
	               |	СводнаяЗаявка.ДатаПоступления,
	               |	СводнаяЗаявка.Аналитика_1,
	               |	СводнаяЗаявка.Аналитика_2,
	               |	СводнаяЗаявка.Аналитика_3,
	               |	СводнаяЗаявка.Аналитика_4,
	               |	СводнаяЗаявка.Аналитика_5,
	               |	СводнаяЗаявка.Аналитика_6,
	               |	СводнаяЗаявка.Аналитика_7,
	               |	СводнаяЗаявка.Аналитика_8,
	               |	СводнаяЗаявка.Аналитика_9,
	               |	СводнаяЗаявка.Аналитика_10,
	               |	СводнаяЗаявка.Аналитика_11,
	               |	СводнаяЗаявка.Аналитика_12,
	               |	СводнаяЗаявка.ЗаявкаНаЗатраты,
	               |	СводнаяЗаявка.ЖелаемаяДатаПоступления,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ПланируемыеЗатратыОстатки.КоличествоОстаток, 0) = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ЕСТЬNULL(ПланируемыеЗатратыОстатки.СуммаОстаток, 0) * СводнаяЗаявка.Количество / ЕСТЬNULL(ПланируемыеЗатратыОстатки.КоличествоОстаток, 0)
	               |	КОНЕЦ КАК СуммаСписания,
	               |	СводнаяЗаявка.Характеристика
	               |ИЗ
	               |	СводнаяЗаявка КАК СводнаяЗаявка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_пз_ПланируемыеЗатраты.Остатки КАК ПланируемыеЗатратыОстатки
	               |		ПО СводнаяЗаявка.ЗаявкаНаЗатраты = ПланируемыеЗатратыОстатки.ЗаявкаНаЗатраты
	               |			И СводнаяЗаявка.ЗаявкаНаЗатраты = ПланируемыеЗатратыОстатки.ДокументПланирования
	               |			И СводнаяЗаявка.Номенклатура = ПланируемыеЗатратыОстатки.Номенклатура
	               |			И СводнаяЗаявка.Организация = ПланируемыеЗатратыОстатки.Организация
	               |			И СводнаяЗаявка.Характеристика = ПланируемыеЗатратыОстатки.Характеристика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // СформироватьТаблицуТовары()

//  Процедура выполняет движения по регистрам.
// 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаЗаявки,Отказ,Заголовок)
	
	// Контроль остатков номенклатуры
	КонтрольОстатковНоменклатуры(Отказ);
	
	// Движение по регистру бит_пз_ПланируемыеЗатраты
	// Для закрытия заявки на затраты.
	ДвиженияПоРегиструПланируемыеЗатратыРасход(СтруктураШапкиДокумента,ТаблицаЗаявки);
	
	// Движение по регистру бит_пз_ПланируемыеЗатраты
	// Для последующего закрытия документом отражения факта.
	ДвиженияПоРегиструПланируемыеЗатратыПриход(СтруктураШапкиДокумента,ТаблицаЗаявки);
	
	ДвиженияПоРегиструПланируемыеЗатратыАналитика(СтруктураШапкиДокумента,ТаблицаЗаявки);
	
КонецПроцедуры // ДвиженияПоРегистрам()

//  Процедура осуществляет контроль количества номенклатуры по регистру бит_пз_ПланируемыеЗатраты.
// 
// Параметры:
//  Отказ                    - Булево
// 
Процедура КонтрольОстатковНоменклатуры(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СводнаяЗаявкаТЧ.Ссылка КАК СводнаяЗаявка,
	|	СводнаяЗаявкаНаЗатраты.Организация,
	|	СУММА(СводнаяЗаявкаТЧ.Количество) КАК Количество,
	|	СУММА(СводнаяЗаявкаТЧ.СуммаСНДС) КАК Сумма,
	|	СводнаяЗаявкаТЧ.ЗаявкаНаЗатраты,
	|	СводнаяЗаявкаТЧ.Номенклатура,
	|	СводнаяЗаявкаТЧ.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СводнаяЗаявкаТЧ.Характеристика
	|ПОМЕСТИТЬ СводныеЗаявки
	|ИЗ
	|	Документ.бит_пз_СводнаяЗаявкаНаЗатраты.ЗаявкиНаЗатраты КАК СводнаяЗаявкаТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_пз_СводнаяЗаявкаНаЗатраты КАК СводнаяЗаявкаНаЗатраты
	|		ПО СводнаяЗаявкаТЧ.Ссылка = СводнаяЗаявкаНаЗатраты.Ссылка
	|ГДЕ
	|	СводнаяЗаявкаТЧ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СводнаяЗаявкаТЧ.Ссылка,
	|	СводнаяЗаявкаНаЗатраты.Организация,
	|	СводнаяЗаявкаТЧ.ЗаявкаНаЗатраты,
	|	СводнаяЗаявкаТЧ.Номенклатура,
	|	СводнаяЗаявкаТЧ.Номенклатура.ЕдиницаИзмерения,
	|	СводнаяЗаявкаТЧ.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводныеЗаявки.СводнаяЗаявка,
	|	СводныеЗаявки.ЗаявкаНаЗатраты,
	|	СводныеЗаявки.Номенклатура,
	|	СУММА(СводныеЗаявки.Количество - ЕСТЬNULL(ПланируемыеЗатратыОстатки.КоличествоОстаток, 0)) КАК Превышение,
	|	СУММА(ЕСТЬNULL(ПланируемыеЗатратыОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	|	СводныеЗаявки.ЕдиницаИзмерения,
	|	СводныеЗаявки.Характеристика
	|ИЗ
	|	СводныеЗаявки КАК СводныеЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_пз_ПланируемыеЗатраты.Остатки КАК ПланируемыеЗатратыОстатки
	|		ПО СводныеЗаявки.ЗаявкаНаЗатраты = ПланируемыеЗатратыОстатки.ДокументПланирования
	|			И СводныеЗаявки.ЗаявкаНаЗатраты = ПланируемыеЗатратыОстатки.ЗаявкаНаЗатраты
	|			И СводныеЗаявки.Организация = ПланируемыеЗатратыОстатки.Организация
	|			И СводныеЗаявки.Номенклатура = ПланируемыеЗатратыОстатки.Номенклатура
	|			И СводныеЗаявки.Характеристика = ПланируемыеЗатратыОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	СводныеЗаявки.СводнаяЗаявка,
	|	СводныеЗаявки.ЗаявкаНаЗатраты,
	|	СводныеЗаявки.Номенклатура,
	|	СводныеЗаявки.ЕдиницаИзмерения,
	|	СводныеЗаявки.Характеристика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЗаявкаНаЗатраты = Документы.бит_пз_ЗаявкаНаЗатраты.ПустаяСсылка() Тогда		
			Продолжить;		
		КонецЕсли; 
		
		Если Выборка.Превышение > 0 ИЛИ Выборка.КоличествоОстаток = 0 Тогда			
			ТекстСообщения = НСтр("ru='Превышен остаток по номенклатуре: %1. Всего доступно %2 %3.';
								  |en='Exceeded residue nomenclature: %1. Total available %2 %3.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Номенклатура, Выборка.КоличествоОстаток, Выборка.ЕдиницаИзмерения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);			
			Отказ = Истина;			
		КонецЕсли; 
	
	КонецЦикла;
	
КонецПроцедуры // КонтрольОстатковНоменклатуры()

//  Процедура выполняет движения по регистру бит_пз_ПланируемыеЗатраты.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  ТаблицаЗаявки - ТаблицаЗначений
// 
Процедура ДвиженияПоРегиструПланируемыеЗатратыРасход(СтруктураШапкиДокумента,ТаблицаЗаявки)

	Для каждого НаборЗаписей Из Движения Цикл
	
		НаборЗаписей.Записывать = Истина;
	
	КонецЦикла; 

	НаборЗаписей = Движения.бит_пз_ПланируемыеЗатраты; 
	 
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Для каждого Строка Из ТаблицаЗаявки Цикл
		
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.Организация 			= СтруктураШапкиДокумента.Организация;
		СтрокаДвижений.ДокументПланирования = Строка.ЗаявкаНаЗатраты;
		СтрокаДвижений.ЗаявкаНаЗатраты 		= Строка.ЗаявкаНаЗатраты;
		СтрокаДвижений.Номенклатура			= Строка.Номенклатура;
		СтрокаДвижений.Характеристика		= Строка.Характеристика;
		СтрокаДвижений.Количество 			= Строка.Количество;
		СтрокаДвижений.Сумма 				= Строка.СуммаСписания;
		
	КонецЦикла; 
	
	НаборЗаписей.мПериод          = СтруктураШапкиДокумента.ЖелаемаяДатаПоступления;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;
	НаборЗаписей.ВыполнитьРасход();
	НаборЗаписей.Записать();

КонецПроцедуры // ДвиженияПоРегиструПланируемыеЗатратыРасход()

//  Процедура выполняет движения по регистру бит_пз_ПланируемыеЗатраты.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  ТаблицаЗаявки - ТаблицаЗначений
// 
Процедура ДвиженияПоРегиструПланируемыеЗатратыПриход(СтруктураШапкиДокумента,ТаблицаЗаявки)

	Для каждого НаборЗаписей Из Движения Цикл
	
		НаборЗаписей.Записывать = Истина;
	
	КонецЦикла; 

	НаборЗаписей = Движения.бит_пз_ПланируемыеЗатраты; 
	 
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Для каждого Строка Из ТаблицаЗаявки Цикл
		
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.Организация 			= СтруктураШапкиДокумента.Организация;
		СтрокаДвижений.ДокументПланирования = СтруктураШапкиДокумента.Ссылка;
		СтрокаДвижений.ЗаявкаНаЗатраты 		= Строка.ЗаявкаНаЗатраты;
		СтрокаДвижений.Номенклатура			= Строка.Номенклатура;
		СтрокаДвижений.Характеристика		= Строка.Характеристика;
		СтрокаДвижений.Количество 			= Строка.Количество;
		СтрокаДвижений.Сумма 				= Строка.СуммаСНДС;
		
	КонецЦикла; 
	
	НаборЗаписей.мПериод          = СтруктураШапкиДокумента.ЖелаемаяДатаПоступления;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;
	НаборЗаписей.ВыполнитьПриход();

КонецПроцедуры // ДвиженияПоРегиструПланируемыеЗатратыПриход()

//  Процедура выполняет движения по регистру бит_пз_ПланируемыеЗатратыАналитика.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  ТаблицаЗаявки - ТаблицаЗначений
// 
Процедура ДвиженияПоРегиструПланируемыеЗатратыАналитика(СтруктураШапкиДокумента,ТаблицаЗаявки)

	СтруктураКурсыВалют = бит_КурсыВалют.КурсыВалютДокумента(ЭтотОбъект,Дата,Новый Структура("Документ,Регл"));
	
	// Выполнение движений
	ТаблицаДвижений = Движения.бит_пз_ПланируемыеЗатратыАналитика.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Для каждого Строка Из ТаблицаЗаявки Цикл
		
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтруктураШапкиДокумента);
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, Строка);
		СтрокаДвижений.ЗаявкаНаЗатраты 		= Строка.ЗаявкаНаЗатраты;
		СтрокаДвижений.ДокументПланирования = СтруктураШапкиДокумента.Ссылка;
		СтрокаДвижений.Период 				= СтруктураШапкиДокумента.ЖелаемаяДатаПоступления;
		
		ИменаРеквизитов = Новый Массив;
		ИменаРеквизитов.Добавить("Сумма");
		ИменаРеквизитов.Добавить("СуммаСНДС");
		
		бит_КурсыВалют.ВыполнитьПересчетыДляОбъекта(СтрокаДвижений,ИменаРеквизитов,СтруктураКурсыВалют,СтруктураКурсыВалют.Документ);
		
	КонецЦикла; 
	
	Если ТаблицаДвижений.Количество() > 0 Тогда
	
		Движения.бит_пз_ПланируемыеЗатратыАналитика.Записывать = Истина;
		Движения.бит_пз_ПланируемыеЗатратыАналитика.мТаблицаДвижений = ТаблицаДвижений;
		Движения.бит_пз_ПланируемыеЗатратыАналитика.ДобавитьДвижение();
		
	КонецЕсли;	

КонецПроцедуры // ДвиженияПоРегиструПланируемыеЗатратыАналитика()

//  Процедура заполняет шапку документа.
// 
Процедура ЗаполнитьШапкуДокумента()
	
	Если Не ЗначениеЗаполнено(ВалютаДокумента) Тогда
		
		ВалютаДокумента    = мВалютаРегламентированногоУчета;
		КурсДокумента      = 1;
		КратностьДокумента = 1;			
		
	КонецЕсли; 
	
	Важность = Перечисления.бит_Важность.Средняя;
	
	// Заполнить реквизиты значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь());
												
КонецПроцедуры

//  Процедура обрабатывает изменение валюты документа
//
Процедура ИзменениеВалютыМодуль() Экспорт

	СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
	КурсДокумента      = СтрКурса.Курс;
	КратностьДокумента = СтрКурса.Кратность;

КонецПроцедуры // ИзменениеВалютыМодуль()

//  Процедура заполняет документ по документу основанию.
// 
Процедура ЗаполнитьПоОснованию(Основание)

	Исключения = "Дата,Номер,Проведен,ПометкаУдаления";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание,,Исключения);
	 
	ТаблицаОстатков = Документы.бит_пз_ЗаявкаНаЗатраты.ПолучитьОстаткиНоменклатуры(Основание);	 
	
	ЗаявкиНаЗатраты.Загрузить(ТаблицаОстатков);
	
КонецПроцедуры // ЗаполнитьПоОснованию()

#КонецОбласти 

#Область ОператорыОсновнойПрограммы

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

мНастройкиПрограммы = Новый Соответствие;

мИзмеренияДоп       = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
мНастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");

#КонецОбласти 

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли