//{{*******************************}}//
//{{  ОБРАБОТКА АРМ Заказы ЛТ 3.17 }}//
//{{*******************************}}//

Процедура ОбработатьСтатусЗаказа(ЗаказОбъект) Экспорт
	
	НовыйСтатус = Неопределено;
	
	Если не ЗначениеЗаполнено(ЗаказОбъект.бит_СтатусЗаказа) И ЗаписиВРегистреСтатусовОтсутствуют(ЗаказОбъект.Ссылка) Тогда
		НовыйСтатус = Перечисления.бит_СтатусыЗаказа.ОжидаетОплаты;
	ИначеЕсли ЗаказГотовКПредъявлению(ЗаказОбъект) Тогда                 
		НовыйСтатус = Перечисления.бит_СтатусыЗаказа.НаСкладеГотовКПредъявлению;
	КонецЕсли;       
	
	Если НовыйСтатус <> Неопределено Тогда  
		ЗаказОбъект.ДополнительныеСвойства.Вставить("ПропуститьОбработкуБитСтатусаЗаказа", Истина);
		ЗаказОбъект.бит_СтатусЗаказа = НовыйСтатус;                       
		ЗаписатьСтатусЗаказаВРегистр(ЗаказОбъект.Ссылка, НовыйСтатус);
	    ЗаказОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры   

Функция ЗаписиВРегистреСтатусовОтсутствуют(ЗаказКлиента)
	
	Запрос = Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	бит_СтатусЗаказаСрезПоследних.СтатусЗаказа КАК СтатусЗаказа
	                      |ИЗ
	                      |	РегистрСведений.бит_СтатусЗаказа.СрезПоследних(, ЗаказКлиента = &ЗаказКлиента) КАК бит_СтатусЗаказаСрезПоследних");
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции    

Процедура ЗаписатьСтатусЗаказаВРегистр(ЗаказКлиента, СтатусЗаказа) 
	
	МЗ = РегистрыСведений.бит_СтатусЗаказа.СоздатьМенеджерЗаписи();
	МЗ.Период = ТекущаяДатаСеанса();
	МЗ.ЗаказКлиента = ЗаказКлиента;  
	МЗ.СтатусЗаказа = СтатусЗаказа;
	МЗ.Записать();
	
КонецПроцедуры

Процедура УстановитьСтатусЗаказаПоОплате(РегистраторОплаты) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВЫРАЗИТЬ(РасчетыСКлиентамиОбороты.ОбъектРасчетов.Объект КАК Документ.ЗаказКлиента) КАК ЗаказКлиента
	                      |ПОМЕСТИТЬ втЗаказы
	                      |ИЗ
	                      |	РегистрНакопления.РасчетыСКлиентами.Обороты(, , Регистратор, ОбъектРасчетов.Объект ССЫЛКА Документ.ЗаказКлиента) КАК РасчетыСКлиентамиОбороты
	                      |ГДЕ
	                      |	РасчетыСКлиентамиОбороты.Регистратор = &Регистратор
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втЗаказы.ЗаказКлиента КАК ЗаказКлиента
	                      |ИЗ
	                      |	втЗаказы КАК втЗаказы
	                      |ГДЕ
	                      |	втЗаказы.ЗаказКлиента.бит_СтатусЗаказа В(&ДопустимыеСтатусы)");
	Запрос.УстановитьПараметр("Регистратор", РегистраторОплаты);        
	// Запишем масив статусов с которых возможен переход на статус "Поступила оплата". 
	// По умолчанию считаем что статусы не идут назад. 
	// Если идут, то реализуем отдельной задачей в подписке проведения и отмена проведения
	// Подходит только статус Ожидает оплаты. 
	мДопустимыеСтатусы = Новый Массив;
	мДопустимыеСтатусы.Добавить(Перечисления.бит_СтатусыЗаказа.ОжидаетОплаты);
	
	Запрос.УстановитьПараметр("ДопустимыеСтатусы", мДопустимыеСтатусы); 
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = Новый Структура("бит_СтатусЗаказа", Перечисления.бит_СтатусыЗаказа.ПоступилаОплата); 
	СтруктураДопПараметры = Новый Структура("ПропуститьОбработкуБитСтатусаЗаказа", Истина);
	Пока Выборка.Следующий() Цикл                                               
		бит_ОбщегоНазначенияСервер.ОбновитьРеквизитОбъекта(Выборка.ЗаказКлиента, СтруктураРеквизитов, СтруктураДопПараметры); 
		ЗаписатьСтатусЗаказаВРегистр(Выборка.ЗаказКлиента, СтруктураРеквизитов.бит_СтатусЗаказа);		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСтатусЗаказаПоЗаказуНаПроизводство(ЗаказНаПроизводство) Экспорт
	
	Если ЗаказНаПроизводство.Статус <> Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству
		И ЗаказНаПроизводство.Статус <> Перечисления.СтатусыЗаказовНаПроизводство.КПроизводству 
		ИЛИ ТипЗнч(ЗаказНаПроизводство.ДокументОснование) <> Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Возврат;
	КонецЕсли;
	
	Заказ  = ЗаказНаПроизводство.ДокументОснование;
	// Если заказ имеет более высокие статусы, то ничего не делаем.
	ЦелевойСтатус = Перечисления.бит_СтатусыЗаказа.ВПроцессеПроизводства;
	мЗаказов = Новый Массив;            
	мСтатусовИсключений = Новый Массив;                                            
	мСтатусовИсключений.Добавить(ЦелевойСтатус);   
	мСтатусовИсключений.Добавить(Перечисления.бит_СтатусыЗаказа.НаСкладеГотовКПредъявлению);
	мСтатусовИсключений.Добавить(Перечисления.бит_СтатусыЗаказа.ГотовКОтгрузке);
	мСтатусовИсключений.Добавить(Перечисления.бит_СтатусыЗаказа.Отгружено);
	мСтатусовИсключений.Добавить(Перечисления.бит_СтатусыЗаказа.ОтгруженоЧастично);
	Если мСтатусовИсключений.Найти(Заказ.бит_СтатусЗаказа) = Неопределено Тогда
		//установка статуса
		УстановитьСтатусЗаказа(Заказ, ЦелевойСтатус);
	КонецЕсли;

КонецПроцедуры

Функция ЗаказГотовКПредъявлению(Заказ)
	
	// Если заказ имеет более высокие статусы, то ничего не делаем.
	ЦелевойСтатус = Перечисления.бит_СтатусыЗаказа.НаСкладеГотовКПредъявлению;
	мЗаказов = Новый Массив;            
	мСтатусовИсключений = Новый Массив;                                            
	мСтатусовИсключений.Добавить(ЦелевойСтатус);     
	мСтатусовИсключений.Добавить(Перечисления.бит_СтатусыЗаказа.ГотовКОтгрузке);
	мСтатусовИсключений.Добавить(Перечисления.бит_СтатусыЗаказа.Отгружено);
	мСтатусовИсключений.Добавить(Перечисления.бит_СтатусыЗаказа.ОтгруженоЧастично);
	Если мСтатусовИсключений.Найти(Заказ.бит_СтатусЗаказа) <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	// --------
	ТЧ = Заказ.Товары.Выгрузить( , "бит_Изготовлено, бит_Проверено"); 
	ТЧ.Свернуть("бит_Изготовлено, бит_Проверено");
	// в ТЧ должна остаться только одна строка
	Возврат ТЧ.Количество() = 1 И ТЧ[0].бит_Изготовлено = Истина И ТЧ[0].бит_Проверено = Истина;

КонецФункции 

Процедура УстановитьГотовностьКОтгрузке(ПриходныйОрдерНаТовары) Экспорт   
	// В ПОТ должны быть назначения ,а в них заказы. соберем массив заказов
	ЦелевойСтатус = Перечисления.бит_СтатусыЗаказа.ГотовКОтгрузке;
	мЗаказов = Новый Массив;            
	мСтатусовИсключений = Новый Массив;                                            
	мСтатусовИсключений.Добавить(ЦелевойСтатус);
	мСтатусовИсключений.Добавить(Перечисления.бит_СтатусыЗаказа.Отгружено);
	мСтатусовИсключений.Добавить(Перечисления.бит_СтатусыЗаказа.ОтгруженоЧастично);
	Для каждого стр из ПриходныйОрдерНаТовары.Товары Цикл                                                                     
		Если не ЗначениеЗаполнено(стр.Назначение) Тогда
			Продолжить;
		КонецЕсли;
		Заказ = стр.Назначение.Заказ;
		Если ЗначениеЗаполнено(Заказ) 
			И ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказКлиента") 
			И мСтатусовИсключений.Найти(Заказ.бит_СтатусЗаказа) = Неопределено Тогда
				мЗаказов.Добавить(Заказ);
		КонецЕсли;
	КонецЦикла;
	
	Если мЗаказов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗапасыИПотребностиОбороты.Номенклатура КАК Номенклатура,
	                      |	ЗапасыИПотребностиОбороты.Назначение.Заказ КАК НазначениеЗаказ,
	                      |	ЗапасыИПотребностиОбороты.ВНаличииПриход КАК ВНаличииПриход
	                      |ПОМЕСТИТЬ ПришлоПриходником
	                      |ИЗ
	                      |	РегистрНакопления.ЗапасыИПотребности.Обороты(, , Регистратор, Назначение.Заказ В (&мЗаказов)) КАК ЗапасыИПотребностиОбороты
	                      |ГДЕ
	                      |	ЗапасыИПотребностиОбороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	РаспоряженияНаОтгрузкуОбороты.Распоряжение КАК Распоряжение,
	                      |	РаспоряженияНаОтгрузкуОбороты.Номенклатура КАК Номенклатура,
	                      |	РаспоряженияНаОтгрузкуОбороты.ЗаказаноОборот КАК ЗаказаноОборот
	                      |ПОМЕСТИТЬ ЗаказаноЗаказом
	                      |ИЗ
	                      |	РегистрНакопления.РаспоряженияНаОтгрузку.Обороты(, , Регистратор, Распоряжение В (&мЗаказов)) КАК РаспоряженияНаОтгрузкуОбороты
	                      |ГДЕ
	                      |	РаспоряженияНаОтгрузкуОбороты.Регистратор ССЫЛКА Документ.ЗаказКлиента
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЗаказаноЗаказом.Распоряжение КАК ЗаказКлиента,
	                      |	СУММА(ЗаказаноЗаказом.ЗаказаноОборот) КАК Заказано,
	                      |	СУММА(ЕСТЬNULL(ПришлоПриходником.ВНаличииПриход, 0)) КАК Пришло,
	                      |	ЗаказаноЗаказом.Номенклатура КАК Номенклатура
	                      |ИЗ
	                      |	ЗаказаноЗаказом КАК ЗаказаноЗаказом
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ПришлоПриходником КАК ПришлоПриходником
	                      |		ПО (ПришлоПриходником.НазначениеЗаказ = ЗаказаноЗаказом.Распоряжение)
	                      |			И ЗаказаноЗаказом.Номенклатура = ПришлоПриходником.Номенклатура
	                      |ГДЕ
	                      |	ЗаказаноЗаказом.Распоряжение В(&мЗаказов)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗаказаноЗаказом.Распоряжение,
	                      |	ЗаказаноЗаказом.Номенклатура
	                      |ИТОГИ
	                      |	СУММА(Заказано),
	                      |	СУММА(Пришло)
	                      |ПО
	                      |	ЗаказКлиента");
	Запрос.УстановитьПараметр("мЗаказов", мЗаказов);
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Результат.Следующий() Цикл
		Если Результат.Заказано = Результат.Пришло Тогда
			УстановитьСтатусЗаказа(Результат.ЗаказКлиента, ЦелевойСтатус);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИУстановитьСтатусОтгруженоЛибоЧастичноОтгружено(РасходныйОрдерНаТовары) Экспорт
	
	Распоряжение = Неопределено;
	Статус = Неопределено;
	ОпределитьРаспоряжениеИСтатус(РасходныйОрдерНаТовары, Распоряжение, Статус);
	Если Распоряжение = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	//установка статуса
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		УстановитьСтатусЗаказа(Распоряжение, Статус);
	КонецЕсли;
		
КонецПроцедуры

Процедура УстановитьСтатусЗаказа(ЗаказКлиента, Статус)
	
	СтруктураРеквизитов = Новый Структура("бит_СтатусЗаказа", Статус); 
	СтруктураДопПараметры = Новый Структура("ПропуститьОбработкуБитСтатусаЗаказа", Истина);
	
	бит_ОбщегоНазначенияСервер.ОбновитьРеквизитОбъекта(ЗаказКлиента, СтруктураРеквизитов, СтруктураДопПараметры); 
	ЗаписатьСтатусЗаказаВРегистр(ЗаказКлиента, Статус);		

КонецПроцедуры

// Возвращает заказ по ордеру, если по нему выполнены отгрузки
// Параметры:
//	РасходныйОрдерНаТовары - Ссылка на Расходный ордер на товары
//
Процедура ОпределитьРаспоряжениеИСтатус(РасходныйОрдерНаТовары, Распоряжение, Статус)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	РаспоряженияНаОтгрузкуОбороты.Распоряжение КАК Распоряжение,
		|	СУММА(РаспоряженияНаОтгрузкуОбороты.ЗаказаноОборот) КАК ЗаказаноОборот,
		|	РаспоряженияНаОтгрузкуОбороты.Регистратор КАК Регистратор,
		|	РаспоряженияНаОтгрузкуОбороты.Номенклатура КАК Номенклатура,
		|	РаспоряженияНаОтгрузкуОбороты.Характеристика КАК Характеристика,
		|	РаспоряженияНаОтгрузкуОбороты.Серия КАК Серия
		|ИЗ
		|	РегистрНакопления.РаспоряженияНаОтгрузку.Обороты(, , Регистратор, Распоряжение В ( &Распоряжение)) КАК РаспоряженияНаОтгрузкуОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспоряженияНаОтгрузкуОбороты.Распоряжение,
		|	РаспоряженияНаОтгрузкуОбороты.Регистратор,
		|	РаспоряженияНаОтгрузкуОбороты.Номенклатура,
		|	РаспоряженияНаОтгрузкуОбороты.Характеристика,
		|	РаспоряженияНаОтгрузкуОбороты.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКОтгрузкеОбороты.Регистратор КАК Регистратор,
		|	ТоварыКОтгрузкеОбороты.Номенклатура КАК Номенклатура,
		|	ТоварыКОтгрузкеОбороты.Характеристика КАК Характеристика,
		|	ТоварыКОтгрузкеОбороты.Серия КАК Серия,
		|	ТоварыКОтгрузкеОбороты.КОтгрузкеОборот КАК КОтгрузкеОборот,
		|	ТоварыКОтгрузкеОбороты.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеОбороты.Регистратор) = ТИП(документ.РасходныйОрдерНатовары)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТипРОТ
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Обороты(, , Регистратор, ДокументОтгрузки В ( &Распоряжение)) КАК ТоварыКОтгрузкеОбороты
		|");                                               
	мРаспоряжения = РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям.ВыгрузитьКолонку("Распоряжение"); 
	Запрос.УстановитьПараметр("Распоряжение", мРаспоряжения); 
	Выборка = Запрос.ВыполнитьПакет();
	РезультатЕстьВсеРТИУ = Выборка[0].Выгрузить();
	РезультатЕстьВсеРОТ	 = Выборка[1].Выгрузить();
	Если РезультатЕстьВсеРТИУ.Количество() > 0 И РезультатЕстьВсеРТИУ.Итог("ЗаказаноОборот") = 0
		И РезультатЕстьВсеРОТ.Количество() > 0 И РезультатЕстьВсеРОТ.Итог("КОтгрузкеОборот") = 0 Тогда
		Распоряжение = РезультатЕстьВсеРОТ[0].ДокументОтгрузки;
		Статус = Перечисления.бит_СтатусыЗаказа.Отгружено;
	ИначеЕсли РезультатЕстьВсеРОТ.Количество() > 0 И РезультатЕстьВсеРОТ.Итог("ТипРОТ") > 0 Тогда 
		Распоряжение = РезультатЕстьВсеРОТ[0].ДокументОтгрузки;
		Статус = Перечисления.бит_СтатусыЗаказа.ОтгруженоЧастично;
	КонецЕсли;
	
КонецПроцедуры
