
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ1.8] [ASHolyavko@1cbit.ru] [02.07.2025] +        
	
	Если ЭтаФорма.Элементы.Найти("бит_ВидРабот") = Неопределено Тогда             
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ВидРабот", Тип("ПолеФормы"), ЭтаФорма, ЭтаФорма.Элементы.Страницы);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_ВидРабот";
	КонецЕсли;
 	
	// }}ПервыйБИТ ЛистТребований [ЛТ1.8] [ASHolyavko@1cbit.ru] [02.07.2025] - 
	
КонецПроцедуры
