
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Счет 			   = Параметры.Счет;
	РазворотПоСубконто = Параметры.РазворотПоСубконто;
	
	ВыбранныеСубконто = Новый СписокЗначений;
	ТаблицаВыбранных  = РазворотПоСубконто.Выгрузить();
	ВыбранныеСубконто.ЗагрузитьЗначения(ТаблицаВыбранных.ВыгрузитьКолонку("Имя"));
	
	СписокВыбораСубконто = бит_БухгалтерскиеОтчетыСервер.СформироватьСписокСубконтоПоСчету(Счет, ВыбранныеСубконто);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(СписокВыбораСубконто);	
	
КонецПроцедуры // ОК()

#КонецОбласти
