#Область ОбработчикиСобытий

#Область Версия10

Функция ВалютыGET(Запрос)
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьPowerBI") Тогда
		Возврат Ответ();
	КонецЕсли;
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = бит_PowerBIПереопределяемый.Валюты(Запрос);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ПубликуемыеДанные);
	
КонецФункции

Функция ВидыЦФОGET(Запрос)
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьPowerBI") Тогда
		Возврат Ответ();
	КонецЕсли;
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = бит_PowerBIПереопределяемый.ВидыЦФО(Запрос);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ПубликуемыеДанные);
	
КонецФункции

Функция ОборотыПоБюджетамGET(Запрос)
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьPowerBI") Тогда
		Возврат Ответ();
	КонецЕсли;
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = бит_PowerBIПереопределяемый.ОборотыПоБюджетам(Запрос);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ПубликуемыеДанные);
	
КонецФункции

Функция СтатьиОборотовGET(Запрос)
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьPowerBI") Тогда
		Возврат Ответ();
	КонецЕсли;
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = бит_PowerBIПереопределяемый.СтатьиОборотов(Запрос);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ПубликуемыеДанные);
	
КонецФункции

Функция СценарииБюджетированияGET(Запрос)
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьPowerBI") Тогда
		Возврат Ответ();
	КонецЕсли;
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = бит_PowerBIПереопределяемый.СценарииБюджетирования(Запрос);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ПубликуемыеДанные);
	
КонецФункции

Функция ЦФОGET(Запрос)
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьPowerBI") Тогда
		Возврат Ответ();
	КонецЕсли;
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = бит_PowerBIПереопределяемый.ЦФО(Запрос);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ПубликуемыеДанные);
	
КонецФункции

Функция ОстаткиДСGET(Запрос)
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьPowerBI") Тогда
		Возврат Ответ();
	КонецЕсли;
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = бит_PowerBIПереопределяемый.ОстаткиДС(Запрос);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ПубликуемыеДанные);
	
КонецФункции

Функция ВалютыУчетаGET(Запрос)
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьPowerBI") Тогда
		Возврат Ответ();
	КонецЕсли;
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = бит_PowerBIПереопределяемый.ВалютыУчета(Запрос);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ПубликуемыеДанные);
	
КонецФункции

Функция СинонимыАналитикGET(Запрос)
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьPowerBI") Тогда
		Возврат Ответ();
	КонецЕсли;
	
	// Доступ к данным регулируется правом доступа к методу веб-сервиса.
	// Если у пользователя есть право на вызов веб-сервиса, то он получит все данные
	// без учета прав на эти данные.
	// Такая реализация необходима из-за того, что веб-сервис могут вызывать служебные пользователи:
	// для них назначать доступ к данным не получится из-за отстуствия профиля и невозможности настроить РЛС.
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = бит_PowerBIПереопределяемый.СинонимыАналитик(Запрос);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ(ПубликуемыеДанные);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Ответ(ДанныеJSON = Неопределено)
	
	Если ДанныеJSON = Неопределено Тогда
		Ответ = Новый HTTPСервисОтвет(405);
	Иначе	
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Accept-Charset", "utf-8");
		Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
		Ответ.Заголовки["Cache-Control"] = "no-cache";
		Ответ.УстановитьТелоИзСтроки(ДанныеJSON);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти