#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Параметры = ЭтаФорма.Параметры;
	Если Параметры.Свойство("ПараметрКоманды") Тогда
		//ЭтаФорма.ФормаПараметры.Отбор.Вставить("Ссылка", Параметры.ПараметрКоманды);
	КонецЕсли;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

Процедура ПриОпределенииНастроек(Настройки) Экспорт 
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Настройки.ДобавитьКомандыОтчетов = Истина;
	Настройки.Размещение.Добавить(Метаданные.Документы.бит_ПланОтгрузок);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры   

Функция ДобавитьКомандуОтчета(КомандыОтчетов, ИсточникВызова = "") Экспорт
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.бит_КонтрольВнеплановойОтгрузки) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		КомандаОтчет.Менеджер = Метаданные.Отчеты.бит_КонтрольВнеплановойОтгрузки.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = '(бит) Контроль внеплановой отгрузки'");
		КомандаОтчет.МножественныйВыбор = Истина;
		КомандаОтчет.Важность = "Обычное";
		КомандаОтчет.КлючВарианта = "Основной";
		Возврат КомандаОтчет;
		
	КонецЕсли;
	
	Возврат Неопределено;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецФункции  

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Основной'"); 
	НастройкиВарианта.ОпределитьНастройкиФормы = Истина;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
