
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтотОбъект.Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("СписокЗначений") Тогда
		СписокЗначений =  Параметры.СписокЗначений;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидОбъекта") Тогда
		ВидОбъекта = Параметры.ВидОбъекта;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокЗначенийВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ВыбранныйЭлемент = СписокЗначений[Значение];	
	Если ВыбранныйЭлемент = Неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	// Откроем форму списка выбранного ПВХ счетов.
	ИмяОбъекта = ВыбранныйЭлемент.Значение; 
	ПутьКФорме = ВидОбъекта + "." + ИмяОбъекта + ".ФормаСписка";
	ОткрытьФорму(ПутьКФорме);
	
КонецПроцедуры

#КонецОбласти
