#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьНастройкиПоУмолчаниюПриОбновлении3_1_54_2() Экспорт
	
	Менеджер = РегистрыСведений.бит_НастройкиДоступностиЭлементов.СоздатьМенеджерЗаписи();
	Менеджер.ОбъектСистемы                    = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(
													Метаданные.Справочники.бит_ВнутренниеДокументы.ПолноеИмя());
	Менеджер.Пользователь                     = Справочники.ГруппыПользователей.ВсеПользователи;
	Менеджер.ИмяЭлементаУправления            = "ФормаКомандаОтправитьНаСогласование";
	Менеджер.НеБлокироватьСостояниемДокумента = Истина;
	Менеджер.ВидЭлемента                      = Перечисления.бит_ВидыЭлементовУправления.КнопкаФормы;
	Менеджер.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли