
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "СводнаяТаблица");
	ПараметрыФормы.Вставить("ВыполнениеКоманды", Истина);
	
	ФормаОтчета = ПолучитьФорму("Отчет.бит_ФормаВводаБюджетаКомментарий.Форма", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор,
		ПараметрыВыполненияКоманды.Окно);
	
	КомпоновщикНастроек   = ФормаОтчета.Отчет.КомпоновщикНастроек;
	НастройкиКомпоновщика = ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек);
		
	ФормаОтчета.Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновщика);	
	ФормаОтчета.Отчет.ФормаВводаБюджетаСсылка = ПараметрКоманды;	
	ФормаОтчета.СкомпоноватьРезультат();	
	ФормаОтчета.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьНастройкиКомпоновщика(Знач КомпоновщикНастроек)
	
	Возврат КомпоновщикНастроек.ПолучитьНастройки();
	
КонецФункции

#КонецОбласти


