
#Область ПрограммныйИнтерфейс

#Область ПроцедурыИФункцииРаботыСУсловнымОформлением

// Функция формирует массив реквизитов статей оборотов - признаков учета,
// учитываемых при оформлении таблиц в качестве оформляемых полей.
//  
// Возвращаемое значение:
//   Массив.
// 
Функция СформироватьМассивРеквизитовСтатей() Экспорт

	МетаОбъект = Метаданные.Справочники.бит_СтатьиОборотов;
	
	// Массив реквизитов статей оборотов, учитываемых при оформлении таблиц
	// в качестве оформляемых полей.
	МассивРеквизитовСтатей = Новый Массив;
	
	МассивРеквизитовСтатей.Добавить("Количество");
	МассивРеквизитовСтатей.Добавить("Сумма");
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Учет_Проект", МетаОбъект) Тогда
		МассивРеквизитовСтатей.Добавить("Проект");
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Учет_БанковскийСчет", МетаОбъект) Тогда
		МассивРеквизитовСтатей.Добавить("БанковскийСчет");
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Учет_Контрагент", МетаОбъект) Тогда
		МассивРеквизитовСтатей.Добавить("Контрагент");
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Учет_ДоговорКонтрагента", МетаОбъект) Тогда
		МассивРеквизитовСтатей.Добавить("ДоговорКонтрагента");
	КонецЕсли;	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Учет_НоменклатурнаяГруппа", МетаОбъект) Тогда
		МассивРеквизитовСтатей.Добавить("НоменклатурнаяГруппа");
	КонецЕсли;
	
	МаксКол = бит_МеханизмДопИзмерений.ПолучитьМаксимальноеКоличествоДополнительныхИзмерений();
	Для н = 1 По МаксКол Цикл		
		МассивРеквизитовСтатей.Добавить("Аналитика_" + н);		
	КонецЦикла; 

	Возврат МассивРеквизитовСтатей;
	
КонецФункции // СформироватьМассивРеквизитовСтатей()

// Функция формирует массив реквизитов статей оборотов - признаков учета,
// учитываемых при оформлении таблиц в качестве оформляемых полей.
//  
// Возвращаемое значение:
//   Массив.
// 
Функция СформироватьМассивРеквизитовСтатейИмяТипа() Экспорт

	МетаОбъект = Метаданные.Справочники.бит_СтатьиОборотов;
	
	// Массив реквизитов статей оборотов, учитываемых при оформлении таблиц
	// в качестве оформляемых полей.
	МассивРеквизитовСтатей = Новый Массив;
	
	МаксКол = бит_МеханизмДопИзмерений.ПолучитьМаксимальноеКоличествоДополнительныхИзмерений();
	Для н = 1 По МаксКол Цикл		
		МассивРеквизитовСтатей.Добавить("Аналитика_" + н);		
	КонецЦикла; 

	Возврат МассивРеквизитовСтатей;
	
КонецФункции // СформироватьМассивРеквизитовСтатей()

// Процедура удаляет элементы условного оформления по представлению.
// 
// Параметры:
//  Представление 	   - Строка.
//  УсловноеОформление - УсловноеОформлениеКомпановкиДанных.
// 
Процедура УдалитьЭлементыОформленияПоПредставлению(Представление, УсловноеОформление) Экспорт

	КоличестоЭлементов = УсловноеОформление.Элементы.Количество();
	Если КоличестоЭлементов = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Для Сч = 1 По КоличестоЭлементов Цикл
		
		НомерЭл = КоличестоЭлементов - Сч;
		
		СтарыйЭлемент = УсловноеОформление.Элементы.Получить(НомерЭл);
		Если СтарыйЭлемент.Представление = Представление Тогда
			УсловноеОформление.Элементы.Удалить(СтарыйЭлемент);	
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементыОформленияПоПредставлению()

// Функция формирует простое условия условного оформления.
//  
// Параметры:
//	УсловиеЛевое  - Строка - левое условие.
//	УсловиеПравое - Любое значение - правое условие.
//	ВидСравненияУсловия - ВидСравненияКомпоновкиДанных - вид сравнения.
//
// Возвращаемое значение:
//   Структура.
//
Функция ПростоеУсловие(УсловиеЛевое, УсловиеПравое, ВидСравненияУсловия = Неопределено) Экспорт

	СтруктураУсловия = Новый Структура;
	СтруктураУсловия.Вставить("УсловиеЛевое" , УсловиеЛевое);
	СтруктураУсловия.Вставить("УсловиеПравое", УсловиеПравое);
	Если ВидСравненияУсловия <> Неопределено Тогда
		СтруктураУсловия.Вставить("ВидСравнения", ВидСравненияУсловия);
	КонецЕсли;
	
	Возврат СтруктураУсловия;
	
КонецФункции // ПростоеУсловие()

// Функция формирует простое условия условного оформления.
//  
// Параметры:
//	УсловиеЛевое  - Строка.
//	ВидСравненияУсловия - ВидСравненияКомпоновкиДанных - вид сравнения.
//
// Возвращаемое значение:
//   Структура.
//
Функция УсловиеНаЗаполнение(УсловиеЛевое, ВидСравненияУсловия) Экспорт

	СтруктураУсловия = Новый Структура;
	СтруктураУсловия.Вставить("УсловиеЛевое", УсловиеЛевое);
	СтруктураУсловия.Вставить("ВидСравнения", ВидСравненияУсловия);
		
	Возврат СтруктураУсловия;
	
КонецФункции // ПростоеУсловие()

// Процедура добавляет элемент условного оформления.
// 
// Параметры:
//  УсловноеОформление - УсловноеОформлениеКомпановкиДанных.
//  Представление  	   - Строка.
//  СтруктураУО 	   - Структура ("СтруктураОформления, СтруктураУсловия, МассивОформляемыхПолей").
//  Позиция			   - Число (Позиция, в которую необходимо добавить оформление. 
// 							Если = Неопределено, тогда добавляется в конец).
// 
Процедура ДобавитьЭлементУсловногоОформления(УсловноеОформление, Представление, СтруктураУО, Позиция = Неопределено) Экспорт

	// Раскроем структуру УО.
	СтруктураОформления 	= СтруктураУО.СтруктураОформления;
	СтруктураУсловия 		= СтруктураУО.СтруктураУсловия;
	МассивОформляемыхПолей 	= СтруктураУО.МассивОформляемыхПолей;
	
	// Новый элемент условного оформления.
	Если Позиция = Неопределено Тогда
	 	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	Иначе	
	    ЭлементУО = УсловноеОформление.Элементы.Вставить(Позиция);
	КонецЕсли;
	ЭлементУО.Представление = Представление;
	ЭлементУО.Использование = Истина;
	
	// Оформление. 	
	Для каждого КлЗн Из СтруктураОформления Цикл
		ЭлементУО.Оформление.УстановитьЗначениеПараметра(КлЗн.Ключ, КлЗн.Значение);
	КонецЦикла;	
	
	// Условие.
	Если ТипЗнч(СтруктураУсловия) = Тип("Массив") Тогда
		МассивУсловий = СтруктураУсловия;
	Иначе
		МассивУсловий = Новый Массив;
		МассивУсловий.Добавить(СтруктураУсловия);
	КонецЕсли;		
	Для Каждого СтрУсловия Из МассивУсловий Цикл		
		УсловиеУО 				 = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(СтрУсловия.УсловиеЛевое);
		Если СтрУсловия.Свойство("ВидСравнения") Тогда
			// По умолчанию: ВидСравненияКомпоновкиДанных.Равно.
			УсловиеУО.ВидСравнения = СтрУсловия.ВидСравнения;
		КонецЕсли;
		Если СтрУсловия.Свойство("УсловиеПравое") Тогда
			УсловиеУО.ПравоеЗначение = СтрУсловия.УсловиеПравое;
		КонецЕсли;
	КонецЦикла;
	
	// Оформляемые поля.	
	Для каждого ОфПоле Из МассивОформляемыхПолей Цикл
		ОформляемоеПоле 	 = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ОфПоле);
	КонецЦикла;
		
КонецПроцедуры

// Параметры условного оформления статей оборотов.
// 
// Возвращаемое значение:
//  Структура:
// 	 * Представление 	                 - Строка.
//	 * ПрефиксКонтейнера                 - Строка.
//	 * ПрефиксТаблицы                    - Строка.
//	 * Постфикс 	  	                 - Строка.
//	 * ИмяРеквизитаСтатья                - Строка.
//	 * ПоляОформления                    - Структура, Неопределено.
//	 * ИменаОформляемыхТаблиц            - Строка, Массив, Неопределено.
//	 * ОтметитьОбязательныеРазрезыСтатей - Булево.
//	 * УдалитьСтароеОформление           - Булево.
// 
Функция НовыеПараметрыОформленияСтатей() Экспорт

	ПараметрыОформления = Новый Структура;
	ПараметрыОформления.Вставить("Представление",                     "");
	ПараметрыОформления.Вставить("ПрефиксКонтейнера",                 "");
	ПараметрыОформления.Вставить("ПрефиксТаблицы",                    "");
	ПараметрыОформления.Вставить("Постфикс",                          "");
	ПараметрыОформления.Вставить("ИмяРеквизитаСтатья",                "СтатьяОборотов");
	ПараметрыОформления.Вставить("ПоляОформления",                    Неопределено);
	ПараметрыОформления.Вставить("ИменаОформляемыхТаблиц",            Неопределено);
	ПараметрыОформления.Вставить("ОтметитьОбязательныеРазрезыСтатей", Ложь);
	ПараметрыОформления.Вставить("УдалитьСтароеОформление",           Ложь);
	ПараметрыОформления.Вставить("ПараметрыУсловногоОформления",
		ПараметрыУсловногоОформленияНедоступныхПолейСтатейОборотов());
		
	Возврат ПараметрыОформления;
	
КонецФункции

// Параметры условного оформления для полей статей оборотов, по которым не ведется учет.
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПараметрыУсловногоОформленияНедоступныхПолейСтатейОборотов() Экспорт
	
	СтруктураОформления = Новый Структура;
	
	СтруктураОформления.Вставить("ЦветТекста",     бит_ОбщегоНазначенияПовтИсп.ЦветСтиля("ЦветНедоступногоТекста"));
	СтруктураОформления.Вставить("Текст",          НСтр("ru='<не требуется>'; en='<Not required>'"));
	СтруктураОформления.Вставить("ТолькоПросмотр", Истина);
	
	Возврат СтруктураОформления;
	
КонецФункции

// Процедура оформляет табличное поле по признакам учета статей оборотов.
//
// Параметры:
//  УсловноеОформление - УсловноеОформлениеКомпоновкиДанных.
//  СтатьиОборотов - Массив.
//  ПараметрыОформления	- Структура - см. НовыеПараметрыОформленияСтатей().
//
Процедура ОформитьТаблицуПоСтатьямОборотов(УсловноеОформление, СтатьиОборотов, ПараметрыОформления) Экспорт
	
	ВычисляемыеПараметры = ВычисляемыеПараметыПроедурУсловногоОформления(ПараметрыОформления);
	ДанныеСтатей         = ДанныеСтатейДляУсловногоОформления(СтатьиОборотов, ПараметрыОформления, ВычисляемыеПараметры);
	УстановитьТолькоПросмотрПолейПоСтатьямОборотов(УсловноеОформление, ПараметрыОформления, ДанныеСтатей, ВычисляемыеПараметры);
	УстановитьОтметкуНезаполненногоПолейПоСтатьямОборотов(УсловноеОформление, ПараметрыОформления, ДанныеСтатей, ВычисляемыеПараметры);
			
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СозданиеФормы

// Процедура выполняет стандартные действия при создании на сервере
//  для форм не ссылочных объектов (отчеты, обработки).
//
// Параметры:
//  Отказ				 - Булево	 - признак ошибки выполнения.
//  СтандартнаяОбработка - Булево	 - признак стандартной (системной) обработки события.
//  ТекущаяФорма		 - УправляемаяФорма	 - Текущая форма.
//  ТекущийОбъект		 - Произвольный		 - Текущий объект.
//  СтрПар				 - Структура		 - Структура параметров.
//
Процедура ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, ТекущийОбъект, СтрПар = Неопределено) Экспорт
	
	ПолноеИмяОбъекта = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ТекущаяФорма.ИмяФормы, Истина);
	
	// Вызов механизма разделения прав доступа.
	Если НЕ бит_ПраваДоступаОсновной.МеханизмОтключен() Тогда
		
		Имена = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ПолноеИмяОбъекта);
		
		Если ЗначениеЗаполнено(Имена.ИмяКоллекции)  Тогда
			
			ИмяТипаОбъект = Имена.ИмяКласса+"Объект."+Имена.ИмяОбъекта;				
			ТипОбъект = Тип(ИмяТипаОбъект);
			
			Об = ДанныеФормыВЗначение(ТекущийОбъект, ТипОбъект);
			бит_ПраваДоступа.ПередОткрытиемФормыОтчета(Отказ, СтандартнаяОбработка, Об, ТекущаяФорма);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеДействияВУправляемыхФормах

// Процедура выполняет стандартные действия при создании на сервере в форме списка. 
// 
// Параметры:
//  Отказ                - Булево.
//  СтандартнаяОбработка - Булево.
//  ТекущаяФорма         - УправляемаяФорма.
//  СтрПар               - Структура.
// 
Процедура СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, СтрПар = Неопределено) Экспорт

	ПолноеИмяОбъекта = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ТекущаяФорма.ИмяФормы, Истина);
	ПолноеИмяОбъекта = ПолноеИмяОбъекта + ".ФормаСписка";
	
	
	
КонецПроцедуры // СписокПриСозданииНаСервере()

// Процедура заполняет параметры списка в форме списка плана счетов. 
// 
// Параметры:
//  ТекущаяФорма - УправляемаяФорма.
// 
Процедура ЗаполнитьПараметрыСпискаПланаСчетов(ТекущаяФорма) Экспорт

	ТекущаяФорма.Список.Параметры.УстановитьЗначениеПараметра("А", 	   Символы.НПП + НСтр("ru = '(А)'; en = 'A'"));
	ТекущаяФорма.Список.Параметры.УстановитьЗначениеПараметра("П", 	   Символы.НПП + НСтр("ru = '(П)'; en = 'P'"));	
	ТекущаяФорма.Список.Параметры.УстановитьЗначениеПараметра("АП",     Символы.НПП + НСтр("ru = '(АП)'; en = 'AP'"));	
	ТекущаяФорма.Список.Параметры.УстановитьЗначениеПараметра("Оборот", Символы.НПП + НСтр("ru = '(об)'; en = 'tu'"));
	ТекущаяФорма.Список.Параметры.УстановитьЗначениеПараметра("Пусто",  Символы.НПП + "");
	
КонецПроцедуры

// Процедура выполняет стандартные действия при создании на сервере в форме выбора. 
// 
// Параметры:
//  Отказ                - Булево.
//  СтандартнаяОбработка - Булево.
//  ТекущаяФорма         - УправляемаяФорма.
//  СтрПар               - Структура.
// 
Процедура ФормаВыбораПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, СтрПар = Неопределено) Экспорт

	ПолноеИмяОбъекта = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ТекущаяФорма.ИмяФормы, Истина);
	ПолноеИмяОбъекта = ПолноеИмяОбъекта + ".ФормаВыбора";
	
	
	
КонецПроцедуры // СписокПриСозданииНаСервере()

// Процедура выполняет стандартные действия при создании на сервере в форме списка регистра сведений. 
// 
// Параметры:
//  Отказ                - Булево.
//  СтандартнаяОбработка - Булево.
//  ТекущаяФорма         - УправляемаяФорма.
//  СтрПар               - Структура.
// 
Процедура ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, СтрПар = Неопределено) Экспорт

	ПолноеИмяОбъекта = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ТекущаяФорма.ИмяФормы, Истина);
	ПолноеИмяОбъекта = ПолноеИмяОбъекта + ".ФормаСписка";
	
	
	
КонецПроцедуры // СписокПриСозданииНаСервере()

// Процедура выполняет стандартные действия при создании на сервере в форме списка регистра сведений. 
// 
// Параметры:
//  Отказ                - Булево.
//  СтандартнаяОбработка - Булево.
//  ТекущаяФорма         - УправляемаяФорма.
//  СтрПар               - Структура.
// 
Процедура ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, СтрПар = Неопределено) Экспорт

	ПолноеИмяОбъекта = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ТекущаяФорма.ИмяФормы, Истина);
	ПолноеИмяОбъекта = ПолноеИмяОбъекта;
	
	
	
КонецПроцедуры // СписокПриСозданииНаСервере()

// Процедура выполняет стандартные действия при создании на сервере в формах ссылочных объектов.
// 
// Параметры:
//  Отказ                - Булево
//  СтандартнаяОбработка - Булево
//  ТекущаяФорма  - Строка
//  ТекущийОбъект - Произвольный
//  СтрПар        - Структура
// 
Процедура ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, ТекущийОбъект, СтрПар = Неопределено) Экспорт

	бит_РаботаСДиалогамиПереопределяемый.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, ТекущийОбъект, СтрПар);

КонецПроцедуры

//  Процедура выполняет действия при создании на сервере в форме РСВ.
//
Процедура ФормаРегистраСведенийПриСозданииНаСервере(ТекущаяФорма, МетаданныеОбъекта) Экспорт 

	// Ограничение для сценариев
	
	Для каждого МетаРеквизит Из МетаданныеОбъекта.Измерения Цикл
	
		Если МетаРеквизит.Тип.СодержитТип(Тип("СправочникСсылка.СценарииТоварногоПланирования")) 
			 И МетаРеквизит.Тип.СодержитТип(Тип("СправочникСсылка.СценарииПланирования")) Тогда
		
			ЭУ = ТекущаяФорма.Элементы.Найти(МетаРеквизит.Имя);
			Если НЕ ЭУ = Неопределено Тогда
			
				ЭУ.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СценарииПланирования");
			
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЦикла; 

КонецПроцедуры // ФормаРегистраСведенийПриСозданииНаСервере()

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСУсловнымОформлениемПоСтатусамДокументовВизирование

// Процедура добавляет кнопку "Раскрасить по статусам" в командную панель формы.
// 
// Параметры:
//  Элементы 			- ВсеЭлементыФормы.
//  Команды         	- КомандыФормы.
//  КоманднаяПанель 	- ГруппаФормы (командная панель).
//  МетаданныеОбъекта   - ОбъектМетаданных.
//	ПометкаПоУмолчанию  - Булево - Признак расскраски по-умолчанию.
// 
Процедура ДобавитьКнопкуРаскраситьПоСтатусам(Элементы,
												Команды,
												КоманднаяПанель,
												МетаданныеОбъекта,
												ПометкаПоУмолчанию = Ложь) Экспорт

	ИмяКнопки = "РаскраситьПоСтатусам";
	Синоним   = НСтр("ru='Раскрасить по статусам';en='Colorize by status'");
	Картинка  = БиблиотекаКартинок.бит_Раскрасить;
	
	// Восстановление значения пометки
	СтруктураПараметров = Новый Структура("ОбъектСистемы, КлючЗначения", МетаданныеОбъекта,	"РаскраситьПоСтатусам_Пометка"); 
	Раскрасить_Пометка = РегистрыСведений.бит_СохраненныеЗначения.ПолучитьЗнч(Пользователи.ТекущийПользователь(), 
																			  СтруктураПараметров);
	Пометка = ?(ТипЗнч(Раскрасить_Пометка) = Тип("Булево"), Раскрасить_Пометка, ПометкаПоУмолчанию);
	
	ПараметрыКнопки = ПараметрыКнопкиНаФорму();
	ПараметрыКнопки.Заголовок 			  = НСтр("ru='Раскрасить по статусам';en='Colorize by status'");
	ПараметрыКнопки.ТолькоВоВсехДействиях = Истина;
	ПараметрыКнопки.Пометка 			  = Пометка;
	ДобавитьКнопкуНаФорму(Элементы, Команды, ИмяКнопки, ИмяКнопки, ПараметрыКнопки, КоманднаяПанель, Картинка);
			
КонецПроцедуры // ДобавитьКнопкуРаскраситьПоСтатусам()

// Процедура удаляет элементы условного оформления, относящихся к оформлению списка по статусам.
// 
// Параметры:
//  УсловноеОформление - УсловноеОформлениеКомпановкиДанных.
// 
Процедура ОчиститьОформлениеПоСтатусам(УсловноеОформление) Экспорт

	УдалитьЭлементыОформленияПоПредставлению(НСтр("ru='Оформление списка по статусам';en='Listing by status'"), УсловноеОформление);
	
КонецПроцедуры // ОчиститьОформлениеПоСтатусам()

// Функция формирует массив объектов системы.
// 
// Параметры:
//  МетаданныеОбъекта - ОбъектМетаданных.
//  МассивТипов       - Массив.
//  
// Возвращаемое значение:
//   Массив.
// 
Функция ПолучитьМассивОбъектов(МетаданныеОбъекта, МассивТипов = Неопределено) Экспорт

	МассивОбъектов = Новый Массив;
	
	Если МассивТипов = Неопределено Тогда
		
		ВидОбъекта 			= бит_УправлениеОбъектамиСистемы.ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);
		ИмяОбъекта 		    = МетаданныеОбъекта.Имя;
		ИмяОбъектаПолное   	= бит_УправлениеОбъектамиСистемы.ПолучитьПолноеИмяОбъекта(ИмяОбъекта, ВидОбъекта);
		ОбъектСистемы 		= Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(ИмяОбъектаПолное);
		МассивОбъектов.Добавить(ОбъектСистемы);
		
	Иначе
		
		Если МассивТипов.Количество() > 0 Тогда
			
			Для каждого ЭлТип Из МассивТипов Цикл				
				ОбъектСистемы = бит_УправлениеОбъектамиСистемы.НайтиОбъектДоступаПоТипу(ЭлТип, 
															Перечисления.бит_ВидыОбъектовСистемы.Документ);
				МассивОбъектов.Добавить(ОбъектСистемы);			
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли; 

	Возврат МассивОбъектов;
	
КонецФункции // ПолучитьМассивОбъектов()

// Процедура добовляет оформление списка документов по настройкам статусов.
// 
// Параметры:
//  МассивОбъектов   	- Массив.
//  ПометкаКнопки		- Булево.
//  УсловноеОформление  - УсловноеОформлениеКомпановкиДанных.
//  ИмяСписка 			- Строка (по умолчанию будет применяться значение "Список"). 
// 
Процедура ОформитьСписокДокументовПоСтатусам(МассивОбъектов
	                                          , ПометкаКнопки
											  , УсловноеОформление
											  , ИмяСписка = "Список"
											  , ИмяПоляСтатус = "Статус"
											  , Очищать = Истина) Экспорт

											  
	Если Очищать Тогда
		  
	  // Удалим старые элементы оформления по статусам.
	  ОчиститьОформлениеПоСтатусам(УсловноеОформление);
		  
	КонецЕсли; 										  
	
	// Если требуется только очистить оформление - выход из процедуры.
	Если Не ПометкаКнопки Тогда
		Возврат;	
	КонецЕсли;
	
	// Представление элемента условного оформления.
	Представление = НСтр("ru='Оформление списка по статусам';en='Listing by status'");
		
	ТекущаяДатаКд = ТекущаяДата();
	ОформлениеПоСрокуИсполнения = Неопределено;
	
	// Массив оформляемых полей.
	МассивОформляемых = Новый Массив;
	МассивОформляемых.Добавить(ИмяСписка);
		
	// Структура условия условного оформления.
	СтрУсловия = Новый Структура("УсловиеЛевое, УсловиеПравое");	
	СтрУсловия.Вставить("УсловиеЛевое", ИмяСписка + "." + ИмяПоляСтатус);
	
	
	// Получим настройки.
	Результат = ПолучитьОформлениеПоСтатусам(МассивОбъектов);
	
	Выборка = Результат.Выбрать();  
	Пока Выборка.Следующий() Цикл
		
		ТекущийСтатус = Выборка.Статус;
		
		Оформление = Выборка.Оформление.Получить();
		Если ТипЗнч(Оформление) = Тип("Структура") Тогда
			
			
			// Пропускаем оформление для просроченных задач.
			Если ТекущийСтатус = Справочники.бит_СтатусыОбъектов.Задача_Просрочена Тогда				
				ОформлениеПоСрокуИсполнения = Оформление;
				Продолжить; 					
			КонецЕсли;
			
			СтрУсловия.Вставить("УсловиеПравое", ТекущийСтатус);
			ДобавитьНаборЭлементовУсловногоОформления(УсловноеОформление, 
													Оформление, 
													СтрУсловия, 
													МассивОформляемых, 
													Представление); 			
			
		КонецЕсли;
		 		
	КонецЦикла;
	
	// Оформление для просроченных задач.
	Если ОформлениеПоСрокуИсполнения <> Неопределено Тогда
				
		СтрУсловия.Вставить("УсловиеЛевое" , ИмяСписка + ".Просрочена");	
		СтрУсловия.Вставить("УсловиеПравое", Истина);
		СтрУсловия.Вставить("ВидСравнения" , ВидСравненияКомпоновкиДанных.Равно);
		
		ДобавитьНаборЭлементовУсловногоОформления(УсловноеОформление, 
												ОформлениеПоСрокуИсполнения, 
												СтрУсловия, 
												МассивОформляемых, 
												Представление);
					
	КонецЕсли;

КонецПроцедуры // ОформитьСписокДокументовПоСтатусам() 

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСЭлементамиФормы

// Процедура проверяет владельца договора в текущей строке при изменении контрагента,
// если владелец изменился, тогда очищаем договор контрагента.
// 
// Параметры:
//  ВыбранныйКонтрагент - СправочникСсылка.Контрагенты.
//  ДоговорКонтрагента  - СправочникСсылка.ДоговорыКонтрагентов.
// 
Процедура ПроверитьВладельцаДоговораКонтрагентаВСтроке(ВыбранныйКонтрагент, ДоговорКонтрагента) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранныйКонтрагент)
		И ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
        
        ИмяКонтр = бит_ОбщегоНазначения.ОпределитьИмяРеквизитаКонтрагента();
        
		Если ДоговорКонтрагента[ИмяКонтр] <> ВыбранныйКонтрагент Тогда
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
				
	КонецЕсли; // Если ЗначениеЗаполнено(ТекущаяСтрока.ДоговорКонтрагента) Тогда.
		
КонецПроцедуры // ПроверитьВладельцаДоговораКонтрагентаВСтроке()

// Процедура обрабатывает изменение поля ввода "ДоговорКонтрагента". 
//
// Параметры:
//  ВыбранныйДоговор - СправочникСсылка.ДоговорыКонтрагентов.
//  Контрагент 		 - СправочникСсылка.Контрагенты.
//
Процедура ИзменениеДоговораКонтрагента(ВыбранныйДоговор, Контрагент) Экспорт
    
    ИмяКонтр = бит_ОбщегоНазначения.ОпределитьИмяРеквизитаКонтрагента();
    
    // Если в строке не заполнен контрагент, тогда заполним его из договора.
	Если ЗначениеЗаполнено(ВыбранныйДоговор) Тогда
		ЗначениеКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранныйДоговор, ИмяКонтр);
        Если Контрагент <> ЗначениеКонтрагента Тогда
            Контрагент = ЗначениеКонтрагента;      
        КонецЕсли;
    КонецЕсли;
    	
КонецПроцедуры

// Функция задает параметры кнопки формы.
//
// Возвращаемое значение:
//   Структура.
//
Функция ПараметрыКнопкиНаФорму() Экспорт

	ПараметрыКнопки = Новый Структура;
	ПараметрыКнопки.Вставить("Заголовок"			, "");
	ПараметрыКнопки.Вставить("Вид"					, ВидКнопкиФормы.КнопкаКоманднойПанели);
	ПараметрыКнопки.Вставить("ТолькоВоВсехДействиях", Ложь);	
	ПараметрыКнопки.Вставить("Пометка"				, Ложь);	
	
	Возврат ПараметрыКнопки;

КонецФункции // ПараметрыКнопкиНаФорму()

// Процедура добавляет кнопку на форму и задает действие.
// 
// Параметры:
//  Элементы 		- ВсеЭлементыФормы.
//  Команды         - КомандыФормы.
//  ИмяКнопки 		- Строка.
//  ИмяДействия 	- Строка.
//  ПараметрыКнопки - Структура
//  ГруппаРодитель 	- ГруппаФормы (По умолчанию = Неопределено).
//  Картинка 		- Картинка (По умолчанию = Неопределено)
// 
Процедура ДобавитьКнопкуНаФорму(Элементы, Команды, ИмяКнопки, ИмяДействия, 
	ПараметрыКнопки = Неопределено, ГруппаРодитель = Неопределено, Картинка = Неопределено) Экспорт
	
	Если ПараметрыКнопки = Неопределено Тогда
		ПараметрыКнопки = ПараметрыКнопкиНаФорму();
	КонецЕсли;
	
	ИмяКоманды = "Команда" + ИмяКнопки;
	
	// Добавляем новую команду обработки выбора вида операции.
	Команда = Команды.Добавить(ИмяКоманды);
	Команда.Действие = "Подключаемый_" + ИмяДействия;
	Если Картинка <> Неопределено Тогда
		Команда.Картинка = Картинка;
	КонецЕсли;
	
	Если ГруппаРодитель = Неопределено Тогда
		НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"));
	Иначе	
	    НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаРодитель);
	КонецЕсли;  
	ЗаполнитьЗначенияСвойств(НоваяКнопка, ПараметрыКнопки);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры // ДобавитьКнопкуНаФорму()

// Процедура удаляет элементы группы.
// 
// Параметры:
//  Элементы    - ВсеЭлементыФормы.
//  ГруппаФормы - ГруппаФормы.
// 
Процедура УдалитьЭлементыГруппыФормы(Элементы, ГруппаФормы) Экспорт

	КоличествоДекораций = ГруппаФормы.ПодчиненныеЭлементы.Количество();
		
	Для Сч = 1 По КоличествоДекораций Цикл
		
		ЭлементГруппы = ГруппаФормы.ПодчиненныеЭлементы[КоличествоДекораций - Сч];
				
		НайденныйЭлемент = Элементы.Найти(ЭлементГруппы.Имя);
		Если НайденныйЭлемент <> Неопределено Тогда
			
			Элементы.Удалить(НайденныйЭлемент);
		
		КонецЕсли;
					
	КонецЦикла;	

КонецПроцедуры // УдалитьЭлементыГруппыФормы()

// Функция Активизирует один из реквизитов при открытии формы объекта. 
// Типовая процедура модифицирована для работы не только с документами.
// 
// Параметры:
//  ТекущийОбъект       - Произвольный объект. 
//  ТекущаяФорма        - Форма документа.
//  СтруктураРеквизитов - Струкутра (Заранее определенные реквизиты для проверки).
//  ИмяТаблицы   		- Строка (Имя таблицы на каторую будет установлен фокус если все обяз. реквизиты заполнены).
//  ИмяСтраницы			- Строка.
//  ИмяПанели			- Строка (По умолчанию = "ПанельОсновная").
// 
Функция АктивизироватьРеквизитВФорме(ТекущийОбъект, ТекущаяФорма, СтруктураРеквизитов, 
	ИмяТаблицы = Неопределено, ИмяСтраницы = Неопределено, ИмяПанели = "ПанельОсновная") Экспорт
	
	// ----------------------------------------------------------------------
	// Шапка
	флВыполнитьУстановкуВШапке = Истина;
	Если Метаданные.Документы.Найти(Метаданные) <> Неопределено Тогда 		
		флВыполнитьУстановкуВШапке = НЕ ТекущийОбъект.Проведен; 		
	КонецЕсли;
	
	Если флВыполнитьУстановкуВШапке Тогда
		
		Если СтруктураРеквизитов = Неопределено Тогда
			// Структура - порядок активизации реквизитов.
			// Активизируется первый не заполненный.
			СтруктураРеквизитов = Новый Структура();
			СтруктураРеквизитов.Вставить("Дата");
			СтруктураРеквизитов.Вставить("Организация");      
			СтруктураРеквизитов.Вставить("СчетОрганизации");
			СтруктураРеквизитов.Вставить("Склад");
			СтруктураРеквизитов.Вставить("БанковскийСчет");
			СтруктураРеквизитов.Вставить("ФизЛицо");
			СтруктураРеквизитов.Вставить("Контрагент");
			СтруктураРеквизитов.Вставить("ДоговорКонтрагента");
			СтруктураРеквизитов.Вставить("Касса");
			СтруктураРеквизитов.Вставить("Получатель");
			СтруктураРеквизитов.Вставить("Плательщик");
			СтруктураРеквизитов.Вставить("ПодразделениеОрганизации");
		КонецЕсли;
		
		Для каждого Элемент Из СтруктураРеквизитов Цикл
			
			// Определим, есть ли ЭУ с таким именем.
			ЭлементУправления = ТекущаяФорма.Элементы.Найти(Элемент.Ключ);
			Если ЭлементУправления <> Неопределено Тогда // Есть такой
				
				ЗначениеЭлемента = ТекущийОбъект[СтрЗаменить(ЭлементУправления.ПутьКДанным, "Объект.", "")];
				Если ЭлементУправления.Видимость И ЭлементУправления.Доступность И Не ЗначениеЗаполнено(ЗначениеЭлемента) Тогда 
					// Нашли не заполненный ЭУ. Делаем его текущим и прекращаем цикл.
					ТекущаяФорма.ТекущийЭлемент = ЭлементУправления;
					Возврат(Истина);
					Прервать;
				КонецЕсли;
				
				ТекущийРеквезит = ЭлементУправления;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	// ----------------------------------------------------------------------
	// Активация нужной страницы панели. 
	Если ЗначениеЗаполнено(ИмяСтраницы) Тогда
			
		ЭлементПанель = ТекущаяФорма.Элементы.Найти(ИмяПанели);
		Если ЭлементПанель <> Неопределено Тогда
			
			ЭлементСтраница = ТекущаяФорма.Элементы.Найти(ИмяСтраницы);
			Если ЭлементСтраница <> Неопределено Тогда
				
				ЭлементПанель.ТекущаяСтраница = ЭлементСтраница;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	
	// ----------------------------------------------------------------------
	// Если в документе есть таблица то необходимой фокус передать ей.
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		
		ЭлементУправления = ТекущаяФорма.Элементы.Найти(ИмяТаблицы);
		
		Если ТипЗнч(ЭлементУправления) = Тип("ТаблицаФормы") Тогда
			
			ТекущаяФорма.ТекущийЭлемент = ЭлементУправления;
			Возврат(Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	// ----------------------------------------------------------------------
	// Если все поля заполнены но нет ТЧ то передадим фокус панели, в результате
	// визуально будет казаться что фокус не установлен ни на одном ЭФ.
	// Хотелось бы фокус установить на кнопке "Закрыть", но пока технически не предоставляется
	// такой возможности.
	ЭлементУправления = ТекущаяФорма.Элементы.Найти("ФормаКоманднаяПанель");
	Если ЭлементУправления <> Неопределено Тогда
		
		ТекущаяФорма.ТекущийЭлемент = ЭлементУправления;
		Возврат(Истина);
		
	КонецЕсли;
	
	Возврат(Ложь);

КонецФункции // АктивизироватьРеквизитВФорме()

// Процедура устанавливает параметры выбора элемента.
// 
// Параметры:
//  Элемент 		- ПолеФормы.
//  СтруктураОтбора - Структура.
// 
Процедура УстановитьПараметрыВыбораДляЭлементов(Элементы) Экспорт

	МассивПараметров = Новый Массив;
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ЗапретитьИспользоватьВПроводках", Ложь);
	
	МассивПараметров.Добавить(НовыйПараметр);
	
	ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);

	Для Каждого Элемент Из Элементы Цикл
		
		Элемент.ПараметрыВыбора = ПараметрыВыбора;

	КонецЦикла;
	
КонецПроцедуры // УстановитьПараметрыВыбораЭлемента()

// Процедура устанавливает связи параметров выбора для договора контрагента. 
// 
// Параметры:
//  Элемент         - ЭлементУправления.
//  ПутьКонтрагент  - Строка.
//  ПутьОрганизация - Строка.
// 
Процедура УстановитьСвязиПараметровВыбораДоговора(Элемент, ПутьКонтрагент, ПутьОрганизация = "Объект.Организация" ) Экспорт
	
	ИмяКонтрагента = бит_ОбщегоНазначения.ОпределитьИмяРеквизитаКонтрагента();	
	ПутьОтборКонтрагент = "Отбор." + ИмяКонтрагента;  
	
	бит_ОбщегоНазначения.УстановитьСвязьПараметраВыбораЭлемента(Элемент,
		ПутьОтборКонтрагент, ПутьКонтрагент, РежимИзмененияСвязанногоЗначения.Очищать);
	
	Если ЗначениеЗаполнено(ПутьОрганизация) Тогда
		
		бит_ОбщегоНазначения.УстановитьСвязьПараметраВыбораЭлемента(Элемент,
			"Отбор.Организация", ПутьОрганизация, РежимИзмененияСвязанногоЗначения.Очищать);
		
	КонецЕсли; 																			
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииУправленияВидимостьюКолонок

// Функция определяет необходимо ли изменение видимости колонок бюджета
// При необходимости изменения изменяется значение переменной НастройкаВидимостиКолонок.
// 
// Параметры:
//  МассивСтатей              - Массив.
//  МассивСтатейЭталон        - Массив.
//  НастройкаВидимостиКолонок - Структура.
//  НастройкиИзмерений        - Соответствие.
// 
// Возвращаемое значение:
//  флНужноИзменить - Булево.
// 
Функция НужноИзменитьВидимостьКолонокБюджета(МассивСтатей
											 ,МассивСтатейЭталон
											 ,НастройкаВидимостиКолонок
											 ,НастройкиИзмерений = Неопределено) Экспорт
											 
    флНужноИзменитьВидимость = Ложь;											 
											 
	МассивСтатей = бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСтатей);
	
	СтрПредставление1 = ЗначениеВСтрокуВнутр(МассивСтатей);
	СтрПредставление2 = ЗначениеВСтрокуВнутр(МассивСтатейЭталон);
	
	Если СтрПредставление1 <> СтрПредставление2 Тогда
		
		МассивСтатейЭталон = МассивСтатей;
		
		НастройкаВидимостиКолонок = бит_Бюджетирование.ПолучитьНастройкуВидимостиКолонок(МассивСтатей,НастройкиИзмерений);
		
		флНужноИзменитьВидимость  = Истина;
		
	КонецЕсли; // Изменился состав статей.
	
	Возврат флНужноИзменитьВидимость;
	
КонецФункции // НужноИзменитьВидимостьКолонокБюджета()

// Процедура устанавливает видимость колонок табличного поля по структуре настройки.
// 
// Параметры:
//  Элементы 				  - Элементы формы.
//  НастройкаВидимостиКолонок - Структура (Ключ: ИмяКолонки, Значение: Видимость).
//  Префикс  				  - Строка.
//  Постфикс 				  - Строка.
// 
Процедура УправлениеВидимостьюКолонокТабличногоПоля(Элементы
											 ,НастройкаВидимостиКолонок
											 ,Префикс  = ""
											 ,Постфикс = "") Экспорт
		 
	 Для каждого КиЗ Из НастройкаВидимостиКолонок Цикл
				
		ИмяКолонки 	   = Префикс + КиЗ.Ключ + Постфикс;
		КолонкаТабПоля = Элементы.Найти(ИмяКолонки);
		
		Если КолонкаТабПоля <> Неопределено Тогда
			КолонкаТабПоля.Видимость = КиЗ.Значение;
		КонецЕсли;
 	КонецЦикла; // По ключам настройки	
	
КонецПроцедуры // УправлениеВидимостьюКолонокТабличногоПоля()

#КонецОбласти

#Область ПроцедурыИФункцииПоРаботеСОтборамиДинамическихСписков

// Процедура удаляет элемент отбора динамического списка.
// 
// Параметры:
//  Список  - ДинамическийСписок.
//  ИмяПоля - Имя поля компоновки, отбор по которому нужно удалить.
// 
Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля) Экспорт
	
	ЭлементыДляУдаления = Новый Массив;
	
	ЭлементыОтбора = Список.Отбор.Элементы;
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементыДляУдаления.Добавить(ЭлементОтбора);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементОтбораДляУдаления Из ЭлементыДляУдаления Цикл
		ЭлементыОтбора.Удалить(ЭлементОтбораДляУдаления);
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

// Процедура устанавливает элемент отбор динамического списка.
// 
// Параметры:
//  Список			- Динамический список.
//  ИмяПоля			- Строка - имя поля компоновки, отбор по которому нужно установить.
//  ПравоеЗначение 	- Произвольный - значение отбора.
//  ВидСравнения	- ВидСравненияКомпоновкиДанных (По умолчанию = Равно).
//  Представление   - Строка (По умолчанию = "").
//  Использование	- Булево (По усолчанию = Истина).
// 
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено, Представление = "", Использование = Истина) Экспорт
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоля);	
	ЭлементОтбора.ВидСравнения   = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование  = Использование;
	ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;
	ЭлементОтбора.Представление  = Представление;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

// Процедура изменяет элемент отбора динамического списка.
// 
// Параметры:
//  Список         - Динамический список.
//  ИмяПоля        - Строка - имя поля компоновки, отбор по которому нужно установить.
//  ПравоеЗначение - Произвольный.
//  Установить     - Булево - признак необходимости установить отбор.
//  ВидСравнения   - ВидСравненияКомпоновкиДанных (По умолчанию = Равно).
// 
Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено) Экспорт
	
	УдалитьЭлементОтбораСписка(Список, ИмяПоля);
	
	Если Установить Тогда
		УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()

// Процедура устанавливает отбор по организации для списков.
// 
// Параметры:
//  Форма  		   - Форма.
//  ИмяСписка	   - Строка (По умолчанию = "Список").
//  ИмяРеквизита   - Строка (По умолчанию = "Организация").
//  ЗначениеОтбора - СправочникСсылка.Организации (По умолчанию = Неопределено).
// 
Функция УстановитьОтборПоОсновнойОрганизацииБит(Форма, ИмяСписка = "Список", ИмяРеквизита = "Организация", ЗначениеОтбора = Неопределено) Экспорт
	
	Если Форма.Параметры.Отбор.Свойство(ИмяРеквизита) Тогда
		// Если значение отбора передается в параметрах формы - берем его оттуда, параметр при этом удаляем.
		ОсновнаяОрганизация = Форма.Параметры.Отбор[ИмяРеквизита];
		Форма.Параметры.Отбор.Удалить(ИмяРеквизита);
	ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.Организации") 
		ИЛИ ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") 
		ИЛИ ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
		ОсновнаяОрганизация = ЗначениеОтбора;
	Иначе
		ОсновнаяОрганизация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
	КонецЕсли;

	Если ТипЗнч(ОсновнаяОрганизация) = Тип("СправочникСсылка.Организации") Тогда
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
	КонецЕсли;

	ИспользованиеОтбора = ЗначениеЗаполнено(ОсновнаяОрганизация);

	ИзменитьЭлементОтбораСписка(Форма[ИмяСписка]
									, ИмяРеквизита
									, ОсновнаяОрганизация
									, ЗначениеЗаполнено(ОсновнаяОрганизация)
									, ВидСравненияОтбора);
		
	Возврат ОсновнаяОрганизация;    	

КонецФункции // УстановитьОтборПоОсновнойОрганизацииБит()

// Процедура устанавливает отбор по организации для списков.
// 
// Параметры:
//  Форма  		   - Форма.
//  ИмяСписка	   - Строка (По умолчанию = "Список").
//  ИмяРеквизита   - Строка (По умолчанию = "Организация").
//  ЗначениеОтбора - СправочникСсылка.Организации (По умолчанию = Неопределено).
// 
Функция УстановитьОтборПоОсновнойОрганизации(Форма, ИмяСписка = "Список", ИмяРеквизита = "Организация", ЗначениеОтбора = Неопределено) Экспорт
    
    // ++ ЕРП 
	Возврат Истина;
	// -- ЕРП 	

КонецФункции // УстановитьОтборПоОсновнойОрганизации()

// Заменяет отбор, установленный пользователем в сохраненной настройке списка, на отбор.
// установленный программно при создании формы списка.
// Вызывается при восстановлении пользовательских настроек динамического списка
// из обработчика списка ПередЗагрузкойПользовательскихНастроекНаСервере.
// 
// Параметры
//  Список    - ДинамическийСписок.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - восстанавливаемые настройки списка.
//  ИмяОтбора - Строка - имя элемента отбора.
// 
Процедура ВосстановитьОтборСписка(Список, Настройки, ИмяОтбора) Экспорт
	
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() ИЛИ бит_ОбщегоНазначения.ЭтоУТ() Тогда
		
	     Модуль = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияБП");
		 Модуль.ВосстановитьОтборСписка(Список, Настройки, "Организация");
		
	КонецЕсли;
	
КонецПроцедуры // ВосстановитьОтборСписка()

#КонецОбласти

#Область ПерехватТиповыхСобытий

// Процедура выполняет перехват типовых событий управляемой формы.
// 
// Параметры:
//  ТекущаяФорма          - Управляемая форма.
//  События               - Массив - Имена, событий, которые нужно перехватить.
//  ИмяРеквизитаХранилища - Строка - Имя реквизита формы для хранения имен обработчиков.
// 
Процедура ВыполнитьПерехватСобытий(ТекущаяФорма, События, ИмяРеквизитаХранилища) Экспорт

	// Тело модуля может выполняться более одного раза - поэтому проверим был ли проведен перехват типовых событий.
	МассивРеквизитов = ТекущаяФорма.ПолучитьРеквизиты();
	Для каждого ТекРеквизит Из МассивРеквизитов Цикл	
		Если ТекРеквизит.Имя = ИмяРеквизитаХранилища Тогда			
			Возврат;		
		КонецЕсли;	
	КонецЦикла;	
		
	// Создание реквизита формы для хранения обработчиков.
	ДобавляемыеРеквизиты = Новый Массив;
	
	ТекстЗаголовка = НСтр("ru='Обработчики (БИТ)';en='Procedures (BIT)'");
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаХранилища, Новый ОписаниеТипов("Неопределено"),, ТекстЗаголовка, Ложь);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ТекущаяФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Инициализация хранилища обработчиков.
	ТекущаяФорма[ИмяРеквизитаХранилища] = Новый Структура("Форма", Новый Структура);
	
	Для каждого ТиповоеСобытие Из События Цикл
		
		ТекДействие   = Строка(ТекущаяФорма.ПолучитьДействие(ТиповоеСобытие));
		ИмяСобытияНов = "Подключаемый_бит_" + ТиповоеСобытие;
		
		// Типовой обработчик назначен - кэшируем его имя.
		Если НЕ ПустаяСтрока(ТекДействие) Тогда			
			КлючТиповогоСобытия = "бит_Типовой_" + ТиповоеСобытие;
			ТекущаяФорма[ИмяРеквизитаХранилища].Форма.Вставить(КлючТиповогоСобытия, ТекДействие);			
		КонецЕсли; 
		
		ТекущаяФорма.УстановитьДействие(ТиповоеСобытие, ИмяСобытияНов);
		
	КонецЦикла; 

КонецПроцедуры // ВыполнитьПерехватСобытий()

#КонецОбласти

#Область ДинамическоеФормированиеЭлементовУправленияСправочникаРбп

// Процедура добавляет элементы управления для реквизитов БИТ в форму элемента справочника РБП. 
// 
Процедура РБП_Элемент_ДобавитьДинамическиеЭлементы(Элементы) Экспорт
	
	ГруппаМСФО = Элементы.Добавить("бит_ГруппаМСФО", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
	ГруппаМСФО.Заголовок           = НСтр("ru='МСФО (БИТ)';en='IFRS'");
	ГруппаМСФО.Вид                 = ВидГруппыФормы.Страница;
	ГруппаМСФО.ОтображатьЗаголовок = Истина;
	
	ЭУ = Элементы.Добавить("бит_ВидРБП_МСФО", Тип("ПолеФормы"), ГруппаМСФО);
	ЭУ.ПутьКДанным = "Объект.бит_ВидРБП_МСФО";
	ЭУ.Вид         = ВидПоляФормы.ПолеВвода;
	ЭУ.Заголовок   = НСтр("ru='Вид РБП';en='Type of DE'");
	
	ЭУ = Элементы.Добавить("бит_НМА_МСФО", Тип("ПолеФормы"), ГруппаМСФО);
	ЭУ.ПутьКДанным = "Объект.бит_НМА_МСФО";
	ЭУ.Вид         = ВидПоляФормы.ПолеВвода;
	ЭУ.Заголовок   = НСтр("ru='НМА';en='IA'");

КонецПроцедуры // бит_ДобавитьДинамическиеЭлементы()

// Процедура добавляет элементы управления для реквизитов БИТ в форму списка справочника РБП. 
// 
// Парметры:
//  Элементы
//
Процедура РБП_Список_ДобавитьДинамическиеЭлементы(Элементы) Экспорт

  ГруппаМСФО = Элементы.Добавить("бит_ГруппаМСФО", Тип("ГруппаФормы"),Элементы.Список);
  ГруппаМСФО.Заголовок           = НСтр("ru='МСФО (БИТ)';en='IFRS'");
  ГруппаМСФО.Вид                 = ВидГруппыФормы.ГруппаКолонок;
  
  ЭУ = Элементы.Добавить("бит_ВидРБП_МСФО", Тип("ПолеФормы"), ГруппаМСФО);
  ЭУ.ПутьКДанным = "Список.бит_ВидРБП_МСФО";
  ЭУ.Вид         = ВидПоляФормы.ПолеВвода;
  
  ЭУ = Элементы.Добавить("бит_НМА_МСФО", Тип("ПолеФормы"), ГруппаМСФО);
  ЭУ.ПутьКДанным = "Список.бит_НМА_МСФО";
  ЭУ.Вид         = ВидПоляФормы.ПолеВвода;

КонецПроцедуры // РБП_Список_ДобавитьДинамическиеЭлементы()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИФункцииРаботыСУсловнымОформлениемПоСтатусамДокументовВизирование

// Процедура получает результат запроса - данные офомления списка по статусам.
// 
// Параметры:
//  МассивОбъектов - Массив.
// 
Функция ПолучитьОформлениеПоСтатусам(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	бит_СтатусыОбъектов.Объект КАК Объект,
	|	бит_СтатусыОбъектов.Ссылка КАК Статус,
	|	бит_СтатусыОбъектов.Оформление
	|	ИЗ
	|	Справочник.бит_СтатусыОбъектов КАК бит_СтатусыОбъектов
	|ГДЕ
	|	бит_СтатусыОбъектов.Объект В(&МассивОбъектов)
	|	ИЛИ бит_СтатусыОбъектов.Родитель = ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов)
    |
	|УПОРЯДОЧИТЬ ПО
	|	Объект
	|";
	Результат = Запрос.Выполнить();
	
    Возврат Результат;
	
КонецФункции // ПолучитьОформлениеПоСтатусам()

#КонецОбласти

// Процедура добавляет набор элементов условного оформления (ЦветФона, ЦфетТекста, Шрифт).
// 
// Параметры:
//  УсловноеОформление  - УсловноеОформление.
//  Оформление  		- Структура.
//  СтрУсловия          - Структура.
//  МассивОформляемых   - Массив.
//  Представление       - Строка.
// 
Процедура ДобавитьНаборЭлементовУсловногоОформления(УсловноеОформление, Оформление, СтрУсловия, МассивОформляемых, Представление)

	Если Оформление.Свойство("ЦветФона") Тогда				
		СтрОформления = Новый Структура("ЦветФона", Оформление.ЦветФона);
		СтруктураУО = Новый Структура("СтруктураОформления, СтруктураУсловия, МассивОформляемыхПолей",
										СтрОформления, СтрУсловия, МассивОформляемых);
		ДобавитьЭлементУсловногоОформления(УсловноеОформление, Представление, СтруктураУО);
	КонецЕсли;
	
	Если Оформление.Свойство("ЦветТекста") Тогда		
		СтрОформления = Новый Структура("ЦветТекста", Оформление.ЦветТекста);
		СтруктураУО = Новый Структура("СтруктураОформления, СтруктураУсловия, МассивОформляемыхПолей",
										СтрОформления, СтрУсловия, МассивОформляемых);
		ДобавитьЭлементУсловногоОформления(УсловноеОформление, Представление, СтруктураУО);		
	КонецЕсли;
	
	Если Оформление.Свойство("Шрифт") Тогда		
		СтрОформления = Новый Структура("Шрифт", Оформление.Шрифт);
		СтруктураУО = Новый Структура("СтруктураОформления, СтруктураУсловия, МассивОформляемыхПолей",
										СтрОформления, СтрУсловия, МассивОформляемых);
		ДобавитьЭлементУсловногоОформления(УсловноеОформление, Представление, СтруктураУО);		
	КонецЕсли;	

КонецПроцедуры

Функция ВычисляемыеПараметыПроедурУсловногоОформления(ПараметрыОформления)
	
	ВычисляемыеПараметры = Новый Структура;
	ВычисляемыеПараметры.Вставить("ИменаРеквизов", СформироватьМассивРеквизитовСтатей());
	ОпределитьПоляПроверкиЗаполнения(ВычисляемыеПараметры, ПараметрыОформления); 
	ОпределитьИменаТаблицОформления(ВычисляемыеПараметры, ПараметрыОформления);
	Возврат ВычисляемыеПараметры;
	
КонецФункции

Процедура ОпределитьПоляПроверкиЗаполнения(ВычисляемыеПараметры, ПараметрыОформления)
	
	ПоляПроверкиЗаполнения = Новый Массив;
	
	Если ПараметрыОформления.ОтметитьОбязательныеРазрезыСтатей Тогда
		МетаданныеСтатьи         = Метаданные.Справочники.бит_СтатьиОборотов;
		ШаблонПоляОбязательности = "Обязательный_%1";
		Для каждого ИмяРеквизита Из ВычисляемыеПараметры.ИменаРеквизов Цикл
			ИмяПоляОбязательности = СтрШаблон(ШаблонПоляОбязательности, ИмяРеквизита);
			Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяПоляОбязательности, МетаданныеСтатьи) Тогда
				ПоляПроверкиЗаполнения.Добавить(ИмяПоляОбязательности);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВычисляемыеПараметры.Вставить("ПоляПроверкиЗаполнения", ПоляПроверкиЗаполнения);
	
КонецПроцедуры

Процедура ОпределитьИменаТаблицОформления(ВычисляемыеПараметры, ПараметрыОформления)
	
	ИменаТаблицОформления  = Новый Массив;
	
	ИменаОформляемыхТаблиц = ПараметрыОформления.ИменаОформляемыхТаблиц;
	Если ИменаОформляемыхТаблиц = Неопределено Тогда
		ИменаТаблицОформления.Добавить(ПараметрыОформления.ПрефиксТаблицы);
	ИначеЕсли ТипЗнч(ИменаОформляемыхТаблиц) = Тип("Строка") Тогда
		ИменаТаблицОформления.Добавить(ИменаОформляемыхТаблиц);
	Иначе
		ИменаТаблицОформления = ИменаОформляемыхТаблиц;
	КонецЕсли;
	
	ВычисляемыеПараметры.Вставить("ИменаТаблицОформления", ИменаТаблицОформления);
	
КонецПроцедуры

Функция ДанныеСтатейДляУсловногоОформления(СтатьиОборотов, ПараметрыОформления, ВычисляемыеПараметры)
	
	ДанныеСтатей = Новый Структура;
	
	СтатьиПоНедоступнымПолям = Новый Структура;
	Для каждого ИмяРеквизита Из ВычисляемыеПараметры.ИменаРеквизов Цикл
		СтатьиПоНедоступнымПолям.Вставить(ИмяРеквизита, Новый Массив);
	КонецЦикла;
	
	СтатьиПоОбязательнымПолям = Новый Структура;
	Для каждого ИмяПоля Из ВычисляемыеПараметры.ПоляПроверкиЗаполнения Цикл
		ИмяРеквизита = СтрЗаменить(ИмяПоля, "Обязательный_", "");
		СтатьиПоОбязательнымПолям.Вставить(ИмяРеквизита, Новый Массив);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтатьиОборотов.Ссылка КАК СтатьяОборотов,
	|	&ПоляВыборки КАК ПоляВыборки
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|ГДЕ
	|	НЕ СтатьиОборотов.ЭтоГруппа
	|	И СтатьиОборотов.Ссылка В(&СтатьиОборотов)";
	ТекстПолейВыборки = ТекстПолейВыборкиДанныхСтатейУсловногоОформления(ВычисляемыеПараметры, ПараметрыОформления);
	ТекстЗапроса      = СтрЗаменить(ТекстЗапроса, "&ПоляВыборки КАК ПоляВыборки", ТекстПолейВыборки);
	Запрос.Текст      = ТекстЗапроса;
	Запрос.УстановитьПараметр("СтатьиОборотов", СтатьиОборотов);
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл
		Для каждого ИмяРеквизита Из ВычисляемыеПараметры.ИменаРеквизов Цикл
			Если НЕ ВыборкаДанных["Учет_" + ИмяРеквизита] Тогда
				СтатьиПоНедоступнымПолям[ИмяРеквизита].Добавить(ВыборкаДанных.СтатьяОборотов);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого ИмяПоля Из ВычисляемыеПараметры.ПоляПроверкиЗаполнения Цикл
			Если ВыборкаДанных[ИмяПоля] Тогда
				ИмяРеквизита = СтрЗаменить(ИмяПоля, "Обязательный_", "");
				СтатьиПоОбязательнымПолям[ИмяРеквизита].Добавить(ВыборкаДанных.СтатьяОборотов);
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
		
	Для каждого ЭлементПоля Из СтатьиПоНедоступнымПолям Цикл
		Если ЭлементПоля.Значение.Количество() = 0 Тогда
			СтатьиПоНедоступнымПолям.Удалить(ЭлементПоля);
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлементПоля Из СтатьиПоОбязательнымПолям Цикл
		Если ЭлементПоля.Значение.Количество() = 0 Тогда
			СтатьиПоОбязательнымПолям.Удалить(ЭлементПоля);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеСтатей.Вставить("СтатьиПоНедоступнымПолям", СтатьиПоНедоступнымПолям);
	ДанныеСтатей.Вставить("СтатьиПоОбязательнымПолям", СтатьиПоОбязательнымПолям);
	
	Возврат ДанныеСтатей;
	
КонецФункции

Функция ТекстПолейВыборкиДанныхСтатейУсловногоОформления(ВычисляемыеПараметры, ПараметрыОформления)
	
	УникальныеПоля  = Новый Соответствие;
	
	ШаблонПоляУчета = "Учет_%1";
	Для каждого ИмяРеквизита Из ВычисляемыеПараметры.ИменаРеквизов Цикл
		УникальныеПоля.Вставить(СтрШаблон(ШаблонПоляУчета, ИмяРеквизита));
	КонецЦикла;
	Для каждого ИмяРеквизита Из ВычисляемыеПараметры.ПоляПроверкиЗаполнения Цикл
		УникальныеПоля.Вставить(ИмяРеквизита);
	КонецЦикла;
	Если ПараметрыОформления.ПоляОформления <> Неопределено Тогда
		Для каждого КиЗ Из ПараметрыОформления.ПоляОформления Цикл
			УникальныеПоля.Вставить(КиЗ.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	ШаблонПоля  = "%1 КАК %1";
	ПоляВыборки = Новый Массив;
	Для каждого КиЗ Из УникальныеПоля Цикл
		ПоляВыборки.Добавить(СтрШаблон(ШаблонПоля, КиЗ.Ключ));
	КонецЦикла;
	
	Возврат СтрСоединить(ПоляВыборки, "," + Символы.ПС + Символы.Таб);
	
КонецФункции

Процедура УстановитьТолькоПросмотрПолейПоСтатьямОборотов(УсловноеОформление, ПараметрыОформления, ДанныеСтатей, ВычисляемыеПараметры)
	
	СтруктураДопПолей = ПараметрыОформления.ПоляОформления;
	Постфикс          = ПараметрыОформления.Постфикс;
	
	Для каждого ЭлементПоляУчета Из ДанныеСтатей.СтатьиПоНедоступнымПолям Цикл
		ИмяРеквизита   = ЭлементПоляУчета.Ключ;
		СтатьиОборотов = ЭлементПоляУчета.Значение;
		
		ПоляОформления = Новый Массив;
		Для каждого ИмяТаблицы Из ВычисляемыеПараметры.ИменаТаблицОформления Цикл
			ПолеОформления = ИмяТаблицы + ИмяРеквизита + Постфикс;
			ПоляОформления.Добавить(ПолеОформления);
		КонецЦикла;
		
		Если СтруктураДопПолей <> Неопределено
			И СтруктураДопПолей.Свойство(ИмяРеквизита) Тогда
			ИмяПоляТаблицы = СтруктураДопПолей[ИмяРеквизита];
			Если ТипЗнч(ИмяПоляТаблицы) = Тип("Массив") Тогда
				Для каждого ЭлементМассиваИмен Из ИмяПоляТаблицы Цикл
					ПоляОформления.Добавить(ИмяТаблицы + ЭлементМассиваИмен + Постфикс);
				КонецЦикла;
			Иначе	
				ПоляОформления.Добавить(ИмяТаблицы + ИмяПоляТаблицы + Постфикс);
			КонецЕсли;
		КонецЕсли;
		
		Для каждого ПолеОформления Из ПоляОформления Цикл
			ЭлементУО       = ЭлементУсловногоОфрмленияПоляПоСтатьямОборотов(УсловноеОформление, ПараметрыОформления,
								ПолеОформления, "ТолькоПросмотр", ПараметрыОформления.ПараметрыУсловногоОформления);
			ЭлементОтбораУО = ЭлементУО.Отбор.Элементы[0];
			
			Если ЭлементОтбораУО.ПравоеЗначение.Количество() = 0 Тогда
				ЭлементОтбораУО.ПравоеЗначение.ЗагрузитьЗначения(СтатьиОборотов);
			Иначе
				Для каждого СтатьяОборотов Из СтатьиОборотов Цикл
					ЭлементОтбораУО.ПравоеЗначение.Добавить(СтатьяОборотов);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьОтметкуНезаполненногоПолейПоСтатьямОборотов(УсловноеОформление, ПараметрыОформления, ДанныеСтатей, ВычисляемыеПараметры)
	
	Если НЕ ПараметрыОформления.ОтметитьОбязательныеРазрезыСтатей Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОформления = Новый Структура("ОтметкаНезаполненного", Истина);
	
	Постфикс = ПараметрыОформления.Постфикс;
	
	Для каждого ЭлементПоляУчета Из ДанныеСтатей.СтатьиПоОбязательнымПолям Цикл
		ИмяРеквизита   = ЭлементПоляУчета.Ключ;
		СтатьиОборотов = ЭлементПоляУчета.Значение;
		
		ПоляОформления = Новый Массив;
		Для каждого ИмяТаблицы Из ВычисляемыеПараметры.ИменаТаблицОформления Цикл
			ПолеОформления = ИмяТаблицы + ИмяРеквизита + Постфикс;
			ПоляОформления.Добавить(ПолеОформления);
		КонецЦикла;
		
		Для каждого ПолеОформления Из ПоляОформления Цикл
			ЭлементУО       = ЭлементУсловногоОфрмленияПоляПоСтатьямОборотов(УсловноеОформление,
								ПараметрыОформления, ПолеОформления, "ОтметкаНезаполненного", СтруктураОформления);
			ЭлементОтбораУО = ЭлементУО.Отбор.Элементы[0];
			
			Если ЭлементОтбораУО.ПравоеЗначение.Количество() = 0 Тогда
				ЭлементОтбораУО.ПравоеЗначение.ЗагрузитьЗначения(СтатьиОборотов);
			Иначе
				Для каждого СтатьяОборотов Из СтатьиОборотов Цикл
					ЭлементОтбораУО.ПравоеЗначение.Добавить(СтатьяОборотов);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ЭлементУсловногоОфрмленияПоляПоСтатьямОборотов(УсловноеОформление, ПараметрыОформления, ПолеОформления,
														ПрефиксПредставления, ПараметрыУсловногоОформления)
	
	ШаблонПредставления     = "%1ПоСтатьям%2";
	ПредставлениеОформления = СтрШаблон(ШаблонПредставления, ПрефиксПредставления, ПолеОформления);
	ЭлементыУО              = УсловноеОформление.Элементы;
	
	Для каждого ЭлементОформления Из ЭлементыУО Цикл
		Если ЭлементОформления.Представление = ПредставлениеОформления Тогда
			Возврат ЭлементОформления;
		КонецЕсли;
	КонецЦикла;
	
	ЭлементУО = ЭлементыУО.Добавить();
	ЭлементУО.Представление = ПредставлениеОформления;
	ЭлементУО.Использование = Истина;
	
	ОформляемоеПоле 	 = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ПолеОформления);
	
	УсловиеУО 		 = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ШаблонЛевогоПоля = "%1%2.%3%4";
	ЛевоеПоле        = СтрШаблон(ШаблонЛевогоПоля, ПараметрыОформления.ПрефиксКонтейнера,
		ПараметрыОформления.ПрефиксТаблицы, ПараметрыОформления.ИмяРеквизитаСтатья, ПараметрыОформления.Постфикс);
	УсловиеУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ЛевоеПоле);
	УсловиеУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
    УсловиеУО.ПравоеЗначение = Новый СписокЗначений;
		
	Для каждого ПараметрУО Из ПараметрыУсловногоОформления Цикл
		ЭлементУО.Оформление.УстановитьЗначениеПараметра(ПараметрУО.Ключ, ПараметрУО.Значение);
	КонецЦикла;
    
	Возврат ЭлементУО;
	
КонецФункции

#КонецОбласти

#Область Картинки

// Процедура устанавливает картинку строки: документ проведен, непроведен, удален.
// 
// Параметры:
//  ТекущаяСтрока  			  - ДанныеФормыЭлементКоллекции.
//  ИсточникДанныхПоДокументу - ДокументСсылка или Выборка результата запроса.
//  ИмяРеквизитаКартинки 	  - Строка (По умолчанию = "СтандартнаяКартинка").
//  Проведен                  - Булево (По умолчанию = Неопределено).
//  ПометкаУдаления           - Булево (По умолчанию = Неопределено).
// 
Процедура УстановитьКартинкиСтрокиПоДокументам(ТекущаяСтрока
                                              , ДокСсылка
                                              , ИмяРеквизитаКартинки = "СтандартнаяКартинка"
                                              , Проведен = Неопределено
                                              , ПометкаУдаления = Неопределено) Экспорт

                                              
   Если Проведен = Неопределено Тогда
       
        ИмяДокумента = ДокСсылка.Метаданные().Имя;
        
        Запрос = Новый Запрос;
        Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
        Запрос.Текст = 
        "ВЫБРАТЬ
        |   ТаблДок.Проведен,
        |   ТаблДок.ПометкаУдаления
        |ИЗ
        |   Документ.%ИмяДок% КАК ТаблДок
        |ГДЕ
        |   ТаблДок.Ссылка = &ДокСсылка
        |
        |";
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяДок%", ИмяДокумента);
        Результат = Запрос.Выполнить();
        
        Если Результат.Пустой() Тогда
            Проведен        = Ложь;
        	ПометкаУдаления = Ложь;
        Иначе
            Выборка = Результат.Выбрать();
            Выборка.Следующий();
            Проведен        = Выборка.Проведен;
	        ПометкаУдаления = Выборка.ПометкаУдаления;
        КонецЕсли;
    
    КонецЕсли;  
	
	Если Проведен Тогда	
		
		ТекущаяСтрока[ИмяРеквизитаКартинки] = БиблиотекаКартинок.бит_ДокументПроведен;
		
	ИначеЕсли ПометкаУдаления Тогда	
		
		ТекущаяСтрока[ИмяРеквизитаКартинки] = БиблиотекаКартинок.бит_ДокументУдален;
		
	Иначе
		
		ТекущаяСтрока[ИмяРеквизитаКартинки] = БиблиотекаКартинок.бит_ДокументНеПроведен;
	
	КонецЕсли;	

КонецПроцедуры // УстановитьКартинкиСтрокиПоДокументам()

#КонецОбласти

#Область УстаревшийФункционал

Процедура УстановитьФормуВыбораДоговораКонтрагентаУппКа(Элементы) Экспорт
	// Устарело.
КонецПроцедуры

#КонецОбласти 
