#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция готовит таблицы документа для проведения.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  СтруктураТаблиц - Структура.
// 
Функция ПодготовитьТаблицыДокумента(Ссылка)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.Ссылка КАК Ссылка,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.НомерСтроки КАК НомерСтроки,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.Контрагент КАК Контрагент,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.КурсАванса КАК КурсАванса,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СуммаАванса КАК СуммаАванса,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютнаяСуммаАванса КАК ВалютнаяСуммаАванса,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СуммаОбязательств КАК СуммаОбязательств,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютнаяСуммаОбязательств КАК ВалютнаяСуммаОбязательств,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СуммаПогашения КАК СуммаПогашения,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютнаяСуммаПогашения КАК ВалютнаяСуммаПогашения,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СчетУчетаАвансов КАК СчетУчетаАвансов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СчетУчетаОбязательств КАК СчетУчетаОбязательств,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СчетУчетаПроцентов КАК СчетУчетаПроцентов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СуммаПроцентов КАК СуммаПроцентов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютнаяСуммаПроцентов КАК ВалютнаяСуммаПроцентов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СуммаПогашенияПроцентов КАК СуммаПогашенияПроцентов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютнаяСуммаПогашенияПроцентов КАК ВалютнаяСуммаПогашенияПроцентов
	|ИЗ
	|	Документ.бит_му_ЗачетАвансовПоЛизингу.ДанныеРаспределения КАК ЗачетАвансовПоЛизингуДанныеРаспределения
	|ГДЕ
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.Ссылка = &Ссылка";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДанныеРаспределения = РезультатЗапроса.Выгрузить();
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ДанныеРаспределения", ТаблицаДанныеРаспределения);
	
	Возврат СтруктураТаблиц;
	
КонецФункции

#КонецОбласти

#КонецЕсли
