
&НаСервере
&ИзменениеИКонтроль("ПрочитатьСмены")
Процедура бит_ПрочитатьСмены(Начало, Окончание, ДобавлятьВНачало)

	Выборка = ВыбратьСменыЗаПериод(Начало, Окончание);
	Если Выборка.Количество() < ЧислоСтрок Тогда

		Если ВсеСмены.Количество() = 0 Тогда
			Начало = '00010101';
			Окончание = '39991231';
		ИначеЕсли ДобавлятьВНачало Тогда
			Начало = '00010101';
		Иначе
			Окончание = '39991231';
		КонецЕсли;

		Выборка = ВыбратьСменыЗаПериод(Начало, Окончание);

	КонецЕсли;

	Переиндексация = Новый Соответствие;
	СтрокаНачалоСписка = Неопределено;
	Если ДобавлятьВНачало Тогда

		Для каждого Строка Из ВидимыеСмены Цикл
			Переиндексация.Вставить(ВидимыеСмены.Индекс(Строка), ВсеСмены[Строка.ИндексВладельца]);
		КонецЦикла;

		Если ИндексНачалоСписка <> -1 Тогда
			СтрокаНачалоСписка = ВсеСмены[ИндексНачалоСписка];
		КонецЕсли;

	КонецЕсли;

	Индекс = 0;
	Пока Выборка.Следующий() Цикл

		Если ДобавлятьВНачало Тогда
			НоваяСтрока = ВсеСмены.Вставить(Индекс);
			Индекс = Индекс + 1;
		Иначе
			НоваяСтрока = ВсеСмены.Добавить();
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ5.35] [ASHolyavko@1cbit.ru] [20.04.2026] +        
		
		НоваяСтрока.СменаПредставление = НоваяСтрока.СменаПредставление + ". Номер смены: " + НоваяСтрока.Смена.бит_НомерСмены; 
		
		#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ5.35] [ASHolyavko@1cbit.ru] [20.04.2026] -
				
	КонецЦикла;

	Если ДобавлятьВНачало Тогда

		Для каждого КлючИЗначение Из Переиндексация Цикл
			ВидимыеСмены[КлючИЗначение.Ключ].ИндексВладельца = ВсеСмены.Индекс(КлючИЗначение.Значение);
		КонецЦикла;

		Если ИндексНачалоСписка <> -1 Тогда
			ИндексНачалоСписка = ВсеСмены.Индекс(СтрокаНачалоСписка);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
