#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает данные шаблона из хранилища.
//
Функция ВложенияШаблонаСообщений(ШаблонСообщения) Экспорт

	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ШаблонСообщения) Тогда
		ХранилищеВложений = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонСообщения, "ХранилищеВложений");
		Если ТипЗнч(ХранилищеВложений) = Тип("ХранилищеЗначения") Тогда
			Результат = ХранилищеВложений.Получить();
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
