&НаКлиенте
Процедура бит_ПродукцияНоменклатураПриИзмененииПосле(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 18:05:40] +        
	ТД = Элементы.Продукция.ТекущиеДанные;
	Если ТД <> Неопределено Тогда 
		ТД.бит_Тара = ЗаполнитьТаруПоСтроке(ТД.Номенклатура, ТД.Назначение);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 18:05:40] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ПродукцияНазначениеПриИзмененииПосле(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 18:05:51] +        
	ТД = Элементы.Продукция.ТекущиеДанные;
	Если ТД <> Неопределено Тогда 
		ТД.бит_Тара = ЗаполнитьТаруПоСтроке(ТД.Номенклатура, ТД.Назначение);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 18:05:51] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ПриОткрытииПосле(Отказ)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 18:06:14] +        
	Для каждого стр из Объект.Продукция Цикл
		стр.бит_Тара = ЗаполнитьТаруПоСтроке(стр.Номенклатура, стр.Назначение);
	КонецЦикла;
	ЭтаФорма.Модифицированность = Ложь;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 18:06:14] -
КонецПроцедуры     

&НаСервереБезКонтекста
Функция ЗаполнитьТаруПоСтроке(Номенклатура, Назначение)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 18:09:52] +        
	//В поле выводить значение тары из строки "Заказа клиента" для Номенклатуры по указанному "Назначению" в строке табличной части
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Тара = Справочники.Номенклатура.ПустаяСсылка();
	ИначеЕсли Не ЗначениеЗаполнено(Назначение) 
		Или Не ЗначениеЗаполнено(Назначение.Заказ) 
		Или ТипЗнч(Назначение.Заказ) <> Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Если назначение не заполнено, то отображать значение "(бит) Стандартный тип тары" из Номенклатуры в строке.
		Тара = Номенклатура.бит_СтандартныйТипТары;
	Иначе
		// если в заказе клиента соблюдается правило "Один заказ клиента" - "Одна номенклатура - одна тара". 
		// Если в Заказе клиента для одной номенклатуры присутствует несколько разных тар, то отображать пустое значение.
        ТЧЗаказа = Назначение.Заказ.Товары.Выгрузить(, "Номенклатура, бит_Тара");   
		ТЧЗаказа.Свернуть("Номенклатура, бит_Тара");
		СтрокиПоКлючу = ТЧЗаказа.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
		Если СтрокиПоКлючу.Количество() = 1 Тогда
			Тара = СтрокиПоКлючу[0].бит_Тара;
		Иначе
			Тара = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Тара;	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 18:09:52] -	
КонецФункции

&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 17:04:00] +  
	НовыйЭлемент = Элементы.Вставить("бит_ВидЗаказа", Тип("ПолеФормы"), Элементы.ГруппаОсновноеЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВидЗаказа";
	   
	НовыйЭлемент = Элементы.Вставить("бит_КлючЗагрузки", Тип("ПолеФормы"), Элементы.ГруппаОсновноеЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КлючЗагрузки";

	Если Элементы.Найти("Продукциябит_Тара") = Неопределено Тогда
		мРеквизиты = Новый Массив;
		мРеквизиты.Добавить(Новый РеквизитФормы("бит_Тара", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"), "Объект.Продукция" , "(бит) Тара")); 
		ИзменитьРеквизиты(мРеквизиты);	
		//
		НоваяКолонка = Элементы.Добавить("Продукциябит_Тара", Тип("ПолеФормы"), Элементы.Продукция); 
	    НоваяКолонка.Заголовок = "(бит) Тара"; 
		НоваяКолонка.ПутьКДанным = "Объект.Продукция.бит_Тара";
	    НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;    
		НоваяКолонка.ТолькоПросмотр = Истина;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.27]  [VUVaynula@1cbit.ru] [04.11.2025 17:04:00] -
КонецПроцедуры
