
//&Вместо("КонтрольНазначенияОпераций")
//Процедура бит_КонтрольНазначенияОпераций(Отказ)
//		Запрос = Новый Запрос;
//	
//	ТекстЗапроса =
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	NULL КАК Этап,
//		|	NULL КАК Операция,
//		|	Операции.СменноеЗадание КАК СменноеЗадание,
//		|	NULL КАК Исполнитель,
//		|	ВЫБОР
//		|		КОГДА НЕ Задания.Проведен
//		|			ТОГДА ""ЗаданиеНеПроведено""
//		|		ИНАЧЕ ""СтатусЗаданияНеФормируется""
//		|	КОНЕЦ КАК КодОшибки,
//		|	NULL КАК Подразделение,
//		|	NULL КАК Этап1,
//		|	NULL КАК Операция1,
//		|	NULL КАК ИдентификаторОперации,
//		|	NULL КАК Исполнитель1,
//		|	NULL КАК Участок,
//		|	NULL КАК РабочийЦентр,
//		|	NULL КАК ВидРабочегоЦентра,
//		|	NULL КАК НазначатьНеРанее,
//		|	NULL КАК Количество,
//		|	NULL КАК ВремяШтучное,
//		|	NULL КАК ВремяПЗ,
//		|	NULL КАК ВремяЕдИзм,
//		|	NULL КАК МожноНазначать,
//		|	NULL КАК НужноНазначать,
//		|	NULL КАК НарушенПорядокНазначения,
//		|	NULL КАК бит_КоличествоХодовОперация,
//		|	NULL КАК Распоряжение,
//		|	NULL КАК НомерОперации,
//		|	NULL КАК НомерСледующейОперации,
//		|	NULL КАК Порядок,
//		|	NULL КАК Подразделение1,
//		|	NULL КАК Этап2,
//		|	NULL КАК Операция2,
//		|	NULL КАК ИдентификаторОперации1,
//		|	NULL КАК Требуется,
//		|	NULL КАК Запланировано,
//		|	NULL КАК Создано,
//		|	NULL КАК ОжиданиеПредшествующих,
//		|	NULL КАК НачатыПредшествующие,
//		|	NULL КАК МожноВыполнять,
//		|	NULL КАК Выполняется,
//		|	NULL КАК Выполнено,
//		|	NULL КАК ТребуетПовторения,
//		|	NULL КАК Пропущено,
//		|	NULL КАК НаКонтроле,
//		|	NULL КАК НаДоработке,
//		|	NULL КАК Брак,
//		|	NULL КАК бит_КоличествоХодовОперация1,
//		|	NULL КАК Распоряжение1,
//		|	NULL КАК МаршрутнаяКарта,
//		|	NULL КАК КоэффициентМаршрутнойКарты,
//		|	NULL КАК ВремяОбщее,
//		|	NULL КАК ВремяШтучное1,
//		|	NULL КАК ВремяПЗ1,
//		|	NULL КАК ВремяЕдИзм1,
//		|	NULL КАК ИдентификаторКонтрольнойОперации,
//		|	NULL КАК НомерОперации1,
//		|	NULL КАК НомерСледующейОперации1,
//		|	NULL КАК Порядок1,
//		|	NULL КАК ВАрхиве
//		|ИЗ
//		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СменноеЗадание КАК Задания
//		|		ПО Операции.СменноеЗадание = Задания.Ссылка
//		|ГДЕ
//		|	Операции.СменноеЗадание <> ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)
//		|	И &ЗаписиНабора
//		|	И (НЕ Задания.Проведен
//		|			ИЛИ Задания.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСменныхЗаданий.Формируется))
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	NULL,
//		|	Операции.Операция,
//		|	NULL,
//		|	NULL,
//		|	""НекорректныйВидРЦ"",
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL
//		|ИЗ
//		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
//		|		ПО Операции.Операция = ТехнологическиеОперации.Ссылка
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеЦентры КАК РабочиеЦентры
//		|		ПО (ТехнологическиеОперации.РабочийЦентр = РабочиеЦентры.Ссылка)
//		|ГДЕ
//		|	Операции.СменноеЗадание <> ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)
//		|	И &ЗаписиНабора
//		|	И Операции.ВидРабочегоЦентра <> ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка)
//		|	И НЕ ТехнологическиеОперации.РабочийЦентр В (ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
//		|	И Операции.ВидРабочегоЦентра <> ВЫБОР
//		|			КОГДА ТехнологическиеОперации.РабочийЦентр ССЫЛКА Справочник.РабочиеЦентры
//		|				ТОГДА РабочиеЦентры.ВидРабочегоЦентра
//		|			ИНАЧЕ ТехнологическиеОперации.РабочийЦентр
//		|		КОНЕЦ
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	Операции.Этап,
//		|	Операции.Операция,
//		|	Операции.СменноеЗадание,
//		|	NULL,
//		|	""ПревышениеПланКоличества"",
//		|	Операции.Подразделение,
//		|	Операции.Этап,
//		|	Операции.Операция,
//		|	Операции.ИдентификаторОперации,
//		|	Операции.Исполнитель,
//		|	Операции.Участок,
//		|	Операции.РабочийЦентр,
//		|	Операции.ВидРабочегоЦентра,
//		|	Операции.НазначатьНеРанее,
//		|	Операции.Количество,
//		|	Операции.ВремяШтучное,
//		|	Операции.ВремяПЗ,
//		|	Операции.ВремяЕдИзм,
//		|	Операции.МожноНазначать,
//		|	Операции.НужноНазначать,
//		|	Операции.НарушенПорядокНазначения,
//		|	Операции.бит_КоличествоХодовОперация,
//		|	Операции.Распоряжение,
//		|	Операции.НомерОперации,
//		|	Операции.НомерСледующейОперации,
//		|	Операции.Порядок,
//		|	Очередь.Подразделение,
//		|	Очередь.Этап,
//		|	Очередь.Операция,
//		|	Очередь.ИдентификаторОперации,
//		|	Очередь.Требуется,
//		|	Очередь.Запланировано,
//		|	Очередь.Создано,
//		|	Очередь.ОжиданиеПредшествующих,
//		|	Очередь.НачатыПредшествующие,
//		|	Очередь.МожноВыполнять,
//		|	Очередь.Выполняется,
//		|	Очередь.Выполнено,
//		|	Очередь.ТребуетПовторения,
//		|	Очередь.Пропущено,
//		|	Очередь.НаКонтроле,
//		|	Очередь.НаДоработке,
//		|	Очередь.Брак,
//		|	Очередь.бит_КоличествоХодовОперация,
//		|	Очередь.Распоряжение,
//		|	Очередь.МаршрутнаяКарта,
//		|	Очередь.КоэффициентМаршрутнойКарты,
//		|	Очередь.ВремяОбщее,
//		|	Очередь.ВремяШтучное,
//		|	Очередь.ВремяПЗ,
//		|	Очередь.ВремяЕдИзм,
//		|	Очередь.ИдентификаторКонтрольнойОперации,
//		|	Очередь.НомерОперации,
//		|	Очередь.НомерСледующейОперации,
//		|	Очередь.Порядок,
//		|	Очередь.ВАрхиве
//		|ИЗ
//		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПроизводственныхОпераций КАК Очередь
//		|		ПО Операции.Подразделение = Очередь.Подразделение
//		|			И Операции.Этап = Очередь.Этап
//		|			И Операции.Операция = Очередь.Операция
//		|			И Операции.ИдентификаторОперации = Очередь.ИдентификаторОперации
//		|ГДЕ
//		|	(Операции.Этап, Операции.Операция) В
//		|			(ВЫБРАТЬ
//		|				Операции.Этап,
//		|				Операции.Операция
//		|			ИЗ
//		|				РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
//		|			ГДЕ
//		|				Операции.СменноеЗадание <> ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)
//		|				И &ЗаписиНабора)
//		|	И Операции.СменноеЗадание <> ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	Операции.Этап,
//		|	Операции.Операция,
//		|	Операции.Этап,
//		|	Операции.Операция,
//		|	Операции.Подразделение,
//		|	Операции.СменноеЗадание,
//		|	Операции.ИдентификаторОперации,
//		|	Операции.Исполнитель,
//		|	Операции.Участок,
//		|	Операции.РабочийЦентр,
//		|	Операции.ВидРабочегоЦентра,
//		|	Операции.НазначатьНеРанее,
//		|	Операции.Количество,
//		|	Операции.ВремяШтучное,
//		|	Операции.ВремяПЗ,
//		|	Операции.ВремяЕдИзм,
//		|	Операции.МожноНазначать,
//		|	Операции.НужноНазначать,
//		|	Операции.НарушенПорядокНазначения,
//		|	Операции.бит_КоличествоХодовОперация,
//		|	Операции.Распоряжение,
//		|	Операции.НомерОперации,
//		|	Операции.НомерСледующейОперации,
//		|	Операции.Порядок,
//		|	Очередь.Подразделение,
//		|	Очередь.Этап,
//		|	Очередь.Операция,
//		|	Очередь.ИдентификаторОперации,
//		|	Очередь.Требуется,
//		|	Очередь.Запланировано,
//		|	Очередь.Создано,
//		|	Очередь.ОжиданиеПредшествующих,
//		|	Очередь.НачатыПредшествующие,
//		|	Очередь.МожноВыполнять,
//		|	Очередь.Выполняется,
//		|	Очередь.Выполнено,
//		|	Очередь.ТребуетПовторения,
//		|	Очередь.Пропущено,
//		|	Очередь.НаКонтроле,
//		|	Очередь.НаДоработке,
//		|	Очередь.Брак,
//		|	Очередь.бит_КоличествоХодовОперация,
//		|	Очередь.Распоряжение,
//		|	Очередь.МаршрутнаяКарта,
//		|	Очередь.КоэффициентМаршрутнойКарты,
//		|	Очередь.ВремяОбщее,
//		|	Очередь.ВремяШтучное,
//		|	Очередь.ВремяПЗ,
//		|	Очередь.ВремяЕдИзм,
//		|	Очередь.ИдентификаторКонтрольнойОперации,
//		|	Очередь.НомерОперации,
//		|	Очередь.НомерСледующейОперации,
//		|	Очередь.Порядок,
//		|	Очередь.ВАрхиве
//		|
//		|ИМЕЮЩИЕ
//		|	СУММА(Операции.Количество) > МАКСИМУМ(Очередь.Запланировано) + МАКСИМУМ(Очередь.ТребуетПовторения) - МАКСИМУМ(Очередь.Создано)
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	NULL,
//		|	Операции.Операция,
//		|	NULL,
//		|	Бригады.Ссылка,
//		|	""НесоответствиеОрганизации"",
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL,
//		|	NULL
//		|ИЗ
//		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Бригады КАК Бригады
//		|		ПО Операции.Исполнитель = Бригады.Ссылка
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
//		|		ПО Операции.Этап = ЭтапПроизводства2_2.Ссылка
//		|ГДЕ
//		|	Операции.СменноеЗадание <> ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)
//		|	И &ЗаписиНабора
//		|	И Операции.Исполнитель ССЫЛКА Справочник.Бригады
//		|	И Операции.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Бригады.ПустаяСсылка)
//		|	И Бригады.Организация <> ЭтапПроизводства2_2.Организация";
//	
//	ТекстУсловия = "";
//	Для каждого Элемент Из Отбор Цикл
//		
//		Если НЕ Элемент.Использование Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		ТекстУсловия = ТекстУсловия	+ " И Операции." + Элемент.Имя + " = &" + Элемент.Имя;
//		Запрос.УстановитьПараметр(Элемент.Имя, Элемент.Значение);
//		
//	КонецЦикла;
//	
//	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "И &ЗаписиНабора", ТекстУсловия);
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		
//		ТекстСообщения = "";
//		КлючДанных = Неопределено;
//		
//		Если Выборка.КодОшибки = "ЗаданиеНеПроведено" Тогда
//			
//			ТекстСообщения = СтрШаблон(НСтр("ru = 'Документ %1 не проведен.';
//											|en = 'Document %1 is not posted.'"), Выборка.СменноеЗадание);
//			КлючДанных = Выборка.СменноеЗадание;
//			
//		ИначеЕсли Выборка.КодОшибки = "СтатусЗаданияНеФормируется" Тогда
//			
//			ТекстСообщения = СтрШаблон(НСтр("ru = 'Документ %1 не находится в статусе ""Формируется"".';
//											|en = 'Document %1 is not in the ""Generating"" status.'"), Выборка.СменноеЗадание);
//			КлючДанных = Выборка.СменноеЗадание;
//			
//		ИначеЕсли Выборка.КодОшибки = "НекорректныйВидРЦ" Тогда
//			
//			ТекстСообщения = СтрШаблон(НСтр("ru = 'Операция %1 не может быть назначена заданному РЦ (виду РЦ).';
//											|en = 'The %1 operation cannot be assigned to the specified work center (work center type).'"), Выборка.Операция);
//			
//		ИначеЕсли Выборка.КодОшибки = "ПревышениеПланКоличества" Тогда
//			
//			ТекстСообщения = СтрШаблон(НСтр("ru = 'Операция %1 %2 назначена в количестве, превышающем запланированное.';
//											|en = 'The %1 %2 operation is assigned in the quantity exceeding the planned one.'"),
//				Выборка.Операция, Выборка.Этап);
//			
//		ИначеЕсли Выборка.КодОшибки = "НесоответствиеОрганизации" Тогда
//			
//			ТекстСообщения = СтрШаблон(НСтр("ru = 'Операция %1 и бригада %2 относятся к различным организациям.';
//											|en = 'Operation %1 and work team %2 belong to different companies.'"),
//				Выборка.Операция, Выборка.Исполнитель);
//				
//		КонецЕсли;
//		
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//				ТекстСообщения,
//				КлючДанных,
//				,
//				, 
//				Отказ);
//		
//	КонецЦикла;

//КонецПроцедуры
