////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из модуля МеждународныйУчетКлиент для стандартных отчетов 
// Возвращает структуру параметров расшифровки.
//
// Параметры:
//  Расшифровка - ПланСчетовСсылка.Международный - Счет международного плана счетов.
//	АдресДанныхРасшифровки - Строка - Адрес расшифровки во временном хранилище.
//  ПараметрыРасшифровки - Массив - Параметры, значения которых нужно получить из расшифровки.
//  ПоляРасшифровки - Массив - Поля, значения которых нужно получить из расшифровки.
//
// Возвращаемое значение:
//  Структура - данные расшифровки.
//
Функция ПараметрыСтандартногоОтчета(Расшифровка, АдресДанныхРасшифровки, ПараметрыРасшифровки, ПоляРасшифровки) Экспорт

	ПараметрыОтчета = Новый Структура;
	ОтборыОтчета 	= Новый Структура;
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки); // ДанныеРасшифровкиКомпоновкиДанных - 
	
	СписокПолейРасшифровки = Новый СписокЗначений;
	ДобавитьРодителейПоляРасшифровки(ДанныеРасшифровки.Элементы[Расшифровка], СписокПолейРасшифровки);
	
	Для каждого ДанныеПоля Из СписокПолейРасшифровки Цикл
		
		ИмяПоля = ДанныеПоля.Представление;
		Если ПоляРасшифровки.Найти(ИмяПоля) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОтборыОтчета.Свойство(ИмяПоля) ИЛИ ПараметрыОтчета.Свойство(ИмяПоля) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ДанныеПоля.Значение) = Тип("Структура") Тогда
			ОтборыОтчета.Вставить(ИмяПоля, ДанныеПоля.Значение);
		Иначе
			ПараметрыОтчета.Вставить(ИмяПоля, ДанныеПоля.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ИмяПараметра Из ПараметрыРасшифровки Цикл
		ЗначениеПараметра = ДанныеРасшифровки.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
		Если ЗначениеПараметра = Неопределено ИЛИ НЕ ЗначениеПараметра.Использование Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыОтчета.Вставить(ИмяПараметра, ЗначениеПараметра.Значение);
	КонецЦикла; 
	
	СтруктураДанных = Новый Структура("Поля,Отборы", ПараметрыОтчета, ОтборыОтчета);
	
	Возврат СтруктураДанных;
		
КонецФункции

Функция НастроитьОтчетРасшифровки(Знач Параметры) Экспорт
	
	// Настройки вызывающего отчета
	НастройкиОтчета = Параметры.КомпоновщикНастроек.ПолучитьНастройки();
	ПользовательскиеНастройкиОтчета = Параметры.КомпоновщикНастроек.ПользовательскиеНастройки; // ПользовательскиеНастройкиКомпоновкиДанных - 
	
	// Настройки отчета расшифровки
	КомпоновщикНастроекРасшифровки = Новый КомпоновщикНастроекКомпоновкиДанных;
	МетаданныеОтчета = Метаданные.Отчеты[Параметры.ИмяОтчета]; // ОбъектМетаданныхОтчет - 
	ИмяСхемы = МетаданныеОтчета.ОсновнаяСхемаКомпоновкиДанных.Имя;
	СхемаРасшифровки = Отчеты[Параметры.ИмяОтчета].ПолучитьМакет(ИмяСхемы);
	НастройкиВарианта = СхемаРасшифровки.ВариантыНастроек[Параметры.КлючВарианта].Настройки;
	КомпоновщикНастроекРасшифровки.ЗагрузитьНастройки(НастройкиВарианта);
	ПользовательскиеНастройкиРасшифровки = КомпоновщикНастроекРасшифровки.ПользовательскиеНастройки;
	ПользовательскийОтборРасшифровки = КомпоновщикНастроекРасшифровки.ФиксированныеНастройки.Отбор;
		
	// Перенесем параметры вызывающего отчета
	Для Каждого Элемент Из ПользовательскиеНастройкиОтчета.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			КлючПараметра =  Строка(Элемент.Параметр);
			ЗначениеПараметра = Элемент.Значение;
			Использование = Элемент.Использование;
			
			ПараметрОтчетаРасшифровки = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(ПользовательскиеНастройкиРасшифровки, КлючПараметра);
			Если НЕ ПараметрОтчетаРасшифровки = Неопределено Тогда
				бит_ОтчетыБФКлиентСервер.УстановитьПараметр(
					ПользовательскиеНастройкиРасшифровки, КлючПараметра, ЗначениеПараметра, Использование);
			КонецЕсли;
		КонецЕсли;// это параметр отчета
	КонецЦикла;// по пользовательским настройкам вызывающего отчета
	
	// Установим переданные параметры
	Если Параметры.Свойство("ПараметрыСКД") Тогда
		Для Каждого Параметр Из Параметры.ПараметрыСКД Цикл
			ПараметрОтчетаРасшифровки = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(ПользовательскиеНастройкиРасшифровки, Параметр.Ключ);
			Если НЕ ПараметрОтчетаРасшифровки = Неопределено И ПараметрОтчетаРасшифровки.Использование Тогда
				бит_ОтчетыБФКлиентСервер.УстановитьПараметр(ПользовательскиеНастройкиРасшифровки, Параметр.Ключ, Параметр.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Перенесем отборы вызывающего отчета, кроме переданных и отборов по полям расшифровки.
	ПоляИсключения = Новый Структура;
	// Установим переданные отборы
	Если Параметры.Свойство("Отбор") Тогда
		Для Каждого Отбор Из Параметры.Отбор Цикл
			ПоляИсключения.Вставить(Отбор.Ключ);
			НовыйОтбор = ПользовательскийОтборРасшифровки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовыйОтбор, Отбор.Значение);
		КонецЦикла;
	КонецЕсли;
	Если Параметры.Свойство("ПоляРасшифровки") И ЗначениеЗаполнено(Параметры.ПоляРасшифровки) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПоляИсключения, Параметры.ПоляРасшифровки);
	КонецЕсли;
	бит_УправленческийУчет.СкопироватьОтбор(
			НастройкиОтчета.Отбор,            // Источник
			ПользовательскийОтборРасшифровки, // Приемник
			Истина,                           // Только используемые
			ПоляИсключения);                  // Поля исключения
	
	// Добавим отборы по полям расшифровки
	Если Параметры.Свойство("ПоляРасшифровки") И ЗначениеЗаполнено(Параметры.ПоляРасшифровки) Тогда
		Для Каждого Поле Из Параметры.ПоляРасшифровки Цикл
			НовыйОтбор = ПользовательскийОтборРасшифровки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле.Ключ);
			НовыйОтбор.ПравоеЗначение = Поле.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Возврат КомпоновщикНастроекРасшифровки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРодителейПоляРасшифровки(ЭлементРасшифровки, СписокПолейРасшифровки)
	
	ИерархическаяСтруктура = Новый Структура("ЛевоеЗначение, ВидСравнения, ПравоеЗначение");
	ИерархическаяСтруктура.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Для каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			Если Поле.Иерархия Тогда
				ИерархическаяСтруктура.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле.Поле);
				ИерархическаяСтруктура.ПравоеЗначение = Поле.Значение;
				СписокПолейРасшифровки.Добавить(ИерархическаяСтруктура, Поле.Поле);
			Иначе
				СписокПолейРасшифровки.Добавить(Поле.Значение, Поле.Поле);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Для каждого Родитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
		ДобавитьРодителейПоляРасшифровки(Родитель, СписокПолейРасшифровки);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
