
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.3] [ASHolyavko@1cbit.ru] [05.11.2025] +        
	
	//Кнопка
	Команда = ЭтаФорма.Команды.Добавить("бит_ПеренестиКатегорииИзДопРеквизита");
	Команда.Действие = "бит_ПеренестиКатегорииИзДопРеквизита";
	Команда.Заголовок = "(бит) Перенести категории из Доп. реквизита";
	
	//Добавляем новую кнопку
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ПеренестиКатегорииИзДопРеквизита", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.Заголовок = "(бит) Перенести категории из Доп. реквизита";
	НовыйЭлемент.ИмяКоманды = "бит_ПеренестиКатегорииИзДопРеквизита"; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.3] [ASHolyavko@1cbit.ru] [05.11.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ПеренестиКатегорииИзДопРеквизита(Команда)
	
	бит_ПеренестиКатегорииИзДопРеквизитаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура бит_ПеренестиКатегорииИзДопРеквизитаНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДолжностиДополнительныеРеквизиты.Ссылка КАК Ссылка,
		|	ДолжностиДополнительныеРеквизиты.Значение.Наименование КАК ЗначениеНаименование
		|ИЗ
		|	Справочник.Должности.ДополнительныеРеквизиты КАК ДолжностиДополнительныеРеквизиты
		|ГДЕ
		|	ДолжностиДополнительныеРеквизиты.Ссылка.бит_КатегорияДолжности ЕСТЬ NULL
		|	И ДолжностиДополнительныеРеквизиты.Свойство.Имя = &ИмяСвойства";
	
	Запрос.УстановитьПараметр("ИмяСвойства", "");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДолжностьОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Если ВыборкаДетальныеЗаписи.ЗначениеНаименование = "" Тогда
			
			ДолжностьОбъект.бит_КатегорияДолжности = Перечисления.бит_КатегорииДолжности.ОсновныеРабочие;
			
		КонецЕсли;
		
		
		ДолжностьОбъект.Записать();
		
	КонецЦикла;
	
    Сообщить("Выполнено!");
	
КонецПроцедуры