#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Если НЕ ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ТаблицаДокументаДляСравнения", ТаблицаДокументаДляСравнения());
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 

	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ТаблицыДляУстановкиСтатуса = ТаблицыДляУстановкиСтатуса();
		ОтменитьИзменениеСтатусов(ТаблицыДляУстановкиСтатуса.УдаленныеИзСписка, 
			ТаблицыДляУстановкиСтатуса.ЗакрытыеДокументы);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект, Ложь);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыПроведения = Документы.бит_кзн_ЗакрытиеДокументовПланирования.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Реквизиты 			= ПараметрыПроведения.Реквизиты;
	
	ДанныеДляИзмененияСтатусов = ДанныеДляИзмененияСтатусов(ПараметрыПроведения.ДокументыПланирования);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Проведен = Проведен Тогда
		ТаблицыДляУстановкиСтатуса = ТаблицыДляУстановкиСтатуса();
		ОтменитьИзменениеСтатусов(ТаблицыДляУстановкиСтатуса.УдаленныеИзСписка, 
			ТаблицыДляУстановкиСтатуса.УдаленныеИзСписка.СкопироватьКолонки());
	КонецЕсли; 
	
	Документы.бит_кзн_ЗакрытиеДокументовПланирования.СформироватьПланируемыйРасходДенежныхСредств(
		ПараметрыПроведения.ПланируемыйРасходДенежныхСредств, Реквизиты, Движения);
	Документы.бит_кзн_ЗакрытиеДокументовПланирования.СформироватьПланируемоеПоступлениеДенежныхСредств(
		ПараметрыПроведения.ПланируемоеПоступлениеДенежныхСредств, Реквизиты, Движения);
	Документы.бит_кзн_ЗакрытиеДокументовПланирования.СформироватьПланируемыеЗатраты(
		ПараметрыПроведения.ПланируемыеЗатраты, Реквизиты, Движения);
		
	Документы.бит_кзн_ЗакрытиеДокументовПланирования.СформироватьКонтрольныеЗначенияБюджетов(
		ПараметрыПроведения, Движения);
	
	УстановитьСтатусДокументовПланирования(ДанныеДляИзмененияСтатусов);
	ОтклонитьАктивныеВизы(Отказ);
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		// Заполнить реквизиты значениями по умолчанию.
		бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), Неопределено);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Дата) Тогда
		Дата = КонецДня(Дата);
	Иначе
		Дата = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли; 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	ИначеЕсли (ДанныеЗаполнения = Неопределено) ИЛИ НЕ Метаданные().ТабличныеЧасти.ДокументыПланирования.Реквизиты.ДокументПланирования.Тип.СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда
		Возврат;
	Иначе	
		
		РеквизитыОснования = ДанныеЗаполнения.Метаданные().Реквизиты;
		
		// Если есть реквизит "Организация", тогда
		Если РеквизитыОснования.Найти("Организация") <> Неопределено Тогда
			Организация = ДанныеЗаполнения.Организация;
		КонецЕсли;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") 
			ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_кзн_ПозицияПоступления") Тогда
			
			ПозицияТекст = ?(ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция"), "бит_кзн_ПлатежнаяПозиция","бит_кзн_ПозицияПоступления");
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ "+ПозицияТекст+".Ссылка) КАК Ссылка
			|ИЗ
			|	Документ."+ПозицияТекст+" КАК "+ПозицияТекст+"
			|ГДЕ
			|	"+ПозицияТекст+".ДокументПланирования = &ДокументПланирования";
			Запрос.УстановитьПараметр("ДокументПланирования", ДанныеЗаполнения.ДокументПланирования);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл  
				Если Выборка.Ссылка = 1 Тогда
					НовСтрока = ДокументыПланирования.Добавить();
					НовСтрока.ДокументПланирования = ДанныеЗаполнения.ДокументПланирования;
					НовСтрока.ПричинаЗакрытия = Справочники.бит_ПричиныЗакрытияДокументовПланированияПлатежа.Отмена;
				Иначе
					НовСтрока = ДокументыПланирования.Добавить();
					НовСтрока.ДокументПланирования = ДанныеЗаполнения;
					НовСтрока.ПричинаЗакрытия = Справочники.бит_ПричиныЗакрытияДокументовПланированияПлатежа.Отмена;
				КонецЕсли;
			КонецЦикла;	
		Иначе 		
			НовСтрока = ДокументыПланирования.Добавить();
			НовСтрока.ДокументПланирования = ДанныеЗаполнения;
			НовСтрока.ПричинаЗакрытия = Справочники.бит_ПричиныЗакрытияДокументовПланированияПлатежа.Отмена;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	//Заполнить реквизиты значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), Неопределено);
	
	// Очистим табличную часть "ДокументыПланирования".
	ДокументыПланирования.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьЗаполнениеДокументыПланирования(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляИзмененияСтатусов(ТаблицаПоДокументам)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументыПланирования", ТаблицаПоДокументам);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	ДокументыПланирования.ПричинаЗакрытия КАК ПричинаЗакрытия
	|ПОМЕСТИТЬ ДокументыПланированияИсходная
	|ИЗ
	|	&ДокументыПланирования КАК ДокументыПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	ДокументыПланирования.ПричинаЗакрытия КАК ПричинаЗакрытия
	|ПОМЕСТИТЬ ДокументыПланирования
	|ИЗ
	|	ДокументыПланированияИсходная КАК ДокументыПланирования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_кзн_ПозицияПоступления.Ссылка,
	|	NULL
	|ИЗ
	|	Документ.бит_кзн_ПозицияПоступления КАК бит_кзн_ПозицияПоступления
	|ГДЕ
	|	бит_кзн_ПозицияПоступления.ДокументПланирования В
	|			(ВЫБРАТЬ
	|				ДокументыПланированияИсходная.ДокументПланирования
	|			ИЗ
	|				ДокументыПланированияИсходная КАК ДокументыПланированияИсходная)
	|	И НЕ бит_кзн_ПозицияПоступления.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_кзн_ПлатежнаяПозиция.Ссылка,
	|	NULL
	|ИЗ
	|	Документ.бит_кзн_ПлатежнаяПозиция КАК бит_кзн_ПлатежнаяПозиция
	|ГДЕ
	|	бит_кзн_ПлатежнаяПозиция.ДокументПланирования В
	|			(ВЫБРАТЬ
	|				ДокументыПланированияИсходная.ДокументПланирования
	|			ИЗ
	|				ДокументыПланированияИсходная КАК ДокументыПланированияИсходная)
	|	И НЕ бит_кзн_ПлатежнаяПозиция.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектов.Объект КАК ДокументПланирования,
	|	СтатусыОбъектов.ВидСтатуса КАК ВидСтатуса,
	|	СтатусыОбъектов.Статус КАК Статус,
	|	СтатусыОбъектов.СтатусПредыдущий КАК СтатусПредыдущий
	|ПОМЕСТИТЬ СтатусыОбъектов
	|ИЗ
	|	РегистрСведений.бит_СтатусыОбъектов КАК СтатусыОбъектов
	|ГДЕ
	|	СтатусыОбъектов.Объект В
	|			(ВЫБРАТЬ
	|				ДокументыПланирования.ДокументПланирования
	|			ИЗ
	|				ДокументыПланирования КАК ДокументыПланирования)
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.бит_СтатусыОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	ДокументыПланирования.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	СтатусыДокументовПланирования.Статус КАК Статус,
	|	СтатусыДокументовПланирования.СтатусПредыдущий КАК СтатусПредыдущий
	|ИЗ
	|	ДокументыПланирования КАК ДокументыПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыОбъектов КАК СтатусыДокументовПланирования
	|		ПО ДокументыПланирования.ДокументПланирования = СтатусыДокументовПланирования.ДокументПланирования";
	
	ТаблицаПоДокументам = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПоДокументам;
	
КонецФункции // ПолучитьСтруктуруДанныхДляИзмененияСтатусов()

Процедура ПроверитьЗаполнениеДокументыПланирования(Отказ)

	Если ДокументыПланирования.Количество() = 0 Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , "Заполнение",,,
							НСтр("ru='Документы планирования';en='Planning Documents'")); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
	Иначе
		
		ПолеСписка = Новый Структура("ДокументПланирования");
		бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект, "ДокументыПланирования", 
				ПолеСписка, Отказ);

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент",		Ссылка);
		Запрос.УстановитьПараметр("ДокументыПланирования" , ДокументыПланирования.Выгрузить());
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования
		|ПОМЕСТИТЬ ДокументыПланирования
		|ИЗ
		|	&ДокументыПланирования КАК ДокументыПланирования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыПланирования.Ссылка КАК Ссылка,
		|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования
		|ИЗ
		|	Документ.бит_кзн_ЗакрытиеДокументовПланирования.ДокументыПланирования КАК ДокументыПланирования
		|ГДЕ
		|	ДокументыПланирования.ДокументПланирования В
		|			(ВЫБРАТЬ
		|				ДокументыПланирования.ДокументПланирования
		|			ИЗ
		|				ДокументыПланирования КАК ДокументыПланирования)
		|	И ДокументыПланирования.Ссылка <> &ТекущийДокумент
		|	И ДокументыПланирования.Ссылка.Проведен";
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пояснение = НСтр("ru='Уже закрыт документом %1.';en='Already closed document %1.'");
		Для каждого СтрокаТаблицы Из ДокументыПланирования Цикл
		
			Поле = "ДокументыПланирования[%1].ДокументПланирования";
			Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						Поле, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="));
		
			Если Выборка.НайтиСледующий(Новый Структура("ДокументПланирования", СтрокаТаблицы.ДокументПланирования)) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
									НСтр("ru='Документ планирования';en='Planning Document'"), СтрокаТаблицы.НомерСтроки, 
									НСтр("ru='Документы планирования';en='Planning Documents'"), СтрШаблон(Пояснение, Выборка.Ссылка));				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры

Процедура УстановитьСтатусДокументовПланирования(ТаблицаПоДокументам)
	
	Если ТаблицаПоДокументам.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
    ДатаИзмененияСтатуса = ТекущаяДатаСеанса();
	
	Для каждого ТекСтрока Из ТаблицаПоДокументам Цикл
		// Получаем статус для закрытия из соответствия.
		НовыйСтатус = Справочники.бит_СтатусыОбъектов.Закрыт;
		Если НовыйСтатус <> ТекСтрока.Статус Тогда
			ПараметрыУстановкиСтатуса = бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса();
			ПараметрыУстановкиСтатуса.Объект               = ТекСтрока.ДокументПланирования; 
			ПараметрыУстановкиСтатуса.Статус               = НовыйСтатус;
			ПараметрыУстановкиСтатуса.СтатусПредыдущий     = ТекСтрока.Статус;
			ПараметрыУстановкиСтатуса.ДатаИзмененияСтатуса = ДатаИзмененияСтатуса;
			
			// Устанавливаем новый статус для документа планирования.
			бит_ВизированиеСервер.УстановитьСтатусОбъекта(ПараметрыУстановкиСтатуса);
		КонецЕсли; 
	КонецЦикла;
		
КонецПроцедуры

Процедура ОтклонитьАктивныеВизы(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ЗакрытиеЗаявокДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	бит_ЗакрытиеЗаявокДокументыПланирования.ПричинаЗакрытия КАК ПричинаЗакрытия
	|ПОМЕСТИТЬ ЗакрываемыеДокументы
	|ИЗ
	|	Документ.бит_кзн_ЗакрытиеДокументовПланирования.ДокументыПланирования КАК бит_ЗакрытиеЗаявокДокументыПланирования
	|ГДЕ
	|	бит_ЗакрытиеЗаявокДокументыПланирования.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗакрываемыеДокументы.ДокументПланирования КАК ДокументПланирования,
	|	ЗакрываемыеДокументы.ПричинаЗакрытия КАК ПричинаЗакрытия
	|ИЗ
	|	ЗакрываемыеДокументы КАК ЗакрываемыеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_УстановленныеВизы КАК бит_УстановленныеВизы
	|		ПО ЗакрываемыеДокументы.ДокументПланирования = бит_УстановленныеВизы.Объект
	|			И (бит_УстановленныеВизы.АктивнаяВиза)";
	РезультатАктивныеВизы = Запрос.Выполнить();
	Если РезультатАктивныеВизы.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Решение"      , Справочники.бит_ВидыРешенийСогласования.Отклонено);
	ПараметрыЗакрытия.Вставить("ДатаУстановки", ТекущаяДатаСеанса());
	ПараметрыЗакрытия.Вставить("Пользователь" , Пользователи.ТекущийПользователь()); 
	ПараметрыЗакрытия.Вставить("Комментарий"  , НСтр("ru='Введено закрытие документов планирования';
													 |en='Permission closure planning documents'"));
	
	ВыборкаОбъектовВизирования = РезультатАктивныеВизы.Выбрать();
	Пока ВыборкаОбъектовВизирования.Следующий() Цикл
		
		ОбъектВизирования = ВыборкаОбъектовВизирования.ДокументПланирования;
		
		НаборВизированияОбъекта = РегистрыСведений.бит_УстановленныеВизы.СоздатьНаборЗаписей();
		НаборВизированияОбъекта.Отбор.Объект.Установить(ОбъектВизирования);
		НаборВизированияОбъекта.Прочитать();
		
		Для каждого ЗаписьНабора Из НаборВизированияОбъекта Цикл
			Если НЕ ЗаписьНабора.АктивнаяВиза Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, ПараметрыЗакрытия);
		КонецЦикла;
		
		бит_ВизированиеСервер.ДовыполнитьАлгоритмВизирования(ОбъектВизирования.ПолучитьОбъект(), НаборВизированияОбъекта, Ложь);
		бит_ВизированиеСервер.УстановитьКрайниеДатыВизирования(ОбъектВизирования, НаборВизированияОбъекта);
		бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборВизированияОбъекта);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаДокументаДляСравнения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	ДокументыПланирования.ПричинаЗакрытия КАК ПричинаЗакрытия
	|ИЗ
	|	Документ.бит_кзн_ЗакрытиеДокументовПланирования.ДокументыПланирования КАК ДокументыПланирования
	|ГДЕ
	|	ДокументыПланирования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаДокумента = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаДокумента;

КонецФункции

Функция ТаблицыДляУстановкиСтатуса()
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		
		ЗакрытыеДокументы = ДокументыПланирования.Выгрузить();
		УдаленныеИзСписка = ЗакрытыеДокументы.СкопироватьКолонки("ДокументПланирования, ПричинаЗакрытия");
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("ТаблицаДокументаДляСравнения", ДополнительныеСвойства.ТаблицаДокументаДляСравнения);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
		|	ДокументыПланирования.ПричинаЗакрытия КАК ПричинаЗакрытия
		|ПОМЕСТИТЬ ТаблицаДокументаДляСравнения
		|ИЗ
		|	&ТаблицаДокументаДляСравнения КАК ДокументыПланирования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
		|	ДокументыПланирования.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ИСТИНА КАК ВСписке
		|ИЗ
		|	Документ.бит_кзн_ЗакрытиеДокументовПланирования.ДокументыПланирования КАК ДокументыПланирования
		|ГДЕ
		|	ДокументыПланирования.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокументаДляСравнения.ДокументПланирования КАК ДокументПланирования,
		|	ТаблицаДокументаДляСравнения.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ЛОЖЬ КАК ВСписке
		|ИЗ
		|	ТаблицаДокументаДляСравнения КАК ТаблицаДокументаДляСравнения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_кзн_ЗакрытиеДокументовПланирования.ДокументыПланирования КАК ДокументыПланирования
		|		ПО ТаблицаДокументаДляСравнения.ДокументПланирования = ДокументыПланирования.ДокументПланирования
		|			И (ДокументыПланирования.Ссылка = &Ссылка)
		|ГДЕ
		|	ДокументыПланирования.ДокументПланирования ЕСТЬ NULL";
		
		Пакет = Запрос.ВыполнитьПакет();
		ЗакрытыеДокументы = Пакет[1].Выгрузить(); 
		УдаленныеИзСписка = Пакет[2].Выгрузить();
	КонецЕсли; 
	
	ТаблицыДляУстановкиСтатуса = Новый Структура;
	ТаблицыДляУстановкиСтатуса.Вставить("ЗакрытыеДокументы", ЗакрытыеДокументы);
	ТаблицыДляУстановкиСтатуса.Вставить("УдаленныеИзСписка", УдаленныеИзСписка);

	Возврат ТаблицыДляУстановкиСтатуса;
	
КонецФункции

Процедура ОтменитьИзменениеСтатусов(УдаленныеИзСписка, ЗакрытыеДокументы)

	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ЗакрытыеДокументы, УдаленныеИзСписка);
	
	ТекДата	= ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументыПланирования", УдаленныеИзСписка.ВыгрузитьКолонку("ДокументПланирования"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежнаяПозиция.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СвязанныеДокументы
	|ИЗ
	|	Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежнаяПозиция
	|ГДЕ
	|	ПлатежнаяПозиция.ДокументПланирования В(&ДокументыПланирования)
	|	И НЕ ПлатежнаяПозиция.Ссылка В (&ДокументыПланирования)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПозицияПоступления.Ссылка
	|ИЗ
	|	Документ.бит_кзн_ПозицияПоступления КАК ПозицияПоступления
	|ГДЕ
	|	ПозицияПоступления.ДокументПланирования В(&ДокументыПланирования)
	|	И НЕ ПозицияПоступления.Ссылка В (&ДокументыПланирования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектов.Объект КАК Объект,
	|	СтатусыОбъектов.ВидСтатуса КАК ВидСтатуса,
	|	СтатусыОбъектов.Статус КАК СтатусПредыдущий,
	|	СтатусыОбъектов.СтатусПредыдущий КАК Статус,
	|	СтатусыОбъектов.Пользователь КАК Пользователь,
	|	СтатусыОбъектов.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса
	|ИЗ
	|	РегистрСведений.бит_СтатусыОбъектов КАК СтатусыОбъектов
	|ГДЕ
	|	(СтатусыОбъектов.Объект В (&ДокументыПланирования)
	|			ИЛИ СтатусыОбъектов.Объект В
	|				(ВЫБРАТЬ
	|					СвязанныеДокументы.Ссылка
	|				ИЗ
	|					СвязанныеДокументы КАК СвязанныеДокументы))";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПараметрыУстановкиСтатуса = бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса();
		ПараметрыУстановкиСтатуса.Объект               = Выборка.Объект; 
		ПараметрыУстановкиСтатуса.Статус               = Выборка.Статус;
		ПараметрыУстановкиСтатуса.СтатусПредыдущий     = Выборка.СтатусПредыдущий;
		ПараметрыУстановкиСтатуса.ДатаИзмененияСтатуса = ТекДата;
		
		бит_ВизированиеСервер.УстановитьСтатусОбъекта(ПараметрыУстановкиСтатуса);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли