// {{ПервыйБИТ ЛистТребований [ЛТ6.9] [Микляев К.А.] [04.06.2026] +

&После("ПриСозданииНаСервере")
Процедура бит_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоздатьПолеПризнакаПечати();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПолеПризнакаПечати()
	
	Если Элементы.Найти("бит_Напечатано") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = Элементы.Найти("Группа4");
	Если Родитель = Неопределено Тогда
		Родитель = Элементы.Найти("ГруппаДополнительно");
	КонецЕсли;
	Если Родитель = Неопределено Тогда
		Родитель = Элементы.Найти("СтраницаДополнительно");
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйЭлемент = Элементы.Добавить("бит_Напечатано", Тип("ПолеФормы"), Родитель);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Напечатано";
	НовыйЭлемент.Заголовок = "Напечатано";
	НовыйЭлемент.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

// }}ПервыйБИТ ЛистТребований [ЛТ6.9] [Микляев К.А.] [04.06.2026] -
