
#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		ТекстОшибки = "";
		Если ВидыВыполняемыхРабот.Количество() = 0 Тогда
			ТекстОшибки = "Виды работ обязательны для заполнения. Заполните Виды работ и отсканируйте QR повторно";
		ИначеЕсли ИсполнителиРабот.Количество() = 0 Тогда
			ТекстОшибки = "Исполнители обязательны для заполнения. Заполните исполнителей и отсканируйте QR повторно";
		ИначеЕсли Не ЗначениеЗаполнено(Подразделение) Тогда
			ТекстОшибки = "Подразделение обязательно для заполнения. Заполните и отсканируйте QR повторно";   
		ИначеЕсли Не ЗначениеЗаполнено(ВидРабочегоЦентра) Тогда
			ТекстОшибки = "Вид рабочего центра обязателен для заполнения. Заполните и отсканируйте QR повторно";
		КонецЕсли;
		Если Не ПустаяСтрока(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		Если ИмяСобытия = "ScanData" Тогда
			Назначение = ПредопределенноеЗначение("Справочник.Назначения.ПустаяСсылка");
			
			стрШтрихкод = ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			// Если при сканировании подразделение или ВРЦ не соответствует установленным в настройках АРМа  -  выдавать сообщение "Подразделение/ВРЦ не соответствует сканируемым. Отсканируйте QR код, соответствующий указанному в настройках АРМ Специалиста".
			Если Подразделение <> стрШтрихкод.Подразделение Или ВидРабочегоЦентра <> стрШтрихкод.ВидРабочегоЦентра Тогда
				ТекстОшибки = "Подразделение/ВРЦ не соответствует сканируемым. Отсканируйте QR код, соответствующий указанному в настройках АРМ Специалиста";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Иначе
				ЗаполнитьЭтапы(стрШтрихкод);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ИнтерфейсФормы

&НаКлиенте
Процедура НастройкаРабочегоМеста(Команда)                                                                                                     
	ОповещениеОЗакрытииОкнаНастроек = Новый ОписаниеОповещения("ПослеЗакрытияОкнаНастроек", ЭтотОбъект);
	ОткрытьФорму("Обработка.бит_АРМСпециалиста.Форма.ФормаНастройки", , ЭтаФорма, УникальныйИдентификатор, , , ОповещениеОЗакрытииОкнаНастроек, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры                                                  

&НаКлиенте
Процедура ПослеЗакрытияОкнаНастроек(ЗначениеНастроек, ДопПараметры) Экспорт
	Если ТипЗнч(ЗначениеНастроек) = Тип("Структура") Тогда
		Подразделение = ЗначениеНастроек.Подразделение;
		ВидРабочегоЦентра = ЗначениеНастроек.ВидРабочегоЦентра;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыВыполняемыхРаботПриИзменении(Элемент)
	ЭтапыПроизводства.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВидыРабот(Команда)
	ВидыВыполняемыхРабот.Очистить();
	ЭтапыПроизводства.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВидРаботы(Команда)
	мВыделенныхСтрок = Элементы.ВидыВыполняемыхРабот.ВыделенныеСтроки;
	Для каждого стр из мВыделенныхСтрок Цикл
		ВидыВыполняемыхРабот.Удалить(ВидыВыполняемыхРабот.НайтиПоИдентификатору(стр));
	КонецЦикла;                  
	ЭтапыПроизводства.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсполнителей(Команда)
	ИсполнителиРабот.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИсполнителя(Команда)
	мВыделенныхСтрок = Элементы.ИсполнителиРабот.ВыделенныеСтроки;
	Для Каждого стр из мВыделенныхСтрок Цикл
		ИсполнителиРабот.Удалить(ИсполнителиРабот.НайтиПоИдентификатору(стр));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВидРаботы(Команда)
	ПФ = Новый Структура;
	ПФ.Вставить("РежимВыбора", Истина);
	ПФ.Вставить("ЗакрыватьПриВыборе", Истина);
	ПФ.Вставить("МножественныйВыбор", Ложь);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораИзСправочника", ЭтотОбъект, "ВидыРабот");
	ОткрытьФорму("Справочник.ВидыРаботСотрудников.ФормаВыбора", ПФ, ЭтаФорма, УникальныйИдентификатор, , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИсполнителя(Команда)
	ПФ = Новый Структура;
	ПФ.Вставить("РежимВыбора", Истина);
	ПФ.Вставить("ЗакрыватьПриВыборе", Истина);
	ПФ.Вставить("МножественныйВыбор", Ложь);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораИзСправочника", ЭтотОбъект, "Исполнители");
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПФ, ЭтаФорма, УникальныйИдентификатор, , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзСправочника(ВыбЗнач, ДопПараметр) Экспорт
	
	Если ВыбЗнач <> Неопределено Тогда
		Если ДопПараметр = "ВидыРабот" И ВидыВыполняемыхРабот.НайтиСтроки(Новый Структура("ВидРабот", ВыбЗнач)).Количество() = 0 Тогда
			нов = ВидыВыполняемыхРабот.Добавить();
			нов.ВидРабот = ВыбЗнач;                 
			ЭтапыПроизводства.Очистить();
		ИначеЕсли ДопПараметр = "Исполнители" И ИсполнителиРабот.НайтиСтроки(Новый Структура("Исполнители", ВыбЗнач)).Количество() = 0 Тогда
			нов = ИсполнителиРабот.Добавить();
			нов.Исполнители = ВыбЗнач;
		КонецЕсли;   
	КонецЕсли;
	
КонецПроцедуры                                      

#КонецОбласти

&НаСервереБезКонтекста
Функция ПреобразоватьДанныеСоСканераВСтруктуру(Параметр)
	
	Структура = Новый Структура;
	Структура.Вставить("ЗаказНаПроизводство");
	Структура.Вставить("Назначение");
	Структура.Вставить("Подразделение");
	Структура.Вставить("ВидРабочегоЦентра");
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЭтапы(стрШтрихкод) 
	
	Назначение = стрШтрихкод.Назначение;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЭтапПроизводства2_2.Ссылка КАК ЭтапПроизводства,
	                      |	ЭтапПроизводства2_2.Спецификация.ОсновноеИзделиеНоменклатура КАК Номенклатура,
	                      |	ЭтапПроизводства2_2.Спецификация.ОсновноеИзделиеХарактеристика КАК Характеристика,
	                      |	ЭтапПроизводства2_2.КоличествоУпаковокПлан КАК Количество,
	                      |	ЭтапПроизводства2_2.УпаковкаПлан КАК ЕдиницаИзмерения,
	                      |	ЭтапПроизводства2_2.Распоряжение КАК ЗаказНапроизводство,
	                      |	ЭтапПроизводства2_2.НазначениеПродукция КАК НазначениеПродукция
	                      |ПОМЕСТИТЬ База
	                      |ИЗ
	                      |	Документ.ЭтапПроизводства2_2.ВидыРабочихЦентров КАК ЭтапПроизводства2_2ВидыРабочихЦентров
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.Трудозатраты КАК ЭтапПроизводства2_2Трудозатраты
	                      |			ПО (ЭтапПроизводства2_2Трудозатраты.Ссылка = ЭтапПроизводства2_2.Ссылка)
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	                      |			ПО ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = ЭтапПроизводства2_2.Ссылка
	                      |		ПО ЭтапПроизводства2_2ВидыРабочихЦентров.Ссылка = ЭтапПроизводства2_2.Ссылка
	                      |ГДЕ
	                      |	ЭтапПроизводства2_2.Распоряжение = &Распоряжение
	                      |	И ЭтапПроизводства2_2.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.КВыполнению), ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат))
	                      |	И ЭтапПроизводства2_2.Подразделение = &Подразделение
	                      |	И ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра = &ВидРабочегоЦентра
	                      |	И ЭтапПроизводства2_2Трудозатраты.ВидРабот В(&ВидРабот)
	                      |	И ЭтапПроизводства2_2ВыходныеИзделия.Назначение = &Назначение
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ИСТИНА КАК КВыполнению,
	                      |	База.ЭтапПроизводства КАК ЭтапПроизводства,
	                      |	База.Номенклатура КАК Номенклатура,
	                      |	База.Характеристика КАК Характеристика,
	                      |	База.Количество КАК Количество,
	                      |	База.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                      |	ЗаказНаПроизводство2_2Продукция.Номенклатура.Наименование + "";"" + ЗаказНаПроизводство2_2Продукция.Характеристика.Наименование КАК НоменклатураХарактеристикаГП
	                      |ИЗ
	                      |	База КАК База
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	                      |		ПО База.ЗаказНапроизводство = ЗаказНаПроизводство2_2Продукция.Ссылка
	                      |			И База.НазначениеПродукция = ЗаказНаПроизводство2_2Продукция.Назначение");
	Запрос.УстановитьПараметр("Подразделение"		, Подразделение);
	Запрос.УстановитьПараметр("ВидРабочегоЦентра"	, ВидРабочегоЦентра);
	Запрос.УстановитьПараметр("ВидРабот"			, ВидыВыполняемыхРабот.Выгрузить( , "ВидРабот").ВыгрузитьКолонку("ВидРабот"));
	Запрос.УстановитьПараметр("Назначение"			, Назначение);
	Запрос.УстановитьПараметр("Распоряжение"		, стрШтрихкод.ЗаказНаПроизводство);
	ЭтапыПроизводства.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры                            

&НаКлиенте
асинх Процедура ВыполнитьЭтапы(Команда)
	
	Если ЭтапыПроизводства.Количество() = 0 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет этапов к выполнению");
		Возврат;
	КонецЕсли;
	
	ВыполнитьЭтапыНаСервере();
	Если ЭтапыПроизводства.Итог("Ошибка") <> 0 Тогда
		ответ = Ждать ВопросАсинх("Снять признак `К выполнению` с этапов, которые не удалось закрыть?", РежимДиалогаВопрос.ДаНет);
		Если ответ = КодВозвратаДиалога.Да Тогда
			Для каждого стр из ЭтапыПроизводства Цикл
				Если стр.Ошибка И стр.КВыполнению Тогда
					стр.КВыполнению = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры                

&НаСервере
Процедура ВыполнитьЭтапыНаСервере()
	
	мВидовРаботАРМ 	 = ВидыВыполняемыхРабот.Выгрузить().ВыгрузитьКолонку("ВидРабот");
	мИсполнители 	 = ИсполнителиРабот.Выгрузить().ВыгрузитьКолонку("Исполнители");
	
	МерныеТоварыККорректировке.Очистить();
	ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
		Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
	ТипЗаказа = "ЭтапПроизводства2_2";
	ИспользуетсяСтатусЗакрыт = Истина;
	стрПараметры = Новый Структура;         
											
	// получим серии к распределению
	Запрос = новый Запрос("ВЫБРАТЬ
		|	вт.ЭтапПроизводства КАК ЭтапПроизводства,
		|	вт.КВыполнению КАК КВыполнению,
		|	вт.Отработан КАК Отработан
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	&вт КАК вт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.ЭтапПроизводства КАК ЭтапПроизводства,
		|	ЭтапВыходныеИзделия.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапВыходныеИзделия
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|			ПО (ЭтапВыходныеИзделия.Номенклатура.ВидНоменклатуры = СерииНоменклатуры.ВидНоменклатуры)
		|				И (ЭтапВыходныеИзделия.Ссылка.Распоряжение = СерииНоменклатуры.ГС_ЗаказНаПроизводство)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|			ПО (ЭтапВыходныеИзделия.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка)
		|		ПО (вт.ЭтапПроизводства = ЭтапВыходныеИзделия.Ссылка)
		|ГДЕ
		|	ВидыНоменклатуры.ИспользоватьСерии
		|	И вт.КВыполнению
		|	И НЕ вт.Отработан  
		|	И ЭтапВыходныеИзделия.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтапПроизводства,
		|	Номенклатура
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт.ЭтапПроизводства КАК ЭтапПроизводства
		|ИЗ
		|	вт КАК вт");                            
	Запрос.УстановитьПараметр("вт", ЭтапыПроизводства.Выгрузить(, "ЭтапПроизводства,КВыполнению,Отработан"));
	Результат = Запрос.ВыполнитьПакет();
	
	ТалицаСвободныхСерий = Результат[1].Выгрузить();
	
	мЭтапов = Результат[2].Выгрузить().ВыгрузитьКолонку("ЭтапПроизводства");

	ЗаполнитьОтклоненияПоЭтапамПроизводства(ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров, 
	                                        мЭтапов,
											стрПараметры);
	
	Для каждого текСтр из ЭтапыПроизводства Цикл
		Если текСтр.КВыполнению = Ложь Тогда
			Продолжить;
		КонецЕсли; 
		Если текСтр.Отработан = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		// Этап содержит только указанные виды работ, то происходит перевод этапа производства в статус "Завершен" 
		// с указанием материальных и трудовых затрат аналогично типовому механизму.
		мВидовРаботЭтапа = текСтр.ЭтапПроизводства.Трудозатраты.Выгрузить(, "ВидРабот");
		мВидовРаботЭтапа.Свернуть("ВидРабот");
		мВидовРаботЭтапа = мВидовРаботЭтапа.ВыгрузитьКолонку("ВидРабот");
		
		Если ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(мВидовРаботЭтапа, мВидовРаботАРМ) Тогда
			// происходит перевод этапа производства в статус "Завершен" 
			// с указанием материальных и трудовых затрат аналогично типовому механизму.
			// гиперссылка "закрыть этап " в этапе.   или диспетчирование этапов - дествие - отметить выполнение. ( брать её)
			//материалы в расход перебросить, статус поменять , исполнителя проставить. на вкладке обеспечение материал "отгрузить" по всем стркам. дата отгрузки = текущая.
			Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
			ОтработатьЭтап(стрПараметры, мВидовРаботЭтапа, мИсполнители, Статус, ТалицаСвободныхСерий,
							текСтр.ЭтапПроизводства, текСтр.Отработан, текСтр.Ошибка);
			
		ИначеЕсли 
			// Этап содержит указанные виды работ 
			ОбщегоНазначенияКлиентСервер.РазностьМассивов(мВидовРаботАРМ, мВидовРаботЭтапа).Количество() <> мВидовРаботАРМ.Количество()   
			// и другие виды работ, 
			И ОбщегоНазначенияКлиентСервер.РазностьМассивов(мВидовРаботЭтапа, мВидовРаботАРМ).Количество() <> 0 Тогда 
			// то происходит перевод этапа производства в статус "Начат",
			// в этапе указываются трудовые затраты только по указанным видам работ. 
			// здесь только исполнители и виды работ.
			//исполнителей только по совпадающим видам работ.
			Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Начат;
			ОтработатьЭтап(стрПараметры, мВидовРаботЭтапа, мИсполнители, Статус, Неопределено,
							текСтр.ЭтапПроизводства, текСтр.Отработан, текСтр.Ошибка);
			
		Иначе
			// Этап содержит ранее указанные трудозатраты 
			ЕстьТрудозатраты = Ложь;
			// в табличной части указаны виды работ, после которых отсутствуют работы к выполнению,
			ЕстьНераспределенныеВидыРабот = Ложь;
			Для каждого текТрудозатрата Из текСтр.ЭтапПроизводства.Трудозатраты Цикл
				Если ЗначениеЗаполнено(текТрудозатрата.Исполнитель) Тогда
					ЕстьТрудозатраты = Истина;
				ИначеЕсли Не ЗначениеЗаполнено(текТрудозатрата.Исполнитель) И мВидовРаботАРМ.Найти(текТрудозатрата.ВидРабот) <> Неопределено Тогда
					ЕстьНераспределенныеВидыРабот = Истина;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьТрудозатраты И ЕстьНераспределенныеВидыРабот Тогда
				// то происходит перевод этапа производства в статус "Завершен" с указанием материальных и трудовых затрат аналогично типовому механизму
				Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
				//материалы в расход перебросить, статус поменять , исполнителя проставить. на вкладке обеспечение материал "отгрузить" по всем стркам. дата отгрузки = текущая.
				ОтработатьЭтап(стрПараметры, мВидовРаботЭтапа, мИсполнители, Статус, ТалицаСвободныхСерий,
								текСтр.ЭтапПроизводства, текСтр.Отработан, текСтр.Ошибка);
			КонецЕсли;	
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтработатьЭтап(Знач стрПараметры, Знач мВидовРаботЭтапа, Знач мИсполнители, 
						 Знач Статус, Знач ТалицаСвободныхСерий, Знач ЭтапПроизводства, 
						 Отработан, Ошибка)
	
	// Заблокируем этап от редактирования
	Попытка
		ЗаблокироватьДанныеДляРедактирования(ЭтапПроизводства);
	Исключение
		ТекстОшибки = "Не удалось заблокировать " + ЭтапПроизводства + ":" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтапПроизводства);
		Возврат;
	КонецПопытки;

	ЭтапОбъект = ЭтапПроизводства.ПолучитьОбъект();
	
	//---------------------------------------------------
	ЗаполнитьТрудозатраты(ЭтапОбъект, мВидовРаботЭтапа, мИсполнители);
	
	//---------------------------------------------------
	Если ТалицаСвободныхСерий <> Неопределено Тогда
		// !!!  проверяем вид номенклатуры у этап.выходные изделия. если требуется учет по сериям то ищем серии в спр. серии ном.  
		// там есть реквизит заказ на производство. берем оттуда
		// Если в закрываемых этапах требуется указание серии для готовой продукции, 
		// то серия подбирается из справочника "Серии номенклатуры" по сопоставлению реквизитов:
		// Если серию подобрать не удалось, вывести сообщение "Не удалось подобрать серии для выходной продукции этапа ____ от ____. 
		// Невозможно закрыть этап". 
		ЗаполнитьСерииВыходныхИзделий(ЭтапОбъект, ТалицаСвободныхСерий, Ошибка);
		Если Ошибка Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось подобрать серии для выходной продукции " + ЭтапПроизводства + ". Невозможно закрыть этап", ЭтапПроизводства);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//--------------Перевод в статус---------------------------------
	
	//  происходит перевод этапа производства в статус "Завершен" (или начат)
	// с указанием материальных и трудовых затрат аналогично типовому механизму.
	// гиперссылка "закрыть этап " в этапе.   или диспетчирование этапов - дествие - отметить выполнение. ( брать её)
	//материалы в расход перебросить, статус поменять , исполнителя проставить. 
	// на вкладке обеспечение материал "отгрузить" по всем стркам. дата отгрузки = текущая.
	СтруктураДополнительныхПараметров = Новый Структура;
	СтруктураДополнительныхПараметров.Вставить("ИмяТабличнойЧасти",            "Товары");
	СтруктураДополнительныхПараметров.Вставить("ПричинаОтмены",                Неопределено);
	СтруктураДополнительныхПараметров.Вставить("ПроверятьОстатки",             Ложь);
	СтруктураДополнительныхПараметров.Вставить("ОтменитьНеотработанныеСтроки", стрПараметры.ОтменитьНеотработанныеСтроки);
	СтруктураДополнительныхПараметров.Вставить("СкорректироватьМерныеТовары",  стрПараметры.СкорректироватьМерныеТовары);
	СтруктураДополнительныхПараметров.Вставить("СкорректироватьМерныеТоварыПоПриемке", стрПараметры.СкорректироватьМерныеТоварыПоПриемке);
	СтруктураДополнительныхПараметров.Вставить("СкорректироватьЦены",          Ложь);
	СтруктураДополнительныхПараметров.Вставить("ЗакрыватьЗаказы",              Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен);
	
	Если Не ЭтапОбъект.УстановитьСтатус(Статус, СтруктураДополнительныхПараметров) Тогда
		Ошибка = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + ЭтапПроизводства + ". Не удалось установить статус " + Статус, ЭтапПроизводства);
		// Если в результате нажатия кнопки "Выполнить этапы" оказалось, что часть отобранных этапов не обеспечены материальными ресурсами, 
		// то такой этап невозможно закрыть из АРМа.   
		// Для каждой такой строки система выдает ошибку
		// ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + текСтр.ЭтапПроизводства + " невозможно закрыть по причине нехватки материальных ресурсов", текСтр.ЭтапПроизводства);  
		Возврат;
	КонецЕсли;
		
	// Запись документа
	Попытка
		ЭтапОбъект.Записать(РежимЗаписиДокумента.Проведение);
		РазблокироватьДанныеДляРедактирования(ЭтапПроизводства);
		Отработан = Истина; 
	Исключение      
		Ошибка = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + ЭтапПроизводства 
															+ ". Не удалось установить статус '" + Статус 
															+ "' по причине "  
															+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ЭтапПроизводства);
	КонецПопытки

КонецПроцедуры                                                                                                           

&НаСервереБезКонтекста
Процедура ЗаполнитьСерииВыходныхИзделий(ЭтапОбъект, ТалицаСвободныхСерий, Ошибка)
	
	мИспользованныхСерий = новый Массив;  
	// Можно удалять из ТалицаСвободныхСерий использованную серию, но пока так.
	
	стрПоиска = Новый Структура;
	стрПоиска.Вставить("ЭтапПроизводства", ЭтапОбъект.Ссылка);
	
	Для каждого стрВыходныеИзделия из ЭтапОбъект.ВыходныеИзделия Цикл 
		
		Если ЗначениеЗаполнено(стрВыходныеИзделия.Серия) Тогда
			мИспользованныхСерий.Добавить(стрВыходныеИзделия.Серия);
			Продолжить;
		КонецЕсли;      
		
		стрПоиска.Вставить("ВидНоменклатуры", стрВыходныеИзделия.Номенклатура.ВидНоменклатуры);
		мСтрокСерий = ТалицаСвободныхСерий.НайтиСтроки(стрПоиска);
		Если мСтрокСерий.Количество() = 0 Тогда
			Продолжить; // значит серии не нужны
		ИначеЕсли Не ЗначениеЗаполнено(мСтрокСерий[0].Серия) Тогда 
			Ошибка = Истина; // если серия не заполнена но строки есть, значит серии нужны но их нету. (см. запрос формирования таблицы)
		    Возврат;
		КонецЕсли;
		
		Для каждого стр из мСтрокСерий Цикл // найдем свободную серию
			Если мИспользованныхСерий.Найти(стр.Серия) <> Неопределено Тогда
				Продолжить; // уже брали такую серию
			Иначе                     
				мИспользованныхСерий.Добавить(стр.Серия);
				стрВыходныеИзделия.Серия = стр.Серия;
				стрВыходныеИзделия.СтатусУказанияСерий = 14;
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьТрудозатраты(ЭтапОбъект, Знач МассивВидовРабот, Знач МассивИсполнителей)
	
	// При указании трудовых затрат если указан один исполнитель, то в качестве исполнителя он транслируется в этап. 
	// Если указано несколько исполнителей, то каждый вид работ и количество разбивается несколько строк по количеству исполнителей.
	
    КопияТЗ = ЭтапОбъект.Трудозатраты.Выгрузить();
    КолИсполнителей = МассивИсполнителей.Количество();
	
    Для Каждого СтрКопии Из КопияТЗ Цикл
        // Вид работ не наш или Исполнитель уже заполнен — пропускаем
		Если МассивВидовРабот.Найти(СтрКопии.ВидРабот) = Неопределено 
			Или ЗначениеЗаполнено(СтрКопии.Исполнитель) Тогда
            Продолжить;
        КонецЕсли;

        // Ищем строку вида работ в этапе
        ИскомаяСтрока = ЭтапОбъект.Трудозатраты.Найти(СтрКопии.ВидРабот, "ВидРабот");
        Если ИскомаяСтрока = Неопределено Тогда
            Продолжить;
        КонецЕсли;
        ВсегоЧасов = ИскомаяСтрока.Количество;
        // Делим часы
        ЧасовНаОдного = Окр(ВсегоЧасов / КолИсполнителей, 3);
        Остаток = ВсегоЧасов - (ЧасовНаОдного * КолИсполнителей);
        // Удаляем строку в этапе
        ЭтапОбъект.Трудозатраты.Удалить(ИскомаяСтрока);
        // Создаём строки по исполнителям
        Для Инд = 0 По КолИсполнителей - 1 Цикл
            НоваяСтрока = ЭтапОбъект.Трудозатраты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрКопии); 
            НоваяСтрока.Исполнитель = МассивИсполнителей[Инд];
            НоваяСтрока.Количество = ЧасовНаОдного;
            // Остаток добавим первому
            Если Инд = 0 Тогда
                НоваяСтрока.Количество = НоваяСтрока.Количество + Остаток;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтклоненияПоЭтапамПроизводства(ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров, мЭтапыПроизводства, стрПараметры)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЭтапПроизводства2_2.Ссылка КАК ЗаказДавальца
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|ГДЕ
	|	ЭтапПроизводства2_2.Ссылка В(&ЭтапыПроизводства)
	|	И ЭтапПроизводства2_2.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)
	|	И &ИспользоватьСтатусЗакрыт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Заказ,
	|	Остатки.Номенклатура,
	|	Остатки.Характеристика,
	|	Остатки.Склад,
	|	Остатки.Серия,
	|	ВЫБОР
	|		КОГДА Остатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И Остатки.Заказ.Дата >= Остатки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОрдернаяСхемаПриОтгрузке,
	|	ВЫБОР
	|		КОГДА Остатки.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|				И Остатки.Заказ.Дата >= Остатки.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОрдернаяСхемаПриПоступлении,
	|	СУММА(Остатки.КОформлениюОстаток),
	|	СУММА(Остатки.ОстатокПоОрдерам),
	|	СУММА(Остатки.Заказано),
	|	СУММА(Остатки.КВыполнению)
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ (ВЫБРАТЬ
	|		ОстаткиКОформлению.Распоряжение               КАК Заказ,
	|		ОстаткиКОформлению.Номенклатура               КАК Номенклатура,
	|		ОстаткиКОформлению.Характеристика             КАК Характеристика,
	|		ОстаткиКОформлению.Склад                      КАК Склад,
	|		ОстаткиКОформлению.Серия                      КАК Серия,
	|		ОстаткиКОформлению.КОформлениюКонечныйОстаток КАК КОформлениюОстаток,
	|		0                                             КАК ОстатокПоОрдерам,
	|		ОстаткиКОформлению.ЗаказаноПриход             КАК Заказано,
	|		ОстаткиКОформлению.ЗаказаноПриход
	|			- ОстаткиКОформлению.КОформлениюПриход    КАК КВыполнению
	|	ИЗ
	|		РегистрНакопления.ЗаказыМатериаловВПроизводство.ОстаткиИОбороты(&НачПериод, &КонПериод,
	|			,, Распоряжение В (&ЭтапыПроизводства) И КодСтроки <> 0) КАК ОстаткиКОформлению
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ОстаткиКОтгрузке.ДокументОтгрузки КАК Заказ,
	|		ОстаткиКОтгрузке.Номенклатура     КАК Номенклатура,
	|		ОстаткиКОтгрузке.Характеристика   КАК Характеристика,
	|		ОстаткиКОтгрузке.Склад            КАК Склад,
	|		ОстаткиКОтгрузке.Серия            КАК Серия,
	|		0                                 КАК КОформлениюОстаток,
	|		ОстаткиКОтгрузке.КОтгрузкеОстаток КАК ОстатокПоОрдерам,
	|		0                                 КАК Заказано,
	|		0                                 КАК КВыполнению
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.Остатки(, ДокументОтгрузки В (&ЭтапыПроизводства)) КАК ОстаткиКОтгрузке) КАК Остатки
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Заказ,
	|	Остатки.Номенклатура,
	|	Остатки.Характеристика,
	|	Остатки.Склад,
	|	Остатки.Серия,
	|	ВЫБОР
	|		КОГДА Остатки.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И Остатки.Заказ.Дата >= Остатки.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Остатки.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|				И Остатки.Заказ.Дата >= Остатки.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Заказ,
	|	Остатки.Номенклатура,
	|	Остатки.Характеристика,
	|	Остатки.Склад,
	|	Остатки.Серия,
	|	ВЫБОР КОГДА Остатки.КОформлениюОстаток >= 0 И Остатки.КОформлениюОстаток < Остатки.ОстатокПоОрдерам
	|			ИЛИ Остатки.КОформлениюОстаток < 0
	|			ИЛИ НЕ Остатки.ОрдернаяСхемаПриОтгрузке ТОГДА
	|		Остатки.КОформлениюОстаток
	|	ИНАЧЕ
	|		Остатки.ОстатокПоОрдерам
	|	КОНЕЦ + Остатки.КВыполнению КАК Количество,
	|	ИСТИНА КАК ЭтоОтгрузка,
	|	Остатки.Заказано
	|ИЗ ВтОстатки КАК Остатки
	|ГДЕ
	|	ВЫБОР КОГДА Остатки.КОформлениюОстаток >= 0 И Остатки.КОформлениюОстаток < Остатки.ОстатокПоОрдерам
	|			ИЛИ Остатки.КОформлениюОстаток < 0
	|			ИЛИ НЕ Остатки.ОрдернаяСхемаПриОтгрузке ТОГДА
	|		Остатки.КОформлениюОстаток
	|	ИНАЧЕ
	|		Остатки.ОстатокПоОрдерам
	|	КОНЕЦ + Остатки.КВыполнению <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОтгрузке.Номенклатура    КАК Номенклатура,
	|	ТоварыКОтгрузке.Характеристика  КАК Характеристика,
	|	ТоварыКОтгрузке.Серия           КАК Серия,
	|	ИСТИНА                          КАК ЭтоОтгрузка,
	|	ТоварыКОтгрузке.Распоряжение    КАК Заказ,
	|	ТоварыКОтгрузке.Склад           КАК Склад,
	|	СУММА(ТоварыКОтгрузке.КОформлениюПриход
	|		* (&ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100)) КАК ДопустимоеОтклонение
	|ИЗ
	|	РегистрНакопления.ЗаказыМатериаловВПроизводство.Обороты(&НачПериод, &КонПериод,
	|		, Распоряжение В (&ЭтапыПроизводства)) КАК ТоварыКОтгрузке
	|ГДЕ
	|	ТоварыКОтгрузке.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОтгрузке.Номенклатура,
	|	ТоварыКОтгрузке.Характеристика,
	|	ТоварыКОтгрузке.Серия,
	|	ТоварыКОтгрузке.Распоряжение,
	|	ТоварыКОтгрузке.Склад");
	
	Запрос.УстановитьПараметр("ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров",
		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров);
	Запрос.УстановитьПараметр("МерныеТипыЕдиницИзмерений",
		Справочники.УпаковкиЕдиницыИзмерения.МерныеТипыЕдиницИзмерений());
	Запрос.УстановитьПараметр("ЭтапыПроизводства", мЭтапыПроизводства);
	Запрос.УстановитьПараметр("ИспользоватьСтатусЗакрыт", Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	ГраницыОборотов = ОбщегоНазначенияУТ.ГраницыОборотовРегистра("ЗаказыМатериаловВПроизводство",
		"Распоряжение В (&ЭтапыПроизводства)", Запрос.Параметры);
	
	Запрос.УстановитьПараметр("НачПериод", ГраницыОборотов.МинимальнаяДата);
	Запрос.УстановитьПараметр("КонПериод", ГраницыОборотов.МаксимальнаяДата);
	
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаЗаказы = Результат[0].Выбрать();
	ТаблицаТоварыКОтмене = Результат[2].Выгрузить();
	ТоварыКОтмене.Загрузить(ТаблицаТоварыКОтмене);
	ДопустимыеОтклонения = Результат[3].Выгрузить();
	
	СтруктураПоиска = Новый Структура("Номенклатура,Характеристика,Серия,Склад,ЭтоОтгрузка,Заказ");
	ВыделитьМерныеТовары(ТоварыКОтмене, ДопустимыеОтклонения, СтруктураПоиска);
	ТоварыКОтмене.Очистить(); // не предлагаем отменять материалы, только корректировка мерных
	
	Если ВыборкаЗаказы.Количество() = 0
		И ТоварыКОтмене.Количество() = 0
		И МерныеТоварыККорректировке.Количество() = 0 Тогда
		ЗаказыЗакрыты = Истина;
	ИначеЕсли ВыборкаЗаказы.Количество() = 0 Тогда
		СтатусЗакрытУстановлен = Истина;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("ЭтоОтгрузка", Истина);
	СтрокиОтгрузки = МерныеТоварыККорректировке.НайтиСтроки(ПараметрыОтбора);
	
	ПараметрыОтбора = Новый Структура("ЭтоОтгрузка", Ложь);
	СтрокиПриемки = МерныеТоварыККорректировке.НайтиСтроки(ПараметрыОтбора);
	
	ЕстьМерныеТоварыККорректировке          = СтрокиОтгрузки.Количество() > 0;
	ЕстьМерныеТоварыККорректировкеПоПриемке = СтрокиПриемки.Количество() > 0;
	
	СкорректироватьМерныеТовары          = ЕстьМерныеТоварыККорректировке;
	СкорректироватьМерныеТоварыПоПриемке = ЕстьМерныеТоварыККорректировкеПоПриемке;
	ОтменитьНеотработанныеСтроки         = ОтменитьНеотработанныеСтроки И ТоварыКОтмене.Количество() > 0;
	
	стрПараметры.Вставить("ОтменитьНеотработанныеСтроки", ОтменитьНеотработанныеСтроки);
	стрПараметры.Вставить("СкорректироватьМерныеТовары", СкорректироватьМерныеТовары);
	стрПараметры.Вставить("СкорректироватьМерныеТоварыПоПриемке", СкорректироватьМерныеТоварыПоПриемке);

КонецПроцедуры

&НаСервере
Процедура ВыделитьМерныеТовары(ТоварыКОтмене, ДопустимыеОтклонения, СтруктураПоиска)
	
	Сч = ТоварыКОтмене.Количество()-1;
	Пока Сч >= 0 Цикл
		
		СтрокаОстатков = ТоварыКОтмене[сч];
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаОстатков);
		
		СтрокиДопустимыхОтклонений = ДопустимыеОтклонения.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокаОстатков.Количество < 0 Тогда //превышение распоряжения
			
			Если СтрокиДопустимыхОтклонений.Количество() > 0 Тогда
				
				ДопустимоеОтклонение = СтрокиДопустимыхОтклонений[0].ДопустимоеОтклонение;
				
				Если -СтрокаОстатков.Количество <= ДопустимоеОтклонение Тогда
					НовСтр = МерныеТоварыККорректировке.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаОстатков);
					НовСтр.Количество = -НовСтр.Количество;
				КонецЕсли;
				
			КонецЕсли;
			
			ТоварыКОтмене.Удалить(сч);
			
		ИначеЕсли СтрокаОстатков.Количество > 0 Тогда
			
			Если СтрокиДопустимыхОтклонений.Количество() > 0 Тогда
				
				ДопустимоеОтклонение = СтрокиДопустимыхОтклонений[0].ДопустимоеОтклонение;
				
				Если СтрокаОстатков.Количество <= ДопустимоеОтклонение Тогда
					НовСтр = МерныеТоварыККорректировке.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр,СтрокаОстатков);
					НовСтр.Количество = -НовСтр.Количество;
					ТоварыКОтмене.Удалить(Сч);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Сч = Сч - 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЭтапы(Команда)
	Назначение = ПредопределенноеЗначение("Справочник.Назначения.ПустаяСсылка");
	ЭтапыПроизводства.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СканерГоу(Команда)                 
	Структура = Новый Структура;
	Структура.Вставить("ЗаказНаПроизводство", ШКЗаказНаПроизводство);
	Структура.Вставить("Назначение", ШКНазначение);
	Структура.Вставить("Подразделение", ШКПодразделение);
	Структура.Вставить("ВидРабочегоЦентра", ШКВидРабочегоЦентра);
	
	ОбработкаОповещения("ScanData", Структура, "ПодключаемоеОборудование");	
КонецПроцедуры



