Функция ФормаВыполненияЗадачи(Знач ЗадачаСсылка, Знач ТочкаМаршрутаСсылка) Экспорт
	
	ИмяФормы = "БизнесПроцесс.бит_СогласованиеАктОБраке.Форма.ФормаЗадачиРецензента";
	
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыФормы", Новый Структура("Ключ", ЗадачаСсылка));
	Результат.Вставить("ИмяФормы", ИмяФормы);
	
	Возврат Результат;
	
КонецФункции 

// Функция - Функция возвращает таблицу значений с колонками исполнитель и роль исполнителя по выбранному пользователю
//	роли исполнителя доступные для бизнес процесса "бит_Согласование"
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи, СправочникСсылка.ВнешниеПользователи 
// 
// Возвращаемое значение:
//  Результат - Таблица значений
// 		Исполнитель - СправочникСсылка.Пользователи, СправочникСсылка.ВнешниеПользователи	 
//		РольИсполнителя - СправочникСсылка.РолиИсполнителей  
//
Функция ПолучитьТаблицуРолейИсполнителей(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
	               |	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя
	               |ИЗ
	               |	РегистрСведений.бит_ОчередностьЭтаповСогласований КАК бит_ОчередностьЭтаповСогласований
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |		ПО бит_ОчередностьЭтаповСогласований.РольИсполнителя = ИсполнителиЗадач.РольИсполнителя
	               |			И (ИсполнителиЗадач.Исполнитель = &Исполнитель)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИсполнителиЗадач.Исполнитель,
	               |	ИсполнителиЗадач.РольИсполнителя";
	
	Запрос.УстановитьПараметр("Исполнитель", Пользователь);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции
