
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОтправленНаСогласование = Ложь;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ВидДокумента") Тогда
			ПометкаУдаленияВидаДокумента =
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.ВидДокумента, "ПометкаУдаления");
			Если ПометкаУдаленияВидаДокумента = Истина Тогда
				ВызватьИсключение НСтр("ru='Выбранный вид документа помечен на удаление.';
									|en='Selected document type is marked for deletion.'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь());
	
	Дата = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// ++ ЕРП
	//Справочники.бит_ШаблоныЗаполненияРеквизитов.ПроверитьУникальностьРеквизитаДляДокумента(ЭтотОбъект, "Номер", Отказ);
	// -- ЕРП
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли