
Функция СведенияОВнешнейОбработке() Экспорт
	
	ИмяОбъекта = ЭтотОбъект.Метаданные().Имя; 
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид","ПечатнаяФорма"); //может быть – ПечатнаяФорма, ЗаполнениеОбъекта (для вн.обработки), ДополнительныйОтчет, СозданиеСвязанныхОбъектов… 
	ПараметрыРегистрации.Вставить("Наименование", "(бит) Запрос поставщику"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("Версия", "1.0.1");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", "Внешняя печатная форма (бит) Запрос поставщику (ЛТ 19)"); //так будет выглядеть описание вн.отчета для пользователя
	
	// Объявим еще одну переменную, которая нам потребуется ниже
	МассивНазначений = Новый Массив;
	
	// Теперь нам необходимо передать в виде массива имен, к чему будет подключена наша ВПФ
	// Имейте ввиду, что можно задать имя в таком виде: Документ.* - в этом случае обработка будет подключена ко всем документам в системе, 
	// которые поддерживают механизм ВПФ
	МассивНазначений.Добавить("Документ.ЗаказПоставщику");  
	
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	
	// Создадим таблицу команд (подробнее смотрим ниже)
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	// Добавим команду в таблицу
	ДобавитьКоманду(ТаблицаКоманд, "(бит) Запрос поставщику", "(бит) Запрос поставщику", ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода(), Истина, "ПечатьMXL");    
	// Сохраним таблицу команд в параметры регистрации обработки
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	// Теперь вернем системе наши параметры
	Возврат ПараметрыРегистрации;	
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	// Создадим пустую таблицу команд и колонки в ней
	Команды = Новый ТаблицаЗначений;
	
	// Как будет выглядеть описание печатной формы для пользователя
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	
	// Имя нашего макета, что бы могли отличить вызванную команду в обработке печати
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	
	// Тут задается, как должна вызваться команда обработки
	// Возможные варианты:
	// - ОткрытиеФормы - в этом случае в колонке идентификатор должно быть указано имя формы, которое должна будет открыть система
	// - ВызовКлиентскогоМетода - вызвать клиентскую экспортную процедуру из модуля формы обработки
	// - ВызовСерверногоМетода - вызвать серверную экспортную процедуру из модуля объекта обработки
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	
	// Следующий параметр указывает, необходимо ли показывать оповещение при начале и завершению работы обработки. Не имеет смысла при открытии формы
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	
	// Для печатной формы должен содержать строку ПечатьMXL 
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	// Добавляем команду в таблицу команд по переданному описанию.
	// Параметры и их значения можно посмотреть в функции ПолучитьТаблицуКоманд
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "(бит) Запрос поставщику") Тогда
		//МакетУПД = ПолучитьМакет("Макет");	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"(бит) Запрос поставщику",
		НСтр("ru = '(бит) Запрос поставщику'"),
		СформироватьПечатнуюФормуЗапросПоставщику(МассивОбъектов, ОбъектыПечати));
		
		ОписаниеПечатнойФормы = КоллекцияПечатныхФорм.Найти(ВРег("(бит) Запрос поставщику"), "ИмяВРЕГ");
		Если ОписаниеПечатнойФормы <> Неопределено Тогда
			ОписаниеПечатнойФормы.ДоступенВыводНаДругихЯзыках = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыПечати = Новый Структура("ИмяФормы");
	
	//ЗаявкаНаВозвратТоваровОтКлиентаЛокализация.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры  

Функция СформироватьПечатнуюФормуЗапросПоставщику(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Номер КАК Номер,
	|	ЗаказПоставщику.Дата КАК Дата,
	|	ЗаказПоставщику.Организация КАК Организация,
	|	ЗаказПоставщику.ЖелаемаяДатаПоступления КАК ЖелаемаяДатаПоступления,
	|	ЗаказПоставщику.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказПоставщику.Менеджер КАК Менеджер,
	|	ЗаказПоставщику.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Номер КАК НомерДокумента,
	|	ВТ_ОсновныеДанные.Дата КАК ДатаДокумента,
	|	ВТ_ОсновныеДанные.Организация КАК Организация,
	|	ВТ_ОсновныеДанные.ЖелаемаяДатаПоступления КАК ЖелаемаяДатаПоступления,
	|	ВТ_ОсновныеДанные.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВТ_ОсновныеДанные.Менеджер КАК Менеджер,
	|	ВТ_ОсновныеДанные.Организация.ИНН КАК ОрганизацияИНН,
	|	ВТ_ОсновныеДанные.Организация.КПП КАК ОрганизацияКПП,
	|	ВТ_ОсновныеДанные.Организация.ОГРН КАК ОрганизацияОГРН,
	|	ВТ_ОсновныеДанные.Менеджер.ФизическоеЛицо.Имя КАК МенеджерФизическоеЛицоИмя,
	|	ВТ_ОсновныеДанные.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные";
	
	ЗаполнитьТабличныйДокументЗаказаПоставщику(ТабличныйДокумент, Запрос, ОбъектыПечати);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументЗаказаПоставщику(ТабличныйДокумент, Запрос, ОбъектыПечати)
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПоставщику_ЗапросПоставщику";
	
	ДанныеПечати = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьПодвалДокумента = Макет.ПолучитьОбласть("ПодвалДокумента");
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Вывод шапки документа
		
		СтруктураДанныхШапки = Новый Структура;
		СтруктураДанныхШапки.Вставить("ИНН", ДанныеПечати.ОрганизацияИНН);
		СтруктураДанныхШапки.Вставить("КПП", ДанныеПечати.ОрганизацияКПП);
		СтруктураДанныхШапки.Вставить("ОГРН", ДанныеПечати.ОрганизацияКПП);
		
		//БанковскийСчетОрганизации = ОрганизацииСервер.БанковскийСчетОрганизации(ДанныеПечати.Организация);
		//СтруктураДанныхШапки.Вставить("БанкПредставление", БанковскийСчетОрганизации.БанковскийСчетБанк);
		//СтруктураДанныхШапки.Вставить("РасчетныйСчет", БанковскийСчетОрганизации.БанковскийСчетНомерСчета);
		//СтруктураДанныхШапки.Вставить("БИК", БанковскийСчетОрганизации.БанковскийСчетБИК);
		//СтруктураДанныхШапки.Вставить("КоррСчет", БанковскийСчетОрганизации.БанковскийСчетКоррСчет);  
		
		//ПоляДополнительныхСведенийОрганизации = "АдресЭлектроннойПочтыОрганизации, АдресОрганизацииФакт, ТелефонОрганизации, ФаксОрганизации"; 
		
		//ДополнительныеСведенияОрганизации = ОрганизацииСервер.ДополнительныеСведенияОрганизации(ДанныеПечати.Организация,
		//ПоляДополнительныхСведенийОрганизации);
		
		//СтруктураДанныхШапки.Вставить("АдресПредставление", ДополнительныеСведенияОрганизации.АдресОрганизацииФакт);											
		//СтруктураДанныхШапки.Вставить("Телефон", ДополнительныеСведенияОрганизации.ТелефонОрганизации);
		//СтруктураДанныхШапки.Вставить("Факс", ДополнительныеСведенияОрганизации.ФаксОрганизации);
		//СтруктураДанныхШапки.Вставить("ЭлектроннаяПочта", ДополнительныеСведенияОрганизации.АдресЭлектроннойПочтыОрганизации);
		
		ДополнительныеСведенияОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.ДатаДокумента);
		СтруктураДанныхШапки.Вставить("БанкПредставление", ДополнительныеСведенияОрганизации.Банк);
		СтруктураДанныхШапки.Вставить("РасчетныйСчет", ДополнительныеСведенияОрганизации.НомерСчета);
		СтруктураДанныхШапки.Вставить("БИК", ДополнительныеСведенияОрганизации.БИК);
		СтруктураДанныхШапки.Вставить("КоррСчет", ДополнительныеСведенияОрганизации.КоррСчет); 	
		СтруктураДанныхШапки.Вставить("АдресПредставление", ДополнительныеСведенияОрганизации.ФактическийАдрес);											
		СтруктураДанныхШапки.Вставить("Телефон", ДополнительныеСведенияОрганизации.Телефоны);
		
		СтруктураДанныхШапки.Вставить("ЭлектроннаяПочта", ДополнительныеСведенияОрганизации.АдресЭлектроннойПочты);
		
		Факс = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеПечати.Организация,
									ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Факс"),ДанныеПечати.ДатаДокумента, Истина);
		СтруктураДанныхШапки.Вставить("Факс", Факс);
		СтруктураДанныхШапки.Вставить("НомерДокумента", ДанныеПечати.НомерДокумента);    
		
		СтруктураДанныхШапки.Вставить("ДатаДокумента", Формат(ДанныеПечати.ДатаДокумента, СтрШаблон("ДЛФ=DD")));
		
		МесяцПоставки = Формат(ДанныеПечати.ЖелаемаяДатаПоступления, "ДФ=ММММ");
		МесяцПоставкиПредлПадеж = ПолучитьСклоненияСтроки(МесяцПоставки,"ПЛ=Мужской", "ПД=Предложный");	
		СтруктураДанныхШапки.Вставить("МесяцПоставки", МесяцПоставкиПредлПадеж[0]);
		
		СтруктураДанныхШапки.Вставить("ГодПоставки", Формат(Год(ДанныеПечати.ЖелаемаяДатаПоступления), "ЧГ="));
		
		ОбластьШапкаДокумента.Параметры.Заполнить(СтруктураДанныхШапки);	
		
		СтруктураДанныхШапки.Вставить("Менеджер", ДанныеПечати.Менеджер);
		ЭлектроннаяПочтаМенеджера = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеПечати.Менеджер,
									ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailПользователя"),,Истина);
									
		СтруктураДанныхШапки.Вставить("ЭлектроннаяПочтаМенеджера", ЭлектроннаяПочтаМенеджера);
		
		ТабличныйДокумент.Вывести(ОбластьШапкаДокумента);
		
		// Вывод шапки таблицы
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура.Представление КАК Номенклатура,
		|	ЗаказПоставщикуТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказПоставщикуТовары.Количество КАК Количество,
		|	ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЗаказПоставщикуТовары.Цена КАК Цена,
		|	ЗаказПоставщикуТовары.Сумма КАК Сумма
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
		|	И ЗаказПоставщикуТовары.Отменено = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеПечати.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ДанныеТЧТовары = РезультатЗапроса.Выбрать();		
		
		НомерСтроки = 0;
		// Вывод строк таблицы
		Пока ДанныеТЧТовары.Следующий() Цикл
			НомерСтроки = НомерСтроки +1;
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеТЧТовары);
			ОбластьСтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);			
		КонецЦикла;
		
		// Вывод подвала таблицы  	
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);	
		
		// Вывод подвала документа
        ОбластьПодвалДокумента.Параметры.Заполнить(СтруктураДанныхШапки);
		ТабличныйДокумент.Вывести(ОбластьПодвалДокумента);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
		ТабличныйДокумент,
		НомерСтрокиНачало,
		ОбъектыПечати,
		ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры


