
////////////////////////////////////////////////////////////////////////////////
// Модуль содержит процедуры и функции формирования бухгалтерских отчетов
// по бюджетированию и управленческому учету.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция формирует список регистров бухгалтерии, доступных в управленческих отчетах.
// 
// Параметры:
//  ДобавитьБюдж - Булево - добавлять ли регистр Бюджетирование (По умолчанию = Ложь).
//  
// Возвращаемое значение:
//  СписокЗначений.
// 
Функция СформироватьСписокДоступныхРегистровБухгалтерииДляУправленческихОтчетов(ДобавитьБюдж = Ложь) Экспорт

	СписокОбъектовСистемы = Новый СписокЗначений;
	       		
	РегистрыМета = Новый Массив;
	РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_1);
	РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_2);
	РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_3);
	РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_4);
	РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_5);
    
    Если ДобавитьБюдж Тогда
        РегистрыМета.Добавить(Метаданные.РегистрыБухгалтерии.бит_Бюджетирование);
    КонецЕсли;
    
	Для каждого МетаОбъект Из РегистрыМета Цикл		
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
		Если ЗначениеЗаполнено(ОбъектСистемы) Тогда			
			СписокОбъектовСистемы.Добавить(ОбъектСистемы);			
		КонецЕсли;		
	КонецЦикла; 
		
	Возврат СписокОбъектовСистемы;
 	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиОтчетов

// Функция возвращает Строку Вида отбора для запроса.
// 
// Параметры
//  ВыбВидСравнения  - ВидСравнения.
//  ЗначениеОтбора   - Значение отбора запроса.
//  СтрокаПоляОтбора - Строка, Аргумент запроса, т.е. то что должно быть написано до вида сревнения.
//  ЗначениеОтбораС  - Произвольный, значение отбора для видов сравнения, 
// 						  у которых необходимо указывать два значения, начальное значение.
//  ЗначениеОтбораПо - Произвольный, значение отбора для видов сравнения,
// 						  у которых необходимо указывать два значения, конечное значение.
//  ИнтервалЗначений - Структура.
// 
// Возвращаемое значение 
//  Строка.
// 
Функция ПолучитьСтрокуОтбора(ВыбВидСравнения, ЗначениеОтбора, СтрокаПоляОтбора, 
	ЗначениеОтбораС = Неопределено, ЗначениеОтбораПо = Неопределено, ИнтервалЗначенийОтбора = Неопределено) Экспорт

	СтрокаВозврата = "";
	
	Если ИнтервалЗначенийОтбора = Неопределено Тогда
		ИнтервалЗначенийОтбора = ИнтервалЗначений();		
	КонецЕсли;
	СамоЗначение   = ИнтервалЗначенийОтбора.Значение;
	СамоЗначениеС  = ИнтервалЗначенийОтбора.ЗначениеС;
	СамоЗначениеПо = ИнтервалЗначенийОтбора.ЗначениеПо;
	
	Если Типзнч(СамоЗначение) = Тип("Массив") Тогда
		Если ВыбВидСравнения = ВидСравнения.Равно Тогда
	    	ВыбВидСравнения = ВидСравнения.ВСписке;
		ИначеЕсли ВыбВидСравнения = ВидСравнения.НеРавно Тогда
			ВыбВидСравнения = ВидСравнения.НеВСписке;
		КонецЕсли;
	КонецЕсли;
	
	Если ВыбВидСравнения = ВидСравнения.Равно Тогда
		
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" = " + ЗначениеОтбора);
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.НеРавно Тогда
		
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" <> " + ЗначениеОтбора);
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.ВСписке Тогда
		
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" В (" + ЗначениеОтбора+")");
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.ВСпискеПоИерархии 
		ИЛИ ВыбВидСравнения = ВидСравнения.ВИерархии Тогда
		
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" В ИЕРАРХИИ(" + ЗначениеОтбора + ")");
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.НеВСписке Тогда
		
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" НЕ В (" + ЗначениеОтбора + ")");
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.НеВСпискеПоИерархии 
		ИЛИ ВыбВидСравнения = ВидСравнения.НеВИерархии Тогда
		
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" НЕ В ИЕРАРХИИ(" + ЗначениеОтбора + ")");
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.Больше Тогда
		
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" > " + ЗначениеОтбора);
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.БольшеИлиРавно Тогда
		
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" >= " + ЗначениеОтбора);
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.Меньше Тогда
		
		Если НЕ (ТипЗнч(СамоЗначение) = Тип("Дата") И НЕ ЗначениеЗаполнено(СамоЗначение)) Тогда
			СтрокаВозврата = СтрокаПоляОтбора + Строка(" < " + ЗначениеОтбора);
		КонецЕсли; 
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.МеньшеИлиРавно Тогда
		
		Если НЕ (ТипЗнч(СамоЗначение) = Тип("Дата") И НЕ ЗначениеЗаполнено(СамоЗначение)) Тогда
			СтрокаВозврата = СтрокаПоляОтбора + Строка(" <= " + ЗначениеОтбора);
		КонецЕсли; 
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.Интервал Тогда
		
		Если ТипЗнч(СамоЗначениеПо) = Тип("Дата") И НЕ ЗначениеЗаполнено(СамоЗначениеПо) Тогда
			СтрокаВозврата = "(" + СтрокаПоляОтбора + Строка(" > " + ЗначениеОтбораС) + ")";
		Иначе
			СтрокаВозврата = "(" + СтрокаПоляОтбора + Строка(" > " + ЗначениеОтбораС) + " И " + СтрокаПоляОтбора + Строка(" < " + ЗначениеОтбораПо) + ")";
		КонецЕсли;
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.ИнтервалВключаяГраницы Тогда
		
		Если ТипЗнч(СамоЗначениеПо) = Тип("Дата") И НЕ ЗначениеЗаполнено(СамоЗначениеПо) Тогда
			СтрокаВозврата = "(" + СтрокаПоляОтбора + Строка(" >= " + ЗначениеОтбораС) + ")";
		Иначе
			СтрокаВозврата = "(" + СтрокаПоляОтбора + Строка(" >= " + ЗначениеОтбораС) + " И " + СтрокаПоляОтбора + Строка(" <= " + ЗначениеОтбораПо) + ")";
		КонецЕсли;
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.ИнтервалВключаяНачало Тогда
		
		Если ТипЗнч(СамоЗначениеПо) = Тип("Дата") И НЕ ЗначениеЗаполнено(СамоЗначениеПо) Тогда
			СтрокаВозврата = "(" + СтрокаПоляОтбора + Строка(" >= " + ЗначениеОтбораС) + ")";
		Иначе
			СтрокаВозврата = "(" + СтрокаПоляОтбора + Строка(" >= " + ЗначениеОтбораС) + " И " + СтрокаПоляОтбора + Строка(" < " + ЗначениеОтбораПо) + ")";
		КонецЕсли;
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.ИнтервалВключаяОкончание Тогда
		
		Если ТипЗнч(СамоЗначениеПо) = Тип("Дата") И НЕ ЗначениеЗаполнено(СамоЗначениеПо) Тогда
			СтрокаВозврата = "(" + СтрокаПоляОтбора + Строка(" > " + ЗначениеОтбораС) + ")";
		Иначе
			СтрокаВозврата = "(" + СтрокаПоляОтбора + Строка(" > " + ЗначениеОтбораС) + " И " + СтрокаПоляОтбора + Строка(" <= " + ЗначениеОтбораПо) + ")";
		КонецЕсли;
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.Содержит Тогда
		
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" ПОДОБНО " + ЗначениеОтбора);
		
	ИначеЕсли ВыбВидСравнения = ВидСравнения.НеСодержит Тогда
		
		СтрокаВозврата = "НЕ (" + СтрокаПоляОтбора + Строка(" ПОДОБНО " + ЗначениеОтбора + ")");
		
	КонецЕсли;

	Возврат СтрокаВозврата;
	
КонецФункции // ПолучитьСтрокуОтбора()

// Функция формирует список субконто по счету.
// 
// Параметры:
//  Счет 			  - ПланСчетовСсылка.
//  ВыбранныеСубконто - СписокЗначений (По умолчанию = Неопределено).
//  
// Возвращаемое значение:
//   СписокЗначений.
// 
Функция СформироватьСписокСубконтоПоСчету(Счет, ВыбранныеСубконто = Неопределено) Экспорт

	СписокСубконто = Новый СписокЗначений;
	
	// Массив выбранных видов субконто.
	Если ВыбранныеСубконто = Неопределено Тогда
		МассивВыбранных = Новый Массив;
		ВыбратьВсе      = Истина;
	Иначе	
		МассивВыбранных = ВыбранныеСубконто.ВыгрузитьЗначения();
		ВыбратьВсе      = Ложь;
	КонецЕсли; 	
	
	Для Каждого ВидСубконто Из Счет.ВидыСубконто Цикл
		ИмяСубконто = "Субконто" + Строка(ВидСубконто.НомерСтроки);
		СписокСубконто.Добавить( ИмяСубконто, Строка(ВидСубконто.ВидСубконто), 
			ВыбратьВсе Или МассивВыбранных.Найти(ИмяСубконто) <> Неопределено); 	                                 
	КонецЦикла;

	Возврат СписокСубконто;
	
КонецФункции

// Процедура изменяет типы у отборов построителя по субконто.
// 
// Параметры:
//  ПостроительОтчета - ПостроительОтчета.
//  МассивСубконто 	  - Массив.
//  ДтКт			  - Строка (По умолчанию = "").
// 
Процедура УстановитьТипыОтборовПостроителяПоСубконто(ПостроительОтчета, МассивСубконто, ДтКт = "") Экспорт
	
	НачалоПредставления = ?(ДтКт = "", "", ДтКт + " ");
	
	Сч = 0;
	
	Для каждого Элемент Из МассивСубконто Цикл
		
		Сч = Сч + 1;
		Поле = ПостроительОтчета.ДоступныеПоля.Найти("Субконто" + ДтКт + Сч);		
		Если Поле <> Неопределено Тогда 			
			Поле.ТипЗначения   = Элемент.ТипЗначения;
			Поле.Представление = НачалоПредставления + Элемент.Наименование;
		КонецЕсли;
	
	КонецЦикла;
	
	// Представления кор субконто
	Для Сч = 1 По 4 Цикл
		
		Поле = ПостроительОтчета.ДоступныеПоля.Найти("КорСубконто" + Сч);
		Если Поле <> Неопределено Тогда
			Поле.Представление = СтрШаблон(НСтр("ru='Кор. Субконто %1';en='Cor. Subconto %1'"), Строка(Сч));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РасшифровкаОтчетов

// Процедура устанавливает текущую строку в таблице движений для документа - регистратора.
// 
// Параметры:
//  Элементы  - Все элементы формы.
//  Параметры - Структура.
// 
Процедура УстановитьТекущуюСтрокуТаблицыДвиженийДокумента(Элементы, Параметры) Экспорт

	Если Параметры.Свойство("НомерСтрокиДвижения") И Параметры.Свойство("ИмяТабличногоПоля") Тогда
		
		Элементы[Параметры.ИмяТабличногоПоля].ТекущаяСтрока = Параметры.НомерСтрокиДвижения;	
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ФормированиеОтчетов

// Функция получает признак использования проверки итогов в отчете.
// 
// Возвращаемое значение:
//  Булево - есть проверка итогов.
// 
Функция ЕстьПроверкаИтоговОтчета() Экспорт

	ЕстьПроверкаИтогов = бит_ОбщегоНазначения.ЭтоСемействоБП();
	
	Возврат ЕстьПроверкаИтогов;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает структуру - интервал значений.
// 
// Возвращаемое значение: 
//  Структура:
//   СамоЗначение   - Произвольный.
//   СамоЗначениеС 	- Произвольный.
//   СамоЗначениеПо - Произвольный.
// 
Функция ИнтервалЗначений()

	ИнтервалЗначенийОтбора = Новый Структура;
	ИнтервалЗначенийОтбора.Вставить("Значение",   Неопределено);
	ИнтервалЗначенийОтбора.Вставить("ЗначениеС",  Неопределено);
	ИнтервалЗначенийОтбора.Вставить("ЗначениеПо", Неопределено);

	Возврат ИнтервалЗначенийОтбора;
	
КонецФункции

#КонецОбласти