#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет табличную часть остатками регистра источника.
//
// Параметры:
//  СхемаКомпоновки     - СхемаКомпоновкиДанных.
//  НастройкиКомпоновки - НастройкиКомпоновкиДанных.
//  ТаблицаДанные		- ТаблицаЗначений.
//  ДопПараметры 		- Структура.
//
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция ОстаткиРегистраБухгалтерии(СхемаКомпоновки, НастройкиКомпоновки, Знач ТаблицаДанные, ДопПараметры) Экспорт
	
	РегистрИсточник = ДопПараметры.РегистрИсточник;
	РегистрПриемник = ДопПараметры.РегистрПриемник;
	Организация 	= ДопПараметры.Организация;
	ДатаОбработки   = ДопПараметры.Дата;
	ЗаполняемыйДокумент = ДопПараметры.ЗаполняемыйДокумент;
	
	ЭтоХозрасчетный   = РегистрИсточник.ИмяОбъекта = "Хозрасчетный";
	ЭтоМеждународный  = бит_му_ОбщегоНазначения.ЭтоМеждународныйПланСчетовИлиРегистр(РегистрИсточник.ИмяОбъекта);
	ЭтоБюджетирование = РегистрИсточник.ИмяОбъекта = "бит_Бюджетирование";
	
	// Выполнение компоновки макета МакетСКД
	// (Настройки берутся из схемы компоновки данных и из пользовательских настроек).
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновки,,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	НайденаОрг = ТаблицаРезультат.Колонки.Найти("Организация") <> Неопределено;
	
	Для каждого Выборка Из ТаблицаРезультат Цикл
		 
		Если Выборка.СуммаРегл <> 0 Тогда 

			НоваяСтрока = ТаблицаДанные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, , "Количество, Валюта, ВалютнаяСумма");
			
			НоваяСтрока.СчетИсточника = Выборка.Счет;
			НоваяСтрока.СубконтоИсточника1 = Выборка.Субконто1;
			НоваяСтрока.СубконтоИсточника2 = Выборка.Субконто2;
			НоваяСтрока.СубконтоИсточника3 = Выборка.Субконто3;
			Если Не ЭтоХозрасчетный Тогда			
				НоваяСтрока.СубконтоИсточника4 = Выборка.Субконто4;			
			КонецЕсли; 
			
			Если Выборка.ВидСчета = "Пассивный" Тогда
				
				НоваяСтрока.СуммаРеглКт = Выборка.СуммаРегл;
				
				Если Не ЭтоХозрасчетный Тогда
					НоваяСтрока.СуммаУпрКт = Выборка.СуммаУпр;
				КонецЕсли;
				
				Если ЭтоМеждународный Тогда
					НоваяСтрока.СуммаМУКт = Выборка.СуммаМУ;
				КонецЕсли; 
				
				Если ЭтоБюджетирование Тогда
					НоваяСтрока.СуммаСценарийКт = Выборка.СуммаСценарий;
				КонецЕсли;
								
			ИначеЕсли Выборка.ВидСчета = "Активный" Тогда	
				
				НоваяСтрока.СуммаРеглДт = Выборка.СуммаРегл;
				
				Если Не ЭтоХозрасчетный Тогда
					НоваяСтрока.СуммаУпрДт = Выборка.СуммаУпр;
				КонецЕсли;
				
				Если ЭтоМеждународный Тогда
					НоваяСтрока.СуммаМУДт = Выборка.СуммаМУ;
				КонецЕсли; 
				
				Если ЭтоБюджетирование Тогда
					НоваяСтрока.СуммаСценарийДт = Выборка.СуммаСценарий;
				КонецЕсли; 
								
			КонецЕсли; 
						
			СтруктураСчетов = бит_МеханизмТрансляции.КонструкторПараметровПодбораСчетов();
			
			СтруктураСчетов.ТекущийОбъект = ЗаполняемыйДокумент;
			СтруктураСчетов.Счет 		  = Выборка.Счет;
			Если ЭтоХозрасчетный Тогда
				СтруктураСчетов.Подразделение = Выборка.Подразделение;
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.Субконто1) Тогда
				СтруктураСчетов.Субконто1 = Выборка.Субконто1;
			КонецЕсли; 
			Если ЗначениеЗаполнено(Выборка.Субконто2) Тогда
				СтруктураСчетов.Субконто2 = Выборка.Субконто2;
			КонецЕсли; 
			Если ЗначениеЗаполнено(Выборка.Субконто3) Тогда
				СтруктураСчетов.Субконто3 = Выборка.Субконто3;
			КонецЕсли;
			Если Не ЭтоХозрасчетный И ЗначениеЗаполнено(Выборка.Субконто4) Тогда
				СтруктураСчетов.Субконто4 = Выборка.Субконто4;
			КонецЕсли;
			
			ТекОрг = ?(НайденаОрг, Выборка.Организация, Организация);
			СтруктураСчетовПриемник = бит_МеханизмТрансляции.ВыполнитьПодборСчетов(СтруктураСчетов, 
				ТекОрг, ДатаОбработки, РегистрИсточник.ИмяОбъекта, РегистрПриемник.ИмяОбъекта);	
																					
			// Заполняем счет и субконто приемника																		
			НоваяСтрока.СчетПриемника = СтруктураСчетовПриемник.Счет;
            СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(НоваяСтрока.СчетПриемника);
			
			Если СвСч.Количественный Тогда
				НоваяСтрока.Количество 	  = Выборка.Количество;
			КонецЕсли;
			Если СвСч.Валютный Тогда
				НоваяСтрока.Валюта 		  = Выборка.Валюта;
				НоваяСтрока.ВалютнаяСумма = Выборка.ВалютнаяСумма;
			КонецЕсли; 			
			
			ПриемникБюджетирование = РегистрПриемник.ИмяОбъекта = "бит_Бюджетирование";
			Если ПриемникБюджетирование Тогда			
				Если ЗначениеЗаполнено(СтруктураСчетовПриемник.ЦФО) Тогда
					НоваяСтрока.ЦФО = СтруктураСчетовПриемник.ЦФО;
				Иначе	
					РезМассив = бит_Бюджетирование.СвязанныеЦФОИПодразделения(НоваяСтрока.Организация, ДатаОбработки);		
					Если РезМассив.Количество() <> 0 Тогда
						
						Если ТипЗнч(РезМассив[0]) = Тип("СправочникСсылка.Подразделения") Тогда				
							НоваяСтрока.ЦФО = РезМассив[0];				
						КонецЕсли;  
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(СтруктураСчетовПриемник.Субконто1) Тогда
				НоваяСтрока.СубконтоПриемника1 = СтруктураСчетовПриемник.Субконто1;
			КонецЕсли; 
			Если ЗначениеЗаполнено(СтруктураСчетовПриемник.Субконто2) Тогда
				НоваяСтрока.СубконтоПриемника2 = СтруктураСчетовПриемник.Субконто2;
			КонецЕсли; 
			Если ЗначениеЗаполнено(СтруктураСчетовПриемник.Субконто3) Тогда
				НоваяСтрока.СубконтоПриемника3 = СтруктураСчетовПриемник.Субконто3;
			КонецЕсли;
			Если Не ЭтоХозрасчетный И ЗначениеЗаполнено(СтруктураСчетовПриемник.Субконто4) Тогда
				НоваяСтрока.СубконтоПриемника4 = СтруктураСчетовПриемник.Субконто4;
			КонецЕсли;
						
		КонецЕсли; 

	КонецЦикла;
	
	Возврат ТаблицаДанные;
	
КонецФункции // ОстаткиРегистраБухгалтерии()

#КонецОбласти

#КонецЕсли
