#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

// Хранит валюту регламентированного учета
Перем мВалютаРегламентированногоУчета Экспорт;
// Хранит настройки БИТ
Перем мНастройкиПрограммы Экспорт;
// Хранит дополнительные измерения
Перем мИзмеренияДоп Экспорт;
// Хранит настройки дополнительных измерений.
Перем мНастройкиИзмерений Экспорт;

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыПроведения = Документы.бит_пз_ОтражениеФактаЗатрат.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 

	Документы.бит_пз_ОтражениеФактаЗатрат.СформироватьДвиженияПланируемыеЗатраты(ПараметрыПроведения.ПланируемыеЗатраты,
		ПараметрыПроведения.ПланируемыеЗатратыРеквизиты, Движения);
		
	Документы.бит_пз_ОтражениеФактаЗатрат.СформироватьДвиженияОборотыПоБюджетам(ПараметрыПроведения.ОборотыПоБюджетам,
		ПараметрыПроведения.ОборотыПоБюджетамРеквизиты, Движения);
		
	Документы.бит_пз_ОтражениеФактаЗатрат.СформироватьДвиженияБюджетирование(ПараметрыПроведения.ОборотыПоБюджетам,
		ПараметрыПроведения.ОборотыПоБюджетамРеквизиты, Движения);
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СвязанныеДокументы = Документы.бит_пз_ОтражениеФактаЗатрат.СвязанныеДокументы(Ссылка);
	Документы.бит_пз_ОтражениеФактаЗатрат.ОбновитьСтатусСвязанныхДокументов(СвязанныеДокументы);
			
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СвязанныеДокументы = Документы.бит_пз_ОтражениеФактаЗатрат.СвязанныеДокументы(Ссылка);
	Документы.бит_пз_ОтражениеФактаЗатрат.ОбновитьСтатусСвязанныхДокументов(СвязанныеДокументы);
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_пз_ЗаявкаНаЗатраты") Тогда	
		ЗаполнитьНаОснованииЗаявкиНаЗатраты(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_пз_СводнаяЗаявкаНаЗатраты") Тогда		
		ЗаполнитьНаОснованииСводнойЗаявкиНаЗатраты(ДанныеЗаполнения);		
	Иначе	
		ЗаполнитьШапкуДокумента();		
	КонецЕсли;	
	
	ЭтотОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

//  Процедура заполняет шапку документа.
// 
Процедура ЗаполнитьШапкуДокумента()
	
	// Заполнить реквизиты значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь());
												
КонецПроцедуры

//  Процедура обрабатывает изменение валюты документа
//
Процедура ИзменениеВалютыМодуль() Экспорт

	СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
	КурсДокумента      = СтрКурса.Курс;
	КратностьДокумента = СтрКурса.Кратность;

КонецПроцедуры // ИзменениеВалютыМодуль()

//  Процедура заполняет документ на основании Заявки на затраты.
// 
Процедура ЗаполнитьНаОснованииЗаявкиНаЗатраты(Основание)

	Исключения = "Дата,Номер,Проведен,ПометкаУдаления,Сценарий";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание,,Исключения);
	 
	Документы.бит_пз_ОтражениеФактаЗатрат.ЗаполнитьОтражениеФактаПоОснованию(ЭтотОбъект, Основание);
	
	ЭтотОбъект.ДокументОснование = Основание;
	
КонецПроцедуры // ЗаполнитьНаОснованииЗаявкиНаЗатраты()

//  Процедура заполняет документ на основании Сводной заявки на затраты.
// 
Процедура ЗаполнитьНаОснованииСводнойЗаявкиНаЗатраты(Основание)

	Исключения = "Дата,Номер,Проведен,ПометкаУдаления";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание,,Исключения);
	 
	Документы.бит_пз_ОтражениеФактаЗатрат.ЗаполнитьОтражениеФактаПоОснованию(ЭтотОбъект, Основание);
	
	ЭтотОбъект.ДокументОснование = Основание;
	
КонецПроцедуры // ЗаполнитьНаОснованииСводнойЗаявкиНаЗатраты()

#КонецОбласти 

#Область ОператорыОсновнойПрограммы

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

мНастройкиПрограммы = Новый Соответствие;

мИзмеренияДоп       = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
мНастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");

#КонецОбласти 

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли