	
#Область ОтборыНаФорме
	
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Период) Тогда   
		Если Период.ДатаНачала > Период.ДатаОкончания Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Период заполнен некорректно: Дата начала больше даты окончания");
			Период.ДатаНачала = Дата("00010101");
			Период.ДатаОкончания = Период.ДатаНачала;
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗаказов1, "ПериодОтбора", Период, Ложь);
			Возврат;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗаказов1, "ПериодОтбора", Период, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗаказов1, "ПериодОтбора", Период, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	//ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗаказов1, "СтатусЗаказа");
	Если ЗначениеЗаполнено(Статус) Тогда       
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказов1, "СтатусЗаказа", Статус, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказов1, "СтатусЗаказа", Статус, ВидСравненияКомпоновкиДанных.ВСписке, , Ложь);
	КонецЕсли;

	//Если ЗначениеЗаполнено(Статус) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗаказов, "СтатусЗаказа", Статус, Истина);
	//Иначе
	//	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗаказов, "СтатусЗаказа", Статус, Ложь);
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	
	//ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗаказов1, "Менеджер");
	Если ЗначениеЗаполнено(Менеджер) Тогда       
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказов1, "Менеджер", Менеджер, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказов1, "Менеджер", Менеджер, ВидСравненияКомпоновкиДанных.Равно, , Ложь); 
	КонецЕсли;
	//Если ЗначениеЗаполнено(Менеджер) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗаказов, "Менеджер", Менеджер, Истина);
	//Иначе
	//	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗаказов, "Менеджер", Менеджер, Ложь);
	//КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеЗаказыСрокИзготовленияПриИзменении(Элемент)
	
	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗаказов, "",  , ПросроченныеЗаказыСрокИзготовления);
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗаказов1, "ПросроченПоИзготовлению");
	Если ЗначениеЗаполнено(Период.ДатаНачала) Тогда       
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказов1, "ПросроченПоИзготовлению", ПросроченныеЗаказыСрокИзготовления, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеЗаказыСрокСдачиПриИзменении(Элемент)
	
	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗаказов, "ПросроченПоСрокуСдачи", ПросроченныеЗаказыСрокСдачи, ПросроченныеЗаказыСрокСдачи);
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗаказов1, "ПросроченПоСрокуСдачи");
	Если ЗначениеЗаполнено(Период.ДатаНачала) Тогда       
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаказов1, "ПросроченПоСрокуСдачи", ПросроченныеЗаказыСрокСдачи, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокЗаказовПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.СписокЗаказов1.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТекЗаказ = ТД.Ссылка;
		Дата = ОбщегоНазначенияКлиент.ДатаСеанса();//ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекЗаказ, "Дата");
	Иначе
		ТекЗаказ = ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка");       
		Дата = Дата("00010101");
	КонецЕсли;  
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НоменклатураЗаказа, "ЗаказКлиента", ТекЗаказ, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НоменклатураЗаказа, "ДатаЗаказа", Дата, Истина);
	
    ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОплатыПоЗаказу, "ЗаказКлиента", ТекЗаказ, Истина);
	
КонецПроцедуры                      

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Календарь = Справочники.бит_ЗначенияПоУмолчанию.КалендарьПоУмолчанию;
	Если Календарь.Значения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен календарь по умолчанию 'Российская Федерация'", Календарь);
		Закрыть();
	КонецЕсли;
	Календарь = Календарь.Значения[0].Значение;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗаказов1, "Календарь", Календарь, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗаказов1, "КоличествоРабочихДней", 10, Истина); 
	
	ТекЗаказ = ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка"); 
	Дата = Дата("00010101");
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НоменклатураЗаказа, "ЗаказКлиента", ТекЗаказ, Истина);	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НоменклатураЗаказа, "ДатаЗаказа", Дата, Истина);

    ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОплатыПоЗаказу, "ЗаказКлиента", ТекЗаказ, Истина);	
    
КонецПроцедуры
