#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура добавляет настройки о умолчанию.
// 
// Параметры:
//  Соответствие (По умолчанию = Неопределено).
// 
Процедура ДобавитьНастройкиВГОПоУмолчанию(СоответствиеНастроек = Неопределено) Экспорт

	ПвхНастроек  = ПланыВидовХарактеристик.бит_вго_ВидыНастроекСверкиВГО;
	РсНастроек   = РегистрыСведений.бит_вго_НастройкиПроведенияСверкиВГО;
	ПериодЗаписи = Дата('19800101');
	
	Если СоответствиеНастроек = Неопределено Тогда
		СоответствиеНастроек = Новый Соответствие;
		СоответствиеНастроек.Вставить(ПвхНастроек.ДопустимоеРасхождение				, 0);
		СоответствиеНастроек.Вставить(ПвхНастроек.ДопустимоеРасхождениеВзаиморасчеты, 0);
		СоответствиеНастроек.Вставить(ПвхНастроек.КонтролироватьДопустимоеРасхождение			  , Ложь);
		СоответствиеНастроек.Вставить(ПвхНастроек.КонтролироватьДопустимоеРасхождениеВзаиморасчеты, Ложь);	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЗапроса", ТекущаяДатаСеанса());
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	НастройкиПроведенияСверкиВГО.Настройка,
    |	НастройкиПроведенияСверкиВГО.Значение
    |ИЗ
    |	РегистрСведений.бит_вго_НастройкиПроведенияСверкиВГО.СрезПоследних(&ДатаЗапроса, ) КАК НастройкиПроведенияСверкиВГО
	|";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	
	Для каждого КлЗнНастройки Из СоответствиеНастроек Цикл
		
		ОтборПоНастройке = Новый Структура("Настройка", КлЗнНастройки.Ключ);
		Если ТаблицаРезультата.НайтиСтроки(ОтборПоНастройке).Количество() = 0 Тогда
		
			МенеджерЗаписиВго = РсНастроек.СоздатьМенеджерЗаписи();
			МенеджерЗаписиВго.Период    = ПериодЗаписи;
			МенеджерЗаписиВго.Настройка = КлЗнНастройки.Ключ;
			МенеджерЗаписиВго.Значение  = КлЗнНастройки.Значение;
			Попытка
			 	МенеджерЗаписиВго.Записать();
		 	Исключение
				// Запись события в журнал регистрации для системного администратора.
			    ЗаписьЖурналаРегистрации(НСтр("ru='Запись настроек';en='Setting recording'"),
			       УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;	
		
		КонецЕсли; 		
	
	КонецЦикла;

КонецПроцедуры // ДобавитьНастройкиВГОПоУмолчанию()

#КонецОбласти

#КонецЕсли
