
#Область СлужебныйПрограммныйИнтерфейс

// Параметры проверки пользовательского условия.
//
// Параметры:
//  ПользовательскоеУсловие - СправочникСсылка.бит_ПользовательскиеУсловия.
//	ИмяПроверяемогоОбъекта - Строка - Полное имя метаданных проверяемого объекта.
// 
// Возвращаемое значение:
//  Структура - параметры проверки:
//   * КодУсловия - Строка - Код условия пользовательского условия.
//   * УсловиеПодходитТекущемуОбъекту - Булево.
//
Функция ПараметрыПроверкиПользовательскогоУсловия(ПользовательскоеУсловие, ИмяПроверяемогоОбъекта) Экспорт
	
	ПараметрыПроверки = Справочники.бит_ПользовательскиеУсловия.ПараметрыПроверкиСсылкиПользовательскогоУсловия(
																					ПользовательскоеУсловие,
																					ИмяПроверяемогоОбъекта);
	Возврат Новый ФиксированнаяСтруктура(ПараметрыПроверки);
	
КонецФункции

Функция ТипСтатусаОбъкта(Статус) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Статус, "ТипСтатуса");
	
КонецФункции

#КонецОбласти