
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Текст1, Текст2, ТипЯзыка");
	
	ДополнительныеСвойства = Новый Структура;
	ДополнительныеСвойства.Вставить("ТолькоПросмотр", Истина);
	ДополнительныеСвойства.Вставить("ТипЯзыка", ТипЯзыка);
	ДополнительныеСвойства.Вставить("ЭтоСравнение", Истина);
	ДополнительныеСвойства.Вставить("ВсегдаИспользоватьMonaco", Истина);
	
	ФиксированныеНастройки = Новый Структура;
	ФиксированныеНастройки.Вставить("ОтображатьНомераСтрок", Истина);
	ДополнительныеСвойства.Вставить("ФиксированныеНастройки", ФиксированныеНастройки);
	
	ИТК_РедакторКода.Инициализация(ЭтотОбъект, "Сравнение", ДополнительныеСвойства);
	
	ДвустороннееСравнение = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИТК_РедакторКодаКлиент.Инициализация(ЭтотОбъект, "Сравнение");
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ИТК_РедакторКодаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИТК_ПодключаемыйДокументСформирован(Элемент)
	
	ДополнительныеСвойства = Новый Структура;
	ДополнительныеСвойства.Вставить("Текст", Текст1);
	ИТК_РедакторКодаКлиент.ДополнительнаяИнициализация(ЭтотОбъект, Элемент, ДополнительныеСвойства);
	
	ОбновитьЭлементыФормы();
	
	ОбновитьСравнение();

КонецПроцедуры

&НаКлиенте
Процедура ИТК_ПодключаемыйПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ИТК_РедакторКодаКлиент.ОбработкаСобытий(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДвустороннееСравнение(Команда)
	
	ДвустороннееСравнение = Не ДвустороннееСравнение;
	ОбновитьЭлементыФормы();
	
	ОбновитьСравнение();

КонецПроцедуры

&НаКлиенте
Процедура СледующееОтличие(Команда)
	
	ИТК_РедакторКодаКлиент.СледующееОтличие(Элементы["Сравнение"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущееОтличие(Команда)
	
	ИТК_РедакторКодаКлиент.ПредыдущееОтличие(Элементы["Сравнение"]);
	
КонецПроцедуры

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура ИТК_ПодключаемаяКомандаРедакторКодаОбработчик(Команда)
	
	ИТК_РедакторКодаКлиент.ПодключаемыйОбработчикКоманд(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ФормаДвустороннееСравнение.Пометка = ДвустороннееСравнение;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСравнение()
	
	ИТК_РедакторКодаКлиент.Сравнение(Элементы["Сравнение"], ДвустороннееСравнение, Текст2);
	
КонецПроцедуры

#КонецОбласти
