
&НаКлиенте
&ИзменениеИКонтроль("КомандаОформитьПоРаспоряжению")
Процедура бит_КомандаОформитьПоРаспоряжению(Команда)

	ОчиститьСообщения();

	Если Элементы.ТрудозатратыКОформлению.ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Команда не может быть выполнена для указанного объекта.';
		|en = 'Command cannot be executed for the specified object.'"));
		Возврат;
	КонецЕсли;

	ПараметрыОформления = ПараметрыОформленияНаСервере(Элементы.ТрудозатратыКОформлению.ВыделенныеСтроки);

	Если ПараметрыОформления = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'По выбранным распоряжениям выработка сотрудников уже оформлена или оформление не требуется.';
		|en = 'Timesheets charge for the selected references has already been registered or registration is not required.'"));
		Возврат;
	КонецЕсли;

	ПараметрыОформления.Вставить("Периодичность",   Периодичность);
	
	
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [09.04.2026] +        
	
	ПараметрыОформления.ТребуетсяОдинДокумент = Ложь; 
	
	#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [09.04.2026] -
	
	
	Если РежимОформления = "ВключатьВПериодВыполненияРабот" Тогда
		ПараметрыОформления.Вставить("ВключатьВПериодВыполненияРабот", Истина);
	Иначе
		ПараметрыОформления.Вставить("ВключатьВПериодВыполненияРабот", Ложь);
	КонецЕсли;

	Если ПараметрыОформления.ТребуетсяОдинДокумент Тогда

		ПараметрыОформления.Вставить("ЗаполнитьПоОтбору", Истина);

		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыОформления);
		ОткрытьФорму("Документ.ВыработкаСотрудников.ФормаОбъекта", ПараметрыФормы);

	Иначе

		ПараметрыОформления.Вставить("НачалоПериода",   НачалоМесяца(Период));
		ПараметрыОформления.Вставить("КонецПериода",    КонецМесяца(Период));

		ДлительнаяОперация = СформироватьВФоне(ПараметрыОформления);

		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ОписаниеОповещения = Новый ОписаниеОповещения("СформироватьДокументыЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

	КонецЕсли;

КонецПроцедуры
