Процедура бит_СформироватьПечатныеФормыЭтикеток(ДанныеПечати, ОбъектыПечати, КоллекцияПечатныхФормБСП)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [27.11.2025 22:20:01] +        
	ИсходныеДанные = ПолучитьИзВременногоХранилища(ДанныеПечати.Товары);
	
	//НужноПечататьЭтикетки = Ложь;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФормБСП, "БИТ_ЭТИКЕТКАТОВАРЫ") Тогда
		//НужноПечататьЭтикетки = Истина;
		КоллекцияПечатныхФормБСП.Удалить(КоллекцияПечатныхФормБСП.Найти(ВРег("БИТ_ЭТИКЕТКАТОВАРЫ"), "ИмяВРЕГ"));
	КонецЕсли;
//	
//	//НужноПечататьЦенники = Ложь;
//	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФормБСП, "ЦенникТовары") Тогда
//	//	НужноПечататьЦенники = Истина;
//	//	КоллекцияПечатныхФормБСП.Удалить(КоллекцияПечатныхФормБСП.Найти(ВРег("ЦенникТовары"), "ИмяВРЕГ"));
//	//КонецЕсли;
//	
//	СтруктураНастроек = СтруктураНастроек();
//	//СтруктураНастроек.ОбязательныеПоля.Добавить("КоличествоЦенниковДляПечати");
//	//СтруктураНастроек.ОбязательныеПоля.Добавить("КоличествоЭтикетокДляПечати");
//	//СтруктураНастроек.ОбязательныеПоля.Добавить("ШаблонЦенникаДляПечати");
//	//СтруктураНастроек.ОбязательныеПоля.Добавить("ШаблонЭтикеткиДляПечати");
//	СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура");
//	//Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
//	//	СтруктураНастроек.ОбязательныеПоля.Добавить("Характеристика");
//	//КонецЕсли;
//	//Если ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
//	//	СтруктураНастроек.ОбязательныеПоля.Добавить("Упаковка");
//	//КонецЕсли;
//	
//	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "бит_ПоляШаблонаЭтикетки";
//	
//	// Собираем используемые поля из шаблонов.
//	СоответствиеШаблонов = Новый Соответствие;
//	Для Каждого СтрокаТЧ Из ИсходныеДанные Цикл
//		//Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) И СтрокаТЧ.КоличествоЭтикеток > 0 И НужноПечататьЭтикетки Тогда
//			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЭтикетки);
//		//КонецЕсли;
//		//Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) И СтрокаТЧ.КоличествоЦенников > 0 И НужноПечататьЦенники Тогда
//		//	СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЦенника);
//		//КонецЕсли;
//	КонецЦикла;
//	Если ДанныеПечати.Свойство("СтруктураМакетаШаблона") И ЗначениеЗаполнено(ДанныеПечати.СтруктураМакетаШаблона) Тогда
//		СоответствиеШаблонов.Вставить(Справочники.ШаблоныЭтикетокИЦенников.ПустаяСсылка());
//	КонецЕсли;
//	
//	// Заполняем коллекцию обязательных полей и формируем соответствие шаблонов.
//	Для Каждого КлючИЗначение ИЗ СоответствиеШаблонов Цикл
//		
//		ШаблонЭтикетокИЦенников = КлючИЗначение.Ключ;
//		
//		Если ЗначениеЗаполнено(ШаблонЭтикетокИЦенников) Тогда
//			КлючШаблон = КлючИЗначение.Ключ.Шаблон; // ХранилищеЗначения
//			СтруктураШаблона = КлючШаблон.Получить();
//		Иначе
//			СтруктураШаблона = ДанныеПечати.СтруктураМакетаШаблона;
//		КонецЕсли;
//		
//		// Структура шаблонов.
//		СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов.Вставить(ШаблонЭтикетокИЦенников, СтруктураШаблона);
//		
//		// Добавляем в массив обязательных полей поля, присутствующие в печатной форме ценника.
//		Для Каждого Элемент Из СтруктураШаблона.ПараметрыШаблона Цикл
//			СтруктураНастроек.ОбязательныеПоля.Добавить(Элемент.Ключ);
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", ДанныеПечати.Организация);
//	
//	СтруктураНастроек.ПараметрыДанных.Вставить("ПравилоОбмена",                 ДанныеПечати.ПравилоОбмена);
//	СтруктураНастроек.ПараметрыДанных.Вставить("МаксимальныйКодВесовогоТовара", ДанныеПечати.МаксимальныйКодВесовогоТовара);
//	СтруктураНастроек.ПараметрыДанных.Вставить("ПравилоВыгрузкиВВесы",          ДанныеПечати.ПравилоВыгрузкиВВесы);
//	
//	СтруктураНастроек.ПараметрыДанных.Вставить("ВидЦены",       ДанныеПечати.ВидЦены);
//	СтруктураНастроек.ПараметрыДанных.Вставить("Дата",          ДанныеПечати.Дата);
//	
//	СтруктураНастроек.ПараметрыДанных.Вставить("ВидЦеныДополнительно", ДанныеПечати.ВидЦеныДополнительно);
//	СтруктураНастроек.ПараметрыДанных.Вставить("ДатаДополнительно",    ДанныеПечати.ДатаДополнительно);
//	
//	СтруктураНастроек.ИсходныеДанные = ИсходныеДанные;

//#Область ПодготовкаСтруктурыДанныхШаблона
//	
//	СтруктураРезультата = ПодготовитьСтруктуруДанных(СтруктураНастроек, "Товары");
    СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Таблица", ИсходныеДанные);
//#КонецОбласти

#Область ФормированиеТабличногоДокумента
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	РисунокКвадрат = Эталон.Рисунки.Квадрат100Пикселей; // РисунокТабличногоДокумента
	КоличествоМиллиметровВПикселе = РисунокКвадрат.Высота / 100;
	
	// Подготовка коллекции печатных форм.
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиКоличество");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиШаблон");
	КоллекцияПечатныхФорм.Колонки.Добавить("Шаблон");
	//сч=0;
	//Для Каждого КлючИЗначение Из ИсходныеДанные Цикл//СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов Цикл
		
		//Если ((ЗначениеЗаполнено(КлючИЗначение.Ключ)
		//		И КлючИЗначение.Ключ.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров)
		//		ИЛИ Не ЗначениеЗаполнено(КлючИЗначение.Ключ))
		//	И НужноПечататьЭтикетки Тогда
			
			ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
			ПечатнаяФорма.ИмяМакета            = "Этикетка: "+"бит_МакетБирки";//+КлючИЗначение.Ключ;
			ПечатнаяФорма.СинонимМакета        = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Этикетка: %1';
																												|en = 'Label: %1'"), "бит_МакетБирки");//КлючИЗначение.Ключ);
			ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЭтикеток";
			ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЭтикеткиДляПечати";
			ПечатнаяФорма.Шаблон = "бит_МакетБирки";//КлючИЗначение.Ключ;
			
		//КонецЕсли;
		//
		//Если ((ЗначениеЗаполнено(КлючИЗначение.Ключ)
		//		И КлючИЗначение.Ключ.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров)
		//		ИЛИ Не ЗначениеЗаполнено(КлючИЗначение.Ключ))
		//	И НужноПечататьЦенники Тогда
		//	
		//	ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
		//	ПечатнаяФорма.ИмяМакета            = "Ценник: " + КлючИЗначение.Ключ;
		//	ПечатнаяФорма.СинонимМакета        = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ценник: %1';
		//																										|en = 'Price tag: %1'"), КлючИЗначение.Ключ);
		//	ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЦенниковДляПечати";
		//	ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЦенникаДляПечати";
		//	ПечатнаяФорма.Шаблон = КлючИЗначение.Ключ;
		//	
		//КонецЕсли;
		
	//КонецЦикла;  
	КоличествоПоГоризонтали = 1;
	КоличествоПоВертикали = 1;  
	ШКРазмерШрифтаСерии = 5;
	ШКРазмерШрифта = 16;
	
	Макет = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("бит_МакетБирки");
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		
		НомерКолонки = 0;
		НомерРяда = 0;
		
		Для Каждого СтрокаТовары Из СтруктураРезультата.Таблица Цикл
			
			//Если СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] > 0 И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон] = ПечатнаяФорма.Шаблон Тогда
				
				//СтруктураШаблона = СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов.Получить(СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон]);	// Структура - см. Справочники.ШаблоныЭтикетокИЦенников.ПодготовитьСтруктуруМакетаШаблона
				
				Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда
					ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
				КонецЕсли;
				
				Область1 = Макет.ПолучитьОбласть("область1");//СтруктураШаблона.МакетЭтикетки.ПолучитьОбласть(СтруктураШаблона.ИмяОбластиПечати);
				область1.Параметры.Заполнить(СтрокаТовары);
				// Применение настроек табличного документа.
				//ЗаполнитьЗначенияСвойств(ПечатнаяФорма.ТабличныйДокумент, СтруктураШаблона.МакетЭтикетки, , "ОбластьПечати");
				
				//Для каждого ПараметрШаблона Из СтруктураШаблона.ПараметрыШаблона Цикл
				//	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Область.Параметры, ПараметрШаблона.Значение) Тогда
				//		НаименованиеКолонки = СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПоляВШаблоне(ПараметрШаблона.Ключ));
				//		Если НаименованиеКолонки <> Неопределено Тогда
				//			Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
				//		КонецЕсли;
				//	КонецЕсли;
				//КонецЦикла;
				
				Для каждого Рисунок Из Область1.Рисунки Цикл
					
					Если Рисунок.Имя = "Штрихкод" Тогда
						
						ЗначениеШтрихкода = СтрокаТовары.Штрихкод;
						Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
							
							ТипВходныхДанных = 0;
							ЗначениеШтрихкодаДляКомпоненты = ЗначениеШтрихкода;
							ПечатьЭтикетокИЦенниковЛокализация.ПриОпределенииЗначенияШтрихкодаДляКомпоненты(
								ЗначениеШтрихкодаДляКомпоненты, 1, ТипВходныхДанных);
							
							//Если СтруктураШаблона.Свойство("УровеньЧеткости") Тогда
							//	УровеньЧеткости = СтруктураШаблона.УровеньЧеткости;
							//Иначе
								УровеньЧеткости = 1;
							//КонецЕсли;
							
							ПараметрыШтрихкода = Новый Структура;
							ПараметрыШтрихкода.Вставить("Ширина",           Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе) * УровеньЧеткости);
							ПараметрыШтрихкода.Вставить("Высота",           Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе) * УровеньЧеткости);
							ПараметрыШтрихкода.Вставить("Штрихкод",         СокрЛП(ЗначениеШтрихкодаДляКомпоненты));
							ПараметрыШтрихкода.Вставить("ТипВходныхДанных", ТипВходныхДанных);
							ПараметрыШтрихкода.Вставить("ТипКода",          1);
							ПараметрыШтрихкода.Вставить("ОтображатьТекст",  Истина);
							ПараметрыШтрихкода.Вставить("РазмерШрифта",     ШКРазмерШрифта * УровеньЧеткости);
							
							//Если СтруктураШаблона.Свойство("GS1DatabarКоличествоСтрок") Тогда
							//	ПараметрыШтрихкода.Вставить("GS1DatabarКоличествоСтрок", СтруктураШаблона.GS1DatabarКоличествоСтрок);
							//КонецЕсли;
							//Если СтруктураШаблона.Свойство("ТипШрифта") Тогда
							//	ПараметрыШтрихкода.Вставить("ТипШрифта", СтруктураШаблона.МонохромныйШрифт);
							//КонецЕсли;
							//Если СтруктураШаблона.Свойство("УголПоворота") Тогда
							//	ПараметрыШтрихкода.Вставить("УголПоворота", СтруктураШаблона.УголПоворота);
							//КонецЕсли;
							//Если СтруктураШаблона.Свойство("МонохромныйШрифт") Тогда
							//	ПараметрыШтрихкода.Вставить("МонохромныйШрифт", СтруктураШаблона.МонохромныйШрифт);
							//КонецЕсли;
							//Если СтруктураШаблона.Свойство("Масштабировать") Тогда
								ПараметрыШтрихкода.Вставить("Масштабировать", Истина);
							//КонецЕсли;
							//Если СтруктураШаблона.Свойство("СохранятьПропорции") Тогда
								ПараметрыШтрихкода.Вставить("СохранятьПропорции", Ложь);
							//КонецЕсли;
							//Если СтруктураШаблона.Свойство("ВертикальноеВыравнивание") Тогда
							//	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание", СтруктураШаблона.ВертикальноеВыравнивание);
							//КонецЕсли;
							
							Рисунок.Картинка = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода).Картинка;
							
						КонецЕсли;
					ИначеЕсли Рисунок.Имя = "ШКСерии" Тогда
						
						ЗначениеШтрихкода = СтрокаТовары.ШКСерии;
						Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
							QRСтрока = ЗначениеШтрихкода;
							ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190);
							КартинкаQRКода = Новый Картинка(ДанныеQRКода);
							//ОбластьМакета.Рисунки.QRКод.Картинка = КартинкаQRКода;
							Рисунок.Картинка = КартинкаQRКода;
							//ТипВходныхДанных = 0;
							//ЗначениеШтрихкодаДляКомпоненты = ЗначениеШтрихкода;
							//ПечатьЭтикетокИЦенниковЛокализация.ПриОпределенииЗначенияШтрихкодаДляКомпоненты(
							//	ЗначениеШтрихкодаДляКомпоненты, 16, ТипВходныхДанных);
							//
							////Если СтруктураШаблона.Свойство("УровеньЧеткости") Тогда
							////	УровеньЧеткости = СтруктураШаблона.УровеньЧеткости;
							////Иначе
							//	УровеньЧеткости = 1;
							////КонецЕсли;
							//
							//ПараметрыШтрихкода = Новый Структура;
							//ПараметрыШтрихкода.Вставить("Ширина",           Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе) * УровеньЧеткости);
							//ПараметрыШтрихкода.Вставить("Высота",           Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе) * УровеньЧеткости);
							//ПараметрыШтрихкода.Вставить("Штрихкод",         СокрЛП(ЗначениеШтрихкодаДляКомпоненты));
							//ПараметрыШтрихкода.Вставить("ТипВходныхДанных", ТипВходныхДанных);
							//ПараметрыШтрихкода.Вставить("ТипКода",          16);
							//ПараметрыШтрихкода.Вставить("ОтображатьТекст",  Ложь);
							//ПараметрыШтрихкода.Вставить("РазмерШрифта",     ШКРазмерШрифтаСерии * УровеньЧеткости);
							//
							////Если СтруктураШаблона.Свойство("GS1DatabarКоличествоСтрок") Тогда
							////	ПараметрыШтрихкода.Вставить("GS1DatabarКоличествоСтрок", СтруктураШаблона.GS1DatabarКоличествоСтрок);
							////КонецЕсли;
							////Если СтруктураШаблона.Свойство("ТипШрифта") Тогда
							////	ПараметрыШтрихкода.Вставить("ТипШрифта", СтруктураШаблона.МонохромныйШрифт);
							////КонецЕсли;
							////Если СтруктураШаблона.Свойство("УголПоворота") Тогда
							////	ПараметрыШтрихкода.Вставить("УголПоворота", СтруктураШаблона.УголПоворота);
							////КонецЕсли;
							////Если СтруктураШаблона.Свойство("МонохромныйШрифт") Тогда
							////	ПараметрыШтрихкода.Вставить("МонохромныйШрифт", СтруктураШаблона.МонохромныйШрифт);
							////КонецЕсли;
							////Если СтруктураШаблона.Свойство("Масштабировать") Тогда
							//	ПараметрыШтрихкода.Вставить("Масштабировать", Истина);
							////КонецЕсли;
							////Если СтруктураШаблона.Свойство("СохранятьПропорции") Тогда
							//	ПараметрыШтрихкода.Вставить("СохранятьПропорции", Истина);
							////КонецЕсли;
							////Если СтруктураШаблона.Свойство("ВертикальноеВыравнивание") Тогда
							////	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание", СтруктураШаблона.ВертикальноеВыравнивание);
							////КонецЕсли;
							//
							//Рисунок.Картинка = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода).Картинка;
							
						КонецЕсли;	
					КонецЕсли;
					
					//Если СтрНайти(Рисунок.Имя, "ЗнакВалюты") = 1 Тогда
					//	ЗначениеКодаВалюты = СтрокаТовары[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПараметраКодВалюты())];
					//	Попытка
					//		Рисунок.Картинка = Новый Картинка(Справочники.ШаблоныЭтикетокИЦенников.ПолучитьМакет("ЗнакВалюты" + ЗначениеКодаВалюты), Истина);
					//	Исключение
					//		Рисунок.Картинка = Новый Картинка;
					//	КонецПопытки;
					//КонецЕсли;
					
				КонецЦикла;
				
				Для Инд = 1 По СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] Цикл // Цикл по количеству экземпляров
					
					НомерКолонки = НомерКолонки + 1;
					
					Если НомерКолонки = 1 Тогда
						
						НомерРяда = НомерРяда + 1;
						
						ПечатнаяФорма.ТабличныйДокумент.Вывести(Область1);
						
					Иначе
						
						ПечатнаяФорма.ТабличныйДокумент.Присоединить(Область1);
						
					КонецЕсли;
					
					Если НомерКолонки = КоличествоПоГоризонтали И НомерРяда = КоличествоПоВертикали Тогда
						
						НомерРяда    = 0;
						НомерКолонки = 0;
						
						ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						
					ИначеЕсли НомерКолонки = КоличествоПоГоризонтали Тогда
						
						НомерКолонки = 0;
						
					КонецЕсли;
					
				КонецЦикла; // Цикл по количеству экземпляров
				
			//КонецЕсли;
			
		КонецЦикла; // Цикл по строкам таблицы товаров
		
	КонецЦикла;
	
#КонецОбласти
	
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		Если ПечатнаяФорма.ТабличныйДокумент <> Неопределено Тогда
			НоваяСтрока = КоллекцияПечатныхФормБСП.Добавить();
			
			НоваяСтрока.ИмяМакета = ПечатнаяФорма.ИмяМакета;
			НоваяСтрока.ИмяВРЕГ   = ВРег(ПечатнаяФорма.ИмяМакета);
			НоваяСтрока.Экземпляров = 1;
			
			НоваяСтрока.ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
			НоваяСтрока.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_МакетБирки";
			НоваяСтрока.СинонимМакета = ПечатнаяФорма.СинонимМакета;
		КонецЕсли;
	КонецЦикла;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [27.11.2025 22:20:01] -
КонецПроцедуры

Процедура бит_СформироватьПечатныеФормыЭтикетокЗавесов(ДанныеПечати, ОбъектыПечати, КоллекцияПечатныхФормБСП)
	
КонецПроцедуры

&ИзменениеИКонтроль("Печать")
Процедура бит_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)

	УстановитьПривилегированныйРежим(Истина);

	ПечатьЭтикетокИЦенниковЛокализация.ПриПечати(КоллекцияПечатныхФорм, ПараметрыПечати, ОбъектыПечати);

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЦенникТовары") 
		Или УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткаТовары") Тогда

		СформироватьПечатныеФормыЭтикетокИЦенниковТоваров(ПараметрыПечати, ОбъектыПечати, КоллекцияПечатныхФорм);

	КонецЕсли;
	#Вставка     
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [27.11.2025 22:21:24] +        
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "бит_ЭтикеткаТовары") Тогда
		бит_СформироватьПечатныеФормыЭтикеток(ПараметрыПечати, ОбъектыПечати, КоллекцияПечатныхФорм);
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "бит_ВесоваяЭтикеткаЗавесов") Тогда
		//бит_СформироватьПечатныеФормыЭтикетокЗавесов(ПараметрыПечати, ОбъектыПечати, КоллекцияПечатныхФорм); 
		СформироватьПечатныеФормыЭтикетокИЦенниковТоваров(ПараметрыПечати, ОбъектыПечати, КоллекцияПечатныхФорм);
	КонецЕсли;		
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [27.11.2025 22:21:24] -
	#КонецВставки

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткаСкладскиеЯчейки") Тогда

		ТабличныйДокумент = СформироватьПечатнуюФормуЭтикеткиСкладскойЯчейки(ПараметрыПечати, ОбъектыПечати);
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭТИКЕТКАСКЛАДСКИЕЯЧЕЙКИ";

		СинонимМакета = НСтр("ru = 'Этикетки складских ячеек';
		|en = 'Storage bin labels'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткаСкладскиеЯчейки",
		СинонимМакета,
		ТабличныйДокумент);

	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткаСерииНоменклатуры") Тогда

		ТабличныйДокумент = СформироватьПечатнуюФормуЭтикеткиСерииНоменклатуры(ПараметрыПечати, ОбъектыПечати);
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭТИКЕТКАСЕРИИНОМЕНКЛАТУРЫ";

		СинонимМакета = НСтр("ru = 'Этикетки серий номенклатуры';
		|en = 'Labels of item batch'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткаСерииНоменклатуры",
		СинонимМакета,
		ТабличныйДокумент);

	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткаДоставки") Тогда

		ТабличныйДокумент = СформироватьПечатнуюФормуЭтикеткиДоставки(ПараметрыПечати, ОбъектыПечати, КоллекцияПечатныхФорм);
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭТИКЕТКАДОСТАВКИ";

		СинонимМакета = НСтр("ru = 'Этикетки доставки';
		|en = 'Delivery labels'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткаДоставки",
		СинонимМакета,
		ТабличныйДокумент);

	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткаУпаковочныеЛисты") Тогда

		ТабличныйДокумент = СформироватьПечатнуюФормуЭтикеткиУпаковочныеЛисты(ПараметрыПечати, ОбъектыПечати);
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭТИКЕТКАУПАКОВОЧНЫЕЛИСТЫ";

		СинонимМакета = НСтр("ru = 'Этикетки упаковочных листов';
		|en = 'Packing list labels'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткаУпаковочныеЛисты",
		СинонимМакета,
		ТабличныйДокумент);

	КонецЕсли;

	//++ НЕ УТ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткаТМЦВЭксплуатации") Тогда

		ТабличныйДокумент = Обработки.ПечатьЭтикетокТМЦВЭксплуатации.СформироватьПечатнуюФормуЭтикеткиТМЦВЭксплуатации(
		ПараметрыПечати, МассивОбъектов);
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭТИКЕТКАТМЦВЭКСПЛУАТАЦИИ";

		СинонимМакета = НСтр("ru = 'Этикетки ТМЦ в эксплуатации';
		|en = 'Labels of inventory in operation'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткаТМЦВЭксплуатации",
		СинонимМакета,
		ТабличныйДокумент);

	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткаОбъектовЭксплуатации") Тогда

		ТабличныйДокумент = Обработки.ПечатьЭтикетокОбъектовЭксплуатации.СформироватьПечатнуюФормуЭтикеткиОбъектовЭксплуатации(
		ПараметрыПечати, МассивОбъектов);
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭТИКЕТКАОБЪЕКТОВЭКСПЛУАТАЦИИ";

		СинонимМакета = НСтр("ru = 'Этикетки объектов эксплуатации';
		|en = 'Assets labels'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткаОбъектовЭксплуатации",
		СинонимМакета,
		ТабличныйДокумент);

	КонецЕсли;
	//-- НЕ УТ

	//++ НЕ УТКА
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткаУзлаОбъектаЭксплуатации") Тогда

		ТабличныйДокумент = Обработки.ПечатьЭтикетокУзловОбъектовЭксплуатации.СформироватьПечатнуюФормуЭтикеткиУзловОбъектовЭксплуатации(
		ПараметрыПечати, МассивОбъектов);
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭТИКЕТКАУЗЛАОБЪЕКТАЭКСПЛУАТАЦИИ";

		СинонимМакета = НСтр("ru = 'Этикетки узлов объектов эксплуатации';
		|en = 'Sub-asset labels'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткаУзлаОбъектаЭксплуатации",
		СинонимМакета,
		ТабличныйДокумент);

	КонецЕсли;
	//-- НЕ УТКА

	Если ТипЗнч(ПараметрыПечати) = Тип("Структура")
		И ПараметрыПечати.Свойство("СтруктураТипов") Тогда
		ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, ПараметрыПечати.СтруктураТипов, КоллекцияПечатныхФорм);
	КонецЕсли;	

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ПодготовитьСтруктуруДанных")
Функция бит_ПодготовитьСтруктуруДанных(СтруктураНастроек, Режим)

	Если СтруктураНастроек.ИсходныеДанные <> Неопределено Тогда
		ИсходныеДанные = СтруктураНастроек.ИсходныеДанные.Скопировать();
	Иначе
		ИсходныеДанные = Неопределено;
	КонецЕсли;

	ИспользуетсяЦенообразование25 = СтруктураНастроек.ИспользуетсяЦенообразование25;
	Если ИспользуетсяЦенообразование25 = Неопределено Тогда

		ДатаЦенообразования = Неопределено;
		Если СтруктураНастроек.ПараметрыДанных.Свойство("Дата") 
			И ЗначениеЗаполнено(СтруктураНастроек.ПараметрыДанных.Дата) Тогда

			ДатаЦенообразования = СтруктураНастроек.ПараметрыДанных.Дата;

		ИначеЕсли СтруктураНастроек.ПараметрыДанных.Свойство("ДатаДополнительно") 
			И ЗначениеЗаполнено(СтруктураНастроек.ПараметрыДанных.ДатаДополнительно) Тогда

			ДатаЦенообразования = СтруктураНастроек.ПараметрыДанных.ДатаДополнительно;

		КонецЕсли;

		ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(ДатаЦенообразования);

	КонецЕсли;

	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Таблица",                             Неопределено);
	СтруктураРезультата.Вставить("СоответствиеПолейСКДКолонкамТаблицы", Новый Соответствие);

	// Схема компоновки.
	Если Режим = "ОбъектыЭксплуатации" Тогда
		//++ НЕ УТ
		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокОбъектовЭксплуатации.ПолучитьМакет(СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных);
	ИначеЕсли Режим = "ТМЦВЭксплуатации" Тогда
		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокТМЦВЭксплуатации.ПолучитьМакет(СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных);
		//-- НЕ УТ

		//++ НЕ УТКА
	ИначеЕсли Режим = "Узлы" Тогда
		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокУзловОбъектовЭксплуатации.ПолучитьМакет(СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных);
		//-- НЕ УТКА
	Иначе
		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет(СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных);
	КонецЕсли; 

	НаборДанных25 = СхемаКомпоновкиДанных.НаборыДанных.Найти("НаборДанных2_5");
	Если НаборДанных25 <> Неопределено Тогда
		Если ИспользуетсяЦенообразование25 Тогда
			СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос = НаборДанных25.Запрос;
		КонецЕсли;
		СхемаКомпоновкиДанных.НаборыДанных.Удалить(НаборДанных25);
	КонецЕсли;

	НаборДанныхВСКДЗапрос = ТипЗнч(СхемаКомпоновкиДанных.НаборыДанных.НаборДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных");

	Если НаборДанныхВСКДЗапрос Тогда

		ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос;

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"УпаковкиНоменклатуры",
		"ИсходныеДанные.Номенклатура"));

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки2",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ЕдиничныеУпаковкиВладельцы.Упаковка",
		"ЕдиничныеУпаковкиВладельцы.Номенклатура"));

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки3",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ИсходныеДанные.Упаковка",
		"ИсходныеДанные.Номенклатура"));

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентУпаковки4",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ЕдиничныеУпаковкиНоменклатур.Упаковка",
		"ЕдиничныеУпаковкиНоменклатур.Номенклатура"));

		ПечатьЭтикетокИЦенниковЛокализация.ПриПодготовкеСтруктурыДанныхНабора(Режим, СхемаКомпоновкиДанных, ТекстЗапроса);

		Если ИсходныеДанные <> Неопределено И ИспользуетсяЦенообразование25 Тогда

			ЗаменяемыйТекст = "&ДанныеПоСериямПереопределяемый";

			Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда

				ТекстЗамены = "ИсходныеДанные.Серия";

			Иначе

				ТекстЗамены = "ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)";

			КонецЕсли;

			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЗаменяемыйТекст, ТекстЗамены);

		КонецЕсли;

		СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос = ТекстЗапроса;

	КонецЕсли;

	// Возможно изменение схемы компоновки данных.
	ДанныеПолученияВыражений = РаботаСФормулами.ДанныеДляПолученияВыраженийФормулЧерезСКД(СхемаКомпоновкиДанных,
	СтруктураНастроек.ОбязательныеПоля, Истина);

	ПоляДляВыборки = Новый Массив;
	НомерПоля = 0;

	// Хранит назначенные имена вычисляемым полям. Для получения данных в СКД (содержатся наборы объекты).
	ИменаКолонокДляСКД = Новый Соответствие;
	// Хранит исходные выражения, указанные в макете печати. Для получения данных в запросе (содержатся наборы запросы).
	ИсходныеВыраженияДляЗапроса = Новый Соответствие;
	Для Каждого ПреобразованиеВыражения Из ДанныеПолученияВыражений.ПреобразованныеВыражения Цикл
		ИсходноеВыражение = ПреобразованиеВыражения.Ключ;
		РезультатПреобразования = ПреобразованиеВыражения.Значение;
		Если ЗначениеЗаполнено(РезультатПреобразования) Тогда
			Если СтрНайти(РезультатПреобразования, ".") > 0 Тогда
				НомерПоля = НомерПоля + 1;
				ИмяПоля = "ВычисляемоеПоле" + Формат(НомерПоля, "ЧН=0; ЧГ=0;");

				ФинансоваяОтчетностьСервер.НовоеВычисляемоеПоле(СхемаКомпоновкиДанных,
				ИмяПоля,
				РезультатПреобразования);
				ПоляДляВыборки.Добавить(ИмяПоля);

				Если НЕ НаборДанныхВСКДЗапрос Тогда
					ИменаКолонокДляСКД.Вставить(ИсходноеВыражение, ЗаменитьСпецСимволы(ИмяПоля));
				КонецЕсли;
			Иначе
				// Исходное поле компоновки.
				ПоляДляВыборки.Добавить(РезультатПреобразования);

				Если НЕ НаборДанныхВСКДЗапрос Тогда
					ИменаКолонокДляСКД.Вставить(ИсходноеВыражение, ЗаменитьСпецСимволы(РезультатПреобразования));
				КонецЕсли;
			КонецЕсли;
			Если НаборДанныхВСКДЗапрос Тогда
				ИсходныеВыраженияДляЗапроса.Вставить(РезультатПреобразования, ИсходноеВыражение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	// Подготовка компоновщика макета компоновки данных.
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Компоновщик.Настройки.Отбор.Элементы.Очистить();

	// Отбор компоновщика настроек.
	Если СтруктураНастроек.КомпоновщикНастроек <> Неопределено Тогда
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(Компоновщик.Настройки.Отбор, СтруктураНастроек.КомпоновщикНастроек.Настройки.Отбор);
	КонецЕсли;

	Для Каждого ИмяПоля Из ПоляДляВыборки Цикл
		ВыбранноеПоле = Компоновщик.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	КонецЦикла;

	Если Режим = "Товары" Тогда
		// Заполнение параметров.
		Для Каждого ПараметрДанных Из СтруктураНастроек.ПараметрыДанных Цикл
			Если ПараметрДанных.Ключ = "Склад" Тогда // Если склад не заполнен - не используем параметр
				УстановитьЗначениеПараметраСКД(Компоновщик, ПараметрДанных.Ключ, ПараметрДанных.Значение, Ложь);
			Иначе
				УстановитьЗначениеПараметраСКД(Компоновщик, ПараметрДанных.Ключ, ПараметрДанных.Значение);
			КонецЕсли;
		КонецЦикла;
		УстановитьЗначениеПараметраСКД(Компоновщик, "ТекущееВремя",        ТекущаяДатаСеанса());
		УстановитьЗначениеПараметраСКД(Компоновщик, "ТекущийПользователь", Пользователи.ТекущийПользователь());

		СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(Компоновщик);
	КонецЕсли;

	// Компоновка макета компоновки данных.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	Если НаборДанныхВСКДЗапрос Тогда

		Для Каждого НаборДанных из МакетКомпоновкиДанных.НаборыДанных Цикл
			Для каждого Поле Из НаборДанных.Поля Цикл

				РезультатПреобразования = Справочники.ШаблоныЭтикетокИЦенников.ИмяПоляВШаблоне(Поле.ПутьКДанным);
				ИсходноеВыражение = ИсходныеВыраженияДляЗапроса.Получить(РезультатПреобразования);
				Если ИсходноеВыражение = Неопределено Тогда
					ИсходноеВыражение = РезультатПреобразования;
				КонецЕсли;
				СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Вставить(
				ИсходноеВыражение,
				ЗаменитьСпецСимволы(Поле.Имя));

			КонецЦикла;
		КонецЦикла;

	Иначе

		Для Каждого ПреобразованиеВыражения Из ДанныеПолученияВыражений.ПреобразованныеВыражения Цикл
			ИсходноеВыражение = ПреобразованиеВыражения.Ключ;
			ИмяКолонкиВРежимеСКД = ИменаКолонокДляСКД.Получить(ИсходноеВыражение);
			СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Вставить(
			Справочники.ШаблоныЭтикетокИЦенников.ИмяПоляВШаблоне(ИсходноеВыражение),
			ИмяКолонкиВРежимеСКД);
		КонецЦикла;

	КонецЕсли;

	Если НаборДанныхВСКДЗапрос Тогда

		Запрос = Новый Запрос(МакетКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос);

		// Заполнение параметров с полей отбора компоновщика настроек формы обработки.
		Для каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
			Запрос.Параметры.Вставить(Параметр.Имя, Параметр.Значение);
		КонецЦикла;

	КонецЕсли;

	Если Режим = "Товары" Тогда
		// Подмена запроса для расчета цен...
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда

			ЗаменяемыйТекст = "ЦеныНоменклатурыСрезПоследних.Цена";
			ТекстЗамены = " ВЫРАЗИТЬ(
			|          ЦеныНоменклатурыСрезПоследних.Цена
			|          / 
			|          ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) 
			|          * 
			|          ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) КАК ЧИСЛО(31,2)) ";

			ТекстЗамены = СтрЗаменить(ТекстЗамены, "&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследних.Упаковка",
			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
			ТекстЗамены = СтрЗаменить(ТекстЗамены, "&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ИсходныеДанныеПоследнийЗапрос.Упаковка",
			"ИсходныеДанныеПоследнийЗапрос.Номенклатура"));
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);

			ЗаменяемыйТекст = "ЦеныНоменклатурыСрезПоследнихДополнительно.Цена";
			ТекстЗамены = " ВЫРАЗИТЬ(
			|          ЦеныНоменклатурыСрезПоследнихДополнительно.Цена
			|          / 
			|          ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) 
			|          * 
			|          ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) КАК ЧИСЛО(31,2)) ";
			ТекстЗамены = СтрЗаменить(ТекстЗамены, "&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследнихДополнительно.Упаковка",
			"ЦеныНоменклатурыСрезПоследнихДополнительно.Номенклатура"));
			ТекстЗамены = СтрЗаменить(ТекстЗамены, "&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ИсходныеДанныеПоследнийЗапрос.Упаковка",
			"ИсходныеДанныеПоследнийЗапрос.Номенклатура"));
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);

			ЗаменяемыйТекст = "ТоварыНаСкладахОстатки.ВНаличииОстаток";
			ТекстЗамены = " ВЫРАЗИТЬ(
			|          ТоварыНаСкладахОстатки.ВНаличииОстаток
			|          / 
			|          ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК ЧИСЛО(31,2)) ";
			ТекстЗамены = СтрЗаменить(ТекстЗамены, "&ТекстЗапросаКоэффициентУпаковки",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ИсходныеДанныеПоследнийЗапрос.Упаковка",
			"ИсходныеДанныеПоследнийЗапрос.Номенклатура"));
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);

		КонецЕсли;

		// Подмена запроса при печати этикеток...
		Если ИсходныеДанные <> Неопределено Тогда

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

			Запрос.Текст = СтрЗаменить(Запрос.Текст, """КоличествоЦенников""", "ИсходныеДанные.КоличествоЦенников");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """КоличествоЭтикеток""", "ИсходныеДанные.КоличествоЭтикеток");

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КОЛИЧЕСТВО(ИсходныеДанные.КоличествоЦенников)",
			"СУММА(ИсходныеДанные.КоличествоЦенниковДляПечати)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КОЛИЧЕСТВО(ИсходныеДанные.КоличествоЭтикеток)",
			"СУММА(ИсходныеДанные.КоличествоЭтикеток)");	

			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ШаблонЦенника""", "ИсходныеДанные.ШаблонЦенника");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ШаблонЭтикетки""", "ИсходныеДанные.ШаблонЭтикетки");

			Запрос.Текст = СтрЗаменить(Запрос.Текст, """Штрихкод""", "ИсходныеДанные.Штрихкод");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """Цена""", "ИсходныеДанные.Цена");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЦенаДополнительно""", "ИсходныеДанные.ЦенаДополнительно");
			#Вставка     
			// {{ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [01.12.2025 2:11:22] +        
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЕдТары""", "ИсходныеДанные.ЕдТары");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """МассаНетто""", "ИсходныеДанные.МассаНетто");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """МассаБрутто""", "ИсходныеДанные.МассаБрутто");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """МассаТары""", "ИсходныеДанные.МассаТары");
			// }}ПервыйБИТ ЛистТребований [ЛТ5.26]  [VUVaynula@1cbit.ru] [01.12.2025 2:11:22] -
			#КонецВставки

			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ДатаПоследнегоИзмененияЦены""", "ИсходныеДанные.ДатаПоследнегоИзмененияЦены");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ДатаПоследнегоИзмененияЦеныДополнительно""", "ИсходныеДанные.ДатаПоследнегоИзмененияЦеныДополнительно");

		Иначе

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
			|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
			|		ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
			|		0 КАК Порядок,
			|		0 КАК Количество)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", ТекстВременнойТаблицы);

		КонецЕсли;

	ИначеЕсли Режим = "СкладскиеЯчейки" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		Иначе

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка) КАК Ячейка,
			|		"""" КАК Штрихкод,
			|		0 КАК Порядок)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", ТекстВременнойТаблицы);

		КонецЕсли;

	ИначеЕсли Режим = "СерииНоменклатуры" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		Иначе

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
			|		"""" КАК Штрихкод,
			|		0 КАК Порядок)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", ТекстВременнойТаблицы);

		КонецЕсли;

	ИначеЕсли Режим = "Доставка" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			ВнешниеНаборыДанных = Новый Структура;
			ВнешниеНаборыДанных.Вставить("ИсходныеДанныеНакладных", ИсходныеДанные);

			Результат = Новый ТаблицаЗначений;
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновкиДанных, ВнешниеНаборыДанных);

			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
			ПроцессорВывода.УстановитьОбъект(Результат);	
			Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);

			СтруктураРезультата.Таблица = Результат;

		КонецЕсли;

	ИначеЕсли Режим = "УпаковочныеЛисты" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		Иначе

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка) КАК Ссылка,
			|		"""" КАК Штрихкод,
			|		0 КАК Порядок)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", ТекстВременнойТаблицы);

		КонецЕсли;

	ИначеЕсли Режим = "ТМЦВЭксплуатации" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Справочник.ПартииТМЦВЭксплуатации.ПустаяСсылка) КАК Номенклатура,
			|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
			|		ЗНАЧЕНИЕ(Справочник.ПартииТМЦВЭксплуатации.ПустаяСсылка) КАК Партия,
			|		"""" КАК ИнвентарныйНомер,
			|		0 КАК Порядок)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		КонецЕсли;

		//++ НЕ УТ
	ИначеЕсли Режим = "ОбъектыЭксплуатации" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		Иначе

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Справочник.ОбъектыЭксплуатации.ПустаяСсылка) КАК ОбъектЭксплуатации,
			|		"""" КАК Штрихкод,
			|		0 КАК Порядок)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", ТекстВременнойТаблицы);

		КонецЕсли;
		//-- НЕ УТ

		//++ НЕ УТКА
	ИначеЕсли Режим = "Узлы" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		Иначе

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка) КАК Узел,
			|		"""" КАК Штрихкод,
			|		0 КАК Порядок)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПереопределяемый", ТекстВременнойТаблицы);

		КонецЕсли;
		//-- НЕ УТКА
	КонецЕсли;

	ПечатьЭтикетокИЦенниковЛокализация.ПриПодготовкеСтруктурыДанныхДляПечати(СтруктураНастроек, Режим, Запрос, ИсходныеДанные);

	Если НаборДанныхВСКДЗапрос Тогда
		СтруктураРезультата.Таблица = Запрос.Выполнить().Выгрузить();
	КонецЕсли;

	Возврат СтруктураРезультата;

КонецФункции
