#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если НЕ Запись.СтатусРегистрации = Перечисления.бит_фн_СтатусыРегистрацииОповещений.ОшибкаОтправки Тогда
			Запись.ДатаОбработки     = '0001-01-01';
			Запись.ПротоколОбработки = "";
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли