
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.14]  [VUVaynula@1cbit.ru] [12.04.2026 20:07:53] +        
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ПакетноеСозданиеПравилНаследования");
	НоваяКоманда.Заголовок = "(бит) Пакетное создание правил наследования";
	НоваяКоманда.Действие = "бит_ПакетноеСозданиеПравилНаследования"; 
	
	НовыйЭлемент = ЭтаФорма.Элементы.Вставить("бит_ПакетноеСозданиеПравилНаследования", Тип("КнопкаФормы"), Элементы.МатериалыИУслуги.КоманднаяПанель, Элементы.МатериалыИУслугиВвестиРазрешениеНаЗамену);
	//НовыйЭлемент.Заголовок = "(бит) Пакетное создание правил наследования";
	НовыйЭлемент.ИмяКоманды = "бит_ПакетноеСозданиеПравилНаследования";
	// }}ПервыйБИТ ЛистТребований [ЛТ6.14]  [VUVaynula@1cbit.ru] [12.04.2026 20:07:53] -
КонецПроцедуры  

&НаКлиенте
Процедура бит_ПакетноеСозданиеПравилНаследования(Команда) 
	// {{ПервыйБИТ ЛистТребований [ЛТ6.14]  [VUVaynula@1cbit.ru] [12.04.2026 20:12:14] +        
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сначала необходимо записать ресурсную спецификацию");
		Возврат;
	КонецЕсли;
	
	ТД = Элементы.МатериалыИУслуги.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТекстОшибки = "Необходимо выбрать обрабатываемую строку";
	ИначеЕсли Не ЗначениеЗаполнено(ТД.Номенклатура) Тогда
		ТекстОшибки = "Необходимо указать номенклатуру";
	ИначеЕсли ТД.Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать") Тогда
		ТекстОшибки = "У вида номенклатуры выбранной номенклатуры должен быть установлен признак использования характеристик";
	ИначеЕсли ЗначениеЗаполнено(ТД.Характеристика)  Тогда
		ТекстОшибки = "Характеристика должна быть пустой";
	ИначеЕсли ТД.СпособАвтовыбораХарактеристики <> ПредопределенноеЗначение("Перечисление.СпособыАвтовыбораХарактеристики.ПодбираетсяПоСвойствамПродукции") Тогда
		ТекстОшибки = "Должно быть установлено свойство автоматического подбора характеристики по свойствам продукции";
	Иначе
		ТекстОшибки = "";
	КонецЕсли;
	
	Если ТекстОшибки = "" Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("РеурснаяСпецификация", Объект.Ссылка);
		СтруктураПараметров.Вставить("Номенклатура", ТД.Номенклатура);
		
		//ОповещениеОЗакрытии = Новый ОписаниеОповещения;
		ОткрытьФорму("Обработка.бит_ПакетноеСозданиеПравилНаследования.Форма.Форма", СтруктураПараметров, ЭтаФорма, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.14]  [VUVaynula@1cbit.ru] [12.04.2026 20:12:14] -
КонецПроцедуры
