#Область ПрограммныйИнтерфейс

Функция ИспользуетсяБСП() Экспорт
	
	Возврат ИТК_БСППовтИсп.ИспользуетсяБСП();
	
КонецФункции

Функция ВыполнитьФункцию(ПолноеИмя, Параметры = Неопределено) Экспорт
	
	Результат = Истина;
	ВыполнитьМетод(ПолноеИмя, Параметры, Результат);
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьПроцедуру(ПолноеИмя, Параметры = Неопределено) Экспорт
	
	ВыполнитьМетод(ПолноеИмя, Параметры);
	
КонецПроцедуры

Функция ВозможноВыполнениеВФоне() Экспорт
	
	Если ИТК_БСПКлиентСерверПовтИсп.РежимОтладки() Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если ИТК_ОбщийКлиентСерверПовтИсп.ИнформационнаяБазаФайловая() Тогда
			
		Результат = НЕ ИТК_ДлительныеОперации.ЕстьАктивныеФоновыеЗадания();
			
	Иначе
			
		Результат = Истина;
			
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСсылкаНаСправочникПользователи(Значение) Экспорт
	
	Если НЕ ИспользуетсяБСП() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяТипаСправочникПользователи = "СправочникСсылка.Пользователи";
	Если ИТК_БСПКлиентСерверПовтИсп.АнглийскаяБСП() Тогда
		ИмяТипаСправочникПользователи = "CatalogRef.Users";
	КонецЕсли;
	
	Результат = (ТипЗнч(Значение) = Тип(ИмяТипаСправочникПользователи));
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьМетод(ПолноеИмя, Параметры, Результат = Неопределено)
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Массив;
	КонецЕсли;
	
	ЧастиИмени = СтрРазделить(ПолноеИмя, ".");
	ИмяМодуля = ЧастиИмени[0];
	
	Модуль = ИТК_БСПКлиентСерверПовтИсп.ОбщийМодуль(ИмяМодуля);
	Если Модуль = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Неизвестное имя модуля: %1 при вызове метода БСП", ИмяМодуля);
	КонецЕсли;
	ИмяФункции = ИТК_БСПКлиентСерверПовтИсп.ИмяФункцииМодуля(ЧастиИмени[1]);
	
	// Параметры
	ПараметрыФункции = Новый Массив;
	Для Индекс = 0 По Параметры.ВГраница() Цикл 
		
		ПараметрыФункции.Добавить(СтрШаблон("Параметры[%1]", Индекс));
		
	КонецЦикла;
	
	Выражение = СтрШаблон("Модуль.%1(%2)", ИмяФункции, СтрСоединить(ПараметрыФункции, ","));
	Если Результат = Истина Тогда
		Результат = Вычислить(Выражение);
	Иначе
		Выполнить(Выражение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
