&После("ПриСозданииНаСервере")
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	Если Элементы.Найти("бит_ЗаказНаПроизводство") <> Неопределено
		Или Элементы.Найти("Список") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяКолонка = Элементы.Добавить("бит_ЗаказНаПроизводство", Тип("ПолеФормы"), Элементы.Список);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ПутьКДанным = "Список.бит_ЗаказНаПроизводство";
	НоваяКолонка.Заголовок = "(бит) Заказ на производство";
	НоваяКолонка.ТолькоПросмотр = Истина;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецПроцедуры
