
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКэшЗначений();
	
	// Восстановим настройки оформления из хранилища.
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		СпрОб = Параметры.ЗначениеКопирования.ПолучитьОбъект();
	Иначе	
		СпрОб = РеквизитФормыВЗначение("Объект");
	КонецЕсли; 
	
	НастройкаОформления = СпрОб.ПолучитьОформление();
	Если ТипЗнч(НастройкаОформления) = Тип("Структура") Тогда
		
		бит_ОбщегоНазначения.УстановитьСвойствоИзСтруктуры(ЭтотОбъект, НастройкаОформления, "Шрифт"     , "фШрифт");
		бит_ОбщегоНазначения.УстановитьСвойствоИзСтруктуры(ЭтотОбъект, НастройкаОформления, "ШрифтАвто" , "фШрифтАвто");
		бит_ОбщегоНазначения.УстановитьСвойствоИзСтруктуры(ЭтотОбъект, НастройкаОформления, "ЦветФона"  , "фЦветФона");
		бит_ОбщегоНазначения.УстановитьСвойствоИзСтруктуры(ЭтотОбъект, НастройкаОформления, "ЦветТекста", "фЦветТекста");
		
	Иначе
		
		фЦветФона  = ЦветаСтиля.бит_ЦветФонаРМКИнформация;
		фШрифтАвто = Истина;
		фШрифт 	   = фКэшЗначений.ШрифтАвто;
		
	КонецЕсли; 	
		
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Запишем установленное оформление.
	СтруктураОформление = Новый Структура;
	СтруктураОформление.Вставить("Шрифт" 	 , фШрифт);
	СтруктураОформление.Вставить("ШрифтАвто" , фШрифтАвто);
	СтруктураОформление.Вставить("ЦветФона"	 , фЦветФона);
	СтруктураОформление.Вставить("ЦветТекста", фЦветТекста);   	
	
	ТекущийОбъект.СохранитьОформление(СтруктураОформление);  	
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов"           , фКэшЗначений.ДоступныеВидыОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы"   , Объект.Объект);
	ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", фКэшЗначений.ДоступныеОбъектыСистемы);
	
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	   	
КонецПроцедуры // ОбъектНачалоВыбора()

&НаКлиенте
Процедура фШрифтПриИзменении(Элемент)
	
	фШрифтАвто = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура фШрифтАвтоПриИзменении(Элемент)
	
	Если фШрифтАвто Тогда
	 	фШрифт = Новый Шрифт;
	Иначе
		фШрифт = фКэшЗначений.ШрифтПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет кэш значений доступных на сервере и на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	фКэшЗначений = Новый Структура;	
 
	ДоступныеВидыОбъектов = Новый СписокЗначений;
	ДоступныеВидыОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.Документ);
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		ДоступныеВидыОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.Справочник);
	КонецЕсли;
	ДоступныеВидыОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.Задача);
	ДоступныеВидыОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.БизнесПроцесс);

	фКэшЗначений.Вставить("ДоступныеВидыОбъектов", ДоступныеВидыОбъектов); 

	ДоступныеОбъектыСистемы = бит_ВизированиеСервер.ВизируемыеОбъектыСистемы();
	ТекОб = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени("Задача.бит_Задача"); 
	Если ЗначениеЗаполнено(ТекОб) Тогда 	 
		ДоступныеОбъектыСистемы.Добавить(ТекОб);	 
	КонецЕсли;

	ТекОб = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени("БизнесПроцесс.бит_Процесс"); 
	Если ЗначениеЗаполнено(ТекОб) Тогда 	 
		ДоступныеОбъектыСистемы.Добавить(ТекОб);  	 
	КонецЕсли; 

	фКэшЗначений.Вставить("ДоступныеОбъектыСистемы", ДоступныеОбъектыСистемы);
	фКэшЗначений.Вставить("ШрифтПоУмолчанию"	   , ШрифтыСтиля.ОбычныйШрифтТекста);
	фКэшЗначений.Вставить("ШрифтАвто"	   		   , Новый Шрифт);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

#КонецОбласти
