#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет наборы значений доступа.
// Параметры:
//  Таблица - ТаблицаЗначений - передает в этот параметр подготовленные наборы значений
//            доступа. Описание колонок см. в функции УправлениеДоступом.ТаблицаНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
		ЦФО, СтатьяОборотов);
	ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	ДобавитьСтрокуВНаборЗначенийДоступа(Ответственный, Таблица);
	
	// Таблица "Данные"
	Для каждого СтрокаТаблицы Из Данные Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
	
	// Таблица "База"
	Для каждого СтрокаТаблицы Из База Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
	
	// Таблица "РезультатРаспределения"
	Для каждого СтрокаТаблицы Из РезультатРаспределения Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
		
	// Удалим дубли
	ПоляГруппировки = "";
	Для каждого Колонка Из Таблица.Колонки Цикл
		ПоляГруппировки = "," + Колонка.Имя + ПоляГруппировки;
	КонецЦикла; 
	
	ПоляГруппировки = Сред(ПоляГруппировки, 2);
	Таблица.Свернуть(ПоляГруппировки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Для каждого СтрокаТаблицы Из Данные Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Регистратор) Тогда
			СтрокаТаблицы.Регистратор = Неопределено;		
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтоНовый()
		ИЛИ (РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения 
		И ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления")) Тогда
		ЗаполнитьЗависимыеОбороты();
	КонецЕсли;
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах.
	СуммаДокумента = Данные.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнение нового документа
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		бит_ОбщегоНазначения.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.бит_НастройкиРаспределенияБюджета") Тогда
		НастройкаРаспределения = ДанныеЗаполнения;
	КонецЕсли;
	
	// Заполнить реквизиты значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), 
		Неопределено, "РасходованиеБДДС");
	
	Если ЗначениеЗаполнено(Сценарий) Тогда 		
		ВалютаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "Валюта");			
	Иначе                                  			
		ВалютаДокумента = Константы.бит_ВалютаУправленческогоУчета.Получить();  		
	КонецЕсли; 											   
	
	ПолучитьКурсВалюты();  		
	
	Если НЕ ЗначениеЗаполнено(Данные_ДатаНачала) Тогда 			
		Данные_ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса()); 			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Данные_ДатаОкончания) Тогда 			
		Данные_ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(База_ДатаНачала) Тогда 			
		База_ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());  			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(База_ДатаОкончания) Тогда    			
		База_ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса()); 			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РежимЗависимыхОборотов) Тогда 			
		РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.НеФормировать;  			
	КонецЕсли; 	

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	бит_Бюджетирование.ПроверитьОбязательныеРазрезыСтатейОборотов(ЭтотОбъект, "РезультатРаспределения", Отказ);
	ДополнительныеСвойства.Вставить("ПроверитьЗаполнение", Ложь);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
		
	ПолучитьКурсВалюты();
	
	РучнаяКорректировка = Ложь;
	Ответственный		= Пользователи.ТекущийПользователь();
	
КонецПроцедуры
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.бит_РаспределениеБюджета.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	Документы.бит_РаспределениеБюджета.СформироватьДвиженияОборотыПоБюджетам(
		ПараметрыПроведения.ТаблицаОборотыПоБюджетам,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	Документы.бит_РаспределениеБюджета.СформироватьДвиженияБюджетирование(
		ПараметрыПроведения.ТаблицаОборотыПоБюджетам,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
    
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти
	 	
#Область СлужебныйПрограммныйИнтерфейс

// Процедура очищает табличную часть ЗависимыеОбороты.
// 
Процедура ОчиститьЗависимыеОбороты() Экспорт

	ЗависимыеОбороты.Очистить();

КонецПроцедуры // ОчиститьЗависимыеОбороты()

// Процедура заполняет табличную часть ЗависимыеОбороты.
// 
Процедура ЗаполнитьЗависимыеОбороты() Экспорт

	УстановитьПривилегированныйРежим(Истина);	
	
	ОчиститьЗависимыеОбороты();
	
	Если НЕ ЗначениеЗаполнено(РежимЗависимыхОборотов)
		ИЛИ РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.НеФормировать Тогда
		// Не формируем зависимые обороты.
		Возврат;
	КонецЕсли;
	
	ПараметыЗаполнения = бит_Бюджетирование.НовыеПараметыЗаполненияЗависимыхОборотов();
	ПараметыЗаполнения.ТаблицаИсточник      = РезультатРаспределения.Выгрузить();
	ПараметыЗаполнения.ТаблицаПриемник      = ЗависимыеОбороты.ВыгрузитьКолонки();
	ПараметыЗаполнения.Сценарий             = Сценарий;
	ПараметыЗаполнения.ВестиПротокол        = (ПараметыЗаполнения.ТаблицаПриемник.Колонки.Найти("КомментарийРасчета")
												<> Неопределено);
	ЗависимыеОбороты.Загрузить(бит_Бюджетирование.ЗависимыеОборотыПоИсточнику(ПараметыЗаполнения));
	
	Если СторнироватьДанные И СторнироватьЗависимыеОбороты Тогда
		СторнироватьРанееСозданныеЗависимыеОбороты();
	КонецЕсли; 														 
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

#КонецОбласти 	

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСтрокуВНаборЗначенийДоступа(ЗначениеДоступа, Таблица)
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = ЗначениеДоступа;

КонецПроцедуры

Процедура ПолучитьКурсВалюты()
	
	КурсВалюты 		   = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	КурсДокумента      = КурсВалюты.Курс;
	КратностьДокумента = КурсВалюты.Кратность;
	
КонецПроцедуры

// Процедура сторнирует ранее созданные зависимые обороты при нажатии флага СторнироватьЗависимыеОбороты. 
// 
Процедура СторнироватьРанееСозданныеЗависимыеОбороты()

	ТаблицаИсточник = Данные.Выгрузить();
	Для каждого СтрокаИсточника Из ТаблицаИсточник Цикл
		СтрокаИсточника.Сумма 		  = - СтрокаИсточника.Сумма;
		СтрокаИсточника.СуммаРегл 	  = - СтрокаИсточника.СуммаРегл;
		СтрокаИсточника.СуммаСценарий = - СтрокаИсточника.СуммаСценарий;
		СтрокаИсточника.СуммаУпр	  = - СтрокаИсточника.СуммаУпр;
	КонецЦикла;
	
	ПараметыЗаполнения = бит_Бюджетирование.НовыеПараметыЗаполненияЗависимыхОборотов();
	ПараметыЗаполнения.ТаблицаИсточник      = ТаблицаИсточник;
	ПараметыЗаполнения.ТаблицаПриемник      = ЗависимыеОбороты.ВыгрузитьКолонки();
	ПараметыЗаполнения.Сценарий             = Сценарий;
	ПараметыЗаполнения.ВестиПротокол        = (ПараметыЗаполнения.ТаблицаПриемник.Колонки.Найти("КомментарийРасчета")
												<> Неопределено);
												
	ТаблицаПриемник = бит_Бюджетирование.ЗависимыеОборотыПоИсточнику(ПараметыЗаполнения);
	Для каждого СтрокаЗависимых Из ТаблицаПриемник Цикл
		НоваяСтрока = ЗависимыеОбороты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗависимых);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли