#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Алгоритм = "Итог";
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("Вид") И ДанныеЗаполнения.Свойство("Владелец") Тогда		
			КодСортировки = Справочники.бит_мпд_ЭлементыТаблицПроизвольныхОтчетов.МаксимальныйКодСортировки(ДанныеЗаполнения.Владелец, ДанныеЗаполнения.Вид)+10;
		КонецЕсли;
	КонецЕсли; 
		
	Если НЕ ЗначениеЗаполнено(ВидЯчейки) Тогда		
		ВидЯчейки = Перечисления.бит_ВидыЯчеекПроизвольногоОтчета.Значение;		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда			
		Возврат;			
	КонецЕсли; 
	
	Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда	
		Возврат; 	
	КонецЕсли; 
	
	Если ЭтоНовый() Тогда
		
		// Проверим, что добавление элемента не приведет к пересечению таблиц.
		МассивОписаний = Справочники.бит_мпд_ТаблицыПроизвольныхОтчетов.ПолучитьТаблицыОтчета(Владелец);
		
		// Скорректируем описание текущей таблицы с учетом внесенных изменений.
		Сч = 0;
		Для каждого ОписаниеТаблицы Из МассивОписаний Цикл
			
			Если ОписаниеТаблицы.ТаблицаОтчета = ТаблицаОтчета Тогда
				
				ТекШирина = ОписаниеТаблицы.Ширина;
				ТекВысота = ОписаниеТаблицы.Высота;
				
				Если Вид = Перечисления.бит_мпд_ВидыЭлементовТаблицПроизвольныхОтчетов.Колонка Тогда					
					ТекШирина = ТекШирина + 1;					
				КонецЕсли; 
				
				Если Вид = Перечисления.бит_мпд_ВидыЭлементовТаблицПроизвольныхОтчетов.Строка Тогда					
					ТекВысота = ТекВысота + 1;					
				КонецЕсли; 
				
				ОписаниеТекТаблицы = Справочники.бит_мпд_ТаблицыПроизвольныхОтчетов.ПодготовитьОписаниеТаблицы(ТаблицаОтчета, 
																											   ТекШирина, ТекВысота);
				МассивОписаний[Сч] = ОписаниеТекТаблицы;
				Прервать;
				
			КонецЕсли; 
			
			Сч = Сч + 1;
		КонецЦикла; 
		
		Если Справочники.бит_мпд_ТаблицыПроизвольныхОтчетов.ПроверитьПересечения(МассивОписаний, Истина) Тогда			
			ТекстСообщения = НСтр("ru='Запись изменений невозможна из-за пересечения таблиц.';
								  |en='Record of changes is possible due to the intersection table.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);			
		КонецЕсли; 
		
	КонецЕсли; // ЭтоНовый()
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти
	
#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли