#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс
 
// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_Запросы.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти = Неопределено) Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда // В подчиненных узлах РИБ не выполняется.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЭлементМСФО_ОстаткиКонечные_СобствКонтр(Элементы);
	ЗаполнитьЭлементМСФО_Обороты_СобствКонтр(Элементы);
	ЗаполнитьЭлементПорталСверкиВГО_ДанныеКорректировокОборотыКт_Международный(Элементы);
	ЗаполнитьЭлементМСФО_ОстаткиНачальные(Элементы);
	ЗаполнитьЭлементМСФО_ОтложенныеНалоги_Остатки(Элементы);
	ЗаполнитьЭлементПорталСверкиВГО_ДанныеКорректировокКонечныеОстаткиДт_Международный(Элементы);
	ЗаполнитьЭлементМСФО_ВыручкаВГО(Элементы);
	ЗаполнитьЭлементМСФО_Обороты_СобствКонтрКор(Элементы);
	ЗаполнитьЭлементМСФО_Обороты(Элементы);
	ЗаполнитьЭлементМСФО_ОстаткиКонечные(Элементы);
	ЗаполнитьЭлементМСФО_ОстаткиНачальные_СобствКонтр(Элементы);
	ЗаполнитьЭлементПорталСверкиВГО_ДанныеКорректировокОборотыДт_Международный(Элементы);
	ЗаполнитьЭлементМСФО_Остатки_НереализованнаяПрибыль(Элементы);
	ЗаполнитьЭлементПорталСверкиВГО_ДанныеКорректировокКонечныеОстаткиКт_Международный(Элементы);

КонецПроцедуры

Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт

	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

// Функция определяет является данный запрос - запросом на внутреннем языке 1С.
// 
// Параметры:
//  ЗапросСсылка - СправочникСсылка.бит_Запросы.
// 
// Возвращаемое значение:
//  Результат - Строка.
// 
Функция ЭтоОбычныйЗапрос(ЗапросСсылка) Экспорт

	флОбычный = ?(ЗапросСсылка.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С 
	              ИЛИ НЕ ЗначениеЗаполнено(ЗапросСсылка.Вид), Истина, Ложь);
	

	Возврат флОбычный;
	
КонецФункции // ЭтоОбычныйЗапрос()

// Функция получает доступные HTTP запросы.
// 
// Параметры:
//   ЗапросСсылка - СправочникСсылка.бит_Запросы.
// 
// Возвращаемое значение:
//  РезСтруктура - Структура.
// 
Функция ПолучитьДоступныеЗапросыHTTP(ЗапросСсылка) Экспорт
	
	РезСтруктура = Новый Структура;
	
	ПризнакОбращения = бит_ПолучениеДанных.ПризнакОбращенияОДата();
	
	// Инициализация дерева выбора.
	ДеревоВыбора = Новый ДеревоЗначений;
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ДеревоВыбора.Колонки.Добавить("Значение"     , ОписаниеТиповСтрока);
	ДеревоВыбора.Колонки.Добавить("Представление", ОписаниеТиповСтрока);
	ДеревоВыбора.Колонки.Добавить("Картинка"     , Новый ОписаниеТипов("Картинка"));
	ДеревоВыбора.Колонки.Добавить("Уровень"		 , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1)));
		
	СтрокаРН = ДеревоВыбора.Строки.Добавить();
	СтрокаРН.Значение = "РегистрыНакопления";
	СтрокаРН.Представление = НСтр("ru='Регистры накопления';en='Accumulation registers'");
	СтрокаРН.Картинка = БиблиотекаКартинок.РегистрНакопления;
	СтрокаРН.Уровень = 0;
	
	СтрокаРБ = ДеревоВыбора.Строки.Добавить();
	СтрокаРБ.Значение = "РегистрыБухгалтерии";
	СтрокаРБ.Представление = НСтр("ru='Регистры бухгалтерии';en='Accounting registers'");
	СтрокаРБ.Картинка = БиблиотекаКартинок.РегистрБухгалтерии;
	СтрокаРБ.Уровень = 0;
	
	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ЗапросСсылка.ВидИнформационнойБазы.НастройкаПодключенияПоУмолчанию) Тогда		
		ТекстСообщения =  НСтр("ru = 'Для вида информационной базы не заполнены параметры подключения по-умолчанию.'; 
		                       |en = 'For the type of infobase, the default connection parameters are not filled.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);				
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		
		СтрОтвет = ПолучитьМетаданныеHTTP(ЗапросСсылка);
		
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(СтрОтвет);
		
		Пока Чтение.Прочитать() Цикл
		
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента 
				 И Чтение.Имя = "FunctionImport" 
				 И Чтение.КоличествоАтрибутов() > 0 Тогда
			
				 ИмяФункции = Чтение.ПолучитьАтрибут("Name");
				 Выражение = Чтение.ПолучитьАтрибут("ReturnType");
				 
				 // Выделим имя регистра
				 Выражение = СтрЗаменить(Выражение, "Collection(","");
				 Выражение = СтрЗаменить(Выражение, ")", "");
				 Выражение = СтрЗаменить(Выражение, "StandardODATA.","");
				 Выражение = СтрЗаменить(Выражение, "_Turnover", "");
				 Выражение = СтрЗаменить(Выражение, "_BalanceAndTurnover", "");
				 Выражение = СтрЗаменить(Выражение, "_Balance", "");
				 Выражение = СтрЗаменить(Выражение, "_ExtDimensions", "");
				 Выражение = СтрЗаменить(Выражение, "_RecordsWithExtDimensions", "");
				 Выражение = СтрЗаменить(Выражение, "_DrCrTurnover", "");
				 
				 
				 ТекстЗапроса = ПризнакОбращения+Выражение+"/"+ИмяФункции;
				 Если ВРег(ИмяФункции) = ВРег("Balance") Тогда
					 
					 ТекстЗапроса = ТекстЗапроса + "(Period=datetime'&КонецПериода')";					 
					 
				 ИначеЕсли ВРег(ИмяФункции) = ВРег("Turnovers") Тогда
					 
					 ТекстЗапроса = ТекстЗапроса + "(StartPeriod=datetime'&НачалоПериода',EndPeriod=datetime'&КонецПериода')";
					 
				 ИначеЕсли ВРег(ИмяФункции) = ВРег("BalanceAndTurnovers") Тогда
					 
					 ТекстЗапроса = ТекстЗапроса + "(StartPeriod=datetime'&НачалоПериода',EndPeriod=datetime'&КонецПериода')";
					 
				 Иначе	 
					 
					ТекстЗапроса = ТекстЗапроса + "()"; 
					 
				 КонецЕсли; 
				 
				 ИмяОбъектаПолное = Выражение;
				 Если Найти(ИмяОбъектаПолное, "RecordType") > 0 Тогда
					 
					 Продолжить;
					 
				 КонецЕсли; 
				 
				 ПозицияПодч = Найти(ИмяОбъектаПолное,"_");
				 ИмяКоллекции = Лев(ИмяОбъектаПолное, ПозицияПодч - 1);
				 ИмяОбъекта = Сред(ИмяОбъектаПолное, ПозицияПодч + 1);
				 
				 СтрОтбор = Новый Структура;
				 СтрОтбор.Вставить("Значение", ИмяОбъекта);
				 
				 Если ИмяКоллекции = "AccumulationRegister" Тогда
					 
					  НайденныеСтроки = СтрокаРН.Строки.НайтиСтроки(СтрОтбор);
					  
					  Если НайденныеСтроки.Количество() = 0 Тогда
						  
						  СтрокаОбъект = СтрокаРН.Строки.Добавить();
						  СтрокаОбъект.Значение = ИмяОбъекта;
						  СтрокаОбъект.Представление = ИмяОбъекта;
						  СтрокаОбъект.Уровень = 1;	
						  
					  Иначе	
						  
						  СтрокаОбъект = НайденныеСтроки[0];
						  
					  КонецЕсли; 
					 
				 ИначеЕсли ИмяКоллекции = "AccountingRegister" Тогда	
					 
					  НайденныеСтроки = СтрокаРБ.Строки.НайтиСтроки(СтрОтбор);
					  
					  Если НайденныеСтроки.Количество() = 0 Тогда
						  
						  СтрокаОбъект = СтрокаРБ.Строки.Добавить();
						  СтрокаОбъект.Значение = ИмяОбъекта;
						  СтрокаОбъект.Представление = ИмяОбъекта;
						  СтрокаОбъект.Уровень = 1;	
						  
					  Иначе	
						  
						  СтрокаОбъект = НайденныеСтроки[0];
						  
					  КонецЕсли; 
					  
					 
				 КонецЕсли; 
				 
				 Если НЕ СтрокаОбъект = Неопределено Тогда
					 
					 СтрокаДетали = СтрокаОбъект.Строки.Добавить();
					 СтрокаДетали.Значение = ТекстЗапроса;
					 СтрокаДетали.Представление =  ИмяФункции;
					 СтрокаДетали.Уровень = 2;				 
					 
				 КонецЕсли; 
				 
				 
			КонецЕсли; 
		
		КонецЦикла; 
		
		
	КонецЕсли; 
	
	РезСтруктура.Вставить("НомерТекущейСтроки", 0);
	РезСтруктура.Вставить("ХранилищеДереваВыбора", бит_ОбщегоНазначения.УпаковатьДеревоЗначений(ДеревоВыбора));
	РезСтруктура.Вставить("Режим", "HTTP");
	
	Возврат РезСтруктура;
	
КонецФункции // ПолучитьДоступныеЗапросыHTTP()

// Функция получает доступные поля HTTP запроса.
// 
// Параметры:
//   ЗапросСсылка - СправочникСсылка.бит_Запросы - объект обработки.
//   ТекущийТекстЗапроса - Строка.
// 
// Возвращаемое значение:
//  РезПоля - Структура.
// 
Функция ПолучитьДоступныеПоляHTTP(ЗапросСсылка, ТекущийТекстЗапроса) Экспорт
	
	РезПоля = Новый Структура;
	
	ПризнакОбращения = бит_ПолучениеДанных.ПризнакОбращенияОДата();
	
	// Поля, которые не добавляем
	Исключения = Новый Массив;
	Исключения.Добавить("LineNumber");
	Исключения.Добавить("Recorder");
	Исключения.Добавить("Recorder_Type");
	
	// Кэш для поиска типов
	Ассоциации = Новый Соответствие;	
	
	ИмяТипа = СтрЗаменить(ТекущийТекстЗапроса, ПризнакОбращения, "");
	НомСлэш = Найти(ИмяТипа,"/");
	Если НомСлэш > 0 Тогда		
		ИмяТипа = Лев(ИмяТипа, НомСлэш-1);		
	КонецЕсли; 
	
	ИмяОбъекта = ИмяТипа;
	
	Если Найти(ТекущийТекстЗапроса, "Balance(") > 0 Тогда		
		ИмяТипа = ИмяТипа+"_Balance";		
	ИначеЕсли Найти(ТекущийТекстЗапроса, "Turnovers(") > 0 Тогда		
		ИмяТипа = ИмяТипа+"_Turnover";		
	ИначеЕсли Найти(ТекущийТекстЗапроса, "BalanceAndTurnovers(") > 0 Тогда		
		ИмяТипа = ИмяТипа+"_BalanceAndTurnover";		
	КонецЕсли; 
	
	СтрОтвет = ПолучитьМетаданныеHTTP(ЗапросСсылка);
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(СтрОтвет);
	
	флОбходПолей = Ложь;
	ТекАссоциация = "";
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента 
			И Чтение.Имя = "ComplexType" 
			И Чтение.КоличествоАтрибутов() > 0 Тогда
			
			ТекИмя = Чтение.ПолучитьАтрибут("Name");			
			Если ТекИмя = ИмяТипа Тогда				
				флОбходПолей = Истина;				
			КонецЕсли; 
			
		КонецЕсли;
		
		// Поиск полей регистра
		Если флОбходПолей Тогда
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента 
				И Чтение.Имя = "Property" 
				И Чтение.КоличествоАтрибутов() > 0 Тогда
				
				ИмяПоля = Чтение.ПолучитьАтрибут("Name");
				ТипСтр = Чтение.ПолучитьАтрибут("Type");
				
				// Периоды не выводятся - ограничение платформы, невыводим.
				Если Найти(ИмяПоля,"Period") > 0 Тогда					
					Продолжить;					
				КонецЕсли; 
				
				Если Исключения.Найти(ИмяПоля) <> Неопределено Тогда				
					 Продолжить;				
				КонецЕсли; 
				
				ОписаниеПоля = Новый Структура;
				ОписаниеПоля.Вставить("Имя", ИмяПоля);
				ОписаниеПоля.Вставить("ТипСтр", ТипСтр);
				ОписаниеПоля.Вставить("ТекстЗапроса", "");
				
				Если Найти(ИмяПоля,"_Key") > 0 Тогда				
					ИмяБезКлюча = СтрЗаменить(ИмяПоля,"_Key","");
					ИмяАссоциации = ИмяОбъекта+"_RecordType_"+ИмяБезКлюча;
					Ассоциации.Вставить(ИмяАссоциации, ИмяПоля);				
				КонецЕсли; 
				
				РезПоля.Вставить(ИмяПоля, ОписаниеПоля);
				
			КонецЕсли; 
			
			Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "ComplexType" Тогда				
				флОбходПолей = Ложь;				
			КонецЕсли; 
			
		КонецЕсли; // Поиск полей регистра
		
		// Поиск типов в ассоциациях
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя = "Association" Тогда
		
			ИмяАссоциации = Чтение.ПолучитьАтрибут("Name");			
			Если Ассоциации[ИмяАссоциации] <> Неопределено Тогда			
				 ТекАссоциация = ИмяАссоциации;			
			КонецЕсли; 
		
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ТекАссоциация) Тогда
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И Чтение.Имя = "End" Тогда
				
				Роль = Чтение.ПолучитьАтрибут("Role");				
				Если Роль = "End" Тогда
					
					ТипСтр = Чтение.ПолучитьАтрибут("Type");
					ТипСтр = СтрЗаменить(ТипСтр, "StandardODATA.", "");
					ИмяПоля = Ассоциации[ИмяАссоциации];
					Если ЗначениеЗаполнено(ИмяПоля) Тогда						
						РезПоля[ИмяПоля].ТекстЗапроса = ТипСтр;						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "ComplexType" Тогда				
				ИмяАссоциации = "";				
			КонецЕсли; 
			
		КонецЕсли; // Поиск типов в ассоциациях
		
	КонецЦикла; // По узлам
	
	// Окончательная обработка выбранных полей
	Для каждого КиЗ Из РезПоля Цикл
	
		ОписаниеПоля = КиЗ.Значение;
		
		Если ЗначениеЗаполнено(ОписаниеПоля.ТекстЗапроса) Тогда
			
			Если Найти(ОписаниеПоля.ТекстЗапроса,"Catalog_") > 0 Тогда				
				ОписаниеПоля.ТипСтр = СтрЗаменить(ОписаниеПоля.ТекстЗапроса, "Catalog_", "СправочникСсылка.");				
			КонецЕсли; 
			
			Если Найти(ОписаниеПоля.ТекстЗапроса,"Document_") > 0 Тогда				
				ОписаниеПоля.ТипСтр = СтрЗаменить(ОписаниеПоля.ТекстЗапроса, "Document_", "ДокументСсылка.");				
			КонецЕсли; 
			
			ОписаниеПоля.ТекстЗапроса = ПризнакОбращения+ОписаниеПоля.ТекстЗапроса;
			
		Иначе	
			
			Если ВРег(ОписаниеПоля.ТипСтр) = ВРег("Edm.Double") Тогда			
				ОписаниеПоля.ТипСтр = "Число";				
			ИначеЕсли ВРег(ОписаниеПоля.ТипСтр) = ВРег("Edm.String") Тогда				
				ОписаниеПоля.ТипСтр = "Строка";				
			Иначе
				ОписаниеПоля.ТипСтр = "Строка";				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат РезПоля;
	
КонецФункции // ПолучитьДоступныеПоляHTTP()

Процедура ПроверитьПервоначальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_Запросы КАК Таблица
	|ГДЕ
	|	Таблица.Предопределенный
	|	И Таблица.ЭтоГруппа = ЛОЖЬ
	|	И Таблица.АвтозаполнениеНастроек";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получает структуру метаданных целевой внешней базы по HTTP.
// 
// Параметры:
//  ЗапросСсылка - СправочникСсылка.бит_Запросы.
// 
// Возвращаемое значение:
//  СтрОтвет - Строка.
// 
Функция ПолучитьМетаданныеHTTP(ЗапросСсылка)
	
	НастройкаПодключения = ЗапросСсылка.ВидИнформационнойБазы.НастройкаПодключенияПоУмолчанию;
	ОтветHTTP = бит_ПолучениеДанных.ПолучитьМетаданныеHTTP(НастройкаПодключения);
	СтрОтвет = ОтветHTTP.ПолучитьТелоКакСтроку();
	
	Возврат СтрОтвет;
	
КонецФункции

Процедура ЗаполнитьЭлементПорталСверкиВГО_ДанныеКорректировокКонечныеОстаткиКт_Международный(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПорталСверкиВГО_ДанныеКорректировокКонечныеОстаткиКт_Международный";
	Элемент.Родитель = Справочники.бит_Запросы.ПорталСверкиВГО;
	Элемент.Наименование = НСтр("ru = 'ПорталСверкиВГО.ДанныеКорректировокКонечныеОстаткиКт (Международный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000023";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставПериметра.Организация КАК Организация
	|ПОМЕСТИТЬ ОрганизацииПериметра
	|ИЗ
	|	РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|ГДЕ
	|	(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|			ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|	И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|	И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие)
	|
	|СГРУППИРОВАТЬ ПО
	|	СоставПериметра.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СобственныеКонтрагенты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ СобствКонтрагентыПериметра
	|ИЗ
	|	РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты
	|ГДЕ
	|	бит_СобственныеКонтрагенты.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСобственныхКонтрагентов.Организация)
	|	И бит_СобственныеКонтрагенты.Объект В
	|			(ВЫБРАТЬ
	|				СоставПериметра.Организация
	|			ИЗ
	|				ОрганизацииПериметра КАК СоставПериметра)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СобственныеКонтрагенты.Объект,
	|	бит_СобственныеКонтрагенты.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ДанныеКорректОбороты.СуммаМУКтОборот) КАК СуммаМУ_Кт,
	|	СУММА(ДанныеКорректОбороты.СуммаРеглКтОборот) КАК СуммаРегл_Кт,
	|	СУММА(ДанныеКорректОбороты.СуммаУпрКтОборот) КАК СуммаУпр_Кт,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеКорректОбороты.ВалютнаяСуммаКтОборот = ДанныеКорректОбороты.СуммаМУКтОборот
	|				ТОГДА NULL
	|			ИНАЧЕ ДанныеКорректОбороты.ВалютнаяСуммаКтОборот
	|		КОНЕЦ) КАК ВалютнаяСумма_Кт,
	|	ВЫБОР
	|		КОГДА ДанныеКорректОбороты.ВалютнаяСуммаКтОборот = ДанныеКорректОбороты.СуммаМУКтОборот
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеКорректОбороты.ВалютаКт
	|	КОНЕЦ КАК Валюта
	|{ВЫБРАТЬ
	|	ДанныеКорректОбороты.Организация.*,
	|	ДанныеКорректОбороты.Контрагент.*,
	|	ДанныеКорректОбороты.СчетКт.*,
	|	СуммаМУ_Кт,
	|	СуммаРегл_Кт,
	|	СуммаУпр_Кт,
	|	ВалютнаяСумма_Кт,
	|	(ВЫБОР
	|			КОГДА ДанныеКорректОбороты.ВалютнаяСуммаКтОборот = ДанныеКорректОбороты.СуммаМУКтОборот
	|				ТОГДА NULL
	|			ИНАЧЕ ДанныеКорректОбороты.ВалютаКт
	|		КОНЕЦ) КАК Валюта,
	|	ДанныеКорректОбороты.СубконтоКт_1.*,
	|	ДанныеКорректОбороты.СубконтоКт_2.*,
	|	ДанныеКорректОбороты.СубконтоКт_3.*,
	|	ДанныеКорректОбороты.СубконтоКт_4.*}
	|ИЗ
	|	РегистрНакопления.бит_вго_ДанныеКорректировок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			ОперацияВГО = ЗНАЧЕНИЕ(Справочник.бит_вго_ОперацииВГО.КонечноеСальдо)
	|				И РегистрБухгалтерии = &РегистрБухгалтерии
	|				И Организация В
	|					(ВЫБРАТЬ
	|						СоставПериметра.Организация
	|					ИЗ
	|						ОрганизацииПериметра КАК СоставПериметра) {(СчетКт)}) КАК ДанныеКорректОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобствКонтрагентыПериметра КАК СобствКонтрагентыПериметра
	|		ПО (ВЫБОР
	|				КОГДА ДанныеКорректОбороты.Контрагент ССЫЛКА Справочник.Контрагенты
	|					ТОГДА ДанныеКорректОбороты.Контрагент = СобствКонтрагентыПериметра.Контрагент
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ СобствКонтрагентыПериметра.Контрагент ЕСТЬ NULL
	|{ГДЕ
	|	ДанныеКорректОбороты.Валюта.*,
	|	ДанныеКорректОбороты.СчетКт.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ДанныеКорректОбороты.ВалютнаяСуммаКтОборот = ДанныеКорректОбороты.СуммаМУКтОборот
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеКорректОбороты.ВалютаКт
	|	КОНЕЦ
	|{ИТОГИ ПО
	|	ДанныеКорректОбороты.СчетКт.*}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОрганизацииПериметра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СобствКонтрагентыПериметра";
	Элемент.Релиз = "1.0.0.2";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементМСФО_Остатки_НереализованнаяПрибыль(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МСФО_Остатки_НереализованнаяПрибыль";
	Элемент.Родитель = Справочники.бит_Запросы.МСФО;
	Элемент.Наименование = НСтр("ru = 'МСФО.ОстаткиНереализованнаяПрибыль'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000010";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ
	|	бит_му_ПартииМПЗОстатки.Организация КАК Организация,
	|	бит_му_ПартииМПЗОстатки.Номенклатура КАК Номенклатура,
	|	бит_му_ПартииМПЗОстатки.СчетУчета КАК СчетУчета,
	|	бит_му_ПартииМПЗОстатки.СуммаУпрОстаток - бит_му_ПартииМПЗОстатки.СуммаПоступленияУпрОстаток КАК СуммаУпрОстаток,
	|	бит_му_ПартииМПЗОстатки.СуммаПоступленияУпрОстаток КАК СуммаПоступленияУпрОстаток,
	|	бит_му_ПартииМПЗОстатки.КоличествоОстаток КАК КоличествоОстаток
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Номенклатура.*,
	|	СчетУчета.*,
	|	СуммаУпрОстаток,
	|	СуммаПоступленияУпрОстаток,
	|	КоличествоОстаток}
	|ИЗ
	|	РегистрНакопления.бит_му_ПартииМПЗ.Остатки(
	|			&КонецПериода,
	|			Организация В
	|				(ВЫБРАТЬ
	|					СоставПериметра.Организация
	|				ИЗ
	|					РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|				ГДЕ
	|					(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|						ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|					И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|					И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие))) КАК бит_му_ПартииМПЗОстатки
	|ГДЕ
	|	бит_му_ПартииМПЗОстатки.СуммаУпрОстаток - бит_му_ПартииМПЗОстатки.СуммаПоступленияУпрОстаток <> 0
	|{ГДЕ
	|	бит_му_ПартииМПЗОстатки.Организация.*,
	|	бит_му_ПартииМПЗОстатки.Номенклатура.*,
	|	бит_му_ПартииМПЗОстатки.СчетУчета.*,
	|	бит_му_ПартииМПЗОстатки.СуммаУпрОстаток,
	|	бит_му_ПартииМПЗОстатки.СуммаПоступленияУпрОстаток,
	|	бит_му_ПартииМПЗОстатки.КоличествоОстаток}
	|{УПОРЯДОЧИТЬ ПО
	|	Организация.*,
	|	Номенклатура.*,
	|	СчетУчета.*,
	|	СуммаУпрОстаток,
	|	СуммаПоступленияУпрОстаток,
	|	КоличествоОстаток}
	|{ИТОГИ ПО
	|	Организация.*,
	|	Номенклатура.*,
	|	СчетУчета.*,
	|	СуммаУпрОстаток,
	|	СуммаПоступленияУпрОстаток,
	|	КоличествоОстаток}";
	Элемент.Релиз = "1.0.0.5";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементПланируемыеЗатраты(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПланируемыеЗатраты";
	Элемент.Родитель = Справочники.бит_Запросы.ДоговорыИЗакупки;
	Элемент.Наименование = НСтр("ru = 'Планируемые затраты'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000031";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПланируемыеЗатратыОбороты.ЦФО КАК ЦФО,
	|	бит_ПланируемыеЗатратыОбороты.СтатьяОборотов КАК СтатьяОборотов,
	|	бит_ПланируемыеЗатратыОбороты.Проект КАК Проект,
	|	бит_ПланируемыеЗатратыОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	бит_ПланируемыеЗатратыОбороты.Аналитика_1 КАК Аналитика_1,
	|	бит_ПланируемыеЗатратыОбороты.Аналитика_2 КАК Аналитика_2,
	|	бит_ПланируемыеЗатратыОбороты.Аналитика_3 КАК Аналитика_3,
	|	бит_ПланируемыеЗатратыОбороты.Аналитика_4 КАК Аналитика_4,
	|	бит_ПланируемыеЗатратыОбороты.Аналитика_5 КАК Аналитика_5,
	|	бит_ПланируемыеЗатратыОбороты.Аналитика_6 КАК Аналитика_6,
	|	бит_ПланируемыеЗатратыОбороты.Аналитика_7 КАК Аналитика_7,
	|	бит_ПланируемыеЗатратыОбороты.СуммаОборот КАК СуммаОборот,
	|	бит_ПланируемыеЗатратыОбороты.СуммаРеглОборот КАК СуммаРеглОборот,
	|	бит_ПланируемыеЗатратыОбороты.СуммаУпрОборот КАК СуммаУпрОборот,
	|	бит_ПланируемыеЗатратыОбороты.Контрагент КАК Контрагент,
	|	бит_ПланируемыеЗатратыОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	бит_ПланируемыеЗатратыОбороты.Валюта КАК Валюта,
	|	бит_ПланируемыеЗатратыОбороты.Организация КАК Организация,
	|	бит_ПланируемыеЗатратыОбороты.ДокументПланирования.ДатаРасхода КАК Период
	|{ВЫБРАТЬ
	|	Организация.*,
	|	ЦФО.*,
	|	СтатьяОборотов.*,
	|	Проект.*,
	|	НоменклатурнаяГруппа.*,
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	Аналитика_1.*,
	|	Аналитика_2.*,
	|	Аналитика_3.*,
	|	Аналитика_4.*,
	|	Аналитика_5.*,
	|	Аналитика_6.*,
	|	Аналитика_7.*,
	|	СуммаОборот,
	|	СуммаРеглОборот,
	|	СуммаУпрОборот,
	|	Период,
	|	Валюта.*}
	|ИЗ
	|	РегистрНакопления.бит_ПланируемыеЗатраты.Обороты(&НачалоПериода, &КонецПериода, , {(Организация).*, (Валюта).*, (ЦФО).*, (СтатьяОборотов).*, (Проект).*, (Контрагент).*, (ДоговорКонтрагента).*, (НоменклатурнаяГруппа).*, (Аналитика_1).*, (Аналитика_2).*, (Аналитика_3).*, (Аналитика_4).*, (Аналитика_5).*, (Аналитика_6).*, (Аналитика_7).*}) КАК бит_ПланируемыеЗатратыОбороты";
	Элемент.Релиз = "1.0.0.1";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементПорталСверкиВГО_ДанныеКорректировокОборотыДт_Международный(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПорталСверкиВГО_ДанныеКорректировокОборотыДт_Международный";
	Элемент.Родитель = Справочники.бит_Запросы.ПорталСверкиВГО;
	Элемент.Наименование = НСтр("ru = 'ПорталСверкиВГО.ДанныеКорректировокОборотыДт (Международный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000020";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставПериметра.Организация КАК Организация
	|ПОМЕСТИТЬ ОрганизацииПериметра
	|ИЗ
	|	РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|ГДЕ
	|	(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|			ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|	И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|	И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие)
	|
	|СГРУППИРОВАТЬ ПО
	|	СоставПериметра.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СобственныеКонтрагенты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ СобствКонтрагентыПериметра
	|ИЗ
	|	РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты
	|ГДЕ
	|	бит_СобственныеКонтрагенты.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСобственныхКонтрагентов.Организация)
	|	И бит_СобственныеКонтрагенты.Объект В
	|			(ВЫБРАТЬ
	|				СоставПериметра.Организация
	|			ИЗ
	|				ОрганизацииПериметра КАК СоставПериметра)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СобственныеКонтрагенты.Объект,
	|	бит_СобственныеКонтрагенты.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ДанныеКорректОбороты.СуммаМУДтОборот) КАК СуммаМУ_Дт,
	|	СУММА(ДанныеКорректОбороты.СуммаРеглДтОборот) КАК СуммаРегл_Дт,
	|	СУММА(ДанныеКорректОбороты.СуммаУпрДтОборот) КАК СуммаУпр_Дт,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеКорректОбороты.ВалютнаяСуммаДтОборот = ДанныеКорректОбороты.СуммаМУДтОборот
	|				ТОГДА NULL
	|			ИНАЧЕ ДанныеКорректОбороты.ВалютнаяСуммаДтОборот
	|		КОНЕЦ) КАК ВалютнаяСумма_Дт,
	|	ВЫБОР
	|		КОГДА ДанныеКорректОбороты.ВалютнаяСуммаДтОборот = ДанныеКорректОбороты.СуммаМУДтОборот
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеКорректОбороты.ВалютаДт
	|	КОНЕЦ КАК Валюта
	|{ВЫБРАТЬ
	|	ДанныеКорректОбороты.Организация.*,
	|	ДанныеКорректОбороты.Контрагент.*,
	|	ДанныеКорректОбороты.СчетДт.*,
	|	СуммаМУ_Дт,
	|	СуммаРегл_Дт,
	|	СуммаУпр_Дт,
	|	ВалютнаяСумма_Дт,
	|	(ВЫБОР
	|			КОГДА ДанныеКорректОбороты.ВалютнаяСуммаДтОборот = ДанныеКорректОбороты.СуммаМУДтОборот
	|				ТОГДА NULL
	|			ИНАЧЕ ДанныеКорректОбороты.ВалютаДт
	|		КОНЕЦ) КАК Валюта,
	|	ДанныеКорректОбороты.СубконтоДт_1.*,
	|	ДанныеКорректОбороты.СубконтоДт_2.*,
	|	ДанныеКорректОбороты.СубконтоДт_3.*,
	|	ДанныеКорректОбороты.СубконтоДт_4.*}
	|ИЗ
	|	РегистрНакопления.бит_вго_ДанныеКорректировок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			ОперацияВГО.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.бит_вго_ВидыОперацийВГО.Остатки)
	|				И РегистрБухгалтерии = &РегистрБухгалтерии
	|				И Организация В
	|					(ВЫБРАТЬ
	|						СоставПериметра.Организация
	|					ИЗ
	|						ОрганизацииПериметра КАК СоставПериметра) {(СчетДт)}) КАК ДанныеКорректОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобствКонтрагентыПериметра КАК СобствКонтрагентыПериметра
	|		ПО (ВЫБОР
	|				КОГДА ДанныеКорректОбороты.Контрагент ССЫЛКА Справочник.Контрагенты
	|					ТОГДА ДанныеКорректОбороты.Контрагент = СобствКонтрагентыПериметра.Контрагент
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ СобствКонтрагентыПериметра.Контрагент ЕСТЬ NULL
	|{ГДЕ
	|	ДанныеКорректОбороты.Валюта.*,
	|	ДанныеКорректОбороты.СчетДт.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ДанныеКорректОбороты.ВалютнаяСуммаДтОборот = ДанныеКорректОбороты.СуммаМУДтОборот
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеКорректОбороты.ВалютаДт
	|	КОНЕЦ
	|{ИТОГИ ПО
	|	ДанныеКорректОбороты.СчетДт.*}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОрганизацииПериметра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СобствКонтрагентыПериметра";
	Элемент.Релиз = "1.0.0.2";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементМСФО_ОстаткиНачальные_СобствКонтр(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МСФО_ОстаткиНачальные_СобствКонтр";
	Элемент.Родитель = Справочники.бит_Запросы.МСФО;
	Элемент.Наименование = НСтр("ru = 'МСФО.ОстаткиНачальные.СобствКонтр'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000005";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СобственныеКонтрагенты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ СобствКонтрагентыПериметра
	|ИЗ
	|	РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты
	|ГДЕ
	|	бит_СобственныеКонтрагенты.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСобственныхКонтрагентов.Организация)
	|	И бит_СобственныеКонтрагенты.Объект В
	|			(ВЫБРАТЬ
	|				СоставПериметра.Организация
	|			ИЗ
	|				РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&НачалоПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|			ГДЕ
	|				(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &НачалоПериода
	|					ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|				И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|				И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МСФО_Остатки.Организация КАК Организация,
	|	МСФО_Остатки.Валюта КАК Валюта,
	|	МСФО_Остатки.Субконто1 КАК Субконто1,
	|	МСФО_Остатки.Субконто2 КАК Субконто2,
	|	МСФО_Остатки.Субконто3 КАК Субконто3,
	|	МСФО_Остатки.Субконто4 КАК Субконто4,
	|	СУММА(МСФО_Остатки.СуммаРеглОстатокДт) КАК СуммаРеглОстатокДт,
	|	СУММА(МСФО_Остатки.СуммаУпрОстатокДт) КАК СуммаУпрОстатокДт,
	|	СУММА(МСФО_Остатки.СуммаМУОстатокДт) КАК СуммаМУОстатокДт,
	|	СУММА(МСФО_Остатки.ВалютнаяСуммаОстатокДт) КАК ВалютнаяСуммаОстатокДт,
	|	СУММА(МСФО_Остатки.КоличествоОстатокДт) КАК КоличествоОстатокДт,
	|	СУММА(МСФО_Остатки.СуммаРеглОстатокКт) КАК СуммаРеглОстатокКт,
	|	СУММА(МСФО_Остатки.СуммаУпрОстатокКт) КАК СуммаУпрОстатокКт,
	|	СУММА(МСФО_Остатки.СуммаМУОстатокКт) КАК СуммаМУОстатокКт,
	|	СУММА(МСФО_Остатки.ВалютнаяСуммаОстатокКт) КАК ВалютнаяСуммаОстатокКт,
	|	СУММА(МСФО_Остатки.КоличествоОстатокКт) КАК КоличествоОстатокКт,
	|	СобствКонтрагентыПериметра.Контрагент КАК Контрагент
	|{ВЫБРАТЬ
	|	СуммаРеглОстатокДт,
	|	СуммаРеглОстатокКт,
	|	СуммаУпрОстатокДт,
	|	СуммаУпрОстатокКт,
	|	КоличествоОстатокДт,
	|	КоличествоОстатокКт,
	|	СуммаМУОстатокДт,
	|	СуммаМУОстатокКт,
	|	МСФО_Остатки.Счет.*,
	|	МСФО_Остатки.Субконто1.*,
	|	МСФО_Остатки.Субконто2.*,
	|	МСФО_Остатки.Субконто3.*,
	|	МСФО_Остатки.Субконто4.*,
	|	МСФО_Остатки.Валюта.*,
	|	МСФО_Остатки.Организация.*,
	|	ВалютнаяСуммаОстатокКт,
	|	ВалютнаяСуммаОстатокДт}
	|ИЗ
	|	РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
	|			&НачалоПериода,
	|			{(Счет)},
	|			,
	|			Организация В
	|					(ВЫБРАТЬ
	|						СоставПериметра.Организация
	|					ИЗ
	|						РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&НачалоПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|					ГДЕ
	|						(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &НачалоПериода
	|							ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|						И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|						И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие))
	|				И ВЫБОР
	|					КОГДА Субконто1 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА Субконто2 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА Субконто3 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА Субконто4 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ {(Организация), (Субконто1), (Субконто2), (Субконто3), (Субконто4)}) КАК МСФО_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобствКонтрагентыПериметра КАК СобствКонтрагентыПериметра
	|		ПО (ВЫБОР
	|				КОГДА МСФО_Остатки.Субконто1 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Остатки.Субконто1 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Остатки.Субконто2 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Остатки.Субконто2 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Остатки.Субконто3 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Остатки.Субконто3 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Остатки.Субконто4 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Остатки.Субконто4 = СобствКонтрагентыПериметра.Контрагент
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ СобствКонтрагентыПериметра.Контрагент ЕСТЬ NULL
	|{ГДЕ
	|	МСФО_Остатки.Счет.*,
	|	МСФО_Остатки.Субконто1.*,
	|	МСФО_Остатки.Субконто2.*,
	|	МСФО_Остатки.Субконто3.*,
	|	МСФО_Остатки.Субконто4.*,
	|	МСФО_Остатки.Организация.*,
	|	МСФО_Остатки.Валюта.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	СобствКонтрагентыПериметра.Контрагент,
	|	МСФО_Остатки.Субконто1,
	|	МСФО_Остатки.Субконто2,
	|	МСФО_Остатки.Субконто3,
	|	МСФО_Остатки.Субконто4,
	|	МСФО_Остатки.Организация,
	|	МСФО_Остатки.Валюта
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СобствКонтрагентыПериметра";
	Элемент.Релиз = "1.0.0.6";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементМСФО_ОстаткиКонечные(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МСФО_ОстаткиКонечные";
	Элемент.Родитель = Справочники.бит_Запросы.МСФО;
	Элемент.Наименование = НСтр("ru = 'МСФО.ОстаткиКонечные'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000003";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(бит_Дополнительный_2Остатки.СуммаРеглОстатокДт) КАК СуммаРеглОстатокДт,
	|	СУММА(бит_Дополнительный_2Остатки.СуммаУпрОстатокДт) КАК СуммаУпрОстатокДт,
	|	СУММА(бит_Дополнительный_2Остатки.СуммаМУОстатокДт) КАК СуммаМУОстатокДт,
	|	СУММА(бит_Дополнительный_2Остатки.ВалютнаяСуммаОстатокДт) КАК ВалютнаяСуммаОстатокДт,
	|	СУММА(бит_Дополнительный_2Остатки.КоличествоОстатокДт) КАК КоличествоОстатокДт,
	|	СУММА(бит_Дополнительный_2Остатки.СуммаРеглОстатокКт) КАК СуммаРеглОстатокКт,
	|	СУММА(бит_Дополнительный_2Остатки.СуммаУпрОстатокКт) КАК СуммаУпрОстатокКт,
	|	СУММА(бит_Дополнительный_2Остатки.СуммаМУОстатокКт) КАК СуммаМУОстатокКт,
	|	СУММА(бит_Дополнительный_2Остатки.ВалютнаяСуммаОстатокКт) КАК ВалютнаяСуммаОстатокКт,
	|	СУММА(бит_Дополнительный_2Остатки.КоличествоОстатокКт) КАК КоличествоОстатокКт
	|{ВЫБРАТЬ
	|	СуммаРеглОстатокДт,
	|	СуммаРеглОстатокКт,
	|	СуммаУпрОстатокДт,
	|	СуммаУпрОстатокКт,
	|	КоличествоОстатокДт,
	|	КоличествоОстатокКт,
	|	СуммаМУОстатокДт,
	|	СуммаМУОстатокКт,
	|	бит_Дополнительный_2Остатки.Счет.*,
	|	бит_Дополнительный_2Остатки.Субконто1.*,
	|	бит_Дополнительный_2Остатки.Субконто2.*,
	|	бит_Дополнительный_2Остатки.Субконто3.*,
	|	бит_Дополнительный_2Остатки.Субконто4.*,
	|	бит_Дополнительный_2Остатки.Валюта.*,
	|	бит_Дополнительный_2Остатки.Организация.*,
	|	ВалютнаяСуммаОстатокКт,
	|	ВалютнаяСуммаОстатокДт}
	|ИЗ
	|	РегистрБухгалтерии.бит_Дополнительный_2.Остатки(&КонецПериода, {(Счет)}, , {(Организация), (Субконто1), (Субконто2), (Субконто3), (Субконто4)}) КАК бит_Дополнительный_2Остатки
	|{ГДЕ
	|	бит_Дополнительный_2Остатки.Счет.*,
	|	бит_Дополнительный_2Остатки.Субконто1.*,
	|	бит_Дополнительный_2Остатки.Субконто2.*,
	|	бит_Дополнительный_2Остатки.Субконто3.*,
	|	бит_Дополнительный_2Остатки.Субконто4.*,
	|	бит_Дополнительный_2Остатки.Организация.*,
	|	бит_Дополнительный_2Остатки.Валюта.*}
	|АВТОУПОРЯДОЧИВАНИЕ";
	Элемент.Релиз = "1.0.0.0";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементМСФО_Обороты(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МСФО_Обороты";
	Элемент.Родитель = Справочники.бит_Запросы.МСФО;
	Элемент.Наименование = НСтр("ru = 'МСФО.Обороты'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000004";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(МСФО_Обороты.СуммаРеглОборотДт) КАК СуммаРеглОборотДт,
	|	СУММА(МСФО_Обороты.СуммаУпрОборотДт) КАК СуммаУпрОборотДт,
	|	СУММА(МСФО_Обороты.СуммаМУОборотДт) КАК СуммаМУОборотДт,
	|	СУММА(МСФО_Обороты.ВалютнаяСуммаОборотДт) КАК ВалютнаяСуммаОборотДт,
	|	СУММА(МСФО_Обороты.КоличествоОборотДт) КАК КоличествоОборотДт,
	|	СУММА(МСФО_Обороты.СуммаРеглОборотКт) КАК СуммаРеглОборотКт,
	|	СУММА(МСФО_Обороты.СуммаУпрОборотКт) КАК СуммаУпрОборотКт,
	|	СУММА(МСФО_Обороты.СуммаМУОборотКт) КАК СуммаМУОборотКт,
	|	СУММА(МСФО_Обороты.ВалютнаяСуммаОборотКт) КАК ВалютнаяСуммаОборотКт,
	|	СУММА(МСФО_Обороты.КоличествоОборотКт) КАК КоличествоОборотКт
	|{ВЫБРАТЬ
	|	СуммаРеглОборотДт,
	|	СуммаРеглОборотКт,
	|	СуммаУпрОборотДт,
	|	СуммаУпрОборотКт,
	|	СуммаМУОборотДт,
	|	СуммаМУОборотКт,
	|	КоличествоОборотДт,
	|	КоличествоОборотКт,
	|	ВалютнаяСуммаОборотДт,
	|	ВалютнаяСуммаОборотКт,
	|	МСФО_Обороты.Счет.*,
	|	МСФО_Обороты.Субконто1.*,
	|	МСФО_Обороты.Субконто2.*,
	|	МСФО_Обороты.Субконто3.*,
	|	МСФО_Обороты.Субконто4.*,
	|	МСФО_Обороты.Организация.*,
	|	МСФО_Обороты.Валюта.*,
	|	МСФО_Обороты.ВалютаКор.*}
	|ИЗ
	|	РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериода, Период {(&Периодичность)}, {(Счет)}, , {(Организация), (Субконто1), (Субконто2), (Субконто3), (Субконто4), (КорСубконто1), (КорСубконто2), (КорСубконто3), (КорСубконто4)}, , ) КАК МСФО_Обороты
	|{ГДЕ
	|	МСФО_Обороты.Счет.*,
	|	МСФО_Обороты.Субконто1.*,
	|	МСФО_Обороты.Субконто2.*,
	|	МСФО_Обороты.Субконто3.*,
	|	МСФО_Обороты.Субконто4.*,
	|	МСФО_Обороты.КорСчет.*,
	|	МСФО_Обороты.КорСубконто1.*,
	|	МСФО_Обороты.КорСубконто2.*,
	|	МСФО_Обороты.КорСубконто3.*,
	|	МСФО_Обороты.КорСубконто4.*,
	|	МСФО_Обороты.Организация.*,
	|	МСФО_Обороты.Валюта.*,
	|	МСФО_Обороты.ВалютаКор.*}
	|АВТОУПОРЯДОЧИВАНИЕ";
	Элемент.Релиз = "1.0.0.0";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементМСФО_Обороты_СобствКонтрКор(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МСФО_Обороты_СобствКонтрКор";
	Элемент.Родитель = Справочники.бит_Запросы.МСФО;
	Элемент.Наименование = НСтр("ru = 'МСФО.Обороты.СобствКонтрКор'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000008";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СобственныеКонтрагенты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ СобствКонтрагентыПериметра
	|ИЗ
	|	РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты
	|ГДЕ
	|	бит_СобственныеКонтрагенты.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСобственныхКонтрагентов.Организация)
	|	И бит_СобственныеКонтрагенты.Объект В
	|			(ВЫБРАТЬ
	|				СоставПериметра.Организация
	|			ИЗ
	|				РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|			ГДЕ
	|				(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|					ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|				И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|				И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(МСФО_Обороты.СуммаРеглОборотДт) КАК СуммаРеглОборотДт,
	|	СУММА(МСФО_Обороты.СуммаУпрОборотДт) КАК СуммаУпрОборотДт,
	|	СУММА(МСФО_Обороты.СуммаМУОборотДт) КАК СуммаМУОборотДт,
	|	СУММА(МСФО_Обороты.ВалютнаяСуммаОборотДт) КАК ВалютнаяСуммаОборотДт,
	|	СУММА(МСФО_Обороты.КоличествоОборотДт) КАК КоличествоОборотДт,
	|	СУММА(МСФО_Обороты.СуммаРеглОборотКт) КАК СуммаРеглОборотКт,
	|	СУММА(МСФО_Обороты.СуммаУпрОборотКт) КАК СуммаУпрОборотКт,
	|	СУММА(МСФО_Обороты.СуммаМУОборотКт) КАК СуммаМУОборотКт,
	|	СУММА(МСФО_Обороты.ВалютнаяСуммаОборотКт) КАК ВалютнаяСуммаОборотКт,
	|	СУММА(МСФО_Обороты.КоличествоОборотКт) КАК КоличествоОборотКт
	|{ВЫБРАТЬ
	|	СуммаРеглОборотДт,
	|	СуммаРеглОборотКт,
	|	СуммаУпрОборотДт,
	|	СуммаУпрОборотКт,
	|	СуммаМУОборотДт,
	|	СуммаМУОборотКт,
	|	КоличествоОборотДт,
	|	КоличествоОборотКт,
	|	ВалютнаяСуммаОборотДт,
	|	ВалютнаяСуммаОборотКт,
	|	МСФО_Обороты.Счет.*,
	|	МСФО_Обороты.Субконто1.*,
	|	МСФО_Обороты.Субконто2.*,
	|	МСФО_Обороты.Субконто3.*,
	|	МСФО_Обороты.Субконто4.*,
	|	МСФО_Обороты.Организация.*,
	|	МСФО_Обороты.Валюта.*,
	|	МСФО_Обороты.ВалютаКор.*}
	|ИЗ
	|	РегистрБухгалтерии.бит_Дополнительный_2.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период {(&Периодичность)},
	|			{(Счет)},
	|			,
	|			Организация В
	|					(ВЫБРАТЬ
	|						СоставПериметра.Организация
	|					ИЗ
	|						РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|					ГДЕ
	|						(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|							ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|						И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|						И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие))
	|				И ВЫБОР
	|					КОГДА КорСубконто1 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА КорСубконто2 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА КорСубконто3 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА КорСубконто4 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ {(Организация), (Субконто1), (Субконто2), (Субконто3), (Субконто4), (КорСубконто1), (КорСубконто2), (КорСубконто3), (КорСубконто4)},
	|			,
	|			) КАК МСФО_Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобствКонтрагентыПериметра КАК СобствКонтрагентыПериметра
	|		ПО (ВЫБОР
	|				КОГДА МСФО_Обороты.КорСубконто1 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.КорСубконто1 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Обороты.КорСубконто2 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.КорСубконто2 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Обороты.КорСубконто3 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.КорСубконто3 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Обороты.КорСубконто4 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.КорСубконто4 = СобствКонтрагентыПериметра.Контрагент
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ СобствКонтрагентыПериметра.Контрагент ЕСТЬ NULL
	|{ГДЕ
	|	МСФО_Обороты.Счет.*,
	|	МСФО_Обороты.Субконто1.*,
	|	МСФО_Обороты.Субконто2.*,
	|	МСФО_Обороты.Субконто3.*,
	|	МСФО_Обороты.Субконто4.*,
	|	МСФО_Обороты.КорСчет.*,
	|	МСФО_Обороты.КорСубконто1.*,
	|	МСФО_Обороты.КорСубконто2.*,
	|	МСФО_Обороты.КорСубконто3.*,
	|	МСФО_Обороты.КорСубконто4.*,
	|	МСФО_Обороты.Организация.*,
	|	МСФО_Обороты.Валюта.*,
	|	МСФО_Обороты.ВалютаКор.*}
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СобствКонтрагентыПериметра";
	Элемент.Релиз = "1.0.0.1";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементПланируемаяЗакупкаНоменклатуры(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПланируемаяЗакупкаНоменклатуры";
	Элемент.Родитель = Справочники.бит_Запросы.ДоговорыИЗакупки;
	Элемент.Наименование = НСтр("ru = 'Планируемая закупка номенклатуры'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000030";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.ЦФО КАК ЦФО,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.СтатьяОборотов КАК СтатьяОборотов,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Проект КАК Проект,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Аналитика_1 КАК Аналитика_1,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Аналитика_2 КАК Аналитика_2,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Аналитика_3 КАК Аналитика_3,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Аналитика_4 КАК Аналитика_4,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Аналитика_5 КАК Аналитика_5,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Аналитика_6 КАК Аналитика_6,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Аналитика_7 КАК Аналитика_7,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.СуммаОборот КАК СуммаОборот,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.СуммаРеглОборот КАК СуммаРеглОборот,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.СуммаУпрОборот КАК СуммаУпрОборот,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Номенклатура КАК Номенклатура,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.КоличествоОборот КАК КоличествоОборот,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.ДокументПланирования.ДатаЗакупкиПлан КАК Период,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.ВалютаДокумента КАК Валюта,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Контрагент КАК Контрагент,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Сценарий КАК Сценарий,
	|	бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты.Организация КАК Организация
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Период,
	|	ЦФО.*,
	|	СтатьяОборотов.*,
	|	Проект.*,
	|	Номенклатура.*,
	|	НоменклатурнаяГруппа.*,
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	Аналитика_1.*,
	|	Аналитика_2.*,
	|	Аналитика_3.*,
	|	Аналитика_4.*,
	|	Аналитика_5.*,
	|	Аналитика_6.*,
	|	Аналитика_7.*,
	|	Валюта.*,
	|	СуммаОборот,
	|	СуммаРеглОборот,
	|	СуммаУпрОборот,
	|	КоличествоОборот,
	|	Сценарий.*}
	|ИЗ
	|	РегистрНакопления.бит_ПланируемаяЗакупкаНоменклатурыАналитика.Обороты(&НачалоПериода, &КонецПериода, , {(Организация).*, (ВалютаДокумента).*, (ЦФО).*, (СтатьяОборотов).*, (Проект).*, (Сценарий).*, (Контрагент).*, (ДоговорКонтрагента).*, (Номенклатура).*, (НоменклатурнаяГруппа).*, (Аналитика_1).*, (Аналитика_2).*, (Аналитика_3).*, (Аналитика_4).*, (Аналитика_5).*, (Аналитика_6).*, (Аналитика_7).*}) КАК бит_ПланируемаяЗакупкаНоменклатурыАналитикаОбороты";
	Элемент.Релиз = "1.0.0.1";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементПотребностиНоменклатуры(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПотребностиНоменклатуры";
	Элемент.Родитель = Справочники.бит_Запросы.ДоговорыИЗакупки;
	Элемент.Наименование = НСтр("ru = 'Потребности номенклатуры'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000029";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.ЦФО КАК ЦФО,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.СтатьяОборотов КАК СтатьяОборотов,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.Проект КАК Проект,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.Аналитика_1 КАК Аналитика_1,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.Аналитика_2 КАК Аналитика_2,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.Аналитика_3 КАК Аналитика_3,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.Аналитика_4 КАК Аналитика_4,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.Аналитика_5 КАК Аналитика_5,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.Аналитика_6 КАК Аналитика_6,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.Аналитика_7 КАК Аналитика_7,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.СуммаОборот КАК СуммаОборот,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.СуммаРеглОборот КАК СуммаРеглОборот,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.СуммаУпрОборот КАК СуммаУпрОборот,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.Потребность КАК Потребность,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.КоличествоОборот КАК КоличествоОборот,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.ДокументПланирования.ДатаЗакупкиПлан КАК Период,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.ВалютаДокумента КАК Валюта,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.Контрагент КАК Контрагент,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	бит_ПотребностиНоменклатурыАналитикаОбороты.Организация КАК Организация
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Период,
	|	ЦФО.*,
	|	СтатьяОборотов.*,
	|	Проект.*,
	|	Потребность.*,
	|	НоменклатурнаяГруппа.*,
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	Аналитика_1.*,
	|	Аналитика_2.*,
	|	Аналитика_3.*,
	|	Аналитика_4.*,
	|	Аналитика_5.*,
	|	Аналитика_6.*,
	|	Аналитика_7.*,
	|	Валюта.*,
	|	СуммаОборот,
	|	СуммаРеглОборот,
	|	СуммаУпрОборот,
	|	КоличествоОборот}
	|ИЗ
	|	РегистрНакопления.бит_ПотребностиНоменклатурыАналитика.Обороты(&НачалоПериода, &КонецПериода, , {(Организация).*, (ВалютаДокумента).*, (ЦФО).*, (СтатьяОборотов).*, (Проект).*, (Контрагент).*, (ДоговорКонтрагента).*, (НоменклатурнаяГруппа).*, (Аналитика_1).*, (Аналитика_2).*, (Аналитика_3).*, (Аналитика_4).*, (Аналитика_5).*, (Аналитика_6).*, (Аналитика_7).*}) КАК бит_ПотребностиНоменклатурыАналитикаОбороты";
	Элемент.Релиз = "1.0.0.1";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементМСФО_ВыручкаВГО(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МСФО_ВыручкаВГО";
	Элемент.Родитель = Справочники.бит_Запросы.МСФО;
	Элемент.Наименование = НСтр("ru = 'МСФО.ВыручкаВГО'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000009";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СобственныеКонтрагенты.Контрагент КАК Контрагент,
	|	бит_СобственныеКонтрагенты.Объект КАК Объект
	|ПОМЕСТИТЬ СобствКонтрагентыПериметра
	|ИЗ
	|	РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты
	|ГДЕ
	|	бит_СобственныеКонтрагенты.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСобственныхКонтрагентов.Организация)
	|	И бит_СобственныеКонтрагенты.Объект В
	|			(ВЫБРАТЬ
	|				СоставПериметра.Организация
	|			ИЗ
	|				РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|			ГДЕ
	|				(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|					ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|				И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|				И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МСФО_Обороты.Счет КАК Счет_Выручка,
	|	МСФО_Обороты.Субконто1 КАК Субконто1_Выручка,
	|	МСФО_Обороты.Субконто2 КАК Субконто2_Выручка,
	|	МСФО_Обороты.Субконто3 КАК Субконто3_Выручка,
	|	МСФО_Обороты.Субконто4 КАК Субконто4_Выручка,
	|	СУММА(МСФО_Обороты.СуммаРеглОборотКт) КАК СуммаРеглОборотКт_Выручка,
	|	СУММА(МСФО_Обороты.СуммаУпрОборотКт) КАК СуммаУпрОборотКт_Выручка,
	|	СУММА(МСФО_Обороты.СуммаМУОборотКт) КАК СуммаМУОборотКт_Выручка,
	|	СУММА(МСФО_Обороты.ВалютнаяСуммаОборотКт) КАК ВалютнаяСуммаОборотКт_Выручка,
	|	СУММА(МСФО_Обороты.КоличествоОборотКт) КАК КоличествоОборотКт_Выручка,
	|	МСФО_Обороты.Регистратор КАК Регистратор,
	|	МСФО_Обороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА МСФО_Обороты.КорСубконто1 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА МСФО_Обороты.КорСубконто1
	|		КОГДА МСФО_Обороты.КорСубконто2 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА МСФО_Обороты.КорСубконто2
	|		КОГДА МСФО_Обороты.КорСубконто3 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА МСФО_Обороты.КорСубконто3
	|		КОГДА МСФО_Обороты.КорСубконто4 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА МСФО_Обороты.КорСубконто4
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Контрагент
	|ПОМЕСТИТЬ ВыборкаПоВыручке
	|{ВЫБРАТЬ
	|	МСФО_Обороты.Счет.* КАК Счет_Выручка,
	|	МСФО_Обороты.Субконто1.*,
	|	МСФО_Обороты.Субконто2.*,
	|	МСФО_Обороты.Субконто3.*,
	|	МСФО_Обороты.Субконто4.*,
	|	МСФО_Обороты.Организация.*,
	|	МСФО_Обороты.Валюта.*,
	|	МСФО_Обороты.ВалютаКор.*}
	|ИЗ
	|	РегистрБухгалтерии.бит_Дополнительный_2.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			{(Счет)},
	|			,
	|			Организация В
	|					(ВЫБРАТЬ
	|						СоставПериметра.Организация
	|					ИЗ
	|						РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|					ГДЕ
	|						(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|							ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|						И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|						И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие))
	|				И ВЫБОР
	|					КОГДА КорСубконто1 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА КорСубконто2 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА КорСубконто3 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА КорСубконто4 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ {(Организация), (Субконто1), (Субконто2), (Субконто3), (Субконто4), (КорСубконто1), (КорСубконто2), (КорСубконто3), (КорСубконто4)},
	|			,
	|			) КАК МСФО_Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобствКонтрагентыПериметра КАК СобствКонтрагентыПериметра
	|		ПО (ВЫБОР
	|				КОГДА МСФО_Обороты.КорСубконто1 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.КорСубконто1 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Обороты.КорСубконто2 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.КорСубконто2 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Обороты.КорСубконто3 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.КорСубконто3 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Обороты.КорСубконто4 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.КорСубконто4 = СобствКонтрагентыПериметра.Контрагент
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ СобствКонтрагентыПериметра.Контрагент ЕСТЬ NULL
	|{ГДЕ
	|	МСФО_Обороты.Счет.* КАК Счет_Выручка,
	|	МСФО_Обороты.Субконто1.*,
	|	МСФО_Обороты.Субконто2.*,
	|	МСФО_Обороты.Субконто3.*,
	|	МСФО_Обороты.Субконто4.*,
	|	МСФО_Обороты.КорСчет.*,
	|	МСФО_Обороты.КорСубконто1.*,
	|	МСФО_Обороты.КорСубконто2.*,
	|	МСФО_Обороты.КорСубконто3.*,
	|	МСФО_Обороты.КорСубконто4.*,
	|	МСФО_Обороты.Организация.*,
	|	МСФО_Обороты.Валюта.*,
	|	МСФО_Обороты.ВалютаКор.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	МСФО_Обороты.Регистратор,
	|	МСФО_Обороты.Счет,
	|	МСФО_Обороты.Организация,
	|	МСФО_Обороты.Субконто1,
	|	МСФО_Обороты.Субконто2,
	|	МСФО_Обороты.Субконто3,
	|	МСФО_Обороты.Субконто4,
	|	ВЫБОР
	|		КОГДА МСФО_Обороты.КорСубконто1 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА МСФО_Обороты.КорСубконто1
	|		КОГДА МСФО_Обороты.КорСубконто2 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА МСФО_Обороты.КорСубконто2
	|		КОГДА МСФО_Обороты.КорСубконто3 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА МСФО_Обороты.КорСубконто3
	|		КОГДА МСФО_Обороты.КорСубконто4 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА МСФО_Обороты.КорСубконто4
	|		ИНАЧЕ NULL
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МСФО_Обороты.Счет КАК Счет_НДС,
	|	ВыборкаПоВыручке.Субконто1_Выручка КАК Субконто1_НДС,
	|	ВыборкаПоВыручке.Субконто2_Выручка КАК Субконто2_НДС,
	|	ВыборкаПоВыручке.Субконто3_Выручка КАК Субконто3_НДС,
	|	ВыборкаПоВыручке.Субконто4_Выручка КАК Субконто4_НДС,
	|	СУММА(ВыборкаПоВыручке.СуммаРеглОборотКт_Выручка) КАК СуммаРеглОборотКт_Выручка,
	|	СУММА(ВыборкаПоВыручке.СуммаУпрОборотКт_Выручка) КАК СуммаУпрОборотКт_Выручка,
	|	СУММА(ВыборкаПоВыручке.СуммаМУОборотКт_Выручка) КАК СуммаМУОборотКт_Выручка,
	|	СУММА(ВыборкаПоВыручке.ВалютнаяСуммаОборотКт_Выручка) КАК ВалютнаяСуммаОборотКт_Выручка,
	|	СУММА(ВыборкаПоВыручке.КоличествоОборотКт_Выручка) КАК КоличествоОборотКт_Выручка,
	|	ВыборкаПоВыручке.Организация КАК Организация,
	|	СУММА(МСФО_Обороты.СуммаРеглОборотДт) КАК СуммаРеглОборотДт_НДС,
	|	СУММА(МСФО_Обороты.СуммаУпрОборотДт) КАК СуммаУпрОборотДт_НДС,
	|	СУММА(МСФО_Обороты.ВалютнаяСуммаОборотДт) КАК ВалютнаяСуммаОборотДт_НДС,
	|	СУММА(МСФО_Обороты.КоличествоОборотДт) КАК КоличествоОборотДт_НДС,
	|	СУММА(МСФО_Обороты.СуммаМУОборотДт) КАК СуммаМУОборотДт_НДС,
	|	СУММА(ЕСТЬNULL(ВыборкаПоВыручке.СуммаРеглОборотКт_Выручка, 0) - ЕСТЬNULL(МСФО_Обороты.СуммаРеглОборотДт, 0)) КАК СуммаРегл_БезНДС,
	|	СУММА(ЕСТЬNULL(ВыборкаПоВыручке.СуммаУпрОборотКт_Выручка, 0) - ЕСТЬNULL(МСФО_Обороты.СуммаУпрОборотДт, 0)) КАК СуммаУпр_БезНДС,
	|	СУММА(ЕСТЬNULL(ВыборкаПоВыручке.СуммаМУОборотКт_Выручка, 0) - ЕСТЬNULL(МСФО_Обороты.СуммаМУОборотДт, 0)) КАК СуммаМУ_БезНДС,
	|	СУММА(ЕСТЬNULL(ВыборкаПоВыручке.ВалютнаяСуммаОборотКт_Выручка, 0) - ЕСТЬNULL(МСФО_Обороты.ВалютнаяСуммаОборотДт, 0)) КАК ВалютнаяСумма_БезНДС,
	|	СУММА(ЕСТЬNULL(ВыборкаПоВыручке.КоличествоОборотКт_Выручка, 0) - ЕСТЬNULL(МСФО_Обороты.КоличествоОборотДт, 0)) КАК Количество_БезНДС,
	|	ВыборкаПоВыручке.Счет_Выручка КАК Счет_Выручка,
	|	ВыборкаПоВыручке.Контрагент КАК Контрагент
	|{ВЫБРАТЬ
	|	МСФО_Обороты.Счет.* КАК Счет_НДС,
	|	СуммаРеглОборотКт_Выручка,
	|	СуммаУпрОборотКт_Выручка,
	|	СуммаМУОборотКт_Выручка,
	|	ВалютнаяСуммаОборотКт_Выручка,
	|	КоличествоОборотКт_Выручка,
	|	Организация.*,
	|	СуммаРеглОборотДт_НДС,
	|	СуммаУпрОборотДт_НДС,
	|	ВалютнаяСуммаОборотДт_НДС,
	|	КоличествоОборотДт_НДС,
	|	СуммаМУОборотДт_НДС,
	|	Счет_НДС.*,
	|	Счет_Выручка.*,
	|	Субконто1_НДС.*,
	|	Субконто2_НДС.*,
	|	Субконто3_НДС.*,
	|	Субконто4_НДС.*,
	|	СуммаРегл_БезНДС,
	|	СуммаУпр_БезНДС,
	|	СуммаМУ_БезНДС,
	|	ВалютнаяСумма_БезНДС,
	|	Количество_БезНДС,
	|	Контрагент.*}
	|ИЗ
	|	ВыборкаПоВыручке КАК ВыборкаПоВыручке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериода, Регистратор, {(Счет)}, , {(Организация), (Субконто1), (Субконто2), (Субконто3), (Субконто4), (КорСубконто1), (КорСубконто2), (КорСубконто3), (КорСубконто4)}, , ) КАК МСФО_Обороты
	|		ПО ВыборкаПоВыручке.Регистратор = МСФО_Обороты.Регистратор
	|			И ВыборкаПоВыручке.Субконто1_Выручка = МСФО_Обороты.Субконто1
	|ГДЕ
	|	НЕ МСФО_Обороты.Счет ЕСТЬ NULL
	|{ГДЕ
	|	ВыборкаПоВыручке.СуммаРеглОборотКт_Выручка,
	|	ВыборкаПоВыручке.СуммаУпрОборотКт_Выручка,
	|	ВыборкаПоВыручке.СуммаМУОборотКт_Выручка,
	|	ВыборкаПоВыручке.ВалютнаяСуммаОборотКт_Выручка,
	|	ВыборкаПоВыручке.КоличествоОборотКт_Выручка,
	|	ВыборкаПоВыручке.Организация.*,
	|	МСФО_Обороты.СуммаРеглОборотДт,
	|	МСФО_Обороты.СуммаУпрОборотДт,
	|	МСФО_Обороты.ВалютнаяСуммаОборотДт,
	|	МСФО_Обороты.КоличествоОборотДт,
	|	МСФО_Обороты.СуммаМУОборотДт,
	|	МСФО_Обороты.Счет.* КАК Счет_НДС,
	|	ВыборкаПоВыручке.Счет_Выручка.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	МСФО_Обороты.Счет,
	|	ВыборкаПоВыручке.Организация,
	|	ВыборкаПоВыручке.Счет_Выручка,
	|	ВыборкаПоВыручке.Контрагент,
	|	ВыборкаПоВыручке.Субконто1_Выручка,
	|	ВыборкаПоВыручке.Субконто2_Выручка,
	|	ВыборкаПоВыручке.Субконто3_Выручка,
	|	ВыборкаПоВыручке.Субконто4_Выручка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МСФО_Обороты.Счет,
	|	ВыборкаПоВыручке.Субконто1_Выручка,
	|	ВыборкаПоВыручке.Субконто2_Выручка,
	|	ВыборкаПоВыручке.Субконто3_Выручка,
	|	ВыборкаПоВыручке.Субконто4_Выручка,
	|	СУММА(ВыборкаПоВыручке.СуммаРеглОборотКт_Выручка),
	|	СУММА(ВыборкаПоВыручке.СуммаУпрОборотКт_Выручка),
	|	СУММА(ВыборкаПоВыручке.СуммаМУОборотКт_Выручка),
	|	СУММА(ВыборкаПоВыручке.ВалютнаяСуммаОборотКт_Выручка),
	|	СУММА(ВыборкаПоВыручке.КоличествоОборотКт_Выручка),
	|	ВыборкаПоВыручке.Организация,
	|	СУММА(МСФО_Обороты.СуммаРеглОборотДт),
	|	СУММА(МСФО_Обороты.СуммаУпрОборотДт),
	|	СУММА(МСФО_Обороты.ВалютнаяСуммаОборотДт),
	|	СУММА(МСФО_Обороты.КоличествоОборотДт),
	|	СУММА(МСФО_Обороты.СуммаМУОборотДт),
	|	СУММА(ЕСТЬNULL(ВыборкаПоВыручке.СуммаРеглОборотКт_Выручка, 0) - ЕСТЬNULL(МСФО_Обороты.СуммаРеглОборотДт, 0)),
	|	СУММА(ЕСТЬNULL(ВыборкаПоВыручке.СуммаУпрОборотКт_Выручка, 0) - ЕСТЬNULL(МСФО_Обороты.СуммаУпрОборотДт, 0)),
	|	СУММА(ЕСТЬNULL(ВыборкаПоВыручке.СуммаМУОборотКт_Выручка, 0) - ЕСТЬNULL(МСФО_Обороты.СуммаМУОборотДт, 0)),
	|	СУММА(ЕСТЬNULL(ВыборкаПоВыручке.ВалютнаяСуммаОборотКт_Выручка, 0) - ЕСТЬNULL(МСФО_Обороты.ВалютнаяСуммаОборотДт, 0)),
	|	СУММА(ЕСТЬNULL(ВыборкаПоВыручке.КоличествоОборотКт_Выручка, 0) - ЕСТЬNULL(МСФО_Обороты.КоличествоОборотДт, 0)),
	|	ВыборкаПоВыручке.Счет_Выручка,
	|	ВыборкаПоВыручке.Контрагент
	|{ВЫБРАТЬ
	|	(МСФО_Обороты.Счет).* КАК Счет_НДС,
	|	СуммаРеглОборотКт_Выручка,
	|	СуммаУпрОборотКт_Выручка,
	|	СуммаМУОборотКт_Выручка,
	|	ВалютнаяСуммаОборотКт_Выручка,
	|	КоличествоОборотКт_Выручка,
	|	Организация.*,
	|	СуммаРеглОборотДт_НДС,
	|	СуммаУпрОборотДт_НДС,
	|	ВалютнаяСуммаОборотДт_НДС,
	|	КоличествоОборотДт_НДС,
	|	СуммаМУОборотДт_НДС,
	|	Счет_НДС.*,
	|	Счет_Выручка.*,
	|	Субконто1_НДС.*,
	|	Субконто2_НДС.*,
	|	Субконто3_НДС.*,
	|	Субконто4_НДС.*,
	|	СуммаРегл_БезНДС,
	|	СуммаУпр_БезНДС,
	|	СуммаМУ_БезНДС,
	|	ВалютнаяСумма_БезНДС,
	|	Количество_БезНДС,
	|	Контрагент.*}
	|ИЗ
	|	ВыборкаПоВыручке КАК ВыборкаПоВыручке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериода, Регистратор, {(Счет)}, , {(Организация), (Субконто1), (Субконто2), (Субконто3), (Субконто4), (КорСубконто1), (КорСубконто2), (КорСубконто3), (КорСубконто4)}, , ) КАК МСФО_Обороты
	|		ПО ВыборкаПоВыручке.Регистратор = МСФО_Обороты.Регистратор
	|			И ВыборкаПоВыручке.Субконто1_Выручка = МСФО_Обороты.Субконто1
	|ГДЕ
	|	МСФО_Обороты.Счет ЕСТЬ NULL
	|{ГДЕ
	|	ВыборкаПоВыручке.СуммаРеглОборотКт_Выручка,
	|	ВыборкаПоВыручке.СуммаУпрОборотКт_Выручка,
	|	ВыборкаПоВыручке.СуммаМУОборотКт_Выручка,
	|	ВыборкаПоВыручке.ВалютнаяСуммаОборотКт_Выручка,
	|	ВыборкаПоВыручке.КоличествоОборотКт_Выручка,
	|	ВыборкаПоВыручке.Организация.*,
	|	МСФО_Обороты.СуммаРеглОборотДт,
	|	МСФО_Обороты.СуммаУпрОборотДт,
	|	МСФО_Обороты.ВалютнаяСуммаОборотДт,
	|	МСФО_Обороты.КоличествоОборотДт,
	|	МСФО_Обороты.СуммаМУОборотДт,
	|	ВыборкаПоВыручке.Счет_Выручка.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	МСФО_Обороты.Счет,
	|	ВыборкаПоВыручке.Организация,
	|	ВыборкаПоВыручке.Счет_Выручка,
	|	ВыборкаПоВыручке.Контрагент,
	|	ВыборкаПоВыручке.Субконто1_Выручка,
	|	ВыборкаПоВыручке.Субконто2_Выручка,
	|	ВыборкаПоВыручке.Субконто3_Выручка,
	|	ВыборкаПоВыручке.Субконто4_Выручка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыборкаПоВыручке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СобствКонтрагентыПериметра";
	Элемент.Релиз = "1.0.0.6";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементПорталСверкиВГО_ДанныеКорректировокКонечныеОстаткиДт_Международный(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПорталСверкиВГО_ДанныеКорректировокКонечныеОстаткиДт_Международный";
	Элемент.Родитель = Справочники.бит_Запросы.ПорталСверкиВГО;
	Элемент.Наименование = НСтр("ru = 'ПорталСверкиВГО.ДанныеКорректировокКонечныеОстаткиДт (Международный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000022";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставПериметра.Организация КАК Организация
	|ПОМЕСТИТЬ ОрганизацииПериметра
	|ИЗ
	|	РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|ГДЕ
	|	(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|			ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|	И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|	И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие)
	|
	|СГРУППИРОВАТЬ ПО
	|	СоставПериметра.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СобственныеКонтрагенты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ СобствКонтрагентыПериметра
	|ИЗ
	|	РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты
	|ГДЕ
	|	бит_СобственныеКонтрагенты.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСобственныхКонтрагентов.Организация)
	|	И бит_СобственныеКонтрагенты.Объект В
	|			(ВЫБРАТЬ
	|				СоставПериметра.Организация
	|			ИЗ
	|				ОрганизацииПериметра КАК СоставПериметра)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СобственныеКонтрагенты.Объект,
	|	бит_СобственныеКонтрагенты.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ДанныеКорректОбороты.СуммаМУДтОборот) КАК СуммаМУ_Дт,
	|	СУММА(ДанныеКорректОбороты.СуммаРеглДтОборот) КАК СуммаРегл_Дт,
	|	СУММА(ДанныеКорректОбороты.СуммаУпрДтОборот) КАК СуммаУпр_Дт,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеКорректОбороты.ВалютнаяСуммаДтОборот = ДанныеКорректОбороты.СуммаМУДтОборот
	|				ТОГДА NULL
	|			ИНАЧЕ ДанныеКорректОбороты.ВалютнаяСуммаДтОборот
	|		КОНЕЦ) КАК ВалютнаяСумма_Дт,
	|	ВЫБОР
	|		КОГДА ДанныеКорректОбороты.ВалютнаяСуммаДтОборот = ДанныеКорректОбороты.СуммаМУДтОборот
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеКорректОбороты.ВалютаДт
	|	КОНЕЦ КАК Валюта
	|{ВЫБРАТЬ
	|	ДанныеКорректОбороты.Организация.*,
	|	ДанныеКорректОбороты.Контрагент.*,
	|	ДанныеКорректОбороты.СчетДт.*,
	|	СуммаМУ_Дт,
	|	СуммаРегл_Дт,
	|	СуммаУпр_Дт,
	|	ВалютнаяСумма_Дт,
	|	(ВЫБОР
	|			КОГДА ДанныеКорректОбороты.ВалютнаяСуммаДтОборот = ДанныеКорректОбороты.СуммаМУДтОборот
	|				ТОГДА NULL
	|			ИНАЧЕ ДанныеКорректОбороты.ВалютаДт
	|		КОНЕЦ) КАК Валюта,
	|	ДанныеКорректОбороты.СубконтоДт_1.*,
	|	ДанныеКорректОбороты.СубконтоДт_2.*,
	|	ДанныеКорректОбороты.СубконтоДт_3.*,
	|	ДанныеКорректОбороты.СубконтоДт_4.*}
	|ИЗ
	|	РегистрНакопления.бит_вго_ДанныеКорректировок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			ОперацияВГО = ЗНАЧЕНИЕ(Справочник.бит_вго_ОперацииВГО.КонечноеСальдо)
	|				И РегистрБухгалтерии = &РегистрБухгалтерии
	|				И Организация В
	|					(ВЫБРАТЬ
	|						СоставПериметра.Организация
	|					ИЗ
	|						ОрганизацииПериметра КАК СоставПериметра) {(СчетДт)}) КАК ДанныеКорректОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобствКонтрагентыПериметра КАК СобствКонтрагентыПериметра
	|		ПО (ВЫБОР
	|				КОГДА ДанныеКорректОбороты.Контрагент ССЫЛКА Справочник.Контрагенты
	|					ТОГДА ДанныеКорректОбороты.Контрагент = СобствКонтрагентыПериметра.Контрагент
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ СобствКонтрагентыПериметра.Контрагент ЕСТЬ NULL
	|{ГДЕ
	|	ДанныеКорректОбороты.Валюта.*,
	|	ДанныеКорректОбороты.СчетДт.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ДанныеКорректОбороты.ВалютнаяСуммаДтОборот = ДанныеКорректОбороты.СуммаМУДтОборот
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеКорректОбороты.ВалютаДт
	|	КОНЕЦ
	|{ИТОГИ ПО
	|	ДанныеКорректОбороты.СчетДт.*}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОрганизацииПериметра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СобствКонтрагентыПериметра";
	Элемент.Релиз = "1.0.0.2";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементМСФО_ОтложенныеНалоги_Остатки(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МСФО_ОтложенныеНалоги_Остатки";
	Элемент.Родитель = Справочники.бит_Запросы.МСФО_ОтложенныеНалоги;
	Элемент.Наименование = НСтр("ru = 'МСФО.ОтложенныеНалоги.Остатки'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000012";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ
	|	СУММА(МУОстатки.СуммаМУОстаток) КАК СуммаМУОстаток,
	|	СУММА(МУОстатки.СуммаМУОстатокДт) КАК СуммаМУОстатокДт,
	|	СУММА(МУОстатки.СуммаМУОстатокКт) КАК СуммаМУОстатокКт,
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто1 = ИСТИНА
	|			ТОГДА МУОстатки.Субконто1
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто2 = ИСТИНА
	|			ТОГДА МУОстатки.Субконто2
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто3 = ИСТИНА
	|			ТОГДА МУОстатки.Субконто3
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Субконто3,
	|	МУОстатки.Организация КАК Организация,
	|	МУОстатки.Счет КАК Счет
	|ПОМЕСТИТЬ МУОстатки
	|{ВЫБРАТЬ
	|	СуммаМУОстаток,
	|	СуммаМУОстатокДт,
	|	СуммаМУОстатокКт,
	|	МУОстатки.Счет.* КАК СчетМУ}
	|ИЗ
	|	РегистрБухгалтерии.бит_Дополнительный_2.Остатки(&КонецПериода, , , {(Организация).*, (Субконто1).*, (Субконто2).*, (Субконто3).*, (Субконто4).*}) КАК МУОстатки
	|{ГДЕ
	|	МУОстатки.Счет.* КАК СчетМУ}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто1 = ИСТИНА
	|			ТОГДА МУОстатки.Субконто1
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто2 = ИСТИНА
	|			ТОГДА МУОстатки.Субконто2
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто3 = ИСТИНА
	|			ТОГДА МУОстатки.Субконто3
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	МУОстатки.Организация,
	|	МУОстатки.Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НУОстатки.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто1 = ИСТИНА
	|			ТОГДА НУОстатки.Субконто1
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто2 = ИСТИНА
	|			ТОГДА НУОстатки.Субконто2
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто3 = ИСТИНА
	|			ТОГДА НУОстатки.Субконто3
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Субконто3,
	|	НУОстатки.Организация КАК Организация,
	|	СУММА(ВЫБОР
	|			КОГДА НУОстатки.Счет.НалоговыйУчет
	|				ТОГДА НУОстатки.СуммаНУОстаток
	|			ИНАЧЕ НУОстатки.СуммаОстаток
	|		КОНЕЦ) КАК СуммаНУОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА НУОстатки.Счет.НалоговыйУчет
	|				ТОГДА НУОстатки.СуммаНУОстатокДт
	|			ИНАЧЕ НУОстатки.СуммаОстатокДт
	|		КОНЕЦ) КАК СуммаНУОстатокДт,
	|	СУММА(ВЫБОР
	|			КОГДА НУОстатки.Счет.НалоговыйУчет
	|				ТОГДА НУОстатки.СуммаНУОстатокКт
	|			ИНАЧЕ НУОстатки.СуммаОстатокКт
	|		КОНЕЦ) КАК СуммаНУОстатокКт,
	|	СУММА(НУОстатки.СуммаПРОстаток) КАК СуммаПРОстаток,
	|	СУММА(НУОстатки.СуммаПРОстатокДт) КАК СуммаПРОстатокДт,
	|	СУММА(НУОстатки.СуммаПРОстатокКт) КАК СуммаПРОстатокКт
	|ПОМЕСТИТЬ НУОстатки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, , , {(Организация).*, (Субконто1).*, (Субконто2).*, (Субконто3).*}) КАК НУОстатки
	|{ГДЕ
	|	НУОстатки.Счет.* КАК СчетНУ}
	|
	|СГРУППИРОВАТЬ ПО
	|	НУОстатки.Счет,
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто1 = ИСТИНА
	|			ТОГДА НУОстатки.Субконто1
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто2 = ИСТИНА
	|			ТОГДА НУОстатки.Субконто2
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СовпадаютСубконто3 = ИСТИНА
	|			ТОГДА НУОстатки.Субконто3
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	НУОстатки.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(МУОстатки.СуммаМУОстаток) КАК СуммаМУОстаток,
	|	СУММА(МУОстатки.СуммаМУОстатокДт) КАК СуммаМУОстатокДт,
	|	СУММА(МУОстатки.СуммаМУОстатокКт) КАК СуммаМУОстатокКт,
	|	СУММА(НУОстатки.СуммаНУОстаток) КАК СуммаНУОстаток,
	|	СУММА(НУОстатки.СуммаНУОстатокДт) КАК СуммаНУОстатокДт,
	|	СУММА(НУОстатки.СуммаНУОстатокКт) КАК СуммаНУОстатокКт,
	|	СУММА(НУОстатки.СуммаПРОстаток) КАК СуммаПРОстаток,
	|	СУММА(НУОстатки.СуммаПРОстатокДт) КАК СуммаПРОстатокДт,
	|	СУММА(НУОстатки.СуммаПРОстатокКт) КАК СуммаПРОстатокКт,
	|	ЕСТЬNULL(МУОстатки.Организация, НУОстатки.Организация) КАК Организация,
	|	ЕСТЬNULL(МУОстатки.Субконто1, НУОстатки.Субконто1) КАК Субконто1,
	|	ЕСТЬNULL(МУОстатки.Субконто2, НУОстатки.Субконто2) КАК Субконто2,
	|	ЕСТЬNULL(МУОстатки.Субконто3, НУОстатки.Субконто3) КАК Субконто3
	|{ВЫБРАТЬ
	|	СуммаМУОстаток,
	|	СуммаМУОстатокДт,
	|	СуммаМУОстатокКт,
	|	СуммаНУОстаток,
	|	СуммаНУОстатокДт,
	|	СуммаНУОстатокКт,
	|	СуммаПРОстаток,
	|	СуммаПРОстатокДт,
	|	СуммаПРОстатокКт,
	|	Организация.*,
	|	Субконто1.*,
	|	Субконто2.*,
	|	Субконто3.*,
	|	МУОстатки.Счет.* КАК СчетМУ,
	|	НУОстатки.Счет.* КАК СчетНУ}
	|ИЗ
	|	МУОстатки КАК МУОстатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ НУОстатки КАК НУОстатки
	|		ПО МУОстатки.Организация = НУОстатки.Организация
	|			И (ВЫБОР
	|				КОГДА &СовпадаютСубконто1 = ИСТИНА
	|					ТОГДА НУОстатки.Субконто1 = МУОстатки.Субконто1
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА &СовпадаютСубконто2 = ИСТИНА
	|					ТОГДА НУОстатки.Субконто2 = МУОстатки.Субконто2
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА &СовпадаютСубконто3 = ИСТИНА
	|					ТОГДА НУОстатки.Субконто3 = МУОстатки.Субконто3
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(МУОстатки.Организация, НУОстатки.Организация),
	|	ЕСТЬNULL(МУОстатки.Субконто1, НУОстатки.Субконто1),
	|	ЕСТЬNULL(МУОстатки.Субконто2, НУОстатки.Субконто2),
	|	ЕСТЬNULL(МУОстатки.Субконто3, НУОстатки.Субконто3)";
	Элемент.Релиз = "1.0.0.7";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементМСФО_ОстаткиНачальные(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МСФО_ОстаткиНачальные";
	Элемент.Родитель = Справочники.бит_Запросы.МСФО;
	Элемент.Наименование = НСтр("ru = 'МСФО.ОстаткиНачальные'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000002";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(бит_Дополнительный_2Остатки.СуммаРеглОстатокДт) КАК СуммаРеглОстатокДт,
	|	СУММА(бит_Дополнительный_2Остатки.СуммаУпрОстатокДт) КАК СуммаУпрОстатокДт,
	|	СУММА(бит_Дополнительный_2Остатки.СуммаМУОстатокДт) КАК СуммаМУОстатокДт,
	|	СУММА(бит_Дополнительный_2Остатки.ВалютнаяСуммаОстатокДт) КАК ВалютнаяСуммаОстатокДт,
	|	СУММА(бит_Дополнительный_2Остатки.КоличествоОстатокДт) КАК КоличествоОстатокДт,
	|	СУММА(бит_Дополнительный_2Остатки.СуммаРеглОстатокКт) КАК СуммаРеглОстатокКт,
	|	СУММА(бит_Дополнительный_2Остатки.СуммаУпрОстатокКт) КАК СуммаУпрОстатокКт,
	|	СУММА(бит_Дополнительный_2Остатки.СуммаМУОстатокКт) КАК СуммаМУОстатокКт,
	|	СУММА(бит_Дополнительный_2Остатки.ВалютнаяСуммаОстатокКт) КАК ВалютнаяСуммаОстатокКт,
	|	СУММА(бит_Дополнительный_2Остатки.КоличествоОстатокКт) КАК КоличествоОстатокКт
	|{ВЫБРАТЬ
	|	СуммаРеглОстатокДт,
	|	СуммаРеглОстатокКт,
	|	СуммаУпрОстатокДт,
	|	СуммаУпрОстатокКт,
	|	КоличествоОстатокДт,
	|	КоличествоОстатокКт,
	|	СуммаМУОстатокДт,
	|	СуммаМУОстатокКт,
	|	бит_Дополнительный_2Остатки.Счет.*,
	|	бит_Дополнительный_2Остатки.Субконто1.*,
	|	бит_Дополнительный_2Остатки.Субконто2.*,
	|	бит_Дополнительный_2Остатки.Субконто3.*,
	|	бит_Дополнительный_2Остатки.Субконто4.*,
	|	бит_Дополнительный_2Остатки.Валюта.*,
	|	бит_Дополнительный_2Остатки.Организация.*,
	|	ВалютнаяСуммаОстатокКт,
	|	ВалютнаяСуммаОстатокДт}
	|ИЗ
	|	РегистрБухгалтерии.бит_Дополнительный_2.Остатки(&НачалоПериода, {(Счет)}, , {(Организация), (Субконто1), (Субконто2), (Субконто3), (Субконто4)}) КАК бит_Дополнительный_2Остатки
	|{ГДЕ
	|	бит_Дополнительный_2Остатки.Счет.*,
	|	бит_Дополнительный_2Остатки.Субконто1.*,
	|	бит_Дополнительный_2Остатки.Субконто2.*,
	|	бит_Дополнительный_2Остатки.Субконто3.*,
	|	бит_Дополнительный_2Остатки.Субконто4.*,
	|	бит_Дополнительный_2Остатки.Организация.*,
	|	бит_Дополнительный_2Остатки.Валюта.*}
	|АВТОУПОРЯДОЧИВАНИЕ";
	Элемент.Релиз = "1.0.0.0";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементПорталСверкиВГО_ДанныеКорректировокОборотыКт_Международный(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПорталСверкиВГО_ДанныеКорректировокОборотыКт_Международный";
	Элемент.Родитель = Справочники.бит_Запросы.ПорталСверкиВГО;
	Элемент.Наименование = НСтр("ru = 'ПорталСверкиВГО.ДанныеКорректировокОборотыКт (Международный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000021";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставПериметра.Организация КАК Организация
	|ПОМЕСТИТЬ ОрганизацииПериметра
	|ИЗ
	|	РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|ГДЕ
	|	(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|			ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|	И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|	И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие)
	|
	|СГРУППИРОВАТЬ ПО
	|	СоставПериметра.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СобственныеКонтрагенты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ СобствКонтрагентыПериметра
	|ИЗ
	|	РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты
	|ГДЕ
	|	бит_СобственныеКонтрагенты.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСобственныхКонтрагентов.Организация)
	|	И бит_СобственныеКонтрагенты.Объект В
	|			(ВЫБРАТЬ
	|				СоставПериметра.Организация
	|			ИЗ
	|				ОрганизацииПериметра КАК СоставПериметра)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СобственныеКонтрагенты.Объект,
	|	бит_СобственныеКонтрагенты.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ДанныеКорректОбороты.СуммаМУКтОборот) КАК СуммаМУ_Кт,
	|	СУММА(ДанныеКорректОбороты.СуммаРеглКтОборот) КАК СуммаРегл_Кт,
	|	СУММА(ДанныеКорректОбороты.СуммаУпрКтОборот) КАК СуммаУпр_Кт,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеКорректОбороты.ВалютнаяСуммаКтОборот = ДанныеКорректОбороты.СуммаМУКтОборот
	|				ТОГДА NULL
	|			ИНАЧЕ ДанныеКорректОбороты.ВалютнаяСуммаКтОборот
	|		КОНЕЦ) КАК ВалютнаяСумма_Кт,
	|	ВЫБОР
	|		КОГДА ДанныеКорректОбороты.ВалютнаяСуммаКтОборот = ДанныеКорректОбороты.СуммаМУКтОборот
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеКорректОбороты.ВалютаКт
	|	КОНЕЦ КАК Валюта
	|{ВЫБРАТЬ
	|	ДанныеКорректОбороты.Организация.*,
	|	ДанныеКорректОбороты.Контрагент.*,
	|	ДанныеКорректОбороты.СчетКт.*,
	|	СуммаМУ_Кт,
	|	СуммаРегл_Кт,
	|	СуммаУпр_Кт,
	|	ВалютнаяСумма_Кт,
	|	(ВЫБОР
	|			КОГДА ДанныеКорректОбороты.ВалютнаяСуммаКтОборот = ДанныеКорректОбороты.СуммаМУКтОборот
	|				ТОГДА NULL
	|			ИНАЧЕ ДанныеКорректОбороты.ВалютаКт
	|		КОНЕЦ) КАК Валюта,
	|	ДанныеКорректОбороты.СубконтоКт_1.*,
	|	ДанныеКорректОбороты.СубконтоКт_2.*,
	|	ДанныеКорректОбороты.СубконтоКт_3.*,
	|	ДанныеКорректОбороты.СубконтоКт_4.*}
	|ИЗ
	|	РегистрНакопления.бит_вго_ДанныеКорректировок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			ОперацияВГО.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.бит_вго_ВидыОперацийВГО.Остатки)
	|				И РегистрБухгалтерии = &РегистрБухгалтерии
	|				И Организация В
	|					(ВЫБРАТЬ
	|						СоставПериметра.Организация
	|					ИЗ
	|						ОрганизацииПериметра КАК СоставПериметра) {(СчетКт)}) КАК ДанныеКорректОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобствКонтрагентыПериметра КАК СобствКонтрагентыПериметра
	|		ПО (ВЫБОР
	|				КОГДА ДанныеКорректОбороты.Контрагент ССЫЛКА Справочник.Контрагенты
	|					ТОГДА ДанныеКорректОбороты.Контрагент = СобствКонтрагентыПериметра.Контрагент
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ СобствКонтрагентыПериметра.Контрагент ЕСТЬ NULL
	|{ГДЕ
	|	ДанныеКорректОбороты.Валюта.*,
	|	ДанныеКорректОбороты.СчетКт.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ДанныеКорректОбороты.ВалютнаяСуммаКтОборот = ДанныеКорректОбороты.СуммаМУКтОборот
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеКорректОбороты.ВалютаКт
	|	КОНЕЦ
	|{ИТОГИ ПО
	|	ДанныеКорректОбороты.СчетКт.*}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОрганизацииПериметра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СобствКонтрагентыПериметра";
	Элемент.Релиз = "1.0.0.2";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементМСФО_Обороты_СобствКонтр(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МСФО_Обороты_СобствКонтр";
	Элемент.Родитель = Справочники.бит_Запросы.МСФО;
	Элемент.Наименование = НСтр("ru = 'МСФО.Обороты.СобствКонтр'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000007";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СобственныеКонтрагенты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ СобствКонтрагентыПериметра
	|ИЗ
	|	РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты
	|ГДЕ
	|	бит_СобственныеКонтрагенты.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСобственныхКонтрагентов.Организация)
	|	И бит_СобственныеКонтрагенты.Объект В
	|			(ВЫБРАТЬ
	|				СоставПериметра.Организация
	|			ИЗ
	|				РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|			ГДЕ
	|				(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|					ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|				И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|				И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(МСФО_Обороты.СуммаРеглОборотДт) КАК СуммаРеглОборотДт,
	|	СУММА(МСФО_Обороты.СуммаУпрОборотДт) КАК СуммаУпрОборотДт,
	|	СУММА(МСФО_Обороты.СуммаМУОборотДт) КАК СуммаМУОборотДт,
	|	СУММА(МСФО_Обороты.ВалютнаяСуммаОборотДт) КАК ВалютнаяСуммаОборотДт,
	|	СУММА(МСФО_Обороты.КоличествоОборотДт) КАК КоличествоОборотДт,
	|	СУММА(МСФО_Обороты.СуммаРеглОборотКт) КАК СуммаРеглОборотКт,
	|	СУММА(МСФО_Обороты.СуммаУпрОборотКт) КАК СуммаУпрОборотКт,
	|	СУММА(МСФО_Обороты.СуммаМУОборотКт) КАК СуммаМУОборотКт,
	|	СУММА(МСФО_Обороты.ВалютнаяСуммаОборотКт) КАК ВалютнаяСуммаОборотКт,
	|	СУММА(МСФО_Обороты.КоличествоОборотКт) КАК КоличествоОборотКт
	|{ВЫБРАТЬ
	|	СуммаРеглОборотДт,
	|	СуммаРеглОборотКт,
	|	СуммаУпрОборотДт,
	|	СуммаУпрОборотКт,
	|	СуммаМУОборотДт,
	|	СуммаМУОборотКт,
	|	КоличествоОборотДт,
	|	КоличествоОборотКт,
	|	ВалютнаяСуммаОборотДт,
	|	ВалютнаяСуммаОборотКт,
	|	МСФО_Обороты.Счет.*,
	|	МСФО_Обороты.Субконто1.*,
	|	МСФО_Обороты.Субконто2.*,
	|	МСФО_Обороты.Субконто3.*,
	|	МСФО_Обороты.Субконто4.*,
	|	МСФО_Обороты.Организация.*,
	|	МСФО_Обороты.Валюта.*,
	|	МСФО_Обороты.ВалютаКор.*}
	|ИЗ
	|	РегистрБухгалтерии.бит_Дополнительный_2.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период {(&Периодичность)},
	|			{(Счет)},
	|			,
	|			Организация В
	|					(ВЫБРАТЬ
	|						СоставПериметра.Организация
	|					ИЗ
	|						РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|					ГДЕ
	|						(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|							ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|						И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|						И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие))
	|				И ВЫБОР
	|					КОГДА Субконто1 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА Субконто2 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА Субконто3 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА Субконто4 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ {(Организация), (Субконто1), (Субконто2), (Субконто3), (Субконто4), (КорСубконто1), (КорСубконто2), (КорСубконто3), (КорСубконто4)},
	|			,
	|			) КАК МСФО_Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобствКонтрагентыПериметра КАК СобствКонтрагентыПериметра
	|		ПО (ВЫБОР
	|				КОГДА МСФО_Обороты.Субконто1 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.Субконто1 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Обороты.Субконто2 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.Субконто2 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Обороты.Субконто3 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.Субконто3 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Обороты.Субконто4 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Обороты.Субконто4 = СобствКонтрагентыПериметра.Контрагент
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ СобствКонтрагентыПериметра.Контрагент ЕСТЬ NULL
	|{ГДЕ
	|	МСФО_Обороты.Счет.*,
	|	МСФО_Обороты.Субконто1.*,
	|	МСФО_Обороты.Субконто2.*,
	|	МСФО_Обороты.Субконто3.*,
	|	МСФО_Обороты.Субконто4.*,
	|	МСФО_Обороты.КорСчет.*,
	|	МСФО_Обороты.КорСубконто1.*,
	|	МСФО_Обороты.КорСубконто2.*,
	|	МСФО_Обороты.КорСубконто3.*,
	|	МСФО_Обороты.КорСубконто4.*,
	|	МСФО_Обороты.Организация.*,
	|	МСФО_Обороты.Валюта.*,
	|	МСФО_Обороты.ВалютаКор.*}
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СобствКонтрагентыПериметра";
	Элемент.Релиз = "1.0.0.1";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

Процедура ЗаполнитьЭлементМСФО_ОстаткиКонечные_СобствКонтр(Элементы)
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МСФО_ОстаткиКонечные_СобствКонтр";
	Элемент.Родитель = Справочники.бит_Запросы.МСФО;
	Элемент.Наименование = НСтр("ru = 'МСФО.ОстаткиКонечные.СобствКонтр'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Код = "000000006";
	Элемент.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СобственныеКонтрагенты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ СобствКонтрагентыПериметра
	|ИЗ
	|	РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты
	|ГДЕ
	|	бит_СобственныеКонтрагенты.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСобственныхКонтрагентов.Организация)
	|	И бит_СобственныеКонтрагенты.Объект В
	|			(ВЫБРАТЬ
	|				СоставПериметра.Организация
	|			ИЗ
	|				РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|			ГДЕ
	|				(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|					ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|				И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|				И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МСФО_Остатки.Организация КАК Организация,
	|	МСФО_Остатки.Валюта КАК Валюта,
	|	МСФО_Остатки.Субконто1 КАК Субконто1,
	|	МСФО_Остатки.Субконто2 КАК Субконто2,
	|	МСФО_Остатки.Субконто3 КАК Субконто3,
	|	МСФО_Остатки.Субконто4 КАК Субконто4,
	|	СУММА(МСФО_Остатки.СуммаРеглОстатокДт) КАК СуммаРеглОстатокДт,
	|	СУММА(МСФО_Остатки.СуммаУпрОстатокДт) КАК СуммаУпрОстатокДт,
	|	СУММА(МСФО_Остатки.СуммаМУОстатокДт) КАК СуммаМУОстатокДт,
	|	СУММА(МСФО_Остатки.ВалютнаяСуммаОстатокДт) КАК ВалютнаяСуммаОстатокДт,
	|	СУММА(МСФО_Остатки.КоличествоОстатокДт) КАК КоличествоОстатокДт,
	|	СУММА(МСФО_Остатки.СуммаРеглОстатокКт) КАК СуммаРеглОстатокКт,
	|	СУММА(МСФО_Остатки.СуммаУпрОстатокКт) КАК СуммаУпрОстатокКт,
	|	СУММА(МСФО_Остатки.СуммаМУОстатокКт) КАК СуммаМУОстатокКт,
	|	СУММА(МСФО_Остатки.ВалютнаяСуммаОстатокКт) КАК ВалютнаяСуммаОстатокКт,
	|	СУММА(МСФО_Остатки.КоличествоОстатокКт) КАК КоличествоОстатокКт,
	|	СобствКонтрагентыПериметра.Контрагент КАК Контрагент
	|{ВЫБРАТЬ
	|	СуммаРеглОстатокДт,
	|	СуммаРеглОстатокКт,
	|	СуммаУпрОстатокДт,
	|	СуммаУпрОстатокКт,
	|	КоличествоОстатокДт,
	|	КоличествоОстатокКт,
	|	СуммаМУОстатокДт,
	|	СуммаМУОстатокКт,
	|	МСФО_Остатки.Счет.*,
	|	МСФО_Остатки.Субконто1.*,
	|	МСФО_Остатки.Субконто2.*,
	|	МСФО_Остатки.Субконто3.*,
	|	МСФО_Остатки.Субконто4.*,
	|	МСФО_Остатки.Валюта.*,
	|	МСФО_Остатки.Организация.*,
	|	ВалютнаяСуммаОстатокКт,
	|	ВалютнаяСуммаОстатокДт}
	|ИЗ
	|	РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
	|			&КонецПериода,
	|			{(Счет)},
	|			,
	|			Организация В
	|					(ВЫБРАТЬ
	|						СоставПериметра.Организация
	|					ИЗ
	|						РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК СоставПериметра
	|					ГДЕ
	|						(КОНЕЦПЕРИОДА(СоставПериметра.ДатаОкончания, ДЕНЬ) >= &КонецПериодаДата
	|							ИЛИ СоставПериметра.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|						И СоставПериметра.ТипКонсолидации = ЗНАЧЕНИЕ(Перечисление.бит_му_ТипыКонсолидации.Обычная)
	|						И СоставПериметра.МетодКонсолидации <> ЗНАЧЕНИЕ(Перечисление.бит_му_МетодыКонсолидации.ДолевоеУчастие))
	|				И ВЫБОР
	|					КОГДА Субконто1 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА Субконто2 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА Субконто3 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					КОГДА Субконто4 ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ {(Организация), (Субконто1), (Субконто2), (Субконто3), (Субконто4)}) КАК МСФО_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобствКонтрагентыПериметра КАК СобствКонтрагентыПериметра
	|		ПО (ВЫБОР
	|				КОГДА МСФО_Остатки.Субконто1 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Остатки.Субконто1 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Остатки.Субконто2 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Остатки.Субконто2 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Остатки.Субконто3 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Остатки.Субконто3 = СобствКонтрагентыПериметра.Контрагент
	|				КОГДА МСФО_Остатки.Субконто4 ССЫЛКА Справочник.Контрагенты
	|					ТОГДА МСФО_Остатки.Субконто4 = СобствКонтрагентыПериметра.Контрагент
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ СобствКонтрагентыПериметра.Контрагент ЕСТЬ NULL
	|{ГДЕ
	|	МСФО_Остатки.Счет.*,
	|	МСФО_Остатки.Субконто1.*,
	|	МСФО_Остатки.Субконто2.*,
	|	МСФО_Остатки.Субконто3.*,
	|	МСФО_Остатки.Субконто4.*,
	|	МСФО_Остатки.Организация.*,
	|	МСФО_Остатки.Валюта.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	СобствКонтрагентыПериметра.Контрагент,
	|	МСФО_Остатки.Субконто1,
	|	МСФО_Остатки.Субконто2,
	|	МСФО_Остатки.Субконто3,
	|	МСФО_Остатки.Субконто4,
	|	МСФО_Остатки.Организация,
	|	МСФО_Остатки.Валюта
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СобствКонтрагентыПериметра";
	Элемент.Релиз = "1.0.0.5";
	Элемент.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	Элемент.Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
	Элемент.АвтозаполнениеНастроек = Ложь;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
