#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если Не ЭтоГруппа Тогда 	
		ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;  
		Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
		АвтозаполнениеНастроек = Истина;
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа И Справочники.бит_мпд_ВидыИнформационныхБаз.ЭтоВнешняяБаза(ВидИнформационнойБазы) Тогда
	
		ТекВерсияПлатформы = бит_ОбщегоНазначения.ВерсияПлатформы();
		КонтрольнаяВерсия = "8.3.5.1";
		
		фВерсияСтарше835 = бит_ОбщегоНазначения.ВерсияОбновленияСтарше(КонтрольнаяВерсия, ТекВерсияПлатформы);		
		Если фВерсияСтарше835 Тогда		
			ПроверяемыеРеквизиты.Добавить("Вид");		
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда			
		Возврат;			
	КонецЕсли; 
	
	Если НЕ ЭтоГруппа Тогда
		Если Вид = Перечисления.бит_мпд_ВидыЗапросов.ЗапросHTTP Тогда
			ЭтоВнешняя = Справочники.бит_мпд_ВидыИнформационныхБаз.ЭтоВнешняяБаза(ВидИнформационнойБазы);
			Если НЕ ЭтоВнешняя Тогда
				Вид = Перечисления.бит_мпд_ВидыЗапросов.Запрос1С;
			КонецЕсли; 
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда			
		Возврат;			
	КонецЕсли; 
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		Релиз = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли