
&После("ПередЗаписью")
Процедура бит_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [06.06.2025 15:18:42] +
	бит_КоличествоМестИтого = Маршрут.Итог("бит_КоличествоМест");    
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [06.06.2025 15:18:44] -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:59:57] +        
	Если ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик 
		И ЗначениеЗаполнено(Перевозчик) И Не ЗначениеЗаполнено(бит_Договор) Тогда 
		СтруктураДанных = Новый Структура("Партнер, Договор, Контрагент", Перевозчик, бит_Договор, Контрагент);
		бит_Договор = бит_ПартнерыИКонтрагентыСервер.ПолучитьДоговорПоУмолчанию(СтруктураДанных);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:59:57] -
КонецПроцедуры  



