#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет, что обработка является обработкой доставки оповещений.
// 
// Возвращаемое значение:
//   Булево
// 
Функция ЭтоОбработкаДоставкиОповещений() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Функция возвращает настройки доставки по умолчанию.
// 
// Возвращаемое значение:
//   РезСтруктура   - Структура
// 
Функция НастройкиПоУмолчанию() Экспорт

	РезСтруктура = Новый Структура;
	РезСтруктура.Вставить("Бот", "");

	Возврат РезСтруктура;
	
КонецФункции // НастройкиПоУмолчанию()

// Процедура выполняет отправку сообщений;
// 
// Параметры:
//  СообщениеСтруктура  - Структура.
//  НастройкиДоставки   - Структура.
//  СтруктураПараметров - Структура.
//  ПротоколОтправки    - Строка.
// 
Функция ОтправитьСообщение(СообщениеСтруктура, НастройкиДоставки, СтруктураПараметров, ПротоколОтправки="") Экспорт
	
	ДействиеВыполнено = Ложь;			
	Отказ             = Ложь;
	
	// Выполним проверки настроек 
	СтруктураСообщенияКорректна(СообщениеСтруктура, Отказ, ПротоколОтправки);	
	СтруктураПараметровКорректна(СтруктураПараметров, Отказ, ПротоколОтправки); 
	
	Если НЕ Отказ Тогда
		
		ТекстСообщения = "<b>" + СообщениеСтруктура.Заголовок + "</b>"
		                 + Символы.ПС
						 + СообщениеСтруктура.Текст;
		
		
		// Отправка оповещения
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
		Соединение           = Новый HTTPСоединение("api.telegram.org",,,,,30,ЗащищенноеСоединение);
		Запрос               = Новый HTTPЗапрос;
		Заголовки            = Новый Соответствие;
		Заголовки.Вставить("Content-Type","application/json");
		
		АдресРесурса = "/bot%token%/sendMessage?parse_mode=HTML&chat_id=%chatId%&text=%text%";
		АдресРесурса = СтрЗаменить(АдресРесурса, "%token%",  НастройкиДоставки.Бот.Токен);
		АдресРесурса = СтрЗаменить(АдресРесурса, "%chatId%", Формат(СтруктураПараметров.АдресПолучателя.ИД, "ЧГ="));
		АдресРесурса = СтрЗаменить(АдресРесурса, "%text%",   ТекстСообщения);
		Запрос.АдресРесурса = АдресРесурса;
		Запрос.Заголовки = Заголовки;
		
		СтруктураОтвета = Соединение.ОтправитьДляОбработки(Запрос);
		ТелоОтвета      = СтруктураОтвета.ПолучитьТелоКакСтроку();
		Если СтруктураОтвета.КодСостояния = 200 Тогда			
			ДействиеВыполнено = Истина;			
			ПротоколОтправки = НСтр("ru='Сообщение отправлено в Telegram. Сообщение: %1. Ответ сервера: %2.';
									|en='Message sent to the Telegram. Message: %1. Server response: %2.'");
			ПротоколОтправки = СтрШаблон(ПротоколОтправки, АдресРесурса, ТелоОтвета);			
		Иначе			
			ПротоколОтправки = НСтр("ru='Ошибка отправки сообщения в Telegram. Сообщение: %1. Ответ сервера: %2.';
									|en='Error while sending message Telegram. Message: %1. Server response: %2.'");
			ПротоколОтправки = СтрШаблон(ПротоколОтправки, АдресРесурса, ТелоОтвета);						
			ДействиеВыполнено = Ложь;			
		КонецЕсли; 
		
	КонецЕсли;
		
	Возврат ДействиеВыполнено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура проверяет корретность структуры сообщения.
// 
Процедура СтруктураСообщенияКорректна(Сообщение, Отказ, ПротоколОтправки = "")
	
	// Приведем строковое описание типа текста к системному перечислению.
	Если НЕ Сообщение.Свойство("ТипТекстаСообщения")
		ИЛИ НЕ ЗначениеЗаполнено(Сообщение.ТипТекстаСообщения) Тогда
		
		ТипТекстаСообщения = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Иначе
		
		Для Каждого ТекущийТипТекста Из ТипТекстаПочтовогоСообщения Цикл
			
			Если Строка(ТекущийТипТекста) = Сообщение.ТипТекстаСообщения Тогда
				ТипТекстаСообщения = ТекущийТипТекста;
				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Сообщение.Вставить("ТипТекстаСообщения", ТипТекстаСообщения);
	
КонецПроцедуры

// Процедура проверяет корретность структуры параметров.
// 
Процедура СтруктураПараметровКорректна(Настройка, Отказ, ПротоколОтправки = "")
	
	Если НЕ Настройка.Свойство("АдресПолучателя") ИЛИ НЕ ЗначениеЗаполнено(Настройка.АдресПолучателя) Тогда	
		Отказ = Истина;
		ПротоколОтправки = НСтр("ru='Не указан чат получателя.';en='No recipient chat specified.'");		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли