
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [19.11.2025] +        
	
	МассивРеквизитов = Новый Массив;
	
	ОписаниеКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2,0));
	ОписаниеКоличества2 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3));
	
	//НовыйРеквизит = Новый РеквизитФормы("бит_КоличествоХодовОперация", ОписаниеКоличества);
	//МассивРеквизитов.Добавить(НовыйРеквизит);
	
	//НовыйРеквизит = Новый РеквизитФормы("бит_КоличествоХодовОперацияПредыдущее", ОписаниеКоличества);
	//МассивРеквизитов.Добавить(НовыйРеквизит);                                                	
	
	НовыйРеквизит = Новый РеквизитФормы("бит_Коэффициент", ОписаниеКоличества2);
	МассивРеквизитов.Добавить(НовыйРеквизит);
	
	Попытка	
		ИзменитьРеквизиты(МассивРеквизитов);  
	Исключение
	КонецПопытки;
	
	//НовыйЭлемент = Этаформа.Элементы.Вставить("бит_КоличествоХодовОперация", Тип("ПолеФормы"), ЭтаФорма ,Элементы.ГруппаИнформация);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "бит_КоличествоХодовОперация";
	//НовыйЭлемент.Заголовок = "(бит) Количество ходов"; 
	//НовыйЭлемент.УстановитьДействие("ПриИзменении", "КоличествоХодовПриИзменении");
	//Если Этап.Спецификация.Трудозатраты.Количество() <> 0 Тогда
	//	ЭтаФорма.бит_КоличествоХодов = Этап.Спецификация.Трудозатраты[0].ВидРабот.бит_РассчитываемоеКоличествоХодов;	
	//КонецЕсли;
	
	КлючиОпераций = Параметры.КлючиОпераций;
	ДанныеОперации = ДанныеОперацииПоКлючу(КлючиОпераций[0], ИспользоватьФизЛиц);
	//Если ДанныеОперации <> Неопределено Тогда
	//	ЭтаФорма.бит_КоличествоХодовОперация = ДанныеОперации.бит_КоличествоХодовОперация;
	//	ЭтаФорма.бит_КоличествоХодовОперацияПредыдущее = ДанныеОперации.бит_КоличествоХодовОперация;
	//КонецЕсли;
	
	//Если ЭтаФорма.бит_КоличествоХодовОперация = 0  Тогда
	//	ЭтаФорма.бит_КоличествоХодовОперация = Документы.ЭтапПроизводства2_2.ПолучитьОсновноеКоличествоХодов(Этап.ВидыРабочихЦентров[0].ВидРабочегоЦентра);
	//	ЭтаФорма.бит_КоличествоХодовОперацияПредыдущее = Документы.ЭтапПроизводства2_2.ПолучитьОсновноеКоличествоХодов(Этап.ВидыРабочихЦентров[0].ВидРабочегоЦентра); 
	//КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(ЭтаФорма.бит_КоличествоХодовОперация) Тогда
	//	ЭтаФорма.бит_КоличествоХодов = 1;
	//	ЭтаФорма.бит_КоличествоХодовОперацияПредыдущее = 1;
	//КонецЕсли;
	
	ЭтаФорма.бит_Коэффициент = 1;

	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [19.11.2025] -
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("НазначитьНаСервере")
Функция бит_НазначитьНаСервере()

	КлючиОпераций = ПолучитьИзВременногоХранилища(АдресКлючиОпераций);

	ПараметрыНазначения = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.ПараметрыНазначенияОпераций();

	ПараметрыНазначения.Измерения.СменноеЗадание = СменноеЗадание;
	Если НазначитьИсполнителя Тогда
		ПараметрыНазначения.Измерения.Исполнитель = Исполнитель;
	КонецЕсли;
	Если НазначитьРабочийЦентр Тогда
		ПараметрыНазначения.Измерения.РабочийЦентр = РабочийЦентр;
	КонецЕсли;
	Если НазначитьВидРабочегоЦентра Тогда
		ПараметрыНазначения.Измерения.ВидРабочегоЦентра = ВидРабочегоЦентра;
	КонецЕсли;

	Если НЕ ГрупповоеНазначение Тогда
		ПараметрыНазначения.Количество = Количество;
		ПараметрыНазначения.НазначитьЧасть = НазначитьЧасть;
	КонецЕсли;
	
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] +        
	
	ПараметрыНазначения.Вставить("бит_Коэффициент", ЭтаФорма["бит_Коэффициент"]);
	//ПараметрыНазначения.Вставить("бит_КоличествоХодовОперация", ЭтаФорма["бит_КоличествоХодовОперация"]); 
	
	#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] -
	
	РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.НазначитьОперации(
	КлючиОпераций,
	ПараметрыНазначения);

	Результат = Новый Структура;
	Результат.Вставить("СменноеЗадание", СменноеЗадание);
	Результат.Вставить("Исполнитель", Исполнитель);
	Результат.Вставить("РабочийЦентр", РабочийЦентр);
	Результат.Вставить("ВидРабочегоЦентра", ВидРабочегоЦентра);
	Результат.Вставить("КлючиОпераций", КлючиОпераций);

	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура КоличествоХодовПриИзменении();
	
	//ЭтаФорма.бит_Коэффициент = ЭтаФорма.бит_КоличествоХодовОперацияПредыдущее / ЭтаФорма.бит_КоличествоХодовОперация;
	
	//ВремяВыполнения = ВремяВыполнения * ЭтаФорма.бит_Коэффициент;
	
	//ЭтаФорма.бит_КоличествоХодовОперацияПредыдущее = ЭтаФорма.бит_КоличествоХодовОперация;
	
	ИзменитьЗаписьРегистра();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗаписьРегистра()
	
	//Если ЭтаФорма.бит_Коэффициент <> 1 Тогда
		
		КлючиЗаписи = ПолучитьИзВременногоХранилища(АдресКлючиОпераций);
		
		Операции = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.СоздатьНаборЗаписей().ВыгрузитьКолонки();
		Порядок = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Для Каждого Ключ Из КлючиЗаписи Цикл
			
			НоваяСтрока = Операции.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Ключ);
			НоваяСтрока.Порядок = Порядок;
			
			Порядок = Порядок + 1;
			
		КонецЦикла;
		
		//Документы.СменноеЗадание.УстановитьКоличествоХодовИВремя(Операции, ЭтаФорма.бит_КоличествоХодовОперация, ВремяВыполнения, Количество, ЭтаФорма.бит_Коэффициент);
		
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура бит_ЗаписатьИЗакрытьПередНаСервере()
	
	//Если ЭтаФорма.бит_Коэффициент <> 1 Тогда
	
	КлючиЗаписи = ПолучитьИзВременногоХранилища(АдресКлючиОпераций);
	
	Операции = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	Порядок = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Для Каждого Ключ Из КлючиЗаписи Цикл
		
		НоваяСтрока = Операции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Ключ);
		НоваяСтрока.Порядок = Порядок;
		
		Порядок = Порядок + 1;
		
	КонецЦикла;
	
	//Документы.СменноеЗадание.УстановитьКоличествоХодовИВремя(Операции, ЭтаФорма.бит_КоличествоХодовОперацияПредыдущее, ВремяВыполнения, Количество, ЭтаФорма.бит_Коэффициент);
				
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&Перед("ЗаписатьИЗакрыть")
Процедура бит_ЗаписатьИЗакрыть(Команда)
	бит_ЗаписатьИЗакрытьПередНаСервере();
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ДанныеОперацииПоКлючу")
Функция бит_ДанныеОперацииПоКлючу(КлючОперации, ИспользоватьФизЛиц)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Операции.СменноеЗадание                                     КАК СменноеЗадание,
	|	Операции.Этап                                               КАК Этап,
	|	ВЫБОР
	|		КОГДА (Операции.Исполнитель = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//++ Локализация
	|				ИЛИ Операции.Исполнитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	//-- Локализация
	|				)
	|				И НЕ &ИспользоватьФизЛиц
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Бригады.ПустаяСсылка)
	|		ИНАЧЕ Операции.Исполнитель
	|	КОНЕЦ                                                       КАК Исполнитель,
	|	Операции.РабочийЦентр                                       КАК РабочийЦентр,
	|	Операции.ВидРабочегоЦентра                                  КАК ВидРабочегоЦентра,
	|	Операции.ВидРабочегоЦентра.ПараллельнаяЗагрузка             КАК ПараллельнаяЗагрузка,
	|	Операции.Операция                                           КАК Операция,
	|	Операции.Количество                                         КАК Количество,
	
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [27.11.2025] +        
	
	//|	Операции.бит_КоличествоХодовОперация						КАК бит_КоличествоХодовОперация, 
	
	#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [27.11.2025] -
	
	|	Операции.ВремяЕдИзм                                         КАК ВремяВыполненияЕдИзм,
	|	Операции.ВремяШтучное                                       КАК ВремяШтучное,
	|	Операции.ВремяПЗ                                            КАК ВремяПЗ,
	|	Операции.Операция.Количество                                КАК КоличествоШтучное,
	|	Операции.Операция.Владелец                                  КАК ОперацияВладелец,
	|	Операции.Операция.ЕдиницаИзмерения                          КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(Операции.РабочийЦентр.КоэффициентВремениРаботы, 1) КАК КоэффициентВремениРаботы
	|ИЗ
	|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
	|ГДЕ
	|	Операции.Подразделение = &Подразделение
	|	И Операции.Этап = &Этап
	|	И Операции.Операция = &Операция
	|	И Операции.ИдентификаторОперации = &ИдентификаторОперации
	|	И Операции.СменноеЗадание = &СменноеЗадание
	|	И Операции.Исполнитель = &Исполнитель
	|	И Операции.РабочийЦентр = &РабочийЦентр
	|	И Операции.ВидРабочегоЦентра = &ВидРабочегоЦентра
	|	И Операции.НазначатьНеРанее = &НазначатьНеРанее");

	Запрос.УстановитьПараметр("Подразделение", КлючОперации.Подразделение);
	Запрос.УстановитьПараметр("Этап", КлючОперации.Этап);
	Запрос.УстановитьПараметр("Операция", КлючОперации.Операция);
	Запрос.УстановитьПараметр("ИдентификаторОперации", КлючОперации.ИдентификаторОперации);
	Запрос.УстановитьПараметр("СменноеЗадание", КлючОперации.СменноеЗадание);
	Запрос.УстановитьПараметр("Исполнитель", КлючОперации.Исполнитель);
	Запрос.УстановитьПараметр("РабочийЦентр", КлючОперации.РабочийЦентр);
	Запрос.УстановитьПараметр("ВидРабочегоЦентра", КлючОперации.ВидРабочегоЦентра);
	Запрос.УстановитьПараметр("НазначатьНеРанее", КлючОперации.НазначатьНеРанее);
	Запрос.УстановитьПараметр("ИспользоватьФизЛиц", ИспользоватьФизЛиц);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

//&НаКлиенте
//&ИзменениеИКонтроль("ВремяВыполненияПриИзменении")
//Процедура бит_ВремяВыполненияПриИзменении(Элемент)
//	#Удаление
//	КоэффициентВремениРаботы = КоэффициентВремениРаботы(РабочийЦентр);
//	Количество = ОперативныйУчетПроизводстваКлиентСервер.РассчитатьКоличествоОперацииОтВремени(
//	ВремяВыполнения,
//	ВремяШтучное,
//	ВремяПЗ,
//	КоличествоШтучное,
//	КоэффициентВремениРаботы);

//	НастроитьЗависимыеЭлементыФормы(ЭтаФорма, "Количество");
//    #КонецУдаления
//	
//	
//	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [28.11.2025] +        
//	
//	СтруктураПараметров = Новый Структура;
//	ОписаниеОповещения = Новый ОписаниеОповещения("бит_ВремяВыполненияПриИзмененииВопросЗавершение", ЭтотОбъект, СтруктураПараметров); 
// 	ПоказатьВопрос(ОписаниеОповещения, "Пересчитать количество относительно времени?", РежимДиалогаВопрос.ДаНет); 
//	
//	#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [28.11.2025] -
//	
//	
//КонецПроцедуры

&НаКлиенте
Процедура бит_ВремяВыполненияПриИзмененииВопросЗавершение(РезультатВопроса, СтруктураПараметров) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		КоэффициентВремениРаботы = КоэффициентВремениРаботы(РабочийЦентр);
		Количество = ОперативныйУчетПроизводстваКлиентСервер.РассчитатьКоличествоОперацииОтВремени(
		ВремяВыполнения,
		ВремяШтучное,
		ВремяПЗ,
		КоличествоШтучное,
		КоэффициентВремениРаботы);
		
		НастроитьЗависимыеЭлементыФормы(ЭтаФорма, "Количество");	
		
	КонецЕсли;
	
КонецПроцедуры



