
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ2.2]  [VUVaynula@1cbit.ru] [14.05.2026 16:09:14] +        
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_КатегорийныйМатериал", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаОсновныеПараметрыУчета);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КатегорийныйМатериал";
	// }}ПервыйБИТ ЛистТребований [ЛТ2.2]  [VUVaynula@1cbit.ru] [14.05.2026 16:09:14] -
КонецПроцедуры
