
	
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Компоновщик             = Параметры.Компоновщик;
	АвтопозицияРесурсов            = Параметры.АвтопозицияРесурсов;
	ОбновлятьВизыПослеСогласования = Параметры.ОбновлятьВизыПослеСогласования;
	ВыполнятьНаКлиенте             = Параметры.ВыполнятьНаКлиенте;
	
	НапоминатьОНеобходимостиУстановкиВизПриЗапуске = бит_УправлениеПользователямиСервер.ПолучитьНастройкуПользователя(
		"НапоминатьОНеобходимостиУстановкиВизПриЗапуске", Пользователи.ТекущийПользователь());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьОбновить(Команда)
	
	ПараметрыНастроек = Новый Структура;
	ПараметрыНастроек.Вставить("Компоновщик",                    Объект.Компоновщик);
	ПараметрыНастроек.Вставить("АвтопозицияРесурсов",            АвтопозицияРесурсов);
	ПараметрыНастроек.Вставить("ОбновлятьВизыПослеСогласования", ОбновлятьВизыПослеСогласования);
	ПараметрыНастроек.Вставить("ВыполнятьНаКлиенте",             ВыполнятьНаКлиенте);
	
	СохраненноеЗначениеНастройки = бит_УправлениеПользователямиВызовСервера.ПолучитьНастройкуПользователя(
		"НапоминатьОНеобходимостиУстановкиВизПриЗапуске", ПользователиКлиент.ТекущийПользователь());
	Если НапоминатьОНеобходимостиУстановкиВизПриЗапуске <> СохраненноеЗначениеНастройки Тогда
		бит_УправлениеПользователямиВызовСервера.УстановитьЗначениеПоУмолчанию("НапоминатьОНеобходимостиУстановкиВизПриЗапуске",
			НапоминатьОНеобходимостиУстановкиВизПриЗапуске, ПользователиКлиент.ТекущийПользователь());
	КонецЕсли;
	
	Закрыть(ПараметрыНастроек);
	
КонецПроцедуры

#КонецОбласти




