Процедура бит_СформироватьДвижения(Регистратор, ТаблицаДвиженийСебестоимостьТоваров) Экспорт
	
	// {{ПервыйБИТ ЛистТребований [БезНомера] [ASHolyavko@1cbit.ru] [06.05.2026] +        
	
	Дата = Регистратор.Дата;
	Организация = Регистратор.Организация;
	ОрганизацияПолучатель = Регистратор.ОрганизацияПолучатель;
	СкладОтправитель = Регистратор.Склад;
	СкладПолучатель = Регистратор.Склад;
	Менеджер = Регистратор.Менеджер;
	
	ПодразделениеЦФООтправитель = РегистрыСведений.бит_СоответствияАналитик.ПолучитьПравуюАналитику(Справочники.бит_ВидыСоответствийАналитик.СтруктураПредприятия_ЦФО, СкладОтправитель.Подразделение, Дата);
	ПодразделениеЦФОПолучатель = РегистрыСведений.бит_СоответствияАналитик.ПолучитьПравуюАналитику(Справочники.бит_ВидыСоответствийАналитик.СтруктураПредприятия_ЦФО, СкладПолучатель.Подразделение, Дата);
			
	ТаблицаДвижений_СебестоимостьТоваров = ТаблицаДвиженийСебестоимостьТоваров;
	
	ТаблицаДвижений_СтоимостьТМЦ_УУ = РегистрыНакопления.бит_СтоимостьТМЦ_УУ.ПолучитьТаблицуДляДвижений();
	ТаблицаДвижений_СтоимостьТМЦ_УУ_Расход = РегистрыНакопления.бит_СтоимостьТМЦ_УУ.ПолучитьТаблицуДляДвижений();
	ТаблицаДвижений_СтоимостьТМЦ_УУ_Приход = РегистрыНакопления.бит_СтоимостьТМЦ_УУ.ПолучитьТаблицуДляДвижений();
		
	//1. Регистр накопления "Стоимость ТМЦ УУ".
	//Вид движения				Расход
	//Номенклатура				Реквизит Номенклатура из ТЧ документа                                            
	//ГФУ						Реквизит Группа финансового учета в карточке Номенклатура
	//Организация				Реквизит Организация документа
	//Партия					В соответствии с типовым механизмом ЕРП по определению партии номенклатуры
	//Склад						Реквизит Склад 
	//Подразделение				Получаем Подразделение из соответствия Склад-Подразделение в карточке склад. 
	//							Далее ищем  соответствие Подразделение -ЦФО с помощью Документ.бит_НазначениеСоответствияАналитик, 
	//							с видом соответствия Структура предприятия --> ЦФО. И полученным ЦФО заполняем реквизитПодразделение..
	//Количество				Реквизит Количество из ТЧ документа
	//Стоимость					Определяем цену на данную номенклатуру, исходя из партии номенклатуры и цены номенклатуры в этой партии (партию определяем по ФИФО) и умножаем на количество.
	//Доп.расходы				Оставляем не заполненным 
		
	РегистрыНакопления.бит_СтоимостьТМЦ_УУ.ЗаполнитьТаблицуДвиженийПоВидуДвижения(ТаблицаДвижений_СтоимостьТМЦ_УУ_Расход, ТаблицаДвижений_СебестоимостьТоваров, ВидДвиженияНакопления.Расход, СкладОтправитель, ПодразделениеЦФООтправитель);		
	//РегистрыНакопления.бит_СтоимостьТМЦ_УУ.ЗаполнитьТаблицуДвиженийПоВидуДвижения(ТаблицаДвижений_СтоимостьТМЦ_УУ_Приход, ТаблицаДвижений_СебестоимостьТоваров, ВидДвиженияНакопления.Приход, СкладПолучатель, ПодразделениеЦФОПолучатель);		
	
	ТаблицаСтоимостиНоменклатурыПоПартиям = РегистрыНакопления.бит_СтоимостьТМЦ_УУ.ПолучитьСтоимостьНоменклатурыПоПартиям(Дата, ТаблицаДвижений_СтоимостьТМЦ_УУ_Расход); 
	
	РегистрыНакопления.бит_СтоимостьТМЦ_УУ.ЗаполнитьСтоимостьВТаблицеДвижений(ТаблицаДвижений_СтоимостьТМЦ_УУ_Расход, ТаблицаСтоимостиНоменклатурыПоПартиям);		
	
	Для Каждого СтрокаРасход Из ТаблицаДвижений_СтоимостьТМЦ_УУ_Расход Цикл
		НоваяСтрокаПриход =  ТаблицаДвижений_СтоимостьТМЦ_УУ_Приход.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПриход, СтрокаРасход);
		НоваяСтрокаПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрокаПриход.Организация = ОрганизацияПолучатель;
		НоваяСтрокаПриход.Партия = Регистратор;
	КонецЦикла;
	
	//ТаблицаСтоимостиНоменклатурыПоПартиям = РегистрыНакопления.бит_СтоимостьТМЦ_УУ.ПолучитьСтоимостьНоменклатурыПоПартиям(Дата, ТаблицаДвижений_СтоимостьТМЦ_УУ_Расход); 
	//РегистрыНакопления.бит_СтоимостьТМЦ_УУ.ЗаполнитьСтоимостьВТаблицеДвижений(ТаблицаДвижений_СтоимостьТМЦ_УУ_Приход, ТаблицаСтоимостиНоменклатурыПоПартиям);		
			
	ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(ТаблицаДвижений_СтоимостьТМЦ_УУ_Расход, ТаблицаДвижений_СтоимостьТМЦ_УУ);
	ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(ТаблицаДвижений_СтоимостьТМЦ_УУ_Приход, ТаблицаДвижений_СтоимостьТМЦ_УУ);	
	
	НаборЗаписей = РегистрыНакопления.бит_СтоимостьТМЦ_УУ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Загрузить(ТаблицаДвижений_СтоимостьТМЦ_УУ);
	НаборЗаписей.Записать(Истина);
	
	// }}ПервыйБИТ ЛистТребований [БезНомера] [ASHolyavko@1cbit.ru] [06.05.2026] -
	
КонецПроцедуры
