////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Присваивает ресурсу регистра значение по умолчанию, в случае,
// если в данных заполнения заполнение реквизита не предусмотрено
// 
// Параметры:
//  Запись              - запись регистра сведений.
//  ДанныеЗаполнения    - Структура - содержит данные для заполнения ресурсов регистра,
//                      где имя ключа соответствует имени ресурса.
//  ИмяРесурса          - Строка - имя ресурса, оторому присваивается значение.
//  ЗначениеПоУмолчанию - Произвольный - значение по умолчанию, соответствующее типу ресурса.
//
Процедура УстановитьЗначениеПоУмолчанию(Запись, ДанныеЗаполнения, ИмяРесурса, ЗначениеПоУмолчанию) Экспорт
	
	Если Не ДанныеЗаполнения.Свойство(ИмяРесурса, Запись[ИмяРесурса]) Тогда
		Запись[ИмяРесурса] = ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает ключ действующей настройки учетной политики на заданную дату.
//
// Параметры:
//  ИмяРегистра		 - Строка - имя регистра, для которого требуется получить значения.
//  Подразделение	 - Произвольный - структурное подразделение,
//                  				  для которого требуется получить настройки.
//  Период			 - Дата, Неопределено - период действия настройки.
// 
// Возвращаемое значение:
//  - РегистрСведенийКлючЗаписи 
//	- Неопределено
//
Функция КлючЗаписиДействующейУчетнойПолитики(ИмяРегистра, Подразделение, Период = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Подразделение) И НЕ Подразделение = Неопределено Тогда
		// Ошибочная ситуация. В "настройках" может быть не заполнено подразделение,
		// но оно должно быть "НЕОПРЕДЕЛЕНО".
		Возврат Неопределено;
	КонецЕсли;
	
	Данные  = ДанныеДействующейУчетнойПолитики(ИмяРегистра, Подразделение, Период);
	Выборка = Данные.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗначенияКлюча = Новый Структура;
		ЗначенияКлюча.Вставить("СтруктурноеПодразделение", Подразделение);
		ЗначенияКлюча.Вставить("Период", Выборка.Период);
		
		Возврат РегистрыСведений[ИмяРегистра].СоздатьКлючЗаписи(ЗначенияКлюча);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает значения действующей настройки учетной политики на заданную дату.
//
// Параметры:
//  ИмяРегистра		 - Строка - имя регистра, для которого требуется получить значения.
//  Подразделение	 - Произвольный	 - структурное подразделение, для которого требуется получить настройки.
//  Период			 - Дата, Неопределено - период действия настройки.
// 
// Возвращаемое значение:
//   - Неопределено
//	 - Произвольный
//
Функция ЗначенияДействующейУчетнойПолитики(ИмяРегистра, Подразделение, Период = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Подразделение) И НЕ Подразделение = Неопределено Тогда
		// Ошибочная ситуация. В "настройках" может быть не заполнено подразделение,
		// но оно должно быть "НЕОПРЕДЕЛЕНО".
		Возврат Неопределено;
	КонецЕсли;
	
	Данные = ДанныеДействующейУчетнойПолитики(ИмяРегистра, Подразделение, Период);
	Если Данные.Пустой() Тогда
		Возврат Неопределено;
	Иначе	
		Выгрузка = Данные.Выгрузить();
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выгрузка[0]);
	КонецЕсли;

КонецФункции

// Функция определяет дату окончания действия записи настройки учета.
//
// Параметры:
//  Период			 - Дата - дата чтения настроек. 
//  Подразделение	 - Произвольный	 - структурное подразделение, для которого требуется получить настройки.
//  ИмяРегистра		 - Строка - имя регистра, для которого требуется получить значения. 
// 
// Возвращаемое значение:
//   - Дата - дата окончания действия записи.
//
Функция НайтиДатуОкончанияДействия(Знач Период, Знач Подразделение, ИмяРегистра) Экспорт

	ДатаОкончания = Период;

	НастройкаПрограммыВсехПодразделений = ЗаполнениеНастройкиУчетнойПолитики(ИмяРегистра);
	
	НастройкаПрограммыПодразделения = НастройкаПрограммыВсехПодразделений.Строки.Найти(Подразделение, "СтруктурноеПодразделение");
	Если НастройкаПрограммыПодразделения <> Неопределено Тогда
		Для каждого СтрокаНастройки Из НастройкаПрограммыПодразделения.Строки Цикл
			Если СтрокаНастройки.Период = Период Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаНастройки.Период > ДатаОкончания Тогда
				ДатаОкончания = СтрокаНастройки.Период - 1;
				Возврат ДатаОкончания;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если Период > ТекущаяДата Тогда
		Возврат КонецДня(Период);
	Иначе
		Если ДатаОкончания = Период Тогда
			Возврат КонецДня(ТекущаяДата);
		Иначе
			Возврат КонецДня(ДатаОкончания);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Заполняет регистры настроек подсистем значениями по умолчанию для всего предприятия.
//
Процедура ЗаполнитьНастройкиПрограммыПоУмолчанию() Экспорт
		
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("Период", Дата('19800101'));

	ЗаписатьМенеджерЗаписиНастроекПрограммы("бит_НастройкиБюджетирования",ДанныеЗаполнения);
	ЗаписатьМенеджерЗаписиНастроекПрограммы("бит_НастройкиВизирования",ДанныеЗаполнения);
	ЗаписатьМенеджерЗаписиНастроекПрограммы("бит_НастройкиДоговоровИЗатрат",ДанныеЗаполнения);
	ЗаписатьМенеджерЗаписиНастроекПрограммы("бит_НастройкиЗакупок",ДанныеЗаполнения);
	ЗаписатьМенеджерЗаписиНастроекПрограммы("бит_НастройкиКазначейства",ДанныеЗаполнения);
	ЗаписатьМенеджерЗаписиНастроекПрограммы("бит_НастройкиПрограммыОбщие",ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Бюджетирование

Функция НеФормироватьДвиженияПоФактуАвтоматически(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиБюджетированияУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_НеФормироватьДвиженияПоФактуАвтоматически",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция СценарийОтраженияФактаБДДС(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиБюджетированияУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_СценарийОтраженияФактаБДДС",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если Результат = Ложь Тогда
		Результат = Справочники.СценарииПланирования.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция НеФормироватьПроводкиБюджетированияПриАвтоматическомСбореФакта(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиБюджетированияУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_НеФормироватьПроводкиБюджетированияПриАвтоматическомСбореФакта",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции 

Функция ФормироватьЗависимыеОборотыПриАвтоматическомСбореФакта(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиБюджетированияУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ФормироватьЗависимыеОборотыПриАвтоматическомСбореФакта",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция ОтражатьФактБДДСНаОснованииОперУчета(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиБюджетированияУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ОтражатьФактБДДСНаОснованииОперУчета",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиБюджетированияУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область Казначейство

Функция ОтклонениеДатыПлатежаВЗаявкахОтПрогнозаПлатежа(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ОтклонениеДатыПлатежаВЗаявкахОтПрогнозаПлатежа",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если Результат = Ложь Тогда
		Результат = 0;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КонтролироватьОстаткиПоОбщейЗаявке(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_КонтролироватьОстаткиПоОбщейЗаявке",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыйПроцентПревышенияСуммыПрогнозаПлатежа(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ДопустимыйПроцентПревышенияСуммыПрогнозаПлатежа",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если Результат = Ложь Тогда
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КонтролироватьЗаявкуПоБюджету(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_КонтролироватьЗаявкуПоБюджету",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция КазначействоСценарийКонтроляПоБюджету(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_КазначействоСценарийКонтроляПоБюджету",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если Результат = Ложь Тогда
		Результат = Справочники.СценарииПланирования.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция КонтролироватьКрайнююДатуПлатежа(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_КонтролироватьКрайнююДатуПлатежа",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если Результат = Ложь Тогда
		Результат = Перечисления.бит_ВидыКонтроляДатыПлатежа.Предупреждать;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ДопустимыйПроцентПревышенияСуммыЗаявки(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ДопустимыйПроцентПревышенияСуммыЗаявки",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если Результат = Ложь Тогда
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнятьНазначениеПлатежаВЗаявкеНаРасходованиеДС(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ЗаполнятьНазначениеПлатежаВЗаявкеНаРасходованиеДС",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция ЗапретитьПлатежиБезЗаявки(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ЗапретитьПлатежиБезЗаявки",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция СоздаватьПланируемыеПоступленияДСПриПереводе(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_СоздаватьПланируемыеПоступленияДСПриПереводе",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция КонтролироватьОстаткиПоПрогнозуПлатежа(СтруктурноеПодразделение, Период) Экспорт

	Перем Результат;
	
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_КонтролироватьОстаткиПоПрогнозуПлатежа",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период)); 
							
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = Перечисления.бит_ВидыКонтроля.НеКонтролировать;	
	КонецЕсли;                                                     
	
	Возврат Результат;
	
КонецФункции

Функция ДопустимыйПроцентПревышенияСуммыПрогнозаПоступления(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ДопустимыйПроцентПревышенияСуммыПрогнозаПоступления",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если Результат = Ложь Тогда
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // -- ЕРП

Функция КонтролироватьОстаткиПоПрогнозуПоступления(СтруктурноеПодразделение, Период) Экспорт

	Перем Результат;
	
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиКазначействаУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_КонтролироватьОстаткиПоПрогнозуПоступления",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период)); 
							
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = Перечисления.бит_ВидыКонтроля.НеКонтролировать;	
	КонецЕсли;                                                     
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область Визирование

Функция НастройкаВизирования(ИмяНастройки, СтруктурноеПодразделение, Период, ЗначениеПоУмочанию = Неопределено) Экспорт
	
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		Отбор = Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период);
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиВизированияУстановлены", Отбор);
		Если ЕстьНастройки Тогда
			Возврат ПолучитьФункциональнуюОпцию(ИмяНастройки, Отбор);
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат ЗначениеПоУмочанию;
	
КонецФункции

Функция ИспользоватьКалендарьДляРасчетаКрайнейДаты(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиВизированияУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ИспользоватьКалендарьДляРасчетаКрайнейДаты",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция ВизированиеНачалоРабочегоДня(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиВизированияУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ВизированиеНачалоРабочегоДня",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если Результат = Ложь Тогда
		Результат = '0001-01-01';	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВизированиеОкончаниеРабочегоДня(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиВизированияУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ВизированиеОкончаниеРабочегоДня",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если Результат = Ложь Тогда
		Результат = '0001-01-01';	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область НастройкиДоговоровИЗатрат

Функция УстанавливатьВДоговорахВысокийПриоритетЗаполненияАналитик(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиДоговоровИЗатратУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_УстанавливатьВДоговорахВысокийПриоритетЗаполненияАналитик",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция КонтролироватьГрафикиДоговоровПоБюджету(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиДоговоровИЗатратУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_КонтролироватьГрафикиДоговоровПоБюджету",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция КонтролироватьЗаявкуНаЗатратыПоБюджету(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиЗакупокУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_КонтролироватьЗаявкуНаЗатратыПоБюджету",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция НеУчитыватьСверхБюджетныеЗаявкиНаЗатратыПриКонтролеПоБюджету(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиЗакупокУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_НеУчитыватьСверхБюджетныеЗаявкиНаЗатратыПриКонтролеПоБюджету",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция КонтролироватьПревышенияСуммыПоДоговору(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиДоговоровИЗатратУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_КонтролироватьПревышенияСуммыПоДоговору",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если Результат = Ложь Тогда
		Результат = Перечисления.бит_ВидыКонтроля.НеКонтролировать;	
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область Закупки

Функция КонтролироватьКоличествоНоменклатурыПоЗаявкамНаЗакупку(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиЗакупокУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_КонтролироватьКоличествоНоменклатурыПоЗаявкамНаЗакупку",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Если Результат = Ложь Тогда
		Результат = Перечисления.бит_мто_ВидыКонтроляПоЗаявкамНаЗакупку.НеКонтролировать;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ФормироватьДвиженияПоФактуБюджетаЗакупок(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиЗакупокУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ФормироватьДвиженияПоФактуБюджетаЗакупок",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция ФормироватьЗависимыеОборотыПоФактуБюджетаЗакупок(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиЗакупокУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_ФормироватьЗависимыеОборотыПоФактуБюджетаЗакупок",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти 

#Область ОбщиеНастройки

Функция Календарь(СтруктурноеПодразделение, Период) Экспорт

	Результат = Ложь;
	Параметры = ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение);	
	Для каждого ЗначениеПараметра Из Параметры Цикл
		ЕстьНастройки = ПолучитьФункциональнуюОпцию("бит_НастройкиПрограммыУстановлены",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
		Если ЕстьНастройки Тогда
			Результат = ПолучитьФункциональнуюОпцию("бит_Календарь",
							Новый Структура("бит_СтруктурноеПодразделение, Период", ЗначениеПараметра, Период));
			Прервать;				
		КонецЕсли;				
	КонецЦикла; 

	Если Результат = Ложь Тогда
		Результат = Справочники.ПроизводственныеКалендари.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Процедура - реализация метода ПриСозданииНаСервере формы списка регистра сведений
//
// Параметры:
//  Форма                - Управляемая форма (форма списка регистра)
//  Отказ                - Булево - признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры	= Форма.Параметры;
	Элементы	= Форма.Элементы;
	Список		= Форма.Список;
	
	Если Параметры.Отбор.Свойство("СтруктурноеПодразделение") Тогда
		Форма.ОтборСтруктурноеПодразделение = Параметры.Отбор.СтруктурноеПодразделение;
		ЭлементОтбораСтруктурноеПодразделение = ЭлементОтбораСпискаПоИмени(Список, "СтруктурноеПодразделение");
		Если ЭлементОтбораСтруктурноеПодразделение <> Неопределено Тогда
			ЭлементОтбораСтруктурноеПодразделение.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
		Элементы.ОтборСтруктурноеПодразделение.Видимость = Истина;
	Иначе
		Элементы.ОтборСтруктурноеПодразделение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - реализация метода ПередЗагрузкойПользовательскихНастроекНаСервере
// динамического списка формы списка регистра сведений
//
// Параметры:
//  Форма     - Управляемая форма (форма списка регистра)
//  Элемент   - ТаблицаФормы - таблица, для которой выполняется сохранение настроек. 
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - загружаемые настройки.
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Форма, Элемент, Настройки) Экспорт
	
	ОбщегоНазначенияБП.ВосстановитьОтборСписка(Форма.Список, Настройки, "СтруктурноеПодразделение");

	ПолеСтруктурноеПодразделениеНаименование = Новый ПолеКомпоновкиДанных("СтруктурноеПодразделение.Наименование");
	ПолеСтруктурноеПодразделение = Новый ПолеКомпоновкиДанных("СтруктурноеПодразделение");
	
	Для каждого ЭлементНастроек Из Настройки.Элементы Цикл
		
		Если ТипЗнч(ЭлементНастроек) = Тип("ПорядокКомпоновкиДанных") 
		И ЭлементНастроек.ИдентификаторПользовательскойНастройки = Форма.Список.КомпоновщикНастроек.Настройки.Порядок.ИдентификаторПользовательскойНастройки Тогда
			
			Для каждого ЭлементПорядка Из ЭлементНастроек.Элементы Цикл
				Если ЭлементПорядка.Поле = ПолеСтруктурноеПодразделениеНаименование Тогда
					ЭлементПорядка.Поле = ПолеСтруктурноеПодразделение;
				КонецЕсли;
				Прервать;
			КонецЦикла;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДействующейУчетнойПолитики(ИмяРегистра, Подразделение, Период = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ?(Период = Неопределено, ТекущаяДатаСеанса(), Период));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	*
	|ИЗ
	|	РегистрСведений.бит_НастройкиБюджетирования.СрезПоследних(&Период, СтруктурноеПодразделение = &Подразделение) КАК Таблица";
	
	Если ИмяРегистра <> "бит_НастройкиБюджетирования" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "бит_НастройкиБюджетирования", ИмяРегистра);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции
 
// Вычисляет структурное подразделение, по которому определяются настройки программы,
// если настройки для переданного подразделения не были найдены.
// Аналог "ПараметрыФункциональнойОпцииНастроекПрограммы", но для других целей.
//
// Параметры:
//  Подразделение	 - СправочникСсылка.Организации, СправочникСсылка.Подразделения	 
//					 - подразделение, шаблон, для которого надо вычислить.
// 
// Возвращаемое значение:
//  Шаблон - неопределено, СправочникСсылка.бит_ГруппыСтруктурныхПодразделений. 
//
Функция ПодразделениеАдминистративныйШаблон(Подразделение)

	Шаблон = Неопределено; // Нет групп, значит для всего предприятия.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Состав.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ГруппыСтруктурныхПодразделений.Состав КАК Состав
	|ГДЕ
	|	Состав.СтруктурноеПодразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса 	   = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Шаблон = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	Возврат Шаблон;
	
КонецФункции

Функция ПараметрыФункциональнойОпцииНастроекПрограммы(СтруктурноеПодразделение)

	Если ТипЗнч(СтруктурноеПодразделение) = Тип("Структура") Тогда
		Подразделение = ОбщегоНазначения.СкопироватьРекурсивно(СтруктурноеПодразделение);
	Иначе	
		Если ТипЗнч(СтруктурноеПодразделение) = Тип("СправочникСсылка.Организации") Тогда
			Подразделение = Новый Структура("Организация", СтруктурноеПодразделение);
		ИначеЕсли ТипЗнч(СтруктурноеПодразделение) = Тип("СправочникСсылка.Подразделения") Тогда	
			Подразделение = Новый Структура("ЦФО", СтруктурноеПодразделение);
		Иначе
			Подразделение = Новый Структура;
		КонецЕсли;
	КонецЕсли;

	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подразделение, "Организация", Неопределено);
	ЦФО 	    = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подразделение, "ЦФО", 		   Неопределено);
	
	// Параметры выстраиваются по приоритету настроек. 
	// Самая важная настройка по ЦФО, самая неважная по предприятию.
	Параметры = Новый Массив;
	Если ЗначениеЗаполнено(ЦФО) Тогда
		Параметры.Добавить(ЦФО);
	КонецЕсли;
	Если ЗначениеЗаполнено(Организация) Тогда
		Параметры.Добавить(Организация);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Состав.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ГруппыСтруктурныхПодразделений.Состав КАК Состав
	|ГДЕ
	|	Состав.СтруктурноеПодразделение В (&Организация, &ЦФО)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЦФО", 		 ЦФО);
	
	РезультатЗапроса 	   = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Параметры.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Параметры.Добавить(Неопределено);
	
	Возврат Параметры;
	
КонецФункции
 
// Функция применяется при необходимости получить сведения об учетной политике организации
// или настройках налога
//
// Параметры: нет
//
// Возвращаемое значение - дерево значений.
//  На первом уровне дерева - список организаций, для которых задана учетная политика
//  На втором уровне дерева - записи учетной политики по организации, каждая запись хранится в дереве как структура
//
Функция ЗаполнениеНастройкиУчетнойПолитики(ИмяНастройки)

	Запрос = Новый Запрос();

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	*
	|ИЗ
	|	РегистрСведений.бит_НастройкиБюджетирования КАК УчетнаяПолитика";
	
	Если ИмяНастройки <> "бит_НастройкиБюджетирования" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "бит_НастройкиБюджетирования", ИмяНастройки);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Сортировать("Период");

	ДеревоУчетнойПолитики = Новый ДеревоЗначений;
	ДеревоУчетнойПолитики.Колонки.Добавить("СтруктурноеПодразделение");
	ДеревоУчетнойПолитики.Колонки.Добавить("Период");
	ДеревоУчетнойПолитики.Колонки.Добавить("УчетнаяПолитика");

	Для каждого Строка Из Результат Цикл
		УчетнаяПолитикаПодразделения = ДеревоУчетнойПолитики.Строки.Найти(Строка.СтруктурноеПодразделение, "СтруктурноеПодразделение");
		Если УчетнаяПолитикаПодразделения = Неопределено Тогда
			УчетнаяПолитикаПодразделения = ДеревоУчетнойПолитики.Строки.Добавить();
			УчетнаяПолитикаПодразделения.СтруктурноеПодразделение = Строка.СтруктурноеПодразделение;
		КонецЕсли;
		ПоПериоду = УчетнаяПолитикаПодразделения.Строки.Добавить();
		ПоПериоду.Период = Строка.Период;

		СтруктураУчетнойПолитики = Новый Структура;
		Для Каждого Колонка Из Результат.Колонки Цикл
			СтруктураУчетнойПолитики.Вставить(Колонка.Имя, Строка[Колонка.Имя]);
		КонецЦикла;

		ПоПериоду.УчетнаяПолитика = СтруктураУчетнойПолитики;

	КонецЦикла;

	Возврат ДеревоУчетнойПолитики;

КонецФункции

// Возвращает элемент пользовательского отбора динамического списка, 
// соответствующий отбору, заданному в конфигураторе с указанным именем.
// Соответствие определяется по совпадению идентификаторов настройки.
//
// Параметры
//  Список - ДинамическийСписок - динамический список, для которого ищется элемент отбора.
//  ИмяОтбора - Строка - имя отбора, заданное в конфигураторе для элемента настроек динамического списка.
//
// Возвращаемое значение:
//	ЭлементОтбораКомпоновкиДанных - найденный элемент пользовательского отбора.
//  Неопределено - если элемент пользовательского отбора не найден.
//
Функция ЭлементОтбораСпискаПоИмени(Список, ИмяОтбора)

	Отборы = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(
		Список.КомпоновщикНастроек.Настройки.Отбор, 
		ИмяОтбора);
	
	Если Отборы.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Отборы[0];
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьМенеджерЗаписиНастроекПрограммы(ИмяРегистра, ДанныеЗаполнения)
	
	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	РегистрыСведений[ИмяРегистра].УстановкаНастроекПоУмолчанию(МенеджерЗаписи, ДанныеЗаполнения);
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти