&После("ПриСозданииНаСервере")
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//Первыйбит ЛТ1 ЛапшовГ "GVLapshov@1cbit.ru" 23.09.2024 +
	НовыйЭлемент = Элементы.Добавить("Бит_ГруппаДополнительныеРеквизиты", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Дополнительно (Бит)"; 

	НовыйЭлемент = Элементы.Добавить("Бит_НаименованиеСФормойСобственности", Тип("ПолеФормы"), Элементы.Бит_ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Бит_НаименованиеСФормойСобственности"; 
	
	НовыйЭлемент = Элементы.Добавить("Бит_ФормаСобственности", Тип("ПолеФормы"), Элементы.Бит_ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Бит_ФормаСобственности";
	
	НовыйЭлемент = Элементы.Добавить("Бит_Зона", Тип("ПолеФормы"), Элементы.Бит_ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Бит_Зона";
	
	НовыйЭлемент = Элементы.Добавить("Бит_ИДКлиента", Тип("ПолеФормы"), Элементы.ГруппаДопоБит_ГруппаДополнительныеРеквизитылнительныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Бит_ИДКлиента";
	//Первыйбит ЛТ1 ЛапшовГ "GVLapshov@1cbit.ru" 23.09.2024 -
			
КонецПроцедуры