#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура сохраняет модель объекта в хранилище значения.
// 
// Параметры:
//  МодельОбъекта - Структура.
// 
Процедура ЗаписатьМодельОбъекта(МодельОбъекта) Экспорт

	 ЭтотОбъект.ХранилищеМодельОбъекта = Новый ХранилищеЗначения(МодельОбъекта);

КонецПроцедуры

// Функция извлекает значение модели объекта из хранилища значения.
// 
// Возвращаемое значение:
//  МодельОбъекта - Структура.
// 
Функция ПолучитьМодельОбъекта() Экспорт

	МодельОбъекта = ЭтотОбъект.ХранилищеМодельОбъекта.Получить();
	Если НЕ ТипЗнч(МодельОбъекта) = Тип("Структура") Тогда
	
		МодельОбъекта = Справочники.бит_мдм_ОписанияОбъектовОбмена.МодельОбъектаКонструктор();
	
	КонецЕсли; 
	
	Возврат МодельОбъекта;
	
КонецФункции // ПолучитьМодельОбъекта()

// Процедура сохраняет модель объекта начальную в хранилище значения.
// 
// Параметры:
//  МодельОбъекта - Структура.
// 
Процедура ЗаписатьМодельОбъектаПред(МодельОбъекта) Экспорт

	 ЭтотОбъект.ХранилищеМодельОбъектаПред = Новый ХранилищеЗначения(МодельОбъекта);

КонецПроцедуры // ЗаписатьХранилище()

// Функция извлекает значение модели объекта до начала изменений из хранилища значения.
// 
// Возвращаемое значение:
//  МодельОбъекта - Структура.
// 
Функция ПолучитьМодельОбъектаПред() Экспорт

	МодельОбъекта = ЭтотОбъект.ХранилищеМодельОбъектаПред.Получить();
	Если НЕ ТипЗнч(МодельОбъекта) = Тип("Структура") Тогда
	
		МодельОбъекта = Справочники.бит_мдм_ОписанияОбъектовОбмена.МодельОбъектаКонструктор();
	
	КонецЕсли; 
	
	Возврат МодельОбъекта;
	
КонецФункции

// Процедура заполняет объект по модели.
// 
// Параметры:
//  СпрОб - СправочникОбъект
//  МодельОбъекта - Структура
// 
Процедура ЗаполнитьОбъектПоМодели(СпрОб, МодельОбъекта)
	
	МетаОбъект = СпрОб.Метаданные();
	ИспользованиеРеквизита = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита;
	ЭтоГруппа = СпрОб.ЭтоГруппа;
	
	Для каждого КиЗ Из МодельОбъекта.СтандартныеРеквизиты Цикл
		
		Если КиЗ.Ключ = "Код" ИЛИ КиЗ.Ключ = "ЭтоГруппа" Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		СпрОб[КиЗ.Ключ] = КиЗ.Значение;
		
	КонецЦикла; 
	
	Для каждого КиЗ Из МодельОбъекта.Реквизиты Цикл
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(КиЗ.Ключ, МетаОбъект) Тогда
			
			МетаРеквизит = МетаОбъект.Реквизиты[КиЗ.Ключ];
			
			Если (МетаРеквизит.Использование = ИспользованиеРеквизита.ДляЭлемента И ЭтоГруппа) 
				ИЛИ (МетаРеквизит.Использование = ИспользованиеРеквизита.ДляГруппы И НЕ ЭтоГруппа)  Тогда
				
				Продолжить;
				
			КонецЕсли; 			
			
			СпрОб[КиЗ.Ключ] = КиЗ.Значение;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Для каждого КиЗ Из МодельОбъекта.ТабличныеЧасти Цикл
		
		МодельТЧ = КиЗ.Значение;
		ИмяТЧ = КиЗ.Ключ;		
		
		Если НЕ бит_РаботаСМетаданными.ЕстьТабЧасть(ИмяТЧ, МетаОбъект) Тогда
		
			 Продолжить;
		
		КонецЕсли; 
		
		МетаТЧ = МетаОбъект.ТабличныеЧасти[ИмяТЧ];
		
		Если (МетаТЧ.Использование = ИспользованиеРеквизита.ДляЭлемента И ЭтоГруппа) 
			  ИЛИ (МетаТЧ.Использование = ИспользованиеРеквизита.ДляГруппы И НЕ ЭтоГруппа)  Тогда
		
			 Продолжить;
		
		КонецЕсли; 		
		
		СпрОб[ИмяТЧ].Очистить();
		
		Для каждого МодельСтроки Из МодельТЧ Цикл
			
			НоваяСтрока = СпрОб[ИмяТЧ].Добавить();
			
			Для каждого КиЗР Из МодельСтроки Цикл
				
				Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти(КиЗР.Ключ, МетаОбъект, ИмяТЧ) Тогда
					
					НоваяСтрока[КиЗР.Ключ] = КиЗР.Значение;
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	СпрОб.ДополнительныеСвойства.Вставить("бит_мдм_РазрешеноИзменение", Истина);
	
КонецПроцедуры // ЗаполнитьОбъектПоМодели()

// Процедура выполняет заявку на удаление - помечает предмет на удаление. 
// В случае успешного выполнения устанавливается статус Исполнена. 
// 
Процедура ИсполнитьЗаявку() Экспорт
	
	флВыполнено = Ложь;
	
	МодельОбъекта = ЭтотОбъект.ПолучитьМодельОбъекта();
	
	Если ЭтотОбъект.ВидОперации = Перечисления.бит_мдм_ВидыОперацийЗаявкаНаИзменение.ВводНового Тогда
		
		Если ЭтотОбъект.СоздатьГруппу Тогда
			СпрОб = Справочники[ЭтотОбъект.ОписаниеОбъекта.Имя].СоздатьГруппу();
		Иначе	
			СпрОб = Справочники[ЭтотОбъект.ОписаниеОбъекта.Имя].СоздатьЭлемент();
		КонецЕсли; 
		
		ЗаполнитьОбъектПоМодели(СпрОб, МодельОбъекта);
		СпрОб.УстановитьНовыйКод();
		
		флВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОб,,"Все");
		
		Если флВыполнено Тогда
		
			 ЭтотОбъект.Предмет = СпрОб.Ссылка;
			 ЭтотОбъект.ОбменДанными.Загрузка = Истина;
			 
			 бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ЭтотОбъект,РежимЗаписиДокумента.Запись,,"Ошибки");
		
		КонецЕсли; 
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.бит_мдм_ВидыОперацийЗаявкаНаИзменение.Изменение Тогда	
		
		СпрОб = ЭтотОбъект.Предмет.ПолучитьОбъект();
		ЗаполнитьОбъектПоМодели(СпрОб, МодельОбъекта);
		флВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОб,,"Все");
		
	КонецЕсли; 
	
	
	Если флВыполнено Тогда
		
		ПараметрыУстановкиСтатуса = бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса();
		ПараметрыУстановкиСтатуса.Объект               = ЭтотОбъект.Ссылка; 
		ПараметрыУстановкиСтатуса.Статус               = Справочники.бит_СтатусыОбъектов.ЗаявкаНаИзменение_Исполнена;
		ПараметрыУстановкиСтатуса.СтатусПредыдущий     = бит_ВизированиеСервер.ТекущийСтатус(ЭтотОбъект.Ссылка);
		ПараметрыУстановкиСтатуса.ДатаИзмененияСтатуса = ТекущаяДатаСеанса();
		
		ДействиеВыполнено = бит_ВизированиеСервер.УстановитьСтатусОбъекта(ПараметрыУстановкиСтатуса);
		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза;
	ВидОперации = Перечисления.бит_мдм_ВидыОперацийЗаявкаНаИзменение.ВводНового;
	
	Если ЭтоНовый() Тогда		
		// Заполнение шапки.
		бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), Неопределено);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВидОперации = Перечисления.бит_мдм_ВидыОперацийЗаявкаНаИзменение.Изменение Тогда
		 ПроверяемыеРеквизиты.Добавить("Предмет");
	КонецЕсли; 
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проверка заполнения модели объекта.
	МодельОбъекта = ЭтотОбъект.ПолучитьМодельОбъекта();
	
	Если МодельОбъекта.СтандартныеРеквизиты.Количество() = 0 И МодельОбъекта.Реквизиты.Количество() = 0 Тогда	
		ТекстСообщения = НСтр("ru='Не внесены новые данные';en='Not included new data'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,, Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЭтотОбъект.ВидОперации = Перечисления.бит_мдм_ВидыОперацийЗаявкаНаИзменение.ВводНового Тогда
		
		ЭтотОбъект.Предмет = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли