
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	СтрПеречисление = бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ВидыОперацийОбработкиОчередиТрансляции);
	
	СтрПеречисления = Новый Структура("бит_ВидыОперацийОбработкиОчередиТрансляции", СтрПеречисление);
	
	фКэшЗначений = Новый Структура("Перечисления", СтрПеречисления);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьОбработанныеЗаписи(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", фКэшЗначений.Перечисления.бит_ВидыОперацийОбработкиОчередиТрансляции.УдалитьОбработанныеЗаписи);
	
	ОткрытьФорму("Обработка.бит_ОбработкаЗаписейРегистраОчередьТрансляции.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатус(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", фКэшЗначений.Перечисления.бит_ВидыОперацийОбработкиОчередиТрансляции.ИзменитьСтатус);
	
	ОткрытьФорму("Обработка.бит_ОбработкаЗаписейРегистраОчередьТрансляции.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
