#Область ПрограммныйИнтерфейс

// При определении команд.
// 
// Параметры:
//  ИмяФормы - Строка - Имя формы объекта ГосИС, на которую добавляются команды ввода/выбора основания
//  Команды - Массив Из См. ПодключаемыеКомандыИСКлиенСервер.ОписаниеКоманды - Добавляемые на форму команды
Процедура ПриОпределенииКоманд(ИмяФормы, Команды) Экспорт
	
	Если ИмяФормы = "Документ.ВходящаяТранспортнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУТКлиентСервер.КомандыВходящейТранспортнойОперации(Команды);
	ИначеЕсли ИмяФормы = "Документ.ИсходящаяТранспортнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУТКлиентСервер.КомандыИсходящейТранспортнойОперации(Команды);
	ИначеЕсли ИмяФормы = "Документ.ИнвентаризацияПродукцииВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУТКлиентСервер.КомандыИнвентаризацииПродукции(Команды);
	ИначеЕсли ИмяФормы = "Документ.ПроизводственнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУТКлиентСервер.КомандыПроизводственнойОперации(Команды);
	
	ИначеЕсли ИмяФормы = "Документ.МаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.КомандыМаркировкиТоваровИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.КомандыЗаказНаЭмиссиюКодовМаркировкиСУЗ(Команды);
	ИначеЕсли ИмяФормы = "Документ.ВыводИзОборотаИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.КомандыВыводаИзОборотаИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.КомандыСписанияКодовМаркировкиИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.КомандыПеремаркировкиТоваровИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.ВозвратВОборотИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.КомандыВозвратаВОборотИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.ОтгрузкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.КомандыОтгрузкиТоваровИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.ПриемкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.КомандыПриемкиТоваровИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.УточнениеСведенийОКодахМаркировкиИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.КомандыУточненияСведенийОКодахМаркировкиИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.РазрешениеНаОтгрузкуИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.КомандыРазрешениеНаОтгрузкуИСМП(Команды);
	ИначеЕсли ИмяФормы = "Документ.ПеремещениеМеждуМОДИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.КомандыПеремещениеМеждуМОДИСМП(Команды);
		
	ИначеЕсли ИмяФормы = "Документ.ПогашениеСДИЗЗЕРНО.Форма.ФормаДокумента" Тогда
		ИнтеграцияЗЕРНОУТКлиентСервер.КомандыПогашенияСДИЗ(Команды);
	ИначеЕсли ИмяФормы = "Документ.ОформлениеСДИЗЗЕРНО.Форма.ФормаДокумента" Тогда
		ИнтеграцияЗЕРНОУТКлиентСервер.КомандыОформлениеСДИЗЗЕРНО(Команды);
	ИначеЕсли ИмяФормы = "Документ.ФормированиеПартийЗЕРНО.Форма.ФормаДокумента" Тогда
		ИнтеграцияЗЕРНОУТКлиентСервер.КомандыФормированиеПартийЗЕРНО(Команды);
	ИначеЕсли ИмяФормы = "Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Форма.ФормаДокумента" Тогда
		ИнтеграцияЗЕРНОУТКлиентСервер.КомандыВнесениеСведенийОСобранномУрожаеЗЕРНО(Команды);
	ИначеЕсли ИмяФормы = "Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Форма.ФормаДокумента" Тогда
		ИнтеграцияЗЕРНОУТКлиентСервер.КомандыФормированиеПартийПриПроизводствеЗЕРНО(Команды);
	ИначеЕсли ИмяФормы = "Документ.СписаниеПартийЗЕРНО.Форма.ФормаДокумента" Тогда
		ИнтеграцияЗЕРНОУТКлиентСервер.КомандыСписаниеПартийЗЕРНО(Команды);
	
	ИначеЕсли ИмяФормы = "Документ.АктИнвентаризацииСАТУРН.Форма.ФормаДокумента" Тогда
		ИнтеграцияСАТУРНУТКлиентСервер.КомандыАктИнвентаризацииСАТУРН(Команды);
	ИначеЕсли ИмяФормы = "Документ.АктПримененияСАТУРН.Форма.ФормаДокумента" Тогда
		ИнтеграцияСАТУРНУТКлиентСервер.КомандыАктПримененияСАТУРН(Команды);
	ИначеЕсли ИмяФормы = "Документ.ИмпортПродукцииСАТУРН.Форма.ФормаДокумента" Тогда
		ИнтеграцияСАТУРНУТКлиентСервер.КомандыИмпортПродукцииСАТУРН(Команды);
	ИначеЕсли ИмяФормы = "Документ.НакладнаяСАТУРН.Форма.ФормаДокумента" Тогда
		ИнтеграцияСАТУРНУТКлиентСервер.КомандыНакладнаяСАТУРН(Команды);
	ИначеЕсли ИмяФормы = "Документ.ПроизводственнаяОперацияСАТУРН.Форма.ФормаДокумента" Тогда
		ИнтеграцияСАТУРНУТКлиентСервер.КомандыПроизводственнаяОперацияСАТУРН(Команды);
	
	ИначеЕсли ИмяФормы = "Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСУТКлиентСервер.КомандыАктПостановкиНаБалансЕГАИС(Команды);
	ИначеЕсли ИмяФормы = "Документ.АктСписанияЕГАИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСУТКлиентСервер.КомандыАктСписанияЕГАИС(Команды);
	ИначеЕсли ИмяФормы = "Документ.ОтчетОПроизводствеЕГАИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСУТКлиентСервер.КомандыОтчетОПроизводствеЕГАИС(Команды);
	ИначеЕсли ИмяФормы = "Документ.ТТНИсходящаяЕГАИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСУТКлиентСервер.КомандыТТНИсходящаяЕГАИС(Команды);
	ИначеЕсли ИмяФормы = "Документ.ТТНВходящаяЕГАИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСУТКлиентСервер.КомандыТТНВходящаяЕГАИС(Команды);
	ИначеЕсли ИмяФормы = "Документ.УведомлениеОПланируемомИмпортеЕГАИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСУТКлиентСервер.КомандыУведомлениеОПланируемомИмпортеЕГАИС(Команды);
	ИначеЕсли ИмяФормы = "Документ.ЧекЕГАИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСУТКлиентСервер.КомандыЧекЕГАИС(Команды);
	ИначеЕсли ИмяФормы = "Документ.ЧекЕГАИСВозврат.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСУТКлиентСервер.КомандыЧекЕГАИСВозврат(Команды);
	
	КонецЕсли;
	
КонецПроцедуры

// Настройка видимости команд ввода/выбора основания в зависимости от реквизитов объекта.
//   Если зависимости нет, переопределения не требуется.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма объекта ГосИС с командами ввода/выбора основания
//  КомандыОбъекта - Массив Из См. ПодключаемыеКомандыИСКлиентСервер.ОписаниеКоманды - Команды объекта
Процедура ПриНастройкеВидимостиКоманд(Форма, КомандыОбъекта) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ИсходящаяТранспортнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУТКлиентСервер.УправлениеВидимостьюКомандИсходящейТранспортнойОперации(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.ИнвентаризацияПродукцииВЕТИС.Форма.ФормаДокумента" Тогда
		ИнтеграцияВЕТИСУТКлиентСервер.УправлениеВидимостьюКомандИнвентаризацииПродукции(Форма, КомандыОбъекта);
	
	ИначеЕсли ИмяФормы = "Документ.МаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.УправлениеВидимостьюКомандМаркировкиТоваров(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.УправлениеВидимостьюКомандЗаказаНаЭмиссию(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.ВыводИзОборотаИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.УправлениеВидимостьюКомандВыводаВОборота(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.СписаниеКодовМаркировкиИСМП.Форма.ФормаДокумента" Тогда
		ИнтеграцияИСМПУТКлиентСервер.УправлениеВидимостьюКомандСписанияКодовМаркировки(Форма, КомандыОбъекта);
	
	ИначеЕсли ИмяФормы = "Документ.ОформлениеСДИЗЗЕРНО.Форма.ФормаДокумента" Тогда
		ИнтеграцияЗЕРНОУТКлиентСервер.УправлениеВидимостьюКомандОформлениеСДИЗЗЕРНО(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.ФормированиеПартийЗЕРНО.Форма.ФормаДокумента" Тогда
		ИнтеграцияЗЕРНОУТКлиентСервер.УправлениеВидимостьюКомандФормированиеПартийЗЕРНО(Форма, КомандыОбъекта);
		
	ИначеЕсли ИмяФормы = "Документ.АктИнвентаризацииСАТУРН.Форма.ФормаДокумента" Тогда
		ИнтеграцияСАТУРНУТКлиентСервер.УправлениеВидимостьюКомандАктИнвентаризацииСАТУРН(Форма, КомандыОбъекта);
	ИначеЕсли ИмяФормы = "Документ.НакладнаяСАТУРН.Форма.ФормаДокумента" Тогда
		ИнтеграцияСАТУРНУТКлиентСервер.УправлениеВидимостьюКомандНакладнаяСАТУРН(Форма, КомандыОбъекта);
	КонецЕсли;
	
	Возврат;
	
КонецПроцедуры

// Заполнить соответствие полей документов оснований (фильтр выбора основания).
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - источник вызова
//  ТипОбъекта - Тип - Тип объекта
//  СоответствиеПолей - Соответствие Из Произвольный - Соответствие полей объекта и основания
Процедура ЗаполнитьСоответствиеПолейДокументовОснований(Форма, ТипОбъекта, СоответствиеПолей) Экспорт
	
	//++ НЕ ГОСИС
	Если СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ПеремаркировкаТоваровИСМП") Тогда
		
		СоответствиеПолей.Вставить("ПоступлениеТоваровУслуг", Новый Соответствие);
		СоответствиеПолей["ПоступлениеТоваровУслуг"].Вставить("Организация", "Организация");
		
	КонецЕсли;
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

#КонецОбласти