
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокРегистров = Параметры.Регистры.Скопировать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ИзменитьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ИзменитьФлажки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("СписокРегистров", СписокРегистров);
	
	Закрыть(СтруктураРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает значение флажка в таблице в нужное состояние.
// 
// Параметры:
// 	ИмяТаблицы     - Строка - имя таблицы.
// 	ЗначениеФлажка - Булево.
// 
&НаКлиенте
Процедура ИзменитьФлажки(ЗначениеФлажка)
	
	Для Каждого ТекСтрока Из СписокРегистров Цикл
		
		ТекСтрока.Пометка = ЗначениеФлажка;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти