&После("ПриСозданииНаСервере")
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//Первыйбит ЛТ1 ЛапшовГ "GVLapshov@1cbit.ru" 31.01.2025 + 
	ЗаголовокФормы = ЭтаФорма.Заголовок;
	ДобавляемыеРеквизиты	= Новый Массив;
	Реквизит_бит_НаименованиеСФормойСобственности = Новый РеквизитФормы("бит_НаименованиеСФормойСобственности",	Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(1024)),	, "(бит) Наименование с формой собственности");
	Реквизит_бит_ФормаСобственности = Новый РеквизитФормы("бит_ФормаСобственности",	Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(1024)),	, "(бит) Форма собственности");
	Реквизит_бит_Зона = Новый РеквизитФормы("бит_Зона",	Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(1024)),	, "(бит) Зона)");
	Реквизит_бит_ИДКлиента = Новый РеквизитФормы("бит_ИДКлиента",	Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(100)),	, "ИДКлиента");
		
	ДобавляемыеРеквизиты.Добавить(Реквизит_бит_НаименованиеСФормойСобственности); 
	ДобавляемыеРеквизиты.Добавить(Реквизит_бит_ФормаСобственности);
	ДобавляемыеРеквизиты.Добавить(Реквизит_бит_Зона);
	ДобавляемыеРеквизиты.Добавить(Реквизит_бит_ИДКлиента);
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);   
	
	Если Не КонтрагентПартнера.Пустая() Тогда
			КонтрагентОбъект = КонтрагентПартнера.ПолучитьОбъект(); 	
			ЭтаФорма.бит_НаименованиеСФормойСобственности = КонтрагентОбъект.бит_НаименованиеСФормойСобственности;
			ЭтаФорма.бит_ФормаСобственности = КонтрагентОбъект.бит_ФормаСобственности;
			ЭтаФорма.бит_Зона = КонтрагентОбъект.бит_Зона;	
			ЭтаФорма.бит_ИДКлиента = КонтрагентОбъект.бит_ИДКлиента;
	КонецЕсли;
		
	НовыйЭлемент = Элементы.Добавить("бит_ГруппаДополнительныеРеквизиты", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "(бит) Дополнительно"; 
			
		НовыйЭлемент = Элементы.Добавить("бит_НаименованиеСФормойСобственности", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "бит_НаименованиеСФормойСобственности"; 
		
		НовыйЭлемент = Элементы.Добавить("бит_ФормаСобственности", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "бит_ФормаСобственности";
		
		НовыйЭлемент = Элементы.Добавить("бит_Зона", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "бит_Зона";
		
		НовыйЭлемент = Элементы.Добавить("бит_ИДКлиента", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "бит_ИДКлиента"; 
	//Первыйбит ЛТ1 ЛапшовГ "GVLapshov@1cbit.ru" 31.01.2025 -
	
	//Первыйбит ЛТ1.1 ЛапшовГ "GVLapshov@1cbit.ru" 31.01.2025 +
	НоваяСтраница = Элементы.Добавить("СтраницаАтрибуты", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
    НоваяСтраница.Вид = ВидГруппыФормы.Страница; 
	НоваяСтраница.Заголовок = "(бит) Атрибуты";
	
	ГруппаДинамическогоСписка  = Элементы.Добавить("Группабит_Атрибуты",Тип("ГруппаФормы"), Элементы.СтраницаАтрибуты);
	ГруппаДинамическогоСписка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДинамическогоСписка.ОтображатьЗаголовок = Истина; 
	ГруппаДинамическогоСписка.Заголовок = "(бит) Атрибуты";
	ГруппаДинамическогоСписка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаДинамическогоСписка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаДинамическогоСписка.Поведение = ПоведениеОбычнойГруппы.Авто;
	ГруппаДинамическогоСписка.Скрыть();
    ТекстЗапроса = "ВЫБРАТЬ
                   |	бит_ЗначенияАтрибутовКонтрагентов.бит_Признак.Код КАК Код,
                   |	бит_ЗначенияАтрибутовКонтрагентов.бит_Признак КАК Наименование,
                   |	бит_ЗначенияАтрибутовКонтрагентов.бит_Значение КАК Значение
                   |ИЗ
                   |	РегистрСведений.бит_ЗначенияАтрибутовКонтрагентов КАК бит_ЗначенияАтрибутовКонтрагентов
                   |ГДЕ
                   |	бит_ЗначенияАтрибутовКонтрагентов.бит_Контрагент.Партнер = &Контрагент";
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("Код");
	МассивКолонок.Добавить("Наименование");
	МассивКолонок.Добавить("Значение");
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Контрагент", Объект.Ссылка); 
	СписокДействий = Новый Структура;
	СписокДействий.Вставить("ПередНачаломДобавления", "ПередНачаломДобавления"); 
	СозданиеДинамическогоСписка("бит_Атрибуты", ТекстЗапроса, МассивКолонок,СписокДействий,"РегистрСведений.бит_ЗначенияАтрибутовКонтрагентов","Группабит_Атрибуты", , , СписокПараметров); 
	ЭтаФорма.Заголовок = ЗаголовокФормы;
	//Первыйбит ЛТ1.1 ЛапшовГ "GVLapshov@1cbit.ru" 31.01.2025 - 
	
КонецПроцедуры    

&НаСервере
Процедура СозданиеДинамическогоСписка(
	ИмяСписка = "Список", 			//тип строка - имя будущего списка на форме и реквизита
	ТекстЗапроса = "", 				//тип строка - запрос, если он не указан, необходимо указать таблицу
	МассивКолонок,                  //тип массив - массив создаваемых колонок, значения тип строка. Пример: "Д,ДоговораКонтрагента" значит будет создана колонка
									//				с заголовком "Д" и колонкой списка "ДоговораКонтрагента". Если указать просто "ДоговораКонтрагента", 
									//				заголовок будет идентичен заголовку по умолчанию типа "Договор контрагента".
	СписокДействий = Неопределено,  //тип структура - структура содержит действия (свойства) динамического списка, можно указать только те которые необходимы.
									//				пример: СписокДействий = Новый Структура("Выбор,ПриАктивизацииСтроки","СписокВыбор","СписокПриАктивизацииСтроки")
	ТаблицаСписка = "",				//тип строка - содержит имя основной таблицы, пример: "Документ.РеализацияТоваровУслуг"	
	ДобавитьВ = "",                 //тип строка - имя элемента на который будет размещен список, если пустое, тогда добавляется на форму
	ВставитьПеред = "",             //тип строка - имя элемента перед которым будет размещен список, если пустое, будет просто добавлен в конец
	СвояКоманднаяПанель = ЛОЖЬ,     //тип булево - если ИСТИНА, скрывает стандартную панель и создает свою пустую для будушего наполнения ИмяСписка+"КоманднаяПанель2"
	ПараметрыЗапроса = Неопределено)//тип структура - содержит перечень параметров, если они используются в запросе.
	
	// //Первыйбит ЛТ1.1 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 + 
	//Защита от дурака
	Если ТекстЗапроса = "" И ТаблицаСписка = "" Тогда Сообщить("Ошибка формирования динамического списка, укажите запрос или таблицу"); Возврат; КонецЕсли;
																									
	//Создаем свою командную панель, тот случай когда я не нашел способа снять галочку "Автозаполнение"
	//Если СвояКоманднаяПанель Тогда
		Если ВставитьПеред = "" Тогда
			ГруппаДинамическогоСписка  = Элементы.Добавить("Группа" + ИмяСписка + "CоСвоейКоманднойПанелью",Тип("ГруппаФормы"),?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ]));
		Иначе
			ГруппаДинамическогоСписка  = Элементы.Вставить("Группа" + ИмяСписка + "CоСвоейКоманднойПанелью",Тип("ГруппаФормы"),?(ДобавитьВ = "",ЭтаФорма,ЭтаФорма.Элементы[ДобавитьВ]),ЭтаФорма.Элементы[ВставитьПеред]);			
		КонецЕсли;
		ГруппаДинамическогоСписка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаДинамическогоСписка.ОтображатьЗаголовок = Ложь; 
		ГруппаДинамическогоСписка.Отображение = ОтображениеОбычнойГруппы.Нет;
		//КоманднаяПанельСписка  = Элементы.Добавить(ИмяСписка + "КоманднаяПанель2",Тип("ГруппаФормы"),ГруппаДинамическогоСписка);
	//	КоманднаяПанельСписка.Вид = ВидГруппыФормы.КоманднаяПанель;			
	//КонецЕсли;
									
	//Создаем реквизит формы
	ТипыРеквизита = Новый Массив;                             
	ТипыРеквизита.Добавить(Тип("ДинамическийСписок"));
	ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита); 
	ДинамическийСписок = Новый РеквизитФормы(ИмяСписка, ОписаниеТиповДляРеквизита,,"",ЛОЖЬ); //Имя реквизита
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);        
	
	//Задаем свойства реквизиту
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);        
	РеквизитДинамическийСписок = ЭтаФорма[ИмяСписка]; //Имя реквизита
	Если ТекстЗапроса = "" Тогда
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = ЛОЖЬ;
		РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка;
	Иначе
		РеквизитДинамическийСписок.ПроизвольныйЗапрос = ИСТИНА;
		РеквизитДинамическийСписок.ТекстЗапроса = ТекстЗапроса;
		Если ТаблицаСписка <> "" Тогда РеквизитДинамическийСписок.ОсновнаяТаблица = ТаблицаСписка; КонецЕсли;		
	КонецЕсли;
	
	//Заполняем параметры если они были указаны
	Если ПараметрыЗапроса <> Неопределено Тогда
		Для Каждого Параметра из ПараметрыЗапроса Цикл
			РеквизитДинамическийСписок.Параметры.УстановитьЗначениеПараметра(Параметра.Ключ,Параметра.Значение);	
		КонецЦикла;		 
	КонецЕсли;
	
	//Размещаем реквизит на форме
	ТаблицаФормы = Элементы.Добавить(ИмяСписка,Тип("ТаблицаФормы"),ГруппаДинамическогоСписка);		
	ТаблицаФормы.ПутьКДанным = ИмяСписка; //Имя реквизита 
	
	//Если своя панель тогда скрываем стандартную
	Если СвояКоманднаяПанель Тогда
		Элементы[ИмяСписка].ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	КонецЕсли;

	//Создание колонок на основание МассивКолонок
	Для Каждого Элемента Из МассивКолонок Цикл
		ПараметрыКолонки = СтрЗаменить(Элемента,",",Символы.ПС);
		Если СтрЧислоСтрок(ПараметрыКолонки) > 1 Тогда
			Заголовок = СтрПолучитьСтроку(ПараметрыКолонки, 1);
			ИмяКолонки = СтрПолучитьСтроку(ПараметрыКолонки, 2);
		Иначе
			Если ПараметрыКолонки = "ПризнакСертификации" Тогда
				Заголовок = "Признак сертификации";
				ИмяКолонки = ПараметрыКолонки; 	
			ИначеЕсли ПараметрыКолонки = "Код"
				  Или ПараметрыКолонки = "Наименование"
				  Или ПараметрыКолонки = "Значение"
				  Тогда
				Заголовок = ПараметрыКолонки + " атрибута";
				ИмяКолонки = ПараметрыКолонки; 
		    КонецЕсли;
		КонецЕсли;
		НоваяКолонкаТаблицы = Элементы.Добавить(ИмяСписка + ИмяКолонки, Тип("ПолеФормы"), ТаблицаФормы);
		Если Заголовок <> "" Тогда НоваяКолонкаТаблицы.Заголовок = Заголовок; КонецЕсли;
		НоваяКолонкаТаблицы.ПутьКДанным = ИмяСписка + "." + ИмяКолонки; 	
	КонецЦикла;
	
	//Задаем действия (События) на основание СписокДействий, если он определен
	Если СписокДействий <> Неопределено Тогда 	
		ПереченьСвойств = "ПриИзменении
						|Выбор
						|ПриАктивизацииСтроки
						|ВыборЗначения
						|ПриАктивизацииПоля
						|ПриАктивизацииЯчейки
						|ПередНачаломДобавления
						|ПередНачаломИзменения
						|ПередУдалением
						|ПриНачалеРедактирования
						|ПередОкончаниемРедактирования
						|ПриОкончанииРедактирования
						|ОбработкаВыбора
						|ПередРазворачиванием
						|ПередСворачиванием
						|ПослеУдаления
						|ПриСменеТекущегоРодителя
						|ОбработкаЗаписиНового
						|ПриСохраненииПользовательскихНастроекНаСервере
						|ПередЗагрузкойПользовательскихНастроекНаСервере
						|ПриЗагрузкеПользовательскихНастроекНаСервере
						|ПриОбновленииСоставаПользовательскихНастроекНаСервере
						|ОбработкаЗапросаОбновления
						|ПриПолученииДанныхНаСервере
						|НачалоПеретаскивания
						|ПроверкаПеретаскивания
						|ОкончаниеПеретаскивания
						|Перетаскивание";
		Для Счетчик = 1 по 28 Цикл
			ИмяСвойства = СтрПолучитьСтроку(ПереченьСвойств, Счетчик); 
			//Действие = СписокДействий[ИмяСвойства];
			Элементы[ИмяСписка].УстановитьДействие(ИмяСвойства,?(СписокДействий.Свойство(ИмяСвойства),СписокДействий[ИмяСвойства],""));
		КонецЦикла;
	КонецЕсли;	
    // //Первыйбит ЛТ1.1 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
	
КонецПроцедуры  

&После("ОбработкаОповещения")
&НаКлиенте
Процедура бит_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Первыйбит ЛТ1.1 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 + 
	Если ИмяСобытия = "бит_ЗаписьАтрибуты" Тогда
		Элементы.Группабит_Атрибуты.Обновить();	
	КонецЕсли;
	//Первыйбит ЛТ1.1 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	//Первыйбит ЛТ1.1 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 +
	ПараметрыФормы = Новый Структура;
	Если Не Копирование И Не Группа Тогда
		Отказ = Истина;
		ПараметрыФормы.Вставить("Источник", Объект.Ссылка);
		ОбработчикЗакрытия = Новый ОписаниеОповещения("Список_ОбработкаЗакрытияФормы", ЭтаФорма);
		ОткрытьФорму("РегистрСведений.бит_ЗначенияАтрибутовКонтрагентов.ФормаЗаписи", ПараметрыФормы, ЭтаФорма,,,, ОбработчикЗакрытия);	
	КонецЕсли;
    //Первыйбит ЛТ1.1 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
	
КонецПроцедуры

&НаКлиенте
Процедура Список_ОбработкаЗакрытияФормы(РезультатОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	//Первыйбит ЛТ1.1 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 +
    ЭтаФорма.ОбновитьОтображениеДанных();
    //Первыйбит ЛТ1.1 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025 -
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаписатьКонтрагентаПартнера")
&НаСервере
Процедура бит_ЗаписатьКонтрагентаПартнера()
	
	СоздатьКонтрагента = КонтрагентПартнера.Пустая();
	
	Если СоздатьКонтрагента Тогда
		КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	Иначе
		КонтрагентОбъект = КонтрагентПартнера.ПолучитьОбъект();
	КонецЕсли;
	
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, КонтрагентОбъект);
	
	КонтрагентОбъект.Наименование = Объект.Наименование;
	КонтрагентОбъект.НаименованиеПолное        = Объект.НаименованиеПолное;
	КонтрагентОбъект.НаименованиеМеждународное = НаименованиеМеждународное;  
	КонтрагентОбъект.НаименованиеВТранскрипции = НаименованиеВТранскрипции;
	КонтрагентОбъект.Партнер                   = Объект.Ссылка;
	КонтрагентОбъект.ЮрФизЛицо                 = ЮрФизЛицо;
	КонтрагентОбъект.ОбособленноеПодразделение = ОбособленноеПодразделение;
	КонтрагентОбъект.СтранаРегистрации         = СтранаРегистрации;
	КонтрагентОбъект.РегистрационныйНомер      = РегистрационныйНомер;
	КонтрагентОбъект.НалоговыйНомер            = НалоговыйНомер;
	КонтрагентОбъект.ИНН                       = ИНН;
	КонтрагентОбъект.ИсторияНаименований.Загрузить(ИсторияНаименований.Выгрузить()); 
	#Вставка
	//Первыйбит ЛТ1 ЛапшовГ "GVLapshov@1cbit.ru" 31.01.2025 
	КонтрагентОбъект.бит_НаименованиеСФормойСобственности =  ЭтаФорма.бит_НаименованиеСФормойСобственности;    
	КонтрагентОбъект.бит_ФормаСобственности =  ЭтаФорма.бит_ФормаСобственности; 
	КонтрагентОбъект.бит_Зона =  ЭтаФорма.бит_Зона;
	КонтрагентОбъект.бит_ИДКлиента =  ЭтаФорма.бит_ИДКлиента; 
	//Первыйбит ЛТ1 ЛапшовГ "GVLapshov@1cbit.ru" 31.01.2025 -
    #КонецВставки  
	
	Если Не ЗначениеЗаполнено(ГоловнойКонтрагент) И Не ОбособленноеПодразделение Тогда
		
		Если СоздатьКонтрагента Тогда
			НоваяСсылка = Справочники.Контрагенты.ПолучитьСсылку();
			КонтрагентОбъект.УстановитьСсылкуНового(НоваяСсылка);
			ГоловнойКонтрагент = КонтрагентОбъект.ПолучитьСсылкуНового();
		Иначе
			ГоловнойКонтрагент = КонтрагентПартнера;
		КонецЕсли;
		
	КонецЕсли;
	КонтрагентОбъект.ГоловнойКонтрагент = ГоловнойКонтрагент;
	ПартнерыИКонтрагенты.ЗаполнитьКонтактнуюИнформациюКонтрагентаПартнера(КонтрагентОбъект, ЭтотОбъект, Объект.КонтактнаяИнформация);
	ПартнерыИКонтрагентыЛокализация.ПередЗаписьюКонтрагентаПартнера(КонтрагентОбъект, ЭтаФорма);
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереКонтрагент(ЭтотОбъект, КонтрагентОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	КонтрагентОбъект.Записать();
	
	КонтрагентПартнера = КонтрагентОбъект.Ссылка;
	
КонецПроцедуры 
