////////////////////////////////////////////////////////////////////////////////
// Модуль содержит методы работы с механизмом общих переменных.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает значение общей переменной.
// 
// Параметры:
//  ИмяПараметра - Строка - Имя переменной.
// 
// Возвращаемое значение:
//  Произвольный.
// 
Функция ЗначениеПеременной(ИмяПараметра) Экспорт
	
	НайденноеЗначение = Неопределено;
	
	НайденноеЗначение = бит_ОбщегоНазначенияПовтИсп.ЗначениеПеременной(ИмяПараметра);
		
	Возврат НайденноеЗначение;
	
КонецФункции

// Устанавливает значение переменной в кэш общих значений. 
// 
// Параметры:
//  ИмяПеременной      - Строка.
//  ЗначениеПеременной - Произвольный.
//  Обновлять          - Булево (По умолчанию = Истина.
// 
Процедура ЗначениеПеременнойУстановить(ИмяПеременной, ЗначениеПеременной, Обновлять = Истина) Экспорт

	// Изменено значение общей переменной - сбрасываем повторно используемые значения.
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

#КонецОбласти
