
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
  	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРазрешитьРедактирование(Команда)
	
	ИзменитьРежимРедактирования();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьРежимРедактирования()

	Элементы.Список.ТолькоПросмотр       = НЕ Элементы.Список.ТолькоПросмотр;

	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ИзменитьРежимРедактирования()

&НаСервере
Процедура УправлениеЭлементамиФормы()

	ТекстЗаголовка = ?(Элементы.Список.ТолькоПросмотр,
					   НСтр("ru='Разрешить редактирование';en='Allow Editing'"),
					   НСтр("ru='Закончить редактирование';en='Finish Editing'"));
	
	Элементы.КомандаРазрешитьРедактирование.Заголовок = ТекстЗаголовка;

	ТекстЗаголовка = НСтр("ru='Показатели произвольных отчетов рекомендуется редактировать в элементах справочника ""Настройки произвольных отчетов"".';
						  |en='It is recommended to edit custom report indicators in items of the directory ""Random report settings""'");
	
	Элементы.ДекорацияРазрешитьРедактирование.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

