
&Вместо("ОписаниеФункцийАвтовыбораЗначенияСвойстваНоменклатуры")
Функция бит_ОписаниеФункцийАвтовыбораЗначенияСвойстваНоменклатуры()
	
	 Результат = ПродолжитьВызов();

    // Вариант 1: для всех свойств типа Строка
	//Описание = СоздатьОписаниеФункцииАвтовыбора(
	//    "ОпределитьЦветПоАртикулу",                // имя функции
	//    "",                                        // модуль, пусто = текущий модуль
	//    НСтр("ru = 'Определить цвет по артикулу'"),
	//    Тип("Строка")                              // что возвращает функция
	//);
	//Результат.Добавить(Описание);

    // Вариант 2: только для конкретного свойства
    ПараметрыФункции = Новый Структура("ИмяСвойства", "ЦветКаркаса_50f05da1b832406cbf498f1997b778b1");
    Описание2 = СоздатьОписаниеФункцииАвтовыбора(
        "ОпределитьЦветПоЦветуФасада",
        "",
        НСтр("ru = 'Цвет по цвету фасада'"),
        Тип("СправочникСсылка.ЗначенияСвойствОбъектов"),
        ПараметрыФункции
    );
    Результат.Добавить(Описание2);

    Возврат Результат;

КонецФункции   

Функция ОпределитьЦветПоЦветуФасада(Параметры) Экспорт
    Возврат Параметры.ОсновноеИзделие.ЗначенияСвойств.Получить("ЦветФасада2");
КонецФункции
