#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ПорядокОформленияНакладныхОрдеров = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить();
	Если ПорядокОформленияНакладныхОрдеров = Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаОрдера Тогда
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	Иначе
		Отказ = Истина;
		ТекстСообщения = "Некорректно указан порядок оформления накладных,расходных ордеров!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Универсальные

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);  
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)  
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры  

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()    
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список); 
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры                              							  

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Элементы.Список); 
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры  

&НаКлиенте 
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
    // Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

#КонецОбласти

#КонецОбласти
