// {{**********************************}} //
// {{ ПервыйБИТ ЛистТребований 1.3.4.1 }} //
// {{ VUVaynula@1cbit.ru]			   }} //
// {{ 27.02.2025 21:22:50]			   }} //
// {{**********************************}}//

Процедура ПодпискаПриЗаписиРесурснойСпецификации(РесурснаяСпецификацияСсылка) Экспорт
	
	Если РесурснаяСпецификацияСсылка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.бит_КоэфицентыСпецификаций.СоздатьНаборЗаписей();
	НЗ.Отбор.РесурснаяСпецификация.Установить(РесурснаяСпецификацияСсылка);
	Если РесурснаяСпецификацияСсылка.ПометкаУдаления = Ложь Тогда  
		ОсновноеИзделиеНоменклатура 		= РесурснаяСпецификацияСсылка.ОсновноеИзделиеНоменклатура;    
		ОсновноеИзделиеУпаковка				= РесурснаяСпецификацияСсылка.ОсновноеИзделиеУпаковка;
		
		КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ОсновноеИзделиеУпаковка, ОсновноеИзделиеНоменклатура);  
		ОсновноеИзделиеКоличествоУпаковок 	= РесурснаяСпецификацияСсылка.ОсновноеИзделиеКоличествоУпаковок * КоэффициентУпаковки;
		ОсновноеИзделиеЕдиницаХранения = Справочники.УпаковкиЕдиницыИзмерения.ЕдиницаХраненияНоменклатуры(ОсновноеИзделиеНоменклатура);
		
		ТЧМатериалы = РесурснаяСпецификацияСсылка.МатериалыИУслуги.Выгрузить(); 
		Для каждого стр из ТЧМатериалы Цикл  
			запись = НЗ.Добавить();
			запись.ИДСтроки 				= стр.НомерСтроки;
			Запись.РесурснаяСпецификация	= РесурснаяСпецификацияСсылка;
			запись.НоменклатураРодитель 	= ОсновноеИзделиеНоменклатура; 
			запись.КоличествоРодитель 		= 1; // ОсновноеИзделиеКоличествоУпаковок;
			запись.ЕдиницаИзмеренияРодитель = ОсновноеИзделиеЕдиницаХранения;
			
			Номенклатура 		= стр.Номенклатура;
			ЕдиницаХранения 	= Справочники.УпаковкиЕдиницыИзмерения.ЕдиницаХраненияНоменклатуры(Номенклатура);
			КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(стр.Упаковка, Номенклатура);  
			
			запись.Номенклатура 			= Номенклатура;  
			запись.ЕдиницаИзмерения 		= ЕдиницаХранения;
			
			запись.КоличествоПозиций 		= (стр.бит_КоличествоПозиции * КоэффициентУпаковки) / ОсновноеИзделиеКоличествоУпаковок; 
			запись.КоэффициентУкрутки 		= стр.бит_КоэффициентУкрутки;
			запись.ТехОтходПроцент 			= стр.бит_ТехнологическийОтход;
			запись.АгрегирующийКоэффициент 	= стр.бит_АгрегирующийКоэффициент;
			запись.РасходСУчетомПотерь 		= (стр.КоличествоУпаковок * КоэффициентУпаковки) / ОсновноеИзделиеКоличествоУпаковок; 
			
		 	запись.ЕдиницаИзмерения 		= ЕдиницаХранения;   
		КонецЦикла;
		НЗ.Записать(); 
	Иначе
		//НЗ.Прочитать();
			НЗ.Записать();
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетОтходовНаСервере(РесурснаяСпецификацияОбъект) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] +        
	Перем РеквизитыСпецификацииЗаказа;
	
	ДеревоСпецификаций = новый ДеревоЗначений;
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТипаЧисло  = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 3));
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ВидыРаботСотрудников"));
	МассивТипов.Добавить(Тип("Строка"));
	ДеревоСпецификаций.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов(МассивТипов)); 
	
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.РесурсныеСпецификации"));
	МассивТипов.Добавить(Тип("СправочникСсылка.МаршрутныеКарты"));
	ДеревоСпецификаций.Колонки.Добавить("Спецификация", Новый ОписаниеТипов(МассивТипов));
	
	ДеревоСпецификаций.Колонки.Добавить("Количество"	, ОписаниеТипаЧисло);
	ДеревоСпецификаций.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ДеревоСпецификаций.Колонки.Добавить("ВидСтроки"		, Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСтрокДереваСпецификаций"));
	ДеревоСпецификаций.Колонки.Добавить("Идентификатор"	, Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	МассивТипов.Добавить(Тип("Строка"));
	ДеревоСпецификаций.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов(МассивТипов));
	
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Число"));
	МассивТипов.Добавить(Тип("Картинка"));
	ДеревоСпецификаций.Колонки.Добавить("ИндексКартинки", Новый ОписаниеТипов(МассивТипов,,, Новый КвалификаторыЧисла(10, 0)));
	
	ДеревоСпецификаций.Колонки.Добавить("ПроизводитсяВПроцессе"				, ОписаниеТипаБулево);
	ДеревоСпецификаций.Колонки.Добавить("ПрименениеМатериалаРедактирование"	, ОписаниеТипаСтрока);
	ДеревоСпецификаций.Колонки.Добавить("ХарактеристикиИспользуются"		, ОписаниеТипаБулево);
	ДеревоСпецификаций.Колонки.Добавить("СпособАвтовыбораНоменклатуры"		, Новый ОписаниеТипов("ПеречислениеСсылка.СпособыАвтовыбораНоменклатуры"));
	ДеревоСпецификаций.Колонки.Добавить("СпособАвтовыбораХарактеристики"	, Новый ОписаниеТипов("ПеречислениеСсылка.СпособыАвтовыбораХарактеристики"));
	ДеревоСпецификаций.Колонки.Добавить("КоличествоУпаковок"				, ОписаниеТипаЧисло);
	ДеревоСпецификаций.Колонки.Добавить("Упаковка"					, Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ДеревоСпецификаций.Колонки.Добавить("ЕстьСпецификация"			, ОписаниеТипаБулево);
	ДеревоСпецификаций.Колонки.Добавить("СпецификацияПрочитана"		, ОписаниеТипаБулево);
	ДеревоСпецификаций.Колонки.Добавить("СтруктураДанных");
	ДеревоСпецификаций.Колонки.Добавить("ВидНоменклатуры"			, Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	ДеревоСпецификаций.Колонки.Добавить("Склад"			, Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ДеревоСпецификаций.Колонки.Добавить("ВНаличии"		, ОписаниеТипаЧисло);
	ДеревоСпецификаций.Колонки.Добавить("Доступно"		, ОписаниеТипаЧисло);
	ДеревоСпецификаций.Колонки.Добавить("Уровень"		, Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10, 0)) );
	
	ДеревоДата = ТекущаяДатаСеанса();
			
	НастройкиОтбора = Новый Структура;
	
	НастройкиОтбора.Вставить("ДеревоВыводитьЭтапы",                Ложь);
	НастройкиОтбора.Вставить("ДеревоВыводитьОперации",             Ложь);
	НастройкиОтбора.Вставить("ДеревоВыводитьВыходныеИзделия",      Ложь);
	НастройкиОтбора.Вставить("ДеревоВыводитьМатериалы",            Истина);
	НастройкиОтбора.Вставить("ДеревоВыводитьТрудозатраты",         Ложь);
	НастройкиОтбора.Вставить("ДеревоВыводитьЗаголовкиГруппировок", Ложь);
	
	ОтображатьОстаткиТоваров = Ложь;
	ДинамическоеСчитывание = Ложь;
                           
	ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделиях.ПараметрыВыбораСпецификаций(Новый Структура(), Обработки.ДеревоРесурсныхСпецификаций);
	ПараметрыДерева = ПараметрыДереваСпецификаций(РесурснаяСпецификацияОбъект, ДеревоСпецификаций, НастройкиОтбора, ОтображатьОстаткиТоваров, РеквизитыСпецификацииЗаказа, ДинамическоеСчитывание, ДеревоДата, ПараметрыВыбораСпецификаций);

	ЗаполнитьДеревоСпецификаций(ПараметрыДерева, ДеревоСпецификаций);
	
	// обход дерева с целью посчитать
	ТаблицаИтоговая = РесурснаяСпецификацияОбъект.ВозвратныеОтходы.Выгрузить();
	ТаблицаИтоговая.Очистить(); 
	ТаблицаИтоговая.Колонки.Добавить("КоличествоУпаковокВсе", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 8)));
	КоэффициентУпаковкиОсновногоИзделия = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(РесурснаяСпецификацияОбъект.ОсновноеИзделиеУпаковка, РесурснаяСпецификацияОбъект.ОсновноеИзделиеНоменклатура);
	Коэффициент = КоэффициентУпаковкиОсновногоИзделия * РесурснаяСпецификацияОбъект.ОсновноеИзделиеКоличествоУпаковок;
	ОбработатьДеревоОбъект(ДеревоСпецификаций, Коэффициент, ТаблицаИтоговая);     
	ТаблицаИтоговая.Свернуть("Номенклатура, СпособАвтовыбораНоменклатуры, СпособАвтовыбораХарактеристики, Этап, Операция, Упаковка, СтатьяКалькуляции, КлючСвязи", "КоличествоУпаковок, КоличествоУпаковокВсе");        
	ТаблицаИтоговая.ЗаполнитьЗначения(Справочники.бит_ЗначенияПоУмолчанию.СтатьяКалькуляции_ВозвратныеОтходы.Значение, "СтатьяКалькуляции");
	ПоследнийЭтап = Справочники.ЭтапыПроизводства.ПустаяСсылка();  
	ПоследняяОперация = Справочники.ТехнологическиеОперации.ПустаяСсылка();
	ПолучитьПоследниеЭтапОперацияПоСпецификации(РесурснаяСпецификацияОбъект.Ссылка, ПоследнийЭтап, ПоследняяОперация);
	ТаблицаИтоговая.ЗаполнитьЗначения(ПоследнийЭтап		, "Этап");
	ТаблицаИтоговая.ЗаполнитьЗначения(ПоследняяОперация	, "Операция");
	УказываетсяВНСИ	= Перечисления.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ;	
	ТаблицаИтоговая.ЗаполнитьЗначения(УказываетсяВНСИ, "СпособАвтовыбораНоменклатуры");
	ТаблицаИтоговая.ЗаполнитьЗначения(УказываетсяВНСИ, "СпособАвтовыбораХарактеристики");
	РесурснаяСпецификацияОбъект.ВозвратныеОтходы.Очистить();	
	Для каждого стр из ТаблицаИтоговая Цикл
		Если стр.КоличествоУпаковокВсе < 0.001 Тогда  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для номенклатуры %1 значение отхода равно %2. Значение пропущено.", стр.Номенклатура, стр.КоличествоУпаковокВсе));
		Иначе
			нов = РесурснаяСпецификацияОбъект.ВозвратныеОтходы.Добавить();
			ЗаполнитьЗначенияСвойств(нов, стр);
			нов.КоличествоУпаковок = стр.КоличествоУпаковокВсе;
			нов.КлючСвязи = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	// }}ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] -
КонецПроцедуры 

Процедура ПолучитьПоследниеЭтапОперацияПоСпецификации(РесурснаяСпецификация, ПоследнийЭтап, ПоследняяОперация)
	// {{ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [11.03.2025 13:56:14] +        
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	ЭтапыПроизводства.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Этап
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ЭтапыПроизводства.НомерЭтапа) КАК НомерЭтапа,
		|		ЭтапыПроизводства.Владелец КАК Владелец
		|	ИЗ
		|		Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|	ГДЕ
		|		ЭтапыПроизводства.Владелец = &РесурснаяСпецификация
		|		И НЕ ЭтапыПроизводства.ПометкаУдаления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЭтапыПроизводства.Владелец) КАК влМаксЭтап
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ПО (влМаксЭтап.НомерЭтапа = ЭтапыПроизводства.НомерЭтапа)
		|			И (влМаксЭтап.Владелец = ЭтапыПроизводства.Владелец)
		|			И (НЕ ЭтапыПроизводства.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТехнологическиеОперации.Ссылка КАК Операция,
		|	ТехнологическиеОперации.Владелец КАК Этап 
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ТехнологическиеОперации.НомерОперации) КАК НомерОперации,
		|		ТехнологическиеОперации.Владелец КАК Владелец
		|	ИЗ
		|		Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|	ГДЕ
		|		ТехнологическиеОперации.Владелец В
		|				(ВЫБРАТЬ
		|					Этап.Ссылка
		|				ИЗ
		|					Этап КАК Этап)
		|		И НЕ ТехнологическиеОперации.ПометкаУдаления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТехнологическиеОперации.Владелец) КАК влОперация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ПО (ТехнологическиеОперации.Владелец = влОперация.Владелец)
		|			И (влОперация.НомерОперации = ТехнологическиеОперации.НомерОперации)
		|			И (НЕ ТехнологическиеОперации.ПометкаУдаления)
		|"); 
	Запрос.УстановитьПараметр("РесурснаяСпецификация", РесурснаяСпецификация);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ПоследнийЭтап 		= Результат.Этап;
		ПоследняяОперация	= Результат.Операция;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [11.03.2025 13:56:14] -
КонецПроцедуры

Функция ПараметрыДереваСпецификаций(РесурснаяСпецификацияОбъект, ДеревоСпецификаций, НастройкиОтбора, ОтображатьОстаткиТоваров, РеквизитыСпецификацииЗаказа, ДинамическоеСчитывание, ДеревоДата, ПараметрыВыбораСпецификаций)
	// {{ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] +        
	ПараметрНазначенияПодразделениеДиспетчер = Справочники.СтруктураПредприятия.ПустаяСсылка();
	ПараметрНазначенияНаправлениеДеятельности = Справочники.НаправленияДеятельности.ПустаяСсылка();
    ДеревоХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	ДеревоНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	
	ПараметрыДерева = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыДереваСпецификаций();
	
	Если ДеревоСпецификаций.Строки.Количество() <> 0 Тогда
		Строка = ДеревоСпецификаций.Строки[0];
		ПараметрыДерева.Номенклатура               = Строка.Номенклатура;
		ПараметрыДерева.ХарактеристикаНоменклатуры = Строка.Характеристика;
		ПараметрыДерева.Спецификация               = Строка.Спецификация;
	Иначе
		ПараметрыДерева.Номенклатура               = ДеревоНоменклатура;
		ПараметрыДерева.ХарактеристикаНоменклатуры = ДеревоХарактеристикаНоменклатуры;
		ПараметрыДерева.Спецификация               = РесурснаяСпецификацияОбъект.Ссылка;
	КонецЕсли;
	
	ПараметрыДерева.ПараметрыВыбораСпецификаций  = ПараметрыВыбораСпецификаций;
	
	ПараметрыДерева.Дата                         = ДеревоДата;
	ПараметрыДерева.ПодразделениеДиспетчер       = ПараметрНазначенияПодразделениеДиспетчер;
	ПараметрыДерева.НаправлениеДеятельности      = ПараметрНазначенияНаправлениеДеятельности;
	
	ПараметрыДерева.ДинамическоеСчитывание       = ДинамическоеСчитывание;
	
	УправлениеДаннымиОбИзделиях.ЗаполнитьНастройкиОтбораДереваСпецификации(ПараметрыДерева, НастройкиОтбора);

	ПараметрыДерева.РазузловыватьПолуфабрикаты = Истина;
	
	ПараметрыДерева.Свойство("КоличествоВыходногоИзделия",         ПараметрыДерева.КоличествоВыходногоИзделия);
	ПараметрыДерева.Свойство("КоличествоУпаковокВыходногоИзделия", ПараметрыДерева.КоличествоУпаковокВыходногоИзделия);
	ПараметрыДерева.Свойство("УпаковкаВыходногоИзделия",           ПараметрыДерева.УпаковкаВыходногоИзделия);
	
	ПараметрыДерева.ВыводитьОстаткиТоваров = ОтображатьОстаткиТоваров;
	
	Возврат ПараметрыДерева;
	// }}ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] -
КонецФункции

Процедура ЗаполнитьДеревоСпецификаций(ПараметрыДерева, Дерево)
	// {{ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] +
	Дерево.Строки.Очистить();
	
	КлючСвязи = Неопределено;
	НоваяСтрокаДерева = Неопределено;
	
	ИспользованныеСпецификации = Неопределено;
	
	Номенклатура               = ПараметрыДерева.Номенклатура;
	ХарактеристикаНоменклатуры = ПараметрыДерева.ХарактеристикаНоменклатуры;
	
	ПараметрыВыбораИзготовлениеСборка = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыВыбораСпецификацийНаИзготовлениеСборку();
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		НоваяСтрокаДерева = Дерево.Строки.Добавить(); // см. УправлениеДаннымиОбИзделияхКлиентСервер.СтрокаДереваСпецификацийСтруктурой
		НоваяСтрокаДерева.Идентификатор  = Новый УникальныйИдентификатор;
		НоваяСтрокаДерева.ВидСтроки      = Перечисления.ВидыСтрокДереваСпецификаций.Номенклатура;
		НоваяСтрокаДерева.ИндексКартинки = ПолучитьИндексКартинки(НоваяСтрокаДерева.ВидСтроки);
		
		НоваяСтрокаДерева.Номенклатура   = Номенклатура;
		НоваяСтрокаДерева.Характеристика = ХарактеристикаНоменклатуры;
		
		// Проверяем используются характеристики или нет.
		РезультатПроверки = Справочники.Номенклатура.ХарактеристикаИУпаковкаПринадлежатВладельцу(
			НоваяСтрокаДерева.Номенклатура,
			НоваяСтрокаДерева.Характеристика,
			Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
		НоваяСтрокаДерева.ХарактеристикиИспользуются = РезультатПроверки.ХарактеристикиИспользуются;
		
		НоваяСтрокаДерева.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ЕдиницаИзмерения");
		
		Если Не ЗначениеЗаполнено(ПараметрыДерева.Спецификация) Тогда
			
			ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СтруктураДанныхОбИзделииДляВыбораСпецификации();
			ДанныеОбИзделии.Номенклатура            = Номенклатура;
			ДанныеОбИзделии.Характеристика          = ХарактеристикаНоменклатуры;
			ДанныеОбИзделии.НачалоПроизводства      = ПараметрыДерева.Дата;
			ДанныеОбИзделии.ПодразделениеДиспетчер  = ПараметрыДерева.ПодразделениеДиспетчер;
			ДанныеОбИзделии.НаправлениеДеятельности = ПараметрыДерева.НаправлениеДеятельности;
			
			ДанныеСпецификации = УправлениеДаннымиОбИзделияхВызовСервера.СпецификацияИзделия(
				ДанныеОбИзделии, ПараметрыВыбораИзготовлениеСборка);
			
			Если НЕ ЗначениеЗаполнено(ДанныеСпецификации) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Не найдена спецификация для изделия.';
						|en = 'BOM for the item is not found.'"),
					,
					"ДеревоСпецификаций");
				Возврат;
			КонецЕсли;
			
			НоваяСтрокаДерева.Спецификация = ДанныеСпецификации.Спецификация;
		Иначе
			НоваяСтрокаДерева.Спецификация = ПараметрыДерева.Спецификация;
		КонецЕсли;
		
		// Режим по спецификации заказа
		Если ЗначениеЗаполнено(ПараметрыДерева.АдресВХранилище) Тогда
			
			НоваяСтрокаДерева.Количество         = ПараметрыДерева.КоличествоВыходногоИзделия;
			НоваяСтрокаДерева.КоличествоУпаковок = ПараметрыДерева.КоличествоУпаковокВыходногоИзделия;
			НоваяСтрокаДерева.Упаковка           = ПараметрыДерева.УпаковкаВыходногоИзделия;
			
			КлючСвязи                            = ПараметрыДерева.КлючСвязи;
			
		ИначеЕсли ЗначениеЗаполнено(ПараметрыДерева.КоличествоУпаковокВыходногоИзделия) Тогда
			
			НоваяСтрокаДерева.Количество         = ПараметрыДерева.КоличествоВыходногоИзделия;
			НоваяСтрокаДерева.КоличествоУпаковок = ПараметрыДерева.КоличествоУпаковокВыходногоИзделия;
			НоваяСтрокаДерева.Упаковка           = ПараметрыДерева.УпаковкаВыходногоИзделия;
			
		Иначе
			
			ДанныеОсновногоИзделия = Справочники.РесурсныеСпецификации.ДанныеОсновногоИзделияСпецификации(
				НоваяСтрокаДерева.Спецификация,
				Номенклатура,
				ХарактеристикаНоменклатуры);
			
			Если ДанныеОсновногоИзделия.Номенклатура.Пустая() Тогда
				Возврат;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, ДанныеОсновногоИзделия, "Количество,КоличествоУпаковок,Упаковка");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НоваяСтрокаДерева.Упаковка) Тогда
			НоваяСтрокаДерева.Упаковка = НоваяСтрокаДерева.ЕдиницаИзмерения;
		КонецЕсли;
		
		НоваяСтрокаДерева.ЕстьСпецификация = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(ПараметрыДерева.Спецификация) Тогда
		
		НоваяСтрокаДерева = Дерево.Строки.Добавить(); // см. УправлениеДаннымиОбИзделияхКлиентСервер.СтрокаДереваСпецификацийСтруктурой
		НоваяСтрокаДерева.Идентификатор  = Новый УникальныйИдентификатор;
		НоваяСтрокаДерева.ИндексКартинки = ПолучитьИндексКартинки(НоваяСтрокаДерева.ВидСтроки);
		НоваяСтрокаДерева.ВидСтроки      = Перечисления.ВидыСтрокДереваСпецификаций.Номенклатура;
		
		ОсновноеИзделие = Справочники.РесурсныеСпецификации.ДанныеОсновногоИзделияСпецификации(ПараметрыДерева.Спецификация);
		
		Если ЗначениеЗаполнено(ОсновноеИзделие.Номенклатура) Тогда
			НоваяСтрокаДерева.Номенклатура    = ОсновноеИзделие.Номенклатура;
			НоваяСтрокаДерева.Характеристика  = ОсновноеИзделие.Характеристика;
		Иначе
			НоваяСтрокаДерева.ВидНоменклатуры = ОсновноеИзделие.ВидНоменклатуры;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(
			НоваяСтрокаДерева, ОсновноеИзделие, "Количество,КоличествоУпаковок,Упаковка,ЕдиницаИзмерения,ХарактеристикиИспользуются");
		
		Если Не ЗначениеЗаполнено(НоваяСтрокаДерева.Упаковка) Тогда
			НоваяСтрокаДерева.Упаковка = НоваяСтрокаДерева.ЕдиницаИзмерения;
		КонецЕсли;
		
		НоваяСтрокаДерева.ЕстьСпецификация = Истина;
		НоваяСтрокаДерева.Спецификация = ПараметрыДерева.Спецификация;
		
	КонецЕсли;
	
	ЕстьСпецификация = (НоваяСтрокаДерева <> Неопределено И НоваяСтрокаДерева.ЕстьСпецификация ИЛИ НоваяСтрокаДерева = Неопределено);
	
	Если Не ПараметрыДерева.ДинамическоеСчитывание И ЕстьСпецификация Тогда
		
		ИспользованныеСпецификации = Новый Массив;
		
		Если НоваяСтрокаДерева <> Неопределено Тогда
			ИспользованныеСпецификации.Добавить(НоваяСтрокаДерева.Спецификация);
		Иначе
			ИспользованныеСпецификации.Добавить(ПараметрыДерева.Спецификация);
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеДаннымиОбИзделиях.ЗаполнитьСтрокиДерева(ПараметрыДерева, Дерево, НоваяСтрокаДерева, ИспользованныеСпецификации, КлючСвязи);
	// }}ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] -	
КонецПроцедуры

Функция ПолучитьИндексКартинки(ВидСтроки, ЕстьСпецификация = Ложь)
	// {{ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] +
	// Этап
	Если ВидСтроки = Перечисления.ВидыСтрокДереваСпецификаций.Этап Тогда
		Возврат БиблиотекаКартинок.РедакторПроизводственногоПроцессаЭтап;
	// Операция
	ИначеЕсли ВидСтроки = Перечисления.ВидыСтрокДереваСпецификаций.Операция Тогда
		Возврат БиблиотекаКартинок.РедакторПроизводственногоПроцессаОперация;
	// Материал
	ИначеЕсли ВидСтроки = Перечисления.ВидыСтрокДереваСпецификаций.Материал И Не ЕстьСпецификация Тогда
		Возврат 2;
	// Трудозатрата
	ИначеЕсли ВидСтроки = Перечисления.ВидыСтрокДереваСпецификаций.Трудозатрата Тогда
		Возврат 3;
	// Выходное изделие
	ИначеЕсли ВидСтроки = Перечисления.ВидыСтрокДереваСпецификаций.ВыходноеИзделие И Не ЕстьСпецификация Тогда
		Возврат 4;
	// Полуфабрикат( материал )
	ИначеЕсли ВидСтроки = Перечисления.ВидыСтрокДереваСпецификаций.Материал И ЕстьСпецификация Тогда
		Возврат 7;
	// Полуфабрикат( выходное изделие )
	ИначеЕсли ВидСтроки = Перечисления.ВидыСтрокДереваСпецификаций.ВыходноеИзделие И ЕстьСпецификация Тогда
		Возврат 8;
	Иначе
		Возврат 10;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] -
КонецФункции

Функция ПолучитьСтрокуМатериалов(ТекСпецификация, Номенклатура)
	// {{ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] +
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	бит_КоэфицентыСпецификаций.Номенклатура КАК Номенклатура,
	                      |	бит_КоэфицентыСпецификаций.КоличествоПозиций КАК КоличествоПозиций,
	                      |	ВЫБОР
	                      |		КОГДА бит_КоэфицентыСпецификаций.КоэффициентУкрутки = 0
	                      |			ТОГДА 1
	                      |		ИНАЧЕ бит_КоэфицентыСпецификаций.КоэффициентУкрутки
	                      |	КОНЕЦ КАК КоэффициентУкрутки,
						  //|	бит_КоэфицентыСпецификаций.ТехОтходПроцент КАК ТехОтходПроцент,
						  //|	бит_КоэфицентыСпецификаций.АгрегирующийКоэффициент КАК АгрегирующийКоэффициент,
	                      |	бит_КоэфицентыСпецификаций.РасходСУчетомПотерь КАК РасходСУчетомПотерь,
	                      |	бит_КоэфицентыСпецификаций.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	                      |ИЗ
	                      |	РегистрСведений.бит_КоэфицентыСпецификаций КАК бит_КоэфицентыСпецификаций
	                      |ГДЕ
	                      |	бит_КоэфицентыСпецификаций.РесурснаяСпецификация = &РесурснаяСпецификация
	                      |	И бит_КоэфицентыСпецификаций.Номенклатура = &Номенклатура");
	Запрос.УстановитьПараметр("РесурснаяСпецификация", ТекСпецификация);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() = Ложь Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] -
КонецФункции

Процедура ОбработатьДеревоОбъект(ДеревоОбъект, Знач Коэффициент, ТаблицаИтоговая)   
	// {{ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] +
	
	Для каждого ТекСтрока Из ДеревоОбъект.Строки Цикл  
		Если Не ЗначениеЗаполнено(ТекСтрока.Спецификация)
			И ТекСтрока.ВидСтроки = Перечисления.ВидыСтрокДереваСпецификаций.Материал 
			И ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.Номенклатура")
			И ЗначениеЗаполнено(ТекСтрока.Номенклатура.бит_НоменклатураОтходов) Тогда
			
			Конструкт = 1;
			ОбщийРасход = 1;
			СтрокаАнализа = ТекСтрока;
			ТекСпецификация = ТекСтрока.Родитель.Спецификация;
			Пока Истина Цикл
				Если ТипЗнч(СтрокаАнализа.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
						СтрокаМатериала = ПолучитьСтрокуМатериалов(ТекСпецификация, СтрокаАнализа.Номенклатура);
						Если СтрокаМатериала <> Неопределено Тогда
							ТекКонструкт = СтрокаМатериала.КоличествоПозиций * СтрокаМатериала.КоэффициентУкрутки;
							ТекОбщийРасход = СтрокаМатериала.РасходСУчетомПотерь;
							Если ТекКонструкт <> 0 Тогда
								Конструкт = Конструкт * ТекКонструкт;
							КонецЕсли;
							Если ТекОбщийРасход <> 0 Тогда 
								ОбщийРасход = ОбщийРасход * ТекОбщийРасход;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;                            
					
				СтрокаАнализа = СтрокаАнализа.Родитель;
				Если СтрокаАнализа = Неопределено Тогда
					Прервать;
				КонецЕсли;                              
				Если СтрокаАнализа.Родитель <> Неопределено Тогда
					ТекСпецификация = СтрокаАнализа.Родитель.Спецификация;
				Иначе                                                    
					ТекСпецификация = СтрокаАнализа.Спецификация;
				КонецЕсли;
			КонецЦикла;
			Отход = (ОбщийРасход - Конструкт) * Коэффициент; 
				нов = ТаблицаИтоговая.Добавить(); 
				нов.Номенклатура = ТекСтрока.Номенклатура.бит_НоменклатураОтходов;
				нов.КоличествоУпаковокВсе = Отход;    
				нов.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ЕдиницаХраненияНоменклатуры(нов.Номенклатура);
		КонецЕсли; 
		ОбработатьДеревоОбъект(ТекСтрока, Коэффициент, ТаблицаИтоговая);
	КонецЦикла;    
	// }}ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [02.03.2025 19:43:47] -
КонецПроцедуры




