#Область ПрограммныйИнтерфейс

Функция ОпределитьСтавкуНДС(Всего, СуммаНДС) Экспорт
	
	Делитель = Всего - СуммаНДС;
	Если Делитель = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Ставка = Окр(СуммаНДС * 100 / Делитель);
	СтруктураСтавкиНДС = Новый Структура("Числом", Ставка);
	
	Если Ставка = 20 Тогда
		СтавкаСсылкой = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС",Перечисления.СтавкиНДС.НДС20);
	ИначеЕсли Ставка = 18 Тогда
		СтавкаСсылкой = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС",Перечисления.СтавкиНДС.НДС18);
	ИначеЕсли Ставка = 10 Тогда
		СтавкаСсылкой = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС",Перечисления.СтавкиНДС.НДС10);
	ИначеЕсли Ставка = 0 Тогда
		СтавкаСсылкой = Справочники.СтавкиНДС.БезНДС;
	Иначе
		СтавкаСсылкой = Неопределено;
	КонецЕсли;
	
	Если СтавкаСсылкой = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		СтруктураСтавкиНДС.Вставить("Ссылкой", СтавкаСсылкой);
		Возврат СтруктураСтавкиНДС;
	КонецЕсли;
	
КонецФункции

Функция СтавкаНДСПоРаспознанномуТексту(Ставка, ТекущееЗначение) Экспорт
	
	Если Ставка = "НДС20" Тогда
		Возврат Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС20);
	ИначеЕсли Ставка = "НДС18" Тогда
		Возврат Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС18);
	ИначеЕсли  Ставка = "НДС10" Тогда
		Возврат Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС10);
	ИначеЕсли Ставка = "НДС18_118" Тогда
		Возврат Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС18_118);
	ИначеЕсли Ставка = "НДС10_110" Тогда
		Возврат Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС10_110);
	ИначеЕсли Ставка = "НДС20_120" Тогда
		Возврат Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС20_120);
	ИначеЕсли Ставка = "НДС0" Тогда
		Возврат Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС0);
	ИначеЕсли Ставка = "БезНДС" Тогда
		Возврат Справочники.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	Возврат ТекущееЗначение;
	
КонецФункции

#КонецОбласти
