
&После("ОбработкаПроведения")
Процедура бит_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8.1] [ASHolyavko@1cbit.ru] [07.04.2026] +        
	
	Если Не Отказ Тогда
		ТаблицаДвижений_СебестоимостьТоваров = ЭтотОбъект.Движения.СебестоимостьТоваров.Выгрузить();
		Документы.ПеремещениеТоваров.бит_СформироватьДвижения(Ссылка, ТаблицаДвижений_СебестоимостьТоваров);	
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8.1] [ASHolyavko@1cbit.ru] [07.04.2026] -
	
КонецПроцедуры


&После("ОбработкаУдаленияПроведения")
Процедура бит_ОбработкаУдаленияПроведения(Отказ)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8.1] [ASHolyavko@1cbit.ru] [07.04.2026] +        
	
	Если Не Отказ Тогда
		
		ТаблицаДвижений_СтоимостьТМЦ_УУ = РегистрыНакопления.бит_СтоимостьТМЦ_УУ.ПолучитьТаблицуДляДвижений();
		
		НаборЗаписей = РегистрыНакопления.бит_СтоимостьТМЦ_УУ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Загрузить(ТаблицаДвижений_СтоимостьТМЦ_УУ);
		НаборЗаписей.Записать(); 
		
		ТаблицаДвижений_ВыручкаИСебестоимость_УУ = РегистрыНакопления.бит_ВыручкаИСебестоимость_УУ.ПолучитьТаблицуДляДвижений();
		
		НаборЗаписей = РегистрыНакопления.бит_ВыручкаИСебестоимость_УУ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Загрузить(ТаблицаДвижений_ВыручкаИСебестоимость_УУ);
		НаборЗаписей.Записать();
		
		НаборПроводок = Движения.бит_Бюджетирование;
		ЭтотОбъект.Движения.бит_Бюджетирование.Записывать = Истина;
		НаборПроводок.Отбор.Регистратор.Установить(Ссылка);
		НаборПроводок.Записать(Истина);	
				
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8.1] [ASHolyavko@1cbit.ru] [07.04.2026] -
	
КонецПроцедуры

