////////////////////////////////////////////////////////////////////////////////
// Модуль содержит методы работы с универсальными коллекциями значений.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция удаляет повторяющиеся элементы массива.
// 
Функция УдалитьПовторяющиесяЭлементыМассива(Массив, НеИспользоватьНеопределено = Ложь) Экспорт
	
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда	
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияБПВызовСервера");
		Массив = Модуль.УдалитьПовторяющиесяЭлементыМассива(Массив, НеИспользоватьНеопределено);                
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда	
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияУТ");
		Массив = Модуль.УдалитьПовторяющиесяЭлементыМассива(Массив, НеИспользоватьНеопределено);                
		
	КонецЕсли; 
	
	Возврат Массив;
	
КонецФункции // УдалитьПовторяющиесяЭлементыМассива()	

// Процедура находит по значению элемент массива и удаляет его.
// 
// Параметры:
//  МассивЭлементов - Массив
//  Значение 		- Строка
// 
Процедура УдалитьЭлементМассиваПоЗначению(МассивЭлементов, Значение) Экспорт

	Индекс = МассивЭлементов.Найти(Значение);
	Если Индекс <> Неопределено Тогда
		МассивЭлементов.Удалить(Индекс);	
	КонецЕсли;                               		

КонецПроцедуры // УдалитьЭлементМассиваПоЗначению()

// Устарела. Следует использовать ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу().
Процедура ЗагрузитьВТаблицуЗначений(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник);
	
КонецПроцедуры

// Функция созданиет копии структуры или соответствия.
// 
// Параментры:
//   СоответствиеИсточник - Структура/Соответствие - Исходная структура, с которой будет создаваться копия.
// 
// Возвращаемое значение:
//   Структура/Соответствие - Копия исходной структуры. Тип данных повторяет тип исходной структуры.
// 
Функция СоздатьКопиюСоответствияСтруктуры(Знач СоответствиеИсточник) Экспорт
	
	Если СоответствиеИсточник = Неопределено Тогда		
		Возврат Неопределено; 		
	КонецЕсли;
	
	КопияСоответствия = Новый (ТипЗнч(СоответствиеИсточник));
		
	Для Каждого ЭлементОтбора Из СоответствиеИсточник Цикл   				
		КопияСоответствия.Вставить(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);  				
	КонецЦикла;
	
	Возврат КопияСоответствия;
	
КонецФункции // СоздатьКопиюСоответствияСтруктуры()

// Процедура преобразовывает массив строк в массив чисел. 
// В случае невозможности преобразования элемента, элементу присваивается -1.
// 
// Параметры:
//  МассивСтрок - Массив
// 
Процедура ПреобразоватьМассивСтрокВЧисла(МассивСтрок) Экспорт
	
	Для й = 1 По МассивСтрок.Количество() Цикл
		
		Попытка			
			МассивСтрок[й-1] = Число(МассивСтрок[й-1]);			
		Исключение			
			МассивСтрок[й-1] = -1;			
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры

// Функция считает сумму по массиву чисел.
// 
// Параметры:
//  ВхМассив - Массив.
// 
// Возвращаемое значение:
//   Число.
// 
Функция ИтогПоМассиву(ВхМассив) Экспорт

	Результат = 0;
	
	Для каждого Элемент Из ВхМассив Цикл
	
		Если ТипЗнч(Элемент) = Тип("Число") Тогда		 
			Результат = Результат + Элемент;		 
		КонецЕсли; 
	
	КонецЦикла; 

	Возврат Результат;
	
КонецФункции

// Функция проверяет наличие колонки в колонках таблицы значений.
// 
// Параметры:
// ИмяКолонки - Строка.
// Колонки    - КолонкиТаблицыЗначений.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ЕстьКолонка(ИмяКолонки, Колонки) Экспорт

	Возврат Колонки.Найти(ИмяКолонки) <> Неопределено;

КонецФункции

#КонецОбласти

