
#Область ОписаниеПеременных

&НаКлиенте
Перем мТекущаяДатаНачалаПланирования; // Хранит текущую дату начала планирования.

&НаКлиенте
Перем мТекущаяДатаОкончанияПланирования; // Хранит текущую дату окончания планирования.

&НаКлиенте
Перем мТекущийРежимЗависимыхОборотов; // Хранит текущий режим зависимых оборотов.

&НаКлиенте
Перем мТекущаяЕдиницаИзмеренияСумм; // Хранит текущую единицу измерения сумм.

&НаКлиенте
Перем мБуфер; // Служит для передачи данных копирования.

&НаКлиенте 
Перем мКэшРеквизитовФормы; // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_УправлениеДоступомБФ.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.Обновление версии ИБ
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Обновление версии ИБ
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	 	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность =
			ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	ПрофДоступен =  бит_ОбщегоНазначения.СборкаДоступна("ПРОФ");
	Элементы.КомандаПолучениеДанныхБюджета.Видимость = ПрофДоступен;
	Элементы.КомандаКопированиеДанныхГрафиковДоговоров.Видимость = ПрофДоступен И Метаданные.РегистрыНакопления.Найти("бит_ГрафикиДоговоров") <> Неопределено;
	
	ПереключательЦеновойПолитики = Объект.ЗаполнятьПоЦенамНоменклатуры;

	ЭтоУХ = бит_ОбщегоНазначения.СборкаДоступна("УХ");
	Элементы.КомандаЗагрузитьИзПроформы.Видимость = ЭтоУХ;
	Элементы.КомандаДобавитьИзПроформы.Видимость = ЭтоУХ;		
	
	ПериодПланирования.ДатаНачала = Объект.ДатаНачалаПланирования;
	ПериодПланирования.ДатаОкончания = Объект.ДатаОкончанияПланирования;
	
	// Определим ид БДДС для установки в новой строке.
	ТабБДДС   = Объект.БДДС.Выгрузить();
	ТекИдБДДС = бит_Бюджетирование.ОпределитьТекущийИД(ТабБДДС,"ИД");
	
	ТекстЗапроса = Объект.НастройкаФормы.ТекстЗапроса;
	
	ЗаполнитьКэшЗначений();
	
	фИспользоватьНормы  = ПолучитьФункциональнуюОпцию("бит_ИспользоватьНормыВБюджетировании");
	фИменаПараметраНорм = ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ПодготовитьСтруктурыСвязи(Объект.ПараметрНорм);	
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		РежимКопирования   = Истина;
		ИсточникЗаполнения = Параметры.ЗначениеКопирования;
	Иначе
		РежимКопирования   = Ложь;
		ИсточникЗаполнения = Объект.Ссылка;
	КонецЕсли;
	
	ДанныеХранилищ = Документы.бит_ФормаВводаБюджета.ДанныеХранилищДокумента(ИсточникЗаполнения,
																			УникальныйИдентификатор,
																			РежимКопирования);
	ТабДокДанные                  = ДанныеХранилищ.ТабличныйДокумент;
	АдресХранилищаДанных          = ДанныеХранилищ.АдресХранилищаДанных;
	АдресХранилищаСпискаСмежности = ДанныеХранилищ.АдресХранилищаСпискаСмежности;
	
	МассивСтатей = ИзвлечьСтатьиИзДерева(ТабДокДанные);
	фКэшЗначений.НастройкиСтатей = Новый Соответствие;
    бит_Бюджетирование.ПолучитьНастройкиСтатейОборотов(МассивСтатей, фКэшЗначений.НастройкиСтатей);
	
	// Инициализация компоновщика, используемого для настройки отборов.
	АдресКомпоновки = Документы.бит_ФормаВводаБюджета.ИнициализироватьКомпоновщик(ТекстЗапроса, Компоновщик, Новый УникальныйИдентификатор);
	
	// Восстановление настроек построителя.
	Если НЕ РежимКопирования
		И Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.НастройкаФормы) Тогда
		Объект.ПараметрНорм = Объект.НастройкаФормы.ПараметрНорм;
		фИменаПараметраНорм = ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ПодготовитьСтруктурыСвязи(Объект.ПараметрНорм);		
		
		НастройкаОб = Объект.НастройкаФормы.ПолучитьОбъект();
		СохраненнаяНастройка = НастройкаОб.ПолучитьНастройкиПостроителя();
	Иначе	
		СохраненнаяНастройка = ДанныеХранилищ.НастройкиПостроителя;
	КонецЕсли; 
	
	ВосстановитьОтбор(СохраненнаяНастройка);
	
    УстановитьПараметрыВыбораСтатей();	
	
	// Элементы управления для измерений несуществующих в смежном решении	
	// создаются программно для унификации кода.
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправленияВкладкиОсновные(Элементы, Элементы.ГруппаДопАналитики);
	ПеренестиПроектВШапкуФормы();
	
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправления(Элементы, 
		"БДДС_Редактирование", "БДДС", Элементы.БДДС_РедактированиеКоличество);
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправления(Элементы, 
		"БДДС", "БДДС", Элементы.БДДСКоличество);
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправления(Элементы, 
		"ЗависимыеОбороты_Редактирование", "ЗависимыеОбороты", Элементы.ЗависимыеОбороты_РедактированиеКоличество);
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправления(Элементы, 
		"ЗависимыеОбороты", "ЗависимыеОбороты", Элементы.ЗависимыеОборотыКоличество);

	// Настроим отображение полей доп. аналитик в форме.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияНаФорме(ЭтотОбъект,
		фКэшЗначений.ИзмеренияДоп, фКэшЗначений.НастройкиИзмерений);
																				 
	// Отображение дополнительных измерений в табличных полях.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, 
		"БДДС_Редактирование", фКэшЗначений.ИзмеренияДоп, фКэшЗначений.НастройкиИзмерений);
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, 
		"БДДС", фКэшЗначений.ИзмеренияДоп, фКэшЗначений.НастройкиИзмерений);
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, 
		"ЗависимыеОбороты_Редактирование", фКэшЗначений.ИзмеренияДоп, фКэшЗначений.НастройкиИзмерений);
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, 
		"ЗависимыеОбороты", фКэшЗначений.ИзмеренияДоп, фКэшЗначений.НастройкиИзмерений);																				 
																	
	// Установка оформления таблиц БДДС и ЗависимыеОбороты.
	ИменаТаблиц = Новый Массив;  
	Если НЕ фСкрытьСтрокиБюджета Тогда 		
		ИменаТаблиц.Добавить("БДДС");		
	КонецЕсли; 
	ИменаТаблиц.Добавить("БДДС_Редактирование");
	ОФормитьТаблицу("БДДС", ИменаТаблиц, МассивСтатей);
	
	ИменаТаблиц = Новый Массив; 
	Если НЕ фСкрытьСтрокиБюджета Тогда 		
		ИменаТаблиц.Добавить("ЗависимыеОбороты"); 		
	КонецЕсли; 
	ИменаТаблиц.Добавить("ЗависимыеОбороты_Редактирование");
	ОФормитьТаблицу("ЗависимыеОбороты", ИменаТаблиц, МассивСтатей);																	
	УстановитьУсловноеОформление();
		
	УстановитьФорматЧисел();
	
	// Установка видимости колонок табличных полей БДДС_Редактирование И ЗависимыеОбороты_Редактирование.
	УправлениеВидимостьюКолонокТаблиц();
	
	// Установка текущей страницы
	Если ТабДокДанные.Области.Количество() > 0 Тогда	
		 Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаДанныеБюджета;	
	КонецЕсли; 
	
	// Проверка наличия зафиксированных бюджетных данных.
	Если Объект.Проведен Тогда
		УстановитьПривилегированныйРежим(Истина);
		бит_Бюджетирование.ПроверитьФиксациюВФорме(ЭтотОбъект, Объект.Ссылка, Истина);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	УправлениеМенюРасчеты(ЭтотОбъект);
	
	ПодготовитьФормуНаСервере(ИсточникЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мТекущаяДатаНачалаПланирования    = Объект.ДатаНачалаПланирования;
	мТекущаяДатаОкончанияПланирования = Объект.ДатаОкончанияПланирования;
	мТекущийРежимЗависимыхОборотов    = Объект.РежимЗависимыхОборотов;
	ТекущаяНастройкаФормы            = Объект.НастройкаФормы;
	мТекущаяЕдиницаИзмеренияСумм      = Объект.ЕдиницаИзмеренияСумм;
	
	мКэшРеквизитовФормы = Новый Соответствие;
	Для Каждого КиЗ Из фКэшЗначений.НастройкиИзмерений Цикл
		мКэшРеквизитовФормы.Вставить(КиЗ.Ключ);
	КонецЦикла; 
	мКэшРеквизитовФормы.Вставить("ВалютаДокумента");
	мКэшРеквизитовФормы.Вставить("Сценарий");		
	мКэшРеквизитовФормы.Вставить("ПараметрНорм");
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// АПК:278-выкл Проектное решение вызвать функционал другой подсистемы.
	ОбщегоНазначенияСлужебныйКлиент.УстановитьВидимостьПанелиПоказателей(Элементы, РазвернутьОбластьПоказателей);
	ОбщегоНазначенияСлужебныйКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТабДокДанные");
	// АПК:278-вкл
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = УникальныйИдентификатор Тогда
		
		Если ИмяСобытия = "ИзмененСтатус" Тогда	        
	        ОбработкаОповещенияИзмененияСтатуса();	        
	    ИначеЕсли ИмяСобытия = "ВыбратьПериодЗавершение" Тогда		        
	        РедактированиеПериодаЗавершение(Параметр.Результат, Неопределено);	        
	    ИначеЕсли ИмяСобытия = "ВосстановитьЗагруженныеИзExcelДанные" Тогда	        
	        ВосстановитьЗагруженныеИзExcelДанные(Параметр.ИмяТабЧасти, Параметр.Ссылка);			
		ИначеЕсли ИмяСобытия = "УстановитьЗагруженныеДанные" Тогда // NB Возможно события более не существует. Проверить в 3.1.52.	        
	        ОчиститьТаблицы(ЭтотОбъект);
    		УстановитьЗагруженныеДанные(Параметр.ЗагружаемыеДанные);
    		Модифицированность = Истина;
		ИначеЕсли ИмяСобытия = "ПолучениеДанныхБюджета" Тогда			
			ОбработкаПодбораБюджета(Параметр);			
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	НаименованиеТаблицы = НСтр("ru = 'БДДС'; en = 'BDDS'");
	бит_УправлениеДоступомБФ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект.БДДС, НаименованиеТаблицы);
	
	Если фКэшЗначений <> Неопределено Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность =
			ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект,
																						ТекущийОбъект,
																						ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	// Сохранение дерева данных.
	бит_БюджетированиеКлиентСервер.ОчиститьВыделениеАргументов(ТабДокДанные, фВыделенныеОбласти);
	ТекущийОбъект.СохранитьДерево(ТабДокДанные);
	
	// Сохранение отбора построителя.
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("НастройкиКомпоновщика", Компоновщик.ПолучитьНастройки());
	ТекущийОбъект.СохранитьНастройкиПостроителя(СтруктураНастройки);
	
	ТекущийОбъект.СохранитьДанныеВХранилище(АдресХранилищаДанных);
	
	ТекущийОбъект.СохранитьСписокСмежностиВХранилище(АдресХранилищаСпискаСмежности);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ОбработатьПереносТЧВРегистр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#Если НЕ ВебКлиент Тогда
		Элементы.ТабДокДанные.ТекущаяОбласть = Неопределено;
	#КонецЕсли
	
	Оповестить("ЗаписанДокументФормаВводаБюджета", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Состояние кнопки Отбор.
	Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Пометка = фУстанавливатьОтборЗависимых;
	УстановитьКартинкуКнопкиОтбор();	
	
	ВидимостьСтрокБюджета();
	ПереключитьПолноэкранныйРежим();
	ПереключитьПодробныеДанные();
	
	Элементы.ФормаКомандаАвтовидимостьКолонок.Пометка = АвтовидимостьКолонок;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_ФормаВводаБюджета";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	Открытьформу("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормыПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("НастройкаФормыПриИзмененииЗавершение", ЭтотОбъект); 
	ЗадатьВопросОбОчисткеДанных(Оповещение);
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура НастройкаФормыПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ИзменениеНастройкиФормы();
	Иначе	
		Объект.НастройкаФормы = ТекущаяНастройкаФормы;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	ПересчитатьСуммы   = Ложь;
	ПерезаполнитьНормы = Ложь;
	
	РезАнализ = АнализИзмененийСценария(мКэшРеквизитовФормы["Сценарий"]);
	
	Если РезАнализ.МожноИзменятьСценарий Тогда
		
		// Сценарий можно изменить без очистки данных.
		ИзменитсяВалюта = РезАнализ.ИзменитсяВалюта;
		СпроситьОНормах = ?(фИспользоватьНормы И Объект.БДДС.Количество() > 0 И ЗначениеЗаполнено(Объект.ПараметрНорм), Истина, Ложь);
		
		Если ИзменитсяВалюта ИЛИ СпроситьОНормах Тогда
			Оповещение = Новый ОписаниеОповещения("СценарийВопросЗавершение", ЭтотОбъект);
			РежимОкна  = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
			ПараметрыФормы = Новый Структура("ИзменитсяВалюта, СпроситьОНормах", ИзменитсяВалюта, СпроситьОНормах);
			ОткрытьФорму("ОбщаяФорма.бит_ВопросПриИзмененииСценария", ПараметрыФормы, ЭтотОбъект,,,,Оповещение, РежимОкна);
		Иначе
			Если ЗначениеЗаполнено(Объект.Сценарий) Тогда
				ИзменениеСценария(ПересчитатьСуммы, ПерезаполнитьНормы);
				ДобавитьВКэш("Сценарий");
				ДобавитьВКэш("ВалютаДокумента");				
			КонецЕсли;
		КонецЕсли; 
	Иначе	
		
		Если фКэшЗначений.НастройкиФормы.ФиксированныйМакет Тогда
			ВывестиСообщениеНесовпадениеПериодичности();
			ИзвлечьИзКэша("Сценарий");
			Возврат;
		Иначе	
			Если Объект.БДДС.Количество() > 0 Тогда
				// Необходимо очистить данные, т.к. не совпадают периодичности.
				Оповещение = Новый ОписаниеОповещения("СценарийОчисткаВопросЗавершение", ЭтотОбъект);
				ТекстСообщения = НСтр("ru='Данные будут очищены. Продолжить?';en='Data will be cleared. Continue?'");
				ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
			Иначе	
		        ИзменениеСценарияОчисткаДанных();	
				ДобавитьВКэш("Сценарий");				
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "СценарийВопросЗавершение".
// 
// Параметры:
// РезСтруктура - Структура
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура СценарийВопросЗавершение(РезСтруктура, ДополнительныеПараметры) Экспорт
	
	ПересчитатьСуммы   = Ложь;
	ПерезаполнитьНормы = Ложь;
	
	Если ТипЗнч(РезСтруктура) = Тип("Структура") Тогда
		ПересчитатьСуммы   = РезСтруктура.ПересчитатьСуммы;
		ПерезаполнитьНормы = РезСтруктура.ПерезаполнитьНормы;
	Иначе	
		ИзвлечьИзКэша("Сценарий");
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Сценарий) Тогда
		ИзменениеСценария(ПересчитатьСуммы, ПерезаполнитьНормы);
	КонецЕсли;	
	ДобавитьВКэш("Сценарий");
	
КонецПроцедуры	

// Процедура обработчик оповещения "СценарийОчисткаВопросЗавершение".
// 
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура СценарийОчисткаВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ИзменениеСценарияОчисткаДанных();
		ДобавитьВКэш("Сценарий");
		ДобавитьВКэш("ВалютаДокумента");
	Иначе	
		ИзвлечьИзКэша("Сценарий");
	КонецЕсли; 
	
КонецПроцедуры	

&НаКлиенте
Процедура ПараметрНормНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоВалюты", Истина);
	
	ОткрытьФорму("ПланВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

// Процедура обработчик оповещения "ВопросЗаменаЗначенияПоУмолчаниюЗавершение".
// 
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура ВопросЗаменаЗначенияПоУмолчаниюЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		РезДействие = "Замена";
	Иначе
		РезДействие = "Отмена";
	КонецЕсли; 
	
	ИмяЭлемента = ДополнительныеДанные.Имя;
	Если РезДействие = "Отмена" Тогда
		Объект[ИмяЭлемента] = мКэшРеквизитовФормы[ИмяЭлемента];
		Возврат;
	КонецЕсли; 
	
	ВыполнитьЗамену = ?(РезДействие = "Замена", Истина, Ложь);
	Если ВыполнитьЗамену Тогда
		ВыполнитьЗаменуАналитикиПоУмолчанию(ИмяЭлемента, Объект[ИмяЭлемента]);
	КонецЕсли;
	
	мКэшРеквизитовФормы[ИмяЭлемента] = Объект[ИмяЭлемента];
	
КонецПроцедуры	

&НаКлиенте
Процедура СтатьяОборотовПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтатьяОборотов) Тогда
		ИзменениеСтатьиШапка();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	Если (Объект.БДДС.Количество() > 0 ИЛИ Объект.ЗависимыеОбороты.Количество() > 0 ) 
		   И Объект.ВалютаДокумента <> мКэшРеквизитовФормы["ВалютаДокумента"] Тогда
		   
		Оповещение = Новый ОписаниеОповещения("ВалютаДокументаВопросЗавершение", ЭтотОбъект);   
		ТекстВопроса = НСтр("ru='Изменена валюта документа. Пересчитать суммы в документе?';
						 	|en='Currency of the document was changed. Recalculate document total?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 15, КодВозвратаДиалога.Отмена);
	Иначе	
		ИзменениеВалюты(Ложь, мКэшРеквизитовФормы["ВалютаДокумента"]);
		ДобавитьВКэш("ВалютаДокумента");	
	КонецЕсли; 
		
КонецПроцедуры

// Процедура обработчик оповещения "ВалютаДокументаВопросЗавершение".
// 
// Параметры:
// Результат - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура ВалютаДокументаВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ИзменениеВалюты(Истина, мКэшРеквизитовФормы["ВалютаДокумента"]);
		ДобавитьВКэш("ВалютаДокумента");	
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ИзменениеВалюты(Ложь, мКэшРеквизитовФормы["ВалютаДокумента"]);
		ДобавитьВКэш("ВалютаДокумента");	
	Иначе	 
		ИзвлечьИзКэша("ВалютаДокумента");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияДатаНачалаПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ПериодПланированияДатаНачалаПриИзмененииЗавершение", ЭтотОбъект); 
	Объект.ДатаНачалаПланирования = ПериодПланирования.ДатаНачала;
	
	ЗадатьВопросОбОчисткеИзмененииДанных(Оповещение);	 
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПериодПланированияДатаНачалаПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		// Выполнение по согласию пользователя.
		ОчиститьВсе(ЭтотОбъект);
		мТекущаяДатаНачалаПланирования = Объект.ДатаНачалаПланирования;
		ОбновитьКурсСервер();
	ИначеЕсли Результат = "Перезаполнить" Тогда
		ИзменитьПериодыТаблиц(мТекущаяДатаНачалаПланирования, мТекущаяДатаОкончанияПланирования);
		мТекущаяДатаНачалаПланирования = Объект.ДатаНачалаПланирования;
		ОбновитьКурсСервер();
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена	ИЛИ Результат = КодВозвратаДиалога.Таймаут Тогда
		// Отказ от выполнения.
		Объект.ДатаНачалаПланирования = мТекущаяДатаНачалаПланирования;
	КонецЕсли; 
	
	ПериодПланирования.ДатаНачала = Объект.ДатаНачалаПланирования;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияДатаОкончанияПриИзменении(Элемент)
	
	Объект.ДатаОкончанияПланирования = ПериодПланирования.ДатаОкончания;
	Оповещение = Новый ОписаниеОповещения("ПериодПланированияДатаОкончанияПриИзмененииЗавершение", ЭтотОбъект); 
	ЗадатьВопросОбОчисткеИзмененииДанных(Оповещение);
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПериодПланированияДатаОкончанияПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		// Выполнение с согласия пользователя.
		ОчиститьВсе(ЭтотОбъект);
		мТекущаяДатаОкончанияПланирования = Объект.ДатаОкончанияПланирования;
	ИначеЕсли Результат = "Перезаполнить" Тогда
		ИзменитьПериодыТаблиц(мТекущаяДатаНачалаПланирования, мТекущаяДатаОкончанияПланирования);
		мТекущаяДатаОкончанияПланирования = Объект.ДатаОкончанияПланирования;
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена	ИЛИ Результат = КодВозвратаДиалога.Таймаут Тогда
		// Отказ от выполнения.
		Объект.ДатаОкончанияПланирования = мТекущаяДатаОкончанияПланирования;		
	КонецЕсли; 
	
	ПериодПланирования.ДатаОкончания = Объект.ДатаОкончанияПланирования;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗависимыхОборотовПриИзменении(Элемент)
	
	Очистить = Истина;
	Если Объект.ЗависимыеОбороты.Количество() > 0 Тогда
		Если Объект.РежимЗависимыхОборотов = ПредопределенноеЗначение("Перечисление.бит_РежимыЗависимыхОборотов.НеФормировать") Тогда
            РежимДиалога     = РежимДиалогаВопрос.ОКОтмена;
			ОтветПоУмолчанию = КодВозвратаДиалога.ОК;
		Иначе	
            РежимДиалога     = РежимДиалогаВопрос.ДаНетОтмена;	
			ОтветПоУмолчанию = КодВозвратаДиалога.Да;
		КонецЕсли; 
		Оповещение = Новый ОписаниеОповещения("РежимЗависимыхОборотовВопросЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Изменен режим зависимых оборотов. Очистить сформированные зависимые обороты?';
							|en='Dependent turnovers mode changed. Clear generated dependent turnovers?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалога, 15, ОтветПоУмолчанию); 
	Иначе	
		РежимЗависимыхОборотовИзменение(Очистить);
		мТекущийРежимЗависимыхОборотов = Объект.РежимЗависимыхОборотов;
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "РежимЗависимыхОборотовВопросЗавершение".
// 
// Параметры:
// Результат - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура РежимЗависимыхОборотовВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Очистить = Истина;
	Если Результат = КодВозвратаДиалога.Да ИЛИ Результат = КодВозвратаДиалога.ОК Тогда
		РежимЗависимыхОборотовИзменение(Очистить);
		мТекущийРежимЗависимыхОборотов = Объект.РежимЗависимыхОборотов;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Очистить = Ложь;
		Если Объект.РежимЗависимыхОборотов = ПредопределенноеЗначение("Перечисление.бит_РежимыЗависимыхОборотов.НеФормировать") Тогда
			Очистить = Истина;	
		КонецЕсли; 
		РежимЗависимыхОборотовИзменение(Очистить);
		мТекущийРежимЗависимыхОборотов = Объект.РежимЗависимыхОборотов;
	Иначе	
		Объект.РежимЗависимыхОборотов = мТекущийРежимЗависимыхОборотов;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияСуммПриИзменении(Элемент)
	
	Если мТекущаяЕдиницаИзмеренияСумм <> Объект.ЕдиницаИзмеренияСумм
		 И Объект.БДДС.Количество() > 0 Тогда
		
		ТекстСообщения = НСтр("ru='Изменилась единица измерения сумм. Пересчитать суммы в документе?';
							  |en='Unit of measuring the totals was changed. Recalculate documents’s total?'");
		ТекстЗаголовка = НСтр("ru='Изменение единицы измерения сумм';
							  |en='Change units of measuring the totals'");
		
		Оповещение = Новый ОписаниеОповещения("ЕдиницаИзмеренияВопросЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНетОтмена, 15, КодВозвратаДиалога.Отмена, ТекстЗаголовка); 
		
	КонецЕсли;
	УстановитьФорматЧиселКлиент();
	
КонецПроцедуры

// Процедура обработчик оповещения "ЕдиницаИзмеренияВопросЗавершение".
// 
// Параметры:
// Результат - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура ЕдиницаИзмеренияВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьПересчетРазмерностиСумм(мТекущаяЕдиницаИзмеренияСумм);
		мТекущаяЕдиницаИзмеренияСумм = Объект.ЕдиницаИзмеренияСумм;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		мТекущаяЕдиницаИзмеренияСумм = Объект.ЕдиницаИзмеренияСумм;
		УстановитьФорматЧисел();	
	Иначе
		Объект.ЕдиницаИзмеренияСумм = мТекущаяЕдиницаИзмеренияСумм;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательЦеновойПолитикиПриИзменении(Элемент)
	
	Объект.ЗаполнятьПоЦенамНоменклатуры = ПереключательЦеновойПолитики;
	
	УправлениеФормой();
	
	Если Объект.ЗаполнятьПоЦенамНоменклатуры
		И НЕ ЗначениеЗаполнено(Объект.ТипЦен) Тогда
		
		ЭтотОбъект.ТекущийЭлемент = Элементы.ТипЦен;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		УправлениеФормой();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура СверхБюджетаПриИзменении(Элемент)
	
	Если НЕ Объект.СверхБюджета Тогда
		Объект.СписатьЛимиты = Ложь;	
	КонецЕсли;
	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	
	Подключаемый_АналитикаПриИзменении(Элемент);
	ЦФОПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастройкиОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Сброс параметров выбора.
	НовыйМассив = Новый Массив();
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элемент.ПараметрыВыбора = НовыеПараметры;
	
	// Подготовка новых параметров выбора.
	Если Элементы.КомпоновщикНастройкиОтбор.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипСтатьяБюджета = Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиБюджета");
	ТипДопЗначенияАналитик = Новый ОписаниеТипов("СправочникСсылка.бит_ДополнительныеЗначенияАналитик");
	
	Поле	= Элементы.КомпоновщикНастройкиОтбор.ТекущиеДанные.ЛевоеЗначение;
	ТипПоля = бит_ОбщегоНазначенияКлиент.ПолучитьСвойствоПоля(
		Компоновщик.Настройки.Отбор.ДоступныеПоляОтбора, Поле, "Тип");
	
	Если ТипПоля = ТипСтатьяБюджета
		И ЗначениеЗаполнено(Бюджет) Тогда
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", Бюджет);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элемент.ПараметрыВыбора = НовыеПараметры;
	ИначеЕсли ТипПоля = ТипДопЗначенияАналитик Тогда
		
		НастройкиДопИзмерений = НастройкиДополнительныхИзмерений();
		НастройкиИзмерения = НастройкиДопИзмерений[Строка(Поле)];
		Если НастройкиИзмерения <> Неопределено Тогда
			ВидДопАналитики = НастройкиИзмерения.Аналитика;
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ВидДопАналитики);
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НовыйПараметр);
			НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
			Элемент.ПараметрыВыбора = НовыеПараметры;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабДокДанные

&НаКлиенте
Процедура ТабДокДанныеПриАктивизацииОбласти(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработчикТабДокДанныеПриАктивизацииОбласти", 0.1, Истина);
	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамически", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикТабДокДанныеПриАктивизацииОбласти()
	
	Если НЕ ПостроенИндексПоиска Тогда
		Оптимизация();
	КонецЕсли;
	
	Если ТабДокДанные.ВысотаТаблицы = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОблМакета = Элементы.ТабДокДанные.ТекущаяОбласть;
	ЗащищеннаяОбласть = ЭтоЗащищеннаяОбласть(ОблМакета);
	ИменаВыделенныхОбластей = ПолучитьИменаВыделенныхОбластей();
	Если ИменаВыделенныхОбластей.Количество() > 1 Тогда
		ВыделеноНесколькоЯчеек	= Истина;
	Иначе
		ВыделеноНесколькоЯчеек = Ложь;
	КонецЕсли;
	
	// Очищаем выделенные области табличного документа.
	бит_БюджетированиеКлиентСервер.ОчиститьВыделениеАргументов(ТабДокДанные, фВыделенныеОбласти);	
	
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблМакета) Тогда
		
		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОблМакета.Расшифровка, "РасшифровкаЯчейкиФормыВвода") Тогда
			ОбластьР = ОблМакета.Расшифровка;
			Если ОбластьР.Вид = "Значение" Тогда
				// Устанавливаем отбор по периоду и комбинации измерений.
				СтрОтбор = бит_БюджетированиеКлиентСервер.СформироватьОтборСтрок(ОбластьР);
				Элементы.БДДС_Редактирование.ОтборСтрок = Новый ФиксированнаяСтруктура(СтрОтбор);
				УправлениеСтраницейОжиданияБДДС(Ложь);
				
				РучнойВводЗависимых = РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов);
				ТекущиеСтрокиБДДС   = Неопределено;
				Если РучнойВводЗависимых ИЛИ АвтовидимостьКолонок Тогда
					ТекущиеСтрокиБДДС = Объект.БДДС.НайтиСтроки(СтрОтбор);
				КонецЕсли;
				
				Если РучнойВводЗависимых Тогда
					ТекущаяСтрока = ?(ТекущиеСтрокиБДДС.Количество() > 0, ТекущиеСтрокиБДДС[0], Неопределено);
					Если НЕ ТекущаяСтрока = Неопределено Тогда
						Элементы.ЗависимыеОбороты_Редактирование.ОтборСтрок = Новый ФиксированнаяСтруктура("Ид_Родитель", ТекущаяСтрока.Ид);
						УправлениеСтраницейОжиданияЗависимыеОбороты(Ложь);
					Иначе
						УправлениеСтраницейОжиданияЗависимыеОбороты(Истина);
					КонецЕсли; 
				КонецЕсли; 
				фВыделенныеОбласти.Добавить(ОбластьР.Имя);
				бит_БюджетированиеКлиент.ВеделитьОбласть(ТабДокДанные, фВыделенныеОбласти);
				
				УстановитьВидимостьКолонокПоСтатьям(ТекущиеСтрокиБДДС, СтрОтбор);
			Иначе	
				УправлениеСтраницейОжиданияБДДС(Истина);
				УправлениеСтраницейОжиданияЗависимыеОбороты(Истина);
			КонецЕсли; 
			
			// Формирование представления формулы.
			Если ПустаяСтрока(ОбластьР.Формула) Тогда
				ФормулаПредставление = "";
			Иначе	
				ФормулаПредставление = бит_БюджетированиеКлиент.ПользовательскоеПредставлениеФормулы(ТабДокДанные, ОбластьР.Формула);
				Если фКэшЗначений.ВыделятьАргументы Тогда
					бит_БюджетированиеКлиент.ВыделитьАргументыФормулы(ТабДокДанные, ОбластьР.Формула, фВыделенныеОбласти, фКэшЗначений.НастройкиФормы.Цвета.Цвет_Аргумент);					  
				КонецЕсли; 
			КонецЕсли; 
		Иначе	  
			УправлениеСтраницейОжиданияБДДС(Истина);
			УправлениеСтраницейОжиданияЗависимыеОбороты(Истина);			  
		КонецЕсли;	// ИмяКласса подходит.
		
	КонецЕсли; // ОблМакета подходит.
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокДанныеПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОблМакета = Элементы.ТабДокДанные.ТекущаяОбласть;
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблМакета) Тогда
		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОблМакета.Расшифровка, "РасшифровкаЯчейкиФормыВвода") Тогда
			СтрокиДляЗависимых = Новый Массив();
			ИзменениеСодержимогоОбласти(ОблМакета, СтрокиДляЗависимых);
			ОбновитьПарнуюЯчейки(ОблМакета, СтрокиДляЗависимых);
			Если СтрокиДляЗависимых.Количество() > 0 Тогда
				ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
			КонецЕсли;
		КонецЕсли;	// ИмяКласса подходит.
	КонецЕсли; // ОблМакета подходит.
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокДанныеОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Расшифровка, "РасшифровкаЯчейкиФормыВвода")  Тогда
		Если Расшифровка.Вид = "Измерение" И ЗначениеЗаполнено(Расшифровка.Значение) Тогда
			ПоказатьЗначение(,Расшифровка.Значение);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокДанныеВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Область.Верх <> Область.Низ
		ИЛИ Область.Лево <> Область.Право 
		ИЛИ ТабДокДанные.ВыделенныеОбласти.Количество() > 1 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ЗаблокироватьЭлементы
		ИЛИ бит_НастройкиДоступностиЭлементовФормКлиентСервер.ЭлементЗаблокированНаРедактирование(Элементы.ТабДокДанные,
				ЭтотОбъект) Тогда
		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Область.Расшифровка, "РасшифровкаЯчейкиФормыВвода")  Тогда
			Если Область.Расшифровка.Вид = "Значение" Тогда
				СтандартнаяОбработка = Ложь;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБДДС_Редактирование

&НаКлиенте
Процедура БДДС_РедактированиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ЗаблокироватьЭлементы ИЛИ ЗащищеннаяОбласть ИЛИ ВыделеноНесколькоЯчеек Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ АктивнаРедактируемаяЯчейка() Тогда
		ТекстСообщения = НСтр("ru = 'Для добавления данных необходимо установить курсор в редактируемую ячейку.'; 
							  |en = 'Для добавления данных необходимо установить курсор в редактируемую ячейку.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.БДДС_Редактирование.ТекущиеДанные;	
	
	Если НоваяСтрока Тогда
		УстановитьИД_БДДС_Клиент(ТекущаяСтрока);		
		Если НЕ Копирование И АктивнаРедактируемаяЯчейка() Тогда
			 ЭлР = Элементы.ТабДокДанные.ТекущаяОбласть.Расшифровка;
			 бит_БюджетированиеКлиентСервер.ЗаполнитьНовуюСтрокуБюджета(Объект, ТекущаяСтрока ,ЭлР.Период, ЭлР.Измерения, фКэшЗначений.НастройкиФормы.Измерения);
		КонецЕсли; 
		
		// Период ставим, т.к. он безусловно обрабатывается.
		ЗаполнитьНорму(ЭтотОбъект, ТекущаяСтрока.ПолучитьИдентификатор(), "БДДС", "Период");
		
		Если АвтовидимостьКолонок Тогда
			ОбработчикТабДокДанныеПриАктивизацииОбласти();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СтрокиДляЗависимых = Новый Массив();
	Если НЕ ОтменаРедактирования И АктивнаРедактируемаяЯчейка() Тогда
		Обл = Элементы.ТабДокДанные.ТекущаяОбласть;
		ОбластьР = Обл.Расшифровка;
		ОбновитьЗначениеЯчейкиДерева(Обл, ОбластьР, СтрокиДляЗависимых);
		ОбновитьПарнуюЯчейки(Обл, СтрокиДляЗависимых);		
	КонецЕсли; 
	
	Если РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов) Тогда
		 ТекущаяСтрока = Элементы.БДДС_Редактирование.ТекущиеДанные;	     
		 Если ТекущаяСтрока <> Неопределено Тогда
			 СтрокиДляЗависимых.Добавить(ТекущаяСтрока.ПолучитьИдентификатор());
			 Элементы.ЗависимыеОбороты_Редактирование.ОтборСтрок = Новый ФиксированнаяСтруктура("Ид_Родитель", ТекущаяСтрока.Ид);
			 УправлениеСтраницейОжиданияЗависимыеОбороты(Ложь);
		 КонецЕсли; 
	КонецЕсли; 
	Если СтрокиДляЗависимых.Количество() > 0 Тогда
		ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеПередУдалением(Элемент, Отказ)
	
	Если ЗаблокироватьЭлементы ИЛИ ЗащищеннаяОбласть ИЛИ ВыделеноНесколькоЯчеек Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ АктивнаРедактируемаяЯчейка() Тогда
		ТекстСообщения = НСтр("ru = 'Для добавления данных необходимо установить курсор в редактируемую ячейку.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	Иначе	
		Если ЗаблокироватьЭлементы Тогда
			Отказ = Истина;		
		КонецЕсли;
	КонецЕсли; 
	
	// В ручном режиме удаляем зависимые обороты.
	Если РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов) Тогда
		 ТекущаяСтрока = Элементы.БДДС_Редактирование.ТекущиеДанные;
		 СтрОтбор = Новый Структура;
		 СтрОтбор.Вставить("ИД_Родитель", ТекущаяСтрока.ИД);
		 НайденныеСтроки = Объект.ЗависимыеОбороты.НайтиСтроки(СтрОтбор);
		 Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		 	Объект.ЗависимыеОбороты.Удалить(НайденнаяСтрока);
		 КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеПослеУдаления(Элемент)
	
	Если АктивнаРедактируемаяЯчейка() Тогда
		Обл = Элементы.ТабДокДанные.ТекущаяОбласть;
		ОбластьР = Обл.Расшифровка;
		СтрокиДляЗависимых = Новый Массив();
		ОбновитьЗначениеЯчейкиДерева(Обл, ОбластьР, СтрокиДляЗависимых);
		ОбновитьПарнуюЯчейки(Обл, СтрокиДляЗависимых);
		Если СтрокиДляЗависимых.Количество() > 0 Тогда
			ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеПриАктивизацииСтроки(Элемент)
	
	Если РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов) Тогда
		ТекущаяСтрока = Элементы.БДДС_Редактирование.ТекущиеДанные;
		Если НЕ ТекущаяСтрока = Неопределено Тогда
			Элементы.ЗависимыеОбороты_Редактирование.ОтборСтрок = Новый ФиксированнаяСтруктура("Ид_Родитель", ТекущаяСтрока.Ид);
			УправлениеСтраницейОжиданияЗависимыеОбороты(Ложь);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеСтатьяОборотовПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.БДДС_Редактирование.ТекущиеДанные;
	бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(ТекущаяСтрока, фКэшЗначений.ИзмеренияДоп, фКэшЗначений.НастройкиИзмерений);
	
	ИзменениеСтатьиОборотовВТабличнойЧасти(ТекущаяСтрока.ПолучитьИдентификатор(),"БДДС", "БДДС_Редактирование");
	
	Если АвтовидимостьКолонок Тогда
		ОбработчикТабДокДанныеПриАктивизацииОбласти();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.БДДС_Редактирование.ТекущиеДанные;
	бит_БюджетированиеКлиентСервер.РассчитатьПоНорме(ТекущаяСтрока, фИспользоватьНормы);
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеНормаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.БДДС_Редактирование.ТекущиеДанные;
	бит_БюджетированиеКлиентСервер.РассчитатьПоНорме(ТекущаяСтрока, фИспользоватьНормы);
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗащищеннаяОбласть ИЛИ ВыделеноНесколькоЯчеек Тогда
		ПоказатьЗначениеТЧ(Элемент, Поле);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БДДС_РедактированиеПередНачаломИзменения(Элемент, Отказ)
	
	Если ЗащищеннаяОбласть ИЛИ ВыделеноНесколькоЯчеек Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗависимыеОбороты_Редактирование

&НаКлиенте
Процедура ЗависимыеОбороты_РедактированиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	// BF-1721.
	Если ЗаблокироватьЭлементы ИЛИ ЗащищеннаяОбласть ИЛИ ВыделеноНесколькоЯчеек Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// BF-1721.
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеОбороты_РедактированиеПередУдалением(Элемент, Отказ)
	
	// BF-1721.
	Если ЗаблокироватьЭлементы ИЛИ ЗащищеннаяОбласть ИЛИ ВыделеноНесколькоЯчеек Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// BF-1721.
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеОбороты_РедактированиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗащищеннаяОбласть ИЛИ ВыделеноНесколькоЯчеек Тогда
		ПоказатьЗначениеТЧ(Элемент, Поле);
		Возврат;
	КонецЕсли;
	
	ВыбСтрока = Объект.ЗависимыеОбороты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Поле.Имя = "ЗависимыеОбороты_РедактированиеКомментарийРасчета" 
		И НЕ ВыбСтрока = Неопределено 
		И НЕ ПустаяСтрока(ВыбСтрока.КомментарийРасчета) Тогда
		
		СтандартнаяОбработка = Ложь;		
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КомментарийРасчета", ВыбСтрока.КомментарийРасчета);
		ОткрытьФорму("ОбщаяФорма.бит_ФормаКомментарияРасчетаЗависимыхОборотов", ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеОбороты_РедактированиеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Фиксируем, если имело место ручное редактирование.
	ТекущаяСтрока = Элементы.ЗависимыеОбороты_Редактирование.ТекущиеДанные;
	СтрВрем = НСтр("ru='Выполнено ручное редактирование. Пользователь ""%1"", время ""%2""';
				   |en='Achieved manual editing. User ""%1"", while ""%2""'");
	СтрВрем = СтрШаблон(СтрВрем, Строка(фКэшЗначений.ТекущийПользователь), 
					Формат(ОбщегоНазначенияКлиент.ДатаСеанса(),"ДЛФ=D"));
	ТекущаяСтрока.КомментарийРасчета = ТекущаяСтрока.КомментарийРасчета + "<p>" + СтрВрем + "</p>";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеОбороты_РедактированиеСтатьяОборотовПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЗависимыеОбороты_Редактирование.ТекущиеДанные;
	бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(ТекущаяСтрока, фКэшЗначений.ИзмеренияДоп, фКэшЗначений.НастройкиИзмерений);
	
	ИзменениеСтатьиОборотовВТабличнойЧасти(ТекущаяСтрока.ПолучитьИдентификатор(),"ЗависимыеОбороты", "ЗависимыеОбороты_Редактирование");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеОбороты_РедактированиеКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЗависимыеОбороты_Редактирование.ТекущиеДанные;
	бит_БюджетированиеКлиентСервер.РассчитатьПоНорме(ТекущаяСтрока, фИспользоватьНормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеОбороты_РедактированиеНормаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЗависимыеОбороты_Редактирование.ТекущиеДанные;
	бит_БюджетированиеКлиентСервер.РассчитатьПоНорме(ТекущаяСтрока, фИспользоватьНормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеОбороты_РедактированиеПередНачаломИзменения(Элемент, Отказ)
		
	Если ЗащищеннаяОбласть ИЛИ ВыделеноНесколькоЯчеек Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБДДС

&НаКлиенте
Процедура БДДСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Объект.БДДС.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ИмяРеквизита = СтрЗаменить(Поле.Имя, "БДДС", "");
		ТекЗнч = ТекущаяСтрока[ИмяРеквизита];
		Если ЗначениеЗаполнено(ТекЗнч) Тогда
			ПоказатьЗначение(,ТекЗнч);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БДДСПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.БДДС.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		УстановитьОтборЗависимые(ТекущаяСтрока.ПолучитьИдентификатор());
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗависимыеОбороты

&НаКлиенте
Процедура ЗависимыеОборотыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбСтрока = Объект.ЗависимыеОбороты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Поле.Имя = "ЗависимыеОборотыКомментарийРасчета" 
		  И НЕ ВыбСтрока = Неопределено 
		  И НЕ ПустаяСтрока(ВыбСтрока.КомментарийРасчета) Тогда
		
		СтандартнаяОбработка = Ложь;		
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КомментарийРасчета", ВыбСтрока.КомментарийРасчета);
		ОткрытьФорму("ОбщаяФорма.бит_ФормаКомментарияРасчетаЗависимыхОборотов", ПараметрыФормы, ЭтотОбъект);
		
	Иначе
		
		Если НЕ ВыбСтрока = Неопределено Тогда
			
			ИмяРеквизита = СтрЗаменить(Поле.Имя, "ЗависимыеОбороты", "");
			ТекЗнч = ВыбСтрока[ИмяРеквизита];
			Если ЗначениеЗаполнено(ТекЗнч) Тогда
				ПоказатьЗначение(,ТекЗнч);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда,
																											ЭтотОбъект,
																											Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область ОбработчикиКомандРедактированияПериода

&НаКлиенте
Процедура КомандаРедактироватьПериод(Команда)
	
	ПараметрыПередачи = Новый Структура(); 
	ПараметрыПередачи.Вставить("ДатаНачала", 	Объект.ДатаНачалаПланирования);
	ПараметрыПередачи.Вставить("ДатаОкончания", Объект.ДатаОкончанияПланирования);
	ПараметрыПередачи.Вставить("Контекст", 		УникальныйИдентификатор);
	
	бит_ОбщегоНазначенияКлиент.ВыбратьПериод(ПараметрыПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеПериодаЗавершение(Период, ДополнительныеДанные)

	Если Период <> Неопределено Тогда
		// Установим даты из диалога редактирования, если пользователь не согласится - вернем обратно.
		ПериодПланирования = Период;		
		Объект.ДатаНачалаПланирования    = ПериодПланирования.ДатаНачала;
		Объект.ДатаОкончанияПланирования = ПериодПланирования.ДатаОкончания;			
		
		Если фКэшЗначений.НастройкиФормы.ФиксированныйМакет Тогда
			Объект.ДатаОкончанияПланирования = Неопределено;
			ПериодПланирования.ДатаОкончания = Дата('00010101');
		КонецЕсли;
		
		ОбновитьКурсСервер();	
		Оповещение = Новый ОписаниеОповещения("РедактироватьПериодЗавершение", ЭтотОбъект); 
		
		ЗадатьВопросОбОчисткеИзмененииДанных(Оповещение);
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПериодДействияЗавершение()
	
	Модифицированность = Истина;			
	
	мТекущаяДатаНачалаПланирования    = Объект.ДатаНачалаПланирования;
	мТекущаяДатаОкончанияПланирования = Объект.ДатаОкончанияПланирования;	
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура РедактироватьПериодЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		// Действия после согласия пользователя.
		ОчиститьВсе(ЭтотОбъект);
		РедактироватьПериодДействияЗавершение();
	ИначеЕсли Результат = "Перезаполнить" Тогда
		ИзменитьПериодыТаблиц(мТекущаяДатаНачалаПланирования, мТекущаяДатаОкончанияПланирования);
		РедактироватьПериодДействияЗавершение();
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена	ИЛИ Результат = КодВозвратаДиалога.Таймаут Тогда
		// Возврат к предыдущим значениям.
		Объект.ДатаНачалаПланирования    = мТекущаяДатаНачалаПланирования;
		Объект.ДатаОкончанияПланирования = мТекущаяДатаОкончанияПланирования;
		ПериодПланирования.ДатаНачала    = Объект.ДатаНачалаПланирования;
		ПериодПланирования.ДатаОкончания = Объект.ДатаОкончанияПланирования;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКомандыЭлементовФормы

&НаКлиенте
Процедура Подключаемый_АналитикаПриИзменении(Элемент)
	
	ЗадатьВопросОЗаменеЗначенияПоУмолчанию(Элемент.Имя, Элемент.Имя);	

КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_АналитикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяПоля  = Элемент.Имя;
	Если бит_МеханизмДопИзмеренийКлиент.ЭтоАналитикаБанковскийСчет(Элемент.Имя, фКэшЗначений.НастройкиИзмерений) Тогда
	  	бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(Объект, СтандартнаяОбработка, Элемент.Имя);	
	Иначе	
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, Объект, Элемент.Имя,
			СтандартнаяОбработка, фКэшЗначений.НастройкиИзмерений);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаОчистка(Элемент, СтандартнаяОбработка)
	
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, Объект, Элемент.Имя,
		СтандартнаяОбработка, фКэшЗначений.НастройкиИзмерений);

КонецПроцедуры

#КонецОбласти 

#Область ПодключаемыеКомандыЭлементовТаблицФормы

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля       = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	Если СтрЧислоВхождений(Элемент.Родитель.Имя,"БДДС") <> 0 Тогда
		ТаблицаОбъекта = "БДДС";
	Иначе
		ТаблицаОбъекта = "ЗависимыеОбороты";
	КонецЕсли; 
	ЗаполнитьНорму(ЭтотОбъект, ТекущиеДанные.ПолучитьИдентификатор(), ТаблицаОбъекта, ИмяПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля  = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	Если бит_МеханизмДопИзмеренийКлиент.ЭтоАналитикаБанковскийСчет(ИмяПоля, фКэшЗначений.НастройкиИзмерений) Тогда
	  	бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(ТекущиеДанные, СтандартнаяОбработка, ИмяПоля);	
	Иначе	
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
			СтандартнаяОбработка, фКэшЗначений.НастройкиИзмерений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, фКэшЗначений.НастройкиИзмерений);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИмяПоля  = СтрЗаменить(Элемент.Имя, Элемент.Родитель.Имя, "");
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, фКэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандРаботыСExcel

#Область ВыгрузкаЗагрузкаНапрямуюИзФормы

&НаКлиенте
Процедура КомандаВыгрузитьШаблонExcel(Команда)
	
	#Если ВебКлиент Тогда 
		ВызватьИсключение НСтр("ru='Работа с файлами Excel в режиме Веб-клиента недоступна.';
							   |en='Working with Excel files in the Web client mode isn’t available.'");
	#КонецЕсли
	
	Если Модифицированность Тогда
		// Запрашиваем подтверждение у пользователя.
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьШаблонExcelВопросЗавершение", ЭтотОбъект);
		ТекстСообщения = НСтр("ru='Для выполнение действия необходимо записать документ. Продолжить?';
							  |en='To perform this action document must be saved. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Да);
	Иначе	
		// Безусловно выгружаем.
		ВыгрузитьШаблонЭксель();
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "ВыгрузитьШаблонЭксельВопросЗавершение".
// 
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура ВыгрузитьШаблонExcelВопросЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Выгружать = Записать();
		Если Выгружать Тогда
			ВыгрузитьШаблонЭксель();
		КонецЕсли;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьПоШаблонуExcel(Команда)
	
	#Если ВебКлиент Тогда 
		ВызватьИсключение НСтр("ru='Работа с файлами Excel в режиме Веб-клиента недоступна.';
							   |en='Working with Excel files in the Web client mode isn’t available.'");
	#КонецЕсли
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьПоШаблонуЗавершение", ЭтотОбъект); 
	ЗадатьВопросОбОчисткеДанных(Оповещение);
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ЗагрузитьПоШаблонуЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		// Выполняем, при согласии пользователя.
		ЗагрузитьДанныеПоШаблону();
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзТабличногоДокумента

&НаКлиенте
Процедура ЗагрузитьДанныеЧерезТабДокДанныеБюджета(Команда)
    
    ОткрытьФормуЗагрузкиДанныхЧерезТабДок("БДДС");
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСExcelЧерезПроформы

&НаКлиенте
Процедура КомандаЗагрузитьИзПроформы(Команда)
	
	#Если ВебКлиент Тогда 
		ВызватьИсключение НСтр("ru='Работа с файлами Excel в режиме Веб-клиента недоступна.';
							   |en='Working with Excel files in the Web client mode isn’t available.'");
	#КонецЕсли
	
	Если Объект.БДДС.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзПроформыВопросЗавершение", ЭтотОбъект);
		ТекстВопроса =  НСтр("en='Tabular section will be cleaned. Continue?';ru='Табличная часть будет очищена. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	Иначе	
		ЗагрузитьДанныеПроформы("Загрузить");
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "ЗагрузитьИзПроформыВопросЗавершение".
//
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура ЗагрузитьИзПроформыВопросЗавершение(Ответ, ДополнительныеДанные) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗагрузитьДанныеПроформы("Загрузить");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьИзПроформы(Команда)
	
	#Если ВебКлиент Тогда 
		ВызватьИсключение НСтр("ru='Работа с файлами Excel в режиме Веб-клиента недоступна.';
							   |en='Working with Excel files in the Web client mode isn’t available.'");
	#КонецЕсли
	
	ЗагрузитьДанныеПроформы("Добавить");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандРасчетаПоказателей

&НаКлиенте
Процедура РассчитатьСумму(Команда)
	
	РассчитатьПоказатели(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличество(Команда)
	
	РассчитатьПоказатели(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСреднее(Команда)
	
	РассчитатьПоказатели(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМинимум(Команда)
	
	РассчитатьПоказатели(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМаксимум(Команда)
	
	РассчитатьПоказатели(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВсеПоказатели(Команда)
	// АПК:278-выкл Проектное решение вызвать функционал другой подсистемы.
	ОбщегоНазначенияСлужебныйКлиент.УстановитьВидимостьПанелиПоказателей(
		Элементы, Не Элементы.РассчитатьВсеПоказатели.Пометка);
	РазвернутьОбластьПоказателей = Элементы.РассчитатьВсеПоказатели.Пометка;	
	// АПК:278-вкл
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоказатели(ИмяКоманды)
	
	// АПК:278-выкл Проектное решение вызвать функционал другой подсистемы.
	ОбщегоНазначенияСлужебныйКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТабДокДанные", ИмяКоманды);
	// АПК:278-вкл
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	Если ЗаполнениеДереваВозможно(Истина) Тогда
		Оповещение = Новый ОписаниеОповещения("ОбновитьЗавершение", ЭтотОбъект);
		ЗадатьВопросОбОчисткеДанных(Оповещение);
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ОбновитьЗавершение(Результат, ДополнительныеПараметры)  Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОчиститьТаблицы(ЭтотОбъект);
		ДлительнаяОперация = НачатьОбновлениеДерева();
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru='Выполняется построение дерева...';en='Creating a tree ...'"); 
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьОбновлениеДерева", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	КонецЕсли; 
	
КонецПроцедуры

// Обраборка оповещения процедуры "ОбновитьЗавершение".
//
// Параметры:
//  Результат				 - Структура - См. общий модуль ДлительныеОпрации.
//  ДополнительныеПараметры	 - Произвольный - произвольные данные, переданные в обработку оповещения. 
//
&НаКлиенте
Процедура ЗавершитьОбновлениеДерева(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		// Ничего не делать или обработать ошибку.
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе
		ТабДокДанные = Новый ТабличныйДокумент;
		ЗавершитьОбновлениеДереваНаСервере(Результат);
	КонецЕсли; 

	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		Для каждого ТекущееСообщение Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекущееСообщение.Текст);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьОбновлениеДерева()
	
	РеквизитыСценария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Сценарий, "бит_Периодичность, ПродолжительностьИнтервала");

	ПараметрыОбновления = Документы.бит_ФормаВводаБюджета.НовыеПараметрыДерева();
	ПараметрыОбновления.АдресКомпоновки				= АдресКомпоновки;
	ПараметрыОбновления.НастройкиКомпоновщика		= Компоновщик.ПолучитьНастройки();
	ПараметрыОбновления.ДатаНачалаПланирования 		= Объект.ДатаНачалаПланирования;
	ПараметрыОбновления.ДатаОкончанияПланирования 	= Объект.ДатаОкончанияПланирования;
	ПараметрыОбновления.Периодичность			    = РеквизитыСценария.бит_Периодичность;
	ПараметрыОбновления.ПродолжительностьИнтервала  = РеквизитыСценария.ПродолжительностьИнтервала;
	ПараметрыОбновления.СхемаКомпоновкиДанных 		= ПолучитьИзВременногоХранилища(АдресКомпоновки);
	
	ВыполняемыйМетод = "Документы.бит_ФормаВводаБюджета.ОбновитьДеревоДанныхВФоне";
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Настройка",			Объект.НастройкаФормы);
	ПараметрыМетода.Вставить("ТекстЗапроса",		ТекстЗапроса);
	ПараметрыМетода.Вставить("ПараметрыОбновления", ПараметрыОбновления);
	
	// Заполнение пераметов длительной операции.
	НаименованиеЗадания = НСтр("ru = 'Обновление макета формы ввода бюджета.'");
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыМетода, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Процедура ЗавершитьОбновлениеДереваНаСервере(РезультаОбновления)

	ТабДокДанные = ПолучитьИзВременногоХранилища(РезультаОбновления.АдресРезультата);
	
	Документы.бит_ФормаВводаБюджета.ЗаполнитьТаблицуДанных(ТабДокДанные, АдресХранилищаДанных);
	Документы.бит_ФормаВводаБюджета.ЗаполнитьСписокСмежности(ТабДокДанные, АдресХранилищаСпискаСмежности);
	
	МассивСтатей = ИзвлечьСтатьиИзДерева(ТабДокДанные);
	фКэшЗначений.НастройкиСтатей = Новый Соответствие;	
    бит_Бюджетирование.ПолучитьНастройкиСтатейОборотов(МассивСтатей, фКэшЗначений.НастройкиСтатей);
	
	ИменаТаблиц = Новый Массив;  
	ИменаТаблиц.Добавить("БДДС");
	ИменаТаблиц.Добавить("БДДС_Редактирование");
	ОФормитьТаблицу("БДДС", ИменаТаблиц, МассивСтатей);
	
	ИменаТаблиц = Новый Массив;  
	ИменаТаблиц.Добавить("ЗависимыеОбороты");
	ИменаТаблиц.Добавить("ЗависимыеОбороты_Редактирование");
	ОФормитьТаблицу("ЗависимыеОбороты", ИменаТаблиц, МассивСтатей);																		
	
	УправлениеВидимостьюКолонокТаблиц();

КонецПроцедуры

&НаКлиенте
Процедура КомандаВосстановить(Команда)
	
	Если ЗаполнениеДереваВозможно(Истина) Тогда
		Состояние(НСтр("ru='Выполняется обновление дерева...';en='Updating the tree ...'"));		
		ОчиститьСообщения();
		ВосстановитьДерево(Истина,Истина,Истина);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкопироватьСтрокуВЗависимые(Команда)
	
	Если ЗащищеннаяОбласть Тогда
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Выбранная область данных бюджета содержит защищенные ячейки.';
								  |en = 'The selected area of the budget data contains protected cells.'"));
		МассивСтрок.Добавить(НСтр("ru = 'Команда недоступна.';
								  |en = 'Command isn’t available.'"));
		ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	ИначеЕсли ВыделеноНесколькоЯчеек Тогда	
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Выбрано несколько ячеек данных бюджета.';
								  |en = 'Select multiple budget data cells.'"));
		МассивСтрок.Добавить(НСтр("ru = 'Команда недоступна.';
								  |en = 'Command isn’t available.'"));
		ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если НЕ РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов) Тогда
		ТекстСообщения = НСтр("ru='Функция копирования доступна при ручном вводе зависимых оборотов.';
							  |en='Copy function is available when entering dependent turnovers manually'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	ТекущаяСтрока = Элементы.БДДС_Редактирование.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		СкоприроватьСтрокуВЗависимые(ТекущаяСтрока.ПолучитьИдентификатор());
	Иначе
		ТекстСообщения = НСтр("ru='Не выбрана текущая строка данных для копирования.';
							  |en='Current data line for copying isn’t selected'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьЗависимыеОбороты(Команда)
	
	Если Объект.ЗависимыеОбороты.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьЗависимыеОборотыВопросЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Зависимые обороты будут очищены. Продолжить?';
							|en='Dependent speed will be cleared. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Нет); 
	Иначе
		ЗаполнитьЗависимыеОбороты();	
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "ЗаполнитьЗависимыеОборотыВопросЗавершение".
// 
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура ЗаполнитьЗависимыеОборотыВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьЗависимыеОбороты();
		ЗаполнитьЗависимыеОбороты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПереключитьОтбор(Команда)
	
	Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Пометка = НЕ Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Пометка;	
	фУстанавливатьОтборЗависимых = Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Пометка;
	
	Если фУстанавливатьОтборЗависимых Тогда
		ТекущаяСтрока = Элементы.БДДС.ТекущиеДанные;
		Если НЕ ТекущаяСтрока = Неопределено Тогда
			УстановитьОтборЗависимые(ТекущаяСтрока.ПолучитьИдентификатор());
		КонецЕсли; 
	Иначе	
		ОтключитьОтборЗависимые();
	КонецЕсли; 
	
	УстановитьКартинкуКнопкиОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьЗависимыеПоСтроке(Команда)
	
	Если ЗащищеннаяОбласть Тогда
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Выбранная область данных бюджета содержит защищенные ячейки.';
								  |en = 'The selected area of the budget data contains protected cells.'"));
		МассивСтрок.Добавить(НСтр("ru = 'Команда недоступна.';
								  |en = 'Command isn’t available.'"));
		ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	ИначеЕсли ВыделеноНесколькоЯчеек Тогда	
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Выбрано несколько ячеек данных бюджета.';
								  |en = 'Select multiple budget data cells.'"));
		МассивСтрок.Добавить(НСтр("ru = 'Команда недоступна.';
								  |en = 'Command isn’t available.'"));
		ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ТекущаяСтрокаДанные = Элементы.БДДС_Редактирование.ТекущиеДанные;
	Если ТекущаяСтрокаДанные <> Неопределено Тогда
		ЗаполнитьЗависимыеОборотыПоСтроке(ТекущаяСтрокаДанные.ПолучитьИдентификатор());
	Иначе
		ТекстСообщения = НСтр("ru='Не выбрана текущая строка данных для заполнения зависимых оборотов.';
							  |en='Current data line to fill in the dependent turnovers isn’t selected'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьЗависимыеПоСтроке(Команда)
	
	Если ЗащищеннаяОбласть Тогда
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Выбранная область данных бюджета содержит защищенные ячейки.';
								  |en = 'The selected area of the budget data contains protected cells.'"));
		МассивСтрок.Добавить(НСтр("ru = 'Команда недоступна.';
								  |en = 'Command isn’t available.'"));
		ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	ИначеЕсли ВыделеноНесколькоЯчеек Тогда	
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Выбрано несколько ячеек данных бюджета.';
								  |en = 'Select multiple budget data cells.'"));
		МассивСтрок.Добавить(НСтр("ru = 'Команда недоступна.';
								  |en = 'Command isn’t available.'"));
		ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ТекущаяСтрокаДанных = Элементы.БДДС_Редактирование.ТекущиеДанные;
	
	Если ТекущаяСтрокаДанных <> Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ОчиститьЗависимыеПоСтрокеВопросЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Будут очищены зависимые обороты для текущей строки данных. Продолжить?';
						    |en='Dependent turnovers for the current data line will be cleared. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Нет); 
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "ОчиститьЗависимыеПоСтрокеВопросЗавершение".
// 
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура ОчиститьЗависимыеПоСтрокеВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ТекущаяСтрокаДанных = Элементы.БДДС_Редактирование.ТекущиеДанные;
		Если ТекущаяСтрокаДанных <> Неопределено Тогда
			ОчиститьЗависимыеОборотыПоСтроке(ТекущаяСтрокаДанных.ПолучитьИдентификатор());	
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКопироватьДанные(Команда)
	
	СкопироватьВБуфер();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВставитьДанные(Команда)

	Если ТипЗнч(мБуфер) <> Тип("Массив") Тогда
		Возврат;	
	КонецЕсли;
		
	СтрокиДляЗависимых = Новый Массив();
	Для каждого ТекущаяОбласть Из ТабДокДанные.ВыделенныеОбласти Цикл
		Если НЕ бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ТекущаяОбласть) Тогда
			Продолжить;	
		КонецЕсли;
		
		ВерхнийИндексКолонки = ТекущаяОбласть.Право - ТекущаяОбласть.Лево;
		ВерхнийИндексСтроки  = ТекущаяОбласть.Низ   - ТекущаяОбласть.Верх;//6 строк - 5
		
		ВерхнийИндексСтрокВБуфере = мБуфер.Вграница();
		ИндексСтрокиВБуфере 	  = 0;
		
		Если ВерхнийИндексСтроки < ВерхнийИндексСтрокВБуфере Тогда
			Продолжить;		
		КонецЕсли;
		
		Для ИндексСтроки = 0 По ВерхнийИндексСтроки Цикл
			НомерСтроки = ТекущаяОбласть.Верх + ИндексСтроки;
			
			Если ИндексСтрокиВБуфере > ВерхнийИндексСтрокВБуфере Тогда
				ИндексСтрокиВБуфере = 0;
				ОсталосьВставить = Макс(ВерхнийИндексСтроки - ИндексСтроки, 0);
				Если ОсталосьВставить < ВерхнийИндексСтрокВБуфере Тогда
					// Выделенные области некратны скопированным.
					// Скопированные польностью не вставятся. Прерываем.
					Прервать;
				КонецЕсли;
			КонецЕсли;
			 
			Буфер = Новый Массив;
			Буфер.Добавить(мБуфер.Получить(ИндексСтрокиВБуфере));
			ИндексСтрокиВБуфере = ИндексСтрокиВБуфере + 1;
			
			Для ИндексКолонки = 0 По ВерхнийИндексКолонки Цикл
				НомерКолонки = ТекущаяОбласть.Лево + ИндексКолонки;
				Область		 = ТабДокДанные.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
				
				ПараметрыВставки = НовыеПараметрыВставкиИзБуфера();
				ЗаполнитьЗначенияСвойств(ПараметрыВставки, Область);
				
				ВставитьИзБуфера(Буфер, ПараметрыВставки, СтрокиДляЗависимых);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если СтрокиДляЗависимых.Количество() > 0 Тогда
		ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьДанные(Команда)
	
	Если АктивнаРедактируемаяЯчейка() Тогда
		ИменаВыделенныхОбластей = ПолучитьИменаВыделенныхОбластей();
		ОбластиТД = ТабДокДанные.Области;	
		СтрокиДляЗависимых = Новый Массив();
		Для Каждого ИмяОбласти Из ИменаВыделенныхОбластей Цикл
			ОблМакета = ОбластиТД.Найти(ИмяОбласти);
			ОбластьР = ОблМакета.Расшифровка;
			Если ОбластьР = Неопределено ИЛИ ЭтоЗащищеннаяОбласть(ОблМакета) Тогда
			 	Продолжить;	
			КонецЕсли;
			Если ОбластьР.Вид = "Значение" Тогда
				// Поиск строк БДДС.
				СтрОтбор = бит_БюджетированиеКлиентСервер.СформироватьОтборСтрок(ОбластьР);
				НайденныеСтроки = Объект.БДДС.НайтиСтроки(СтрОтбор);
				Если НайденныеСтроки <> Неопределено Тогда
					ОблМакета.Значение = 0;  				
				КонецЕсли;
			КонецЕсли;
			ИзменениеСодержимогоОбласти(ОблМакета, СтрокиДляЗависимых);
		КонецЦикла;
		Если СтрокиДляЗависимых.Количество() > 0 Тогда
			ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСтроку(Команда)
	
	Если ТипЗнч(мБуфер) <> Тип("Массив") Тогда
		Возврат;	
	КонецЕсли;
	
	СтрокиДляЗависимых = Новый Массив();
	Для каждого ВыделеннаяОбласть Из ТабДокДанные.ВыделенныеОбласти Цикл
		Если НЕ бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ВыделеннаяОбласть) Тогда
			Продолжить;	
		КонецЕсли;
		
		ПараметрыВставки = НовыеПараметрыВставкиИзБуфера();
		ЗаполнитьЗначенияСвойств(ПараметрыВставки, ВыделеннаяОбласть);
		
		ПараметрыВставки.Лево  = ВыделеннаяОбласть.Право + 1;
		ПараметрыВставки.Право = ТабДокДанные.ШиринаТаблицы;
		
		ВставитьИзБуфера(мБуфер, ПараметрыВставки, СтрокиДляЗависимых);
	КонецЦикла;
	
	Если СтрокиДляЗависимых.Количество() > 0 Тогда
		ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьБуфер(Команда)
	
	мБуфер = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКопированиеДанныхБюджета(Команда)
	
	ОткрытьОбработкуПолучения("КопированиеБюджета");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучениеДанныхБюджета(Команда)
	
	ОткрытьОбработкуПолучения("ПолучениеБюджета");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКопированиеДанныхГрафиковДоговоров(Команда)
	
	ОткрытьОбработкуПолучения("ГрафикДоговоров");
	                            
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСвязанномуСценарию(Команда)
	
	ОткрытьОбработкуПолучения("ЗаполнениеПоСвязанномуСценарию");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтрокиБюджетаВидимость(Команда)
	
	КомандаСтрокиБюджетаВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолныйЭкран(Команда)
	
	фПолныйЭкран = НЕ фПолныйЭкран;
	ПереключитьПолноэкранныйРежим();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодробныеДанные(Команда)
	
	СкрытьПодробныеДанные = НЕ СкрытьПодробныеДанные;
	ПереключитьПодробныеДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспределитьПоАналитике(Команда)
	
	Если ЗащищеннаяОбласть Тогда
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Выбранная область данных бюджета содержит защищенные ячейки.';
								  |en = 'The selected area of the budget data contains protected cells.'"));
		МассивСтрок.Добавить(НСтр("ru = 'Команда недоступна.';
								  |en = 'Command isn’t available.'"));
		ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	ИначеЕсли ВыделеноНесколькоЯчеек Тогда	
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Выбрано несколько ячеек данных бюджета.';
								  |en = 'Select multiple budget data cells.'"));
		МассивСтрок.Добавить(НСтр("ru = 'Команда недоступна.';
								  |en = 'Command isn’t available.'"));
		ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ТекЭлемент 	  = Элементы.БДДС_Редактирование.ТекущийЭлемент;
	ТекущиеДанные = Элементы.БДДС_Редактирование.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекЭлемент = Неопределено Тогда
			ТекстСообщения = НСтр("ru = 'Не выбрана аналитика для распределения.'; 
								  |en = 'Not selected for distribution analyst.'");
			ТекстЗаголовка = НСтр("ru='Распределить по аналитике';en='Allocate to the dimension'");
			ПоказатьПредупреждение(, ТекстСообщения,, ТекстЗаголовка);
			Возврат;
		КонецЕсли;
		
		Исключения = Новый Структура;
		Исключения.Вставить("Сумма",			НСтр("ru = 'Сумма';en = 'Amount'"));
		Исключения.Вставить("Количество",		НСтр("ru = 'Количество';en = 'Quantity'"));
		Исключения.Вставить("Норма",			НСтр("ru = 'Норма';en = 'Price (rate)'"));
		Исключения.Вставить("Комментарий",		НСтр("ru = 'Комментарий';en = 'Comment'"));
		Исключения.Вставить("НомерСтроки",		НСтр("ru = 'Номер строки';en = 'Line number'"));
		Исключения.Вставить("СтатьяОборотов",	НСтр("ru = 'Статья оборотов';en = 'Line item'"));
		
		ИмяКолонки = СтрЗаменить(ТекЭлемент.Имя, "БДДС_Редактирование","");
		
		Если Исключения.Свойство(ИмяКолонки) Тогда
			ТекстСообщения = НСтр("ru = 'По колонке ""%1"" распределение не предусмотрено.'; 
								  |en = 'By column ""%1"" distribution isn’t provided.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Исключения[ИмяКолонки]);
			ТекстЗаголовка = НСтр("ru='Распределить по аналитике';en='Allocate to the dimension'");
			ПоказатьПредупреждение(, ТекстСообщения,, ТекстЗаголовка);
			Возврат;
		КонецЕсли; 
		
		ТекущееЗначение = ТекущиеДанные[ИмяКолонки];
		
		// Если по статье не ведется учет по данной аналитике - распределение невозможно.
		ТекНастройкиСтатьи = фКэшЗначений.НастройкиСтатей[ТекущиеДанные.СтатьяОборотов];
		Если ТекНастройкиСтатьи <> Неопределено Тогда
			 ЕстьУчет = Ложь;
			 ТекНастройкиСтатьи.Свойство("Учет_"+ИмяКолонки, ЕстьУчет);
			 Если ЕстьУчет <> Истина Тогда
				 ТекстСообщения = НСтр("ru='Для статьи %1 учет по аналитике %2 не ведется. Распределение невозможно.';
					 				   |en='For the article %1 account analytics %2 isn’t conducted. It can not be distributed.'");
				 ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущиеДанные.СтатьяОборотов, ИмяКолонки);
				 ПоказатьПредупреждение(, ТекстСообщения,, НСтр("ru='Распределить по аналитике';en='Allocate to the dimension'"));
			 	 Возврат;
			 КонецЕсли; 
		КонецЕсли; 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Вид", ПредопределенноеЗначение("Перечисление.бит_ВидыПрофилейРаспределения.ПоАналитике"));
		ПараметрыФормы.Вставить("ИмяКолонки", ИмяКолонки);
		ПараметрыФормы.Вставить("ТекущееЗначение", ТекущееЗначение);

		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ТекущаяСтрока", Элементы.БДДС_Редактирование.ТекущаяСтрока);
		Оповещение = Новый ОписаниеОповещения("РаспределитьПоАналитикеЗавершение", ЭтотОбъект, ДопПараметры);
	    РежимОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		
		ОткрытьФорму("Обработка.бит_РаспределениеБюджетныхДанныхПоПрофилю.Форма", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОкна);
	КонецЕсли; 	
	
КонецПроцедуры

// Процедура обработчик оповещения "РаспределитьПоАналитикеЗавершение".
//
// Параметры:
// РезДанные - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура РаспределитьПоАналитикеЗавершение(РезДанные, ДополнительныеДанные) Экспорт

	Если ТипЗнч(РезДанные) = Тип("Структура") Тогда
		МассивСтрок = Элементы.БДДС_Редактирование.ВыделенныеСтроки;
		ВыполнитьРаспределение(МассивСтрок, РезДанные);
		Обл = Элементы.ТабДокДанные.ТекущаяОбласть;
		ОбластьР = Обл.Расшифровка;
		СтрокиДляЗависимых = Новый Массив();
		ОбновитьЗначениеЯчейкиДерева(Обл, ОбластьР, СтрокиДляЗависимых);
		ОбновитьПарнуюЯчейки(Обл, СтрокиДляЗависимых);
		Если СтрокиДляЗависимых.Количество() > 0 Тогда
			ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспределитьПоПериодамДерево(Команда)
	
	Если АктивнаРедактируемаяЯчейка() Тогда
		ОблМакета = ТабДокДанные.ТекущаяОбласть;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Вид", ПредопределенноеЗначение("Перечисление.бит_ВидыПрофилейРаспределения.ПоПериодам"));
		ПараметрыФормы.Вставить("Сценарий", Объект.Сценарий);
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Расшифровка", ОблМакета.Расшифровка);
		
		Оповещение = Новый ОписаниеОповещения("РаспределитьПоПериодамДеревоЗавершение", ЭтотОбъект, ДопПараметры);
		РежимОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОткрытьФорму("Обработка.бит_РаспределениеБюджетныхДанныхПоПрофилю.Форма.Форма",ПараметрыФормы,ЭтотОбъект,,,,Оповещение,РежимОкна);
		Модифицированность = Истина;		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "РаспределитьПоПериодамДеревоЗавершение".
//
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура РаспределитьПоПериодамДеревоЗавершение(РезДанные, ДополнительныеДанные) Экспорт

	Если ТипЗнч(РезДанные) = Тип("Структура") Тогда
		ИзмененныеПериоды = ВыполнитьРаспределениеПоПериодам(ДополнительныеДанные.Расшифровка, РезДанные);
		ШаблонИмени = Лев(ДополнительныеДанные.Расшифровка.Имя,3)+"%Период%"+Сред(ДополнительныеДанные.Расшифровка.Имя,12);
		СтрокиДляЗависимых = Новый Массив();
		Для Каждого ТекПериод Из ИзмененныеПериоды Цикл
			ТекИмя = СтрЗаменить(ШаблонИмени, "%Период%", Формат(ТекПериод,"ДФ=yyyyMMdd"));
			ТекОбл = ТабДокДанные.Области.Найти(ТекИмя);
			Если ЭтоЗащищеннаяОбласть(ТекОбл) Тогда
				Продолжить;
			КонецЕсли;
			Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ТекОбл) Тогда
				ОбновитьЗначениеЯчейкиДерева(ТекОбл, ТекОбл.Расшифровка, СтрокиДляЗависимых);
				ОбновитьПарнуюЯчейки(ТекОбл, СтрокиДляЗависимых);		
			КонецЕсли; 
		КонецЦикла;
		Если СтрокиДляЗависимых.Количество() > 0 Тогда
			ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспределить(Команда)
	
	Если ЗащищеннаяОбласть Тогда
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Выбранная область данных бюджета содержит защищенные ячейки.';
								  |en = 'The selected area of the budget data contains protected cells.'"));
		МассивСтрок.Добавить(НСтр("ru = 'Команда недоступна.';
								  |en = 'Command isn’t available.'"));
		ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	ИначеЕсли ВыделеноНесколькоЯчеек Тогда	
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'Выбрано несколько ячеек данных бюджета.';
								  |en = 'Select multiple budget data cells.'"));
		МассивСтрок.Добавить(НСтр("ru = 'Команда недоступна.';
								  |en = 'Command isn’t available.'"));
		ТекстОшибки = СтрСоединить(МассивСтрок, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
		
	ТекЭлемент 	  = Элементы.ЗависимыеОбороты_Редактирование.ТекущийЭлемент;
	ТекущиеДанные = Элементы.ЗависимыеОбороты_Редактирование.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекЭлемент = Неопределено Тогда
			ТекстСообщения = НСтр("ru = 'Не выбраны период или аналитика для распределения.'; 
								  |en = 'No period or dimension has been selected for distribution.'");
			ТекстЗаголовка = НСтр("ru='Распределить';en='Distribute'");
			ПоказатьПредупреждение(, ТекстСообщения,, ТекстЗаголовка);
			Возврат;
		КонецЕсли;
		
		Исключения = Новый Структура;
		Исключения.Вставить("Сумма",			НСтр("ru = 'Сумма';en = 'Amount'"));
		Исключения.Вставить("Количество",		НСтр("ru = 'Количество';en = 'Quantity'"));
		Исключения.Вставить("Норма",			НСтр("ru = 'Норма';en = 'Price (rate)'"));
		Исключения.Вставить("Комментарий",		НСтр("ru = 'Комментарий';en = 'Comment'"));
		Исключения.Вставить("НомерСтроки",		НСтр("ru = 'Номер строки';en = 'Line number'"));
		Исключения.Вставить("СтатьяОборотов",	НСтр("ru = 'Статья оборотов';en = 'Line item'"));
		
		ИмяКолонки = СтрЗаменить(ТекЭлемент.Имя, "ЗависимыеОбороты_Редактирование","");
		
		Если Исключения.Свойство(ИмяКолонки) Тогда
			ТекстСообщения = НСтр("ru = 'По колонке ""%1"" распределение не предусмотрено.'; 
								  |en = 'By column ""%1"" distribution isn’t provided.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Исключения[ИмяКолонки]);
			ТекстЗаголовка = НСтр("ru='Распределить';en='Distribute'");
			ПоказатьПредупреждение(, ТекстСообщения,, ТекстЗаголовка);
			Возврат;
		КонецЕсли; 
		
		ТекущееЗначение = ТекущиеДанные[ИмяКолонки];
		
		Если ИмяКолонки = "Период" Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Вид"	  , ПредопределенноеЗначение("Перечисление.бит_ВидыПрофилейРаспределения.ПоПериодам"));
			ПараметрыФормы.Вставить("Сценарий", Объект.Сценарий);
			
		Иначе		
			
			// Если по статье не ведется учет по данной аналитике - распределение невозможно.
			ТекНастройкиСтатьи = фКэшЗначений.НастройкиСтатей[ТекущиеДанные.СтатьяОборотов];
			Если ТекНастройкиСтатьи <> Неопределено Тогда
				 ЕстьУчет = Ложь;
				 ТекНастройкиСтатьи.Свойство("Учет_"+ИмяКолонки, ЕстьУчет);
				 Если ЕстьУчет <> Истина Тогда
					 ТекстСообщения = НСтр("ru='Для статьи %1 учет по аналитике %2 не ведется. Распределение невозможно.';
						 				   |en='For the article %1 account analytics %2 isn’t conducted. It can not be distributed.'");
					 ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущиеДанные.СтатьяОборотов, ИмяКолонки);
					 ПоказатьПредупреждение(, ТекстСообщения,, НСтр("ru='Распределить по аналитике';en='Allocate to the dimension'"));
				 	 Возврат;
				 КонецЕсли; 
			КонецЕсли; 
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Вид"	  		 , ПредопределенноеЗначение("Перечисление.бит_ВидыПрофилейРаспределения.ПоАналитике"));
			ПараметрыФормы.Вставить("ИмяКолонки"	 , ИмяКолонки);
			ПараметрыФормы.Вставить("ТекущееЗначение", ТекущееЗначение);
			
		КонецЕсли;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ТекущаяСтрока", Элементы.ЗависимыеОбороты_Редактирование.ТекущаяСтрока);
		Оповещение = Новый ОписаниеОповещения("РаспределитьЗавершение", ЭтотОбъект, ДопПараметры);
	    РежимОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		
		ОткрытьФорму("Обработка.бит_РаспределениеБюджетныхДанныхПоПрофилю.Форма", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОкна);
	
	КонецЕсли; 	
	
КонецПроцедуры

// Процедура обработчик оповещения "РаспределитьПоАналитикеЗавершение".
//
// Параметры:
// РезДанные - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура РаспределитьЗавершение(РезДанные, ДополнительныеДанные) Экспорт

	Если ТипЗнч(РезДанные) = Тип("Структура") Тогда	
		МассивСтрок = Элементы.ЗависимыеОбороты_Редактирование.ВыделенныеСтроки;
		ВыполнитьРаспределениеЗависимых(МассивСтрок, РезДанные);
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИменаВыделенныхОбластей()

	ИменаВыделенныхОбластей = Новый Массив;
	ВыделенныеОбласти = ТабДокДанные.ВыделенныеОбласти;
	
	Если ВыделенныеОбласти.Количество() = 1 Тогда
		ОблВыделения = ТабДокДанные.ТекущаяОбласть;
	   	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблВыделения) Тогда
			// Необходимо определить координаты всех ячеек выделенной области
			// и обойти по отдельности эти ячейки.
			ДельтаГ = ОблВыделения.Право - ОблВыделения.Лево + 1;
			ДельтаВ = ОблВыделения.Низ   - ОблВыделения.Верх + 1;				
			ЛевоНач = ОблВыделения.Лево;
			ВерхНач = ОблВыделения.Верх;
			Для нг = 1 По ДельтаГ Цикл
				Лево = ЛевоНач + нг-1;
				Для нв = 1 По ДельтаВ Цикл
					Верх = ВерхНач + нв-1;
					ОблМакета = ТабДокДанные.Область(Верх, Лево, Верх, Лево);
					// Если выделенная ячейка является ячейкой вида Значение - сохраним имя.
					ОбластьР = ОблМакета.Расшифровка;
					Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОбластьР, "РасшифровкаЯчейкиФормыВвода") И ОбластьР.Вид = "Значение" Тогда
						ИменаВыделенныхОбластей.Добавить(ОблМакета.Имя);
					КонецЕсли;	// ИмяКласса подходит.
				КонецЦикла; 
			КонецЦикла; 
		КонецЕсли; // ОблМакета подходит.
	Иначе	
		Для Каждого ОблМакета Из ВыделенныеОбласти Цикл
			ОбластьР = ОблМакета.Расшифровка;
			Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОбластьР, "РасшифровкаЯчейкиФормыВвода") И ОбластьР.Вид = "Значение" Тогда
				ИменаВыделенныхОбластей.Добавить(ОблМакета.Имя);
			КонецЕсли;	// ИмяКласса подходит.
		КонецЦикла;
	КонецЕсли;	

	Возврат ИменаВыделенныхОбластей;
	
КонецФункции

&НаКлиенте
Процедура КомандаИзменить(Команда)
	
	Если АктивнаРедактируемаяЯчейка() Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СуммаПример", ТабДокДанные.ВыделенныеОбласти[0].Значение);
		
		ИменаВыделенныхОбластей = ПолучитьИменаВыделенныхОбластей();
		
		ДопПараметры = Новый Структура("ИменаВыделенныхОбластей", ИменаВыделенныхОбластей);
		Оповещение = Новый ОписаниеОповещения("ИзменитьЗавершение", ЭтотОбъект, ДопПараметры);
		
		ОткрытьФорму("Документ.бит_ФормаВводаБюджета.Форма.ФормаПараметровИзменения", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат <> КодВозвратаДиалога.Отмена Тогда
			
	    Модифицированность = Истина;
		
		ЭтоПроцент  = Результат.ЭтоПроцент;
		ЗначениеИзм = Результат.Значение;
		
		ИменаВыделенныхОбластей = ДопПараметры.ИменаВыделенныхОбластей;
		ОбластиТД = ТабДокДанные.Области;
		
		СтрокиДляЗависимых = Новый Массив();
		Для Каждого ИмяОбласти Из ИменаВыделенныхОбластей Цикл
			ОблМакета = ОбластиТД.Найти(ИмяОбласти);
			ОбластьР = ОблМакета.Расшифровка;
			Если ОбластьР = Неопределено ИЛИ ЭтоЗащищеннаяОбласть(ОблМакета) Тогда
			 	Продолжить;	
			КонецЕсли;
			Если ОбластьР.Вид = "Значение" Тогда
				// Поиск строк БДДС.
				СтрОтбор = бит_БюджетированиеКлиентСервер.СформироватьОтборСтрок(ОбластьР);
				НайденныеСтроки = Объект.БДДС.НайтиСтроки(СтрОтбор);
				Если НайденныеСтроки <> Неопределено Тогда
					// Исходная сумма в ячейке.
					ИсхСуммаЯч = ОблМакета.Значение;
					// Расчит суммы, которую нужно получить в ячейке.
					Если ЭтоПроцент Тогда
						ПроцентЧисло = ИсхСуммаЯч * ЗначениеИзм / 100;
						РезСуммаЯч = ИсхСуммаЯч + ПроцентЧисло;
					Иначе	
						РезСуммаЯч = ИсхСуммаЯч + ЗначениеИзм;
					КонецЕсли;
					ОблМакета.Значение = РезСуммаЯч;  				
				КонецЕсли;
			КонецЕсли;
			ИзменениеСодержимогоОбласти(ОблМакета, СтрокиДляЗависимых);
			ОбновитьПарнуюЯчейки(ОблМакета, СтрокиДляЗависимых);
		КонецЦикла;
		Если СтрокиДляЗависимых.Количество() > 0 Тогда
			ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислятьФормулыПриВводеДа(Команда)
	
	Объект.ВычислятьФормулыПриВводе = Истина;
	УправлениеМенюРасчеты(ЭтотОбъект);
	ВосстановитьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислятьФормулыПриВводеНет(Команда)
	
	Объект.ВычислятьФормулыПриВводе = Ложь;
	УправлениеМенюРасчеты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьБДДС(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьИзменениеТабличнойЧасти", ЭтотОбъект);

	ПараметрыФормы = ПараметрыИзмененияТаблицыДокумента("БДДС");
	ОткрытьФорму("Обработка.бит_ИзменениеТабличнойЧастиДокументаБюджетирования.Форма", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗависимые(Команда)
		
	Оповещение = Новый ОписаниеОповещения("ОбработатьИзменениеТабличнойЧасти", ЭтотОбъект);

	ПараметрыФормы = ПараметрыИзмененияТаблицыДокумента("ЗависимыеОбороты");
	ОткрытьФорму("Обработка.бит_ИзменениеТабличнойЧастиДокументаБюджетирования.Форма", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение);

КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ОбработатьИзменениеТабличнойЧасти(Результат, Дополнительно) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ИмяТабличнойЧасти		  = Результат.ИмяТабличнойЧасти;
	АдресВоВременномХранилище = Результат.АдресВоВременномХранилище;
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресВоВременномХранилище) Тогда
		Возврат;
	КонецЕсли; 
	
	ОбработатьИзменениеТабличнойЧастиНаСервере(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаАвтовидимостьКолонок(Команда)
	
	АвтовидимостьКолонок = НЕ АвтовидимостьКолонок;	
	Элементы.ФормаКомандаАвтовидимостьКолонок.Пометка = АвтовидимостьКолонок;
	ОбработчикТабДокДанныеПриАктивизацииОбласти();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемыСвойства

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойств

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбщиеСлужебныеПроцедурыИФункции

// Процедура заполняет значения, необходимые на клинте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	ТекПользователь = Пользователи.ТекущийПользователь();	
	
	фКэшЗначений = Новый Структура;
	фКэшЗначений.Вставить("ИзмеренияДоп", бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним"));
	фКэшЗначений.Вставить("ИзмеренияВсе", бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все","синоним"));
	фКэшЗначений.Вставить("НастройкиИзмерений" , бит_Бюджетирование.НастройкиИзмеренийБюджетирования()); 
	фКэшЗначений.Вставить("НастройкиФормы"     , Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(Объект.НастройкаФормы));
	фКэшЗначений.Вставить("ТекущийПользователь", ТекПользователь);	
	фКэшЗначений.Вставить("ВидСравненияРавно"  , ВидСравнения.Равно);
	фКэшЗначений.Вставить("ПроводитьПослеУтверждения", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ПроводитьДокументыПослеУтверждения"));
	фКэшЗначений.Вставить("ВыделятьАргументы", бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ВыделятьАргументыФормулФормыВвода", ТекПользователь));
	
	// Параметры, используемые для управления автовидимостью колонок.
	фКэшЗначений.Вставить("НастройкаВидимостиКолонок"	 , Новый Структура);
	фКэшЗначений.Вставить("МассивСтатей_БДДС"			 , Новый Массив);
	фКэшЗначений.Вставить("МассивСтатей_ЗависимыеОбороты", Новый Массив);
	
	фКэшЗначений.Вставить("СтруктураДопПолей", Новый Структура("Учет_Сумма, Учет_Количество", "Норма","Норма"));
	
	фКэшЗначений.Вставить("НастройкиСтатей", Новый Соответствие);
	
	// Запишем параметр для формирования заголовка.
	фКэшЗначений.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);	
	
	// Заполним массив полей таб. поля БДДС_Редактирование.
	ИменаПолей = Новый Массив;
	Исключения = Новый Массив;
	Исключения.Добавить("НомерСтроки");
	Исключения.Добавить("ИД");
	Исключения.Добавить("Измерение");
	Исключения.Добавить("Период");
	Исключения.Добавить("Норма");
	Исключения.Добавить("Комментарий");
	Исключения.Добавить("СтатьяОборотов");
	
	Для Каждого Эл Из Элементы.БДДС_Редактирование.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Эл) = Тип("ПолеФормы") Тогда
			ИмяРеквизита = СтрЗаменить(Эл.Имя, "БДДС_Редактирование", "");
			Если Исключения.Найти(ИмяРеквизита) = Неопределено Тогда
				ИменаПолей.Добавить(ИмяРеквизита);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	фКэшЗначений.Вставить("ПоляАналитикРедактирование", ИменаПолей);
	
	Бюджет = фКэшЗначений.НастройкиФормы.Бюджет;
	
КонецПроцедуры

&НаСервере
Функция НастройкиДополнительныхИзмерений()

	Возврат бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений();	

КонецФункции

// Процедура восстанавливает отбор из хранилища значения.
// 
// Параметры:
//  СохраненнаяНастройка - Структура.
// 
&НаСервере
Процедура ВосстановитьОтбор(СохраненнаяНастройка)

	Если СохраненнаяНастройка.Свойство("НастройкиКомпоновщика") 
		И ТипЗнч(СохраненнаяНастройка.НастройкиКомпоновщика) = Тип("НастройкиКомпоновкиДанных")  Тогда
		
		НастройкиИсточник = СохраненнаяНастройка.НастройкиКомпоновщика;
		// ++ NB Очистку ваполнять при сохранении настроек. 

		НастройкиПриемник = Компоновщик.ПолучитьНастройки();
		бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(НастройкиПриемник.Отбор, НастройкиИсточник.Отбор, Ложь);
		//бит_ОтчетыБФКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(НастройкиПриемник, НастройкиИсточник);
		
		Если ЗначениеЗаполнено(Бюджет) Тогда
			бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиПриемник, "Бюджет", Бюджет);			
		КонецЕсли;
		
		Компоновщик.ЗагрузитьНастройки(НастройкиПриемник);
		
	Иначе
		// ++ NB Изучить, принять решение. 
		// Если сохранена еще старая настройка выполним конвертацию отбора построителя в отбор компоновщика.
		бит_МеханизмПолученияДанных.КонвертацияОтборПостроителяОтборКомпоновщика(СохраненнаяНастройка, Компоновщик, ТекстЗапроса);
	КонецЕсли; 
	
КонецПроцедуры

// Выполняет замену аналитики по-умолчанию. 
// 
// Параметры:
//  Имя - Строка.
//  Значение - Произвольный.
// 
&НаСервере
Процедура ВыполнитьЗаменуАналитикиПоУмолчанию(Имя, Значение)

   Для Каждого СтрокаТаблицы Из Объект.БДДС Цикл
   	  СтрокаТаблицы[Имя] = Значение;
   КонецЦикла; 	
  
   Для Каждого СтрокаТаблицы Из Объект.БДДС Цикл
   	 СтрокаТаблицы[Имя] = Значение;
   КонецЦикла; 

КонецПроцедуры

// Процедура обрабатывает изменение сценария в случае, когда необходимо очищать данные. 
// 
&НаСервере
Процедура ИзменениеСценарияОчисткаДанных()
	
	ОчиститьВсе(ЭтотОбъект);
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ИзменениеСценарияОбъект(Истина);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

// Функция определяет, что произойдет в результате изменения сценария.
// 
// Параметры:
//  ПредСценарий - СправочникСсылка.СценарииПланирования.
// 
// Возвращаемое значение:
//  РезСтр - Строка.
// 
&НаСервере
Функция АнализИзмененийСценария(ПредСценарий)

	РезСтр = Новый Структура;
	ИзменитсяВалюта = ИзменитсяВалюта();
	РезСтр.Вставить("ИзменитсяВалюта", ИзменитсяВалюта);
	МожноИзменятьСценарий = Истина;
	Если Объект.НастройкаФормы.Вид = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет Тогда 
		Если ЗначениеЗаполнено(Объект.Сценарий) И ЗначениеЗаполнено(Объект.НастройкаФормы) Тогда
			Если Объект.Сценарий.бит_Периодичность <> Объект.НастройкаФормы.ПериодичностьПланирования Тогда
				// В случае фиксированного макета переодичность сценария должна совпадать с периодичностью макета.
				МожноИзменятьСценарий = Ложь;
			КонецЕсли;
		КонецЕсли; 	
	Иначе	
		Если ЗначениеЗаполнено(Объект.Сценарий) И ЗначениеЗаполнено(ПредСценарий) Тогда
			МожноИзменятьСценарий = ?(Объект.Сценарий.бит_Периодичность = ПредСценарий.бит_Периодичность, Истина, Ложь);
		КонецЕсли; 
	КонецЕсли; 
	РезСтр.Вставить("МожноИзменятьСценарий", МожноИзменятьСценарий);
	Возврат РезСтр;
	
КонецФункции

// Процедура обрабатывает изменение сценария. 
// 
&НаСервере
Процедура ИзменениеСценария(ПересчитатьСуммы, ПерезаполнитьНормы)
	
	ВалютаНач = Объект.ВалютаДокумента;
	СтрНач = бит_КурсыВалют.СтруктураКурса(ВалютаНач, Объект.КурсДокумента, Объект.КратностьДокумента);		
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ИзменениеСценарияОбъект(Ложь);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	СтрКон = бит_КурсыВалют.СтруктураКурса(Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);
		
	Если ПересчитатьСуммы И ЗначениеЗаполнено(ВалютаНач) Тогда
		КурсыДок = Новый Структура("Нач, Кон", СтрНач, СтрКон);
		ПересчитатьТабличныеЧастиПоВалюте(КурсыДок);
	КонецЕсли; // Пересчитать.
	
	Если ПерезаполнитьНормы И НЕ Объект.ЗаполнятьПоЦенамНоменклатуры Тогда
		бит_Бюджетирование.ПерезаполнитьНормыТабЧасти(Объект.ПараметрНорм, Объект.Сценарий, Объект.БДДС, СтрКон, фИменаПараметраНорм, Объект.ЕдиницаИзмеренияСумм);
	КонецЕсли; 		
	
	Если ПересчитатьСуммы ИЛИ ПерезаполнитьНормы Тогда
		ВосстановитьДерево();
	КонецЕсли; 
	
КонецПроцедуры

// Процедура, проводящая изменения периодов в таблицах.
//
&НаСервере
Процедура ИзменитьПериодыТаблиц(Знач СтараяДатаНачала, Знач СтараяДатаОкончания)

	Если НЕ ЗначениеЗаполнено(Объект.Сценарий) Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыСценария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Сценарий, "бит_Периодичность, ПродолжительностьИнтервала");
	Периодичность = ПараметрыСценария.бит_Периодичность;
	ПродолжительностьИнтервала = ПараметрыСценария.ПродолжительностьИнтервала;
	СдвигНачало = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(СтараяДатаНачала, ПериодПланирования.ДатаНачала, Периодичность);
	Если ЗначениеЗаполнено(СтараяДатаОкончания) Тогда
		СдвигКонец = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(СтараяДатаОкончания, ПериодПланирования.ДатаОкончания, Периодичность);
	Иначе	
		СтараяДатаОкончания = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ПериодПланирования.ДатаНачала, ПродолжительностьИнтервала-1, Периодичность);
		СдвигКонец = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(СтараяДатаОкончания, ПериодПланирования.ДатаОкончания, Периодичность);
	КонецЕсли;
	Если СдвигНачало = 0 И СдвигКонец = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Периоды = Новый Соответствие;
	Для каждого ТекущаяСтрока Из Объект.БДДС Цикл
		ТекущаяСтрока.Период = Документы.бит_ФормаВводаБюджета.ПреобразоватьПериод(ТекущаяСтрока.Период, СдвигНачало, Периодичность, Периоды);
	КонецЦикла;
	Для каждого ТекущаяСтрока Из Объект.ЗависимыеОбороты Цикл
		ТекущаяСтрока.Период = Документы.бит_ФормаВводаБюджета.ПреобразоватьПериод(ТекущаяСтрока.Период, СдвигНачало, Периодичность, Периоды);
	КонецЦикла;
	
	ВосстановитьДерево(Истина, Истина, Истина);
	
КонецПроцедуры

// Процедура обрабатывает изменение валюты.
// 
&НаСервере
Процедура ИзменениеВалюты(ПересчитатьСуммы, ВалютаНач = Неопределено)
	
	СтрНач = бит_КурсыВалют.СтруктураКурса(ВалютаНач, Объект.КурсДокумента, Объект.КратностьДокумента);	
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ИзменениеВалюты();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Если ПересчитатьСуммы И ЗначениеЗаполнено(ВалютаНач) Тогда
		СтрКон = бит_КурсыВалют.СтруктураКурса(Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);
		КурсыДок = Новый Структура("Нач, Кон", СтрНач, СтрКон);
		ПересчитатьТабличныеЧастиПоВалюте(КурсыДок);
		ВосстановитьДерево();
	КонецЕсли; // Пересчитать.	
	
КонецПроцедуры

// Обрабатывает изменение контрагента. 
// 
&НаСервере
Процедура ИзменениеКонтрагента()
	
	бит_РаботаСДиалогамиСервер.ПроверитьВладельцаДоговораКонтрагентаВСтроке(Объект.Контрагент, Объект.ДоговорКонтрагента);
	
КонецПроцедуры

// Обрабатывает изменение договора контрагента. 
// 
&НаСервере
Процедура ИзменениеДоговораКонтрагента()

  бит_РаботаСДиалогамиСервер.ИзменениеДоговораКонтрагента(Объект.ДоговорКонтрагента, Объект.Контрагент);	

КонецПроцедуры

// Процедура устанавливает параметры выбора статей оборотов, в зависимости от настройки формы ввода бюджета.
// 
&НаСервере
Процедура УстановитьПараметрыВыбораСтатей()
	
	ИзмеренияРазворачивать = фКэшЗначений.НастройкиФормы.СпособыЗаполнения[ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать")];
	Если ИзмеренияРазворачивать.Найти("СтатьяОборотов") = Неопределено Тогда
		// Если разворот не по статьям, выбирать можно только те статьи, 
		// в которых ведется учет как минимум разворачиваемых аналитик.
		СтрОтбор = Новый Структура;
		Для Каждого Имя Из ИзмеренияРазворачивать Цикл
			СтрОтбор.Вставить("Учет_"+Имя, Истина);
		КонецЦикла; 
		бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элементы.БДДС_РедактированиеСтатьяОборотов, СтрОтбор);
		бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элементы.СтатьяОборотов, СтрОтбор);
	КонецЕсли; 
	
КонецПроцедуры

// Выполняет обновление дерева данных. 
// 
&НаСервере
Процедура ОбновитьДерево(ОчищатьТаблицы)
	
	// Очистим таблицу с данными.
	Если ОчищатьТаблицы Тогда
		ОчиститьТаблицы(ЭтотОбъект);
	КонецЕсли; 
	
	РеквизитыСценария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Сценарий, "бит_Периодичность, ПродолжительностьИнтервала");

	ПараметрыОбновления = Документы.бит_ФормаВводаБюджета.НовыеПараметрыДерева();
	ПараметрыОбновления.СхемаКомпоновкиДанных 		= ПолучитьИзВременногоХранилища(АдресКомпоновки);
	ПараметрыОбновления.НастройкиКомпоновщика		= Компоновщик.ПолучитьНастройки();
	ПараметрыОбновления.ДатаНачалаПланирования 		= Объект.ДатаНачалаПланирования;
	ПараметрыОбновления.ДатаОкончанияПланирования 	= Объект.ДатаОкончанияПланирования;
	ПараметрыОбновления.Периодичность			    = РеквизитыСценария.бит_Периодичность;
	ПараметрыОбновления.ПродолжительностьИнтервала  = РеквизитыСценария.ПродолжительностьИнтервала;
	
	Документы.бит_ФормаВводаБюджета.ОбновитьДеревоДанных(ТабДокДанные, Объект.НастройкаФормы, ТекстЗапроса, ПараметрыОбновления);
	
	Документы.бит_ФормаВводаБюджета.ЗаполнитьТаблицуДанных(ТабДокДанные, АдресХранилищаДанных);
	Документы.бит_ФормаВводаБюджета.ЗаполнитьСписокСмежности(ТабДокДанные, АдресХранилищаСпискаСмежности);
	
	МассивСтатей = ИзвлечьСтатьиИзДерева(ТабДокДанные);
	фКэшЗначений.НастройкиСтатей = Новый Соответствие;	
    бит_Бюджетирование.ПолучитьНастройкиСтатейОборотов(МассивСтатей, фКэшЗначений.НастройкиСтатей);
	
	ИменаТаблиц = Новый Массив;  
	ИменаТаблиц.Добавить("БДДС");
	ИменаТаблиц.Добавить("БДДС_Редактирование");
	ОФормитьТаблицу("БДДС", ИменаТаблиц, МассивСтатей);
	
	ИменаТаблиц = Новый Массив;  
	ИменаТаблиц.Добавить("ЗависимыеОбороты");
	ИменаТаблиц.Добавить("ЗависимыеОбороты_Редактирование");
	ОФормитьТаблицу("ЗависимыеОбороты", ИменаТаблиц, МассивСтатей);																		
	
	УправлениеВидимостьюКолонокТаблиц();
	
КонецПроцедуры

// Восстанавливает дерево данных по табличным частям. 
// 
&НаСервере
Процедура ВосстановитьДерево(ВыводитьСообщения = Ложь, УдалятьЛишниеСтроки = Ложь, ОбновитьДерево = Ложь)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВосстановленияДерева = Документы.бит_ФормаВводаБюджета.НовыеПараметрыДерева();
	ПараметрыВосстановленияДерева.ВыводитьСообщения		= ВыводитьСообщения;
	ПараметрыВосстановленияДерева.СхемаКомпоновкиДанных	= ПолучитьИзВременногоХранилища(АдресКомпоновки);
	ПараметрыВосстановленияДерева.НастройкиКомпоновщика	= Компоновщик.ПолучитьНастройки();
	ПараметрыВосстановленияДерева.УдалитьЛишнее			= УдалятьЛишниеСтроки;
	ПараметрыВосстановленияДерева.ОбновитьДерево		= ОбновитьДерево;

	ДокументОбъект.ВосстановитьДеревоПоДанным(АдресХранилищаДанных, АдресХранилищаСпискаСмежности,
		ЭтотОбъект.УникальныйИдентификатор, ТабДокДанные, Объект.НастройкаФормы, ТекстЗапроса,
		ПараметрыВосстановленияДерева);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	МассивСтатей = ИзвлечьСтатьиИзДерева(ТабДокДанные);	
	фКэшЗначений.НастройкиСтатей = Новый Соответствие;
    бит_Бюджетирование.ПолучитьНастройкиСтатейОборотов(МассивСтатей, фКэшЗначений.НастройкиСтатей);
	
	ИменаТаблиц = Новый Массив;  
	ИменаТаблиц.Добавить("БДДС");
	ИменаТаблиц.Добавить("БДДС_Редактирование");
	ОФормитьТаблицу("БДДС", ИменаТаблиц, МассивСтатей);
	
	ИменаТаблиц = Новый Массив;  
	ИменаТаблиц.Добавить("ЗависимыеОбороты");
	ИменаТаблиц.Добавить("ЗависимыеОбороты_Редактирование");
	ОФормитьТаблицу("ЗависимыеОбороты", ИменаТаблиц, МассивСтатей);																		
	
	УправлениеВидимостьюКолонокТаблиц();
	
КонецПроцедуры

// Процедура очищает табличные части ЗависимыеОбороты и БДДС.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТаблицы(Форма)

	Объект = Форма.Объект;
	Объект.БДДС.Очистить();
	Объект.ЗависимыеОбороты.Очистить();

КонецПроцедуры

// Очищает таблицы данных и дерево данных. 
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьВсе(Форма)

	Форма.ТабДокДанные = Новый ТабличныйДокумент;
	ОчиститьТаблицы(Форма);
	
КонецПроцедуры

// Очищает таблицы "ХранилищеДанных" и "ХранилищеСпискаСмежности". 
// 
&НаСервере
Процедура ОчиститьДополнительныеТаблицы()
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресХранилищаДанных);
	ТаблицаДанных.Очистить();
	ПоместитьВоВременноеХранилище(ТаблицаДанных, АдресХранилищаДанных);
	СписокСмежности = бит_БюджетированиеКлиентСервер.СписокСмежности(ТабДокДанные);
	ПоместитьВоВременноеХранилище(СписокСмежности, АдресХранилищаСпискаСмежности);
	
КонецПроцедуры

// Процедура устанавливает ид строки на клиенте. 
// 
// Параметры:
//  ТекущаяСтрока - Строка.
// 
&НаКлиенте
Процедура УстановитьИД_БДДС_Клиент(ТекущаяСтрока)

	ТекущаяСтрока.ИД = ТекИдБДДС;
	ТекИдБДДС = ТекИдБДДС + 1;

КонецПроцедуры

// Процедура устанавливает ид строки на сервере. 
// 
// Параметры:
//  ТекущаяСтрока - Строка.
// 
&НаСервере
Процедура УстановитьИД_БДДС_Сервер(ТекущаяСтрока)

	ТекущаяСтрока.ИД = ТекИдБДДС;
	ТекИдБДДС = ТекИдБДДС + 1;

КонецПроцедуры

// Создает новую строку табличной части БДДС.
// 
// Параметры:
//  Расшифровка   - Структура.
//  НовоеЗначение - Число.
// 
&НаСервере
Процедура СоздатьНовуюСтрокуБюджета(Расшифровка, НовоеЗначение)
	
	НоваяСтрока = Объект.БДДС.Добавить();
	
	бит_БюджетированиеКлиентСервер.ЗаполнитьНовуюСтрокуБюджета(Объект, НоваяСтрока, Расшифровка.Период, Расшифровка.Измерения, фКэшЗначений.НастройкиФормы.Измерения);
	УстановитьИД_БДДС_Сервер(НоваяСтрока);
	
	// Заполнение ресурсов.
	НоваяСтрока[Расшифровка.ИмяРесурса] = НовоеЗначение;
	
	Если ЗначениеЗаполнено(НоваяСтрока.СтатьяОборотов) Тогда
		ИзменениеСтатьиОборотовВТабличнойЧасти(НоваяСтрока,"БДДС", "БДДС_Редактирование", Ложь);
	КонецЕсли; 
	
	// Период ставим, т.к. он безусловно обрабатывается.
	ЗаполнитьНорму(ЭтотОбъект, НоваяСтрока, "БДДС", "Период");		
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюСтрокуБюджета_Клиент(Расшифровка, НовоеЗначение, СтрокиДляЗависимых, ЭтоРасчетная = Ложь)

	НоваяСтрока = Объект.БДДС.Добавить();
	
	// Установка ИД строки.
	УстановитьИД_БДДС_Клиент(НоваяСтрока);	
	
	// Заполнение аналитики.
	бит_БюджетированиеКлиентСервер.ЗаполнитьНовуюСтрокуБюджета(Объект, НоваяСтрока, Расшифровка.Период, Расшифровка.Измерения, фКэшЗначений.НастройкиФормы.Измерения);
	
	// Заполнение ресурсов
	НоваяСтрока[Расшифровка.ИмяРесурса] = НовоеЗначение;
	
	// Признак того, что значение было рассчитано по формуле.
	НоваяСтрока.Расчетная = ЭтоРасчетная;
	
	// Вызов механизма заполнения норм.	
	ЗаполнитьНорму(ЭтотОбъект, НоваяСтрока.ПолучитьИдентификатор(), "БДДС", "Период");
	
	// При вводе даных в макет (ячейка "Сумма"): если строк БДДС нет, создается новая строка.
	// Количество в этой строке, естественно, не устаналивается, поэтому рассчет "Сумма = Цена * Количество" в нормировании,
	// обнуляет то, что было получено в "НоваяСтрока[Расшифровка.ИмяРесурса] = НовоеЗначение;".
	// Приведем к исходному.
	Если Расшифровка.ИмяРесурса = "Сумма" И НоваяСтрока.Количество = 0 Тогда
		НоваяСтрока.Сумма = НовоеЗначение;
	КонецЕсли;	
	
	// Проверка возможности заполнения полей в строке в зависимости от статьи оборотов.
	ИзмеренияРазворачивать = фКэшЗначений.НастройкиФормы.СпособыЗаполнения[ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать")];
	УдаленоКлючевоеПоле  = бит_БюджетированиеКлиентСервер.ПроверитьПоляВСтроке(НоваяСтрока,фКэшЗначений.НастройкиСтатей, фКэшЗначений.ИзмеренияВсе, ИзмеренияРазворачивать); 	
	
	Если УдаленоКлючевоеПоле Тогда
        бит_БюджетированиеКлиентСервер.ВывестиСообщениеОНесоответствииСтатьи(НоваяСтрока.СтатьяОборотов);		
		// Необходимо удалить строку, потому что к ней не будет доступа, т.к. отбор в табличном поле 
		// редактирования осуществляется по измерениям со способом заполнения Разворачивать.
		Объект.БДДС.Удалить(НоваяСтрока);
	Иначе	
		Если РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов) Тогда
			СтрокиДляЗависимых.Добавить(НоваяСтрока.ПолучитьИдентификатор());
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСтатьиШапка()
	
	Если фКэшЗначений.НастройкиСтатей[Объект.СтатьяОборотов] = Неопределено Тогда
		бит_Бюджетирование.ПолучитьНастройкиСтатейОборотов(Объект.СтатьяОборотов, фКэшЗначений.НастройкиСтатей);
	КонецЕсли; 
	
	МассивСтатей = Новый Массив;
	МассивСтатей.Добавить(Объект.СтатьяОборотов);
	
	ИменаТаблиц = Новый Массив;  
	ИменаТаблиц.Добавить("БДДС");
	ИменаТаблиц.Добавить("БДДС_Редактирование");
	ОФормитьТаблицу("БДДС", ИменаТаблиц, МассивСтатей);
	
	ИменаТаблиц = Новый Массив;  
	ИменаТаблиц.Добавить("ЗависимыеОбороты");
	ИменаТаблиц.Добавить("ЗависимыеОбороты_Редактирование");
	ОФормитьТаблицу("ЗависимыеОбороты", ИменаТаблиц, МассивСтатей);																	
	
	УправлениеВидимостьюКолонокТаблиц();	
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСтатьиОборотовВТабличнойЧасти(Идентификатор, ИмяТабЧасти, ИмяПоля, ЗаполнятьНорму = Истина)
	
	Если ТипЗнч(Идентификатор) = Тип("Число") Тогда
		ТекущиеДанные = Объект[ИмяТабЧасти].НайтиПоИдентификатору(Идентификатор);
	Иначе
		ТекущиеДанные = Идентификатор;
	КонецЕсли; 

	Если ТекущиеДанные = Неопределено Тогда		
		Возврат;		
	КонецЕсли;
	
	Если фКэшЗначений.НастройкиСтатей[ТекущиеДанные.СтатьяОборотов] = Неопределено Тогда	
		бит_Бюджетирование.ПолучитьНастройкиСтатейОборотов(ТекущиеДанные.СтатьяОборотов, фКэшЗначений.НастройкиСтатей); 	
	КонецЕсли; 
	
	бит_МеханизмДопИзмерений.ИнициализироватьЗначенияДопИзмерений(ТекущиеДанные,фКэшЗначений.ИзмеренияДоп,фКэшЗначений.НастройкиИзмерений);	
	
	Если ЗаполнятьНорму Тогда  		
		ЗаполнитьНорму(ЭтотОбъект, ТекущиеДанные, ИмяТабЧасти, "СтатьяОборотов");  		
	КонецЕсли; 
	
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить(ИмяПоля);
	
	МассивСтатей = Новый Массив;
	МассивСтатей.Добавить(ТекущиеДанные.СтатьяОборотов);
	
	ОФормитьТаблицу(ИмяТабЧасти, ИменаПолей, МассивСтатей);			
	
	ИзмеренияРазворачивать = фКэшЗначений.НастройкиФормы.СпособыЗаполнения[ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать")];	
	УдаленоКлючевоеПоле = бит_БюджетированиеКлиентСервер.ПроверитьПоляВСтроке(ТекущиеДанные, фКэшЗначений.НастройкиСтатей, фКэшЗначений.ИзмеренияВсе, ИзмеренияРазворачивать);
	
	Если УдаленоКлючевоеПоле Тогда  	
        бит_БюджетированиеКлиентСервер.ВывестиСообщениеОНесоответствииСтатьи(ТекущиеДанные.СтатьяОборотов);		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура РежимЗависимыхОборотовИзменение(Знач Очистить)

	Если Очистить Тогда
		ОчиститьЗависимыеОбороты();
	КонецЕсли; 
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	бит_НастройкиДоступностиЭлементовФорм.РазблокироватьЭлементы(ЭтотОбъект);
	
	ЗаблокироватьЭлементы = НЕ (Статус = Справочники.бит_СтатусыОбъектов.Черновик
						    ИЛИ Статус = Справочники.бит_СтатусыОбъектов.ПустаяСсылка());

	ФиксированныйМакет									= фКэшЗначений.НастройкиФормы.ФиксированныйМакет;
	Элементы.ФормулаПредставление.Видимость				= ФиксированныйМакет;
	Элементы.РежимФормированияДвижений.Видимость		= ФиксированныйМакет;
	Элементы.ПериодПланированияДатаОкончания.Доступность= НЕ ФиксированныйМакет;
	Элементы.ГруппаТаблицаОтбор.Доступность				= НЕ ФиксированныйМакет;
	
	РучнойВводЗависимых = РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов);	
	Элементы.ГруппаРедактированиеЗависимые.Видимость = РучнойВводЗависимых;
	Элементы.ИзменитьЗависимые.Видимость = РучнойВводЗависимых;
	Элементы.БДДС_РедактированиеКомандаСкопироватьСтрокуВЗависимые.Видимость = РучнойВводЗависимых;
	
	// Видимость элементов шапки.
	Для Каждого КиЗ Из фКэшЗначений.НастройкиИзмерений Цикл
		Имя       = КиЗ.Ключ;
		Настройка = КиЗ.Значение;
		Если Имя = "Сценарий" Тогда
			Продолжить;
		КонецЕсли; 		
		Если Найти(Имя,"Аналитика_")>0 Тогда
			Если Настройка = Неопределено Тогда
				Элементы[Имя].Видимость = Ложь;
			Иначе
				Элементы[Имя].Заголовок = Настройка.Синоним;
			КонецЕсли; 
		КонецЕсли; 
		Элементы[Имя].АвтоОтметкаНезаполненного = Ложь;
		Элементы[Имя].ОтметкаНезаполненного = Ложь;		
	КонецЦикла;
	
	Если фИспользоватьНормы Тогда
		Элементы.ПараметрНорм.Видимость = НЕ Объект.ЗаполнятьПоЦенамНоменклатуры;
		Элементы.ТипЦен.Видимость       = Объект.ЗаполнятьПоЦенамНоменклатуры;
	Иначе
		Элементы.ПереключательЦеновойПолитики.Видимость = Ложь;
		Элементы.ПараметрНорм.Видимость                 = Ложь;
		Элементы.ТипЦен.Видимость                       = Истина;
		Элементы.ТипЦен.Заголовок                       = НСтр("ru = 'Заполнять по ценам номенклатуры';
														  	   |en = 'Fill-in by product price'");
	КонецЕсли;
	
	// Автоотметка значений по умолчанию, обязательных к заполнению.
	ИзмеренияОбязательные = фКэшЗначений.НастройкиФормы.СпособыЗаполнения[Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию];

	Если ЗначениеЗаполнено(ИзмеренияОбязательные) Тогда
		Для Каждого Имя Из ИзмеренияОбязательные Цикл
			Элементы[Имя].АвтоОтметкаНезаполненного = Истина;
			Если НЕ ЗначениеЗаполнено(Объект[Имя]) Тогда
				Элементы[Имя].ОтметкаНезаполненного = Истина;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	// Видимость нормы.
	ЕстьКоличествоСумма = Истина;
	Элементы.БДДС_РедактированиеНорма.Видимость = ЕстьКоличествоСумма;
	Элементы.БДДСНорма.Видимость = ЕстьКоличествоСумма;
	Элементы.ЗависимыеОбороты_РедактированиеНорма.Видимость = ЕстьКоличествоСумма;
	Элементы.ЗависимыеОборотыНорма.Видимость = ЕстьКоличествоСумма;
	
	Если фКэшЗначений.ПроводитьПослеУтверждения 
		И Объект.Проведен И Объект.ОтправленНаСогласование
		И Объект.РежимПринятияКУчету = 1
		И НЕ Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(Статус,
				Перечисления.бит_ТипыСтатусовОбъектов.Утвержден)
		И НЕ бит_ВизированиеСервер.МеханизмВизированияОтключен(Объект.Ссылка) Тогда
		Элементы.ПредупреждениеОПринятиеКУчетуПослеУтверждения.Видимость = Истина;
	Иначе
		Элементы.ПредупреждениеОПринятиеКУчетуПослеУтверждения.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СписатьЛимиты.Видимость   = НеУчитыватьСверхБюджета;
	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаблокироватьЭлементы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеМенюРасчеты(Форма)

	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;

	Элементы.ВычислятьФормулыПриВводеДа.Пометка  = Объект.ВычислятьФормулыПриВводе;
	Элементы.ВычислятьФормулыПриВводеНет.Пометка = НЕ Объект.ВычислятьФормулыПриВводе;
	Если Объект.ВычислятьФормулыПриВводе Тогда
		Элементы.Расчеты.Отображение = ОтображениеКнопки.Текст;
	Иначе
		Элементы.Расчеты.Отображение = ОтображениеКнопки.КартинкаИТекст;	
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура УстановитьКартинкуКнопкиОтбор()

	Если фУстанавливатьОтборЗависимых Тогда
		Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Картинка  = БиблиотекаКартинок.ОтключитьОтбор;
		Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Заголовок = НСтр("ru='Отключить отбор';en='Disable Filter'");
	Иначе	
		Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Картинка  = БиблиотекаКартинок.ОтборКомпоновкиДанных;
		Элементы.ЗависимыеОборотыКомандаПереключитьОтбор.Заголовок = НСтр("ru='Установить отбор';en='Set Filter'");
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура СкоприроватьСтрокуВЗависимые(Знач ИдСтроки)

	ТекущаяСтрока = Объект.БДДС.НайтиПоИдентификатору(ИдСтроки);
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		СтрокаЗависимые = Объект.ЗависимыеОбороты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗависимые,ТекущаяСтрока);
		
		// Расчитаем сумму в указанных единицах измерения сумм.
	    РазмерностьЕдиницы = бит_ОбщегоНазначения.ПолучитьРазмерностьЕдиницыИзмеренияСумм(Объект.ЕдиницаИзмеренияСумм);			
		СтрокаЗависимые.Сумма = бит_ОбщегоНазначения.ПересчитатьИзРазмерностиВРазмерность(СтрокаЗависимые.Сумма,
																						  РазмерностьЕдиницы, 1);
		СтрокаЗависимые.ИД_Родитель = ТекущаяСтрока.ИД;
		СтрокаЗависимые.Комментарий = "";
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ОФормитьТаблицу(ПрефиксТаблицы, МассивОформляемыхТаблиц = Неопределено, вхМассивСтатей = Неопределено) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	// ----------------------------------------------------------------------
	// Оформление реквизитов строк по статьям оборотов.
	ПрефиксКонтейнера = "Объект.";
	
	Если вхМассивСтатей = Неопределено Тогда
	    // Формирование массива статей, по которым нужно добавить элементы УО.
		ТаблицаПоиска = Объект[ПрефиксТаблицы].Выгрузить();
		МассивСтатей = ТаблицаПоиска.ВыгрузитьКолонку("СтатьяОборотов");
		бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСтатей);
		ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].ЗагрузитьЗначения(МассивСтатей);
	Иначе // Работаем только с массивом статей оборотов.
		МассивСтатей = Новый Массив; 		
		Для Каждого ТекСтатья Из вхМассивСтатей Цикл
			НайденноеЗначение = ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].НайтиПоЗначению(ТекСтатья);
			Если НайденноеЗначение = Неопределено Тогда	
				МассивСтатей.Добавить(ТекСтатья);
				ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].Добавить(ТекСтатья);		
			КонецЕсли;  		
		КонецЦикла; 
	КонецЕсли;	
	
	ПараметрыОформления = бит_РаботаСДиалогамиСервер.НовыеПараметрыОформленияСтатей();
	ПараметрыОформления.ПрефиксКонтейнера                 = ПрефиксКонтейнера;
	ПараметрыОформления.ПрефиксТаблицы                    = ПрефиксТаблицы;
	ПараметрыОформления.ПоляОформления                    = фКэшЗначений.СтруктураДопПолей;
	ПараметрыОформления.ИменаОформляемыхТаблиц            = МассивОформляемыхТаблиц;
	ПараметрыОформления.ОтметитьОбязательныеРазрезыСтатей = Истина;
	бит_РаботаСДиалогамиСервер.ОформитьТаблицуПоСтатьямОборотов(УсловноеОформление, МассивСтатей, ПараметрыОформления);
	
КонецПроцедуры
															 
// Формирует массив статей, которые присутствуют в дереве.
// 
// Параметры:
//  ТабДок - ТабличныйДокумент
// 
// Возвращаемое значение:
//  МассивСтатей - Массив.
// 
&НаСервере
Функция ИзвлечьСтатьиИзДерева(ТабДок)
	
	МассивСтатей = Новый Массив;
	ГруппыСтатейОборотов = ГруппыСтатейОборотов(); 
	
	Для Каждого Обл Из ТабДок.Области Цикл
		
		Если Найти(Обл.Имя, "СтатьяОборотов_") > 0 Тогда
			Если Обл.Расшифровка <> Неопределено 
				И ТипЗнч(Обл.Расшифровка.Значение) = Тип("СправочникСсылка.бит_СтатьиОборотов") Тогда 

				ЭтоГруппа = ГруппыСтатейОборотов.Найти(Обл.Расшифровка.Значение, "Ссылка");
				Если ЭтоГруппа = Неопределено Тогда
					МассивСтатей.Добавить(Обл.Расшифровка.Значение);
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	
	ТабВрем = Объект.БДДС.Выгрузить();
	ТабВрем.Свернуть("СтатьяОборотов");
	
	Для Каждого СтрокаТаблицы Из ТабВрем Цикл
		МассивСтатей.Добавить(СтрокаТаблицы.СтатьяОборотов);
	КонецЦикла; 
	
	ТабВрем = Объект.ЗависимыеОбороты.Выгрузить();
	ТабВрем.Свернуть("СтатьяОборотов");
	
	Для Каждого СтрокаТаблицы Из ТабВрем Цикл
		МассивСтатей.Добавить(СтрокаТаблицы.СтатьяОборотов);
	КонецЦикла; 
	
	МассивСтатей.Добавить(Объект.СтатьяОборотов);
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСтатей);
	
	Возврат МассивСтатей;
	
КонецФункции

// Управляет видимостью колонок табличных полей БДДС_Редактирование и ЗависимыеОбороты_Редактирование.
// 
&НаСервере
Процедура УправлениеВидимостьюКолонокТаблиц()

	Для Каждого КиЗ Из фКэшЗначений.НастройкиФормы.Измерения Цикл
		Если КиЗ.Ключ = "Сценарий" Тогда
			Продолжить;
		КонецЕсли; 		
		ТекОписание = КиЗ.Значение;
		ИмяКолонки = "БДДС_Редактирование"+ТекОписание.Имя;
		Элементы[ИмяКолонки].Видимость = Истина;
	КонецЦикла; 
	
	// Скроем аналитики, которые заведомо не используются ни в одной статье в рамках формы ввода.
	локМассивСтатей = Новый Массив;
	Для Каждого КиЗ Из фКэшЗначений.НастройкиСтатей Цикл
		локМассивСтатей.Добавить(КиЗ.Ключ);
	КонецЦикла; 
	локНастройкаВидимостиКолонок = Новый Структура;
	
	НеобходимоИзменение = бит_РаботаСДиалогамиСервер.НужноИзменитьВидимостьКолонокБюджета(локМассивСтатей
																		, Новый Массив
																		, локНастройкаВидимостиКолонок);
	
	бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы
											 				, локНастройкаВидимостиКолонок
											 				, "БДДС_Редактирование");
															
	бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы
											 				, локНастройкаВидимостиКолонок
											 				, "ЗависимыеОбороты_Редактирование");
															
	// Скрываем в поле редактирования колонки, для которых установлен режим "Разворачивать" или "ПоУмолчанию".
	ВидимостьАналитик = ВидимостьАналитикПоНастройкеДокумента();
	
	Для каждого КлючЗначение Из ВидимостьАналитик Цикл
		Элементы[КлючЗначение.Ключ].Видимость = КлючЗначение.Значение;
	КонецЦикла;
	
	// Видимость нормы.
	ЕстьКоличествоСумма = Истина;
	Элементы.БДДС_РедактированиеНорма.Видимость = ЕстьКоличествоСумма;
	Элементы.БДДСНорма.Видимость = ЕстьКоличествоСумма;
	Элементы.ЗависимыеОбороты_РедактированиеНорма.Видимость = ЕстьКоличествоСумма;
	Элементы.ЗависимыеОборотыНорма.Видимость = ЕстьКоличествоСумма;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонокПоСтатьям(СтрокиБДДС, ОтборПоРасшифровке)
	
	Если НЕ АвтовидимостьКолонок Тогда
		УстановитьВидимостьКолонокПоСтатьямНаСервере(Новый Массив);
	КонецЕсли;
		
	Если СтрокиБДДС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтатьиОборотов = Новый Массив;
	Если ТипЗнч(СтрокиБДДС) = Тип("Массив") Тогда
		Для каждого СтрокаБДДС Из СтрокиБДДС Цикл
			СтатьяОборотов = СтрокаБДДС.СтатьяОборотов;
			Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
				СтатьиОборотов.Добавить(СтатьяОборотов);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ТипЗнч(ОтборПоРасшифровке) = Тип("Структура")
		И ОтборПоРасшифровке.Свойство("СтатьяОборотов") Тогда
		СтатьяОборотов = ОтборПоРасшифровке.СтатьяОборотов;
		Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
			СтатьиОборотов.Добавить(СтатьяОборотов);
		КонецЕсли;
	КонецЕсли;
	
	Если СтатьиОборотов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьКолонокПоСтатьямНаСервере(СтатьиОборотов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКолонокПоСтатьямНаСервере(СтатьиОборотов)
	
	НастройкаВидимостиКолонок = бит_Бюджетирование.ПолучитьНастройкуВидимостиКолонок(СтатьиОборотов);
	бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы, НастройкаВидимостиКолонок,
											 							"БДДС_Редактирование");
	бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы, НастройкаВидимостиКолонок,
											 							"ЗависимыеОбороты_Редактирование");
	
КонецПроцедуры

// Процедура выполняет пересчет размерности сумм в документе.
// 
// Параметры:
//  НачЕдиницаИзмеренияСумм - ПеречислениеСсылка.бит_ЕдиницыИзмеренияСумм.
// 
&НаСервере
Процедура ВыполнитьПересчетРазмерностиСумм(НачЕдиницаИзмеренияСумм)
	
	РазмерностьНач = бит_ОбщегоНазначения.ПолучитьРазмерностьЕдиницыИзмеренияСумм(НачЕдиницаИзмеренияСумм);
	РазмерностьКон = бит_ОбщегоНазначения.ПолучитьРазмерностьЕдиницыИзмеренияСумм(Объект.ЕдиницаИзмеренияСумм);
	
	Для каждого ТекСтрока Из Объект.БДДС Цикл
		Если ТекСтрока.СтатьяОборотов.ЭтоКоэффициент Тогда
			// Безразмерные величины не пересчитываем.
			Продолжить;
		КонецЕсли; 		
		
		// Расчитаем сумму в указанных единицах измерения сумм.
		ТекСтрока.Сумма = бит_ОбщегоНазначения.ПересчитатьИзРазмерностиВРазмерность(ТекСтрока.Сумма
																				   ,РазмерностьНач
																				   ,РазмерностьКон);
																				   
		ТекСтрока.Норма = бит_ОбщегоНазначения.ПересчитатьИзРазмерностиВРазмерность(ТекСтрока.Норма
																				   ,РазмерностьНач
																				   ,РазмерностьКон);
	КонецЦикла;
	Для каждого СтрокаОборота Из Объект.ЗависимыеОбороты Цикл
		СтрокаОборота.Сумма = бит_ОбщегоНазначенияКлиентСервер.ПересчитатьИзРазмерностиВРазмерность(СтрокаОборота.Сумма,
								РазмерностьНач, РазмерностьКон);
	КонецЦикла;																		   
	ВосстановитьДерево();
	УстановитьФорматЧисел();	
	
КонецПроцедуры

// Устанавливает загруженные из Эксель данные в форму ввода.
// 
&НаСервере
Процедура УстановитьЗагруженныеДанные(ДанныеЭксель, ВыводитьСообщения = Истина)

	// Создание структуры сопоставления имен в документе и в файле.
	КолСтрок   = ТабДокДанные.ВысотаТаблицы;
	КолКолонок = ТабДокДанные.ШиринаТаблицы;
	НомПервойСтроки = 3;
	ИменаЯчеек = Новый Структура;
	Для нс = 1 По КолСтрок Цикл		
		сим = нс+НомПервойСтроки;		
		Для кол = 1 По КолКолонок Цикл			
			// Ячейка табличного документа.
			Обл = ТабДокДанные.Область(нс, кол, нс, кол);
			Имя = Обл.Имя;
			ЭтоСумма      = Лев(Имя,1)="С";
			ЭтоКоличество = Лев(Имя,1)="К";
			Если ЭтоСумма Тогда
				ИмяВФайле = "СП_R"+(нс+НомПервойСтроки)+"C"+кол;
				ИмяВФайле = СтрЗаменить(ИмяВФайле, Символы.НПП, "");
				ИменаЯчеек.Вставить(ИмяВФайле, Имя);	
			ИначеЕсли ЭтоКоличество Тогда
				ИмяВФайле = "КП_R"+(нс+НомПервойСтроки)+"C"+кол;
				ИмяВФайле = СтрЗаменить(ИмяВФайле, Символы.НПП, "");
				ИменаЯчеек.Вставить(ИмяВФайле, Имя);
			КонецЕсли;
			
		КонецЦикла; // По колонкам.		
	КонецЦикла; // По строкам.
	
    Для Каждого ЭД Из ДанныеЭксель Цикл
		
		ИмяВДокументе = ?(ИменаЯчеек.Свойство(ЭД.Имя), ИменаЯчеек[ЭД.Имя], ЭД.Имя);
		НовоеЗначение = ЭД.Значение;
		
    	Попытка
    		Обл = ТабДокДанные.Область(ИмяВДокументе);
    	Исключение
    		Обл = Неопределено;
    		Если ВыводитьСообщения Тогда
    			ТекстСообщения = НСтр("ru = 'Не удалось найти ячейку по имени %1. Значение %2 не будет загружено.';
									  |en = 'Не удалось найти ячейку по имени %1. Значение %2 не будет загружено.'");
    			ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяВДокументе, НовоеЗначение);
    			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
    		КонецЕсли; 
    	КонецПопытки;
    	
    	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(Обл) Тогда
    		
    		ОбластьР = Обл.Расшифровка;
    		
    		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОбластьР, "РасшифровкаЯчейкиФормыВвода") 
    			 И ОбластьР.Вид = "Значение" 
    			 И НЕ ЗначениеЗаполнено(ОбластьР.Формула)  Тогда
    							
    			Если НовоеЗначение <> 0 Тогда
    				СтрОтбор = Новый Структура;
    				Для Каждого КиЗ Из ОбластьР.Измерения Цикл
    					СтрОтбор.Вставить(КиЗ.Ключ, КиЗ.Значение);
    				КонецЦикла; 
    				СтрОтбор.Вставить("Период", ОбластьР.Период);
    				НайденныеСтроки = Объект.БДДС.НайтиСтроки(СтрОтбор);
    				Если НайденныеСтроки.Количество() > 0 Тогда
    					ТекСтрока = НайденныеСтроки[0];
    					Если Лев(ОбластьР.Имя,1)  = "K"  Тогда
    					   ТекСтрока.Количество = НовоеЗначение;
    					ИначеЕсли Лев(ОбластьР.Имя, 1) = "С" Тогда	
    					   ТекСтрока.Сумма = НовоеЗначение;
    					КонецЕсли; 
    				Иначе	
    					СоздатьНовуюСтрокуБюджета(ОбластьР, НовоеЗначение);
    				КонецЕсли;
    			КонецЕсли; 
    		КонецЕсли; 
    	КонецЕсли; 
    КонецЦикла; // ДанныеЭксель.

	ВосстановитьДерево();
    
    // Заполнение зависимых оборотов.
    ЗаполнитьЗависимыеОбороты(Ложь);
    
КонецПроцедуры

&НаКлиенте
Процедура ПараметрНормПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПараметрНорм) 
		И ( Объект.БДДС.Количество() > 0 ИЛИ Объект.ЗависимыеОбороты.Количество() > 0 ) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПараметрНормВопросЗавершение", ЭтотОбъект); 
		ТекстВопроса = НСтр("ru='Перезаполнить нормы согласно выбранного параметра?';
							|en='Refill rates according to the selected option?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 15, КодВозвратаДиалога.Отмена);
	Иначе
		ИзменениеРазрешено = ПроверитьПараметрНорм(Объект.ПараметрНорм);
		Если ИзменениеРазрешено Тогда
			ИзменениеПараметраНорм();
			ДобавитьВКэш("ПараметрНорм");			
		Иначе
			ИзвлечьИзКэша("ПараметрНорм");
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "ПараметрНормВопросЗавершение".
// 
// Параметры:
// Ответ - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура ПараметрНормВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Перезаполнить = Ложь;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Перезаполнить = Истина;
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		ИзвлечьИзКэша("ПараметрНорм");
		Возврат;
	КонецЕсли;
	
	ИзменениеРазрешено = ПроверитьПараметрНорм(Объект.ПараметрНорм);
	Если ИзменениеРазрешено Тогда
		Если Перезаполнить Тогда
			ИзменениеПараметраНорм();
		КонецЕсли;
		ДобавитьВКэш("ПараметрНорм");
	Иначе
		ИзвлечьИзКэша("ПараметрНорм");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПараметрНорм(ПараметрНорм)

	// Проверка правильности выбора параметра норм.
	Если ЗначениеЗаполнено(ПараметрНорм) Тогда
		Если ТипЗнч(ПараметрНорм.ЕдиницаИзмерения) <> Тип("СправочникСсылка.Валюты") Тогда
			ТекстСообщения = НСтр("ru = 'Допустим выбор параметров только с единицей измерения типа Валюта.'; 
								  |en = 'Допустим выбор параметров только с единицей измерения типа Валюта.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ИзменениеПараметраНорм()

	фИменаПараметраНорм = ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ПодготовитьСтруктурыСвязи(Объект.ПараметрНорм);
	
	СтрКурсаДок = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);		
	бит_Бюджетирование.ПерезаполнитьНормыТабЧасти(Объект.ПараметрНорм, Объект.Сценарий, Объект.БДДС, СтрКурсаДок, фИменаПараметраНорм, Объект.ЕдиницаИзмеренияСумм);
	
	Если РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов) Тогда
		бит_Бюджетирование.ПерезаполнитьНормыТабЧасти(Объект.ПараметрНорм, Объект.Сценарий, Объект.ЗависимыеОбороты, СтрКурсаДок, фИменаПараметраНорм, Объект.ЕдиницаИзмеренияСумм);		
	КонецЕсли; 
	ВосстановитьДерево();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьИспользованиеКурсаСценария(Сценарий, СтрКурсаДок, ВалютаДокумента, Период)

	Если ЗначениеЗаполнено(Сценарий)
		И бит_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "ИспользоватьКурсыСценария") Тогда
		СтрКурса    = бит_Бюджетирование.ПолучитьКурсПоСценарию(Сценарий, ВалютаДокумента, Период);
		СтрКурсаДок = Новый Структура("Валюта, Курс, Кратность", ВалютаДокумента, СтрКурса.Курс, СтрКурса.Кратность);
		ИспользоватьКурсыСценария = Истина;
	КонецЕсли; 

КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьРазмерностьЕдиницыИзмеренияСумм(ЕдиницаИзмеренияСумм)

	СоответствиеКоэффициентов = Новый Соответствие;
	СоответствиеКоэффициентов.Вставить(ПредопределенноеЗначение("Перечисление.бит_ЕдиницыИзмеренияСумм.Единицы") , 1);
	СоответствиеКоэффициентов.Вставить(ПредопределенноеЗначение("Перечисление.бит_ЕдиницыИзмеренияСумм.Тысячи")  , 1000);
	СоответствиеКоэффициентов.Вставить(ПредопределенноеЗначение("Перечисление.бит_ЕдиницыИзмеренияСумм.Миллионы"), 1000000);
	
	Коэффициент = СоответствиеКоэффициентов.Получить(ЕдиницаИзмеренияСумм);
    Коэффициент = ?(Коэффициент = Неопределено, 1, Коэффициент);
	
	Возврат Коэффициент;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНормуВСтроке(Форма, ТекущиеДанные, СтрКурсаДок)

	Объект = Форма.Объект;
	Если КоличествоСуммаВстатье(ТекущиеДанные.СтатьяОборотов) Тогда

		МассивОтбор = Новый Массив;
		Для Каждого КиЗ Из Форма.фИменаПараметраНорм.БП Цикл
			ЭлементОбъекта = Новый Структура;
			ЭлементОбъекта.Вставить("Имя"     , КиЗ.Значение);
			ЭлементОбъекта.Вставить("Значение", ТекущиеДанные[КиЗ.Ключ]);
			МассивОтбор.Добавить(ЭлементОбъекта);
		КонецЦикла; 

		Если МассивОтбор.Количество() = 0 Тогда
			// Если нет отбора, нет смысла получать норму.
			Возврат;
		КонецЕсли; 	   

		ТекущиеДанные.Норма = ПолучитьЗначениеНормы(Объект.ПараметрНорм, ТекущиеДанные.Период, Объект.Сценарий, МассивОтбор, СтрКурсаДок);	
		РазмерностьНач      = 1;
		РазмерностьКон      = ПолучитьРазмерностьЕдиницыИзмеренияСумм(Объект.ЕдиницаИзмеренияСумм);
		ТекущиеДанные.Норма = бит_ОбщегоНазначенияКлиентСервер.ПересчитатьИзРазмерностиВРазмерность(ТекущиеДанные.Норма,
		   						РазмерностьНач, РазмерностьКон);																				   
		бит_БюджетированиеКлиентСервер.РассчитатьПоНорме(ТекущиеДанные, Истина);

	КонецЕсли; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНорму(Форма, ВхДанные, ИмяТабЧасти, ИмяПоля) 

	Объект = Форма.Объект;
	Если ТипЗнч(ВхДанные) = Тип("Число") Тогда 		
		ТекущиеДанные = Объект[ИмяТабЧасти].НайтиПоИдентификатору(ВхДанные); 		
	Иначе			
		ТекущиеДанные = ВхДанные; 		
	КонецЕсли; 
	
	Если ТекущиеДанные = Неопределено Тогда 	
		Возврат;   	
	КонецЕсли; 
	
	ПараметрыРасчетаЦен = ПараметрыРасчетаЦен(Форма);
	
	Если ПараметрыРасчетаЦен.ЗаполнитьПоНорме Тогда 	
		Если бит_БюджетированиеКлиентСервер.ВыполнятьЗаполнениеНормы(Объект.ПараметрНорм, Форма.фИменаПараметраНорм, ИмяПоля, Форма.фИспользоватьНормы) Тогда
			СтрКурсаДок = Новый Структура;
			ПроверитьИспользованиеКурсаСценария(Объект.Сценарий, СтрКурсаДок, Объект.ВалютаДокумента, ТекущиеДанные.Период);
			Если НЕ ЗначениеЗаполнено(СтрКурсаДок) Тогда
				СтрКурсаДок = ПараметрыРасчетаЦен.СтруктураКурсаДокумента;
			КонецЕсли; 
			ЗаполнитьНормуВСтроке(Форма, ТекущиеДанные, СтрКурсаДок);
		КонецЕсли;
	ИначеЕсли ПараметрыРасчетаЦен.ЗаполнитьПоТипуЦен Тогда
		Если ИмяПоля = "Период" ИЛИ ИмяПоля = "СтатьяОборотов" ИЛИ ИмяПоля = ПараметрыРасчетаЦен.АналитикаНоменклатуры Тогда
			ЗаполнитьЦенуВСтроке(ТекущиеДанные, ПараметрыРасчетаЦен);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЦенуВСтроке(ТекущиеДанные, ПараметрыРасчетаЦен)
	
	ДанныеСтрокиТаблицы	= Новый Структура("Номенклатура, Количество, Цена, Сумма, Период");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущиеДанные);
	ДанныеСтрокиТаблицы.Номенклатура = ТекущиеДанные[ПараметрыРасчетаЦен.АналитикаНоменклатуры];
	ДанныеСтрокиТаблицы.Цена         = ТекущиеДанные.Норма;
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, ТекущиеДанные);
	
	ПерезаполнитьЦеныСтрокиТабличнойЧасти(ДанныеСтрокиТаблицы, ПараметрыРасчетаЦен, ТекущиеДанные.СтатьяОборотов);
	ТекущиеДанные.Норма = ДанныеСтрокиТаблицы.Цена;
	ТекущиеДанные.Сумма = ДанныеСтрокиТаблицы.Сумма;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерезаполнитьЦеныСтрокиТабличнойЧасти(ДанныеСтрокиТаблицы, ПараметрыРасчетаЦен, СтатьяОборотов);
	
	бит_Бюджетирование.ПерезаполнитьЦеныСтрокиТабличнойЧасти(ДанныеСтрокиТаблицы, ПараметрыРасчетаЦен, СтатьяОборотов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КоличествоСуммаВстатье(СтатьяОборотов)

	КоличествоСумма = Ложь;
	СтруктураУчета = бит_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяОборотов, "Учет_Количество, Учет_Сумма");
	
	Если СтруктураУчета.Учет_Количество И СтруктураУчета.Учет_Сумма Тогда
		КоличествоСумма = Истина;
	КонецЕсли; 

	Возврат КоличествоСумма;
	
КонецФункции
 
&НаСервереБезКонтекста
Функция ПолучитьЗначениеНормы(ВидПараметра, Период, Сценарий, Отбор, СтрКурсаДок)

	ЗначениеНормы = 0;
	
	ИмяСпрСц = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();
	ПустойСц = Справочники[ИмяСпрСц].ПустаяСсылка();
	
	СписокСценариев = Новый СписокЗначений;
	СписокСценариев.Добавить(Сценарий);
	СписокСценариев.Добавить(ПустойСц);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ВидПараметра", ВидПараметра);
	Запрос.УстановитьПараметр("СписокСценариев", СписокСценариев);
	Запрос.УстановитьПараметр("ПустойСценарий", ПустойСц);
	Для Каждого эо Из Отбор Цикл
		// Установка параметров для отбора.
		Запрос.УстановитьПараметр("Зн_"+эо.Имя,эо.Значение);
		ПустоеЗначение = Неопределено;
		Если ЗначениеЗаполнено(эо.Значение) Тогда
			 ТекТип = ТипЗнч(Эо.Значение);
			 ТекМассив = Новый Массив;
			 ТекМассив.Добавить(ТекТип);
			 ТекОписание = Новый ОписаниеТипов(ТекМассив);
			 ПустоеЗначение = ТекОписание.ПривестиЗначение();
		КонецЕсли; 
		Запрос.УстановитьПараметр("Пустое_"+эо.Имя, ПустоеЗначение);
	КонецЦикла; 
		
	// Извлекаем значение параметра
	// заполненный сценарий имеет больший приоритет перед пустым
	// заполненная аналитика имеет больший приоритет перед пустой.
	Шаблон = "ВЫБРАТЬ
	         |	ЗнчПараметров.Параметр,
	         |	ЗнчПараметров.ЕдиницаИзмерения,
	         |	ЗнчПараметров.Аналитика_1 КАК Аналитика_1,
	         |	ЗнчПараметров.Аналитика_2 КАК Аналитика_2,
	         |	ЗнчПараметров.Аналитика_3 КАК Аналитика_3,
	         |	ЗнчПараметров.Аналитика_4 КАК Аналитика_4,
	         |	ЗнчПараметров.ЗначениеПараметра КАК ЗначениеПараметра,
	         |	ВЫБОР
	         |		КОГДА ЗнчПараметров.Сценарий = &ПустойСценарий
	         |			ТОГДА 2
	         |		ИНАЧЕ 1
	         |	КОНЕЦ КАК Приоритет
	         |ИЗ
	         |	РегистрСведений.бит_ЗначенияПроизвольныхПараметров.СрезПоследних(&Период, Сценарий В (&СписокСценариев)) КАК ЗнчПараметров
	         |ГДЕ
	         |	ЗнчПараметров.Параметр = &ВидПараметра
			 |{%Для Каждого ЭлементОтбора ИЗ Отбор ЦИКЛ%}
	         | И (ЗнчПараметров.{%ЭлементОтбора.Имя%} = &Зн_{%ЭлементОтбора.Имя%} 
			 |     ИЛИ ЗнчПараметров.{%ЭлементОтбора.Имя%} = &Пустое_{%ЭлементОтбора.Имя%}
			 |     ИЛИ ЗнчПараметров.{%ЭлементОтбора.Имя%}.Ссылка ЕСТЬ NULL)
	         |{%КонецЦикла%}			 			 
	         |
	         |УПОРЯДОЧИТЬ ПО
	         |	Приоритет,
	         |	Аналитика_1 УБЫВ,
	         |	Аналитика_2 УБЫВ,
	         |	Аналитика_3 УБЫВ,
	         |	Аналитика_4 УБЫВ
	         |АВТОУПОРЯДОЧИВАНИЕ";
	
   СтрКонтекст = Новый Структура("Отбор", Отбор);
   Запрос.Текст = бит_СтрокиСервер.ОбработатьТекстШаблона(Шаблон,СтрКонтекст);
   
   Результат = Запрос.Выполнить();
   Выборка = Результат.Выбрать();
   Если Выборка.Следующий() Тогда
	   СтрКурсаПарам = бит_Бюджетирование.ПолучитьКурсПоСценарию(Сценарий, Выборка.ЕдиницаИзмерения, Период);
	   ЗначениеНормы = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(Выборка.ЗначениеПараметра
																			   , Выборка.ЕдиницаИзмерения
	                                                                           , СтрКурсаДок.Валюта	
																			   , СтрКурсаПарам.Курс																			   
																			   , СтрКурсаДок.Курс
																			   , СтрКурсаПарам.Кратность																			   
																			   , СтрКурсаДок.Кратность);
   КонецЕсли; 
   
   Если НЕ ТипЗнч(ЗначениеНормы) = Тип("Число") Тогда
	   ЗначениеНормы = 0;
   КонецЕсли; 
   Возврат ЗначениеНормы;
	
КонецФункции

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	
	Объект.ЗаполнятьПоЦенамНоменклатуры = Истина;
	
	Если ЗначениеЗаполнено(Объект.ТипЦен) 
		И ( Объект.БДДС.Количество() > 0 ИЛИ Объект.ЗависимыеОбороты.Количество() > 0 ) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ТипЦенВопросЗавершение", ЭтотОбъект); 
		ТекстВопроса = НСтр("ru='Перезаполнить цены по выбранному типу цен?';
							|en='Refill prise according to the selected option?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
// 
&НаКлиенте
Процедура ТипЦенВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ИзменениеТипаЦен();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеТипаЦен()
	
	ПараметрыРасчетаЦен = ПараметрыРасчетаЦен(ЭтотОбъект);
	Если НЕ ПараметрыРасчетаЦен.ЗаполнитьПоТипуЦен Тогда
		Возврат;
	КонецЕсли;
	
	бит_Бюджетирование.ПерезаполнитьЦеныТабличнойЧасти(Объект.БДДС, ПараметрыРасчетаЦен);
	
	ВосстановитьДерево();
	
КонецПроцедуры

// Функция определяет изменится ли валюта при изменении сценария.
// 
// Возвращаемое значение:
//  Результат - Булево.
// 
&НаСервере
Функция ИзменитсяВалюта()

	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.Сценарий)
		 И Объект.Сценарий.Валюта <> Объект.ВалютаДокумента
		 И Объект.БДДС.Количество() > 0 Тогда
	
		Результат = Истина;
	КонецЕсли; 
	Возврат Результат;
	
КонецФункции

// Выполняет пересчеты табличных частей при изменении валюты. 
// 
// Параметры:
//  КурсыДок - Структура
// 
&НаСервере
Процедура ПересчитатьТабличныеЧастиПоВалюте(КурсыДок)
	
	ПоляПересчета = Новый Массив;
	ПоляПересчета.Добавить("Сумма");
	ПоляПересчета.Добавить("Норма");		
	
	бит_Бюджетирование.ПересчитатьТабЧастьПоВалюте(Объект.БДДС, Объект.Сценарий, КурсыДок, ПоляПересчета);
	
	ПоляПересчета = Новый Массив;
	ПоляПересчета.Добавить("Сумма");
	ПоляПересчета.Добавить("Норма");			
	
	бит_Бюджетирование.ПересчитатьТабЧастьПоВалюте(Объект.ЗависимыеОбороты, Объект.Сценарий, КурсыДок, ПоляПересчета);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧасть(ВыбранноеЗначение, ОчищатьДанные, ЗаполнитьЗависимые = Ложь)
	
	Модифицированность = Истина;
	
	Если ОчищатьДанные Тогда
		Объект.БДДС.Очистить();
		Объект.ЗависимыеОбороты.Очистить();
	КонецЕсли; 
	
	ДанныеЗаполнения = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОборотовПоБюджетам);
	ИспользоватьЗначенияПоУмолчанию = ВыбранноеЗначение.ИспользоватьЗначенияПоУмолчанию;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений") Тогда
		
		ЗаполнитьПоНорме   = ЗначениеЗаполнено(Объект.ПараметрНорм) И НЕ Объект.ЗаполнятьПоЦенамНоменклатуры;
		ЗаполнитьПоТипуЦен = ЗначениеЗаполнено(Объект.ТипЦен) И Объект.ЗаполнятьПоЦенамНоменклатуры;
		ПараметрыРасчетаЦен = ПараметрыРасчетаЦен(ЭтотОбъект);
		
		Если ПараметрыРасчетаЦен.ЗаполнитьПоНорме Тогда
			ИменаПараметраНорм = ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ПодготовитьСтруктурыСвязи(Объект.ПараметрНорм);
			СтрКурсаДок = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);		
		КонецЕсли; 
		
		ТаблицаДокумента = Объект.БДДС.Выгрузить();
		РучнойВводЗависимыхОборотов = РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов);
		Если СтрСравнить(ВыбранноеЗначение.Режим, "Заменить") = 0 Тогда
								
			Шаблон = "Период, СтатьяОборотов";
			Отбор  = Новый Структура(Шаблон); 
			ТаблицаДокумента.Индексы.Добавить(Шаблон);
			
			Группировки = ДанныеЗаполнения.Скопировать(Новый Структура("Выполнять", Истина), "ПериодДляЗаполнения, СтатьяОборотов");
			Группировки.Колонки.ПериодДляЗаполнения.Имя = "Период";
			Группировки.Индексы.Добавить(Шаблон);
			Группировки.Свернуть(Шаблон);
			
			Для каждого СтрокаТаблицы Из Группировки Цикл
				
				ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
				НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли; 
				
				Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Если РучнойВводЗависимыхОборотов Тогда
						ПодчиненныеСтроки = Объект.ЗависимыеОбороты.НайтиСтроки(Новый Структура("Ид_Родитель", НайденнаяСтрока.Ид));
						Для каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
							Объект.ЗависимыеОбороты.Удалить(Объект.ЗависимыеОбороты.Индекс(ПодчиненнаяСтрока));
						КонецЦикла; 
					КонецЕсли;
					ТаблицаДокумента.Удалить(НайденнаяСтрока);
				КонецЦикла; 
			КонецЦикла; 
		КонецЕсли; 
		
		НовыеСтроки = Новый Массив();
		Для Каждого СтрокаТаблицы Из ДанныеЗаполнения Цикл
			
			НоваяСтрока = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			УстановитьИД_БДДС_Сервер(НоваяСтрока); 
			НоваяСтрока.Период     = СтрокаТаблицы.ПериодДляЗаполнения;
			НоваяСтрока.Количество = СтрокаТаблицы.КоличествоДляЗаполнения;
			НоваяСтрока.Сумма      = СтрокаТаблицы.СуммаСценарийВВалютеДокумента;
			
			// Заполнение измерений по-умолчанию.
			Для Каждого КиЗ Из фКэшЗначений.НастройкиФормы.Измерения Цикл
				Если КиЗ.Ключ = "Сценарий" Тогда
					Продолжить;
				КонецЕсли; 
				ТекОписание = КиЗ.Значение;
				Если (ИспользоватьЗначенияПоУмолчанию 
					И ТекОписание.СпособЗаполнения <> ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать") 
					И ЗначениеЗаполнено(Объект[ТекОписание.Имя]))
					ИЛИ ТекОписание.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию") Тогда
					
					НоваяСтрока[ТекОписание.Имя] = Объект[ТекОписание.Имя];
				КонецЕсли; 
			КонецЦикла;
			
			Если ПараметрыРасчетаЦен.ЗаполнитьПоНорме 
				И НоваяСтрока.СтатьяОборотов.Учет_Сумма 
				И НоваяСтрока.СтатьяОборотов.Учет_Количество 
				И Не ЗначениеЗаполнено(НоваяСтрока.Сумма) Тогда
				
				// По норме вычисляем только если не заполнена сумма, т.к. в противном случае можно скопированную сумму изменить.
				бит_Бюджетирование.ЗаполнитьНормуВСтроке(НоваяСтрока, Объект.ПараметрНорм, Объект.Сценарий, СтрКурсаДок, ИменаПараметраНорм, Объект.ЕдиницаИзмеренияСумм);
			КонецЕсли;
			Если ЗаполнитьЗависимые И РучнойВводЗависимыхОборотов Тогда
				НовыеСтроки.Добавить(НоваяСтрока.ИД);
			КонецЕсли; 
		КонецЦикла;
		
		Объект.БДДС.Загрузить(ТаблицаДокумента);
		
		Если ПараметрыРасчетаЦен.ЗаполнитьПоТипуЦен Тогда
			ПараметрыРасчетаЦен.ТолькоНулевыеСуммы = Истина; // Строки с заполненной суммой не перезаполняем.
			бит_Бюджетирование.ПерезаполнитьЦеныТабличнойЧасти(Объект.БДДС, ПараметрыРасчетаЦен);
		КонецЕсли;
		СтрокиДляЗависимых = Новый Массив();
		Если ЗаполнитьЗависимые И РучнойВводЗависимыхОборотов Тогда
			Для каждого Стр Из НовыеСтроки Цикл
				СтрОтбор = Новый Структура("ИД", Стр); 
				НайденныеСтроки = Объект.БДДС.НайтиСтроки(СтрОтбор);
				Для Каждого СтрокаБДДС Из НайденныеСтроки Цикл
					СтрокиДляЗависимых.Добавить(СтрокаБДДС.ПолучитьИдентификатор());
				КонецЦикла; 
			КонецЦикла; 
		КонецЕсли; 
		Если СтрокиДляЗависимых.Количество() > 0 Тогда
			ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
		КонецЕсли;
	КонецЕсли; 
	
	ВосстановитьДерево(Истина, Истина);
	
	ТекстСообщения = НСтр("ru='Заполнение завершено.';en='Filling in completed.'");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеТабличнойЧастиНаСервере(ПараметрыОповещения)

	ИмяТабличнойЧасти		  = ПараметрыОповещения.ИмяТабличнойЧасти;
	АдресВоВременномХранилище = ПараметрыОповещения.АдресВоВременномХранилище;
		
	Модифицированность = Истина;
	ВосстановитьДерево = Ложь;
	ДанныеЗаполнения   = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	СтрокиДляЗависимых = Новый Массив();
	
	Индекс = 0;
	Для каждого СтрокаТаблицы Из ДанныеЗаполнения Цикл
		ТекущиеДанные		  = Объект[ИмяТабличнойЧасти][Индекс];
		ТекущаяСтатьяОборотов = ТекущиеДанные.СтатьяОборотов;
		ТекущаяСумма		  = ТекущиеДанные.Сумма;
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтрокаТаблицы);
		
		Если ТекущиеДанные.СтатьяОборотов <> ТекущаяСтатьяОборотов Тогда
			ИмяПоля = ИмяТабличнойЧасти + "_Редактирование";
			ИзменениеСтатьиОборотовВТабличнойЧасти(ТекущиеДанные, ИмяТабличнойЧасти, ИмяПоля);
		КонецЕсли;
		Если ТекущиеДанные.Сумма <> ТекущаяСумма Тогда
			ВосстановитьДерево = Истина;
			Если СтрСравнить(ИмяТабличнойЧасти, "БДДС") = 0 Тогда
				СтрокиДляЗависимых.Добавить(ТекущиеДанные.ПолучитьИдентификатор());
			КонецЕсли; 		
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла; 

	Если СтрокиДляЗависимых.Количество() > 0 Тогда
		ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
	КонецЕсли;
	
	Если ВосстановитьДерево Тогда
		ВосстановитьДерево();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораБюджета(ВыбранноеЗначение)
	
	РучнойВводЗависимыхОборотов = РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов);
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
	Оповещение = Новый ОписаниеОповещения("ОбработкаПодбораБюджетаЗавершение", ЭтотОбъект, ДопПараметры);
	Если РучнойВводЗависимыхОборотов Тогда
		ТекстВопроса = НСтр("ru='Заполнить зависимые обороты по новым данным автоматически?';
							|en='Fill dependent turnovers with new data automatically?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьПоДаннымПодбора(ВыбранноеЗначение, Ложь);	
	КонецЕсли;
		
КонецПроцедуры

// Обработчик завершения метода "показать вопрос".
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ОбработкаПодбораБюджетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыбранноеЗначение = ДополнительныеПараметры.ВыбранноеЗначение;
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДаннымПодбора(ВыбранноеЗначение, Истина);
	Иначе
		ЗаполнитьПоДаннымПодбора(ВыбранноеЗначение, Ложь);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымПодбора(ВыбранноеЗначение, ЗаполнитьЗависимые)
	
	Если ВыбранноеЗначение.Режим = "Заполнить" 
		И Объект.БДДС.Количество() > 0 Тогда 
		
		// В режиме заполнения существующие данные следует очистить.
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
		ДопПараметры.Вставить("ЗаполнитьЗависимые", ЗаполнитьЗависимые);
		бит_РаботаСДиалогамиКлиент.ЗапросПодтвержденияОчисткиДанных(ЭтотОбъект, ДопПараметры);
	Иначе
		ЗаполнитьТабЧасть(ВыбранноеЗначение, Ложь, ЗаполнитьЗависимые);
	КонецЕсли;
	
КонецПроцедуры

// Процедура получает вид проформы и эмулирует метаданные проформы. 
//
// Параметры:
//  ИмяПроформы - Строка.
//
&НаСервереБезКонтекста
Функция ДанныеВидаПроформы(Знач ИмяПроформы)

	РезСтр = Документы.бит_ФормаСбораДанных.ДанныеВидаПроформы(ИмяПроформы);
	
	Возврат РезСтр;

КонецФункции

// Процедура распознает данные, загруженные из Эксель и записывает в текущий документ.
// 
// Параметры:
//  КомплектДанных - Структура.
// 
&НаСервере
Процедура ОбработатьЗагруженныеДанные(Знач КомплектДанных, Режим)
	
	СпискиИсточники  = КомплектДанных.СпискиИсточники;
	ПсевдоМетаданные = КомплектДанных.ПсевдоМетаданные;
	МодельДокумента  = КомплектДанных.МодельДокумента;
	Отказ 			 = Ложь;
	
	Если МодельДокумента.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Нет данных для загрузки. Возможно выбран файл, не соответсвующий данному виду формы.';
							  |en='No data to download. To select a file, does not correspond to this type of form.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Документы.бит_ФормаСбораДанных.РаспознатьДанные(МодельДокумента, ПсевдоМетаданные, СпискиИсточники);
	
	ИмяТаблицыДанных = Документы.бит_ФормаСбораДанных.ИмяТаблицыДляЗагрузкиДанныхБюджета(ПсевдоМетаданные);
	
	// Проверка состава обязательных колонок таблицы.	
	МетаТаб = КомплектДанных.ПсевдоМетаданные.ТабличныеЧасти[ИмяТаблицыДанных];
	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Период");
	ОбязательныеПоля.Добавить("СтатьяОборотов");
	ОбязательныеПоля.Добавить("ЦФО");
	ОбязательныеПоля.Добавить("Сумма");
	
	ИменаРеквизитовТЧ = Новый Массив;
	Для каждого ОписаниеРеквизита Из МетаТаб.Реквизиты Цикл
		Если ТипЗнч(ОписаниеРеквизита) = Тип("Структура") И ОписаниеРеквизита.Свойство("Имя") Тогда
			ИменаРеквизитовТЧ.Добавить(ОписаниеРеквизита.Имя);
		Иначе
			ИменаРеквизитовТЧ.Добавить(ОписаниеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ОшибкиВПоляхФайла = Новый Массив(); 
	Для Каждого ИмяПоля Из ОбязательныеПоля Цикл
		Если ИменаРеквизитовТЧ.Найти(ИмяПоля) = Неопределено Тогда
			ОшибкиВПоляхФайла.Добавить(ИмяПоля);
		КонецЕсли; 
	КонецЦикла; 

	Если ОшибкиВПоляхФайла.Количество() <> 0 Тогда
		ТекстСообщения = НСтр("ru='В шаблоне проформы отсутствуют обязательные поля: %1';
							  |en='The template proforma no mandatory fields: %1'");			 
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтрСоединить(ОшибкиВПоляхФайла, ", "));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	Если Режим = "Загрузить" Тогда
		Объект.БДДС.Очистить();
		Объект.ЗависимыеОбороты.Очистить();
	КонецЕсли; 
	
	ТаблицаДанныхБюджета = МодельДокумента[ИмяТаблицыДанных].ТаблицаДанных;
	
	// проверим существование колонок.
	КолонкиПроверены = Новый Структура;
	
	МетаДок = Объект.Ссылка.Метаданные();
	Для Каждого Колонка Из ТаблицаДанныхБюджета.Колонки Цикл
		Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти(Колонка.Имя, МетаДок, "БДДС") Тогда
			 КолонкиПроверены.Вставить(Колонка.Имя, Истина);
		КонецЕсли; 
	КонецЦикла; 
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанныхБюджета  Цикл
		
		НоваяСтрока = Объект.БДДС.Добавить();
		УстановитьИД_БДДС_Сервер(НоваяСтрока);
		Для Каждого КиЗ Из КолонкиПроверены Цикл
			ИмяКолонки = КиЗ.Ключ;
			НоваяСтрока[ИмяКолонки] = СтрокаТаблицы[ИмяКолонки];
		КонецЦикла; 
		
		// Заполнение измерений по-умолчанию.
		Для Каждого КиЗ Из фКэшЗначений.НастройкиФормы.Измерения Цикл
			Если КиЗ.Ключ = "Сценарий" Тогда
				Продолжить;
			КонецЕсли; 
			
			ТекОписание = КиЗ.Значение;
			Если НЕ ТекОписание.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать") 
				И ЗначениеЗаполнено(Объект[ТекОписание.Имя]) 
				И НЕ ЗначениеЗаполнено(НоваяСтрока[ТекОписание.Имя]) Тогда
				
				НоваяСтрока[ТекОписание.Имя] = Объект[ТекОписание.Имя];
			КонецЕсли; 
		КонецЦикла; // НастройкиЗаполненияИзмерений.
	    ИзменениеСтатьиОборотовВТабличнойЧасти(НоваяСтрока,"БДДС", "БДДС_Редактирование");
	КонецЦикла; 
	
	ВосстановитьДерево(Истина, Истина);
		
КонецПроцедуры

&НаСервере
Процедура ВидимостьСтрокБюджета()
	
	Элементы.ФормаКомандаСтрокиБюджетаВидимость.Пометка = НЕ фСкрытьСтрокиБюджета;
	Элементы.ГруппаСтраницаСтрокиБюджета.Видимость = НЕ фСкрытьСтрокиБюджета;
	
КонецПроцедуры

&НаСервере
Процедура КомандаСтрокиБюджетаВидимостьНаСервере()
	
	фСкрытьСтрокиБюджета = НЕ фСкрытьСтрокиБюджета;
	
	Если НЕ фСкрытьСтрокиБюджета Тогда
		МассивСтатей = ИзвлечьСтатьиИзДерева(ТабДокДанные);
		
		ИменаТаблиц = Новый Массив;  
		ИменаТаблиц.Добавить("БДДС");
		ОФормитьТаблицу("БДДС", ИменаТаблиц, МассивСтатей);
		
		ИменаТаблиц = Новый Массив;  
		ИменаТаблиц.Добавить("ЗависимыеОбороты");
		ОФормитьТаблицу("ЗависимыеОбороты", ИменаТаблиц, МассивСтатей);																		
	КонецЕсли; 
	ВидимостьСтрокБюджета();
	
КонецПроцедуры

&НаСервере
Процедура ПереключитьПолноэкранныйРежим()
	
	Элементы.ФормаКомандаПолныйЭкран.Пометка = фПолныйЭкран;	
	
	Элементы.ГруппаВерх.Видимость = НЕ фПолныйЭкран;
	Элементы.Ответственный.Видимость = НЕ фПолныйЭкран;
	
	КомандаПолныйЭкран =  ЭтотОбъект.Команды.Найти("КомандаПолныйЭкран");
	
	Если фПолныйЭкран Тогда
		Элементы.ФормаКомандаПолныйЭкран.Картинка = БиблиотекаКартинок.бит_ПолныйЭкранСвернуть;
		Если КомандаПолныйЭкран <> Неопределено Тогда
			 КомандаПолныйЭкран.Подсказка = НСтр("ru='Обычный режим';en='Common mode'");
			 КомандаПолныйЭкран.Заголовок = НСтр("ru='Свернуть';en='Collapse All'");
		КонецЕсли; 
	Иначе
		Элементы.ФормаКомандаПолныйЭкран.Картинка = БиблиотекаКартинок.бит_ПолныйЭкран;
		Если КомандаПолныйЭкран <> Неопределено Тогда
			 КомандаПолныйЭкран.Подсказка = НСтр("ru='Развернуть рабочую область';en='Open Workspace'");
			 КомандаПолныйЭкран.Заголовок = НСтр("ru='Развернуть';en='Expand'");
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПереключитьПодробныеДанные()
	
	Элементы.КомандаПодробныеДанные.Пометка = СкрытьПодробныеДанные;	
	
	Элементы.ГруппаДанныеНиз.Видимость = НЕ СкрытьПодробныеДанные;
		
	КомандаПодробныеДанные = ЭтотОбъект.Команды.Найти("КомандаПодробныеДанные");
	
	Если СкрытьПодробныеДанные Тогда
		Элементы.КомандаПодробныеДанные.Картинка = БиблиотекаКартинок.бит_ПолныйЭкранСвернуть;
		Если КомандаПодробныеДанные <> Неопределено Тогда
			 КомандаПодробныеДанные.Подсказка = НСтр("ru='Показать подробные данные';en='Show details'");
		КонецЕсли;
	Иначе
		Элементы.КомандаПодробныеДанные.Картинка = БиблиотекаКартинок.бит_ПолныйЭкран;
		Если КомандаПодробныеДанные <> Неопределено Тогда
			 КомандаПодробныеДанные.Подсказка = НСтр("ru='Скрыть подробные данные';en='Hide details'");
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРаспределение(МассивИдСтрок, НастройкиРаспределения)
	
	СтрокиДляЗависимых = Новый Массив();
	Для Каждого ИдСтроки Из МассивИдСтрок Цикл
		
		СтрокаИсточник = Объект.БДДС.НайтиПоИдентификатору(ИдСтроки);	
		Если СтрокаИсточник <> Неопределено Тогда
			// Распределение по профилю.
			МассивСтрок = бит_Бюджетирование.РаспределитьПоПрофилюАналитики(НастройкиРаспределения, Объект.БДДС, СтрокаИсточник);
			Для Каждого НоваяСтрока Из МассивСтрок Цикл
				УстановитьИД_БДДС_Сервер(НоваяСтрока);
				ЗаполнитьНорму(ЭтотОбъект, НоваяСтрока, "БДДС", НастройкиРаспределения.ИмяКолонки);
				Если РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов) Тогда
					СтрокиДляЗависимых.Добавить(НоваяСтрока.ПолучитьИдентификатор());
				КонецЕсли; 
			КонецЦикла; // по массиву строк.
			
			
			Если РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов) Тогда
				// Удаление зависимых оборотов, связанных со СтрокойИсточник.
				СтрОтбор = Новый Структура;
				СтрОтбор.Вставить("ИД_Родитель", СтрокаИсточник.ИД);
				НайденныеСтроки = Объект.ЗависимыеОбороты.НайтиСтроки(СтрОтбор);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Объект.ЗависимыеОбороты.Удалить(НайденнаяСтрока);
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла; // по ИД строк.
	Если СтрокиДляЗависимых.Количество() > 0 Тогда
		ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьРаспределениеПоПериодам(Расшифровка, НастройкиРаспределения)
	
	// Строки-Источники удалим, когда проверим диапазон дат новых данных.
	НастройкиРаспределения.УдалятьИсходныеДанные = Ложь;
	
	ИзмененныеПериоды = Новый Массив;
	ЗапрещенныеПериоды = Новый Массив;
	
	ДатаОкончания = Объект.ДатаОкончанияПланирования;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияПланирования) Тогда
		 ДатаОкончания = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(Объект.ДатаНачалаПланирования, Объект.Сценарий.ПродолжительностьИнтервала, Объект.Сценарий.бит_Периодичность);
	КонецЕсли; 
	
	СтрОтбор = бит_БюджетированиеКлиентСервер.СформироватьОтборСтрок(Расшифровка);
	ИсходныеСтроки = Объект.БДДС.НайтиСтроки(СтрОтбор);
	
	Для Каждого СтрокаИсточник Из ИсходныеСтроки Цикл
		
		ИзмененныеПериоды.Добавить(СтрокаИсточник.Период);
		
		// Распределение по профилю.
		МассивСтрок = бит_Бюджетирование.РаспределитьПоПрофилюАналитики(НастройкиРаспределения, Объект.БДДС, СтрокаИсточник);
		
		РеквизитыНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.НастройкаФормы, "РежимОтображенияВыходныхДней");
		// ++ Изменение периодов с учетом выходных.
		Если РеквизитыНастройки = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.НеОтображать Тогда

			Область = Элементы.ТабДокДанные.ТекущаяОбласть;
			Периоды = Новый Массив();
			Периоды.Добавить(Расшифровка.Период);
			
			ВГраница = НастройкиРаспределения.БазаРаспределения.Количество() - 1;
			Индекс = 1;
			Пока Индекс <= ВГраница Цикл
				Если Область.Лево + Индекс <= ТабДокДанные.ШиринаТаблицы Тогда
					НоваяОбласть = ТабДокДанные.Область(Область.Верх, Область.Лево + Индекс, Область.Верх, Область.Лево + Индекс);
					Если ТипЗнч(НоваяОбласть.Расшифровка) = Тип("Структура") Тогда 
						Если НоваяОбласть.Расшифровка.Свойство("Вид") И НоваяОбласть.Расшифровка.Вид = "Значение" Тогда
							Периоды.Добавить(НоваяОбласть.Расшифровка.Период);
						Иначе
							// Передвинем правую границу области периодов.
							ВГраница = ВГраница + 1;
						КонецЕсли; 
					Иначе
						// Передвинем правую границу области периодов.
						ВГраница = ВГраница + 1;
					КонецЕсли; 
				Иначе	
					// Достигли правой границы документа.
					Периоды.Добавить('2036-12-31');
				КонецЕсли; 
				Индекс = Индекс + 1; 
			КонецЦикла; 
			
			Индекс = 0;
			Для каждого Элемент Из МассивСтрок Цикл
				Элемент.Период = Периоды[Индекс];		
				Индекс = Индекс + 1;
			КонецЦикла; 
		КонецЕсли; 
		// -- Изменение периодов с учетом выходных. 
		
		КолСтрок = МассивСтрок.Количество();
		Для Сч = 1 По КолСтрок Цикл
			ЭлЙ = КолСтрок-Сч;
			ТекСтрока = МассивСтрок[ЭлЙ];
			Если НЕ ( ТекСтрока.Период >= Объект.ДатаНачалаПланирования 
				       И ТекСтрока.Период < ДатаОкончания ) Тогда
			
				ЗапрещенныеПериоды.Добавить(ТекСтрока.Период);
			Иначе
			    УстановитьИД_БДДС_Сервер(ТекСтрока);
				ИзмененныеПериоды.Добавить(ТекСтрока.Период);
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;  // по массиву строк-источников.
	
	ИзмененныеПериоды = бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(ИзмененныеПериоды);
	
	ЗапрещенныеПериоды = бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(ЗапрещенныеПериоды);
	Если ЗапрещенныеПериоды.Количество() > 0 Тогда
		
		 // Распределение не может быть выполнено, т.к. данные "вылетели" за границы периода планирования.
		 
		 // Выводим сообщение.
		 СтрПериоды = "";
		 Для Каждого ТекПериод Из ЗапрещенныеПериоды Цикл
		 	СтрПериоды = СтрПериоды+?(ПустаяСтрока(СтрПериоды),"",",")+Формат(ТекПериод,"ДЛФ=D");
		 КонецЦикла; 
		
		 ТекстСообщения = НСтр("ru = 'Периоды планирования %1 за рамками данной формы. Распределение не выполнено.'");
		 ТекстСообщения = СтрШаблон(ТекстСообщения, СтрПериоды);
		 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		 
		 // Обновлять в дереве ничего не нужно. 
		 ИзмененныеПериоды = Новый Массив;
		 
		 // Удаляем строки, получившиеся в результате распределения.
		 Для Каждого СтрокаРезультат Из МассивСтрок Цикл
			 Объект.БДДС.Удалить(СтрокаРезультат);
		 КонецЦикла; 
		 
	Иначе	 
		
		// Распределение выполнено.
		РучнойВводЗависимых = РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов);
		
		// Удаляем исходные данные.
		Для Каждого СтрокаИсточник Из ИсходныеСтроки Цикл
			Объект.БДДС.Удалить(СтрокаИсточник);
			Если РучнойВводЗависимых Тогда
				// Удаление зависимых оборотов, связанных со СтрокойИсточник.
				СтрОтбор = Новый Структура;
				СтрОтбор.Вставить("ИД_Родитель", СтрокаИсточник.ИД);
				НайденныеСтроки = Объект.ЗависимыеОбороты.НайтиСтроки(СтрОтбор);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Объект.ЗависимыеОбороты.Удалить(НайденнаяСтрока);
				КонецЦикла; 
			КонецЕсли; 
		КонецЦикла; // Исходные строки.
		
		// Формируем зависимые обороты при необходимости.
		Если РучнойВводЗависимых Тогда
			СтрокиДляЗависимых = Новый Массив();
			Для Каждого СтрокаРезультат Из МассивСтрок Цикл
				СтрокиДляЗависимых.Добавить(СтрокаРезультат.ПолучитьИдентификатор());
			КонецЦикла;
			Если СтрокиДляЗависимых.Количество() > 0 Тогда
				ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат ИзмененныеПериоды;
	
КонецФункции

&НаСервере
Процедура ВыполнитьРаспределениеЗависимых(МассивИдСтрок, НастройкиРаспределения)
	
	Для Каждого ИдСтроки Из МассивИдСтрок Цикл
		
		СтрокаИсточник = Объект.ЗависимыеОбороты.НайтиПоИдентификатору(ИдСтроки);	
		Если СтрокаИсточник <> Неопределено Тогда
			ИД_Родитель = СтрокаИсточник.ИД;
			// Распределение по профилю.
			МассивСтрок = бит_Бюджетирование.РаспределитьПоПрофилюАналитики(НастройкиРаспределения, Объект.ЗависимыеОбороты, СтрокаИсточник);
			Для Каждого НоваяСтрока Из МассивСтрок Цикл
				НоваяСтрока.ИД = ИД_Родитель;
			КонецЦикла; // по массиву строк.
		КонецЕсли;
	КонецЦикла; // по ИД строк. 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьФорматЧисел(ЕдиницаИзмеренияСумм)

	Если ЕдиницаИзмеренияСумм = ПредопределенноеЗначение("Перечисление.бит_ЕдиницыИзмеренияСумм.Тысячи") Тогда
		ТекФормат = "ЧДЦ=2; ЧС=3"; 
	ИначеЕсли ЕдиницаИзмеренияСумм = ПредопределенноеЗначение("Перечисление.бит_ЕдиницыИзмеренияСумм.Миллионы") Тогда	
		ТекФормат = "ЧДЦ=2; ЧС=6";
	Иначе	
		ТекФормат = "";
	КонецЕсли; 

	Возврат ТекФормат;
	
КонецФункции

// Процедура устанавливает формат в зависимости от единицы измерения. 
//
&НаКлиенте
Процедура УстановитьФорматЧиселКлиент()
	
	ТекФормат = ОпределитьФорматЧисел(Объект.ЕдиницаИзмеренияСумм);
	
	Элементы.ЗависимыеОборотыНорма.Формат = ТекФормат;
	Элементы.ЗависимыеОбороты_РедактированиеНорма.Формат = ТекФормат;

КонецПроцедуры	

// Процедура устанавливает формат в зависимости от единицы измерения. 
//
&НаСервере
Процедура УстановитьФорматЧисел()
	
	ТекФормат = ОпределитьФорматЧисел(Объект.ЕдиницаИзмеренияСумм);
	
	Элементы.ЗависимыеОборотыНорма.Формат = ТекФормат;
	Элементы.ЗависимыеОбороты_РедактированиеНорма.Формат = ТекФормат;

КонецПроцедуры	

// Оповещение на вопрос о подтверждение очистки.
//
// Параметры:
//  Результат    - КодВозвратаДиалога.
//  ДопПараметры - Структура.
//
&НаКлиенте
Процедура ОтветНаПотверждениеОчистки(РезультатОтвет, ДопПараметры) Экспорт
	
	ОчищатьДанные = РезультатОтвет = КодВозвратаДиалога.Да;
	ЗаполнитьЗависимые = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "ЗаполнитьЗависимые", Ложь);
	
    Если ОчищатьДанные Тогда
        ЗаполнитьТабЧасть(ДопПараметры.ВыбранноеЗначение, ОчищатьДанные, ЗаполнитьЗависимые);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗначениеТЧ(Таблица, Поле)
	
	ТекущаяСтрока = Таблица.ТекущиеДанные;
	ВыбранноеЗначение = ТекущаяСтрока[СтрЗаменить(Поле.Имя,Таблица.Имя,"")];	
	ПоказатьЗначение(,ВыбранноеЗначение);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция ЭтоЗащищеннаяОбласть(ОбластьМакета)
	
	Если ОбластьМакета.Защита = Ложь Тогда
		ОбластьЗащищена = Ложь;
	Иначе
		ОбластьЗащищена = Истина;
	КонецЕсли;
	
	Возврат ОбластьЗащищена;
	
КонецФункции

&НаСервере
Процедура ИзменениеНастройкиФормы()
	
	ЕстьОшибки = Ложь;
	
	// Проверка на возможность изменения настройки формы.
	Если ЗначениеЗаполнено(Объект.НастройкаФормы) И ЗначениеЗаполнено(Объект.Сценарий) Тогда
		Если Объект.НастройкаФормы.Вид = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет 
			И Объект.Сценарий.бит_Периодичность <> Объект.НастройкаФормы.ПериодичностьПланирования Тогда
			
			// В случае фиксированного макета переодичность сценария должна совпадать с периодичностью макета.
			ВывестиСообщениеНесовпадениеПериодичности();
			ЕстьОшибки = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
	Если ЕстьОшибки Тогда
		Объект.НастройкаФормы = ТекущаяНастройкаФормы;
		Возврат;
	КонецЕсли;
	
	ОчиститьВсе(ЭтотОбъект);
	ОчиститьДополнительныеТаблицы();
	
	Объект.ПараметрНорм = Объект.НастройкаФормы.ПараметрНорм;
	фИменаПараметраНорм = ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ПодготовитьСтруктурыСвязи(Объект.ПараметрНорм);		
	
	ТекстЗапроса = Объект.НастройкаФормы.ТекстЗапроса;
	АдресКомпоновки = Документы.бит_ФормаВводаБюджета.ИнициализироватьКомпоновщик(ТекстЗапроса, Компоновщик, Новый УникальныйИдентификатор);	
	
    фКэшЗначений.НастройкиФормы = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(Объект.НастройкаФормы);
	
	Бюджет = фКэшЗначений.НастройкиФормы.Бюджет;
	
	Если ЗначениеЗаполнено(Объект.НастройкаФормы) Тогда
		Если фКэшЗначений.НастройкиФормы.ФиксированныйМакет Тогда
			// Для настройки с фиксированным макетом отбор задается в настройке формы ввода.
			Компоновщик.Настройки.Отбор.Элементы.Очистить();
			Объект.ДатаОкончанияПланирования = Неопределено;
		Иначе	
			// Копирование отбора из настройки.
			ОбНастройка   = Объект.НастройкаФормы.ПолучитьОбъект();
			СохрНастройка = ОбНастройка.ПолучитьНастройкиПостроителя();
				
			ВосстановитьОтбор(СохрНастройка);
		КонецЕсли; 
		
		// Копирование значений по-умолчанию из настройки.
		Для Каждого КиЗ Из фКэшЗначений.НастройкиФормы.Измерения Цикл
			ТекОписание = КиЗ.Значение;
			Если НЕ ТекОписание.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать 
				И ЗначениеЗаполнено(ТекОписание.ЗначениеПоУмолчанию) Тогда
				
				ЕстьРазличия = ?(Объект[ТекОписание.Имя] <> ТекОписание.ЗначениеПоУмолчанию, Истина, Ложь);
				Объект[ТекОписание.Имя] = ТекОписание.ЗначениеПоУмолчанию;
				Если ЕстьРазличия Тогда
					// Вызов обработчиков.
					Если ТекОписание.Имя = "Сценарий" Тогда
						ИзменениеСценария(Ложь,Ложь);
					ИначеЕсли ТекОписание.Имя = "Контрагент" Тогда
						ИзменениеКонтрагента();
					ИначеЕсли ТекОписание.Имя = "ДоговорКонтрагента" Тогда	
						ИзменениеДоговораКонтрагента();
					КонецЕсли; 
				КонецЕсли; // ЕстьРазличия.
			КонецЕсли; 
		КонецЦикла; // ФКэшЗначений.НастройкиФормы.Измерения.
        УстановитьПараметрыВыбораСтатей();
	КонецЕсли; // ЗначениеЗаполнено(Объект.НастройкаФормы).
	
	ТекущаяНастройкаФормы = Объект.НастройкаФормы;

	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти  

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры

// Процедура добавляет в кэш реквизитов текущее значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	мКэшРеквизитовФормы[ИмяРеквизита] = Объект[ИмяРеквизита];	
	
КонецПроцедуры

// Процедура извлекает из кэша и присваивает объекту значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ИзвлечьИзКэша(ИмяРеквизита)
	
	Объект[ИмяРеквизита] = мКэшРеквизитовФормы[ИмяРеквизита];
	
КонецПроцедуры

&НаСервере 
Функция ГруппыСтатейОборотов()
	
	ГруппыСтатейОборотов = Новый ТаблицаЗначений();	
	ГруппыСтатейОборотов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиОборотов"));
	
	Если ТабДокДанные.ВысотаТаблицы <> 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатьиОборотов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
		|ГДЕ
		|	СтатьиОборотов.ЭтоГруппа";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ГруппыСтатейОборотов.Добавить(), Выборка);
		КонецЦикла; 
		
		Если ГруппыСтатейОборотов.Количество() > 1000 Тогда
			ГруппыСтатейОборотов.Индексы.Добавить("Ссылка");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ГруппыСтатейОборотов;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция определяет, используются ли обе ячейки в табличном документе.
// 
// Возвращаемое значение:
//  Результат - Булево.
// 
&НаКлиенте
Функция ИспользуютсяДвеЯчейки()
	
	Результат = фКэшЗначений.НастройкиФормы.УчетСумма И фКэшЗначений.НастройкиФормы.УчетКоличество;	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗадатьВопросОбОчисткеДанных(Оповещение) 
	
	Если Объект.БДДС.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Данные будут очищены. Продолжить?';en='Data will be cleared. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Нет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОбОчисткеИзмененииДанных(Оповещение) 
	
	Если НЕ ЗначениеЗаполнено(ПериодПланирования.ДатаНачала) Тогда
		ТекстСообщения = НСтр("ru='Начало периода не должно быть пустым.';en='The beginning of the period must not be empty.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Отмена);
	КонецЕсли;
	
	Если Объект.БДДС.Количество() = 0 Тогда 
		Если ТабДокДанные.ВысотаТаблицы = 0 Тогда
			ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Нет);
		Иначе	
			ВыполнитьОбработкуОповещения(Оповещение, "Перезаполнить");
		КонецЕсли;		
	ИначеЕсли мТекущаяДатаНачалаПланирования <> Объект.ДатаНачалаПланирования 
		ИЛИ мТекущаяДатаОкончанияПланирования <> Объект.ДатаОкончанияПланирования Тогда
		КнопкиВопроса = Новый СписокЗначений;
		КнопкиВопроса.Добавить("Перезаполнить"			, "Перезаполнить");
		КнопкиВопроса.Добавить(КодВозвратаДиалога.Да	, "Очистить");
		КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
		ТекстВопроса = НСтр("ru='Перезаполнить данные бюджета или очистить?';en='Refill budget data or clear?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, КнопкиВопроса, 5, КодВозвратаДиалога.Отмена);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выводит сообщение о несовпадении периодичности сценария и фиксированного макета.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиСообщениеНесовпадениеПериодичности()
	
	ТекстСообщения = НСтр("ru = 'Периодичность сценария должна совпадать с периодичностью фиксированного макета.'; 
						  |en = 'Периодичность сценария должна совпадать с периодичностью фиксированного макета.'");
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	#Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	#КонецЕсли
	
КонецПроцедуры

// Определяет, что активна ячейка для ввода значения.
// 
// Возвращаемое значение:
//  Результат - Булево.
// 
&НаКлиенте
Функция АктивнаРедактируемаяЯчейка()
	
	Результат = Ложь;
	ОблМакета = Элементы.ТабДокДанные.ТекущаяОбласть;
	Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблМакета) Тогда
		Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОблМакета.Расшифровка, "РасшифровкаЯчейкиФормыВвода") 
			  И ОблМакета.Расшифровка.Вид = "Значение" Тогда
			
			Результат = Истина;
		КонецЕсли;	// ИмяКласса подходит.
	КонецЕсли; // ОблМакета подходит.
	Возврат Результат;
	
КонецФункции

// Обновляет значение в ячейке дерева данных по данным, установленным в табличной части. 
// 
// Параметры:
//  Обл - ТабличныйДокумент.
//  Расшифровка - Структура.
//  СтрокиДляЗависимых - Массив.
// 
&НаКлиенте
Процедура ОбновитьЗначениеЯчейкиДерева(Обл, Расшифровка, СтрокиДляЗависимых)
	
	// Копируем отбор из отбора строк.
	СтрОтбор = Новый Структура;
	
	Для Каждого КиЗ Из Расшифровка.Измерения Цикл
		СтрОтбор.Вставить(КиЗ.Ключ, КиЗ.Значение);
	КонецЦикла; 
	СтрОтбор.Вставить("Период", Расшифровка.Период);
	
	// Вычисляем итог для данного отбора.
	МассивСтрок = Объект.БДДС.НайтиСтроки(СтрОтбор);
	
	Ит = 0;
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		Ит = Ит+СтрокаТаблицы[Расшифровка.ИмяРесурса];
	КонецЦикла; 
	
	// Устанавливаем в дерево.
	Обл.Значение = Ит;
	
	УстановитьЗначениеТаблицеДанных(АдресХранилищаДанных,Обл.Имя,Обл.Значение);
	
	Если Объект.ВычислятьФормулыПриВводе Тогда
		МассивЯчеек = Неопределено;
		Результат = ВычислитьЗависимыеФормулы(АдресХранилищаДанных, АдресХранилищаСпискаСмежности,
			Обл.Имя, Обл.Значение,МассивЯчеек);
		
		Для каждого СтруктураИзменений Из Результат.МассивИзменений Цикл
			ТабДокДанные.Области[СтруктураИзменений.Имя].Значение = СтруктураИзменений.Значение;
		КонецЦикла;
		Для каждого ОблИзмененная  Из Результат.ИзмененныеОбласти Цикл
			ИзменениеСодержимогоОбласти(ТабДокДанные.Области[ОблИзмененная], СтрокиДляЗависимых);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеСтраницейОжиданияБДДС(ПоказатьДекорацию)
	
	Если ПоказатьДекорацию Тогда
		Элементы.СтраницыРедактированияДанных.ТекущаяСтраница = Элементы.СтраницаОжиданияДанных;
	Иначе
		Элементы.СтраницыРедактированияДанных.ТекущаяСтраница = Элементы.СтраницаРедактированияДанных;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеСтраницейОжиданияЗависимыеОбороты(ПоказатьДекорацию)
	
	Если ПоказатьДекорацию Тогда
		Элементы.СтраницыРедактированияЗависимые.ТекущаяСтраница = Элементы.СтраницаОжиданияЗависимые;
	Иначе	
		Элементы.СтраницыРедактированияЗависимые.ТекущаяСтраница = Элементы.СтраницаРедактированияЗависимые;
	КонецЕсли; 
	
КонецПроцедуры

// Функция проверяет возможность заполнения дерева данные. 
// Заполнение возможно, если заполнены НастройкаФормы и все измерения, обязательные к заполнению.
// 
// Параметры:
//  ВыводитьСообщения  - Булево.
// 
// Возвращаемое значение:
//   ЗаполнениеВозможно   - Булево.
// 
&НаКлиенте
Функция ЗаполнениеДереваВозможно(ВыводитьСообщения=Ложь)

	ЗаполнениеВозможно = Истина;
	
	ТекстСообщения = "";
	Если НЕ ЗначениеЗаполнено(Объект.НастройкаФормы) Тогда
		ТекстСообщения = НСтр("ru='Не заполнена настройка формы ввода.';en='Input form configuration isn’t filled'");	
		ЗаполнениеВозможно = Ложь;	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаПланирования) Тогда
		ТекстСообщения = ТекстСообщения+?(ПустаяСтрока(ТекстСообщения),"",Символы.ПС)
			+ НСтр("ru='Не указано ""Начало планирования"".';en='Planning start isn’t specified.'");	
		ЗаполнениеВозможно = Ложь;	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияПланирования) И Объект.ДатаОкончанияПланирования < Объект.ДатаНачалаПланирования Тогда
		ТекстСообщения = ТекстСообщения+?(ПустаяСтрока(ТекстСообщения),"",Символы.ПС)
			+ НСтр("ru = 'Неверно указан интервал планирования. Дата окончания предшествует дате начала.';
					|en = 'Incorrect scheduling interval specified. The end date is before the start date.'");	
		ЗаполнениеВозможно = Ложь;	
	КонецЕсли; 
	
	ОбязательныеИзмерения = фКэшЗначений.НастройкиФормы.СпособыЗаполнения[ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию")];
	
	Если ОбязательныеИзмерения <> Неопределено Тогда
		Для Каждого Измерение Из ОбязательныеИзмерения Цикл
			Если НЕ ЗначениеЗаполнено(Объект[Измерение]) Тогда
				ТекстДоб = НСтр("ru = 'Не заполнено значение по умолчанию ""%1"".';
								|en = 'The default value ""%1"" has not been populated.'");
				ТекстДоб = СтрШаблон(ТекстДоб, Измерение);
				ТекстСообщения = ТекстСообщения+?(ПустаяСтрока(ТекстСообщения),"",Символы.ПС)+ТекстДоб;	
				ЗаполнениеВозможно = Ложь;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	ИзмеренияРазворачивать = фКэшЗначений.НастройкиФормы.СпособыЗаполнения[ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать")];
	Если ИзмеренияРазворачивать.Найти("СтатьяОборотов") = Неопределено 
		 И ЗначениеЗаполнено(Объект.СтатьяОборотов) Тогда
	
		 // Настройки статьи должны соответствовать настройкам разворотов.
		 НастройкаСтатьи = фКэшЗначений.НастройкиСтатей[Объект.СтатьяОборотов];
		 Если НЕ НастройкаСтатьи = Неопределено Тогда
		 	  Для Каждого Имя Из ИзмеренияРазворачивать Цикл
			  	  Если НЕ НастройкаСтатьи["Учет_"+Имя] Тогда
					  ТекстДоб = НСтр("ru = 'Настройка аналитик статьи оборотов по умолчанию ""%1"" не соответствует разворачиваемым измерениям.';
										|en = 'The default dimension setting for the turnover item ""%1"" does not match the dimensions being expanded.'");
					  ТекстДоб = СтрШаблон(ТекстДоб, Объект.СтатьяОборотов);
					  ТекстСообщения = ТекстСообщения+?(ПустаяСтрока(ТекстСообщения),"",Символы.ПС)+ТекстДоб;	
					  ЗаполнениеВозможно = Ложь; 
					  Прервать;
				  КонецЕсли; 					  				  
			  КонецЦикла; // ИзмеренияРазворачивать.
		 КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ЗаполнениеВозможно Тогда
		ТекстСообщения = ТекстСообщения+Символы.ПС
					   + НСтр("ru = 'Заполнение невозможно.'; en = 'Filling is not possible.'");
		Если ВыводитьСообщения Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли; 
	
	Возврат ЗаполнениеВозможно;
	
КонецФункции

// Определяет, является ли данная аналитика обязательной.
// 
// Параметры:
//  Имя - Строка
// 
// Возвращаемое значение:
//  Результат - Булево.
// 
&НаКлиенте
Функция ЭтоОбязательнаяАналитика(Имя)
	
	ИзмеренияОбязательные = фКэшЗначений.НастройкиФормы.СпособыЗаполнения[ПредопределенноеЗначение("Перечисление.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию")];
	Результат = ?(ИзмеренияОбязательные.Найти(Имя) = Неопределено, Ложь, Истина);
	Возврат Результат;
	
КонецФункции

// Выводит вопрос о необходимости проведения замены аналитик по-умолчанию.
// 
// Параметры:
//  Имя - Строка
//  Синоним - Строка
// 
// Возвращаемое значение:
//  РезДействие - Строка.
// 
&НаКлиенте
Функция ЗадатьВопросОЗаменеЗначенияПоУмолчанию(Имя, Синоним)

	РезДействие = "";
	
	Если Объект.БДДС.Количество() > 0 Тогда
		Если ЭтоОбязательнаяАналитика(Имя) Тогда
			ДополнительныеДанные = Новый Структура("Имя", Имя);
			Оповещение = Новый ОписаниеОповещения("ВопросЗаменаЗначенияПоУмолчаниюЗавершение", ЭтотОбъект, ДополнительныеДанные);
			ТекстВопроса = НСтр("ru='Изменено значение аналитики по-умолчанию ""%1"". Произвести замену в пределах документа?';
							    |en='Analysts default changed to ""%1"". Replace within the document?'");
			ТекстВопроса = СтрШаблон(ТекстВопроса, Синоним);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
		КонецЕсли; 
	КонецЕсли; 
	Возврат РезДействие;
	
КонецФункции

&НаКлиенте
Процедура ИзменениеСодержимогоОбласти(Обл, СтрокиДляЗависимых, ВычислятьФормулы = Истина)
	
	ОбластьР = Обл.Расшифровка;
	Если ОбластьР.Вид = "Значение" Тогда
		Если Обл.Значение = 0 Тогда
			
			УдалятьСтроки = Истина;
			Если ИспользуютсяДвеЯчейки() Тогда
				
				ИмяПарн = бит_БюджетированиеКлиент.ИмяВторойЯчейки(Обл.Имя);
				ОблПарн = ТабДокДанные.Области.Найти(ИмяПарн);
				Если НЕ ОблПарн.Значение = 0
					ИЛИ НЕ Обл.Значение = 0 Тогда
					УдалятьСтроки = Ложь;
				КонецЕсли; 
			Иначе
				Если НЕ Обл.Значение = 0 Тогда
					УдалятьСтроки = Ложь;
				КонецЕсли;	
			КонецЕсли;	
			
			Если УдалятьСтроки Тогда
				СтрОтбор = бит_БюджетированиеКлиентСервер.СформироватьОтборСтрок(ОбластьР);
				МассивСтрок = Объект.БДДС.НайтиСтроки(СтрОтбор);
				// Удаляем строки по данной комбинации измерений.
				Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
					Если РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов) Тогда
						СтрОтборЗав = Новый Структура;
						СтрОтборЗав.Вставить("ИД_Родитель", СтрокаТаблицы.ИД);
						МассивЗависимые = Объект.ЗависимыеОбороты.НайтиСтроки(СтрОтборЗав);
						Для Каждого СтрокаЗависимые Из МассивЗависимые Цикл
							Объект.ЗависимыеОбороты.Удалить(СтрокаЗависимые);
						КонецЦикла; // МассивСтрокЗависимые.
					КонецЕсли; 
					Объект.БДДС.Удалить(СтрокаТаблицы);
				КонецЦикла; // МассивСтрок. 
			КонецЕсли;
		Иначе	
			СтрОтбор = бит_БюджетированиеКлиентСервер.СформироватьОтборСтрок(ОбластьР);
			МассивСтрок = Объект.БДДС.НайтиСтроки(СтрОтбор);
			ЭтоРасчетная = ?(ОбластьР.Вид = "Значение" И ЗначениеЗаполнено(ОбластьР.Формула), Истина, Ложь);			
			
			Если МассивСтрок.Количество() = 0 Тогда
				// Создаем новую строку.
				СоздатьНовуюСтрокуБюджета_Клиент(ОбластьР, Обл.Значение, СтрокиДляЗависимых, ЭтоРасчетная);
			ИначеЕсли МассивСтрок.Количество() = 1 Тогда	
				// Изменяем значение строки.
				ТекСтрока = МассивСтрок[0];
				ТекСтрока[ОбластьР.ИмяРесурса] = Обл.Значение;
				Если ЭтоРасчетная И НЕ ТекСтрока.Расчетная Тогда
					ТекСтрока.Расчетная = Истина;
				КонецЕсли;	
				Если ОбластьР.ИмяРесурса = "Количество" Тогда
					бит_БюджетированиеКлиентСервер.РассчитатьПоНорме(ТекСтрока, фИспользоватьНормы);
				КонецЕсли; 
				бит_БюджетированиеКлиентСервер.ПроверитьПоляВСтроке(ТекСтрока, фКэшЗначений.НастройкиСтатей);
				Если РазрешенРучнойВводЗависимыхОборотов(Объект.РежимЗависимыхОборотов) Тогда
					СтрокиДляЗависимых.Добавить(ТекСтрока.ПолучитьИдентификатор());
				КонецЕсли; 
				
			Иначе
				// Выполняем распределение согласно текущим весам.
				ИтПред = 0;
				Для каждого СтрокаТаблицы Из МассивСтрок Цикл
					ИтПред = ИтПред + бит_ОбщегоНазначенияКлиентСервер.МодульЧисла(СтрокаТаблицы[ОбластьР.ИмяРесурса]);
				КонецЦикла; 
				ЗначениеРаспределения = Обл.Значение;
				Ит = 0;
				Для каждого СтрокаТаблицы Из МассивСтрок Цикл
					СтрокаТаблицы[ОбластьР.ИмяРесурса] = ЗначениеРаспределения*?(ИтПред <>0, СтрокаТаблицы[ОбластьР.ИмяРесурса]/ИтПред, 0);
					Ит = Ит + СтрокаТаблицы[ОбластьР.ИмяРесурса];
					Если ОбластьР.ИмяРесурса = "Количество" Тогда
						бит_БюджетированиеКлиентСервер.РассчитатьПоНорме(СтрокаТаблицы, фИспользоватьНормы);
					КонецЕсли;
				КонецЦикла; 
				Обл.Значение = Ит;
			КонецЕсли; 
		КонецЕсли;
		
		Модифицированность = Истина;
		
		Если ВычислятьФормулы Тогда
			Если Объект.ВычислятьФормулыПриВводе Тогда
				МассивЯчеек = Неопределено;
				Результат 	= ВычислитьЗависимыеФормулы(АдресХранилищаДанных, АдресХранилищаСпискаСмежности,
					Обл.Имя, Обл.Значение,МассивЯчеек);				
				Для каждого СтруктураИзменений Из Результат.МассивИзменений Цикл
					ТабДокДанные.Области[СтруктураИзменений.Имя].Значение = СтруктураИзменений.Значение;
				КонецЦикла; 
				
				Для каждого ОблИзмененная Из Результат.ИзмененныеОбласти Цикл
					ИзменениеСодержимогоОбласти(ТабДокДанные.Области[ОблИзмененная], СтрокиДляЗависимых, Ложь);
				КонецЦикла;
			КонецЕсли; 
		Иначе
			УстановитьЗначениеТаблицеДанных(АдресХранилищаДанных,Обл.Имя,Обл.Значение);
		КонецЕсли;
	КонецЕсли; 
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеТаблицеДанных(АдресХранилищаДанных,ИмяОбласти,Значение)

	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресХранилищаДанных);
	СтрОтбор = Новый Структура("Имя,ИмяАргумента",ИмяОбласти,ИмяОбласти);
	МассивСтрок = ТаблицаДанных.НайтиСтроки(СтрОтбор);
	Если МассивСтрок.Количество()>0 Тогда
		СтрокаТаблицы = МассивСтрок[0];
		СтрокаТаблицы.Значение = Значение;
		ПоместитьВоВременноеХранилище(ТаблицаДанных,АдресХранилищаДанных);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВычислитьЗависимыеФормулы(АдресХранилищаДанных, АдресХранилищаСпискаСмежности, ИмяОбласти, Значение, МассивЯчеек)

	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресХранилищаДанных);
	СписокСмежности = ПолучитьИзВременногоХранилища(АдресХранилищаСпискаСмежности);
	
	СтрОтбор = Новый Структура("Имя,ИмяАргумента",ИмяОбласти,ИмяОбласти);
	МассивСтрок = ТаблицаДанных.НайтиСтроки(СтрОтбор);
	Если МассивСтрок.Количество()>0 Тогда
		СтрокаТаблицы = МассивСтрок[0];
		СтрокаТаблицы.Значение = Значение;
	КонецЕсли; 
	// На больших макетах эффективнее пересоздавать колонки, чем перезаполнять значениями по умолчанию.
	ТаблицаДанных.Колонки.Удалить("ЗначениеВычисленияФормулы");
	ТаблицаДанных.Колонки.Удалить("ФормулаВычислена");
	ТаблицаДанных.Колонки.Добавить("ЗначениеВычисленияФормулы", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("ФормулаВычислена", Новый ОписаниеТипов("Булево"));

	Результат = Документы.бит_ФормаВводаБюджета.ВычислитьЗависимыеФормулы(ТаблицаДанных, СписокСмежности,  ИмяОбласти, МассивЯчеек);
	ПоместитьВоВременноеХранилище(ТаблицаДанных,АдресХранилищаДанных);
	Возврат Результат;
	
КонецФункции

// Процедура обновляет парную ячейку (Количество для Сумма, Сумму для Количества) в дереве.
// 
&НаКлиенте
Процедура ОбновитьПарнуюЯчейки(Обл, СтрокиДляЗависимых)
	
	// Возможно следует обновить значение парной ячейки.
	Если ИспользуютсяДвеЯчейки() Тогда
		ИмяПарн = бит_БюджетированиеКлиент.ИмяВторойЯчейки(Обл.Имя);
		ОблПарн = ТабДокДанные.Области.Найти(ИмяПарн);
		Если бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ОблПарн) 
			И бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ОблПарн.Расшифровка, "РасшифровкаЯчейкиФормыВвода") Тогда
			ОбновитьЗначениеЯчейкиДерева(ОблПарн, ОблПарн.Расшифровка, СтрокиДляЗависимых);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

// Процедура открывает отбработку получения данных в различных режимах заполнения. 
// 
&НаКлиенте
Процедура ОткрытиеОбработкиПолучения(ДополнительныеПараметры)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаДок", Объект.Дата);
	ПараметрыФормы.Вставить("ДокументЗаполнения", Объект.Ссылка);
	ПараметрыФормы.Вставить("РежимЗаполнения", ДополнительныеПараметры.РежимЗаполнения);
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	ПараметрыЗаполнения.Вставить("КурсДокумента", Объект.КурсДокумента);
	ПараметрыЗаполнения.Вставить("КратностьДокумента", Объект.КратностьДокумента);
	ПараметрыЗаполнения.Вставить("Сценарий", Объект.Сценарий);
	ПараметрыЗаполнения.Вставить("ЕдиницаИзмеренияСумм", Объект.ЕдиницаИзмеренияСумм);
	ПараметрыЗаполнения.Вставить("ЕдиницаИзмеренияСуммДокумента", Объект.ЕдиницаИзмеренияСумм);

	ПараметрыФормы.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);
	
	ДанныеДокументаЗаполнения = бит_КазначействоКлиент.НовыеПараметрыДокументаДляПолученияДанныхБюджета();
	ЗаполнитьЗначенияСвойств(ДанныеДокументаЗаполнения, Объект);
	ДанныеДокументаЗаполнения.ЕдиницаИзмеренияСуммДокумента = Объект.ЕдиницаИзмеренияСумм;
	ПараметрыФормы.Вставить("ДанныеДокументаЗаполнения", ДанныеДокументаЗаполнения);
	
	ИмяОбработкиПолучения = "";
	Если ДополнительныеПараметры.РежимЗаполнения = "ЗаполнениеПоСвязанномуСценарию" Тогда
		ИмяОбработкиПолучения = "бит_ПолучениеДанныхБюджетаИзСвязанногоСценария";
	Иначе
		ИмяОбработкиПолучения = "бит_ПолучениеДанныхБюджета";
	КонецЕсли;
	ИмяФормыПолучения = СтрШаблон("Обработка.%1.Форма", ИмяОбработкиПолучения);
	
	ОткрытьФорму(ИмяФормыПолучения, ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры	

// Процедура открывает отбработку получения данных в различных режимах заполнения. 
// 
&НаКлиенте
Процедура ОткрытьОбработкуПолучения(РежимЗаполнения)
	
	ДополнительныеПараметры = Новый Структура("РежимЗаполнения", РежимЗаполнения);	
	
	Если Объект.Ссылка.Пустая() Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросОткрытьОбработкуПолученияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru='Для продолжения необходимо записать документ. Выполнить запись?';
							|en='To continue, you must write the document. Record?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	Иначе	
		// Безусловное открытие обработки.
		ОткрытиеОбработкиПолучения(ДополнительныеПараметры);
	КонецЕсли;	
	
КонецПроцедуры

// Процедура обработчик оповещения вопроса о необходимости записи документа 
// при открытии обработки заполнения. 
// 
&НаКлиенте
Процедура ВопросОткрытьОбработкуПолученияЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УспешноЗаписан = Записать();
		Если УспешноЗаписан Тогда
			ОткрытиеОбработкиПолучения(ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Установка оформления таблицы отбор
    бит_МеханизмПолученияДанных.УстановитьОформлениеТаблицыОтбор(УсловноеОформление);
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗависимыеОборотыКомментарийРасчета.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗависимыеОбороты_РедактированиеКомментарийРасчета.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.КурсДокумента");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = -1; 
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветТочекАлгоритма);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст"     , НСтр("ru = 'Комментарий расчета';
																 	|en = 'Calculation commentary'"));
	
КонецПроцедуры

// Процедура отключает отбор в табличном поле ЗависимыеОбороты.
// 
&НаКлиенте
Процедура ОтключитьОтборЗависимые()

	Элементы.ЗависимыеОбороты.ОтборСтрок = Неопределено;

КонецПроцедуры

// Процедура устанавливает отбор в табличном поле ЗависимыеОбороты.
// 
&НаКлиенте
Процедура УстановитьОтборЗависимые(ИдСтроки)
	
	Если фУстанавливатьОтборЗависимых Тогда
		СтрокаРодитель = Объект.БДДС.НайтиПоИдентификатору(ИдСтроки);
		Если НЕ СтрокаРодитель = Неопределено  Тогда
			Элементы.ЗависимыеОбороты.ОтборСтрок = Новый ФиксированнаяСтруктура("ИД_Родитель",СтрокаРодитель.ИД);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ЗависимыеОбороты

// Функция определяет разрешен ли ручной ввод зависимых оборотов.
// 
// Возвращаемое значение:
//  Результат   - Булево.
// 
&НаКлиентеНаСервереБезКонтекста
Функция РазрешенРучнойВводЗависимыхОборотов(Режим)
	
	Результат = Ложь;
	Если Режим = ПредопределенноеЗначение("Перечисление.бит_РежимыЗависимыхОборотов.Ручной") Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция РазрешенВводЗависимыхОборотов(ЗаполнятьПриАвтоматическом = Истина)
	
	Результат = Ложь;
	Если (ЗаполнятьПриАвтоматическом 
		И Объект.РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Автоматический)
		ИЛИ Объект.РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Ручной Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Выполняет очистку зависимых оборотов. 
// 
&НаСервере
Процедура ОчиститьЗависимыеОбороты()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ОчиститьЗависимыеОбороты();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

// Процедура удаляет строки зависимых оборотов, соответствующие указанной строке данных.
// 
// Параметры:
//  ТекущаяСтрока  - СтрокаТабличнойЧастиБДДС.
// 
&НаСервере
Процедура ОчиститьЗависимыеОборотыПоСтроке(Знач ИдСтроки)
	
    ТекущаяСтрока = Объект.БДДС.НайтиПоИдентификатору(ИдСтроки);	
	
	Если ТекущаяСтрока <> Неопределено Тогда
		СтруктураОтбор = Новый Структура;
		СтруктураОтбор.Вставить("ИД_Родитель",ТекущаяСтрока.ИД);
		МассивСтрок = Объект.ЗависимыеОбороты.НайтиСтроки(СтруктураОтбор);
		Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
			Объект.ЗависимыеОбороты.Удалить(СтрокаТаблицы);
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры

// Выполняет заполнение зависимых оборотов. 
// 
// Параметры:
//  ЗаполнятьПриАвтоматическом - Булево. (По умолчанию = Истина).
//
&НаСервере
Процедура ЗаполнитьЗависимыеОбороты(ЗаполнятьПриАвтоматическом = Истина)
	
	Если РазрешенВводЗависимыхОборотов(ЗаполнятьПриАвтоматическом) Тогда
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДокументОбъект.ЗаполнитьЗависимыеОбороты();
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	КонецЕсли; 
	
КонецПроцедуры

// Процедура заполняет зависимые обороты по строке данных.
// 
// Параметры:
//  ТекущаяСтрока  - СтрокаТабличнойЧасти.БДДС
//  Очищать        - Булево.
// 
&НаСервере
Процедура ЗаполнитьЗависимыеОборотыПоСтроке(Знач ИдСтроки, Знач Очищать = Истина)
	
	ТекущаяСтрока = Объект.БДДС.НайтиПоИдентификатору(ИдСтроки);
	Если ТекущаяСтрока <> Неопределено Тогда
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДокументОбъект.ЗаполнитьЗависимыеОборотыПоСтроке(ТекущаяСтрока, Очищать);
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗависимыеОборотыПоСтрокам(СтрокиДляЗависимых)
	
	СтрокиДляЗависимых = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтрокиДляЗависимых);
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого ИдСтроки Из СтрокиДляЗависимых Цикл
		ТекущаяСтрока = Объект.БДДС.НайтиПоИдентификатору(ИдСтроки);
		Если ТекущаяСтрока <> Неопределено Тогда
			ДокументОбъект.ЗаполнитьЗависимыеОборотыПоСтроке(ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла; 
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	СтрокиДляЗависимых = Неопределено;
	
КонецПроцедуры

// Обращение на сервер для кэширования табличной части БДДС.
// Дает существенное ускорении при работе с отборами ТаблицФормы.
// Например, активация ячейки макета/поиск на закладке "Строки бюджета".
//
&НаСервере
Процедура Оптимизация()
	
	Для каждого ТекущаяСтрока Из Объект.БДДС Цикл
		ТекущаяСтрока.Служебный = ТекущаяСтрока.СтатьяОборотов.УникальныйИдентификатор();
	КонецЦикла;
	
	ПостроенИндексПоиска = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСExcel

#Область ВыгрузкаЗагрузкаНапрямуюИзФормы

// Осуществляет выгрузку шаблона формы ввода в Excel. 
// 
&НаКлиенте
Процедура ВыгрузитьШаблонЭксель()
    
    бит_ОбменДаннымиКлиент.ФВБ_ВыгрузитьШаблонЭксель(ТабДокДанные
                                            , Объект.Ссылка
                                            , фДеревоВрем
                                            , фКэшЗначений.НастройкиФормы.КоличествоРазворачивать);
	
КонецПроцедуры

// Выполняет загрузку данных по шаблону Excel.
// 
&НаКлиенте
Процедура ЗагрузитьДанныеПоШаблону()
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьДанныеПоШаблонуЗавершение", ЭтотОбъект);
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    ДиалогВыбора.МножественныйВыбор = Ложь;
    ДиалогВыбора.Фильтр = "Все файлы Excel (*.xls, *.xlsx)|*.xls; *.xlsx";         
	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, ДиалогВыбора)
    
КонецПроцедуры

// Обработчик завершения выбора каталога сохраненных файлов.
//  См. Синтакс-помощник: ДиалогВыбораФайла.Показать().
//
&НаКлиенте
Процедура ЗагрузитьДанныеПоШаблонуЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
        ПутьКФайлу = ВыбранныеФайлы[0];
		ДанныеЭксель = бит_ОбменДаннымиКлиент.ФВБ_ЗагрузитьДанныеПоШаблону(ПутьКФайлу);
        Если ДанныеЭксель <> Неопределено Тогда
            ОчиститьТаблицы(ЭтотОбъект);
    		// Преобразование данных. 		
    		УстановитьЗагруженныеДанные(ДанныеЭксель);
    		Модифицированность = Истина;
    	КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСExcelЧерезПроформы

// Процедура загружает данные из проформы. 
//
&НаКлиенте
Процедура ЗагрузитьДанныеПроформы(Режим)

	ДополнительныеДанные = Новый Структура("Режим", Режим);
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьДанныеПроформыВыборФайлаЗавершение", ЭтотОбъект, ДополнительныеДанные);
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Фильтр = "Все файлы Excel (*.xls, *.xlsx)|*.xls; *.xlsx";

	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, ДиалогВыбора)

КонецПроцедуры

// Обработчик завершения выбора каталога сохраненных файлов.
//  См. Синтакс-помощник: ДиалогВыбораФайла.Показать().
//
&НаКлиенте 
Процедура ЗагрузитьДанныеПроформыВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеДанные) Экспорт

	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда

		ПолноеИмя = ВыбранныеФайлы[0];
		
		ТекстСостояние = НСтр("ru='Загрузка данных...';en='Loading data ...'");
		Состояние(ТекстСостояние);
		
		// Открытие эксель.
		Отказ = Ложь;		
		Эксель = бит_ОбменДаннымиКлиент.InitExcel(Ложь, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
		
		ЭксельКнига = бит_ОбменДаннымиКлиент.OpenExcelFile(Эксель, ПолноеИмя, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ИмяПроформы = "";
		// Чтение данных шапки.
		ЛистШапка = Неопределено;
		Для Каждого Лист Из ЭксельКнига.Sheets Цикл
			// Найдем лист с данными шапки требуемой проформы.
			ПараметрыЛиста = бит_ПроформыКлиент.GetHiddenParams(Лист);
			
			Если ПараметрыЛиста.ВидЛиста = "Шапка"  Тогда
				ИмяПроформы = ПараметрыЛиста.ИмяПроформы;
				ЛистШапка = Лист;
			КонецЕсли; 
		КонецЦикла; 

		Если НЕ ЗначениеЗаполнено(ИмяПроформы) Тогда
			  Отказ = Истина;
			  ТекстСообщения = НСтр("ru='Не удалось определить имя проформы. Возможно данный файл не является шаблоном проформы.';
			  						|en='Could not determine the name of the pro forma. Maybe this is the template file isn’t pro forma.'");
			  ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			  Возврат;
		КонецЕсли; 
		
		РезДанныеВидаПроформы = ДанныеВидаПроформы(ИмяПроформы);
		
		КомплектДанных = Новый Структура;
		КомплектДанных.Вставить("ИмяПроформы",		ИмяПроформы);
		КомплектДанных.Вставить("ПсевдоМетаданные",	   РезДанныеВидаПроформы.ПсевдоМетаданные);
		КомплектДанных.Вставить("ВидФормыСбораДанных", РезДанныеВидаПроформы.ВидФормыСбораДанных);
		КомплектДанных.Вставить("ИмяТаблицыДанных",    РезДанныеВидаПроформы.ИмяТаблицыДанных);
		
		// Чтение источников выпадающих списков.
		СпискиИсточники     = бит_ПроформыКлиентСервер.ПрочитатьСпискиИсточники(ЭксельКнига);
		КомплектДанных.Вставить("СпискиИсточники", СпискиИсточники);
		
		МодельДокумента = Новый Структура;
		
		// Чтение данных шапки.
		ЛистШапка = Неопределено;
		Для Каждого Лист Из ЭксельКнига.Sheets Цикл
			// Найдем лист с данными шапки требуемой проформы.
			ПараметрыЛиста = бит_ПроформыКлиент.GetHiddenParams(Лист);
			Если ПараметрыЛиста.ВидЛиста = "Шапка" И ПараметрыЛиста.ИмяПроформы = ИмяПроформы Тогда
				ЛистШапка = Лист;
			КонецЕсли; 
		КонецЦикла; 
		
		Если НЕ ЛистШапка = Неопределено Тогда
			бит_ПроформыКлиент.ПрочитатьДанныеШапки(ЭксельКнига, ЛистШапка, КомплектДанных.ПсевдоМетаданные, ИмяПроформы, МодельДокумента);
		КонецЕсли; 
		
		// Чтение данных табличных частей.
		бит_ПроформыКлиент.ПрочитатьДанныеТабЧастей(ЭксельКнига, КомплектДанных.ПсевдоМетаданные, МодельДокумента, ИмяПроформы);
		
		КомплектДанных.Вставить("МодельДокумента", МодельДокумента);
		
		бит_ОбменДаннымиКлиент.CloseExcelFile(ЭксельКнига, Ложь);
        бит_ОбменДаннымиКлиент.QuitExcel(Эксель);		
		
		ТекстСостояние = НСтр("ru='Преобразование данных...';en='Data conversion ...'");
		Состояние(ТекстСостояние);

		ОбработатьЗагруженныеДанные(КомплектДанных, ДополнительныеДанные.Режим);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзТабличногоДокумента

// Процедура открывает форму обработки бит_ЗагрузкаДанныхИзТабличногоДокумента проверяя записан ли документ. 
//
// Параметры:
//  ИмяТаблицы - Строка.
//
&НаКлиенте
Процедура ОткрытьФормуЗагрузкиДанныхЧерезТабДок(ИмяТаблицы)
    
    ДопПараметры = Новый Структура("ИмяТаблицы", ИмяТаблицы);
       
    Если Параметры.Ключ.Пустая() ИЛИ Модифицированность Тогда  
        
        ТекстВопроса = НСтр("ru = 'Данные еще не записаны. 
                             	  |Выполнение действия ""Загрузить через табличный документ"" возможно только после записи данных.
                             	  |Записать?'; 
							 |en = 'Данные еще не записаны. 
                             	  |Выполнение действия ""Загрузить через табличный документ"" возможно только после записи данных.
                             	  |Записать?'");				
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросЗаписатьДокументДляЗагрузкиЧерезТД", ЭтотОбъект, ДопПараметры), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
        
    Иначе
        
        ОткрытьФормуЗагрузкиДанныхЧерезТабДокОкончание(ДопПараметры);
        
    КонецЕсли;	
		
КонецПроцедуры

// Обработка оповещения вопроса пользователю. 
//
// Параметры:
//  Результат               - Строка.
//  ДополнительныеПараметры - Структура.
//
&НаКлиенте
Процедура ВопросЗаписатьДокументДляЗагрузкиЧерезТД(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
   	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
        ЗаписьВыполнена = Записать();        
        Если ЗаписьВыполнена Тогда
            // Флаг модифицированности автоматически не снимается.
            ОткрытьФормуЗагрузкиДанныхЧерезТабДокОкончание(ДополнительныеПараметры);
        КонецЕсли;
	КонецЕсли;

КонецПроцедуры 

// Процедура открывает форму обработки бит_ЗагрузкаДанныхИзТабличногоДокумента. 
//
// Параметры:
//  ДополнительныеПараметры - Структура.
//
&НаКлиенте
Процедура ОткрытьФормуЗагрузкиДанныхЧерезТабДокОкончание(ДополнительныеПараметры)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектМетаданных",		"Документ.бит_ФормаВводаБюджета");
   	ПараметрыФормы.Вставить("ОбъектДляЗаполнения",	Объект.Ссылка);
	Если ДополнительныеПараметры.Свойство("ИмяТаблицы") Тогда
		ПараметрыФормы.Вставить("РежимЗагрузки",
			ПредопределенноеЗначение("Перечисление.бит_РежимыЗагрузки.ТабличнаяЧасть"));
	    ПараметрыФормы.Вставить("ИмяТабЧасти", 		ДополнительныеПараметры.ИмяТаблицы);
	КонецЕсли;
	     
    ОткрытьФорму("Обработка.бит_ЗагрузкаДанныхИзТабличногоДокумента.Форма", ПараметрыФормы, ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
  	                                      
КонецПроцедуры 

// Процедура восстанавливает загруженные из Excel данные.
//
// Параметры:
//  ОбъектДляЗаполнения - ДанныеФормыСтруктура.
//  ИмяТабЧасти         - Строка.
//  
&НаСервере
Процедура ВосстановитьЗагруженныеИзExcelДанные(ИмяТабЧасти, Знач ОбъектДляЗаполнения = Неопределено)
    
    Если ТипЗнч(ОбъектДляЗаполнения) = Тип("ДокументСсылка.бит_ФормаВводаБюджета") Тогда
        ОбъектДляЗаполнения_Объект = ОбъектДляЗаполнения.ПолучитьОбъект();
    КонецЕсли;
	ЗначениеВДанныеФормы(ОбъектДляЗаполнения_Объект, Объект);
	
	Если ИмяТабЧасти = "БДДС" Тогда
        ВосстановитьДерево(Истина, Истина, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Выполняет расчет и вывод показателей выделенной области ячеек.
// См. обработчик события ТабДокДанныеПриАктивизацииОбласти.
//
&НаКлиенте
Процедура РассчитатьПоказателиДинамически()
	// АПК:278-выкл Проектное решение вызвать функционал другой подсистемы.
	ОбщегоНазначенияСлужебныйКлиент.РассчитатьПоказатели(ЭтотОбъект, "ТабДокДанные");
	// АПК:278-вкл
КонецПроцедуры

&НаСервере
Процедура ОбновитьКурсСервер()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ИзменениеВалюты();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Функция ПараметрыИзмененияТаблицыДокумента(ИмяТабличнойЧасти)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Команда",			"бит_ФормаВводаБюджета");
	ПараметрыФормы.Вставить("Объект",			Объект.Ссылка);
	ПараметрыФормы.Вставить("ИмяТабличнойЧасти",ИмяТабличнойЧасти);
	Если ИмяТабличнойЧасти = "БДДС" Тогда
		ПараметрыФормы.Вставить("ВидимостьАналитик", ВидимостьАналитикБДДСРедактирование());
	Иначе	
		ПараметрыФормы.Вставить("ВидимостьАналитик", Неопределено);
	КонецЕсли;
	ПараметрыФормы.Вставить("ТабличнаяЧасть",	 
		ПоместитьВоВременноеХранилище(Объект[ИмяТабличнойЧасти].Выгрузить(), УникальныйИдентификатор));
		
	Возврат ПараметрыФормы;	
	
КонецФункции

&НаСервере
Функция ВидимостьАналитикПоНастройкеДокумента()
	
	ВидимостьАналитик = Новый Структура; 
	
	Для Каждого КиЗ Из фКэшЗначений.НастройкиФормы.Измерения Цикл
		Если КиЗ.Ключ = "Сценарий" Тогда
			Продолжить;
		КонецЕсли; 		
		
		ТекОписание = КиЗ.Значение;
		Показать = ?(ТекОписание.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию 
		ИЛИ ТекОписание.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать, Ложь, Истина);
		
		Если Найти(ТекОписание.Имя,"Аналитика_")>0 Тогда
			Если фКэшЗначений.НастройкиИзмерений[ТекОписание.Имя] = Неопределено Тогда
				Показать = Ложь;
			КонецЕсли;	
		КонецЕсли; 				 
		ВидимостьАналитик.Вставить("БДДС_Редактирование" + ТекОписание.Имя, Показать);
	КонецЦикла;

	Возврат ВидимостьАналитик;
	
КонецФункции

&НаСервере
Функция ВидимостьАналитикБДДСРедактирование()

	ВидимостьАналитик = Новый Структура;
	РеквизитыТаблицы = Метаданные.Документы.бит_ФормаВводаБюджета.ТабличныеЧасти.БДДС.Реквизиты;
	Для каждого Реквизит Из РеквизитыТаблицы Цикл
		ИмяЭлемента = "БДДС_Редактирование" + Реквизит.Имя;
		Если Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
			ВидимостьАналитик.Вставить(Реквизит.Имя, Элементы[ИмяЭлемента].Видимость);
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат ВидимостьАналитик;
	
КонецФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыеПараметрыВставкиИзБуфера()

	ПараметрыВставки = Новый Структура; 
	ПараметрыВставки.Вставить("Имя",   "");
	ПараметрыВставки.Вставить("Верх",  0);
	ПараметрыВставки.Вставить("Лево",  0);
	ПараметрыВставки.Вставить("Низ",   0);
	ПараметрыВставки.Вставить("Право", 0);
	
	Возврат ПараметрыВставки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыРасчетаЦен(Форма)
	
	Объект = Форма.Объект;
	КэшЗначений = Форма.фКэшЗначений;
	ИспользоватьНормы = Форма.фИспользоватьНормы;
	
	ПараметрыРасчетаЦен = Новый Структура;
	ПараметрыРасчетаЦен.Вставить("ЗаполнитьПоТипуЦен", Ложь);
	ПараметрыРасчетаЦен.Вставить("ЗаполнитьПоНорме"  , Ложь);
	ПараметрыРасчетаЦен.Вставить("ТипЦен"); 
	ПараметрыРасчетаЦен.Вставить("АналитикаНоменклатуры");
	ПараметрыРасчетаЦен.Вставить("СтруктураКурсаДокумента");
	ПараметрыРасчетаЦен.Вставить("ДатаДокумента");
	ПараметрыРасчетаЦен.Вставить("ТолькоНулевыеСуммы", Ложь);
	ПараметрыРасчетаЦен.Вставить("ПараметрНорм"); 
	ПараметрыРасчетаЦен.Вставить("ИменаПараметраНорм");
	
	Если Объект.ЗаполнятьПоЦенамНоменклатуры И ЗначениеЗаполнено(Объект.ТипЦен) Тогда
		ПараметрыРасчетаЦен.ТипЦен  = Объект.ТипЦен;
		
		ТипНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		Для каждого НастройкаИзмерения Из КэшЗначений.НастройкиИзмерений Цикл
			Если ТипЗнч(НастройкаИзмерения.Значение) <> Тип("Структура") Тогда
				Продолжить;
			КонецЕсли;
			
			Если НастройкаИзмерения.Значение.ТипЗначения = ТипНоменклатура Тогда
				ПараметрыРасчетаЦен.АналитикаНоменклатуры = НастройкаИзмерения.Ключ;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ПараметрыРасчетаЦен.АналитикаНоменклатуры) Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось определить аналитики для расчета цен.';
								  |en = 'Cant find match dimensions for price count.'");
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			#Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			#КонецЕсли 
		Иначе
			ПараметрыРасчетаЦен.ЗаполнитьПоТипуЦен = Истина;
		КонецЕсли;
	ИначеЕсли НЕ Объект.ЗаполнятьПоЦенамНоменклатуры И ЗначениеЗаполнено(Объект.ПараметрНорм) И ИспользоватьНормы Тогда
		ПараметрыРасчетаЦен.ПараметрНорм       = Объект.ПараметрНорм;
		ПараметрыРасчетаЦен.ЗаполнитьПоНорме   = Истина;
		ПараметрыРасчетаЦен.ИменаПараметраНорм = ИменаПараметраНорм(Объект.ПараметрНорм);
	КонецЕсли;
		
	СтруктураКурсаДокумента     = Новый Структура("Валюта, Курс, Кратность",
									Объект.ВалютаДокумента, Объект.КурсДокумента, Объект.КратностьДокумента);
	ПараметрыРасчетаЦен.СтруктураКурсаДокумента = СтруктураКурсаДокумента;
	ПараметрыРасчетаЦен.ДатаДокумента           = Объект.Дата;
	
	Возврат ПараметрыРасчетаЦен;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИменаПараметраНорм(ПараметрНорм)
	
	Результат = ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ПодготовитьСтруктурыСвязи(ПараметрНорм);
	Возврат Результат;	
	
КонецФункции

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(ИсточникЗаполнения = Неопределено, СтандартнаяОбработка = Ложь)
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	
	Если НЕ ЗначениеЗаполнено(ИсточникЗаполнения) Тогда
		ИсточникЗаполнения = Объект.Ссылка;
	КонецЕсли;
	ЗагрузитьДанныеТЧ(ИсточникЗаполнения);
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);
	
	бит_ВизированиеСервер.ЗаполнитьРеквизитыСтатусаВФорме(ЭтотОбъект, Объект);
	УстановитьСостояниеДокумента();	
	
	АвтовидимостьКолонок = Истина;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеТЧ(Ссылка)
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДанныеТЧВРегистре") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументВладелец", Ссылка);
	
	Объект.БДДС.Очистить();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БДДС.ИД КАК ИД,
	|	БДДС.ПериодСтрокиДокумента КАК Период,
	|	БДДС.ЦФО КАК ЦФО,
	|	БДДС.СтатьяОборотов КАК СтатьяОборотов,
	// ++ ЕРП
	|	БДДС.Аналитика_8 КАК Аналитика_8,
	|	БДДС.Аналитика_9 КАК Аналитика_9,
	|	БДДС.Аналитика_10 КАК Аналитика_10,
	|	БДДС.Аналитика_11 КАК Аналитика_11,
	|	БДДС.Аналитика_12 КАК Аналитика_12,
	// -- ЕРП
	|	БДДС.Аналитика_1 КАК Аналитика_1,
	|	БДДС.Аналитика_2 КАК Аналитика_2,
	|	БДДС.Аналитика_3 КАК Аналитика_3,
	|	БДДС.Аналитика_4 КАК Аналитика_4,
	|	БДДС.Аналитика_5 КАК Аналитика_5,
	|	БДДС.Аналитика_6 КАК Аналитика_6,
	|	БДДС.Аналитика_7 КАК Аналитика_7,
	|	БДДС.Количество КАК Количество,
	|	БДДС.Норма КАК Норма,
	|	БДДС.Сумма КАК Сумма,
	|	БДДС.Измерение КАК Измерение,
	|	БДДС.Расчетная КАК Расчетная,
	|	БДДС.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.бит_ФормаВводаБюджетаБДДС КАК БДДС
	|ГДЕ
	|	БДДС.ДокументВладелец = &ДокументВладелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	БДДС.НомерСтрокиДокумента";
	ВыборкаСтрок = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСтрок.Следующий() Цикл
		НоваяСтрока = Объект.БДДС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрок);
	КонецЦикла;
	
	Объект.ЗависимыеОбороты.Очистить();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗависимыеОбороты.ИД КАК ИД,
	|	ЗависимыеОбороты.ИД_Родитель КАК ИД_Родитель,
	|	ЗависимыеОбороты.ПериодСтрокиДокумента КАК Период,
	|	ЗависимыеОбороты.ЦФО КАК ЦФО,
	|	ЗависимыеОбороты.СтатьяОборотов КАК СтатьяОборотов,
	// ++ ЕРП
	|	ЗависимыеОбороты.Аналитика_8 КАК Аналитика_8,
	|	ЗависимыеОбороты.Аналитика_9 КАК Аналитика_9,
	|	ЗависимыеОбороты.Аналитика_10 КАК Аналитика_10,
	|	ЗависимыеОбороты.Аналитика_11 КАК Аналитика_11,
	|	ЗависимыеОбороты.Аналитика_12 КАК Аналитика_12,
	// -- ЕРП
	|	ЗависимыеОбороты.Аналитика_1 КАК Аналитика_1,
	|	ЗависимыеОбороты.Аналитика_2 КАК Аналитика_2,
	|	ЗависимыеОбороты.Аналитика_3 КАК Аналитика_3,
	|	ЗависимыеОбороты.Аналитика_4 КАК Аналитика_4,
	|	ЗависимыеОбороты.Аналитика_5 КАК Аналитика_5,
	|	ЗависимыеОбороты.Аналитика_6 КАК Аналитика_6,
	|	ЗависимыеОбороты.Аналитика_7 КАК Аналитика_7,
	|	ЗависимыеОбороты.Количество КАК Количество,
	|	ЗависимыеОбороты.Норма КАК Норма,
	|	ЗависимыеОбороты.Сумма КАК Сумма,
	|	ЗависимыеОбороты.Измерение КАК Измерение,
	|	ЗависимыеОбороты.Комментарий КАК Комментарий,
	|	ЗависимыеОбороты.КомментарийРасчета КАК КомментарийРасчета,
	|	ЗависимыеОбороты.Расчетная КАК Расчетная
	|ИЗ
	|	РегистрСведений.бит_ФормаВводаБюджетаЗависимыеОбороты КАК ЗависимыеОбороты
	|ГДЕ
	|	ЗависимыеОбороты.ДокументВладелец = &ДокументВладелец";
	ВыборкаСтрок = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСтрок.Следующий() Цикл
		НоваяСтрока = Объект.ЗависимыеОбороты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрок);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ПостроенИндексПоиска = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеУчитыватьСверхБюджета(ЦФО, Период)

	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("ЦФО", ЦФО);
								
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(
								ПараметрыНастройки, Период);
								
	Возврат НеУчитыватьСверхБюджета;							

КонецФункции

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);

КонецПроцедуры

&НаСервере
Процедура ЦФОПриИзмененииНаСервере()
	
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиПроектВШапкуФормы()
	
	ПолеПроект = Элементы.ГруппаДопАналитики.ПодчиненныеЭлементы.Найти("Проект");
	Если ПолеПроект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(ПолеПроект, Элементы.ГруппаЗначенияПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВБуфер()

	Если ТабДокДанные.ВыделенныеОбласти.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru = 'Выполнить не могу, когда выделено несколько областей.'; 
							|en = 'I can''t do it when several areas are highlighted.'");
		Возврат;
	КонецЕсли;
	
	мБуфер = Неопределено;
	ТекущаяОбласть = ТабДокДанные.ТекущаяОбласть;
	
	Если НЕ бит_БюджетированиеКлиентСервер.ЭтоПрямоугольнаяОбласть(ТекущаяОбласть) Тогда
		ПредупредитьОВыделенииМногоугольнойОбласти();
		Возврат;	
	КонецЕсли;
	
	мБуфер = Новый Массив;		
	ДанныеОбластей = Новый Соответствие;

	// Необходимо определить координаты всех ячеек выделенной области
	// и обойти по отдельности эти ячейки.		
	ВерхнийИндексКолонки = ТекущаяОбласть.Право - ТекущаяОбласть.Лево;
	ВерхнийИндексСтроки  = ТекущаяОбласть.Низ   - ТекущаяОбласть.Верх;
	
	Для ИндексСтроки = 0 По ВерхнийИндексСтроки Цикл
		НомерСтроки = ТекущаяОбласть.Верх + ИндексСтроки;

		ДанныеОбластей = Новый Соответствие;
		ОбластиСтроки  = Новый Массив;
		
		Для ИндексКолонки = 0 По ВерхнийИндексКолонки Цикл	
			
			НомерКолонки = ТекущаяОбласть.Лево + ИндексКолонки;	
			Область 	 = ТабДокДанные.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
			
			// Если выделенная ячейка является ячейкой вида Значение - сохраним параметры, необходимые для копирования в буфер.
			Расшифровка = Область.Расшифровка;
			ЭтоРасшифровкаЯчейкиФормыВвода = бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Расшифровка, "РасшифровкаЯчейкиФормыВвода");
			Если НЕ ЭтоРасшифровкаЯчейкиФормыВвода И Расшифровка.Вид = "Значение" Тогда
				Продолжить;		
			КонецЕсли;
				 
			// Принятый формат имени области "значение": Ресурс_Период_КонтрольнаяСумма.
			// ++ NB Сделать функцию 
			ИмяНабора  = Область.Имя;
			ЧастиИмени = СтрРазделить(ИмяНабора, "_");
			Если ЧастиИмени.Количество() = 3 Тогда
				ЧастиИмени.Удалить(0);
				ИмяНабора = СтрСоединить(ЧастиИмени, "_");
			КонецЕсли;
			
			ДанныеОбласти = ДанныеОбластей.Получить(ИмяНабора);
			Если ДанныеОбласти = Неопределено Тогда
				Фильтры = бит_БюджетированиеКлиентСервер.СформироватьОтборСтрок(Расшифровка);
				// ++ NB Вызов сервера
				ДанныеТаблицы = Объект.БДДС.НайтиСтроки(Фильтры);
				
				ДанныеОбласти = Новый Структура;
				ДанныеОбласти.Вставить("ДанныеТаблицы", ДанныеТаблицы);
				ДанныеОбласти.Вставить("ИменаРесурсов", Новый Массив);
				
				ДанныеОбластей.Вставить(ИмяНабора, ДанныеОбласти);
			КонецЕсли; 
			
			ДанныеОбласти.ИменаРесурсов.Добавить(Расшифровка.ИмяРесурса);
		КонецЦикла;
		
		Для каждого КлючЗначение Из ДанныеОбластей Цикл
			ДанныеОбласти = КлючЗначение.Значение;	
			ОбластиСтроки.Добавить(ДанныеОбласти);
		КонецЦикла;
		мБуфер.Добавить(ОбластиСтроки);
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзБуфера(Буфер, ПараметрыВставки, СтрокиДляЗависимых)
	
	КоличествоСкопированных = Буфер.Количество();
	Если КоличествоСкопированных = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Верх  = ПараметрыВставки.Верх;
	Лево  = ПараметрыВставки.Лево;
	ПраваяГараница = ПараметрыВставки.Право;
		
	СуммовойУчет	   = фКэшЗначений.НастройкиФормы.УчетСумма;
	КоличественныйУчет = фКэшЗначений.НастройкиФормы.УчетКоличество;

	ИсключаемыеСтвойства = Новый Массив;
	ИсключаемыеСтвойства.Добавить("Норма");
	
	Если СуммовойУчет Тогда
		ИсключаемыеСтвойства.Добавить("Сумма"); 
	КонецЕсли;
	Если КоличественныйУчет Тогда
		ИсключаемыеСтвойства.Добавить("Количество");
	КонецЕсли;
	ИсключаемыеСтвойства = СтрСоединить(ИсключаемыеСтвойства,",");
	
	ДобавленыеСтроки = Новый Соответствие;
	НомерСтроки = Верх;
	
	Для каждого ОбластиСтроки Из Буфер Цикл
		Для каждого ДанныеОбласти Из ОбластиСтроки Цикл

			ИменаРесурсов = ДанныеОбласти.ИменаРесурсов;
			ДанныеТаблицы = ДанныеОбласти.ДанныеТаблицы;
			
			НомерКолонки = Лево;
			Пока НомерКолонки <= ПраваяГараница Цикл
				
				ОбработаныеРесурсы  = 0;
				ТекущаяОбласть	    = Неопределено;
				НомерТекущийКолонки = НомерКолонки; 
				
				Для каждого ИмяРесурса Из ИменаРесурсов Цикл		
					
					ТекущаяОбласть = ТабДокДанные.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
					
					Расшифровка = ТекущаяОбласть.Расшифровка;
					ЭтоРасшифровкаЯчейкиФормыВвода = бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Расшифровка, "РасшифровкаЯчейкиФормыВвода");
					Если НЕ (ЭтоРасшифровкаЯчейкиФормыВвода И Расшифровка.Вид = "Значение") Тогда
						ТекущаяОбласть = Неопределено;
						Продолжить;			
					КонецЕсли;
					
					Если Расшифровка.ИмяРесурса <> ИмяРесурса Тогда
						ТекущаяОбласть = Неопределено;
						Продолжить;					
					КонецЕсли;
					
					НомерКолонки = НомерКолонки + 1;
					Если ЗначениеЗаполнено(ТекущаяОбласть.Значение) Тогда
						Продолжить;				
					КонецЕсли;
					
					Фильтры = бит_БюджетированиеКлиентСервер.СформироватьОтборСтрок(Расшифровка);
					
					ИмяНабора  = ТекущаяОбласть.Имя;
					ЧастиИмени = СтрРазделить(ИмяНабора, "_");
					Если ЧастиИмени.Количество() = 3 Тогда
						ЧастиИмени.Удалить(0);
						ИмяНабора = СтрСоединить(ЧастиИмени, "_");
					КонецЕсли;
					
					НовыеСтроки = ДобавленыеСтроки.Получить(ИмяНабора);
					Если НовыеСтроки = Неопределено Тогда
						НовыеСтроки = Новый Массив;
						ДобавленыеСтроки.Вставить(ИмяНабора, НовыеСтроки);
					КонецЕсли;
					
					Если НовыеСтроки.Количество() = 0 Тогда
						Для каждого СтрокаТаблицы Из ДанныеТаблицы Цикл
							НоваяСтрока = Объект.БДДС.Добавить();	
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы,, ИсключаемыеСтвойства);
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Фильтры);
							НоваяСтрока[ИмяРесурса] = СтрокаТаблицы[ИмяРесурса];
							УстановитьИД_БДДС_Клиент(НоваяСтрока);
							НовыеСтроки.Добавить(НоваяСтрока);
						КонецЦикла;
					Иначе	
						Индекс = 0;
						Для каждого СтрокаТаблицы Из ДанныеТаблицы Цикл
							НоваяСтрока = НовыеСтроки.Получить(Индекс);
							НоваяСтрока[ИмяРесурса] = СтрокаТаблицы[ИмяРесурса];
							Индекс = Индекс + 1;
						КонецЦикла;
					КонецЕсли;
					ОбработаныеРесурсы = ОбработаныеРесурсы + 1;
					ОбновитьЗначениеЯчейкиДерева(ТекущаяОбласть, ТекущаяОбласть.Расшифровка, СтрокиДляЗависимых);
				КонецЦикла;
				
				Если НомерКолонки = НомерТекущийКолонки Тогда
					// Ни один ресурс не подошел. Сдвигаемся на одну колонку.
					НомерКолонки = НомерКолонки + 1;
				КонецЕсли;
				
				Если ТекущаяОбласть <> Неопределено И ОбработаныеРесурсы <> ИменаРесурсов.Количество() Тогда
					ОбновитьПарнуюЯчейки(ТекущаяОбласть, СтрокиДляЗависимых);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		НомерСтроки = НомерСтроки + 1;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредупредитьОВыделенииМногоугольнойОбласти()

	ТекстСообщения = НСтр("ru = 'Выполнить не могу. 
							|Выделите прямоугольную область.'; 		
							|en = 'I can''t do it. 
							|Select a rectangular area.'");
	ПоказатьПредупреждение(, ТекстСообщения);

КонецПроцедуры

#КонецОбласти