#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.КОтправке = (
			Запись.СостояниеСведений = Перечисления.СостоянияДокументаСЭДОФСС.ПодготовленКОтправке
			Или Запись.СостояниеСведений = Перечисления.СостоянияДокументаСЭДОФСС.ОшибкаПриОтправке);
		Запись.НаОформлении = (
			Запись.СостояниеСведений = Перечисления.СостоянияДокументаСЭДОФСС.ВПроцессеПодготовки
			Или Запись.СостояниеСведений = Перечисления.СостоянияДокументаСЭДОФСС.ПринятСЗамечаниями
			Или Запись.СостояниеСведений = Перечисления.СостоянияДокументаСЭДОФСС.НеПринят
			Или Запись.СостояниеСведений = Перечисления.СостоянияДокументаСЭДОФСС.ТребуетсяАктуализировать
			Или Запись.СостояниеСведений = Перечисления.СостоянияДокументаСЭДОФСС.ТребуетсяСоздать);
		Запись.ВРаботе = (ЗначениеЗаполнено(Запись.СостояниеСведений)
			И Запись.СостояниеСведений <> Перечисления.СостоянияДокументаСЭДОФСС.НеПланируетсяОтправлять
			И Запись.СостояниеСведений <> Перечисления.СостоянияДокументаСЭДОФСС.Принят);
		Если Запись.ДатаОтправки >= Запись.МаксимальнаяДатаОтправки Тогда;
			Запись.МаксимальнаяДатаОтправки = '00010101';
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли

