#Область ПрограммныйИнтерфейс

Функция ОбработкаСобытияПолученияМетаданных(Метаданные) Экспорт
	
	Возврат ИТК_РедакторКода.ОбработкаСобытияПолученияМетаданных(Метаданные);
	
КонецФункции

Функция ДанныеПакетаУлучшенногоРедактораКода(ЭтоWindowsКлиент) Экспорт
	
	Если ЭтоWindowsКлиент Тогда
		ИмяМакета = "ИТК_РедакторКодаMonacoWindows";
	Иначе
		ИмяМакета = "ИТК_РедакторКодаMonaco";
	КонецЕсли;
	
	Возврат ПолучитьОбщийМакет(ИмяМакета);
	
КонецФункции

Функция ПользовательскиеОбъектыОбработкаРезультатов(Данные, АдресОбрабатываемыхДанных, Имя) Экспорт
	
	Возврат ИТК_РедакторКода.ПользовательскиеОбъектыОбработкаРезультатов(Данные, АдресОбрабатываемыхДанных, Имя);
	
КонецФункции

Функция ПользовательскиеОбъектыВыраженияСКД(Контекст) Экспорт
	
	Возврат ИТК_РедакторКода.ПользовательскиеОбъектыВыраженияСКД(Контекст);
	
КонецФункции

Функция ПользовательскиеОбъектыРезультат() Экспорт
	
	Возврат ИТК_РедакторКода.ПользовательскиеОбъектыРезультат();
	
КонецФункции

Функция ИмяОбъектаМетаданныхВ1С(ИмяКоллекции, ИмяОбъекта) Экспорт
	
	ОбъектМетаданных = Метаданные[ИмяКоллекции].Найти(ИмяОбъекта);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбъектМетаданных.Имя;
	
КонецФункции

Функция ЗагрузитьНастройкиРедактора() Экспорт
	
	ОбщиеНастройки = ИТК_Настройки.Загрузить();
	
	Результат = Новый Структура;
	Результат.Вставить("ОтображатьКарту", ОбщиеНастройки.РедакторОтображатьКарту);
	Результат.Вставить("ОтображатьНомераСтрок", ОбщиеНастройки.РедакторОтображатьНомераСтрок);
	Результат.Вставить("ОтображатьПробелыИТабуляции", ОбщиеНастройки.РедакторОтображатьПробелыИТабуляции);
	Результат.Вставить("ОтображатьСостояние", ОбщиеНастройки.РедакторОтображатьСостояние);
	Результат.Вставить("Шрифт", ОбщиеНастройки.РедакторШрифт);
	Результат.Вставить("ПутьКФайлуШаблоновКода", ОбщиеНастройки.РедакторКодаПутьКФайлуШаблонов);
	Результат.Вставить("ЯзыкПрограммирования", ИТК_Общий.КодЯзыкаПрограммирования());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти