#Область ОписаниеПеременных

&НаКлиенте
Перем ДоступныеОперацииИдентификаторПоследней Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Метаданные.Обработки.ИТК_ГлобальноеМеню.Представление();
					
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.ДоступныеОперации, ПоложениеСтрокиПоиска.Верх);
	
	// Подготовка доступных операций
	НавигационнаяСсылка = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "НавигационнаяСсылка");
	ПоляОбъекта = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "ПоляОбъекта", Новый Массив);
	ДобавитьВДоступныеОперацииПоКонтексту(ДоступныеОперации, НавигационнаяСсылка, ПоляОбъекта);
	ПрисутствуютДоступныеОперацииКонтекста = ЗначениеЗаполнено(ДоступныеОперации.ПолучитьЭлементы());
	
	ОбновитьЭлементыФормыПриСозданииНаСервере();
	ДобавитьВДоступныеОперацииИнструменты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИТК_ОбщийКлиент.ОбработчикПриОткрытии(Отказ);
	
	ИТК_ФормаКлиент.СортироватьСтрокиДерева(ДоступныеОперации.ПолучитьЭлементы(), "Порядок");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеОперации

&НаКлиенте
Процедура ДоступныеОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбраноЗначение(Элемент.ТекущиеДанные, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбраноЗначение(Элементы.ДоступныеОперации.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыФормыПриСозданииНаСервере()
	
	Элементы.ДоступныеОперацииГруппаОбъект.Видимость = ПрисутствуютДоступныеОперацииКонтекста;

КонецПроцедуры

&НаСервере
Процедура ДобавитьВДоступныеОперацииИнструменты()
	
	Если ПрисутствуютДоступныеОперацииКонтекста Тогда
		
		Инструмент = ИТК_Перечисления.Инструменты();
		ПорядокВСамомКонце = 10000;
		СтрокаРодитель = ДобавитьСтрокуВДоступныеОперации(ДоступныеОперации, Инструмент, , , ПорядокВСамомКонце);
															
	Иначе
		СтрокаРодитель = ДоступныеОперации;
	КонецЕсли;
	
	ИнструментыИЗначения = Новый СписокЗначений;
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментКонсольЗапросов());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментРедакторОбъекта());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментКонсольСхемКомпоновкиДанных());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментКонсольКода());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментАнализПравДоступа());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментМетаданные());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментПоискПоСтруктуреХранения());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментРедакторКонстант());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментРедакторПараметровСеанса());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментПоискСсылокНаОбъект());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментПоискИЗаменаСсылок());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментПодпискиНаСобытия());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментСравнениеОбъектов());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментПользователи());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментРегламентныеИФоновыеЗадания());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментМониторЛицензий());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментЖурналРегистрации());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментДинамическийСписок());
	
	ДобавитьДоступныеИнструментыПоЗначениям(СтрокаРодитель, ИнструментыИЗначения, "Представление");
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуВДоступныеОперации(Родитель, Инструмент, ИдентификаторПредставления = "Представление", Объект = Неопределено, Порядок = Неопределено)
	
	Если НЕ ИТК_ТуллкитКлиентСервер.ДоступенИнструмент(Инструмент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбъектОбработки = ИТК_Туллкит.ОбъектОбработкиИнструмента(Инструмент, Объект);
	Если ЗначениеЗаполнено(Объект) 
			И НЕ ЗначениеЗаполнено(ОбъектОбработки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаДублируется = Ложь;
	Для Каждого Строка Из Родитель.ПолучитьЭлементы() Цикл 
		
		Если Строка.Идентификатор = Инструмент
				И Строка.Объект = ОбъектОбработки Тогда
				
			СтрокаДублируется = Истина;
			Прервать;
			
		КонецЕсли;
				
	КонецЦикла;
	
	Если СтрокаДублируется Тогда
		Возврат Строка;
	КонецЕсли;
	
	ОписаниеИнструмента = ИТК_ТуллкитКлиентСервер.ОписаниеИнструмента(Инструмент);

	НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
	НоваяСтрока.Идентификатор = Инструмент;
	НоваяСтрока.Картинка = ОписаниеИнструмента["Картинка"];
	
	Если Порядок = Неопределено Тогда
		Порядок = 100;
	КонецЕсли;
	НоваяСтрока.Порядок = Порядок;
	
	НоваяСтрока.Объект = ОбъектОбработки;
	
	ПоказыватьПояснение = ЗначениеЗаполнено(ОбъектОбработки)
							И ТипЗнч(ОбъектОбработки) <> Тип("СписокЗначений")
							И ТипЗнч(ОбъектОбработки) <> Тип("Строка");
	Если ПоказыватьПояснение Тогда
								
		ТипЗначенияОбъекта = ТипЗнч(ОбъектОбработки);
		НоваяСтрока.ОбъектПояснение = ИТК_Типы.ПредставлениеТипа(ТипЗначенияОбъекта);
	
	КонецЕсли;
	
	Представление = ОписаниеИнструмента[ИдентификаторПредставления];
	ПолноеПредставление  = Представление;
	Если ТипЗнч(ОбъектОбработки) = Тип("СписокЗначений") Тогда
		ПолноеПредставление = ИТК_ФормаКлиентСервер.ЗаголовокСКоличеством(Представление, ОбъектОбработки.Количество());
	КонецЕсли;
	НоваяСтрока.Представление = ПолноеПредставление;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура ВыбраноЗначение(Строка, СтандартнаяОбработка = Неопределено)
	
	Если Строка = Неопределено
			ИЛИ ЗначениеЗаполнено(Строка.ПолучитьЭлементы()) Тогда 
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	Закрыть();
	
	ОткрытьФормуПоСтроке(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПоСтроке(Строка)
	
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Строка.Идентификатор, Строка.Объект);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВДоступныеОперацииПоКонтексту(Родитель, НавигационнаяСсылка, ПоляОбъекта)
	
	// Объект по навигационной ссылке
	Ссылка = ИТК_Общий.СсылкаПоНавигационнойСсылке(НавигационнаяСсылка);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОбъектПоНавигационнойСсылке = Ссылка;
	Иначе
		ОбъектПоНавигационнойСсылке = ИТК_Метаданные.ОбъектПоНавигационнойСсылке(НавигационнаяСсылка);
	КонецЕсли;
	ДобавитьВДоступныеОперацииПоЗначению(Родитель, ОбъектПоНавигационнойСсылке);
	
	// Другие объекты
	Для ИндексОбъекта = 0 По ПоляОбъекта.ВГраница() Цикл 
		
		ПолеОбъекта = ПоляОбъекта[ИндексОбъекта];
		
		Порядок = (ИндексОбъекта + 1) * 100;
		ДобавитьВДоступныеОперацииПоЗначению(Родитель, ПолеОбъекта, Истина, Порядок);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВставитьОбъектВПоляОбъекта(ПоляОбъекта, Объект)
	
	Если Объект = Неопределено
			ИЛИ ПоляОбъекта.Найти(Объект) <> Неопределено Тогда 
			
		Возврат;
		
	КонецЕсли;
	
	ПоляОбъекта.Вставить(0, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВДоступныеОперацииПоЗначению(Родитель, Значение, ДоступноОткрытьЗначение = Ложь, Порядок = 0)
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Массив") Тогда
		
		ЗначениеСписок = ИТК_ОбщийКлиентСервер.МассивВСписокЗначений(Значение);
		
		ИнструментыИЗначения = Новый СписокЗначений;
		ИнструментыИЗначения.Добавить(ЗначениеСписок, ИТК_Перечисления.ИнструментПоискИЗаменаСсылок());
		ИнструментыИЗначения.Добавить(ЗначениеСписок, ИТК_Перечисления.ИнструментСравнениеОбъектов());
		ИнструментыИЗначения.Добавить(ЗначениеСписок, ИТК_Перечисления.ИнструментОбработкаВКонсолиКода());
		
		ДобавитьДоступныеИнструментыПоЗначениям(Родитель, ИнструментыИЗначения, "ПредставленияДействияСписок", Порядок);
		
	Иначе
		
		ИнструментыИЗначения = Новый СписокЗначений;
		
		Если ТипЗначения = Тип("ОбъектМетаданных") Тогда
			
			ПолноеИмяОбъектаМетаданных = Значение.ПолноеИмя();
			
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментАнализПравДоступа(), ПолноеИмяОбъектаМетаданных);
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментПодпискиНаСобытия(), ПолноеИмяОбъектаМетаданных);
			
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментМетаданные(), ПолноеИмяОбъектаМетаданных);
			
			ИмяКоллекции = ИТК_Метаданные.ИмяКоллекции(ПолноеИмяОбъектаМетаданных);
			Если НЕ (ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоОтчет(ИмяКоллекции)
						ИЛИ ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоОбработка(ИмяКоллекции)) Тогда
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментСтруктураХранения(), ПолноеИмяОбъектаМетаданных);
			КонецЕсли;
			
		Иначе
			
			ПолноеИмяОбъектаМетаданных = Значение.Метаданные().ПолноеИмя();
			
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментРедакторОбъекта(), ПолноеИмяОбъектаМетаданных, Значение);
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментАнализПравДоступа(), ПолноеИмяОбъектаМетаданных);

			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментПоискСсылокНаОбъект(), ПолноеИмяОбъектаМетаданных, Значение);
			
			Если ДоступноОткрытьЗначение Тогда
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментОткрытьОбъект(), ПолноеИмяОбъектаМетаданных, Значение);
			КонецЕсли;	
			
			Если ИТК_БСПКлиентСервер.ЭтоСсылкаНаСправочникПользователи(Значение) Тогда
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментРедактированиеПользователяИБ(), ПолноеИмяОбъектаМетаданных, Значение);
			КонецЕсли;
			
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментЖурналРегистрации(), ПолноеИмяОбъектаМетаданных, Значение);
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментОбработкаВКонсолиКода(), ПолноеИмяОбъектаМетаданных, Значение);
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментПоискИЗаменаСсылок(), ПолноеИмяОбъектаМетаданных, Значение);
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментПодпискиНаСобытия(), ПолноеИмяОбъектаМетаданных);
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментМетаданные(), ПолноеИмяОбъектаМетаданных);
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментСтруктураХранения(), ПолноеИмяОбъектаМетаданных);
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментСравнениеОбъектов(), ПолноеИмяОбъектаМетаданных, Значение);
			
		КонецЕсли;
		
		ДобавитьДоступныеИнструментыПоЗначениям(Родитель, ИнструментыИЗначения, "ПредставленияДействия", Порядок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДоступныеИнструментыПоЗначениям(Родитель, ИнструментыИЗначения, ИдентификаторПредставления, Порядок = Неопределено)
	
	Если Порядок = Неопределено Тогда
		Порядок = 1;
	КонецЕсли;
	
	Для Каждого ИнструментИЗначение Из ИнструментыИЗначения Цикл 
		
		Инструмент = ИнструментИЗначение.Представление;
		Значение = ИнструментИЗначение.Значение;
		
		ДобавитьСтрокуВДоступныеОперации(Родитель, Инструмент, ИдентификаторПредставления, Значение, Порядок);
		
		Порядок = Порядок + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, Инструмент, ПолноеИмяОбъектаМетаданных, Значение = Неопределено);
	
	Если Значение = Неопределено Тогда
		
		Параметр = ПолноеИмяОбъектаМетаданных;
		ИмяКоллекции = ИТК_Метаданные.ИмяКоллекции(ПолноеИмяОбъектаМетаданных);
		
	Иначе
		
		Параметр = Значение;
		ИмяКоллекции = ИТК_Метаданные.ИмяКоллекции(ТипЗнч(Значение));
		
	КонецЕсли;

	ОписаниеИнструмента = ИТК_ТуллкитКлиентСервер.ОписаниеИнструмента(Инструмент);
	Если НЕ ОписаниеИнструмента["ДоступенДляПеречислений"] Тогда
		
		Если ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоПеречисление(ИмяКоллекции) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	ИнструментыИЗначения.Добавить(Параметр, Инструмент);
	
КонецПроцедуры

#КонецОбласти
