#Область ПрограммныйИнтерфейс

Процедура Данные(Параметры, АдресРезультата) Экспорт

	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Изменять", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	
	Результат.Колонки.Добавить("Имя", ИТК_ТипыКлиентСервер.ОписаниеИмяМетаданных());
	
	Результат.Колонки.Добавить("Синоним", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Результат.Колонки.Добавить("Комментарий", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Результат.Колонки.Добавить("Пояснение", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Результат.Колонки.Добавить("Подсказка", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	
	Результат.Колонки.Добавить("Доступность", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	
	Результат.Колонки.Добавить("Значение");
	Результат.Колонки.Добавить("ЗначениеКартинка", ИТК_ТипыКлиентСервер.ОписаниеКартинка());
	
	Результат.Колонки.Добавить("Тип", ИТК_ТипыКлиентСервер.ОписаниеИзСтроки("ОписаниеТипов"));
	Результат.Колонки.Добавить("ТипКартинка", ИТК_ТипыКлиентСервер.ОписаниеКартинка());
	Результат.Колонки.Добавить("ТипПредставление", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	
	СписокКонстант = ИТК_Метаданные.СписокИменИзКоллекции(Метаданные.Константы);
	НаборКонстант = Константы.СоздатьНабор(СписокКонстант);
	НаборКонстант.Прочитать();
	
	Для Каждого Константа Из Метаданные.Константы Цикл 
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Константа);
		
		Значение = НаборКонстант[Константа.Имя];
		
		НоваяСтрока.Значение = Значение;
		НоваяСтрока.ЗначениеКартинка = ИТК_Типы.КартинкаЗначения(Значение, Константа.Тип);
		
		НоваяСтрока.Доступность = ИТК_Типы.РедактируетсяВТаблицеЗначений(Константа.Тип);
		НоваяСтрока.ТипКартинка = ИТК_Типы.КартинкаОписания(Константа.Тип);
		НоваяСтрока.ТипПредставление = ИТК_Типы.ПредставлениеОписания(Константа.Тип);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти