
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_УправлениеДоступомБФ.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ++ ЕРП 
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	// -- ЕРП
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
			
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	ОформитьТаблицу();
	УстановитьПривилегированныйРежим(Истина);
	ОформитьТаблицу(,"ЗависимыеОбороты");
	УстановитьПривилегированныйРежим(Ложь);
	
	// Проверка наличия зафиксированных бюджетных данных.
	Если Объект.Проведен Тогда
		бит_Бюджетирование.ПроверитьФиксациюВФорме(ЭтотОбъект, Объект.Ссылка, Истина);
	КонецЕсли;
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Зададим имена реквизитов, подлежащих кэшированию.
	КонтролируемыеРеквизиты = Новый Структура;
	КонтролируемыеРеквизиты.Вставить("Дата");
	КонтролируемыеРеквизиты.Вставить("Сценарий");
	КонтролируемыеРеквизиты.Вставить("РежимЗависимыхОборотов");
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатус" И Источник = УникальныйИдентификатор Тогда
		ОбработкаОповещенияИзмененияСтатуса();
	ИначеЕсли СтрСравнить(ИмяСобытия, "ПодборДанныхБюджета") = 0 И Источник = ЭтотОбъект Тогда
		ОбработатьПодборДанныхБюджета(Параметр);
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	НаименованиеТаблицы = НСтр("ru = 'БДДС'; en = 'BDDS'");
	бит_УправлениеДоступомБФ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект.БДДС, НаименованиеТаблицы);
	
	ПодготовитьФормуНаСервере();
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере();
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Установить видимость/доступность элементов формы.
	УправлениеФормой();
                      	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Автовидимость колонок.
	Элементы.ФормаАвтовидимостьКолонок.Пометка = фАвтовидимостьКолонок;	
	УстановитьАвтовидимостьКолонок(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_КорректировкаБюджета";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
		
	ДатаПриИзмененииНаСервере();
	ДобавитьВКэш("Дата");
	
КонецПроцедуры
 
&НаКлиенте
Процедура СценарийПриИзменении(Элемент)

	ОповещениеВопрос = Новый ОписаниеОповещения("ВопросСценарийПриИзменении", ЭтотОбъект);
	Если Объект.БДДС.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Данные будут очищены. Продолжить?';en='Data will be cleared. Continue?'");
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеВопрос, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

// Обработка оповещения вопроса пользователю. 
// 
// Параметры:
//  Ответ - Строка.
// 
&НаКлиенте
Процедура ВопросСценарийПриИзменении(Ответ, ДопПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ИзменениеСценарияСервер(Истина);
	Иначе
		ИзвлечьИзКэша("Сценарий");
	КонецЕсли;

	ДобавитьВКэш("Сценарий");
		
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ИзменениеВалютыСервер();
	
КонецПроцедуры
     
&НаКлиенте
Процедура РежимЗависимыхОборотовПриИзменении(Элемент)
	
	ТекущийРежимЗависимыхОборотов = КонтролируемыеРеквизиты.РежимЗависимыхОборотов;
	Если ТекущийРежимЗависимыхОборотов = Объект.РежимЗависимыхОборотов Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ЗависимыеОбороты.Количество() > 0 Тогда		
		ТекстВопроса = НСтр("ru='Зависимые обороты будут очищены. Продолжить?';
							|en='Dependent speed will be cleared. Continue?'");		
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросРежимЗависимыхОборотовПриИзменении", ЭтотОбъект, ТекущийРежимЗависимыхОборотов);
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);				
	Иначе		
		ДобавитьВКэш("РежимЗависимыхОборотов");
		УправлениеФормой();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗависимыхОборотовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_РежимыЗависимыхОборотов.Автоматический"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.бит_РежимыЗависимыхОборотов.НеФормировать"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОсновнаяПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		УправлениеФормой();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	
	ЦФОПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СверхБюджетаПриИзменении(Элемент)
	
	Если НЕ Объект.СверхБюджета Тогда
		Объект.СписатьЛимиты = Ложь;	
	КонецЕсли;
	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБДДС

&НаКлиенте
Процедура БДДСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.БДДСНадписиСтароеЗначение ИЛИ Поле = Элементы.БДДСНадписиНовоеЗначение Тогда
		Возврат;
	Иначе
		бит_РаботаСДиалогамиКлиент.ОбработкаВыбораПоляТабличногоПоля("БДДС",
			Объект.БДДС, Поле, ВыбраннаяСтрока);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БДДСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;

	Если НоваяСтрока Тогда
		Если Копирование Тогда
			ПоляТаблицы = ПоляТаблицы(ЭтотОбъект);
			Для каждого ГруппаПолей Из ПоляТаблицы Цикл
				Для каждого Элемент Из ГруппаПолей.Значение Цикл
					ТекущиеДанные[Элемент + "_Старый"] = Неопределено;
				КонецЦикла; 
			КонецЦикла; 
		Иначе	
			бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(ТекущиеДанные, 
				КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
			ТекущиеДанные.Валюта = Объект.ВалютаДокумента;	
		КонецЕсли; 
			
		ТекущиеДанные.РучнаяКорректировка = Истина;	
	КонецЕсли;	
	
	Если НоваяСтрока Тогда
		ЗаполнитьНадписиВСтроке(ТекущиеДанные);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура БДДСПослеУдаления(Элемент)
	
	ПослеУдаленияСтрокиТаблицыБДДС();

КонецПроцедуры

&НаКлиенте
Процедура БДДССтатьяОборотовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;
		
	бит_МеханизмДопИзмеренийКлиент.ИнициализироватьЗначенияДопИзмерений(ТекущиеДанные, КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	
	ИзменениеСтатьиОборотовТабличнойЧасти(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура БДДСВалютаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;  
	ТекИд = ТекущиеДанные.ПолучитьИдентификатор();
	
	ИзменениеСуммыТабличнойЧасти(ТекИд, "Сумма", "");
	
КонецПроцедуры

&НаКлиенте
Процедура БДДССумма_СтарыйПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;
	ИзменениеСуммыТабличнойЧасти(ТекущиеДанные.ПолучитьИдентификатор(), "Сумма", "_Старый");
	
КонецПроцедуры

&НаКлиенте
Процедура БДДССуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;
	ИзменениеСуммыТабличнойЧасти(ТекущиеДанные.ПолучитьИдентификатор(), "Сумма", "");
	
КонецПроцедуры

&НаКлиенте
Процедура БДДССуммаСценарий_СтарыйПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;
	ИзменениеСуммыТабличнойЧасти(ТекущиеДанные.ПолучитьИдентификатор(), "СуммаСценарий", "_Старый");

КонецПроцедуры

&НаКлиенте
Процедура БДДССуммаСценарийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;
	ИзменениеСуммыТабличнойЧасти(ТекущиеДанные.ПолучитьИдентификатор(), "СуммаСценарий", "");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗависимыеОбороты

&НаКлиенте
Процедура ЗависимыеОборотыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Объект.ЗависимыеОбороты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Поле.Имя = "ЗависимыеОборотыКомментарийРасчета" И НЕ ПустаяСтрока(ТекущиеДанные.КомментарийРасчета) Тогда
		
		СтандартнаяОбработка = Ложь;		
		
		ПараметрыФормы = Новый Структура("КомментарийРасчета", ТекущиеДанные.КомментарийРасчета);
		ОткрытьФорму("ОбщаяФорма.бит_ФормаКомментарияРасчетаЗависимыхОборотов", ПараметрыФормы, ЭтотОбъект);
		
	Иначе
		
		Если НЕ ТекущиеДанные = Неопределено Тогда
			
			ИмяРеквизита = СтрЗаменить(Поле.Имя, "ЗависимыеОбороты", "");
			ТекЗнч = ТекущиеДанные[ИмяРеквизита];
			
			Если ЗначениеЗаполнено(ТекЗнч) Тогда
				
				ПоказатьЗначение(,ТекЗнч);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область ПодключаемыеКомандыЭлементовТаблицФормы

&НаКлиенте
Процедура Подключаемый_БДДСяАналитикаСтрокиПриИзменении(Элемент)
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БДДСАналитикаСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.БДДС.ТекущиеДанные;
	ИмяПоля  	  = СтрЗаменить(Элемент.Имя, "БДДС", "");
	Если бит_МеханизмДопИзмеренийКлиент.ЭтоАналитикаБанковскийСчет(ИмяПоля, КэшЗначений.НастройкиИзмерений) Тогда
	  	бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(ТекущиеДанные, СтандартнаяОбработка, ИмяПоля);	
	Иначе	
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
			СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БДДСАналитикаСтрокиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.БДДС.ТекущиеДанные;
	ИмяПоля = СтрЗаменить(Элемент.Имя, "БДДС", "");
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БДДСАналитикаСтрокиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.БДДС.ТекущиеДанные;
	ИмяПоля  	  = СтрЗаменить(Элемент.Имя, "БДДС", "");
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры
	
&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиПриИзменении(Элемент)
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ЗависимыеОбороты.ТекущиеДанные;
	ИмяПоля  	  = СтрЗаменить(Элемент.Имя, "ЗависимыеОбороты", "");
	Если бит_МеханизмДопИзмеренийКлиент.ЭтоАналитикаБанковскийСчет(ИмяПоля, КэшЗначений.НастройкиИзмерений) Тогда
	  	бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(ТекущиеДанные, СтандартнаяОбработка, ИмяПоля);	
	Иначе	
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
			СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ЗависимыеОбороты.ТекущиеДанные;
	ИмяПоля = СтрЗаменить(Элемент.Имя, "ЗависимыеОбороты", "");
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
    
КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_АналитикаСтрокиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ЗависимыеОбороты.ТекущиеДанные;
	ИмяПоля  	  = СтрЗаменить(Элемент.Имя, "ЗависимыеОбороты", "");
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент, ТекущиеДанные, ИмяПоля,
		СтандартнаяОбработка, КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры
	
#КонецОбласти 

&НаКлиенте
Процедура АвтовидимостьКолонок(Команда)
	
	фАвтовидимостьКолонок = Не фАвтовидимостьКолонок;	
	Элементы.ФормаАвтовидимостьКолонок.Пометка = фАвтовидимостьКолонок;
	
	УстановитьАвтовидимостьКолонок(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборДанныхБюджета(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Команда" , "ПодборДанныхБюджета");
	ПараметрыФормы.Вставить("Сценарий", Объект.Сценарий);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ОткрытьФорму("Обработка.бит_ПодборДанныхБюджета.Форма", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТабЧасть(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьИзменениеТабличнойЧасти", ЭтотОбъект);

	ПараметрыФормы = ПараметрыИзмененияТаблицыДокумента();
	ОткрытьФорму("Обработка.бит_ИзменениеТабличнойЧастиДокументаБюджетирования.Форма", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение);

	КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ОбработатьИзменениеТабличнойЧасти(Результат, Дополнительно) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ИмяТабличнойЧасти		  = Результат.ИмяТабличнойЧасти;
	АдресВоВременномХранилище = Результат.АдресВоВременномХранилище;
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресВоВременномХранилище) Тогда
		Возврат;
	КонецЕсли; 
	
	ОбработатьИзменениеТабличнойЧастиНаСервере(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеОборотыЗаполнить(Команда)
	
	Если Объект.ЗависимыеОбороты.Количество() > 0 Тогда		
		ТекстВопроса = НСтр("ru='Зависимые обороты будут очищены. Продолжить?';
							|en='Dependent speed will be cleared. Continue?'");		
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросЗависимыеОборотыЗаполнить", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет);				
	Иначе
		ЗаполнитьЗависимыеОборотыСервер();
	КонецЕсли; 
		
КонецПроцедуры

// Обработка оповещения вопроса пользователю. 
// 
// Параметры:
//  Ответ - Строка.
// 
&НаКлиенте
Процедура ВопросЗависимыеОборотыЗаполнить(Ответ, ДопПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьЗависимыеОборотыСервер();
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура РаспределитьПо(Команда)
	
    ТекЭлемент = Элементы.БДДС.ТекущийЭлемент;
	Если ТекЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = СтрЗаменить(ТекЭлемент.Имя, "БДДС", "");
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;
	
	Если НЕ РаспределениеПоддерживается(ТекущиеДанные, ТекЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекЭлемент = Элементы.БДДСПериод_Старый ИЛИ ТекЭлемент = Элементы.БДДСПериод Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Вид", ПредопределенноеЗначение("Перечисление.бит_ВидыПрофилейРаспределения.ПоПериодам"));
		ПараметрыФормы.Вставить("Сценарий", Объект.Сценарий);
		
		Оповещение = Новый ОписаниеОповещения("РаспределитьПоАналитикеЗавершение", ЭтотОбъект);
		РежимОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
	Иначе
		Если СтрНайти(ИмяКолонки, "_Старый") = 0 Тогда
			// Значение считываем с исторических данных.
			ИмяКолонки = ИмяКолонки + "_Старый";
		КонецЕсли; 
		ТекущееЗначение = ТекущиеДанные[ИмяКолонки];

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Вид", ПредопределенноеЗначение("Перечисление.бит_ВидыПрофилейРаспределения.ПоАналитике"));
		ПараметрыФормы.Вставить("ИмяКолонки", СтрЗаменить(ИмяКолонки, "_Старый", ""));
		ПараметрыФормы.Вставить("ТекущееЗначение", ТекущееЗначение);
		
		Оповещение = Новый ОписаниеОповещения("РаспределитьПоАналитикеЗавершение", ЭтотОбъект);
		РежимОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли; 
	
	ОткрытьФорму("Обработка.бит_РаспределениеБюджетныхДанныхПоПрофилю.Форма",ПараметрыФормы,ЭтотОбъект,,,,Оповещение,РежимОкна);

КонецПроцедуры

// Процедура обработчик оповещения "РаспределитьПоАналитикеЗавершение".
//
// Параметры:
// Результат - Структура - Настройки распределения.
// ДополнительныеДанные - Произвольный.
//
&НаКлиенте 
Процедура РаспределитьПоАналитикеЗавершение(Результат, ДополнительныеДанные) Экспорт

	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Строки = Элементы.БДДС.ВыделенныеСтроки;
		РаспределитьНаСервере(Строки, Результат);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемыСвойства

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойств

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	КэшЗначений = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшЗначений.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
	МетаданныеОбъекта = Метаданные.Документы.бит_КорректировкаБюджета;
	КэшЗначений.Вставить("ИмяТипаОбъекта", "ДокументОбъект." + МетаданныеОбъекта.Имя);
	КэшЗначений.Вставить("ПроводитьПослеУтверждения", ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения"));	
		
	// Данные по дополнительным аналитикам.
	КэшЗначений.Вставить("НастройкиИзмерений", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	КэшЗначений.Вставить("ИзмеренияДоп"      , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним"));
		
	// Параметры, используемые для управления автовидимостью колонок.
	КэшЗначений.Вставить("НастройкаВидимостиКолонок", Новый Структура);
	КэшЗначений.Вставить("МассивСтатей_БДДС"		 , Новый Массив);
	КэшЗначений.Вставить("МассивСтатей_ЗависимыеОбороты", Новый Массив);
			
	КлючевыеЭлементы = Новый Массив;
	КлючевыеЭлементы.Добавить("Дата");
	КлючевыеЭлементы.Добавить("Сценарий");
	КлючевыеЭлементы.Добавить("ЦФО");
	КлючевыеЭлементы.Добавить("СтатьяОборотов");
	Если МетаданныеОбъекта.Реквизиты.Найти("Проект") <> Неопределено Тогда
		КлючевыеЭлементы.Добавить("Проект");	
	КонецЕсли;
	КлючевыеЭлементы.Добавить("Ответственный");  
	КлючевыеЭлементы.Добавить("Комментарий");	
	КлючевыеЭлементы.Добавить("БДДС");
	КлючевыеЭлементы.Добавить("СторнироватьСверхБюджета");
	КлючевыеЭлементы.Добавить("СверхБюджета");
	
	КлючевыеЭлементы.Добавить("БДДСКоманднаяПанель");  
	КлючевыеЭлементы.Добавить("БДДСКонтекстноеМенюРаспределитьПо");
	КлючевыеЭлементы.Добавить("БДДСПодборДанныхБюджета");
	КлючевыеЭлементы.Добавить("БДДСИзменитьТабЧасть");
	КлючевыеЭлементы.Добавить("ЗависимыеОборотыЗависимыеОборотыЗаполнить");

	КэшЗначений.Вставить("МассивНеРедактируемыхЭлементовФормы", КлючевыеЭлементы);
	
	МассивИменСумм = Новый Массив;
	МассивИменСумм.Добавить("СуммаСценарий");
	МассивИменСумм.Добавить("СуммаРегл");
	МассивИменСумм.Добавить("СуммаУпр");
	КэшЗначений.Вставить("СтруктураДопПолей", Новый Структура("Учет_Сумма", МассивИменСумм));
	  
	// Произвольные измерения.
	КэшЗначений.Вставить("Измерения"         , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Произвольные", "Синоним"));
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()

	бит_НастройкиДоступностиЭлементовФорм.РазблокироватьЭлементы(ЭтотОбъект);
	
	// Устанавливаем доступность кнопки "Подбор" командной панели "КоманднаяПанельБДДС".
	Элементы.БДДСПодборДанныхБюджета.Доступность = ЗначениеЗаполнено(Объект.Сценарий);
	
	Элементы.СторнироватьЗависимыеОбороты.Видимость = Объект.РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Автоматический;
	
	Если КэшЗначений.ПроводитьПослеУтверждения 
		И Объект.Проведен И Объект.ОтправленНаСогласование
		И Объект.РежимПринятияКУчету = 1
		И ТипСтатуса <> ПредопределенноеЗначение("Перечисление.бит_ТипыСтатусовОбъектов.Утвержден") Тогда
		Элементы.ПредупреждениеОПринятиеКУчетуПослеУтверждения.Видимость = Истина;
	Иначе
		Элементы.ПредупреждениеОПринятиеКУчетуПослеУтверждения.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СписатьЛимиты.Видимость   = НеУчитыватьСверхБюджета;
	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаблокироватьЭлементы(ЭтотОбъект);
	
КонецПроцедуры

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из КонтролируемыеРеквизиты Цикл
		КонтролируемыеРеквизиты[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры

// Процедура добавляет в кэш реквизитов текущее значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	КонтролируемыеРеквизиты[ИмяРеквизита] = Объект[ИмяРеквизита];	
	
КонецПроцедуры

// Процедура извлекает из кэша и присваивает объекту значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ИзвлечьИзКэша(ИмяРеквизита)
	
	Объект[ИмяРеквизита] = КонтролируемыеРеквизиты[ИмяРеквизита];
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

// Обработка оповещения вопроса пользователю. 
// 
// Параметры:
//  Ответ - Строка.
// 
&НаКлиенте
Процедура ВопросРежимЗависимыхОборотовПриИзменении(Ответ, ТекущийРежимЗависимыхОборотов) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда 			
		Объект.ЗависимыеОбороты.Очистить();  					
	Иначе
		РежимЗависимыхОборотов = ТекущийРежимЗависимыхОборотов;
	КонецЕсли;

	ДобавитьВКэш("РежимЗависимыхОборотов");
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция РаспределениеПоддерживается(ДанныеСтроки, ПолеФормы)
	
	Поддерживается = Истина;
	ТекстСообщения = "";
	ИмяПоля = СтрЗаменить(ПолеФормы.Имя, "БДДС", "");	   
	Разрез  = СтрЗаменить(ИмяПоля, "_Старый", "");
	Представление = "";
	
	Если НЕ ПустаяСтрока(ПолеФормы.Заголовок) Тогда
		Представление = ПолеФормы.Заголовок;
	Иначе	
		Если ТипЗнч(ПолеФормы.Родитель) = Тип("ГруппаФормы") Тогда
			Представление = ПолеФормы.Родитель.Заголовок;
		Иначе	
			Представление = Разрез;
		КонецЕсли;  
	КонецЕсли; 
	
	Если Поддерживается Тогда
		Исключения = Новый Массив;
		// Технологические.
		Исключения.Добавить(Элементы.БДДСНомерСтроки);
		Исключения.Добавить(Элементы.БДДСНадписиСтароеЗначение);
		Исключения.Добавить(Элементы.БДДСНадписиНовоеЗначение);
		// Значащие.
		Исключения.Добавить(Элементы.БДДССумма_Старый);
		Исключения.Добавить(Элементы.БДДССуммаСценарий_Старый);
		Исключения.Добавить(Элементы.БДДССуммаРегл_Старый);
		Исключения.Добавить(Элементы.БДДССуммаУпр_Старый);
		Исключения.Добавить(Элементы.БДДСВалюта_Старый);
		Исключения.Добавить(Элементы.БДДСКоличество_Старый);
		Исключения.Добавить(Элементы.БДДСКомментарий_Старый);
		Исключения.Добавить(Элементы.БДДССтатьяОборотов_Старый);
		Исключения.Добавить(Элементы.БДДССтавкаНДС_Старый);
		
		Исключения.Добавить(Элементы.БДДССумма);
		Исключения.Добавить(Элементы.БДДССуммаСценарий);
		Исключения.Добавить(Элементы.БДДССуммаРегл);
		Исключения.Добавить(Элементы.БДДССуммаУпр);
		Исключения.Добавить(Элементы.БДДСВалюта);
		Исключения.Добавить(Элементы.БДДСКоличество);
		Исключения.Добавить(Элементы.БДДСКомментарий);
		Исключения.Добавить(Элементы.БДДССтатьяОборотов);
		Исключения.Добавить(Элементы.БДДССтавкаНДС);		

		Если Исключения.Найти(ПолеФормы) <> Неопределено Тогда
			Поддерживается = Ложь;
			ТекстСообщения = НСтр("ru='По этой колонке распределение не поддерживается.';
								  |en='For this column, the distribution is not supported.'");
		КонецЕсли;
	КонецЕсли; 
	
	ПолеПериод = (ПолеФормы = Элементы.БДДСПериод_Старый ИЛИ ПолеФормы = Элементы.БДДСПериод);
	Если Поддерживается И НЕ ПолеПериод Тогда
		// Если по статье не ведется учет по данной аналитике - распределение невозможно.		
		НастройкиСтатьи = ПолучитьНастройкиСтатьи(ДанныеСтроки.СтатьяОборотов);
		Если НастройкиСтатьи <> Неопределено Тогда
			ВедетсяУчет = Ложь;
			НастройкиСтатьи.Свойство("Учет_" + Разрез, ВедетсяУчет);
			Если ВедетсяУчет <> Истина Тогда
				Поддерживается = Ложь;
				ТекстСообщения = НСтр("ru='Для статьи ""%1"" по аналитике ""%2"" учет не ведется. Распределение не поддерживается.';
									  |en='For the article ""%1"" for analysis ""%2"" accounting is not conducted. Distribution is not supported.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ДанныеСтроки.СтатьяОборотов, Представление);
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
	
	Если НЕ Поддерживается Тогда
		ПоказатьПредупреждение(, ТекстСообщения,, НСтр("ru='Распределить по ...';en='Distribute ...'"));	
	КонецЕсли; 
	
	Возврат Поддерживается;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкиСтатьи(Знач СтатьяОборотов) 

	НастройкиСтатей = Новый Соответствие;
	бит_Бюджетирование.ПолучитьНастройкиСтатейОборотов(СтатьяОборотов, НастройкиСтатей);
	Возврат НастройкиСтатей[СтатьяОборотов];
	
КонецФункции

&НаСервере
Процедура РаспределитьНаСервере(Знач ВыделенныеСтроки, Знач НастройкиРаспределения)
	
	Ресурсы = Новый Массив();  
	Ресурсы.Добавить("СуммаСценарий");
	Ресурсы.Добавить("СуммаРегл");
	Ресурсы.Добавить("СуммаУпр");
	Ресурсы.Добавить("Сумма");
	Ресурсы.Добавить("Количество");
	
	Модифицированность = Истина;
	
	Для каждого ИдСтроки Из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.БДДС.НайтиПоИдентификатору(ИдСтроки);	
		Если СтрокаТаблицы <> Неопределено Тогда
			// Распределение по профилю.
			НовыеСтроки = бит_Бюджетирование.РаспределитьПоПрофилюАналитики(НастройкиРаспределения, Объект.БДДС, СтрокаТаблицы, Ресурсы);
			// Заполнение сторнируемых ресурсов и надписей.
			Для каждого НоваяСтрока Из НовыеСтроки Цикл
				Если НЕ НоваяСтрока.РучнаяКорректировка Тогда
					Для каждого Ресурс Из Ресурсы Цикл
						НоваяСтрока[Ресурс + "_Старый"] = НоваяСтрока[Ресурс];
					КонецЦикла; 
				КонецЕсли; 
				ЗаполнитьНадписиВСтроке(НоваяСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНадписиВСтроке(ТекущаяСтрока)

	ТекущаяСтрока.НадписиНовоеЗначение  = НСтр("ru='после изменения:';en='after the change:'");
	ТекущаяСтрока.НадписиСтароеЗначение = НСтр("ru='до изменения:';en='before the change:'");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	Для каждого СтрокаТаблицы Из Объект.БДДС Цикл
		ЗаполнитьНадписиВСтроке(СтрокаТаблицы);
	КонецЦикла; 	

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()
	
	Если ФормаИнициализирована Тогда
		Возврат;
	КонецЕсли;
	
	// Элементы управления для измерений несуществующих в смежном решении	
	// создаются программно для унификации кода.
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправленияКорректировкаБюджета(Элементы);
	бит_РаботаСДиалогамиПереопределяемый.СоздатьЭлементыУправления(Элементы, "ЗависимыеОбороты", "ЗависимыеОбороты",
		Элементы.ЗависимыеОборотыКоличество);

	// Подготовка параметров, необходимых для отображения доп. измерений.
	ПараметрыГрупп = Новый Соответствие;
	ПараметрыПолей = Новый Соответствие;
	Для каждого ТекЭлемент Из КэшЗначений.ИзмеренияДоп Цикл
		СтруктураИмен = Новый Структура;
		СтруктураИмен.Вставить("ИмяПоля" , "БДДСГруппа" + ТекЭлемент.Ключ);
		СтруктураИмен.Вставить("Префикс" , "");
		СтруктураИмен.Вставить("Постфикс", "");
		
		ПараметрыГрупп.Вставить(ТекЭлемент.Ключ, СтруктураИмен);
		
		СтруктураИмен = Новый Структура;
		СтруктураИмен.Вставить("ИмяПоля" , "БДДС" + ТекЭлемент.Ключ + "_Старый");
		СтруктураИмен.Вставить("Префикс" , "");
		СтруктураИмен.Вставить("Постфикс", " " + НСтр("ru='(старый)';en='(old)'"));
		
		ПараметрыПолей.Вставить(ТекЭлемент.Ключ, СтруктураИмен);
	КонецЦикла;
	
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(
		ЭтотОбъект, "БДДС", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
																	
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(
		ЭтотОбъект, "БДДС", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений, ПараметрыГрупп);
	
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(
		ЭтотОбъект, "БДДС", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений, ПараметрыПолей);

	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(
		ЭтотОбъект, "ЗависимыеОбороты", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);

	ФормаИнициализирована = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьАвтовидимостьКолонок(Знач ОбновлятьБезусловно = Ложь)
	
	ИмяТабличнойЧасти = "БДДС";
	ИмяМассива = "МассивСтатей_" 		+ ИмяТабличнойЧасти;
	
	Если фАвтовидимостьКолонок Тогда
		
		ТаблРез = Объект[ИмяТабличнойЧасти].Выгрузить();
		МассивСтатей = ТаблРез.ВыгрузитьКолонку("СтатьяОборотов");
		МассивСтарый = ТаблРез.ВыгрузитьКолонку("СтатьяОборотов_Старый"); 			
		Для каждого Элемент Из МассивСтарый Цикл  				
			МассивСтатей.Добавить(Элемент);    				
		КонецЦикла;		
		
		НеобходимоИзменение = бит_РаботаСДиалогамиСервер.НужноИзменитьВидимостьКолонокБюджета(МассивСтатей
																		, КэшЗначений[ИмяМассива]
																		, КэшЗначений.НастройкаВидимостиКолонок
																		, КэшЗначений.НастройкиИзмерений);
		
		Если НеобходимоИзменение Тогда
			
			бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы
											 				, КэшЗначений.НастройкаВидимостиКолонок
											 				, ИмяТабличнойЧасти);
			бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы
											 				, КэшЗначений.НастройкаВидимостиКолонок
											 				, ИмяТабличнойЧасти
															, "_Старый"); // Старый.															
						
		КонецЕсли; 
		
	Иначе
		
		Если ОбновлятьБезусловно Тогда
			
			НеобходимоИзменение = бит_РаботаСДиалогамиСервер.НужноИзменитьВидимостьКолонокБюджета(Новый Массив
																		, КэшЗначений[ИмяМассива]
																		, КэшЗначений.НастройкаВидимостиКолонок
																		, КэшЗначений.НастройкиИзмерений);
																		
			бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы
											 				,КэшЗначений.НастройкаВидимостиКолонок
											 				,ИмяТабличнойЧасти);
			бит_РаботаСДиалогамиСервер.УправлениеВидимостьюКолонокТабличногоПоля(Элементы
											 				,КэшЗначений.НастройкаВидимостиКолонок
											 				,ИмяТабличнойЧасти
															, "_Старый"); // Старый.
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОформитьТаблицу(СтатьяОборотов = Неопределено, ПрефиксТаблицы = "БДДС") 
	
	// ----------------------------------------------------------------------
	// Оформление реквизитов строк по статьям оборотов.
	ПрефиксКонтейнера = "Объект.";
	
	Если СтатьяОборотов = Неопределено Тогда
	    // Формирование массива статей, по которым нужно добавить элементы УО.
		ТаблицаПоиска = Объект[ПрефиксТаблицы].Выгрузить();
		МассивСтатей = ТаблицаПоиска.ВыгрузитьКолонку("СтатьяОборотов");
		
		Если ПрефиксТаблицы = "БДДС" Тогда
			МассивСтатейСтарых = ТаблицаПоиска.ВыгрузитьКолонку("СтатьяОборотов_Старый");
			Для каждого ЭлементМассива Из МассивСтатейСтарых Цикл
				МассивСтатей.Добавить(ЭлементМассива);		
			КонецЦикла;
		КонецЕсли;
		
		бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСтатей);
		
		ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].ЗагрузитьЗначения(МассивСтатей);
	Иначе // Работаем только с одной статьей оборотов.		
		
		МассивСтатей = Новый Массив; 		
		
		НайденноеЗначение = ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].НайтиПоЗначению(СтатьяОборотов);
		Если НайденноеЗначение = Неопределено Тогда	
			
			МассивСтатей.Добавить(СтатьяОборотов);
			ЭтотОбъект["фСписокСтатей" + ПрефиксТаблицы].Добавить(СтатьяОборотов);		
			
		КонецЕсли;  		
		
	КонецЕсли;	
	
	ПараметрыОформления = бит_РаботаСДиалогамиСервер.НовыеПараметрыОформленияСтатей();
	ПараметрыОформления.ПрефиксКонтейнера                 = ПрефиксКонтейнера;
	ПараметрыОформления.ПрефиксТаблицы                    = ПрефиксТаблицы;
	ПараметрыОформления.ПоляОформления                    = КэшЗначений.СтруктураДопПолей;
	ПараметрыОформления.ОтметитьОбязательныеРазрезыСтатей = Истина;
	бит_РаботаСДиалогамиСервер.ОформитьТаблицуПоСтатьямОборотов(УсловноеОформление, МассивСтатей, ПараметрыОформления);
	
	Если ПрефиксТаблицы = "БДДС" Тогда
		ПараметрыОформления.Постфикс                          = "_Старый";
		ПараметрыОформления.ОтметитьОбязательныеРазрезыСтатей = Ложь;
		бит_РаботаСДиалогамиСервер.ОформитьТаблицуПоСтатьямОборотов(УсловноеОформление, МассивСтатей, ПараметрыОформления);
		УстановитьУсловноеОформлениеТаблиц();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИзВалютыВВалюту(ТекущиеДанные, ИмяРеквизита, ИмяРеквизитаИсточник, СтруктураКурсыНач, СтруктураКурсыКон)

	ТекущиеДанные[ИмяРеквизита] = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(ТекущиеДанные[ИмяРеквизитаИсточник]
    																			, СтруктураКурсыНач.Валюта
    																			, СтруктураКурсыКон.Валюта
    																			, СтруктураКурсыНач.Курс
    																			, СтруктураКурсыКон.Курс
    																			, СтруктураКурсыНач.Кратность
    																			, СтруктураКурсыКон.Кратность);
	

КонецПроцедуры

&НаСервере
Процедура ВыполнитьВалютныеПересчетыВСтроке(ТекИд, Префикс, Постфикс)

	ТекущиеДанные = Объект.БДДС.НайтиПоИдентификатору(ТекИд);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
  	СтруктураКурсыВалют = бит_Бюджетирование.КурсыВалютСценария(ДокОбъект, ТекущиеДанные.Период, Новый Структура("Документ, Регл, Упр, Сценарий"));
  
  	Если Объект.Сценарий.ИспользоватьКурсыСценария Тогда
		СтруктураКурсыСценарий = СтруктураКурсыВалют.Сценарий;
  	Иначе	
  		СтруктураКурсыСценарий = СтруктураКурсыВалют.Документ;
	КонецЕсли;
	СтруктураКурсыРегл = СтруктураКурсыВалют["Регл"];
	СтруктураКурсыУпр  = СтруктураКурсыВалют["Упр"];
	СтруктураКурсыВал  = бит_КурсыВалют.ПолучитьКурсВалюты(ТекущиеДанные.Валюта, ТекущиеДанные.Период);
		
	ИмяРеквизитаИсточник = Префикс + Постфикс;
	           	
	Если Префикс = "СуммаСценарий" Тогда
		ПересчитатьИзВалютыВВалюту(ТекущиеДанные, "Сумма" + Постфикс	, ИмяРеквизитаИсточник, СтруктураКурсыСценарий, СтруктураКурсыВал);
		ПересчитатьИзВалютыВВалюту(ТекущиеДанные, "СуммаРегл" + Постфикс, ИмяРеквизитаИсточник, СтруктураКурсыСценарий, СтруктураКурсыРегл);	
		ПересчитатьИзВалютыВВалюту(ТекущиеДанные, "СуммаУпр" + Постфикс , ИмяРеквизитаИсточник, СтруктураКурсыСценарий, СтруктураКурсыУпр);
	ИначеЕсли Префикс = "Сумма" Тогда	
		ПересчитатьИзВалютыВВалюту(ТекущиеДанные, "СуммаСценарий" + Постфикс, ИмяРеквизитаИсточник, СтруктураКурсыВал, СтруктураКурсыСценарий);
		ПересчитатьИзВалютыВВалюту(ТекущиеДанные, "СуммаРегл" + Постфикс	, ИмяРеквизитаИсточник, СтруктураКурсыВал, СтруктураКурсыРегл);	
		ПересчитатьИзВалютыВВалюту(ТекущиеДанные, "СуммаУпр" + Постфикс	 	, ИмяРеквизитаИсточник, СтруктураКурсыВал, СтруктураКурсыУпр);
	КонецЕсли;   	
  	      
КонецПроцедуры

&НаСервере
Процедура ПослеУдаленияСтрокиТаблицыБДДС()
	
	УстановитьАвтовидимостьКолонок();

КонецПроцедуры

// Процедура обрабатывает изменение валюты документа.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура ИзменениеВалютыСервер()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ИзменениеВалютыОбъект();
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// Процедура обрабатывает изменение сценария.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура ИзменениеСценарияСервер(Знач ОчищатьТч = Ложь)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ИзменениеСценарияОбъект(ОчищатьТч);
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	УправлениеФормой();
	
КонецПроцедуры

// Процедура обрабатывает изменение реквизита "СтатьяОборотов" в табличной части "БДДС".
// 
// Параметры:
//  ТекИд - Число.
// 
&НаСервере
Процедура ИзменениеСтатьиОборотовТабличнойЧасти(Знач Идентификатор)
	
	Если ТипЗнч(Идентификатор) = Тип("Число") Тогда
		ТекущиеДанные = Объект.БДДС.НайтиПоИдентификатору(Идентификатор);
	Иначе
		ТекущиеДанные = Идентификатор;
	КонецЕсли; 

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СтатьяОборотов) Тогда
		НастройкиСтатьи = Справочники.бит_СтатьиОборотов.ПолучитьНастройки(ТекущиеДанные.СтатьяОборотов);	
		
		ТекущиеДанные.СтавкаНДС = НастройкиСтатьи.СтавкаНДС;
		Если Не НастройкиСтатьи.Учет_Количество Тогда
			ТекущиеДанные.Количество = 0;
		КонецЕсли;
		
		Если Не НастройкиСтатьи.Учет_Сумма Тогда
			ТекущиеДанные.СуммаСценарий = 0;
			ТекущиеДанные.СуммаРегл 	= 0;
			ТекущиеДанные.СуммаУпр 		= 0;
			ТекущиеДанные.Сумма 		= 0;
		КонецЕсли;
		
		бит_Бюджетирование.УстановитьИспользованиеАналитики(ТекущиеДанные, НастройкиСтатьи, КэшЗначений.Измерения);
		
		ОформитьТаблицу(ТекущиеДанные.СтатьяОборотов);		
		УстановитьАвтовидимостьКолонок();
	КонецЕсли;

КонецПроцедуры

// Процедура обрабатывает изменение реквизита "Сумма...."" в табличной части "БДДС".
// 
// Параметры:
//  ТекИд 	 - Число,
//  Префикс  - Строка,
//  Постфикс - Строка.
// 
&НаСервере
Процедура ИзменениеСуммыТабличнойЧасти(Знач ТекИд, Знач Префикс, Знач Постфикс)
	
	ВыполнитьВалютныеПересчетыВСтроке(ТекИд, Префикс, Постфикс);
			
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборДанныхБюджета(Знач ПараметрыРезультата)

	РезультатПодбора = ПараметрыРезультата.РезультатПодбора;
	Если РезультатПодбора.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли; 
	
	ОчиститьТаблицу  = ПараметрыРезультата.ОчиститьТаблицу;
	Если ОчиститьТаблицу Тогда
		Объект.БДДС.Очистить();
	КонецЕсли; 
	
	Для Каждого СтрокаТаблицы Из РезультатПодбора Цикл
		ДобавитьРезультатПолбораВБДДС(СтрокаТаблицы);	
	КонецЦикла;
	
	Модифицированность = Истина;
	ОформитьТаблицу();
	УстановитьАвтовидимостьКолонок();
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРезультатПолбораВБДДС(ДанныеСтроки)
	
	СтрокаТаблицы = Неопределено;
	
	// Поиск такой же строки в таблице БДДС.
	НайденныеСтроки = Объект.БДДС.НайтиСтроки(ДанныеСтроки);
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрокаТаблицы = НайденныеСтроки[0];		
	КонецЕсли;
	
	Если СтрокаТаблицы = Неопределено Тогда
		
		СтрокаТаблицы = Объект.БДДС.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеСтроки);
		
		Для каждого КлЗнч Из ДанныеСтроки Цикл
			ИмяРеквизита = КлЗнч.Ключ;
			СтрокаТаблицы[ИмяРеквизита + "_Старый"] = ДанныеСтроки[ИмяРеквизита];		
		КонецЦикла;

		// Сумма в валюте.
		Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаСценарий <> 0 Тогда
			СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаСценарий;		
		КонецЕсли;

	Иначе
		
		ТекстСообщения = НСтр("ru='Данная строка уже подобрана в табличную часть ""Данные бюджета"" строка № %1';
							  |en='This line has picked up in a table of the ""Budget Information"" line number %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Формат(СтрокаТаблицы.НомерСтроки,"ЧЦ=5; ЧДЦ="));
		Поле = СтрШаблон("БДДС[%1].НомерСтроки", Формат(СтрокаТаблицы.НомерСтроки - 1,"ЧЦ=5; ЧГ="));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, Поле,, Ложь);
	КонецЕсли;
			
КонецПроцедуры

// Процедура заполняет зависимые обороты.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура ЗаполнитьЗависимыеОборотыСервер()

	Объект.ЗависимыеОбороты.Очистить();
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьЗависимыеОбороты();
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	ОформитьТаблицу(,"ЗависимыеОбороты");
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеТабличнойЧастиНаСервере(Знач ПараметрыОповещения)

	ИмяТабличнойЧасти		  = ПараметрыОповещения.ИмяТабличнойЧасти;
	АдресВоВременномХранилище = ПараметрыОповещения.АдресВоВременномХранилище;
		
	Модифицированность = Истина;
	ДанныеЗаполнения   = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Индекс = 0;
	Для каждого СтрокаТаблицы Из ДанныеЗаполнения Цикл
		ТекущиеДанные		  = Объект[ИмяТабличнойЧасти][Индекс];
		ТекущаяСтатьяОборотов = ТекущиеДанные.СтатьяОборотов;
		ТекущаяСумма 		  = ТекущиеДанные.Сумма;
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтрокаТаблицы);
		
		Если ТекущиеДанные.СтатьяОборотов <> ТекущаяСтатьяОборотов Тогда
			ИзменениеСтатьиОборотовТабличнойЧасти(ТекущиеДанные);
		КонецЕсли; 
		
		Если ТекущиеДанные.Сумма <> ТекущаяСумма Тогда
			ИзменениеСуммыТабличнойЧасти(ТекущиеДанные.ПолучитьИдентификатор(), "Сумма", "");
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла; 

КонецПроцедуры

// Процедура добавляет условное оформление для предопределенных аналитик
//  доступных только в БФ 3.1 для БП 3.0. 
//
&НаСервере
Процедура УстановитьУсловноеОформлениеТаблиц()

	ПоляТаблицы = ПоляТаблицы(ЭтотОбъект);
	Измерения = ПоляТаблицы.Измерения;	
	Для Каждого Поле Из Измерения Цикл
				
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		// АПК:277-выкл Поставщик библиотеки не разбил модуль на области.
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "БДДС" + Поле);
		// АПК:277-вкл
		
		ГруппаИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор.Элементы,"",
					ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИ,
			"Объект.БДДС." + Поле, ВидСравненияКомпоновкиДанных.НеРавно, 
			Новый ПолеКомпоновкиДанных("Объект.БДДС." + Поле + "_Старый"));
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИ,
			"Объект.БДДС.РучнаяКорректировка", ВидСравненияКомпоновкиДанных.Равно, Ложь);
			
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.бит_ОсновнойЭлементСписка);
	КонецЦикла;

	Для каждого ГруппаПолей Из ПоляТаблицы Цикл
		Для каждого Поле Из ГруппаПолей.Значение Цикл
			ЭлементУО = УсловноеОформление.Элементы.Добавить();
			// АПК:277-выкл Поставщик библиотеки не разбил модуль на области.
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "БДДС" + Поле + "_Старый");
			// АПК:277-вкл
			
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.БДДС.РучнаяКорректировка", ВидСравненияКомпоновкиДанных.Равно, Истина);
			
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
		КонецЦикла; 		
	КонецЦикла; 
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Поставщик библиотеки не разбил модуль на области.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЗависимыеОборотыКомментарийРасчета");
	// АПК:277-вкл
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ЗависимыеОбороты.КомментарийРасчета", ВидСравненияКомпоновкиДанных.Заполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст"	 , НСтр("ru='Комментарий расчета';en='Calculation Comments'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Поставщик библиотеки не разбил модуль на области.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ЗависимыеОборотыСумма");
	// АПК:277-вкл
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ЗависимыеОбороты.Сумма", ВидСравненияКомпоновкиДанных.Заполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ВыделятьОтрицательные", Истина);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПоляТаблицы(Форма)

	Измерения = Новый Массив(); 
	Измерения.Добавить("Период");
	Измерения.Добавить("ЦФО");
	Измерения.Добавить("СтатьяОборотов");
	
	Если Форма.ЭтоБП Тогда
		Измерения.Добавить("Контрагент");
		Измерения.Добавить("ДоговорКонтрагента");
		Измерения.Добавить("Проект");
		Измерения.Добавить("НоменклатурнаяГруппа");
		Измерения.Добавить("БанковскийСчет");
		КоличествоАналитик = 7;
	Иначе
		КоличествоАналитик = 12;
	КонецЕсли; 
	
	Для Индекс = 1 По КоличествоАналитик Цикл
		Измерения.Добавить("Аналитика_" + Индекс);
	КонецЦикла; 
	
	Ресурсы = Новый Массив(); 
	Ресурсы.Добавить("Количество");
	Ресурсы.Добавить("СуммаСценарий");
	Ресурсы.Добавить("СуммаРегл");
	Ресурсы.Добавить("СуммаУпр");
	Ресурсы.Добавить("Сумма");
	
	Реквизиты = Новый Массив(); 
	Реквизиты.Добавить("СтавкаНДС");
	Реквизиты.Добавить("Валюта");
	Реквизиты.Добавить("Комментарий");
	
	ПоляТаблицы = Новый Структура; 
	ПоляТаблицы.Вставить("Измерения", Измерения);
	ПоляТаблицы.Вставить("Ресурсы", Ресурсы);
	ПоляТаблицы.Вставить("Реквизиты", Реквизиты);
	
	Возврат ПоляТаблицы;
	
КонецФункции

&НаСервере
Функция ПараметрыИзмененияТаблицыДокумента()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Команда", 			 "бит_КорректировкаБюджета");
	ПараметрыФормы.Вставить("Объект", 			 Объект.Ссылка);
	ПараметрыФормы.Вставить("ИмяТабличнойЧасти", "БДДС");
	ПараметрыФормы.Вставить("ТабличнаяЧасть",	 
		ПоместитьВоВременноеХранилище(Объект.БДДС.Выгрузить(), УникальныйИдентификатор));
		
	Возврат ПараметрыФормы;	
	
КонецФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеУчитыватьСверхБюджета(ЦФО, Период)

	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("ЦФО", ЦФО);
								
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(
								ПараметрыНастройки, Период);
								
	Возврат НеУчитыватьСверхБюджета;							

КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
		
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);
	ЭтоБП					= бит_ОбщегоНазначения.ЭтоСемействоБП();
	
	ЗаполнитьКэшЗначений();
	УстановитьСостояниеДокумента();	

	ИнициализироватьФорму()
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()

	ИзменениеВалютыСервер();
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ЦФОПриИзмененииНаСервере()
	
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.ЦФО, Объект.Дата);
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти
