#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет наборы значений доступа.
// Параметры:
//  Таблица - ТаблицаЗначений - передает в этот параметр подготовленные наборы значений
//            доступа. Описание колонок см. в функции УправлениеДоступом.ТаблицаНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ДобавитьСтрокуВНаборЗначенийДоступа(Ответственный, Таблица);
	
	// Таблица "УвеличениеЛимита"
	Для каждого СтрокаТаблицы Из УвеличениеЛимита Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
	
	// Таблица "УменьшениеЛимита"
	Для каждого СтрокаТаблицы Из УменьшениеЛимита Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
	
	// Удалим дубли
	ПоляГруппировки = "";
	Для каждого Колонка Из Таблица.Колонки Цикл
		ПоляГруппировки = "," + Колонка.Имя + ПоляГруппировки;
	КонецЦикла; 
	
	ПоляГруппировки = Сред(ПоляГруппировки, 2);
	Таблица.Свернуть(ПоляГруппировки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	// СтандартныеПодсистемы.ОбновлениеВерсииИБ
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("ПроводитьПослеУтверждения", ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения"));
	
	Если ВидКонтроля <> Перечисления.бит_РежимыКонтроляПоБюджету.Заявки Тогда
		ДокументОснование = Неопределено;
	КонецЕсли;
	
	Если ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Бюджет Тогда
		ПроизвольнаяПериодичностьКонтроля = Ложь;
	КонецЕсли;
	
	УстановитьКонтролируемыйСценарий();

	Если НЕ ПроизвольнаяПериодичностьКонтроля Тогда
		Если ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Бюджет Тогда
			ПериодичностьКонтроля = бит_КонтрольИсполненияБюджета.ПериодичностьКонтроляСценария(СценарийКонтролируемый);
		Иначе
			ПериодичностьКонтроля = бит_КонтрольИсполненияБюджета.ПериодичностьКонтроляСценария(Сценарий);
		КонецЕсли;
		ДатаНачалаКонтроля 	  = Дата;
		ДатаОкончанияКонтроля = Дата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПериодичностьКонтроля) Тогда
		ДатаНачалаКонтроля = бит_ОбщегоНазначенияКлиентСервер.ПолучитьНачалоПериода(
								ДатаНачалаКонтроля, ПериодичностьКонтроля);
		
		ДатаОкончанияКонтроля = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(
									ДатаОкончанияКонтроля, ПериодичностьКонтроля);								
	КонецЕсли;

	Если ВидКорректировки = Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ВозвратЛимита Тогда
		УменьшениеЛимита.Очистить();
	КонецЕсли; 
	
	Если СпособУстановкиРазрезовКонтроля <> Перечисления.бит_СпособыУстановкиРазрезовКонтроля.ИзНастройки Тогда
		НастройкаКонтроля = Документы.бит_УстановкаКонтрольныхЗначений.ПустаяСсылка();
	КонецЕсли;
	
	Если СпособУстановкиРазрезовКонтроля <> Перечисления.бит_СпособыУстановкиРазрезовКонтроля.ВручнуюИзШапки Тогда
		ИменаРеквизитов = ИменаРеквизитовКонтроль();
		Для каждого Имя Из ИменаРеквизитов Цикл
			ЭтотОбъект[Имя] = Ложь;	
		КонецЦикла;
	КонецЕсли;
	
	Если СпособУстановкиРазрезовКонтроля <> Перечисления.бит_СпособыУстановкиРазрезовКонтроля.ВручнуюПоСтрочно Тогда
		ИменаРеквизитов = ИменаРеквизитовКонтроль();
		Для каждого СтрокаТаблицы Из УвеличениеЛимита Цикл
			Для каждого Имя Из ИменаРеквизитов Цикл
				СтрокаТаблицы[Имя] = Ложь;	
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	КопияТаблицы = УвеличениеЛимита.Выгрузить();
	бит_КонтрольИсполненияБюджета.ОчиститьНеИспользуемыеАналитики(КопияТаблицы);
	УвеличениеЛимита.Загрузить(КопияТаблицы);
	
	КопияТаблицы = УменьшениеЛимита.Выгрузить();
	бит_КонтрольИсполненияБюджета.ОчиститьНеИспользуемыеАналитики(УменьшениеЛимита.Выгрузить());
	УменьшениеЛимита.Загрузить(КопияТаблицы);
	
	Если ДополнительныеСвойства.ПроводитьПослеУтверждения Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ОтправленНаСогласование = Истина;
		Иначе
			ОтправленНаСогласование = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		ПовторноеПроведение = Проведен И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения;
		УстановитьРежимПринятияКУчету(ПовторноеПроведение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект, Ложь);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПриниматьКУчету = Истина;
	ПроводитьПослеУтверждения = ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения");
	Если ПроводитьПослеУтверждения И РежимПринятияКУчету = 1 Тогда
		ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
		Если НЕ Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ТекущийСтатус,
					Перечисления.бит_ТипыСтатусовОбъектов.Утвержден) Тогда
			ПриниматьКУчету = Ложь;
		КонецЕсли;
	КонецЕсли;

	ПараметрыПроведения = Документы.бит_КорректировкаКонтрольныхЗначений.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда  
		Возврат;
	КонецЕсли;
	
	Документы.бит_КорректировкаКонтрольныхЗначений.ВыполнитьКонтрольПересеченияНастроек(
		ПараметрыПроведения.КорректировкиНастроекКонтроля, 
		ПараметрыПроведения.КорректировкиНастроекКонтроляРеквизиты, Отказ);
		
	Если НЕ ПриниматьКУчету Тогда
		бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ); 
		Возврат;
	КонецЕсли;
	
	КонтрольныеЗначенияБюджетов = бит_КонтрольИсполненияБюджета.ПодготовитьТаблицуКорректировкиЛимитов(
									ПараметрыПроведения.ИсполнениеБюджета,
									ПараметрыПроведения.ИсполнениеБюджетаРеквизиты,
									Отказ);

	Если Отказ Тогда  
		Возврат;
	КонецЕсли; 

	бит_КонтрольИсполненияБюджета.СформироватьДвиженияКонтрольныеЗначенияБюджетов(
		КонтрольныеЗначенияБюджетов, Движения);
			
	бит_КонтрольИсполненияБюджета.СформироватьДвиженияКорректировкиСроковКонтроля(
		ПараметрыПроведения.КорректировкиНастроекКонтроля,
		ПараметрыПроведения.КорректировкиНастроекКонтроляРеквизиты,
		Движения);
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ); 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ); 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	
	Если ВидКонтроля <> Перечисления.бит_РежимыКонтроляПоБюджету.Бюджет Тогда
		НепроверяемыеРеквизиты.Добавить("СценарийКонтролируемый");
	КонецЕсли;
	
	Если ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Бюджет Тогда
		НепроверяемыеРеквизиты.Добавить("ДатаНачалаКонтроля");
		НепроверяемыеРеквизиты.Добавить("ДатаОкончанияКонтроля");
	Иначе
		Если НЕ ПроизвольнаяПериодичностьКонтроля Тогда
			НепроверяемыеРеквизиты.Добавить("ДатаНачалаКонтроля");
			НепроверяемыеРеквизиты.Добавить("ДатаОкончанияКонтроля");
		Иначе
			Если ЗначениеЗаполнено(ПериодичностьКонтроля) Тогда
				НепроверяемыеРеквизиты.Добавить("ДатаНачалаКонтроля");
				НепроверяемыеРеквизиты.Добавить("ДатаОкончанияКонтроля");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если СпособУстановкиРазрезовКонтроля <> Перечисления.бит_СпособыУстановкиРазрезовКонтроля.ИзНастройки Тогда
		НепроверяемыеРеквизиты.Добавить("НастройкаКонтроля");
	КонецЕсли;
	
	ПроверитьЗаполнениеНастройкиКонтроля(Отказ, ПроверяемыеРеквизиты);
	ПроверитьЗаполнениеУвеличениеЛимита(Отказ);
	ПроверитьЗаполнениеУменьшениеЛимита(Отказ);
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект,ПроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			ЗаполнитьПоЗаявке(ДанныеЗаполнения);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьШапкуДокумента();
	УстановитьРежимПринятияКУчету();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// Сбрасываем признак начала согласования.
	ОтправленНаСогласование = Ложь;
	ДокументОснование 		= Неопределено;
	ВидКонтроля 			= ОбъектКопирования.ВидКонтроля;
	Ответственный			= Пользователи.ТекущийПользователь();
	УстановитьРежимПринятияКУчету();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСтрокуВНаборЗначенийДоступа(ЗначениеДоступа, Таблица)
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = ЗначениеДоступа;

КонецПроцедуры

// Процедура заполняет шапку документа.
// 
// Параметры:
// 	ПараметрОбъектКопирования - ДокументСсылка.
// 
Процедура ЗаполнитьШапкуДокумента(ПараметрОбъектКопирования = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ВидКонтроля) Тогда
		ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Заявки;
	КонецЕсли;											
	
	Если НЕ ЗначениеЗаполнено(ВидКорректировки) Тогда
		ВидКорректировки = Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ЗаСчет;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СпособУстановкиРазрезовКонтроля) Тогда
		СпособУстановкиРазрезовКонтроля = Перечисления.бит_СпособыУстановкиРазрезовКонтроля.Автоматически;	
	КонецЕсли;

	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ПараметрОбъектКопирования);
		
	УстановитьКонтролируемыйСценарий();

КонецПроцедуры

Процедура УстановитьКонтролируемыйСценарий()
	
	Если ВидКонтроля <> Перечисления.бит_РежимыКонтроляПоБюджету.Бюджет Тогда
		СценарийКонтролируемый = Сценарий;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоЗаявке(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) <> Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Заявки;
		
	Если НЕ ЗначениеЗаполнено(ВидКорректировки) Тогда
		ВидКорректировки = Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ЗаСчет;
	КонецЕсли;	
	
	ИзмеренияДоп       = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним");
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");

	АдресДанныхДляКорректировки = "";
	Если ДанныеЗаполнения.Свойство("АдресДанныхДляКорректировки", АдресДанныхДляКорректировки) Тогда
		Если НЕ ЭтоАдресВременногоХранилища(АдресДанныхДляКорректировки) Тогда
			Возврат;	
		КонецЕсли;
		
		Результат = ПолучитьИзВременногоХранилища(АдресДанныхДляКорректировки);
		Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
			Возврат;
		КонецЕсли;
		
		ОжидаемыеДанные = Новый Структура("ЕстьДанныеКорректировки, АдресКорректировки", Ложь, "");
		ЗаполнитьЗначенияСвойств(ОжидаемыеДанные, Результат);
		
		ЕстьДанныеКорректировки = ОжидаемыеДанные.ЕстьДанныеКорректировки;
		АдресКорректировки		= ОжидаемыеДанные.АдресКорректировки;
		
		Если НЕ ЭтоАдресВременногоХранилища(АдресКорректировки) Тогда
			Возврат;	
		КонецЕсли;
		
		Корректировки = ПолучитьИзВременногоХранилища(АдресКорректировки);
		Если ТипЗнч(Корректировки) <> Тип("ТаблицаЗначений") Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаДокумента = УвеличениеЛимита.ВыгрузитьКолонки();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Корректировки, ТаблицаДокумента);
		
		Группировки = бит_КонтрольИсполненияБюджета.ПереченьИзмеренийКонтроля(); 
		ТаблицаДокумента.Свернуть(Группировки + ", Период", "Сумма, Количество"); 
		УвеличениеЛимита.Загрузить(ТаблицаДокумента);
		
		Для каждого СтрокаТаблицы Из УвеличениеЛимита Цикл
			СтрокаТаблицы.КлючСтроки = Строка(Новый УникальныйИдентификатор());
		КонецЦикла;
		
		ИсполнениеБюджетаРеквизиты = Новый ТаблицаЗначений;
		ИсполнениеБюджетаРеквизиты.Колонки.Добавить("РежимКонтроля", 		  Новый ОписаниеТипов("ПеречислениеСсылка.бит_РежимыКонтроляПоБюджету"));
		ИсполнениеБюджетаРеквизиты.Колонки.Добавить("СценарийКонтролируемый", Метаданные.ОпределяемыеТипы.бит_СценарииПланирования.Тип);
		ИсполнениеБюджетаРеквизиты.Колонки.Добавить("Сценарий", 			  Метаданные.ОпределяемыеТипы.бит_СценарииПланирования.Тип);
		
		НоваяСтрока = ИсполнениеБюджетаРеквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтотОбъект);
		НоваяСтрока.РежимКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Заявки;
		
		Если Корректировки.Колонки.Найти("НомерСтроки") = Неопределено Тогда
			Корректировки.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(5));
			Счетчик = 1;
			Для каждого СтрокаТаблицы Из Корректировки Цикл
				СтрокаТаблицы.НомерСтроки = Счетчик; 
				Счетчик = Счетчик + 1;		
			КонецЦикла;
		КонецЕсли;
				
		РезультатПодбора = РезультатПодбораНастроекКонтроля(Корректировки, ИсполнениеБюджетаРеквизиты);
		Если ЗначениеЗаполнено(РезультатПодбора) Тогда
			
			УстановкиКонтрольныхЗначений = РезультатПодбора.ВыгрузитьКолонку("НастройкаКонтроля");
			УстановкиКонтрольныхЗначений = ОбщегоНазначенияКлиентСервер.СвернутьМассив(УстановкиКонтрольныхЗначений);
			
			Если УстановкиКонтрольныхЗначений.Количество() = 1 И ЗначениеЗаполнено(УстановкиКонтрольныхЗначений[0]) Тогда
				СпособУстановкиРазрезовКонтроля = Перечисления.бит_СпособыУстановкиРазрезовКонтроля.ИзНастройки;	
				НастройкаКонтроля				= УстановкиКонтрольныхЗначений[0]; 
			Иначе
				
				СпособУстановкиРазрезовКонтроля = Перечисления.бит_СпособыУстановкиРазрезовКонтроля.ВручнуюПоСтрочно;
				ПоляКонтроля				    = СтрСоединить(ИменаРеквизитовКонтроль(), ",");
				
				Для каждого СтрокаТаблицы Из УвеличениеЛимита Цикл
					ПараметрыПоиска = Новый Структура("НомерСтроки");
					ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаТаблицы); 
					РезультатПоиска = РезультатПодбора.НайтиСтроки(ПараметрыПоиска);
					Если ЗначениеЗаполнено(РезультатПоиска) Тогда
						ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РезультатПоиска[0], ПоляКонтроля);	
					КонецЕсли;				
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьРежимПринятияКУчету(ПовторноеПроведение = Ложь)
	
	Если ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения") Тогда
		Если НЕ ПовторноеПроведение Тогда
			РежимПринятияКУчету = 1;
		КонецЕсли;
	Иначе
		РежимПринятияКУчету = 0;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеНастройкиКонтроля(Отказ, ПроверяемыеРеквизиты)

	Если НЕ ЗначениеЗаполнено(НастройкаКонтроля) Тогда
		Возврат;
	КонецЕсли;
	
	ВидКонтроляНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаКонтроля, "ВидКонтроля");
	
	Если ВидКонтроляНастройки <> ВидКонтроля Тогда
		ТекстПояснения = НСтр("ru = 'Не подходящий вид операции.'; en = 'Inappropriate type of operation.'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", "КОРРЕКТНОСТЬ",
							НСтр("ru = 'Настройка контроля'; en = 'Setting up control'"),,, ТекстПояснения);
							
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "НастройкаКонтроля", ,Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеУвеличениеЛимита(Отказ)
	
	РеквизитыСтатей = Новый Соответствие(); 
	СинонимТаблицы 	  = НСтр("ru = 'Увеличение лимита'; en = 'Increasing the limit'");
	СинонимСумма 	  = НСтр("ru='Сумма';en='Amount'");
	СинонимКоличество = НСтр("ru='Количество';en='Quantity'");
	
	Для Каждого ТекущаяСтрока Из УвеличениеЛимита Цикл
		
		РеквизитыСтатьи = РеквизитыСтатей[ТекущаяСтрока.СтатьяОборотов];
		Если РеквизитыСтатьи = Неопределено Тогда
			Если ЗначениеЗаполнено(ТекущаяСтрока.СтатьяОборотов) Тогда
				РеквизитыСтатьи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСтрока.СтатьяОборотов, "Учет_Сумма, Учет_Количество");
			Иначе	
				РеквизитыСтатьи = Новый Структура("Учет_Сумма, Учет_Количество", Ложь, Ложь); 
			КонецЕсли;
			РеквизитыСтатей.Вставить(ТекущаяСтрока.СтатьяОборотов, РеквизитыСтатьи);
		КонецЕсли; 
		
		
		// Проверим заполненность суммы.
		Если РеквизитыСтатьи.Учет_Сумма И РеквизитыСтатьи.Учет_Количество Тогда			
			// Проверим заполненность суммы.
			Если ТекущаяСтрока.Сумма = 0 И ТекущаяСтрока.Количество = 0 Тогда				
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",,
									СинонимСумма, ТекущаяСтрока.НомерСтроки, СинонимТаблицы);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
				
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",,
									СинонимКоличество, ТекущаяСтрока.НомерСтроки, СинонимТаблицы);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
			КонецЕсли;
		Иначе
			// Проверим заполненность суммы.
			Если РеквизитыСтатьи.Учет_Сумма И ТекущаяСтрока.Сумма = 0 Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",,
									СинонимСумма, ТекущаяСтрока.НомерСтроки, СинонимТаблицы);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
			КонецЕсли;			
			// Проверим заполненность количество.
			Если РеквизитыСтатьи.Учет_Количество И ТекущаяСтрока.Количество = 0 Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",,
									СинонимКоличество, ТекущаяСтрока.НомерСтроки, СинонимТаблицы);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		// Для вида корректировки ЗаСчет сумма прихода должна совпадать с суммой расхода.
		Если ВидКорректировки = Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ЗаСчет Тогда
			
			СуммаПриход = ТекущаяСтрока.Сумма;
			СуммаРасход = 0;
			
			КоличествоПриход = ТекущаяСтрока.Количество;
			КоличествоРасход = 0;
			
			// Найдем подчиненные строки.
			Фильтр = Новый Структура;
			Фильтр.Вставить("КлючСтроки", ТекущаяСтрока.КлючСтроки);
			
			РезультатПоиска = УменьшениеЛимита.НайтиСтроки(Фильтр);
			
			Для Каждого ПодчиненнаяСтрока Из РезультатПоиска Цикл
				СуммаРасход 	 = СуммаРасход + ПодчиненнаяСтрока.Сумма;
				КоличествоРасход = КоличествоРасход + ПодчиненнаяСтрока.Количество;
			КонецЦикла;
			
			Префикс = СтрШаблон("УвеличениеЛимита[%1].", Формат(ТекущаяСтрока.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
			Если СуммаПриход <> СуммаРасход Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА","КОРРЕКТНОСТЬ",
									СинонимСумма, ТекущаяСтрока.НомерСтроки,  СинонимТаблицы,
									НСтр("ru='Сумма корректировки не совпадает с общей суммой корректировки по списку ""За счет"".';
										|en='The amount of adjustment is not the same as the total amount of the adjustment of the list of ""Through"".'"));
				Поле = Префикс + "Сумма";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, ,Отказ);
			КонецЕсли;
			
			Если ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.ГрафикиДоговоров
			 ИЛИ ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Бюджет Тогда
			 
				Если КоличествоПриход <> КоличествоРасход Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА","КОРРЕКТНОСТЬ",
										СинонимКоличество, ТекущаяСтрока.НомерСтроки, СинонимТаблицы,
										НСтр("ru='Количество не совпадает с общим количеством по списку ""За счет"".';
											|en='The number does not coincide with the total number in list ""Through"".'"));					
					Поле = Префикс + "Количество";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, ,Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Данные документа поддерживают ввод отрицательных значений.
		// Это исторически сложившийся факт. Сообщим об ошибке, но отказ изменять не станем.
		// В будущих релизах эта возможность будет отключена.
		Если ВидКорректировки = Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ЗаСчет Тогда
			НазваниеПравильнойТаблицы = НСтр("ru='За счет';en='At the expense of'");
		Иначе
			НазваниеПравильнойТаблицы = НСтр("ru = 'Уменьшение лимита'; en = 'Limit reduction'");
		КонецЕсли;
		
		Если ВидКорректировки = Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ВозвратЛимита Тогда
			
			Пояснение = НСтр("ru = 'Отрицательные значения не поддерживаются. Для уменьшения величины лимита используйте список ""%1"".'; 
							|en = 'Negative values are not supported. To reduce the limit, use the ""%1 "" list.'");
			Пояснение = СтрШаблон(Пояснение, НазваниеПравильнойТаблицы);
			КритическаяОшибка = Истина;
			
			Префикс = СтрШаблон("УвеличениеЛимита[%1].", Формат(ТекущаяСтрока.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
			Если ТекущаяСтрока.Сумма < 0 Тогда	 
				Поле 		   = Префикс + "Сумма";
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
									СинонимСумма, ТекущаяСтрока.НомерСтроки, СинонимТаблицы, Пояснение);
				Если КритическаяОшибка Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				Иначе	
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле);
				КонецЕсли;					 
			КонецЕсли;

			Если ТекущаяСтрока.Количество < 0 Тогда	 
				Поле 		   = Префикс + "Количество";
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
									СинонимКоличество, ТекущаяСтрока.НомерСтроки, СинонимТаблицы, Пояснение);
				
				Если КритическаяОшибка Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				Иначе	
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле);
				КонецЕсли;					 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьЗаполнениеУменьшениеЛимита(Отказ)
		
	РеквизитыСтатей   = Новый Соответствие(); 
	СинонимТаблицы 	  = НСтр("ru = 'Уменьшение лимита'; en = 'Limit reduction'");
	СинонимСумма 	  = НСтр("ru='Сумма';en='Amount'");
	СинонимКоличество = НСтр("ru='Количество';en='Quantity'");

	Для Каждого ТекущаяСтрока Из УменьшениеЛимита Цикл

		РеквизитыСтатьи = РеквизитыСтатей[ТекущаяСтрока.СтатьяОборотов];
		Если РеквизитыСтатьи = Неопределено Тогда
			Если ЗначениеЗаполнено(ТекущаяСтрока.СтатьяОборотов) Тогда
				РеквизитыСтатьи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСтрока.СтатьяОборотов, "Учет_Сумма, Учет_Количество");
			Иначе	
				РеквизитыСтатьи = Новый Структура("Учет_Сумма, Учет_Количество", Ложь, Ложь); 
			КонецЕсли;
			РеквизитыСтатей.Вставить(ТекущаяСтрока.СтатьяОборотов, РеквизитыСтатьи);
		КонецЕсли; 
		
		// Проверим заполненность суммы.
		Если РеквизитыСтатьи.Учет_Сумма И РеквизитыСтатьи.Учет_Количество Тогда			
			// Проверим заполненность суммы.
			Если ТекущаяСтрока.Сумма = 0 И ТекущаяСтрока.Количество = 0 Тогда				
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",,
									СинонимСумма, ТекущаяСтрока.НомерСтроки, СинонимТаблицы);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
				
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",,
									СинонимКоличество, ТекущаяСтрока.НомерСтроки, СинонимТаблицы);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
			КонецЕсли;
		Иначе
			// Проверим заполненность суммы.
			Если РеквизитыСтатьи.Учет_Сумма И ТекущаяСтрока.Сумма = 0 Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",,
									СинонимСумма, ТекущаяСтрока.НомерСтроки, СинонимТаблицы);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
			КонецЕсли;			
			// Проверим заполненность количество.
			Если РеквизитыСтатьи.Учет_Количество И ТекущаяСтрока.Количество = 0 Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА",,
									СинонимКоличество, ТекущаяСтрока.НомерСтроки, СинонимТаблицы);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
			КонецЕсли;
		КонецЕсли;
				
		// Данные документа поддерживают ввод отрицательных значений.
		// Это исторически сложившийся факт. Сообщим об ошибке, но отказ изменять не станем.
		// В будущих релизах эта возможность будет отключена.
		Если ВидКорректировки = Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ЗаСчет Тогда
			НазваниеПравильнойТаблицы = НСтр("ru='За счет';en='At the expense of'");
		Иначе
			НазваниеПравильнойТаблицы = НСтр("ru = 'Уменьшение лимита'; en = 'Limit reduction'");
		КонецЕсли;
		
		Если ВидКорректировки = Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ВозвратЛимита Тогда
			
			Пояснение = НСтр("ru = 'Отрицательные значения не поддерживаются. Для уменьшения величины лимита используйте список ""%1"".'; 
								|en = 'Negative values are not supported. To reduce the limit, use the ""%1 "" list.'");
			Пояснение = СтрШаблон(Пояснение, НазваниеПравильнойТаблицы);
			КритическаяОшибка = Истина;
			
			Префикс = СтрШаблон("УменьшениеЛимита[%1].", Формат(ТекущаяСтрока.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
			Если ТекущаяСтрока.Сумма < 0 Тогда	 
				Поле 		   = Префикс + "Сумма";
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
									СинонимСумма, ТекущаяСтрока.НомерСтроки, СинонимТаблицы, Пояснение);
				Если КритическаяОшибка Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				Иначе	
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле);
				КонецЕсли;					 
			КонецЕсли;
			Если ТекущаяСтрока.Количество < 0 Тогда	 
				Поле 		   = Префикс + "Количество";
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
									СинонимКоличество, ТекущаяСтрока.НомерСтроки, СинонимТаблицы, Пояснение);
				
				Если КритическаяОшибка Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				Иначе	
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле);
				КонецЕсли;					 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ИменаРеквизитовКонтроль()
	
	Имена = Новый Массив;
	Имена.Добавить("КонтрольАналитика_1");
	Имена.Добавить("КонтрольАналитика_2");
	Имена.Добавить("КонтрольАналитика_3");
	Имена.Добавить("КонтрольАналитика_4");
	Имена.Добавить("КонтрольАналитика_5");
	Имена.Добавить("КонтрольАналитика_6");
	Имена.Добавить("КонтрольАналитика_7");
	// ++ ЕРП
	Имена.Добавить("КонтрольАналитика_8");
	Имена.Добавить("КонтрольАналитика_9");
	Имена.Добавить("КонтрольАналитика_10");
	Имена.Добавить("КонтрольАналитика_11");
	Имена.Добавить("КонтрольАналитика_12");
	// -- ЕРП

	Возврат Имена;
	
КонецФункции

Функция РезультатПодбораНастроекКонтроля(ИсполнениеБюджета, ИсполнениеБюджетаРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(ИсполнениеБюджетаРеквизиты) ИЛИ НЕ ЗначениеЗаполнено(ИсполнениеБюджета) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Реквизиты = ИсполнениеБюджетаРеквизиты[0];

	Если Реквизиты.РежимКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Бюджет Тогда
		Сценарий 	  = Реквизиты.СценарийКонтролируемый;
		Периодичность = бит_КонтрольИсполненияБюджета.ПериодичностьКонтроляСценария(Реквизиты.СценарийКонтролируемый);
	Иначе
		Сценарий 	  = Реквизиты.Сценарий;
		Периодичность = бит_КонтрольИсполненияБюджета.ПериодичностьКонтроляСценария(Реквизиты.Сценарий);
	КонецЕсли;
	
	ТаблицаДляЦелейКонтроля = бит_КонтрольИсполненияБюджета.ПустаяТаблицаИсполнениеБюджетаДляЦелейКонтроля();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсполнениеБюджета, ТаблицаДляЦелейКонтроля);
	бит_КонтрольИсполненияБюджета.ОчиститьНеИспользуемыеАналитики(ТаблицаДляЦелейКонтроля);
	
	Запрос = Новый Запрос(); 
	Запрос.УстановитьПараметр("ИсполнениеБюджета", 		ТаблицаДляЦелейКонтроля);
	Запрос.УстановитьПараметр("СценарийКонтролируемый", Сценарий);
	Запрос.УстановитьПараметр("РежимКонтроля", 	   		Реквизиты.РежимКонтроля);
	Запрос.УстановитьПараметр("Периодичность", 	   		Периодичность);
	Запрос.УстановитьПараметр("КодПериода", 	   		бит_КонтрольИсполненияБюджета.КодПериодичности(Периодичность));
	
	// Аналог см. бит_КонтрольИсполненияБюджета.ПодготовитьТаблицуИсполнениеБюджетаДляЦелейКонтроля().
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсполнениеБюджета.ИмяСписка КАК ИмяСписка,
	|	ИсполнениеБюджета.СинонимСписка КАК СинонимСписка,
	|	ИсполнениеБюджета.НомерСтроки КАК НомерСтроки,
	|	ИсполнениеБюджета.Период КАК Период,
	|	ИсполнениеБюджета.ЦФО КАК ЦФО,
	|	ИсполнениеБюджета.СтатьяОборотов КАК СтатьяОборотов,
	|	ИсполнениеБюджета.Аналитика_1 КАК Аналитика_1,
	|	ИсполнениеБюджета.Аналитика_2 КАК Аналитика_2,
	|	ИсполнениеБюджета.Аналитика_3 КАК Аналитика_3,
	|	ИсполнениеБюджета.Аналитика_4 КАК Аналитика_4,
	|	ИсполнениеБюджета.Аналитика_5 КАК Аналитика_5,
	|	ИсполнениеБюджета.Аналитика_6 КАК Аналитика_6,
	|	ИсполнениеБюджета.Аналитика_7 КАК Аналитика_7,
	|	ИсполнениеБюджета.Сумма КАК Сумма,
	|	ИсполнениеБюджета.Количество КАК Количество,
	|	ИсполнениеБюджета.КонтролироватьСумму КАК КонтролироватьСумму,
	|	ИсполнениеБюджета.КонтролироватьКоличество КАК КонтролироватьКоличество,
	|	ИсполнениеБюджета.КонтролироватьПоСтатье КАК КонтролироватьПоСтатье,
	|	ИсполнениеБюджета.Аналитика_8 КАК Аналитика_8,
	|	ИсполнениеБюджета.Аналитика_9 КАК Аналитика_9,
	|	ИсполнениеБюджета.Аналитика_10 КАК Аналитика_10,
	|	ИсполнениеБюджета.Аналитика_11 КАК Аналитика_11,
	|	ИсполнениеБюджета.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	&ИсполнениеБюджета КАК ИсполнениеБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка КАК ИмяСписка,
	|	МАКСИМУМ(НастройкиКонтроля.Период) КАК Период,
	|	НастройкиКонтроля.РежимКонтроля КАК РежимКонтроля,
	|	НастройкиКонтроля.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	НастройкиКонтроля.СтатьяОборотов КАК СтатьяОборотов,
	|	НастройкиКонтроля.ЦФО КАК ЦФО,
	|	НастройкиКонтроля.Аналитика_1 КАК Аналитика_1,
	|	НастройкиКонтроля.Аналитика_2 КАК Аналитика_2,
	|	НастройкиКонтроля.Аналитика_3 КАК Аналитика_3,
	|	НастройкиКонтроля.Аналитика_4 КАК Аналитика_4,
	|	НастройкиКонтроля.Аналитика_5 КАК Аналитика_5,
	|	НастройкиКонтроля.Аналитика_6 КАК Аналитика_6,
	|	НастройкиКонтроля.Аналитика_7 КАК Аналитика_7,
	|	НастройкиКонтроля.Аналитика_8 КАК Аналитика_8,
	|	НастройкиКонтроля.Аналитика_9 КАК Аналитика_9,
	|	НастройкиКонтроля.Аналитика_10 КАК Аналитика_10,
	|	НастройкиКонтроля.Аналитика_11 КАК Аналитика_11,
	|	НастройкиКонтроля.Аналитика_12 КАК Аналитика_12,
	|	ИСТИНА КАК СтрогоеСоответствие
	|ПОМЕСТИТЬ СрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СрокиКонтроляПоБюджету КАК НастройкиКонтроля
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО (НастройкиКонтроля.СценарийКонтролируемый = &СценарийКонтролируемый)
	|			И (НастройкиКонтроля.РежимКонтроля = &РежимКонтроля)
	|			И НастройкиКонтроля.СтатьяОборотов = ВременнаяТаблица.СтатьяОборотов
	|			И НастройкиКонтроля.Период <= ВременнаяТаблица.Период
	|			И (ВременнаяТаблица.Период МЕЖДУ НастройкиКонтроля.НачалоПериода И НастройкиКонтроля.КонецПериода)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольЦФО
	|					ТОГДА НастройкиКонтроля.ЦФО = ВременнаяТаблица.ЦФО
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_10
	|					ТОГДА НастройкиКонтроля.Аналитика_10 = ВременнаяТаблица.Аналитика_10
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_8
	|					ТОГДА НастройкиКонтроля.Аналитика_8 = ВременнаяТаблица.Аналитика_8
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_9
	|					ТОГДА НастройкиКонтроля.Аналитика_9 = ВременнаяТаблица.Аналитика_9
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_11
	|					ТОГДА НастройкиКонтроля.Аналитика_11 = ВременнаяТаблица.Аналитика_11
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_12
	|					ТОГДА НастройкиКонтроля.Аналитика_12 = ВременнаяТаблица.Аналитика_12
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_1
	|					ТОГДА НастройкиКонтроля.Аналитика_1 = ВременнаяТаблица.Аналитика_1
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_2
	|					ТОГДА НастройкиКонтроля.Аналитика_2 = ВременнаяТаблица.Аналитика_2
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_3
	|					ТОГДА НастройкиКонтроля.Аналитика_3 = ВременнаяТаблица.Аналитика_3
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_4
	|					ТОГДА НастройкиКонтроля.Аналитика_4 = ВременнаяТаблица.Аналитика_4
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_5
	|					ТОГДА НастройкиКонтроля.Аналитика_5 = ВременнаяТаблица.Аналитика_5
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_6
	|					ТОГДА НастройкиКонтроля.Аналитика_6 = ВременнаяТаблица.Аналитика_6
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_7
	|					ТОГДА НастройкиКонтроля.Аналитика_7 = ВременнаяТаблица.Аналитика_7
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиКонтроля.СценарийКонтролируемый,
	|	НастройкиКонтроля.СтатьяОборотов,
	|	НастройкиКонтроля.ЦФО,
	|	НастройкиКонтроля.Аналитика_10,
	|	ВременнаяТаблица.НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка,
	|	НастройкиКонтроля.Аналитика_8,
	|	НастройкиКонтроля.Аналитика_11,
	|	НастройкиКонтроля.Аналитика_9,
	|	НастройкиКонтроля.Аналитика_12,
	|	НастройкиКонтроля.Аналитика_1,
	|	НастройкиКонтроля.Аналитика_2,
	|	НастройкиКонтроля.Аналитика_3,
	|	НастройкиКонтроля.Аналитика_4,
	|	НастройкиКонтроля.Аналитика_5,
	|	НастройкиКонтроля.Аналитика_6,
	|	НастройкиКонтроля.Аналитика_7,
	|	НастройкиКонтроля.РежимКонтроля
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблица.НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка,
	|	МАКСИМУМ(НастройкиКонтроля.Период),
	|	НастройкиКонтроля.РежимКонтроля,
	|	НастройкиКонтроля.СценарийКонтролируемый,
	|	НастройкиКонтроля.СтатьяОборотов,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.бит_СрокиКонтроляПоБюджету КАК НастройкиКонтроля
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО (НастройкиКонтроля.СценарийКонтролируемый = &СценарийКонтролируемый)
	|			И (НастройкиКонтроля.РежимКонтроля = &РежимКонтроля)
	|			И НастройкиКонтроля.СтатьяОборотов = ВременнаяТаблица.СтатьяОборотов
	|			И НастройкиКонтроля.Период <= ВременнаяТаблица.Период
	|			И (ВременнаяТаблица.Период МЕЖДУ НастройкиКонтроля.НачалоПериода И НастройкиКонтроля.КонецПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиКонтроля.СценарийКонтролируемый,
	|	НастройкиКонтроля.СтатьяОборотов,
	|	ВременнаяТаблица.НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка,
	|	НастройкиКонтроля.РежимКонтроля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследних.НомерСтроки КАК НомерСтроки,
	|	СрезПоследних.ИмяСписка КАК ИмяСписка,
	|	СрезПоследних.Период КАК Период,
	|	СрезПоследних.РежимКонтроля КАК РежимКонтроля,
	|	СрезПоследних.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	СрезПоследних.СтатьяОборотов КАК СтатьяОборотов,
	|	МАКСИМУМ(СрезПоследних.СтрогоеСоответствие) КАК СтрогоеСоответствие
	|ПОМЕСТИТЬ НестрогоеСоответствие
	|ИЗ
	|	СрезПоследних КАК СрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	СрезПоследних.НомерСтроки,
	|	СрезПоследних.ИмяСписка,
	|	СрезПоследних.Период,
	|	СрезПоследних.РежимКонтроля,
	|	СрезПоследних.СценарийКонтролируемый,
	|	СрезПоследних.СтатьяОборотов
	|
	|ИМЕЮЩИЕ
	|	НЕ МАКСИМУМ(СрезПоследних.СтрогоеСоответствие)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка КАК ИмяСписка,
	|	ВременнаяТаблица.СинонимСписка КАК СинонимСписка,
	|	СрезПоследних.Период КАК Период,
	|	НастройкиКонтроля.РежимКонтроля КАК РежимКонтроля,
	|	НастройкиКонтроля.Сценарий КАК Сценарий,
	|	НастройкиКонтроля.СтатьяОборотов КАК СтатьяОборотов,
	|	НастройкиКонтроля.НачалоПериода КАК НачалоПериода,
	|	НастройкиКонтроля.КонецПериода КАК КонецПериода,
	|	НастройкиКонтроля.Периодичность КАК Периодичность,
	|	НастройкиКонтроля.Регистратор КАК Регистратор,
	|	НастройкиКонтроля.КонтрольЦФО КАК КонтрольЦФО,
	|	НастройкиКонтроля.КонтрольАналитика_8 КАК КонтрольАналитика_8,
	|	НастройкиКонтроля.КонтрольАналитика_9 КАК КонтрольАналитика_9,
	|	НастройкиКонтроля.КонтрольАналитика_10 КАК КонтрольАналитика_10,
	|	НастройкиКонтроля.КонтрольАналитика_11 КАК КонтрольАналитика_11,
	|	НастройкиКонтроля.КонтрольАналитика_12 КАК КонтрольАналитика_12,
	|	НастройкиКонтроля.КонтрольАналитика_1 КАК КонтрольАналитика_1,
	|	НастройкиКонтроля.КонтрольАналитика_2 КАК КонтрольАналитика_2,
	|	НастройкиКонтроля.КонтрольАналитика_3 КАК КонтрольАналитика_3,
	|	НастройкиКонтроля.КонтрольАналитика_4 КАК КонтрольАналитика_4,
	|	НастройкиКонтроля.КонтрольАналитика_5 КАК КонтрольАналитика_5,
	|	НастройкиКонтроля.КонтрольАналитика_6 КАК КонтрольАналитика_6,
	|	НастройкиКонтроля.КонтрольАналитика_7 КАК КонтрольАналитика_7,
	|	НастройкиКонтроля.НастройкаКонтроля КАК НастройкаКонтроля
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрезПоследних КАК СрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СрокиКонтроляПоБюджету КАК НастройкиКонтроля
	|			ПО СрезПоследних.Период = НастройкиКонтроля.Период
	|				И СрезПоследних.СценарийКонтролируемый = НастройкиКонтроля.СценарийКонтролируемый
	|				И СрезПоследних.ЦФО = НастройкиКонтроля.ЦФО
	|				И СрезПоследних.СтатьяОборотов = НастройкиКонтроля.СтатьяОборотов
	|				И СрезПоследних.Аналитика_10 = НастройкиКонтроля.Аналитика_10
	|				И СрезПоследних.Аналитика_11 = НастройкиКонтроля.Аналитика_11
	|				И СрезПоследних.Аналитика_8 = НастройкиКонтроля.Аналитика_8
	|				И СрезПоследних.Аналитика_9 = НастройкиКонтроля.Аналитика_9
	|				И СрезПоследних.Аналитика_12 = НастройкиКонтроля.Аналитика_12
	|				И СрезПоследних.Аналитика_1 = НастройкиКонтроля.Аналитика_1
	|				И СрезПоследних.Аналитика_2 = НастройкиКонтроля.Аналитика_2
	|				И СрезПоследних.Аналитика_3 = НастройкиКонтроля.Аналитика_3
	|				И СрезПоследних.Аналитика_4 = НастройкиКонтроля.Аналитика_4
	|				И СрезПоследних.Аналитика_5 = НастройкиКонтроля.Аналитика_5
	|				И СрезПоследних.Аналитика_6 = НастройкиКонтроля.Аналитика_6
	|				И СрезПоследних.Аналитика_7 = НастройкиКонтроля.Аналитика_7
	|				И СрезПоследних.РежимКонтроля = НастройкиКонтроля.РежимКонтроля
	|		ПО ВременнаяТаблица.НомерСтроки = СрезПоследних.НомерСтроки
	|			И ВременнаяТаблица.ИмяСписка = СрезПоследних.ИмяСписка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблица.НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка,
	|	ВременнаяТаблица.СинонимСписка,
	|	НастройкиКонтроля.Период,
	|	НастройкиКонтроля.РежимКонтроля,
	|	НастройкиКонтроля.Сценарий,
	|	НастройкиКонтроля.СтатьяОборотов,
	|	НастройкиКонтроля.НачалоПериода,
	|	НастройкиКонтроля.КонецПериода,
	|	НастройкиКонтроля.Периодичность,
	|	НастройкиКонтроля.Регистратор,
	|	НастройкиКонтроля.КонтрольЦФО,
	|	НастройкиКонтроля.КонтрольАналитика_8,
	|	НастройкиКонтроля.КонтрольАналитика_9,
	|	НастройкиКонтроля.КонтрольАналитика_10,
	|	НастройкиКонтроля.КонтрольАналитика_11,
	|	НастройкиКонтроля.КонтрольАналитика_12,
	|	НастройкиКонтроля.КонтрольАналитика_1,
	|	НастройкиКонтроля.КонтрольАналитика_2,
	|	НастройкиКонтроля.КонтрольАналитика_3,
	|	НастройкиКонтроля.КонтрольАналитика_4,
	|	НастройкиКонтроля.КонтрольАналитика_5,
	|	НастройкиКонтроля.КонтрольАналитика_6,
	|	НастройкиКонтроля.КонтрольАналитика_7,
	|	НастройкиКонтроля.НастройкаКонтроля
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НестрогоеСоответствие КАК НестрогоеСоответствие
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СрокиКонтроляПоБюджету КАК НастройкиКонтроля
	|			ПО НестрогоеСоответствие.Период = НастройкиКонтроля.Период
	|				И НестрогоеСоответствие.РежимКонтроля = НастройкиКонтроля.РежимКонтроля
	|				И НестрогоеСоответствие.СценарийКонтролируемый = НастройкиКонтроля.СценарийКонтролируемый
	|				И НестрогоеСоответствие.СтатьяОборотов = НастройкиКонтроля.СтатьяОборотов
	|		ПО ВременнаяТаблица.НомерСтроки = НестрогоеСоответствие.НомерСтроки
	|			И ВременнаяТаблица.ИмяСписка = НестрогоеСоответствие.ИмяСписка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблица.НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка,
	|	ВременнаяТаблица.СинонимСписка,
	|	ВЫБОР &КодПериода
	|		КОГДА 6
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, ДЕНЬ)
	|		КОГДА 7
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, НЕДЕЛЯ)
	|		КОГДА 8
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, ДЕКАДА)
	|		КОГДА 9
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, МЕСЯЦ)
	|		КОГДА 10
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, КВАРТАЛ)
	|		КОГДА 11
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, ПОЛУГОДИЕ)
	|		КОГДА 12
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, ГОД)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, ДЕНЬ)
	|	КОНЕЦ,
	|	&РежимКонтроля,
	|	&СценарийКонтролируемый,
	|	ВременнаяТаблица.СтатьяОборотов,
	|	ВЫБОР &КодПериода
	|		КОГДА 6
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, ДЕНЬ)
	|		КОГДА 7
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, НЕДЕЛЯ)
	|		КОГДА 8
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, ДЕКАДА)
	|		КОГДА 9
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, МЕСЯЦ)
	|		КОГДА 10
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, КВАРТАЛ)
	|		КОГДА 11
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, ПОЛУГОДИЕ)
	|		КОГДА 12
	|			ТОГДА НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, ГОД)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВременнаяТаблица.Период, ДЕНЬ)
	|	КОНЕЦ,
	|	ВЫБОР &КодПериода
	|		КОГДА 6
	|			ТОГДА КОНЕЦПЕРИОДА(ВременнаяТаблица.Период, ДЕНЬ)
	|		КОГДА 7
	|			ТОГДА КОНЕЦПЕРИОДА(ВременнаяТаблица.Период, НЕДЕЛЯ)
	|		КОГДА 8
	|			ТОГДА КОНЕЦПЕРИОДА(ВременнаяТаблица.Период, ДЕКАДА)
	|		КОГДА 9
	|			ТОГДА КОНЕЦПЕРИОДА(ВременнаяТаблица.Период, МЕСЯЦ)
	|		КОГДА 10
	|			ТОГДА КОНЕЦПЕРИОДА(ВременнаяТаблица.Период, КВАРТАЛ)
	|		КОГДА 11
	|			ТОГДА КОНЕЦПЕРИОДА(ВременнаяТаблица.Период, ПОЛУГОДИЕ)
	|		КОГДА 12
	|			ТОГДА КОНЕЦПЕРИОДА(ВременнаяТаблица.Период, ГОД)
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ВременнаяТаблица.Период, ДЕНЬ)
	|	КОНЕЦ,
	|	&Периодичность,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ СрезПоследних КАК СрезПоследних
	|		ПО ВременнаяТаблица.ИмяСписка = СрезПоследних.ИмяСписка
	|			И ВременнаяТаблица.НомерСтроки = СрезПоследних.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ НестрогоеСоответствие КАК НестрогоеСоответствие
	|		ПО ВременнаяТаблица.ИмяСписка = НестрогоеСоответствие.ИмяСписка
	|			И ВременнаяТаблица.НомерСтроки = НестрогоеСоответствие.НомерСтроки
	|ГДЕ
	|	НестрогоеСоответствие.НомерСтроки ЕСТЬ NULL
	|	И СрезПоследних.НомерСтроки ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	РезультатПодбора = РезультатЗапроса.Выгрузить();

	Возврат РезультатПодбора;
	
КонецФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли