////////////////////////////////////////////////////////////////////////////////
// Модуль содержит процедуры/функции механизма делопроизводства доступные как на клиенте так и на сервере.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция АвтоНаименованиеВнутреннегоДокумента(ПараметрыДокумента) Экспорт
	
	Наименование = Строка(ПараметрыДокумента.ВидДокумента);
	Если НЕ ПустаяСтрока(ПараметрыДокумента.Номер) Тогда
		ШаболонНаименования = "%1 № %2"; 
		Наименование        = СтрШаблон(ШаболонНаименования, Наименование, ПараметрыДокумента.Номер);
	КонецЕсли;
	Если ПараметрыДокумента.Дата <> '00010101' Тогда
		ШаболонНаименования = НСтр("ru='%1 от %2';
							  		|en='%1 from %2'"); 
		Наименование        = СтрШаблон(ШаболонНаименования, Наименование, ПараметрыДокумента.Дата);
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

#КонецОбласти
