
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаКомандаВидимостьАлгоритма.Пометка = ВидимостьАлгоритма;	
	УстановитьВидимостьАлгоритма(ВидимостьАлгоритма);
	
	Элементы.ФормаКомандаЗавершенные.Пометка = ЭтотОбъект.Завершенные;	
	УстановитьОтбор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗакрытиеЗадачиОповещение(Результат, ДополнительныеПараметры)  Экспорт
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;				
	ДействияПриЗакрытииФормыЗадачи(ТекущаяСтрока);
	
КонецПроцедуры // ОткрытиеФормыЗадачиОповещение()

&НаКлиенте
Процедура ГрафическаяСхемаВыбор(Элемент)
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли; 
	
	Если Элементы.ГрафическаяСхема.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	КодТочки = Элементы.ГрафическаяСхема.ТекущийЭлемент.Имя;
	СтрокаТаблицыТочек = Неопределено;
	
	// Выполняем сканирование, что бы избежать серверного вызова при поиске в таблице.
	Для каждого СтрокаТаблицы Из ТаблицаТочкиВизы Цикл
		Если СтрокаТаблицы.КодТочки = КодТочки Тогда
			СтрокаТаблицыТочек = СтрокаТаблицы;
			Прервать;		
		КонецЕсли;
	КонецЦикла; 
	
	Если СтрокаТаблицыТочек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ (СтрокаТаблицыТочек.ВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.Действие")
		ИЛИ СтрокаТаблицыТочек.ВидТочки = ПредопределенноеЗначение("Перечисление.бит_ВидыТочекАлгоритмов.ПодчиненныйПроцесс"))Тогда
		Возврат;	 
	КонецЕсли;

	Если ЗначениеЗаполнено(СтрокаТаблицыТочек.Задача) Тогда
		Оповещение = Новый ОписаниеОповещения("ЗакрытиеЗадачиОповещение", ЭтотОбъект);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", СтрокаТаблицыТочек.Задача);
		ОткрытьФорму("Задача.бит_Задача.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,,,,Оповещение, 
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ВидимостьАлгоритма Тогда
		
		ОтключитьОбработчикОжидания("ОжиданиеАктивизацииСтроки");
		ПодключитьОбработчикОжидания("ОжиданиеАктивизацииСтроки", 0.1, Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОткрытьИсториюИзменения(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Задача", ТекущаяСтрока.Ссылка);
		ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.Форма.ФормаИсторияСостоянийЗадач",ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВидимостьАлгоритма(Команда)
	
	Элементы.ФормаКомандаВидимостьАлгоритма.Пометка = НЕ Элементы.ФормаКомандаВидимостьАлгоритма.Пометка;
	ВидимостьАлгоритма = Элементы.ФормаКомандаВидимостьАлгоритма.Пометка;
	
	УстановитьВидимостьАлгоритма(ВидимостьАлгоритма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОстановить(Команда)
	
	МассивВыделенных = Элементы.Список.ВыделенныеСтроки;
	флВыполнено = ОстановитьВозобновитьПроцесс(МассивВыделенных, "Остановить");
	
	Если флВыполнено Тогда
		
		ОповеститьОбИзменении(Тип("БизнесПроцессСсылка.бит_Процесс"));
		ОповеститьОбИзменении(Тип("ЗадачаСсылка.бит_Задача"));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	МассивВыделенных = Элементы.Список.ВыделенныеСтроки;
	флВыполнено = ОстановитьВозобновитьПроцесс(МассивВыделенных, "Возобновить");
	
	Если флВыполнено Тогда
		
		ОповеститьОбИзменении(Тип("БизнесПроцессСсылка.бит_Процесс"));
		ОповеститьОбИзменении(Тип("ЗадачаСсылка.бит_Задача"));		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;	
	Если ТекущаяСтрока <> Неопределено Тогда	
		СтрПар = Новый Структура("Алгоритм, Ссылка", ТекущаяСтрока.Алгоритм, ТекущаяСтрока.Ссылка);		
	Иначе		
		СтрПар = Неопределено;	
	КонецЕсли; 
	
	ОбновитьВсе(СтрПар);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтчетСтатусПроцесса(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ОткрытьФорму("Отчет.бит_ОтчетСтатусПроцесса.Форма",, ЭтотОбъект);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Процесс", ТекущаяСтрока.Ссылка);
		Оповестить("ПередачаПараметровОтчетуСтатусаПроцесса", ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерезапустить(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Процесс" , ТекущаяСтрока.Ссылка);
		ПараметрыФормы.Вставить("Действие", "ПерезапускПроцесса");
		
		ОткрытьФорму("БизнесПроцесс.бит_Процесс.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗавершенные(Команда)
	
  Завершенные = НЕ Завершенные;
  Элементы.ФормаКомандаЗавершенные.Пометка = Завершенные;
  УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбзорСхемы(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;	

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура; 
	ПараметрыФормы.Вставить("ГрафическаяСхема", ГрафическаяСхема);
	
	ОткрытьФорму("Справочник.бит_АлгоритмыПроцессов.Форма.ОбзорСхемы", ПараметрыФормы, 
		ЭтотОбъект, ТекущаяСтрока.Ссылка);
		
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - обработчик ожидания активизации строки списка. 
// 
&НаКлиенте
Процедура ОжиданиеАктивизацииСтроки()

	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ДействияПриАктивизацииСтроки(ТекущаяСтрока.Алгоритм, ТекущаяСтрока.Ссылка);
	КонецЕсли; 
  
КонецПроцедуры // ОжиданиеАктивизацииСтроки() 

// Процедура устанавливает отбор списка.
// 
&НаКлиенте
Процедура УстановитьОтбор()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Завершен", Завершенные, 
		ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Завершенные)); 
	
КонецПроцедуры

// Процедура устанавливает видимость табличного поля со схемой алгоритма.
// 
// Параметры:
//  ВидимостьАлгоритма - Булево.
// 
&НаКлиенте
Процедура УстановитьВидимостьАлгоритма(ВидимостьАлгоритма)
	
	# Если НЕ ВебКлиент Тогда
		Элементы.ГруппаАлгоритм.Видимость = ВидимостьАлгоритма;
	# КонецЕсли
	
	# Если ВебКлиент Тогда
		Элементы.ГруппаАлгоритм.Видимость = Ложь;
	# КонецЕсли
	
КонецПроцедуры // УстановитьВидимостьАлгоритма()

// Процедура выполняет на сервере действия, необходимые при активизации строки списка. 
// 
// Параметры:
//  Алгоритм - СправочникСсылка.бит_АлгоритмыПроцессов.
//  Процесс  - БизнесПроцессСсылка.бит_Процесс.
// 
&НаСервере
Процедура ДействияПриАктивизацииСтроки(Алгоритм, Процесс, СохранятьНастройку=Ложь)

	Если ВидимостьАлгоритма Тогда
		
		Если НЕ ЗначениеЗаполнено(Алгоритм) Тогда
			ГрафическаяСхема = Новый ГрафическаяСхема;
		Иначе
			
			Если СохранятьНастройку Тогда
				ХранилищеОбщихНастроек.Сохранить(Метаданные.БизнесПроцессы.бит_Процесс.ПолноеИмя() 
					,"ПоказыватьСрокиИсполненияЗадач" 
					,ПоказыватьСрокиИсполненияЗадач);
			Иначе
				ПоказыватьСрокиИсполненияЗадач = ХранилищеОбщихНастроек.Загрузить(Метаданные.БизнесПроцессы.бит_Процесс.ПолноеИмя() 
					,"ПоказыватьСрокиИсполненияЗадач");
			КонецЕсли; 
			
			ТаблицаЗадач = БизнесПроцессы.бит_Процесс.ПолучитьЗадачиПроцесса(Процесс);
			ТаблицаТочек = бит_УправлениеПроцессами.ОписаниеТочекАлгоритма(Алгоритм,, ТаблицаЗадач);
			ТаблицаТочкиВизы.Загрузить(ТаблицаТочек);
			
			ГрафическаяСхема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Алгоритм, "КартаМаршрута").Получить();
			Для каждого СтрокаТаблицы Из ТаблицаТочкиВизы Цикл
				Если СтрокаТаблицы.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.Действие
					ИЛИ СтрокаТаблицы.ВидТочки = Перечисления.бит_ВидыТочекАлгоритмов.ПодчиненныйПроцесс Тогда
					ВыделитьЭлементСхемы(СтрокаТаблицы);
					ПоказатьСрокиИсполненияЗадач(СтрокаТаблицы);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ВыделитьЭлементСхемы(ПараметрыТочки)
	
	Активные = Новый Массив(); 
	Активные.Добавить(Справочники.бит_СтатусыОбъектов.Задача_Создана);
	Активные.Добавить(Справочники.бит_СтатусыОбъектов.Задача_Просрочена);
	Активные.Добавить(Справочники.бит_СтатусыОбъектов.Задача_Принята);
	
	Выполненные = Новый Массив(); 
	Выполненные.Добавить(Справочники.бит_СтатусыОбъектов.Задача_Выполнена);
	Выполненные.Добавить(Справочники.бит_СтатусыОбъектов.Задача_Отменена);
	
	Ожидание = Новый Массив();
	Ожидание.Добавить(Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
	Ожидание.Добавить(Справочники.бит_СтатусыОбъектов.Задача_Остановлена);
	
	Если Активные.Найти(ПараметрыТочки.Состояние) <> Неопределено Тогда
		ВариантОформления = "2";
	ИначеЕсли Выполненные.Найти(ПараметрыТочки.Состояние) <> Неопределено Тогда
		ВариантОформления = "1";
	Иначе
		ВариантОформления = "0";
	КонецЕсли;
	
	бит_УправлениеПроцессами.ВыделитьЭлемент(ГрафическаяСхема, 
		ПараметрыТочки.ИдентификаторТочки, ВариантОформления);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСрокиИсполненияЗадач(ПараметрыТочки)

	Если НЕ ПоказыватьСрокиИсполненияЗадач Тогда
		Возврат;		
	КонецЕсли; 

	ДокументDOM = бит_УправлениеПроцессами.ГрафическаяСхемаВDOM(ГрафическаяСхема);
	
	ИдентификаторТочки = Строка(ПараметрыТочки.ИдентификаторТочки);
	УзелТочкиМаршрута  = бит_УправлениеПроцессами.ЭлементПоЗначениюСвойства(ДокументDOM, "itemId", ИдентификаторТочки);
	
	Если УзелТочкиМаршрута = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	Содержание = бит_УправлениеПроцессами.ЗначениеСвойстваЭлемента(УзелТочкиМаршрута, "content");
	Содержание = Содержание + Символы.ПС + НСтр("ru = 'до'") + " "
			+ Формат(ПараметрыТочки.ДатаОкончания, НСтр("ru = 'ДФ='dd.MM.yyyy HH:mm'; ДП=<неограничено>'"));
	бит_УправлениеПроцессами.УстановитьЗначениеСвойстваЭлемента(УзелТочкиМаршрута, "content", Содержание);
	
	ГрафическаяСхема = бит_УправлениеПроцессами.ГрафическаяСхемаИзDOM(ДокументDOM);
	
КонецПроцедуры

// Процедура обрабатывет закрытие формы задачи. 
// 
// Параметры:
//  ТекущаяСтрока - ДанныеФормыСтруктура.
// 
&НаСервере
Процедура ДействияПриЗакрытииФормыЗадачи(ТекущаяСтрока)
	
	Если ТекущаяСтрока <> Неопределено Тогда		
		ДействияПриАктивизацииСтроки(ТекущаяСтрока.Алгоритм, ТекущаяСтрока.Ссылка);		
	КонецЕсли; 
	Элементы.Список.Обновить();
	
КонецПроцедуры // ДействияПриЗакрытииФормыЗадачи() 

// Процедура выполняет остановку или продолжение выполнения процесса после остановки. 
// 
// Параметры:
//  Процессы - Массив.
//  Режим    - Строка.
// 
&НаСервере
Функция ОстановитьВозобновитьПроцесс(Процессы, Режим)
	
	ВыполненоДействие = Ложь;
	
	Для каждого ТекПроцесс Из Процессы Цикл
		
		Если ТекПроцесс.Состояние = Справочники.бит_СтатусыОбъектов.Процесс_Активный И Режим = "Остановить" Тогда
			ВыполненоДействие = БизнесПроцессы.бит_Процесс.ОстановитьПроцесс(ТекПроцесс, "Ошибки");
		ИначеЕсли ТекПроцесс.Состояние = Справочники.бит_СтатусыОбъектов.Процесс_Остановлен И Режим = "Возобновить" Тогда	
			ВыполненоДействие = БизнесПроцессы.бит_Процесс.ПродолжитьПроцесс(ТекПроцесс);
		Иначе
			ВыполненоДействие = Ложь;
		КонецЕсли; 
		
		// Если удалось выполнить хотя бы для одного процесса - нужно обновить динамические списки.
		
	КонецЦикла; 	
	
	Возврат ВыполненоДействие;
	
КонецФункции // ОстановитьВозобновитьПроцесс()

// Процедура обновляет алгоритм и список процессов.
// 
// Параметры:
//  Структура.
// 
&НаСервере
Процедура ОбновитьВсе(СтрПар)
	
	Если СтрПар <> Неопределено Тогда		
		ДействияПриАктивизацииСтроки(СтрПар.Алгоритм, СтрПар.Ссылка);		
	КонецЕсли; 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСрокиИсполненияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ДействияПриАктивизацииСтроки(ТекущаяСтрока.Алгоритм, ТекущаяСтрока.Ссылка, Истина);
	КонецЕсли; 
   
КонецПроцедуры

#КонецОбласти
