
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	Если фОтказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		Элементы.Сценарий.ТолькоПросмотр = Истина;	
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ВладелецФормы <> Неопределено И ЭтотОбъект.ВладелецФормы.Имя = "СписокНастройкаКонтроляПоСценариям" Тогда
		Элементы.Сценарий.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНастроитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала 	= Запись.Период;
	Диалог.Период.ДатаОкончания = Запись.ДатаОкончания;
	Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры // КомандаНастроитьПериод()

// Процедура обработчик оповещения "ВыборПериодаЗавершение".
//
// Параметры:
// Период 				- СтандартныйПериод.
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура ВыборПериодаЗавершение(Период, ДополнительныеДанные) Экспорт

	Если Период <> Неопределено Тогда
	
		Запись.Период    	 = Период.ДатаНачала;
		Запись.ДатаОкончания = Период.ДатаОкончания;
				
	КонецЕсли; 
	
КонецПроцедуры	// ВыборПериодаЗавершение

#КонецОбласти

