#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура формирует движения по регистру бит_кзн_ПланируемыйРасходДенежныхСредствАналитика. 
//
// Параметры:
//  Движения - ДвиженияДокумента
//  ТаблицаДанные - ТаблицаЗначений
//  Отказ - Булево
//
Процедура ОтразитьДвижения(Движения, ТаблицаДанные, Отказ) Экспорт

	Если Отказ ИЛИ ТаблицаДанные.Количество() = 0 Тогда
	
		 Возврат;
	
	КонецЕсли; 
	
	// Движения по регистру обороты по бюджетам
	ТаблицаДвижений = Движения.бит_кзн_ПланируемыйРасходДенежныхСредствАналитика.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанные Цикл
		
		НоваяСтрока = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла; 
	
	Движения.бит_кзн_ПланируемыйРасходДенежныхСредствАналитика.Записывать = Истина;
	Движения.бит_кзн_ПланируемыйРасходДенежныхСредствАналитика.мТаблицаДвижений = ТаблицаДвижений;
	Движения.бит_кзн_ПланируемыйРасходДенежныхСредствАналитика.ДобавитьДвижение();

КонецПроцедуры // ОтразитьДвижения()

#КонецЕсли
