
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнитьПоУмолчанию(Команда)
	
	Оповещение = Новый ОписаниеОповещения("КомандаЗаполнитьПоУмолчаниюВопросЗавершение", ЭтотОбъект);
	ТекстСообщения = НСтр("ru='Заполнить перечень хозяйственных операций по-умолчанию?';
						 |en='Fill in the list of default of transactions?'");
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоУмолчаниюВопросЗавершение(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет перечень хоз. операций по-умолчанию.
//
&НаСервереБезКонтекста 
Процедура ЗаполнитьПоУмолчанию()


КонецПроцедуры

#КонецОбласти
