
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
	бит_НастройкиДоступностиЭлементовФорм.ПриСозданииНаСервере(ЭтотОбъект, СтандартнаяОбработка, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
			
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьФормуНаСервере(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("Статус") Тогда
			ОбработкаОповещенияИзмененияСтатуса();
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если бит_НастройкиДоступностиЭлементовФормКлиентСервер.ФормаПодготовлена(ЭтотОбъект) Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	Открытьформу("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОбъектаПриИзменении(Элемент)
	УстановитьТипПредмета();
КонецПроцедуры

&НаКлиенте
Процедура ПредметОчистка(Элемент, СтандартнаяОбработка)
	
	УстановитьТипПредмета();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	КомандаВыполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыполнитьНаСервере()
	
	ТекущийОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_мдм_ЗаявкаНаУдаление"));
	ТекущийОбъект.ИсполнитьЗаявку();
	
	бит_ВизированиеСервер.ЗаполнитьРеквизитыСтатусаВФорме(ЭтотОбъект, ТекущийОбъект);
	
	ЗначениеВДанныеФормы(ТекущийОбъект, Объект);
	
	УправлениеЭлементамиФормы();	
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемы

#КонецОбласти  

// Процедура управляет видимостью/доступностью элементов формы. 
// 
&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	бит_НастройкиДоступностиЭлементовФорм.РазблокироватьЭлементы(ЭтотОбъект);
	
	ЭтоАдмин = бит_мдм.ЭтоАдминистраторМДМ();
	
	Утверждена = (ТипСтатуса = Перечисления.бит_ТипыСтатусовОбъектов.Утвержден);
	Элементы.ФормаКомандаВыполнить.Доступность = Утверждена И ЭтоАдмин;
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаблокироватьЭлементы(ЭтотОбъект);
	
КонецПроцедуры

// Процедура устанавливает тип реквизита Предмет в зависимости от выбранного описания объекта. 
// 
&НаСервере
Процедура УстановитьТипПредмета()
	
	Если ЗначениеЗаполнено(Объект.ОписаниеОбъекта) Тогда
		
		Если НЕ Метаданные.Справочники.Найти(Объект.ОписаниеОбъекта.Имя) = Неопределено Тогда
			ИмяТипа = "СправочникСсылка."+Объект.ОписаниеОбъекта.Имя;
		Иначе	
			ИмяТаблицы = бит_мдм.ИмяОбъектаХранения(Объект.ОписаниеОбъекта);			
			ИмяТипа = "СправочникСсылка."+ИмяТаблицы;
		КонецЕсли; 
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип(ИмяТипа));
		
		Описание = Новый ОписаниеТипов(МассивТипов);
		Объект.Предмет = Описание.ПривестиЗначение(Объект.Предмет);
		
	Иначе	
		
		Объект.Предмет = Неопределено;
		
	КонецЕсли; 
	
	
КонецПроцедуры  // УстановитьТипПредмета()

&НаСервере
Процедура ПодготовитьФормуНаСервере(СтандартнаяОбработка = Ложь)

	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

#КонецОбласти
