#Область ПрограммныйИнтерфейс

Процедура НайтиСсылки(Параметры, АдресРезультата) Экспорт

	ПоискИЗаменаСсылок = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "ПоискИЗаменаСсылок", Ложь);
	
	// Поиск ссылок обработка
	НайденныеСсылки = МестаИспользования(Параметры.Ссылки);
	
	// Подготовка начального представления
	НачальноеПредставление = Новый ДеревоЗначений;
	НачальноеПредставление.Колонки.Добавить("Картинка", ИТК_ТипыКлиентСервер.ОписаниеКартинка());
	НачальноеПредставление.Колонки.Добавить("Представление", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	НачальноеПредставление.Колонки.Добавить("Порядок", ИТК_ТипыКлиентСервер.ОписаниеЧисло(10));
	НачальноеПредставление.Колонки.Добавить("Данные");
	НачальноеПредставление.Колонки.Добавить("Метаданные", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	
	Если ПоискИЗаменаСсылок Тогда
		
		НачальноеПредставление.Колонки.Добавить("Пометка", ИТК_ТипыКлиентСервер.ОписаниеЧисло(1));
		НачальноеПредставление.Колонки.Добавить("Ссылка");
		НачальноеПредставление.Колонки.Добавить("ДоступенОтбор", ИТК_ТипыКлиентСервер.ОписаниеБулево());
		НачальноеПредставление.Колонки.Добавить("КартинкаОтбора", ИТК_ТипыКлиентСервер.ОписаниеКартинка());
		НачальноеПредставление.Колонки.Добавить("ПредставлениеОтбора", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
		
		Если ЗначениеЗаполнено(НайденныеСсылки) Тогда
			
			// Создание корневой строки Все (для отборов)
			Представление = НСтр("ru = 'Все';
								|en = 'All'");
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ПолноеИмяМетаданных", Представление);
			КорневаяСтрока = ДобавитьСтрокуВНайденныеСсылки(НачальноеПредставление, Представление, ПоискИЗаменаСсылок, ДополнительныеПараметры);
			
		КонецЕсли;
		
	Иначе
		
		КорневаяСтрока = НачальноеПредставление;
		
	КонецЕсли;
	
	МестаИспользованияСтруктура = МестаИспользованияСтруктура();

	// Добавление строк (создание структуры)
	СтрокиКоллекцииМетаданных = Новый Соответствие;
	СтрокиОбъектовМетаданных = Новый Соответствие;
	Для Каждого НайденнаяСсылка Из НайденныеСсылки Цикл 
		
		ИмяОбъектаМетаданных = НайденнаяСсылка[МестаИспользованияСтруктура.ПолеМетаданные];
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяОбъектаМетаданных);
		ИмяОбъектаКоллекции = ИТК_Метаданные.ИмяОбъектаКоллекции(ИмяОбъектаМетаданных);
		
		// Добавление строки коллекции метаданных Справочники, Документы...
		СтрокаКоллекцияМетаданных = СтрокиКоллекцииМетаданных.Получить(ИмяОбъектаКоллекции);
		Если СтрокаКоллекцияМетаданных = Неопределено Тогда
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Картинка", ИТК_ОбщийПовтИсп.КартинкаБиблиотеки(ИмяОбъектаКоллекции));
			ДополнительныеПараметры.Вставить("Порядок", ИТК_МетаданныеКлиентСерверПовтИсп.ПорядокОбъектаКоллекции(ИмяОбъектаКоллекции));
			ДополнительныеПараметры.Вставить("ПолноеИмяМетаданных", ИмяОбъектаКоллекции);
			СтрокаКоллекцияМетаданных = ДобавитьСтрокуВНайденныеСсылки(КорневаяСтрока, ИмяОбъектаКоллекции, ПоискИЗаменаСсылок, ДополнительныеПараметры);
			
			СтрокиКоллекцииМетаданных.Вставить(ИмяОбъектаКоллекции, СтрокаКоллекцияМетаданных);
			
		КонецЕсли;
		
		// Добавление строки объект метаданных
		СтрокаОбъектМетаданных = СтрокиОбъектовМетаданных.Получить(ИмяОбъектаМетаданных);
		Если СтрокаОбъектМетаданных = Неопределено Тогда
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Картинка", СтрокаКоллекцияМетаданных.Картинка);
			ДополнительныеПараметры.Вставить("ПолноеИмяМетаданных", ИмяОбъектаМетаданных);
			ДополнительныеПараметры.Вставить("Метаданные", ОбъектМетаданных);
			СтрокаОбъектМетаданных = ДобавитьСтрокуВНайденныеСсылки(СтрокаКоллекцияМетаданных, ОбъектМетаданных.Представление(), ПоискИЗаменаСсылок, ДополнительныеПараметры);
			СтрокиОбъектовМетаданных.Вставить(ИмяОбъектаМетаданных, СтрокаОбъектМетаданных);
			
			// Добавим пустую строку для разворачивания динамически
			Если ПоискИЗаменаСсылок Тогда
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ДоступенОтбор", Ложь);
				ДополнительныеПараметры.Вставить("Пометка", СтрокаОбъектМетаданных.Пометка);
				
			Иначе
				
				ДополнительныеПараметры = Неопределено;
				
			КонецЕсли;
			ДобавитьСтрокуВНайденныеСсылки(СтрокаОбъектМетаданных, "", ПоискИЗаменаСсылок, ДополнительныеПараметры);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Сортировка данных
	Для Каждого СтрокаКоллекцииМетаданных Из НачальноеПредставление.Строки Цикл 
		СтрокаКоллекцииМетаданных.Строки.Сортировать("Представление");
	КонецЦикла;
	
	НачальноеПредставление.Строки.Сортировать("Порядок", Истина);
	НачальноеПредставление.Колонки.Удалить("Порядок");
	
	// Заполнени количества в представлении
	ЗаполнитьКоличествоВПредставлении(НачальноеПредставление, НайденныеСсылки);
	
	Если ПоискИЗаменаСсылок Тогда
		
		// Определение пометок
		Для Каждого Строка Из НачальноеПредставление.Строки Цикл 
			
			Строка.Пометка = ИТК_ОбщийКлиентСервер.ПометкаДереваЗначений(Строка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Возврат результата
	Результат = Новый Структура;
	Результат.Вставить("НайденныеСсылки", НайденныеСсылки);
	Результат.Вставить("НачальноеПредставление", НачальноеПредставление);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Процедура НайденныеСсылкиРазвернутьСтроку(Форма, Идентификатор, ПоискИЗаменаСсылок = Ложь) Экспорт
	
	РазворачиваемаяСтрока = Форма["НайденныеСсылки"].НайтиПоИдентификатору(Идентификатор);
	
	Результат = ПолучитьИзВременногоХранилища(Форма["НайденныеСсылкиАдресРезультата"]);
	ТаблицаНайденныхСсылок = Результат.НайденныеСсылки;
	
	РазвернутьСтроку(РазворачиваемаяСтрока, ТаблицаНайденныхСсылок, ПоискИЗаменаСсылок);
	
КонецПроцедуры

Функция ДобавитьСтрокуВНайденныеСсылки(Родитель, Представление, ПоискИЗаменаСсылок, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	ЭтоКоллекцияФормы = (ТипЗнч(Родитель) = Тип("ДанныеФормыЭлементДерева"));
	
	Если ЭтоКоллекцияФормы Тогда
		Коллекция = Родитель.ПолучитьЭлементы();
	Иначе 
		Коллекция = Родитель.Строки;
	КонецЕсли;
	
	НоваяСтрока = Коллекция.Добавить();
	
	Картинка = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "Картинка");
	Порядок = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "Порядок");
	Данные = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "Данные");
	ОбъектМетаданных = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "Метаданные");
	ПолноеИмяМетаданных = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "ПолноеИмяМетаданных");
	
	Если ПоискИЗаменаСсылок Тогда
		
		Ссылка = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "Ссылка");
		
		Если ЭтоКоллекцияФормы Тогда
			
			Пометка = Родитель.Пометка;
			
		Иначе 
			
			ИсключенияЗаменыСсылок = ИТК_БСППовтИсп.ИсключенияЗаменыСсылок();
			Пометка = ИсключенияЗаменыСсылок.Получить(ОбъектМетаданных) <> "*";
			
		КонецЕсли;
		
		НоваяСтрока.Пометка = ИТК_ОбщийКлиентСервер.Свойство(ДополнительныеПараметры, "Пометка", Пометка);
		НоваяСтрока.Ссылка = Ссылка;
		
		ДоступенОтбор = Не ЗначениеЗаполнено(Ссылка);
		НоваяСтрока.ДоступенОтбор = ДоступенОтбор;
		Если ДоступенОтбор Тогда
			НоваяСтрока.КартинкаОтбора = БиблиотекаКартинок.ОтборКомпоновкиДанныхНедоступный;
		КонецЕсли;
	
	КонецЕсли;
	
	НоваяСтрока.Представление = Представление;
	
	Если Картинка <> Неопределено Тогда
		НоваяСтрока.Картинка = Картинка;
	КонецЕсли;
	
	Если Порядок <> Неопределено Тогда
		НоваяСтрока.Порядок = Порядок;
	КонецЕсли;
	
	НоваяСтрока.Данные = Данные;
	НоваяСтрока.Метаданные = ПолноеИмяМетаданных;
	
	Возврат НоваяСтрока;
	
КонецФункции

Процедура ПодключитьКоманды(Форма, ПоискИЗаменаСсылок = Ложь) Экспорт
	
	Имя = "НайденныеСсылки";
	ЭлементНайденныеСсылки = Форма.Элементы[Имя];
	ИмяДействия = "ПодключаемаяКоманда";
	
	// Открыть ссылку
	ИмяКоманды = Имя + "_ОткрытьСсылку";
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Картинка", БиблиотекаКартинок.ПоказатьДанные);
	ИТК_Форма.ДобавитьКоманду(Форма, ИмяКоманды, ИмяДействия, НСтр("ru = 'Открыть...';
																	|en = 'Open...'"), ПараметрыКоманды);
	
	Поля = Новый Структура("ИмяКоманды", ИмяКоманды);
	ИТК_Форма.ДобавитьЭлемент(Форма, ИТК_ПодключаемыеКомандыКлиентСервер.ОткрытьСсылкуИмяЭлемента(Имя), "Кнопка", Поля, ЭлементНайденныеСсылки.КонтекстноеМеню);
	
	ИТК_ПодключаемыеКоманды.ИнструментыКТаблицеЗначений(Форма, Имя);
	
	// Группа кнопок Свернуть/Развернуть ---------------------------------------------------------------------------------------------------------
	Поля = Новый Структура;
	Поля.Вставить("Отображение", ОтображениеГруппыКнопок.Компактное);
	ГруппаСвернутьРазвернуть = ИТК_Форма.ДобавитьЭлемент(Форма, Имя + "КоманднаяПанельГруппаСвернутьРазвернуть", "Группа", Поля, ЭлементНайденныеСсылки.КоманднаяПанель);
	
	// Свернуть все
	ИмяКоманды = Имя + "_СвернутьВсе";
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Картинка", БиблиотекаКартинок.СвернутьВсе);
	ПараметрыКоманды.Вставить("СочетаниеКлавиш", Новый СочетаниеКлавиш(Клавиша.NumAdd, , Истина, Истина));
	ИТК_Форма.ДобавитьКоманду(Форма, ИмяКоманды, ИмяДействия, НСтр("ru = 'Свернуть все';
																	|en = 'Collapse all'"), ПараметрыКоманды);
	
	Поля = Новый Структура("ИмяКоманды", ИмяКоманды);
	ИТК_Форма.ДобавитьЭлемент(Форма, Имя + "КоманднаяПанельСвернутьВсе", "Кнопка", Поля, ГруппаСвернутьРазвернуть);
	
	// Развернуть все
	ИмяКоманды = Имя + "_РазвернутьВсе";
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Картинка", БиблиотекаКартинок.РазвернутьВсе);
	ПараметрыКоманды.Вставить("СочетаниеКлавиш", Новый СочетаниеКлавиш(Клавиша.NumSubtract, , Истина, Истина));
	ИТК_Форма.ДобавитьКоманду(Форма, ИмяКоманды, ИмяДействия, НСтр("ru = 'Развернуть все';
																	|en = 'Expand all'"), ПараметрыКоманды);
	
	Поля = Новый Структура("ИмяКоманды", ИмяКоманды);
	ИТК_Форма.ДобавитьЭлемент(Форма, Имя + "КоманднаяПанельРазвернутьВсе", "Кнопка", Поля, ГруппаСвернутьРазвернуть);
	
КонецПроцедуры

Процедура ОбновитьНайденныеСсылки(Форма, АдресРезультата, ПоискИЗаменаСсылок = Ложь) Экспорт
	
	Форма.НайденныеСсылкиАдресРезультата = АдресРезультата;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ТаблицаНайденныхСсылок = Результат.НайденныеСсылки;
	Если ЗначениеЗаполнено(ТаблицаНайденныхСсылок) Тогда
		
		КоличествоНайденныхСсылок = ТаблицаНайденныхСсылок.Количество();
		
		Если КоличествоНайденныхСсылок <= ИТК_ПоискСсылокНаОбъектКлиентСервер.КоличествоСсылокОтображаемыхРазвернутыми() Тогда
			
			РазвернутьВсе(Форма, ПоискИЗаменаСсылок);

		КонецЕсли;
		
	Иначе
		
		КоличествоНайденныхСсылок = НСтр("ru = 'отсутствуют';
										|en = 'not'");
		
	КонецЕсли;
	
	Форма.КоличествоНайденныхСсылок = КоличествоНайденныхСсылок;
	Форма.ЗначениеВРеквизитФормы(Результат.НачальноеПредставление, "НайденныеСсылки");
	
КонецПроцедуры

Процедура РазвернутьВсе(Форма, ПоискИЗаменаСсылок = Ложь) Экспорт
	
	Имя = "НайденныеСсылки";
	Коллекция = Форма[Имя];
	
	НайденныеСсылкиАдресРезультата = Форма["НайденныеСсылкиАдресРезультата"];
	
	Если ЭтоАдресВременногоХранилища(НайденныеСсылкиАдресРезультата) Тогда
		
		Результат = ПолучитьИзВременногоХранилища(НайденныеСсылкиАдресРезультата);
		ТаблицаНайденныхСсылок = Результат.НайденныеСсылки;
		
		РазвернутьКоллекцию(Коллекция, ТаблицаНайденныхСсылок, ПоискИЗаменаСсылок);
		
	КонецЕсли;
	
КонецПроцедуры

Функция МестаИспользования(Ссылки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = НайтиПоСсылкам(Ссылки);
	УстановитьПривилегированныйРежим(Ложь);
	
	МестаИспользованияСтруктура = МестаИспользованияСтруктура();
	Результат.Колонки.Добавить("ПредставлениеДанных", Новый ОписаниеТипов("Строка"));
	
	УдаляемыеСтроки = Новый Массив;
	Для Каждого МестоИспользования Из Результат Цикл
		
		Данные = МестоИспользования[МестаИспользованияСтруктура.ПолеДанные];
		ОбъектМетаданных = МестоИспользования[МестаИспользованияСтруктура.ПолеМетаданные];
		ПолноеИмябъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
		ИмяОбъектаКоллекцииМетаданных = ИТК_Метаданные.ИмяОбъектаКоллекции(ПолноеИмябъектаМетаданных);
		
		Если Данные = МестоИспользования[МестаИспользованияСтруктура.ПолеСсылка] Тогда
			
			УдаляемыеСтроки.Добавить(МестоИспользования);
			Продолжить;
			
		КонецЕсли;
		
		Если ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоРегистрСведений(ИмяОбъектаКоллекцииМетаданных) Тогда
			
			Представление = ОбъектМетаданных.Представление();
			
			ОписаниеИзмерений = ИТК_ОбщийПовтИсп.ОписаниеИзмеренийНабораЗаписейРегистраСведений(ОбъектМетаданных.Имя);
			
			ЗначенияИзмерений = Новый Массив;
			Для Каждого ОписаниеИзмерения Из ОписаниеИзмерений Цикл 
				
				Если ТипЗнч(ОписаниеИзмерения) = Тип("Строка") Тогда
					
					Ключ = ОписаниеИзмерения;
					Значение = Данные[Ключ];
					
				Иначе
					
					Ключ = ОписаниеИзмерения.Ключ;
					Значение = Формат(Данные[Ключ], ОписаниеИзмерения.Формат);
					
				КонецЕсли;
				
				ЗначенияИзмерений.Добавить(СтрШаблон("%1 ""%2""", Ключ, Значение));
				
			КонецЦикла;
			
			ПредставлениеИзмерений = СтрСоединить(ЗначенияИзмерений, ", ");
			ПредставлениеИзмерений = ИТК_Строки.Сократить(ПредставлениеИзмерений, 200);
			Если ЗначениеЗаполнено(ПредставлениеИзмерений) Тогда
				
				Представление = СтрШаблон("%1 (%2)", Представление, ПредставлениеИзмерений);
				
			КонецЕсли;
			
		Иначе
			
			Представление = Строка(Данные);
			
		КонецЕсли;
		
		МестоИспользования.ПредставлениеДанных = Представление;
		
	КонецЦикла;
	
	// Дополнительная подготовка данных
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл 
		Результат.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	Результат.Сортировать(МестаИспользованияСтруктура.ПолеДанные);
	
	Для Каждого НайденнаяСсылка Из Результат Цикл  
		
		НайденнаяСсылка[МестаИспользованияСтруктура.ПолеМетаданные] = НайденнаяСсылка[МестаИспользованияСтруктура.ПолеМетаданные].ПолноеИмя();
		
	КонецЦикла;
	
	Результат.Индексы.Добавить(МестаИспользованияСтруктура.ПолеСсылка);
	Результат.Индексы.Добавить(МестаИспользованияСтруктура.ПолеМетаданные);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МестаИспользованияСтруктура()
	
	ПолеСсылка = "Ссылка";
	ПолеДанные = "Данные";
	ПолеМетаданные = "Метаданные";
	Если ИТК_ОбщийПовтИсп.ВариантВстроенногоЯзыкаАнглийский() Тогда
		
		ПолеСсылка = "Ref";
		ПолеДанные = "Data";
		ПолеМетаданные = "Metadata";
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПолеСсылка", ПолеСсылка);
	Результат.Вставить("ПолеДанные", ПолеДанные);
	Результат.Вставить("ПолеМетаданные", ПолеМетаданные);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьКоличествоВПредставлении(Строка, НайденныеСсылки)
	
	МестаИспользованияСтруктура = МестаИспользованияСтруктура();
	
	Результат = 0;
	Для Каждого ПодчиненнаяСтрока Из Строка.Строки Цикл 
		
		Если ЗначениеЗаполнено(ПодчиненнаяСтрока.Строки) Тогда
			
			Если ИТК_МетаданныеКлиентСервер.ЭтоПолноеИмяОбъекта(ПодчиненнаяСтрока.Метаданные) Тогда
				
				НайденныеСтроки = НайденныеСсылки.НайтиСтроки(Новый Структура(МестаИспользованияСтруктура.ПолеМетаданные, ПодчиненнаяСтрока.Метаданные));
				Количество = НайденныеСтроки.Количество();
				
			Иначе
				
				Количество = ЗаполнитьКоличествоВПредставлении(ПодчиненнаяСтрока, НайденныеСсылки);
				
			КонецЕсли;
			
			ПодчиненнаяСтрока.Представление = ПредставлениеКоллекции(ПодчиненнаяСтрока, Количество);
			
		КонецЕсли;
		
		Результат = Результат + 1;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеКоллекции(Строка, Количество)
	
	Результат = Строка.Представление;
	Если ЗначениеЗаполнено(Количество) Тогда
		Результат = СтрШаблон("%1 (%2)", Строка.Представление, Количество);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Процедура РазвернутьКоллекцию(Коллекция, НайденныеСсылки, ПоискИЗаменаСсылок)
	
	Для Каждого Строка Из Коллекция.ПолучитьЭлементы() Цикл 
		
		Если ИТК_МетаданныеКлиентСервер.ЭтоПолноеИмяОбъекта(Строка.Метаданные) Тогда
			
			Если ИТК_ФормаКлиентСервер.НеобходимоРазвернутьСтроку(Строка) Тогда
				
				РазвернутьСтроку(Строка, НайденныеСсылки, ПоискИЗаменаСсылок);
				
			КонецЕсли;
			
		Иначе
			
			РазвернутьКоллекцию(Строка, НайденныеСсылки, ПоискИЗаменаСсылок)
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РазвернутьСтроку(Строка, НайденныеСсылки, ПоискИЗаменаСсылок) Экспорт
	
	Строка.ПолучитьЭлементы().Очистить();
	
	ИмяОбъектаМетаданных = Строка.Метаданные;
	
	МестаИспользованияСтруктура = МестаИспользованияСтруктура();
	
	НайденныеСтроки = НайденныеСсылки.НайтиСтроки(Новый Структура(МестаИспользованияСтруктура.ПолеМетаданные, ИмяОбъектаМетаданных));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Данные", НайденнаяСтрока[МестаИспользованияСтруктура.ПолеДанные]);
		
		Если ПоискИЗаменаСсылок Тогда
			
			ДополнительныеПараметры.Вставить("Ссылка", НайденнаяСтрока[МестаИспользованияСтруктура.ПолеСсылка]);
			ДополнительныеПараметры.Вставить("ДоступенОтбор", Ложь);
			
		КонецЕсли;
		
		ДобавитьСтрокуВНайденныеСсылки(Строка, НайденнаяСтрока.ПредставлениеДанных, ПоискИЗаменаСсылок, ДополнительныеПараметры);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
