
&После("ОбработкаПроведения")
Процедура бит_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// {{ПервыйБИТ ЛистТребований [УчетОтходов] [ASHolyavko@1cbit.ru] [10.08.2026] +        
	
	Если Не Отказ Тогда
		
		НаборЗаписей = РегистрыНакопления.бит_ПростоиОборудования.СоздатьНаборЗаписей();
		НаборЗаписей.Записывать = Истина;
		
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		
		Для Каждого СтрокаТЧ Из Ссылка.бит_ПростоиЗаСмену Цикл
			
			ЗаписьПростоиЗаСмену = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьПростоиЗаСмену, СтрокаТЧ);
			ЗаписьПростоиЗаСмену.Период = Ссылка.Дата;
			ЗаписьПростоиЗаСмену.Строка = СтрокаТЧ.НомерСтроки;
			ЗаписьПростоиЗаСмену.СменноеЗадание = Ссылка;
			
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина); 
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [УчетОтходов] [ASHolyavko@1cbit.ru] [10.08.2026] -
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура бит_ОбработкаУдаленияПроведения(Отказ)
	
	// {{ПервыйБИТ ЛистТребований [УчетОтходов] [ASHolyavko@1cbit.ru] [10.08.2026] +        
	
	НаборЗаписей = РегистрыНакопления.бит_ПростоиОборудования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);  
	
	// }}ПервыйБИТ ЛистТребований [УчетОтходов] [ASHolyavko@1cbit.ru] [10.08.2026] -
	
КонецПроцедуры
