
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьОбъектыСистемы();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыСистемы

&НаКлиенте
Процедура ОбъектыСистемыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("СправочникСсылка.бит_ОбъектыСистемы") Тогда
		Возврат;
	КонецЕсли;
	
	НовыеОбъектыСистемы.Добавить(ВыбранноеЗначение);
	ТекущийОбъектСистемы = ВыбранноеЗначение;
	ОбновитьОбъектыСистемы();
	АктивизироватьОбъектСистемы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыСистемыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ПриИзмененииТекущегоОбъектаСистемы", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ОбновитьОбъектыСистемы();
	АктивизироватьОбъектСистемы();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДобавитьОбъект(Команда)
	
	ДоступныеОбъекты = ДоступныеОбъектыДляВыбора();
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", ДоступныеОбъекты);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор"			, СтруктураОтбора);
	ПараметрыФормы.Вставить("РежимПросмотра", "Список");
	
	ОткрытьФорму("Справочник.бит_ОбъектыСистемы.ФормаВыбора", ПараметрыФормы, Элементы.ОбъектыСистемы);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьОбъект(Команда)
	
	КоличествоНазначений = КоличествоНазначенийАналитик(ТекущийОбъектСистемы);
	Если КоличествоНазначений = 0 Тогда
		УдалитьДокументИзСписка();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ВопросУдалениеНазначенийПриЗавершении", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Удалить назначенные аналитики?';en='Remove assigned analytics?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОбъектыСистемыПредставление");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОбъектыСистемы.ОбъектСистемы", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт",  ШрифтыСтиля.бит_ОсновнойЭлементСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьНастройкиОбъектаСистемы()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Объект", ТекущийОбъектСистемы, 
         ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОбъектыСистемы()
	
	ОбъектыСистемы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НазначениеАналитик.Объект КАК Объект,
	|	КОЛИЧЕСТВО(НазначениеАналитик.Аналитика) КАК КоличествоНастроек
	|ПОМЕСТИТЬ МатрицаОбъектов
	|ИЗ
	|	РегистрСведений.бит_НазначениеДополнительныхАналитик КАК НазначениеАналитик
	|
	|СГРУППИРОВАТЬ ПО
	|	НазначениеАналитик.Объект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектыСистемы.Ссылка,
	|	0
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
	|ГДЕ
	|	ОбъектыСистемы.Ссылка В(&НовыеОбъектыСистемы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПустаяСсылка),
	|	0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатрицаОбъектов.Объект КАК Объект,
	|	МАКСИМУМ(МатрицаОбъектов.Объект = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПустаяСсылка)) КАК ОбщаяНастройка,
	|	СУММА(МатрицаОбъектов.КоличествоНастроек) КАК КоличествоНастроек
	|ПОМЕСТИТЬ Статистика
	|ИЗ
	|	МатрицаОбъектов КАК МатрицаОбъектов
	|
	|СГРУППИРОВАТЬ ПО
	|	МатрицаОбъектов.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МатрицаОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Статистика.Объект КАК ОбъектСистемы,
	|	ВЫБОР
	|		КОГДА Статистика.ОбщаяНастройка
	|			ТОГДА &ПредставлениеОбщейНастроки
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Статистика.Объект)
	|	КОНЕЦ КАК Представление,
	|	Статистика.КоличествоНастроек КАК КоличествоНастроек
	|ИЗ
	|	Статистика КАК Статистика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статистика.ОбщаяНастройка УБЫВ,
	|	Представление";
	Запрос.УстановитьПараметр("ПредставлениеОбщейНастроки", НСтр("ru='Общие аналитики';en='General analytics'"));
	Запрос.УстановитьПараметр("НовыеОбъектыСистемы", НовыеОбъектыСистемы);
	
	ПредставлениеСоСтатистикой = "%1 (%2)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ОбъектыСистемы.Добавить();
		НоваяСтрока.ОбъектСистемы = Выборка.ОбъектСистемы;
		Если Выборка.КоличествоНастроек > 0 Тогда
			НоваяСтрока.Представление = СтрШаблон(ПредставлениеСоСтатистикой,
													Выборка.Представление,
													Выборка.КоличествоНастроек);
		Иначе
			НоваяСтрока.Представление = Выборка.Представление;
		КонецЕсли;
		Если Выборка.ОбъектСистемы = ТекущийОбъектСистемы Тогда
			ИдентификаторТекущегоОбъекта = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДоступныеОбъектыДляВыбора()
	
	ДоступныеОбъекты = Новый СписокЗначений;
	
	МассивМетаданных = Новый Массив;
	Для каждого ТипВладельца Из Метаданные.ОпределяемыеТипы.бит_ВладелецДополнительныхАналитик.Тип.Типы() Цикл
		МассивМетаданных.Добавить(Метаданные.НайтиПоТипу(ТипВладельца));
	КонецЦикла;
	
	ВладельцыАналитик = Справочники.бит_ОбъектыСистемы.ОбъектыСистемыПоОбъектамМетаданных(МассивМетаданных);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыСистемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НазначениеДополнительныхАналитик КАК НазначениеАналитик
	|		ПО НазначениеАналитик.Объект = ОбъектыСистемы.Ссылка
	|ГДЕ
	|	НазначениеАналитик.Объект ЕСТЬ NULL
	|	И ОбъектыСистемы.Ссылка В (&ВладельцыАналитик)
	|	И НЕ ОбъектыСистемы.Ссылка В (&НовыеОбъектыСистемы)";
	Запрос.УстановитьПараметр("ВладельцыАналитик",   ВладельцыАналитик);
	Запрос.УстановитьПараметр("НовыеОбъектыСистемы", НовыеОбъектыСистемы);

	ДоступныеОбъекты.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат ДоступныеОбъекты;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииТекущегоОбъектаСистемы()
	
	Если Элементы.ОбъектыСистемы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийОбъектСистемы = Элементы.ОбъектыСистемы.ТекущиеДанные.ОбъектСистемы;
	ОтобразитьНастройкиОбъектаСистемы();
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьОбъектСистемы()
	
	Элементы.ОбъектыСистемы.ТекущаяСтрока = ИдентификаторТекущегоОбъекта;
	
КонецПроцедуры

&НаСервере
Функция КоличествоНазначенийАналитик(ОбъектСистемы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_НазначениеДополнительныхАналитик.Аналитика) КАК Количество
	|ИЗ
	|	РегистрСведений.бит_НазначениеДополнительныхАналитик КАК бит_НазначениеДополнительныхАналитик
	|ГДЕ
	|	бит_НазначениеДополнительныхАналитик.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", ОбъектСистемы);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ВопросУдалениеНазначенийПриЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьНазначенныеАналитики();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНазначенныеАналитики()
	
	НаборНазначений = РегистрыСведений.бит_НазначениеДополнительныхАналитик.СоздатьНаборЗаписей();
	НаборНазначений.Отбор.Объект.Установить(ТекущийОбъектСистемы);
	НаборНазначений.Записать();
	
	УдалитьДокументИзСписка();	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументИзСписка()
	
	ЭлементОбъекта = НовыеОбъектыСистемы.НайтиПоЗначению(ТекущийОбъектСистемы);
	Если ЭлементОбъекта <> Неопределено Тогда
		НовыеОбъектыСистемы.Удалить(ЭлементОбъекта);
	КонецЕсли;
	
	ОбновитьОбъектыСистемы();
	
	Если ТекущийОбъектСистемы.Пустая() Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти