#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьПоСтатьямОборотовПриПереходеНаНовуюВерсию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УдалитьШаблоныПроводок.СчетДТ КАК СчетДТ,
	|	УдалитьШаблоныПроводок.СчетКТ КАК СчетКТ,
	|	УдалитьШаблоныПроводок.КоэффициентСумма КАК КоэффициентСумма,
	|	УдалитьШаблоныПроводок.КоэффициентКоличество КАК КоэффициентКоличество,
	|	УдалитьШаблоныПроводок.Содержание КАК Содержание,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(УдалитьШаблоныПроводок.СчетДТ) КАК СчетДТПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(УдалитьШаблоныПроводок.СчетКТ) КАК СчетКТПредставление
	|ПОМЕСТИТЬ ВТ_УдалитьШаблоныПроводок
	|ИЗ
	|	Справочник.бит_СтатьиОборотов.УдалитьШаблоныПроводок КАК УдалитьШаблоныПроводок
	|
	|СГРУППИРОВАТЬ ПО
	|	УдалитьШаблоныПроводок.СчетДТ,
	|	УдалитьШаблоныПроводок.СчетКТ,
	|	УдалитьШаблоныПроводок.Содержание,
	|	УдалитьШаблоныПроводок.КоэффициентСумма,
	|	УдалитьШаблоныПроводок.КоэффициентКоличество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УдалитьШаблоныПроводок.СчетДТ КАК СчетДТ,
	|	ВТ_УдалитьШаблоныПроводок.СчетКТ КАК СчетКТ,
	|	ВТ_УдалитьШаблоныПроводок.КоэффициентСумма КАК КоэффициентСумма,
	|	ВТ_УдалитьШаблоныПроводок.КоэффициентКоличество КАК КоэффициентКоличество,
	|	ВТ_УдалитьШаблоныПроводок.Содержание КАК Содержание,
	|	ВТ_УдалитьШаблоныПроводок.СчетДТПредставление КАК СчетДТПредставление,
	|	ВТ_УдалитьШаблоныПроводок.СчетКТПредставление КАК СчетКТПредставление
	|ИЗ
	|	ВТ_УдалитьШаблоныПроводок КАК ВТ_УдалитьШаблоныПроводок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ШаблоныПроводокБюджетирования КАК ШаблоныПроводок
	|		ПО ВТ_УдалитьШаблоныПроводок.СчетДТ = ШаблоныПроводок.СчетДТ
	|			И ВТ_УдалитьШаблоныПроводок.СчетКТ = ШаблоныПроводок.СчетКТ
	|			И ВТ_УдалитьШаблоныПроводок.КоэффициентСумма = ШаблоныПроводок.КоэффициентСумма
	|			И ВТ_УдалитьШаблоныПроводок.КоэффициентКоличество = ШаблоныПроводок.КоэффициентКоличество
	|			И ВТ_УдалитьШаблоныПроводок.Содержание = ШаблоныПроводок.Содержание
	|ГДЕ
	|	ШаблоныПроводок.Ссылка ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		ЧастиНаименования = Новый Массив;
		ЧастиНаименования.Добавить(Выборка.СчетДТПредставление);
		ЧастиНаименования.Добавить(Выборка.СчетКТПредставление);
		Наименование = СтрСоединить(ЧастиНаименования, " - ");
		
		НачатьТранзакцию();
		Попытка
			
			Шаблон = Справочники.бит_ШаблоныПроводокБюджетирования.СоздатьЭлемент();
			Шаблон.Наименование			 = Наименование;
			Шаблон.СчетДТ				 = Выборка.СчетДТ;
			Шаблон.СчетКТ				 = Выборка.СчетКТ;
			Шаблон.КоэффициентСумма		 = Выборка.КоэффициентСумма;
			Шаблон.КоэффициентКоличество = Выборка.КоэффициентКоличество;
			Шаблон.Содержание			 = Выборка.Содержание;
			Шаблон.УстановитьНовыйКод();
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Шаблон, Истина);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			бит_ОбновлениеИнформационнойБазыБФ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Наименование);
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли