#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мКоличествоСубконтоМУ Экспорт; // Хранит количество субконто международного учета в документа.

Перем мРезультатЗапроса Экспорт; // Хранит результат запроса с данными о сторнировании.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ПервоначальноеЗаполнениеДокумента();
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка, Отказ, Заголовок, ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ДвиженияПоРегистрам(Отказ, Заголовок);
               
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если РегистрБухгалтерии.ИмяОбъекта = "бит_Бюджетирование" Тогда
		ПроверяемыеРеквизиты.Добавить("Сценарий");
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);

КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		

		
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

Процедура ПриКопировании(ОбъектКопирования)
	
	ПервоначальноеЗаполнениеДокумента(ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция выполняет запрос, возвращает остатки для сторнирования.
// 
// Параметры:
//  ЭтотРегистр_Меж - Булево.
//  ЭтотРегистр_Бюд - Булево.
// 
// Возвращаемое значение:
//  РезультатЗапроса.
// 
Функция ПолучитьДанныеДляСторнирования(ЭтотРегистр_Меж, ЭтотРегистр_Бюд) Экспорт

	Запрос = Новый Запрос;
	
	СписокСчетов = СчетаИсключения.Выгрузить().ВыгрузитьКолонку("Счет");
	СписокСчетов.Добавить(СчетСторно);
	
	Запрос.УстановитьПараметр("Период"		   , Дата);
	Запрос.УстановитьПараметр("Организация"	   , Организация);
	Запрос.УстановитьПараметр("СчетаИсключения", СписокСчетов);
	
	Если ЭтотРегистр_Меж Тогда // бит_Дополнительный_2
		
		ДопСтрокаПолей 	= "
		|	РегистрБухгалтерииОстатки.СуммаМУОстатокДт,
	    |	РегистрБухгалтерииОстатки.СуммаМУОстатокКт,";
		
		ДопСтрокаУсловие = "Организация = &Организация";
		
	ИначеЕсли ЭтотРегистр_Бюд Тогда // бит_Бюджетирование
		
		МассивЦФО = Новый Массив;
		
		Запрос.Текст = ТекстЗапросаЦФОПоОрганизации();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ТекстСообщения = НСтр("ru='Не найдено ЦФО по организации %1';
			                      |en='CFR can not be found for the organization %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Организация);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		ТаблицаЦФО = РезультатЗапроса.Выгрузить();
		МассивЦФО  = ТаблицаЦФО.ВыгрузитьКолонку("ЦФО");
				
	    ДопСтрокаПолей = "
		|	РегистрБухгалтерииОстатки.ЦФО,
		|	РегистрБухгалтерииОстатки.СуммаСценарийОстатокДт,
	    |	РегистрБухгалтерииОстатки.СуммаСценарийОстатокКт,";
		
		ДопСтрокаУсловие = "Сценарий = &Сценарий И ЦФО В (&МассивЦФО)";
		
		Запрос.УстановитьПараметр("Сценарий", Сценарий);
		Запрос.УстановитьПараметр("МассивЦФО", МассивЦФО);
		
	Иначе
		
		ДопСтрокаПолей 	 = "";   
		
		ДопСтрокаУсловие = "Организация = &Организация";		
		
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
    |	РегистрБухгалтерииОстатки.Счет,
    |	РегистрБухгалтерииОстатки.Субконто1,
    |	РегистрБухгалтерииОстатки.Субконто2,
    |	РегистрБухгалтерииОстатки.Субконто3,
    |	РегистрБухгалтерииОстатки.Субконто4,
    |	РегистрБухгалтерииОстатки.Валюта,
	|" + ДопСтрокаПолей + "
    |	РегистрБухгалтерииОстатки.СуммаРеглОстатокДт,
    |	РегистрБухгалтерииОстатки.СуммаРеглОстатокКт,
    |	РегистрБухгалтерииОстатки.СуммаУпрОстатокДт,
    |	РегистрБухгалтерииОстатки.СуммаУпрОстатокКт,
    |	РегистрБухгалтерииОстатки.ВалютнаяСуммаОстатокДт,
    |	РегистрБухгалтерииОстатки.ВалютнаяСуммаОстатокКт,
    |	РегистрБухгалтерииОстатки.КоличествоОстатокДт,
    |	РегистрБухгалтерииОстатки.КоличествоОстатокКт     
    |ИЗ
    |	РегистрБухгалтерии." + РегистрБухгалтерии.ИмяОбъекта + ".Остатки(&Период
    |										, (НЕ Счет В ИЕРАРХИИ (&СчетаИсключения))
	|										, 
	|										, " + ДопСтрокаУсловие + ") КАК РегистрБухгалтерииОстатки
	|";
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;
	
КонецФункции

// Функция определяет будут ли движения по международному учету.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ЕстьМеждународныйУчет() Экспорт

	Если Метаданные.РегистрыБухгалтерии[РегистрБухгалтерии.ИмяОбъекта].Ресурсы.Найти("СуммаМУ") = Неопределено Тогда
		ЕстьМеждународныйУчет = Ложь;
	Иначе
		ЕстьМеждународныйУчет = Истина;
	КонецЕсли;

	Возврат ЕстьМеждународныйУчет;
	
КонецФункции // ЕстьМеждународныйУчет()	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЦФОПоОрганизации()
	
	// ++ ЕРП 
	Текст =
	"ВЫБРАТЬ
	|	бит_СоответствияАналитик.ЛеваяАналитика_1
	|ИЗ
	|	РегистрСведений.бит_СоответствияАналитик.СрезПоследних(
	|			&Период,
	|			ВидСоответствия = &ВидСоответствия
	|				И ПраваяАналитика_1 = &Организация) КАК СоответствияАналитик";
	// -- ЕРП 
	Возврат Текст;
	
КонецФункции

// Процедура выполняет первоначальное заполнение созданного/скопированного документа.
// 
// Параметры:
//  ПараметрОбъектКопирования - ДокументОбъект.
// 
Процедура ПервоначальноеЗаполнениеДокумента(ПараметрОбъектКопирования = Неопределено)
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ПараметрОбъектКопирования);
												
	Если ПараметрОбъектКопирования = Неопределено Тогда
		РегистрБухгалтерии = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойРегистрБухгалтерииУУ);
	КонецЕсли;												
	
КонецПроцедуры // ПервоначальноеЗаполнениеДокумента()

#Область ПроцедурыИФункцииДляОбеспеченияПроведенияДокумента

// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(Отказ, Заголовок)
	
	ЭтотРегистр_Бюд = РегистрБухгалтерии.ИмяОбъекта = "бит_Бюджетирование";
	ЭтотРегистр_Меж = РегистрБухгалтерии.ИмяОбъекта = "бит_Дополнительный_2";
	
	МассивПоказателей = Новый Массив;
	
	МассивПоказателей.Добавить("СуммаРегл");
	МассивПоказателей.Добавить("СуммаУпр");
	Если ЭтотРегистр_Меж Тогда
		МассивПоказателей.Добавить("СуммаМУ");
	ИначеЕсли ЭтотРегистр_Бюд Тогда
		МассивПоказателей.Добавить("СуммаСценарий");
	КонецЕсли;         	
	
	Если мРезультатЗапроса = Неопределено Тогда	
		мРезультатЗапроса = ПолучитьДанныеДляСторнирования(ЭтотРегистр_Меж, ЭтотРегистр_Бюд);
	КонецЕсли;
	
	Выборка = мРезультатЗапроса.Выбрать();
	
	Проводки = Движения[РегистрБухгалтерии.ИмяОбъекта];
	Проводки.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Проводки.Добавить();
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Активность	= Истина;
		НоваяСтрока.Период		= Дата;
				
		Для каждого ТекСтр Из МассивПоказателей Цикл
			Если Выборка[ТекСтр + "ОстатокДт"] <> 0 Тогда
				СчетДляЗакрытия = "Дт";
				СчетДляСторно	= "Кт";
				Прервать;
			Иначе
				СчетДляЗакрытия = "Кт";
				СчетДляСторно	= "Дт";
			КонецЕсли;
		КонецЦикла;
		
		НоваяСтрока["Счет" + СчетДляЗакрытия] 			= Выборка.Счет;
		НоваяСтрока["Валюта" + СчетДляЗакрытия]		 	= Выборка.Валюта;
		НоваяСтрока["ВалютнаяСумма" + СчетДляЗакрытия]	= - Выборка["ВалютнаяСуммаОстаток" + СчетДляЗакрытия];
		НоваяСтрока["Количество" + СчетДляЗакрытия]	 	= Выборка["КоличествоОстаток" + СчетДляЗакрытия];
		
		Для Н = 1 По мКоличествоСубконтоМУ Цикл
			бит_му_ОбщегоНазначения.УстановитьСубконто(Выборка.Счет, НоваяСтрока["Субконто" + СчетДляЗакрытия], Н, Выборка["Субконто" + Н]);
		КонецЦикла;
		
		НоваяСтрока["Счет" + СчетДляСторно] 			= СчетСторно;
				
		НоваяСтрока.СуммаРегл = - Выборка["СуммаРеглОстаток" + СчетДляЗакрытия];
		НоваяСтрока.СуммаУпр  = - Выборка["СуммаУпрОстаток" + СчетДляЗакрытия];		
		
		Если ЭтотРегистр_Меж Тогда
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.СуммаМУ		= - Выборка["СуммаМУОстаток" + СчетДляЗакрытия];			
		ИначеЕсли ЭтотРегистр_Бюд Тогда  			
			НоваяСтрока.Сценарий = Сценарий;
			НоваяСтрока.ЦФО 	 = Выборка.ЦФО;
			НоваяСтрока.СуммаСценарий = - Выборка["СуммаСценарийОстаток" + СчетДляЗакрытия];
		Иначе
			НоваяСтрока.Организация = Организация;
		КонецЕсли;
		
		НоваяСтрока.Содержание = Содержание;
		
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоРегистрам()

#КонецОбласти

#КонецОбласти

#Область Инициализация

мКоличествоСубконтоМУ = 4;
мРезультатЗапроса 	  = Неопределено;

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли