


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Инициализация();
	
КонецПроцедуры


&НаСервере
Процедура Инициализация()
	
		
	//глИнициализировать_ПостроительОтчета(ПостроительОтчета_ВариантИсполненияГП, Тип("СправочникСсылка.ВариантыИсполнения"), "Значение параметра");
	
	//мСКД_ВариантИсполненияГП = Неопределено;
	//
	//Инициализировать_СхемуКомпоновкиДанных(мСКД_ВариантИсполненияГП, Тип("СправочникСсылка.Номенклатура"), "Значение параметра");
	//
	//Возврат ПоместитьВоВременноеХранилище(мСКД_ВариантИсполненияГП, новый УникальныйИдентификатор);
	
	//КомпоновщикНастроек_ВариантИсполненияГП.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(мСКД_ВариантИсполненияГП));
	//КомпоновщикНастроек_ВариантИсполненияГП.ЗагрузитьНастройки(мСКД_ВариантИсполненияГП.НастройкиПоУмолчанию);
	

	////ЗначениеПараметра - Условия отбора значения
	//
	//_ТипЗначенияПараметра = глПолучитьТипЗначенияПараметра(Параметр);
	//
	//глИнициализировать_ПостроительОтчета(ПостроительОтчета_ЗначениеПараметра, _ТипЗначенияПараметра, "Значение параметра");
	//
	//глИнициализировать_СхемуКомпоновкиДанных(мСКД_ЗначениеПараметра, _ТипЗначенияПараметра, "Значение параметра");
	//КомпоновщикНастроек_ЗначениеПараметра.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(мСКД_ЗначениеПараметра));
	//КомпоновщикНастроек_ЗначениеПараметра.ЗагрузитьНастройки(мСКД_ЗначениеПараметра.НастройкиПоУмолчанию);
	//
	//ЭлементыФормы.Шаг.Видимость 		= _ТипЗначенияПараметра = Тип("Число");
	//ЭлементыФормы.НадписьШаг.Видимость 	= ЭлементыФормы.Шаг.Видимость;
	
	
	//ВариантИсполненияГП - Условия применения
   
	СхемаКомпоновкиДанных_ВариантИсполненияГП = Неопределено;
	
	Инициализировать_СхемуКомпоновкиДанных(СхемаКомпоновкиДанных_ВариантИсполненияГП, Тип("СправочникСсылка.Номенклатура"), "Значение параметра");
	ХранилищеСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных_ВариантИсполненияГП, Новый УникальныйИдентификатор);
	КомпоновщикНастроек_ВариантИсполненияГП.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ХранилищеСхемы));
	КомпоновщикНастроек_ВариантИсполненияГП.ЗагрузитьНастройки(СхемаКомпоновкиДанных_ВариантИсполненияГП.НастройкиПоУмолчанию);
	
	//ЗначениеПараметра - Условия отбора значения
	
	//_ТипЗначенияПараметра = глПолучитьТипЗначенияПараметра(Параметр);
	//глИнициализировать_ПостроительОтчета(ПостроительОтчета_ЗначениеПараметра, _ТипЗначенияПараметра, "Значение параметра");
	СхемаКомпоновкиДанных_ЗначениеПараметра = Неопределено;
	
	Инициализировать_СхемуКомпоновкиДанных(СхемаКомпоновкиДанных_ЗначениеПараметра, Тип("СправочникСсылка.Номенклатура"), "Значение параметра");
	ХранилищеСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных_ЗначениеПараметра, Новый УникальныйИдентификатор);
	КомпоновщикНастроек_ЗначениеПараметра.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ХранилищеСхемы));
	КомпоновщикНастроек_ЗначениеПараметра.ЗагрузитьНастройки(СхемаКомпоновкиДанных_ЗначениеПараметра.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура Инициализировать_СхемуКомпоновкиДанных(ВхСхемаКомпоновки, ВхТипЗначенияРесурса, ВхПредставлениеИмениРесурса = Неопределено) Экспорт
	
	ВхСхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	_ИсточникДанных = ВхСхемаКомпоновки.ИсточникиДанных.Добавить();
	_ИсточникДанных.Имя = "ИсточникДанных";
	_ИсточникДанных.ТипИсточникаДанных = "Local";
	
	_ТекстЗапроса 	= "";
	
	//Если ВхТипЗначенияРесурса = Неопределено 
	//	ИЛИ ВхТипЗначенияРесурса = Тип("Неопределено") Тогда
	//	
	//	_ТекстЗапроса =
	//	"ВЫБРАТЬ
	//	|	ТаблицаРесурса.Ссылка
	//	|{ВЫБРАТЬ
	//	|	Ссылка.*}
	//	|ИЗ
	//	|	Справочник.Номенклатура КАК ТаблицаРесурса
	//	|{ГДЕ
	//	|	ТаблицаРесурса.Ссылка.*}"
	//	;
	//	
	//	_НаборДанных = ВхСхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	//	_НаборДанных.Имя 			= "НаборДанных_01";
	//	_НаборДанных.ИсточникДанных = "ИсточникДанных";
	//	_НаборДанных.Запрос 		= _ТекстЗапроса;
	//	
	//	_Поле1 = _НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	//	_Поле1.Поле 		= "Ссылка";
	//	_Поле1.ПутьКДанным 	= "Ссылка";
	//	_Поле1.Заголовок 	= "Ссылка";
	//	
	//ИначеЕсли ВхТипЗначенияРесурса = Тип("Число")
	//	ИЛИ ВхТипЗначенияРесурса = Тип("Строка")
	//	ИЛИ ВхТипЗначенияРесурса = Тип("Булево") Тогда
	//	
	//	_НаборДанных = ВхСхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	//	_НаборДанных.Имя 			= "НаборДанных_01";
	//	_НаборДанных.ИсточникДанных = "ИсточникДанных";
	//	_НаборДанных.ИмяОбъекта 	= "табл_ЗначенияПростыхТипов";
	//	
	//	
	//	_Поле1 = _НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	//	_Поле1.Поле 		= "Значение";
	//	_Поле1.ПутьКДанным 	= "Значение";
	//	_Поле1.Заголовок 	= ?(ВхПредставлениеИмениРесурса = Неопределено, "Значение", ВхПредставлениеИмениРесурса);
	//	
	//	масс_Типы = Новый Массив;
	//	масс_Типы.Добавить(ВхТипЗначенияРесурса);

	//	//квалификаторы из ПВХ.ПараметрыНоменклатуры
	//	КЧ = Новый КвалификаторыЧисла(15,5);
	//	КС = Новый КвалификаторыСтроки(50); 
	//	
	//	_Поле1.ТипЗначения 	= Новый ОписаниеТипов(масс_Типы,,,КЧ,КС);
	//	
	//ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ВхТипЗначенияРесурса) Тогда
		
		// к ИсточникуДанных-Справочнику добавляется еще 1 элемент - пустая ссылка на элемент справочника (через временную таблицу с 1 строкой)
		// для того чтобы можно было указывать пустую ссылку на элемент справочника в качестве валидного проверяемого значения параметра номенклатуры
		_ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ПустаяСсылка
		|ИЗ
		|	Перечисление.ЮрФизЛицо КАК ТаблицаРесурса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРесурса.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК ТаблицаРесурса
		|{ГДЕ
		|	ТаблицаРесурса.Ссылка.*}
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|ИЗ
		|	ВТ_ПустаяСсылка КАК ВТ_ПустаяСсылка
		|{ГДЕ
		|	ВТ_ПустаяСсылка.Ссылка.*}"
		;
		
		_ИмяСправочника = Метаданные.НайтиПоТипу(ВхТипЗначенияРесурса).Имя;
		_ТекстЗапроса = СтрЗаменить(_ТекстЗапроса, "Номенклатура", _ИмяСправочника);
		
		_НаборДанных = ВхСхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		_НаборДанных.Имя 			= "НаборДанных_01";
		_НаборДанных.ИсточникДанных = "ИсточникДанных";
		_НаборДанных.Запрос 		= _ТекстЗапроса;
		
		_Поле1 = _НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		_Поле1.Поле 		= "Ссылка";
		_Поле1.ПутьКДанным 	= "Ссылка";
		_Поле1.Заголовок 	= "Ссылка";
		
	//ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ВхТипЗначенияРесурса) Тогда
	//	
	//	_ТекстЗапроса =
	//	"ВЫБРАТЬ
	//	|	ТаблицаРесурса.Ссылка
	//	|{ВЫБРАТЬ
	//	|	Ссылка.*}
	//	|ИЗ
	//	|	Документ.ЗаказПокупателя КАК ТаблицаРесурса
	//	|{ГДЕ
	//	|	ТаблицаРесурса.Ссылка.*}"
	//	;
	//	
	//	_ИмяДокумента = Метаданные.НайтиПоТипу(ВхТипЗначенияРесурса).Имя;
	//	_ТекстЗапроса = СтрЗаменить(_ТекстЗапроса, "ЗаказПокупателя", _ИмяДокумента);
	//	
	//	_НаборДанных = ВхСхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	//	_НаборДанных.Имя 			= "НаборДанных_01";
	//	_НаборДанных.ИсточникДанных = "ИсточникДанных";
	//	_НаборДанных.Запрос 		= _ТекстЗапроса;
	//	
	//	_Поле1 = _НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	//	_Поле1.Поле 		= "Ссылка";
	//	_Поле1.ПутьКДанным 	= "Ссылка";
	//	_Поле1.Заголовок 	= "Ссылка";
	//	
	//ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ВхТипЗначенияРесурса) Тогда
	//	
	//	_ТекстЗапроса =
	//	"ВЫБРАТЬ
	//	|	ТаблицаРесурса.Ссылка
	//	|{ВЫБРАТЬ
	//	|	Ссылка.*}                                                           
	//	|ИЗ
	//	|	Перечисление.СтавкиНДС КАК ТаблицаРесурса
	//	|{ГДЕ
	//	|	ТаблицаРесурса.Ссылка.*}"
	//	;
	//	
	//	_ИмяПеречисления = Метаданные.НайтиПоТипу(ВхТипЗначенияРесурса).Имя;
	//	_ТекстЗапроса = СтрЗаменить(_ТекстЗапроса, "СтавкиНДС", _ИмяПеречисления);
	//	
	//	_НаборДанных = ВхСхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	//	_НаборДанных.Имя 			= "НаборДанных_01";
	//	_НаборДанных.ИсточникДанных = "ИсточникДанных";
	//	_НаборДанных.Запрос 		= _ТекстЗапроса;
	//	
	//	_Поле1 = _НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	//	_Поле1.Поле 		= "Ссылка";
	//	_Поле1.ПутьКДанным 	= "Ссылка";
	//	_Поле1.Заголовок 	= "Ссылка";
	//	
	//Иначе
	//	
	//	ВызватьИсключение("глИнициализировать_СхемуКомпановкиДанных(): Неподдерживаемый тип значения ресурса - <" + ВхТипЗначенияРесурса + ">");
	//	
	//КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПравилаОграниченийПриАктивизацииСтроки(Элемент)
	
	КомпоновщикНастроек_ВариантИсполненияГП.Настройки.Отбор.Элементы.Очистить();
	КомпоновщикНастроек_ЗначениеПараметра.Настройки.Отбор.Элементы.Очистить();
	
	

	//ДД = РеквизитФормыВЗначение("Объект");
	
	ТекущиеДанные = Элементы.ПравилаОграничений.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		ИдентификаторСтроки = Элементы.ПравилаОграничений.ТекущиеДанные.НомерСтроки - 1;
		            
		//УсловияПрименения
	
		_Хранилище_УсловияПрименения_Отбор = ПолучитьЗначениеХранилищаЗначений(ИдентификаторСтроки, "Хранилище_УсловияПрименения");//ТекущиеДанные.Хранилище_УсловияПрименения.Получить();
		
		Если НЕ _Хранилище_УсловияПрименения_Отбор = Неопределено Тогда
			
			Для Каждого _Хранилище_ЭлементОтбора Из _Хранилище_УсловияПрименения_Отбор.Элементы Цикл
				
				_ЭлементОтбора = КомпоновщикНастроек_ВариантИсполненияГП.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

				ЗаполнитьЗначенияСвойств(_ЭлементОтбора, _Хранилище_ЭлементОтбора);
					
			КонецЦикла;
			
		КонецЕсли;                  
		
		//УсловияОтбора
		
		_Хранилище_УсловияОтбора_Отбор = ПолучитьЗначениеХранилищаЗначений(ИдентификаторСтроки, "Хранилище_УсловияОтбора");//ТекущиеДанные.Хранилище_УсловияОтбора.Получить();
		
		Если НЕ _Хранилище_УсловияОтбора_Отбор = Неопределено Тогда
			
			Для Каждого _Хранилище_ЭлементОтбора Из _Хранилище_УсловияОтбора_Отбор.Элементы Цикл
				
				_ЭлементОтбора = КомпоновщикНастроек_ЗначениеПараметра.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

				ЗаполнитьЗначенияСвойств(_ЭлементОтбора, _Хранилище_ЭлементОтбора);
					
			КонецЦикла;
			
		КонецЕсли;
		
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеХранилищаЗначений(Идентификатор, ИмяРеквизита)
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	Значение = СправочникОбъект.ПравилаОграничений[Идентификатор][ИмяРеквизита];
	
	Возврат Значение.Получить();
	
КонецФункции

&НаКлиенте
Процедура ПравилаОграниченийПередУдалением(Элемент, Отказ)
	
	ПравилаОграниченийПриАктивизацииСтроки(Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьВХранилищеЗначений(НастройкиОтбор, Идентификатор, ИмяРеквизита) 
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	Значение = Новый ХранилищеЗначения(НастройкиОтбор);

	//СправочникОбъект.ЗаполнитьХранилищеЗначений(Значение);
	//Объект.ПравилаОграничений[0].
	СправочникОбъект.ПравилаОграничений[Идентификатор][ИмяРеквизита] = Значение;
	
	СправочникОбъект.Записать();
	Прочитать();
	//
	//ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");

	//Модифицированность = Истина;	
	
	//Возврат Новый ХранилищеЗначения(Значение);
	
КонецПроцедуры


&НаКлиенте
Процедура КомпоновщикНастроек_ВариантИсполненияГП_Настройки_ОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанные = Элементы.ПравилаОграничений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроек_ВариантИсполненияГП_Настройки_ОтборПослеУдаления(Элемент)
	
	КомпоновщикНастроек_ВариантИсполненияГП_Настройки_ОтборПриОкончанииРедактирования(Элемент, Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроек_ВариантИсполненияГП_Настройки_ОтборПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	_ТЧПравилаОграничений_ТекущиеДанные = Элементы.ПравилаОграничений.ТекущиеДанные;
		
	ИдентификаторСтроки = Элементы.ПравилаОграничений.ТекущиеДанные.НомерСтроки - 1;
	
	НастройкиОтбор = КомпоновщикНастроек_ВариантИсполненияГП.Настройки.Отбор;
	
	ПоместитьВХранилищеЗначений(НастройкиОтбор, ИдентификаторСтроки, "Хранилище_УсловияПрименения");
	
	_ТЧПравилаОграничений_ТекущиеДанные.УсловияПрименения = НастройкиОтбор;
	
КонецПроцедуры   

&НаКлиенте
Процедура КомпоновщикНастроек_ЗначениеПараметра_Настройки_ОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанные = Элементы.ПравилаОграничений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроек_ЗначениеПараметра_Настройки_ОтборПослеУдаления(Элемент)
	
	КомпоновщикНастроек_ЗначениеПараметра_Настройки_ОтборПриОкончанииРедактирования(Элемент, Ложь, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроек_ЗначениеПараметра_Настройки_ОтборПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	_ТЧПравила_ТекущиеДанные = Элементы.ПравилаОграничений.ТекущиеДанные;
		
	ИдентификаторСтроки = Элементы.ПравилаОграничений.ТекущиеДанные.НомерСтроки - 1;
	
	НастройкиОтбор = КомпоновщикНастроек_ЗначениеПараметра.Настройки.Отбор;
	
	ПоместитьВХранилищеЗначений(НастройкиОтбор, ИдентификаторСтроки, "Хранилище_УсловияОтбора");
	
	_ТЧПравила_ТекущиеДанные.УсловиеОтбора = НастройкиОтбор;
	
КонецПроцедуры


