#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция проверяет наличие активных задач у пользователя.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЕстьАктивныеЗадачи() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗадачиИсполнителя.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.бит_Задача.ЗадачиПоИсполнителю КАК ЗадачиИсполнителя
	|ГДЕ
	|	НЕ ЗадачиИсполнителя.ПометкаУдаления
	|	И НЕ ЗадачиИсполнителя.Выполнена
	|	И ЗадачиИсполнителя.Состояние <> ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.Задача_Остановлена)
	|	И ЗадачиИсполнителя.Алгоритм = ЗНАЧЕНИЕ(Справочник.бит_АлгоритмыПроцессов.ПустаяСсылка)";
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли