#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Версия = ИТК_ТуллкитКлиентСервер.Версия();
	ДомашняяСтраница = ИТК_ТуллкитКлиентСервер.WebСайт();
	
	// Заполнение интеграции с БСП
	Если ИТК_БСП.Поддерживается("2.3") Тогда
		ИнтеграцияСБСП = НСтр("ru = 'Используется';
								|en = 'Use'");
	Иначе
		ИнтеграцияСБСП = НСтр("ru = 'Не используется';
								|en = 'Not use'");
	КонецЕсли;
	
	ВерсияБСП = ИТК_БСППовтИсп.Версия();
	Если ЗначениеЗаполнено(ВерсияБСП) Тогда
		ИнтеграцияСБСП = ИнтеграцияСБСП + СтрШаблон(" (%1)", ВерсияБСП);
	КонецЕсли;
	
	Заголовок = ИТК_ТуллкитКлиентСервер.Представление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДомашняяСтраницаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(ДомашняяСтраница);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КопироватьИнформациюДляТехническойПоддержки(Команда)
	
	ИТК_БуферОбменаКлиент.Копировать(ИнформацияДляТехническойПоддержки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Заполняем информацию для технической поддержки
	ИнформацияДляТехническойПоддержкиКлиент = ИТК_ОбщийКлиент.ИнформацияДляТехническойПоддержки();
	ИнформацияДляТехническойПоддержкиСервер = ИТК_ОбщийВызовСервера.ИнформацияДляТехническойПоддержки();
	
	Шаблон = "%1
	|
	|%2
	|
	|%3";
	ИнформацияДляТехническойПоддержки = СтрШаблон(Шаблон, ИТК_ТуллкитКлиентСервер.ПолноеПредставление(), ИнформацияДляТехническойПоддержкиСервер, ИнформацияДляТехническойПоддержкиКлиент);

КонецПроцедуры

#КонецОбласти
