
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьДанныеКонстант();
	
	ОпределитьДоступностьРедактированияВалютыРегламентированногоУчета();
	    	
	ЗаполнитьСписки();
	
	РежимАвтоЗаполненияАналитикПриИзмененииНаСервере();
	
	// Управление видимостью доступностью.	
	УправлениеВидимостьюДоступностью();
	
	ВерсииПодсистем = ОбновлениеИнформационнойБазы.ВерсииПодсистем();
	НайденнаяСтрока = ВерсииПодсистем.Найти("БитФинанс", "ИмяПодсистемы"); 
	Если НайденнаяСтрока <> Неопределено Тогда
		ВерсияБиблиотеки = НайденнаяСтрока.Версия;
	КонецЕсли;

	Элементы.ВерсияБиблиотеки.Видимость = НЕ ПустаяСтрока(ВерсияБиблиотеки);
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		// АПК:1297-выкл Строковый параметр.
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Общие настройки/Первый запуск БИТ.ФИНАНС", "", Ложь);
		// АПК:1297-вкл
	КонецЕсли; 
	
	Если бит_ОбщегоНазначения.ЭтоУТ() Тогда
		Элементы.СтраницаМСФО.Видимость = Ложь;
	КонецЕсли;
	
	УправлениеГруппойИспользоватьФиксациюБюджета();
	
	СсылкаНаБИТФинанс = "https://www.bitfinance.ru/";
	
	Если ЗначениеЗаполнено(Параметры.ТекущийЭлемент) Тогда
		ПозицияКурсора = Элементы.Найти(Параметры.ТекущийЭлемент);
		Если ПозицияКурсора <> Неопределено Тогда
			ТекущийЭлемент = ПозицияКурсора;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	ОбновитьИнтерфейсПрограммы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимАвтоЗаполненияАналитикОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура РежимФормированияОтчетовПриИзмененииНаСервере()
	
	Константы.бит_РежимФормированияОтчетов.Установить(РежимФормированияОтчетов);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимФормированияОтчетовПриИзменении(Элемент)
	
	РежимФормированияОтчетовПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИнтервалПроверкиКэшаПриИзмененииНаСервере()
	
	Константы.бит_ИнтервалПроверкиАктуальностиКэшаНастроек.Установить(ИнтервалПроверкиКэша);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалПроверкиКэшаПриИзменении(Элемент)
	
	ИнтервалПроверкиКэшаПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяВерсияПродуктаПриИзменении(Элемент)

	Успех = ТекущаяВерсияПродуктаПриИзмененииНаСервере();
		
	Если Успех Тогда
		бит_РаботаСДиалогамиКлиент.ОбновитьИнтерфейсПользователя();
		Если СистемаЛицензирования = 2 Тогда
			// Оповещение обработки клиента лицензирования об изменении версии продукта, для обновления состояния.
			Оповестить("сл2_ПереключенаВерсияПродукта");	
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru='Выбранная версия продукта не доступна в ""БИТ.Сервере лицензий"".';
								|en='The selected version of the product is not available in ""BIT.Servere License"".'");
		ПоказатьПредупреждение(,ТекстСообщения);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТипыПроводокНажатие(Элемент)
	
	ОткрытьФорму("Обработка.бит_ЗаполнитьТипыПроводок.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаБИТФинансНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СсылкаНаБИТФинанс);
	
КонецПроцедуры

&НаСервере
Процедура ВалютаУправленческогоУчетаПриИзмененииНаСервере()
	
	Константы.бит_ВалютаУправленческогоУчета.Установить(ВалютаУправленческогоУчета);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаУправленческогоУчетаПриИзменении(Элемент)
	
	ВалютаУправленческогоУчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьАвтоматическоеЗаполнениеАналитикШапкиПриИзмененииНаСервере()
	
	Константы.бит_ОтключитьАвтоматическоеЗаполнениеАналитикШапки.Установить(ОтключитьАвтоматическоеЗаполнениеАналитикШапки);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьАвтоматическоеЗаполнениеАналитикШапкиПриИзменении(Элемент)
	
	ОтключитьАвтоматическоеЗаполнениеАналитикШапкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере 
Процедура РежимАвтоЗаполненияАналитикПриИзмененииНаСервере()

	Если НЕ ЗначениеЗаполнено(РежимАвтоЗаполненияАналитик) Тогда
		РежимАвтоЗаполненияАналитик = Константы.бит_РежимАвтоЗаполненияАналитик.Получить();
		Возврат;
	КонецЕсли;
	
	Константы.бит_РежимАвтоЗаполненияАналитик.Установить(РежимАвтоЗаполненияАналитик);
	ОбновитьИнтерфейс = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура РежимАвтоЗаполненияАналитикПриИзменении(Элемент)
		
	РежимАвтоЗаполненияАналитикПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	УправлениеВидимостьюДоступностью();

КонецПроцедуры

&НаСервере
Процедура ИспользоватьНормыВБюджетированииПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьНормыВБюджетировании.Установить(ИспользоватьНормыВБюджетировании);
	ОбновитьИнтерфейс = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНормыВБюджетированииПриИзменении(Элемент)
	
	ИспользоватьНормыВБюджетированииПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПроводитьДокументыПослеУтвержденияПриИзмененииНаСервере()
	
	Константы.бит_ПроводитьДокументыПослеУтверждения.Установить(ПроводитьДокументыПослеУтверждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводитьДокументыПослеУтвержденияПриИзменении(Элемент)
	
	ПроводитьДокументыПослеУтвержденияПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьФиксациюБюджетаПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьФиксациюБюджета.Установить(ИспользоватьФиксациюБюджета);
	ОбновитьИнтерфейс = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФиксациюБюджетаПриИзменении(Элемент)
	
	ИспользоватьФиксациюБюджетаПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьДатыЗапретаИзмененияПриИзмененииНаСервере()
	
	Константы.ИспользоватьДатыЗапретаИзменения.Установить(ИспользоватьДатыЗапретаИзменения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДатыЗапретаИзмененияПриИзменении(Элемент)
	
	ИспользоватьДатыЗапретаИзмененияПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ВестиПартионныйУчетПоСкладамПриИзмененииНаСервере()
	
	Константы.бит_му_ВестиПартионныйУчетПоСкладам.Установить(ВестиПартионныйУчетПоСкладам);
	
КонецПроцедуры

&НаКлиенте
Процедура ВестиПартионныйУчетПоСкладамПриИзменении(Элемент)
	
	ВестиПартионныйУчетПоСкладамПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ВестиУчетПоТипамПроводокПриИзмененииНаСервере()
	
	Константы.бит_ВестиУчетПоТипамПроводок.Установить(ВестиУчетПоТипамПроводок);
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ВестиУчетПоТипамПроводокПриИзменении(Элемент)
	
	ВестиУчетПоТипамПроводокПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьСторнируемыеПроводкиПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьСторнируемыеПроводки.Установить(ИспользоватьСторнируемыеПроводки);
	ОбновитьИнтерфейс = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСторнируемыеПроводкиПриИзменении(Элемент)
	
	ИспользоватьСторнируемыеПроводкиПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПроводитьОперацииПослеУтвержденияПриИзмененииНаСервере()
	
	Константы.бит_му_ПроводитьОперацииПослеУтверждения.Установить(ПроводитьОперацииПослеУтверждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводитьОперацииПослеУтвержденияПриИзменении(Элемент)
	
	ПроводитьОперацииПослеУтвержденияПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ГлубинаХраненияИсторииАлгоритмовПриИзмененииНаСервере()
	
	Константы.бит_ГлубинаХраненияИсторииАлгоритмов.Установить(ГлубинаХраненияИсторииАлгоритмов);
	
КонецПроцедуры

&НаКлиенте
Процедура ГлубинаХраненияИсторииАлгоритмовПриИзменении(Элемент)
	
	ГлубинаХраненияИсторииАлгоритмовПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьЭлектронныеПодписиПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьЭлектронныеПодписи.Установить(ИспользоватьЭлектронныеПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЭлектронныеПодписиПриИзменении(Элемент)
	
	ИспользоватьЭлектронныеПодписиПриИзмененииНаСервере();
	ПриЗапросеНастроекКлиентаЛицензирования();
	
КонецПроцедуры

&НаСервере
Процедура РежимОбновленияПеречняВизПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(РежимОбновленияПеречняВиз) Тогда
		Константы.бит_РежимОбновленияПеречняВиз.Установить(РежимОбновленияПеречняВиз);
	Иначе
		РежимОбновленияПеречняВиз = Константы.бит_РежимОбновленияПеречняВиз.Получить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОбновленияПеречняВизПриИзменении(Элемент)
	
	РежимОбновленияПеречняВизПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьАвтоСогласованиеПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьАвтоСогласование.Установить(ИспользоватьАвтоСогласование);
	ОбновитьИнтерфейс = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтоСогласованиеПриИзменении(Элемент)
	
	ИспользоватьАвтоСогласованиеПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРазделениеДоступаНаУровнеБазыПриИзменении(Элемент)
	
	ИспользоватьРазделениеДоступаНаУровнеБазыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьМДМПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьМДМ.Установить(ИспользоватьМДМ);
	ОбновитьИнтерфейс = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМДМПриИзменении(Элемент)
	
	ИспользоватьМДМПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
		
КонецПроцедуры

&НаСервере
Процедура ИспользоватьМеханизмОповещенийПриИзмененииНаСервере()
	
	Константы.бит_фн_ИспользоватьМеханизмОповещений.Установить(ИспользоватьМеханизмОповещений);
	Элементы.НастройкиОповещений.Видимость = ИспользоватьМеханизмОповещений;
	ОбновитьИнтерфейс = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМеханизмОповещенийПриИзменении(Элемент)
	
	ИспользоватьМеханизмОповещенийПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьПодключениеКВнешнимБазамПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьПодключениеКВнешнимБазам.Установить(ИспользоватьПодключениеКВнешнимБазам);
	ОбновитьИнтерфейс = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПодключениеКВнешнимБазамПриИзменении(Элемент)
	
	ИспользоватьПодключениеКВнешнимБазамПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьТелеграмПриИзмененииНаСервере()
	
	Константы.бит_ПолучатьИнформациюОтБотаТелеграм.Установить(ИспользоватьТелеграм);
	Если НЕ ИспользоватьТелеграм Тогда
		ОповещенияВТелеграмОНовыхВизах = Ложь;
		Константы.бит_ОповещенияВТелеграмОНовыхВизах.Установить(ОповещенияВТелеграмОНовыхВизах);
	КонецЕсли;
	ОбновитьИнтерфейс = Истина;
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТелеграмПриИзменении(Элемент)
	
	ИспользоватьТелеграмПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОповещенияВТелеграмОНовыхВизахПриИзмененииНаСервере()
	
	Константы.бит_ОповещенияВТелеграмОНовыхВизах.Установить(ОповещенияВТелеграмОНовыхВизах);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещенияВТелеграмОНовыхВизахПриИзменении(Элемент)
	
	ОповещенияВТелеграмОНовыхВизахПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьЭлектроннуюПочтуДляВизированияПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьЭлектроннуюПочтуДляВизирования.Установить(ИспользоватьЭлектроннуюПочтуДляВизирования);
	ОбновитьИнтерфейс = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЭлектроннуюПочтуДляВизированияПриИзменении(Элемент)
	
	ИспользоватьЭлектроннуюПочтуДляВизированияПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура КодировкаФайловВложенийБезСигнатурыПриИзмененииНаСервере()
	
	Константы.бит_КодировкаФайловВложенийБезСигнатуры.Установить(КодировкаФайловВложенийБезСигнатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура КодировкаФайловВложенийБезСигнатурыПриИзменении(Элемент)
	
	КодировкаФайловВложенийБезСигнатурыПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьДелопроизводствоПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьДелопроизводство.Установить(ИспользоватьДелопроизводство);
	ОбновитьИнтерфейс = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДелопроизводствоПриИзменении(Элемент)
	
	ИспользоватьДелопроизводствоПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьPowerBIПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьPowerBI.Установить(ИспользоватьPowerBI);
	ОбновитьИнтерфейс = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьPowerBIПриИзменении(Элемент)
	
	ИспользоватьPowerBIПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗатратыПланируютсяСНДСПриИзмененииНеСервере()
	
	Константы.бит_пз_ЗатратыПланируютсяСНДС.Установить(ЗатратыПланируютсяСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыПланируютсяСНДСПриИзменении(Элемент)
	
	ЗатратыПланируютсяСНДСПриИзмененииНеСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

#Область Казначейство
	
&НаСервере
Процедура ИспользоватьПрогнозыПлатежейИПоступленийДСПриИзмененииНаСервере()
	
	Константы.бит_кзн_ИспользоватьПрогнозыПлатежейИПоступленийДС.Установить(ИспользоватьПрогнозыПлатежейИПоступленийДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПрогнозыПлатежейИПоступленийДСПриИзменении(Элемент)
	
	ИспользоватьПрогнозыПлатежейИПоступленийДСПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура РежимОтображенияОстатковДСПриИзмененииНаСервере()
	
	Константы.бит_кзн_РежимОтображенияОстатковДС.Установить(РежимОтображенияОстатковДС);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтображенияОстатковДСПриИзменении(Элемент)
	
	РежимОтображенияОстатковДСПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура НеСоздаватьДокументыПоступленияПриИзмененииНаСервере()
	
	Константы.бит_кзн_НеСоздаватьДокументыПоступления.Установить(НеСоздаватьДокументыПоступления);
	
КонецПроцедуры

&НаКлиенте
Процедура НеСоздаватьДокументыПоступленияПриИзменении(Элемент)
	
	НеСоздаватьДокументыПоступленияПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ВключатьПлатежнуюПозициюВНесколькоРеестровПриИзмененииНаСервере()
	
	Константы.бит_ВключатьПлатежнуюПозициюВНесколькоРеестров.Установить(ВключатьПлатежнуюПозициюВНесколькоРеестров);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьПлатежнуюПозициюВНесколькоРеестровПриИзменении(Элемент)
	
	ВключатьПлатежнуюПозициюВНесколькоРеестровПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);

КонецПроцедуры

&НаСервере
Процедура ЗапретитьИзменениеЗаявкиВключеннойВРеестрПриИзмененииНаСервере()
	
	Константы.бит_ЗапретитьИзменениеЗаявкиВключеннойВРеестр.Установить(ЗапретитьИзменениеЗаявкиВключеннойВРеестр);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьИзменениеЗаявкиВключеннойВРеестрПриИзменении(Элемент)
	
	ЗапретитьИзменениеЗаявкиВключеннойВРеестрПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);

КонецПроцедуры

&НаСервере
Процедура ОплатаЗаявокНаРасходованиеДСТолькоИзРеестраПриИзмененииНаСервере()
	
	Константы.бит_ОплатаЗаявокНаРасходованиеДСТолькоИзРеестра.Установить(ОплатаЗаявокНаРасходованиеДСТолькоИзРеестра);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаЗаявокНаРасходованиеДСТолькоИзРеестраПриИзменении(Элемент)
	
	ОплатаЗаявокНаРасходованиеДСТолькоИзРеестраПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ИспользоватьПодсистемуПланированияЗатратПриИзмененииНаСервере()
	
	Константы.бит_пз_ИспользоватьПодсистемуПланированияЗатрат.Установить(ИспользоватьПодсистемуПланированияЗатрат);
	ОбновитьИнтерфейс = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПодсистемуПланированияЗатратПриИзменении(Элемент)
	
	ИспользоватьПодсистемуПланированияЗатратПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьГруппыДоступаЦФОСтатьиОборотовПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьГруппыДоступаЦФОСтатьиОборотов.Установить(ИспользоватьГруппыДоступаЦФОСтатьиОборотов);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГруппыДоступаЦФОСтатьиОборотовПриИзменении(Элемент)
	
	ИспользоватьГруппыДоступаЦФОСтатьиОборотовПриИзмененииНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьРазделениеДоступаНаУровнеБазыПриИзмененииНаСервере()
	
	Константы.бит_ИспользоватьРазделениеДоступаНаУровнеБазы.Установить(ИспользоватьРазделениеДоступаНаУровнеБазы);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаЛицензированияПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("СистемаЛицензированияЗавершение", ЭтотОбъект); 
	ТекстСообщения = НСтр("ru = 'Потребует перезапуск клиента 1С. Продолжить?';
						|en = 'It will require a restart of the 1C client. Continue?'");
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
 
// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура СистемаЛицензированияЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	ОчиститьСообщения();
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Результат = СистемаЛицензированияПриИзмененииНаСервере();
		Если Результат Тогда
			ЗавершитьРаботуСистемы(Ложь, Истина)
		КонецЕсли;
	Иначе
		Если СистемаЛицензирования = 1 Тогда
			СистемаЛицензирования = 2;
		Иначе	
			СистемаЛицензирования = 1;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция СистемаЛицензированияПриИзмененииНаСервере()
	
	Результат = УстановитьМонопольныйРежимСервер(Истина);
	Если Результат Тогда
		Если СистемаЛицензирования = 1 Тогда
			Константы.бит_СистемаЛицензирования10.Установить(Истина);
		Иначе	
			Константы.бит_СистемаЛицензирования20.Установить(Истина);
		КонецЕсли;
	Иначе
		Если СистемаЛицензирования = 1 Тогда
			СистемаЛицензирования = 2;
		Иначе	
			СистемаЛицензирования = 1;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиНастройкиФиксацииБюджета(Команда)
	
	ТекстСообщения1 = НСтр("ru = 'Не рекомендуется одновременно использовать ""Фиксацию бюджета"" и запрет изменения данных по разделу ""Бюджетирование"".'");
	ТекстСообщения2 = НСтр("ru = 'После переноса настроек отключите ""Фиксацию бюджета"".'");
	ТекстСообщения = ТекстСообщения1 + Символы.ПС + ТекстСообщения2;
	
	Оповещение = Новый ОписаниеОповещения("ПеренестиНастройкиФиксацииБюджетаЗавершение", ЭтотОбъект); 
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПеренестиНастройкиФиксацииБюджетаЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ПеренестиНастройкиФиксацииБюджетаНаСервере();
		ТекстСообщения = НСтр("ru = 'Настройки перенесены'");
		Пояснение	   = НСтр("ru = 'Проверить даты запрета изменения'"); 
		ПоказатьОповещениеПользователя(ТекстСообщения, 
			"e1cib/command/РегистрСведений.ДатыЗапретаИзменения.Команда.ДатыЗапретаИзмененияДанных", Пояснение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НастроитьДатыЗапретаИзменения(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ДатыЗапретаИзменения") Тогда
		МодульДатыЗапретаИзмененияСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ДатыЗапретаИзмененияСлужебныйКлиент");
		МодульДатыЗапретаИзмененияСлужебныйКлиент.ОткрытьДатыЗапретаИзмененияДанных(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПоставкам(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ОткрытьФорму("Отчет.бит_ОтчетПоПоставкам.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанныеКонстант()
	
	ВалютаУправленческогоУчета                        = Константы.бит_ВалютаУправленческогоУчета.Получить();
	ОтключитьАвтоматическоеЗаполнениеАналитикШапки    = Константы.бит_ОтключитьАвтоматическоеЗаполнениеАналитикШапки.Получить();
	РежимАвтоЗаполненияАналитик                       = Константы.бит_РежимАвтоЗаполненияАналитик.Получить();
	
	ИспользоватьНормыВБюджетировании     = Константы.бит_ИспользоватьНормыВБюджетировании.Получить();
	ПроводитьДокументыПослеУтверждения   = Константы.бит_ПроводитьДокументыПослеУтверждения.Получить();
	ЗатратыПланируютсяСНДС               = Константы.бит_пз_ЗатратыПланируютсяСНДС.Получить();
	ИспользоватьФиксациюБюджета          = Константы.бит_ИспользоватьФиксациюБюджета.Получить();
	ИспользоватьДатыЗапретаИзменения     = Константы.ИспользоватьДатыЗапретаИзменения.Получить();
	
	ИспользоватьПрогнозыПлатежейИПоступленийДС  = Константы.бит_кзн_ИспользоватьПрогнозыПлатежейИПоступленийДС.Получить();
	РежимОтображенияОстатковДС                  = Константы.бит_кзн_РежимОтображенияОстатковДС.Получить();
	НеСоздаватьДокументыПоступления             = Константы.бит_кзн_НеСоздаватьДокументыПоступления.Получить();
	ВключатьПлатежнуюПозициюВНесколькоРеестров  = Константы.бит_ВключатьПлатежнуюПозициюВНесколькоРеестров.Получить();
	ЗапретитьИзменениеЗаявкиВключеннойВРеестр   = Константы.бит_ЗапретитьИзменениеЗаявкиВключеннойВРеестр.Получить();
	ОплатаЗаявокНаРасходованиеДСТолькоИзРеестра = Константы.бит_ОплатаЗаявокНаРасходованиеДСТолькоИзРеестра.Получить();

	ПрочитатьКонстантыМСФО();
	
	ИспользоватьПодсистемуПланированияЗатрат = Константы.бит_пз_ИспользоватьПодсистемуПланированияЗатрат.Получить();
	
	ГлубинаХраненияИсторииАлгоритмов           = Константы.бит_ГлубинаХраненияИсторииАлгоритмов.Получить();
	ИспользоватьЭлектронныеПодписи             = Константы.бит_ИспользоватьЭлектронныеПодписи.Получить();
	РежимОбновленияПеречняВиз                  = Константы.бит_РежимОбновленияПеречняВиз.Получить();
	ИспользоватьАвтоСогласование               = Константы.бит_ИспользоватьАвтоСогласование.Получить();
	
	ИспользоватьГруппыДоступаЦФОСтатьиОборотов   = Константы.бит_ИспользоватьГруппыДоступаЦФОСтатьиОборотов.Получить();
	ИспользоватьРазделениеДоступаНаУровнеБазы    = Константы.бит_ИспользоватьРазделениеДоступаНаУровнеБазы.Получить();
	
	ИспользоватьМДМ                            = Константы.бит_ИспользоватьМДМ.Получить();
	ИспользоватьМеханизмОповещений             = Константы.бит_фн_ИспользоватьМеханизмОповещений.Получить();
	ИспользоватьПодключениеКВнешнимБазам       = Константы.бит_ИспользоватьПодключениеКВнешнимБазам.Получить();
	ИспользоватьТелеграм                       = Константы.бит_ПолучатьИнформациюОтБотаТелеграм.Получить();
	ОповещенияВТелеграмОНовыхВизах             = Константы.бит_ОповещенияВТелеграмОНовыхВизах.Получить();
	ИспользоватьЭлектроннуюПочтуДляВизирования = Константы.бит_ИспользоватьЭлектроннуюПочтуДляВизирования.Получить();
	КодировкаФайловВложенийБезСигнатуры        = Константы.бит_КодировкаФайловВложенийБезСигнатуры.Получить();
	ИспользоватьДелопроизводство               = Константы.бит_ИспользоватьДелопроизводство.Получить();
	ИспользоватьPowerBI                        = Константы.бит_ИспользоватьPowerBI.Получить();
	
	РежимФормированияОтчетов             = Константы.бит_РежимФормированияОтчетов.Получить();
	ИнтервалПроверкиКэша                 = Константы.бит_ИнтервалПроверкиАктуальностиКэшаНастроек.Получить();
	
	ТекущаяВерсияПродукта            = Константы.бит_ТекущаяВерсияПродукта.Получить();
	
	СистемаЛицензирования10 = Константы.бит_СистемаЛицензирования10.Получить();
	Если СистемаЛицензирования10 Тогда
		СистемаЛицензирования = 1;
	Иначе	
		СистемаЛицензирования = 2;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКонстантыМСФО()
	
	Если бит_ОбщегоНазначения.ЭтоУТ() Тогда
		Возврат;
	КонецЕсли;
	
	ВестиПартионныйУчетПоСкладам                = Константы["бит_му_ВестиПартионныйУчетПоСкладам"].Получить();
	ВестиУчетПоТипамПроводок                    = Константы["бит_ВестиУчетПоТипамПроводок"].Получить();
	ИспользоватьСторнируемыеПроводки            = Константы["бит_ИспользоватьСторнируемыеПроводки"].Получить();
	ПроводитьОперацииПослеУтверждения           = Константы["бит_му_ПроводитьОперацииПослеУтверждения"].Получить();
	
КонецПроцедуры

// Процедура управляет отображением элементов формы.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Элементы.РежимФормированияОтчетов.ТолькоПросмотр		  = бит_ОбщегоНазначения.ЭтоФайловаяИБ();
	Элементы.ЗаполнитьТипыПроводок.Доступность			      = ВестиУчетПоТипамПроводок;
	Элементы.ИспользоватьЭлектронныеПодписи.Видимость	      = Константы.ИспользоватьЭлектронныеПодписи.Получить();
	
	Элементы.ОповещенияВТелеграмОНовыхВизах.Доступность       = ИспользоватьТелеграм;
	Элементы.ОповещенияВТелеграмОНовыхВизахОтступ.Видимость   =
		ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(Метаданные.Константы.бит_ОповещенияВТелеграмОНовыхВизах);
		
	Элементы.КодировкаФайловВложенийБезСигнатурыОтступ.Видимость =
		ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(Метаданные.Константы.бит_КодировкаФайловВложенийБезСигнатуры);
		
	Элементы.ТекущаяВерсияПродукта.Доступность	= бит_ПолныеПрава.ДоступностьОбщихНастроек();
	Элементы.НастройкиОповещений.Видимость		= Константы.бит_фн_ИспользоватьМеханизмОповещений.Получить();
	
КонецПроцедуры

// Процедура определяет доступность редактирования валюты регламентированного учета.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура ОпределитьДоступностьРедактированияВалютыРегламентированногоУчета()

	УстановитьПривилегированныйРежим(Истина);
			
	// Запрос по регистрам "бит_ОборотыПоБюджетам", "бит_ПланируемыйРасходДенежныхСредств" 
	// и "бит_ПланируемоеПоступлениеДенежныхСредств" на предмет наличия в них записей.  
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ОборотыПоБюджетам.Период
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам КАК бит_ОборотыПоБюджетам
	|";
	Если Метаданные.РегистрыНакопления.Найти("бит_ПланируемыйРасходДенежныхСредств") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	бит_ПланируемыйРасходДенежныхСредств.Период
		|ИЗ
		|	РегистрНакопления.бит_ПланируемыйРасходДенежныхСредств КАК бит_ПланируемыйРасходДенежныхСредств
		|";
	КонецЕсли;
	Если Метаданные.РегистрыНакопления.Найти("бит_ПланируемоеПоступлениеДенежныхСредств") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	бит_ПланируемоеПоступлениеДенежныхСредств.Период
		|ИЗ
		|	РегистрНакопления.бит_ПланируемоеПоступлениеДенежныхСредств КАК бит_ПланируемоеПоступлениеДенежныхСредств
		|";
	КонецЕсли;
	
	// Если результат запроса не пустой, то запрещаем изменение валюты и меняем надпись.
	Если Не Запрос.Выполнить().Пустой() Тогда
		Элементы.ВалютаУправленческогоУчета.ТолькоПросмотр = Истина;
		Элементы.НадписьПредупреждение.Заголовок = НСтр("ru = 'Изменение валюты запрещено, так как есть проведенные документы в подсистемах ""Бюджетирование"" и ""Казначейство""';
						  	  							|en = 'Изменение валюты запрещено, так как есть проведенные документы в подсистемах ""Бюджетирование"" и ""Казначейство""'");
		Элементы.НадписьПредупреждение.ЦветТекста = ЦветаСтиля.бит_ЦветТекстаКрасный;
	Иначе
		Элементы.ВалютаУправленческогоУчета.ТолькоПросмотр = бит_ОбщегоНазначения.ЭтоСемействоERP();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписки()

	Список = бит_ЛицензированиеБФСерверПереопределяемый.ВерсииПродуктов();
	Список.Вставить(0,"", "АВТО");
	Для каждого Элемент Из Список Цикл	
		Элементы.ТекущаяВерсияПродукта.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);	
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Функция ТекущаяВерсияПродуктаПриИзмененииНаСервере()
	
	Успех = бит_ЛицензированиеБФСерверПереопределяемый.УстановитьВерсиюРешения(ТекущаяВерсияПродукта);
	
	ТекущаяВерсияПродукта = Константы.бит_ТекущаяВерсияПродукта.Получить();
	
	ОбъектПроверки = Метаданные.Константы.бит_ПолучатьИнформациюОтБотаТелеграм;
	Если ИспользоватьТелеграм
		И НЕ ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОбъектПроверки) Тогда
		ОповещенияВТелеграмОНовыхВизах = Ложь;
		ИспользоватьТелеграм           = Ложь;
		Константы.бит_ОповещенияВТелеграмОНовыхВизах.Установить(ОповещенияВТелеграмОНовыхВизах);
		Константы.бит_ПолучатьИнформациюОтБотаТелеграм.Установить(ИспользоватьТелеграм);
	КонецЕсли;
	
	ОбъектПроверки = Метаданные.Константы.бит_ИспользоватьЭлектроннуюПочтуДляВизирования;
	Если ИспользоватьЭлектроннуюПочтуДляВизирования
		И НЕ ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОбъектПроверки) Тогда
		ИспользоватьЭлектроннуюПочтуДляВизирования = Ложь;
		Константы.бит_ИспользоватьЭлектроннуюПочтуДляВизирования.Установить(ИспользоватьЭлектроннуюПочтуДляВизирования);
	КонецЕсли;
	
	УправлениеГруппойИспользоватьФиксациюБюджета();
	УправлениеВидимостьюДоступностью();
	Если Успех Тогда
		ПрочитатьДанныеКонстант();
	КонецЕсли;
	
	Возврат Успех;
	
КонецФункции

&НаСервере
Процедура ПеренестиНастройкиФиксацииБюджетаНаСервере()
	
	Справочники.бит_КлючиСценарийЦФО.ПеренестиНастойкиФиксации();
	
КонецПроцедуры

&НаСервере
Функция ЕстьНастройкиФиксацииБюджета()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ГраницыФиксацииБюджета.Сценарий КАК Сценарий,
	|	бит_ГраницыФиксацииБюджета.ЦФО КАК ЦФО,
	|	бит_ГраницыФиксацииБюджета.ДатаФиксации КАК ДатаФиксации
	|ИЗ
	|	РегистрСведений.бит_ГраницыФиксацииБюджета КАК бит_ГраницыФиксацииБюджета";
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Процедура УправлениеГруппойИспользоватьФиксациюБюджета()

	Если ПолучитьФункциональнуюОпцию("бит_СТ") Тогда
		
		ДатыЗапретаИзмененияДоступны 	 = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ДатыЗапретаИзменения);
		ЕстьНастройкиФиксации 			 = Ложь;
		
		// См. бит_ДатыЗапретаИзмененияБФ.ПриЗаполненииРазделовДатЗапретаИзменения().
		Раздел = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПолучитьСсылку(Новый УникальныйИдентификатор("cb9767ea-9c3f-4328-9140-64b3ffea3089"));
		
		Если ДатыЗапретаИзмененияДоступны И ИспользоватьДатыЗапретаИзменения И ЗначениеЗаполнено(Раздел) 
			И ПолучитьФункциональнуюОпцию("бит_СТ") Тогда
			ЕстьНастройкиФиксации = ЕстьНастройкиФиксацииБюджета();
		КонецЕсли;
		
		Если ДатыЗапретаИзмененияДоступны Тогда
			Элементы.НастроитьДатыЗапретаИзменения.Доступность 	 = ИспользоватьДатыЗапретаИзменения;
			Элементы.ПеренестиНастройкиФиксацииБюджета.Видимость = ЕстьНастройкиФиксации;
		Иначе	
			Элементы.ИспользоватьДатыЗапретаИзменения.Видимость  = Ложь;
			Элементы.НастроитьДатыЗапретаИзменения.Видимость 	 = Ложь;
			Элементы.ПеренестиНастройкиФиксацииБюджета.Видимость = Ложь;
		КонецЕсли;
	Иначе 
		Элементы.ИспользоватьДатыЗапретаИзменения.Видимость  = Ложь;
		Элементы.НастроитьДатыЗапретаИзменения.Видимость 	 = Ложь;
		Элементы.ПеренестиНастройкиФиксацииБюджета.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьМонопольныйРежимСервер(Режим)
	
	Результат = Истина;
	Если МонопольныйРежим() <> Режим Тогда
		Попытка
			УстановитьМонопольныйРежим(Режим);
		Исключение
			Результат = Ложь;
			ТекстСообщения = НСтр("ru = 'Невозможно изменить версию системы лицензирования, в программе работают другие пользователи. Требуется монопольный доступ.';
								|en = 'It is impossible to change the version of the licensing system, other users work in the program. Requires exclusive access.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти