
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураЗначений = Новый Структура;
	СтруктураЗначений.Вставить("РежимЗаписи"					   , Объект.РежимЗаписи);
	СтруктураЗначений.Вставить("ЗагрузитьБезПроверок"			   , Объект.ЗагрузитьБезПроверок);
	СтруктураЗначений.Вставить("ВестиПротоколЗагрузки"			   , Объект.ВестиПротоколЗагрузки);
	СтруктураЗначений.Вставить("СообщатьОЗаписиЭлементов"		   , Объект.СообщатьОЗаписиЭлементов);
	СтруктураЗначений.Вставить("СообщатьОбОшибкахЗаписи"		   , Объект.СообщатьОбОшибкахЗаписи);
	СтруктураЗначений.Вставить("ВыполнятьЧтениеФайлаExcelНаСервере", Объект.ВыполнятьЧтениеФайлаExcelНаСервере);
	
	Закрыть(СтруктураЗначений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()

	Если ЗначениеЗаполнено(Объект.НастройкаДляЗагрузки) Тогда		
		ТипЗагружаемогоОбъекта = Объект.НастройкаДляЗагрузки.ТипЗначенияОбъекта.Получить();
		СимволыДляПоиска 	   = Лев(Строка(ТипЗагружаемогоОбъекта), 3);
		ЭтоРегистрСведений 	   = СимволыДляПоиска = "Рег";		
	Иначе
		ЭтоРегистрСведений = Ложь;
	КонецЕсли;
	
	Элементы.РежимЗаписи.Доступность 		  = Не ЭтоРегистрСведений;
	Элементы.ЗагрузитьБезПроверок.Доступность = Не ЭтоРегистрСведений;
	
КонецПроцедуры // УстановитьВидимость()

#КонецОбласти

