#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

Функция ПараметрыПроведения(ДокументСсылка) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Ссылка, Дата, ОбъектИнвестирования");
	ПараметрыПроведения.Вставить("РеквизитыДокумента", РеквизитыДокумента);
	
	ТаблицыДвижений = Новый Структура;
	ТаблицыДвижений.Вставить("СоставИнвесторов");
	ТаблицыДвижений.СоставИнвесторов = СоставИнвесторовДляОтражения(РеквизитыДокумента);
	
	ПараметрыПроведения.Вставить("ТаблицыДвижений", ТаблицыДвижений);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Процедура СформироватьСоставИнвесторов(Движения, ПараметрыПроведения) Экспорт

	СоставИнвесторов = ПараметрыПроведения.ТаблицыДвижений.СоставИнвесторов;
	
	ДвиженияСоставИнвесторов = Движения.бит_СоставИнвесторов;
	ДвиженияСоставИнвесторов.Записывать = Истина;
	
	Для каждого СтрокаСостава Из СоставИнвесторов Цикл
		Проводка = ДвиженияСоставИнвесторов.Добавить();
		ЗаполнитьЗначенияСвойств(Проводка, СтрокаСостава);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоставИнвесторовДляОтражения(РеквизитыДокумента)
	
	ПериодЗаписи         = НачалоДня(РеквизитыДокумента.Дата);
	ОбъектИнвестирования = РеквизитыДокумента.ОбъектИнвестирования;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставИнвесторов.Ссылка КАК Регистратор,
	|	&ПериодЗаписи КАК Период,
	|	&ОбъектИнвестирования КАК ОбъектИнвестирования,
	|	СоставИнвесторов.Акционер КАК Акционер,
	|	СоставИнвесторов.ДоляВладения КАК ДоляВладения
	|ИЗ
	|	Документ.бит_УтверждениеСоставаИнвесторов.СоставИнвесторов КАК СоставИнвесторов
	|ГДЕ
	|	СоставИнвесторов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",               РеквизитыДокумента.Ссылка);
	Запрос.УстановитьПараметр("ПериодЗаписи",         ПериодЗаписи);
	Запрос.УстановитьПараметр("ОбъектИнвестирования", ОбъектИнвестирования);
	СоставИнвесторов = Запрос.Выполнить().Выгрузить();
	
	Если СоставИнвесторов.Количество() = 0 Тогда
		ПроцентПолногоВладения = 100;
		
		НоваяСтрокаСостава = СоставИнвесторов.Добавить();
		НоваяСтрокаСостава.Регистратор          = РеквизитыДокумента.Ссылка;
		НоваяСтрокаСостава.Период               = ПериодЗаписи;
		НоваяСтрокаСостава.ОбъектИнвестирования = ОбъектИнвестирования;
		НоваяСтрокаСостава.Акционер             = ОбъектИнвестирования;
		НоваяСтрокаСостава.ДоляВладения         = ПроцентПолногоВладения;
	КонецЕсли;
	
	Возврат СоставИнвесторов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
