
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	Если Параметры.Свойство("Задача") Тогда
	
		ЭО = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭО.Использование = Истина;
		ЭО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задача");
		ЭО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭО.ПравоеЗначение = Параметры.Задача;
	
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти
