
&НаКлиенте
Процедура СоздатьНормативнаяПремия(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидПремии", ПредопределенноеЗначение("Перечисление.бит_ВидыРасчетаПремии.Нормативная"));
	
	ОткрытьФорму("Документ.бит_РасчетПремии.ФормаОбъекта", ПараметрыФормы);	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаМногостаночноеОбслуживание(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидПремии", ПредопределенноеЗначение("Перечисление.бит_ВидыРасчетаПремии.ЗаМногостаночноеОбслуживание"));
	
	ОткрытьФорму("Документ.бит_РасчетПремии.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаСложность(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидПремии", ПредопределенноеЗначение("Перечисление.бит_ВидыРасчетаПремии.ЗаСложность"));
	
	ОткрытьФорму("Документ.бит_РасчетПремии.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ПолныеПрава", РольДоступна("ПолныеПрава") 
		ИЛИ РольДоступна("АдминистраторСистемы")
		ИЛИ РольДоступна("бит_НормативнаяПремияПослеПроверкиРедактирование"));
	Список.Параметры.УстановитьЗначениеПараметра("Руководитель", ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписка()
	
	Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ВидПремии) Тогда
		ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидРасчетаПремии");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ВидПремии;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Служба) Тогда
		ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Служба");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Служба;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПремииОтборПриИзменении(Элемент)
	УстановитьОтборСписка();
КонецПроцедуры

&НаКлиенте
Процедура СлужбаОтборПриИзменении(Элемент)
	УстановитьОтборСписка()
КонецПроцедуры
