#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
		
// Функция - автоматически формирует наименование экземпляра отчетов.
//
// Параметры:
//  Параметры	 - Структура - параметры. См. НовыеПараметрыСформироватьАвтонаименование().
// 
// Возвращаемое значение:
//  СтрНаименование - строка.
//
Функция СформироватьАвтоНаименование(Параметры) Экспорт
	
	КодЯзыка = Справочники.бит_Языки.ПолучитьКодЯзыка(Параметры.Язык);	
	СтрФормат = СтрШаблон("Л=%1; ДФ='dd.MM.yyyy'", КодЯзыка);
	
	Если Параметры.НастройкаОтчета.ТипОтчета = Перечисления.бит_ТипыПроизвольныхОтчетов.ОтчетностьМСФО Тогда
		СтрНаименование =  Строка(Параметры.НастройкаОтчета);
		Если ЗначениеЗаполнено(Параметры.ДатаОкончания) Тогда
			СтрНаименование = СтрШаблон(НСтр("ru='%1 на дату %2';en='%1 on the date %2'"),
										СтрНаименование,
										Формат(Параметры.ДатаОкончания, СтрФормат));
		КонецЕсли; 
	Иначе	
		СтрНаименование = Строка(Параметры.НастройкаОтчета);
		Если ЗначениеЗаполнено(Параметры.ДатаНачала) И ЗначениеЗаполнено(Параметры.ДатаОкончания) Тогда
			СтрНаименование = СтрНаименование + ПредставлениеПериода(Параметры.ДатаНачала, КонецДня(Параметры.ДатаОкончания), 
				СтрШаблон("Л=%1; ФП = Истина", КодЯзыка));		
		КонецЕсли; 
	КонецЕсли; 

	Возврат СтрНаименование;
	
КонецФункции

// Функция - конструктор структуры параметров для передачи в функцию "СформироватьАвтонаименование".
// 
// Возвращаемое значение:
//  СтрПар - Структура.
//
Функция НовыеПараметрыСформироватьАвтонаименование() Экспорт

	СтрПар = Новый Структура("НастройкаОтчета, ДатаНачала, ДатаОкончания, Язык");

	Возврат СтрПар;
	
КонецФункции

#КонецОбласти 
 
#КонецЕсли
