#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;
	КонецЕсли; 	
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;	
	
	Для каждого СтрокаТаблицы Из НастройкиПодключений Цикл
	
		Если НЕ СтрокаТаблицы.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза Тогда
		
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НастройкаПодключения) Тогда
				
				ТекстСообщения = НСтр("ru = 'В строке № %1 табличной части ""Настройки подключений"" не указана настройка подключения для вида ИБ ""%2"".'; 
				                      |en = 'In the line N%1 of the tabular section ""Connection Settings"" the connection setting for the information security type ""%2"" is not indicated.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения,
											СтрокаТаблицы.НомерСтроки,
											СтрокаТаблицы.ВидИнформационнойБазы);				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);																			   
			
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЦикла; // НастройкиПодключений
	          	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли