
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НуженПинКодПриИзменении(Элемент)
	
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПроверить(Команда)
	
	ПроверитьТокен(Объект.Токен);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайтиЧаты(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Бот", Объект.Ссылка);
	ОткрытьФорму("Справочник.бит_БотыTelegram.Форма.ФормаСозданияЧатов", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПрокси(Команда)
	
	ОткрытьФорму("ОбщаяФорма.бит_НастройкиПроксиТелеграм");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеЭлементамиФормыКлиент()

	Элементы.ПинКод.Доступность = Объект.НуженПинКод;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

// Процедура выполняет проверку токена.
//
&НаСервереБезКонтекста
Процедура ПроверитьТокен(Знач Токен)
	
	РезультатПроверки = Справочники.бит_БотыTelegram.ПроверитьТокен(Токен);
	
	Если РезультатПроверки.Существует Тогда
		
		ТекстСообщения = НСтр("ru='Проверка выполнена успешно.';en='Verification was successful.'");
		
	Иначе	
		
		ТекстСообщения = НСтр("ru='Ошибка выполнения проверки. %1.';en='Run-time error checking. %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, РезультатПроверки.Сообщение);
		
	КонецЕсли; 
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти
