Функция УстановкаЦенНоменклатуры(ДокументКалькуляции) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	МножителиПартийИПолуфабрикатов.Продукция КАК Продукция,
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	МножителиПартийИПолуфабрикатов.Назначение КАК Назначение,
		|	МАКСИМУМ(МножителиПартийИПолуфабрикатов.Калькуляция.Дата) КАК Период
		|ПОМЕСТИТЬ ПериодыКалькуляций
		|ИЗ
		|	РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
		|ГДЕ
		|	(МножителиПартийИПолуфабрикатов.Калькуляция.Дата <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|			ИЛИ &Период = ДАТАВРЕМЯ(1, 1, 1))
		|	И МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
		|{ГДЕ
		|	МножителиПартийИПолуфабрикатов.Калькуляция.*}
		|
		|СГРУППИРОВАТЬ ПО
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции,
		|	МножителиПартийИПолуфабрикатов.Продукция,
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции,
		|	МножителиПартийИПолуфабрикатов.Назначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ЗначенияПоУмолчаниюЗначения.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_Признаки
		|ИЗ
		|	Справочник.бит_ЗначенияПоУмолчанию.Значения КАК бит_ЗначенияПоУмолчаниюЗначения
		|ГДЕ
		|	бит_ЗначенияПоУмолчаниюЗначения.Ссылка.ИмяПредопределенныхДанных = ""ПризнакиДляРасчетаАгрегКоэффициента""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПериодыКалькуляций.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	ПериодыКалькуляций.Продукция КАК Продукция,
		|	ПериодыКалькуляций.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ПериодыКалькуляций.Назначение КАК Назначение,
		|	МАКСИМУМ(МножителиПартийИПолуфабрикатов.Калькуляция) КАК Калькуляция
		|ПОМЕСТИТЬ ПоследниеКалькуляции
		|ИЗ
		|	ПериодыКалькуляций КАК ПериодыКалькуляций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
		|		ПО ПериодыКалькуляций.Период = МножителиПартийИПолуфабрикатов.Калькуляция.Дата
		|			И ПериодыКалькуляций.ПартияСпецификацияПродукции = МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции
		|			И ПериодыКалькуляций.Продукция = МножителиПартийИПолуфабрикатов.Продукция
		|			И ПериодыКалькуляций.ХарактеристикаПродукции = МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции
		|			И ПериодыКалькуляций.Назначение = МножителиПартийИПолуфабрикатов.Назначение
		|ГДЕ
		|	МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыКалькуляций.ПартияСпецификацияПродукции,
		|	ПериодыКалькуляций.Продукция,
		|	ПериодыКалькуляций.ХарактеристикаПродукции,
		|	ПериодыКалькуляций.Назначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоследниеКалькуляции.Продукция КАК Продукция,
		|	ПоследниеКалькуляции.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ПоследниеКалькуляции.Назначение КАК Назначение,
		|	ПоследниеКалькуляции.Калькуляция КАК Калькуляция,
		|	ПоследниеКалькуляции.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	СУММА(МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката) КАК ВсегоКоличество
		|ПОМЕСТИТЬ РассчитанноеКоличество
		|ИЗ
		|	ПоследниеКалькуляции КАК ПоследниеКалькуляции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
		|		ПО ПоследниеКалькуляции.Калькуляция = МножителиПартийИПолуфабрикатов.Калькуляция
		|			И ПоследниеКалькуляции.ПартияСпецификацияПродукции = МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции
		|			И ПоследниеКалькуляции.Продукция = МножителиПартийИПолуфабрикатов.Продукция
		|			И ПоследниеКалькуляции.ХарактеристикаПродукции = МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции
		|			И ПоследниеКалькуляции.Назначение = МножителиПартийИПолуфабрикатов.Назначение
		|			И (МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|ГДЕ
		|	МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоследниеКалькуляции.Продукция,
		|	ПоследниеКалькуляции.ХарактеристикаПродукции,
		|	ПоследниеКалькуляции.Назначение,
		|	ПоследниеКалькуляции.Калькуляция,
		|	ПоследниеКалькуляции.ПартияСпецификацияПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РассчитанноеКоличество.Продукция КАК Продукция,
		|	РассчитанноеКоличество.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	РассчитанноеКоличество.Назначение КАК Назначение,
		|	РассчитанноеКоличество.Калькуляция КАК Калькуляция,
		|	РассчитанноеКоличество.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	КалькуляцияПродукцииОбъектыКалькуляции.Количество / РассчитанноеКоличество.ВсегоКоличество КАК ДоляСтоимости
		|ПОМЕСТИТЬ ДолиСтоимостиОтРассчитанногоКоличества
		|ИЗ
		|	РассчитанноеКоличество КАК РассчитанноеКоличество
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2.ОбъектыКалькуляции КАК КалькуляцияПродукцииОбъектыКалькуляции
		|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукцииОбъектыКалькуляции.Ссылка
		|			И РассчитанноеКоличество.Продукция = КалькуляцияПродукцииОбъектыКалькуляции.Номенклатура
		|			И РассчитанноеКоличество.ХарактеристикаПродукции = КалькуляцияПродукцииОбъектыКалькуляции.Характеристика
		|			И РассчитанноеКоличество.Назначение = КалькуляцияПродукцииОбъектыКалькуляции.Назначение
		|			И РассчитанноеКоличество.ПартияСпецификацияПродукции = КалькуляцияПродукцииОбъектыКалькуляции.Объект
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2 КАК КалькуляцияПродукции
		|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукции.Ссылка
		|ГДЕ
		|	КалькуляцияПродукции.ОбъектКалькуляции = ЗНАЧЕНИЕ(Перечисление.ОбъектыКалькуляции.РесурснаяСпецификация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РассчитанноеКоличество.Продукция,
		|	РассчитанноеКоличество.ХарактеристикаПродукции,
		|	РассчитанноеКоличество.Назначение,
		|	РассчитанноеКоличество.Калькуляция,
		|	РассчитанноеКоличество.ПартияСпецификацияПродукции,
		|	КалькуляцияПродукцииОбъектыКалькуляции.Количество / РассчитанноеКоличество.ВсегоКоличество
		|ИЗ
		|	РассчитанноеКоличество КАК РассчитанноеКоличество
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2.ОбъектыКалькуляции КАК КалькуляцияПродукцииОбъектыКалькуляции
		|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукцииОбъектыКалькуляции.Ссылка
		|			И РассчитанноеКоличество.Продукция = КалькуляцияПродукцииОбъектыКалькуляции.Номенклатура
		|			И РассчитанноеКоличество.ХарактеристикаПродукции = КалькуляцияПродукцииОбъектыКалькуляции.Характеристика
		|			И РассчитанноеКоличество.Назначение = КалькуляцияПродукцииОбъектыКалькуляции.Назначение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2 КАК КалькуляцияПродукции
		|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукции.Ссылка
		|ГДЕ
		|	НЕ КалькуляцияПродукции.ОбъектКалькуляции = ЗНАЧЕНИЕ(Перечисление.ОбъектыКалькуляции.РесурснаяСпецификация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МножителиПартийИПолуфабрикатов.Калькуляция КАК Калькуляция,
		|	МножителиПартийИПолуфабрикатов.Продукция КАК Продукция,
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	МножителиПартийИПолуфабрикатов.Полуфабрикат КАК Полуфабрикат,
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
		|	СУММА(МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката * ДолиСтоимости.ДоляСтоимости) КАК КоличествоПолуфабриката,
		|	СУММА(МножителиПартийИПолуфабрикатов.Числитель * ДолиСтоимости.ДоляСтоимости) КАК Числитель,
		|	МножителиПартийИПолуфабрикатов.Знаменатель КАК Знаменатель,
		|	МножителиПартийИПолуфабрикатов.ПартияВыпущена КАК ПартияВыпущена,
		|	ВЫБОР
		|		КОГДА МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоПродукция,
		|	МножителиПартийИПолуфабрикатов.Назначение КАК Назначение,
		|	СУММА(ДолиСтоимости.ДоляСтоимости) КАК ДоляСтоимости,
		|	МИНИМУМ(МножителиПартийИПолуфабрикатов.Порядок) КАК Порядок,
		|	МножителиПартийИПолуфабрикатов.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
		|	МножителиПартийИПолуфабрикатов.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
		|	МножителиПартийИПолуфабрикатов.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения
		|ПОМЕСТИТЬ ОбщиеМножители
		|ИЗ
		|	РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДолиСтоимостиОтРассчитанногоКоличества КАК ДолиСтоимости
		|		ПО МножителиПартийИПолуфабрикатов.Калькуляция = ДолиСтоимости.Калькуляция
		|			И МножителиПартийИПолуфабрикатов.Продукция = ДолиСтоимости.Продукция
		|			И МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции = ДолиСтоимости.ХарактеристикаПродукции
		|			И МножителиПартийИПолуфабрикатов.Назначение = ДолиСтоимости.Назначение
		|			И МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции = ДолиСтоимости.ПартияСпецификацияПродукции
		|ГДЕ
		|	МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
		|
		|СГРУППИРОВАТЬ ПО
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции,
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции,
		|	МножителиПартийИПолуфабрикатов.Продукция,
		|	МножителиПартийИПолуфабрикатов.Калькуляция,
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката,
		|	МножителиПартийИПолуфабрикатов.Полуфабрикат,
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПолуфабриката,
		|	МножителиПартийИПолуфабрикатов.ПартияВыпущена,
		|	МножителиПартийИПолуфабрикатов.Знаменатель,
		|	ВЫБОР
		|		КОГДА МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	МножителиПартийИПолуфабрикатов.Назначение,
		|	МножителиПартийИПолуфабрикатов.бит_КомпенсирующийКоэффициент,
		|	МножителиПартийИПолуфабрикатов.бит_АгрегирующийКоэффициент,
		|	МножителиПартийИПолуфабрикатов.бит_ПроцентВыполнения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбщиеМножители.Калькуляция КАК Калькуляция,
		|	ОбщиеМножители.Продукция КАК Продукция,
		|	ОбщиеМножители.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ОбщиеМножители.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	ОбщиеМножители.Полуфабрикат КАК Полуфабрикат,
		|	ОбщиеМножители.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
		|	ОбщиеМножители.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
		|	Себестоимость.Количество КАК КоличествоПолуфабриката,
		|	ОбщиеМножители.Числитель КАК Числитель,
		|	ОбщиеМножители.Знаменатель КАК Знаменатель,
		|	ОбщиеМножители.ПартияВыпущена КАК ПартияВыпущена,
		|	ОбщиеМножители.ЭтоПродукция КАК ЭтоПродукция,
		|	ОбщиеМножители.Назначение КАК Назначение,
		|	ОбщиеМножители.ДоляСтоимости КАК ДоляСтоимости,
		|	Себестоимость.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ОбщиеМножители.Порядок КАК Порядок,
		|	ОбщиеМножители.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
		|	ОбщиеМножители.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
		|	ОбщиеМножители.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения
		|ПОМЕСТИТЬ ОбщиеМножителиСАналитикойПартии
		|ИЗ
		|	ОбщиеМножители КАК ОбщиеМножители
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитики
		|			ПО Себестоимость.АналитикаУчетаНоменклатуры = Аналитики.Ссылка
		|		ПО (Себестоимость.Партия = ОбщиеМножители.ПартияСпецификацияПродукции)
		|			И (Аналитики.Номенклатура = ОбщиеМножители.Продукция)
		|			И (Аналитики.Характеристика = ОбщиеМножители.ХарактеристикаПродукции)
		|			И (Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|			И (Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции))
		|			И (Себестоимость.Количество > 0)
		|			И (Себестоимость.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка))
		|ГДЕ
		|	ОбщиеМножители.ПартияВыпущена
		|	И ОбщиеМножители.ЭтоПродукция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Множители.Калькуляция КАК Калькуляция,
		|	Множители.Продукция КАК Продукция,
		|	Множители.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	Множители.КоличествоПолуфабриката КАК КоличествоПолуфабриката,
		|	ПлановыеМатериальныеЗатраты.Подразделение КАК Подразделение,
		|	ПлановыеМатериальныеЗатраты.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	ПлановыеМатериальныеЗатраты.Номенклатура КАК Номенклатура,
		|	ПлановыеМатериальныеЗатраты.Характеристика КАК Характеристика,
		|	СУММА(ПлановыеМатериальныеЗатраты.Количество / Множители.Знаменатель * Множители.Числитель) КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ПлановыеМатериальныеЗатраты.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьБезНДС
		|			ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьРегл
		|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель) КАК Стоимость,
		|	ВЫБОР
		|		КОГДА ПлановыеМатериальныеЗатраты.Количество < 0
		|			ТОГДА ""ВозвратныеОтходы""
		|		ИНАЧЕ ""Материальные""
		|	КОНЕЦ КАК ТипЗатрат,
		|	Множители.Продукция.ЕдиницаИзмерения КАК ПродукцияЕдиницаИзмерения,
		|	ПлановыеМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
		|	Множители.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	ПлановыеМатериальныеЗатраты.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
		|	Множители.Продукция КАК Полуфабрикат,
		|	Множители.ХарактеристикаПродукции КАК ХарактеристикаПолуфабриката,
		|	Множители.Назначение КАК Назначение,
		|	Множители.Порядок КАК Порядок,
		|	ВЫБОР
		|		КОГДА &ДанныеПоСебестоимости = 3
		|			ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьЗабалансоваяРегл
		|		ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьЗабалансовая
		|	КОНЕЦ / Множители.Знаменатель * Множители.Числитель КАК Забалансовая,
		|	Множители.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения
		|ПОМЕСТИТЬ ДанныеПредварительные
		|ИЗ
		|	ОбщиеМножители КАК Множители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеМатериальныеЗатраты КАК ПлановыеМатериальныеЗатраты
		|		ПО Множители.Калькуляция = ПлановыеМатериальныеЗатраты.Калькуляция
		|			И Множители.ПартияСпецификацияПродукции = ПлановыеМатериальныеЗатраты.ПартияСпецификация
		|ГДЕ
		|	НЕ Множители.ПартияВыпущена
		|	И Множители.ЭтоПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеМатериальныеЗатраты.Номенклатура,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.Калькуляция,
		|	ПлановыеМатериальныеЗатраты.Характеристика,
		|	ПлановыеМатериальныеЗатраты.СтатьяКалькуляции,
		|	ПлановыеМатериальныеЗатраты.Подразделение,
		|	ВЫБОР
		|		КОГДА ПлановыеМатериальныеЗатраты.Количество < 0
		|			ТОГДА ""ВозвратныеОтходы""
		|		ИНАЧЕ ""Материальные""
		|	КОНЕЦ,
		|	Множители.Продукция.ЕдиницаИзмерения,
		|	ПлановыеМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения,
		|	Множители.ПартияСпецификацияПродукции,
		|	Множители.КоличествоПолуфабриката,
		|	ПлановыеМатериальныеЗатраты.ЭтоПолуфабрикат,
		|	Множители.Назначение,
		|	Множители.Порядок,
		|	ВЫБОР
		|		КОГДА &ДанныеПоСебестоимости = 3
		|			ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьЗабалансоваяРегл
		|		ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьЗабалансовая
		|	КОНЕЦ / Множители.Знаменатель * Множители.Числитель,
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Множители.Калькуляция,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.КоличествоПолуфабриката,
		|	ПлановыеТрудозатраты.Подразделение,
		|	ПлановыеТрудозатраты.СтатьяКалькуляции,
		|	ПлановыеТрудозатраты.ВидРабот,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	СУММА(ПлановыеТрудозатраты.Количество / Множители.Знаменатель * Множители.Числитель),
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|					ИЛИ &ДанныеПоСебестоимости = 2
		|				ТОГДА ПлановыеТрудозатраты.Стоимость
		|			ИНАЧЕ ПлановыеТрудозатраты.СтоимостьРегл
		|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель),
		|	""Трудозатраты"",
		|	Множители.Продукция.ЕдиницаИзмерения,
		|	ПлановыеТрудозатраты.ВидРабот.ЕдиницаИзмерения,
		|	Множители.ПартияСпецификацияПродукции,
		|	ЛОЖЬ,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.Назначение,
		|	Множители.Порядок,
		|	0,
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения
		|ИЗ
		|	ОбщиеМножители КАК Множители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
		|		ПО Множители.Калькуляция = ПлановыеТрудозатраты.Калькуляция
		|			И Множители.ПартияСпецификацияПродукции = ПлановыеТрудозатраты.ПартияСпецификация
		|ГДЕ
		|	НЕ Множители.ПартияВыпущена
		|	И Множители.ЭтоПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеТрудозатраты.ВидРабот,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.Калькуляция,
		|	ПлановыеТрудозатраты.СтатьяКалькуляции,
		|	ПлановыеТрудозатраты.Подразделение,
		|	Множители.Продукция.ЕдиницаИзмерения,
		|	Множители.ПартияСпецификацияПродукции,
		|	Множители.КоличествоПолуфабриката,
		|	ПлановыеТрудозатраты.ВидРабот.ЕдиницаИзмерения,
		|	Множители.Назначение,
		|	Множители.Порядок,
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Множители.Калькуляция,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.КоличествоПолуфабриката,
		|	ПлановыеПрочиеЗатраты.Подразделение,
		|	ПлановыеПрочиеЗатраты.СтатьяКалькуляции,
		|	ПлановыеПрочиеЗатраты.СтатьяРасходов,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	0,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ПлановыеПрочиеЗатраты.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ПлановыеПрочиеЗатраты.СтоимостьБезНДС
		|			ИНАЧЕ ПлановыеПрочиеЗатраты.СтоимостьРегл
		|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель),
		|	ВЫБОР
		|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|			ТОГДА ""ПрочиеПостоянные""
		|		ИНАЧЕ ""ПрочиеПеременные""
		|	КОНЕЦ,
		|	Множители.Продукция.ЕдиницаИзмерения,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
		|	Множители.ПартияСпецификацияПродукции,
		|	ЛОЖЬ,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.Назначение,
		|	Множители.Порядок,
		|	0,
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения
		|ИЗ
		|	ОбщиеМножители КАК Множители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеПрочиеЗатраты КАК ПлановыеПрочиеЗатраты
		|		ПО Множители.Калькуляция = ПлановыеПрочиеЗатраты.Калькуляция
		|			И Множители.ПартияСпецификацияПродукции = ПлановыеПрочиеЗатраты.ПартияСпецификация
		|ГДЕ
		|	НЕ Множители.ПартияВыпущена
		|	И Множители.ЭтоПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеПрочиеЗатраты.СтатьяРасходов,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.Калькуляция,
		|	ПлановыеПрочиеЗатраты.СтатьяКалькуляции,
		|	ПлановыеПрочиеЗатраты.Подразделение,
		|	Множители.Продукция.ЕдиницаИзмерения,
		|	Множители.ПартияСпецификацияПродукции,
		|	Множители.КоличествоПолуфабриката,
		|	Множители.Назначение,
		|	Множители.Порядок,
		|	ВЫБОР
		|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|			ТОГДА ""ПрочиеПостоянные""
		|		ИНАЧЕ ""ПрочиеПеременные""
		|	КОНЕЦ,
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Множители.Калькуляция,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.КоличествоПолуфабриката,
		|	ПлановыеМатериальныеЗатраты.Подразделение,
		|	ПлановыеМатериальныеЗатраты.СтатьяКалькуляции,
		|	ПлановыеМатериальныеЗатраты.Номенклатура,
		|	ПлановыеМатериальныеЗатраты.Характеристика,
		|	СУММА(ПлановыеМатериальныеЗатраты.Количество / Множители.Знаменатель * Множители.Числитель),
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ПлановыеМатериальныеЗатраты.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьБезНДС
		|			ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьРегл
		|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель),
		|	ВЫБОР
		|		КОГДА ПлановыеМатериальныеЗатраты.Количество < 0
		|			ТОГДА ""ВозвратныеОтходы""
		|		ИНАЧЕ ""Материальные""
		|	КОНЕЦ,
		|	Множители.Продукция.ЕдиницаИзмерения,
		|	ПлановыеМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения,
		|	Множители.ПартияСпецификацияПродукции,
		|	ПлановыеМатериальныеЗатраты.ЭтоПолуфабрикат,
		|	Множители.Полуфабрикат,
		|	Множители.ХарактеристикаПолуфабриката,
		|	Множители.Назначение,
		|	Множители.Порядок,
		|	ВЫБОР
		|		КОГДА &ДанныеПоСебестоимости = 3
		|			ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьЗабалансоваяРегл
		|		ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьЗабалансовая
		|	КОНЕЦ / Множители.Знаменатель * Множители.Числитель,
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения
		|ИЗ
		|	ОбщиеМножители КАК Множители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеМатериальныеЗатраты КАК ПлановыеМатериальныеЗатраты
		|		ПО Множители.Калькуляция = ПлановыеМатериальныеЗатраты.Калькуляция
		|			И Множители.ПартияСпецификацияПолуфабриката = ПлановыеМатериальныеЗатраты.ПартияСпецификация
		|ГДЕ
		|	НЕ Множители.ПартияВыпущена
		|	И НЕ Множители.ЭтоПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеМатериальныеЗатраты.Номенклатура,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.Калькуляция,
		|	ПлановыеМатериальныеЗатраты.Характеристика,
		|	ПлановыеМатериальныеЗатраты.СтатьяКалькуляции,
		|	ПлановыеМатериальныеЗатраты.Подразделение,
		|	Множители.Продукция.ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА ПлановыеМатериальныеЗатраты.Количество < 0
		|			ТОГДА ""ВозвратныеОтходы""
		|		ИНАЧЕ ""Материальные""
		|	КОНЕЦ,
		|	ПлановыеМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения,
		|	Множители.ПартияСпецификацияПродукции,
		|	Множители.КоличествоПолуфабриката,
		|	ПлановыеМатериальныеЗатраты.ЭтоПолуфабрикат,
		|	Множители.Полуфабрикат,
		|	Множители.ХарактеристикаПолуфабриката,
		|	Множители.Назначение,
		|	Множители.Порядок,
		|	ВЫБОР
		|		КОГДА &ДанныеПоСебестоимости = 3
		|			ТОГДА ПлановыеМатериальныеЗатраты.СтоимостьЗабалансоваяРегл
		|		ИНАЧЕ ПлановыеМатериальныеЗатраты.СтоимостьЗабалансовая
		|	КОНЕЦ / Множители.Знаменатель * Множители.Числитель,
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Множители.Калькуляция,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.КоличествоПолуфабриката,
		|	ПлановыеТрудозатраты.Подразделение,
		|	ПлановыеТрудозатраты.СтатьяКалькуляции,
		|	ПлановыеТрудозатраты.ВидРабот,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	СУММА(ПлановыеТрудозатраты.Количество / Множители.Знаменатель * Множители.Числитель),
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|					ИЛИ &ДанныеПоСебестоимости = 2
		|				ТОГДА ПлановыеТрудозатраты.Стоимость
		|			ИНАЧЕ ПлановыеТрудозатраты.СтоимостьРегл
		|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель),
		|	""Трудозатраты"",
		|	Множители.Продукция.ЕдиницаИзмерения,
		|	ПлановыеТрудозатраты.ВидРабот.ЕдиницаИзмерения,
		|	Множители.ПартияСпецификацияПродукции,
		|	ЛОЖЬ,
		|	Множители.Полуфабрикат,
		|	Множители.ХарактеристикаПолуфабриката,
		|	Множители.Назначение,
		|	Множители.Порядок,
		|	0,
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения
		|ИЗ
		|	ОбщиеМножители КАК Множители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
		|		ПО Множители.Калькуляция = ПлановыеТрудозатраты.Калькуляция
		|			И Множители.ПартияСпецификацияПолуфабриката = ПлановыеТрудозатраты.ПартияСпецификация
		|ГДЕ
		|	НЕ Множители.ПартияВыпущена
		|	И НЕ Множители.ЭтоПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеТрудозатраты.ВидРабот,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.Калькуляция,
		|	ПлановыеТрудозатраты.СтатьяКалькуляции,
		|	ПлановыеТрудозатраты.Подразделение,
		|	Множители.Продукция.ЕдиницаИзмерения,
		|	Множители.ПартияСпецификацияПродукции,
		|	Множители.КоличествоПолуфабриката,
		|	ПлановыеТрудозатраты.ВидРабот.ЕдиницаИзмерения,
		|	Множители.Полуфабрикат,
		|	Множители.ХарактеристикаПолуфабриката,
		|	Множители.Назначение,
		|	Множители.Порядок,
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Множители.Калькуляция,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.КоличествоПолуфабриката,
		|	ПлановыеПрочиеЗатраты.Подразделение,
		|	ПлановыеПрочиеЗатраты.СтатьяКалькуляции,
		|	ПлановыеПрочиеЗатраты.СтатьяРасходов,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	0,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ПлановыеПрочиеЗатраты.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ПлановыеПрочиеЗатраты.СтоимостьБезНДС
		|			ИНАЧЕ ПлановыеПрочиеЗатраты.СтоимостьРегл
		|		КОНЕЦ / Множители.Знаменатель * Множители.Числитель),
		|	ВЫБОР
		|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|			ТОГДА ""ПрочиеПостоянные""
		|		ИНАЧЕ ""ПрочиеПеременные""
		|	КОНЕЦ,
		|	Множители.Продукция.ЕдиницаИзмерения,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
		|	Множители.ПартияСпецификацияПродукции,
		|	ЛОЖЬ,
		|	Множители.Полуфабрикат,
		|	Множители.ХарактеристикаПолуфабриката,
		|	Множители.Назначение,
		|	Множители.Порядок,
		|	0,
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения
		|ИЗ
		|	ОбщиеМножители КАК Множители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеПрочиеЗатраты КАК ПлановыеПрочиеЗатраты
		|		ПО Множители.Калькуляция = ПлановыеПрочиеЗатраты.Калькуляция
		|			И Множители.ПартияСпецификацияПолуфабриката = ПлановыеПрочиеЗатраты.ПартияСпецификация
		|ГДЕ
		|	НЕ Множители.ПартияВыпущена
		|	И НЕ Множители.ЭтоПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеПрочиеЗатраты.СтатьяРасходов,
		|	Множители.Продукция,
		|	Множители.ХарактеристикаПродукции,
		|	Множители.Калькуляция,
		|	ПлановыеПрочиеЗатраты.СтатьяКалькуляции,
		|	ПлановыеПрочиеЗатраты.Подразделение,
		|	Множители.Продукция.ЕдиницаИзмерения,
		|	Множители.ПартияСпецификацияПродукции,
		|	Множители.КоличествоПолуфабриката,
		|	Множители.Полуфабрикат,
		|	Множители.ХарактеристикаПолуфабриката,
		|	Множители.Назначение,
		|	Множители.Порядок,
		|	ВЫБОР
		|		КОГДА ПлановыеПрочиеЗатраты.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|			ТОГДА ""ПрочиеПостоянные""
		|		ИНАЧЕ ""ПрочиеПеременные""
		|	КОНЕЦ,
		|	Множители.бит_КомпенсирующийКоэффициент,
		|	Множители.бит_АгрегирующийКоэффициент,
		|	Множители.бит_ПроцентВыполнения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура КАК бит_Номенклатура,
		|	1 КАК Признак
		|ПОМЕСТИТЬ АгрегирующиеК
		|ИЗ
		|	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
		|ГДЕ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Признак В
		|			(ВЫБРАТЬ
		|				ВТ_Признаки.Значение КАК Значение
		|			ИЗ
		|				ВТ_Признаки КАК ВТ_Признаки)
		|	И бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура В
		|			(ВЫБРАТЬ
		|				ДанныеПредварительные.Номенклатура КАК Номенклатура
		|			ИЗ
		|				ДанныеПредварительные КАК ДанныеПредварительные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПредварительные.Калькуляция КАК Калькуляция,
		|	ДанныеПредварительные.Продукция КАК Продукция,
		|	ДанныеПредварительные.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ДанныеПредварительные.КоличествоПолуфабриката КАК КоличествоПолуфабриката,
		|	ДанныеПредварительные.Подразделение КАК Подразделение,
		|	ДанныеПредварительные.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	ДанныеПредварительные.Номенклатура КАК Номенклатура,
		|	ДанныеПредварительные.Характеристика КАК Характеристика,
		|	ДанныеПредварительные.Количество КАК Количество,
		|	ДанныеПредварительные.Стоимость КАК Стоимость,
		|	ДанныеПредварительные.ТипЗатрат КАК ТипЗатрат,
		|	ДанныеПредварительные.ПродукцияЕдиницаИзмерения КАК ПродукцияЕдиницаИзмерения,
		|	ДанныеПредварительные.НоменклатураЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
		|	ДанныеПредварительные.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	ДанныеПредварительные.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
		|	ДанныеПредварительные.Полуфабрикат КАК Полуфабрикат,
		|	ДанныеПредварительные.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
		|	ДанныеПредварительные.Назначение КАК Назначение,
		|	ДанныеПредварительные.Порядок КАК Порядок,
		|	ДанныеПредварительные.Забалансовая КАК Забалансовая,
		|	ДанныеПредварительные.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
		|	ВЫБОР
		|		КОГДА ДанныеПредварительные.бит_АгрегирующийКоэффициент = 0
		|			ТОГДА 1
		|		ИНАЧЕ ДанныеПредварительные.бит_АгрегирующийКоэффициент
		|	КОНЕЦ КАК бит_АгрегирующийКоэффициент,
		|	ДанныеПредварительные.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения,
		|	ВЫБОР
		|		КОГДА ДанныеПредварительные.Номенклатура ССЫЛКА Справочник.Номенклатура
		|			ТОГДА ЕСТЬNULL(АгрегирующиеК.Признак, 0)
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Признак
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	ДанныеПредварительные КАК ДанныеПредварительные
		|		ЛЕВОЕ СОЕДИНЕНИЕ АгрегирующиеК КАК АгрегирующиеК
		|		ПО ДанныеПредварительные.Номенклатура = АгрегирующиеК.бит_Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбщиеМножителиСАналитикойПартии.Калькуляция КАК Калькуляция,
		|	ОбщиеМножителиСАналитикойПартии.Продукция КАК Продукция,
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката КАК КоличествоПолуфабриката,
		|	СебестоимостьТоваров.Партия КАК ПартияПроизводства,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения КАК Подразделение,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	СУММА(СебестоимостьТоваров.Количество / ОбщиеМножителиСАналитикойПартии.Знаменатель * ОбщиеМножителиСАналитикойПартии.Числитель) КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл
		|		КОНЕЦ / ОбщиеМножителиСАналитикойПартии.Знаменатель * ОбщиеМножителиСАналитикойПартии.Числитель) КАК Стоимость,
		|	""Материальные"" КАК ТипЗатрат,
		|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения КАК ПродукцияЕдиницаИзмерения,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ОбщиеМножителиСАналитикойПартии.Числитель КАК Числитель,
		|	ОбщиеМножителиСАналитикойПартии.Знаменатель КАК Знаменатель,
		|	ОбщиеМножителиСАналитикойПартии.Продукция КАК Полуфабрикат,
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции КАК ХарактеристикаПолуфабриката,
		|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция КАК ЭтоПродукция,
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции КАК ПартияПолуфабриката,
		|	ОбщиеМножителиСАналитикойПартии.Назначение КАК Назначение,
		|	ОбщиеМножителиСАналитикойПартии.Порядок КАК Порядок,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
		|			ИНАЧЕ СебестоимостьТоваров.СтоимостьЗабалансовая
		|		КОНЕЦ / ОбщиеМножителиСАналитикойПартии.Знаменатель * ОбщиеМножителиСАналитикойПартии.Числитель) КАК Забалансовая,
		|	ОбщиеМножителиСАналитикойПартии.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
		|	ОбщиеМножителиСАналитикойПартии.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
		|	ОбщиеМножителиСАналитикойПартии.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения
		|ПОМЕСТИТЬ ФактическиеЗатраты
		|ИЗ
		|	ОбщиеМножителиСАналитикойПартии КАК ОбщиеМножителиСАналитикойПартии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|		ПО ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции = СебестоимостьТоваров.КорПартия
		|			И ОбщиеМножителиСАналитикойПартии.АналитикаУчетаПартий = СебестоимостьТоваров.КорАналитикаУчетаПартий
		|			И (СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (НЕ СебестоимостьТоваров.Партия = НЕОПРЕДЕЛЕНО)
		|ГДЕ
		|	ОбщиеМножителиСАналитикойПартии.ПартияВыпущена
		|	И ОбщиеМножителиСАналитикойПартии.ЭтоПродукция
		|	И НЕ СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура,
		|	СебестоимостьТоваров.Партия,
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
		|	ОбщиеМножителиСАналитикойПартии.Продукция,
		|	ОбщиеМножителиСАналитикойПартии.Калькуляция,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения,
		|	СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Характеристика,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
		|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения,
		|	ОбщиеМножителиСАналитикойПартии.Знаменатель,
		|	ОбщиеМножителиСАналитикойПартии.Числитель,
		|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция,
		|	ОбщиеМножителиСАналитикойПартии.Назначение,
		|	ОбщиеМножителиСАналитикойПартии.Порядок,
		|	ОбщиеМножителиСАналитикойПартии.бит_КомпенсирующийКоэффициент,
		|	ОбщиеМножителиСАналитикойПартии.бит_АгрегирующийКоэффициент,
		|	ОбщиеМножителиСАналитикойПартии.бит_ПроцентВыполнения,
		|	ОбщиеМножителиСАналитикойПартии.Продукция,
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбщиеМножителиСАналитикойПартии.Калькуляция,
		|	ОбщиеМножителиСАналитикойПартии.Продукция,
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
		|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката,
		|	ПрочиеРасходыНезавершенногоПроизводства.ПартияПроизводства,
		|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
		|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяКалькуляции,
		|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	СУММА(0),
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ПрочиеРасходыНезавершенногоПроизводства.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ПрочиеРасходыНезавершенногоПроизводства.СтоимостьБезНДС
		|			ИНАЧЕ ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРегл
		|		КОНЕЦ * ОбщиеМножителиСАналитикойПартии.ДоляСтоимости),
		|	ВЫБОР
		|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|			ТОГДА ""ПрочиеПостоянные""
		|		ИНАЧЕ ""ПрочиеПеременные""
		|	КОНЕЦ,
		|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		|	ОбщиеМножителиСАналитикойПартии.Числитель,
		|	ОбщиеМножителиСАналитикойПартии.Знаменатель,
		|	ОбщиеМножителиСАналитикойПартии.Продукция,
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
		|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция,
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
		|	ОбщиеМножителиСАналитикойПартии.Назначение,
		|	ОбщиеМножителиСАналитикойПартии.Порядок,
		|	0,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	ОбщиеМножителиСАналитикойПартии КАК ОбщиеМножителиСАналитикойПартии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНезавершенногоПроизводства
		|		ПО ОбщиеМножителиСАналитикойПартии.Продукция = ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура
		|			И ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции = ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Характеристика
		|			И ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции = ПрочиеРасходыНезавершенногоПроизводства.Регистратор
		|			И (ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И ОбщиеМножителиСАналитикойПартии.АналитикаУчетаПартий = ПрочиеРасходыНезавершенногоПроизводства.КорАналитикаУчетаПартий
		|ГДЕ
		|	ОбщиеМножителиСАналитикойПартии.ПартияВыпущена
		|	И ОбщиеМножителиСАналитикойПартии.ЭтоПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
		|	ПрочиеРасходыНезавершенногоПроизводства.ПартияПроизводства,
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
		|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяКалькуляции,
		|	ОбщиеМножителиСАналитикойПартии.Продукция,
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
		|	ОбщиеМножителиСАналитикойПартии.Калькуляция,
		|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов,
		|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката,
		|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения,
		|	ОбщиеМножителиСАналитикойПартии.Знаменатель,
		|	ОбщиеМножителиСАналитикойПартии.Числитель,
		|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция,
		|	ОбщиеМножителиСАналитикойПартии.Назначение,
		|	ОбщиеМножителиСАналитикойПартии.Порядок,
		|	ВЫБОР
		|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|			ТОГДА ""ПрочиеПостоянные""
		|		ИНАЧЕ ""ПрочиеПеременные""
		|	КОНЕЦ,
		|	ОбщиеМножителиСАналитикойПартии.Продукция,
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбщиеМножителиСАналитикойПартии.Калькуляция,
		|	ОбщиеМножителиСАналитикойПартии.Продукция,
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
		|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката,
		|	ТрудозатратыНезавершенногоПроизводства.ПартияПроизводства,
		|	ТрудозатратыНезавершенногоПроизводства.Подразделение,
		|	ТрудозатратыНезавершенногоПроизводства.СтатьяКалькуляции,
		|	ТрудозатратыНезавершенногоПроизводства.ВидРабот,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	СУММА(ТрудозатратыНезавершенногоПроизводства.Количество * ОбщиеМножителиСАналитикойПартии.ДоляСтоимости),
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|					ИЛИ &ДанныеПоСебестоимости = 2
		|				ТОГДА ТрудозатратыНезавершенногоПроизводства.Стоимость
		|			ИНАЧЕ ТрудозатратыНезавершенногоПроизводства.СтоимостьРегл
		|		КОНЕЦ * ОбщиеМножителиСАналитикойПартии.ДоляСтоимости),
		|	""Трудозатраты"",
		|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		|	ОбщиеМножителиСАналитикойПартии.Числитель,
		|	ОбщиеМножителиСАналитикойПартии.Знаменатель,
		|	ОбщиеМножителиСАналитикойПартии.Продукция,
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
		|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция,
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
		|	ОбщиеМножителиСАналитикойПартии.Назначение,
		|	ОбщиеМножителиСАналитикойПартии.Порядок,
		|	0,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	ОбщиеМножителиСАналитикойПартии КАК ОбщиеМножителиСАналитикойПартии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ТрудозатратыНезавершенногоПроизводства
		|		ПО ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции = ТрудозатратыНезавершенногоПроизводства.Регистратор
		|			И ОбщиеМножителиСАналитикойПартии.Продукция = ТрудозатратыНезавершенногоПроизводства.КорАналитикаУчетаПродукции.Номенклатура
		|			И ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции = ТрудозатратыНезавершенногоПроизводства.КорАналитикаУчетаПродукции.Характеристика
		|			И (ТрудозатратыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И ОбщиеМножителиСАналитикойПартии.АналитикаУчетаПартий = ТрудозатратыНезавершенногоПроизводства.КорАналитикаУчетаПартий
		|ГДЕ
		|	ОбщиеМножителиСАналитикойПартии.ПартияВыпущена
		|	И ОбщиеМножителиСАналитикойПартии.ЭтоПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
		|	ОбщиеМножителиСАналитикойПартии.Калькуляция,
		|	ОбщиеМножителиСАналитикойПартии.Продукция,
		|	ТрудозатратыНезавершенногоПроизводства.ПартияПроизводства,
		|	ТрудозатратыНезавершенногоПроизводства.ВидРабот,
		|	ТрудозатратыНезавершенногоПроизводства.Подразделение,
		|	ТрудозатратыНезавершенногоПроизводства.СтатьяКалькуляции,
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции,
		|	ОбщиеМножителиСАналитикойПартии.КоличествоПолуфабриката,
		|	ОбщиеМножителиСАналитикойПартии.Продукция.ЕдиницаИзмерения,
		|	ОбщиеМножителиСАналитикойПартии.Знаменатель,
		|	ОбщиеМножителиСАналитикойПартии.Числитель,
		|	ОбщиеМножителиСАналитикойПартии.ЭтоПродукция,
		|	ОбщиеМножителиСАналитикойПартии.Назначение,
		|	ОбщиеМножителиСАналитикойПартии.Порядок,
		|	ОбщиеМножителиСАналитикойПартии.Продукция,
		|	ОбщиеМножителиСАналитикойПартии.ХарактеристикаПродукции,
		|	ОбщиеМножителиСАналитикойПартии.ПартияСпецификацияПродукции
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбщиеМножители.Калькуляция,
		|	ОбщиеМножители.Продукция,
		|	ОбщиеМножители.ХарактеристикаПродукции,
		|	ОбщиеМножители.КоличествоПолуфабриката,
		|	СебестоимостьТоваров.Партия,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Характеристика,
		|	СУММА(СебестоимостьТоваров.Количество / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА СебестоимостьТоваров.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА СебестоимостьТоваров.СтоимостьБезНДС
		|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл
		|		КОНЕЦ / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
		|	""Материальные"",
		|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
		|	ОбщиеМножители.ПартияСпецификацияПродукции,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	ОбщиеМножители.Числитель,
		|	ОбщиеМножители.Знаменатель,
		|	ОбщиеМножители.Полуфабрикат,
		|	ОбщиеМножители.ХарактеристикаПолуфабриката,
		|	ОбщиеМножители.ЭтоПродукция,
		|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
		|	ОбщиеМножители.Назначение,
		|	ОбщиеМножители.Порядок,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
		|			ИНАЧЕ СебестоимостьТоваров.СтоимостьЗабалансовая
		|		КОНЕЦ / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	ОбщиеМножители КАК ОбщиеМножители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
		|		ПО ОбщиеМножители.ПартияСпецификацияПолуфабриката = СебестоимостьТоваров.КорПартия
		|			И ОбщиеМножители.Полуфабрикат = СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры.Номенклатура
		|			И ОбщиеМножители.ХарактеристикаПолуфабриката = СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры.Характеристика
		|			И (СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (НЕ СебестоимостьТоваров.Партия = НЕОПРЕДЕЛЕНО)
		|ГДЕ
		|	ОбщиеМножители.ПартияВыпущена
		|	И НЕ ОбщиеМножители.ЭтоПродукция
		|	И НЕ СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура,
		|	СебестоимостьТоваров.Партия,
		|	ОбщиеМножители.ХарактеристикаПродукции,
		|	ОбщиеМножители.Продукция,
		|	ОбщиеМножители.Калькуляция,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения,
		|	СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Характеристика,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
		|	ОбщиеМножители.ПартияСпецификацияПродукции,
		|	ОбщиеМножители.КоличествоПолуфабриката,
		|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
		|	ОбщиеМножители.Знаменатель,
		|	ОбщиеМножители.Числитель,
		|	ОбщиеМножители.Полуфабрикат,
		|	ОбщиеМножители.ХарактеристикаПолуфабриката,
		|	ОбщиеМножители.ЭтоПродукция,
		|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
		|	ОбщиеМножители.Назначение,
		|	ОбщиеМножители.Порядок
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбщиеМножители.Калькуляция,
		|	ОбщиеМножители.Продукция,
		|	ОбщиеМножители.ХарактеристикаПродукции,
		|	ОбщиеМножители.КоличествоПолуфабриката,
		|	ПрочиеРасходыНезавершенногоПроизводства.ПартияПроизводства,
		|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
		|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяКалькуляции,
		|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	0,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ПрочиеРасходыНезавершенногоПроизводства.Стоимость
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ПрочиеРасходыНезавершенногоПроизводства.СтоимостьБезНДС
		|			ИНАЧЕ ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРегл
		|		КОНЕЦ / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
		|	ВЫБОР
		|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|			ТОГДА ""ПрочиеПостоянные""
		|		ИНАЧЕ ""ПрочиеПеременные""
		|	КОНЕЦ,
		|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
		|	ОбщиеМножители.ПартияСпецификацияПродукции,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		|	ОбщиеМножители.Числитель,
		|	ОбщиеМножители.Знаменатель,
		|	ОбщиеМножители.Полуфабрикат,
		|	ОбщиеМножители.ХарактеристикаПолуфабриката,
		|	ОбщиеМножители.ЭтоПродукция,
		|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
		|	ОбщиеМножители.Назначение,
		|	ОбщиеМножители.Порядок,
		|	0,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	ОбщиеМножители КАК ОбщиеМножители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНезавершенногоПроизводства
		|		ПО ОбщиеМножители.ПартияСпецификацияПолуфабриката = ПрочиеРасходыНезавершенногоПроизводства.Регистратор
		|			И ОбщиеМножители.Полуфабрикат = ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура
		|			И ОбщиеМножители.ХарактеристикаПолуфабриката = ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Характеристика
		|			И (ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|ГДЕ
		|	ОбщиеМножители.ПартияВыпущена
		|	И НЕ ОбщиеМножители.ЭтоПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
		|	ПрочиеРасходыНезавершенногоПроизводства.ПартияПроизводства,
		|	ОбщиеМножители.ПартияСпецификацияПродукции,
		|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяКалькуляции,
		|	ОбщиеМножители.Продукция,
		|	ОбщиеМножители.ХарактеристикаПродукции,
		|	ОбщиеМножители.Калькуляция,
		|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов,
		|	ОбщиеМножители.КоличествоПолуфабриката,
		|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
		|	ОбщиеМножители.Знаменатель,
		|	ОбщиеМножители.Числитель,
		|	ОбщиеМножители.Полуфабрикат,
		|	ОбщиеМножители.ХарактеристикаПолуфабриката,
		|	ОбщиеМножители.ЭтоПродукция,
		|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
		|	ОбщиеМножители.Назначение,
		|	ОбщиеМножители.Порядок,
		|	ВЫБОР
		|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов.ХарактерПроизводственныхЗатрат = ЗНАЧЕНИЕ(Перечисление.ХарактерПроизводственныхЗатрат.Постоянные)
		|			ТОГДА ""ПрочиеПостоянные""
		|		ИНАЧЕ ""ПрочиеПеременные""
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбщиеМножители.Калькуляция,
		|	ОбщиеМножители.Продукция,
		|	ОбщиеМножители.ХарактеристикаПродукции,
		|	ОбщиеМножители.КоличествоПолуфабриката,
		|	ТрудозатратыНезавершенногоПроизводства.ПартияПроизводства,
		|	ТрудозатратыНезавершенногоПроизводства.Подразделение,
		|	ТрудозатратыНезавершенногоПроизводства.СтатьяКалькуляции,
		|	ТрудозатратыНезавершенногоПроизводства.ВидРабот,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	СУММА(ТрудозатратыНезавершенногоПроизводства.Количество / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|					ИЛИ &ДанныеПоСебестоимости = 2
		|				ТОГДА ТрудозатратыНезавершенногоПроизводства.Стоимость
		|			ИНАЧЕ ТрудозатратыНезавершенногоПроизводства.СтоимостьРегл
		|		КОНЕЦ / ОбщиеМножители.Знаменатель * ОбщиеМножители.Числитель),
		|	""Трудозатраты"",
		|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
		|	ОбщиеМножители.ПартияСпецификацияПродукции,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
		|	ОбщиеМножители.Числитель,
		|	ОбщиеМножители.Знаменатель,
		|	ОбщиеМножители.Полуфабрикат,
		|	ОбщиеМножители.ХарактеристикаПолуфабриката,
		|	ОбщиеМножители.ЭтоПродукция,
		|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
		|	ОбщиеМножители.Назначение,
		|	ОбщиеМножители.Порядок,
		|	0,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	ОбщиеМножители КАК ОбщиеМножители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ТрудозатратыНезавершенногоПроизводства
		|		ПО ОбщиеМножители.ПартияСпецификацияПолуфабриката = ТрудозатратыНезавершенногоПроизводства.Регистратор
		|			И ОбщиеМножители.Полуфабрикат = ТрудозатратыНезавершенногоПроизводства.КорАналитикаУчетаПродукции.Номенклатура
		|			И ОбщиеМножители.ХарактеристикаПолуфабриката = ТрудозатратыНезавершенногоПроизводства.КорАналитикаУчетаПродукции.Характеристика
		|			И (ТрудозатратыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|ГДЕ
		|	ОбщиеМножители.ПартияВыпущена
		|	И НЕ ОбщиеМножители.ЭтоПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбщиеМножители.ХарактеристикаПродукции,
		|	ОбщиеМножители.Калькуляция,
		|	ОбщиеМножители.Продукция,
		|	ТрудозатратыНезавершенногоПроизводства.ПартияПроизводства,
		|	ТрудозатратыНезавершенногоПроизводства.ВидРабот,
		|	ТрудозатратыНезавершенногоПроизводства.Подразделение,
		|	ТрудозатратыНезавершенногоПроизводства.СтатьяКалькуляции,
		|	ОбщиеМножители.ПартияСпецификацияПродукции,
		|	ОбщиеМножители.КоличествоПолуфабриката,
		|	ОбщиеМножители.Продукция.ЕдиницаИзмерения,
		|	ОбщиеМножители.Знаменатель,
		|	ОбщиеМножители.Числитель,
		|	ОбщиеМножители.Полуфабрикат,
		|	ОбщиеМножители.ХарактеристикаПолуфабриката,
		|	ОбщиеМножители.ЭтоПродукция,
		|	ОбщиеМножители.ПартияСпецификацияПолуфабриката,
		|	ОбщиеМножители.Назначение,
		|	ОбщиеМножители.Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ФактическиеЗатраты.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ФактическиеЗатраты.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	ФактическиеЗатраты.ПартияПроизводства КАК ПартияПроизводства,
		|	ФактическиеЗатраты.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
		|	ФактическиеЗатраты.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
		|	ФактическиеЗатраты.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения
		|ПОМЕСТИТЬ АналитикиПартии
		|ИЗ
		|	ФактическиеЗатраты КАК ФактическиеЗатраты
		|ГДЕ
		|	НЕ ФактическиеЗатраты.АналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|	И ФактическиеЗатраты.ЭтоПродукция
		|	И ФактическиеЗатраты.ТипЗатрат = ""Материальные""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФактическиеЗатраты.АналитикаУчетаНоменклатуры,
		|	ФактическиеЗатраты.ПартияПолуфабриката,
		|	ФактическиеЗатраты.ПартияПроизводства,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	ФактическиеЗатраты КАК ФактическиеЗатраты
		|ГДЕ
		|	НЕ ФактическиеЗатраты.ЭтоПродукция
		|	И ФактическиеЗатраты.ТипЗатрат = ""Материальные""
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПартияСпецификацияПродукции,
		|	АналитикаУчетаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АналитикиПартии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	АналитикиПартии.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	ДвиженияВыпуска.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость) КАК ФиксСтоимость,
		|	СУММА(ЕСТЬNULL(ДвиженияВыпуска.Количество, 0)) КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.Стоимость, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходы, 0)
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.СтоимостьБезНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходыБезНДС, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.СтоимостьРегл, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходыРегл, 0)
		|		КОНЕЦ) КАК СтоимостьМатериальные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.Трудозатраты, 0)
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.Трудозатраты, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.ТрудозатратыРегл, 0)
		|		КОНЕЦ) КАК СтоимостьТрудозатраты,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеСНДС, 0)
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеБезНДС, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеРегл, 0)
		|		КОНЕЦ) КАК СтоимостьПрочиеПостоянные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеСНДС, 0)
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеБезНДС, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеРегл, 0)
		|		КОНЕЦ) КАК СтоимостьПрочиеПеременные,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 1
		|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.Стоимость, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходы, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеСНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеСНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.Трудозатраты, 0)
		|			КОГДА &ДанныеПоСебестоимости = 2
		|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.СтоимостьБезНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходыБезНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеБезНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеБезНДС, 0) + ЕСТЬNULL(ДвиженияВыпуска.Трудозатраты, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.СтоимостьРегл, 0) + ЕСТЬNULL(ДвиженияВыпуска.ДопРасходыРегл, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПостоянныеРегл, 0) + ЕСТЬNULL(ДвиженияВыпуска.ПостатейныеПеременныеРегл, 0) + ЕСТЬNULL(ДвиженияВыпуска.ТрудозатратыРегл, 0)
		|		КОНЕЦ) КАК Стоимость,
		|	СУММА(ВЫБОР
		|			КОГДА &ДанныеПоСебестоимости = 3
		|				ТОГДА ЕСТЬNULL(ДвиженияВыпуска.СтоимостьЗабалансовая, 0)
		|			ИНАЧЕ ЕСТЬNULL(ДвиженияВыпуска.СтоимостьЗабалансоваяРегл, 0)
		|		КОНЕЦ) КАК СтоимостьЗабалансовая,
		|	АналитикиПартии.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
		|	АналитикиПартии.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
		|	АналитикиПартии.бит_ПроцентВыполнения КАК бит_ПроцентВыполнения
		|ПОМЕСТИТЬ ОпределениеПолуфабрикатов
		|ИЗ
		|	АналитикиПартии КАК АналитикиПартии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ОпределениеПартии
		|		ПО АналитикиПартии.ПартияПроизводства = ОпределениеПартии.КорПартия
		|			И АналитикиПартии.АналитикаУчетаНоменклатуры = ОпределениеПартии.КорАналитикаУчетаНоменклатуры
		|			И (ОпределениеПартии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (ОпределениеПартии.РазделУчета В (ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)))
		|			И (ОпределениеПартии.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства))
		|			И (ОпределениеПартии.Количество > 0)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ДвиженияВыпуска
		|		ПО (ОпределениеПартии.Партия = ДвиженияВыпуска.Партия)
		|			И (ОпределениеПартии.АналитикаУчетаПартий = ДвиженияВыпуска.АналитикаУчетаПартий)
		|			И (ДвиженияВыпуска.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)))
		|
		|СГРУППИРОВАТЬ ПО
		|	АналитикиПартии.АналитикаУчетаНоменклатуры,
		|	АналитикиПартии.ПартияСпецификацияПродукции,
		|	ДвиженияВыпуска.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость),
		|	АналитикиПартии.бит_КомпенсирующийКоэффициент,
		|	АналитикиПартии.бит_АгрегирующийКоэффициент,
		|	АналитикиПартии.бит_ПроцентВыполнения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Калькуляция КАК Калькуляция,
		|	ВТ.Продукция КАК Продукция,
		|	ВТ.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	СУММА(ВТ.Стоимость) / ВЫБОР
		|		КОГДА СУММА(ВТ.КоличествоПолуфабриката) = 0
		|			ТОГДА 1
		|		ИНАЧЕ СУММА(ВТ.КоличествоПолуфабриката)
		|	КОНЕЦ КАК Цена,
		|	ВТ.ПартияПродукции КАК ПартияПродукции,
		|	ВТ.Полуфабрикат КАК Полуфабрикат,
		|	ВТ.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
		|	ВТ.НазначениеПродукции КАК НазначениеПродукции
		|ПОМЕСТИТЬ ЦеныПолуфабрикатов
		|ИЗ
		|	(ВЫБРАТЬ
		|		Данные.Калькуляция КАК Калькуляция,
		|		Данные.Продукция КАК Продукция,
		|		Данные.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|		СУММА(Данные.Стоимость) КАК Стоимость,
		|		0 КАК КоличествоПолуфабриката,
		|		Данные.ПартияСпецификацияПродукции КАК ПартияПродукции,
		|		Данные.Полуфабрикат КАК Полуфабрикат,
		|		Данные.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
		|		Данные.Назначение КАК НазначениеПродукции
		|	ИЗ
		|		Данные КАК Данные
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Данные.Калькуляция,
		|		Данные.Продукция,
		|		Данные.ХарактеристикаПродукции,
		|		Данные.ПартияСпецификацияПродукции,
		|		Данные.Полуфабрикат,
		|		Данные.ХарактеристикаПолуфабриката,
		|		Данные.Назначение
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Множители.Калькуляция,
		|		Множители.Продукция,
		|		Множители.ХарактеристикаПродукции,
		|		0,
		|		СУММА(Множители.КоличествоПолуфабриката),
		|		Множители.ПартияСпецификацияПродукции,
		|		Множители.Полуфабрикат,
		|		Множители.ХарактеристикаПолуфабриката,
		|		Множители.Назначение
		|	ИЗ
		|		ОбщиеМножители КАК Множители
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Множители.Калькуляция,
		|		Множители.Продукция,
		|		Множители.ХарактеристикаПродукции,
		|		Множители.ПартияСпецификацияПродукции,
		|		Множители.Полуфабрикат,
		|		Множители.ХарактеристикаПолуфабриката,
		|		Множители.Назначение) КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Калькуляция,
		|	ВТ.Продукция,
		|	ВТ.ХарактеристикаПродукции,
		|	ВТ.ПартияПродукции,
		|	ВТ.Полуфабрикат,
		|	ВТ.ХарактеристикаПолуфабриката,
		|	ВТ.НазначениеПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные.Калькуляция КАК Калькуляция,
		|	Данные.Продукция КАК Продукция,
		|	Данные.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ВЫБОР
		|		КОГДА Данные.Признак = 0
		|				И Данные.бит_ПроцентВыполнения <> 100
		|				И Данные.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА Данные.КоличествоПолуфабриката / Данные.бит_АгрегирующийКоэффициент * Данные.бит_ПроцентВыполнения / 100
		|		КОГДА Данные.Признак = 0
		|			ТОГДА Данные.КоличествоПолуфабриката / Данные.бит_АгрегирующийКоэффициент
		|		КОГДА Данные.бит_ПроцентВыполнения <> 100
		|				И Данные.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА Данные.КоличествоПолуфабриката * Данные.бит_ПроцентВыполнения / 100
		|		ИНАЧЕ Данные.КоличествоПолуфабриката
		|	КОНЕЦ КАК КоличествоПолуфабриката,
		|	Данные.Подразделение КАК Подразделение,
		|	Данные.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	Данные.Номенклатура КАК Номенклатура,
		|	Данные.Характеристика КАК Характеристика,
		|	Данные.ТипЗатрат КАК ТипЗатрат,
		|	СУММА(ВЫБОР
		|			КОГДА Данные.Признак = 0
		|					И Данные.бит_ПроцентВыполнения <> 100
		|					И Данные.ТипЗатрат = ""Трудозатраты""
		|				ТОГДА Данные.Количество / Данные.бит_АгрегирующийКоэффициент * Данные.бит_ПроцентВыполнения / 100
		|			КОГДА Данные.Признак = 0
		|				ТОГДА Данные.Количество / Данные.бит_АгрегирующийКоэффициент
		|			КОГДА Данные.бит_ПроцентВыполнения <> 100
		|					И Данные.ТипЗатрат = ""Трудозатраты""
		|				ТОГДА Данные.Количество * Данные.бит_ПроцентВыполнения / 100
		|			ИНАЧЕ Данные.Количество
		|		КОНЕЦ) КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА Данные.ЭтоПолуфабрикат
		|				ТОГДА 0
		|			ИНАЧЕ Данные.Стоимость
		|		КОНЕЦ) КАК Стоимость,
		|	СУММА(ВЫБОР
		|			КОГДА (Данные.ТипЗатрат = ""Материальные""
		|					ИЛИ Данные.ТипЗатрат = ""ВозвратныеОтходы"")
		|					И НЕ Данные.ЭтоПолуфабрикат
		|				ТОГДА Данные.Стоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьМатериальные,
		|	СУММА(ВЫБОР
		|			КОГДА Данные.ТипЗатрат = ""Трудозатраты""
		|					И НЕ Данные.ЭтоПолуфабрикат
		|				ТОГДА Данные.Стоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьТрудозатраты,
		|	СУММА(ВЫБОР
		|			КОГДА Данные.ТипЗатрат = ""ПрочиеПостоянные""
		|					И НЕ Данные.ЭтоПолуфабрикат
		|				ТОГДА Данные.Стоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьПрочиеПостоянные,
		|	СУММА(ВЫБОР
		|			КОГДА Данные.ТипЗатрат = ""ПрочиеПеременные""
		|					И НЕ Данные.ЭтоПолуфабрикат
		|				ТОГДА Данные.Стоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьПрочиеПеременные,
		|	ВЫБОР
		|		КОГДА Данные.ЭтоПолуфабрикат
		|			ТОГДА МАКСИМУМ(ЕСТЬNULL(Цены.Цена, 0))
		|		КОГДА СУММА(Данные.Количество) = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(Данные.Стоимость) / СУММА(Данные.Количество)
		|	КОНЕЦ КАК Цена,
		|	СУММА(Данные.Забалансовая) КАК СтоимостьЗабалансовая,
		|	Данные.ПродукцияЕдиницаИзмерения КАК ПродукцияЕдиницаИзмерения,
		|	Данные.НоменклатураЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
		|	Данные.ПартияСпецификацияПродукции КАК ПартияПродукции,
		|	Данные.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
		|	Данные.Полуфабрикат КАК Полуфабрикат,
		|	Данные.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
		|	Данные.Назначение КАК НазначениеПродукции,
		|	Данные.Полуфабрикат.ЕдиницаИзмерения КАК ПолуфабрикатЕдиницаИзмерения,
		|	Данные.Калькуляция.Организация КАК Организация,
		|	Данные.Порядок КАК Порядок,
		|	Данные.бит_КомпенсирующийКоэффициент КАК бит_КомпенсирующийКоэффициент,
		|	Данные.бит_ПроцентВыполнения КАК ПроцентВыполнения,
		|	Данные.бит_АгрегирующийКоэффициент КАК бит_АгрегирующийКоэффициент,
		|	Данные.Признак КАК Признак
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	Данные КАК Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныПолуфабрикатов КАК Цены
		|		ПО Данные.Калькуляция = Цены.Калькуляция
		|			И Данные.Продукция = Цены.Продукция
		|			И Данные.ХарактеристикаПродукции = Цены.ХарактеристикаПродукции
		|			И Данные.ПартияСпецификацияПродукции = Цены.ПартияПродукции
		|			И Данные.Номенклатура = Цены.Полуфабрикат
		|			И Данные.Характеристика = Цены.ХарактеристикаПолуфабриката
		|			И Данные.Назначение = Цены.НазначениеПродукции
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.Характеристика,
		|	Данные.ПродукцияЕдиницаИзмерения,
		|	Данные.Калькуляция,
		|	Данные.Продукция,
		|	Данные.Номенклатура,
		|	Данные.Подразделение,
		|	Данные.НоменклатураЕдиницаИзмерения,
		|	Данные.ХарактеристикаПродукции,
		|	Данные.ТипЗатрат,
		|	Данные.СтатьяКалькуляции,
		|	Данные.ПартияСпецификацияПродукции,
		|	Данные.ЭтоПолуфабрикат,
		|	Данные.Полуфабрикат,
		|	Данные.ХарактеристикаПолуфабриката,
		|	Данные.Назначение,
		|	Данные.Полуфабрикат.ЕдиницаИзмерения,
		|	Данные.Калькуляция.Организация,
		|	Данные.Порядок,
		|	Данные.бит_КомпенсирующийКоэффициент,
		|	Данные.бит_ПроцентВыполнения,
		|	ВЫБОР
		|		КОГДА Данные.Признак = 0
		|				И Данные.бит_ПроцентВыполнения <> 100
		|				И Данные.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА Данные.КоличествоПолуфабриката / Данные.бит_АгрегирующийКоэффициент * Данные.бит_ПроцентВыполнения / 100
		|		КОГДА Данные.Признак = 0
		|			ТОГДА Данные.КоличествоПолуфабриката / Данные.бит_АгрегирующийКоэффициент
		|		КОГДА Данные.бит_ПроцентВыполнения <> 100
		|				И Данные.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА Данные.КоличествоПолуфабриката * Данные.бит_ПроцентВыполнения / 100
		|		ИНАЧЕ Данные.КоличествоПолуфабриката
		|	КОНЕЦ,
		|	Данные.бит_АгрегирующийКоэффициент,
		|	Данные.Признак
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФактическиеЗатраты.Калькуляция,
		|	ФактическиеЗатраты.Продукция,
		|	ФактическиеЗатраты.ХарактеристикаПродукции,
		|	ФактическиеЗатраты.КоличествоПолуфабриката,
		|	ФактическиеЗатраты.Подразделение,
		|	ФактическиеЗатраты.СтатьяКалькуляции,
		|	ФактическиеЗатраты.Номенклатура,
		|	ФактическиеЗатраты.Характеристика,
		|	ФактическиеЗатраты.ТипЗатрат,
		|	ВЫБОР
		|		КОГДА ОпределениеПолуфабрикатов.АналитикаУчетаНоменклатуры ЕСТЬ NULL
		|			ТОГДА ФактическиеЗатраты.Количество
		|		ИНАЧЕ ОпределениеПолуфабрикатов.Количество * ФактическиеЗатраты.Числитель / ФактическиеЗатраты.Знаменатель
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОпределениеПолуфабрикатов.АналитикаУчетаНоменклатуры ЕСТЬ NULL
		|			ТОГДА ФактическиеЗатраты.Стоимость
		|		КОГДА НЕ ОпределениеПолуфабрикатов.ФиксСтоимость
		|			ТОГДА 0
		|		ИНАЧЕ ОпределениеПолуфабрикатов.Стоимость * ФактическиеЗатраты.Числитель / ФактическиеЗатраты.Знаменатель
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОпределениеПолуфабрикатов.АналитикаУчетаНоменклатуры ЕСТЬ NULL
		|				И ФактическиеЗатраты.ТипЗатрат = ""Материальные""
		|			ТОГДА ФактическиеЗатраты.Стоимость
		|		КОГДА НЕ ОпределениеПолуфабрикатов.ФиксСтоимость
		|			ТОГДА 0
		|		КОГДА ФактическиеЗатраты.ТипЗатрат = ""Материальные""
		|			ТОГДА ОпределениеПолуфабрикатов.СтоимостьМатериальные * ФактическиеЗатраты.Числитель / ФактическиеЗатраты.Знаменатель
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОпределениеПолуфабрикатов.АналитикаУчетаНоменклатуры ЕСТЬ NULL
		|				И ФактическиеЗатраты.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ФактическиеЗатраты.Стоимость
		|		КОГДА НЕ ОпределениеПолуфабрикатов.ФиксСтоимость
		|				И ФактическиеЗатраты.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА 0
		|		КОГДА ФактическиеЗатраты.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ОпределениеПолуфабрикатов.СтоимостьТрудозатраты * ФактическиеЗатраты.Числитель / ФактическиеЗатраты.Знаменатель
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОпределениеПолуфабрикатов.АналитикаУчетаНоменклатуры ЕСТЬ NULL
		|				И ФактическиеЗатраты.ТипЗатрат = ""ПрочиеПостоянные""
		|			ТОГДА ФактическиеЗатраты.Стоимость
		|		КОГДА НЕ ОпределениеПолуфабрикатов.ФиксСтоимость
		|				И ФактическиеЗатраты.ТипЗатрат = ""ПрочиеПостоянные""
		|			ТОГДА 0
		|		КОГДА ФактическиеЗатраты.ТипЗатрат = ""ПрочиеПостоянные""
		|			ТОГДА ОпределениеПолуфабрикатов.СтоимостьПрочиеПостоянные * ФактическиеЗатраты.Числитель / ФактическиеЗатраты.Знаменатель
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОпределениеПолуфабрикатов.АналитикаУчетаНоменклатуры ЕСТЬ NULL
		|				И ФактическиеЗатраты.ТипЗатрат = ""ПрочиеПеременные""
		|			ТОГДА ФактическиеЗатраты.Стоимость
		|		КОГДА НЕ ОпределениеПолуфабрикатов.ФиксСтоимость
		|				И ФактическиеЗатраты.ТипЗатрат = ""ПрочиеПеременные""
		|			ТОГДА 0
		|		КОГДА ФактическиеЗатраты.ТипЗатрат = ""ПрочиеПеременные""
		|			ТОГДА ОпределениеПолуфабрикатов.СтоимостьПрочиеПеременные * ФактическиеЗатраты.Числитель / ФактическиеЗатраты.Знаменатель
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОпределениеПолуфабрикатов.АналитикаУчетаНоменклатуры ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ФактическиеЗатраты.Количество = 0
		|						ТОГДА 0
		|					ИНАЧЕ ФактическиеЗатраты.Стоимость / ФактическиеЗатраты.Количество
		|				КОНЕЦ
		|		ИНАЧЕ ОпределениеПолуфабрикатов.Стоимость * ФактическиеЗатраты.Числитель / ФактическиеЗатраты.Знаменатель / (ОпределениеПолуфабрикатов.Количество * ФактическиеЗатраты.Числитель / ФактическиеЗатраты.Знаменатель)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОпределениеПолуфабрикатов.АналитикаУчетаНоменклатуры ЕСТЬ NULL
		|			ТОГДА ФактическиеЗатраты.Забалансовая
		|		КОГДА НЕ ОпределениеПолуфабрикатов.ФиксСтоимость
		|			ТОГДА 0
		|		ИНАЧЕ ОпределениеПолуфабрикатов.СтоимостьЗабалансовая * ФактическиеЗатраты.Числитель / ФактическиеЗатраты.Знаменатель
		|	КОНЕЦ,
		|	ФактическиеЗатраты.ПродукцияЕдиницаИзмерения,
		|	ФактическиеЗатраты.НоменклатураЕдиницаИзмерения,
		|	ФактическиеЗатраты.ПартияСпецификацияПродукции,
		|	НЕ ОпределениеПолуфабрикатов.АналитикаУчетаНоменклатуры ЕСТЬ NULL,
		|	ФактическиеЗатраты.Полуфабрикат,
		|	ФактическиеЗатраты.ХарактеристикаПолуфабриката,
		|	ФактическиеЗатраты.Назначение,
		|	ФактическиеЗатраты.Полуфабрикат.ЕдиницаИзмерения,
		|	ФактическиеЗатраты.Калькуляция.Организация,
		|	ФактическиеЗатраты.Порядок,
		|	ОпределениеПолуфабрикатов.бит_КомпенсирующийКоэффициент,
		|	ОпределениеПолуфабрикатов.бит_ПроцентВыполнения,
		|	ФактическиеЗатраты.бит_АгрегирующийКоэффициент,
		|	1
		|ИЗ
		|	ФактическиеЗатраты КАК ФактическиеЗатраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОпределениеПолуфабрикатов КАК ОпределениеПолуфабрикатов
		|		ПО ФактическиеЗатраты.АналитикаУчетаНоменклатуры = ОпределениеПолуфабрикатов.АналитикаУчетаНоменклатуры
		|			И (ВЫБОР
		|				КОГДА ФактическиеЗатраты.ЭтоПродукция
		|					ТОГДА ФактическиеЗатраты.ПартияСпецификацияПродукции = ОпределениеПолуфабрикатов.ПартияСпецификацияПродукции
		|				ИНАЧЕ ФактическиеЗатраты.ПартияПолуфабриката = ОпределениеПолуфабрикатов.ПартияСпецификацияПродукции
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Калькуляция КАК Калькуляция,
		|	ВТ_Итог.Продукция КАК Продукция,
		|	ВТ_Итог.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ВТ_Итог.КоличествоПолуфабриката КАК КоличествоПолуфабриката,
		|	ВТ_Итог.Подразделение КАК Подразделение,
		|	ВТ_Итог.СтатьяКалькуляции КАК СтатьяКалькуляции,
		|	ВТ_Итог.Номенклатура КАК Номенклатура,
		|	ВТ_Итог.Характеристика КАК Характеристика,
		|	ВТ_Итог.ТипЗатрат КАК ТипЗатрат,
		|	ВТ_Итог.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Признак = 0
		|				И ВТ_Итог.ПроцентВыполнения <> 100
		|				И ВТ_Итог.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ВТ_Итог.Стоимость / ВТ_Итог.бит_АгрегирующийКоэффициент * ВТ_Итог.ПроцентВыполнения / 100
		|		КОГДА ВТ_Итог.Признак = 0
		|			ТОГДА ВТ_Итог.Стоимость / ВТ_Итог.бит_АгрегирующийКоэффициент
		|		КОГДА ВТ_Итог.ПроцентВыполнения <> 100
		|				И ВТ_Итог.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ВТ_Итог.Стоимость * ВТ_Итог.ПроцентВыполнения / 100
		|		ИНАЧЕ ВТ_Итог.Стоимость
		|	КОНЕЦ КАК Стоимость,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Признак = 0
		|				И ВТ_Итог.ПроцентВыполнения <> 100
		|				И ВТ_Итог.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ВТ_Итог.СтоимостьМатериальные / ВТ_Итог.бит_АгрегирующийКоэффициент * ВТ_Итог.ПроцентВыполнения / 100
		|		КОГДА ВТ_Итог.Признак = 0
		|			ТОГДА ВТ_Итог.СтоимостьМатериальные / ВТ_Итог.бит_АгрегирующийКоэффициент
		|		КОГДА ВТ_Итог.ПроцентВыполнения <> 100
		|				И ВТ_Итог.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ВТ_Итог.СтоимостьМатериальные * ВТ_Итог.ПроцентВыполнения / 100
		|		ИНАЧЕ ВТ_Итог.СтоимостьМатериальные
		|	КОНЕЦ КАК СтоимостьМатериальные,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Признак = 0
		|				И ВТ_Итог.ПроцентВыполнения <> 100
		|				И ВТ_Итог.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ВТ_Итог.СтоимостьТрудозатраты / ВТ_Итог.бит_АгрегирующийКоэффициент * ВТ_Итог.ПроцентВыполнения / 100
		|		КОГДА ВТ_Итог.Признак = 0
		|			ТОГДА ВТ_Итог.СтоимостьТрудозатраты / ВТ_Итог.бит_АгрегирующийКоэффициент
		|		КОГДА ВТ_Итог.ПроцентВыполнения <> 100
		|				И ВТ_Итог.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ВТ_Итог.СтоимостьТрудозатраты * ВТ_Итог.ПроцентВыполнения / 100
		|		ИНАЧЕ ВТ_Итог.СтоимостьТрудозатраты
		|	КОНЕЦ КАК СтоимостьТрудозатраты,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Признак = 0
		|				И ВТ_Итог.ПроцентВыполнения <> 100
		|				И ВТ_Итог.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ВТ_Итог.СтоимостьПрочиеПостоянные / ВТ_Итог.бит_АгрегирующийКоэффициент * ВТ_Итог.ПроцентВыполнения / 100
		|		КОГДА ВТ_Итог.Признак = 0
		|			ТОГДА ВТ_Итог.СтоимостьПрочиеПостоянные / ВТ_Итог.бит_АгрегирующийКоэффициент
		|		КОГДА ВТ_Итог.ПроцентВыполнения <> 100
		|				И ВТ_Итог.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ВТ_Итог.СтоимостьПрочиеПостоянные * ВТ_Итог.ПроцентВыполнения / 100
		|		ИНАЧЕ ВТ_Итог.СтоимостьПрочиеПостоянные
		|	КОНЕЦ КАК СтоимостьПрочиеПостоянные,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Признак = 0
		|				И ВТ_Итог.ПроцентВыполнения <> 100
		|				И ВТ_Итог.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ВТ_Итог.СтоимостьПрочиеПеременные / ВТ_Итог.бит_АгрегирующийКоэффициент * ВТ_Итог.ПроцентВыполнения / 100
		|		КОГДА ВТ_Итог.Признак = 0
		|			ТОГДА ВТ_Итог.СтоимостьПрочиеПеременные / ВТ_Итог.бит_АгрегирующийКоэффициент
		|		КОГДА ВТ_Итог.ПроцентВыполнения <> 100
		|				И ВТ_Итог.ТипЗатрат = ""Трудозатраты""
		|			ТОГДА ВТ_Итог.СтоимостьПрочиеПеременные * ВТ_Итог.ПроцентВыполнения / 100
		|		ИНАЧЕ ВТ_Итог.СтоимостьПрочиеПеременные
		|	КОНЕЦ КАК СтоимостьПрочиеПеременные,
		|	ВТ_Итог.Цена КАК Цена,
		|	ВТ_Итог.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
		|	ВТ_Итог.ПродукцияЕдиницаИзмерения КАК ПродукцияЕдиницаИзмерения,
		|	ВТ_Итог.НоменклатураЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
		|	ВТ_Итог.ПартияПродукции КАК ПартияПродукции,
		|	ВТ_Итог.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
		|	ВТ_Итог.Полуфабрикат КАК Полуфабрикат,
		|	ВТ_Итог.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
		|	ВТ_Итог.НазначениеПродукции КАК НазначениеПродукции,
		|	ВТ_Итог.ПолуфабрикатЕдиницаИзмерения КАК ПолуфабрикатЕдиницаИзмерения,
		|	ВТ_Итог.Организация КАК Организация,
		|	ВТ_Итог.Порядок КАК Порядок,
		|	ВТ_Итог.ПроцентВыполнения КАК ПроцентВыполнения,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Признак = 0
		|			ТОГДА ВТ_Итог.бит_АгрегирующийКоэффициент
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Коэффициент
		|ПОМЕСТИТЬ вт_НаборДанных
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	МножителиПартийИПолуфабрикатов.Продукция КАК Продукция,
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	МножителиПартийИПолуфабрикатов.Назначение КАК Назначение,
		|	МАКСИМУМ(МножителиПартийИПолуфабрикатов.Калькуляция.Дата) КАК Период
		|ПОМЕСТИТЬ ПериодыКалькуляций1
		|ИЗ
		|	РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
		|ГДЕ
		|	(МножителиПартийИПолуфабрикатов.Калькуляция.Дата <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|			ИЛИ &Период = ДАТАВРЕМЯ(1, 1, 1))
		|	И МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
		|{ГДЕ
		|	МножителиПартийИПолуфабрикатов.Калькуляция.*}
		|
		|СГРУППИРОВАТЬ ПО
		|	МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции,
		|	МножителиПартийИПолуфабрикатов.Продукция,
		|	МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции,
		|	МножителиПартийИПолуфабрикатов.Назначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПериодыКалькуляций.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	ПериодыКалькуляций.Продукция КАК Продукция,
		|	ПериодыКалькуляций.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ПериодыКалькуляций.Назначение КАК Назначение,
		|	МАКСИМУМ(МножителиПартийИПолуфабрикатов.Калькуляция) КАК Калькуляция
		|ПОМЕСТИТЬ ПоследниеКалькуляции1
		|ИЗ
		|	ПериодыКалькуляций1 КАК ПериодыКалькуляций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
		|		ПО ПериодыКалькуляций.Период = МножителиПартийИПолуфабрикатов.Калькуляция.Дата
		|			И ПериодыКалькуляций.ПартияСпецификацияПродукции = МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции
		|			И ПериодыКалькуляций.Продукция = МножителиПартийИПолуфабрикатов.Продукция
		|			И ПериодыКалькуляций.ХарактеристикаПродукции = МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции
		|			И ПериодыКалькуляций.Назначение = МножителиПартийИПолуфабрикатов.Назначение
		|ГДЕ
		|	МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыКалькуляций.ПартияСпецификацияПродукции,
		|	ПериодыКалькуляций.Продукция,
		|	ПериодыКалькуляций.ХарактеристикаПродукции,
		|	ПериодыКалькуляций.Назначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоследниеКалькуляции.Продукция КАК Продукция,
		|	ПоследниеКалькуляции.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ПоследниеКалькуляции.Назначение КАК Назначение,
		|	ПоследниеКалькуляции.Калькуляция КАК Калькуляция,
		|	ПоследниеКалькуляции.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	СУММА(МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката) КАК ВсегоКоличество
		|ПОМЕСТИТЬ РассчитанноеКоличество1
		|ИЗ
		|	ПоследниеКалькуляции1 КАК ПоследниеКалькуляции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
		|		ПО ПоследниеКалькуляции.Калькуляция = МножителиПартийИПолуфабрикатов.Калькуляция
		|			И ПоследниеКалькуляции.ПартияСпецификацияПродукции = МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции
		|			И ПоследниеКалькуляции.Продукция = МножителиПартийИПолуфабрикатов.Продукция
		|			И ПоследниеКалькуляции.ХарактеристикаПродукции = МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции
		|			И ПоследниеКалькуляции.Назначение = МножителиПартийИПолуфабрикатов.Назначение
		|			И (МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|ГДЕ
		|	МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоследниеКалькуляции.Продукция,
		|	ПоследниеКалькуляции.ХарактеристикаПродукции,
		|	ПоследниеКалькуляции.Назначение,
		|	ПоследниеКалькуляции.Калькуляция,
		|	ПоследниеКалькуляции.ПартияСпецификацияПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РассчитанноеКоличество.Продукция КАК Продукция,
		|	РассчитанноеКоличество.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	РассчитанноеКоличество.Назначение КАК Назначение,
		|	РассчитанноеКоличество.Калькуляция КАК Калькуляция,
		|	РассчитанноеКоличество.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	КалькуляцияПродукцииОбъектыКалькуляции.Количество / РассчитанноеКоличество.ВсегоКоличество КАК ДоляСтоимости
		|ПОМЕСТИТЬ ДолиСтоимостиОтРассчитанногоКоличества1
		|ИЗ
		|	РассчитанноеКоличество1 КАК РассчитанноеКоличество
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2.ОбъектыКалькуляции КАК КалькуляцияПродукцииОбъектыКалькуляции
		|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукцииОбъектыКалькуляции.Ссылка
		|			И РассчитанноеКоличество.Продукция = КалькуляцияПродукцииОбъектыКалькуляции.Номенклатура
		|			И РассчитанноеКоличество.ХарактеристикаПродукции = КалькуляцияПродукцииОбъектыКалькуляции.Характеристика
		|			И РассчитанноеКоличество.Назначение = КалькуляцияПродукцииОбъектыКалькуляции.Назначение
		|			И РассчитанноеКоличество.ПартияСпецификацияПродукции = КалькуляцияПродукцииОбъектыКалькуляции.Объект
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2 КАК КалькуляцияПродукции
		|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукции.Ссылка
		|ГДЕ
		|	КалькуляцияПродукции.ОбъектКалькуляции = ЗНАЧЕНИЕ(Перечисление.ОбъектыКалькуляции.РесурснаяСпецификация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РассчитанноеКоличество.Продукция,
		|	РассчитанноеКоличество.ХарактеристикаПродукции,
		|	РассчитанноеКоличество.Назначение,
		|	РассчитанноеКоличество.Калькуляция,
		|	РассчитанноеКоличество.ПартияСпецификацияПродукции,
		|	КалькуляцияПродукцииОбъектыКалькуляции.Количество / РассчитанноеКоличество.ВсегоКоличество
		|ИЗ
		|	РассчитанноеКоличество КАК РассчитанноеКоличество
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2.ОбъектыКалькуляции КАК КалькуляцияПродукцииОбъектыКалькуляции
		|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукцииОбъектыКалькуляции.Ссылка
		|			И РассчитанноеКоличество.Продукция = КалькуляцияПродукцииОбъектыКалькуляции.Номенклатура
		|			И РассчитанноеКоличество.ХарактеристикаПродукции = КалькуляцияПродукцииОбъектыКалькуляции.Характеристика
		|			И РассчитанноеКоличество.Назначение = КалькуляцияПродукцииОбъектыКалькуляции.Назначение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановаяКалькуляция2_2 КАК КалькуляцияПродукции
		|		ПО РассчитанноеКоличество.Калькуляция = КалькуляцияПродукции.Ссылка
		|ГДЕ
		|	НЕ КалькуляцияПродукции.ОбъектКалькуляции = ЗНАЧЕНИЕ(Перечисление.ОбъектыКалькуляции.РесурснаяСпецификация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДолиСтоимости.Калькуляция КАК Калькуляция,
		|	ДолиСтоимости.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
		|	ДолиСтоимости.Продукция КАК Продукция,
		|	ДолиСтоимости.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	ДолиСтоимости.Назначение КАК НазначениеПродукции,
		|	ВЫБОР
		|		КОГДА МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА МножителиПартийИПолуфабрикатов.Продукция
		|		ИНАЧЕ МножителиПартийИПолуфабрикатов.Полуфабрикат
		|	КОНЕЦ КАК Полуфабрикат,
		|	ВЫБОР
		|		КОГДА МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции
		|		ИНАЧЕ МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката
		|	КОНЕЦ КАК ХарактеристикаПолуфабриката,
		|	СУММА(МножителиПартийИПолуфабрикатов.КоличествоПолуфабриката * ДолиСтоимости.ДоляСтоимости) КАК КоличествоВыпуска
		|ПОМЕСТИТЬ Выпуск
		|ИЗ
		|	ДолиСтоимостиОтРассчитанногоКоличества1 КАК ДолиСтоимости
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МножителиПартийИПолуфабрикатов КАК МножителиПартийИПолуфабрикатов
		|		ПО ДолиСтоимости.Калькуляция = МножителиПартийИПолуфабрикатов.Калькуляция
		|			И ДолиСтоимости.Продукция = МножителиПартийИПолуфабрикатов.Продукция
		|			И ДолиСтоимости.ХарактеристикаПродукции = МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции
		|			И ДолиСтоимости.Назначение = МножителиПартийИПолуфабрикатов.Назначение
		|			И ДолиСтоимости.ПартияСпецификацияПродукции = МножителиПартийИПолуфабрикатов.ПартияСпецификацияПродукции
		|ГДЕ
		|	МножителиПартийИПолуфабрикатов.Калькуляция = &Калькуляция
		|
		|СГРУППИРОВАТЬ ПО
		|	ДолиСтоимости.Назначение,
		|	ДолиСтоимости.Продукция,
		|	ВЫБОР
		|		КОГДА МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА МножителиПартийИПолуфабрикатов.ХарактеристикаПродукции
		|		ИНАЧЕ МножителиПартийИПолуфабрикатов.ХарактеристикаПолуфабриката
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА МножителиПартийИПолуфабрикатов.Полуфабрикат = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА МножителиПартийИПолуфабрикатов.Продукция
		|		ИНАЧЕ МножителиПартийИПолуфабрикатов.Полуфабрикат
		|	КОНЕЦ,
		|	ДолиСтоимости.Калькуляция,
		|	ДолиСтоимости.ПартияСпецификацияПродукции,
		|	ДолиСтоимости.ХарактеристикаПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_НаборДанных.Продукция КАК Продукция,
		|	вт_НаборДанных.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
		|	Сумма(вт_НаборДанных.Стоимость) КАК Стоимость
		|ИЗ
		|	вт_НаборДанных КАК вт_НаборДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Выпуск КАК Выпуск
		|		ПО вт_НаборДанных.Калькуляция = Выпуск.Калькуляция
		|			И вт_НаборДанных.Продукция = Выпуск.Продукция
		|			И вт_НаборДанных.ХарактеристикаПродукции = Выпуск.ХарактеристикаПродукции
		|			И вт_НаборДанных.ПартияПродукции = Выпуск.ПартияСпецификацияПродукции
		|			И вт_НаборДанных.Полуфабрикат = Выпуск.Полуфабрикат
		|			И вт_НаборДанных.ХарактеристикаПолуфабриката = Выпуск.ХарактеристикаПродукции
		|			И вт_НаборДанных.НазначениеПродукции = Выпуск.НазначениеПродукции
		|СГРУППИРОВАТЬ ПО
		|	вт_НаборДанных.Продукция,
		|	вт_НаборДанных.ХарактеристикаПродукции";
	
	Запрос.УстановитьПараметр("ДанныеПоСебестоимости", 3);
	Запрос.УстановитьПараметр("Период", ДокументКалькуляции.Дата);
	Запрос.УстановитьПараметр("Калькуляция", ДокументКалькуляции);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВидЦены = Константы.ВидЦеныПлановойСтоимостиМатериаловРабот.Получить();
	
	//НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.УстановкаЦенНоменклатуры"));
	//НовыйДокумент.Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
	//НовыйДокумент.ДокументОснование = ДокументКалькуляции;
	//НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	//
	//СтрокаДокумента = НовыйДокумент.ВидыЦен.Добавить();
	//СтрокаДокумента.ВидЦены = ВидЦены;
	
	ТаблицаНоменклатуры = новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура");
	ТаблицаНоменклатуры.Колонки.Добавить("Характеристика");
	ТаблицаНоменклатуры.Колонки.Добавить("ВидЦены");
	ТаблицаНоменклатуры.Колонки.Добавить("Цена");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаТЗ = ТаблицаНоменклатуры.Добавить();
		СтрокаТЗ.Номенклатура = ВыборкаДетальныеЗаписи.Продукция;
		СтрокаТЗ.Характеристика = ВыборкаДетальныеЗаписи.ХарактеристикаПродукции;
		СтрокаТЗ.ВидЦены = ВидЦены;
		СтрокаТЗ.Цена = ВыборкаДетальныеЗаписи.Стоимость;
		
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(ТаблицаНоменклатуры, Новый УникальныйИдентификатор);
	Возврат Адрес
	
КонецФункции