#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область НачальноеЗаполнениеДанных

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УдерживаемыеДоПогашения";
	Элемент.Код 					  = "000000002";
	Элемент.Наименование 			  = НСтр("ru = 'Удерживаемые до погашения'; en = 'Held-to-maturity'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ТипКатегории 			  = Перечисления.бит_му_ТипыКатегорийФинансовыхАктивовМСФО.УдерживаемыеДоПогашения;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИмеющиесяДляПродажи";
	Элемент.Код 					  = "000000003";
	Элемент.Наименование 			  = НСтр("ru = 'Имеющиеся для продажи'; en = 'Available for sale'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ТипКатегории 			  = Перечисления.бит_му_ТипыКатегорийФинансовыхАктивовМСФО.ИмеющиесяДляПродажи;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КредитыИДебиторскаяЗадолженность";
	Элемент.Код 					  = "000000004";
	Элемент.Наименование 			  = НСтр("ru = 'Кредиты и дебиторская задолженность'; en = 'Loans and receivables'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ТипКатегории 			  = Перечисления.бит_му_ТипыКатегорийФинансовыхАктивовМСФО.КредитыИДебиторскаяЗадолженность;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УчитываемыеПоСправедливойСтоимости";
	Элемент.Код 					  = "000000001";
	Элемент.Наименование			  = НСтр("ru = 'Учитываемые по справедливой стоимости'; en = 'Accounted for at fair value'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ТипКатегории			  = Перечисления.бит_му_ТипыКатегорийФинансовыхАктивовМСФО.УчитываемыеПоСправедливойСтоимости;
	
КонецПроцедуры

// См. бит_ОбновлениеИнформационнойБазыБФ.ПередОбновлениемИнформационнойБазы().
//
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

#КонецОбласти
 
#КонецОбласти

#КонецЕсли