#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура(); 
	ТекстЗапроса = ТекстЗапросаНазначениеПравилТрансляции(НомераТаблиц);

	Запрос.Текст = ТекстЗапроса;			 
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Процедура СформироватьНазначениеПравилТрнасляции(НазначениеПравилТрнасляции, Движения, Отказ) Экспорт

	Если НЕ ЗначениеЗаполнено(НазначениеПравилТрнасляции) Тогда
		Возврат;
	КонецЕсли;
	
	Проводки = Движения.бит_НазначениеПравилТрансляции;
	Проводки.Записывать	 = Истина;
	
	Для каждого СтрокаТаблицы Из НазначениеПравилТрнасляции Цикл
		ЗаполнитьЗначенияСвойств(Проводки.Добавить(), СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаНазначениеПравилТрансляции(НомераТаблиц)

	НомераТаблиц.Вставить("НазначениеПравилТрансляции", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НазначениеПравилТрансляции.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА Список.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НазначениеПравилТрансляции.ДатаНачала
	|		ИНАЧЕ Список.ДатаНачала
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА НазначениеПравилТрансляции.ГруппаСтруктурныхПодразделений <> ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка)
	|			ТОГДА НазначениеПравилТрансляции.ГруппаСтруктурныхПодразделений
	|		ИНАЧЕ НазначениеПравилТрансляции.Организация
	|	КОНЕЦ КАК СтруктурноеПодразделение,
	|	Список.ПравилоТрансляции КАК ПравилоТрансляции,
	|	Список.Приоритет КАК Приоритет,
	|	Список.Назначение КАК Назначение,
	|	Список.ДатаОкончания КАК ДатаОкончания,
	|	Список.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.бит_НазначениеПравилТрансляции.ПравилаТрансляции КАК Список
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_НазначениеПравилТрансляции КАК НазначениеПравилТрансляции
	|		ПО Список.Ссылка = НазначениеПравилТрансляции.Ссылка
	|			И (Список.Ссылка = &Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Список.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

#КонецОбласти 

#КонецЕсли
