#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.бит_ПравилаТрансляции") Тогда
		НоваяСтрокаПравил = ПравилаТрансляции.Добавить();
	    НоваяСтрокаПравил.ПравилоТрансляции = ДанныеЗаполнения;
		НоваяСтрокаПравил.Назначение = Перечисления.бит_НазначенияПравилТрансляции.Трансляция;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("МассивПравил") Тогда
			ЗаполнитьПоНаборуПравилТрансляции(ДанныеЗаполнения.МассивПравил);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли; 
	КонецЕсли;
	
	ЗаполнитьШапкуДокумента();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.бит_НазначениеПравилТрансляции.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Документы.бит_НазначениеПравилТрансляции.СформироватьНазначениеПравилТрнасляции(
		ПараметрыПроведения.НазначениеПравилТрансляции, Движения, Отказ);
		
	Если ОбновитьДанныеСеанса() Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли; 
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ОбновитьДанныеСеанса() Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли; 

КонецПроцедуры
	
Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнитьШапкуДокумента(ОбъектКопирования);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьНазначениеПравилЗаполненияПолей(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьШапкуДокумента(ОбъектКопирования = Неопределено)
	
	Дата = ТекущаяДатаСеанса();
	
	// Заполнить реквизиты значениями по умолчанию.
	ДатаНачала = Дата;
		
	// Заполним шапку документа значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ОбъектКопирования);
	
КонецПроцедуры // ЗаполнитьШапкуДокумента()

Процедура ЗаполнитьПоНаборуПравилТрансляции(НаборПравил)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборПравил", НаборПравил);
	Запрос.УстановитьПараметр("ДатаНачала",  ТекущаяДатаСеанса());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаТрансляции.Ссылка КАК ПравилоТрансляции,
	|	ЗНАЧЕНИЕ(Перечисление.бит_НазначенияПравилТрансляции.Трансляция) КАК Назначение,
	|	&ДатаНачала КАК ДатаНачала
	|ИЗ
	|	Справочник.бит_ПравилаТрансляции КАК ПравилаТрансляции
	|ГДЕ
	|	НЕ ПравилаТрансляции.ЭтоГруппа
	|	И НЕ ПравилаТрансляции.ПометкаУдаления
	|	И ПравилаТрансляции.Ссылка В(&НаборПравил)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПравилаТрансляции.Добавить(), Выборка);
		НоваяСтрокаПравил = ПравилаТрансляции.Добавить();
	КонецЦикла;

КонецПроцедуры

Функция ОбновитьДанныеСеанса()

	Отбор 	  = Новый Структура("Назначение", Перечисления.бит_НазначенияПравилТрансляции.ПодборТиповПроводок);
	Результат = ПравилаТрансляции.НайтиСтроки(Отбор);

	Возврат ЗначениеЗаполнено(Результат);
	
КонецФункции

Процедура ПроверитьНазначениеПравилЗаполненияПолей(Отказ)
		
	ПравилаДляПроверки = Новый Массив; 
	Для каждого СтрокаТаблицы Из ПравилаТрансляции Цикл
		Если СтрокаТаблицы.Назначение = Перечисления.бит_НазначенияПравилТрансляции.Трансляция 
			ИЛИ СтрокаТаблицы.Назначение = Перечисления.бит_НазначенияПравилТрансляции.ТрансляцияИПодборСчетов Тогда
			ПравилаДляПроверки.Добавить(СтрокаТаблицы.ПравилоТрансляции);
		КонецЕсли;
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(ПравилаДляПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПравилаДляПроверки", ПравилаДляПроверки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаТрансляции.Источник КАК Источник,
	|	ПравилаТрансляции.Приемник КАК Приемник,
	|	ПравилаТрансляции.Ссылка КАК Правило,
	|	ПравилаТрансляции.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ВТСписокПравил
	|ИЗ
	|	Справочник.бит_ПравилаТрансляции КАК ПравилаТрансляции
	|ГДЕ
	|	ПравилаТрансляции.Ссылка В(&ПравилаДляПроверки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НазначениеПравилЗаполненияПриТрансляции.Источник КАК Источник,
	|	НазначениеПравилЗаполненияПриТрансляции.Приемник КАК Приемник
	|ПОМЕСТИТЬ ВТНазначениеПравилДляПолей
	|ИЗ
	|	РегистрСведений.бит_НазначениеПравилЗаполненияПриТрансляции КАК НазначениеПравилЗаполненияПриТрансляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокПравил КАК ВТСписокПравил
	|		ПО НазначениеПравилЗаполненияПриТрансляции.Источник = ВТСписокПравил.Источник
	|			И НазначениеПравилЗаполненияПриТрансляции.Приемник = ВТСписокПравил.Приемник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСписокПравил.Правило КАК Правило,
	|	ВТНазначениеПравилДляПолей.Источник ЕСТЬ NULL КАК НетПравилЗаполненияПолей,
	|	ВТСписокПравил.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	ВТСписокПравил КАК ВТСписокПравил
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНазначениеПравилДляПолей КАК ВТНазначениеПравилДляПолей
	|		ПО ВТСписокПравил.Источник = ВТНазначениеПравилДляПолей.Источник
	|			И ВТСписокПравил.Приемник = ВТНазначениеПравилДляПолей.Приемник";	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТаблицы Из ПравилаТрансляции Цикл
		
		Поле = "ПравилаТрансляции[%1].ПравилоТрансляции";
		Поле = СтрШаблон(Поле, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="));
		РезультатПоиска = Результат.Найти(СтрокаТаблицы.ПравилоТрансляции, "Правило");
		
		Если РезультатПоиска.ПометкаУдаления Тогда
			ШаблонСообщения = НСтр("ru = 'Правило трансляции помечено на удаление.';
									|en = 'The сonversion rule is marked for deletion.'");
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
								НСтр("ru = 'Правило'"), СтрокаТаблицы.НомерСтроки, 
								НСтр("ru = 'Правила трансляции'"), ШаблонСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
		Если НЕ (СтрокаТаблицы.Назначение = Перечисления.бит_НазначенияПравилТрансляции.Трансляция 
			ИЛИ СтрокаТаблицы.Назначение =  Перечисления.бит_НазначенияПравилТрансляции.ТрансляцияИПодборСчетов) Тогда
			Продолжить;			
		КонецЕсли;

		Если РезультатПоиска.НетПравилЗаполненияПолей Тогда
			ШаблонСообщения = НСтр("ru = 'Нет зарегистрированных правил заполнения полей.'; 
									|en = 'There are no registered rules for filling in fields.'") ;
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
								НСтр("ru = 'Правило'"), СтрокаТаблицы.НомерСтроки, 
								НСтр("ru = 'Правила трансляции'"), ШаблонСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли