
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ПодходящийСтатус(ПараметрКоманды) Тогда
	 	ТекстСообщения = НСтр("ru = 'Ввод на основании доступен для документов в статусах с типом ""Утвержден"".'; 
								|en = 'Input based on is available for documents in statuses with the type ""Approved"".'");
		ВызватьИсключение ТекстСообщения;	
	КонецЕсли;            
	
	МодульСтрокой		   = "Документ.бит_кзн_ЗаявкаНаРасходованиеСредств";
	ПараметрыОткрытияФормы = бит_КазначействоВызовСервера.ПараметрыФормыВводНаОсновании(МодульСтрокой, ПараметрКоманды);
	
	Если ПараметрыОткрытияФормы.Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Нет остатков прогнозов списаний денежных средств.'; 
							|en = 'There are no balances of forecasts of cash write-offs.'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	
	ОткрытьФорму(ПараметрыОткрытияФормы.ИмяФормы, ПараметрыОткрытияФормы.ПараметрыФормы,
				ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры
			
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодходящийСтатус(Заявка)
		
	СтатусОбъекта = бит_ВизированиеСервер.ТекущийСтатус(Заявка);  
	
	ПодходящиеТипы = Новый Массив;
	ПодходящиеТипы.Добавить(Перечисления.бит_ТипыСтатусовОбъектов.Утвержден);
	ПодходящиеТипы.Добавить(Перечисления.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен);
	
	Возврат Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(СтатусОбъекта, ПодходящиеТипы);
	
КонецФункции
 
#КонецОбласти