#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Процедура устанавливает значения регистра по умолчанию
//
// Параметры:
//   Запись           - РегистрСведенийЗапись - запись регистра
//   ДанныеЗаполнения - Структура - где ключ - имя ресурса
//
Процедура УстановкаНастроекПоУмолчанию(Запись, ДанныеЗаполнения) Экспорт
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Период",
		ТекущаяДатаСеанса());
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СтруктурноеПодразделение",
		Неопределено);
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СценарийОтраженияФактаБДДС",
		Справочники.СценарииПланирования.ФАКТ);
		
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"НеФормироватьДвиженияПоФактуАвтоматически",
		Ложь);
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"НеФормироватьПроводкиБюджетированияПриАвтоматическомСбореФакта",
		Истина);
		
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ОтражатьФактБДДСНаОснованииОперУчета",
		Ложь);

	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ФормироватьЗависимыеОборотыПриАвтоматическомСбореФакта",
		Ложь);
		
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету",
		Ложь);
			
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли