&После("ПриСозданииНаСервере")
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.9] [Микляев К.А.] [10.06.2026] +
	бит_ДобавитьПолеКодаВРЦ();
	// }}ПервыйБИТ ЛистТребований [ЛТ6.9] [Микляев К.А.] [10.06.2026] -
КонецПроцедуры

&НаСервере
Процедура бит_ДобавитьПолеКодаВРЦ()
	
	Если Элементы.Найти("бит_КодВРЦ") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = Элементы.Найти("ГруппаДополнительныеРеквизиты");
	Если Родитель = Неопределено Тогда
		Родитель = Элементы.Найти("ГруппаРабочиеЦентры");
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("бит_КодВРЦ", Тип("ПолеФормы"));
	Иначе
		НовыйЭлемент = Элементы.Добавить("бит_КодВРЦ", Тип("ПолеФормы"), Родитель);
	КонецЕсли;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КодВРЦ";
	НовыйЭлемент.Заголовок = "(бит) Код ВРЦ";
	НовыйЭлемент.ТолькоПросмотр = Истина;
		
КонецПроцедуры
