
	
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокОбъектов        = Параметры.СписокОбъектов;
	ДоступныеВидыОбъектов = Параметры.ДоступныеВидыОбъектов;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокОбъектовЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокОбъектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектСистемы = ТекущиеДанные.Значение;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов",         ДоступныеВидыОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы", ОбъектСистемы);
	ПараметрыФормы.Вставить("ТолькоВключенные",     Истина);
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаСервере
Функция КорректныйВидОбъектаСистемы(Знач ОбъектСистемы)
	
	Если НЕ ЗначениеЗаполнено(ОбъектСистемы) Тогда 
		Возврат Истина;
	КонецЕсли;
	
	ВидОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСистемы, "ВидОбъекта");
	Если ДоступныеВидыОбъектов.НайтиПоЗначению(ВидОбъекта) = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Объекты системы вида ""%1"" не доступны для выбора.';
							  |en='Objects of the system type ""%1"" is not available for selection.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ВидОбъекта); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура СписокОбъектовЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокОбъектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектСистемы = ТекущиеДанные.Значение;
	
	Если НЕ КорректныйВидОбъектаСистемы(ОбъектСистемы) Тогда
		ТекущиеДанные.Значение = Неопределено;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПустойОбъект = ПредопределенноеЗначение("Справочник.бит_ОбъектыСистемы.ПустаяСсылка");
	Если СписокОбъектов.НайтиПоЗначению(ПустойОбъект) <> Неопределено Тогда
		ТекстСообщения = НСтр("ru='Выбор пустого объекта недопустим.';
							  |en='Cant choose empty object.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	ОповеститьОВыборе(СписокОбъектов);
	
КонецПроцедуры

#КонецОбласти
