////////////////////////////////////////////////////////////////////////////////
// В этом модуле содержится дополнения БИТ к коду обработчиков модуля приложения. 
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура выполняется перед интерактивном началом работы пользователя с областью данных.
// Соответствует обработчику ПередНачаломРаботыСистемы
// 
// Параметры:
// Отказ - Булево - отказ в от начала работы. Если параметр установить в Истина,
// 					начало работы с областью осуществлено не будет.
// 
Процедура ПередНачаломРаботыСистемы(Отказ) Экспорт
	
	РезСтр = бит_ПолныеПраваВызовСервера.ДействияПередСтартомСистемы();	
	Если РезСтр.Отказ Тогда		
		Отказ = Истина;
		ВызватьИсключение РезСтр.ТекстСообщения;		
	Иначе
		бит_РаботаСДиалогамиКлиент.УстановитьПараметрыОпций(РезСтр.ЭтоИнтПоставка);
	КонецЕсли; 
		
КонецПроцедуры

// Процедура выполняется при интерактивном начале работы пользователя с областью данных.
// Соответствует обработчику ПриНачалеРаботыСистемы
// 
// Параметры
//   ПараметрыРаботыКлиента - ФиксированнаяСтруктура - параметры работы клиента при запуске. 
//                            См. в ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиентаПриЗапуске.
// 
Процедура ПриНачалеРаботыСистемы(ПараметрыРаботыКлиента) Экспорт
	
	бит_ОбщегоНазначенияКлиент.ДействияПриНачалеРаботыСистемы();
	
	Если ПараметрыРаботыКлиента.Свойство("бит_ОбновитьИнтерфейс")
		И ПараметрыРаботыКлиента.бит_ОбновитьИнтерфейс Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в обработчике ПередНачаломРаботыСистемы, проверяет возможность
// обновления на текущую версию программы.
//
Процедура ПриОпределенииВозможностиОбновления() Экспорт
	
	// ЗДЕСЬ МОЖНО ОГРАНИЧИТЬ МИНИМАЛЬНУЮ ВЕРСИЮ ПРИ ОБНОВЛЕНИИ КОНФИГУРАЦИИ.
	// См. ОбновлениеИнформационнойБазыКлиентПереопределяемый.ПриОпределенииВозможностиОбновления().
	МинимальноДопустимаяВерсия = "3.2.28";
	
	ПараметрыКлиента = бит_ОбщегоНазначенияВызовСервера.ПараметрыРаботыКлиентаПриЗапуске();
	
	Если ПараметрыКлиента.ВерсияДанных = "0.0.0.0" Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим допустимость обновления
	ТекущаяВерсияКонфигурации  = ОбщегоНазначенияКлиентСервер.ВерсияКонфигурацииБезНомераСборки(ПараметрыКлиента.ВерсияДанных);
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ТекущаяВерсияКонфигурации, МинимальноДопустимаяВерсия) < 0 Тогда
		Сообщение =
			НСтр("ru = 'Обновление на текущую версию допустимо только с версии %1 и выше.
			|(Недопустимая попытка обновления с версии %2)
			|Необходимо восстановить информационную базу из резервной копии
			|и повторить обновление согласно файлу ReadMe.txt';
			|en = 'Only version %1 and higher can be updated to the current version.
			|(Invalid attempt to update from version %2)
			|Restore the Infobase from backup and try updating again according to file
			|ReadMe.txt'");
		Сообщение = СтрШаблон(Сообщение, МинимальноДопустимаяВерсия, ПараметрыКлиента.ВерсияДанных);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти

