
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов.
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов.
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства	
	
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ИспользуютсяЕдиницыИзмерения = бит_ОбщегоНазначения.ЭтоСемействоБП();
	
	// Заполним кэш значений, доступный на сервере и клиенте.
	ЗаполнитьКэшЗначений();
	
	УстановитьПараметрыВыбораВидаОперации(ЭтотОбъект);
	
	// Отобразим данные в табличном поле "Разрезы бюджетирования".
	ОтобразитьРазрезыБюджетирования();
	
	ЕстьПраво = ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.бит_МаскиКодов);
	Элементы.НастроитьМаскуКодификатора.Видимость = ЕстьПраво;
	
	ЕстьПраваНаШаблоныПроводок = ПравоДоступа("Редактирование",
		Метаданные.РегистрыСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов);
	
	УправлениеФормой(ЭтотОбъект);
	                   
	УстановитьМаскиЭлементам();
	УстановитьУсловноеОформление();
	
	АктивныйЭлементПоУмолчанию = Параметры.АктивныйЭлементПоУмолчанию;
	Если НЕ ПустаяСтрока(АктивныйЭлементПоУмолчанию) Тогда
		ЭлементПоУмолчанию = Элементы.Найти(АктивныйЭлементПоУмолчанию);
		Если ЭлементПоУмолчанию <> Неопределено Тогда
			ТекущийЭлемент = ЭлементПоУмолчанию;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	УстановитьФлагФормироватьНаименованиеПолноеАвтоматически();
 	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УстановитьРазрезыБюджетирования();
	
КонецПроцедуры // ПередЗаписью()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "ЗаписанаМаскаКода" И Параметр = ОбъектСистемы Тогда
		УстановитьМаскиЭлементам();	
	ИначеЕсли ИмяСобытия = "ЗаписанШаблонПроводкиБюджетирования" Тогда
		ОбработатьЗаписьШаблонаПроводкиБюджетирования(Параметр);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ИзмененыШаблоныПроводок Тогда
		НазначитьШаблоныПроводок(ТекущийОбъект);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_СтатьиОборотов", ПараметрыЗаписи, Объект.Ссылка);
	ОповеститьОЗаписиНового(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОтобразитьРазрезыБюджетирования();
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	СформироватьНаименованиеПолноеАвтоматически();

КонецПроцедуры // НаименованиеПриИзменении()

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)

	УстановитьФлагФормироватьНаименованиеПолноеАвтоматически();

КонецПроцедуры // НаименованиеПолноеПриИзменении()

&НаКлиенте
Процедура НаименованиеПолноеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
	
		Объект.НаименованиеПолное = ВыбранноеЗначение;
		ФормироватьНаименованиеПолноеАвтоматически = Истина;
	
	КонецЕсли;
	
КонецПроцедуры // НаименованиеПолноеОбработкаВыбора()

&НаКлиенте
Процедура НаименованиеПолноеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	
	Элемент.СписокВыбора.Добавить(Объект.Наименование);
	
КонецПроцедуры // НаименованиеПолноеАвтоПодбор()

&НаКлиенте
Процедура Учет_КоличествоПриИзменении(Элемент)
	
	НовоеЗначение = Объект.Учет_Количество;
	ПриИзмененииВидаУчета(Объект.Учет_Количество);
	
	Если Объект.Учет_Количество <> НовоеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеФормойПриИзмененииУчетаКоличества(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Учет_СуммаПриИзменении(Элемент)
	
	НовоеЗначение = Объект.Учет_Сумма;
	ПриИзмененииВидаУчета(Объект.Учет_Сумма);
	
	Если Объект.Учет_Сумма <> НовоеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.Учет_Сумма Тогда
		Объект.ЭтоКоэффициент = Ложь;
	КонецЕсли; 
	
	УправлениеФормойПриИзмененииУчетаСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСтатьиПриИзменении(Элемент)
	
	ТипыСтатейБДР 					 = ПредопределенноеЗначение("Перечисление.бит_ТипыСтатейОборотов.БДР");
	ТипыСтатейНефинансовыйПоказатель = ПредопределенноеЗначение("Перечисление.бит_ТипыСтатейОборотов.НефинансовыйПоказатель");
	ТипыСтатейФинансовыйПоказатель	 = ПредопределенноеЗначение("Перечисление.бит_ТипыСтатейОборотов.ФинансовыйПоказатель");
	
	Если Объект.ТипСтатьи = ТипыСтатейБДР Тогда
		
		Объект.СтавкаНДС = СтавкаНДСБезНДС();
		
	ИначеЕсли Объект.ТипСтатьи = ТипыСтатейНефинансовыйПоказатель ИЛИ Объект.ТипСтатьи = ТипыСтатейФинансовыйПоказатель Тогда
		
		Объект.СтавкаНДС   = СтавкаНДСБезНДС();
		Объект.ВидСтатьи   = ПредопределенноеЗначение("Справочник.бит_ВидыСтатейОборотов.ПустаяСсылка");
		Объект.РасходДоход = ПредопределенноеЗначение("Перечисление.бит_РасходДоход.ПустаяСсылка");
		
	КонецЕсли; 
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры // ТипСтатьиПриИзменении()

&НаКлиенте
Процедура РасходДоходПриИзменении(Элемент)
	
	Объект.ВидОперации = Неопределено;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры // РасходДоходПриИзменении()

&НаКлиенте
Процедура НеКонтролировать_ЗаявкиПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НеКонтролировать_БюджетыПриИзменении(Элемент)
	
	Объект.НеКонтролировать_Количество = Объект.НеКонтролировать_Бюджеты;
	Объект.НеКонтролировать_Сумма = Объект.НеКонтролировать_Бюджеты;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НеКонтролировать_ГрафикиПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ФормаОплаты) Тогда
		Объект.ВидОперации = Неопределено;
	Иначе
		ДоступныеЗначения = ДоступныеЗначенияВидовОпераций(Объект.ФормаОплаты);
		Если ДоступныеЗначения.НайтиПоЗначению(Объект.ВидОперации) = Неопределено Тогда
			Объект.ВидОперации = ДоступныеЗначения[0].Значение;
		КонецЕсли; 
	КонецЕсли;
	
	УстановитьПараметрыВыбораВидаОперации(ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРазрезПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РазрезыБюджетирования.ТекущиеДанные;
	Если ТекущиеДанные.ИспользоватьРазрез = Ложь Тогда
		Если Параметры.Ключ.Пустая() Тогда
			ЕстьДвиженияПоСтатье = Ложь;
		Иначе
			ЕстьДвиженияПоСтатье = ЕстьДвиженияПоСтатье(Объект.Ссылка, ТекущиеДанные.ИмяРеквизита);
		КонецЕсли;
		Если ЕстьДвиженияПоСтатье Тогда
			Оповещение = Новый ОписаниеОповещения("ИспользоватьРазрезПриИзмененииЗавершение", ЭтотОбъект);
			ТекстСообщения1 = НСтр("ru = 'По данной статье есть движения.'; en = 'There are movements under this article.'");
			ТекстСообщения2 = НСтр("ru = 'Для корректной работы системы после изменений необходимо самостоятельно перепровести документы с движениями по статье.';
				|en = 'For the correct operation of the system after the changes it is necessary to independently rewrite documents with movements according to the article.'");
			ТекстСообщения3 = НСтр("ru = 'Данные по отключенной аналитике будут удалены. Продолжить?'; en = 'Disabled analytics data will be deleted. Proceed?'");
			ТекстСообщения = НСтр("ru = '%1 %2 %3'; en = '%1 %2 %3'"); 
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстСообщения1, ТекстСообщения2, ТекстСообщения3); 			
			ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		Иначе
			ТекущиеДанные.Обязательный = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	РазрезыБюджетированияУстановитьЗаголовок(ЭтотОбъект);
	
КонецПроцедуры

// Процедура обработчик оповещения "ИспользоватьРазрезПриИзмененииЗавершение".
//
// Параметры:
// Результат - КодВозвратаДиалога
// ДополнительныеДанные - Структура.
//
&НаКлиенте
Процедура ИспользоватьРазрезПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = Элементы.РазрезыБюджетирования.ТекущиеДанные;
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные.Обязательный = Ложь;
	Иначе	
		ТекущиеДанные.ИспользоватьРазрез = Истина;
	КонецЕсли;
	РазрезыБюджетированияУстановитьЗаголовок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОсновнаяПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ИндивидуальнаяНастройкаШаблоновПроводокПриИзменении(Элемент)
	
	Если ИндивидуальнаяНастройкаШаблоновПроводок Тогда
		ИзмененыШаблоныПроводок = Истина;
	Иначе	
		ЗаполнитьШаблоныПроводокПоУмолчанию();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	Если НЕ ИндивидуальнаяНастройкаШаблоновПроводок Тогда
		ЗаполнитьШаблоныПроводокПоУмолчанию();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШаблоныПроводок

&НаКлиенте
Процедура ШаблоныПроводокПриИзменении(Элемент)
	
	ИзмененыШаблоныПроводок = Истина;
	КоличествоШаблонов 		= ШаблоныПроводок.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПроводокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ШаблоныПроводок.ТекущиеДанные;
	Если Поле <> Элементы.ШаблоныПроводокШаблонПроводки И ЗначениеЗаполнено(ТекущиеДанные.ШаблонПроводки) Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ТекущиеДанные.ШаблонПроводки));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПроводокШаблонПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ШаблоныПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ШаблонПроводки) Тогда
		ЗаполнитьДобавленныеКолонкиТаблицыШаблоныПроводок(ТекущиеДанные.ПолучитьИдентификатор());
	Иначе	
		ДанныеСтроки = НовыеДанныеСтрокиШаблоныПроводок();
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура НастроитьМаскуКодификатора(Команда)

	Отборы = Новый Структура;
	Отборы.Вставить("ОбъектСистемы", ОбъектСистемы);
	Отборы.Вставить("ИмяРеквизита",  "Кодификатор");
	
	ПараметрыФормы = Новый Структура("Отбор", Отборы);
	ОткрытьФорму("РегистрСведений.бит_МаскиКодов.ФормаСписка", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШаблонИзИсточника(Команда)
	
	ПараметрыФормы = Новый Структура("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
 	Оповещение	   = Новый ОписаниеОповещения("ДобавитьШаблонИзИсточникаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.бит_СтатьиОборотов.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,, Оповещение);

КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ДобавитьШаблонИзИсточникаЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьШаблоныПроводок(Результат);
	
	ИзмененыШаблоныПроводок							  = Истина;
	ИндивидуальнаяНастройкаШаблоновПроводок = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборШаблоновПроводок(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);

	Оповещение = Новый ОписаниеОповещения("ПодборШаблоновПроводокЗавершение", ЭтотОбъект);

	ОткрытьФорму("Справочник.бит_ШаблоныПроводокБюджетирования.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,
		Оповещение);
		
КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ПодборШаблоновПроводокЗавершение(Результат, Дополнительно) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;	
	КонецЕсли;
	
	ИзмененСоставСтрок = Ложь;
	Для каждого Элемент Из Результат Цикл
		УжеПодобран = Ложь;
		Для каждого СтрокаТаблицы Из ШаблоныПроводок Цикл
			Если СтрокаТаблицы.ШаблонПроводки = Элемент Тогда
				УжеПодобран = Истина;
				Прервать;		
			КонецЕсли;
		КонецЦикла;
		Если НЕ УжеПодобран Тогда
			НоваяСтрока = ШаблоныПроводок.Добавить();
			НоваяСтрока.ШаблонПроводки = Элемент;
			ИзмененСоставСтрок = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемыСвойства

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти 

&НаСервереБезКонтекста
Функция ДоступныеЗначенияВидовОпераций(Знач ФормаОплаты)
	
	// ++ ЕРП 
	Модуль = Перечисления.бит_ВидыОперацийКазначейства;
	// -- ЕРП 
	Возврат Модуль.ПолучитьДоступныеЗначения(Новый Структура("ФормаОплаты", ФормаОплаты)).ДоступныеЗначения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьПараметрыВыбораВидаОперации(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	НовыеПараметры = Новый Массив; 
	НовыеПараметры.Добавить(Новый ПараметрВыбора("Отбор.ФормаОплаты", Объект.ФормаОплаты));
	Элементы.ВидОперации.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
	
КонецПроцедуры

// Процедура заполняет кэш значений доступных на сервере и на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	КэшЗначений = Новый Структура;
	
	КэшЗначений.Вставить("НастройкиАналитик", бит_Бюджетирование.НастройкиИзмеренийБюджетирования());
	ЕстьДокументЗаявка = Истина;
	
КонецПроцедуры // ЗаполнитьКэшЗначений()
  
&НаКлиенте 
Процедура УправлениеФормойПриИзмененииУчетаСуммы()
	
	Элементы.ЭтоКоэффициент.Доступность = Объект.Учет_Сумма;

КонецПроцедуры
  
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормойПриИзмененииУчетаКоличества(Форма)
	
	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;
	
	Если Форма.ИспользуютсяЕдиницыИзмерения Тогда
		Элементы.ЕдиницаИзмерения.Доступность				= Объект.Учет_Количество;	
		Элементы.ЕдиницаИзмерения.АвтоОтметкаНезаполненного = Объект.Учет_Количество;
	Иначе	
		Элементы.ЕдиницаИзмерения.Видимость = Ложь;
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект	 = Форма.Объект;
	
	Элементы.ЭтоКоэффициент.Доступность = Объект.Учет_Сумма;
	УправлениеФормойПриИзмененииУчетаКоличества(Форма); 	
	
	ЭтоНефинансовыйПоказатель = ЭтоПоказатель(Объект.ТипСтатьи);
	
	Элементы.СтавкаНДС.ТолькоПросмотр   	   	   = ЭтоНефинансовыйПоказатель;
	Элементы.РасходДоход.ТолькоПросмотр 	   	   = ЭтоНефинансовыйПоказатель;	 
	Элементы.РасходДоход.ОтметкаНезаполненного 	   = НЕ ЭтоНефинансовыйПоказатель;
	Элементы.РасходДоход.АвтоОтметкаНезаполненного = НЕ ЭтоНефинансовыйПоказатель;
							
	Элементы.НеКонтролировать_Количество.Доступность = НЕ Объект.НеКонтролировать_Бюджеты;	
	Элементы.НеКонтролировать_Сумма.Доступность 	 = НЕ Объект.НеКонтролировать_Бюджеты;					
						
	Если Форма.ЕстьДокументЗаявка Тогда
		Элементы.ГруппаВидОперацииФормаОплаты.Видимость = Объект.ТипСтатьи = ПредопределенноеЗначение("Перечисление.бит_ТипыСтатейОборотов.БДДС");
		Элементы.ВидОперации.Видимость 					= Объект.РасходДоход = ПредопределенноеЗначение("Перечисление.бит_РасходДоход.Расходование");
		Если Элементы.ВидОперации.Видимость Тогда
			Элементы.ВидОперации.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Объект.ФормаОплаты);
		КонецЕсли;
	Иначе
		Элементы.ГруппаВидОперацииФормаОплаты.Видимость = Ложь;	
	КонецЕсли;					
	
	Если Объект.ТипСтатьи = ПредопределенноеЗначение("Перечисление.бит_ТипыСтатейОборотов.БДДС") 
		ИЛИ Объект.ТипСтатьи = ПредопределенноеЗначение("Перечисление.бит_ТипыСтатейОборотов.Прочее") Тогда		
		Элементы.РазрешитьПроводитьБезЗаявки.Видимость = Истина;		
	Иначе
		Элементы.РазрешитьПроводитьБезЗаявки.Видимость = Ложь;
	КонецЕсли;
	
	РазрезыБюджетированияУстановитьЗаголовок(Форма);

	Если Форма.ЕстьПраваНаШаблоныПроводок Тогда
		Элементы.ШаблоныПроводок.ТолькоПросмотр = НЕ Форма.ИндивидуальнаяНастройкаШаблоновПроводок;
	Иначе
		Элементы.ШаблоныПроводок.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ШаблоныПроводокДобавитьШаблонИзИсточника.Доступность = НЕ Элементы.ШаблоныПроводок.ТолькоПросмотр;
	Элементы.ШаблоныПроводокПодборШаблоновПроводок.Доступность	  = НЕ Элементы.ШаблоныПроводок.ТолькоПросмотр;
	
КонецПроцедуры
 
// Процедура заполняет таблицу значений "РазрезыБюджетирования" по данным текущего объекта.
// 
&НаСервере
Процедура ОтобразитьРазрезыБюджетирования()

	Измерения = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("произвольные","синоним");
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	МетаданныеОбъекта = СправочникОбъект.Метаданные();
	
	// Получаем настройки используемых дополнительных измерений.
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");

	РазрезыБюджетирования.Очистить();
	Для каждого КлючИЗначение Из Измерения Цикл
		
		ИмяРеквизита 			 = "Учет_" + КлючИЗначение.Ключ;
		ИмяРеквизитаОбязательный = "Обязательный_" + КлючИЗначение.Ключ;
		ИмяРеквизитаИмяТипа      = "ИмяТипаПоУмолчанию_" + КлючИЗначение.Ключ;
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита,МетаданныеОбъекта) Тогда  
			
			ТекущаяНастройка = НастройкиИзмерений[КлючИЗначение.Ключ];
			Если СтрНачинаетсяС(ВРег(КлючИЗначение.Ключ), "АНАЛИТИКА") Тогда
				Если НЕ ТекущаяНастройка = Неопределено Тогда
					НоваяСтрока                    = РазрезыБюджетирования.Добавить();
					НоваяСтрока.ИмяРеквизита       = ИмяРеквизита;
					НоваяСтрока.ИспользоватьРазрез = Объект[ИмяРеквизита];
					НоваяСтрока.Измерение          = ТекущаяНастройка.Синоним;
					НоваяСтрока.ИмяТипаПоУмолчанию = Объект[ИмяРеквизитаИмяТипа];
					
					Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизитаОбязательный,МетаданныеОбъекта) Тогда
						НоваяСтрока.Обязательный = Объект[ИмяРеквизитаОбязательный];
					КонецЕсли;
					НоваяСтрока.ИмяТипаПоУмолчаниюДоступность = ТекущаяНастройка.ТипЗначения.Типы().Количество() > 1;
				КонецЕсли;
				
			Иначе
				// Обратная совместимость с БП, КОРП.
				НоваяСтрока                    = РазрезыБюджетирования.Добавить();
				НоваяСтрока.ИмяРеквизита       = ИмяРеквизита;
				НоваяСтрока.ИспользоватьРазрез = Объект[ИмяРеквизита];
				НоваяСтрока.Измерение          = КлючИЗначение.Значение;
				
				Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизитаОбязательный,МетаданныеОбъекта) Тогда
					НоваяСтрока.Обязательный = Объект[ИмяРеквизитаОбязательный];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры // ОтобразитьРазрезыБюджетирования()

&НаСервере
Процедура УстановитьРазрезыБюджетирования()
	
	Измерения = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("произвольные","синоним");
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	МетаданныеОбъекта = СправочникОбъект.Метаданные();
	
	Для каждого СтрокаТаблицы Из РазрезыБюджетирования Цикл
		ИмяРеквизита = СтрокаТаблицы.ИмяРеквизита;
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита,МетаданныеОбъекта) Тогда
			
			Если Объект[ИмяРеквизита] <> СтрокаТаблицы.ИспользоватьРазрез Тогда
				
				Объект[ИмяРеквизита] = СтрокаТаблицы.ИспользоватьРазрез;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		ИмяРеквизитаОбязательный = СтрЗаменить(СтрокаТаблицы.ИмяРеквизита, "Учет_", "Обязательный_");
		Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизитаОбязательный,МетаданныеОбъекта) Тогда
			
			Если Объект[ИмяРеквизитаОбязательный] <> СтрокаТаблицы.Обязательный Тогда
				
				Объект[ИмяРеквизитаОбязательный] = СтрокаТаблицы.Обязательный;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		ИмяРеквизитаИмяТипа      = СтрЗаменить(СтрокаТаблицы.ИмяРеквизита, "Учет_", "ИмяТипаПоУмолчанию_");
        Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизитаИмяТипа,МетаданныеОбъекта) Тогда
			
			Если Объект[ИмяРеквизитаИмяТипа] <> СтрокаТаблицы.ИмяТипаПоУмолчанию Тогда
				
				Объект[ИмяРеквизитаИмяТипа] = СтрокаТаблицы.ИмяТипаПоУмолчанию;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		
	КонецЦикла; 
		
КонецПроцедуры // УстановитьРазрезыБюджетирования()

// Процедура устанавливает маску кодификатора.
// 
&НаСервере
Процедура УстановитьМаскиЭлементам()

	ОбъектСистемы = бит_УправлениеОбъектамиСистемы.НайтиОбъектДоступаПоТипу(ТипЗнч(Объект.Ссылка), 
						Перечисления.бит_ВидыОбъектовСистемы.Справочник);
	
	// Маска кодификатора
	Элементы.Кодификатор.Маска = РегистрыСведений.бит_МаскиКодов.ПолучитьМаскуРеквизита(ОбъектСистемы, "Кодификатор");	

КонецПроцедуры // УстановитьМаскиЭлементам()

&НаКлиенте
Процедура РазрезыБюджетированияИмяТипаПоУмолчаниюАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.РазрезыБюджетирования.ТекущиеДанные;
	
	ИмяАналитики = СтрЗаменить(ТекущаяСтрока.ИмяРеквизита, "Учет_","");
	ТекНастройка = КэшЗначений.НастройкиАналитик[ИмяАналитики];
	
	Если НЕ ТекНастройка = Неопределено 
		 И ЗначениеЗаполнено(ТекНастройка.Аналитика) Тогда
		
		 МассивВыбора = ТипыПоУмолчанию(ТекНастройка.Аналитика);
		 
		 Если МассивВыбора.Количество() > 1 Тогда
			 
			 ДанныеВыбора = Новый СписокЗначений;		 
			 Для каждого Эл Из МассивВыбора Цикл
				 
				 ДанныеВыбора.Добавить(Эл);
				 
			 КонецЦикла; 
			 СтандартнаяОбработка = Ложь;
			 
		 КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипыПоУмолчанию(Знач Аналитика)
	
	МассивВыбора = РегистрыСведений.бит_НазначениеДополнительныхИзмерений.ТипыДополнительнойАналитики(Аналитика);	
	Возврат МассивВыбора;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура РазрезыБюджетированияУстановитьЗаголовок(Форма)

	РазрезыЗаголовок = НСтр("ru='Разрезы бюджетирования';en='Budgeting Dimensions'");
	Аналитики = "";
	Для каждого СтрокаТаблицы Из Форма.РазрезыБюджетирования Цикл
		Разделитель = ?(ПустаяСтрока(Аналитики), "", ", ");
		Если СтрокаТаблицы.ИспользоватьРазрез Тогда
			Аналитики = Аналитики + Разделитель + СтрокаТаблицы.Измерение;
		КонецЕсли; 
	КонецЦикла; 
	
	Разделитель = ?(ПустаяСтрока(Аналитики), "", ": ");
	Форма.Элементы.ГруппаРазрезыБюджетирования.ЗаголовокСвернутогоОтображения = РазрезыЗаголовок + Разделитель + Аналитики;
	
КонецПроцедуры

// Процедура проверяет, совпадало ли ранее полное наименование с наименованием,
// и присваивает соответствующее значение переменной мФормироватьНаименованиеПолноеАвтоматически.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте
Процедура УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()

	Если ПустаяСтрока(Объект.НаименованиеПолное) 
	 ИЛИ Объект.НаименованиеПолное = Объект.Наименование Тогда
		ФормироватьНаименованиеПолноеАвтоматически = Истина;
	Иначе
		ФормироватьНаименованиеПолноеАвтоматически = Ложь;
	КонецЕсли;

КонецПроцедуры // УстановитьФлагФормироватьНаименованиеПолноеАвтоматически()

// Процедура проверяет, необходимо ли формировать полное наименование автоматически или нет,
// и, если необходимо, формирует его.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте
Процедура СформироватьНаименованиеПолноеАвтоматически()

	Если ФормироватьНаименованиеПолноеАвтоматически Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;

КонецПроцедуры // СформироватьНаименованиеПолноеАвтоматически()

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПоказатель(ТипСтатьи)

	ЭтоПоказатель = (ТипСтатьи = ПредопределенноеЗначение("Перечисление.бит_ТипыСтатейОборотов.НефинансовыйПоказатель") 
	             ИЛИ ТипСтатьи = ПредопределенноеЗначение("Перечисление.бит_ТипыСтатейОборотов.ФинансовыйПоказатель"));
	
	Возврат ЭтоПоказатель;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	// Обязательный.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:1297-выкл Недопустимый вызов служебной процедуры или функции другой подсистемы..
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Обязательный");
	// АПК:1297-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"РазрезыБюджетирования.ИспользоватьРазрез", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// РазрезыБюджетированияИмяТипаПоУмолчанию.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:1297-выкл Недопустимый вызов служебной процедуры или функции другой подсистемы..
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РазрезыБюджетированияИмяТипаПоУмолчанию");
	// АПК:1297-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"РазрезыБюджетирования.ИмяТипаПоУмолчаниюДоступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ТекстНедоступнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<не требуется>';en='<Not required>'"));

КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ЕстьДвиженияПоСтатье(Знач СтатьяОборотов, Знач ИмяРеквизита)
	
	Результат = Ложь;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатьяОборотов", СтатьяОборотов);
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_ОборотыПоБюджетам.СтатьяОборотов КАК СтатьяОборотов
	|ПОМЕСТИТЬ ВТОбороты
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам КАК бит_ОборотыПоБюджетам
	|ГДЕ
	|	бит_ОборотыПоБюджетам.СтатьяОборотов = &СтатьяОборотов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОбороты.СтатьяОборотов КАК СтатьяОборотов
	|ИЗ
	|	ВТОбороты КАК ВТОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|		ПО ВТОбороты.СтатьяОборотов = СтатьиОборотов.Ссылка
	|ГДЕ
	|	&УсловиеОтбора";
	ТекстОтбора = СтрШаблон("СтатьиОборотов.%1 = ИСТИНА", ИмяРеквизита);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбора", ТекстОтбора);
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = Истина;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтавкаНДСБезНДС()
	// ++ ЕРП 
	Возврат ПредопределенноеЗначение("Справочник.СтавкиНДС.БезНДС");
	// -- ЕРП 
КонецФункции

&НаКлиенте
Процедура ПриИзмененииВидаУчета(ВидУчета)

	Если НЕ Объект.Учет_Количество И НЕ Объект.Учет_Сумма Тогда
		ВидУчета = Истина;
		
		ТекстСообщения = НСтр("ru = 'Один из видов учета должен быть включен.';
								|en = 'One of the types of accounting should be included.'");
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ШаблоныПроводок.Очистить();
	ПрочитатьШаблоныПроводок(Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьШаблоныПроводок(ОбъектСШаблонами)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныПроводок.ШаблонПроводки КАК ШаблонПроводки,
	|	ШаблоныПроводок.ШаблонПроводки.СчетДТ КАК СчетДТ,
	|	ШаблоныПроводок.ШаблонПроводки.СчетКТ КАК СчетКТ,
	|	ШаблоныПроводок.ШаблонПроводки.КоэффициентСумма КАК КоэффициентСумма,
	|	ШаблоныПроводок.ШаблонПроводки.КоэффициентКоличество КАК КоэффициентКоличество,
	|	ШаблоныПроводок.ШаблонПроводки.Содержание КАК Содержание,
	|	ШаблоныПроводок.Назначено КАК Назначено
	|ИЗ
	|	РегистрСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов КАК ШаблоныПроводок
	|ГДЕ
	|	ШаблоныПроводок.ОбъектСШаблонами = &ОбъектСШаблонами
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШаблоныПроводок.ШаблонПроводки";
	
	Запрос.УстановитьПараметр("ОбъектСШаблонами", ОбъектСШаблонами);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = РезультатЗапроса.Выбрать();
	
	ИндивидуальнаяНастройкаШаблоновПроводок = Ложь;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ШаблоныПроводок.Добавить(), Выборка);
		ИндивидуальнаяНастройкаШаблоновПроводок = Выборка.Назначено;
	КонецЦикла;

	КоличествоШаблонов = ШаблоныПроводок.Количество();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблицыШаблоныПроводок(ИдентификаторСтроки)

	СтрокаТаблицы 	 = ШаблоныПроводок.НайтиПоИдентификатору(ИдентификаторСтроки);
	РеквизитыШаблона = НовыеДанныеСтрокиШаблоныПроводок();
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ШаблонПроводки) Тогда
		РеквизитыШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.ШаблонПроводки,
			"СчетДТ, СчетКТ, КоэффициентСумма, КоэффициентКоличество, Содержание");
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РеквизитыШаблона);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыеДанныеСтрокиШаблоныПроводок()

	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("СчетДТ",				   Неопределено);
	ДанныеСтроки.Вставить("СчетКТ", 			   Неопределено);
	ДанныеСтроки.Вставить("КоэффициентСумма", 	   0);
	ДанныеСтроки.Вставить("КоэффициентКоличество", 0);
	ДанныеСтроки.Вставить("Содержание", 		   "");
	Возврат ДанныеСтроки;

КонецФункции

&НаКлиенте
Процедура ОбработатьЗаписьШаблонаПроводкиБюджетирования(ШаблонПроводки)

	Для каждого СтрокаТаблицы Из ШаблоныПроводок Цикл
		Если СтрокаТаблицы.ШаблонПроводки = ШаблонПроводки Тогда
			ЗаполнитьДобавленныеКолонкиТаблицыШаблоныПроводок(СтрокаТаблицы.ПолучитьИдентификатор());
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура НазначитьШаблоныПроводок(ТекущийОбъект)

	НаборЗаписей = РегистрыСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектСШаблонами.Установить(ТекущийОбъект.Ссылка);
	
	Для каждого СтрокаТаблицы Из ШаблоныПроводок Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ШаблонПроводки) Тогда
			Продолжить;	
		КонецЕсли;
		Запись = НаборЗаписей.Добавить();
		Запись.ОбъектСШаблонами = ТекущийОбъект.Ссылка;
		Запись.ШаблонПроводки	= СтрокаТаблицы.ШаблонПроводки;
		Запись.Назначено 	  	= ИндивидуальнаяНастройкаШаблоновПроводок;
	КонецЦикла;
	
	НаборЗаписей.Записать();

	ИзмененыШаблоныПроводок = Ложь;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблоныПроводокПоУмолчанию()

	ШаблоныПроводок.Очистить();
	ПрочитатьШаблоныПроводок(Объект.Родитель);
	
	ИндивидуальнаяНастройкаШаблоновПроводок = Ложь;
	ИзмененыШаблоныПроводок 						  = Истина;

КонецПроцедуры

#КонецОбласти
