
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	Если Список.Отбор.Элементы.Количество() > 0 Тогда
	
		 Для каждого Эл Из Список.Отбор.Элементы Цикл
		 
		 	Если Эл.Использование И Строка(Эл.ЛевоеЗначение) = "Владелец"  И Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			
				 ПараметрыФормы.Вставить("ВидИнформационнойБазы", Эл.ПравоеЗначение);
				 Прервать;
			
			КонецЕсли; 
		 
		 КонецЦикла; 
	
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения("ВыборОбъектовОбменаЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.бит_мдм_ФормаВыбораОбъектовОбмена", ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура обработчик оповещения "ВыборОбъектовОбменаЗавершение".
// 
// Параметры:
// Результат - Структура
// ДополнительныеДанные - Структура
// 
&НаКлиенте 
Процедура ВыборОбъектовОбменаЗавершение(Результат, ДополнительныеДанные) Экспорт
	
	Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Результат, "РезультатВыбораОбъектовОбмена") Тогда
		
		ЗаполнитьОбъектыОбмена(Результат);
		ОповеститьОбИзменении(Тип("СправочникСсылка.бит_мдм_ОписанияОбъектовОбмена"));
		 		
	КонецЕсли; 
	
КонецПроцедуры	// ВыборОбъектовОбменаЗавершение

&НаСервере
Процедура ЗаполнитьОбъектыОбмена(ДанныеВыбора)
	
	бит_мдм.ЗаполнитьОбъектыОбмена(ДанныеВыбора);
	
КонецПроцедуры // ЗаполнитьОбъектыОбмена()

#КонецОбласти