#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	
	Если Количество()>0 Тогда
	    Заголовок = СокрЛП(Регистратор);
	КонецЕсли; 
	
	ВидыСоставныхСубконто = Новый Соответствие;

	Для Каждого Проводка Из ЭтотОбъект Цикл
        
        СвСчДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
        СвСчКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
        
		Если НЕ ЗначениеЗаполнено(Проводка.СчетДт) И НЕ СвСчКт.Забалансовый Тогда
			ТекстСообщения = НСтр("ru = 'Проводка № %1 <%2>: не заполнен счет дебета.'; 
								  |en = 'Проводка № %1 <%2>: не заполнен счет дебета.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Проводка.НомерСтроки+1, Проводка.Содержание);
			Если ЗначениеЗаполнено(Заголовок) Тогда
				ОбщегоНазначения.СообщитьПользователю(Заголовок);
				Заголовок = "";		
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Проводка.СчетКт) И НЕ СвСчДт.Забалансовый Тогда
			ТекстСообщения = НСтр("ru = 'Проводка № %1 <%2>: не заполнен счет кредита.'; 
								  |en = 'Проводка № %1 <%2>: не заполнен счет кредита.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Проводка.НомерСтроки+1, Проводка.Содержание);
			Если ЗначениеЗаполнено(Заголовок) Тогда
				ОбщегоНазначения.СообщитьПользователю(Заголовок);
				Заголовок = "";		
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		бит_БухгалтерскийУчет.КорректировкаПустыхЗначенийСубконто(Проводка.СубконтоДт, ВидыСоставныхСубконто);
		бит_БухгалтерскийУчет.КорректировкаПустыхЗначенийСубконто(Проводка.СубконтоКт, ВидыСоставныхСубконто);
		
	КонецЦикла;

	бит_УправленческийУчет.ОбработатьПроводкиПоТипамПроводок(ЭтотОбъект, Регистратор);
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли