
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// ++ ЕРП
	СтандартнаяОбработка = Ложь;
	МассивИсключаемыхЗначений = Новый Массив;
	
	МассивИсключаемыхЗначений.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияПоГрафикуНачислений);
	МассивИсключаемыхЗначений.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияПоГрафикуПлатежей);
	
	ОбщегоНазначенияУТВызовСервера.ДоступныеДляВыбораЗначенияПеречисления(
		"бит_фн_ВидыСобытийОповещений",
		ДанныеВыбора,
		Параметры,
		МассивИсключаемыхЗначений);
	// -- ЕРП
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли