
&ИзменениеИКонтроль("МакетыВариантовОтчетовПечатныхФорм")
Функция бит_МакетыВариантовОтчетовПечатныхФорм()

	МакетыВариантовОтчетов = ЗарплатаКадрыОтчетыБазовый.МакетыВариантовОтчетовПечатныхФорм();

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ1.Т1", "ОбщийМакет.ПФ_MXL_Т1");
	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ5.Т5", "ОбщийМакет.ПФ_MXL_Т5");
	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ1а.Т1а", "Отчет.ПечатнаяФормаТ1а.ПФ_MXL_Т1а");
	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ5а.Т5а", "Отчет.ПечатнаяФормаТ5а.ПФ_MXL_Т5а");

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ6.Т6", "ОбщийМакет.ПФ_MXL_Т6");
	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ8.Т8", "ОбщийМакет.ПФ_MXL_Т8");
	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ6а.Т6а", "Отчет.ПечатнаяФормаТ6а.ПФ_MXL_Т6а");
	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ8а.Т8а", "Отчет.ПечатнаяФормаТ8а.ПФ_MXL_Т8а");

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ9.Т9", "Отчет.ПечатнаяФормаТ9.ПФ_MXL_Т9");
	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ9.Т10", "Отчет.ПечатнаяФормаТ9.ПФ_MXL_Т10");
	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ9.Т10а", "Отчет.ПечатнаяФормаТ9.ПФ_MXL_Т10а");

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ9а.Т9а", "Отчет.ПечатнаяФормаТ9а.ПФ_MXL_Т9а");

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ11.Т11", "Отчет.ПечатнаяФормаТ11.ПФ_MXL_Т11");
	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТ11.Т11а", "Отчет.ПечатнаяФормаТ11.ПФ_MXL_Т11а");

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТрудовойДоговорМикропредприятий.ТрудовойДоговорМикропредприятий",
	"ОбщийМакет.ПФ_MXL_ТрудовойДоговорМикропредприятий");

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаТрудовойДоговорМикропредприятий.ТрудовойДоговорМикропредприятийБезДоступаКЗарплате",
	"ОбщийМакет.ПФ_MXL_ТрудовойДоговорМикропредприятийБезДоступаКЗарплате");

	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата") Тогда

		МакетыВариантовОтчетов.Вставить("Отчет.АнализНачисленийИУдержаний.РасчетныйЛистокСРазбивкойПоИсточникамФинансирования",
		"ОбщийМакет.ПФ_MXL_РасчетныйЛистокСРазбивкойПоИсточникамФинансирования");

		МакетыВариантовОтчетов.Вставить("Отчет.АнализНачисленийИУдержанийАвансом.РасчетныйЛистокСРазбивкойПоИсточникамФинансированияПерваяПоловинаМесяца",
		"ОбщийМакет.ПФ_MXL_РасчетныйЛистокСРазбивкойПоИсточникамФинансированияПерваяПоловинаМесяца");

	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		МодульУправленческаяЗарплата = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплата");
		МодульУправленческаяЗарплата.ДополнитьКоллекциюМакетовВариантовОтчетовПечатныхФорм(МакетыВариантовОтчетов);
	КонецЕсли;

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПриказМобилизация",
	"Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПФ_MXL_ПриостановлениеМобилизация");

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПриказКонтракт",
	"Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПФ_MXL_ПриостановлениеКонтракт");

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПриказСодействие",
	"Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПФ_MXL_ПриостановлениеСодействие");

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПриказГражданскиеСлужащиеМобилизация",
	"Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПФ_MXL_ПриостановлениеГражданскиеСлужащиеМобилизация");

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПриказГражданскиеСлужащиеКонтракт",
	"Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПФ_MXL_ПриостановлениеГражданскиеСлужащиеКонтракт");

	МакетыВариантовОтчетов.Вставить("Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПриказГражданскиеСлужащиеСодействие",
	"Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора.ПФ_MXL_ПриостановлениеГражданскиеСлужащиеСодействие");
	
	
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.5] [ASHolyavko@1cbit.ru] [18.02.2026] +        
	
	МакетыВариантовОтчетов.Вставить("Отчет.бит_РасчетныйЛисток.РасчетныйЛисток",
		"Отчет.бит_РасчетныйЛисток.ПФ_MXL_РасчетныйЛистокНастраиваемый"); 
	
	#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.5] [ASHolyavko@1cbit.ru] [18.02.2026] -
	
	
	Возврат МакетыВариантовОтчетов;

КонецФункции
