#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы
	 
Процедура ЗаполнитьВидОперацииПриПереходеНаНовуюВерсию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЗависимыхОборотов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_УстановкаЗависимыхОборотов КАК УстановкаЗависимыхОборотов
	|ГДЕ
	|	УстановкаЗависимыхОборотов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийУстановкиЗависимыхОборотов.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекущийОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ТекущийОбъект.ВидОперации = Перечисления.бит_ВидыОперацийУстановкиЗависимыхОборотов.ЗависимыеОборотыСценария;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекущийОбъект);
		
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти

Процедура ПроверитьтЗацикливаниеТаблицы(Реквизиты, Заголовок, Отказ)  Экспорт
	
	// Проверка на зацикливание.
	Результат = ЗапросЗависисмыеОбороты(Реквизиты.ДатаНачала, Реквизиты.Сценарий, Реквизиты.Ссылка);
	Если НЕ Результат.Пустой() Тогда
		ТекстСообщения = НСтр("ru='Обнаружено зацикливание по статьям:';en='Loop detected under:'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Реквизиты.Ссылка,,, Отказ); 
		Выборка	= Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = НСтр("ru='%1 - %2';en='%1 - %2'"); 
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.СтатьяОборотов, Выборка.СтатьяОборотов_Зависимые);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Реквизиты.Ссылка,,, Отказ); 
			ЗаголовокСообщения = "";
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

Функция ФорматКоэффициентаСуммы(ТочностьКоэффициентаСуммы, УстанавливатьПредставлениеНуля = Ложь) Экспорт

	Если УстанавливатьПредставлениеНуля Тогда
		ПредставлениеНуля = ?(ТочностьКоэффициентаСуммы = 0, "0", Лев("0,000000000", ТочностьКоэффициентаСуммы+2));
		ФорматКоэффициентаСуммы = СтрШаблон("ЧЦ=%1; ЧДЦ=%2; ЧН=%3",
									6 + ТочностьКоэффициентаСуммы, ТочностьКоэффициентаСуммы, ПредставлениеНуля);
	Иначе	
		ФорматКоэффициентаСуммы = СтрШаблон("ЧЦ=%1; ЧДЦ=%2", 
									6 + ТочностьКоэффициентаСуммы, ТочностьКоэффициентаСуммы);
	КонецЕсли;
	
	Возврат ФорматКоэффициентаСуммы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапросЗависисмыеОбороты(ДатаЗаполнения, Сценарий, Ссылка)  
	
	Запрос = Новый Запрос;
	// Установка параметров запроса.			             	
	Запрос.УстановитьПараметр("ДатаЗаполнения",		  ДатаЗаполнения);
	Запрос.УстановитьПараметр("Ссылка",				  Ссылка);
	Запрос.УстановитьПараметр("Сценарий",       	  Сценарий);

	// ++ ЕРП 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ЦФО КАК ЦФО,
	|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
	|	Таблица.Аналитика_1 КАК Аналитика_1,
	|	Таблица.Аналитика_2 КАК Аналитика_2,
	|	Таблица.Аналитика_3 КАК Аналитика_3,
	|	Таблица.Аналитика_4 КАК Аналитика_4,
	|	Таблица.Аналитика_5 КАК Аналитика_5,
	|	Таблица.Аналитика_6 КАК Аналитика_6,
	|	Таблица.Аналитика_7 КАК Аналитика_7,
	|	Таблица.Аналитика_8 КАК Аналитика_8,
	|	Таблица.Аналитика_9 КАК Аналитика_9,
	|	Таблица.Аналитика_10 КАК Аналитика_10,
	|	Таблица.Аналитика_11 КАК Аналитика_11,
	|	Таблица.Аналитика_12 КАК Аналитика_12,
	|	Таблица.ЦФО_Зависимый КАК ЦФО_Зависимый,
	|	Таблица.СтатьяОборотов_Зависимый КАК СтатьяОборотов_Зависимый,
	|	Таблица.Аналитика_1_Зависимый КАК Аналитика_1_Зависимый,
	|	Таблица.Аналитика_2_Зависимый КАК Аналитика_2_Зависимый,
	|	Таблица.Аналитика_3_Зависимый КАК Аналитика_3_Зависимый,
	|	Таблица.Аналитика_4_Зависимый КАК Аналитика_4_Зависимый,
	|	Таблица.Аналитика_5_Зависимый КАК Аналитика_5_Зависимый,
	|	Таблица.Аналитика_6_Зависимый КАК Аналитика_6_Зависимый,
	|	Таблица.Аналитика_7_Зависимый КАК Аналитика_7_Зависимый,
	|	Таблица.Аналитика_8_Зависимый КАК Аналитика_8_Зависимый,
	|	Таблица.Аналитика_9_Зависимый КАК Аналитика_9_Зависимый,
	|	Таблица.Аналитика_10_Зависимый КАК Аналитика_10_Зависимый,
	|	Таблица.Аналитика_11_Зависимый КАК Аналитика_11_Зависимый,
	|	Таблица.Аналитика_12_Зависимый КАК Аналитика_12_Зависимый,
	|	Таблица.ПрофильРаспределения КАК ПрофильРаспределения,
	|	Таблица.КоэффициентКоличество КАК КоэффициентКоличество,
	|	Таблица.КоэффициентСумма КАК КоэффициентСумма,
	|	Таблица.РеквизитКоличество КАК РеквизитКоличество,
	|	Таблица.РеквизитСумма КАК РеквизитСумма,
	|	Таблица.ФункцияКоличество КАК ФункцияКоличество,
	|	Таблица.ФункцияСумма КАК ФункцияСумма,
	|	Таблица.Ссылка.ДатаОкончания КАК ДатаОкончания,
	|	Таблица.Ссылка.Сценарий КАК Сценарий
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	Документ.бит_УстановкаЗависимыхОборотов.ЗависимыеОбороты КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документ.ЦФО КАК ЦФО,
	|	ВТ_Документ.СтатьяОборотов КАК СтатьяОборотов,
	|	ВТ_Документ.Аналитика_1 КАК Аналитика_1,
	|	ВТ_Документ.Аналитика_2 КАК Аналитика_2,
	|	ВТ_Документ.Аналитика_3 КАК Аналитика_3,
	|	ВТ_Документ.Аналитика_4 КАК Аналитика_4,
	|	ВТ_Документ.Аналитика_5 КАК Аналитика_5,
	|	ВТ_Документ.Аналитика_6 КАК Аналитика_6,
	|	ВТ_Документ.Аналитика_7 КАК Аналитика_7,
	|	ВТ_Документ.Аналитика_8 КАК Аналитика_8,
	|	ВТ_Документ.Аналитика_9 КАК Аналитика_9,
	|	ВТ_Документ.Аналитика_10 КАК Аналитика_10,
	|	ВТ_Документ.Аналитика_11 КАК Аналитика_11,
	|	ВТ_Документ.Аналитика_12 КАК Аналитика_12,
	|	ВТ_Документ.Сценарий КАК Сценарий
	|ПОМЕСТИТЬ ВТ_УсловиеОтбора
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Документ.ЦФО_Зависимый,
	|	ВТ_Документ.СтатьяОборотов_Зависимый,
	|	ВТ_Документ.Аналитика_1_Зависимый,
	|	ВТ_Документ.Аналитика_2_Зависимый,
	|	ВТ_Документ.Аналитика_3_Зависимый,
	|	ВТ_Документ.Аналитика_4_Зависимый,
	|	ВТ_Документ.Аналитика_5_Зависимый,
	|	ВТ_Документ.Аналитика_6_Зависимый,
	|	ВТ_Документ.Аналитика_7_Зависимый,
	|	ВТ_Документ.Аналитика_8_Зависимый,
	|	ВТ_Документ.Аналитика_9_Зависимый,
	|	ВТ_Документ.Аналитика_10_Зависимый,
	|	ВТ_Документ.Аналитика_11_Зависимый,
	|	ВТ_Документ.Аналитика_12_Зависимый,
	|	ВТ_Документ.Сценарий
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.бит_СтатьиОборотов.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ВТ_Документ.Сценарий
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таблица.Сценарий КАК Сценарий,
	|	Таблица.ЦФО КАК ЦФО,
	|	Таблица.ЦФО_Зависимый КАК ЦФО_Зависимый,
	|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
	|	Таблица.СтатьяОборотов_Зависимый КАК СтатьяОборотов_Зависимый,
	|	Таблица.Аналитика_1 КАК Аналитика_1,
	|	Таблица.Аналитика_1_Зависимый КАК Аналитика_1_Зависимый,
	|	Таблица.Аналитика_2 КАК Аналитика_2,
	|	Таблица.Аналитика_2_Зависимый КАК Аналитика_2_Зависимый,
	|	Таблица.Аналитика_3 КАК Аналитика_3,
	|	Таблица.Аналитика_3_Зависимый КАК Аналитика_3_Зависимый,
	|	Таблица.Аналитика_4 КАК Аналитика_4,
	|	Таблица.Аналитика_4_Зависимый КАК Аналитика_4_Зависимый,
	|	Таблица.Аналитика_5 КАК Аналитика_5,
	|	Таблица.Аналитика_5_Зависимый КАК Аналитика_5_Зависимый,
	|	Таблица.Аналитика_6 КАК Аналитика_6,
	|	Таблица.Аналитика_6_Зависимый КАК Аналитика_6_Зависимый,
	|	Таблица.Аналитика_7 КАК Аналитика_7,
	|	Таблица.Аналитика_7_Зависимый КАК Аналитика_7_Зависимый,
	|	Таблица.Аналитика_8 КАК Аналитика_8,
	|	Таблица.Аналитика_8_Зависимый КАК Аналитика_8_Зависимый,
	|	Таблица.Аналитика_9 КАК Аналитика_9,
	|	Таблица.Аналитика_9_Зависимый КАК Аналитика_9_Зависимый,
	|	Таблица.Аналитика_10 КАК Аналитика_10,
	|	Таблица.Аналитика_10_Зависимый КАК Аналитика_10_Зависимый,
	|	Таблица.Аналитика_11 КАК Аналитика_11,
	|	Таблица.Аналитика_11_Зависимый КАК Аналитика_11_Зависимый,
	|	Таблица.Аналитика_12 КАК Аналитика_12,
	|	Таблица.Аналитика_12_Зависимый КАК Аналитика_12_Зависимый,
	|	Таблица.ПрофильРаспределения КАК ПрофильРаспределения,
	|	Таблица.КоэффициентКоличество КАК КоэффициентКоличество,
	|	Таблица.КоэффициентСумма КАК КоэффициентСумма,
	|	Таблица.РеквизитКоличество КАК РеквизитКоличество,
	|	Таблица.РеквизитСумма КАК РеквизитСумма,
	|	Таблица.ФункцияКоличество КАК ФункцияКоличество,
	|	Таблица.ФункцияСумма КАК ФункцияСумма,
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_Таблица
	|ИЗ
	|	РегистрСведений.бит_ЗависимыеОбороты.СрезПоследних(
	|			&ДатаЗаполнения,
	|			(ЦФО, СтатьяОборотов, Аналитика_1, Аналитика_2, Аналитика_3, Аналитика_4, Аналитика_5, Аналитика_6, Аналитика_7, Аналитика_8, Аналитика_9, Аналитика_10, Аналитика_11, Аналитика_12) В
	|					(ВЫБРАТЬ
	|						УсловиеОтбора.ЦФО,
	|						УсловиеОтбора.СтатьяОборотов,
	|						УсловиеОтбора.Аналитика_1,
	|						УсловиеОтбора.Аналитика_2,
	|						УсловиеОтбора.Аналитика_3,
	|						УсловиеОтбора.Аналитика_4,
	|						УсловиеОтбора.Аналитика_5,
	|						УсловиеОтбора.Аналитика_6,
	|						УсловиеОтбора.Аналитика_7,
	|						УсловиеОтбора.Аналитика_8,
	|						УсловиеОтбора.Аналитика_9,
	|						УсловиеОтбора.Аналитика_10,
	|						УсловиеОтбора.Аналитика_11,
	|						УсловиеОтбора.Аналитика_12
	|					ИЗ
	|						ВТ_УсловиеОтбора КАК УсловиеОтбора)
	|				И ВЫБОР
	|					КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Сценарий В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								УсловиеОтбора.Сценарий
	|							ИЗ
	|								ВТ_УсловиеОтбора КАК УсловиеОтбора
	|			
	|							ОБЪЕДИНИТЬ ВСЕ
	|			
	|							ВЫБРАТЬ
	|								ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка))
	|				КОНЕЦ
	|				И СценарийЗависимый = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)) КАК Таблица
	|ГДЕ
	|	(Таблица.КоэффициентКоличество <> 0
	|			ИЛИ Таблица.ФункцияКоличество <> ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеФункции.ПустаяСсылка)
	|			ИЛИ Таблица.КоэффициентСумма <> 0
	|			ИЛИ Таблица.ФункцияСумма <> ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеФункции.ПустаяСсылка))
	|	И (Таблица.РеквизитКоличество <> ЗНАЧЕНИЕ(Перечисление.бит_РеквизитыДляРасчетаЗависимостей.ПустаяСсылка)
	|			ИЛИ Таблица.РеквизитСумма <> ЗНАЧЕНИЕ(Перечисление.бит_РеквизитыДляРасчетаЗависимостей.ПустаяСсылка))
	|	И (КОНЕЦПЕРИОДА(Таблица.ДатаОкончания, ДЕНЬ) >= &ДатаЗаполнения
	|			ИЛИ Таблица.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Таблица.Сценарий КАК Сценарий,
	|	ВТ_Таблица.ЦФО КАК ЦФО,
	|	ВТ_Таблица.ЦФО_Зависимый КАК ЦФО_Зависимый,
	|	ВТ_Таблица.СтатьяОборотов КАК СтатьяОборотов,
	|	ВТ_Таблица.СтатьяОборотов_Зависимый КАК СтатьяОборотов_Зависимый,
	|	ВТ_Таблица.Аналитика_1 КАК Аналитика_1,
	|	ВТ_Таблица.Аналитика_1_Зависимый КАК Аналитика_1_Зависимый,
	|	ВТ_Таблица.Аналитика_2 КАК Аналитика_2,
	|	ВТ_Таблица.Аналитика_2_Зависимый КАК Аналитика_2_Зависимый,
	|	ВТ_Таблица.Аналитика_3 КАК Аналитика_3,
	|	ВТ_Таблица.Аналитика_3_Зависимый КАК Аналитика_3_Зависимый,
	|	ВТ_Таблица.Аналитика_4 КАК Аналитика_4,
	|	ВТ_Таблица.Аналитика_4_Зависимый КАК Аналитика_4_Зависимый,
	|	ВТ_Таблица.Аналитика_5 КАК Аналитика_5,
	|	ВТ_Таблица.Аналитика_5_Зависимый КАК Аналитика_5_Зависимый,
	|	ВТ_Таблица.Аналитика_6 КАК Аналитика_6,
	|	ВТ_Таблица.Аналитика_6_Зависимый КАК Аналитика_6_Зависимый,
	|	ВТ_Таблица.Аналитика_7 КАК Аналитика_7,
	|	ВТ_Таблица.Аналитика_7_Зависимый КАК Аналитика_7_Зависимый,
	|	ВТ_Таблица.Аналитика_8 КАК Аналитика_8,
	|	ВТ_Таблица.Аналитика_8_Зависимый КАК Аналитика_8_Зависимый,
	|	ВТ_Таблица.Аналитика_9 КАК Аналитика_9,
	|	ВТ_Таблица.Аналитика_9_Зависимый КАК Аналитика_9_Зависимый,
	|	ВТ_Таблица.Аналитика_10 КАК Аналитика_10,
	|	ВТ_Таблица.Аналитика_10_Зависимый КАК Аналитика_10_Зависимый,
	|	ВТ_Таблица.Аналитика_11 КАК Аналитика_11,
	|	ВТ_Таблица.Аналитика_11_Зависимый КАК Аналитика_11_Зависимый,
	|	ВТ_Таблица.Аналитика_12 КАК Аналитика_12,
	|	ВТ_Таблица.Аналитика_12_Зависимый КАК Аналитика_12_Зависимый,
	|	ВТ_Таблица.ПрофильРаспределения КАК ПрофильРаспределения,
	|	ВТ_Таблица.КоэффициентКоличество КАК КоэффициентКоличество,
	|	ВТ_Таблица.КоэффициентСумма КАК КоэффициентСумма,
	|	ВТ_Таблица.РеквизитКоличество КАК РеквизитКоличество,
	|	ВТ_Таблица.РеквизитСумма КАК РеквизитСумма,
	|	ВТ_Таблица.ФункцияКоличество КАК ФункцияКоличество,
	|	ВТ_Таблица.ФункцияСумма КАК ФункцияСумма,
	|	ВТ_Таблица.Регистратор КАК Регистратор,
	|	ВТ_Таблица.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_Объединение
	|ИЗ
	|	ВТ_Таблица КАК ВТ_Таблица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Документ.Сценарий,
	|	ВТ_Документ.ЦФО,
	|	ВТ_Документ.ЦФО_Зависимый,
	|	ВТ_Документ.СтатьяОборотов,
	|	ВТ_Документ.СтатьяОборотов_Зависимый,
	|	ВТ_Документ.Аналитика_1,
	|	ВТ_Документ.Аналитика_1_Зависимый,
	|	ВТ_Документ.Аналитика_2,
	|	ВТ_Документ.Аналитика_2_Зависимый,
	|	ВТ_Документ.Аналитика_3,
	|	ВТ_Документ.Аналитика_3_Зависимый,
	|	ВТ_Документ.Аналитика_4,
	|	ВТ_Документ.Аналитика_4_Зависимый,
	|	ВТ_Документ.Аналитика_5,
	|	ВТ_Документ.Аналитика_5_Зависимый,
	|	ВТ_Документ.Аналитика_6,
	|	ВТ_Документ.Аналитика_6_Зависимый,
	|	ВТ_Документ.Аналитика_7,
	|	ВТ_Документ.Аналитика_7_Зависимый,
	|	ВТ_Документ.Аналитика_8,
	|	ВТ_Документ.Аналитика_8_Зависимый,
	|	ВТ_Документ.Аналитика_9,
	|	ВТ_Документ.Аналитика_9_Зависимый,
	|	ВТ_Документ.Аналитика_10,
	|	ВТ_Документ.Аналитика_10_Зависимый,
	|	ВТ_Документ.Аналитика_11,
	|	ВТ_Документ.Аналитика_11_Зависимый,
	|	ВТ_Документ.Аналитика_12,
	|	ВТ_Документ.Аналитика_12_Зависимый,
	|	ВТ_Документ.ПрофильРаспределения,
	|	ВТ_Документ.КоэффициентКоличество,
	|	ВТ_Документ.КоэффициентСумма,
	|	ВТ_Документ.РеквизитКоличество,
	|	ВТ_Документ.РеквизитСумма,
	|	ВТ_Документ.ФункцияКоличество,
	|	ВТ_Документ.ФункцияСумма,
	|	ВТ_Документ.Ссылка,
	|	ВТ_Документ.ДатаОкончания
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Основные.СтатьяОборотов КАК СтатьяОборотов,
	|	Зависимые.СтатьяОборотов КАК СтатьяОборотов_Зависимые
	|ИЗ
	|	ВТ_Объединение КАК Основные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Объединение КАК Зависимые
	|		ПО (Основные.Сценарий = Зависимые.Сценарий
	|				ИЛИ Основные.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
	|				ИЛИ Зависимые.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка))
	|			И Основные.ЦФО = Зависимые.ЦФО_Зависимый
	|			И Основные.СтатьяОборотов = Зависимые.СтатьяОборотов_Зависимый
	|			И Основные.СтатьяОборотов = Зависимые.СтатьяОборотов_Зависимый
	|			И Основные.СтатьяОборотов_Зависимый = Зависимые.СтатьяОборотов
	|			И Основные.Аналитика_1 = Зависимые.Аналитика_1_Зависимый
	|			И Основные.Аналитика_2 = Зависимые.Аналитика_2_Зависимый
	|			И Основные.Аналитика_3 = Зависимые.Аналитика_3_Зависимый
	|			И Основные.Аналитика_4 = Зависимые.Аналитика_4_Зависимый
	|			И Основные.Аналитика_5 = Зависимые.Аналитика_5_Зависимый
	|			И Основные.Аналитика_6 = Зависимые.Аналитика_6_Зависимый
	|			И Основные.Аналитика_7 = Зависимые.Аналитика_7_Зависимый
	|			И Основные.Аналитика_8 = Зависимые.Аналитика_8_Зависимый
	|			И Основные.Аналитика_9 = Зависимые.Аналитика_9_Зависимый
	|			И Основные.Аналитика_10 = Зависимые.Аналитика_10_Зависимый
	|			И Основные.Аналитика_11 = Зависимые.Аналитика_11_Зависимый
	|			И Основные.Аналитика_12 = Зависимые.Аналитика_12_Зависимый";
	// -- ЕРП
	Результат = Запрос.Выполнить();

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
