
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Периодичность = Перечисления.бит_ПериодичностьПланирования.Месяц;
	Период.Вариант = ВариантСтандартногоПериода.ЭтотГод;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНастроитьПериод(Команда)
	
	Оповещение = Новый ОписаниеОповещения("РедактированиеПериодаЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

// Процедура обработчик оповещения "РедактированиеПериодаЗавершение".
//
// Параметры:
// ВыбПериод - КодВозвратаДиалога.
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура РедактированиеПериодаЗавершение(ВыбПериод, ДополнительныеДанные) Экспорт

	Период.Вариант = ВыбПериод.Вариант;
	Период.ДатаНачала = ВыбПериод.ДатаНачала;
	Период.ДатаОкончания = ВыбПериод.ДатаОкончания;
		
КонецПроцедуры	// РедактированиеПериодаЗавершение

&НаКлиенте
Процедура КомандаОК(Команда)
	
	РезДанные = Новый Структура;
	РезДанные.Вставить("ДатаНачала", Период.ДатаНачала);
	РезДанные.Вставить("ДатаОкончания", Период.ДатаОкончания);
	РезДанные.Вставить("Периодичность", Периодичность);
	
	Закрыть(РезДанные);
	
КонецПроцедуры

#КонецОбласти
