#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
&После("ДобавитьКомандыПечати")
Процедура бит_ДобавитьКомандыПечати(КомандыПечати)
	
// ПервыйБИТ ЛистТребований ЛТ 7  KAKravchenko@1cbit.ru 12.12.2024 +  
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_СчетДоговор";
	КомандаПечати.Представление = НСтр("ru = '(бит) Счет-договор'"); 
// ПервыйБИТ ЛистТребований ЛТ 7  KAKravchenko@1cbit.ru 12.12.2024 -
	
КонецПроцедуры

&После("Печать")
Процедура бит_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
// ПервыйБИТ ЛистТребований ЛТ 7  KAKravchenko@1cbit.ru 12.12.2024 +
 	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "бит_СчетДоговор");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Счет-договор'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"бит_СчетДоговор", 
				Заголовок,
				бит_ПечатнаяФормаСчетДоговор(МассивОбъектов),
				,
				"Документ.ЗаказКлиента.бит_ПФ_MXL_СчетДоговор");
	КонецЕсли; 
// ПервыйБИТ ЛистТребований ЛТ 7  KAKravchenko@1cbit.ru 12.12.2024 -

КонецПроцедуры   

Функция бит_ПечатнаяФормаСчетДоговор(МассивОбъектов)
	
// ПервыйБИТ ЛистТребований ЛТ 7  KAKravchenko@1cbit.ru 12.12.2024 +
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = ИСТИНА;
	
	Макет = ПолучитьМакет("бит_ПФ_MXL_СчетДоговор"); 
	
	ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьОбласть1 	= Макет.ПолучитьОбласть("Область1");
	ОбластьТовары 		= Макет.ПолучитьОбласть("Товары");
	ОбластьТоварыИтого 	= Макет.ПолучитьОбласть("ТоварыИтого");
	ОбластьОбласть2 	= Макет.ПолучитьОбласть("Область2");
	ОбластьОбласть3 	= Макет.ПолучитьОбласть("Область3");
	ОбластьОбласть4 	= Макет.ПолучитьОбласть("Область4");
	ОбластьОбласть5 	= Макет.ПолучитьОбласть("Область5");
	ОбластьОбласть6 	= Макет.ПолучитьОбласть("Область6");
	ОбластьОбласть7 	= Макет.ПолучитьОбласть("Область7");
	ОбластьОбласть8 	= Макет.ПолучитьОбласть("Область8");
	ОбластьОбласть9 	= Макет.ПолучитьОбласть("Область9");
	ОбластьОбласть10 	= Макет.ПолучитьОбласть("Область10");
	ОбластьПодвал 		= Макет.ПолучитьОбласть("Подвал");
	
	ДокументЗаказКлиента = МассивОбъектов[0]; 
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Наименование КАК КонтрагентНаименование,
		|	Контрагенты.ИНН КАК КонтрагентИНН,
		|	Контрагенты.КПП КАК КонтрагентКПП,
		|	КонтрагентыКонтактнаяИнформация.Представление КАК КонтрагентЮрАдрес,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК КонтрагентЭлПочта
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|			ПО (Контрагенты.Ссылка = КонтрагентыКонтактнаяИнформация.Ссылка)
		|				И (КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
		|		ПО (ЗаказКлиента.Контрагент = Контрагенты.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|		ПО (ЗаказКлиента.КонтактноеЛицо = КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка)
		|			И (КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка");

	Запрос.УстановитьПараметр("Ссылка", ДокументЗаказКлиента); 
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать();
	ВыборкаКонтрагент.Следующий(); 
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	Товары.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА Товары.ЕдиницаИзмерения
		|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка
		|	КОНЕЦ КАК Упаковка,
		|	ЗаказКлиентаТовары.Количество КАК Количество,
		|	ЗаказКлиентаТовары.Цена КАК Цена,
		|	ЗаказКлиентаТовары.Сумма КАК Сумма,
		|	ЗаказКлиентаТовары.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
		|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
		|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
		|		ПО (ЗаказКлиентаТовары.Номенклатура = Товары.Ссылка)
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка");

	Запрос.УстановитьПараметр("Ссылка", ДокументЗаказКлиента);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаТовары = РезультатЗапроса.Выбрать();
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	ЗаказКлиента.Номер КАК Номер,
		|	ЗаказКлиента.Дата КАК Дата,
		|	ЗаказКлиента.Организация КАК Организация,
		|	ЗаказКлиента.ГрафикОплаты КАК ГрафикОплаты,
		|	ЗаказКлиента.БанковскийСчет КАК БанковскийСчет, 
		|	ЗаказКлиента.АдресДоставки КАК АдресДоставки,
		|	ЗаказКлиента.бит_Толеранс КАК бит_Толеранс,
		|	ЗаказКлиента.бит_СрокИзготовления КАК бит_СрокИзготовления,
		|	ЗаказКлиента.Менеджер КАК Менеджер,
		|	ЗаказКлиента.ЭтапыГрафикаОплаты.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ВариантОплаты КАК ВариантОплаты,
		|		ДатаПлатежа КАК ДатаПлатежа,
		|		ПроцентПлатежа КАК ПроцентПлатежа,
		|		СуммаПлатежа КАК СуммаПлатежа,
		|		ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару,
		|		СуммаЗалогаЗаТару КАК СуммаЗалогаЗаТару,
		|		СуммаОтклоненияМерныхТоваров КАК СуммаОтклоненияМерныхТоваров,
		|		Сдвиг КАК Сдвиг,
		|		ВариантОтсчета КАК ВариантОтсчета
		|	) КАК ЭтапыГрафикаОплаты,
		|	Организации.Наименование КАК ОрганизацияНаименование,
		|	Организации.ИНН КАК ОрганизацияИНН,
		|	Организации.КПП КАК ОрганизацияКПП,
		|	БанковскиеСчетаОрганизаций.НомерСчета КАК ОрганизацияРасчСчет,
		|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК ОрганизацияКоррСчет,
		|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
		|	Пользователи.Наименование КАК МенеджерНаименование,
		|	ОрганизацииТелефон.Представление КАК ОрганизацияТелефон,
		|	ОрганизацииЮрАдрес.Представление КАК ОрганизацияЮрАдрес,
		|	ПользователиТелефон.Представление КАК МенеджерТелефон,
		|	ПользователиЭлПочта.Представление КАК МенеджерЭлПочта
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииЮрАдрес
		|			ПО (ОрганизацииЮрАдрес.Ссылка = Организации.Ссылка)
		|				И (ОрганизацииЮрАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииТелефон
		|			ПО (ОрганизацииТелефон.Ссылка = Организации.Ссылка)
		|				И (ОрганизацииТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации))
		|		ПО (ЗаказКлиента.Организация = Организации.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиТелефон
		|			ПО (Пользователи.Ссылка = ПользователиТелефон.Ссылка)
		|				И (ПользователиТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиЭлПочта
		|			ПО (Пользователи.Ссылка = ПользователиЭлПочта.Ссылка)
		|				И (ПользователиЭлПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|		ПО (ЗаказКлиента.Менеджер = Пользователи.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		|		ПО (ЗаказКлиента.БанковскийСчет = БанковскиеСчетаОрганизаций.Ссылка)
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументЗаказКлиента);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗаказ = РезультатЗапроса.Выбрать();
	ВыборкаЗаказ.Следующий();      
	
	ВыборкаОплата = ВыборкаЗаказ.ЭтапыГрафикаОплаты.Выбрать(); 
	
	//ШАПКА
	ОбластьШапка.Параметры.ОрганизацияНаименование 	= ВыборкаЗаказ.ОрганизацияНаименование; 
	ОбластьШапка.Параметры.ОрганизацияИНН 			= ВыборкаЗаказ.ОрганизацияИНН;
	ОбластьШапка.Параметры.ОрганизацияКПП 			= ВыборкаЗаказ.ОрганизацияКПП;
	ОбластьШапка.Параметры.ОрганизацияЮрАдрес		= ВыборкаЗаказ.ОрганизацияЮрАдрес;
	ОбластьШапка.Параметры.ОрганизацияРасчСчет 		= ВыборкаЗаказ.ОрганизацияРасчСчет;
	ОбластьШапка.Параметры.ОрганизацияКоррСчет 		= ВыборкаЗаказ.ОрганизацияКоррСчет;
	
	ОбластьШапка.Параметры.КонтрагентНаименование 	= ВыборкаКонтрагент.КонтрагентНаименование;
	ОбластьШапка.Параметры.КонтрагентИНН 			= ВыборкаКонтрагент.КонтрагентИНН;
	ОбластьШапка.Параметры.КонтрагентКПП	 		= ВыборкаКонтрагент.КонтрагентКПП;
	ОбластьШапка.Параметры.КонтрагентЮрАдрес 		= ВыборкаКонтрагент.КонтрагентЮрАдрес;
  
	ТабличныйДокумент.Вывести(ОбластьШапка);  	
	ТабличныйДокумент.Вывести(ОбластьОбласть1);
	
	//ТОВАРЫ    
	НомерСтроки		= 1;
	ИтогоСумма 		= 0;
	ИтогоСуммаНДС 	= 0;
	ИтогоСуммаСНДС 	= 0;
	
	Пока ВыборкаТовары.Следующий() Цикл 
		ОбластьТовары.Параметры.НомерСтроки				 	= НомерСтроки;
		ОбластьТовары.Параметры.НоменклатураНаименование 	= ВыборкаТовары.Наименование; 
		ОбластьТовары.Параметры.НоменклатураЕдИзм 			= ВыборкаТовары.Упаковка;
		ОбластьТовары.Параметры.НоменклатураКолво 			= ВыборкаТовары.Количество;
		ОбластьТовары.Параметры.НоменклатураЦена 			= ВыборкаТовары.Цена;
		ОбластьТовары.Параметры.НоменклатураСумма	 		= ВыборкаТовары.Сумма;
		ОбластьТовары.Параметры.НоменклатураНДС 			= ВыборкаТовары.СтавкаНДССтавка;
		ОбластьТовары.Параметры.НоменклатураСуммаНДС 		= ВыборкаТовары.СуммаНДС;
		ОбластьТовары.Параметры.НоменклатураВсегоСНДС 		= ВыборкаТовары.СуммаСНДС;
		
		НомерСтроки		= НомерСтроки		+ 1;
		ИтогоСумма 		= ИтогоСумма 		+ ВыборкаТовары.Сумма;
		ИтогоСуммаНДС 	= ИтогоСуммаНДС 	+ ВыборкаТовары.СуммаНДС;
		ИтогоСуммаСНДС 	= ИтогоСуммаСНДС 	+ ВыборкаТовары.СуммаСНДС;
		
		ТабличныйДокумент.Вывести(ОбластьТовары);
	КонецЦикла;
	
	ОбластьТоварыИтого.Параметры.ИтогоСумма 	= ИтогоСумма;
	ОбластьТоварыИтого.Параметры.ИтогоСуммаНДС 	= ИтогоСуммаНДС;
	ОбластьТоварыИтого.Параметры.ИтогоВсегоСНДС = ИтогоСуммаСНДС;
	
	ТабличныйДокумент.Вывести(ОбластьТоварыИтого);
	
	//ЭТАПЫ ОПЛАТЫ 
	ЭтапыГрафикаОплаты = "";	
	Пока ВыборкаОплата.Следующий() Цикл
		
		Если ВыборкаОплата.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения Тогда //Оплата до обеспечения
			
			ЭтапыГрафикаОплаты = ЭтапыГрафикаОплаты + Символы.ПС + " " 
								+ ВыборкаОплата.ПроцентПлатежа + "% в течение " + ВыборкаОплата.Сдвиг
								+ " банковских дней с момента выставления настоящего счета-договора;"  
								
		ИначеЕсли ВыборкаОплата.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки Тогда //Оплата до отгрузки
								
			ЭтапыГрафикаОплаты = ЭтапыГрафикаОплаты + Символы.ПС + " " 
								+ ВыборкаОплата.ПроцентПлатежа + "% в течение " + ВыборкаОплата.Сдвиг
								+ " календарных дней с момента получения Покупателем уведомления о готовности продукции к отгрузке;" 
								
		ИначеЕсли ВыборкаОплата.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитСдвиг Тогда //Оплата после отгрузки 
			
			ЭтапыГрафикаОплаты = ЭтапыГрафикаОплаты + Символы.ПС + " " 
								+ ВыборкаОплата.ПроцентПлатежа + "% в течение " + ВыборкаОплата.Сдвиг 
								+ " банковских дней с момента поставки продукции;" 

		ИначеЕсли ВыборкаОплата.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки Тогда //Оплата независимо от отгрузки 
			
			ЭтапыГрафикаОплаты = ЭтапыГрафикаОплаты + Символы.ПС + " " 
								+ ВыборкаОплата.ПроцентПлатежа + "% в течение " + ВыборкаОплата.Сдвиг
								+ " календарных дней с момента выставления настоящего счета-договора;" 	
		КонецЕсли;			
	КонецЦикла;

	Если НЕ ЭтапыГрафикаОплаты = "" Тогда
		ЭтапыГрафикаОплаты = Лев(ЭтапыГрафикаОплаты, СтрДлина(ЭтапыГрафикаОплаты) - 1) + "."; 
	Иначе
		ЭтапыГрафикаОплаты = Символы.ПС;
	КонецЕсли;
	
	ОбластьОбласть2.Параметры.ЭтапыГрафикаОплаты = ЭтапыГрафикаОплаты;

	ТабличныйДокумент.Вывести(ОбластьОбласть2);
	
	//ДОГОВОР 
	ОбластьОбласть3.Параметры.СрокИзготовления 	= ВыборкаЗаказ.бит_СрокИзготовления;
	
	ОбластьОбласть4.Параметры.СпособДоставки 	= ВыборкаЗаказ.СпособДоставки; 
	ОбластьОбласть4.Параметры.АдресДоставки 	= ВыборкаЗаказ.АдресДоставки;
	ОбластьОбласть4.Параметры.Отклонения 		= ВыборкаЗаказ.бит_Толеранс;   
	ОбластьОбласть4.Параметры.МенеджерЭлПочта 	= ВыборкаЗаказ.МенеджерЭлПочта;
	ОбластьОбласть4.Параметры.КонтрагентЭлПочта = ВыборкаКонтрагент.КонтрагентЭлПочта;
	                                                                           
	ТабличныйДокумент.Вывести(ОбластьОбласть3);
	ТабличныйДокумент.Вывести(ОбластьОбласть4);
	ТабличныйДокумент.Вывести(ОбластьОбласть5);
	ТабличныйДокумент.Вывести(ОбластьОбласть6);
	ТабличныйДокумент.Вывести(ОбластьОбласть7);
	ТабличныйДокумент.Вывести(ОбластьОбласть8);
	ТабличныйДокумент.Вывести(ОбластьОбласть9);  
	ТабличныйДокумент.Вывести(ОбластьОбласть10); 
	ТабличныйДокумент.Вывести(ОбластьПодвал); 
	
	//КОЛОНТИТУЛЫ
	ТабличныйДокумент.ВерхнийКолонтитул.НачальнаяСтраница 		= 1; 
	ТабличныйДокумент.ВерхнийКолонтитул.ВертикальноеПоложение 	= ВертикальноеПоложение.Центр;
	ТабличныйДокумент.ВерхнийКолонтитул.ТекстСлева				= "телефон/факс: " 		+ ВыборкаЗаказ.ОрганизацияТелефон;
	ТабличныйДокумент.ВерхнийКолонтитул.ТекстСправа				= "Счет-договор №   " 	+ ВыборкаЗаказ.Номер + "   от " + Формат(ВыборкаЗаказ.Дата, "ДФ=dd.MM.yyyy")+ "   Стр. [&НомерСтраницы] из [&СтраницВсего]";
	ТабличныйДокумент.ВерхнийКолонтитул.Выводить				= Истина;   
			
	ТабличныйДокумент.НижнийКолонтитул.НачальнаяСтраница 		= 1; 
	ТабличныйДокумент.НижнийКолонтитул.ВертикальноеПоложение 	= ВертикальноеПоложение.Центр; 
	ТабличныйДокумент.НижнийКолонтитул.ТекстСлева 				= "Исполнитель: " 	+ ВыборкаЗаказ.МенеджерНаименование;
	ТабличныйДокумент.НижнийКолонтитул.ТекстВЦентре				= "Тел./Факс: " 	+ ВыборкаЗаказ.МенеджерТелефон;
    ТабличныйДокумент.НижнийКолонтитул.ТекстСправа 				= "e-mail: " 		+ ВыборкаЗаказ.МенеджерЭлПочта; 
    ТабличныйДокумент.НижнийКолонтитул.Выводить 				= Истина; 
		
	Возврат ТабличныйДокумент;

// ПервыйБИТ ЛистТребований ЛТ 7  KAKravchenko@1cbit.ru 12.12.2024 –

КонецФункции

&ИзменениеИКонтроль("ТоварыДокументаДляСозданияОбеспечивающегоЗаказа")
Процедура бит_ТоварыДокументаДляСозданияОбеспечивающегоЗаказа(Ссылка, ПараметрыСоздания, МенеджерВременныхТаблиц)

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Статус,Проведен");
	ПроверитьВозможностьВводаНаОсновании(Ссылка, Реквизиты.Статус, Не Реквизиты.Проведен, Истина);

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТипыНоменклатуры", ПараметрыСоздания.ТипыНоменклатуры);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	
	#Вставка // {{ПервыйБИТ ЛистТребований [лт5.30] [ASHolyavko@1cbit.ru] [22.10.2025] +        
		
	|	Товары.бит_ТипТары КАК бит_ТипТары,
	|	Товары.бит_КоличествоТары КАК бит_КоличествоТары, 	
	|	Товары.бит_Толеранс КАК бит_Толеранс,
	
	#КонецВставки // }}ПервыйБИТ ЛистТребований [лт5.30] [ASHolyavko@1cbit.ru] [22.10.2025] -
	
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.Склад КАК Склад,
	|	Товары.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Товары.Обособленно
	|			ТОГДА Товары.Ссылка.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	Товары.ВариантОбеспечения КАК ВариантОбеспечения,
	|	Товары.Обособленно КАК Обособленно,
	|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	Товары.Количество КАК КоличествоЕдиницПоДокументу,
	|	Товары.КоличествоУпаковок КАК КоличествоПоДокументу
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|		И НЕ Товары.Отменено
	|		И Товары.Номенклатура.ТипНоменклатуры В(&ТипыНоменклатуры)";

	Запрос.Выполнить();

КонецПроцедуры

#КонецЕсли
