
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РежимВыбора = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "РежимВыбора", Ложь);
	Элементы.ДинамическийСписок.РежимВыбора = РежимВыбора;
	
	Если ЗначениеЗаполнено(Параметры.ЗакрыватьПриВыборе) Тогда
		ЗакрыватьПриВыборе = Параметры.ЗакрыватьПриВыборе;
	КонецЕсли;
	
	ПараметрТаблица = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "Таблица", "");
	Если ТипЗнч(ПараметрТаблица) = Тип("Строка") Тогда
		Таблица = ПараметрТаблица;
	Иначе
		
		ОбъектМетаданных = ПараметрТаблица.Метаданные();
		Таблица = ИТК_Метаданные.ПолноеИмя(ОбъектМетаданных);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Таблица) Тогда
		ТаблицаПредставление = Таблица;
	Иначе
		ТаблицаПредставление = НСтр("ru = 'Выбрать';
									|en = 'Select'"); 		 
	КонецЕсли;
	
	ОбновитьРеквизитыЭлементыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ИТК_ОбщийКлиент.ОбработчикПриОткрытии(Отказ);
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	ДополнительныеПараметрыОповещения = Новый Структура;
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВыборТаблицыМетаданныхЗавершен", ЭтотОбъект, ДополнительныеПараметрыОповещения);
	
	ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(ЭтотОбъект, Неопределено, ИТК_Перечисления.РежимРедактированияТипаЗначенияВыборОбъектаМетаданных(),
														Таблица, ОписаниеОповещенияЗавершение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Инструменты(Команда)
	
	ИТК_ГлобальноеМенюКлиент.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()

	Элементы.НеобходимоВыбратьТип.Видимость = Не ЗначениеЗаполнено(Таблица);
	Элементы.ОтсутствуютДанныеДляОтображения.Видимость = ОтсутствуютДанныеДляОтображения;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыЭлементыДинамическогоСписка()
	
	Если Не ЗначениеЗаполнено(Таблица) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаДинамическогоСписка = "ДинамическийСписок";
	
	// Устанавливаем параметры
	ДинамическийСписок.ОсновнаяТаблица = Таблица;
	ДинамическийСписок.ПроизвольныйЗапрос = Ложь;
	
	// Добавляем колонки реквизиты и элементы
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Таблица);
	
	ПоляОбъектаМетаданных = ИТК_ДинамическийСписок.ПоляОбъектаМетаданных(ОбъектМетаданных);
	ОтсутствуютДанныеДляОтображения = Не ЗначениеЗаполнено(ПоляОбъектаМетаданных);
	
	Для Каждого Поле Из ПоляОбъектаМетаданных Цикл 
		
		ИмяПоля = Поле.Имя;
		ТипЗначенияПоля = Поле.ТипЗначения;
		
		Попытка
		
			НоваяКолонка = Элементы.Добавить("ДинамическийСписок" + ИмяПоля, Тип("ПолеФормы"), Элементы.ДинамическийСписок);
			
			Если ИТК_ТипыКлиентСервер.Количество(ТипЗначенияПоля) = 1
				И ТипЗначенияПоля.СодержитТип(Тип("Булево")) Тогда
				
				ВидПоля = ВидПоляФормы.ПолеФлажка;
				
			Иначе
				
				ВидПоля = ВидПоляФормы.ПолеВвода;
				
			КонецЕсли;
			НоваяКолонка.Вид = ВидПоля;
			
			НоваяКолонка.ПутьКДанным = "ДинамическийСписок." + ИмяПоля;
			НоваяКолонка.КартинкаШапки = ИТК_Типы.КартинкаОписания(ТипЗначенияПоля);
			НоваяКолонка.Подсказка = ИТК_Типы.ПодсказкаОписания(ИмяПоля, ТипЗначенияПоля)
		
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТаблицыМетаданныхЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Таблица = Результат;
	ТаблицаПредставление = Результат;
	
	ОбновитьРеквизитыЭлементыДинамическогоСписка();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти
