
#Область СлужебныйПрограммныйИнтерфейс

Функция ЕстьНастройкаОповещения(ОбъектСистемы) Экспорт
	
	ВидСобытия = Новый Массив;
	ВидСобытия.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ЗаписанДокумент);
	ВидСобытия.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ПроведенДокумент);
	ВидСобытия.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ОтмененоПроведениеДокумента);
	ВидСобытия.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ЗаписанСправочник);
	ВидСобытия.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ИзмененаДатаПлатежа);
	
	ТаблицаОповещений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_фн_АктивныеОповещения");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектСистемы",		ОбъектСистемы);
	Запрос.УстановитьПараметр("ВидСобытия",			ВидСобытия);
	Запрос.УстановитьПараметр("ТаблицаОповещений",	ТаблицаОповещений);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаОповещений.Оповещение КАК Оповещение,
	|	ТаблицаОповещений.ВидСобытия КАК ВидСобытия,
	|	ТаблицаОповещений.ОбъектСистемы КАК ОбъектСистемы
	|ПОМЕСТИТЬ ТаблицаОповещений
	|ИЗ
	|	&ТаблицаОповещений КАК ТаблицаОповещений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаОповещений.Оповещение КАК Оповещение
	|ИЗ
	|	ТаблицаОповещений КАК ТаблицаОповещений
	|ГДЕ
	|	ТаблицаОповещений.ВидСобытия В(&ВидСобытия)
	|	И ТаблицаОповещений.ОбъектСистемы = &ОбъектСистемы";
	
	Результат = Запрос.Выполнить();

	Возврат НЕ Результат.Пустой();
	
КонецФункции

// Функция возвращает коллекцию параметров печатных форм,
//	которые необходимо вложить к объекту при отправке по почте.
// 
// Параметры:
// 	ПолноеИмяМетаданных - Строка.
// 
// Возвращаемое значение:
// 	Массив. Элемент массива - Стурктура:
//		ИмяОбъекта    - Строка - Полное имя объекта метаданных
//		Идентификатор - Строка - Идентификатор печатной формы
//		Представление - Строка - Представление печатной формы
//		ВнешняяОбработка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Ссылка на обработку печатной формы (если используется внешняя).
//		МенеджерПечати   - Строка - Имя менеджера печати. Если пустая, то менеджером выступает сам объект.
//		ЕстьУсловияВидимости - Булево - Признак наличия условий видимости печатной формы для каждого объекта.
//
Функция ПараметрыВложенийЭлектроннойПочты(ПолноеИмяМетаданных) Экспорт
	
	ПараметрыВложений = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Вложения.Идентификатор КАК Идентификатор,
	|	Вложения.Представление КАК Представление,
	|	Вложения.ВнешняяОбработка КАК ВнешняяОбработка,
	|	Вложения.МенеджерПечати КАК МенеджерПечати,
	|	Вложения.ЕстьУсловияВидимости КАК ЕстьУсловияВидимости
	|ИЗ
	|	РегистрСведений.бит_ВложенияВизЭлектроннойПочты КАК Вложения
	|ГДЕ
	|	Вложения.ОбъектВизирования = &ОбъектВизирования";
	Запрос.УстановитьПараметр("ОбъектВизирования", ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяМетаданных));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Вложение = НовыеПараметрыВложенияЭлектроннойПочты();
		ЗаполнитьЗначенияСвойств(Вложение, Выборка);
		Вложение.ИмяОбъекта = ПолноеИмяМетаданных;
		ДобавитьУсловияВидимостиВложения(Вложение);
		ПараметрыВложений.Добавить(Вложение);
	КонецЦикла;
	
	Возврат ПараметрыВложений;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеПараметрыВложенияЭлектроннойПочты()
	
	ПараметрыВложения = Новый Структура;
	ПараметрыВложения.Вставить("ИмяОбъекта",           "");
	ПараметрыВложения.Вставить("Идентификатор",        "");
	ПараметрыВложения.Вставить("Представление",        "");
	ПараметрыВложения.Вставить("ВнешняяОбработка",     Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
	ПараметрыВложения.Вставить("МенеджерПечати",       "");
	ПараметрыВложения.Вставить("ЕстьУсловияВидимости", Ложь);
	ПараметрыВложения.Вставить("УсловияВидимости",     Новый Массив);
		
	Возврат ПараметрыВложения;
	
КонецФункции

Процедура ДобавитьУсловияВидимостиВложения(ПараметрыВложения)
	
	Если НЕ ПараметрыВложения.ЕстьУсловияВидимости Тогда
		Возврат;
	КонецЕсли;
			
	КэшФормы       = ПодключаемыеКомандыПовтИсп.КэшФормы("", ПараметрыВложения.ИмяОбъекта, Истина);
	КомандаОбъекта = КэшФормы.Команды.Найти(ПараметрыВложения.Идентификатор, "Идентификатор");
	Если КомандаОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВложения.УсловияВидимости = КомандаОбъекта.УсловияВидимости;
	
КонецПроцедуры

#КонецОбласти
