
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
		
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОперацияПоставщикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Запись.ОперацияПокупателя) Тогда
		
		ДанныеПоОперации = ПолучитьДанныеПоОперацииВГО(Запись.ОперацияПокупателя);
		ЭтоГруппа 	= ДанныеПоОперации.ЭтоГруппа;
		ТипОперации = ДанныеПоОперации.ТипОперации;
		Элементы.ОперацияПоставщика.ВыборГруппИЭлементов = ?(ЭтоГруппа, ГруппыИЭлементы.Группы, ГруппыИЭлементы.Элементы);	
		         		
	Иначе
		
		Элементы.ОперацияПоставщика.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
		ТипОперации = Неопределено;
		
	КонецЕсли;
	
	ВыбратьОперациюВГО(Элемент, СтандартнаяОбработка, ТипОперации);
		
КонецПроцедуры // ОперацияПоставщикаНачалоВыбора()

&НаКлиенте
Процедура ОперацияПокупателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ОперацияПоставщика) Тогда
		
		ДанныеПоОперации = ПолучитьДанныеПоОперацииВГО(Запись.ОперацияПоставщика);
		ЭтоГруппа 	= ДанныеПоОперации.ЭтоГруппа;
		ТипОперации = ДанныеПоОперации.ТипОперации;
 	    Элементы.ОперацияПокупателя.ВыборГруппИЭлементов = ?(ЭтоГруппа, ГруппыИЭлементы.Группы, ГруппыИЭлементы.Элементы);	
				
	Иначе
		
		Элементы.ОперацияПокупателя.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
		ТипОперации = Неопределено;
		
	КонецЕсли;
	
	ВыбратьОперациюВГО(Элемент, СтандартнаяОбработка, ТипОперации);
	
КонецПроцедуры // ОперацияПокупателяНачалоВыбора()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выбирает операцию ВГО.
//
// Параметры:
//  Элемент  			 - ПолеФормы.
//  СтандартнаяОбработка - Булево.
//  ТипОперации 		 - СправочникСсылка.бит_вго_ТипыОперацийВГО.
//
&НаКлиенте
Процедура ВыбратьОперациюВГО(Элемент, СтандартнаяОбработка, ТипОперации)
	
	МассивВыбора = Новый Массив;
	МассивВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидОперации", Элемент.ПараметрыВыбора[0].Значение));
	Если ТипОперации <> Неопределено Тогда
		МассивВыбора.Добавить(Новый ПараметрВыбора("Отбор.ТипОперации", ТипОперации));
	КонецЕсли;

	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивВыбора);
	
КонецПроцедуры // ВыбратьОперациюВГО()

// Функция возвращает данные по операции ВГО.
//
// Параметры:
//  ТекОперация - СправочникСсылка.бит_ОперацииВГО.
//  
// Возвращаемое значение:
//   Структура.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеПоОперацииВГО(ТекОперация)

	Результат = Новый Структура;
	Результат.Вставить("ЭтоГруппа"	, ТекОперация.ЭтоГруппа);
	Результат.Вставить("ТипОперации", ТекОперация.ТипОперации);

	Возврат Результат;
	
КонецФункции // ПолучитьДанныеПоОперацииВГО()

#КонецОбласти