
Функция ПолучитьИдентификатор_БазисРаскрой(ВхДокПакетныйЗаказНаПроизводство) Экспорт 
	
	_Идентификатор = "Базис_"+ глНомерБезПрефикса(ВхДокПакетныйЗаказНаПроизводство.Номер) + "_" + Формат(ВхДокПакетныйЗаказНаПроизводство.Дата, "ДФ=ddMMyyyy");
	Возврат _Идентификатор;
	
КонецФункции

Функция ПолучитьИмяФайлаCutRite(ВхДокПакетныйЗаказНаПроизводство, ВхСуффикс = "") Экспорт 
	
	_ИмяФайлаВыгрузкиCutRite = "CutRite_"+ глНомерБезПрефикса(ВхДокПакетныйЗаказНаПроизводство.Номер) + "_" + Формат(ВхДокПакетныйЗаказНаПроизводство.Дата, "ДФ=ddMMyyyy") + ?(ВхСуффикс = "", "", "_" + ВхСуффикс);
	Возврат _ИмяФайлаВыгрузкиCutRite;

КонецФункции 

// Возвращает номер документа без префикса
//
// Параметры:
//  ВхНомер      - Строка.
//
// Возвращаемое значение:
//  Строка. Строковое представление документа.
//
Функция глНомерБезПрефикса(Знач ВхНомер) Экспорт
	//Микляев К.А Получать везде префикс в документах
	Возврат(ВхНомер);
	//_Микляев К.А Получать везде префикс в документах 	
КонецФункции
