#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗаполнениеОсновнойТаблицыДанных

Функция ПолучитьДанные(ДанныеОбъекта, ДанныеФормы) Экспорт
	
	ИсточникДанных 			 = ДанныеОбъекта.ИсточникДанных;
	Период					 = ДанныеОбъекта.Период;
	НастройкаПулаПодключений = ДанныеОбъекта.НастройкаПулаПодключений;
	
	ОтборВОтчете	 = ДанныеФормы.ОтборВОтчете;
	ТаблицаПараметры = ДанныеФормы.ТаблицаПараметры;
	
	ГраницаНач = Период.ДатаНачала;
	ГраницаКон = Новый Граница(Период.ДатаОкончания, ВидГраницы.Включая);
	
	ПараметрыЗапроса = бит_МеханизмПолученияДанных.ЗаполнитьСтруктуруПараметровИзТаблицы(ТаблицаПараметры);	
	
	Если ТипЗнч(ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		
		// Получим таблицу с данными по источнику данных.
		ПараметрыПередачи = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоИсточнику();
		ПараметрыПередачи.НастройкаПулаПодключений = НастройкаПулаПодключений;
		ПараметрыПередачи.Параметры                = ПараметрыЗапроса;
		ПараметрыПередачи.ОтборВОтчете             = ОтборВОтчете;
		
		ТаблицаРезультат = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточнику(ИсточникДанных,
							ГраницаНач, ГраницаКон, ПараметрыПередачи);
	Иначе
		
		ПоказыватьИндикатор = НЕ бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("НеОтображатьИндикаторКомпоновкиИсточников");
		// Получим таблицу с данными по способу компоновки источников данных.
        ПараметрыПередачи = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоСпособуКомпоновки();
		ПараметрыПередачи.НастройкаПулаПодключений = НастройкаПулаПодключений;
		ПараметрыПередачи.Параметры                = ПараметрыЗапроса;		
		ПараметрыПередачи.ОтборВОтчете             = ОтборВОтчете;
		ПараметрыПередачи.ПоказыватьИндикатор      = ПоказыватьИндикатор;
		
		ТаблицаРезультат = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточникам(ИсточникДанных,
							ГраницаНач, ГраницаКон, ПараметрыПередачи);
																			
		бит_МеханизмПолученияДанных.ДополнитьРезультатИВыполнитьРасчет(ИсточникДанных, ТаблицаРезультат);
		
	КонецЕсли;
		
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти
 
#Область СозданиеДокументов
	
// Процедура заполняет движения операции по данным, полученным из источника.
// 
// Параметры:
//  ХранилищеДанные    - ТаблицаЗначений ИЛИ ХранилищеЗначений.
//  НаборЗаписей 	   - НаборЗаписей.<ИмяРегистраБухгалтерии>.
//  КоличествоСубконто - Число.
//  ИмяРегистра		   - Строка (По умолчанию = Неопределено)
// 						(Необезательный, если ХранилищеДанные типа ТаблицаЗначений 
// 						и НаборЗаписей типа НаборЗаписей.<ИмяРегистраБухгалтерии>).
// 
Процедура ЗаполнитьДвижения(ХранилищеДанные, НаборЗаписей, КоличествоСубконто, ИмяРегистра = Неопределено)  Экспорт
	
	// Данные заполнения - таблица значений  	
	Если ТипЗнч(ХранилищеДанные) = Тип("ТаблицаЗначений") Тогда
		ДанныеЗаполнения = ХранилищеДанные;
	Иначе                                  		
		ДанныеЗаполнения = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(ХранилищеДанные);
	КонецЕсли;
	
	// Активность проводок
	Активность = ?(НаборЗаписей.Количество() > 0, НаборЗаписей[0].Активность, Истина);	
	
	Для каждого СтрокаДанные Из ДанныеЗаполнения Цикл
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаДанные);
		Запись.Активность = Активность;
						
		// Заполнение субконто
		Для Ном = 1 По КоличествоСубконто Цикл
			ЗначениеАналитикиДт = СтрокаДанные["СубконтоДт" + Ном];
			ЗначениеАналитикиКт = СтрокаДанные["СубконтоКт" + Ном];
			
			бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, Ном, ЗначениеАналитикиДт);
			бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт, Запись.СубконтоКт, Ном, ЗначениеАналитикиКт);
		КонецЦикла;
	КонецЦикла; // ЗначениеВыбора.Данные
	          
КонецПроцедуры // ЗаполнитьДвижения()

// Процедура заполняет движения операции по данным, полученным из источника.
// 
// Параметры:
//  ХранилищеДанные    - ТаблицаЗначений ИЛИ ХранилищеЗначений.
//  НаборЗаписей 	   - ДанныеФормыСтруктураСКоллекцией.
//  КоличествоСубконто - Число.
// 
Процедура ЗаполнитьДвиженияХоз(ХранилищеДанные, НаборЗаписей, КоличествоСубконто)  Экспорт
	
	// Данные заполнения - таблица значений  	
	Если ТипЗнч(ХранилищеДанные) = Тип("ТаблицаЗначений") Тогда
		ДанныеЗаполнения = ХранилищеДанные;
	Иначе                                  		
		ДанныеЗаполнения = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(ХранилищеДанные);
    КонецЕсли;
    
    Если ДанныеЗаполнения = Неопределено Тогда
        Возврат;
    КонецЕсли;    
	
	// Активность проводок
	Активность = ?(НаборЗаписей.Количество() > 0, НаборЗаписей[0].Активность, Истина);	
	
	Для каждого СтрокаДанные Из ДанныеЗаполнения Цикл
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаДанные);
		Запись.Активность = Активность;
								
	КонецЦикла; // ЗначениеВыбора.Данные
	          
КонецПроцедуры // ЗаполнитьДвиженияХоз()

// Процедура создает документы. 
// 
// Параметры:
//  ДанныеЗаполнения - ТаблицаЗначений.
//  ОбъектСистемы    - СправочникСсылка.бит_ОбъектыСистемы.
//  РежимСообщений   - Строка.
//
// Возвращаемое значение:
//  Массив - созданные документы.
//
Функция СоздатьДокументы(ДанныеЗаполнения, ОбъектСистемы, РежимСообщений = "Ошибки") Экспорт

	НовыеДокументы = Новый Массив;

	ИмяРегистра		   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСистемы, "ИмяОбъекта");
	КоличествоСубконто = Метаданные.РегистрыБухгалтерии[ИмяРегистра].ПланСчетов.МаксКоличествоСубконто;
	ЭтоБюджетирование  = (ВРег(ИмяРегистра) = ВРег("бит_Бюджетирование"));
	ЭтоХозрасчетный    = (ВРег(ИмяРегистра) = ВРег("Хозрасчетный"));
	РазделительУчета   = ?(ЭтоБюджетирование, "Сценарий", "Организация");

	ШаблонПоля     = "ДанныеЗаполнения.%1 КАК %1";
	ВыраженияПолей = Новый Массив;
	Для каждого Колонка Из ДанныеЗаполнения.Колонки Цикл
		Если Колонка.Имя <> РазделительУчета 
		   И Колонка.Имя <> "Выполнять" И Колонка.Имя <> "Период" Тогда
			ВыраженияПолей.Добавить(СтрШаблон(ШаблонПоля, Колонка.Имя));
		КонецЕсли; 
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеЗаполнения.Выполнять КАК Выполнять,
	|	ДанныеЗаполнения.Период КАК Период,
	|	&ВыраженияПолей, 
	|	&ИмяИзмерения
	|ПОМЕСТИТЬ ВременныеДанные
	|ИЗ
	|	&ДанныеЗаполнения КАК ДанныеЗаполнения
	|ГДЕ
	|	ДанныеЗаполнения.Выполнять
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗаполнения.Выполнять КАК Выполнять,
	|	ДанныеЗаполнения.Период КАК Период,
	|	&ВыраженияПолей,
	|	&ИмяИзмерения 
	|ИЗ
	|	ВременныеДанные КАК ДанныеЗаполнения
	|ИТОГИ ПО
	|	&ИмяИзмерения,
	|	Период";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыраженияПолей", СтрСоединить(ВыраженияПолей, "," + Символы.ПС));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяИзмерения", 	СтрШаблон("ДанныеЗаполнения.%1", РазделительУчета));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
	Запрос.Текст = ТекстЗапроса;
	Результат	 = Запрос.Выполнить();
	
	ТаблицаДанныеЗаполнения = ДанныеЗаполнения.СкопироватьКолонки();
	
	ВыборкаИзмерение = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИзмерение.Следующий() Цикл
	
		ВыборкаПериод = ВыборкаИзмерение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПериод.Следующий() Цикл
			 
			Если ЭтоБюджетирование Тогда
				СозданныйДокумент = Документы.бит_ОперацияБюджетирование.СоздатьДокумент();
			ИначеЕсли ЭтоХозрасчетный Тогда
				СозданныйДокумент = Документы.ОперацияБух.СоздатьДокумент();
				СозданныйДокумент.СпособЗаполнения = "Вручную";
			Иначе	
				СозданныйДокумент = Документы.бит_ОперацияУправленческий.СоздатьДокумент();
				СозданныйДокумент.РегистрБухгалтерии = ОбъектСистемы;
			КонецЕсли; 
				
			СозданныйДокумент.Дата = КонецДня(ВыборкаПериод.Период);
			
			СозданныйДокумент[РазделительУчета] = ВыборкаПериод[РазделительУчета];

			// Движения.
			ТаблицаДанныеЗаполнения.Очистить();			 
		 	Выборка = ВыборкаПериод.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = ТаблицаДанныеЗаполнения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла; // Выборка			
			НаборЗаписей = СозданныйДокумент.Движения[ИмяРегистра];
			НаборЗаписей.Записывать = Истина;
			ЗаполнитьДвижения(ТаблицаДанныеЗаполнения, НаборЗаписей, КоличествоСубконто);
			  
			Если ТипЗнч(СозданныйДокумент) = Тип("ДокументОбъект.ОперацияБух")
			   И ТаблицаДанныеЗаполнения.Колонки.Найти("Сумма") <> Неопределено Тогда
				// В типовом документе операция в модуле объекта нет процедуры, 
				// вычисляющей сумму операции - выполним вычисления здесь.  
				СозданныйДокумент.СуммаОперации = ТаблицаДанныеЗаполнения.Итог("Сумма");
			КонецЕсли; 
			
			Записан = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(СозданныйДокумент, 
				РежимЗаписиДокумента.Запись, "", РежимСообщений);
			Если Записан Тогда
				НовыеДокументы.Добавить(СозданныйДокумент.Ссылка);
			КонецЕсли; 
			  
		 КонецЦикла; // ВыборкаПериод
	
	КонецЦикла; // ВыборкаИзмерение
	 
	Возврат НовыеДокументы;

КонецФункции // СоздатьДокументы()

#КонецОбласти
 
#КонецОбласти
 
#КонецЕсли
