
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Основание", ПараметрКоманды);
	ПараметрыФормы.Вставить("ВидПлана", ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.План"));
	ПараметрыФормы.Вставить("Режим", "Заявка");
	
	ОткрытьФорму("Документ.бит_кзн_ПлатежнаяПозиция.ФормаОбъекта"
	              , ПараметрыФормы
				  , ПараметрыВыполненияКоманды.Источник
				  , ПараметрыВыполненияКоманды.Уникальность
				  , ПараметрыВыполненияКоманды.Окно);
				  
КонецПроцедуры
