&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																		"кг", 
																		Константы.ЕдиницаИзмеренияВеса.Получить(),
																		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																		"м3", 
																		Константы.ЕдиницаИзмеренияОбъема.Получить(),
																		Истина);   
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)       
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"СкладОтправительОтбор", 
																			СкладОтправитель,
																			ЗначениеЗаполнено(СкладОтправитель));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"СкладПолучательОтбор", 
																			СкладПолучатель,
																			ЗначениеЗаполнено(СкладПолучатель));																
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();
	РассчитатьИтоги();
	
	ЗаголовокКолонкиПроизведено(); 
	
КонецПроцедуры

#Область ПерваяСтраница

#Область ОтборыПервойСтраницы	

&НаКлиенте
Процедура ДатаОтгрузкиКлиентуПриИзменении(Элемент)                                      
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"Дата", 
																			ДатаОтгрузкиКлиентуОтбор.ДатаНачала,
																			ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
																			,
																			ЗначениеЗаполнено(ДатаОтгрузкиКлиентуОтбор.ДатаНачала));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"Дата", 
																			ДатаОтгрузкиКлиентуОтбор.ДатаОкончания,
																			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
																			,
																			ЗначениеЗаполнено(ДатаОтгрузкиКлиентуОтбор.ДатаОкончания));																		
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();	
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"СкладОтправительОтбор", 
																			СкладОтправитель,
																			ЗначениеЗаполнено(СкладОтправитель));
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить(); 
	ЗаголовокКолонкиПроизведено();
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"СкладПолучательОтбор", 
																			СкладПолучатель,
																			ЗначениеЗаполнено(СкладПолучатель));   
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();	
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"Назначение", 
																			Назначение,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			ЗначениеЗаполнено(Назначение));
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"Номенклатура", 
																			Номенклатура,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			ЗначениеЗаполнено(Номенклатура)); 
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();
	РассчитатьИтоги();
КонецПроцедуры


&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"ЗаказКлиента", 
																			ЗаказКлиента,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			ЗначениеЗаполнено(ЗаказКлиента));   
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();	
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура дсУправлениеЗаказамиНаПеремещениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элемент.ТекущиеДанные;                  
	ТекПоле = СтрЗаменить(Поле.Имя, Элемент.Имя, "");   
	Если ТекПоле = "ЗаказКлиента" 
		Или ТекПоле = "Назначение"
		или ТекПоле = "Номенклатура"
		Или ТекПоле = "Характеристика" 
		Или ТекПоле = "Ссылка" Тогда
		
		ОткрытьЗначение(ТД[ТекПоле]);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Процедура РассчитатьИтоги()
    Схема = Элементы.дсУправлениеЗаказамиНаПеремещение.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.дсУправлениеЗаказамиНаПеремещение.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Элементы.дсУправлениеЗаказамиНаПеремещениеКоличество.ТекстПодвала = Результат.Итог("Количество");
	Элементы.дсУправлениеЗаказамиНаПеремещениеМасса.ТекстПодвала = Результат.Итог("Масса");
	Элементы.дсУправлениеЗаказамиНаПеремещениеОбъем.ТекстПодвала = Результат.Итог("Объем");
	Элементы.дсУправлениеЗаказамиНаПеремещениеПроизведено.ТекстПодвала = Результат.Итог("Произведено");
	Элементы.дсУправлениеЗаказамиНаПеремещениеЕдИзмМассы.ТекстПодвала = "кг";
	Элементы.дсУправлениеЗаказамиНаПеремещениеЕдИзмОбъема.ТекстПодвала = "м3";
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаголовокКолонкиПроизведено()
	
	Если ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(СкладОтправитель, "ЦеховаяКладовая") Тогда
		Элементы.дсУправлениеЗаказамиНаПеремещениеПроизведено.Заголовок = "Сколько произведено(готово к отгрузке)";
	Иначе
		Элементы.дсУправлениеЗаказамиНаПеремещениеПроизведено.Заголовок = "Остаток на складе";
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Отгрузить(Команда)

	мВыделенных = Элементы.дсУправлениеЗаказамиНаПеремещение.ВыделенныеСтроки;
	мДанныхЗаказа = Новый Массив;
	Для каждого стр из мВыделенных Цикл
		ТД = Элементы.дсУправлениеЗаказамиНаПеремещение.ДанныеСтроки(стр);
		Если ТД.Произведено = 0 Тогда 
			Продолжить;
		Иначе    
			мДанныхЗаказа.Добавить(Новый Структура("Заказ, НомерСтроки, Номенклатура, Характеристика, СкладОтправитель", ТД.Ссылка, ТД.НомерСтроки, ТД.Номенклатура, ТД.Характеристика, ТД.СкладОтправитель));
		КонецЕсли;
		
	КонецЦикла;          
	ОтгрузитьНаСервере(мДанныхЗаказа);
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();
	
КонецПроцедуры 

&НаСервере
Процедура ОтгрузитьНаСервере(мДанныхЗаказа)
	//Запрос в цикле это плохо, но такое задание.
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПеремещение"));
	тз.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));
	тз.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тз.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры")); 
	тз.Колонки.Добавить("СкладОтправитель", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	
	Для каждого стр из мДанныхЗаказа Цикл
		нов = тз.Добавить();
		ЗаполнитьЗначенияСвойств(нов, стр);
	КонецЦикла;                            
	// получим таблицу остатка чтобы не гонять запрос в цикле
	Запрос = Новый Запрос("ВЫБРАТЬ Различные
	                      |	вт.Заказ КАК Заказ,
	                      |	вт.Номенклатура КАК Номенклатура,
	                      |	вт.Характеристика КАК Характеристика,
	                      |	вт.СкладОтправитель КАК СкладОтправитель
	                      |ПОМЕСТИТЬ вт
	                      |ИЗ
	                      |	&вт КАК вт
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                      |	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	                      |	ТоварыНаСкладахОстатки.Назначение.Заказ КАК Заказ,
	                      |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Остаток,
	                      |	ТоварыНаСкладахОстатки.Серия КАК Серия
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	                      |		ПО ТоварыНаСкладахОстатки.Номенклатура = вт.Номенклатура
	                      |			И ТоварыНаСкладахОстатки.Характеристика = вт.Характеристика
	                      |			И ТоварыНаСкладахОстатки.Назначение.Заказ = вт.Заказ
	                      |			И ТоварыНаСкладахОстатки.Склад = вт.СкладОтправитель");
	Запрос.УстановитьПараметр("вт", тз);
	ТаблицаОстатковПоСериям = Запрос.Выполнить().Выгрузить();
	
	ОбъектыЗаказов = Новый Соответствие;
	Для каждого стр из тз Цикл
		ДокОбъект = ОбъектыЗаказов.Получить(стр.Заказ);
		Если ДокОбъект = Неопределено Тогда
			ДокОбъект = стр.Заказ.ПолучитьОбъект();
			ОбъектыЗаказов.Вставить(стр.Заказ, ДокОбъект);
		КонецЕсли;
		
		СтрокаЗаказа = ДокОбъект.Товары.Найти(стр.НомерСтроки, "НомерСтроки");
		СтрокиОстатков = ТаблицаОстатковПоСериям.НайтиСтроки(Новый Структура("Заказ, Номенклатура, Характеристика", стр.Заказ, стр.Номенклатура, стр.Характеристика));
		//Для каждого стрОстатка из СтрокиОстатка Цикл
		ОбработатьСтрокуТоваров_Отгрузить(ДокОбъект, СтрокаЗаказа, СтрокиОстатков);  
		//Попытка
		//	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать " + стр.Заказ, стр.Заказ);	
		//КонецПопытки;
	КонецЦикла;
	
	Для Каждого ПараЗаказа Из ОбъектыЗаказов Цикл

	Попытка
		ПараЗаказа.Значение.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать " + Строка(ПараЗаказа.Ключ) + " по причине " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ПараЗаказа.Ключ);
	КонецПопытки;

КонецЦикла;
КонецПроцедуры    

&НаСервере
Процедура ОбработатьСтрокуТоваров_Отгрузить(ДокОбъект, СтрокаЗаказа, СтрокиОстатков)
	
	ОсталосьОбеспечить = СтрокаЗаказа.Количество;
	//ПерваяСтрокаЗаполнена = Ложь;
	
	Для Каждого СтрокаОстатка Из СтрокиОстатков Цикл
		
		Если ОсталосьОбеспечить <= 0 Тогда
			Прервать;
		КонецЕсли;
		Если СтрокаОстатка.Остаток <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОсталосьОбеспечить <= СтрокаОстатка.Остаток Тогда
			СтрокаЗаказа.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
			Если СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ИспользоватьСерии Тогда
				СтрокаЗаказа.Серия = СтрокаОстатка.Серия;
				СтрокаЗаказа.СтатусУказанияСерий = 14; 
			КонецЕсли;
			СтрокаОстатка.Остаток = СтрокаОстатка.Остаток - ОсталосьОбеспечить;
			ОсталосьОбеспечить = 0;  
			
			Прервать;
		Иначе
			
			нов = ДокОбъект.товары.Добавить();
			ЗаполнитьЗначенияСвойств(нов, СтрокаЗаказа); 
			
			нов.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
			Если нов.Номенклатура.ВидНоменклатуры.ИспользоватьСерии Тогда
				нов.Серия = СтрокаОстатка.Серия;
				нов.СтатусУказанияСерий = 14; 
			КонецЕсли;
			// уменьшим исходную строку
			СтрокаЗаказа.Количество = СтрокаЗаказа.Количество - СтрокаОстатка.Остаток;
			
			// установим количество в новой строке
			нов.Количество = СтрокаОстатка.Остаток;
			ОсталосьОбеспечить = ОсталосьОбеспечить - СтрокаОстатка.Остаток;
			СтрокаОстатка.Остаток = 0;
			
			// упаковки 
			Если ЗначениеЗаполнено(СтрокаЗаказа.Упаковка) Тогда  
				коэффициент = СтрокаЗаказа.Упаковка.Числитель / СтрокаЗаказа.Упаковка.Знаменатель;
			Иначе                                              
				коэффициент = 1;
			КонецЕсли;                                                 
			
			Если коэффициент = 0 Тогда
				коэффициент = 1;
			КонецЕсли;
			СтрокаЗаказа.КоличествоУпаковок = СтрокаЗаказа.Количество / коэффициент;
			нов.КоличествоУпаковок = нов.Количество / коэффициент;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура СформироватьПеремещение(Команда)
	
	мВыделенных = Элементы.дсУправлениеЗаказамиНаПеремещение.ВыделенныеСтроки;
	мДанныхЗаказа = Новый Массив;
	Для каждого стр из мВыделенных Цикл
		ТД = Элементы.дсУправлениеЗаказамиНаПеремещение.ДанныеСтроки(стр);
		Если ТД.Произведено = 0 Тогда 
			Продолжить;
		Иначе    
			мДанныхЗаказа.Добавить(Новый Структура("Заказ, Номенклатура, Характеристика, СкладОтправитель, СкладПолучатель", ТД.Ссылка, ТД.НомерСтроки, ТД.Номенклатура, ТД.Характеристика, ТД.СкладОтправитель));
		КонецЕсли;
		
	КонецЦикла;          
	СформироватьПеремещенияНаСервере(мДанныхЗаказа);
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();

КонецПроцедуры

&НаСервере
Процедура СформироватьПеремещенияНаСервере(мДанныхЗаказа)
	
КонецПроцедуры
	
	
#КонецОбласти
