&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																		"кг", 
																		Константы.ЕдиницаИзмеренияВеса.Получить(),
																		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																		"м3", 
																		Константы.ЕдиницаИзмеренияОбъема.Получить(),
																		Истина); 
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																		"ТекДата", 
																		НачалоДня(ТекущаяДатаСеанса()),
																		Истина); 
																																			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)       
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"СкладОтправительОтбор", 
																			СкладОтправитель,
																			ЗначениеЗаполнено(СкладОтправитель));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"СкладПолучательОтбор", 
																			СкладПолучатель,
																			ЗначениеЗаполнено(СкладПолучатель));																
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();
	РассчитатьИтоги();
	
	ЗаголовокКолонкиПроизведено(); 
	
КонецПроцедуры

#Область ПерваяСтраница

#Область ОтборыПервойСтраницы	

&НаКлиенте
Процедура ДатаОтгрузкиКлиентуПриИзменении(Элемент)    
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
								дсУправлениеЗаказамиНаПеремещение.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы,
								"ОтборДатаОтгрузкиКлиенту",
								ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	
	Если ЗначениеЗаполнено(ДатаОтгрузкиКлиентуОтбор.ДатаНачала) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбора,
			"ДатаОтгрузкиКлиенту",
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
			ДатаОтгрузкиКлиентуОтбор.ДатаНачала,,
			Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОтгрузкиКлиентуОтбор.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбора,
			"ДатаОтгрузкиКлиенту",
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
			КонецДня(ДатаОтгрузкиКлиентуОтбор.ДатаОкончания),,
			Истина);
	КонецЕсли;
	
	ГруппаОтбора.Использование = ЗначениеЗаполнено(ДатаОтгрузкиКлиентуОтбор.ДатаНачала) Или ЗначениеЗаполнено(ДатаОтгрузкиКлиентуОтбор.ДатаОкончания);
	
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();
	РассчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"СкладОтправительОтбор", 
																			СкладОтправитель,
																			ЗначениеЗаполнено(СкладОтправитель));
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить(); 
	ЗаголовокКолонкиПроизведено();
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"СкладПолучательОтбор", 
																			СкладПолучатель,
																			ЗначениеЗаполнено(СкладПолучатель));   
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();	
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"Назначение", 
																			Назначение,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			ЗначениеЗаполнено(Назначение));
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"Номенклатура", 
																			Номенклатура,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			ЗначениеЗаполнено(Номенклатура)); 
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(дсУправлениеЗаказамиНаПеремещение, 
																			"ЗаказКлиента", 
																			ЗаказКлиента,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			ЗначениеЗаполнено(ЗаказКлиента));   
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();	
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура дсУправлениеЗаказамиНаПеремещениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элемент.ТекущиеДанные;                  
	ТекПоле = СтрЗаменить(Поле.Имя, Элемент.Имя, "");   
	Если ТекПоле = "ЗаказКлиента" 
		Или ТекПоле = "Назначение"
		или ТекПоле = "Номенклатура"
		Или ТекПоле = "Характеристика" 
		Или ТекПоле = "Ссылка" Тогда
		
		ОткрытьЗначение(ТД[ТекПоле]);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#ОБласть КомандыПервойСтраницы

&НаКлиенте
Процедура ОбновитьЗаказы(Команда)
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Отгрузить(Команда)

	мВыделенных = Элементы.дсУправлениеЗаказамиНаПеремещение.ВыделенныеСтроки;
	мДанныхЗаказа = Новый Массив;
	Для каждого стр из мВыделенных Цикл
		ТД = Элементы.дсУправлениеЗаказамиНаПеремещение.ДанныеСтроки(стр);
		Если ТД.Произведено = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка не обеспечена. Невозможно произвести отгрузку");
			Продолжить;   
		ИначеЕсли ТД.СостояниеОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка уже в статусе Отгрузить. Действий не требуется");
			Продолжить;
		Иначе    
			мДанныхЗаказа.Добавить(Новый Структура("Заказ, НомерСтроки, Номенклатура, Характеристика, СкладОтправитель", ТД.Ссылка, ТД.НомерСтроки, ТД.Номенклатура, ТД.Характеристика, ТД.СкладОтправитель));
		КонецЕсли;
		
	КонецЦикла;  
	
	Если мДанныхЗаказа.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("нет строк для отгрузки");	
		Возврат;
	КонецЕсли;
	
	ОтгрузитьНаСервере(мДанныхЗаказа);
	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отгрузка выделенных строк завершена");
	
КонецПроцедуры 

&НаСервере
Процедура ОтгрузитьНаСервере(мДанныхЗаказа)

	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПеремещение"));
	тз.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));
	тз.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тз.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры")); 
	тз.Колонки.Добавить("СкладОтправитель", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	
	Для каждого стр из мДанныхЗаказа Цикл
		нов = тз.Добавить();
		ЗаполнитьЗначенияСвойств(нов, стр);
	КонецЦикла;                            
	// получим таблицу остатка чтобы не гонять запрос в цикле
	Запрос = Новый Запрос("ВЫБРАТЬ Различные
	                      |	вт.Заказ КАК Заказ,
	                      |	вт.Номенклатура КАК Номенклатура,
	                      |	вт.Характеристика КАК Характеристика,
	                      |	вт.СкладОтправитель КАК СкладОтправитель
	                      |ПОМЕСТИТЬ вт
	                      |ИЗ
	                      |	&вт КАК вт
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                      |	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	                      |	ТоварыНаСкладахОстатки.Назначение.Заказ КАК Заказ,
	                      |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Остаток,
	                      |	ТоварыНаСкладахОстатки.Серия КАК Серия
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	                      |		ПО ТоварыНаСкладахОстатки.Номенклатура = вт.Номенклатура
	                      |			И ТоварыНаСкладахОстатки.Характеристика = вт.Характеристика
	                      |			И ТоварыНаСкладахОстатки.Назначение.Заказ = вт.Заказ
	                      |			И ТоварыНаСкладахОстатки.Склад = вт.СкладОтправитель");
	Запрос.УстановитьПараметр("вт", тз);
	ТаблицаОстатковПоСериям = Запрос.Выполнить().Выгрузить();
	
	ОбъектыЗаказов = Новый Соответствие;
	Для каждого стр из тз Цикл
		ДокОбъект = ОбъектыЗаказов.Получить(стр.Заказ);
		Если ДокОбъект = Неопределено Тогда
			ДокОбъект = стр.Заказ.ПолучитьОбъект();
			ОбъектыЗаказов.Вставить(стр.Заказ, ДокОбъект);
		КонецЕсли;
		
		СтрокаЗаказа = ДокОбъект.Товары.Найти(стр.НомерСтроки, "НомерСтроки");
		СтрокиОстатков = ТаблицаОстатковПоСериям.НайтиСтроки(Новый Структура("Заказ, Номенклатура, Характеристика", стр.Заказ, стр.Номенклатура, стр.Характеристика));
        Если СтрокиОстатков.Количество() Тогда
			ОбработатьСтрокуТоваров_Отгрузить(ДокОбъект, СтрокаЗаказа, СтрокиОстатков);     
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + стр.Заказ + " для " + стр.Номенклатура + " " + стр.Характеристика + " нет остатков для перевода строки в состояние `Отгрузить`.");
		КонецЕсли;
		
	КонецЦикла;
	// запишем документы
	Для Каждого ПараЗаказа Из ОбъектыЗаказов Цикл
		Попытка
			ПараЗаказа.Значение.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать " + Строка(ПараЗаказа.Ключ) + " по причине " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ПараЗаказа.Ключ);
		КонецПопытки;
	КонецЦикла; 

КонецПроцедуры    

&НаСервере
Процедура ОбработатьСтрокуТоваров_Отгрузить(ДокОбъект, СтрокаЗаказа, СтрокиОстатков)
	
	ОсталосьОбеспечить = СтрокаЗаказа.Количество;
	
	НачалоОтгрузки = ТекущаяДатаСеанса();
	
	Для Каждого СтрокаОстатка Из СтрокиОстатков Цикл
		
		Если ОсталосьОбеспечить <= 0 Тогда
			Прервать;
		КонецЕсли;
		Если СтрокаОстатка.Остаток <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОсталосьОбеспечить <= СтрокаОстатка.Остаток Тогда
			СтрокаЗаказа.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить; 
			СтрокаЗаказа.НачалоОтгрузки = НачалоОтгрузки;   
			Если ДокОбъект.ИспользоватьДлительностьПеремещения 
				И ЗначениеЗаполнено(ДокОбъект.ДлительностьПеремещения) Тогда 
				СтрокаЗаказа.ОкончаниеПоступления = НачалоОтгрузки + (ДокОбъект.ДлительностьПеремещения * 86400);
			КонецЕсли;
			
			Если СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ИспользоватьСерии Тогда
				СтрокаЗаказа.Серия = СтрокаОстатка.Серия;
				СтрокаЗаказа.СтатусУказанияСерий = 14; 
			КонецЕсли;
			СтрокаОстатка.Остаток = СтрокаОстатка.Остаток - ОсталосьОбеспечить;
			ОсталосьОбеспечить = 0;  
			
			Прервать;
		Иначе
			
			нов = ДокОбъект.товары.Добавить();
			ЗаполнитьЗначенияСвойств(нов, СтрокаЗаказа); 
			
			нов.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;  
			нов.НачалоОтгрузки = НачалоОтгрузки;
			Если ДокОбъект.ИспользоватьДлительностьПеремещения 
				И ЗначениеЗаполнено(ДокОбъект.ДлительностьПеремещения) Тогда 
				СтрокаЗаказа.ОкончаниеПоступления = НачалоОтгрузки + (ДокОбъект.ДлительностьПеремещения * 86400);
			КонецЕсли;
			
			нов.КодСтроки = ДокОбъект.товары.Количество();
			
			Если нов.Номенклатура.ВидНоменклатуры.ИспользоватьСерии Тогда
				нов.Серия = СтрокаОстатка.Серия;
				нов.СтатусУказанияСерий = 14; 
			КонецЕсли;
			// уменьшим исходную строку
			СтрокаЗаказа.Количество = СтрокаЗаказа.Количество - СтрокаОстатка.Остаток;
			
			// установим количество в новой строке
			нов.Количество = СтрокаОстатка.Остаток;
			ОсталосьОбеспечить = ОсталосьОбеспечить - СтрокаОстатка.Остаток;
			СтрокаОстатка.Остаток = 0;
			
			// упаковки 
			Если ЗначениеЗаполнено(СтрокаЗаказа.Упаковка) Тогда  
				коэффициент = СтрокаЗаказа.Упаковка.Числитель / СтрокаЗаказа.Упаковка.Знаменатель;
			Иначе                                              
				коэффициент = 1;
			КонецЕсли;                                                 
			
			Если коэффициент = 0 Тогда
				коэффициент = 1;
			КонецЕсли;
			СтрокаЗаказа.КоличествоУпаковок = СтрокаЗаказа.Количество / коэффициент;
			нов.КоличествоУпаковок = нов.Количество / коэффициент;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура СформироватьПеремещение(Команда)

	СозданныеДокументы.Очистить();
    мДанныхЗаказа = Новый Массив;
	Для Каждого ИдентификаторСтроки Из Элементы.дсУправлениеЗаказамиНаПеремещение.ВыделенныеСтроки Цикл

		ТекущиеДанные = Элементы.дсУправлениеЗаказамиНаПеремещение.ДанныеСтроки(ИдентификаторСтроки);
		Если ТекущиеДанные = Неопределено Или ТекущиеДанные.Произведено <= 0 Тогда
			Продолжить;
		КонецЕсли;

		мДанныхЗаказа.Добавить(Новый Структура("Заказ,НомерСтроки", ТекущиеДанные.Ссылка, ТекущиеДанные.НомерСтроки));

	КонецЦикла;

	Если мДанныхЗаказа.Количество() = 0 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет строк для формирования перемещений");
		Возврат;
	КонецЕсли;

	СформироватьПеремещенияНаСервере(мДанныхЗаказа);

	Элементы.дсУправлениеЗаказамиНаПеремещение.Обновить();
	
	Элементы.грСозданныеДокументы.Заголовок = СтрШаблон("Созданные документы (%1)", СозданныеДокументы.Количество());
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формирование перемещений завершено");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПеремещенияНаСервере(мДанныхЗаказа)

	ТаблицаОтбора = Новый ТаблицаЗначений;
	ТаблицаОтбора.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПеремещение"));
	ТаблицаОтбора.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));

	Для Каждого ДанныеЗаказа Из мДанныхЗаказа Цикл

		Если Не ЗначениеЗаполнено(ДанныеЗаказа.Заказ) Или Не ЗначениеЗаполнено(ДанныеЗаказа.НомерСтроки) Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаОтбора.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеЗаказа);

	КонецЦикла;

	Если ТаблицаОтбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Отбор.Заказ КАК Заказ,
	                      |	Отбор.НомерСтроки КАК НомерСтроки
	                      |ПОМЕСТИТЬ ВТОтбор
	                      |ИЗ
	                      |	&ТаблицаОтбора КАК Отбор
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	докЗаказы.Ссылка КАК Заказ,
	                      |	ДокЗаказыТовары.НомерСтроки КАК НомерСтроки,
	                      |	ДокЗаказыТовары.КодСтроки КАК КодСтроки,
	                      |	докЗаказы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	                      |	докЗаказы.Организация КАК Организация,
	                      |	докЗаказы.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
	                      |	докЗаказы.СкладОтправитель КАК СкладОтправитель,
	                      |	докЗаказы.СкладПолучатель КАК СкладПолучатель,
	                      |	докЗаказы.Подразделение КАК Подразделение,
	                      |	докЗаказы.ВариантПриемкиТоваров КАК ВариантПриемкиТоваров
	                      |ИЗ
	                      |	ВТОтбор КАК Отбор
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК докЗаказы
	                      |		ПО (докЗаказы.Ссылка = Отбор.Заказ)
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК ДокЗаказыТовары
	                      |		ПО (ДокЗаказыТовары.Ссылка = Отбор.Заказ)
	                      |			И (ДокЗаказыТовары.НомерСтроки = Отбор.НомерСтроки)
	                      |ГДЕ
	                      |	докЗаказы.Проведен
	                      |	И НЕ ДокЗаказыТовары.Отменено
	                      |	И ДокЗаказыТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Организация,
	                      |	СкладОтправитель,
	                      |	СкладПолучатель,
	                      |	Подразделение,
	                      |	Заказ,
	                      |	НомерСтроки");

	Запрос.УстановитьПараметр("ТаблицаОтбора", ТаблицаОтбора);

	//ВыборкаГрупп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация,СкладОтправитель,СкладПолучатель,Подразделение");
    ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаГрупп = ТаблицаДанных.Скопировать( , "Организация,СкладОтправитель,СкладПолучатель,Подразделение");
	ТаблицаГрупп.Свернуть("Организация,СкладОтправитель,СкладПолучатель,Подразделение");
	Для Каждого СтрокаГруппы Из ТаблицаГрупп Цикл

		СтрокиГруппы = ТаблицаДанных.НайтиСтроки(Новый Структура("Организация,СкладОтправитель,СкладПолучатель,Подразделение",
																СтрокаГруппы.Организация,
																СтрокаГруппы.СкладОтправитель,
																СтрокаГруппы.СкладПолучатель,
																СтрокаГруппы.Подразделение));
		Если СтрокиГруппы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		ПерваяСтрока = СтрокиГруппы[0];

		МассивЗаказов = Новый Массив;
		РазрешенныеСтроки = Новый Соответствие;

		Для Каждого СтрокаДанных Из СтрокиГруппы Цикл

			Если МассивЗаказов.Найти(СтрокаДанных.Заказ) = Неопределено Тогда
				МассивЗаказов.Добавить(СтрокаДанных.Заказ);
			КонецЕсли;

			РазрешенныеСтроки.Вставить(Строка(СтрокаДанных.Заказ.УникальныйИдентификатор())
										+ "|"
										+ Строка(СтрокаДанных.КодСтроки),
										Истина);

		КонецЦикла;

		РеквизитыШапки = Новый Структура("ХозяйственнаяОперация, Организация, ОрганизацияПолучатель, СкладОтправитель, 
										|СкладПолучатель, Подразделение, ВариантПриемкиТоваров",
										ПерваяСтрока.ХозяйственнаяОперация,
										ПерваяСтрока.Организация,
										ПерваяСтрока.ОрганизацияПолучатель,
										ПерваяСтрока.СкладОтправитель,
										ПерваяСтрока.СкладПолучатель,
										ПерваяСтрока.Подразделение,
										ПерваяСтрока.ВариантПриемкиТоваров
									);

		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("МассивЗаказов", МассивЗаказов);
		СтруктураЗаполнения.Вставить("РеквизитыШапки", РеквизитыШапки);
		СтруктураЗаполнения.Вставить("ФормаОткрыта", Ложь);

		ДокументПеремещения = Документы.ПеремещениеТоваров.СоздатьДокумент();    
		
		ДокументПеремещения.Заполнить(СтруктураЗаполнения);
		
		ДокументПеремещения.Дата = ТекущаяДатаСеанса();

		ДокументПеремещения.Статус = Перечисления.СтатусыПеремещенийТоваров.Отгружено;

		Для ИндексСтроки = ДокументПеремещения.Товары.Количество() - 1 По 0 Цикл
			
			СтрокаТоваров = ДокументПеремещения.Товары[ИндексСтроки];
            Если Не ЗначениеЗаполнено(СтрокаТоваров.ЗаказНаПеремещение) Тогда
				ДокументПеремещения.Товары.Удалить(ИндексСтроки);
				Продолжить;
			КонецЕсли;

			КлючСтроки = Строка(СтрокаТоваров.ЗаказНаПеремещение.УникальныйИдентификатор()) + "|" + Строка(СтрокаТоваров.КодСтроки);

			Если РазрешенныеСтроки.Получить(КлючСтроки) = Неопределено Тогда
				ДокументПеремещения.Товары.Удалить(ИндексСтроки);
			КонецЕсли;

		КонецЦикла;

		Если ДокументПеремещения.Товары.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		Если МассивЗаказов.Количество() = 1 Тогда
			ДокументПеремещения.ЗаказНаПеремещение = МассивЗаказов[0];
		Иначе
			ДокументПеремещения.ЗаказНаПеремещение = Документы.ЗаказНаПеремещение.ПустаяСсылка();
		КонецЕсли;
		СтрокаСозданногоДокумента = СозданныеДокументы.Добавить();

		Попытка
			ДокументПеремещения.Записать(РежимЗаписиДокумента.Проведение);
			СтрокаСозданногоДокумента.Проведен = Истина;
		Исключение
			Причина = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			СтрокаСозданногоДокумента.Комментарий = Причина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести перемещение товаров по причине: " + Причина, ДокументПеремещения.Ссылка);
		КонецПопытки;

		СтрокаСозданногоДокумента.Документ = ДокументПеремещения.Ссылка;

	КонецЦикла;
	//Пока ВыборкаГрупп.Следующий() Цикл

	//	ВыборкаСтрок = ВыборкаГрупп.Выбрать();

	//	МассивЗаказов = Новый Массив;
	//	СоответствиеЗаказов = Новый Соответствие;
	//	РазрешенныеСтроки = Новый Соответствие;
	//	ПерваяСтрокаГруппы = Неопределено;

	//	Пока ВыборкаСтрок.Следующий() Цикл

	//		Если ПерваяСтрокаГруппы = Неопределено Тогда
	//			ПерваяСтрокаГруппы = Новый Структура("ХозяйственнаяОперация,Организация,ОрганизацияПолучатель,"
	//												+ "СкладОтправитель,СкладПолучатель,Подразделение,"
	//												+ "ВариантПриемкиТоваров",
	//																	ВыборкаСтрок.ХозяйственнаяОперация,
	//																	ВыборкаСтрок.Организация,
	//																	ВыборкаСтрок.ОрганизацияПолучатель,
	//																	ВыборкаСтрок.СкладОтправитель,
	//																	ВыборкаСтрок.СкладПолучатель,
	//																	ВыборкаСтрок.Подразделение,
	//																	ВыборкаСтрок.ВариантПриемкиТоваров);
	//		КонецЕсли;

	//		Если СоответствиеЗаказов.Получить(ВыборкаСтрок.Заказ) = Неопределено Тогда
	//			СоответствиеЗаказов.Вставить(ВыборкаСтрок.Заказ, Истина);
	//			МассивЗаказов.Добавить(ВыборкаСтрок.Заказ);
	//		КонецЕсли;

	//		КлючСтроки = Строка(ВыборкаСтрок.Заказ.УникальныйИдентификатор())
	//							+ "|"
	//							+ Формат(ВыборкаСтрок.КодСтроки, "ЧГ=0");

	//		РазрешенныеСтроки.Вставить(КлючСтроки, Истина);

	//	КонецЦикла;

	//	Если ПерваяСтрокаГруппы = Неопределено Или МассивЗаказов.Количество() = 0 Тогда
	//		Продолжить;
	//	КонецЕсли;

	//	РеквизитыШапки = Новый Структура;
	//	ЗаполнитьЗначенияСвойств(РеквизитыШапки, ПерваяСтрокаГруппы);

	//	СтруктураЗаполнения = Новый Структура;
	//	СтруктураЗаполнения.Вставить("МассивЗаказов", МассивЗаказов);
	//	СтруктураЗаполнения.Вставить("РеквизитыШапки", РеквизитыШапки);
	//	СтруктураЗаполнения.Вставить("ФормаОткрыта", Ложь);

	//	ДокументПеремещения = Документы.ПеремещениеТоваров.СоздатьДокумент();
	//	ДокументПеремещения.Заполнить(СтруктураЗаполнения);
	//    ДокументПеремещения.Статус = Перечисления.СтатусыПеремещенийТоваров.Отгружено; 
	//	
	//	ИндексСтроки = ДокументПеремещения.Товары.Количество() - 1;

	//	Пока ИндексСтроки >= 0 Цикл

	//		СтрокаТоваров = ДокументПеремещения.Товары[ИндексСтроки];

	//		КлючСтроки = Строка(СтрокаТоваров.ЗаказНаПеремещение.УникальныйИдентификатор())
	//							+ "|"
	//							+ Формат(СтрокаТоваров.КодСтроки, "ЧГ=0");

	//		Если РазрешенныеСтроки.Получить(КлючСтроки) = Неопределено Тогда
	//			ДокументПеремещения.Товары.Удалить(ИндексСтроки);
	//		КонецЕсли;

	//		ИндексСтроки = ИндексСтроки - 1;

	//	КонецЦикла;

	//	Если ДокументПеремещения.Товары.Количество() = 0 Тогда
	//		Продолжить;
	//	КонецЕсли;

	//	Если МассивЗаказов.Количество() = 1 Тогда
	//		ДокументПеремещения.ЗаказНаПеремещение = МассивЗаказов[0];
	//	Иначе
	//		ДокументПеремещения.ЗаказНаПеремещение = Документы.ЗаказНаПеремещение.ПустаяСсылка();
	//	КонецЕсли;
	//	
	//	нов = СозданныеДокументы.Добавить();
	//	Попытка
	//		ДокументПеремещения.Записать(РежимЗаписиДокумента.Проведение);
	//		нов.Проведено = Истина;
	//	Исключение
	//        ДокументПеремещения.Записать();
	//		Причина = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать перемещение товаров " + ДокументПеремещения.Ссылка + " по причине: " + Причина, ДокументПеремещения.Ссылка);
	//		нов.Комментарий = Причина;	
	//	КонецПопытки;
	//	нов.Документ = ДокументПеремещения.Ссылка;
	//КонецЦикла;

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура РассчитатьИтоги()
    Схема = Элементы.дсУправлениеЗаказамиНаПеремещение.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.дсУправлениеЗаказамиНаПеремещение.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Элементы.дсУправлениеЗаказамиНаПеремещениеКоличество.ТекстПодвала = Результат.Итог("Количество");
	Элементы.дсУправлениеЗаказамиНаПеремещениеМасса.ТекстПодвала = Результат.Итог("Масса");
	Элементы.дсУправлениеЗаказамиНаПеремещениеОбъем.ТекстПодвала = Результат.Итог("Объем");
	Элементы.дсУправлениеЗаказамиНаПеремещениеПроизведено.ТекстПодвала = Результат.Итог("Произведено");
	Элементы.дсУправлениеЗаказамиНаПеремещениеЕдИзмМассы.ТекстПодвала = "кг";
	Элементы.дсУправлениеЗаказамиНаПеремещениеЕдИзмОбъема.ТекстПодвала = "м3";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокКолонкиПроизведено()
	
	Если ЗначениеЗаполнено(СкладОтправитель) И ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(СкладОтправитель, "ЦеховаяКладовая") Тогда
		Элементы.дсУправлениеЗаказамиНаПеремещениеПроизведено.Заголовок = "Сколько произведено(готово к отгрузке)";
	Иначе
		Элементы.дсУправлениеЗаказамиНаПеремещениеПроизведено.Заголовок = "Остаток на складе";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВтораяСтраница

#Область КомандыВторойСтраницы

&НаКлиенте
Процедура ОчиститьСоздание(Команда)
	тчСозданиеЗаказовНаПеремещение.Очистить();
КонецПроцедуры

#Область Подбор

&НаКлиенте
Процедура ПодборСоздание(Команда)
	
	ПФ = ПолучитьПараметрыПодбора();
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПФ, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыподбора()                                                        
	
	ПФ = Новый Структура;
	ПФ.Вставить("Склад",                                     СкладОтправитель);
	ПФ.Вставить("РежимПодбораБезСуммовыхПараметров",         Истина);
	ПФ.Вставить("ОтборПоТипуНоменклатуры",                   Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре()));
	ПФ.Вставить("ИспользоватьДатыОтгрузки",                  Истина);
	ПФ.Вставить("СкрыватьКолонкуВидЦены",                    Истина);
	ПФ.Вставить("СкрыватьКомандуЦеныНоменклатуры",           Истина);
	ПФ.Вставить("Заголовок",                                 НСтр("ru = 'Подбор товаров';
																				|en = 'Pick goods'"));
	ПФ.Вставить("Дата",                                      ТекущаяДатаСеанса());
	ПФ.Вставить("Документ",                                  Документы.ЗаказНаПеремещение.ПустаяСсылка());   
	
	Структура = Новый Структура("СкладОтправитель,СкладПолучатель,Дата", СкладОтправитель, СкладПолучательСоздание, ТекущаяДатаСеанса());
	ФиксСтруктура = Новый ФиксированнаяСтруктура(Структура);
	ПараметрыУказанияСерий = Документы.ЗаказНаПеремещение.ПараметрыУказанияСерий(ФиксСтруктура);
	
	ПФ.Вставить("ПараметрыУказанияСерий",                    ПараметрыУказанияСерий);
	ПФ.Вставить("Назначение",                                Неопределено);
	ПФ.Вставить("Подразделение",                             СкладОтправитель.Подразделение);
	ПФ.Вставить("ПодборВариантовОбеспечения",                Истина);
	ПФ.Вставить("ДоступныеОстаткиПараметрыДокумента",        Неопределено);
	
	Возврат ПФ;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
		
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры  

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);

	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		ТекущаяСтрока = тчСозданиеЗаказовНаПеремещение.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, "Номенклатура,Характеристика,Упаковка,КоличествоУпаковок"); 
		ТекущаяСтрока.Количество = ТекущаяСтрока.КоличествоУпаковок * ?(ТекущаяСтрока.Упаковка.Знаменатель = 0, 1, ТекущаяСтрока.Упаковка.Числитель / ТекущаяСтрока.Упаковка.Знаменатель);
		Если не ЗначениеЗаполнено(СтрокаТовара.Упаковка) Тогда
			ТекущаяСтрока.Упаковка = ТекущаяСтрока.Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЦикла;
	
	//НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СоздатьЗаказыНаПеремещение(Команда)    
	
	Если не ЗначениеЗаполнено(Организация)
		или не ЗначениеЗаполнено(СкладОтправитель)
		или не ЗначениеЗаполнено(СкладПолучательСоздание)
		или тчСозданиеЗаказовНаПеремещение.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены обязательные поля. Создание документов `Заказ на перемещение` невозможно. Заполните обязательные поля и повторите создание документов");
		Возврат;
	КонецЕсли;
	Если СкладОтправитель = СкладПолучательСоздание Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Склад отправитель равен складу получателю");
		Возврат;
	КонецЕсли;
	
	СозданныеДокументыЗаказНаПеремещение.Очистить(); 
	
	СоздатьЗаказыНаПеремещениеНаСервере();  
	
	Элементы.грСозданныеЗаказыНаПеремещение.Заголовок = СтрШаблон("Созданные документы (%1)", СозданныеДокументыЗаказНаПеремещение.Количество());
    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формирование заказов на перемещение завершено");

КонецПроцедуры                           

&НаСервере
Процедура СоздатьЗаказыНаПеремещениеНаСервере()
	
	ТекДата = ТекущаяДатаСеанса();
	
	Для каждого стр из тчСозданиеЗаказовНаПеремещение Цикл
		Если Не ЗначениеЗаполнено(стр.Номенклатура) или стр.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Док = Документы.ЗаказНаПеремещение.СоздатьДокумент();
		Док.Дата = ТекДата;
		Док.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний"); 
		Док.Организация = Организация;
		Док.СкладОтправитель = СкладОтправитель;
		Док.СкладПолучатель = СкладПолучательСоздание; 
		Док.Автор = Пользователи.АвторизованныйПользователь();     
		Док.Ответственный = Док.Автор;
		Док.Подразделение = Док.Автор.Подразделение;
		Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		Док.ДлительностьПеремещения = 1;
		Док.ИспользоватьДлительностьПеремещения = Истина;
		Док.ПеремещениеПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Док.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
		Док.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт;  
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		
		нов = Док.Товары.Добавить();
		нов.Номенклатура =  стр.Номенклатура;
		нов.Характеристика = стр.Характеристика;
		нов.КоличествоУпаковок = стр.КоличествоУпаковок;
		нов.Количество = стр.Количество; 
		Если стр.Упаковка <> нов.Номенклатура.ЕдиницаИзмерения Тогда
			нов.Упаковка = стр.Упаковка;
		КонецЕсли;
		нов.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;   
		нов.КодСтроки =  Док.Товары.Количество();
		нов.Обособленно = Истина;
		
		// Дата отгрузки	
		// Рассчитывается как сумма сроков схемы обеспечения для цепочки перемещений и производства номенклатуры 
		// до ее обеспечения на складе - получателе. 
        // Например, в схеме обеспечения:
		// "Перемещение с цеховой кладовой" - 2 дня
        // "Производство" -  10 дней. 
        // Необходимо прибавить к "текущей дате" 10 + 2 дня и вписать значение рассчитанной даты.
		нов.НачалоОтгрузки = Док.Дата + 86400 * ПолучитьДлительностьОбеспечения(нов.Номенклатура.СхемаОбеспечения, Док.СкладПолучатель);
		
		Док.МаксимальныйКодСтроки = Док.Товары.Количество();
		
		новДок = СозданныеДокументыЗаказНаПеремещение.Добавить();
		Попытка 
			Док.Записать(РежимЗаписиДокумента.Проведение);  
			новДок.Проведен = Истина;
		Исключение  
			Док.Записать();
			Причина = "" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("не удалось записать Заказ на перемещение " 
																+ Док.Ссылка, Док.Ссылка 
																+ " по причине "
																+ Причина);
			новДок.Комментарий = Причина;	
		КонецПопытки;														
		новДок.Документ = Док.ссылка;
			
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура тчСозданиеЗаказовНаПеремещениеНоменклатураПриИзменении(Элемент)
	
	ТД = Элементы.тчСозданиеЗаказовНаПеремещение.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТД.Упаковка = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТД.Номенклатура, "ЕдиницаИзмерения");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДлительностьОбеспечения(СхемаОбеспечения, Склад)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СхемыОбеспечения.СпособОбеспеченияПотребностей.ИсточникОбеспеченияПотребностей КАК Источник,
	                      |	СхемыОбеспечения.СпособОбеспеченияПотребностей.ТипОбеспечения КАК ТипОбеспечения,
	                      |	СхемыОбеспечения.СпособОбеспеченияПотребностей.СрокИсполненияЗаказа КАК Срок
	                      |ИЗ
	                      |	РегистрСведений.СхемыОбеспечения КАК СхемыОбеспечения
	                      |ГДЕ
	                      |	СхемыОбеспечения.Склад = &Склад
	                      |	И СхемыОбеспечения.СхемаОбеспечения = &СхемаОбеспечения");
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СхемаОбеспечения", СхемаОбеспечения);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Срок = Результат.Срок;
		ТипОбеспечения = Результат.ТипОбеспечения; 
		Источник = Результат.Источник;
	Иначе
		Срок = 0; 
		ТипОбеспечения = Неопределено;
		Источник = Неопределено; 
	КонецЕсли;
	
	Если ТипОбеспечения = Перечисления.ТипыОбеспечения.Перемещение Тогда
		Запрос.УстановитьПараметр("Склад", Источник);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
    		Срок = Срок + Результат.Срок;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Срок;
	
КонецФункции

&НаКлиенте
Процедура тчСозданиеЗаказовНаПеремещениеКоличествоПриИзменении(Элемент)
	
	ТД = Элементы.тчСозданиеЗаказовНаПеремещение.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТД.Упаковка) Тогда
		стрРеквизитовУпаковки = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(ТД.Упаковка, "Числитель, Знаменатель");       
		Если стрРеквизитовУпаковки.Знаменатель =0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В выбранной единице измерения некорректно задан реквизит Знаменатель");
			Коэффициент = 1;
		ИначеЕсли стрРеквизитовУпаковки.Числитель =0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В выбранной единице измерения некорректно задан реквизит Числитель");
			Коэффициент = 1;
		Иначе
			Коэффициент = стрРеквизитовУпаковки.Числитель / стрРеквизитовУпаковки.Знаменатель;
		КонецЕсли;
	иначе
		Коэффициент = 1;
	КонецЕсли;
	ТД.КоличествоУпаковок = ТД.Количество / Коэффициент;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти