#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
// Функция регистрирует событие мдм.
// 
// Параметры:
//  Объект 		   		 - СправочникСсылка.бит_мдм_ОбъектОбмена, СправочникСсылка.бит_мдм_ОбъектОбменаИерархияДанных
//  ВходящееСобытие 	 - Строка, ПеречислениеСсылка.бит_мдм_События
//  ВходящийПользователь - СправочникСсылка.Пользователи
//  Комментарий    		 - Строка.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция Зарегистрировать(Объект, ВходящееСобытие, Комментарий = "", ВходящийПользователь = Неопределено ) Экспорт

	РезультатВыполнено = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ВходящийПользователь) Тогда		
		ТекПользователь = Пользователи.ТекущийПользователь();		
	Иначе		
		ТекПользователь = ВходящийПользователь;		
	КонецЕсли; 
	
	Если ТипЗнч(ВходящееСобытие) = Тип("Строка") Тогда		
		ТекСобытие = Перечисления.бит_мдм_События[ВходящееСобытие];		
	Иначе		
		ТекСобытие = ВходящееСобытие;		
	КонецЕсли; 
	
	Менеджер = РегистрыСведений.бит_мдм_СобытияОбъектов.СоздатьМенеджерЗаписи();
	Менеджер.Период       = ТекущаяДата();
	Менеджер.Объект       = Объект;
	Менеджер.Пользователь = ТекПользователь;
	Менеджер.Событие      = ТекСобытие;
	Менеджер.Комментарий  = Комментарий;
	
	Попытка
		
		Менеджер.Записать();
		РезультатВыполнено = Истина;
		
	Исключение
		
		ТекстСообщения = НСтр("ru='Не удалось зарегистрировать событие %1 для объекта %2. Описание ошибки: %3'; 
							  |en='Failed to register event %1 for the object %2. Error description: %3'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекСобытие, Объект, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("МДМ.РегистрацияСобытия",
								 УровеньЖурналаРегистрации.Ошибка, 
								 Метаданные.РегистрыСведений.бит_мдм_СобытияОбъектов, 
								 ТекстСообщения);
		
	КонецПопытки;

	Возврат РезультатВыполнено;
	
КонецФункции // Зарегистрировать()

#КонецОбласти

#КонецЕсли
