
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого ТекРегистр Из Параметры.Регистры Цикл
		
		СписокРегистров.Добавить(ТекРегистр.Имя, ТекРегистр.Синоним, ТекРегистр.Отображение);
		
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает значение флажка в таблице в нужное состояние.
// 
// Параметры:
// 	ИмяТаблицы - строка - имя таблицы.
// 	ЗначениеФлажка - булево.
// 
&НаКлиенте
Процедура ИзменитьФлажки(ЗначениеФлажка)
	
	Для Каждого ТекСтрока Из СписокРегистров Цикл
		
		ТекСтрока.Пометка = ЗначениеФлажка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ИзменитьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ИзменитьФлажки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("СписокРегистров", СписокРегистров);
	
	Закрыть(СтруктураРезультат);
	
КонецПроцедуры
