
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если бит_НастройкиДоступностиЭлементовФормКлиентСервер.ФормаПодготовлена(ЭтотОбъект) Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_НастройкиДоступностиЭлементовФорм.ПриСозданииНаСервере(ЭтотОбъект, СтандартнаяОбработка, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
		
	// Стандартные действия при создании на сервере
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ВзаиморасчетыСервер.ФормаПриСозданииНаСервере(ЭтотОбъект);
	
	Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования);
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(); 	
	
	// Настроим отображение полей доп. аналитик в табличном поле ТаблицаПозиции.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект,
								"ТаблицаПозиции", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	
	ХозОперацияУП = ХозяйственнаяОперацияУП();

	УстановитьОтборПозиций();
	
	Если ЗначениеЗаполнено(Объект.ХозяйственнаяОперация) Тогда
		УстановитьОтборыОрганизацииПолучателя();
	КонецЕсли; 
	
	УстановитьПараметрыВыбораВидаОперации(ЭтотОбъект);
	ЗаполнитьКонтролируемыеРеквизиты(ЭтотОбъект);
	
	ПодготовитьФормуНаСервере(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		 И ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ПодключитьОбработчикОжидания("ОжиданиеОткрытияФормы", 0.1, Истина);
	КонецЕсли; 
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойств
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если КопироватьПозиции Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗначениеКопирования", ЗначениеКопирования);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьОтборПозиций();	
	Элементы.ТаблицаПозиции.Обновить();
	
	ПодготовитьФормуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПараметрПередачи = Новый Структура("Ссылка, Важность, Сумма", Объект.Ссылка
																, Объект.Важность
																, Объект.СуммаДокумента);
	Оповестить("бит_ИзменениеДокументаПереводДСВДругуюОрганизацию", ПараметрПередачи, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатус" Тогда
		ОбработкаОповещенияИзмененияСтатуса();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	бит_КазначействоКлиент.ОбработкаОповещенияФормыДокумента(ЭтотОбъект, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	Открытьформу("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ХозяйственнаяОперация) Тогда
		Объект.ХозяйственнаяОперация = КонтролируемыеРеквизиты.ХозяйственнаяОперация;
	КонецЕсли; 
	
	Если Объект.ХозяйственнаяОперация <> КонтролируемыеРеквизиты.ХозяйственнаяОперация Тогда
		ХозяйственнаяОперацияПриИзмененииНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	ПересчитатьРеквизитыУчетаНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьРеквизитыУчетаНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ИзменениеВалюты", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Изменена валюта документа. Пересчитать сумму в документе?';
						|en='Change Currency document. Calculate the amount of paper?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте 
Процедура ИзменениеВалюты(Ответ, ДополнительныеДанные) Экспорт
	
	ЕстьПозиции = ИзменениеВалютыСервер();
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если ЗначениеЗаполнено(КонтролируемыеРеквизиты.ВалютаДокумента) Тогда
			ПараметрыТекущегоКурса = Новый Структура; 
			ПараметрыТекущегоКурса.Вставить("Валюта", 	КонтролируемыеРеквизиты.ВалютаДокумента);
			ПараметрыТекущегоКурса.Вставить("Курс",		КонтролируемыеРеквизиты.КурсДокумента);
			ПараметрыТекущегоКурса.Вставить("Кратность",КонтролируемыеРеквизиты.КратностьДокумента);
			
			ПараметрыНовогоКурса = Новый Структура; 
			ПараметрыНовогоКурса.Вставить("Валюта",	  Объект.ВалютаДокумента);
			ПараметрыНовогоКурса.Вставить("Курс",	  Объект.КурсДокумента);
			ПараметрыНовогоКурса.Вставить("Кратность",Объект.КратностьДокумента);
			
			Объект.СуммаДокумента = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Объект.СуммаДокумента, 
										ПараметрыТекущегоКурса, ПараметрыНовогоКурса);
			
			Если ЕстьПозиции Тогда
				Записать();
			КонецЕсли; 																		  
		КонецЕсли; // пересчитать
	КонецЕсли; 
	
	УправлениеЭлементамиФормы();
	
	ОбновитьКонтролируемыеРеквизиты("ВалютаДокумента", ЭтотОбъект);
	ОбновитьКонтролируемыеРеквизиты("КратностьДокумента", ЭтотОбъект);
	ОбновитьКонтролируемыеРеквизиты("КурсДокумента", ЭтотОбъект);
	
КонецПроцедуры // ИзменениеВалюты

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВзаиморасчетыКлиент.ОбъектРасчетовНачалоВыбора(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ОбъектРасчетов = ВыбранноеЗначение.ОбъектРасчетов;
	Иначе
		ОбъектРасчетов = Неопределено;
	КонецЕсли;

	Если ЗначениеЗаполнено(ОбъектРасчетов) Тогда
		Объект.ОбъектРасчетов = ОбъектРасчетов;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СверхБюджетаПриИзменении(Элемент)
	
	Если НЕ Объект.СверхБюджета Тогда
		Объект.СписатьЛимиты = Ложь;	
	КонецЕсли;
	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПозиции

&НаКлиенте
Процедура ТаблицаПозицииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		СтандартнаяОбработка = Ложь;
		ПредложитьЗаписатьДокумент();
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПлатежныйДокумент(Команда)
	
	ПлатежныйДокумент = СоздатьПлатежныйДокументСервер();
	
	Для каждого Док Из ПлатежныйДокумент Цикл
		ПоказатьЗначение(, Док);
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемыСвойства

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти  

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ХозОперацияУП(Операция)

	Если ЗначениеЗаполнено(Операция) Тогда
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Операция, "ВидОперации");
	Иначе	
		ВидОперации = Перечисления.ХозяйственныеОперации.ПустаяСсылка();
	КонецЕсли;

	Возврат ВидОперации;
	
КонецФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	КэшЗначений = Новый Структура;
	
	КэшЗначений.Вставить("ИзмеренияДоп"      , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним"));
	КэшЗначений.Вставить("НастройкиИзмерений", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));

	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

// Процедура управляет видимостью/доступностью элементов формы. 
//
&НаСервере
Процедура УправлениеЭлементамиФормы()

	бит_НастройкиДоступностиЭлементовФорм.РазблокироватьЭлементы(ЭтотОбъект);
	
	ЭтоНовый = ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), Истина, Ложь);
	
	Элементы.ГруппаИнфоПлатежи.Видимость = ЭтоНовый;
	
	Если ХозОперацияУП = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств") Тогда 
		Элементы.ОбъектРасчетов.Видимость = Ложь;
	Иначе 
		Элементы.ОбъектРасчетов.Видимость = Истина;
	КонецЕсли;	
	
	ОтображатьНДС    = ОперацияУчитываетНДС();
	Элементы.СтавкаНДС.Видимость = ОтображатьНДС;
	Элементы.СуммаНДС.Видимость  = ОтображатьНДС;
	
	Элементы.КурсДокумента.Видимость = (Объект.ВалютаДокумента <> ВалютаРеглУчета);
	
	Элементы.ФормаСоздатьПлатежныйДокумент.Доступность =
		(ТипСтатуса = Перечисления.бит_ТипыСтатусовОбъектов.Утвержден
			ИЛИ ТипСтатуса = Перечисления.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен);
	
	Элементы.СписатьЛимиты.Видимость   = НеУчитыватьСверхБюджета;
	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;
	
	Элементы.ГруппаДекорацияПредупреждения.Видимость = ЗаявкаВключенаВРеестр;
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаблокироватьЭлементы(ЭтотОбъект);
	
КонецПроцедуры

// Процедура заполняет список выбора элемента Операция доступными видами операций. 
//
&НаСервере
Процедура СформироватьСписокВыбораХозОпераций(Отказ)

	//Элементы.ХозяйственнаяОперация.СписокВыбора.Очистить();
	//
	//ВыдачаДоступна   = ПолучитьФункциональнуюОпцию("ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс");
	//ПередачаМеждуОрг = ПолучитьФункциональнуюОпцию("ИспользоватьПередачиТоваровМеждуОрганизациями");
	//
	//ВидыОпераций = Новый СписокЗначений();
	//Если ВыдачаДоступна Тогда
	//	
	//	Если бит_УправлениеДоступомБФУП.СсылкаДоступна(ПредопределенноеЗначение("Справочник.бит_СтатьиОборотов.ВнутренняяПередачаДС_расходование"))
	//		И бит_УправлениеДоступомБФУП.СсылкаДоступна(ПредопределенноеЗначение("Справочник.бит_СтатьиОборотов.ВнутренняяПередачаДС_поступление")) Тогда
	//		
	//		ВидыОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств);
	//		
	//	КонецЕсли;	
	//	
	//КонецЕсли; 
	//Если ПередачаМеждуОрг Тогда
	//	
	//	Если бит_УправлениеДоступомБФУП.СсылкаДоступна(ПредопределенноеЗначение("Справочник.бит_СтатьиОборотов.ОплатаВДругуюОрганизацию_Расходование"))
	//		И бит_УправлениеДоступомБФУП.СсылкаДоступна(ПредопределенноеЗначение("Справочник.бит_СтатьиОборотов.ОплатаВДругуюОрганизацию_Поступление")) Тогда
	//		  
	//		ВидыОпераций.Добавить(Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию);
	//		
	//	КонецЕсли;	
	//	
	//	Если бит_УправлениеДоступомБФУП.СсылкаДоступна(ПредопределенноеЗначение("Справочник.бит_СтатьиОборотов.ОплатаВДругуюОрганизацию_Расходование"))
	//		И бит_УправлениеДоступомБФУП.СсылкаДоступна(ПредопределенноеЗначение("Справочник.бит_СтатьиОборотов.ОплатаВДругуюОрганизацию_Поступление")) Тогда
	//		  
	//		ВидыОпераций.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию);
	//		
	//	КонецЕсли;	
	//
	//КонецЕсли; 
	//
	//Если ВидыОпераций.Количество() = 0 Тогда
	//	ТекстСообщения = НСтр("ru='Отсутствуют доступные Статьи оборотов. Дествие отменено.';
	//						  |en='There are no available Article speed. Destve canceled.'"); 
	//	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ХозяйственнаяОперация",, Отказ);
	//КонецЕсли; 
	//
	//МассивПараметров = Новый Массив();
	//МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ВидОперации", ВидыОпераций));
	//МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь));
	//НовыеПараметры = Новый ФиксированныйМассив(МассивПараметров);
	//Элементы.ХозяйственнаяОперация.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры // СформироватьСписокВыбораХозОпераций()

// Процедура устанавливает отбор у динамического списка. 
//
&НаСервере
Процедура УстановитьОтборПозиций()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТаблицаПозиции, "ДокументПланирования", 
		Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,, Истина, 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный); 

КонецПроцедуры // УстановитьОтборПозиций()

// Функция создает платежный документ на основании документа передачи ДС.
//
// Возвращаемое значение:
//  ПлатежныйДокумент - Массив.
//
&НаСервере
Функция СоздатьПлатежныйДокументСервер()
	
	ПараметрыДокумента = бит_Казначейство.НовыеПараметрыСозданияПлатежногоДокумента();
	ПараметрыДокумента.ДокументОснование = Объект.Ссылка;
	ПараметрыДокумента.ДатаДокумента     = ТекущаяДатаСеанса();
	
	ПлатежныйДокумент = Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.СоздатьПлатежныйДокументНаОсновании(ПараметрыДокумента);
	
	Возврат ПлатежныйДокумент;
	
КонецФункции // СоздатьПлатежныйДокументСервер()

// Процедура устанавливает отбор для организации получателя.
//
&НаСервере
Процедура УстановитьОтборыОрганизацииПолучателя()

	Если Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВнутренняяПередачаДенежныхСредств Тогда
	
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ГоловнаяОрганизация", "Объект.Организация");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.ОрганизацияПолучатель.СвязиПараметровВыбора = НовыеСвязи;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ОбособленноеПодразделение", ИСТИНА);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.ОрганизацияПолучатель.ПараметрыВыбора = НовыеПараметры;
		
	Иначе
		
		НовыеСвязи = Новый ФиксированныйМассив(Новый Массив());
		Элементы.ОрганизацияПолучатель.СвязиПараметровВыбора = НовыеСвязи;
		
		НовыеПараметры = Новый ФиксированныйМассив(Новый Массив());
		Элементы.ОрганизацияПолучатель.ПараметрыВыбора = НовыеПараметры;
		
	КонецЕсли; 

КонецПроцедуры // УстановитьОтборыОрганизацииПолучателя()

// Функция обрабатывает изменение валюты документа
//
// Возвращаемое значение
// 	Булево				
//
&НаСервере
Функция ИзменениеВалютыСервер()
	
	Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.ПриИзмененииВалютыДокумента(Объект, Объект.Дата);
	
	//ищем есть ли созданная позиция для документа
	ПлатежнаяПозиция = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(Объект.Ссылка);
	Если ЗначениеЗаполнено(ПлатежнаяПозиция.Позиция) Тогда
		Возврат Истина; 
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции // ИзменениеВалютыСервер()

// Процедура заполняет сценарий при изменении поля документа. 
// 
// Параметры: Имя - Строка
//
&НаСервере
Процедура ЗаполнитьСценарий(Имя)

	СтруктураПараметров = Новый Структура;
	Если Имя = "Организация" Тогда
		
		СтруктураПараметров.Вставить("Организация", Объект.Организация);
		
	ИначеЕсли Имя = "ЦФО" Тогда 	
		
		СтруктураПараметров.Вставить("ЦФО", Объект.ЦФО);
		
	КонецЕсли; 
	
	КонтролироватьЗаявку = бит_НастройкиПрограммы.КонтролироватьЗаявкуПоБюджету(СтруктураПараметров, Объект.Дата);
	Сценарий 			 = бит_НастройкиПрограммы.КазначействоСценарийКонтроляПоБюджету(СтруктураПараметров, Объект.Дата);

	Если ЗначениеЗаполнено(Сценарий) И КонтролироватьЗаявку Тогда
	
		Объект.Сценарий = Сценарий;
	
	КонецЕсли; 

КонецПроцедуры // ЗаполнитьСценарий()

//  Процедура обработчик-ожидания открытия формы. 
//
&НаКлиенте
Процедура ОжиданиеОткрытияФормы()
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьКопирование",ЭтотОбъект);
	ТекстВопроса =  НСтр("ru='Выполнить копирование и записать документ?';en='Make a copy and write the document?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте 
Процедура ВыполнитьКопирование(Ответ, ДополнительныеДанные) Экспорт
	
	КопироватьПозиции = ?(Ответ = КодВозвратаДиалога.Да, Истина, Ложь);
	
	Если КопироватьПозиции Тогда
		Записать();
		КопироватьПозиции = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКопирование

&НаСервере
Функция ОперацияУчитываетНДС()
	
	Возврат НЕ бит_Казначейство.ОперацияБезНДС(Объект.ХозяйственнаяОперация);
	
КонецФункции

&НаСервере
Процедура ПересчитатьРеквизитыУчетаНДС(ИзменятьСтавку = Ложь)
	
	Если ОперацияУчитываетНДС()	Тогда
		Если ИзменятьСтавку И НЕ ЗначениеЗаполнено(Объект.СтавкаНДС) Тогда
			Объект.СтавкаНДС = бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
		КонецЕсли;
		СтавкаНДС = бит_СтавкиНДС.ЗначениеСтавкиНДС(Объект.СтавкаНДС);
		Объект.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(Объект.СуммаДокумента, СтавкаНДС, Истина);
	Иначе
		Объект.СтавкаНДС = бит_СтавкиНДС.СтавкаНДСПустая();
		Объект.СуммаНДС  = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьПараметрыВыбораВидаОперации(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	НовыеПараметры = Новый Массив; 
	НовыеПараметры.Добавить(Новый ПараметрВыбора("Отбор.ФормаОплаты", Объект.ФормаОплаты));
	НовыеПараметры.Добавить(Новый ПараметрВыбора("Отбор.ТипДокумента", ТипЗнч(Объект.Ссылка)));
	
	Элементы.ХозяйственнаяОперация.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ЗаполнитьКонтролируемыеРеквизиты(Форма)
	
	НаборРеквизитов = Новый Структура;
	НаборРеквизитов.Вставить("ВалютаДокумента");
	НаборРеквизитов.Вставить("КурсДокумента");
	НаборРеквизитов.Вставить("КратностьДокумента");
	//НаборРеквизитов.Вставить("ОбъектРасчетов");
	//НаборРеквизитов.Вставить("Организация");
	//НаборРеквизитов.Вставить("БанковскийСчет");
	НаборРеквизитов.Вставить("ФормаОплаты");
	НаборРеквизитов.Вставить("ХозяйственнаяОперация");

	ЗаполнитьЗначенияСвойств(НаборРеквизитов, Форма.Объект);
	
	Форма.КонтролируемыеРеквизиты = Новый ФиксированнаяСтруктура(НаборРеквизитов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ОбновитьКонтролируемыеРеквизиты(ИмяРеквизита, Форма)
	
	НаборРеквизитов = Новый Структура;
	Для каждого КлючЗначение Из Форма.КонтролируемыеРеквизиты Цикл
		НаборРеквизитов.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла; 
	НаборРеквизитов.Вставить(ИмяРеквизита, Форма.Объект[ИмяРеквизита]);
	
	Форма.КонтролируемыеРеквизиты = Новый ФиксированнаяСтруктура(НаборРеквизитов);	
	
КонецПроцедуры

&НаСервере
Процедура ФормаОплатыПриИзмененииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ФормаОплаты) Тогда
		Объект.ФормаОплаты = КонтролируемыеРеквизиты.ФормаОплаты; 
	КонецЕсли; 

	Если КонтролируемыеРеквизиты.ФормаОплаты = Объект.ФормаОплаты Тогда
		Возврат;
	КонецЕсли; 

	УстановитьПараметрыВыбораВидаОперации(ЭтотОбъект);
	
	ДоступныеЗначения = ДоступныеЗначенияВидовОпераций();
	Если ДоступныеЗначения.НайтиПоЗначению(Объект.ХозяйственнаяОперация) = Неопределено Тогда
		Объект.ХозяйственнаяОперация = ДоступныеЗначения[0].Значение;
		ХозяйственнаяОперацияПриИзмененииНаСервере();
	Иначе
		ЗаполнитьКонтролируемыеРеквизиты(ЭтотОбъект);
		УправлениеЭлементамиФормы();
	КонецЕсли; 
	
КонецПроцедуры
 
&НаСервере
Функция ДоступныеЗначенияВидовОпераций()
	
	Модуль = Перечисления.бит_ВидыОперацийКазначейства;
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("ФормаОплаты", Объект.ФормаОплаты);
	ПараметрыПередачи.Вставить("ТипДокумента", ТипЗнч(Объект.Ссылка));
	
	Возврат Модуль.ПолучитьДоступныеЗначения(ПараметрыПередачи).ДоступныеЗначения;
	
КонецФункции

&НаСервере
Процедура ХозяйственнаяОперацияПриИзмененииНаСервере()
	
	ХозОперацияУП = ХозяйственнаяОперацияУП();
	Если ХозОперацияУП = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств") Тогда 
		Объект.ОбъектРасчетов = Неопределено;
	КонецЕсли;	
	
	ПересчитатьРеквизитыУчетаНДС(Истина);
	
	УстановитьОтборыОрганизацииПолучателя();
	УправлениеЭлементамиФормы();
	ОбновитьКонтролируемыеРеквизиты("ХозяйственнаяОперация", ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ХозяйственнаяОперацияУП()

	Возврат бит_Казначейство.ХозяйственнаяОперацияУП(Объект.ХозяйственнаяОперация);
	
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере(СтандартнаяОбработка = Ложь)

	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ПолучитьФункциональнуюОпцию("бит_ЗапретитьИзменениеЗаявкиВключеннойВРеестр") Тогда
			ЗаявкаВключенаВРеестр = бит_Казначейство.ЗаявкаВключенаВРеестр(Объект.Ссылка);
		Иначе
			ЗаявкаВключенаВРеестр = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	УстановитьСостояниеДокумента();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеУчитыватьСверхБюджета(Организация, ЦФО, Период)

	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("Организация", Организация);
	ПараметрыНастройки.Вставить("ЦФО",		   ЦФО);
								
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету(ПараметрыНастройки, 
									Период);
	Возврат НеУчитыватьСверхБюджета;
	
КонецФункции

&НаСервере 
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗаполнитьСценарий("Организация");
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере 
Процедура ДатаПриИзмененииНаСервере()
	
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаписатьДокумент()

	Оповещение 	   = Новый ОписаниеОповещения("ПредложитьЗаписатьДокументЗавершение", ЭтотОбъект);
	ТекстСообщения = НСтр("ru = 'Документ изменен. Для отражения изменений в связанных позициях необходимо записать документ.'; 
							|en = 'The document has been changed. To reflect changes in related items, you need to write a document.'");

	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте
Процедура ПредложитьЗаписатьДокументЗавершение(Результат, Дополнительно) Экспорт

	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	

	Попытка
		Записать();		
	Исключение
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки; 

	Если Элементы.ТаблицаПозиции.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Элементы.ТаблицаПозиции.ТекущаяСтрока));
	
КонецПроцедуры

#КонецОбласти