
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбщиеНастройки

&НаКлиенте
Процедура ОткрытьУчетнуюПолитикуМСФО(Команда)

	ОткрытьФорму("РегистрСведений.бит_му_УчетнаяПолитика.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТипыПроводок(Команда)
	
	ОткрытьФорму("Справочник.бит_ТипыПроводок.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВалютныеНеденежныеСтатьи(Команда)
	
	ПараметрыФормы = Новый Структура("РФ_РегистрБухгалтерии", ПолучитьОбъектДоступаРегистрМСФО());
	ОткрытьФорму("РегистрСведений.бит_ВалютныеНеденежныеСтатьи.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПланСчетовМеждународный(Команда)
	
	ОткрытьФорму("ПланСчетов.бит_Дополнительный_2.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыСубконтоМеждународные(Команда)
	
	ОткрытьФорму("ПланВидовХарактеристик.бит_ВидыСубконтоДополнительные_2.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область РазнесениеСальдоАктивноПассивныхСчетов

&НаКлиенте
Процедура ОткрытьНастройкиРазнесениеСальдо(Команда)
	
	ОткрытьФорму("Справочник.бит_му_НастройкиРазнесенияСальдо.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНазначенияНастроекРазнесениеСальдо(Команда)
	
	ОткрытьФорму("РегистрСведений.бит_му_НастройкиРасчетаОтложенныхНалогов.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОтложенныеНалоги

&НаКлиенте
Процедура ОткрытьВидыАктивовОбязательств(Команда)
	
	ОткрытьФорму("Справочник.бит_му_ВидыАктивовОбязательств.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиРасчетаОтложенныхНалогов(Команда)
	
	ОткрытьФорму("РегистрСведений.бит_му_НастройкиРасчетаОтложенныхНалогов.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ЗакрытиеСчетов

&НаКлиенте
Процедура ОткрытьВидыЗакрытияСчетов(Команда)
	
	ОткрытьФорму("Справочник.бит_ВидыЗакрытияСчетов.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиЗакрытия(Команда)
	
	ОткрытьФорму("Справочник.бит_НастройкиЗакрытия.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНазначениеАлгоритмовЗакрытия(Команда)
	
	ОткрытьФорму("РегистрСведений.бит_НазначениеАлгоритмовЗакрытия.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ФинансовыеИнструменты

&НаКлиенте
Процедура ОткрытьРыночныеСтавкиКредитыЗаймы(Команда)
	
	ОткрытьФорму("Справочник.бит_му_РыночныеСтавкиКредитыЗаймы.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПериодыПросрочкиДебиторскойЗадолженности(Команда)
	
	ОткрытьФорму("РегистрСведений.бит_му_ПериодыПросрочкиДебиторскойЗадолженности.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыДополнительныхСтавок(Команда)
	
	ОткрытьФорму("Справочник.бит_му_ВидыДополнительныхСтавок.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДополнительныеСтавки(Команда)
	
	ОткрытьФорму("РегистрСведений.бит_му_ДополнительныеСтавки.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область МПЗ

&НаКлиенте
Процедура ОткрытьСчетаУчетаНоменклатуры(Команда)
	
	ОткрытьФорму("РегистрСведений.бит_му_СчетаУчетаНоменклатуры.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыРасчетаРезервовМПЗ(Команда)
	
	ОткрытьФорму("РегистрСведений.бит_му_ПараметрыРасчетаРезервовМПЗ.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры
	
#КонецОбласти

#Область ПрочиеНастройки

&НаКлиенте
Процедура ОткрытьВидыРБП(Команда)
	
	ОткрытьФорму("Справочник.бит_му_ВидыРБП.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыЗатрат(Команда)
	
	ОткрытьФорму("Справочник.бит_му_ВидыЗатрат.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКурсыВалютОтчетности(Команда)
	
	ОткрытьФорму("РегистрСведений.бит_КурсыВалютОтчетности.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСчетаРасчетовСКонтрагентами(Команда)
	
	ОткрытьФорму("РегистрСведений.бит_му_СчетаРасчетовСКонтрагентами.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьОбъектДоступаРегистрМСФО()
	
	МетаРегистрМСФО = Метаданные.РегистрыБухгалтерии.бит_Дополнительный_2;
	ОбъектРегистрМСФО = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаРегистрМСФО);
	
	Возврат ОбъектРегистрМСФО;
	
КонецФункции // ПолучитьОбъектДоступаРегистрМСФО()

#КонецОбласти
