
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресТЗОперации") Тогда
		
		Операции = ПолучитьИзВременногоХранилища(Параметры.АдресТЗОперации);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Операции.Подразделение КАК Подразделение,
		|	Операции.Этап КАК Этап,
		|	Операции.Операция КАК Операция,
		|	Операции.ИдентификаторОперации КАК ИдентификаторОперации,
		|	Операции.СменноеЗадание КАК СменноеЗадание,
		|	Операции.Исполнитель КАК Исполнитель,
		|	Операции.РабочийЦентр КАК РабочийЦентр,
		|	Операции.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	Операции.НазначатьНеРанее КАК НазначатьНеРанее,
		|	Операции.Порядок КАК Порядок
		|ПОМЕСТИТЬ ВТОперацииНазначение
		|ИЗ
		|	&Операции КАК Операции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОперацииНазначение.Подразделение КАК Подразделение,
		|	ОперацииНазначение.Этап КАК Этап,
		|	ОперацииНазначение.Операция КАК Операция,
		|	ОперацииНазначение.ИдентификаторОперации КАК ИдентификаторОперации,
		|	ОперацииНазначение.СменноеЗадание КАК СменноеЗадание,
		|	ОперацииНазначение.Исполнитель КАК Исполнитель,
		|	ОперацииНазначение.РабочийЦентр КАК РабочийЦентр,
		|	ОперацииНазначение.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ОперацииНазначение.НазначатьНеРанее КАК НазначатьНеРанее,
		|	ЕСТЬNULL(ОперацииКСозданиюСменныхЗаданий.Количество, 1) КАК Количество,
		|	ОперацииКСозданиюСменныхЗаданий.ВремяШтучное КАК ВремяШтучное,
		|	ОперацииКСозданиюСменныхЗаданий.ВремяПЗ КАК ВремяПЗ,
		|	ОперацииКСозданиюСменныхЗаданий.ВремяЕдИзм КАК ВремяЕдИзм,
		|	ОперацииКСозданиюСменныхЗаданий.МожноНазначать КАК МожноНазначать,
		|	ОперацииКСозданиюСменныхЗаданий.НужноНазначать КАК НужноНазначать,
		|	ОперацииКСозданиюСменныхЗаданий.НарушенПорядокНазначения КАК НарушенПорядокНазначения,
		//|	ОперацииКСозданиюСменныхЗаданий.бит_КоличествоХодовОперация КАК бит_КоличествоХодовОперация,
		|	ОперацииКСозданиюСменныхЗаданий.Распоряжение КАК Распоряжение,
		|	ОперацииКСозданиюСменныхЗаданий.НомерОперации КАК НомерОперации,
		|	ОперацииКСозданиюСменныхЗаданий.НомерСледующейОперации КАК НомерСледующейОперации,
		|	ОперацииКСозданиюСменныхЗаданий.Порядок КАК ПорядокСтарый,
		|	ОперацииНазначение.Порядок КАК ПорядокНовый,
		|	ОперацииКСозданиюСменныхЗаданий.Этап.Спецификация.ОсновноеИзделиеНоменклатура КАК ВыходноеИзделие,
		|	ЭтапыПроизводства.Ссылка КАК Ссылка,
		|	ТехнологическиеОперации.бит_КодОперации КАК бит_КодОперации
		|ИЗ
		|	ВТОперацииНазначение КАК ОперацииНазначение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК ОперацииКСозданиюСменныхЗаданий
		|		ПО ОперацииНазначение.Подразделение = ОперацииКСозданиюСменныхЗаданий.Подразделение
		|			И ОперацииНазначение.Этап = ОперацииКСозданиюСменныхЗаданий.Этап
		|			И ОперацииНазначение.Операция = ОперацииКСозданиюСменныхЗаданий.Операция
		|			И ОперацииНазначение.ИдентификаторОперации = ОперацииКСозданиюСменныхЗаданий.ИдентификаторОперации
		|			И ОперацииНазначение.СменноеЗадание = ОперацииКСозданиюСменныхЗаданий.СменноеЗадание
		|			И ОперацииНазначение.Исполнитель = ОперацииКСозданиюСменныхЗаданий.Исполнитель
		|			И ОперацииНазначение.РабочийЦентр = ОперацииКСозданиюСменныхЗаданий.РабочийЦентр
		|			И ОперацииНазначение.ВидРабочегоЦентра = ОперацииКСозданиюСменныхЗаданий.ВидРабочегоЦентра
		|			И ОперацииНазначение.НазначатьНеРанее = ОперацииКСозданиюСменныхЗаданий.НазначатьНеРанее
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|			ПО ЭтапыПроизводства.Ссылка = ТехнологическиеОперации.Владелец
		|				И (ТехнологическиеОперации.НомерСледующейОперации = 0)
		|		ПО (ОперацииКСозданиюСменныхЗаданий.Этап.Спецификация = ЭтапыПроизводства.Владелец)
		|			И (ЭтапыПроизводства.НомерСледующегоЭтапа = 0)");
		
		Запрос.УстановитьПараметр("Операции", Операции);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Заказ = Выборка.Распоряжение;
			Этап = Выборка.Этап;
			ВыходноеИзделие = Выборка.ВыходноеИзделие;
			ТекущееОборудование = Выборка.ВидРабочегоЦентра;
			КоличествоКВыпуску = Выборка.Количество;
			Время = Выборка.ВремяШтучное * Выборка.Количество;
			//КоличествоХодов = Выборка.бит_КоличествоХодовОперация;
			//НовоеОборудование = Выборка.ВидРабочегоЦентра;
			СпецификацияЭтапа = Этап.Спецификация;		
			КодОперации = Выборка.бит_КодОперации;
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПосчитатьСкорость();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьОборудование(Команда)
	
	//Если Не ЗначениеЗаполнено(ПричинаЗаменыОборудования) Тогда
	//	Сообщить("Не указана причина замены оборудования");
	//	Возврат;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(НовоеОборудование)
		И НовоеОборудование <> ТекущееОборудование Тогда
		
		СтруктураПараметров = Новый Структура;
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаНаВопросСоздатьНовыйЭтап", ЭтотОбъект, СтруктураПараметров); 
		ПоказатьВопрос(ОписаниеОповещения, "Создать новый этап на новом оборудовании?", РежимДиалогаВопрос.ДаНет);
			
	ИначеЕсли НовоеОборудование = ТекущееОборудование Тогда
		
		Сообщить("Новое оборудование совпадает со старым!");
		
	ИначеЕсли НовоеОборудование = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.ПустаяСсылка") Тогда
		
		Сообщить("Не указано новое оборудование!");
		
	Иначе
		
		//Закрыть(Этап);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаВопросСоздатьНовыйЭтап(РезультатВопроса, СтруктураПараметров) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Результат = СоздатьНовыйЭтапНаСервере();
		Закрыть(Результат);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьНовыйЭтапНаСервере() 
		
	Если НЕ ЗначениеЗаполнено(Спецификация) Тогда
		
		СпецификацияНовогоЭтапа = Этап.Спецификация.Скопировать();
		СпецификацияНовогоЭтапа.ВариантПодбораВДокументы = Перечисления.ВариантыПодбораСпецификацииВДокументы.Вручную;
		СпецификацияНовогоЭтапа.НачалоДействия = НачалоДня(ТекущаяДатаСеанса());
		СпецификацияНовогоЭтапа.Статус  = Перечисления.СтатусыСпецификаций.ВРазработке;
		СпецификацияНовогоЭтапа.бит_НужнаПроверкаТО = Истина;
		СпецификацияНовогоЭтапа.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТехнологическиеОперации.Ссылка КАК ТехнологическаяОперация,
		|	ЭтапыПроизводства.Ссылка КАК ЭтапПроизводства,
		|	ЭтапыПроизводства.НомерЭтапа КАК НомерЭтапа
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ПО ЭтапыПроизводства.Ссылка = ТехнологическиеОперации.Владелец
		|			И (ТехнологическиеОперации.НомерСледующейОперации = 0)
		|			И (НЕ ТехнологическиеОперации.ПометкаУдаления)
		|ГДЕ
		|	ЭтапыПроизводства.Владелец = &РесурснаяСпецификация
		|	И ЭтапыПроизводства.НомерСледующегоЭтапа = 0
		|	И НЕ ЭтапыПроизводства.ПометкаУдаления
		|	И ТехнологическиеОперации.бит_КодОперации = &КодОперации";
		
		Запрос.УстановитьПараметр("РесурснаяСпецификация", Этап.Спецификация);
		Запрос.УстановитьПараметр("КодОперации", КодОперации);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НовыйТехнологическаяОперация = ВыборкаДетальныеЗаписи.ТехнологическаяОперация.Скопировать();
			НовыйЭтапПроизводства = ВыборкаДетальныеЗаписи.ЭтапПроизводства.Скопировать();
			
			НовыйЭтапПроизводства.Владелец = СпецификацияНовогоЭтапа.Ссылка;
			НовыйЭтапПроизводства.НомерЭтапа = 1;
			НовыйЭтапПроизводства.НомерСледующегоЭтапа = 0;
			Для Каждого СтрокаТЧ Из НовыйЭтапПроизводства.ВидыРабочихЦентров Цикл
				СтрокаТЧ.ВидРабочегоЦентра = НовоеОборудование;
			КонецЦикла;
			НовыйЭтапПроизводства.Записать();
			
			НовыйТехнологическаяОперация.Владелец = НовыйЭтапПроизводства.Ссылка;
			НовыйТехнологическаяОперация.НомерОперации = 1;
			НовыйТехнологическаяОперация.НомерСледующейОперации = 0;
			НовыйТехнологическаяОперация.РабочийЦентр = НовоеОборудование;			
			НовыйТехнологическаяОперация.Записать();
			
			СпецификацияНовогоЭтапа.Статус  = Перечисления.СтатусыСпецификаций.Действует;
			СпецификацияНовогоЭтапа.Записать();
			
			НомерЭтапа = ВыборкаДетальныеЗаписи.НомерЭтапа;
			ЭтапПроизводства = НовыйЭтапПроизводства.Ссылка;
			
		КонецЦикла;
		
	Иначе
		
		СпецификацияНовогоЭтапа = Спецификация;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроизводства.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|ГДЕ
		|	НЕ ЭтапыПроизводства.ПометкаУдаления
		|	И ЭтапыПроизводства.Владелец = &Спецификация
		|	И ЭтапыПроизводства.НомерСледующегоЭтапа = 0";
		
		Запрос.УстановитьПараметр("Спецификация", СпецификацияНовогоЭтапа);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЭтапПроизводства = ВыборкаДетальныеЗаписи.Ссылка
		КонецЦикла;
			
	КонецЕсли;
	
	СпецификацияНовогоЭтапа = СпецификацияНовогоЭтапа.Ссылка;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ЭтапПроизводства2_2.НомерПартииЗапуска КАК НомерПартииЗапуска
	//	|ИЗ
	//	|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	//	|ГДЕ
	//	|	ЭтапПроизводства2_2.Распоряжение = &Распоряжение
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	НомерПартииЗапуска УБЫВ";
	//
	//Запрос.УстановитьПараметр("Распоряжение", Заказ);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	НомерПартииЗапуска = ВыборкаДетальныеЗаписи.НомерПартииЗапуска
	//КонецЦикла;
	//
	//НовыйЭтап = Этап.Скопировать();
	//НовыйЭтап.Дата = ТекущаяДата();
	//НовыйЭтап.НомерЭтапа = НомерЭтапа + 1;
	//НовыйЭтап.НомерСледующегоЭтапа = 0;//НомерЭтапа + 1;
	//НовыйЭтап.НомерПартииЗапуска = НомерПартииЗапуска + 1;//НомерЭтапа + 1;
	//НовыйЭтап.НомерЭтапаВПартииЗапуска = 1;
	//НовыйЭтап.Номер = Неопределено;
	//НовыйЭтап.Распоряжение = Заказ;
	//НовыйЭтап.Спецификация = СпецификацияНовогоЭтапа.Ссылка;
	//НовыйЭтап.КоличествоУпаковокПлан = КоличествоКВыпуску;
	////НовыйЭтап.ПартияПроизводства = Неопределено;
	////НовыйЭтап.Назначение = Неопределено;
	//НовыйЭтап.ВыходныеИзделия.Очистить(); 
	//НовыйЭтап.ВыходныеИзделияСерии.Очистить();

	//НовыйЭтап.ВыходныеИзделия.Загрузить(НовыйЭтап.Спецификация.ВыходныеИзделия.Выгрузить());
	//
	//Если НовыйЭтап.ВыходныеИзделия.Количество() <> 0 Тогда
	//	НовыйЭтап.ВыходныеИзделия[0].КоличествоУпаковок  = КоличествоКВыпуску;
	//	НовыйЭтап.ВыходныеИзделия[0].ДоляСтоимости = 100;
	//	НовыйЭтап.ВыходныеИзделия[0].ДоляСтоимости = 100;
	//	НовыйЭтап.ВыходныеИзделия[0].Подразделение = НовыйЭтап.Подразделение;
	//	НовыйЭтап.ВыходныеИзделия[0].Получатель = Этап.ВыходныеИзделия[0].Получатель;
	//КонецЕсли;
	//
	//НовыйЭтап.ПобочныеИзделия.Очистить(); 
	//НовыйЭтап.ПобочныеИзделияСерии.Очистить();
	//НовыйЭтап.РасходМатериаловИРабот.Очистить(); 
	//НовыйЭтап.РасходМатериаловИРабот.Очистить();
	//НовыйЭтап.ЭкономияМатериалов.Очистить(); 
	//НовыйЭтап.ЭкономияМатериаловСерии.Очистить();
	//НовыйЭтап.Записать();
	//НовыйЭтап.Записать(РежимЗаписиДокумента.Проведение);
	
	Ошибки = Новый ТаблицаЗначений;
	Ошибки.Колонки.Добавить("НаправлениеДеятельности");
	Ошибки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Ошибки.Колонки.Добавить("Сообщения");
	Ошибки.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
	Ошибки.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
	
	РезультатФормирования = Новый ТаблицаЗначений;
	РезультатФормирования.Колонки.Добавить("Документ");
	РезультатФормирования.Колонки.Добавить("Партия");
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Ошибки", Ошибки);
	СтруктураРезультата.Вставить("РезультатФормирования", РезультатФормирования);
	СтруктураРезультата.Вставить("СозданныеОбъекты", Новый Массив);
	СтруктураРезультата.Вставить("Сообщения", Новый Массив);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(СтруктураРезультата, Новый УникальныйИдентификатор);
	
	Группы = Новый ТаблицаЗначений;
	
	Группы.Колонки.Добавить("ДатаПотребности", Новый ОписаниеТипов("Дата"));//	23.02.2026 13:52:06	Дата
	Группы.Колонки.Добавить("ДлительностьДоВыпуска", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));//	0	Число
	Группы.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));//		СправочникСсылка.ДоговорыКонтрагентов
	Группы.Колонки.Добавить("ЗаказНаПроизводствоДата", Новый ОписаниеТипов("Дата"));//	26.01.2026 11:21:00	Дата
	Группы.Колонки.Добавить("ЗаказНаПроизводствоНомер", Новый ОписаниеТипов("Строка"));//	"РК00-000026"	Строка
	Группы.Колонки.Добавить("ЗаказПодДеятельность", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНалогообложенияНДС"));//	Продажа облагается НДС	ПеречислениеСсылка.ТипыНалогообложенияНДС
	Группы.Колонки.Добавить("КлючПартия", Новый ОписаниеТипов("УникальныйИдентификатор"));//	9e56681d-b2fa-48f4-9bfa-93255a91601d	УникальныйИдентификатор
	Группы.Колонки.Добавить("НазначениеПродукция", Новый ОписаниеТипов("СправочникСсылка.Назначения"));//		СправочникСсылка.Назначения
	Группы.Колонки.Добавить("НаправлениеДеятельности", Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));//		СправочникСсылка.НаправленияДеятельности
	Группы.Колонки.Добавить("НачатьНеРанее", Новый ОписаниеТипов("Дата"));//	23.02.2026 13:52:06	Дата
	Группы.Колонки.Добавить("НомерГруппы", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));//	1	Число
	Группы.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));//	РыбинскКабель	СправочникСсылка.Организации
	Группы.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));//		СправочникСсылка.Партнеры
	Группы.Колонки.Добавить("ПодразделениеДиспетчер", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));//	Производственная группа	СправочникСсылка.СтруктураПредприятия
	Группы.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("СправочникСсылка.Приоритеты"));//	Средний	СправочникСсылка.Приоритеты
	Группы.Колонки.Добавить("Распоряжение", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство2_2"));//	Заказ на производство РК00-000026 от 26.01.2026 11:21:00	ДокументСсылка.ЗаказНаПроизводство2_2
	Группы.Колонки.Добавить("СледующийЗаказВОчереди", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство2_2"));//	Заказ на производство РК00-000026 от 26.01.2026 11:21:00	ДокументСсылка.ЗаказНаПроизводство2_2
	Группы.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));//	ПАСМА 6Х0.262 КГ (Цех1)	СправочникСсылка.РесурсныеСпецификации
	Группы.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперации"));//	Собственное производство	ПеречислениеСсылка.ХозяйственныеОперации
	
	КлючПартия = Новый УникальныйИдентификатор;
	
	СтрокаГруппы = Группы.Добавить();
	СтрокаГруппы.ДатаПотребности = ТекущаяДатаСеанса();
	СтрокаГруппы.ДлительностьДоВыпуска = 0;
	СтрокаГруппы.Договор = Заказ.Договор;
	СтрокаГруппы.ЗаказНаПроизводствоДата = Заказ.Дата;
	СтрокаГруппы.ЗаказНаПроизводствоНомер = Заказ.Номер;
	СтрокаГруппы.ЗаказПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	СтрокаГруппы.КлючПартия = КлючПартия;
	СтрокаГруппы.НазначениеПродукция = Справочники.Назначения.ПустаяСсылка();
	СтрокаГруппы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ПустаяСсылка();
	СтрокаГруппы.НачатьНеРанее = ТекущаяДатаСеанса();
	СтрокаГруппы.НомерГруппы = 1;
	СтрокаГруппы.Организация = Заказ.Организация;
	СтрокаГруппы.Партнер = Заказ.Партнер;
	СтрокаГруппы.ПодразделениеДиспетчер = Заказ.Подразделение;
	СтрокаГруппы.Приоритет = Заказ.Приоритет;
	СтрокаГруппы.Распоряжение = Заказ;
	СтрокаГруппы.СледующийЗаказВОчереди = Заказ;
	СтрокаГруппы.Спецификация = СпецификацияНовогоЭтапа;
	СтрокаГруппы.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СобственноеПроизводство;
	
	ДатыОбеспеченияПоГрафику = Новый ТаблицаЗначений;
	ДатыОбеспеченияПоГрафику.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ДатыОбеспеченияПоГрафику.Колонки.Добавить("НомерГруппы", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ДатыОбеспеченияПоГрафику.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства"));

	СтрокаДатыОбеспеченияПоГрафику = ДатыОбеспеченияПоГрафику.Добавить();
	СтрокаДатыОбеспеченияПоГрафику.Дата = ТекущаяДатаСеанса();
	СтрокаДатыОбеспеченияПоГрафику.НомерГруппы = 1;
	СтрокаДатыОбеспеченияПоГрафику.Этап = ЭтапПроизводства;
	
	Изделия = Новый ТаблицаЗначений;

	Изделия.Колонки.Добавить("АналитикаАктивовПассивов");//		Неопределено
	Изделия.Колонки.Добавить("АналитикаРасходов");//		Неопределено
	Изделия.Колонки.Добавить("ДатаЗапуска", Новый ОписаниеТипов("Дата"));//	23.02.2026 14:11:50	Дата
	Изделия.Колонки.Добавить("ДатаЗапускаНорматив", Новый ОписаниеТипов("Дата"));//	01.01.0001 0:00:00	Дата
	Изделия.Колонки.Добавить("ДлительностьДоВыпуска", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));//	0	Число
	Изделия.Колонки.Добавить("КлючПартия", Новый ОписаниеТипов("УникальныйИдентификатор"));//	f55a4d15-fdba-4ede-975e-b10fd7dfd80c	УникальныйИдентификатор
	Изделия.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));//	0,05	Число
	Изделия.Колонки.Добавить("КоличествоНаПартию", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));//	1	Число
	Изделия.Колонки.Добавить("КоличествоНорматив", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));//	0,05	Число
	Изделия.Колонки.Добавить("КоличествоПартий", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));//	1	Число
	Изделия.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));//		СправочникСсылка.Назначения
	Изделия.Колонки.Добавить("НаправлениеДеятельности", Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));//		СправочникСсылка.НаправленияДеятельности
	Изделия.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));//	ПАСМА 6Х0.262 КГ	СправочникСсылка.Номенклатура
	Изделия.Колонки.Добавить("НомерГруппы", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));//	1	Число
	Изделия.Колонки.Добавить("НомерПартииВГруппе", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));//	0	Число
	Изделия.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));//		Неопределено
	Изделия.Колонки.Добавить("ПодразделениеДиспетчер", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));//	Производственная группа	СправочникСсылка.СтруктураПредприятия
	Изделия.Колонки.Добавить("Получатель", Новый ОписаниеТипов("СправочникСсылка.Склады"));//	Z1-Склад ГП ООО РКЗ	СправочникСсылка.Склады
	Изделия.Колонки.Добавить("Распоряжение", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство2_2"));//	Заказ на производство РК00-000026 от 26.01.2026 11:21:00	ДокументСсылка.ЗаказНаПроизводство2_2
	Изделия.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));//	Z1-Склад ГП ООО РКЗ	СправочникСсылка.Склады
	Изделия.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));//	ПАСМА 6Х0.262 КГ (Цех1)	СправочникСсылка.РесурсныеСпецификации
	Изделия.Колонки.Добавить("СписатьНаРасходы", Новый ОписаниеТипов("Булево"));//	Ложь	Булево
	Изделия.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));//		ПланВидовХарактеристикСсылка.СтатьиРасходов
	Изделия.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));//	1	Число
	Изделия.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));//		СправочникСсылка.ХарактеристикиНоменклатуры 
	
	СтрокаИзделия = Изделия.Добавить();
	СтрокаИзделия.АналитикаАктивовПассивов = Неопределено;
	СтрокаИзделия.АналитикаРасходов = Неопределено;
	СтрокаИзделия.ДатаЗапуска = ТекущаяДатаСеанса();
	СтрокаИзделия.ДатаЗапускаНорматив = Дата('00010101');
	СтрокаИзделия.ДлительностьДоВыпуска = 0;
	СтрокаИзделия.КлючПартия = КлючПартия;
	СтрокаИзделия.Количество = КоличествоКВыпуску;
	СтрокаИзделия.КоличествоНаПартию = 1;
	СтрокаИзделия.КоличествоНорматив = КоличествоКВыпуску;
	СтрокаИзделия.КоличествоПартий = 1;
	СтрокаИзделия.Назначение = Справочники.Назначения.ПустаяСсылка();
	СтрокаИзделия.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ПустаяСсылка();
	СтрокаИзделия.Номенклатура = ВыходноеИзделие;
	СтрокаИзделия.НомерГруппы = 1;
	СтрокаИзделия.НомерПартииВГруппе = 0;
	СтрокаИзделия.Подразделение = Неопределено;
	СтрокаИзделия.ПодразделениеДиспетчер = Заказ.Подразделение;
	СтрокаИзделия.Получатель = Заказ.Продукция[0].Склад;
	СтрокаИзделия.Распоряжение = Заказ;
	СтрокаИзделия.Склад = Заказ.Продукция[0].Склад;
	СтрокаИзделия.Спецификация = СпецификацияНовогоЭтапа;
	СтрокаИзделия.СписатьНаРасходы = Ложь;
	СтрокаИзделия.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	СтрокаИзделия.Уровень = 1;
	СтрокаИзделия.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	ПараметрыФормирования = Новый Структура;
	ПараметрыФормирования.Вставить("ВариантЗаполненияГрафикаЭтапов", "РассчитатьОтТекущейДаты");
	ПараметрыФормирования.Вставить("ВариантПередачиЭтаповКВыполнению", "Все");
	ПараметрыФормирования.Вставить("Группы", Группы);
	ПараметрыФормирования.Вставить("ДатыОбеспеченияПоГрафику", ДатыОбеспеченияПоГрафику);
	ПараметрыФормирования.Вставить("ЗаменятьМатериалыНаАналоги", Ложь);
	ПараметрыФормирования.Вставить("Изделия", Изделия);
	ПараметрыФормирования.Вставить("ОбособитьВыпускПолуфабрикатов", Ложь);
	ПараметрыФормирования.Вставить("РезервироватьМатериалы", Истина);
	ПараметрыФормирования.Вставить("УкрупнятьПартииМеждуЗаказами", Истина);
	ПараметрыФормирования.Вставить("УкрупнятьПартииПоНазначениям", Ложь);
	
	Обработки.ФормированиеЭтаповПроизводства.СоздатьДокументыОтложенно(ПараметрыФормирования, АдресХранилища);
	
	Возврат АдресХранилища;
	
КонецФункции

&НаКлиенте
Процедура КоличествоКВыпускуПриИзменении(Элемент)
	ПосчитатьСкорость();
КонецПроцедуры

&НаКлиенте
Процедура ВремяПриИзменении(Элемент)
	ПосчитатьСкорость();
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьСкорость()
	
	Если ЗначениеЗаполнено(КоличествоКВыпуску)
		И ЗначениеЗаполнено(Время) Тогда
		
		Элементы.НадписьСкорость.Заголовок = Формат(КоличествоКВыпуску / Время, "ЧЦ=5; ЧДЦ=2");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЭтапПриИзмененииНаСервере()
	
	//ВыходноеИзделие =  Этап.Спецификация.ОсновноеИзделиеНоменклатура;
	//СпецификацияЭтапа = Этап.Спецификация;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ТехнологическиеОперации.РабочийЦентр.ВидРабочегоЦентра КАК ТекущееОборудование
	//	|ИЗ
	//	|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	//	|		ПО ЭтапыПроизводства.Ссылка = ТехнологическиеОперации.Владелец
	//	|			И (ТехнологическиеОперации.НомерСледующейОперации = 0
	//	|				И НЕ ТехнологическиеОперации.ПометкаУдаления)
	//	|ГДЕ
	//	|	ЭтапыПроизводства.Владелец = &РесурснаяСпецификация
	//	|	И ЭтапыПроизводства.НомерСледующегоЭтапа = 0
	//	|	И НЕ ЭтапыПроизводства.ПометкаУдаления";
	//
	//Запрос.УстановитьПараметр("РесурснаяСпецификация", Спецификация);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	ТекущееОборудование = ВыборкаДетальныеЗаписи.ТекущееОборудование;
	//КонецЦикла;
		 
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПриИзменении(Элемент)
	ЭтапПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЭтапНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	
	Если ЗначениеЗаполнено(Заказ) Тогда
		ПараметрыОткрытия.Вставить("ОтборПоЗаказу", Заказ);	
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("ОтборПоКоличеству_ОтмекаУдален_НеРучнойВводМатериалов");
	
	ОткрытьФорму("Документ.ЭтапПроизводства2_2.ФормаВыбора", ПараметрыОткрытия, Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура СпецификацияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("НеРесурснаяСпецификация", СпецификацияЭтапа);
	ПараметрыОткрытия.Вставить("Номенклатура", ВыходноеИзделие);
	ПараметрыОткрытия.Вставить("ОтображениеТаблицы", ОтображениеТаблицы.Список);
	
	ОткрытьФорму("Справочник.РесурсныеСпецификации.ФормаВыбора", ПараметрыОткрытия, Элемент);
	
КонецПроцедуры


&НаСервере
Процедура СпецификацияПриИзмененииНаСервере()

	//ВыходноеИзделие =  Этап.Спецификация.ОсновноеИзделиеНоменклатура;
	//СпецификацияЭтапа = Этап.Спецификация;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТехнологическиеОперации.РабочийЦентр.ВидРабочегоЦентра КАК ТекущееОборудование
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ПО ЭтапыПроизводства.Ссылка = ТехнологическиеОперации.Владелец
		|			И (ТехнологическиеОперации.НомерСледующейОперации = 0
		|				И НЕ ТехнологическиеОперации.ПометкаУдаления)
		|ГДЕ
		|	ЭтапыПроизводства.Владелец = &РесурснаяСпецификация
		|	И ЭтапыПроизводства.НомерСледующегоЭтапа = 0
		|	И НЕ ЭтапыПроизводства.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("РесурснаяСпецификация", Спецификация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовоеОборудование = ВыборкаДетальныеЗаписи.ТекущееОборудование;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
	СпецификацияПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура НовоеОборудованиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ПолучитьВРЦ());

	ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("НеТекущееОборудование", ТекущееОборудование);
	ПараметрыОткрытия.Вставить("ОтображениеТаблицы", ОтображениеТаблицы.Список);
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.ВидыРабочихЦентров.ФормаВыбора", ПараметрыОткрытия, Элемент);

КонецПроцедуры

&НаСервере
Функция ПолучитьВРЦ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРабочихЦентров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
		|ГДЕ
		|	ВидыРабочихЦентров.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", ТекущееОборудование.Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура НовоеОборудованиеПриИзмененииНаСервере()
	
	Элементы.ЗаменитьОборудование.Доступность = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТехнологическиеОперации.Владелец КАК ЭтапПроизводства,
		|	ЭтапыПроизводства.Владелец КАК РесурснаяСпецификация,
		|	ЭтапыПроизводства.НомерЭтапа КАК НомерЭтапа
		|ИЗ
		|	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ПО ТехнологическиеОперации.Владелец = ЭтапыПроизводства.Ссылка
		|			И (НЕ ЭтапыПроизводства.ПометкаУдаления)
		|			И (ЭтапыПроизводства.НомерСледующегоЭтапа = 0)
		|			И (ЭтапыПроизводства.Владелец.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует))
		|ГДЕ
		|	ТехнологическиеОперации.РабочийЦентр = &НовоеОборудование
		|	И ТехнологическиеОперации.НомерСледующейОперации = 0
		|	И НЕ ТехнологическиеОперации.ПометкаУдаления
		|	И ТехнологическиеОперации.Спецификация.ОсновноеИзделиеНоменклатура = &ОсновноеИзделиеНоменклатура
		|	И ТехнологическиеОперации.бит_КодОперации = &КодОперации";
	
	Запрос.УстановитьПараметр("НовоеОборудование", НовоеОборудование);
	Запрос.УстановитьПараметр("ОсновноеИзделиеНоменклатура", ВыходноеИзделие);
	Запрос.УстановитьПараметр("КодОперации", КодОперации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Спецификация = ВыборкаДетальныеЗаписи.РесурснаяСпецификация;
		НомерЭтапа = ВыборкаДетальныеЗаписи.НомерЭтапа;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Спецификация) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТехнологическиеОперации.Владелец КАК ЭтапПроизводства,
		|	ЭтапыПроизводства.Владелец КАК РесурснаяСпецификация,
		|	ЭтапыПроизводства.НомерЭтапа КАК НомерЭтапа
		|ИЗ
		|	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ПО ТехнологическиеОперации.Владелец = ЭтапыПроизводства.Ссылка
		|			И (НЕ ЭтапыПроизводства.ПометкаУдаления)
		|			И (ЭтапыПроизводства.НомерСледующегоЭтапа = 0)
		|			И (ЭтапыПроизводства.Владелец.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Закрыта))
		|ГДЕ
		|	ТехнологическиеОперации.РабочийЦентр = &НовоеОборудование
		|	И ТехнологическиеОперации.НомерСледующейОперации = 0
		|	И НЕ ТехнологическиеОперации.ПометкаУдаления
		|	И ТехнологическиеОперации.Спецификация.ОсновноеИзделиеНоменклатура = &ОсновноеИзделиеНоменклатура
		|	И ТехнологическиеОперации.бит_КодОперации = &КодОперации";
		
		Запрос.УстановитьПараметр("НовоеОборудование", НовоеОборудование);
		Запрос.УстановитьПараметр("ОсновноеИзделиеНоменклатура", ВыходноеИзделие);
		Запрос.УстановитьПараметр("КодОперации", КодОперации);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Сообщить("Есть закрытая спецификация с таким видом оборудования. Данный маршрут запрещен технологами!");
			Элементы.ЗаменитьОборудование.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура НовоеОборудованиеПриИзменении(Элемент)
	
	Спецификация = Неопределено;
	ОчиститьСообщения();

	Если НовоеОборудование = ТекущееОборудование Тогда
		НовоеОборудование = Неопределено;
		Сообщить("Новое оборудование должно отличаться от текущего!");
	ИначеЕсли ПолучитьВРЦ().Найти(НовоеОборудование) = Неопределено Тогда
		НовоеОборудование = Неопределено;
		Сообщить("Подразделение нового обородувания отличается от текущего обрудования!");
	Иначе
		НовоеОборудованиеПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

