
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
    
	
	// Вызов механизма защиты
	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 	
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВизыГруппы

&НаКлиенте
Процедура ВизыГруппыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивВиз = Новый Массив;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		// Случай множественного выбора
		Для каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл		
			Если ТипЗнч(ВыбранныйЭлемент) = Тип("СправочникСсылка.бит_Визы") Тогда			
				МассивВиз.Добавить(ВыбранныйЭлемент);			
			КонецЕсли;		
		КонецЦикла; // Выбранное значение
	
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_Визы") Тогда	
		
		МассивВиз.Добавить(ВыбранноеЗначение);
		
	КонецЕсли; 
	
	Для каждого ВыбранныйЭлемент Из МассивВиз Цикл
		
		СтрОтбор = Новый Структура;
		СтрОтбор.Вставить("Виза", ВыбранныйЭлемент);
		
		МассивСтрок = Объект.ВизыГруппы.НайтиСтроки(СтрОтбор);
		
		// Если выбранной визы нет в табличной части, то добавяем ее, иначе выводим сообщение.
		Если МассивСтрок.Количество() = 0 Тогда
			НоваяСтрока 	 = Объект.ВизыГруппы.Добавить();
			НоваяСтрока.Виза = ВыбранныйЭлемент;
		Иначе
			ТекстСообщения = НСтр("ru='Виза ""%1"" уже подобрана в табличную часть.';
								  |en='Visa ""%1"" is already selected in the table part.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ВыбранныйЭлемент);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПодбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.бит_Визы.ФормаВыбора", ПараметрыФормы, Элементы.ВизыГруппы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура управляет видимостью/доступностью элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()
	
	Если Объект.Ссылка = Справочники.бит_ГруппыВиз.ВсеВизы Тогда
		
		Элементы.ГруппаСостав.Доступность = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьВидимость()

#КонецОбласти

