
&НаСервере
&Перед("ПриЧтенииСозданииНаСервере")
Процедура бит_ПриЧтенииСозданииНаСервере()
	
	// {{ПервыйБИТ ЛистТребований [ЛТ0.1] [ASHolyavko@1cbit.ru] [04.12.2025] +        
	
	МассивРеквизитов = Новый Массив;
	ОписаниеКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3));
	//Без привязки к объекту
	НовыйРеквизит = Новый РеквизитФормы("бит_ВремяРаботыНаСтоПроцентов", ОписаниеКоличества, "ВидыРабочихЦентров");
	МассивРеквизитов.Добавить(НовыйРеквизит);
	Попытка	
		ИзменитьРеквизиты(МассивРеквизитов);  
	Исключение
	КонецПопытки;
	
	НовыйЭлемент  = Элементы.Добавить("бит_ВремяРаботыНаСтоПроцентов", Тип("ПолеФормы"), Элементы.ВидыРабочихЦентровГруппаВремяРаботы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.Заголовок = "(бит) Время работы на 100%";
	НовыйЭлемент.ПутьКДанным = "ВидыРабочихЦентров.бит_ВремяРаботыНаСтоПроцентов"; 

	// }}ПервыйБИТ ЛистТребований [ЛТ0.1] [ASHolyavko@1cbit.ru] [04.12.2025] -

КонецПроцедуры
