
#Область СлужебныйПрограммныйИнтерфейс

// Процедура обновляет статус проверки подписи.
//
// Параметры:
//  РезультатПроверкиПодписи - Строка.
//  ИДПодписи
//  ОбъектПодписи
//  СтатусПроверкиПодписи
//
Процедура ОбновитьСтатусПроверкиПодписи(РезультатПроверкиПодписи, ИДПодписи, ОбъектПодписи, СтатусПроверкиПодписи) Экспорт

	бит_ЭлектронныеПодписи.ОбновитьСтатусПроверкиПодписи(РезультатПроверкиПодписи, ИДПодписи, ОбъектПодписи, СтатусПроверкиПодписи);
	
КонецПроцедуры

// Процедура находит запись в регистре сведений "бит_ЭлектронныеПодписи" с отбором
// и очищает ее.
//
// Параметры:
//  ИД - Строка.
//  ОбъектПодписи - Объект.
//
Процедура ПроверитьУдалитьПодписьВизы(ИД, ОбъектПодписи) Экспорт

	бит_ЭлектронныеПодписи.ПроверитьУдалитьПодписьВизы(ИД, ОбъектПодписи); 
			
КонецПроцедуры

// Сохраняет информацию о ЭП.
//
Процедура ЗанестиИнформациюОПодписи(ПараметрыПодписи) Экспорт
	
	бит_ЭлектронныеПодписи.ЗанестиИнформациюОПодписи(ПараметрыПодписи);
	
КонецПроцедуры

// Процедура записывает информацию о подписи в регистр сведений "бит_УстановленныеВизы". 
//
// Параметры:
//  ИД 						 - Строка.
//  ОбъектПодписи 			 - ДокументОбъект.
//  ТипСобытия 				 - СТрока.
//  РезультатПроверкиПОдписи - Структура, Булево.
//
Процедура ЗаписатьДанныеПодписиВРегистрУстановленныеВизы(ИД, ОбъектПодписи, ТипСобытия, РезультатПроверкиПОдписи = Неопределено) Экспорт

	бит_ЭлектронныеПодписи.ЗаписатьДанныеПодписиВРегистрУстановленныеВизы(ИД, ОбъектПодписи, ТипСобытия, РезультатПроверкиПОдписи);	
	
КонецПроцедуры

#КонецОбласти
