#Область ПрограммныйИнтерфейс

// Функция осуществляет загрузку документов из облака Эвотор
//
// Параметры:
//   Параметры - Структура
//   РезультатЗагрузки - Структура
//
Процедура НачатьЗагрузкуДокументов(Параметры, РезультатЗагрузки) Экспорт
	
	ОфлайнОборудованиеОФДСервер.НачатьЗагрузкуДокументов(Параметры, РезультатЗагрузки);
	
КонецПроцедуры

// Функция осуществляет загрузку документов из облака Эвотор
//
// Параметры:
//   Параметры - Структура
//   РезультатЗагрузки - Структура
//
Процедура НачатьЗагрузкуОборотовКассовойСмены(Параметры, РезультатЗагрузки) Экспорт
	
	ОфлайнОборудованиеОФДСервер.НачатьЗагрузкуОборотовКассовойСмены(Параметры, РезультатЗагрузки);
	
КонецПроцедуры

// Функция осуществляет загрузку документов из облака Эвотор
//
// Параметры:
//   Параметры - Структура
//   РезультатЗагрузки - Структура
//
Процедура НачатьЗагрузкуЧековКассовойСмены(Параметры, РезультатЗагрузки) Экспорт
	
	ОфлайнОборудованиеОФДСервер.НачатьЗагрузкуЧековКассовойСмены(Параметры, РезультатЗагрузки);
	
КонецПроцедуры

#КонецОбласти