
//&Вместо("ТекстЗапросаТаблицаМножителиПартийИПолуфабрикатов")
//Процедура бит_ТекстЗапросаТаблицаМножителиПартийИПолуфабрикатов(Запрос, ТекстыЗапроса, Регистры)
//	// Взята с релиза 1С:ERP Управление предприятием 2 (2.5.25.92)
//	ИмяРегистра = "МножителиПартийИПолуфабрикатов";
//	
//	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВТОбъектыКалькуляции", ТекстыЗапроса) Тогда
//		ТекстыЗапросаДляФормированияДвижений(Запрос, ТекстыЗапроса);
//	КонецЕсли;
//	
//	Запрос.УстановитьПараметр("ПустойУИД", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
//	ТекстЗапроса = "
//		|ВЫБРАТЬ
//		|	ВЗ.Период КАК Период,
//		|	ВЗ.Калькуляция КАК Калькуляция,
//		|	ВЗ.Продукция КАК Продукция,
//		|	ВЗ.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
//		|	ВЗ.Назначение КАК Назначение,
//		|	ВЗ.ПартияСпецификацияПродукции КАК ПартияСпецификацияПродукции,
//		|	ВЗ.ПартияСпецификацияПолуфабриката КАК ПартияСпецификацияПолуфабриката,
//		|	ВЗ.КлючПартия КАК КлючПартия,
//		|	ВЗ.Полуфабрикат КАК Полуфабрикат,
//		|	ВЗ.ХарактеристикаПолуфабриката КАК ХарактеристикаПолуфабриката,
//		|	ВЗ.Порядок КАК Порядок,
//		|	СУММА(ВЗ.Числитель) КАК Числитель,
//		|	ВЗ.Знаменатель КАК Знаменатель,
//		|	СУММА(ВЗ.КоличествоПолуфабриката) КАК КоличествоПолуфабриката,
//		|	ВЗ.РасчетЗавершен КАК РасчетЗавершен,
//		|	ВЗ.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
//		|	ВЗ.ПартияВыпущена КАК ПартияВыпущена
//		|ИЗ
//		|(
//		|	ВЫБРАТЬ
//		|		НАЧАЛОПЕРИОДА(ВыходныеИзделияПоЗаказу.ДатаПроизводства, ДЕНЬ) КАК Период,
//		|		&Ссылка КАК Калькуляция,
//		|		ВТОбъектыКалькуляции.Номенклатура КАК Продукция,
//		|		ВТОбъектыКалькуляции.Характеристика КАК ХарактеристикаПродукции,
//		|		ВТОбъектыКалькуляции.Назначение КАК Назначение,
//		|		ВЫБОР КОГДА ВыходныеИзделияПоЗаказу.ПроизводствоНаСтороне И НЕ ВыходныеИзделияПоЗаказу.ПартияВыпущена
//		|			ТОГДА
//		|				ВыходныеИзделияПоЗаказу.Спецификация
//		|			ИНАЧЕ
//		|				ВыходныеИзделияПоЗаказу.ВыпускающийЭтап
//		|		КОНЕЦ КАК ПартияСпецификацияПродукции,
//		|		НЕОПРЕДЕЛЕНО КАК ПартияСпецификацияПолуфабриката,
//		|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОбъектыКалькуляции.Характеристика) КАК КлючПартия,
//		|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Полуфабрикат,
//		|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаПолуфабриката,
//		|		ВЫБОР
//		|			КОГДА ВыходныеИзделияПоЗаказу.ПартияВыпущена
//		|				ТОГДА -100
//		|			КОГДА ВыходныеИзделияПоЗаказу.СписатьНаРасходы
//		|				ТОГДА -1
//		|			ИНАЧЕ 0
//		|		КОНЕЦ КАК Порядок,
//		|		ВыходныеИзделияПоЗаказу.ДоляСтоимости КАК Числитель,
//		|		ВЫБОР
//		//	Комментарий 1045.
//		//	В одном документе ЭтапПроизводства2_2 продукция может быть частично выпущена:
//		//		1. Часть строк с галкой Произведено, часть без галки.
//		//		2. Разные даты выпуска:
//		//			2.1 Какие-то даты выпуска попали в закрытый период, какие-то нет.
//		//			2.2 Какие-то даты выпуска до даты ПК, какие-то после.
//		|			КОГДА ВыходныеИзделияПоЗаказу.ПартияВыпущена
//		//	Для верного расчета затрат по выпущенным партиям знаменатель должен быть посчитан только по строкам,
//		//		для которых ПартияВыпущена = ИСТИНА.
//		|				ТОГДА ВсегоДолейСтоимости.ДоляПоВыпущеннымПартиям
//		//	Для верного расчета по НЕ выпущенным партиям, знаменатель должен быть в целом по всему документу.
//		|			ИНАЧЕ ВсегоДолейСтоимости.ВсегоДолей
//		|		КОНЕЦ КАК Знаменатель,
//		|		ВыходныеИзделияПоЗаказу.Количество КАК КоличествоПолуфабриката,
//		|		ЛОЖЬ КАК РасчетЗавершен,
//		|		ВТОбъектыКалькуляции.Объект КАК ЗаказНаПроизводство,
//		|		ВыходныеИзделияПоЗаказу.ПартияВыпущена КАК ПартияВыпущена
//		|	ИЗ
//		|		ВТОбъектыКалькуляции КАК ВТОбъектыКалькуляции
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыходныеИзделияПоЗаказу КАК ВыходныеИзделияПоЗаказу
//		|			ПО ВТОбъектыКалькуляции.Объект = ВыходныеИзделияПоЗаказу.Объект
//		|				И ВТОбъектыКалькуляции.Номенклатура = ВыходныеИзделияПоЗаказу.Номенклатура
//		|				И ВТОбъектыКалькуляции.Характеристика = ВыходныеИзделияПоЗаказу.Характеристика
//		|				И ВТОбъектыКалькуляции.Назначение = ВыходныеИзделияПоЗаказу.Назначение
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсегоДолейСтоимости КАК ВсегоДолейСтоимости
//		|			ПО (ВыходныеИзделияПоЗаказу.ВыпускающийЭтап = ВсегоДолейСтоимости.Объект)
//		|	ГДЕ
//		|		НЕ (ВыходныеИзделияПоЗаказу.ПартияВыпущена И ВыходныеИзделияПоЗаказу.СписатьНаРасходы)
//		|
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|
//		|	ВЫБРАТЬ
//		|		&Период КАК Период,
//		|		&Ссылка КАК Калькуляция,
//		|		ВТОбъектыКалькуляции.Номенклатура КАК Продукция,
//		|		ВТОбъектыКалькуляции.Характеристика КАК ХарактеристикаПродукции,
//		|		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
//		|		ВыходныеИзделияПоСпецификации.Спецификация КАК ПартияСпецификацияПродукции,
//		|		НЕОПРЕДЕЛЕНО КАК ПартияСпецификацияПолуфабриката,
//		|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОбъектыКалькуляции.Характеристика) КАК КлючПартия,
//		|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Полуфабрикат,
//		|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаПолуфабриката,
//		|		0 КАК Порядок,
//		|		ВыходныеИзделияПоСпецификации.ДоляСтоимости КАК Числитель,
//		|		ВЫБОР 
//		|			КОГДА ВсегоДолейСтоимости.ВсегоДолей = 0
//		|				ТОГДА 1
//		|			ИНАЧЕ
//		|				ВсегоДолейСтоимости.ВсегоДолей
//		|		КОНЕЦ КАК Знаменатель,
//		|		ВыходныеИзделияПоСпецификации.Количество КАК КоличествоПолуфабриката,
//		|		ЛОЖЬ КАК РасчетЗавершен,
//		|		НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
//		|		ЛОЖЬ КАК ПартияВыпущена
//		|	ИЗ
//		|		ВТОбъектыКалькуляции КАК ВТОбъектыКалькуляции
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыходныеИзделияПоСпецификации КАК ВыходныеИзделияПоСпецификации
//		|			ПО ВТОбъектыКалькуляции.Объект = ВыходныеИзделияПоСпецификации.Спецификация
//		|				И ВТОбъектыКалькуляции.Номенклатура = ВыходныеИзделияПоСпецификации.Номенклатура
//		|				И (ВТОбъектыКалькуляции.Характеристика = ВыходныеИзделияПоСпецификации.Характеристика 
//		|					ИЛИ ВыходныеИзделияПоСпецификации.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
//		|
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсегоДолейСтоимости КАК ВсегоДолейСтоимости
//		|			ПО (ВыходныеИзделияПоСпецификации.Спецификация = ВсегоДолейСтоимости.Объект)
//		|
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
//		|			ПО ВТОбъектыКалькуляции.Объект = РесурсныеСпецификации.Ссылка
//		|				И (РесурсныеСпецификации.ТипПроизводственногоПроцесса В (
//		|					ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Сборка), 
//		|					ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Ремонт))
//		|					)
//		|
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|
//		|	ВЫБРАТЬ
//		|		&Период КАК Период,
//		|		&Ссылка КАК Калькуляция,
//		|		ВТОбъектыКалькуляции.Номенклатура КАК Продукция,
//		|		ВТОбъектыКалькуляции.Характеристика КАК ХарактеристикаПродукции,
//		|		ВТОбъектыКалькуляции.Назначение КАК Назначение,
//		|		ВЫБОР КОГДА ДД.ВыпускающийЭтап ССЫЛКА Документ.ЭтапПроизводства2_2
//		|			ТОГДА ДД.ВыпускающийЭтап
//		|			ИНАЧЕ ДД.Спецификация
//		|		КОНЕЦ КАК ПартияСпецификацияПродукции,
//		|		НЕОПРЕДЕЛЕНО КАК ПартияСпецификацияПолуфабриката,
//		|		ДД.КлючПартия КАК КлючПартия,
//		|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Полуфабрикат,
//		|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаПолуфабриката,
//		// Признак дин. структуры Порядок = -1024 см. ОбработатьПродукциюПоЗаказу.ОбработатьПродукциюПоЗаказу
//		|		-1024 КАК Порядок,
//		|		ДД.ДоляСтоимости КАК Числитель,
//		|		1 КАК Знаменатель,
//		|		ДД.Количество КАК КоличествоПолуфабриката,
//		|		ЛОЖЬ КАК РасчетЗавершен,
//		|		ДД.Объект КАК ЗаказНаПроизводство,
//		|		ЛОЖЬ КАК ПартияВыпущена
//		|	ИЗ
//		|		ВТОбъектыКалькуляции КАК ВТОбъектыКалькуляции
//		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыходныеИзделияПоЗаказуДинамическаяСтруктура КАК ДД
//		|			ПО ВТОбъектыКалькуляции.Объект = ДД.Объект
//		|				И ВТОбъектыКалькуляции.Номенклатура = ДД.Номенклатура
//		|				И ВТОбъектыКалькуляции.Характеристика = ДД.Характеристика
//		|				И ВТОбъектыКалькуляции.Назначение = ДД.Назначение
//		|) КАК ВЗ
//		|СГРУППИРОВАТЬ ПО
//		|	ВЗ.Период,
//		|	ВЗ.Калькуляция,
//		|	ВЗ.Продукция,
//		|	ВЗ.ХарактеристикаПродукции,
//		|	ВЗ.Назначение,
//		|	ВЗ.ПартияСпецификацияПродукции,
//		|	ВЗ.ПартияСпецификацияПолуфабриката,
//		|	ВЗ.КлючПартия,
//		|	ВЗ.Полуфабрикат,
//		|	ВЗ.ХарактеристикаПолуфабриката,
//		|	ВЗ.Порядок,
//		|	ВЗ.Знаменатель,
//		|	ВЗ.РасчетЗавершен,
//		|	ВЗ.ЗаказНаПроизводство,
//		|	ВЗ.ПартияВыпущена
//		|";
//	
//	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

//КонецПроцедуры

//&Вместо("ТекстЗапросаВТОбъектыКалькуляции")
//Процедура бит_ТекстЗапросаВТОбъектыКалькуляции(Запрос, ТекстыЗапроса)
//	// Взята с релиза 1С:ERP Управление предприятием 2 (2.5.25.92)
//	ТекстЗапроса = 
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	ОбъектыКалькуляции.Номенклатура,
//		|	ОбъектыКалькуляции.Характеристика,
//		|	ОбъектыКалькуляции.Назначение,
//		|	ОбъектыКалькуляции.Объект
//		|ПОМЕСТИТЬ ВТОбъектыКалькуляции
//		|ИЗ
//		|	Документ.ПлановаяКалькуляция2_2.ОбъектыКалькуляции КАК ОбъектыКалькуляции
//		|ГДЕ
//		|	ОбъектыКалькуляции.Ссылка = &Ссылка";
//	ТекстыЗапроса.Добавить(ТекстЗапроса, "ВТОбъектыКалькуляции");
//	
//	ТекстЗапроса = 
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	ОбъектыКалькуляции.Объект КАК Объект,
//		|	ОбъектыКалькуляции.Объект ССЫЛКА Документ.ЗаказНаПроизводство2_2
//		|		И ВЫРАЗИТЬ(ОбъектыКалькуляции.Объект КАК Документ.ЗаказНаПроизводство2_2).ДинамическаяСтруктура КАК ДинамическаяСтруктура
//		|ПОМЕСТИТЬ ОбъектыКРазузлованию
//		|ИЗ
//		|	ВТОбъектыКалькуляции КАК ОбъектыКалькуляции
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Объект";
//	ТекстыЗапроса.Добавить(ТекстЗапроса, "ВТОбъектыКалькуляции");
//	
//	ТекстЗапроса = "ВЫБРАТЬ
//		|	ОбъектыКРазузлованию.Объект КАК Объект,
//		|	Реквизиты.ПроизводствоНаСтороне
//		|		ИЛИ Реквизиты.ПроизводствоНаСтороне2_5
//		|		ИЛИ Реквизиты.ВнутренняяПереработка КАК ПроизводствоНаСтороне,
//		|	Реквизиты.Спецификация КАК Спецификация,
//		|	Изделия.Номенклатура КАК Номенклатура,
//		|	Изделия.Характеристика КАК Характеристика,
//		|	Изделия.Назначение КАК Назначение,
//		|	Изделия.Ссылка КАК ВыпускающийЭтап,
//		|	Изделия.СписатьНаРасходы КАК СписатьНаРасходы,
//		|	ВЫБОР
//		|		КОГДА Реквизиты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)
//		|				ИЛИ Изделия.Произведено
//		|			ТОГДА ВЫБОР
//		|					КОГДА Реквизиты.ПроизводствоОднойДатой
//		|						ТОГДА Реквизиты.ДатаПроизводства <= &Период
//		|								И Реквизиты.ДатаПроизводства < &НеРассчитанныйПериодПоОрганизации
//		|					ИНАЧЕ Изделия.ДатаПроизводства <= &Период
//		|							И Изделия.ДатаПроизводства < &НеРассчитанныйПериодПоОрганизации
//		|				КОНЕЦ
//		|			ИНАЧЕ ЛОЖЬ
//		|	КОНЕЦ КАК ПартияВыпущена,
//		|	ВЫБОР
//		|		КОГДА Реквизиты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)
//		|				ИЛИ Изделия.Произведено
//		|			ТОГДА ВЫБОР
//		|					КОГДА Реквизиты.ПроизводствоОднойДатой
//		|						ТОГДА Реквизиты.ДатаПроизводства
//		|					ИНАЧЕ Изделия.ДатаПроизводства
//		|				КОНЕЦ
//		|		ИНАЧЕ Реквизиты.Дата
//		|	КОНЕЦ КАК ДатаПроизводства,
//		|	СУММА(ВЫБОР
//		|			КОГДА Изделия.ДоляСтоимости = 0
//		|				ТОГДА Изделия.Количество
//		|			ИНАЧЕ Изделия.ДоляСтоимости
//		|		КОНЕЦ) КАК ДоляСтоимости,
//		|	СУММА(Изделия.Количество) КАК Количество
//		|
//		|ПОМЕСТИТЬ ВыходныеИзделияПоЗаказу
//		|ИЗ
//		|	ОбъектыКРазузлованию КАК ОбъектыКРазузлованию
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК Изделия
//		|		ПО &УсловияСоединения
//		|
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК Реквизиты
//		|		ПО Изделия.Ссылка = Реквизиты.Ссылка
//		|			И Реквизиты.Проведен
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ОбъектыКРазузлованию.Объект,
//		|	Реквизиты.Дата,
//		|	Реквизиты.Спецификация,
//		|	Реквизиты.ПроизводствоНаСтороне,
//		|	Реквизиты.ПроизводствоНаСтороне2_5,
//		|	Реквизиты.ВнутренняяПереработка,
//		|	Изделия.Назначение,
//		|	Изделия.Номенклатура,
//		|	Изделия.Характеристика,
//		|	Изделия.Ссылка,
//		|	Изделия.СписатьНаРасходы,
//		|	Реквизиты.Статус,
//		|	Реквизиты.ПроизводствоОднойДатой,
//		|	Реквизиты.ДатаПроизводства,
//		|	Изделия.Произведено,
//		|	Изделия.ДатаПроизводства
//		|";
//	
//	ВыбираемыеПоля = Новый Структура;
//	ВыбираемыеПоля.Вставить("Номенклатура",   "ВыходныеИзделия.Номенклатура");
//	ВыбираемыеПоля.Вставить("Характеристика", "ВыходныеИзделия.Характеристика");
//	ВыбираемыеПоля.Вставить("Назначение",     "ВыходныеИзделия.Назначение");
//	ВыбираемыеПоля.Вставить("ДоляСтоимости",  "ВыходныеИзделия.ДоляСтоимости");
//	ВыбираемыеПоля.Вставить("Количество",     "ВыходныеИзделия.Количество");
//	
//	ТекстЗапроса = Документы.ЭтапПроизводства2_2.ПодставитьВыбираемыеПоля(ТекстЗапроса, ВыбираемыеПоля);
//	ТекстЗапроса = Документы.ЭтапПроизводства2_2.ПодставитьСоединениеДляПолученияВыходныхИзделий(ТекстЗапроса, 
//		"УсловияСоединения",
//		Новый Структура("Распоряжение", "ОбъектыКРазузлованию.Объект"));
//	ТекстыЗапроса.Добавить(ТекстЗапроса, "ВыходныеИзделияПоЗаказу");
//	
//	ТекстЗапроса = 
//		"ВЫБРАТЬ
//		|	ИзделияСпецификаций.Номенклатура КАК Номенклатура,
//		|	ИзделияСпецификаций.Характеристика КАК Характеристика,
//		|	ИзделияСпецификаций.Спецификация КАК Спецификация,
//		|	ИзделияСпецификаций.ДоляСтоимости КАК ДоляСтоимости,
//		|	ИзделияСпецификаций.ВсегоДолей КАК ВсегоДолей,
//		|	ИзделияСпецификаций.КоличествоИзделие КАК Количество
//		|ПОМЕСТИТЬ РезультатыРазузлования
//		|ИЗ
//		|	&ИзделияСпецификаций КАК ИзделияСпецификаций";
//	ТекстыЗапроса.Добавить(ТекстЗапроса, "РезультатыРазузлования");
//	
//	ТекстЗапроса = 
//		"ВЫБРАТЬ
//		|	ВТОбъектыКалькуляции.Номенклатура КАК Номенклатура,
//		|	ВТОбъектыКалькуляции.Характеристика КАК Характеристика,
//		|	ВТОбъектыКалькуляции.Объект КАК Спецификация,
//		|	МАКСИМУМ(РезультатыРазузлования.ДоляСтоимости) КАК ДоляСтоимости,
//		|	МАКСИМУМ(РезультатыРазузлования.Количество) КАК Количество
//		|ПОМЕСТИТЬ ВыходныеИзделияПоСпецификации
//		|ИЗ
//		|	ВТОбъектыКалькуляции КАК ВТОбъектыКалькуляции
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РезультатыРазузлования КАК РезультатыРазузлования
//		|		ПО ВТОбъектыКалькуляции.Номенклатура = РезультатыРазузлования.Номенклатура
//		|			И ВТОбъектыКалькуляции.Характеристика = РезультатыРазузлования.Характеристика
//		|			И ВТОбъектыКалькуляции.Объект = РезультатыРазузлования.Спецификация
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ВТОбъектыКалькуляции.Номенклатура,
//		|	ВТОбъектыКалькуляции.Характеристика,
//		|	ВТОбъектыКалькуляции.Объект";
//	ТекстыЗапроса.Добавить(ТекстЗапроса, "ВыходныеИзделияПоСпецификации");
//	
//	ТекстыЗапроса.Добавить(
//		ТекстЗапроса_ВыходныеИзделияПоЗаказуДинамическаяСтруктура(),
//		"ВыходныеИзделияПоЗаказуДинамическаяСтруктура"
//	);
//	
//	ТекстЗапроса = "
//		|ВЫБРАТЬ
//		|	ОбъектыКРазузлованию.Объект КАК Объект,
//		|	МАКСИМУМ(РезультатыРазузлования.ВсегоДолей) КАК ВсегоДолей,
//		|	0 ДоляПоВыпущеннымПартиям
//		|ПОМЕСТИТЬ ВсегоДолейСтоимости
//		|ИЗ
//		|	ОбъектыКРазузлованию КАК ОбъектыКРазузлованию
//		|		
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РезультатыРазузлования КАК РезультатыРазузлования
//		|		ПО ОбъектыКРазузлованию.Объект = РезультатыРазузлования.Спецификация
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ОбъектыКРазузлованию.Объект
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ВыходныеИзделияПоЗаказу.ВыпускающийЭтап КАК ВыпускающийЭтап,
//		|	СУММА(ВыходныеИзделияПоЗаказу.ДоляСтоимости) КАК ВсегоДолей,
//		|	СУММА(ВЫБОР
//		|				КОГДА ВыходныеИзделияПоЗаказу.ПартияВыпущена
//		|					ТОГДА ВыходныеИзделияПоЗаказу.ДоляСтоимости
//		|				ИНАЧЕ
//		|					0
//		|	КОНЕЦ) КАК ДоляПоВыпущеннымПартиям
//		|ИЗ
//		|	ВыходныеИзделияПоЗаказу КАК ВыходныеИзделияПоЗаказу
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ВыходныеИзделияПоЗаказу.ВыпускающийЭтап
//		|
//		|ИНДЕКСИРОВАТЬ ПО
//		|	Объект";
//	
//	ПараметрыПодстановки = ПроизводствоСервер.ПараметрыПодстановкиАлгоритмаРасчетаДолейСтоимости("Изделия", "Реквизиты.СпособРаспределенияЗатратНаВыходныеИзделия");
//	ПараметрыПодстановки.ДоляСтоимости = "&ДоляСтоимости";
//	ПараметрыПодстановки.СоединениеДоляСтоимости = "И &СоединениеДоляСтоимости";
//	ПараметрыПодстановки.Дата = "&Период";
//	
//	ПроизводствоСервер.ВыполнитьПодстановкуАлгоритмаРасчетаДолейСтоимости(ТекстЗапроса, ПараметрыПодстановки);
//	
//	ТекстыЗапроса.Добавить(ТекстЗапроса, "ВсегоДолейСтоимости");
//КонецПроцедуры

//// Текст запроса выходные изделия по заказу динамическая структура, необходим при старте расчета ПК,
//// для стартового сбора данных необходимых для расчета.
//// 
//// Возвращаемое значение:
////  Строка - Текст запроса выходные изделия по заказу динамическая структура
//Функция ТекстЗапроса_ВыходныеИзделияПоЗаказуДинамическаяСтруктура()
//	// Взята с релиза 1С:ERP Управление предприятием 2 (2.5.25.92)
//	Возврат "
//	|ВЫБРАТЬ
//	|	ОбъектыКРазузлованию.Объект КАК Объект,
//	|	СтруктураЗаказа.Спецификация КАК Спецификация,
//	|	СтруктураЗаказа.КлючПартия КАК КлючПартия,
//	|	СтруктураЗаказа.Номенклатура КАК Номенклатура,
//	|	СтруктураЗаказа.Характеристика КАК Характеристика,
//	|	СтруктураЗаказа.Назначение КАК Назначение,
//	|	СтруктураЗаказа.Этап КАК ВыпускающийЭтап,
//	|	1 КАК ДоляСтоимости,
//	|	СУММА(СтруктураЗаказа.Запланировано) КАК Количество
//	|ПОМЕСТИТЬ ВыходныеИзделияПоЗаказуДинамическаяСтруктура
//	|ИЗ
//	|	ОбъектыКРазузлованию КАК ОбъектыКРазузлованию
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураЗаказа КАК СтруктураЗаказа
//	|		ПО ОбъектыКРазузлованию.ДинамическаяСтруктура
//	|			И ОбъектыКРазузлованию.Объект = СтруктураЗаказа.ЗаказНаПроизводство
//	|			И СтруктураЗаказа.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции)
//	|			И СтруктураЗаказа.Этап Ссылка Справочник.ЭтапыПроизводства
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ОбъектыКРазузлованию.Объект,
//	|	СтруктураЗаказа.Спецификация,
//	|	СтруктураЗаказа.КлючПартия,
//	|	СтруктураЗаказа.Назначение,
//	|	СтруктураЗаказа.Номенклатура,
//	|	СтруктураЗаказа.Характеристика,
//	|	СтруктураЗаказа.Этап
//	|	
//	|ИМЕЮЩИЕ
//	|	СУММА(СтруктураЗаказа.Запланировано) > 0
//	|";
//	
//КонецФункции

//&Вместо("ЗаполнитьПараметрыИнициализации")
//Процедура бит_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
//	// Взята с релиза 1С:ERP Управление предприятием 2 (2.5.25.92)
//	РеквизитыДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Дата,Организация");
//	
//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
//	Запрос.УстановитьПараметр("Период", КонецДня(РеквизитыДокументов.Дата));
//	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.ВидЦеныПлановойСтоимостиТМЦ());
//	Запрос.УстановитьПараметр("НеРассчитанныйПериодПоОрганизации",
//		РегистрыСведений.ЗаданияКРасчетуСебестоимости.ПолучитьНеРассчитанныйПериодПоОрганизации(РеквизитыДокументов.Организация));
//	
//КонецПроцедуры

//Функция ЕстьАктивныеФоновыеЗадания(МассивЗаданий)
//    // Взята с релиза 1С:ERP Управление предприятием 2 (2.5.25.92)
//	Для Каждого Задание Из МассивЗаданий Цикл
//		Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
//			Возврат Истина;
//		КонецЕсли;
//	КонецЦикла;
//		
//КонецФункции

//Процедура ЗапускВыполненияФоновогоЗадания_НовыйРелиз(ДокументСсылка, ЭтоПроведение) Экспорт
//	// Взята с релиза 1С:ERP Управление предприятием 2 (2.5.25.92)
//	УстановитьПривилегированныйРежим(Истина);
//	
//	Уид = ДокументСсылка.УникальныйИдентификатор();
//	КлючПроведение = СтрШаблон("%1 ЭтоПроведение = %2", Уид, Истина);
//	КлючОтменаПроведения = СтрШаблон("%1 ЭтоПроведение = %2", Уид, Ложь);
//	
//	ОтборПроведение = Новый Структура();
//	ОтборПроведение.Вставить("Ключ", КлючПроведение);
//	ОтборПроведение.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
//	АктивныеЗаданияПроведения = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборПроведение);
//	
//	ОтборОтменаПроведения = Новый Структура();
//	ОтборОтменаПроведения.Вставить("Ключ", КлючОтменаПроведения);
//	ОтборОтменаПроведения.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
//	АктивныеЗаданияОтменыПроведения = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборОтменаПроведения);
//	
//	Если ЭтоПроведение Тогда
//		Если АктивныеЗаданияПроведения.Количество() > 0 Тогда
//			МассивЗаданий = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(АктивныеЗаданияПроведения, 5);
//			Если ЕстьАктивныеФоновыеЗадания(МассивЗаданий) Тогда
//				ВызватьИсключение НСтр("ru = 'Выполняется фоновое задание проведения документа, для отмены фонового задания проведения документа, необходимо распровести документ.';
//										|en = 'The document posting background job is in progress. To cancel the background job, unpost the document.'");
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если АктивныеЗаданияОтменыПроведения.Количество() > 0 Тогда
//			МассивЗаданий = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(АктивныеЗаданияОтменыПроведения, 5);
//			Если ЕстьАктивныеФоновыеЗадания(МассивЗаданий) Тогда
//				ВызватьИсключение НСтр("ru = 'Выполняется фоновое задание отмены проведения, перед проведением необходимо дождаться отмены проведения.';
//										|en = 'The posting cancellation background job is in progress. Before posting, wait for the posting to be canceled.'");
//			КонецЕсли;
//		КонецЕсли;
//		
//	ИначеЕсли АктивныеЗаданияПроведения.Количество() > 0 Или АктивныеЗаданияОтменыПроведения.Количество() > 0 Тогда
//		// В случаях, когда происходит отмена проведения и в этот момент активно задание проведения или отмены проведения,
//		// повторный запуск фонового задания не нужен, достаточно регистрации задачи отмены проведения,
//		// которая пишется в регистр сведений ОчередьРасчетаПлановыхКалькуляций, перед запуском этой процедуры.
//		Возврат;
//	КонецЕсли;
//	
//	НаименованиеЗадания = НСтр("ru = 'Проведение документа: %Ссылка%';
//								|en = 'Posting the document: %Ссылка%'");
//	НаименованиеЗадания = СтрЗаменить(НаименованиеЗадания, "%Ссылка%", ДокументСсылка);
//	
//	ИмяЭкспортнойПроцедуры = "РегистрыСведений.МножителиПартийИПолуфабрикатов.ВыполнитьПроведение";
//	
//	ПараметрыЭкспортнойПроцедуры = Новый Массив();
//	ПараметрыЭкспортнойПроцедуры.Добавить(Новый Структура("Калькуляция, ЭтоПроведение", ДокументСсылка, ЭтоПроведение));
//	
//	ПараметрыЗадания = Новый Массив();
//	ПараметрыЗадания.Добавить(ИмяЭкспортнойПроцедуры);
//	ПараметрыЗадания.Добавить(ПараметрыЭкспортнойПроцедуры);
//	
//	Ключ = ?(ЭтоПроведение, КлючПроведение, КлючОтменаПроведения);
//	ФоновыеЗадания.Выполнить("ОбщегоНазначения.ВыполнитьМетодКонфигурации", ПараметрыЗадания, Ключ, НаименованиеЗадания);

//	
//КонецПроцедуры



