#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.Тип = Перечисления.бит_мпд_ТипыПрезентацийОтчетности.PowerPoint;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет загружен ли макет презентации.
// 
// Возвращаемое значение:
//  Результат - Строка.
// 
Функция МакетЗагружен() Экспорт

	флЗагружен = ЭтотОбъект.МакетПрезентации.Получить() <> Неопределено;

	Возврат флЗагружен;
	
КонецФункции // МакетЗагружен()

// Процедура сохраняет макет.
// 
// Параметры:
//  ДанныеМакета - Строка.
// 
Процедура СохранитьМакет(ДанныеМакета) Экспорт

	ЭтотОбъект.МакетПрезентации = Новый  ХранилищеЗначения(ДанныеМакета);

КонецПроцедуры // СохранитьМакет()

// Функция извлекает макет.
// 
// Возвращаемое значение:
//  Результат - Строка.
// 
Функция ИзвлечьМакет() Экспорт

	ДанныеМакета = ЭтотОбъект.МакетПрезентации.Получить();
	
	Возврат ДанныеМакета;
	
КонецФункции // ИзвлечьМакет()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли