
#Область ОписаниеПеременных

&НаКлиенте 
Перем мКэшРеквизитовФормы; // Хранит текущие значения реквизитов формы. Клиент.

&НаКлиенте 
Перем мВыбранныйСчет; // Хранит выбранный счет. Клиент.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	// Открытие нового 
   	Если Параметры.Ключ.Пустая() Тогда
		
		УстановитьСостояниеДокумента();
		ЗаполнитьКэшЗначений();   
		
		// При копировании
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования)
			ИЛИ ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда  		
			ОбновитьФормуПоДаннымОбъекта();                                     		
		Иначе
			// Установить видимость реквизитов и заголовков колонок.	
			УстановитьВидимостьДоступностьПоРегиструБухгалтерии();
			УстановитьДоступностьТч();
		КонецЕсли;
	
	КонецЕсли;
				
	// Управление отображением счетов и субконто.
	фКоличествоСубконто = 4;
	ОформитьСчета();
	ОформитьРеквизиты();
	
	// Дата запрета редактирования	
	ЗапрещеноРедактировать = Ложь;
	Если Не Параметры.Ключ.Пустая() И Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		ПараметрыСверки = Новый Структура("Организация1, Контрагент2", Объект.Организация, Объект.Контрагент);	
		бит_вго_Сервер.ПроверитьВозможностьРедактированияДокументовСверкиВГО(Объект.Дата, ПараметрыСверки, ЗапрещеноРедактировать);
		
		Если Объект.Проведен Тогда
			ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип(фКэшЗначений.ИмяТипаОбъекта));
			ДокументОбъект.ПроверитьЗавершениеСверкиВГО(ЗапрещеноРедактировать);		
		КонецЕсли;
		
		ЭтотОбъект.ТолькоПросмотр = ЗапрещеноРедактировать;
			
	КонецЕсли;
	
	УстановитьПараметрыВыбораДляСчетов();
	
	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	мКэшРеквизитовФормы.Вставить("Дата");
	мКэшРеквизитовФормы.Вставить("НастройкаАктаСверки");
	мКэшРеквизитовФормы.Вставить("РегистрБухгалтерии");
	мКэшРеквизитовФормы.Вставить("Организация");
	мКэшРеквизитовФормы.Вставить("Контрагент");
	мКэшРеквизитовФормы.Вставить("Сценарий");
		
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьСостояниеДокумента();
	ВосстановитьНастройкиОформленияПоСчету();
	
	ЗаполнитьКэшЗначений();
	
	ОбновитьФормуПоДаннымОбъекта();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();
	ВосстановитьНастройкиОформленияПоСчету();	
	 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПараметрыОповещения = Новый Структура("Организация, Контрагент, Ссылка"
										, Объект.Организация, Объект.Контрагент, Объект.Ссылка);
	Оповестить("ИзмененДокументСверкиВГО", ПараметрыОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_вго_ПротоколРасхождений";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СтараяДата = мКэшРеквизитовФормы.Дата;
	
	Если Объект.Проводки.Количество() > 0 И Объект.Дата <> СтараяДата Тогда		
		Оповещение = Новый ОписаниеОповещения("ДатаПриИзмененииЗавершение", ЭтотОбъект, СтараяДата);
		ТекстВопроса = НСтр("ru='Дата документа изменена. Будут пересчитаны валютные суммы табличной части. Продолжить?';
							|en='Date of the document is changed. Tabular currency totals will be recalculated. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);		
	Иначе		
		ДобавитьВКэш("Дата");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаАктаСверкиПриИзменении(Элемент)
	
	Если Объект.НастройкаАктаСверки <> мКэшРеквизитовФормы.НастройкаАктаСверки Тогда
		
		Если Объект.Проводки.Количество() > 0 Тогда			
			Оповещение = Новый ОписаниеОповещения("НастройкаАктаСверкиПриИзмененииЗавершение", ЭтотОбъект);
			ТекстВопроса = НСтр("ru='Табличная часть будет очищена. Продолжить?';
								|en='Tabular section will be cleaned. Continue?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);			
		Иначе			
			ИзменениеНастройкиСервер();
		    ДобавитьВКэш("НастройкаАктаСверки");
			ДобавитьВКэш("РегистрБухгалтерии");			
		КонецЕсли;     		
				  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияКонсолидирующаяПриИзменении(Элемент)
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СтараяОрганизация = мКэшРеквизитовФормы.Организация;
	ТекОрганизация    = Объект.Организация;
	СтараяВалютаМСФО  = фКэшЗначений.ВалютаМСФО;
	ТекВалютаМСФО     = ПолучитьВалютуМСФО();
	
	ИзменитьОрганизацию 	= Истина;
	ПересчитыватьСуммыМСФО 	= Ложь;
	
	
	Если ЗначениеЗаполнено(ТекОрганизация) Тогда
		
		Если ТекОрганизация <> СтараяОрганизация Тогда
		
			Если Объект.Проводки.Количество() > 0 Тогда
				
				Если ИмяРегистраБухгалтерии = "бит_Дополнительный_2" И ТекВалютаМСФО <> СтараяВалютаМСФО Тогда				
					ТекстВопроса = НСтр("ru = 'Изменилась организация и валюта МСФО';
										|en = 'The organization and currency of IFRS have changed'") ;
					ПересчитыватьСуммыМСФО = Истина;
				Иначе
					ТекстВопроса = НСтр("ru = 'Изменилась организация'; en = 'The organization has changed'");
				КонецЕсли;
				
				// Структура дополнительных параметров для обработки оповещения.
				СтруктураДопПараметров = Новый Структура;
				СтруктураДопПараметров.Вставить("ПересчитыватьСуммыМСФО", ПересчитыватьСуммыМСФО);
				СтруктураДопПараметров.Вставить("СтараяВалютаМСФО"		, СтараяВалютаМСФО);
				СтруктураДопПараметров.Вставить("ТекВалютаМСФО"			, ТекВалютаМСФО);
				
				Оповещение = Новый ОписаниеОповещения("ОрганизацияПриИзмененииЗавершение", ЭтотОбъект, СтруктураДопПараметров);
				ТекстВопроса = ТекстВопроса + НСтр("ru='. Будут изменены данные табличной части. Продолжить?';
												   |en='. Table data will be changed. Continue?'");
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
				
			Иначе
				
				Если ИзменитьОрганизацию Тогда
					ИзменениеОрганизацииСервер(ПересчитыватьСуммыМСФО, СтараяВалютаМСФО, ТекВалютаМСФО);
					ДобавитьВКэш("Организация");
				Иначе	
					ИзвлечьИзКэша("Организация");
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
			
		УстановитьДоступностьТч();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	СтарыйКонтрагент  = мКэшРеквизитовФормы.Контрагент;
	ТекКонтрагент     = Объект.Контрагент;
		
	ИзменитьКонтрагента = Истина;
		
	Если ЗначениеЗаполнено(ТекКонтрагент) Тогда  
		
		Если ТекКонтрагент <> СтарыйКонтрагент Тогда
		
			Если Объект.Проводки.Количество() > 0 Тогда
				
				Оповещение = Новый ОписаниеОповещения("КонтрагентПриИзмененииЗавершение", ЭтотОбъект);
				ТекстВопроса = НСтр("ru='Изменен контрагент. Будут изменены данные табличной части. Продолжить?';
									|en='Company was changed. Tabular data will be changed. Continue?'");
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
				 			
			Иначе
				
				Если ИзменитьКонтрагента Тогда
					ИзменениеКонтрагентаСервер();
					ДобавитьВКэш("Контрагент");
				Иначе	
					ИзвлечьИзКэша("Контрагент");
				КонецЕсли;
				
			КонецЕсли;
						
		КонецЕсли;
		
	Иначе
		
		УстановитьДоступностьТч();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Сценарий) Тогда
	
		ТекВалютаСценария    = ПолучитьВалютуСценария();
		СтараяВалютаСценария = фКэшЗначений.ВалютаСценария; 
			
		Если Объект.Проводки.Количество() > 0 И ТекВалютаСценария <> СтараяВалютаСценария Тогда
			
			СтруктураДопПараметров = Новый Структура;
			СтруктураДопПараметров.Вставить("ТекВалютаСценария", ТекВалютаСценария);
			СтруктураДопПараметров.Вставить("СтараяВалютаСценария", СтараяВалютаСценария);
			
			Оповещение = Новый ОписаниеОповещения("СценарийПриИзмененииЗавершение", ЭтотОбъект, СтруктураДопПараметров);
			ТекстВопроса = НСтр("ru='Валюта сценария изменена. Будут пересчитаны суммы табличной части. Продолжить?';
								|en='Currency of scenario was changed. Totals in table will be recalculated. Continue?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
			
		Иначе
			
			фКэшЗначений.Вставить("ВалютаСценария", ТекВалютаСценария);
			Объект.ВалютаДокумента = ТекВалютаСценария;
			
			УстановитьДоступностьТч();
		
			ДобавитьВКэш("Сценарий");
			
		КонецЕсли;
		
	Иначе
		
		УстановитьДоступностьТч();
		
		ДобавитьВКэш("Сценарий");
		
	КонецЕсли;
	 	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиОперацияВГОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ТекущиеДанные = Элементы.Проводки.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СчетДт) И ЗначениеЗаполнено(ТекущиеДанные.СчетКт) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДтКт = ?(ТекущиеДанные.ЭтоСчетРасчетовДт, "Кт", "Дт"); 		
		ЭтоОплата  = фКэшЗначений.МассивСчетовОплаты.Найти(ТекущиеДанные["Счет" + ДтКт]) <> Неопределено;
		
		ИсключаемыйТипОперации = ?(ЭтоОплата
								, фКэшЗначений.Перечисления.бит_вго_ТипыОперацийВГО.НачислениеЗадолженности
								, фКэшЗначений.Перечисления.бит_вго_ТипыОперацийВГО.ПогашениеЗадолженности);
		
								
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТекущаяСтрока"			, ТекущиеДанные.ОперацияВГО);	
		ПараметрыФормы.Вставить("ИсключаемыйТипОперации", ИсключаемыйТипОперации);
		ОткрытьФорму("Справочник.бит_вго_ОперацииВГО.ФормаВыбора", ПараметрыФормы, Элемент);	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиОперацияВГОПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Проводки.ТекущиеДанные;	
	ТекущиеДанные.РучноеИзменениеОперацииВГО = ЗначениеЗаполнено(ТекущиеДанные.ОперацияВГО);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПроводки

&НаКлиенте
Процедура ПроводкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ЗаполнитьЗначенияСвойств(фКэшЗначений.КэшРеквизитовСтроки, Элемент.ТекущиеДанные); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.Проводки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка, есть ли изменения.
	ЕстьИзменения = Ложь;
	КэшРеквизитовСтроки = фКэшЗначений.КэшРеквизитовСтроки;
	Для каждого КлЗнч Из КэшРеквизитовСтроки Цикл
		ИмяРеквизита = КлЗнч.Ключ;
		Если ТекущиеДанные[ИмяРеквизита] <> КэшРеквизитовСтроки[ИмяРеквизита] Тогда
			ЕстьИзменения = Истина;
			Прервать;		
		КонецЕсли;	
	КонецЦикла;
	
	Если ЕстьИзменения Тогда		
		ТекИдентификатор 	 = ТекущиеДанные.ПолучитьИдентификатор();		
		УстановитьДанныеПоПравиламТрансляции(ТекИдентификатор);	
		ЭтотОбъект.Модифицированность = Истина;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Не Копирование Тогда
	
		Отказ = Истина;
		
		НоваяСтрока = Объект.Проводки.Добавить();
		НоваяСтрока.СчетДт = Элементы.ПроводкиСчетДт.ДоступныеТипы.ПривестиЗначение(НоваяСтрока.СчетДт);
		НоваяСтрока.СчетКт = Элементы.ПроводкиСчетКт.ДоступныеТипы.ПривестиЗначение(НоваяСтрока.СчетКт);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИмяРеквизита = ПолучитьИмяРеквизита(Элемент.Имя);
	
	ТекущиеДанные = Элементы.Проводки.ТекущиеДанные;
	Если ТекущиеДанные[ИмяРеквизита] = Неопределено Тогда
		ТекущиеДанные[ИмяРеквизита] = Элемент.ДоступныеТипы.ПривестиЗначение(ТекущиеДанные[ИмяРеквизита]);
	КонецЕсли;
	
	СтруктураДопПараметров = Новый Структура;
	СтруктураДопПараметров.Вставить("ТекущиеДанные", ТекущиеДанные);
	СтруктураДопПараметров.Вставить("ИмяРеквизита", ИмяРеквизита);
	
	ВыбратьСчетНемодально(Новый ОписаниеОповещения("ПроводкиСчетНачалоВыбораЗавершение", ЭтотОбъект, СтруктураДопПараметров), фКэшЗначений.МассивДоступныхСчетов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиСчетПриИзменении(Элемент)
	
	Идентификатор = Элементы.Проводки.ТекущиеДанные.ПолучитьИдентификатор();	
	ИмяРеквизита  = ПолучитьИмяРеквизита(Элемент.Имя);
	
	ИзменениеСчетаТабличноеПоле(Идентификатор, Прав(ИмяРеквизита, 2));
			
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиВалютаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Проводки.ТекущиеДанные;
	
	ИмяРеквизита = ПолучитьИмяРеквизита(Элемент.Имя);
	фКэшЗначений.Вставить(ИмяРеквизита, ТекущиеДанные[ИмяРеквизита]);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиВалютаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Проводки.ТекущиеДанные;
	
	ИмяВалюты = ПолучитьИмяРеквизита(Элемент.Имя);
	ИмяСуммы  = СтрЗаменить(ИмяВалюты, "Валюта", "ВалютнаяСумма");
	
	ВалютаНач = фКэшЗначений[ИмяВалюты];
	ВалютаКон = ТекущиеДанные[ИмяВалюты];
		
	Если ТекущиеДанные[ИмяСуммы] <> 0 И ВалютаНач <> ВалютаКон Тогда		
		ПересчитатьСуммуПоВалютеДляСтроки(ТекущиеДанные.ПолучитьИдентификатор(), ИмяСуммы, ВалютаНач, ВалютаКон);			
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Проводки.ТекущиеДанные;
	ИмяРеквизита  = ПолучитьИмяРеквизита(Элемент.Имя);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Владелец", Объект.Организация);
	
	НачалоВыбораРеквизитаЗаписи(Элемент, СтандартнаяОбработка, СтруктураПараметров, ТекущиеДанные[ИмяРеквизита]);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиСубконтоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Проводки.ТекущиеДанные;
	ИмяСубконто   = Лев(ПолучитьИмяРеквизита(Элемент.Имя), 11);
	
	ЗначениеСубконто  = ПолучитьЗначениеСубконтоТабПоле(ТекущиеДанные, Элемент.Имя);		
	ИзменениеСубконто(Элементы.Проводки.ТекущиеДанные, ЗначениеСубконто, ИмяСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Проводки.ТекущиеДанные;
	ИмяСубконто   = Лев(ПолучитьИмяРеквизита(Элемент.Имя), 11);
	
	ЗначениеСубконто  = ПолучитьЗначениеСубконтоТабПоле(ТекущиеДанные, Элемент.Имя);		
	НачалоВыбораСубконто(Элемент, СтандартнаяОбработка, ТекущиеДанные, ЗначениеСубконто, ИмяСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиСубконтоАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные    = Элементы.Проводки.ТекущиеДанные;
	ИмяСубконто      = ПолучитьИмяРеквизита(Элемент.Имя);	
	ЗначениеСубконто = ТекущиеДанные[ИмяСубконто];
	
	ПараметрыСубконто = Новый Структура;
	ПараметрыСубконто.Вставить("ИмяСубконто"       , Лев(ИмяСубконто, 11));
	ПараметрыСубконто.Вставить("ЗначениеСубконто"  , ЗначениеСубконто);
	ПараметрыСубконто.Вставить("КоличествоСубконто", фКоличествоСубконто);
	бит_БухгалтерияКлиент.СубконтоАвтоПодбор(Элемент, Параметры, ТекущиеДанные, Объект, ПараметрыСубконто);

КонецПроцедуры

&НаКлиенте
Процедура ПроводкиСуммаПриИзменении(Элемент)
	
	ИзменениеСуммыСтроки(Элемент.Имя, фКэшЗначений.ВалютаРеглУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиВалютнаяСуммаДтПриИзменении(Элемент)
	
	ИзменениеСуммыСтроки(Элемент.Имя, "ВалютаДт");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиВалютнаяСуммаКтПриИзменении(Элемент)
	
	ИзменениеСуммыСтроки(Элемент.Имя, "ВалютаКт");
 	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиСуммаМУПриИзменении(Элемент)
	
	ИзменениеСуммыСтроки(Элемент.Имя, фКэшЗначений.ВалютаМСФО);
   	                              	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиСуммаУпрПриИзменении(Элемент)
	                         
	ИзменениеСуммыСтроки(Элемент.Имя, фКэшЗначений.ВалютаУпрлУчета);
			
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиСуммаРеглПриИзменении(Элемент)
	
	ИзменениеСуммыСтроки(Элемент.Имя, фКэшЗначений.ВалютаРеглУчета);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПроводкиСуммаСценарийПриИзменении(Элемент)
	
	// ВалютаСценария = Объект.Сценарий.Валюта;
	ИзменениеСуммыСтроки(Элемент.Имя, фКэшЗначений.ВалютаСценария);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область ОбщиеСлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьФормуПоДаннымОбъекта()

	// Имя регистра бухгалтерии.
	УстановитьИмяРегистраБухгалтерии();
	
	// Заполним валюту МСФО.
	УстановитьВалютуДокумента();
	ЗаполнитьДекорациюВалютыМСФО();

	// Установить видимость реквизитов и заголовков колонок.	
	УстановитьВидимостьДоступностьПоРегиструБухгалтерии();
	УстановитьДоступностьТч();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	фКэшЗначений = Новый Структура;
	
	
	// Запишем параметр для формирования заголовка.
	фКэшЗначений.Вставить("ПредставлениеОбъекта", Метаданные.Документы.бит_вго_ПротоколРасхождений.ПредставлениеОбъекта);
	фКэшЗначений.Вставить("ИмяТипаОбъекта", "ДокументОбъект." + Метаданные.Документы.бит_вго_ПротоколРасхождений.Имя);
		
	// Валюты регламентированного и управленческого учетов, МСВО и сценария.
	фКэшЗначений.Вставить("ВалютаРеглУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	фКэшЗначений.Вставить("ВалютаУпрлУчета", Константы.бит_ВалютаУправленческогоУчета.Получить());
	фКэшЗначений.Вставить("ВалютаМСФО"	   , ПолучитьВалютуМСФО());
	фКэшЗначений.Вставить("ВалютаСценария" , ПолучитьВалютуСценария());
	 	
	Если ЗначениеЗаполнено(Объект.НастройкаАктаСверки) Тогда
		// Массив счетов расчетов по настройке.
		ПолучитьСчетаДляФильтров();
	КонецЕсли;
	
	// Инициализация структуры кэша реквизитов строки тч.
	КэшРеквизитовСтроки = Новый Структура;
	Для каждого РеквизитТч Из Метаданные.Документы[Метаданные.Документы.бит_вго_ПротоколРасхождений.Имя].ТабличныеЧасти.Проводки.Реквизиты Цикл
		КэшРеквизитовСтроки.Вставить(РеквизитТч.Имя);
	КонецЦикла;
	фКэшЗначений.Вставить("КэшРеквизитовСтроки", КэшРеквизитовСтроки);
	
	
	// Перечисления
	КэшПеречисления = Новый Структура;
	КэшПеречисления.Вставить("бит_вго_ТипыОперацийВГО", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_вго_ТипыОперацийВГО));
	
	фКэшЗначений.Вставить("Перечисления", КэшПеречисления);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПроводкиОперацияВГО");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Проводки.РучноеИзменениеОперацииВГО", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветГиперссылки);
			
КонецПроцедуры

&НаСервере 
Функция ПолучитьВалютуМСФО()
	
	// Получим валюту международного учета.
	ВалютаМСФО = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Объект.Организация);
	
	Возврат ВалютаМСФО;
	
КонецФункции

&НаСервере 
Функция ПолучитьВалютуСценария()
	
	// Получим валюту сценария.
	ВалютаСценария = ?(ЗначениеЗаполнено(Объект.Сценарий), Объект.Сценарий.Валюта, Справочники.Валюты.ПустаяСсылка());
		
	Возврат ВалютаСценария;
	
КонецФункции

&НаСервере 
Процедура ЗаполнитьДекорациюВалютыМСФО()
	
	// Получим строковое представление валюты международного учета.
	СтрокаВалютаМСФО = Строка(фКэшЗначений.ВалютаМСФО);
	
	Элементы.ВалютаМСФО.Заголовок = ?(ПустаяСтрока(СтрокаВалютаМСФО), "НЕ УСТАНОВЛЕНА", СтрокаВалютаМСФО);
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьДоступностьТч()
	
	ЭтотРегистр_Бюд = ИмяРегистраБухгалтерии = "бит_Бюджетирование";
	
	Элементы.ГруппаПроводки.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.НастройкаАктаСверки)
												ИЛИ Не ЗначениеЗаполнено(Объект.РегистрБухгалтерии)
												ИЛИ Не ЗначениеЗаполнено(Объект.Организация) 
												ИЛИ Не ЗначениеЗаполнено(Объект.Контрагент)
												ИЛИ (ЭтотРегистр_Бюд И Не ЗначениеЗаполнено(Объект.Сценарий));
			
КонецПроцедуры

&НаСервере 
Процедура УстановитьВидимостьДоступностьПоРегиструБухгалтерии()
	
	ЭтотРегистр_Бюд = Ложь;
	
	Если ЗначениеЗаполнено(Объект.РегистрБухгалтерии) Тогда
		
		// Настройки видимости.
		ЭтотРегистр_Хоз = ИмяРегистраБухгалтерии = "Хозрасчетный";
		ЭтотРегистр_Бюд = ИмяРегистраБухгалтерии = "бит_Бюджетирование";
		ЭтотРегистр_Упр = ИмяРегистраБухгалтерии = "бит_Дополнительный_1";
		ЭтотРегистр_Меж = ИмяРегистраБухгалтерии = "бит_Дополнительный_2"; 		
		
		// Видимость элементов формы.
		// Общие группы.
		Элементы.ПроводкиГруппаПоРегиструБухгалтерии.Видимость 	= Истина;
		Элементы.ГруппаСуммыДокумента.Видимость 			   	= Истина;
		Элементы.ГруппаСценарий.Видимость 						= ЭтотРегистр_Бюд;
		Элементы.ГруппаВалютаМСФО.Видимость						= ЭтотРегистр_Меж;
		// Суммы в шапке.
		Элементы.ГруппаСуммаДокумента.Видимость    	= ЭтотРегистр_Хоз;
		Элементы.ГруппаСуммыДокументаБИТ.Видимость 	= Не ЭтотРегистр_Хоз;
		Элементы.СуммаСценарий.Видимость 			= ЭтотРегистр_Бюд;
		Элементы.СуммаМУ.Видимость 					= ЭтотРегистр_Меж;
		// Суммы в табличной части.
		Элементы.ПроводкиГруппаСумма.Видимость 		= ЭтотРегистр_Хоз;
		Элементы.ПроводкиГруппаСуммыБИТ.Видимость 	= Не ЭтотРегистр_Хоз;
		Элементы.ПроводкиСуммаСценарий.Видимость    = ЭтотРегистр_Бюд;
		Элементы.ПроводкиСуммаМУ.Видимость          = ЭтотРегистр_Меж;
		// Измерения в табличной части.
		Элементы.ПроводкиГруппаЦФО.Видимость 		= ЭтотРегистр_Бюд;		
		Элементы.ПроводкиПодразделениеДт.Видимость 	= ЭтотРегистр_Хоз;
		Элементы.ПроводкиПодразделениеКт.Видимость 	= ЭтотРегистр_Хоз;
		
		// Авто отметки незаполненных.
		Элементы.Организация.АвтоОтметкаНезаполненного  = Не ЭтотРегистр_Бюд;
		Элементы.Сценарий.АвтоОтметкаНезаполненного 	= ЭтотРегистр_Бюд;
			
	Иначе
		
		// Видимость элементов формы.
		Элементы.ПроводкиГруппаПоРегиструБухгалтерии.Видимость 	= Ложь;
		Элементы.ГруппаСуммыДокумента.Видимость 			   	= Ложь;
		Элементы.ГруппаСценарий.Видимость 					   	= Ложь;
		Элементы.ГруппаВалютаМСФО.Видимость					   	= Ложь;
				
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Сценарий) И Не ЭтотРегистр_Бюд Тогда
		ИмяСправочникаСценарий = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();
		Объект.Сценарий = Справочники[ИмяСправочникаСценарий].ПустаяСсылка();
	КонецЕсли;
			
КонецПроцедуры // УстановитьВидимостьДоступностьПоРегиструБухгалтерии()

&НаСервере
Процедура УстановитьИмяРегистраБухгалтерии()

	Если ЗначениеЗаполнено(Объект.РегистрБухгалтерии) Тогда		
		ИмяРегистраБухгалтерии = Объект.РегистрБухгалтерии.ИмяОбъекта;
		ИмяПланаСчетов 		   = Метаданные.РегистрыБухгалтерии[ИмяРегистраБухгалтерии].ПланСчетов.Имя;
		МетаданныеПланаСчетов  = Метаданные.ПланыСчетов[ИмяПланаСчетов];		
	Иначе		
		ИмяРегистраБухгалтерии = "";
		ИмяПланаСчетов 		   = "";						
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВалютуДокумента()

	ЭтотРегистр_Хоз = ИмяРегистраБухгалтерии = "Хозрасчетный";
	ЭтотРегистр_Бюд = ИмяРегистраБухгалтерии = "бит_Бюджетирование";
	ЭтотРегистр_Меж = ИмяРегистраБухгалтерии = "бит_Дополнительный_2";
	
	Если ЭтотРегистр_Хоз Тогда
		Объект.ВалютаДокумента = фКэшЗначений.ВалютаРеглУчета;	
	ИначеЕсли ЭтотРегистр_Бюд Тогда
		Объект.ВалютаДокумента = фКэшЗначений.ВалютаСценария;	
	ИначеЕсли ЭтотРегистр_Меж Тогда
		Объект.ВалютаДокумента = фКэшЗначений.ВалютаМСФО;	
	Иначе
	    Объект.ВалютаДокумента = фКэшЗначений.ВалютаУпрлУчета;
	КонецЕсли;   	

КонецПроцедуры

&НаСервере
Процедура ПолучитьСчетаДляФильтров()

	СтруктураСчетов = бит_вго_Сервер.СчетаФильтрации(Объект.НастройкаАктаСверки);
	 				
	фКэшЗначений.Вставить("МассивСчетовРасчетов",  СтруктураСчетов.МассивСчетовРасчетов);
	фКэшЗначений.Вставить("МассивДоступныхСчетов", СтруктураСчетов.МассивДоступныхСчетов);
	фКэшЗначений.Вставить("МассивСчетовОборотов",  СтруктураСчетов.МассивСчетовОборотов);
	фКэшЗначений.Вставить("МассивСчетовОплаты"  ,  СтруктураСчетов.МассивСчетовОплаты);
		
КонецПроцедуры

&НаСервере
Процедура ИзменениеНастройкиСервер()

	Настройка = Объект.НастройкаАктаСверки;
	
	Объект.Проводки.Очистить();
	          	
	Если Объект.РегистрБухгалтерии <> Настройка.РегистрБухгалтерии Тогда
		Объект.РегистрБухгалтерии = Настройка.РегистрБухгалтерии;
		ИзменениеРегистраБухгалтерииСервер();	
	КонецЕсли;	
	
	ПолучитьСчетаДляФильтров();
	
	УстановитьДоступностьТч();
			
КонецПроцедуры

&НаСервере
Процедура ИзменениеРегистраБухгалтерииСервер()

	УстановитьИмяРегистраБухгалтерии();
	
	УстановитьВалютуДокумента();
	
	УстановитьВидимостьДоступностьПоРегиструБухгалтерии();
	ОформитьСчета();
		
КонецПроцедуры

&НаСервере
Процедура ИзменениеОрганизацииСервер(Знач ПересчитыватьСуммыМСФО, Знач СтараяВалютаМСФО, Знач ТекВалютаМСФО)
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип(фКэшЗначений.ИмяТипаОбъекта));			
   	ДокументОбъект.ВыполнитьДействияПриИзмененииОрганизации();
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	// Заполним декорацию валюты МСФО.
	фКэшЗначений.Вставить("ВалютаМСФО", ТекВалютаМСФО);
	ЗаполнитьДекорациюВалютыМСФО();
	
	УстановитьВалютуДокумента();
	
	// Действия при изменение валюты МСФО.
	Если ПересчитыватьСуммыМСФО Тогда
		ПересчитатьСуммыПоВалютам("СуммаМУ", СтараяВалютаМСФО, ТекВалютаМСФО);
	Иначе
		ВосстановитьНастройкиОформленияПоСчету();	
	КонецЕсли; 
	
	УстановитьДоступностьТч();  	
		
КонецПроцедуры

&НаСервере
Процедура ИзменениеКонтрагентаСервер()

	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип(фКэшЗначений.ИмяТипаОбъекта));			
	ДокументОбъект.ВыполнитьДействияПриИзмененииКонтрагента();
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	ВосстановитьНастройкиОформленияПоСчету();
	УстановитьДоступностьТч();	

КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеПоПравиламТрансляции(Знач ТекИдентификатор)
	
	ТекущиеДанные = Объект.Проводки.НайтиПоИдентификатору(ТекИдентификатор);	
	Если ТекущиеДанные.РучноеИзменениеОперацииВГО Тогда
		Возврат;	
	КонецЕсли;
			
	// Определяем максимальное количество субконто источника и приемника.
	ИмяПланаСчетовИсточник     = Метаданные.РегистрыБухгалтерии[ИмяРегистраБухгалтерии].ПланСчетов.Имя;
	КоличествоСубконтоИсточник = Метаданные.ПланыСчетов[ИмяПланаСчетов].МаксКоличествоСубконто;
	КоличествоСубконтоПриемник = 4;
	
	СтруктураПараметров = Новый Структура;	
	
	СтруктураПараметров.Вставить("СчетДт", ТекущиеДанные.СчетДт);
	СтруктураПараметров.Вставить("СчетКт", ТекущиеДанные.СчетКт);
	Для i = 1 По КоличествоСубконтоИсточник Цикл
		Попытка
			СтруктураПараметров.Вставить("СубконтоДт" + i , ТекущиеДанные["СубконтоДт_" + i]);
		Исключение
		   	СтруктураПараметров.Вставить("СубконтоДт" + i , Неопределено);
		КонецПопытки;
		Попытка
			СтруктураПараметров.Вставить("СубконтоКт" + i , ТекущиеДанные["СубконтоКт_" + i]);
		Исключение
		   	СтруктураПараметров.Вставить("СубконтоКт" + i , Неопределено);
		КонецПопытки;
	КонецЦикла;
	
	СтруктураПараметров.Вставить("ИмяРегистраБухгалтерии", ИмяРегистраБухгалтерии);
	СтруктураПараметров.Вставить("ИмяПланаСчетовИсточник", ИмяПланаСчетовИсточник);
	СтруктураПараметров.Вставить("КоличествоСубконтоИсточник", КоличествоСубконтоИсточник);
	СтруктураПараметров.Вставить("КоличествоСубконтоПриемник", КоличествоСубконтоПриемник);
	// ----------------------------------------------------------------------
	РезСтруктура = бит_вго_Сервер.ВыполнитьПодборСчетов(СтруктураПараметров                                                 
							   , Объект.Ссылка
							   , Объект.Организация
							   , Объект.Дата);
							   
	// Заполнение данных по найденным правилам трансляции.
	ЗаполнятьОперацию = Истина;
			
	Если ЗначениеЗаполнено(РезСтруктура.ОперацияВГО) Тогда
		
		ДтКт = ?(ТекущиеДанные.ЭтоСчетРасчетовДт, "Кт", "Дт"); 		
		ЭтоОбороты = фКэшЗначений.МассивСчетовОборотов.Найти(ТекущиеДанные["Счет" + ДтКт]) <> Неопределено;
		
		// Обороты должны соответствовоать начислению задолженности, а данные оплаты - погашению.
		Если ЭтоОбороты Тогда		
			Если ТекущиеДанные.ОперацияВГО.ТипОперации = Перечисления.бит_вго_ТипыОперацийВГО.ПогашениеЗадолженности Тогда
				ЗаполнятьОперацию = Ложь;
			КонецЕсли; 		
		Иначе
			Если ТекущиеДанные.ОперацияВГО.ТипОперации = Перечисления.бит_вго_ТипыОперацийВГО.НачислениеЗадолженности Тогда
				// ТекущиеДанные.НекорректнаяОперация = Истина;
			ИначеЕсли ТекущиеДанные.ОперацияВГО.ВидОперации = Перечисления.бит_вго_ВидыОперацийВГО.Техническая Тогда
				ЗаполнятьОперацию = Ложь;	
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

	Если ЗаполнятьОперацию Тогда
	 	ТекущиеДанные.ОперацияВГО = РезСтруктура.ОперацияВГО;
	КонецЕсли;
		 	
КонецПроцедуры // УстановитьДанныеПоПравиламТрансляции()

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункции

// Процедура выбирает счет
// 
&НаКлиенте
Процедура ВыбратьСчетНемодально(Знач Оповещение, МассивСчетов)
	
	мВыбранныйСчет = Неопределено;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", МассивСчетов));
	
	Обработчик = Новый ОписаниеОповещения("ВыбратьСчетЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение));
	ИмяФормы = СтрШаблон("ПланСчетов.%1.ФормаВыбора", ИмяПланаСчетов);
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, ЭтотОбъект,,,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

// Процедура завершает выбор счета
// 
&НаКлиенте
Процедура ВыбратьСчетЗавершение(ВыбранныйСчет, Параметры) Экспорт
	
	мВыбранныйСчет = ВыбранныйСчет;	
	
	ВыполнитьОбработкуОповещения(Параметры.Оповещение);
	
КонецПроцедуры

// Процедура завершает выбор счета в проводке.
// 
&НаКлиенте
Процедура ПроводкиСчетНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыбранныйСчет = мВыбранныйСчет;
	
	Если ЗначениеЗаполнено(ВыбранныйСчет) Тогда
		ДополнительныеПараметры.ТекущиеДанные[ДополнительныеПараметры.ИмяРеквизита] = ВыбранныйСчет;	 
	КонецЕсли;  
	
	ИзменениеСчетаТабличноеПоле(ДополнительныеПараметры.ТекущиеДанные.ПолучитьИдентификатор(), Прав(ДополнительныеПараметры.ИмяРеквизита, 2));
	
КонецПроцедуры

// Процедура - завершение изменения даты
// 
&НаКлиенте
Процедура ДатаПриИзмененииЗавершение(Ответ, СтараяДата) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПересчитатьВалютныеСуммыПоДате(СтараяДата);
	Иначе
		ИзвлечьИзКэша("Дата");
	КонецЕсли;
	
	ДобавитьВКэш("Дата");
	
КонецПроцедуры

// Процедура - завершение изменения реквизита НастройкаАктаСверки.
// 
&НаКлиенте
Процедура НастройкаАктаСверкиПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	НужноОчистить = Ответ = КодВозвратаДиалога.Да;
	
	Если НужноОчистить Тогда
		ИзменениеНастройкиСервер();
		ДобавитьВКэш("НастройкаАктаСверки");
		ДобавитьВКэш("РегистрБухгалтерии");
	Иначе
		ИзвлечьИзКэша("НастройкаАктаСверки");	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - завершение изменения реквизита Организация.
// 
&НаКлиенте
Процедура ОрганизацияПриИзмененииЗавершение(Ответ, СтруктураДопПараметров) Экспорт
	
	ИзменитьОрганизацию = Истина;
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ИзменитьОрганизацию = Ложь;			  
	КонецЕсли;
	
	Если ИзменитьОрганизацию Тогда
		ИзменениеОрганизацииСервер(СтруктураДопПараметров.ПересчитыватьСуммыМСФО, СтруктураДопПараметров.СтараяВалютаМСФО, СтруктураДопПараметров.ТекВалютаМСФО);
		ДобавитьВКэш("Организация");
	Иначе	
		ИзвлечьИзКэша("Организация");
	КонецЕсли;
	
КонецПроцедуры

// Процедура - завершение изменения реквизита Контрагент.
// 
&НаКлиенте
Процедура КонтрагентПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	ИзменитьКонтрагента = Истина;
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ИзменитьКонтрагента = Ложь;			  
	КонецЕсли;
	
	Если ИзменитьКонтрагента Тогда
		ИзменениеКонтрагентаСервер();
		ДобавитьВКэш("Контрагент");
	Иначе	
		ИзвлечьИзКэша("Контрагент");
	КонецЕсли;
	
КонецПроцедуры

// Процедура - завершение изменения реквизита Сценарий.
// 
&НаКлиенте
Процедура СценарийПриИзмененииЗавершение(Ответ, СтруктураДопПараметров) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПересчитатьСуммыПоВалютам("СуммаСценарий", СтруктураДопПараметров.СтараяВалютаСценария, СтруктураДопПараметров.ТекВалютаСценария);
		фКэшЗначений.Вставить("ВалютаСценария", СтруктураДопПараметров.ТекВалютаСценария);
		Объект.ВалютаДокумента = СтруктураДопПараметров.ТекВалютаСценария;
	Иначе	
		ИзвлечьИзКэша("Сценарий");
	КонецЕсли;
	
	УстановитьДоступностьТч();
		
	ДобавитьВКэш("Сценарий");
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	мКэшРеквизитовФормы[ИмяРеквизита] = Объект[ИмяРеквизита];	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзвлечьИзКэша(ИмяРеквизита)
	
	Объект[ИмяРеквизита] = мКэшРеквизитовФормы[ИмяРеквизита];
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.ПроводкиСчетДт);
	МассивЭлементов.Добавить(Элементы.ПроводкиСчетКт);
	
	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьИмяРеквизита(ИмяЭлемента)

	ИмяРеквизита  = СтрЗаменить(ИмяЭлемента, "Проводки", "");

	Возврат ИмяРеквизита;
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗначениеСубконтоТабПоле(ТекущиеДанные, ИмяЭлемента)

	ЗначениеСубконто = Неопределено;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ИмяРеквизита     = ПолучитьИмяРеквизита(ИмяЭлемента);
		ЗначениеСубконто = ТекущиеДанные[ИмяРеквизита];
		
	КонецЕсли; 

	Возврат ЗначениеСубконто;
	
КонецФункции

&НаКлиенте
Процедура ИзменениеСубконто(Контейнер, ЗначениеСубконто, ИмяСубконто)

	СтруктураСубконто = бит_БухгалтерияКлиент.ПодготовитьСтруктуруСубконто(Контейнер, ИмяСубконто , фКоличествоСубконто);
	бит_БухгалтерияВызовСервера.ОбработатьИзменениеСубконто(СтруктураСубконто, ИмяСубконто, ЗначениеСубконто  , фКоличествоСубконто);
	бит_БухгалтерияКлиент.ЗаполнитьСубконтоПоСтруктуре(СтруктураСубконто, Контейнер, ИмяСубконто, ""  , фКоличествоСубконто);																   

КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораРеквизитаЗаписи(Элемент, СтандартнаяОбработка, СтруктураПараметров, ЗначениеРеквизита)
	
	// Установим параметры выбора субконто.
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураПараметров); 
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораСубконто(Элемент, СтандартнаяОбработка, Контейнер, ЗначениеСубконто, ИмяСубконто)
	
	ТипЭлемента = ТипЗнч(ЗначениеСубконто);																					  
	Если ТипЭлемента = Тип("СправочникСсылка.Контрагенты") Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Проводки.ТекущиеДанные;
		ТекущиеДанные[ПолучитьИмяРеквизита(Элемент.Имя)] = Объект.Контрагент;
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = бит_БухгалтерияКлиент.ПодготовитьПараметрыВыбораСубконто(Контейнер, 
		ИмяСубконто, ЗначениеСубконто, фКоличествоСубконто, Объект);	
																						  
	Если ТипЭлемента = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда 	 	
		СтруктураПараметров.Вставить("Контрагент", Объект.Контрагент);
		СтруктураПараметров.Вставить("Владелец"  , Объект.Контрагент);
	КонецЕсли;
	
	НачалоВыбораРеквизитаЗаписи(Элемент, СтандартнаяОбработка, СтруктураПараметров, ЗначениеСубконто); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеСуммыСтроки(ИмяЭлемента, Валюта)
	
	ТекущиеДанные = Элементы.Проводки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИндексСтроки = Объект.Проводки.Индекс(ТекущиеДанные);
	
	ИмяРесурса = ПолучитьИмяРеквизита(ИмяЭлемента);
	Если ТипЗнч(Валюта) = Тип("Строка") Тогда
		Валюта = ТекущиеДанные[Валюта];
	КонецЕсли;
	
	// Выполним расчет сумм в текущей строке.
	ВыполнитьРасчетСуммВТекущейСтрокеСервер(ИндексСтроки, ИмяРесурса, Валюта);
	                		                              	
КонецПроцедуры

#КонецОбласти

#Область ОформлениеСчетовИСубконто

&НаСервере
Процедура УстановитьПараметрыОформленияПоСчету(СтрокаТаблицы, ИмяСчета)

	Постфикс = СтрЗаменить(ИмяСчета, "Счет", "");
	
	ТекущийСчет = СтрокаТаблицы[ИмяСчета];
	Если ТекущийСчет <> Неопределено Тогда
        
        СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущийСчет);
        
		// Количество доступных субконто.
		СтрокаТаблицы["КоличествоДоступныхСубконто" + Постфикс] = СвСч.КоличествоСубконто;   
        
		// Счет валютный.
		СтрокаТаблицы[ИмяСчета + "Валютный"] = СвСч.Валютный;
		Если Не СвСч.Валютный Тогда
        	СтрокаТаблицы["Валюта" + Постфикс] 		  = Неопределено;
			СтрокаТаблицы["ВалютнаяСумма" + Постфикс] = 0;
       	КонецЕсли;
		
		// Счет количественный.
		СтрокаТаблицы[ИмяСчета + "Количественный"] = СвСч.Количественный;
		Если Не СвСч.Количественный Тогда
        	СтрокаТаблицы["Количество" + Постфикс] = 0;
       	КонецЕсли;
		
		Если ИмяРегистраБухгалтерии = "Хозрасчетный" Тогда
			// Счет использует учет по подразделениям.
			СтрокаТаблицы[ИмяСчета + "УчетПоПодразделениям"] = СвСч.УчетПоПодразделениям;
			Если Не СвСч.УчетПоПодразделениям Тогда
            	СтрокаТаблицы["Подразделение" + Постфикс] = Неопределено;
   	    	КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 	
 	
КонецПроцедуры
		
&НаСервере
Процедура ОформитьСчета()
	
	Если Не ЗначениеЗаполнено(Объект.РегистрБухгалтерии) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТипаДляСчетов = "ПланСчетовСсылка." + ИмяПланаСчетов;
		
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип(ИмяТипаДляСчетов));
	ОписаниеТиповСчета = Новый ОписаниеТипов(МассивТипов);
	
	Элементы.ПроводкиСчетДт.ВыбиратьТип   = Ложь;
	Элементы.ПроводкиСчетДт.ДоступныеТипы = ОписаниеТиповСчета;
	
	Элементы.ПроводкиСчетКт.ВыбиратьТип   = Ложь;
	Элементы.ПроводкиСчетКт.ДоступныеТипы = ОписаниеТиповСчета;

КонецПроцедуры

&НаСервере 
Процедура ОформитьРеквизитыПоСчету(ИмяСчета)
	 	
	Постфикс 			   = СтрЗаменить(ИмяСчета, "Счет", "");
	ИмяКоличестваДоступных = "КоличествоДоступныхСубконто" + Постфикс;
	ИмяСубконто			   = "Субконто" + Постфикс + "_";	
	
	// Устанавливаем связи параметров выбора и связи по типу субконто.
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы,
		ИмяСчета, ИмяСубконто, фКоличествоСубконто, "Проводки", "Элементы.Проводки.ТекущиеДанные");
												  
	// Восстанавливаем настройки субконто, валюты, валютной суммы в зависимости от счета учета.
	Для каждого СтрокаТаблицы Из Объект.Проводки Цикл
		УстановитьПараметрыОформленияПоСчету(СтрокаТаблицы, ИмяСчета);
	КонецЦикла; 

	// Настройки оформления для полей субконто.
	бит_БухгалтерскийУчет.УстановитьОформлениеСубконтоТаблицы(УсловноеОформление,
		"Проводки", ИмяСубконто, ИмяКоличестваДоступных, фКоличествоСубконто);
															   
	// Настройки оформления для остальных полей по счету.
	бит_БухгалтерскийУчет.УстановитьОформлениеПолейПоСчету(УсловноеОформление, "Проводки", Постфикс);										
																	
КонецПроцедуры

&НаСервере 
Процедура ОформитьРеквизиты()

	// Удалить старое оформление таблицы.
	бит_РаботаСДиалогамиСервер.УдалитьЭлементыОформленияПоПредставлению("Оформление субконто таблицы", УсловноеОформление);
	бит_РаботаСДиалогамиСервер.УдалитьЭлементыОформленияПоПредставлению("Оформление полей по счету"  , УсловноеОформление);
	
	// Установить оформление и связи.
	ОформитьРеквизитыПоСчету("СчетДт");
	ОформитьРеквизитыПоСчету("СчетКт");
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиОформленияПоСчету()

	Для каждого СтрокаТаблицы Из Объект.Проводки Цикл
		
		УстановитьПараметрыОформленияПоСчету(СтрокаТаблицы, "СчетДт");
		УстановитьПараметрыОформленияПоСчету(СтрокаТаблицы, "СчетКт");
		
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ИзменениеСчетаТабличноеПоле(Знач Идентификатор, Знач ДтКт)
	
	ИмяСчета = "Счет" + ДтКт;
	ИмяСубконто = "Субконто" + ДтКт + "_";
	
	ТекущиеДанные = Объект.Проводки.НайтиПоИдентификатору(Идентификатор);
	
	// Признак - это счет расчетов.
	ТекущиеДанные["ЭтоСчетРасчетов" + ДтКт] = фКэшЗначений.МассивСчетовРасчетов.Найти(ТекущиеДанные[ИмяСчета]) <> Неопределено;

	// Настройки субконто.
	Если ЗначениеЗаполнено(ТекущиеДанные[ИмяСчета]) Тогда
		НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(ТекущиеДанные[ИмяСчета], фКоличествоСубконто);									  
    	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(ТекущиеДанные, НастройкиСубконто, ИмяСубконто);
	КонецЕсли;
	
	УстановитьПараметрыОформленияПоСчету(ТекущиеДанные, ИмяСчета);	
		
КонецПроцедуры

#КонецОбласти

#Область СерверныеПроцедурыИФункцииПересчетаСуммТабличнойЧасти

&НаСервере
Процедура ВыполнитьРасчетСуммВТекущейСтрокеСервер(Знач ИндексСтроки, Знач ИмяРесурса, Знач Валюта)
	
	СтруктураВалют = Новый Структура;
	СтруктураВалют.Вставить("ВалютаДляПересчета", Валюта);
	СтруктураВалют.Вставить("ВалютаМСФО",		  фКэшЗначений.ВалютаМСФО);
	СтруктураВалют.Вставить("ВалютаРеглУчета",	  фКэшЗначений.ВалютаРеглУчета);
	СтруктураВалют.Вставить("ВалютаУпрлУчета",	  фКэшЗначений.ВалютаУпрлУчета);
									
	// Обращение к модулю объекта.
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип(фКэшЗначений.ИмяТипаОбъекта));	
	ДокументОбъект.ВыполнитьРасчетСуммВТекущейСтроке(ИндексСтроки, СтруктураВалют, ИмяРесурса); 
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	ВосстановитьНастройкиОформленияПоСчету();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуПоВалютеДляСтроки(Знач ИдСтроки, Знач ИмяСуммы, Знач ВалютаНач, Знач ВалютаКон)

	ТекущиеДанные = Объект.Проводки.НайтиПоИдентификатору(ИдСтроки);
	
	// Обращение к модулю объекта.
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип(фКэшЗначений.ИмяТипаОбъекта));			
   	СуммаРезультат = ДокументОбъект.ПересчитатьСуммуПоНовойВалюте(ТекущиеДанные[ИмяСуммы], ВалютаНач, ВалютаКон);
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	ТекущиеДанные[ИмяСуммы] = СуммаРезультат;
	
	ВосстановитьНастройкиОформленияПоСчету();

КонецПроцедуры

&НаСервере
Процедура ПересчитатьВалютныеСуммыПоДате(Знач СтараяДата)

	// Обращение к модулю объекта.
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип(фКэшЗначений.ИмяТипаОбъекта));			
   	ДокументОбъект.ВыполнитьПерерасчетВалютныхСуммПоДатам(СтараяДата);
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
    ВосстановитьНастройкиОформленияПоСчету();

КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыПоВалютам(Знач ИмяСуммы, Знач СтараяВалюта, Знач НоваяВалюта)
	
	// Обращение к модулю объекта.
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип(фКэшЗначений.ИмяТипаОбъекта));			
   	ДокументОбъект.ВыполнитьПерерасчетСуммПоВалютам(ИмяСуммы, СтараяВалюта, НоваяВалюта);
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
    ВосстановитьНастройкиОформленияПоСчету();

КонецПроцедуры

#КонецОбласти

#КонецОбласти
