//Первыйбит ЛТ1 + ЛТ1.1 + ЛТ1.3 + ЛТ2 + ЛТ3 ЛапшовГ "GVLapshov@1cbit.ru" 09.09.2024 +   
#Область ОбщиеПроцедурыИФункции
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВызовИзФормы = Параметры.Свойство("ОбъектыНазначения");
	Если ВызовИзФормы Тогда
		Если ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("СправочникСсылка.БанковскиеСчетаКонтрагентов") Тогда
			Объект.ИдентификаторСправочника = "БанковскиеСчетаКонтрагентов";  
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций") Тогда 
			Объект.ИдентификаторСправочника = "БанковскиеСчетаОрганизаций";
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("СправочникСсылка.Контрагенты") Тогда 
			Объект.ИдентификаторСправочника = "Контрагенты";
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("СправочникСсылка.Партнеры") Тогда   
			Объект.ИдентификаторСправочника = "Партнеры";
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда 
			Объект.ИдентификаторСправочника = "ДоговорыКонтрагентов"; 
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда 
			Объект.ИдентификаторСправочника = "ВидыНоменклатуры"; 	
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("СправочникСсылка.Номенклатура") Тогда 
			Объект.ИдентификаторСправочника = "Номенклатура";	
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("СправочникСсылка.КлассификаторБанков") Тогда 
			Объект.ИдентификаторСправочника = "Банки";
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("ПланВидовХарактеристикСсылка.бит_ПризнакиНоменклатуры") Тогда 
			Объект.ИдентификаторСправочника = "ПризнакиНоменклатуры";
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("ПланВидовХарактеристикСсылка.бит_ПризнакиКонтрагентов") Тогда 
			Объект.ИдентификаторСправочника = "АтрибутыКонтрагентов";	
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("СправочникСсылка.ВидыРабочихЦентров") Тогда 
			Объект.ИдентификаторСправочника = "ВидыРабочихЦентров";
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("СправочникСсылка.РабочиеЦентры") Тогда 
			Объект.ИдентификаторСправочника = "РабочиеЦентры";
		ИначеЕсли ТипЗнч(Параметры.ОбъектыНазначения[0]) = Тип("СправочникСсылка.РесурсныеСпецификации") Тогда                    
			Объект.ИдентификаторСправочника = "Спецификации";
		Иначе    
			Объект.ИдентификаторСправочника = ""; 
		КонецЕсли;
	Иначе 
		Объект.ИдентификаторСправочника = ""; 
	КонецЕсли;
	
	Дата = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
		Элементы.ПутьКФайлу.КнопкаВыбора = Ложь;
	КонецЕсли;
	
	ИдентификаторСостояния = "Состояние0";
	ТаблицыСкрытьОчиститьСопоставление();
	ТаблицыСкрытьОчиститьСоздание();
	
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицыСкрытьОчиститьСопоставление()
	
	Элементы.Дата1.Видимость = Ложь;
	
	Элементы.ИсточникБанковскиеСчетаКонтрагентов.Видимость 	= Ложь;
	Элементы.ИсточникБанковскиеСчетаОрганизаций.Видимость 	= Ложь;
	Элементы.ИсточникДоговорыКонтрагентов.Видимость 		= Ложь;
	Элементы.ИсточникПартнеры.Видимость 					= Ложь; 
	Элементы.ИсточникВидыНоменклатуры.Видимость 			= Ложь; 
	Элементы.ИсточникНоменклатура.Видимость 				= Ложь;
	Элементы.ИсточникПризнакиНоменклатуры.Видимость 		= Ложь;
	Элементы.ИсточникБанки.Видимость 						= Ложь; 
	Элементы.ИсточникАтрибутыКонтрагентов.Видимость 		= Ложь; 
	Элементы.ИсточникВидыРабочихЦентров.Видимость 			= Ложь;
	Элементы.ИсточникРабочиеЦентры.Видимость 				= Ложь;
	Элементы.ИсточникСпецификации.Видимость 				= Ложь;
	Элементы.ИсточникОходыСпецификаций.Видимость 			= Ложь;
	
	ИсточникБанковскиеСчетаКонтрагентов.Очистить();
    ИсточникБанковскиеСчетаОрганизаций.Очистить();
	ИсточникДоговорыКонтрагентов.Очистить();
	ИсточникПартнеры.Очистить(); 
	ИсточникВидыНоменклатуры.Очистить();
	ИсточникНоменклатура.Очистить();
	ИсточникПризнакиНоменклатуры.Очистить();
	ИсточникБанки.Очистить();
	ИсточникАтрибутыКонтрагентов.Очистить();
	ИсточникВидыРабочихЦентров.Очистить();
	ИсточникРабочиеЦентры.Очистить();
	ИсточникСпецификации.Очистить();
	ИсточникОходыСпецификаций.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыСкрытьОчиститьСоздание()

	Элементы.дата1.Видимость = Ложь;
	
	Элементы.ОшибокБанковскиеСчетаКонтрагентов.Видимость 	= Ложь;
	Элементы.ОшибокБанковскиеСчетаОрганизаций.Видимость 	= Ложь;
	Элементы.ОшибокДоговорыКонтрагентов.Видимость 			= Ложь;
	Элементы.ОшибокПартнеры.Видимость 						= Ложь; 
	Элементы.ОшибокВидыНоменклатуры.Видимость            	= Ложь;
	Элементы.ОшибокНоменклатура.Видимость                	= Ложь;
	Элементы.ОшибокПризнакиНоменклатуры.Видимость          	= Ложь;
	Элементы.ОшибокБанки.Видимость   		             	= Ложь; 
	Элементы.ОшибокАтрибутыКонтрагентов.Видимость   	   	= Ложь;
	Элементы.ОшибокВидыРабочихЦентров.Видимость   	       	= Ложь;
	Элементы.ОшибокРабочиеЦентры.Видимость   		       	= Ложь;
	Элементы.ОшибокСпецификации.Видимость   		       	= Ложь;
	Элементы.ОшибокОходыСпецификаций.Видимость   		    = Ложь;
	
	Элементы.ПроверкиБанковскиеСчетаКонтрагентов.Видимость 	= Ложь;
	Элементы.ПроверкиБанковскиеСчетаОрганизаций.Видимость 	= Ложь;
	Элементы.ПроверкиДоговорыКонтрагентов.Видимость 		= Ложь;
	Элементы.ПроверкиПартнеры.Видимость 					= Ложь;
	Элементы.ПроверкиВидыНоменклатуры.Видимость             = Ложь;
	Элементы.ПроверкиНоменклатура.Видимость              	= Ложь;
	Элементы.ПроверкиПризнакиНоменклатуры.Видимость        	= Ложь;
	Элементы.ПроверкиБанки.Видимость     		         	= Ложь;
	Элементы.ПроверкиАтрибутыКонтрагентов.Видимость        	= Ложь;
	Элементы.ПроверкиВидыРабочихЦентров.Видимость          	= Ложь;
	Элементы.ПроверкиРабочиеЦентры.Видимость   		       	= Ложь;
	Элементы.ПроверкиСпецификации.Видимость   		       	= Ложь;
	Элементы.ПроверкиОходыСпецификаций.Видимость   	       	= Ложь;
	
	Элементы.СозданиеБанковскиеСчетаКонтрагентов.Видимость 	= Ложь;
	Элементы.СозданиеБанковскиеСчетаОрганизаций.Видимость 	= Ложь;
	Элементы.СозданиеДоговорыКонтрагентов.Видимость 		= Ложь;
	Элементы.СозданиеПартнеры.Видимость 					= Ложь;  
	Элементы.СозданиеВидыНоменклатуры.Видимость          	= Ложь;
	Элементы.СозданиеНоменклатура.Видимость              	= Ложь;  
	Элементы.СозданиеПризнакиНоменклатуры.Видимость        	= Ложь;
	Элементы.СозданиеБанки.Видимость     		         	= Ложь;
	Элементы.СозданиеАтрибутыКонтрагентов.Видимость        	= Ложь;
    Элементы.СозданиеВидыРабочихЦентров.Видимость          	= Ложь;
	Элементы.СозданиеРабочиеЦентры.Видимость   		       	= Ложь;
	Элементы.СозданиеСпецификации.Видимость   	          	= Ложь;
	Элементы.СозданиеОходыСпецификаций.Видимость           	= Ложь;
	
	ОшибокБанковскиеСчетаКонтрагентов.Очистить();
	ОшибокБанковскиеСчетаОрганизаций.Очистить();
	ОшибокДоговорыКонтрагентов.Очистить();
    ОшибокПартнеры.Очистить();  
	ОшибокВидыНоменклатуры.Очистить(); 
	ОшибокНоменклатура.Очистить(); 
	ОшибокПризнакиНоменклатуры.Очистить();
	ОшибокБанки.Очистить();
	ОшибокАтрибутыКонтрагентов.Очистить();
    ОшибокВидыРабочихЦентров.Очистить();
    ОшибокРабочиеЦентры.Очистить();
    ОшибокСпецификации.Очистить();
	ОшибокОходыСпецификаций.Очистить();

    ПроверкиБанковскиеСчетаКонтрагентов.Очистить();
	ПроверкиБанковскиеСчетаОрганизаций.Очистить();
	ПроверкиДоговорыКонтрагентов.Очистить();
	ПроверкиПартнеры.Очистить();
	ПроверкиВидыНоменклатуры.Очистить(); 
	ПроверкиНоменклатура.Очистить(); 
	ПроверкиПризнакиНоменклатуры.Очистить(); 
	ПроверкиБанки.Очистить(); 
	ПроверкиАтрибутыКонтрагентов.Очистить();
	ПроверкиВидыРабочихЦентров.Очистить();
	ПроверкиРабочиеЦентры.Очистить();
	ПроверкиСпецификации.Очистить();
	ПроверкиОходыСпецификаций.Очистить();

	СозданиеБанковскиеСчетаКонтрагентов.Очистить();
	СозданиеБанковскиеСчетаОрганизаций.Очистить();
	СозданиеДоговорыКонтрагентов.Очистить();
	СозданиеПартнеры.Очистить(); 
	СозданиеВидыНоменклатуры.Очистить(); 
	СозданиеНоменклатура.Очистить();
	СозданиеПризнакиНоменклатуры.Очистить();
	СозданиеБанки.Очистить();
	СозданиеАтрибутыКонтрагентов.Очистить();
	СозданиеВидыРабочихЦентров.Очистить();
	СозданиеРабочиеЦентры.Очистить();
	СозданиеСпецификации.Очистить();
	СозданиеОходыСпецификаций.Очистить();
	
КонецПроцедуры

&НаСервере
Функция УстановитьСоответствиеРеквизитовБанка()
	
	СоответствиеРеквизитовБанка = Новый Соответствие;
	СоответствиеРеквизитовБанка.Вставить("БИКБанка", "БИК");
	СоответствиеРеквизитовБанка.Вставить("СВИФТБанка", "СВИФТ");
	СоответствиеРеквизитовБанка.Вставить("КоррСчетБанка", "КоррСчет");
	СоответствиеРеквизитовБанка.Вставить("НаименованиеБанка", "Наименование");
	СоответствиеРеквизитовБанка.Вставить("НаименованиеБанкаМеждународное", "НаименованиеМеждународное");
	СоответствиеРеквизитовБанка.Вставить("СтранаБанка", "Страна");
	СоответствиеРеквизитовБанка.Вставить("ГородБанка", "Город");
	СоответствиеРеквизитовБанка.Вставить("ГородБанкаМеждународный", "ГородМеждународный");
	СоответствиеРеквизитовБанка.Вставить("АдресБанка", "Адрес");
	СоответствиеРеквизитовБанка.Вставить("АдресБанкаМеждународный", "АдресМеждународный");
	СоответствиеРеквизитовБанка.Вставить("ТелефоныБанка", "Телефоны");
	СоответствиеРеквизитовБанка.Вставить("БИКБанкаДляРасчетов", "БИК");
	СоответствиеРеквизитовБанка.Вставить("СВИФТБанкаДляРасчетов", "СВИФТ");
	СоответствиеРеквизитовБанка.Вставить("НаименованиеБанкаДляРасчетов", "Наименование");
	СоответствиеРеквизитовБанка.Вставить("НаименованиеБанкаДляРасчетовМеждународное", "НаименованиеМеждународное");
	СоответствиеРеквизитовБанка.Вставить("КоррСчетБанкаДляРасчетов", "КоррСчет");
	СоответствиеРеквизитовБанка.Вставить("СтранаБанкаДляРасчетов", "Страна");
	СоответствиеРеквизитовБанка.Вставить("ГородБанкаДляРасчетов", "Город");
	СоответствиеРеквизитовБанка.Вставить("ГородБанкаДляРасчетовМеждународный", "ГородМеждународный");
	СоответствиеРеквизитовБанка.Вставить("АдресБанкаДляРасчетов", "Адрес");
	СоответствиеРеквизитовБанка.Вставить("АдресБанкаДляРасчетовМеждународный", "АдресМеждународный");
	СоответствиеРеквизитовБанка.Вставить("ТелефоныБанкаДляРасчетов", "Телефоны");
	
	Возврат СоответствиеРеквизитовБанка;
	
КонецФункции

&НаСервере
Функция Банк(Страна, Код)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КлассификаторБанков.Ссылка 
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|ГДЕ
	|	КлассификаторБанков.Код = &Код
	|	И КлассификаторБанков.Страна = &Страна";
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Страна", Страна);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитыБанка()
	
	Возврат "БИКБанка, СВИФТБанка, НаименованиеБанка, НаименованиеБанкаМеждународное, КоррСчетБанка, СтранаБанка,
		|ГородБанка, ГородБанкаМеждународный, АдресБанка, АдресБанкаМеждународный, ТелефоныБанка";
	
КонецФункции  

&НаСервере
Функция  ПроверкаИсправленияБанка(ТекущийЭлементСправочника)
	
	ИдентификаторБик = Ложь;
	ИдентификаторНаименованиеБанка = Ложь;
	ИдентификаторКоррСчетБанка = Ложь;
	
	Если ТекущийЭлементСправочника.БИКБанка = Неопределено 
		ИЛИ ТекущийЭлементСправочника.БИКБанка = "" Тогда 
		ИдентификаторБик = Истина;
	ИначеЕсли ТекущийЭлементСправочника.НаименованиеБанка = Неопределено 
		ИЛИ ТекущийЭлементСправочника.НаименованиеБанка = "" Тогда
		ИдентификаторНаименованиеБанка = Истина;
	ИначеЕсли ТекущийЭлементСправочника.КоррСчетБанка = Неопределено 
		ИЛИ ТекущийЭлементСправочника.КоррСчетБанка = "" Тогда
		ИдентификаторКоррСчетБанка = Истина;
	ИначеЕсли ТекущийЭлементСправочника.Банк = Неопределено 
		ИЛИ ТекущийЭлементСправочника.Банк.Пустая() Тогда
		ИдентификаторБ = Истина;  
	Иначе ИдентификаторБ = Ложь;
	КонецЕсли;   
	
	Если ИдентификаторБик ИЛИ ИдентификаторНаименованиеБанка ИЛИ ИдентификаторКоррСчетБанка Тогда
		ИдентификаторБ = Истина;
	Иначе ИдентификаторБ = Ложь;
	КонецЕсли;
		
	Возврат ИдентификаторБ; 	

КонецФункции

&НаСервере
Процедура ОбработкаДанныхБанка(ТекущийЭлементСправочника, СтрокаТек)
	
	Если ПроверкаИсправленияБанка(ТекущийЭлементСправочника) Тогда
		
		Банк = Справочники.КлассификаторБанков.НайтиПоКоду(СтрокаТек.БИКБанка);
		
		Если Банк = Неопределено Тогда
			Банк = Справочники.КлассификаторБанков.НайтиПоРеквизиту("СВИФТБИК" , СтрокаТек.БИКБанка);
		КонецЕсли;
		
		СоответствиеРеквизитовБанка = УстановитьСоответствиеРеквизитовБанка();
		СтруктураРеквизитов = Новый Структура;
		ИменаРеквизитов = СтрРазделить(РеквизитыБанка(), ",", Ложь);
		
		Для каждого ИмяРеквизита Из ИменаРеквизитов Цикл
			СтруктураРеквизитов.Вставить(ИмяРеквизита, СоответствиеРеквизитовБанка[СокрЛП(ИмяРеквизита)]);
		КонецЦикла;
		
		СтруктураРеквизитов.Вставить("БИКБанка", "Код");
		СтруктураРеквизитов.Вставить("СВИФТБанка", "СВИФТБИК");
		СтруктураРеквизитов.Вставить("НаименованиеБанкаМеждународное", "МеждународноеНаименование");
		РеквизитыБанка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Банк, СтруктураРеквизитов);
		ЗаполнитьЗначенияСвойств(ТекущийЭлементСправочника, РеквизитыБанка);
		ТекущийЭлементСправочника.Банк = Банк; 
		СтрокаТек.Изменено = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЕстьБуквыВСтроке(Строка)
	
	ЕстьКириллица = Ложь;
	ЕстьЛатиница = Ложь;
	
	КириллическиеСимволы = "АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЬьЫыЪъЭэЮюЯя";
	ЛатинскиеСимволы         = "AaBbCcDdEeFfGgHhIiJjKkLlMmNnOoPpQqRrSsTtUuVvWwXxYyZz";
	
	ИсходнаяСтрока = СокрЛП(Строка);
	Если СтрДлина(ИсходнаяСтрока) > 0 Тогда
		Для Сч = 1 По СтрДлина(ИсходнаяСтрока) Цикл
			Символ = НРег(Сред(ИсходнаяСтрока, Сч, 1)); 
			
			Если СтрНайти(КириллическиеСимволы , Символ) <> 0 Тогда
				ЕстьКириллица = Истина;
			ИначеЕсли СтрНайти(ЛатинскиеСимволы, Символ) <> 0 Тогда
				ЕстьЛатиница = Истина;  
			Иначе
				Кириллица = Ложь;
				Латиница = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьКириллица ИЛИ ЕстьЛатиница Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОпределитьСтрануИБанкПоIBAN(БанковскийСчета)
	
	КодСтраны = ДенежныеСредстваКлиентСервер.КодСтраныIBAN(БанковскийСчета.НомерСчета);
	Страна =  Справочники.СтраныМира.НайтиПоРеквизиту("КодАльфа2", КодСтраны);
	Если ЗначениеЗаполнено(Страна) Тогда
		СтранаБанка = Страна;
		БанковскийСчета.СтранаБанка = Страна;
		НациональныйКодБанка = ДенежныеСредстваСервер.НациональныйКодБанка(БанковскийСчета.НомерСчета);
		НайденныйБанк = Банк(Страна, НациональныйКодБанка);
		Если ЗначениеЗаполнено(НайденныйБанк) Тогда
			БанковскийСчета.Банк = НайденныйБанк;
			БанковскийСчета.РучноеИзменениеРеквизитовБанка = Ложь;
			СоответствиеРеквизитовБанка = УстановитьСоответствиеРеквизитовБанка();
			СтруктураРеквизитов = Новый Структура;
			ИменаРеквизитов = СтрРазделить(РеквизитыБанка(), ",", Ложь);
			
			Для каждого ИмяРеквизита Из ИменаРеквизитов Цикл
				СтруктураРеквизитов.Вставить(ИмяРеквизита, СоответствиеРеквизитовБанка[СокрЛП(ИмяРеквизита)]);
			КонецЦикла;
			
			СтруктураРеквизитов.Вставить("БИКБанка", "Код");
			СтруктураРеквизитов.Вставить("СВИФТБанка", "СВИФТБИК");
			СтруктураРеквизитов.Вставить("НаименованиеБанкаМеждународное", "МеждународноеНаименование");
			РеквизитыБанка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НайденныйБанк, СтруктураРеквизитов);
			ЗаполнитьЗначенияСвойств(БанковскийСчета, РеквизитыБанка);
			
			БанковскийСчета.Банк = НайденныйБанк; 
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработкиСтраниц
// Первая страница

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		
	ДиалогВыбораФайла.Фильтр                  =     НСтр("ru='Файл данных (*.xlsx, *.xls)|*.xlsx; *.xls");
   	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение              =    "xlsx,xls";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла              = Элемент.ТекстРедактирования;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриветствиеДалее(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ТекстСообщения = НСтр("ru='Вначале укажите путь к файлу загрузки!'");
		Предупреждение(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если  Объект.ИдентификаторСправочника = "" ИЛИ
		  Объект.ИдентификаторСправочника = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Требуется указать справочник!'");
		Предупреждение(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИдентификаторСостояния = "Состояние1";
	Элементы.ГруппаСопоставления.Заголовок 					= ПутьКФайлу;
	
	ПоместитьТекущийФайлНаСерверАсинхронно();
	    
	Элементы.ЭтапыЗагрузки.ТекущаяСтраница = Элементы.ЭтапыЗагрузки.ПодчиненныеЭлементы.Сопоставление; 
	
	Если Объект.ИдентификаторСправочника = "ПризнакиНоменклатуры" 
		Или Объект.ИдентификаторСправочника = "ПризнакиТара"
		Или Объект.ИдентификаторСправочника = "ПризнакиОтходов"Тогда
		Элементы.ЗаполнитьПризнакиНоменклатуры.Видимость = Истина;
		Элементы.ЗаполнитьПризнакиНоменклатуры.Доступность = Истина;
	Иначе
		Элементы.ЗаполнитьПризнакиНоменклатуры.Видимость = Ложь;
		Элементы.ЗаполнитьПризнакиНоменклатуры.Доступность = Ложь;
	КонецЕсли;	
	
	Если Объект.ИдентификаторСправочника = "АтрибутыКонтрагентов" Тогда
		Элементы.ЗаполнитьАтрибутыКонтрагентов.Видимость = Истина;
		Элементы.ЗаполнитьАтрибутыКонтрагентов.Доступность = Истина;
	Иначе
		Элементы.ЗаполнитьАтрибутыКонтрагентов.Видимость = Ложь;
		Элементы.ЗаполнитьАтрибутыКонтрагентов.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ИдентификаторСправочника = "Спецификации" Тогда
		Элементы.Дата1.Видимость = Истина;
	Иначе
		Элементы.Дата1.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
Асинх Процедура ПоместитьТекущийФайлНаСерверАсинхронно()
	
	ОписаниеФайла =
	Ждать 
	ПоместитьФайлНаСерверАсинх( , , , ПутьКФайлу);
	Если ОписаниеФайла <> Неопределено Тогда  
		ПутьСНовымИменем = ОписаниеФайла.СсылкаНаФайл.Файл.Путь + ОписаниеФайла.СсылкаНаФайл.Файл.ИмяБезРасширения; 
		ПредставлениеИсточника = ЗагрузитьРеквизитыНаСервере(ОписаниеФайла.Адрес, ОписаниеФайла.СсылкаНаФайл.Расширение, 
		                                                     ПутьСНовымИменем);
		ЗаполнитьТаблицу(ПредставлениеИсточника);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗагрузитьРеквизитыНаСервере(АдресДанных, РасширениеФайла, ПутьСНовымИменем)
	
	ПутьКФайлуЗагрузки = ПолучитьИмяВременногоФайла(РасширениеФайла);         
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);
	Данные.Записать(ПутьКФайлуЗагрузки);
	ТабДок = ПрочитатьExcel(ПутьКФайлуЗагрузки, ПутьСНовымИменем);
	УдалитьФайлы(ПутьКФайлуЗагрузки);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ПрочитатьExcel(ПутьКФайлуЗагрузки, ПутьСНовымИменем)
	
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(ПутьКФайлуЗагрузки);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();                                                        
		Возврат Неопределено;
	КонецПопытки;  	
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область()); 	
	Построитель.ЗаполнитьНастройки(); 
	Построитель.Выполнить();	
	
	ИменаКолонок = Построитель.ВыбранныеПоля;	
	ВыборкаДетальныеЗаписи = Построитель.Результат.Выбрать();
	
	Возврат ТабДок; 
	
КонецФункции

// Вторая страница  

&НаКлиенте 
Процедура ЗаполнитьТаблицу(ПредставлениеИсточника = Неопределено)
	
	Если Объект.ИдентификаторСправочника = "БанковскиеСчетаКонтрагентов" Тогда
		ДействияСТаблицамиБанковскиеСчетаКонтрагентов(ПредставлениеИсточника);
	ИначеЕсли Объект.ИдентификаторСправочника = "БанковскиеСчетаОрганизаций" Тогда
		ДействияСТаблицамиБанковскиеСчетаОрганизаций(ПредставлениеИсточника);
	ИначеЕсли Объект.ИдентификаторСправочника = "Контрагенты" 
		  ИЛИ Объект.ИдентификаторСправочника = "Партнеры" Тогда
		ДействияСТаблицамиПартнеры(ПредставлениеИсточника);
	ИначеЕсли Объект.ИдентификаторСправочника = "ДоговорыКонтрагентов" Тогда
		ДействияСТаблицамиДоговорыКонтрагентов(ПредставлениеИсточника);  
	ИначеЕсли Объект.ИдентификаторСправочника = "ВидыНоменклатуры" Тогда
		ДействияСТаблицамиВидыНоменклатуры(ПредставлениеИсточника);  
	ИначеЕсли Объект.ИдентификаторСправочника = "Номенклатура" Тогда
		ДействияСТаблицамиНоменклатура(ПредставлениеИсточника);
	ИначеЕсли Объект.ИдентификаторСправочника = "ПризнакиНоменклатуры" 
		Или Объект.ИдентификаторСправочника = "ПризнакиОтходов"
		Или Объект.ИдентификаторСправочника = "ПризнакиТара" Тогда
		ДействияСТаблицамиПризнакиНоменклатуры(ПредставлениеИсточника);	
	ИначеЕсли Объект.ИдентификаторСправочника = "Банки" Тогда
		ДействияСТаблицамиБанки(ПредставлениеИсточника); 
	ИначеЕсли Объект.ИдентификаторСправочника = "АтрибутыКонтрагентов" Тогда
		ДействияСТаблицамиАтрибутыКонтрагентов(ПредставлениеИсточника);	
		ИначеЕсли Объект.ИдентификаторСправочника = "ВидыРабочихЦентров" Тогда
		ДействияСТаблицамиВидыРабочихЦентров(ПредставлениеИсточника);  	
	ИначеЕсли Объект.ИдентификаторСправочника = "РабочиеЦентры" Тогда
		ДействияСТаблицамиРабочиеЦентры(ПредставлениеИсточника);  	
	ИначеЕсли Объект.ИдентификаторСправочника = "Спецификации" Тогда
		ДействияСТаблицамиСпецификации(ПредставлениеИсточника); 
	ИначеЕсли Объект.ИдентификаторСправочника = "ОходыСпецификаций" Тогда
		ДействияСТаблицамиОходыСпецификаций(ПредставлениеИсточника);	
	Иначе
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеНазад(Команда)
	
	ИдентификаторСостояния = "Состояние0";
	Элементы.ЭтапыЗагрузки.ТекущаяСтраница = Элементы.ЭтапыЗагрузки.ПодчиненныеЭлементы.Приветствие;
	ТаблицыСкрытьОчиститьСопоставление();
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеДалее(Команда)
	
	ИдентификаторСостояния = "Состояние2";
	Элементы.ЭтапыЗагрузки.ТекущаяСтраница = Элементы.ЭтапыЗагрузки.ПодчиненныеЭлементы.Создание; 
	Элементы.СозданиеЗагрузить.Видимость = Ложь;
	Элементы.СозданиеПроверить.Видимость = Ложь;
	Элементы.СозданиеЗагрузить.Доступность = Ложь;
	Элементы.СозданиеПроверить.Доступность = Ложь;
	Элементы.СозданиеВсеРавноЗагрузить.Видимость = Ложь;
	Элементы.СозданиеВсеРавноЗагрузить.Доступность = Ложь;
	Элементы.ЗаполнитьПризнакиНоменклатуры.Видимость = Ложь;
    Элементы.ЗаполнитьПризнакиНоменклатуры.Доступность = Ложь;
	Элементы.ЗаполнитьАтрибутыКонтрагентов.Видимость = Ложь;
    Элементы.ЗаполнитьАтрибутыКонтрагентов.Доступность = Ложь;
	
    ЗаполнитьТаблицу();  
	ПриСменеСтраницы(Элементы.Группа9, Элементы.ЭтапыЗагрузки.ТекущаяСтраница.ПодчиненныеЭлементы.Группа9.ТекущаяСтраница);
		
КонецПроцедуры

// Третья страница 

 &НаКлиенте   
Процедура СозданиеНазад(Команда)
	
	ИдентификаторСостояния = "Состояние2";
	ТаблицыСкрытьОчиститьСоздание();
	Элементы.ЭтапыЗагрузки.ТекущаяСтраница = Элементы.ЭтапыЗагрузки.ПодчиненныеЭлементы.Сопоставление;
	
	УсловноеОформлениеОчистить();
	
КонецПроцедуры 

&НаСервере
Процедура УсловноеОформлениеОчистить()

	УсловноеОформление.Элементы.Очистить();

КонецПроцедуры 

&НаКлиенте
Процедура СозданиеЗагрузить(Команда)

	ИдентификаторСостояния = "Состояние3";
	ЗаполнитьТаблицу();
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеПроверить(Команда)
	
    ИдентификаторСостояния = "Состояние4";
    ЗаполнитьТаблицу(); 
	
КонецПроцедуры   

&НаКлиенте
Процедура СозданиеВсеРавноЗагрузить(Команда)
	
	ИдентификаторСостояния = "Состояние6";
    ЗаполнитьТаблицу();  
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеВперед(Команда)
	
	ИдентификаторСостояния = "Состояние5";
	Элементы.ЭтапыЗагрузки.ТекущаяСтраница = Элементы.ЭтапыЗагрузки.ПодчиненныеЭлементы.Завершение;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.Создаваемые Тогда 
		Элементы.СозданиеЗагрузить.Видимость 		 = Истина;
		Элементы.СозданиеПроверить.Видимость 		 = Ложь; 
		Элементы.СозданиеВсеРавноЗагрузить.Видимость = Ложь;

		Если ПроверкаНаличияЗаписейСоздания() Тогда
			Элементы.СозданиеЗагрузить.Доступность = Истина;
		Иначе 
			Элементы.СозданиеЗагрузить.Доступность = Ложь;
		КонецЕсли;	
		
		Элементы.СозданиеПроверить.Доступность = Ложь;		
		
	ИначеЕсли ТекущаяСтраница = Элементы.Провяемые Тогда 
		Элементы.СозданиеЗагрузить.Видимость 		 = Ложь;
		Элементы.СозданиеПроверить.Видимость 		 = Истина;
		Элементы.СозданиеЗагрузить.Доступность		 = Ложь;
		Элементы.СозданиеВсеРавноЗагрузить.Видимость = Ложь;
		
		Если ПроверкаНаличияЗаписейПроверки() Тогда 
			Элементы.СозданиеПроверить.Доступность = Истина;
		Иначе 
			Элементы.СозданиеПроверить.Доступность = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Элементы.Ошибки Тогда
		
		Если ОшибокБанковскиеСчетаКонтрагентов.Количество() > 0 
			Или ОшибокДоговорыКонтрагентов.Количество() > 0 Тогда
			    Элементы.СозданиеЗагрузить.Видимость 		 	= Ложь;
		        Элементы.СозданиеПроверить.Видимость 			= Ложь;
			    Элементы.СозданиеВсеРавноЗагрузить.Видимость 	= Истина;
				Элементы.СозданиеВсеРавноЗагрузить.Доступность	= Истина; 
			Иначе
				
				Элементы.СозданиеВсеРавноЗагрузить.Видимость = Ложь;
				Элементы.СозданиеВсеРавноЗагрузить.Доступность = Ложь; 
		КонецЕсли;	
		
		 Элементы.СозданиеЗагрузить.Видимость 		 	= Ложь;
		 Элементы.СозданиеПроверить.Видимость 			= Ложь;

	Иначе
		
		Элементы.СозданиеЗагрузить.Видимость = Ложь;
		Элементы.СозданиеПроверить.Видимость = Ложь;
		Элементы.СозданиеЗагрузить.Доступность = Ложь;
		Элементы.СозданиеПроверить.Доступность = Ложь;		
		Элементы.СозданиеВсеРавноЗагрузить.Видимость = Ложь;
		Элементы.СозданиеВсеРавноЗагрузить.Доступность = Ложь;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаНаличияЗаписейСоздания()
	
	ДоступностьСоздания1 = Ложь;
	ДоступностьСоздания2 = Ложь;
	ДоступностьСоздания3 = Ложь; 
	ДоступностьСоздания4 = Ложь;
	ДоступностьСоздания5 = Ложь;  
	
	Если СозданиеБанковскиеСчетаКонтрагентов.Количество() > 0 
		ИЛИ СозданиеБанковскиеСчетаОрганизаций.Количество() > 0 Тогда
		ДоступностьСоздания1 = Истина;
	ИначеЕсли СозданиеДоговорыКонтрагентов.Количество() > 0 
		ИЛИ  СозданиеПартнеры.Количество() > 0 
		ИЛИ СозданиеАтрибутыКонтрагентов.Количество() > 0 Тогда
		ДоступностьСоздания2 = Истина; 
	ИначеЕсли СозданиеВидыНоменклатуры.Количество() > 0 
		ИЛИ СозданиеНоменклатура.Количество() > 0
		ИЛИ СозданиеПризнакиНоменклатуры.Количество() > 0 Тогда
		ДоступностьСоздания3 = Истина; 
	ИначеЕсли СозданиеБанки.Количество() > 0 Тогда
		ДоступностьСоздания4 = Истина;
	ИначеЕсли СозданиеВидыРабочихЦентров.Количество() > 0 
		ИЛИ СозданиеРабочиеЦентры.Количество() > 0
		ИЛИ СозданиеСпецификации.Количество() > 0 
		ИЛИ СозданиеОходыСпецификаций.Количество() > 0 Тогда
		ДоступностьСоздания5 = Истина;	
	Иначе ДоступностьСоздания = Ложь;
		  ДоступностьСоздания1 = Ложь;
		  ДоступностьСоздания2 = Ложь;
		  ДоступностьСоздания3 = Ложь;
		  ДоступностьСоздания4 = Ложь;
		  ДоступностьСоздания5 = Ложь;
	КонецЕсли;
	
	Если ДоступностьСоздания1 
		ИЛИ ДоступностьСоздания2 
		ИЛИ ДоступностьСоздания3 
		ИЛИ ДоступностьСоздания4  
		ИЛИ ДоступностьСоздания5 Тогда
		 ДоступностьСоздания = Истина;
	 Иначе
		 ДоступностьСоздания = Ложь;
	  КонецЕсли;
	 
	Возврат ДоступностьСоздания;
	
КонецФункции    

&НаКлиенте
Функция ПроверкаНаличияЗаписейПроверки()
	
	ДоступностьПроверки1 = Ложь;
	ДоступностьПроверки2 = Ложь;
	ДоступностьПроверки3 = Ложь;
	ДоступностьПроверки4 = Ложь;
	
	Если ПроверкиБанковскиеСчетаКонтрагентов.Количество() > 0 
		ИЛИ ПроверкиБанковскиеСчетаОрганизаций.Количество() > 0 Тогда
		ДоступностьПроверки1 = Истина;
	ИначеЕсли ПроверкиДоговорыКонтрагентов.Количество() > 0 
		ИЛИ  ПроверкиПартнеры.Количество() > 0 
		ИЛИ  ПроверкиАтрибутыКонтрагентов.Количество() > 0 Тогда
		ДоступностьПроверки2 = Истина;
	ИначеЕсли ПроверкиВидыНоменклатуры.Количество() > 0 
		ИЛИ ПроверкиНоменклатура.Количество() > 0 
		ИЛИ ПроверкиПризнакиНоменклатуры.Количество() > 0 Тогда
		ДоступностьПроверки3 = Истина;	
	ИначеЕсли ПроверкиВидыРабочихЦентров.Количество() > 0 
		//ИЛИ ПроверкиСпецификации.Количество() > 0
		//ИЛИ ПроверкиОходыСпецификаций.Количество() > 0
		ИЛИ ПроверкиРабочиеЦентры.Количество() > 0 Тогда
		ДоступностьПроверки4 = Истина;	
	Иначе ДоступностьПроверки = Ложь;
		  ДоступностьПроверки1 = Ложь;
		  ДоступностьПроверки2 = Ложь;
		  ДоступностьПроверки3 = Ложь;
		  ДоступностьПроверки4 = Ложь;
	КонецЕсли;
	
	Если ДоступностьПроверки1 
		ИЛИ ДоступностьПроверки2
		ИЛИ ДоступностьПроверки3
		ИЛИ ДоступностьПроверки4 Тогда
		 ДоступностьПроверки = Истина;
	 Иначе
		 ДоступностьПроверки = Ложь;
	 КонецЕсли;
	
	Возврат ДоступностьПроверки;
    
КонецФункции 

// Четвертая страница 

&НаКлиенте 
Процедура СсылкаНаСписокНажатие(Элемент)
	
	ЗаполнитьТаблицу();
			
КонецПроцедуры

 &НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

 &НаКлиенте
Процедура КПервойСтранице(Команда)
	
	ИдентификаторСостояния = "Состояние0";
	Элементы.ЭтапыЗагрузки.ТекущаяСтраница = Элементы.ЭтапыЗагрузки.ПодчиненныеЭлементы.Приветствие;
	ТаблицыСкрытьОчиститьСопоставление();
    ТаблицыСкрытьОчиститьСоздание();
	
КонецПроцедуры

#КонецОбласти  

#Область СозданияБанковскихСчетовОрганизации

&НаСервере 
Процедура ЗаполнитьТаблицуИсточникБанковскиеСчетаОрганизаций(ПредставлениеИсточника)
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточникСчетаО = ИсточникБанковскиеСчетаОрганизаций.Добавить();	 
		
		ТекстКолонки = ПредставлениеИсточника.Область(НомерСтроки, 1).Текст;
		СтрИсточникСчетаО.Владелец = ТекстКолонки;           
		СтрИсточникСчетаО.НомерСчета = ПредставлениеИсточника.Область(НомерСтроки, 3).Текст;
		СтрИсточникСчетаО.ТекстНазначения = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст;
	    СтрИсточникСчетаО.ВалютаДенежныхСредств = ПредставлениеИсточника.Область(НомерСтроки, 8).Текст;	
		СтрИсточникСчетаО.БИКБанка = ПредставлениеИсточника.Область(НомерСтроки, 9).Текст;
		СтрИсточникСчетаО.НаименованиеБанка = ПредставлениеИсточника.Область(НомерСтроки, 11).Текст;
		СтрИсточникСчетаО.КоррСчетБанка = ПредставлениеИсточника.Область(НомерСтроки, 12).Текст;
			
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникБанковскиеСчетаОрганизаций.Удалить(СтрИсточникСчетаО);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
Процедура ДействияСТаблицамиБанковскиеСчетаОрганизаций(ПредставлениеИсточника)        

	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникБанковскиеСчетаОрганизаций.Видимость 	= Истина;
		ЗаполнитьТаблицуИсточникБанковскиеСчетаОрганизаций(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда 
		Элементы.СозданиеБанковскиеСчетаОрганизаций.Видимость 	= Истина;
		Элементы.ПроверкиБанковскиеСчетаОрганизаций.Видимость 	= Истина;
		Элементы.ОшибокБанковскиеСчетаОрганизаций.Видимость 	= Истина;
		ЗаполнитьТаблицыПроверкиБанковскиеСчетаОрганизаций();
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыТаблицыБанковскиеСчетаОрганизаций();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыТаблицыБанковскиеСчетаОрганизаций();	
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.БанковскиеСчетаОрганизаций.ФормаСписка"); 
	Иначе
		Возврат;
	КонецЕсли; 
			
КонецПроцедуры  

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиБанковскиеСчетаОрганизаций()
	
	УсловноеОформление.Элементы.Очистить();
	
	Для каждого СтрокаИсточникБанковскиеСчетаОрганизаций Из ИсточникБанковскиеСчетаОрганизаций Цикл     
		Если СтрокаИсточникБанковскиеСчетаОрганизаций.ВалютаДенежныхСредств = "RUB" Тогда 
			 СтрокаИсточникБанковскиеСчетаОрганизаций.ВалютаДенежныхСредств = "руб.";   
		КонецЕсли;		
	КонецЦикла;  
	МассивВалют = ИсточникБанковскиеСчетаОрганизаций.Выгрузить( , "ВалютаДенежныхСредств");
	МассивНомерСчета = ИсточникБанковскиеСчетаОрганизаций.Выгрузить( , "НомерСчета");
	МассивБик = ИсточникБанковскиеСчетаОрганизаций.Выгрузить( , "БИКБанка");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторБанков.Ссылка КАК Ссылка,
		|	КлассификаторБанков.Код КАК Код,
		|	КлассификаторБанков.СВИФТБИК КАК СВИФТБИК
		|ПОМЕСТИТЬ КлассификаторБаковБик
		|ИЗ
		|	Справочник.КлассификаторБанков КАК КлассификаторБанков
		|ГДЕ
		|	КлассификаторБанков.Код В(&МассивБик)
		|	И КлассификаторБанков.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлассификаторБанков.Ссылка КАК Ссылка,
		|	КлассификаторБанков.Код КАК Код,
		|	КлассификаторБанков.СВИФТБИК КАК СВИФТБИК
		|ПОМЕСТИТЬ КлассификаторБаковСВИФТ
		|ИЗ
		|	Справочник.КлассификаторБанков КАК КлассификаторБанков
		|ГДЕ
		|	КлассификаторБанков.СВИФТБИК В(&МассивБик)
		|	И КлассификаторБанков.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КлассификаторБаковБик.Ссылка КАК Ссылка,
		|	КлассификаторБаковБик.Код КАК Код,
		|	КлассификаторБаковБик.СВИФТБИК КАК СВИФТБИК
		|ИЗ
		|	КлассификаторБаковБик КАК КлассификаторБаковБик
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КлассификаторБаковСВИФТ.Ссылка,
		|	КлассификаторБаковСВИФТ.Код,
		|	КлассификаторБаковСВИФТ.СВИФТБИК
		|ИЗ
		|	КлассификаторБаковСВИФТ КАК КлассификаторБаковСВИФТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка,
		|	Валюты.Код КАК Код,
		|	Валюты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Наименование В(&МассивВалют)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БанковскиеСчетаОрганизаций.Ссылка КАК Ссылка,
		|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета
		|ИЗ
		|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		|ГДЕ
		|	БанковскиеСчетаОрганизаций.НомерСчета В(&МассивНомерСчета)
		|	И БанковскиеСчетаОрганизаций.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("МассивБик", МассивБик);
	Запрос.УстановитьПараметр("МассивВалют", МассивВалют);
	Запрос.УстановитьПараметр("МассивНомерСчета", МассивНомерСчета);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаБик = РезультатЗапроса[2].Выгрузить();
	ВыборкаВалют = РезультатЗапроса[3].Выгрузить();
	ВыборкаНомерСчета = РезультатЗапроса[4].Выгрузить();  
	
	Для каждого СтрокаБанковскиеСчетаОрганизаций Из ИсточникБанковскиеСчетаОрганизаций Цикл 
		
		ТекстСообщения = ""; 
		
		ИдентификаторIBAN = ЕстьБуквыВСтроке(СтрокаБанковскиеСчетаОрганизаций.НомерСчета);
		Если НЕ ИдентификаторIBAN Тогда
			ИдентификаторБик = ВыборкаБик.Найти(СтрокаБанковскиеСчетаОрганизаций.БИКБанка);
			Если ИдентификаторБик = Неопределено Тогда
				ТекстСообщения = ТекстСообщения + "Банк не найден! ";
			КонецЕсли; 
		КонецЕсли;
		
		ИдентификаторВалюта = ВыборкаВалют.Найти(СтрокаБанковскиеСчетаОрганизаций.ВалютаДенежныхСредств);
		Если ИдентификаторВалюта = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Валюта не найдена! ";
		КонецЕсли;
		
		Если СтрокаБанковскиеСчетаОрганизаций.НомерСчета = "" ИЛИ 
			 СтрокаБанковскиеСчетаОрганизаций.НомерСчета = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Номер счета не указан! ";
		КонецЕсли;
		
		СтрокаНомерСчета = ВыборкаНомерСчета.Найти(СтрокаБанковскиеСчетаОрганизаций.НомерСчета);
		Если ТекстСообщения <> "" Тогда
			СтрокаОшибокБанковскиеСчетаОрганизаций = ОшибокБанковскиеСчетаОрганизаций.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиБанковскиеСчетаОрганизаций(СтрокаОшибокБанковскиеСчетаОрганизаций, 
			                                                         СтрокаБанковскиеСчетаОрганизаций);
			СтрокаОшибокБанковскиеСчетаОрганизаций.Ошибка = ТекстСообщения;
		ИначеЕсли СтрокаНомерСчета = Неопределено Тогда
			СтрокаСозданиеБанковскиеСчетаОрганизаций = СозданиеБанковскиеСчетаОрганизаций.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиБанковскиеСчетаОрганизаций(СтрокаСозданиеБанковскиеСчетаОрганизаций,
			                                                         СтрокаБанковскиеСчетаОрганизаций);
		Иначе 
			СтрокаПроверкиБанковскиеСчетаОрганизаций = ПроверкиБанковскиеСчетаОрганизаций.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиБанковскиеСчетаОрганизаций(СтрокаПроверкиБанковскиеСчетаОрганизаций, 
			                                                         СтрокаБанковскиеСчетаОрганизаций);
        КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыПроверкиБанковскиеСчетаОрганизаций(СтрокаПриемник, СтрокаИсточник)
	
	СтрокаПриемник.Владелец = СтрокаИсточник.Владелец; 
	СтрокаПриемник.НомерСчета = СтрокаИсточник.НомерСчета;
	СтрокаПриемник.ТекстНазначения = СтрокаИсточник.ТекстНазначения;
	СтрокаПриемник.ВалютаДенежныхСредств = СтрокаИсточник.ВалютаДенежныхСредств;
	СтрокаПриемник.БИКБанка = СтрокаИсточник.БИКБанка;
	СтрокаПриемник.НаименованиеБанка = СтрокаИсточник.НаименованиеБанка;   
	СтрокаПриемник.КоррСчетБанка = СтрокаИсточник.КоррСчетБанка; 
	
КонецПроцедуры	

&НаСервере 
Процедура СоздатьЭлементыТаблицыБанковскиеСчетаОрганизаций()
	
	Для каждого СтрокаБанковскиеСчетаОрганизаций Из  СозданиеБанковскиеСчетаОрганизаций Цикл
		
		БанковскийСчетаОрганизаций = Справочники.БанковскиеСчетаОрганизаций.СоздатьЭлемент();
		БанковскийСчетаОрганизаций.Владелец = Справочники.Организации.ОрганизацияПоУмолчанию();
		БанковскийСчетаОрганизаций.ТипСчета = Перечисления.ТипыБанковскихСчетов.Расчетный;
		БанковскийСчетаОрганизаций.ВалютаДенежныхСредств = 
		Справочники.Валюты.НайтиПоНаименованию(СтрокаБанковскиеСчетаОрганизаций.ВалютаДенежныхСредств);
		НомерСчета = ВРег(СтрЗаменить(СтрЗаменить(СокрЛП(СтрокаБанковскиеСчетаОрганизаций.НомерСчета), " ", ""), ".", ""));
		БанковскийСчетаОрганизаций.НомерСчета = НомерСчета;
		БанковскийСчетаОрганизаций.ВариантВыводаМесяца = Перечисления.ВариантыВыводаМесяцаВДатеДокумента.Числом;
		БанковскийСчетаОрганизаций.ТекстНазначения = СтрокаБанковскиеСчетаОрганизаций.ТекстНазначения; 
		
		Если ЕстьБуквыВСтроке(НомерСчета) Тогда
			БанковскийСчетаОрганизаций.ИностранныйБанк = Истина;
			Если Сред(НомерСчета, 1, 4) = "IBAN" Тогда
				НомерСчета = Сред(НомерСчета, 5);
				БанковскийСчетаОрганизаций.НомерСчета = НомерСчета;
			КонецЕсли;
			Если ДенежныеСредстваКлиентСервер.ПравильнаяДлинаIBAN(НомерСчета) Тогда
				БанковскийСчетаОрганизаций.ЭтоIBAN = Истина;
				ОпределитьСтрануИБанкПоIBAN(БанковскийСчетаОрганизаций); 
				БанковскийСчетаОрганизаций.РучноеИзменениеРеквизитовБанка = Истина;
			КонецЕсли;
		Иначе
			Банк = Справочники.КлассификаторБанков.НайтиПоКоду(СтрокаБанковскиеСчетаОрганизаций.БИКБанка);
			
			Если Банк = Неопределено Тогда
				Банк = Справочники.КлассификаторБанков.НайтиПоРеквизиту("СВИФТБИК", СтрокаБанковскиеСчетаОрганизаций.БИКБанка);
			КонецЕсли;
			
			СоответствиеРеквизитовБанка = УстановитьСоответствиеРеквизитовБанка();
			СтруктураРеквизитов = Новый Структура;
			ИменаРеквизитов = СтрРазделить(РеквизитыБанка(), ",", Ложь);
			
			Для каждого ИмяРеквизита Из ИменаРеквизитов Цикл
				СтруктураРеквизитов.Вставить(ИмяРеквизита, СоответствиеРеквизитовБанка[СокрЛП(ИмяРеквизита)]);
			КонецЦикла;
			
			СтруктураРеквизитов.Вставить("БИКБанка", "Код");
			СтруктураРеквизитов.Вставить("СВИФТБанка", "СВИФТБИК");
			СтруктураРеквизитов.Вставить("НаименованиеБанкаМеждународное", "МеждународноеНаименование");
			РеквизитыБанка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Банк, СтруктураРеквизитов);
			ЗаполнитьЗначенияСвойств(БанковскийСчетаОрганизаций, РеквизитыБанка);
			
			БанковскийСчетаОрганизаций.Банк = Банк;
		КонецЕсли;  
		Если БанковскийСчетаОрганизаций.ВалютаДенежныхСредств.Пустая() Тогда
			БанковскийСчетаОрганизаций.ВалютаДенежныхСредств = Справочники.Валюты.ПолучитьВалютуПоУмолчанию();
		КонецЕсли;
		ШаблонНаименования = НСтр("ru = '%1, %2'; |en = '%1, %2'"); 
		НаименованиеО = СокрЛП(БанковскийСчетаОрганизаций.Владелец.Наименование);
		СтрокаНаименования = СтрШаблон(ШаблонНаименования, Прав(СокрЛП(НомерСчета), 4), НаименованиеО);
		
		БанковскийСчетаОрганизаций.Наименование = СтрокаНаименования;
		
		Попытка	
			БанковскийСчетаОрганизаций.Записать();
			СтрокаБанковскиеСчетаОрганизаций.Создано = Истина;
		Исключение
			СтрокаБанковскиеСчетаОрганизаций.Создано = Ложь;
		КонецПопытки;	
		
	КонецЦикла;	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеБанковскиеСчетаОрганизаций.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеБанковскиеСчетаОрганизаций.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеБанковскиеСчетаОрганизаций.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;

КонецПроцедуры

&НаСервере 
Процедура ПроверитьЭлементыТаблицыБанковскиеСчетаОрганизаций()
	
	Для каждого СтрокаБанковскиеСчетаОрганизаций Из ПроверкиБанковскиеСчетаОрганизаций Цикл 
		
		НомерСчета = ВРег(СтрЗаменить(СтрЗаменить(СокрЛП(СтрокаБанковскиеСчетаОрганизаций.НомерСчета), " ", ""), ".", ""));
		ТекущийЭлементСправочника = Справочники.БанковскиеСчетаОрганизаций.НайтиПоРеквизиту("НомерСчета", НомерСчета);
		ТекущийЭлементСправочника = ТекущийЭлементСправочника.ПолучитьОбъект();
		
		Если (ТекущийЭлементСправочника.ТекстНазначения = Неопределено ИЛИ ТекущийЭлементСправочника.ТекстНазначения = "") И 
			СтрокаБанковскиеСчетаОрганизаций.ТекстНазначения <> "" Тогда
			ТекущийЭлементСправочника.ТекстНазначения = СтрокаБанковскиеСчетаОрганизаций.ТекстНазначения;
			СтрокаБанковскиеСчетаОрганизаций.Изменено = Истина;
		КонецЕсли;
		
		Если ТекущийЭлементСправочника.ВалютаДенежныхСредств = Неопределено 
		 ИЛИ ТекущийЭлементСправочника.ВалютаДенежныхСредств.Пустая() Тогда
			ТекущийЭлементСправочника.ВалютаДенежныхСредств = 
			                      Справочники.Валюты.НайтиПоНаименованию(СтрокаБанковскиеСчетаОрганизаций.ВалютаДенежныхСредств);
			СтрокаБанковскиеСчетаОрганизаций.Изменено = Истина;
		КонецЕсли;
		
		Если ТекущийЭлементСправочника.ПометкаУдаления = Истина Тогда
			 ТекущийЭлементСправочника.ПометкаУдаления = Ложь;
			 СтрокаБанковскиеСчетаОрганизаций.Изменено = Истина;
		 КонецЕсли;
		 
		ОбработкаДанныхБанка(ТекущийЭлементСправочника, СтрокаБанковскиеСчетаОрганизаций);
		
		ШаблонНаименования = НСтр("ru = '%1, %2'; |en = '%1, %2'"); 
		НаименованиеО = СокрЛП(ТекущийЭлементСправочника.Владелец.Наименование);
		СтрокаНаименования = СтрШаблон(ШаблонНаименования, Прав(СокрЛП(НомерСчета), 4), НаименованиеО);
		Если ТекущийЭлементСправочника.Наименование <> СтрокаНаименования Тогда
			 ТекущийЭлементСправочника.Наименование = СтрокаНаименования;
			 СтрокаБанковскиеСчетаОрганизаций.Изменено = Истина;
		 КонецЕсли;
		 
		 Если ЕстьБуквыВСтроке(НомерСчета) Тогда
			 ТекущийЭлементСправочника.РучноеИзменениеРеквизитовБанка = Истина;
		 КонецЕсли;
		
		Если СтрокаБанковскиеСчетаОрганизаций.Изменено Тогда
			
			Попытка
				ТекущийЭлементСправочника.Записать();
			Исключение 
				СтрокаБанковскиеСчетаОрганизаций.Изменено = Ложь;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	ИзменениеУсловногоОформленияБанковскиеСчетаОрганизаций();
	
КонецПроцедуры

 &НаСервере 
Процедура ИзменениеУсловногоОформленияБанковскиеСчетаОрганизаций()

 	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиБанковскиеСчетаОрганизаций.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); 
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиБанковскиеСчетаОрганизаций.Изменено"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь; 
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки); 
	
	Для каждого элПоля Из Элементы.ПроверкиБанковскиеСчетаОрганизаций.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле1 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
	
КонецПроцедуры	
#КонецОбласти

#Область СозданияПартнеровКонтрагентов

&НаСервере 
Процедура ЗаполнитьТаблицуИсточникПартнеры(ПредставлениеИсточника)
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточникПартнеры = ИсточникПартнеры.Добавить();	 
		
		ТекстКолонки = ПредставлениеИсточника.Область(НомерСтроки, 1).Текст;	    
		СтрИсточникПартнеры.Наименование = ТекстКолонки;                        
		СтрИсточникПартнеры.НаименованиеПолное = ПредставлениеИсточника.Область(НомерСтроки, 2).Текст;
		СтрИсточникПартнеры.ЮридическоеФизическоеЛицо = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст;
		СтрИсточникПартнеры.СтранаРегистрации = ПредставлениеИсточника.Область(НомерСтроки, 5).Текст;
		СтрИсточникПартнеры.ИНН = ПредставлениеИсточника.Область(НомерСтроки, 7).Текст;
		СтрИсточникПартнеры.КПП = ПредставлениеИсточника.Область(НомерСтроки, 8).Текст;
		СтрИсточникПартнеры.Партнер = ПредставлениеИсточника.Область(НомерСтроки, 10).Текст;
		СтрИсточникПартнеры.ЮрФизЛицо = ПредставлениеИсточника.Область(НомерСтроки, 11).Текст; 
		СтрИсточникПартнеры.КодПоОКПО = ПредставлениеИсточника.Область(НомерСтроки, 13).Текст; 
		СтрИсточникПартнеры.КонтактнаяИнформацияТип = ПредставлениеИсточника.Область(НомерСтроки, 17).Текст;
		СтрИсточникПартнеры.КонтактнаяИнформацияСтрана = ПредставлениеИсточника.Область(НомерСтроки, 21).Текст;
		СтрИсточникПартнеры.КонтактнаяИнформацияРегион = ПредставлениеИсточника.Область(НомерСтроки, 22).Текст;
		СтрИсточникПартнеры.КонтактнаяИнформацияГород = ПредставлениеИсточника.Область(НомерСтроки, 23).Текст;
		СтрИсточникПартнеры.КонтактнаяИнформацияНомерТелефона = ПредставлениеИсточника.Область(НомерСтроки, 26).Текст;
		СтрИсточникПартнеры.Факс = ПредставлениеИсточника.Область(НомерСтроки, 38).Текст;
		СтрИсточникПартнеры.РуководительОрганизацииДолжность = ПредставлениеИсточника.Область(НомерСтроки, 39).Текст;
		СтрИсточникПартнеры.РуководительОрганизацииФИО = ПредставлениеИсточника.Область(НомерСтроки, 40).Текст; 
		СтрИсточникПартнеры.НаименованиеСФормойСобственности = ПредставлениеИсточника.Область(НомерСтроки, 41).Текст;
		СтрИсточникПартнеры.Счет = ПредставлениеИсточника.Область(НомерСтроки, 42).Текст;
		СтрИсточникПартнеры.ФормаСобственности = ПредставлениеИсточника.Область(НомерСтроки, 43).Текст;
		СтрИсточникПартнеры.Зона = ПредставлениеИсточника.Область(НомерСтроки, 44).Текст;
		СтрИсточникПартнеры.ИДКлиента = ПредставлениеИсточника.Область(НомерСтроки, 45).Текст;
		
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникПартнеры.Удалить(СтрИсточникПартнеры);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте 
Процедура ДействияСТаблицамиПартнеры(ПредставлениеИсточника)
	
	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникПартнеры.Видимость 				= Истина;
		ЗаполнитьТаблицуИсточникПартнеры(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда 
		Элементы.СозданиеПартнеры.Видимость 					= Истина;
		Элементы.ПроверкиПартнеры.Видимость 					= Истина;
		Элементы.ОшибокПартнеры.Видимость 						= Истина;
        ЗаполнитьТаблицыПроверкиПартнеры(); 
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыТаблицыПартнеры();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыТаблицыПартнеры();
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.Партнеры.ФормаСписка");
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиПартнеры() 
	
	УсловноеОформление.Элементы.Очистить();
	
	Для каждого СтрокаИсточникПартнеры Из ИсточникПартнеры Цикл     
		Если СтрокаИсточникПартнеры.НаименованиеПолное = "" Тогда 
			 СтрокаИсточникПартнеры.НаименованиеПолное = СтрокаИсточникПартнеры.НаименованиеСФормойСобственности;   
		 КонецЕсли;	
		 Если СтрокаИсточникПартнеры.СтранаРегистрации = "<Неизвестная>" или СтрокаИсточникПартнеры.СтранаРегистрации = "" Тогда 
			 СтрокаИсточникПартнеры.СтранаРегистрации = "Россия" ;   
		 КонецЕсли;	
         КорректировкаНаименованияСтраныРегистрации(СтрокаИсточникПартнеры.СтранаРегистрации);
	КонецЦикла; 
	
	МассивИНН = ИсточникПартнеры.Выгрузить( , "ИНН");
	МассивКПП = ИсточникПартнеры.Выгрузить( , "КПП");
	МассивНаименований = ИсточникПартнеры.Выгрузить( , "Наименование");
	МассивИД = ИсточникПартнеры.Выгрузить( , "ИДКлиента");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.Партнер КАК Партнер,
	|	Контрагенты.бит_ИДКлиента КАК бит_ИДКлиента
	|ПОМЕСТИТЬ КонтрагентИНН
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН В(&МассивИННКонтрагентов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.Партнер КАК Партнер,
	|	Контрагенты.бит_ИДКлиента КАК бит_ИДКлиента
	|ПОМЕСТИТЬ КонтрагентКПП
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.КПП В(&МассивКППКонтрагентов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.Партнер КАК Партнер,
	|	Контрагенты.бит_ИДКлиента КАК бит_ИДКлиента
	|ПОМЕСТИТЬ КонтрагентНаименование
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Наименование В(&МассивКонтрагентов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.Партнер КАК Партнер,
	|	Контрагенты.бит_ИДКлиента КАК бит_ИДКлиента
	|ПОМЕСТИТЬ КонтрагентыИД
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.бит_ИДКлиента В(&МассивИД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентИНН.Ссылка КАК Ссылка,
	|	КонтрагентИНН.Наименование КАК Наименование,
	|	КонтрагентИНН.ИНН КАК ИНН,
	|	КонтрагентИНН.КПП КАК КПП,
	|	КонтрагентИНН.Партнер КАК Партнер,
	|	КонтрагентИНН.бит_ИДКлиента КАК бит_ИДКлиента
	|ИЗ
	|	КонтрагентИНН КАК КонтрагентИНН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрагентКПП.Ссылка,
	|	КонтрагентКПП.Наименование,
	|	КонтрагентКПП.ИНН,
	|	КонтрагентКПП.КПП,
	|	КонтрагентКПП.Партнер,
	|	КонтрагентКПП.бит_ИДКлиента
	|ИЗ
	|	КонтрагентКПП КАК КонтрагентКПП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентНаименование.Ссылка,
	|	КонтрагентНаименование.Наименование,
	|	КонтрагентНаименование.ИНН,
	|	КонтрагентНаименование.КПП,
	|	КонтрагентНаименование.Партнер,
	|	КонтрагентНаименование.бит_ИДКлиента
	|ИЗ
	|	КонтрагентНаименование КАК КонтрагентНаименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыИД.Ссылка,
	|	КонтрагентыИД.Наименование,
	|	КонтрагентыИД.ИНН,
	|	КонтрагентыИД.КПП,
	|	КонтрагентыИД.Партнер,
	|	КонтрагентыИД.бит_ИДКлиента
	|ИЗ
	|	КонтрагентыИД КАК КонтрагентыИД"; 
	
	Запрос.УстановитьПараметр("МассивИННКонтрагентов", МассивИНН);
    Запрос.УстановитьПараметр("МассивКППКонтрагентов", МассивКПП);
    Запрос.УстановитьПараметр("МассивКонтрагентов", МассивНаименований);
	Запрос.УстановитьПараметр("МассивИД", МассивИД);
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаКонтрагентов = РезультатЗапроса.Выгрузить();
	
	Для каждого СтрокаИсточникПартнеры Из ИсточникПартнеры Цикл
		
		ТекстСообщения = ""; 
		
	   // ИдентификаторСтранаРегистрации = ПроверитСтранаРегистрации(СтрокаИсточникПартнеры.СтранаРегистрации); 
	   // Если ИдентификаторСтранаРегистрации = Неопределено Тогда
	   //    ТекстСообщения = ТекстСообщения + "Страна не найдена! ";
	   //КонецЕсли;  
	   
	    Если СтрокаИсточникПартнеры.НаименованиеПолное = "" Тогда
		   ТекстСообщения = ТекстСообщения + "Полное наименование не указано! ";   
	   КонецЕсли;
	   
	   Если СтрокаИсточникПартнеры.Наименование = "$отсутствует"
		   ИЛИ СтрокаИсточникПартнеры.НаименованиеПолное = "$отсутствует" Тогда
		   ТекстСообщения = ТекстСообщения + "Наименование отсутствует! ";   
	   КонецЕсли;
	   
	   ИдентификаторКонтрагента = ВыборкаКонтрагентов.Найти(СтрокаИсточникПартнеры.ИДКлиента);
	   //Если ИдентификаторКонтрагента = Неопределено Тогда
	   //Если СтрокаИсточникПартнеры.ИНН <> "" Тогда
	   //     ПараметрыОтбора = Новый Структура;
	   // 	ПараметрыОтбора.Вставить("ИНН", СтрокаИсточникПартнеры.ИНН);
	   // 	ПараметрыОтбора.Вставить("КПП", СтрокаИсточникПартнеры.КПП);
	   // 	ИдентификаторКонтрагента = ВыборкаКонтрагентов.НайтиСтроки(ПараметрыОтбора);
	   // Иначе 
	   // 	ПараметрыОтбора = Новый Структура;
	   // 	ПараметрыОтбора.Вставить("Наименование", СтрокаИсточникПартнеры.Наименование);
	   // 	ПараметрыОтбора.Вставить("НаименованиеПолное", СтрокаИсточникПартнеры.НаименованиеПолное);
	   // 	ИдентификаторКонтрагента = ВыборкаКонтрагентов.НайтиСтроки(ПараметрыОтбора);
		//КонецЕсли;
		
		Если ТекстСообщения <> "" Тогда
			СтрокаОшибокПартнеры  = ОшибокПартнеры.Добавить(); 
			ЗаполнитьСтрокуТаблицыПартнеры(СтрокаОшибокПартнеры, СтрокаИсточникПартнеры);
			СтрокаОшибокПартнеры.Ошибка = ТекстСообщения; 
        ИначеЕсли ИдентификаторКонтрагента = Неопределено Тогда
			СтрокаСозданиеПартнеры = СозданиеПартнеры.Добавить(); 
			ЗаполнитьСтрокуТаблицыПартнеры(СтрокаСозданиеПартнеры, СтрокаИсточникПартнеры);
		Иначе 	
			СтрокаПроверкиПартнеры = ПроверкиПартнеры.Добавить(); 
			ЗаполнитьСтрокуТаблицыПартнеры(СтрокаПроверкиПартнеры, СтрокаИсточникПартнеры);
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры  
	
&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыПартнеры(СтрокаПриемник, СтрокаИсточник)
	
	СтрокаПриемник.Наименование = СтрокаИсточник.Наименование;                          
	СтрокаПриемник.НаименованиеПолное = СтрокаИсточник.НаименованиеПолное;
	СтрокаПриемник.ЮридическоеФизическоеЛицо = СтрокаИсточник.ЮридическоеФизическоеЛицо ;
	СтрокаПриемник.СтранаРегистрации = СтрокаИсточник.СтранаРегистрации;
	СтрокаПриемник.ИНН = СтрокаИсточник.ИНН;
	СтрокаПриемник.КПП = СтрокаИсточник.КПП; 
	СтрокаПриемник.КодПоОКПО = СтрокаИсточник.КодПоОКПО;
	СтрокаПриемник.Партнер = СтрокаИсточник.Партнер;
	СтрокаПриемник.ЮрФизЛицо = СтрокаИсточник.ЮрФизЛицо;
	СтрокаПриемник.КонтактнаяИнформацияТип = СтрокаИсточник.КонтактнаяИнформацияТип;
	СтрокаПриемник.КонтактнаяИнформацияСтрана = СтрокаИсточник.КонтактнаяИнформацияСтрана;
	СтрокаПриемник.КонтактнаяИнформацияРегион = СтрокаИсточник.КонтактнаяИнформацияРегион;
	СтрокаПриемник.КонтактнаяИнформацияГород = СтрокаИсточник.КонтактнаяИнформацияГород;
	СтрокаПриемник.КонтактнаяИнформацияНомерТелефона = СтрокаИсточник.КонтактнаяИнформацияНомерТелефона;
	СтрокаПриемник.Факс = СтрокаИсточник.Факс;
	СтрокаПриемник.РуководительОрганизацииДолжность = СтрокаИсточник.РуководительОрганизацииДолжность;
	СтрокаПриемник.РуководительОрганизацииФИО = СтрокаИсточник.РуководительОрганизацииФИО;
	СтрокаПриемник.НаименованиеСФормойСобственности = СтрокаИсточник.НаименованиеСФормойСобственности;
	СтрокаПриемник.Счет = СтрокаИсточник.Счет;
	СтрокаПриемник.ФормаСобственности = СтрокаИсточник.ФормаСобственности;
	СтрокаПриемник.Зона = СтрокаИсточник.Зона;
	СтрокаПриемник.ИДКлиента = СтрокаИсточник.ИДКлиента;

КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыТаблицыПартнеры() 
     				
	Для каждого СтрокаПартнеры Из СозданиеПартнеры Цикл 
		
		ИдентификаторП = Неопределено;
		ИдентификаторК = Неопределено;
		ИдентификаторЛ = Неопределено;
		ЭлементКонтрагенты = Неопределено;
		ЭлементПартнеры = Неопределено;
		СоздатьЭлементПартнер (СтрокаПартнеры, ИдентификаторП, ЭлементПартнеры);
		СоздатьЭлементКонтрагенты (СтрокаПартнеры, ИдентификаторК, ЭлементКонтрагенты, ЭлементПартнеры);
        СоздатьЭлементКонтактныеЛица (СтрокаПартнеры, ИдентификаторЛ, ЭлементКонтрагенты);
		Если Не (СтрокаПартнеры.Счет = "") Тогда
			СоздатьЭлементСчет (СтрокаПартнеры.Счет, ЭлементКонтрагенты); 
		КонецЕсли;
		Если ИдентификаторК И ИдентификаторП И ИдентификаторЛ Тогда
			СтрокаПартнеры.Создано = Истина;
		Иначе
			СтрокаПартнеры.Создано = Ложь;
		КонецЕсли;
	КонецЦикла;	
	
	ИзменениеУсловногоОформленияСозданияПартнеров();
		
КонецПроцедуры  

&НаСервере 
Процедура СоздатьЭлементПартнер (СтрокаПартнеры, ИдентификаторП, ЭлементПартнеры)
	
	ЭлементПартнеры = Справочники.Партнеры.СоздатьЭлемент();
	ЭлементПартнеры.Наименование =  СтрокаПартнеры.Наименование;
	ЭлементПартнеры.НаименованиеПолное = СтрокаПартнеры.НаименованиеПолное; 
	СозданиеЮрФизЛицоПартнеры(СтрокаПартнеры, ЭлементПартнеры);
	ЭлементПартнеры.ДатаРегистрации = Дата; 
	ЭлементПартнеры.Поставщик = Истина;
	Если СтрокаПартнеры.Партнер = "" ИЛИ СтрокаПартнеры.Партнер = "Нет" ИЛИ СтрокаПартнеры.Партнер = "нет" Тогда 
		ЭлементПартнеры.ПрочиеОтношения = Истина;
	Иначе 
		ЭлементПартнеры.ПрочиеОтношения = Ложь;
	КонецЕсли;
	
	Если СтрокаПартнеры.КонтактнаяИнформацияТип <> "" Тогда
		ЗаполнитьКонтактнуюИнформациюКонтрагентПартнер(ЭлементПартнеры, СтрокаПартнеры); 
	КонецЕсли;	
	
	Попытка	
		ЭлементПартнеры.Записать();
		ИдентификаторП = Истина;
		ЭлементПартнеры = ЭлементПартнеры.Ссылка;
	Исключение
		ИдентификаторП = Ложь;
	КонецПопытки;

КонецПроцедуры 

&НаСервере 
Процедура СоздатьЭлементКонтрагенты (СтрокаПартнеры, ИдентификаторК, ЭлементКонтрагенты, ЭлементПартнеры)
	
	ЭлементКонтрагенты = Справочники.Контрагенты.СоздатьЭлемент(); 
	ЭлементКонтрагенты.Наименование = СтрокаПартнеры.Наименование;
	ЭлементКонтрагенты.НаименованиеПолное = СтрокаПартнеры.НаименованиеПолное; 
	СозданиеЮрФизЛицоКонтрагенты(СтрокаПартнеры, ЭлементКонтрагенты);
	ЭлементКонтрагенты.СтранаРегистрации = ПроверитСтранаРегистрации(СтрокаПартнеры.СтранаРегистрации);
	Если СтрДлина(СтрокаПартнеры.ИНН) < 7 Тогда
		ЭлементКонтрагенты.ИНН = "";
	Иначе	 
		ЭлементКонтрагенты.ИНН = СтрокаПартнеры.ИНН;
		ЭлементКонтрагенты.КПП = СтрокаПартнеры.КПП; 
	КонецЕсли;
	ЭлементКонтрагенты.Партнер = ЭлементПартнеры;
	ЭлементКонтрагенты.КодПоОКПО = СтрокаПартнеры.КодПоОКПО;
	ЗаполнитьДопРеквизитыЭлемента(ЭлементКонтрагенты, СтрокаПартнеры);
	
	Если СтрокаПартнеры.КонтактнаяИнформацияТип <> "" Тогда
		ЗаполнитьКонтактнуюИнформациюКонтрагентПартнер(ЭлементКонтрагенты, СтрокаПартнеры);
	КонецЕсли;
	
	Попытка	
		ЭлементКонтрагенты.Записать();
		ИдентификаторК = Истина; 
		ЭлементКонтрагенты = ЭлементКонтрагенты.Ссылка;
	Исключение
		ИдентификаторК = Ложь;
	КонецПопытки;
	
КонецПроцедуры 

&НаСервере 
Процедура СоздатьЭлементКонтактныеЛица (СтрокаПартнеры, ИдентификаторЛ, ЭлементКонтрагенты)  
	
	ЭлементКонтактныеЛица = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент(); 
	ЭлементКонтактныеЛица.Наименование = СтрокаПартнеры.РуководительОрганизацииФИО;  
	ЭлементКонтактныеЛица.ДолжностьПоВизитке = СтрокаПартнеры.РуководительОрганизацииДолжность; 
	ЭлементКонтактныеЛица.Владелец = ЭлементКонтрагенты.Партнер;
	ЭлементКонтактныеЛица.ДатаРегистрацииСвязи = Дата;
	ЭлементКонтактныеЛица.Автор = Пользователи.ТекущийПользователь(); 
	
	Попытка	
		ЭлементКонтактныеЛица.Записать();
		ИдентификаторЛ = Истина;
	Исключение
		ИдентификаторЛ = Ложь;
	КонецПопытки;

КонецПроцедуры 

&НаСервере 
Процедура СозданиеЮрФизЛицоПартнеры(СтрокаПартнеры, ЭлементПартнеры)
	
	Если СтрокаПартнеры.ЮрФизЛицо = "Юридическое лицо"  Тогда 
		ЭлементПартнеры.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
	ИначеЕсли СтрокаПартнеры.ЮрФизЛицо = "Физическое лицо" Тогда
		ЭлементПартнеры.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо;
	Иначе
		ЭлементПартнеры.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
		ЮрФизЛицо = Неопределено;
	КонецЕсли;
	Если СтрокаПартнеры.Партнер = "да" ИЛИ СтрокаПартнеры.Партнер = "Да" ИЛИ СтрокаПартнеры.Партнер = "ДА" Тогда 
		ЭлементПартнеры.Клиент = Истина;
	Иначе 
		ЭлементПартнеры.Клиент = Ложь;
	КонецЕсли;
	//Если ЭлементПартнеры.Клиент Тогда	
	//	ЭлементПартнеры.ГруппаДоступа = Справочники.ГруппыДоступаПартнеров.НайтиПоНаименованию("Продажи"); 
	//Иначе 	
	//	ЭлементПартнеры.ГруппаДоступа = Справочники.ГруппыДоступаПартнеров.НайтиПоНаименованию("Прочие отношения");
	//КонецЕсли;	

КонецПроцедуры

&НаСервере 
Процедура СозданиеЮрФизЛицоКонтрагенты(СтрокаПартнеры, ЭлементКонтрагенты)
	
	Если СтрокаПартнеры.ФормаСобственности = "ЧЛ" Тогда
		ЭлементКонтрагенты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
		ЭлементКонтрагенты.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо; 
	ИначеЕсли СтрокаПартнеры.ФормаСобственности = "ИП" Тогда 
		ЭлементКонтрагенты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель;
		ЭлементКонтрагенты.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Иначе	  
		Если СтрокаПартнеры.ЮрФизЛицо = "Юридическое лицо"
			И (СтрокаПартнеры.СтранаРегистрации = "Россия" 
			ИЛИ СтрокаПартнеры.СтранаРегистрации = "РОССИЯ") Тогда 
			ЭлементКонтрагенты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
			ЭлементКонтрагенты.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
		ИначеЕсли СтрокаПартнеры.ЮрФизЛицо = "Юридическое лицо" И СтрокаПартнеры.СтранаРегистрации <> "Россия" Тогда        
			ЭлементКонтрагенты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент;
			ЭлементКонтрагенты.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
		ИначеЕсли СтрокаПартнеры.ЮрФизЛицо = "Физическое лицо" Тогда
			ЭлементКонтрагенты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
			ЭлементКонтрагенты.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		ИначеЕсли СтрокаПартнеры.ЮрФизЛицо = "Индивидуальный предприниматель" Тогда
			ЭлементКонтрагенты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель;
			ЭлементКонтрагенты.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо; 
		Иначе
			ЭлементКонтрагенты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
			ЭлементКонтрагенты.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			ЮрФизЛицо = Неопределено;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере 
Процедура СоздатьЭлементСчет (Счет, ЭлементКонтрагенты) 
	
		БанковскийСчетаКонтрагентов = Справочники.БанковскиеСчетаКонтрагентов.СоздатьЭлемент();
		БанковскийСчетаКонтрагентов.Владелец = ЭлементКонтрагенты; 
		НомерСчета = ВРег(СтрЗаменить(СтрЗаменить(СокрЛП(Счет), " ", ""), ".", ""));
		БанковскийСчетаКонтрагентов.НомерСчета = НомерСчета;
		
		Если ЕстьБуквыВСтроке(НомерСчета) Тогда
			БанковскийСчетаКонтрагентов.ИностранныйБанк = Истина;
			Если Сред(НомерСчета, 1, 4) = "IBAN" Тогда
				НомерСчета = Сред(НомерСчета, 5);
				БанковскийСчетаКонтрагентов.НомерСчета = НомерСчета;
			КонецЕсли;
			Если ДенежныеСредстваКлиентСервер.ПравильнаяДлинаIBAN(НомерСчета) Тогда
				БанковскийСчетаКонтрагентов.ЭтоIBAN = Истина;
				ОпределитьСтрануИБанкПоIBAN(БанковскийСчетаКонтрагентов);
				БанковскийСчетаКонтрагентов.РучноеИзменениеРеквизитовБанка = Истина;
			КонецЕсли;
		КонецЕсли;  
		Если БанковскийСчетаКонтрагентов.ВалютаДенежныхСредств.Пустая() Тогда
			БанковскийСчетаКонтрагентов.ВалютаДенежныхСредств = Справочники.Валюты.ПолучитьВалютуПоУмолчанию();
		КонецЕсли;
		ШаблонНаименования = НСтр("ru = '%1, %2'; |en = '%1, %2'"); 
		ВалютаДС = СокрЛП(БанковскийСчетаКонтрагентов.ВалютаДенежныхСредств);
		СтрокаНаименования = СтрШаблон(ШаблонНаименования, Прав(СокрЛП(НомерСчета), 4), ВалютаДС);
		БанковскийСчетаКонтрагентов.Наименование = СтрокаНаименования;
		
		Попытка	
			БанковскийСчетаКонтрагентов.Записать();
		Исключение
			СозданиеСчета = Ложь;
		КонецПопытки;	
 
КонецПроцедуры

&НаСервере 
Процедура ИзменениеУсловногоОформленияСозданияПартнеров() 
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеПартнеры.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеПартнеры.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеПартнеры.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;

КонецПроцедуры	

&НаСервере 
Процедура ПроверитьЭлементыТаблицыПартнеры()
		
	Для каждого СтрокаПартнеры Из ПроверкиПартнеры Цикл  
		
		СправочникКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("бит_ИДКлиента", СтрокаПартнеры.ИДКлиента);;
		Если СправочникКонтрагент = Неопределено Тогда 
			Если СтрокаПартнеры.ИНН <> "" Тогда
				ПараметрыОтбора = Новый Структура("Отбор,ВыборГруппИЭлементов");
				Отбор = Новый Структура;
				Отбор.Вставить("ИНН", СтрокаПартнеры.ИНН);
				Отбор.Вставить("КПП", СтрокаПартнеры.КПП); 
				ПараметрыОтбора.Отбор = Отбор;
				ПараметрыОтбора.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
				СправочникКонтрагент = Справочники.Контрагенты.ПолучитьДанныеВыбора(ПараметрыОтбора); 
				Если СправочникКонтрагент.Количество() > 0 Тогда	
					СправочникКонтрагент = СправочникКонтрагент[0].Значение;
				Иначе 
					СправочникКонтрагент =  Неопределено;
				КонецЕсли;
			Иначе
				//ПараметрыОтбора = Новый Структура("Отбор,ВыборГруппИЭлементов");
				//Отбор = Новый Структура;
				//Отбор.Вставить("Наименование", СтрокаПартнеры.Наименование);
				//Отбор.Вставить("НаименованиеПолное", СтрокаПартнеры.НаименованиеПолное); 
				//ПараметрыОтбора.Отбор = Отбор;
				//ПараметрыОтбора.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
				//СправочникКонтрагент = Справочники.Контрагенты.ПолучитьДанныеВыбора(ПараметрыОтбора);
				//Если СправочникКонтрагент.Количество() > 0 Тогда	
				//	СправочникКонтрагент = СправочникКонтрагент[0].Значение;
				//Иначе 
				//	СправочникКонтрагент =  Неопределено;
				//КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ЭлементКонтрагенты = СправочникКонтрагент.ПолучитьОбъект();
		
		ЗаполнитьПустыеЗначенияПартнер(ЭлементКонтрагенты, СтрокаПартнеры);
				
		Если ЭлементКонтрагенты.КонтактнаяИнформация.Количество() = 0 Тогда
			ЗаполнитьКонтактнуюИнформациюКонтрагентПартнер(ЭлементКонтрагенты, СтрокаПартнеры);
			СтрокаПартнеры.Изменено = Истина;
		КонецЕсли;
		
////////////////////////////////////////////////
// Исправление
		//Если ЭлементКонтрагенты.ДополнительныеРеквизиты.Количество() = 0	Тогда
		//	ЗаполнитьДопРеквизитыЭлемента(ЭлементКонтрагенты, СтрокаПартнеры);
		//	СтрокаПартнеры.Изменено = Истина;
		//КонецЕсли;	
//////////////////////////////////////////////  

        ПроверитьДопРеквизитыЭлемента(ЭлементКонтрагенты, СтрокаПартнеры);
		
///////////////////////////////////////////
		Если СтрокаПартнеры.Изменено Тогда
			
			Попытка
				ЭлементКонтрагенты.Записать();
			Исключение 
				СтрокаПартнеры.Изменено = Ложь;
			КонецПопытки;
		КонецЕсли;
				
	КонецЦикла;	
	
	ИзменениеУсловногоОформленияПроверкиПартнеров();

КонецПроцедуры  

&НаСервере 
Процедура ЗаполнитьПустыеЗначенияПартнер(ЭлементКонтрагенты, СтрокаПартнеры)
	
	Если ЭлементКонтрагенты.КодПоОКПО = "" ИЛИ ЭлементКонтрагенты.КодПоОКПО = Неопределено Тогда
		Если СтрокаПартнеры.КодПоОКПО <> "" Тогда
			ЭлементКонтрагенты.КодПоОКПО = СтрокаПартнеры.КодПоОКПО;
			СтрокаПартнеры.Изменено = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭлементКонтрагенты.СтранаРегистрации.Пустая() И СтрокаПартнеры.СтранаРегистрации <> "" Тогда
		СтранаРегистрации = ПроверитСтранаРегистрации(СтрокаПартнеры.СтранаРегистрации); 
		Если СтранаРегистрации <> Неопределено Тогда
			ЭлементКонтрагенты.СтранаРегистрации = СтранаРегистрации;  
			СтрокаПартнеры.Изменено = Истина; 
		КонецЕсли;
	КонецЕсли;
	
	Если ЭлементКонтрагенты.НаименованиеПолное = "" ИЛИ ЭлементКонтрагенты.НаименованиеПолное = Неопределено Тогда  
		ЭлементКонтрагенты.НаименованиеПолное = СтрокаПартнеры.НаименованиеПолное;
		СтрокаПартнеры.Изменено = Истина;
	КонецЕсли;  
	
	ЭлементПартнер = ЭлементКонтрагенты.Партнер.ПолучитьОбъект();

	//Если ЭлементПартнер.ГруппаДоступа.Пустая() Тогда
	//	Если ЭлементПартнер.Клиент Тогда	
	//		ЭлементПартнер.ГруппаДоступа = Справочники.ГруппыДоступаПартнеров.НайтиПоНаименованию("Продажи"); 
	//	Иначе 	
	//		ЭлементПартнер.ГруппаДоступа = Справочники.ГруппыДоступаПартнеров.НайтиПоНаименованию("Прочие отношения");
	//	КонецЕсли;
	//	СтрокаПартнеры.Изменено = Истина;
	//КонецЕсли;
	
	Попытка
		ЭлементПартнер.Записать();
	Исключение 
		СтрокаПартнеры.Изменено = Ложь;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьКонтактнуюИнформациюКонтрагентПартнер(ЭлементПриемник, СтрокаПартнеры)
	
	ЗаполнитьАдресаКонтрагентПартнер(ЭлементПриемник, СтрокаПартнеры);
    	
	Если СтрокаПартнеры.КонтактнаяИнформацияНомерТелефона <> "" Тогда  
		МассивНомерТелефона = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		СтрокаПартнеры.КонтактнаяИнформацияНомерТелефона, ",");	
		Для Индекс = 0 По МассивНомерТелефона.Количество() - 1 Цикл 
			ЭлементКонтактнаяИнформацияКонтрагент = ЭлементПриемник.КонтактнаяИнформация.Добавить();
			ЭлементКонтактнаяИнформацияКонтрагент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон; 
			Если ТипЗнч(ЭлементПриемник) =  Тип("СправочникСсылка.Контрагенты") Тогда
				ЭлементКонтактнаяИнформацияКонтрагент.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;	
			Иначе
				ЭлементКонтактнаяИнформацияКонтрагент.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
			КонецЕсли;
           	ЭлементКонтактнаяИнформацияКонтрагент.Представление = МассивНомерТелефона[Индекс];
			ЭлементКонтактнаяИнформацияКонтрагент.НомерТелефона = МассивНомерТелефона[Индекс]; 
			Если ТипЗнч(ЭлементПриемник) =  Тип("СправочникСсылка.Контрагенты") Тогда
				ЭлементКонтактнаяИнформацияКонтрагент.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;	
			Иначе
				ЭлементКонтактнаяИнформацияКонтрагент.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
			КонецЕсли;
            ЭлементКонтактнаяИнформацияКонтрагент.Значение = МассивНомерТелефона[Индекс];
			Если ТипЗнч(ЭлементПриемник) =  Тип("СправочникСсылка.Контрагенты") Тогда
			ЭлементКонтактнаяИнформацияКонтрагент.ДействуетС = Дата;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СтрокаПартнеры.Факс <> "" Тогда 
		МассивФакс = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПартнеры.Факс, ",");
		Для Индекс = 0 По МассивФакс.Количество() - 1 Цикл 
			ЭлементКонтактнаяИнформацияКонтрагент = ЭлементПриемник.КонтактнаяИнформация.Добавить();
			ЭлементКонтактнаяИнформацияКонтрагент.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
			ЭлементКонтактнаяИнформацияКонтрагент.Вид = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагенты;
			ЭлементКонтактнаяИнформацияКонтрагент.Представление = МассивФакс[Индекс];
			ЭлементКонтактнаяИнформацияКонтрагент.НомерТелефона = МассивФакс[Индекс];
			ЭлементКонтактнаяИнформацияКонтрагент.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагенты;
			Если ТипЗнч(ЭлементПриемник) =  Тип("СправочникСсылка.Контрагенты") Тогда
			ЭлементКонтактнаяИнформацияКонтрагент.ДействуетС = Дата;  
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
		
КонецПроцедуры  

&НаСервере 
Процедура ЗаполнитьАдресаКонтрагентПартнер(ЭлементПриемник, СтрокаПартнеры)

	Если СтрокаПартнеры.КонтактнаяИнформацияТип <> "" Тогда
		
		ЭлементКонтактнаяИнформацияКонтрагент = ЭлементПриемник.КонтактнаяИнформация.Добавить();
		ЭлементКонтактнаяИнформацияКонтрагент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес; 
		ЭлементКонтактнаяИнформацияКонтрагент.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента; 
		ЭлементКонтактнаяИнформацияКонтрагент.Представление = СтрокаПартнеры.КонтактнаяИнформацияТип;
		ЭлементКонтактнаяИнформацияКонтрагент.Страна = СтрокаПартнеры.КонтактнаяИнформацияСтрана;
		ЭлементКонтактнаяИнформацияКонтрагент.Регион = СтрокаПартнеры.КонтактнаяИнформацияРегион;
		ЭлементКонтактнаяИнформацияКонтрагент.Город = СтрокаПартнеры.КонтактнаяИнформацияГород;
		ЭлементКонтактнаяИнформацияКонтрагент.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		Если ТипЗнч(ЭлементПриемник) =  Тип("СправочникСсылка.Контрагенты") Тогда
		ЭлементКонтактнаяИнформацияКонтрагент.ДействуетС = Дата; 
		КонецЕсли;
		
		ЭлементКонтактнаяИнформацияКонтрагент = ЭлементПриемник.КонтактнаяИнформация.Добавить();
		ЭлементКонтактнаяИнформацияКонтрагент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		ЭлементКонтактнаяИнформацияКонтрагент.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента; 
		ЭлементКонтактнаяИнформацияКонтрагент.Представление = СтрокаПартнеры.КонтактнаяИнформацияТип;
		ЭлементКонтактнаяИнформацияКонтрагент.Страна = СтрокаПартнеры.КонтактнаяИнформацияСтрана;
		ЭлементКонтактнаяИнформацияКонтрагент.Регион = СтрокаПартнеры.КонтактнаяИнформацияРегион;
		ЭлементКонтактнаяИнформацияКонтрагент.Город = СтрокаПартнеры.КонтактнаяИнформацияГород;
		ЭлементКонтактнаяИнформацияКонтрагент.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
		Если ТипЗнч(ЭлементПриемник) =  Тип("СправочникСсылка.Контрагенты") Тогда
        ЭлементКонтактнаяИнформацияКонтрагент.ДействуетС = Дата;
		КонецЕсли;

		Если СтрокаПартнеры.СтранаРегистрации = "РОССИЯ" ИЛИ СтрокаПартнеры.СтранаРегистрации = "Россия" Тогда 
			
			ЭлементКонтактнаяИнформацияКонтрагент = ЭлементПриемник.КонтактнаяИнформация.Добавить();
			ЭлементКонтактнаяИнформацияКонтрагент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			ЭлементКонтактнаяИнформацияКонтрагент.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента; 
			ЭлементКонтактнаяИнформацияКонтрагент.Представление = СтрокаПартнеры.КонтактнаяИнформацияТип;
			ЭлементКонтактнаяИнформацияКонтрагент.Страна = СтрокаПартнеры.КонтактнаяИнформацияСтрана;
			ЭлементКонтактнаяИнформацияКонтрагент.Регион = СтрокаПартнеры.КонтактнаяИнформацияРегион;
			ЭлементКонтактнаяИнформацияКонтрагент.Город = СтрокаПартнеры.КонтактнаяИнформацияГород;
			ЭлементКонтактнаяИнформацияКонтрагент.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
			Если ТипЗнч(ЭлементПриемник) =  Тип("СправочникСсылка.Контрагенты") Тогда
			ЭлементКонтактнаяИнформацияКонтрагент.ДействуетС = Дата;
			КонецЕсли;
           		
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры	

&НаСервере 
Функция ПроверитСтранаРегистрации(СтранаРегистрации)
	
	СтраныРегистрации = КорректировкаНаименованияСтраныРегистрации(СтранаРегистрации);
	СтраныРегистрации = ВРег(СтранаРегистрации);
	СправочникСтранаРегистрации = Справочники.СтраныМира.ДанныеСтраныМира( ,СтраныРегистрации);
	Если  ТипЗнч(СправочникСтранаРегистрации) = Тип("Структура") Тогда
		  СправочникСтранаРегистрации = СправочникСтранаРегистрации.Ссылка;
	КонецЕсли;
	  
	Если СправочникСтранаРегистрации = Неопределено Тогда  
		
		КлассификаторСтрана = Справочники.СтраныМира.ДанныеКлассификатораСтранМираПоНаименованию(СтраныРегистрации);
		Если КлассификаторСтрана <> Неопределено Тогда
			Если КлассификаторСтрана.Количество() > 0 Тогда
				
				СправочникСтранаРегистрации = Справочники.СтраныМира.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(СправочникСтранаРегистрации, КлассификаторСтрана);
				СправочникСтранаРегистрации.Записать();
				СправочникСтранаРегистрации = СправочникСтранаРегистрации.Ссылка;
				
			КонецЕсли;
		Иначе
			СправочникСтранаРегистрации = Неопределено;
		КонецЕсли;
		
	//Иначе
	//	СправочникСтранаРегистрации = СправочникСтранаРегистрации.Ссылка;	
	КонецЕсли; 
	
	Возврат СправочникСтранаРегистрации;

КонецФункции	

&НаСервере
Функция КорректировкаНаименованияСтраныРегистрации(СтранаРегистрации)
	
	Если СтранаРегистрации = "Великобритания" Тогда
		СтранаРегистрации = "СОЕДИНЕННОЕ КОРОЛЕВСТВО";
	ИначеЕсли СтранаРегистрации = "Иран" Тогда
		СтранаРегистрации = "ИРАН (ИСЛАМСКАЯ РЕСПУБЛИКА)";
	ИначеЕсли СтранаРегистрации = "Кыргызстан" Тогда
		СтранаРегистрации = "КИРГИЗИЯ";
	ИначеЕсли СтранаРегистрации = "Молдова" Тогда
		СтранаРегистрации = "МОЛДОВА, РЕСПУБЛИКА"; 
	ИначеЕсли СтранаРегистрации = "ОАЭ" Тогда
		СтранаРегистрации = "ОБЪЕДИНЕННЫЕ АРАБСКИЕ ЭМИРАТЫ";
	ИначеЕсли СтранаРегистрации = "США" Тогда
		СтранаРегистрации = "СОЕДИНЕННЫЕ ШТАТЫ"; 
	ИначеЕсли СтранаРегистрации = "Туркмения" Тогда
		СтранаРегистрации = "ТУРКМЕНИСТАН";
	Иначе 
		Возврат СтранаРегистрации;	 
	КонецЕсли;
	
	Возврат СтранаРегистрации;

КонецФункции

&НаСервере 
Процедура ЗаполнитьДопРеквизитыЭлемента(ЭлементКонтрагенты, СтрокаПартнеры)
/////////////////////////////////////////////////////////
// Требуется корректно указать идентификатор 		
		
		 //НаименованиеСФормойСобственности = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(
		 //                                                                          "НаименованиеСФормойСобственности_Бит"); 
		 //ФормаСобственности = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(
		 //                                                                                        "ФормаСобственности_Бит"); 
		 //Зона = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Зона_Бит");
		 //НовСтрДопРеквизитНаименование = ЭлементКонтрагенты.ДополнительныеРеквизиты.Добавить();
		 //НовСтрДопРеквизитНаименование.Свойство = НаименованиеСФормойСобственности;
		 //НовСтрДопРеквизитНаименование.Значение = СтрокаПартнеры.НаименованиеСФормойСобственности;  
		 //
		 //НовСтрДопРеквизитФормаСобственности = ЭлементКонтрагенты.ДополнительныеРеквизиты.Добавить();
		 //НовСтрДопРеквизитФормаСобственности.Свойство = ФормаСобственности;
		 //НовСтрДопРеквизитФормаСобственности.Значение = СтрокаПартнеры.ФормаСобственности; 
		 //
		 //НовСтрДопРеквизитЗона = ЭлементКонтрагенты.ДополнительныеРеквизиты.Добавить();
		 //НовСтрДопРеквизитЗона.Свойство = Зона;
		 //НовСтрДопРеквизитЗона.Значение = СтрокаПартнеры.Зона; 

/////////////////////////////////////////////////////////
// Исправление 

        ЭлементКонтрагенты.бит_НаименованиеСФормойСобственности = СтрокаПартнеры.НаименованиеСФормойСобственности;
        ЭлементКонтрагенты.бит_ФормаСобственности = СтрокаПартнеры.ФормаСобственности;
		ЭлементКонтрагенты.бит_Зона = СтрокаПартнеры.Зона; 
		ЭлементКонтрагенты.бит_ИДКлиента = СтрокаПартнеры.ИДКлиента;

/////////////////////////////////////////////////////////
КонецПроцедуры 

&НаСервере 
Процедура ПроверитьДопРеквизитыЭлемента(ЭлементКонтрагенты, СтрокаПартнеры)
	
		Если ЭлементКонтрагенты.бит_НаименованиеСФормойСобственности = "" 
			Или ЭлементКонтрагенты.бит_НаименованиеСФормойСобственности = Неопределено Тогда 
			Если СтрокаПартнеры.НаименованиеСФормойСобственности <> "" Тогда 
				ЭлементКонтрагенты.бит_НаименованиеСФормойСобственности = СтрокаПартнеры.НаименованиеСФормойСобственности; 
				СтрокаПартнеры.Изменено = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭлементКонтрагенты.бит_ФормаСобственности = "" 
			Или ЭлементКонтрагенты.бит_ФормаСобственности = Неопределено Тогда
			Если СтрокаПартнеры.ФормаСобственности <> "" Тогда
				ЭлементКонтрагенты.бит_ФормаСобственности = СтрокаПартнеры.ФормаСобственности; 
				СтрокаПартнеры.Изменено = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭлементКонтрагенты.бит_Зона = "" 
			Или ЭлементКонтрагенты.бит_Зона = Неопределено Тогда
			Если СтрокаПартнеры.Зона <> "" Тогда
				ЭлементКонтрагенты.бит_Зона = СтрокаПартнеры.Зона; 
				СтрокаПартнеры.Изменено = Истина;
			КонецЕсли; 
		КонецЕсли;

КонецПроцедуры
	 
 &НаСервере 
Процедура ИзменениеУсловногоОформленияПроверкиПартнеров()
   	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиПартнеры.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); 
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиПартнеры.Изменено"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь; 
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки); 
	
	Для каждого элПоля Из Элементы.ПроверкиПартнеры.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле1 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;

КонецПроцедуры
#КонецОбласти   

#Область СозданияБанковскихСчетовКонтрагентов

&НаСервере 
Процедура ЗаполнитьТаблицуИсточникБанковскиеСчетаКонтрагентов(ПредставлениеИсточника) 
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточникБанкК = ИсточникБанковскиеСчетаКонтрагентов.Добавить();	 
		
		ТекстКолонки = ПредставлениеИсточника.Область(НомерСтроки, 1).Текст;
		СтрИсточникБанкК.Владелец = ТекстКолонки;           
		СтрИсточникБанкК.НомерСчета = ПредставлениеИсточника.Область(НомерСтроки, 3).Текст;
		СтрИсточникБанкК.ТекстНазначения = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст;
	    СтрИсточникБанкК.ВалютаДенежныхСредств = ПредставлениеИсточника.Область(НомерСтроки, 8).Текст;	
		СтрИсточникБанкК.БИКБанка = ПредставлениеИсточника.Область(НомерСтроки, 9).Текст;
		СтрИсточникБанкК.НаименованиеБанка = ПредставлениеИсточника.Область(НомерСтроки, 11).Текст;
		СтрИсточникБанкК.КоррСчетБанка = ПредставлениеИсточника.Область(НомерСтроки, 12).Текст;
		СтрИсточникБанкК.ИДКлиента = ПредставлениеИсточника.Область(НомерСтроки, 41).Текст;
		
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникБанковскиеСчетаКонтрагентов.Удалить(СтрИсточникБанкК);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте 
Процедура ДействияСТаблицамиБанковскиеСчетаКонтрагентов(ПредставлениеИсточника)

	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникБанковскиеСчетаКонтрагентов.Видимость 	= Истина;
		ЗаполнитьТаблицуИсточникБанковскиеСчетаКонтрагентов(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда
		Элементы.СозданиеБанковскиеСчетаКонтрагентов.Видимость 	= Истина;
        Элементы.ПроверкиБанковскиеСчетаКонтрагентов.Видимость 	= Истина;
		Элементы.ОшибокБанковскиеСчетаКонтрагентов.Видимость 	= Истина;
		ЗаполнитьТаблицыПроверкиБанковскиеСчетаКонтрагентов();
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыТаблицыБанковскиеСчетаКонтрагентов();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыТаблицыБанковскиеСчетаКонтрагентов();	
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.БанковскиеСчетаКонтрагентов.ФормаСписка"); 
	ИначеЕсли ИдентификаторСостояния = "Состояние6" Тогда
		 ОбработатьОшибкиЭлементыТаблицыБанковскиеСчетаКонтрагентов();		
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры 

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиБанковскиеСчетаКонтрагентов()
	
	УсловноеОформление.Элементы.Очистить();
	
	Для каждого СтрокаИсточникБанковскиеСчетаКонтрагентов Из ИсточникБанковскиеСчетаКонтрагентов Цикл     
		Если СтрокаИсточникБанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств = "RUB" Тогда 
			СтрокаИсточникБанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств = "руб.";   
		КонецЕсли;		
	КонецЦикла;  
	МассивВалют = ИсточникБанковскиеСчетаКонтрагентов.Выгрузить( , "ВалютаДенежныхСредств");
	МассивНомерСчета = ИсточникБанковскиеСчетаКонтрагентов.Выгрузить( , "НомерСчета");
	МассивБик = ИсточникБанковскиеСчетаКонтрагентов.Выгрузить( , "БИКБанка"); 
	МассивКонтрагентов = ИсточникБанковскиеСчетаКонтрагентов.Выгрузить( , "ИДКлиента");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторБанков.Ссылка КАК Ссылка,
	|	КлассификаторБанков.Код КАК Код,
	|	КлассификаторБанков.СВИФТБИК КАК СВИФТБИК
	|ПОМЕСТИТЬ КлассификаторБаковБик
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|ГДЕ
	|	КлассификаторБанков.Код В(&МассивБик)
	|	И КлассификаторБанков.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлассификаторБанков.Ссылка КАК Ссылка,
	|	КлассификаторБанков.Код КАК Код,
	|	КлассификаторБанков.СВИФТБИК КАК СВИФТБИК
	|ПОМЕСТИТЬ КлассификаторБаковСВИФТ
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|ГДЕ
	|	КлассификаторБанков.СВИФТБИК В(&МассивБик)
	|	И КлассификаторБанков.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлассификаторБаковБик.Ссылка КАК Ссылка,
	|	КлассификаторБаковБик.Код КАК Код,
	|	КлассификаторБаковБик.СВИФТБИК КАК СВИФТБИК
	|ИЗ
	|	КлассификаторБаковБик КАК КлассификаторБаковБик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КлассификаторБаковСВИФТ.Ссылка,
	|	КлассификаторБаковСВИФТ.Код,
	|	КлассификаторБаковСВИФТ.СВИФТБИК
	|ИЗ
	|	КлассификаторБаковСВИФТ КАК КлассификаторБаковСВИФТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка,
	|	Валюты.Код КАК Код,
	|	Валюты.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Наименование В(&МассивВалют)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БанковскиеСчетаКонтрагентов.Ссылка КАК Ссылка1,
	|	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета1
	|ИЗ
	|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	|ГДЕ
	|	БанковскиеСчетаКонтрагентов.НомерСчета В(&МассивНомерСчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.бит_ИДКлиента КАК бит_ИДКлиента
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.бит_ИДКлиента В(&МассивКонтрагентов)";
	
	Запрос.УстановитьПараметр("МассивБик", МассивБик);
	Запрос.УстановитьПараметр("МассивВалют", МассивВалют);
	Запрос.УстановитьПараметр("МассивНомерСчета", МассивНомерСчета);
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаБик = РезультатЗапроса[2].Выгрузить();
	ВыборкаВалют = РезультатЗапроса[3].Выгрузить();
	ВыборкаНомерСчета = РезультатЗапроса[4].Выгрузить(); 
	ВыборкаКонтрагентов = РезультатЗапроса[5].Выгрузить(); 
	
	ЗаполнениеТаблицБанковскиеСчетаКонтрагентов(ВыборкаБик, ВыборкаВалют, ВыборкаНомерСчета, ВыборкаКонтрагентов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеТаблицБанковскиеСчетаКонтрагентов(ВыборкаБик, ВыборкаВалют, ВыборкаНомерСчета, ВыборкаКонтрагентов)
    
	Для каждого СтрокаИсточникБанковскиеСчетаКонтрагентов Из ИсточникБанковскиеСчетаКонтрагентов Цикл 
		
		ТекстСообщения = ""; 
		
		ИдентификаторIBAN = ЕстьБуквыВСтроке(СтрокаИсточникБанковскиеСчетаКонтрагентов.НомерСчета);
		Если НЕ ИдентификаторIBAN Тогда
		ИдентификаторБик = ВыборкаБик.Найти(СтрокаИсточникБанковскиеСчетаКонтрагентов.БИКБанка);
		Если ИдентификаторБик = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Банк не найден! ";
		КонецЕсли;
		КонецЕсли;
		
		ИдентификаторВалюта = ВыборкаВалют.Найти(СтрокаИсточникБанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств);
		Если ИдентификаторВалюта = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Валюта не найдена! ";
		КонецЕсли;
		
		ИдентификаторКонтрагента = ВыборкаКонтрагентов.Найти(СтрокаИсточникБанковскиеСчетаКонтрагентов.ИДКлиента);
		Если ИдентификаторКонтрагента = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Контрагент по ID не найден! ";
		КонецЕсли;
		
		Если СтрокаИсточникБанковскиеСчетаКонтрагентов.НомерСчета = "" ИЛИ 
			СтрокаИсточникБанковскиеСчетаКонтрагентов.НомерСчета = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Номер счета не указан! ";
		КонецЕсли;
			
		СтрокаНомерСчета = ВыборкаНомерСчета.Найти(СтрокаИсточникБанковскиеСчетаКонтрагентов.НомерСчета);
		Если ТекстСообщения <> "" Тогда
			СтрокаОшибокБанковскиеСчетаКонтрагентов = ОшибокБанковскиеСчетаКонтрагентов.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиБанковскиеСчетаКонтрагентов(СтрокаОшибокБанковскиеСчетаКонтрагентов, 
			СтрокаИсточникБанковскиеСчетаКонтрагентов);
			СтрокаОшибокБанковскиеСчетаКонтрагентов.Ошибка = ТекстСообщения;
		ИначеЕсли СтрокаНомерСчета = Неопределено Тогда
			СтрокаСозданиеБанковскиеСчетаКонтрагентов = СозданиеБанковскиеСчетаКонтрагентов.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиБанковскиеСчетаКонтрагентов(СтрокаСозданиеБанковскиеСчетаКонтрагентов,
			СтрокаИсточникБанковскиеСчетаКонтрагентов);
		Иначе 
			СтрокаПроверкиБанковскиеСчетаКонтрагентов = ПроверкиБанковскиеСчетаКонтрагентов.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиБанковскиеСчетаКонтрагентов(СтрокаПроверкиБанковскиеСчетаКонтрагентов, 
			СтрокаИсточникБанковскиеСчетаКонтрагентов);
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры	

&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыПроверкиБанковскиеСчетаКонтрагентов(СтрокаПриемник, СтрокаИсточник)
	
	СтрокаПриемник.Владелец = СтрокаИсточник.Владелец; 
	СтрокаПриемник.НомерСчета = СтрокаИсточник.НомерСчета;
	СтрокаПриемник.ТекстНазначения = СтрокаИсточник.ТекстНазначения;
	СтрокаПриемник.ВалютаДенежныхСредств = СтрокаИсточник.ВалютаДенежныхСредств;
	СтрокаПриемник.БИКБанка = СтрокаИсточник.БИКБанка;
	СтрокаПриемник.НаименованиеБанка = СтрокаИсточник.НаименованиеБанка;   
	СтрокаПриемник.КоррСчетБанка = СтрокаИсточник.КоррСчетБанка; 
	СтрокаПриемник.ИДКлиента = СтрокаИсточник.ИДКлиента;
	
КонецПроцедуры

&НаСервере 
Процедура СоздатьЭлементыТаблицыБанковскиеСчетаКонтрагентов()
	
	Для каждого СтрокаБанковскиеСчетаКонтрагентов Из  СозданиеБанковскиеСчетаКонтрагентов Цикл
		
		БанковскийСчетаКонтрагентов = Справочники.БанковскиеСчетаКонтрагентов.СоздатьЭлемент();
		БанковскийСчетаКонтрагентов.Владелец = Справочники.Контрагенты.НайтиПоРеквизиту("бит_ИДКлиента",
		                                                   СтрокаБанковскиеСчетаКонтрагентов.ИДКлиента); 
		НомерСчета = ВРег(СтрЗаменить(СтрЗаменить(СокрЛП(СтрокаБанковскиеСчетаКонтрагентов.НомерСчета), " ", ""), ".", ""));
		БанковскийСчетаКонтрагентов.НомерСчета = НомерСчета;
        БанковскийСчетаКонтрагентов.ТекстНазначения = СтрокаБанковскиеСчетаКонтрагентов.ТекстНазначения; 
		БанковскийСчетаКонтрагентов.ВалютаДенежныхСредств = 
		Справочники.Валюты.НайтиПоНаименованию(СтрокаБанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств);
		
		Если ЕстьБуквыВСтроке(НомерСчета) Тогда
			БанковскийСчетаКонтрагентов.ИностранныйБанк = Истина;
			Если Сред(НомерСчета, 1, 4) = "IBAN" Тогда
				НомерСчета = Сред(НомерСчета, 5);
				БанковскийСчетаКонтрагентов.НомерСчета = НомерСчета;
			КонецЕсли;
			Если ДенежныеСредстваКлиентСервер.ПравильнаяДлинаIBAN(НомерСчета) Тогда
				БанковскийСчетаКонтрагентов.ЭтоIBAN = Истина;
				ОпределитьСтрануИБанкПоIBAN(БанковскийСчетаКонтрагентов);  
				БанковскийСчетаКонтрагентов.РучноеИзменениеРеквизитовБанка = Истина;
			КонецЕсли;
		Иначе
			
			Банк = Справочники.КлассификаторБанков.НайтиПоКоду(СтрокаБанковскиеСчетаКонтрагентов.БИКБанка);
			
			Если Банк = Неопределено Тогда
				Банк = Справочники.КлассификаторБанков.НайтиПоРеквизиту("СВИФТБИК", СтрокаБанковскиеСчетаКонтрагентов.БИКБанка);
			КонецЕсли;
			
			СоответствиеРеквизитовБанка = УстановитьСоответствиеРеквизитовБанка();
			СтруктураРеквизитов = Новый Структура;
			ИменаРеквизитов = СтрРазделить(РеквизитыБанка(), ",", Ложь);
			
			Для каждого ИмяРеквизита Из ИменаРеквизитов Цикл
				СтруктураРеквизитов.Вставить(ИмяРеквизита, СоответствиеРеквизитовБанка[СокрЛП(ИмяРеквизита)]);
			КонецЦикла;
			
			СтруктураРеквизитов.Вставить("БИКБанка", "Код");
			СтруктураРеквизитов.Вставить("СВИФТБанка", "СВИФТБИК");
			СтруктураРеквизитов.Вставить("НаименованиеБанкаМеждународное", "МеждународноеНаименование");
			РеквизитыБанка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Банк, СтруктураРеквизитов);
			ЗаполнитьЗначенияСвойств(БанковскийСчетаКонтрагентов, РеквизитыБанка);
			
			БанковскийСчетаКонтрагентов.Банк = Банк; 
		КонецЕсли;  
		Если БанковскийСчетаКонтрагентов.ВалютаДенежныхСредств.Пустая() Тогда
			БанковскийСчетаКонтрагентов.ВалютаДенежныхСредств = Справочники.Валюты.ПолучитьВалютуПоУмолчанию();
		КонецЕсли;
		ШаблонНаименования = НСтр("ru = '%1, (%2)'; |en = '%1, %2'");  
		ВалютаДС = СокрЛП(СтрокаБанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств);
		СтрокаНаименования = СтрШаблон(ШаблонНаименования, Прав(СокрЛП(НомерСчета), 4), ВалютаДС); 
		БанковскийСчетаКонтрагентов.Наименование = СтрокаНаименования;
		
		Попытка	
			БанковскийСчетаКонтрагентов.Записать();
			СтрокаБанковскиеСчетаКонтрагентов.Создано = Истина;
		Исключение
			СтрокаБанковскиеСчетаКонтрагентов.Создано = Ложь;
		КонецПопытки;	
		
	КонецЦикла;	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеБанковскиеСчетаКонтрагентов.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеБанковскиеСчетаКонтрагентов.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеБанковскиеСчетаКонтрагентов.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;

КонецПроцедуры

&НаСервере 
Процедура ПроверитьЭлементыТаблицыБанковскиеСчетаКонтрагентов()
	
	Для каждого СтрокаБанковскиеСчетаКонтрагентов Из ПроверкиБанковскиеСчетаКонтрагентов Цикл 
		
		НомерСчета = ВРег(СтрЗаменить(СтрЗаменить(СокрЛП(СтрокаБанковскиеСчетаКонтрагентов.НомерСчета), " ", ""), ".", "")); 
		Владелец = Справочники.Контрагенты.НайтиПоРеквизиту("бит_ИДКлиента",
		                                                   СтрокаБанковскиеСчетаКонтрагентов.ИДКлиента);
		ТекущийЭлементСправочника = Справочники.БанковскиеСчетаКонтрагентов.НайтиПоРеквизиту("НомерСчета", НомерСчета,,Владелец);
		Попытка
		ТекущийЭлементСправочника = ТекущийЭлементСправочника.ПолучитьОбъект();
						
		Если (ТекущийЭлементСправочника.ТекстНазначения = Неопределено ИЛИ ТекущийЭлементСправочника.ТекстНазначения = "") И 
			СтрокаБанковскиеСчетаКонтрагентов.ТекстНазначения <> "" Тогда
			ТекущийЭлементСправочника.ТекстНазначения = СтрокаБанковскиеСчетаКонтрагентов.ТекстНазначения;
			СтрокаБанковскиеСчетаКонтрагентов.Изменено = Истина;
		КонецЕсли;

		Если ТекущийЭлементСправочника.ВалютаДенежныхСредств = Неопределено 
		 ИЛИ ТекущийЭлементСправочника.ВалютаДенежныхСредств.Пустая() Тогда
			ТекущийЭлементСправочника.ВалютаДенежныхСредств = 
			                     Справочники.Валюты.НайтиПоНаименованию(СтрокаБанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств);
			СтрокаБанковскиеСчетаКонтрагентов.Изменено = Истина;
		КонецЕсли; 
		
		Если ТекущийЭлементСправочника.ПометкаУдаления = Истина Тогда
			 ТекущийЭлементСправочника.ПометкаУдаления = Ложь;
			 СтрокаБанковскиеСчетаКонтрагентов.Изменено = Истина;
		КонецЕсли;	 
		
		Если ЕстьБуквыВСтроке(НомерСчета) Тогда
			ТекущийЭлементСправочника.ИностранныйБанк = Истина;
			Если Сред(НомерСчета, 1, 4) = "IBAN" Тогда
				НомерСчета = Сред(НомерСчета, 5);
				ТекущийЭлементСправочника.НомерСчета = НомерСчета;
			КонецЕсли;
			Если ДенежныеСредстваКлиентСервер.ПравильнаяДлинаIBAN(НомерСчета) Тогда
				ТекущийЭлементСправочника.ЭтоIBAN = Истина;
				ОпределитьСтрануИБанкПоIBAN(ТекущийЭлементСправочника);  
				ТекущийЭлементСправочника.РучноеИзменениеРеквизитовБанка = Истина;
			КонецЕсли;
			СтрокаБанковскиеСчетаКонтрагентов.Изменено = Истина;
		Иначе	
		ОбработкаДанныхБанка(ТекущийЭлементСправочника, СтрокаБанковскиеСчетаКонтрагентов);
		КонецЕсли;
		ШаблонНаименования = НСтр("ru = '%1, (%2)'; |en = '%1, %2'");  
		ВалютаДС = СокрЛП(СтрокаБанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств);
		СтрокаНаименования = СтрШаблон(ШаблонНаименования, Прав(СокрЛП(НомерСчета), 4), ВалютаДС); 
		Если ТекущийЭлементСправочника.Наименование <>  СтрокаНаименования Тогда
			 ТекущийЭлементСправочника.Наименование = СтрокаНаименования;
			 СтрокаБанковскиеСчетаКонтрагентов.Изменено = Истина;
		КонецЕсли;
						
		Если СтрокаБанковскиеСчетаКонтрагентов.Изменено Тогда
			
			Попытка
				ТекущийЭлементСправочника.Записать();
			Исключение 
				СтрокаБанковскиеСчетаКонтрагентов.Изменено = Ложь;
			КонецПопытки;
		КонецЕсли;
		Исключение
		КонецПопытки
	КонецЦикла;
	
    ИзменениеУсловногоОформленияПроверкиБанковскиеСчетаКонтрагентов();
	
КонецПроцедуры 

&НаСервере 
Процедура ОбработатьОшибкиЭлементыТаблицыБанковскиеСчетаКонтрагентов();
	
	  Для каждого СтрокаБанковскиеСчетаКонтрагентов Из  ОшибокБанковскиеСчетаКонтрагентов Цикл
		  ОшибкаВалют = СтрНайти(СтрокаБанковскиеСчетаКонтрагентов.Ошибка, "Валюта не найдена!");
		  ОшибкаКонтрагент = СтрНайти(СтрокаБанковскиеСчетаКонтрагентов.Ошибка, "Контрагент по ID не найден!");
		  ОшибкаНомер = СтрНайти(СтрокаБанковскиеСчетаКонтрагентов.Ошибка,"Номер счета не указан!");
		  Если ОшибкаКонтрагент <> 0 
			  ИЛИ  ОшибкаВалют <> 0 
	          ИЛИ  ОшибкаНомер <> 0 Тогда
			  Продолжить;
		  КонецЕсли;
		  
		  БанковскийСчетаКонтрагентов = Справочники.БанковскиеСчетаКонтрагентов.СоздатьЭлемент();
		  БанковскийСчетаКонтрагентов.Владелец = Справочники.Контрагенты.НайтиПоРеквизиту("бит_ИДКлиента",
		  СтрокаБанковскиеСчетаКонтрагентов.ИДКлиента); 
		  НомерСчета = ВРег(СтрЗаменить(СтрЗаменить(СокрЛП(СтрокаБанковскиеСчетаКонтрагентов.НомерСчета), " ", ""), ".", ""));
		  БанковскийСчетаКонтрагентов.НомерСчета = НомерСчета;
		  БанковскийСчетаКонтрагентов.ТекстНазначения = СтрокаБанковскиеСчетаКонтрагентов.ТекстНазначения; 
		  БанковскийСчетаКонтрагентов.ВалютаДенежныхСредств = 
		  Справочники.Валюты.НайтиПоНаименованию(СтрокаБанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств);
		  
		  Если ЕстьБуквыВСтроке(НомерСчета) Тогда
			  БанковскийСчетаКонтрагентов.ИностранныйБанк = Истина;
			  Если Сред(НомерСчета, 1, 4) = "IBAN" Тогда
				  НомерСчета = Сред(НомерСчета, 5);
				  БанковскийСчетаКонтрагентов.НомерСчета = НомерСчета;
			  КонецЕсли;
			  Если ДенежныеСредстваКлиентСервер.ПравильнаяДлинаIBAN(НомерСчета) Тогда
				  БанковскийСчетаКонтрагентов.ЭтоIBAN = Истина;
				  ОпределитьСтрануИБанкПоIBAN(БанковскийСчетаКонтрагентов);  
				  БанковскийСчетаКонтрагентов.РучноеИзменениеРеквизитовБанка = Истина;
			  КонецЕсли;
			  БанковскийСчетаКонтрагентов.Банк = Справочники.КлассификаторБанков.ПустаяСсылка();
		  КонецЕсли;
		  
		  Если БанковскийСчетаКонтрагентов.ВалютаДенежныхСредств.Пустая() Тогда
			БанковскийСчетаКонтрагентов.ВалютаДенежныхСредств = Справочники.Валюты.ПолучитьВалютуПоУмолчанию();
		КонецЕсли;
		ШаблонНаименования = НСтр("ru = '%1, (%2)'; |en = '%1, %2'");  
		ВалютаДС = СокрЛП(СтрокаБанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств);
		СтрокаНаименования = СтрШаблон(ШаблонНаименования, Прав(СокрЛП(НомерСчета), 4), ВалютаДС); 
		БанковскийСчетаКонтрагентов.Наименование = СтрокаНаименования;
		
		Попытка	
			БанковскийСчетаКонтрагентов.Записать();
			СтрокаБанковскиеСчетаКонтрагентов.Обработано = Истина;
		Исключение
			СтрокаБанковскиеСчетаКонтрагентов.Обработано = Ложь;
		КонецПопытки;	
		
	КонецЦикла;	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОшибокБанковскиеСчетаКонтрагентов.Обработано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОшибокБанковскиеСчетаКонтрагентов.Обработано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.ОшибокБанковскиеСчетаКонтрагентов.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;

КонецПроцедуры

 &НаСервере 
Процедура ИзменениеУсловногоОформленияПроверкиБанковскиеСчетаКонтрагентов()

   	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиБанковскиеСчетаКонтрагентов.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); 
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиБанковскиеСчетаКонтрагентов.Изменено"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь; 
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки); 
	
	Для каждого элПоля Из Элементы.ПроверкиБанковскиеСчетаКонтрагентов.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле1 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
	
КонецПроцедуры	
#КонецОбласти

#Область СозданияДоговоровКонтрагентов

&НаСервере 
Процедура ЗаполнитьТаблицуИсточникДоговорыКонтрагентов(ПредставлениеИсточника) 
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточникДоговорыК = ИсточникДоговорыКонтрагентов.Добавить();	 
		
		ТекстКолонки = ПредставлениеИсточника.Область(НомерСтроки, 1).Текст;
		СтрИсточникДоговорыК.Наименование = ТекстКолонки;                           
		СтрИсточникДоговорыК.БанковскийСчет = ПредставлениеИсточника.Область(НомерСтроки, 2).Текст;
		СтрИсточникДоговорыК.БанковскийСчетКонтрагента = ПредставлениеИсточника.Область(НомерСтроки, 3).Текст;
		СтрИсточникДоговорыК.ВалютаВзаиморасчетов = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст;
		СтрИсточникДоговорыК.Комментарий = ПредставлениеИсточника.Область(НомерСтроки, 5).Текст;
		ДатаНачалаДействия = ПредставлениеИсточника.Область(НомерСтроки, 6).Текст; 
		ДатаНачалаДействия = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаНачалаДействия);
		СтрИсточникДоговорыК.ДатаНачалаДействия = ДатаНачалаДействия; 
		ДатаОкончанияДействия = ПредставлениеИсточника.Область(НомерСтроки, 7).Текст;  
		ДатаОкончанияДействия = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаОкончанияДействия);
		СтрИсточникДоговорыК.ДатаОкончанияДействия = ДатаОкончанияДействия;
		СтрИсточникДоговорыК.Организация = ПредставлениеИсточника.Область(НомерСтроки, 8).Текст;
		СтрИсточникДоговорыК.ИННОрганизации = ПредставлениеИсточника.Область(НомерСтроки, 9).Текст;
		СтрИсточникДоговорыК.Контрагент = ПредставлениеИсточника.Область(НомерСтроки, 10).Текст;
		СтрИсточникДоговорыК.ИННКонтрагента = ПредставлениеИсточника.Область(НомерСтроки, 11).Текст;
		СтрИсточникДоговорыК.КППКонтрагента = ПредставлениеИсточника.Область(НомерСтроки, 12).Текст;
		СтрИсточникДоговорыК.Менеджер = ПредставлениеИсточника.Область(НомерСтроки, 13).Текст;
		СтрИсточникДоговорыК.НаименованиеДляПечати = ПредставлениеИсточника.Область(НомерСтроки, 14).Текст;
		СтрИсточникДоговорыК.Номер = ПредставлениеИсточника.Область(НомерСтроки, 18).Текст;
		СтрИсточникДоговорыК.ТипДоговора = ПредставлениеИсточника.Область(НомерСтроки, 24).Текст;
		СтрИсточникДоговорыК.КонтактноеЛицо = ПредставлениеИсточника.Область(НомерСтроки, 30).Текст;
		СтрИсточникДоговорыК.Сумма = ПредставлениеИсточника.Область(НомерСтроки, 35).Текст;
		СтрИсточникДоговорыК.Назначение = ПредставлениеИсточника.Область(НомерСтроки, 57).Текст;
		СтрИсточникДоговорыК.ИДКлиента = ПредставлениеИсточника.Область(НомерСтроки, 104).Текст;
			
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникДоговорыКонтрагентов.Удалить(СтрИсточникДоговорыК);
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте 
Процедура ДействияСТаблицамиДоговорыКонтрагентов(ПредставлениеИсточника)  
	
	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникДоговорыКонтрагентов.Видимость 	= Истина;
		ЗаполнитьТаблицуИсточникДоговорыКонтрагентов(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда
		Элементы.СозданиеДоговорыКонтрагентов.Видимость 		= Истина;
		Элементы.ПроверкиДоговорыКонтрагентов.Видимость 		= Истина;
        Элементы.ОшибокДоговорыКонтрагентов.Видимость 			= Истина;
        ЗаполнитьТаблицыПроверкиДоговорыКонтрагентов();
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыТаблицыДоговорыКонтрагентов();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыТаблицыДоговорыКонтрагентов();	
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаСписка");
	ИначеЕсли ИдентификаторСостояния = "Состояние6" Тогда
		 ОбработатьОшибкиЭлементыТаблицыДоговорыКонтрагентов();	
	Иначе	
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиДоговорыКонтрагентов()
	
	УсловноеОформление.Элементы.Очистить();
	
	Для каждого СтрокаИсточникДоговорыКонтрагентов Из ИсточникДоговорыКонтрагентов Цикл     
		Если СтрокаИсточникДоговорыКонтрагентов.ВалютаВзаиморасчетов = "RUB" Тогда 
			 СтрокаИсточникДоговорыКонтрагентов.ВалютаВзаиморасчетов = "руб.";   
		КонецЕсли;		
	КонецЦикла; 
	
	МассивНомеровДоговоров = ИсточникДоговорыКонтрагентов.Выгрузить( , "Номер");
	МассивДатаНачалаДействия = ИсточникДоговорыКонтрагентов.Выгрузить( , "ДатаНачалаДействия");
	//МассивИННКонтрагентов = ИсточникДоговорыКонтрагентов.Выгрузить( , "ИННКонтрагента");
	//МассивКППКонтрагентов = ИсточникДоговорыКонтрагентов.Выгрузить( , "КППКонтрагента");
	МассивИДКонтрагентов = ИсточникДоговорыКонтрагентов.Выгрузить( , "ИДКлиента");
	МассивВалют = ИсточникДоговорыКонтрагентов.Выгрузить( , "ВалютаВзаиморасчетов");
	МассивБанковскийСчет = ИсточникДоговорыКонтрагентов.Выгрузить( , "БанковскийСчет"); 
	МассивБанковскийКонтрагента = ИсточникДоговорыКонтрагентов.Выгрузить( , "БанковскийСчетКонтрагента"); 
				
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка,
	|	Валюты.Код КАК Код,
	|	Валюты.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Наименование В(&МассивВалют)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БанковскиеСчетаОрганизаций.Ссылка КАК Ссылка,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|ГДЕ
	|	БанковскиеСчетаОрганизаций.НомерСчета В(&МассивБанковскийСчет)
	|	И БанковскиеСчетаОрганизаций.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БанковскиеСчетаКонтрагентов.Ссылка КАК Ссылка,
	|	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета
	|ИЗ
	|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	|ГДЕ
	|	БанковскиеСчетаКонтрагентов.НомерСчета В(&МассивБанковскийКонтрагента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	|	ДоговорыКонтрагентов.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ДоговорыКонтрагентов.Номер КАК Номер
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ДатаНачалаДействия В(&МассивДатаНачалаДействия)
	|	И ДоговорыКонтрагентов.Номер В(&МассивНомеровДоговоров)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.бит_ИДКлиента КАК бит_ИДКлиента
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.бит_ИДКлиента В(&МассивИДКонтрагентов)";
	
	Запрос.УстановитьПараметр("МассивВалют", МассивВалют);
	Запрос.УстановитьПараметр("МассивБанковскийСчет", МассивБанковскийСчет);
    Запрос.УстановитьПараметр("МассивБанковскийКонтрагента", МассивБанковскийКонтрагента);
	Запрос.УстановитьПараметр("МассивДатаНачалаДействия", МассивДатаНачалаДействия);
	Запрос.УстановитьПараметр("МассивНомеровДоговоров", МассивНомеровДоговоров); 
	//Запрос.УстановитьПараметр("МассивИННКонтрагентов", МассивИННКонтрагентов);
	//Запрос.УстановитьПараметр("МассивКППКонтрагентов", МассивКППКонтрагентов);
    Запрос.УстановитьПараметр("МассивИДКонтрагентов", МассивИДКонтрагентов);
    РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаВалют = РезультатЗапроса[0].Выгрузить();
	ВыборкаБанковскиеСчетаОрганизаций = РезультатЗапроса[1].Выгрузить();
	ВыборкаБанковскиеСчетаКонтрагентов = РезультатЗапроса[2].Выгрузить(); 
	ВыборкаДоговоры = РезультатЗапроса[3].Выгрузить();
	ВыборкаКонтрагентов = РезультатЗапроса[4].Выгрузить();
	
	Для каждого СтрокаИсточникДоговорыКонтрагентов Из ИсточникДоговорыКонтрагентов Цикл  
		
		ТекстСообщения = ""; 
		
		ВыборкаСтруктура = Новый Структура;
		ВыборкаСтруктура.Вставить("ВыборкаВалют", ВыборкаВалют);
		ВыборкаСтруктура.Вставить("ВыборкаБанковскиеСчетаОрганизаций", ВыборкаБанковскиеСчетаОрганизаций);
		ВыборкаСтруктура.Вставить("ВыборкаКонтрагентов", ВыборкаКонтрагентов);
		ВыборкаСтруктура.Вставить("ВыборкаБанковскиеСчетаКонтрагентов", ВыборкаБанковскиеСчетаКонтрагентов);
		
		ИнициализацияОшибокДК(ТекстСообщения, СтрокаИсточникДоговорыКонтрагентов, ВыборкаСтруктура);
				
		Отбор = Новый Структура();
        Отбор.Вставить("Номер", СтрокаИсточникДоговорыКонтрагентов.Номер); 
		Отбор.Вставить("ДатаНачалаДействия", СтрокаИсточникДоговорыКонтрагентов.ДатаНачалаДействия); 
		СтрокаДоговоры = ВыборкаДоговоры.НайтиСтроки(Отбор);
		Если ТекстСообщения <> "" Тогда       
			СтрокаОшибокДоговорыКонтрагентов = ОшибокДоговорыКонтрагентов.Добавить(); 
			ЗаполнитьСтрокуТаблицыДоговорыКонтрагентов(СтрокаОшибокДоговорыКонтрагентов, 
													    СтрокаИсточникДоговорыКонтрагентов);
			СтрокаОшибокДоговорыКонтрагентов.Ошибка = ТекстСообщения;
		ИначеЕсли СтрокаДоговоры.Количество() > 0 Тогда
			СтрокаПроверкиДоговорыКонтрагентов = ПроверкиДоговорыКонтрагентов.Добавить(); 
			ЗаполнитьСтрокуТаблицыДоговорыКонтрагентов(СтрокаПроверкиДоговорыКонтрагентов, 
														СтрокаИсточникДоговорыКонтрагентов);
		Иначе
			СтрокаСозданиеДоговорыКонтрагентов = СозданиеДоговорыКонтрагентов.Добавить(); 
			ЗаполнитьСтрокуТаблицыДоговорыКонтрагентов(СтрокаСозданиеДоговорыКонтрагентов,
														СтрокаИсточникДоговорыКонтрагентов);
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры 

&НаСервере 
Процедура ИнициализацияОшибокДК(ТекстСообщения, СтрокаИсточникДоговорыКонтрагентов, ВыборкаСтруктура)
	
		ИдентификаторВалюта = ВыборкаСтруктура.ВыборкаВалют.Найти(СтрокаИсточникДоговорыКонтрагентов.ВалютаВзаиморасчетов);
		Если ИдентификаторВалюта = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Валюта не найдена! ";
		КонецЕсли;
		
		ИдентификаторНомерСчета = ВыборкаСтруктура.ВыборкаБанковскиеСчетаОрганизаций.Найти(
		                                                          СтрокаИсточникДоговорыКонтрагентов.БанковскийСчет);
		Если ИдентификаторНомерСчета = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Банковский счет организации не найден! ";
		КонецЕсли;

		ИдентификаторНомерСчетаКонтрагента = ВыборкаСтруктура.ВыборкаБанковскиеСчетаКонтрагентов.Найти(
		                                                       СтрокаИсточникДоговорыКонтрагентов.БанковскийСчетКонтрагента);
		Если ИдентификаторНомерСчетаКонтрагента = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Банковский счет контрагента не найден! ";
		КонецЕсли;
		
		//Если СтрокаИсточникДоговорыКонтрагентов.ИННКонтрагента <> "" Тогда
		//    ПараметрыОтбора = Новый Структура("Отбор,ВыборГруппИЭлементов");
		//	Отбор = Новый Структура;
		//	Отбор.Вставить("ИНН", СтрокаИсточникДоговорыКонтрагентов.ИННКонтрагента);
		//	Отбор.Вставить("КПП", СтрокаИсточникДоговорыКонтрагентов.КППКонтрагента); 
		//	ПараметрыОтбора.Отбор = Отбор;
		//	ПараметрыОтбора.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		//	СправочникКонтрагент = Справочники.Контрагенты.ПолучитьДанныеВыбора(ПараметрыОтбора);
		//	Если СправочникКонтрагент.Количество() > 0 Тогда	
		//		СправочникКонтрагент = СправочникКонтрагент[0].Значение;
		//	Иначе 
		//		СправочникКонтрагент =  Неопределено;
		//	КонецЕсли;
		//Иначе
		//	ПараметрыОтбора = Новый Структура("Отбор,ВыборГруппИЭлементов");
		//	Отбор = Новый Структура;
		//	Отбор.Вставить("Наименование", СтрокаИсточникДоговорыКонтрагентов.Контрагент);
		//	ПараметрыОтбора.Отбор = Отбор;
		//	ПараметрыОтбора.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		//	СправочникКонтрагент = Справочники.Контрагенты.ПолучитьДанныеВыбора(ПараметрыОтбора); 
		//	Если СправочникКонтрагент.Количество() > 0 Тогда	
		//		СправочникКонтрагент = СправочникКонтрагент[0].Значение;
		//	Иначе 
		//		СправочникКонтрагент =  Неопределено;
		//	КонецЕсли;
		//КонецЕсли;
		
		ИдентификаторКонтрагента = ВыборкаСтруктура.ВыборкаКонтрагентов.Найти(СтрокаИсточникДоговорыКонтрагентов.ИДКлиента);
		Если ИдентификаторКонтрагента = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Контрагент по ID не найден! ";
		КонецЕсли;

		//Если СправочникКонтрагент = Неопределено Тогда
		//	ТекстСообщения = ТекстСообщения + "Контрагент не найден! ";
		//КонецЕсли;

	КонецПроцедуры
	
&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыДоговорыКонтрагентов(СтрокаПриемник, СтрокаИсточник)
	
	СтрокаПриемник.Наименование = СтрокаИсточник.Наименование;               
	СтрокаПриемник.Сумма = СтрокаИсточник.Сумма;            
	СтрокаПриемник.КонтактноеЛицо = СтрокаИсточник.КонтактноеЛицо;   
	СтрокаПриемник.ТипДоговора = СтрокаИсточник.ТипДоговора;  
	СтрокаПриемник.Номер = СтрокаИсточник.Номер;                             
	СтрокаПриемник.НаименованиеДляПечати = СтрокаИсточник.НаименованиеДляПечати;           
	СтрокаПриемник.Менеджер = СтрокаИсточник.Менеджер; 
	СтрокаПриемник.КППКонтрагента = СтрокаИсточник.КППКонтрагента; 
	СтрокаПриемник.ИННКонтрагента = СтрокаИсточник.ИННКонтрагента; 
	СтрокаПриемник.Контрагент = СтрокаИсточник.Контрагент; 
	СтрокаПриемник.ИННОрганизации = СтрокаИсточник.ИННОрганизации; 
	СтрокаПриемник.Организация = СтрокаИсточник.Организация;
	СтрокаПриемник.ДатаОкончанияДействия = СтрокаИсточник.ДатаОкончанияДействия;
	СтрокаПриемник.ДатаНачалаДействия = СтрокаИсточник.ДатаНачалаДействия;
	СтрокаПриемник.Комментарий = СтрокаИсточник.Комментарий;
	СтрокаПриемник.ВалютаВзаиморасчетов = СтрокаИсточник.ВалютаВзаиморасчетов;
	СтрокаПриемник.БанковскийСчетКонтрагента = СтрокаИсточник.БанковскийСчетКонтрагента;
	СтрокаПриемник.БанковскийСчет = СтрокаИсточник.БанковскийСчет;
	СтрокаПриемник.Назначение = СтрокаИсточник.Назначение;
	СтрокаПриемник.ИДКлиента = СтрокаИсточник.ИДКлиента;
                                                                       
КонецПроцедуры	                                                                   
                                                                                   
&НаСервере                                                                         
Процедура СоздатьЭлементыТаблицыДоговорыКонтрагентов() 
	
	 МассивМенеджеров = СозданиеДоговорыКонтрагентов.Выгрузить( , "Менеджер");
     МассивКонтактныхЛиц = СозданиеДоговорыКонтрагентов.Выгрузить( , "КонтактноеЛицо");
	 МассивИДКонтрагентов = ИсточникДоговорыКонтрагентов.Выгрузить( , "ИДКлиента");
	 //МассивИННКонтрагентов = СозданиеДоговорыКонтрагентов.Выгрузить( , "ИННКонтрагента");
	 //МассивКППКонтрагентов = СозданиеДоговорыКонтрагентов.Выгрузить( , "КППКонтрагента");
	 //МассивКонтрагентов = СозданиеДоговорыКонтрагентов.Выгрузить( , "Контрагент");
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.бит_ИДКлиента КАК бит_ИДКлиента
		|ПОМЕСТИТЬ ВТКонтрагентов
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.бит_ИДКлиента В(&МассивИДКонтрагентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование В(&МассивМенеджеров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.бит_ИДКлиента КАК бит_ИДКлиента
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.бит_ИДКлиента В(&МассивИДКонтрагентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
		|	КонтактныеЛицаПартнеров.Наименование КАК Наименование,
		|	КонтактныеЛицаПартнеров.Владелец КАК Владелец
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Наименование В(&МассивКонтактныхЛиц)
		|	И КонтактныеЛицаПартнеров.Владелец В
		|			(ВЫБРАТЬ
		|				ВТКонтрагентов.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТКонтрагентов КАК ВТКонтрагентов)";
	
	Запрос.УстановитьПараметр("МассивМенеджеров", МассивМенеджеров);
	Запрос.УстановитьПараметр("МассивКонтактныхЛиц", МассивКонтактныхЛиц);
	//Запрос.УстановитьПараметр("МассивИННКонтрагентов", МассивИННКонтрагентов);
	//Запрос.УстановитьПараметр("МассивКППКонтрагентов", МассивКППКонтрагентов);
	Запрос.УстановитьПараметр("МассивИДКонтрагентов", МассивИДКонтрагентов);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаМенеджеры = РезультатЗапроса[1].Выгрузить();  
	ВыборкаКонтрагенты = РезультатЗапроса[2].Выгрузить();
	ВыборкаКонтактныеЛицаПартнеров = РезультатЗапроса[3].Выгрузить();
	
	Для каждого СтрокаДоговорыКонтрагентов Из СозданиеДоговорыКонтрагентов Цикл  
		
		СоздатьЭлементДК(СтрокаДоговорыКонтрагентов, ВыборкаМенеджеры, ВыборкаКонтактныеЛицаПартнеров);
		
	КонецЦикла;	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеДоговорыКонтрагентов.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеДоговорыКонтрагентов.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеДоговорыКонтрагентов.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;
	
КонецПроцедуры

&НаСервере                                                                         
Процедура СоздатьЭлементДК(СтрокаДоговорыКонтрагентов, ВыборкаМенеджеры, ВыборкаКонтактныеЛицаПартнеров)
	
	ИдентификаторМенеджера = ВыборкаМенеджеры.Найти(СтрокаДоговорыКонтрагентов.Менеджер);
		Если ИдентификаторМенеджера = Неопределено И СтрокаДоговорыКонтрагентов.Менеджер <> "" Тогда
			//СозданиеМенеджера(СтрокаДоговорыКонтрагентов.Менеджер);
		КонецЕсли;
		
		//ПараметрыОтбора = Новый Структура;
		//ПараметрыОтбора.Вставить("СтрокаПоиска", СтрокаДоговорыКонтрагентов.ИННКонтрагента);
		//Контрагент = Справочники.Контрагенты.ПолучитьДанныеВыбора(ПараметрыОтбора);
		//Если Контрагент.Количество() = 0 Тогда
		Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("бит_ИДКлиента",
		                                                   	   СтрокаДоговорыКонтрагентов.ИДКлиента); 
		//Иначе 
		//	Контрагент = Контрагент[0].Значение;
		//КонецЕсли;
		
		Если Не Контрагент.Пустая()  Тогда
			
			Если ЗначениеЗаполнено(СтрокаДоговорыКонтрагентов.КонтактноеЛицо) Тогда	
				Отбор = Новый Структура();
				Отбор.Вставить("Наименование", СтрокаДоговорыКонтрагентов.КонтактноеЛицо); 
				Отбор.Вставить("Владелец", Контрагент.Партнер); 
				СтрокаДоговоры = ВыборкаКонтактныеЛицаПартнеров.НайтиСтроки(Отбор);
				КонтактноеЛицо = Неопределено;
				Если СтрокаДоговоры.Количество() = 0 И СтрокаДоговорыКонтрагентов.КонтактноеЛицо <> "" Тогда
					КонтактноеЛицо = СозданиеКонтактногоЛица(СтрокаДоговорыКонтрагентов.КонтактноеЛицо, Контрагент);
				КонецЕсли;
			КонецЕсли;
			
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		ДоговорКонтрагента.Наименование = СтрокаДоговорыКонтрагентов.Наименование; 
		БСО = СтрЗаменить(СокрЛП(СтрокаДоговорыКонтрагентов.БанковскийСчет), " ", "");
		НомерСчетаБСО = ВРег(СтрЗаменить(БСО, ".", ""));
		ТекущийЭлементСправочникаБСО = Справочники.БанковскиеСчетаОрганизаций.НайтиПоРеквизиту("НомерСчета", НомерСчетаБСО);
		ДоговорКонтрагента.БанковскийСчет = ТекущийЭлементСправочникаБСО; 
		
		Если ЗначениеЗаполнено(СтрокаДоговорыКонтрагентов.БанковскийСчетКонтрагента) Тогда
			БСК = СтрЗаменить(СокрЛП(СтрокаДоговорыКонтрагентов.БанковскийСчетКонтрагента), " ", "");
			НомерСчетаБСК = ВРег(СтрЗаменить(БСК, ".", ""));
			ТекущийЭлементСправочникаБСК = Справочники.БанковскиеСчетаКонтрагентов.НайтиПоРеквизиту("НомерСчета", НомерСчетаБСК, , Контрагент);
			ДоговорКонтрагента.БанковскийСчетКонтрагента = ТекущийЭлементСправочникаБСК;
		Иначе
			ДоговорКонтрагента.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	
		ДоговорКонтрагента.ВалютаВзаиморасчетов = 
		                             Справочники.Валюты.НайтиПоНаименованию(СтрокаДоговорыКонтрагентов.ВалютаВзаиморасчетов);
		ДоговорКонтрагента.Комментарий = СтрокаДоговорыКонтрагентов.Комментарий; 
		ДоговорКонтрагента.ДатаНачалаДействия = СтрокаДоговорыКонтрагентов.ДатаНачалаДействия;
		ДоговорКонтрагента.ДатаОкончанияДействия = СтрокаДоговорыКонтрагентов.ДатаОкончанияДействия;
		ДоговорКонтрагента.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		ДоговорКонтрагента.Контрагент = Контрагент; 
		ДоговорКонтрагента.Менеджер = Справочники.Пользователи.НайтиПоНаименованию(СтрокаДоговорыКонтрагентов.Менеджер);
		ДоговорКонтрагента.НаименованиеДляПечати = СтрокаДоговорыКонтрагентов.НаименованиеДляПечати;
		ДоговорКонтрагента.Дата = СтрокаДоговорыКонтрагентов.ДатаНачалаДействия;
		ДоговорКонтрагента.Номер = СтрокаДоговорыКонтрагентов.Номер;
		ДоговорКонтрагента.Партнер = Контрагент.Партнер;
		ДоговорКонтрагента.СпособДоставки = Перечисления.СпособыДоставки.ОпределяетсяВРаспоряжении;
		////
		//Если СтрокаДоговорыКонтрагентов.ТипДоговора = "Договор" Тогда
		//	ДоговорКонтрагента.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем;
		//Иначе
		//	ДоговорКонтрагента.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком;
		//КонецЕсли;
		//Если ДоговорКонтрагента.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем Тогда
		//	
		//	ДоговорКонтрагента.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам;
		//Иначе 
		//	ДоговорКонтрагента.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
		//КонецЕсли; 
		////
		
		ДоговорКонтрагентаЗаполнениеТипНазначения(СтрокаДоговорыКонтрагентов, ДоговорКонтрагента);
		Если ДоговорКонтрагента.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем Тогда
			ДоговорКонтрагента.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам;
		ИначеЕсли ДоговорКонтрагента.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком Тогда 
			ДоговорКонтрагента.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
		КонецЕсли;
		ДоговорКонтрагента.ЗакупкаПодДеятельностьОпределяетсяВДокументе = Истина;
        ДоговорКонтрагента.СпособДоставки = Перечисления.СпособыДоставки.ОпределяетсяВРаспоряжении;
		ДоговорКонтрагента.Согласован = Истина;  
		ДоговорКонтрагента.НалогообложениеНДСОпределяетсяВДокументе = Истина; 
		ДоговорКонтрагента.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", 
		Перечисления.СтавкиНДС.НДС20); 
		ДоговорКонтрагента.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
		Если КонтактноеЛицо = Неопределено Тогда
			//ДоговорКонтрагента.КонтактноеЛицо =
			//                Справочники.КонтактныеЛицаПартнеров.НайтиПоНаименованию(СтрокаДоговорыКонтрагентов.КонтактноеЛицо,,,Контрагент.Партнер); 
			Если СтрокаДоговоры.Количество() = 1 и ЗначениеЗаполнено(СтрокаДоговорыКонтрагентов.КонтактноеЛицо) Тогда
				//ДоговорКонтрагента.КонтактноеЛицо = СтрокаДоговоры[0].Ссылка; 
				ДоговорКонтрагента.КонтактноеЛицо =
			                Справочники.КонтактныеЛицаПартнеров.НайтиПоНаименованию(СтрокаДоговорыКонтрагентов.КонтактноеЛицо,,,Контрагент.Партнер); 
			ИначеЕсли ЗначениеЗаполнено(СтрокаДоговорыКонтрагентов.КонтактноеЛицо) Тогда
				ДоговорКонтрагента.КонтактноеЛицо = Справочники.КонтактныеЛицаПартнеров.НайтиПоНаименованию(СтрокаДоговорыКонтрагентов.КонтактноеЛицо,Истина,,Контрагент.Партнер);
			Иначе 
				ДоговорКонтрагента.КонтактноеЛицо = Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();
			КонецЕсли;	
		Иначе 
			ДоговорКонтрагента.КонтактноеЛицо = КонтактноеЛицо;
		КонецЕсли;
		
		Если ДоговорКонтрагента.КонтактноеЛицо.Владелец <> Контрагент.Партнер Тогда 
			ДоговорКонтрагента.КонтактноеЛицо = Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();
		КонецЕсли;	
			
		ДоговорКонтрагента.Сумма = СтрокаДоговорыКонтрагентов.Сумма;
		
		Попытка	
			ДоговорКонтрагента.Записать();
			СтрокаДоговорыКонтрагентов.Создано = Истина;
		Исключение
			СтрокаДоговорыКонтрагентов.Создано = Ложь;
		КонецПопытки; 
		
		КонецЕсли;
КонецПроцедуры 

&НаСервере                                                                         
Процедура ДоговорКонтрагентаЗаполнениеТипНазначения(СтрокаДоговорыКонтрагентов, ДоговорКонтрагента)
	
	ТипДоговора = ПроверкаТипаДоговора(СтрокаДоговорыКонтрагентов);
	Если ТипДоговора = "Реализация" Тогда 
		ДоговорКонтрагента.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем;
		//ДоговорКонтрагента.Назначение = Справочники.Назначения.НайтиПоНаименованию(ДоговорКонтрагента.ТипДоговора);
	ИначеЕсли ТипДоговора = "Закупка" Тогда  
		ДоговорКонтрагента.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком;
		//ДоговорКонтрагента.Назначение = Справочники.Назначения.НайтиПоНаименованию(ДоговорКонтрагента.ТипДоговора)
	ИначеЕсли ТипДоговора = "Импорт" Тогда  
		ДоговорКонтрагента.ТипДоговора = Перечисления.ТипыДоговоров.Импорт;
		//ДоговорКонтрагента.Назначение = Справочники.Назначения.НайтиПоНаименованию(ДоговорКонтрагента.ТипДоговора)
	КонецЕсли;	

КонецПроцедуры

&НаСервере                                                                         
Функция  ПроверкаТипаДоговора(СтрокаДоговорыКонтрагентов)	
	
	ТипДоговора = "";
	Если СтрокаДоговорыКонтрагентов.ТипДоговора = "Договор" 
		Или СтрокаДоговорыКонтрагентов.ТипДоговора = "Договор оказания услуг (выполнения работ)" Тогда
		
		Если СтрокаДоговорыКонтрагентов.Назначение = "Покупатель" 
             Или СтрокаДоговорыКонтрагентов.Назначение = "" Тогда
			   ТипДоговора = "Реализация";
		ИначеЕсли СтрокаДоговорыКонтрагентов.Назначение = "Поставщик" Тогда	   
		       ТипДоговора = "Закупка"; 
		КонецЕсли;
		   
	//ИначеЕсли СтрокаДоговорыКонтрагентов.ТипДоговора = "ДОГОВОР аренды"	Тогда
	//	
	//	Если СтрокаДоговорыКонтрагентов.Назначение = "Покупатель" 
	//         Или СтрокаДоговорыКонтрагентов.Назначение = "" Тогда
	//		   ТипДоговора = "Реализация";
	//	   КонецЕсли; 
		   
	ИначеЕсли СтрокаДоговорыКонтрагентов.ТипДоговора = "Договор купли-продажи"	Тогда
		
		Если СтрокаДоговорыКонтрагентов.Назначение = "Покупатель" 
             Или СтрокаДоговорыКонтрагентов.Назначение = "" Тогда
			   ТипДоговора = "Реализация";
		ИначеЕсли СтрокаДоговорыКонтрагентов.Назначение = "Поставщик" Тогда	   
		       ТипДоговора = "Закупка"; 
		КонецЕсли;

		//ТипДоговора = "Реализация"; 

	ИначеЕсли СтрокаДоговорыКонтрагентов.ТипДоговора = "Договор перевозки" Тогда
		
		Если СтрокаДоговорыКонтрагентов.Назначение = "Покупатель" 
             Или СтрокаДоговорыКонтрагентов.Назначение = "" Тогда
			   ТипДоговора = "Реализация";
        КонецЕсли;
			   
	ИначеЕсли СтрокаДоговорыКонтрагентов.ТипДоговора = "Договор поставки" Тогда
		
		Если СтрокаДоговорыКонтрагентов.Назначение = "Покупатель" 
             Или СтрокаДоговорыКонтрагентов.Назначение = "" Тогда
			   ТипДоговора = "Реализация";
		ИначеЕсли СтрокаДоговорыКонтрагентов.Назначение = "Поставщик" Тогда	   
		       ТипДоговора = "Закупка"; 
		КонецЕсли;
		   
		//ТипДоговора = "Закупка";
		
	ИначеЕсли СтрокаДоговорыКонтрагентов.ТипДоговора = "Контракт"	Тогда  
		
		Если СтрокаДоговорыКонтрагентов.Назначение = "Поставщик" Тогда	   
		       ТипДоговора = "Закупка"; 
		   КонецЕсли;

	КонецЕсли;	
		
	Возврат ТипДоговора;
	
КонецФункции

&НаСервере                                                                         
Процедура СозданиеМенеджера(Менеджер)                           
	
	//Пользователь = Справочники.Пользователи.СоздатьЭлемент(); 
	//Пользователь.Наименование = Менеджер; 
	//Пользователь.Служебный = Ложь; 
	//Пользователь.Записать();
	
КонецПроцедуры

&НаСервере                                                                         
Функция СозданиеКонтактногоЛица(КонтактноеЛицо, Контрагент)                          
	
	КонтактныеЛицаПартнеров = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
	КонтактныеЛицаПартнеров.Наименование = КонтактноеЛицо;
	КонтактныеЛицаПартнеров.Владелец = Контрагент.Партнер;
	КонтактныеЛицаПартнеров.ДатаРегистрацииСвязи = Дата;
    КонтактныеЛицаПартнеров.Автор = Пользователи.ТекущийПользователь(); 
	КонтактныеЛицаПартнеров.Записать();
	
	Возврат КонтактныеЛицаПартнеров;
	
КонецФункции
                                                                                   
&НаСервере                                                                         
Процедура ПроверитьЭлементыТаблицыДоговорыКонтрагентов()   
	
	МассивМенеджеров = СозданиеДоговорыКонтрагентов.Выгрузить( , "Менеджер");
    МассивКонтактныхЛиц = СозданиеДоговорыКонтрагентов.Выгрузить( , "КонтактноеЛицо"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование В(&МассивМенеджеров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
		|	КонтактныеЛицаПартнеров.Наименование КАК Наименование,
		|	КонтактныеЛицаПартнеров.Владелец КАК Владелец
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Наименование В(&МассивКонтактныхЛиц)";
	
	Запрос.УстановитьПараметр("МассивМенеджеров", МассивМенеджеров);
	Запрос.УстановитьПараметр("МассивКонтактныхЛиц", МассивКонтактныхЛиц);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаМенеджеры = РезультатЗапроса[0].Выгрузить();
	ВыборкаКонтактныеЛицаПартнеров = РезультатЗапроса[1].Выгрузить();
   	
	Для каждого СтрокаДоговорыКонтрагентов Из ПроверкиДоговорыКонтрагентов Цикл 
		
		ТекущийЭлементСправочника = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Номер", 
		                                                                               СтрокаДоговорыКонтрагентов.Номер);
		Если ТекущийЭлементСправочника.ДатаНачалаДействия <> СтрокаДоговорыКонтрагентов.ДатаНачалаДействия Тогда  
			СтрокаДоговорыКонтрагентов.Изменено = Ложь;
			Продолжить;
		КонецЕсли;

		ПроверкаДоговорыКв(ТекущийЭлементСправочника, СтрокаДоговорыКонтрагентов, 
		                             ВыборкаМенеджеры, ВыборкаКонтактныеЛицаПартнеров);
			
	КонецЦикла;
	
	ИзменениеУсловногоОформленияПроверкиДоговорыКонтрагентов();
		
КонецПроцедуры 

 &НаСервере 
 Процедура ПроверкаДоговорыКв(ТекЭлемент, СтрокаДоговорыКонтрагентов, ВыборкаМенеджеры, ВыборкаКонтактныеЛицаПартнеров)

	 ТекЭлемент = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Номер", 
	 СтрокаДоговорыКонтрагентов.Номер);
	 ТекЭлемент = ТекЭлемент.ПолучитьОбъект();   
	 
	 ПроверкаДоговорыКвБСОиБСК(ТекЭлемент, СтрокаДоговорыКонтрагентов); 
	 ПроверкаДоговорыКвПустыеПоля(ТекЭлемент, СтрокаДоговорыКонтрагентов);
	 ПроверкаМенеджерКонтакт(ТекЭлемент, СтрокаДоговорыКонтрагентов, ВыборкаМенеджеры, ВыборкаКонтактныеЛицаПартнеров);
     
	 Если ТекЭлемент.ВалютаВзаиморасчетов = Неопределено 
		 ИЛИ ТекЭлемент.ВалютаВзаиморасчетов.Пустая() Тогда
		 ТекЭлемент.ВалютаВзаиморасчетов = 
		 Справочники.Валюты.НайтиПоНаименованию(СтрокаДоговорыКонтрагентов.ВалютаВзаиморасчетов);
		 СтрокаДоговорыКонтрагентов.Изменено = Истина;
	 Иначе 
		 Изменено = Ложь;
	 КонецЕсли;  
				 
	 Если ТекЭлемент.ПометкаУдаления = Истина Тогда
		 ТекЭлемент.ПометкаУдаления = Ложь;
		 СтрокаДоговорыКонтрагентов.Изменено = Истина;
	 КонецЕсли;	 
	 
	 Если СтрокаДоговорыКонтрагентов.Изменено Тогда
		 Попытка
			 ТекЭлемент.Записать();
		 Исключение 
			 СтрокаДоговорыКонтрагентов.Изменено = Ложь;
		 КонецПопытки;
	 КонецЕсли;  
	 
 КонецПроцедуры 
 
 &НаСервере 
 Процедура ПроверкаДоговорыКвБСОиБСК(ТекЭлемент, СтрокаДоговорыКонтрагентов)
	 
	 Если СтрокаДоговорыКонтрагентов.БанковскийСчет <> "" Тогда
		 Если ТекЭлемент.БанковскийСчет.Пустая() 
			 ИЛИ	ТекЭлемент.БанковскийСчет = Неопределено Тогда 
			 НомерСчетаБСО = ВРег(СтрЗаменить(СтрЗаменить(СокрЛП(СтрокаДоговорыКонтрагентов.БанковскийСчет), " ", ""), ".", ""));
			 ТекущийЭлементСправочникаБСО = Справочники.БанковскиеСчетаОрганизаций.НайтиПоРеквизиту("НомерСчета", НомерСчетаБСО);
			 ТекЭлемент.БанковскийСчет = ТекущийЭлементСправочникаБСО;
			 СтрокаДоговорыКонтрагентов.Изменено = Истина;
		 Иначе
			 СтрокаДоговорыКонтрагентов.Изменено = Ложь;
		 КонецЕсли;
	 Иначе
		 Изменено = Ложь;
	 КонецЕсли;
	 
	 Если СтрокаДоговорыКонтрагентов.БанковскийСчетКонтрагента <> "" Тогда
		 Если ТекЭлемент.БанковскийСчетКонтрагента.Пустая() 
			 ИЛИ ТекЭлемент.БанковскийСчетКонтрагента = Неопределено Тогда 
			 БСК = СтрЗаменить(СокрЛП(СтрокаДоговорыКонтрагентов.БанковскийСчетКонтрагента), " ", "");
			 НомерСчетаБСК = ВРег(СтрЗаменить(БСК, ".", ""));
			 ТекЭлементСправочникаБСК = Справочники.БанковскиеСчетаКонтрагентов.НайтиПоРеквизиту("НомерСчета", НомерСчетаБСК);
			 ТекЭлемент.БанковскийСчетКонтрагента = ТекЭлементСправочникаБСК;
			 СтрокаДоговорыКонтрагентов.Изменено = Истина;
		 Иначе
			 СтрокаДоговорыКонтрагентов.Изменено = Ложь;
		 КонецЕсли;
	 Иначе
		 Изменено = Ложь;
	 КонецЕсли;
	 
 КонецПроцедуры
 
 &НаСервере 
 Процедура ПроверкаДоговорыКвПустыеПоля(ТекЭлемент, СтрокаДоговорыКонтрагентов)   
	 
	 Если СтрокаДоговорыКонтрагентов.НаименованиеДляПечати <> "" Тогда
		 Если ТекЭлемент.НаименованиеДляПечати = "" ИЛИ  
			 ТекЭлемент.НаименованиеДляПечати = Неопределено Тогда
			 ТекЭлемент.НаименованиеДляПечати = СтрокаДоговорыКонтрагентов.НаименованиеДляПечати;
			 СтрокаДоговорыКонтрагентов.Изменено = Истина;
		 Иначе
			Изменено = Ложь;
		 КонецЕсли;
		 Изменено = Ложь;
	 КонецЕсли;
	 
	 Если СтрокаДоговорыКонтрагентов.Комментарий <> "" Тогда 
		 Если ТекЭлемент.Комментарий = Неопределено 
			 ИЛИ ТекЭлемент.Комментарий = "" Тогда
			 ТекЭлемент.Комментарий = СтрокаДоговорыКонтрагентов.Комментарий; 
			 СтрокаДоговорыКонтрагентов.Изменено = Истина;
		 КонецЕсли; 
	 КонецЕсли;
	 
	 Если СтрокаДоговорыКонтрагентов.Сумма <> "" ИЛИ  СтрокаДоговорыКонтрагентов.Сумма <> 0 Тогда
		 Если ТекЭлемент.Сумма = 0 
			 ИЛИ ТекЭлемент.Сумма = Неопределено Тогда
			 ТекЭлемент.Сумма = СтрокаДоговорыКонтрагентов.Сумма;
			 СтрокаДоговорыКонтрагентов.Изменено = Истина;
		 Иначе
			 Изменено = Ложь;
		 КонецЕсли;
	 КонецЕсли;
	 
 КонецПроцедуры  
 
 &НаСервере 
 Процедура ПроверкаМенеджерКонтакт(ТекЭлемент, СтрокаДоговорыКонтрагентов, ВыборкаМенеджеры, ВыборкаКонтакты)
	 
	 // Если СтрокаДоговорыКонтрагентов.Менеджер <> "" Тогда 
	 //    Если ТекЭлемент.Менеджер = Неопределено 
	 //   	 ИЛИ ТекЭлемент.Менеджер.Пустая() Тогда
	 //   	 ТекущийМенеджер = ВыборкаМенеджеры.Найти(СтрокаДоговорыКонтрагентов.Менеджер);
	 //   	 Если ТекущийМенеджер = Неопределено Тогда 
	 //   		 //СозданиеМенеджера(СтрокаДоговорыКонтрагентов.Менеджер);
	 //   	 КонецЕсли;
	 //   	 ТекЭлемент.Менеджер = 
	 //   	 Справочники.Пользователи.НайтиПоНаименованию(СтрокаДоговорыКонтрагентов.Менеджер);
	 //   	 СтрокаДоговорыКонтрагентов.Изменено = Истина;
	 //    КонецЕсли;
	 //КонецЕсли; 
	 
	 Если СтрокаДоговорыКонтрагентов.КонтактноеЛицо <> "" Тогда 
		 Если ТекЭлемент.КонтактноеЛицо = Неопределено 
			 ИЛИ ТекЭлемент.КонтактноеЛицо.Пустая() Тогда
			 ТекущееКонтактноеЛицо = ВыборкаКонтакты.Найти(СтрокаДоговорыКонтрагентов.КонтактноеЛицо);
			 Если ТекущееКонтактноеЛицо = Неопределено Тогда 
				 СозданиеКонтактногоЛица(СтрокаДоговорыКонтрагентов.КонтактноеЛицо, ТекЭлемент.Контрагент);
			 КонецЕсли;
			 ТекЭлемент.Менеджер = 
			 Справочники.КонтактныеЛицаПартнеров.НайтиПоНаименованию(СтрокаДоговорыКонтрагентов.КонтактноеЛицо);
			 СтрокаДоговорыКонтрагентов.Изменено = Истина;
		 КонецЕсли;
	 КонецЕсли;

 КонецПроцедуры
 
 &НаСервере 
Процедура ОбработатьОшибкиЭлементыТаблицыДоговорыКонтрагентов()
	
	 МассивМенеджеров = СозданиеДоговорыКонтрагентов.Выгрузить( , "Менеджер");
     МассивКонтактныхЛиц = СозданиеДоговорыКонтрагентов.Выгрузить( , "КонтактноеЛицо");
	 МассивИДКонтрагентов = ИсточникДоговорыКонтрагентов.Выгрузить( , "ИДКлиента");
		 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.бит_ИДКлиента КАК бит_ИДКлиента
		|ПОМЕСТИТЬ ВТКонтрагентов
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.бит_ИДКлиента В(&МассивИДКонтрагентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование В(&МассивМенеджеров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.бит_ИДКлиента КАК бит_ИДКлиента
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.бит_ИДКлиента В(&МассивИДКонтрагентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
		|	КонтактныеЛицаПартнеров.Наименование КАК Наименование,
		|	КонтактныеЛицаПартнеров.Владелец КАК Владелец
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Наименование В(&МассивКонтактныхЛиц)
		|	И КонтактныеЛицаПартнеров.Владелец В
		|			(ВЫБРАТЬ
		|				ВТКонтрагентов.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТКонтрагентов КАК ВТКонтрагентов)";
	
	Запрос.УстановитьПараметр("МассивМенеджеров", МассивМенеджеров);
	Запрос.УстановитьПараметр("МассивКонтактныхЛиц", МассивКонтактныхЛиц);
	Запрос.УстановитьПараметр("МассивИДКонтрагентов", МассивИДКонтрагентов);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаМенеджеры = РезультатЗапроса[1].Выгрузить();  
	ВыборкаКонтрагенты = РезультатЗапроса[2].Выгрузить();
	ВыборкаКонтактныеЛицаПартнеров = РезультатЗапроса[3].Выгрузить();

	Для каждого СтрокаДоговорыКонтрагентов Из  ОшибокДоговорыКонтрагентов Цикл    
		ОшибкаВалют = СтрНайти(СтрокаДоговорыКонтрагентов.Ошибка, "Валюта не найдена!");
		ОшибкаКонтрагент = СтрНайти(СтрокаДоговорыКонтрагентов.Ошибка, "Контрагент по ID не найден!");
		ОшибкаСчетКонтрагента = СтрНайти(СтрокаДоговорыКонтрагентов.Ошибка,"Банковский счет контрагента не найден!");
		ОшибкаСчетОрганизации = СтрНайти(СтрокаДоговорыКонтрагентов.Ошибка,"Банковский счет организации не найден!"); 
		Если ОшибкаКонтрагент <> 0 
			ИЛИ  ОшибкаВалют <> 0 Тогда
			Продолжить;
		КонецЕсли;  
		СоздатьЭлементОшибокДК(СтрокаДоговорыКонтрагентов, ВыборкаМенеджеры, ВыборкаКонтактныеЛицаПартнеров, ОшибкаСчетКонтрагента, ОшибкаСчетОрганизации);

	КонецЦикла;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОшибокДоговорыКонтрагентов.Обработано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОшибокДоговорыКонтрагентов.Обработано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.ОшибокДоговорыКонтрагентов.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;

КонецПроцедуры  

&НаСервере                                                                         
Процедура СоздатьЭлементОшибокДК(СтрокаДоговорыКонтрагентов, ВыборкаМенеджеры, ВыборкаКонтактныеЛицаПартнеров, ОшибкаСчетКонтрагента, ОшибкаСчетОрганизации)
	
	ИдентификаторМенеджера = ВыборкаМенеджеры.Найти(СтрокаДоговорыКонтрагентов.Менеджер);
		Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("бит_ИДКлиента",
		                                                   	   СтрокаДоговорыКонтрагентов.ИДКлиента); 
		
		Отбор = Новый Структура();
        Отбор.Вставить("Наименование", СтрокаДоговорыКонтрагентов.КонтактноеЛицо); 
		Отбор.Вставить("Владелец", Контрагент); 
		СтрокаДоговоры = ВыборкаКонтактныеЛицаПартнеров.НайтиСтроки(Отбор);
        Если СтрокаДоговоры.Количество() = 0 И СтрокаДоговорыКонтрагентов.КонтактноеЛицо <> "" Тогда
			СозданиеКонтактногоЛица(СтрокаДоговорыКонтрагентов.КонтактноеЛицо, Контрагент);
		КонецЕсли;
			
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		ДоговорКонтрагента.Наименование = СтрокаДоговорыКонтрагентов.Наименование; 
		Если ОшибкаСчетОрганизации = 0 Тогда 
			БСО = СтрЗаменить(СокрЛП(СтрокаДоговорыКонтрагентов.БанковскийСчет), " ", "");
			НомерСчетаБСО = ВРег(СтрЗаменить(БСО, ".", ""));
			ТекущийЭлементСправочникаБСО = Справочники.БанковскиеСчетаОрганизаций.НайтиПоРеквизиту("НомерСчета", НомерСчетаБСО);
			ДоговорКонтрагента.БанковскийСчет = ТекущийЭлементСправочникаБСО;   
		КонецЕсли;
		Если ОшибкаСчетКонтрагента = 0 Тогда
			БСК = СтрЗаменить(СокрЛП(СтрокаДоговорыКонтрагентов.БанковскийСчетКонтрагента), " ", "");
			НомерСчетаБСК = ВРег(СтрЗаменить(БСК, ".", ""));
			ТекущийЭлементСправочникаБСК = Справочники.БанковскиеСчетаКонтрагентов.НайтиПоРеквизиту("НомерСчета", НомерСчетаБСК);
			ДоговорКонтрагента.БанковскийСчетКонтрагента = ТекущийЭлементСправочникаБСК;
		КонецЕсли;
		ДоговорКонтрагента.ВалютаВзаиморасчетов = 
		                             Справочники.Валюты.НайтиПоНаименованию(СтрокаДоговорыКонтрагентов.ВалютаВзаиморасчетов);
		ДоговорКонтрагента.Комментарий = СтрокаДоговорыКонтрагентов.Комментарий; 
		ДоговорКонтрагента.ДатаНачалаДействия = СтрокаДоговорыКонтрагентов.ДатаНачалаДействия;
		ДоговорКонтрагента.ДатаОкончанияДействия = СтрокаДоговорыКонтрагентов.ДатаОкончанияДействия;
		ДоговорКонтрагента.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		ДоговорКонтрагента.Контрагент = Контрагент; 
		ДоговорКонтрагента.Менеджер = Справочники.Пользователи.НайтиПоНаименованию(СтрокаДоговорыКонтрагентов.Менеджер);
		ДоговорКонтрагента.НаименованиеДляПечати = СтрокаДоговорыКонтрагентов.НаименованиеДляПечати;
		ДоговорКонтрагента.Дата = СтрокаДоговорыКонтрагентов.ДатаНачалаДействия;
		ДоговорКонтрагента.Номер = СтрокаДоговорыКонтрагентов.Номер;
		ДоговорКонтрагента.Партнер = Контрагент.Партнер;
		
		ДоговорКонтрагентаЗаполнениеТипНазначения(СтрокаДоговорыКонтрагентов, ДоговорКонтрагента);
		ДоговорКонтрагента.ЗакупкаПодДеятельностьОпределяетсяВДокументе = Истина;
		ДоговорКонтрагента.СпособДоставки = Перечисления.СпособыДоставки.ОпределяетсяВРаспоряжении;
        ДоговорКонтрагента.Согласован = Истина;  
		ДоговорКонтрагента.НалогообложениеНДСОпределяетсяВДокументе = Истина; 
		ДоговорКонтрагента.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", 
		Перечисления.СтавкиНДС.НДС20); 
		ДоговорКонтрагента.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
		ДоговорКонтрагента.КонтактноеЛицо =
		                Справочники.КонтактныеЛицаПартнеров.НайтиПоНаименованию(СтрокаДоговорыКонтрагентов.КонтактноеЛицо);
		ДоговорКонтрагента.Сумма = СтрокаДоговорыКонтрагентов.Сумма;
		
		Попытка	
			ДоговорКонтрагента.Записать();
			СтрокаДоговорыКонтрагентов.Обработано = Истина;
		Исключение
			СтрокаДоговорыКонтрагентов.Обработано = Ложь;
		КонецПопытки;
		
КонецПроцедуры

 &НаСервере 
Процедура ИзменениеУсловногоОформленияПроверкиДоговорыКонтрагентов()
	
    ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиДоговорыКонтрагентов.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); 
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиДоговорыКонтрагентов.Изменено"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь; 
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки); 
	
	Для каждого элПоля Из Элементы.ПроверкиДоговорыКонтрагентов.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле1 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СозданияБанки
   
&НаКлиенте 
Процедура ДействияСТаблицамиБанки(ПредставлениеИсточника)
	
	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникБанки.Видимость 				= Истина;
		ЗаполнитьТаблицуИсточникБанки(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда 
		Элементы.СозданиеБанки.Видимость 					= Истина;
		Элементы.ПроверкиБанки.Видимость 					= Истина;
		Элементы.ОшибокБанки.Видимость 						= Истина;
        ЗаполнитьТаблицыПроверкиБанки(); 
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыТаблицыБанки();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыТаблицыБанки();
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.КлассификаторБанков.ФормаСписка");
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры 
  
&НаСервере 
Процедура ЗаполнитьТаблицуИсточникБанки(ПредставлениеИсточника)
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточникБанки = ИсточникБанки.Добавить();	 
		ТекстКолонки = ПредставлениеИсточника.Область(НомерСтроки, 11).Текст;	   
		СтрИсточникБанки.НаименованиеБанка = ТекстКолонки;
		СтрИсточникБанки.КоррСчетБанка = ПредставлениеИсточника.Область(НомерСтроки, 12).Текст;
        СтрИсточникБанки.БИКБанка = ПредставлениеИсточника.Область(НомерСтроки, 9).Текст;
        СтрИсточникБанки.ВалютаДенежныхСредств = ПредставлениеИсточника.Область(НомерСтроки, 8).Текст;
        	 		
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникБанки.Удалить(СтрИсточникБанки);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиБанки() 
	
	УсловноеОформление.Элементы.Очистить();
	
	Для каждого СтрокаИсточникБанки Из ИсточникБанки Цикл     
		Если СтрокаИсточникБанки.ВалютаДенежныхСредств = "RUB" Тогда 
			СтрокаИсточникБанки.ВалютаДенежныхСредств = "руб.";   
		КонецЕсли;		
	КонецЦикла;  
	МассивВалют = ИсточникБанки.Выгрузить( , "ВалютаДенежныхСредств");
	МассивБик = ИсточникБанки.Выгрузить( , "БИКБанка"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторБанков.Ссылка КАК Ссылка,
	|	КлассификаторБанков.Код КАК Код,
	|	КлассификаторБанков.СВИФТБИК КАК СВИФТБИК
	|ПОМЕСТИТЬ КлассификаторБаковБик
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|ГДЕ
	|	КлассификаторБанков.Код В(&МассивБик)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлассификаторБанков.Ссылка КАК Ссылка,
	|	КлассификаторБанков.Код КАК Код,
	|	КлассификаторБанков.СВИФТБИК КАК СВИФТБИК
	|ПОМЕСТИТЬ КлассификаторБаковСВИФТ
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|ГДЕ
	|	КлассификаторБанков.СВИФТБИК В(&МассивБик)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлассификаторБаковБик.Ссылка КАК Ссылка,
	|	КлассификаторБаковБик.Код КАК Код,
	|	КлассификаторБаковБик.СВИФТБИК КАК СВИФТБИК
	|ИЗ
	|	КлассификаторБаковБик КАК КлассификаторБаковБик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КлассификаторБаковСВИФТ.Ссылка,
	|	КлассификаторБаковСВИФТ.Код,
	|	КлассификаторБаковСВИФТ.СВИФТБИК
	|ИЗ
	|	КлассификаторБаковСВИФТ КАК КлассификаторБаковСВИФТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка,
	|	Валюты.Код КАК Код,
	|	Валюты.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Наименование В(&МассивВалют)";
		
	Запрос.УстановитьПараметр("МассивБик", МассивБик);
	Запрос.УстановитьПараметр("МассивВалют", МассивВалют);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаБик = РезультатЗапроса[2].Выгрузить();
	ВыборкаВалют = РезультатЗапроса[3].Выгрузить();
		
	ЗаполнениеТаблицБанки(ВыборкаБик, ВыборкаВалют);

КонецПроцедуры

&НаСервере
Процедура ЗаполнениеТаблицБанки(ВыборкаБик, ВыборкаВалют)
    
	Для каждого СтрокаИсточникБанки Из ИсточникБанки Цикл 
		
		ТекстСообщения = ""; 
		
		ИдентификаторВалюта = ВыборкаВалют.Найти(СтрокаИсточникБанки.ВалютаДенежныхСредств);
		Если ИдентификаторВалюта = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Валюта не найдена! ";
		КонецЕсли;
		
		ИдентификаторБик = ВыборкаБик.Найти(СтрокаИсточникБанки.БИКБанка);
		Если ИдентификаторБик = Неопределено И Не (ЕстьБуквыВСтроке(СтрокаИсточникБанки.БИКБанка)) Тогда
			ТекстСообщения = ТекстСообщения + "Банк не найден! ";
		КонецЕсли;
		
		Если ТекстСообщения <> "" Тогда
			СтрокаОшибокБанки = ОшибокБанки.Добавить();
			ЗаполнитьСтрокуТаблицыПроверкиБанки(СтрокаОшибокБанки, 
			СтрокаИсточникБанки);
			СтрокаОшибокБанки.Ошибка = ТекстСообщения;
		ИначеЕсли ИдентификаторБик <> Неопределено Тогда 
			СтрокаПроверкиБанки = ПроверкиБанки.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиБанки(СтрокаПроверкиБанки, 
			СтрокаИсточникБанки);
		Иначе 
			СтрокаСозданиеБанки = СозданиеБанки.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиБанки(СтрокаСозданиеБанки,
			СтрокаИсточникБанки);
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыПроверкиБанки(СтрокаПриемник, СтрокаИсточник)
	
	СтрокаПриемник.НаименованиеБанка = СтрокаИсточник.НаименованиеБанка; 
	СтрокаПриемник.КоррСчетБанка = СтрокаИсточник.КоррСчетБанка;
	СтрокаПриемник.БИКБанка = СтрокаИсточник.БИКБанка;
	СтрокаПриемник.ВалютаДенежныхСредств = СтрокаИсточник.ВалютаДенежныхСредств;
	
КонецПроцедуры

&НаСервере 
Процедура СоздатьЭлементыТаблицыБанки()
	
	Для каждого СтрокаБанки Из СозданиеБанки Цикл
		
		Банки = Справочники.КлассификаторБанков.СоздатьЭлемент();
		Банки.Наименование = СтрокаБанки.НаименованиеБанка;
		Банки.КоррСчет = СтрокаБанки.КоррСчетБанка;
		Банки.Код = СтрокаБанки.БИКБанка;
		Банки.СВИФТБИК = СтрокаБанки.БИКБанка;
		Банки.ДеятельностьПрекращена = Ложь;
						
		Попытка	
			Банки.Записать();
			СтрокаБанки.Создано = Истина;
		Исключение
			СтрокаБанки.Создано = Ложь;
		КонецПопытки;	
		
	КонецЦикла;	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеБанки.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеБанки.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеБанки.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;

КонецПроцедуры

&НаСервере 
Процедура ПроверитьЭлементыТаблицыБанки()
	
	// Проверка в рамках ЛТ не предусмотрена 
 	
КонецПроцедуры 	

#КонецОбласти

#Область СозданияВидовНоменклатуры   

&НаКлиенте 
Процедура ДействияСТаблицамиВидыНоменклатуры(ПредставлениеИсточника)        

	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникВидыНоменклатуры.Видимость 	= Истина;
		ЗаполнитьТаблицуИсточникВидыНоменклатуры(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда 
		Элементы.СозданиеВидыНоменклатуры.Видимость 	= Истина;
		Элементы.ПроверкиВидыНоменклатуры.Видимость 	= Истина;
		Элементы.ОшибокВидыНоменклатуры.Видимость 	= Истина;
		ЗаполнитьТаблицыПроверкиВидыНоменклатуры();
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыВидыНоменклатуры();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыВидыНоменклатуры();	
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.ВидыНоменклатуры.ФормаСписка");
	Иначе
		Возврат;
	КонецЕсли; 
			
КонецПроцедуры 

&НаСервере 
Процедура ЗаполнитьТаблицуИсточникВидыНоменклатуры(ПредставлениеИсточника)
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточникВидыН = ИсточникВидыНоменклатуры.Добавить();	 
		
		ТекстКолонки = ПредставлениеИсточника.Область(НомерСтроки, 2).Текст;   
		СтрИсточникВидыН.Наименование = ТекстКолонки; 
		СтрИсточникВидыН.Родитель = ПредставлениеИсточника.Область(НомерСтроки, 1).Текст;
		СтрИсточникВидыН.ВариантОформленияПродажи = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст;
		СтрИсточникВидыН.ВестиУчетПоГТД = ПредставлениеИсточника.Область(НомерСтроки, 7).Текст;
		СтрИсточникВидыН.ВестиУчетСертификатовНоменклатуры = ПредставлениеИсточника.Область(НомерСтроки, 8).Текст;
		СтрИсточникВидыН.ВладелецСерий = ПредставлениеИсточника.Область(НомерСтроки, 10).Текст;
		СтрИсточникВидыН.ВладелецТоварныхКатегорий = ПредставлениеИсточника.Область(НомерСтроки, 11).Текст;
		СтрИсточникВидыН.ВладелецХарактеристик = ПредставлениеИсточника.Область(НомерСтроки, 12).Текст;
		СтрИсточникВидыН.ЗапретРедактированияНаименованияДляПечатиНоменклатуры = 
		                                              ПредставлениеИсточника.Область(НомерСтроки, 19).Текст;
		СтрИсточникВидыН.ЗапретРедактированияНаименованияДляПечатиХарактеристики =
		                                              ПредставлениеИсточника.Область(НомерСтроки, 20).Текст;
		СтрИсточникВидыН.ЗапретРедактированияРабочегоНаименованияНоменклатуры = 
		                                              ПредставлениеИсточника.Область(НомерСтроки, 21).Текст;
		СтрИсточникВидыН.ЗапретРедактированияРабочегоНаименованияХарактеристики = 
		                                              ПредставлениеИсточника.Область(НомерСтроки, 22).Текст;
		СтрИсточникВидыН.ИспользованиеХарактеристик = ПредставлениеИсточника.Область(НомерСтроки, 24).Текст; 
		СтрИсточникВидыН.КоэффициентЕдиницыДляОтчетов = ПредставлениеИсточника.Область(НомерСтроки, 34).Текст;
		СтрИсточникВидыН.НаименованиеДляПечати = ПредставлениеИсточника.Область(НомерСтроки, 39).Текст;
		СтрИсточникВидыН.ТипНоменклатуры = ПредставлениеИсточника.Область(НомерСтроки, 51).Текст;
		СтрИсточникВидыН.СтавкаНДС = ПредставлениеИсточника.Область(НомерСтроки, 53).Текст;
		СтрИсточникВидыН.ОсобенностьУчета = ПредставлениеИсточника.Область(НомерСтроки, 71).Текст;
					
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникВидыНоменклатуры.Удалить(СтрИсточникВидыН);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиВидыНоменклатуры() 
	
	УсловноеОформление.Элементы.Очистить();
	
	МассивНаименований = ИсточникВидыНоменклатуры.Выгрузить( , "Наименование");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка,
	|	ВидыНоменклатуры.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	ВидыНоменклатуры.Наименование В(&МассивНаименований)
	|	И ВидыНоменклатуры.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНаименований = РезультатЗапроса.Выгрузить();
	
	Для каждого СтрокаВидыНоменклатуры Из ИсточникВидыНоменклатуры Цикл 
		Наименование = ВыборкаНаименований.Найти(СтрокаВидыНоменклатуры.Наименование);
		
		Если Наименование = Неопределено Тогда
			СтрокаСозданиеВидыНоменклатуры = СозданиеВидыНоменклатуры.Добавить(); 
			ЗаполнитьСтрокуТаблицыВидыНоменклатуры(СтрокаСозданиеВидыНоменклатуры,
			СтрокаВидыНоменклатуры);
		Иначе 
			СтрокаПроверкиВидыНоменклатуры = ПроверкиВидыНоменклатуры.Добавить(); 
			ЗаполнитьСтрокуТаблицыВидыНоменклатуры(СтрокаПроверкиВидыНоменклатуры, 
			СтрокаВидыНоменклатуры);
		КонецЕсли;
		
	КонецЦикла;	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыВидыНоменклатуры(СтрокаПриемник, СтрокаИсточник)
	
	СтрокаПриемник.Родитель = СтрокаИсточник.Родитель;
	СтрокаПриемник.Наименование = СтрокаИсточник.Наименование; 
	СтрокаПриемник.ВариантОформленияПродажи = СтрокаИсточник.ВариантОформленияПродажи;
	СтрокаПриемник.ВестиУчетПоГТД = ПреобразоватьКТИпуБулевоВН(СтрокаИсточник.ВестиУчетПоГТД);
	СтрокаПриемник.ВестиУчетСертификатовНоменклатуры = Неопределено;
    СтрокаПриемник.ВладелецСерий = СтрокаИсточник.ВладелецСерий;
	СтрокаПриемник.ВладелецТоварныхКатегорий = СтрокаИсточник.ВладелецТоварныхКатегорий;
	СтрокаПриемник.ВладелецХарактеристик = СтрокаИсточник.ВладелецХарактеристик;   
	СтрокаПриемник.ЗапретРедактированияНаименованияДляПечатиНоменклатуры = 
	               ПреобразоватьКТИпуБулевоВН(СтрокаИсточник.ЗапретРедактированияНаименованияДляПечатиНоменклатуры);  
	СтрокаПриемник.ЗапретРедактированияНаименованияДляПечатиХарактеристики = 
	               ПреобразоватьКТИпуБулевоВН(СтрокаИсточник.ЗапретРедактированияНаименованияДляПечатиХарактеристики);
	СтрокаПриемник.ЗапретРедактированияРабочегоНаименованияНоменклатуры = 
	               ПреобразоватьКТИпуБулевоВН(СтрокаИсточник.ЗапретРедактированияРабочегоНаименованияНоменклатуры);
    СтрокаПриемник.ЗапретРедактированияРабочегоНаименованияХарактеристики = 
	               ПреобразоватьКТИпуБулевоВН(СтрокаИсточник.ЗапретРедактированияРабочегоНаименованияХарактеристики);
    СтрокаПриемник.ИспользованиеХарактеристик = Ложь;   
	СтрокаПриемник.КоэффициентЕдиницыДляОтчетов = СтрокаИсточник.КоэффициентЕдиницыДляОтчетов;
	СтрокаПриемник.НаименованиеДляПечати = СтрокаИсточник.НаименованиеДляПечати;
	СтрокаПриемник.ТипНоменклатуры = СтрокаИсточник.ТипНоменклатуры;
	СтрокаПриемник.СтавкаНДС = СтрокаИсточник.СтавкаНДС;
	СтрокаПриемник.ОсобенностьУчета = СтрокаИсточник.ОсобенностьУчета;   
		
КонецПроцедуры	

&НаСервере 
Функция ПреобразоватьКТИпуБулевоВН(Реквезит)
	
	Если  Реквезит = "Нет" ИЛИ Реквезит = "нет" Тогда 
		Определитель = Ложь;
	ИначеЕсли Реквезит = "Да" ИЛИ Реквезит = "да" Тогда 
		Определитель = Истина; 
	Иначе
		Определитель = Неопределено;
	КонецЕсли;
	
	Возврат Определитель;
	
КонецФункции	

&НаСервере 
Процедура СоздатьЭлементыВидыНоменклатуры()

	Для каждого СтрокаВидыНоменклатуры Из СозданиеВидыНоменклатуры Цикл
		
		ПараметрыОтбора = Новый Структура ("Отбор,ВыборГруппИЭлементов"); 
		Отбор = Новый Структура;
		Отбор.Вставить("Наименование", СтрокаВидыНоменклатуры.Родитель);
        ПараметрыОтбора.Отбор = Отбор;
		ПараметрыОтбора.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы;
		РидительВидовНоменклатуры = Справочники.ВидыНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
        Если РидительВидовНоменклатуры.Количество() = 0 Тогда    
			 РидительВидовНоменклатуры = Справочники.ВидыНоменклатуры.СоздатьГруппу();
			 РидительВидовНоменклатуры.Наименование = СтрокаВидыНоменклатуры.Родитель;
			 РидительВидовНоменклатуры.Записать();
			 РидительВидовНоменклатуры = РидительВидовНоменклатуры.Ссылка;
		 Иначе
			РидительВидовНоменклатуры = РидительВидовНоменклатуры[0].Значение; 
		КонецЕсли;	
		
		ВидыНоменклатуры = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
		ВидыНоменклатуры.Наименование = СтрокаВидыНоменклатуры.Наименование; 
		ВидыНоменклатуры.Родитель = РидительВидовНоменклатуры;
		ВидыНоменклатуры.АлкогольнаяПродукция = Ложь;
		//Если СтрокаВидыНоменклатуры.ВариантОформленияПродажи = "реализация" 
		//	ИЛИ СтрокаВидыНоменклатуры.ВариантОформленияПродажи = "" Тогда
		//	ВидыНоменклатуры.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
		//Иначе
		//	ВидыНоменклатуры.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.ПустаяСсылка();
		//КонецЕсли;
		ВидыНоменклатуры.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
		ВидыНоменклатуры.ВестиУчетПоГТД = СтрокаВидыНоменклатуры.ВестиУчетПоГТД;
		//ВидыНоменклатуры.ВладелецСерий = 
		//            ПодборВладельцаВН(СтрокаВидыНоменклатуры.Наименование, СтрокаВидыНоменклатуры.ВладелецСерий);	
		//ВидыНоменклатуры.ВладелецТоварныхКатегорий =
		// 			ПодборВладельцаВН(СтрокаВидыНоменклатуры.Наименование, СтрокаВидыНоменклатуры.ВладелецТоварныхКатегорий);
		//ВидыНоменклатуры.ВладелецХарактеристик = 
		//			ПодборВладельцаВН(СтрокаВидыНоменклатуры.Наименование, СтрокаВидыНоменклатуры.ВладелецХарактеристик);
        ВидыНоменклатуры.ЗапретРедактированияНаименованияДляПечатиНоменклатуры = 
		                       СтрокаВидыНоменклатуры.ЗапретРедактированияНаименованияДляПечатиНоменклатуры;
		ВидыНоменклатуры.ЗапретРедактированияНаименованияДляПечатиХарактеристики = 
		                     СтрокаВидыНоменклатуры.ЗапретРедактированияНаименованияДляПечатиХарактеристики;
		ВидыНоменклатуры.ЗапретРедактированияРабочегоНаименованияНоменклатуры  = 
		                        СтрокаВидыНоменклатуры.ЗапретРедактированияРабочегоНаименованияНоменклатуры;
		ВидыНоменклатуры.ЗапретРедактированияРабочегоНаименованияХарактеристики = 
		                      СтрокаВидыНоменклатуры.ЗапретРедактированияРабочегоНаименованияХарактеристики; 
		ВидыНоменклатуры.ИспользованиеХарактеристик = Ложь;
		ВидыНоменклатуры.КоэффициентЕдиницыДляОтчетов = СтрокаВидыНоменклатуры.КоэффициентЕдиницыДляОтчетов;
		ВидыНоменклатуры.НаименованиеДляПечати = СтрокаВидыНоменклатуры.НаименованиеДляПечати;
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СтрокаПоиска", СтрокаВидыНоменклатуры.ТипНоменклатуры);
		ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если ТипНоменклатуры.Количество() = 0 Тогда
			ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
		Иначе 
			ТипНоменклатуры = ТипНоменклатуры[0].Значение;
		КонецЕсли;
        ВидыНоменклатуры.ТипНоменклатуры = ТипНоменклатуры;
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СтрокаПоиска", СтрокаВидыНоменклатуры.СтавкаНДС);
		СтавкаНДС = Справочники.СтавкиНДС.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если СтавкаНДС.Количество() = 0 Тогда
			СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС20);
		Иначе                                                                        
			СтавкаНДС = СтавкаНДС[0].Значение;
		КонецЕсли;
       	ВидыНоменклатуры.СтавкаНДС = СтавкаНДС;
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СтрокаПоиска", СтрокаВидыНоменклатуры.ОсобенностьУчета);
		ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если ОсобенностьУчета.Количество() = 0 Тогда
			ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета;
		Иначе                                                                        
			ОсобенностьУчета = ОсобенностьУчета[0].Значение;
		КонецЕсли;
        ВидыНоменклатуры.ОсобенностьУчета = ОсобенностьУчета;
					
		Попытка	
			ВидыНоменклатуры.Записать();
			ВидыНоменклатуры.ВладелецСерий = ВидыНоменклатуры.Ссылка;
			ВидыНоменклатуры.ВладелецТоварныхКатегорий = ВидыНоменклатуры.Ссылка;
			Если Не СтрокаВидыНоменклатуры.ВладелецХарактеристик = "" Тогда
				ВидыНоменклатуры.ВладелецХарактеристик = ВидыНоменклатуры.Ссылка;	
			КонецЕсли;	
			ВидыНоменклатуры.Записать();
			СтрокаВидыНоменклатуры.Создано = Истина;
		Исключение
			СтрокаВидыНоменклатуры.Создано = Ложь;
		КонецПопытки;	
		
	КонецЦикла;	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеВидыНоменклатуры.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеВидыНоменклатуры.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеВидыНоменклатуры.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;

КонецПроцедуры 

&НаСервере 
Функция ПодборВладельцаВН(Наименование, Владелец)
	
	Если Наименование <> Владелец И Владелец <> "" Тогда 
		ЭлементВладелец = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(Владелец);
	Иначе
		ЭлементВладелец = Справочники.ВидыНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ЭлементВладелец;
	
КонецФункции

&НаСервере 
Процедура  ПроверитьЭлементыВидыНоменклатуры()
	
	Для каждого СтрокаВидыНоменклатуры Из ПроверкиВидыНоменклатуры Цикл
		//ТекущийЭлементСправочника = Справочники.ВидыНоменклатуры.НайтиПоРеквизиту(("Наименование", 
		//                                                                              СтрокаВидыНоменклатуры.Наименование);  
		ТекущийЭлементСправочника = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(СтрокаВидыНоменклатуры.Наименование);
		ТекущийЭлементСправочника = ТекущийЭлементСправочника.ПолучитьОбъект();
			
		Если ТекущийЭлементСправочника.КоэффициентЕдиницыДляОтчетов = ""
			ИЛИ ТекущийЭлементСправочника.КоэффициентЕдиницыДляОтчетов = Неопределено Тогда  
			Если СтрокаВидыНоменклатуры.КоэффициентЕдиницыДляОтчетов <> "" Тогда
				ТекущийЭлементСправочника.КоэффициентЕдиницыДляОтчетов = СтрокаВидыНоменклатуры.КоэффициентЕдиницыДляОтчетов;
				СтрокаВидыНоменклатуры.Изменено = Истина;
			КонецЕсли;
		КонецЕсли;
       		
		Если ТекущийЭлементСправочника.НаименованиеДляПечати = ""
			ИЛИ ТекущийЭлементСправочника.НаименованиеДляПечати = Неопределено Тогда  
			Если СтрокаВидыНоменклатуры.НаименованиеДляПечати <> "" Тогда
				ТекущийЭлементСправочника.НаименованиеДляПечати = СтрокаВидыНоменклатуры.НаименованиеДляПечати;
				СтрокаВидыНоменклатуры.Изменено = Истина;
			КонецЕсли;
		КонецЕсли;
			
		Если ТекущийЭлементСправочника.СтавкаНДС.Пустая() Тогда 
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СтрокаПоиска", СтрокаВидыНоменклатуры.СтавкаНДС);
		СтавкаНДС = Справочники.СтавкиНДС.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если СтавкаНДС.Количество() = 0 Тогда
			СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС20);
		Иначе                                                                        
			СтавкаНДС = СтавкаНДС[0].Значение;
		КонецЕсли;
       	ТекущийЭлементСправочника.СтавкаНДС = СтавкаНДС;
         СтрокаВидыНоменклатуры.Изменено = Истина;
        КонецЕсли;
		
		Если ТекущийЭлементСправочника.ОсобенностьУчета.Пустая() Тогда 
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СтрокаПоиска", СтрокаВидыНоменклатуры.ОсобенностьУчета);
		ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если ОсобенностьУчета.Количество() = 0 Тогда
			ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета;
		Иначе                                                                        
			ОсобенностьУчета = ОсобенностьУчета[0].Значение;
		КонецЕсли;
        ТекущийЭлементСправочника.ОсобенностьУчета = ОсобенностьУчета;
        СтрокаВидыНоменклатуры.Изменено = Истина;
		КонецЕсли;
				
		Если СтрокаВидыНоменклатуры.Изменено Тогда
			
			Попытка
				ТекущийЭлементСправочника.Записать();
			Исключение 
				СтрокаВидыНоменклатуры.Изменено = Ложь;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	ИзменениеУсловногоОформленияВидыНоменклатуры();
			
КонецПроцедуры 

 &НаСервере 
Процедура ИзменениеУсловногоОформленияВидыНоменклатуры()

 	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиВидыНоменклатуры.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); 
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиВидыНоменклатуры.Изменено"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь; 
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки); 
	
	Для каждого элПоля Из Элементы.ПроверкиВидыНоменклатуры.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле1 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти  

#Область СозданияНоменклатуры  
&НаКлиенте 
Процедура ДействияСТаблицамиНоменклатура(ПредставлениеИсточника)        

	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникНоменклатура.Видимость 	= Истина;
		ЗаполнитьТаблицуИсточникНоменклатура(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда 
		Элементы.СозданиеНоменклатура.Видимость 	= Истина;
		Элементы.ПроверкиНоменклатура.Видимость 	= Истина;
		Элементы.ОшибокНоменклатура.Видимость 	= Истина;
		ЗаполнитьТаблицыПроверкиНоменклатура();
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыНоменклатура();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыНоменклатура();	
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.Номенклатура.ФормаСписка");
	Иначе
		Возврат;
	КонецЕсли; 
			
КонецПроцедуры 

&НаСервере 
Процедура ЗаполнитьТаблицуИсточникНоменклатура(ПредставлениеИсточника)
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточникНоменклатура = ИсточникНоменклатура.Добавить();	 
		
		ТекстКолонки = ПредставлениеИсточника.Область(Формат(НомерСтроки, "ЧГ=0"), 2).Текст;
		СтрИсточникНоменклатура.Наименование = ТекстКолонки;  
		СтрИсточникНоменклатура.Родитель = ПредставлениеИсточника.Область(НомерСтроки, 1).Текст;
	    СтрИсточникНоменклатура.ЕдиницаИзмерения = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст;
		СтрИсточникНоменклатура.Артикул = ПредставлениеИсточника.Область(НомерСтроки, 5).Текст;
		СтрИсточникНоменклатура.ВесЗнаменатель = ПредставлениеИсточника.Область(НомерСтроки, 8).Текст;
		СтрИсточникНоменклатура.ВесЧислитель = ПредставлениеИсточника.Область(НомерСтроки, 11).Текст;
		СтрИсточникНоменклатура.ВидНоменклатуры = ПредставлениеИсточника.Область(НомерСтроки, 15).Текст;
		СтрИсточникНоменклатура.ИспользоватьИндивидуальныйШаблонЭтикетки =
		                                                       ПредставлениеИсточника.Область(НомерСтроки, 29).Текст; 
		СтрИсточникНоменклатура.ШаблонЭтикетки = ПредставлениеИсточника.Область(НомерСтроки, 67).Текст; 
        СтрИсточникНоменклатура.ИспользоватьУпаковки = ПредставлениеИсточника.Область(НомерСтроки, 30).Текст;
		СтрИсточникНоменклатура.ОбъемДАЛ = ПредставлениеИсточника.Область(НомерСтроки, 37).Текст;
		СтрИсточникНоменклатура.СтавкаНДС = ПредставлениеИсточника.Область(НомерСтроки, 45).Текст;
		СтрИсточникНоменклатура.ТипНоменклатуры = ПредставлениеИсточника.Область(НомерСтроки, 46).Текст;
		СтрИсточникНоменклатура.КоэффициентЕдиницыДляОтчетов = ПредставлениеИсточника.Область(НомерСтроки, 66).Текст;
		СтрИсточникНоменклатура.ВладелецСерий = ПредставлениеИсточника.Область(НомерСтроки, 79).Текст;
		СтрИсточникНоменклатура.ВладелецХарактеристик = ПредставлениеИсточника.Область(НомерСтроки, 80).Текст;
		СтрИсточникНоменклатура.ВладелецТоварныхКатегорий = ПредставлениеИсточника.Область(НомерСтроки, 81).Текст;
		СтрИсточникНоменклатура.ОсобенностьУчета = ПредставлениеИсточника.Область(НомерСтроки, 83).Текст;
						
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникНоменклатура.Удалить(СтрИсточникНоменклатура);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиНоменклатура()
	
	УсловноеОформление.Элементы.Очистить();
	 
	МассивНаименований = ИсточникНоменклатура.Выгрузить( , "Наименование");
	МассивАртикулов = ИсточникНоменклатура.Выгрузить( , "Артикул");
	МассивВидНоменклатуры = ИсточникНоменклатура.Выгрузить( , "ВидНоменклатуры");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК СсылкаНоменклатура,
	|	Номенклатура.Наименование КАК НаименованиеНоменклатура,
	|	Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование В(&МассивНаименований)
	|	И Номенклатура.Артикул В(&МассивАртикулов)
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка КАК СсылкаВидыНоменклатуры,
	|	ВидыНоменклатуры.Наименование КАК НаименованиеВидыНоменклатуры
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	ВидыНоменклатуры.Наименование В(&МассивВидНоменклатуры)
	|	И ВидыНоменклатуры.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
	Запрос.УстановитьПараметр("МассивВидНоменклатуры", МассивВидНоменклатуры);
    Запрос.УстановитьПараметр("МассивАртикулов", МассивАртикулов);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНоменклатура = РезультатЗапроса[0].Выгрузить();
	ВыборкаВидыНоменклатуры = РезультатЗапроса[1].Выгрузить();
		
	ЗаполнениеТаблицНоменклатура(ВыборкаНоменклатура, ВыборкаВидыНоменклатуры);    	 
КонецПроцедуры 

&НаСервере 
Процедура ЗаполнениеТаблицНоменклатура(ВыборкаНоменклатура, ВыборкаВидыНоменклатуры)
	
	//ИдентификаторЕденицИзмеренияКМ = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоРеквизиту("Наименование", "км/1000 м"); 
	ИдентификаторЕденицИзмеренияКМ = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("км"); 
	Если ИдентификаторЕденицИзмеренияКМ.Пустая() Тогда
		ИдентификаторЕденицИзмеренияКМ = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("008");
	КонецЕсли;	
	
	ИдентификаторЕденицИзмеренияКГ = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("кг"); 
	Если ИдентификаторЕденицИзмеренияКГ.Пустая() Тогда
		ИдентификаторЕденицИзмеренияКГ = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("166");
	КонецЕсли;  
	
	ИдентификаторЕденицИзмеренияТ = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("т"); 
	Если ИдентификаторЕденицИзмеренияТ.Пустая() Тогда
		ИдентификаторЕденицИзмеренияТ = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("168");
	КонецЕсли;
	
	Для каждого СтрокаНоменклатура Из ИсточникНоменклатура Цикл
		
		ТекстСообщения = ""; 
				
		ИдентификаторВидыНоменклатуры = ВыборкаВидыНоменклатуры.Найти(СтрокаНоменклатура.ВидНоменклатуры);
		Если ИдентификаторВидыНоменклатуры = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Вид номенклатуры не найден! ";  
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СтрокаПоиска", СтрокаНоменклатура.ТипНоменклатуры);
		ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если ТипНоменклатуры.Количество() = 0 Тогда
			ТекстСообщения = ТекстСообщения + "Тип номенклатуры не найден! ";
		КонецЕсли;
		
		Отбор = Новый Структура();
        Отбор.Вставить("НаименованиеНоменклатура", СтрокаНоменклатура.Наименование); 
		Отбор.Вставить("Артикул", СтрокаНоменклатура.Артикул); 
		Наименование = ВыборкаНоменклатура.НайтиСтроки(Отбор);


		Если ТекстСообщения <> "" Тогда
			СтрокаОшибокНоменклатура = ОшибокНоменклатура.Добавить();
			ЗаполнитьСтрокуТаблицыНоменклатура(СтрокаОшибокНоменклатура, 
			СтрокаНоменклатура);
			СтрокаОшибокНоменклатура.Ошибка = ТекстСообщения;
		ИначеЕсли Наименование.Количество() > 0  Тогда 
			СтрокаПроверкиНоменклатура = ПроверкиНоменклатура.Добавить(); 
			ЗаполнитьСтрокуТаблицыНоменклатура(СтрокаПроверкиНоменклатура, 
			СтрокаНоменклатура);
		Иначе 
			СтрокаСозданиеНоменклатура = СозданиеНоменклатура.Добавить(); 
			ЗаполнитьСтрокуТаблицыНоменклатура(СтрокаСозданиеНоменклатура,
			СтрокаНоменклатура);
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры	

&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыНоменклатура(СтрокаПриемник, СтрокаИсточник)  
		                 
	СтрокаПриемник.Родитель = СтрокаИсточник.Родитель; 
	СтрокаПриемник.Наименование = СтрокаИсточник.Наименование;
	СтрокаПриемник.ЕдиницаИзмерения = СтрокаИсточник.ЕдиницаИзмерения;
	СтрокаПриемник.Артикул = СтрокаИсточник.Артикул;
	СтрокаПриемник.ВесЗнаменатель = СтрокаИсточник.ВесЗнаменатель;
	СтрокаПриемник.ВесЧислитель = СтрокаИсточник.ВесЧислитель;
	СтрокаПриемник.ВидНоменклатуры = СтрокаИсточник.ВидНоменклатуры;
	СтрокаПриемник.ИспользоватьИндивидуальныйШаблонЭтикетки = СтрокаИсточник.ИспользоватьИндивидуальныйШаблонЭтикетки;
	СтрокаПриемник.ИспользоватьУпаковки = СтрокаИсточник.ИспользоватьУпаковки;
	СтрокаПриемник.ОбъемДАЛ = СтрокаИсточник.ОбъемДАЛ;   
	СтрокаПриемник.СтавкаНДС = СтрокаИсточник.СтавкаНДС;
    СтрокаПриемник.ТипНоменклатуры = СтрокаИсточник.ТипНоменклатуры;
	СтрокаПриемник.КоэффициентЕдиницыДляОтчетов = СтрокаИсточник.КоэффициентЕдиницыДляОтчетов;
    СтрокаПриемник.ВладелецСерий = СтрокаИсточник.ВладелецСерий;
    СтрокаПриемник.ВладелецХарактеристик = СтрокаИсточник.ВладелецХарактеристик;
	СтрокаПриемник.ВладелецТоварныхКатегорий = СтрокаИсточник.ВладелецТоварныхКатегорий;
	СтрокаПриемник.ОсобенностьУчета = СтрокаИсточник.ОсобенностьУчета;
	СтрокаПриемник.ШаблонЭтикетки = СтрокаИсточник.ШаблонЭтикетки;
	
КонецПроцедуры	

&НаСервере 
Процедура СоздатьЭлементыНоменклатура()
	 
	Для каждого СтрокаНоменклатуры Из СозданиеНоменклатура Цикл
		
		ЭлементНоменклатуры = Справочники.Номенклатура.СоздатьЭлемент();  
		
		ПараметрыОтбора = Новый Структура("Отбор,ВыборГруппИЭлементов");
		Отбор = Новый Структура;
		Отбор.Вставить("Наименование", СтрокаНоменклатуры.Родитель);
		ПараметрыОтбора.Отбор = Отбор;
		ПараметрыОтбора.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы;
		РодительНомменклатуры = Справочники.Номенклатура.ПолучитьДанныеВыбора(ПараметрыОтбора);  
		Если РодительНомменклатуры.Количество() > 0 Тогда	
			//РодительНомменклатуры = РодительНомменклатуры[0].Значение; 
			ЭлементНоменклатуры.Родитель  = РодительНомменклатуры[0].Значение.Значение;
		Иначе 
			РодительНомменклатуры = Справочники.Номенклатура.СоздатьГруппу();
			РодительНомменклатуры.Наименование = СтрокаНоменклатуры.Родитель;
			РодительНомменклатуры.Записать();
			ЭлементНоменклатуры.Родитель = РодительНомменклатуры.Ссылка;
		КонецЕсли;
		ЭлементНоменклатуры.Наименование = СтрокаНоменклатуры.Наименование;	
		ЭлементНоменклатуры.НаименованиеПолное = СтрокаНоменклатуры.Наименование;
		Если СтрокаНоменклатуры.ЕдиницаИзмерения = "КМ" Тогда
			ЭлементНоменклатуры.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("006"); 
			ЭлементНоменклатуры.ЕдиницаДляОтчетов = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("008");
			ЭлементНоменклатуры.КоэффициентЕдиницыДляОтчетов =  1000;
		ИначеЕсли СтрокаНоменклатуры.ЕдиницаИзмерения = "ТН" Тогда
			ЭлементНоменклатуры.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("166");
			ЭлементНоменклатуры.ЕдиницаДляОтчетов = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("168");
			ЭлементНоменклатуры.КоэффициентЕдиницыДляОтчетов =  1000;
		ИначеЕсли СтрокаНоменклатуры.ЕдиницаИзмерения = "КУБМ" Тогда
			ЭлементНоменклатуры.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("113");
			ЭлементНоменклатуры.ЕдиницаДляОтчетов = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("113");      
        Иначе ЭлементНоменклатуры.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(СтрокаНоменклатуры.ЕдиницаИзмерения); 
			Если ЭлементНоменклатуры.ЕдиницаИзмерения.Пустая() Тогда
				НоваяЕденицаИзмерения = СоздатьЕдиницуИзмерения(СтрокаНоменклатуры.ЕдиницаИзмерения);
				Если НоваяЕденицаИзмерения.Количество() > 0 Тогда
				    ЭлементНоменклатуры.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(СтрокаНоменклатуры.ЕдиницаИзмерения);
				Иначе      
					СтрокаНоменклатуры.Ошибка = "Не удалось подобрать единицу измерения!";
					СтрокаОшибокНоменклатура = ОшибокНоменклатура.Добавить();
					ЗаполнитьСтрокуТаблицыНоменклатура(СтрокаОшибокНоменклатура, СтрокаНоменклатуры); 
					//Продолжить;
				КонецЕсли; 
				
			КонецЕсли;	
		КонецЕсли;
		ЭлементНоменклатуры.Артикул = СтрокаНоменклатуры.Артикул;
		ЭлементНоменклатуры.ВесЗнаменатель = СтрокаНоменклатуры.ВесЗнаменатель;
		ЭлементНоменклатуры.ВесЧислитель = СтрокаНоменклатуры.ВесЧислитель;
		ПараметрыОтбора = Новый Структура("Отбор,ВыборГруппИЭлементов");
		Отбор = Новый Структура;
		Отбор.Вставить("Наименование", СтрокаНоменклатуры.ВидНоменклатуры);
		ПараметрыОтбора.Отбор = Отбор;
		ПараметрыОтбора.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);  
		Если ВидНоменклатуры.Количество() > 0 Тогда	
			ЭлементНоменклатуры.ВидНоменклатуры = ВидНоменклатуры[0].Значение;
		Иначе      
			СтрокаНоменклатуры.Ошибка = "Не удалось подобрать вид номенклатуры!";
			СтрокаОшибокНоменклатура = ОшибокНоменклатура.Добавить();
			ЗаполнитьСтрокуТаблицыНоменклатура(СтрокаОшибокНоменклатура, СтрокаНоменклатуры); 
		КонецЕсли; 
		Если СтрокаНоменклатуры.ИспользоватьИндивидуальныйШаблонЭтикетки = "" Тогда 
			ЭлементНоменклатуры.ИспользоватьИндивидуальныйШаблонЭтикетки = Ложь;
		Иначе
			ЭлементНоменклатуры.ИспользоватьИндивидуальныйШаблонЭтикетки = ПреобразоватьКТИпуБулевоВН(СтрокаНоменклатуры.ИспользоватьИндивидуальныйШаблонЭтикетки);
		КонецЕсли;
		Если СтрокаНоменклатуры.ШаблонЭтикетки = "" Тогда 
			ЭлементНоменклатуры.ИспользоватьИндивидуальныйШаблонЭтикетки = Ложь;
			ЭлементНоменклатуры.ШаблонЭтикетки = Справочники.ШаблоныЭтикетокИЦенников.ПустаяСсылка();
		Иначе
			ЭлементНоменклатуры.ШаблонЭтикетки = Справочники.ШаблоныЭтикетокИЦенников.НайтиПоРеквизиту("Наименование", СтрокаНоменклатуры.ШаблонЭтикетки);
		КонецЕсли;
		Если СтрокаНоменклатуры.ИспользоватьУпаковки = "" Тогда 
			ИспользоватьУпаковки = ЭлементНоменклатуры.ВидНоменклатуры.ИспользоватьУпаковки;
		Иначе 
			ИспользоватьУпаковки = СтрокаНоменклатуры.ИспользоватьУпаковки;
		КонецЕсли;
		ЭлементНоменклатуры.ИспользоватьУпаковки = ИспользоватьУпаковки;
		ЭлементНоменклатуры.ОбъемДАЛ = СтрокаНоменклатуры.ОбъемДАЛ;
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СтрокаПоиска", СтрокаНоменклатуры.СтавкаНДС);
		СтавкаНДС = Справочники.СтавкиНДС.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если СтавкаНДС.Количество() = 0 Тогда
			СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС20);
		Иначе                                                                        
			СтавкаНДС = СтавкаНДС[0].Значение;
		КонецЕсли;
       	ЭлементНоменклатуры.СтавкаНДС = СтавкаНДС;  
		Если СтрокаНоменклатуры.ТипНоменклатуры = "Товар" Тогда
			 ЭлементНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
		ИначеЕсли СтрокаНоменклатуры.ТипНоменклатуры = "Работа" Тогда
			 ЭлементНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа;
		ИначеЕсли СтрокаНоменклатуры.ТипНоменклатуры = "Услуга" Тогда
			 ЭлементНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
		ИначеЕсли СтрокаНоменклатуры.ТипНоменклатуры = "МногооборотнаяТара" Тогда
			 ЭлементНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара;
		ИначеЕсли СтрокаНоменклатуры.ТипНоменклатуры = "Набор" Тогда
			 ЭлементНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор;	 
		Иначе 
			//ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
			//СтрокаОшибокНоменклатура = ОшибокНоменклатура.Добавить();
			//ЗаполнитьСтрокуТаблицыНоменклатура(СтрокаОшибокНоменклатура, СтрокаНоменклатуры); 
			//СтрокаОшибокНоменклатура.Ошибка = "Не удалось подобрать тип номенклатуры!";
			//Продолжить; 
			 ЭлементНоменклатуры.ТипНоменклатуры = ЭлементНоменклатуры.ВидНоменклатуры.ТипНоменклатуры;	
		КонецЕсли;
		//ЭлементНоменклатуры.ТипНоменклатуры = ТипНоменклатуры;
		ЭлементНоменклатуры.Качество = Перечисления.ГрадацииКачества.Новый;
		//ЭлементНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры;
		//ЭлементНоменклатуры.КоэффициентЕдиницыДляОтчетов = 1;
		ЭлементНоменклатуры.ВладелецСерий = ЭлементНоменклатуры.ВидНоменклатуры;
		ЭлементНоменклатуры.ВладелецХарактеристик = ЭлементНоменклатуры.ВидНоменклатуры;
		ЭлементНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;
		ЭлементНоменклатуры.ВладелецТоварныхКатегорий = ЭлементНоменклатуры.ВидНоменклатуры;
		ЭлементНоменклатуры.ВариантОформленияПродажи = ЭлементНоменклатуры.ВидНоменклатуры.ВариантОформленияПродажи;
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СтрокаПоиска", СтрокаНоменклатуры.ОсобенностьУчета);
		ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
        Если ОсобенностьУчета.Количество() = 0 Тогда
			//ЭлементНоменклатуры.ОсобенностьУчета =  Перечисления.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета; 
			ЭлементНоменклатуры.ОсобенностьУчета = ЭлементНоменклатуры.ВидНоменклатуры.ОсобенностьУчета;
		Иначе                                                                        
			ЭлементНоменклатуры.ОсобенностьУчета = ОсобенностьУчета[0].Значение;
		КонецЕсли;
		
		Если СтрокаНоменклатуры.Ошибка = "" Тогда 
			Попытка	
				ЭлементНоменклатуры.Записать();
				СтрокаНоменклатуры.Создано = Истина;
			Исключение
				СтрокаНоменклатуры.Создано = Ложь;
				
				СтрокаОшибокНоменклатура = ОшибокНоменклатура.Добавить(); 
				СтрокаНоменклатуры.Ошибка = "Не удалось записать номенклатуру по причине " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаполнитьСтрокуТаблицыНоменклатура(СтрокаОшибокНоменклатура, СтрокаНоменклатуры); 
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;	
	
	//Элементы.СозданиеНоменклатураСоздано.ТолькоПросмотр = Истина;
	//Элементы.ПроверкиНоменклатура.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Создано", Истина));
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеНоменклатура.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеНоменклатура.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеНоменклатура.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;

КонецПроцедуры  

&НаСервере 
Функция СоздатьЕдиницуИзмерения(ЕдиницаИзмерения);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	УпаковкиЕдиницыИзмерения.Код КАК Код
	 |ИЗ
	 |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	 |ГДЕ
	 |	УпаковкиЕдиницыИзмерения.Наименование = &Наименование";
	
	 Запрос.УстановитьПараметр("Наименование", ЕдиницаИзмерения);
	 
	 РезультатЗапроса = Запрос.Выполнить().Выбрать();
	 НовыйЕдИзМ = Новый Соответствие;
	 Пока РезультатЗапроса.Следующий() Цикл
	      КодЕдИзм = РезультатЗапроса.Код; 
		  НовыйЕдИзМ = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора(КодЕдИзм);
	 КонецЦикла;	  
	 
     Возврат НовыйЕдИзМ; 
	 
КонецФункции	

&НаСервере 
Процедура ПроверитьЭлементыНоменклатура()

	Для каждого СтрокаНоменклатуры Из ПроверкиНоменклатура Цикл
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.Артикул) Тогда
			ТекущийЭлементСправочника = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаНоменклатуры.Артикул);
			ТекущийЭлементСправочника = ТекущийЭлементСправочника.ПолучитьОбъект();
		Иначе
			ТекущийЭлементСправочника = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаНоменклатуры.Наименование);
			ТекущийЭлементСправочника = ТекущийЭлементСправочника.ПолучитьОбъект();
		КонецЕсли;
        				
		Если ТекущийЭлементСправочника.Артикул = "" или ТекущийЭлементСправочника.Артикул = Неопределено Тогда
			Если  СтрокаНоменклатуры.Артикул <> "" Тогда
				ТекущийЭлементСправочника.Артикул = СтрокаНоменклатуры.Артикул; 
				СтрокаНоменклатуры.Изменено = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаНоменклатуры.ЕдиницаИзмерения = "КМ" Тогда
			ТекущийЭлементСправочника.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("006"); 
			ТекущийЭлементСправочника.ЕдиницаДляОтчетов = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("008");
			ТекущийЭлементСправочника.КоэффициентЕдиницыДляОтчетов =  1000;
			СтрокаНоменклатуры.Изменено = Истина;
		ИначеЕсли СтрокаНоменклатуры.ЕдиницаИзмерения = "ТН" Тогда
			ТекущийЭлементСправочника.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("166");
			ТекущийЭлементСправочника.ЕдиницаДляОтчетов = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("168");
			ТекущийЭлементСправочника.КоэффициентЕдиницыДляОтчетов =  1000;
			СтрокаНоменклатуры.Изменено = Истина;
		ИначеЕсли СтрокаНоменклатуры.ЕдиницаИзмерения = "КУБМ" Тогда
			ТекущийЭлементСправочника.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("113");
			ТекущийЭлементСправочника.ЕдиницаДляОтчетов = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("113"); 
			СтрокаНоменклатуры.Изменено = Истина;
        Иначе ТекущийЭлементСправочника.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(СтрокаНоменклатуры.ЕдиницаИзмерения); 
			Если ТекущийЭлементСправочника.ЕдиницаИзмерения.Пустая() Тогда
				НоваяЕденицаИзмерения = СоздатьЕдиницуИзмерения(СтрокаНоменклатуры.ЕдиницаИзмерения);
				Если НоваяЕденицаИзмерения.Количество() > 0 Тогда
				    ТекущийЭлементСправочника.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(СтрокаНоменклатуры.ЕдиницаИзмерения);
					ТекущийЭлементСправочника.ЕдиницаДляОтчетов = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(СтрокаНоменклатуры.ЕдиницаИзмерения);
			        СтрокаНоменклатуры.Изменено = Истина;
				Иначе            
					СтрокаНоменклатуры.Ошибка = "Не удалось подобрать единицу измерения!";
					СтрокаОшибокНоменклатура = ОшибокНоменклатура.Добавить();
					ЗаполнитьСтрокуТаблицыНоменклатура(СтрокаОшибокНоменклатура, СтрокаНоменклатуры); 
					//Продолжить;
				КонецЕсли; 
			КонецЕсли;	
		КонецЕсли;
        		
		Если ТекущийЭлементСправочника.ВесЗнаменатель = 0 или ТекущийЭлементСправочника.ВесЗнаменатель = Неопределено Тогда
			Если  СтрокаНоменклатуры.ВесЗнаменатель <> "" Тогда
				ТекущийЭлементСправочника.ВесЗнаменатель = СтрокаНоменклатуры.ВесЗнаменатель; 
				СтрокаНоменклатуры.Изменено = Истина;
			КонецЕсли;
		КонецЕсли;

		Если ТекущийЭлементСправочника.ВесЧислитель = 0 или ТекущийЭлементСправочника.ВесЧислитель = Неопределено Тогда
			Если  СтрокаНоменклатуры.ВесЧислитель <> "" Тогда
				ТекущийЭлементСправочника.ВесЧислитель = СтрокаНоменклатуры.ВесЧислитель; 
				СтрокаНоменклатуры.Изменено = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекущийЭлементСправочника.СтавкаНДС.Пустая() Тогда 
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СтрокаПоиска", СтрокаНоменклатуры.СтавкаНДС);
		СтавкаНДС = Справочники.СтавкиНДС.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если СтавкаНДС.Количество() = 0 Тогда
			СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", Перечисления.СтавкиНДС.НДС20);
		Иначе                                                                        
			СтавкаНДС = СтавкаНДС[0].Значение;
		КонецЕсли;
       	ТекущийЭлементСправочника.СтавкаНДС = СтавкаНДС;
         СтрокаНоменклатуры.Изменено = Истина;
        КонецЕсли;
    		
		Если ТекущийЭлементСправочника.ОсобенностьУчета.Пустая() Тогда 
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СтрокаПоиска", СтрокаНоменклатуры.ОсобенностьУчета);
		ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если ОсобенностьУчета.Количество() = 0 Тогда
			ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета;
		Иначе                                                                        
			ОсобенностьУчета = ОсобенностьУчета[0].Значение;
		КонецЕсли;
        ТекущийЭлементСправочника.ОсобенностьУчета = ОсобенностьУчета;
        СтрокаНоменклатуры.Изменено = Истина;
		КонецЕсли;
				
		Если СтрокаНоменклатуры.Изменено И СтрокаНоменклатуры.Ошибка = "" Тогда
			
			Попытка
				ТекущийЭлементСправочника.Записать();
			Исключение 
				СтрокаНоменклатуры.Изменено = Ложь;  
				
				СтрокаОшибокНоменклатура = ОшибокНоменклатура.Добавить();
				ЗаполнитьСтрокуТаблицыНоменклатура(СтрокаОшибокНоменклатура, СтрокаНоменклатуры); 
				СтрокаОшибокНоменклатура.Ошибка = "Не удалось записать номенклатуру по причине " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	//Элементы.ПроверкиНоменклатураИзменено.ТолькоПросмотр = Истина;
	//Элементы.ПроверкиНоменклатура.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Изменено", Истина));

	ИзменениеУсловногоОформленияНоменклатуры();

КонецПроцедуры

 &НаСервере 
Процедура ИзменениеУсловногоОформленияНоменклатуры()

 	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиНоменклатура.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); 
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиНоменклатура.Изменено"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь; 
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки); 
	
	Для каждого элПоля Из Элементы.ПроверкиНоменклатура.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле1 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СозданияПризнаковНоменклатуры   
&НаКлиенте 
Процедура ДействияСТаблицамиПризнакиНоменклатуры(ПредставлениеИсточника)
	
	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникПризнакиНоменклатуры.Видимость 	= Истина;
		ЗаполнитьТаблицуИсточникПризнакиНоменклатуры(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда 
		Элементы.СозданиеПризнакиНоменклатуры.Видимость 	= Истина;
		Элементы.ПроверкиПризнакиНоменклатуры.Видимость 	= Истина;
		Элементы.ОшибокПризнакиНоменклатуры.Видимость 	= Истина;
		ЗаполнитьТаблицыПроверкиПризнакиНоменклатуры();
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыПризнакиНоменклатуры();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыПризнакиНоменклатуры();	
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.Номенклатура.ФормаСписка");
	Иначе
		Возврат;
	КонецЕсли; 
			
КонецПроцедуры 

&НаСервере 
Процедура ЗаполнитьТаблицуИсточникПризнакиНоменклатуры(ПредставлениеИсточника)
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточникНоменклатура = ИсточникПризнакиНоменклатуры.Добавить();	 
		
		ТекстКолонки = ПредставлениеИсточника.Область(Формат(НомерСтроки, "ЧГ=0"), 3).Текст;
		СтрИсточникНоменклатура.Наименование = ТекстКолонки;  
		СтрИсточникНоменклатура.ГруппаКабеля = ПредставлениеИсточника.Область(НомерСтроки, 1).Текст;
	    СтрИсточникНоменклатура.Код = ПредставлениеИсточника.Область(НомерСтроки, 2).Текст;
		СтрИсточникНоменклатура.ЕдИзм = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст;
		//СтрИсточникНоменклатура.НормативнаяТара = ПредставлениеИсточника.Область(НомерСтроки, 5).Текст;
		//СтрИсточникНоменклатура.Ед_Изм = ПредставлениеИсточника.Область(НомерСтроки, 6).Текст;
		//СтрИсточникНоменклатура.Емкость = ПредставлениеИсточника.Область(НомерСтроки, 7).Текст;
		//СтрИсточникНоменклатура.НормаРасхода = ПредставлениеИсточника.Область(НомерСтроки, 8).Текст;
		СтрИсточникНоменклатура.КодПризнака =  ПредставлениеИсточника.Область(НомерСтроки, 5).Текст; 
		СтрИсточникНоменклатура.НаименованиеПризнака = ПредставлениеИсточника.Область(НомерСтроки, 6).Текст; 
        СтрИсточникНоменклатура.ЗначениеПризнака = ПредставлениеИсточника.Область(НомерСтроки, 7).Текст;
					
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникПризнакиНоменклатуры.Удалить(СтрИсточникНоменклатура);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиПризнакиНоменклатуры()
	
	УсловноеОформление.Элементы.Очистить();
	
	МассивНоменклатуры = ИсточникПризнакиНоменклатуры.Выгрузить( , "Наименование");
	МассивАртикулов = ИсточникПризнакиНоменклатуры.Выгрузить( , "Код");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК СсылкаНоменклатура,
	|	Номенклатура.Наименование КАК НаименованиеНоменклатура,
	|	Номенклатура.Код КАК КодНоменклатура,
	|	Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование В(&МассивНоменклатуры)
	|	И Номенклатура.Артикул В(&МассивАртикулов)
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура КАК бит_Номенклатура,
	|	бит_ЗначенияПризнаковНоменклатуры.бит_Признак КАК бит_Признак,
	|	бит_ЗначенияПризнаковНоменклатуры.бит_Признак.Код КАК бит_ПризнакКод, 
	|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура.Наименование КАК бит_НоменклатураНаименование,
	|	бит_ЗначенияПризнаковНоменклатуры.бит_Признак.Наименование КАК бит_ПризнакНаименование,
	|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура.Артикул КАК бит_НоменклатураАртикул
	|ИЗ
	|	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
	|ГДЕ
	|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура.Наименование В(&МассивНоменклатуры)";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("МассивАртикулов", МассивАртикулов);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНоменклатура = РезультатЗапроса[0].Выгрузить();
	ВыборкаПризнак = РезультатЗапроса[1].Выгрузить();		
	ЗаполнениеТаблицПризнакиНоменклатуры(ВыборкаНоменклатура, ВыборкаПризнак);
   
КонецПроцедуры  

&НаСервере 
Процедура ЗаполнениеТаблицПризнакиНоменклатуры(ВыборкаНоменклатура, ВыборкаПризнак)
	
	ВсеПодразделенияБезПрификса = ПолучитьВсеПодразделенияБезПрификса();
	
	Для каждого СтрокаПризнакиНоменклатуры Из ИсточникПризнакиНоменклатуры Цикл
		
		ТекстСообщения = ""; 
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НаименованиеНоменклатура", СтрокаПризнакиНоменклатуры.Наименование);
		ПараметрыОтбора.Вставить("Артикул", СтрокаПризнакиНоменклатуры.Код);
        ИдентификаторНоменклатуры = ВыборкаНоменклатура.НайтиСтроки(ПараметрыОтбора);
		Если ИдентификаторНоменклатуры.Количество() = 0 Тогда
			ТекстСообщения = ТекстСообщения + "Номенклатура не найдена! ";
		КонецЕсли; 
		
		//Если ИдентификаторНоменклатуры = Неопределено Тогда
		//	ТекстСообщения = ТекстСообщения + "Номенклатура не найдена! "; 
		//ИначеЕсли Не ИдентификаторНоменклатуры[0].Артикул = СтрокаПризнакиНоменклатуры.Код Тогда
		//	ТекстСообщения = ТекстСообщения + "Номенклатура не найдена! "
		//КонецЕсли;
		
		
		НоменклатураТ = Справочники.Номенклатура.ПустаяСсылка();

		ПараметрыОтбора = Новый Структура;
		Отбор = Новый Структура;
		Отбор.Вставить("Наименование", СтрокаПризнакиНоменклатуры.Наименование); 
		Отбор.Вставить("Артикул", СтрокаПризнакиНоменклатуры.Код);   
		ПараметрыОтбора.Вставить("Отбор", Отбор);
		бит_Номенклатура = Справочники.Номенклатура.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если Не (бит_Номенклатура = Неопределено Или бит_Номенклатура.Количество() = 0) Тогда 
			НоменклатураТ = бит_Номенклатура[0].Значение;
			НоменклатураТ = НоменклатураТ.Значение;
			Если  НоменклатураТ.Артикул <> СтрокаПризнакиНоменклатуры.Код Тогда
				НоменклатураТ = бит_Номенклатура[1].Значение;
				НоменклатураТ = НоменклатураТ.Значение;
				Если  НоменклатураТ.Артикул <> СтрокаПризнакиНоменклатуры.Код Тогда
					НоменклатураТ = бит_Номенклатура[2].Значение;
					НоменклатураТ = НоменклатураТ.Значение;
					Если  НоменклатураТ.Артикул <> СтрокаПризнакиНоменклатуры.Код Тогда 
						ТекстСообщения = ТекстСообщения + СтрШаблон("Артикул номенклатуры %1 <> Код в строке таблицы %2", НоменклатураТ.Артикул, СтрокаПризнакиНоменклатуры.Код);
						бит_Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
					КонецЕсли;	
					бит_Номенклатура = НоменклатураТ;
				КонецЕсли;	
				бит_Номенклатура = НоменклатураТ;
			КонецЕсли;
			бит_Номенклатура = НоменклатураТ;
		Иначе
			бит_Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;                 
		
		Если Не бит_Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			ПараметрыОтбора = Новый Структура;
			Отбор = Новый Структура;
			Отбор.Вставить("Код", СтрокаПризнакиНоменклатуры.КодПризнака);   
			ПараметрыОтбора.Вставить("Отбор", Отбор);
			бит_Признак = ПланыВидовХарактеристик.бит_ПризнакиНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
			Если бит_Признак = Неопределено Или бит_Признак.Количество() = 0 Тогда 
				ТекстСообщения = ТекстСообщения + "Признак " + СтрокаПризнакиНоменклатуры.КодПризнака + " не найден в ПВХ. "; 
				бит_Признак = ПланыВидовХарактеристик.бит_ПризнакиНоменклатуры.ПустаяСсылка();
			Иначе
				бит_Признак = бит_Признак[0].Значение;
			КонецЕсли;
			
			Если Не бит_Признак = ПланыВидовХарактеристик.бит_ПризнакиНоменклатуры.ПустаяСсылка() Тогда
				бит_Значение = ПолучитьЗначениеПризнака(СтрокаПризнакиНоменклатуры, бит_Признак, бит_Номенклатура, ВсеПодразделенияБезПрификса); 
			Иначе              
				бит_Значение = Неопределено;
			КонецЕсли;

			Если ТипЗнч(бит_Значение) = Тип("СправочникСсылка.бит_ДополнительныеПризнакиНоменклатуры") Тогда
				бит_Значение = бит_Значение[0].Значение;
			КонецЕсли;

			Если бит_Значение <> Неопределено Тогда 
				Если ТипЗнч(бит_Значение) = Тип("СправочникСсылка.бит_ДополнительныеПризнакиНоменклатуры") 
					Или ТипЗнч(бит_Значение) = Тип("СправочникСсылка.Номенклатура")
					Или ТипЗнч(бит_Значение) = Тип("СправочникСсылка.СтруктураПредприятия")
					Или ТипЗнч(бит_Значение) = Тип("СправочникСсылка.Марки") Тогда
					Если бит_Значение.Пустая() Тогда 
						ТекстСообщения = ТекстСообщения + "не удалось получить значение признака " + СтрокаПризнакиНоменклатуры.КодПризнака;
						бит_Значение = "";
					КонецЕсли;
				Иначе
					Если бит_Значение = "" Тогда
						ТекстСообщения = ТекстСообщения + "тип значения для значения признака не является корректным";
						бит_Значение = "";
					КонецЕсли;
				КонецЕсли;
			Иначе 		
				бит_Значение = "";                                                                                                          
				ТекстСообщения = ТекстСообщения + "не удалось получить значение признака " + СтрокаПризнакиНоменклатуры.КодПризнака;
			КонецЕсли;   
		КонецЕсли;
		
		//Если ТекстСообщения = "" И ЗначениеЗаполнено(бит_Признак) и ЗначениеЗаполнено(бит_Номенклатура) и ЗначениеЗаполнено(бит_Значение) Тогда
		Если ТекстСообщения = "" И ЗначениеЗаполнено(бит_Признак) и ЗначениеЗаполнено(бит_Номенклатура) Тогда
			
			ПараметрыОтбора = Новый Структура;
		    ПараметрыОтбора.Вставить("бит_НоменклатураНаименование", СтрокаПризнакиНоменклатуры.Наименование);
		    ПараметрыОтбора.Вставить("бит_ПризнакНаименование", СтрокаПризнакиНоменклатуры.НаименованиеПризнака); 
			ПараметрыОтбора.Вставить("бит_НоменклатураАртикул", СтрокаПризнакиНоменклатуры.Код);
			Признак = ВыборкаПризнак.НайтиСтроки(ПараметрыОтбора);
			
			СтрокаПризнакиНоменклатуры.бит_Номенклатура = бит_Номенклатура;
			СтрокаПризнакиНоменклатуры.бит_Признак = бит_Признак;
			СтрокаПризнакиНоменклатуры.бит_Значение = бит_Значение;
			
			Если Признак.Количество() > 0 Тогда 
				СтрокаПроверкиПризнакиНоменклатуры = ПроверкиПризнакиНоменклатуры.Добавить(); 
				ЗаполнитьСтрокуТаблицыПризнакиНоменклатуры(СтрокаПроверкиПризнакиНоменклатуры, СтрокаПризнакиНоменклатуры);
			Иначе 
				СтрокаСозданиеПризнакиНоменклатуры = СозданиеПризнакиНоменклатуры.Добавить(); 
				ЗаполнитьСтрокуТаблицыПризнакиНоменклатуры(СтрокаСозданиеПризнакиНоменклатуры, СтрокаПризнакиНоменклатуры);
			КонецЕсли;	
			
		Иначе
			СтрокаОшибокПризнакиНоменклатуры = ОшибокПризнакиНоменклатуры.Добавить();
			ЗаполнитьСтрокуТаблицыПризнакиНоменклатуры(СтрокаОшибокПризнакиНоменклатуры, СтрокаПризнакиНоменклатуры);
			СтрокаОшибокПризнакиНоменклатуры.Ошибка = ТекстСообщения;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыПризнакиНоменклатуры(СтрокаПриемник, СтрокаИсточник)  
		                 
	СтрокаПриемник.ГруппаКабеля = СтрокаИсточник.ГруппаКабеля; 
	СтрокаПриемник.Код = СтрокаИсточник.Код;
	СтрокаПриемник.Наименование = СтрокаИсточник.Наименование;
	СтрокаПриемник.ЕдИзм = СтрокаИсточник.ЕдИзм;
	СтрокаПриемник.НормативнаяТара = СтрокаИсточник.НормативнаяТара;
	СтрокаПриемник.Ед_Изм = СтрокаИсточник.Ед_Изм;
	СтрокаПриемник.Емкость = СтрокаИсточник.Емкость;
	СтрокаПриемник.НормаРасхода = СтрокаИсточник.НормаРасхода; 
	Если СтрокаИсточник.КодПризнака = "GR1 (KKSS)" Тогда
		СтрокаПриемник.КодПризнака = "GR1 (KKSS)";	
	Иначе
		СтрокаПриемник.КодПризнака = СтрокаИсточник.КодПризнака;
	КонецЕсли;
	СтрокаПриемник.НаименованиеПризнака = СтрокаИсточник.НаименованиеПризнака;   
	СтрокаПриемник.ЗначениеПризнака = СтрокаИсточник.ЗначениеПризнака; 
	
	СтрокаПриемник.бит_Номенклатура = СтрокаИсточник.бит_Номенклатура;
	СтрокаПриемник.бит_Признак 		= СтрокаИсточник.бит_Признак;
	СтрокаПриемник.бит_Значение 	= СтрокаИсточник.бит_Значение;

КонецПроцедуры

&НаСервере
Функция НайтиНоменклатуруПоСтрокеПризнакаИзКеша(СтрокаПризнакиНоменклатуры, КешДанных)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НаименованиеНоменклатура", СтрокаПризнакиНоменклатуры.Наименование);
	ПараметрыОтбора.Вставить("Артикул", СтрокаПризнакиНоменклатуры.Код);
	СтрокиНоменклатуры = КешДанных.Номенклатура.НайтиСтроки(ПараметрыОтбора);
	
	Если СтрокиНоменклатуры.Количество() = 0 Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтрокиНоменклатуры[0].СсылкаНоменклатура;
	
КонецФункции

&НаСервере
Функция НайтиПризнакПоКодуИзКеша(КодПризнака, КешДанных)
	
	ПараметрыОтбора = Новый Структура("Код", КодПризнака);
	СтрокиПризнаков = КешДанных.Признаки.НайтиСтроки(ПараметрыОтбора);
	Если СтрокиПризнаков.Количество() = 0 Тогда
		Возврат ПланыВидовХарактеристик.бит_ПризнакиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтрокиПризнаков[0].Ссылка;
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеСтрокиПризнакаДляЗаписи(СтрокаПризнакиНоменклатуры, КешДанных, ВсеПодразделенияБезПрификса)
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ТекстПредупреждения", "");
	Результат.Вставить("КодПризнака", "");
	Результат.Вставить("СсылкаНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	Результат.Вставить("СсылкаПризнак", ПланыВидовХарактеристик.бит_ПризнакиНоменклатуры.ПустаяСсылка());
	Результат.Вставить("ЗначениеДляЗаписи", "");
	Результат.Вставить("ЗаписьСуществует", Ложь);
	
	СсылкаНоменклатуры = НайтиНоменклатуруПоСтрокеПризнакаИзКеша(СтрокаПризнакиНоменклатуры, КешДанных);
	Если СсылкаНоменклатуры.Пустая() Тогда
		Результат.ТекстОшибки = Результат.ТекстОшибки + "Номенклатура не найдена: " + СтрокаПризнакиНоменклатуры.Наименование + "(" + СтрокаПризнакиНоменклатуры.Код + ")";
		Возврат Результат;
	КонецЕсли;
	
	СсылкаПризнака = НайтиПризнакПоКодуИзКеша(СтрокаПризнакиНоменклатуры.КодПризнака, КешДанных);
	Если СсылкаПризнака.Пустая() Тогда
		Результат.ТекстОшибки = Результат.ТекстОшибки + "Признак " + СтрокаПризнакиНоменклатуры.КодПризнака + " не найден в ПВХ. ";
		Результат.СсылкаНоменклатура = СсылкаНоменклатуры;
		Возврат Результат;
	КонецЕсли;
	
	ЗначениеДляЗаписи = ПолучитьЗначениеПризнака(СтрокаПризнакиНоменклатуры, СсылкаПризнака, СсылкаНоменклатуры, ВсеПодразделенияБезПрификса);
	Если ЗначениеДляЗаписи = Неопределено Или ЗначениеДляЗаписи = "" Тогда
		Результат.ТекстОшибки = Результат.ТекстОшибки + "не удалось получить значение признака " + СтрокаПризнакиНоменклатуры.КодПризнака;
		Результат.СсылкаНоменклатура = СсылкаНоменклатуры;
		Результат.СсылкаПризнак = СсылкаПризнака;
		Результат.КодПризнака = СсылкаПризнака.Код;
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеДляЗаписи) = Тип("СправочникСсылка.ПодразделенияОрганизаций") 
		Или ТипЗнч(ЗначениеДляЗаписи) = Тип("СправочникСсылка.бит_ДополнительныеПризнакиНоменклатуры") 
		Или ТипЗнч(ЗначениеДляЗаписи) = Тип("СправочникСсылка.Марки")
		Или ТипЗнч(ЗначениеДляЗаписи) = Тип("СправочникСсылка.Номенклатура") 
		ИЛИ ТипЗнч(ЗначениеДляЗаписи) = Тип("СправочникСсылка.СтруктураПредприятия") 
		ИЛИ ТипЗнч(ЗначениеДляЗаписи) = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
		
		Если ЗначениеДляЗаписи.Пустая() Тогда 
			Результат.ТекстОшибки = Результат.ТекстОшибки + "Признак " + СтрокаПризнакиНоменклатуры.КодПризнака + " не найдено значение признака ";
			ЗначениеДляЗаписи = "";	
		ИначеЕсли СтрокаПризнакиНоменклатуры.ЗначениеПризнака <> ЗначениеДляЗаписи.Наименование 
			И Не (ТипЗнч(ЗначениеДляЗаписи) = Тип("СправочникСсылка.СтруктураПредприятия")) 
			И Не (ТипЗнч(ЗначениеДляЗаписи) = Тип("СправочникСсылка.Марки")) Тогда
			Результат.ТекстПредупреждения = СтрШаблон("Наименование в таблице не совпадает с найденным значением. Артикул %1 Признак %2", СтрокаПризнакиНоменклатуры.Код, СтрокаПризнакиНоменклатуры.КодПризнака);
		КонецЕсли;
	ИначеЕсли ЭтоЧисловойТипПризнака(СсылкаПризнака.ТипЗначения) Тогда
		ЗначениеДляЗаписи = НормализацияЗначенияПризнакаЧисло(ЗначениеДляЗаписи);
		Если ТипЗнч(ЗначениеДляЗаписи) = Тип("Строка") Тогда
			Попытка
				ЗначениеДляЗаписи = Число(ЗначениеДляЗаписи);
			Исключение
				Результат.ТекстОшибки = Результат.ТекстОшибки + "ожидается другой тип значения признака ";
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.ТекстОшибки = "" Тогда
		Результат.ЗаписьСуществует = ЕстьСуществующаяЗаписьПризнакаВКеше(СсылкаНоменклатуры, СсылкаПризнака, КешДанных);
	КонецЕсли;
	
	Результат.СсылкаНоменклатура = СсылкаНоменклатуры;
	Результат.СсылкаПризнак = СсылкаПризнака;
	Результат.ЗначениеДляЗаписи = ЗначениеДляЗаписи;
	Результат.КодПризнака = СсылкаПризнака.Код;
	
	Возврат Результат;
	
КонецФункции

&НаСервере 
Функция НормализацияЗначенияПризнакаЧисло(бит_Значение)
	
	Если ТипЗнч(бит_Значение) = Тип("Число") Тогда
		Возврат бит_Значение;
	КонецЕсли;
	
	ЗначениеСтрокой = СокрЛП(Строка(бит_Значение));
	Если ЗначениеСтрокой = "" Тогда
		Возврат бит_Значение;
	КонецЕсли;
	
	Если Лев(ЗначениеСтрокой, 1) = "." Тогда
		ЗначениеСтрокой = "0" + ЗначениеСтрокой;
	ИначеЕсли Лев(ЗначениеСтрокой, 1) = "," Тогда
		ЗначениеСтрокой = "0" + ЗначениеСтрокой;
	КонецЕсли;
	
	ЗначениеСтрокой = СтрЗаменить(ЗначениеСтрокой, ",", ".");
	
	Попытка
		Возврат Число(ЗначениеСтрокой);
	Исключение
		Возврат бит_Значение;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ЭтоЧисловойТипПризнака(ТипЗначенияПризнака)
	
	КвалификаторЧисла10_20 = Новый КвалификаторыЧисла(30,20);
	ОписаниеЧисло10_20 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла10_20);
	КвалификаторЧисла2_2 = Новый КвалификаторыЧисла(4,2);
	ОписаниеЧисло2_2 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла2_2);
	КвалификаторЧисла2_3 = Новый КвалификаторыЧисла(5,3);
	ОписаниеЧисло2_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла2_3);
	КвалификаторЧисла4_0 = Новый КвалификаторыЧисла(4,0);
	ОписаниеЧисло4_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла4_0);
	КвалификаторЧисла4_2 = Новый КвалификаторыЧисла(6,2);
	ОписаниеЧисло4_2 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла4_2);
	КвалификаторЧисла3_0 = Новый КвалификаторыЧисла(3,0);
	ОписаниеЧисло3_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла3_0);
	КвалификаторЧисла3_3 = Новый КвалификаторыЧисла(6,3);
	ОписаниеЧисло3_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла3_3);
	КвалификаторЧисла3_5 = Новый КвалификаторыЧисла(8,5);
	ОписаниеЧисло3_5 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла3_5);
	КвалификаторЧисла3_10 = Новый КвалификаторыЧисла(13,10);
	ОписаниеЧисло3_10 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла3_10);
	КвалификаторЧисла3_20 = Новый КвалификаторыЧисла(23,20);
	ОписаниеЧисло3_20 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла3_20); 
	КвалификаторЧисла5_0 = Новый КвалификаторыЧисла(5,0);
	ОписаниеЧисло5_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла5_0); 
	КвалификаторЧисла5_2 = Новый КвалификаторыЧисла(7,2);
	ОписаниеЧисло5_2 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла5_2); 
	КвалификаторЧисла5_3 = Новый КвалификаторыЧисла(8,3);
	ОписаниеЧисло5_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла5_3); 
	КвалификаторЧисла5_6 = Новый КвалификаторыЧисла(11,6);
	ОписаниеЧисло5_6 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла5_6);
	КвалификаторЧисла10_0 = Новый КвалификаторыЧисла(10,0);
	ОписаниеЧисло10_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла10_0); 
	КвалификаторЧисла10_3 = Новый КвалификаторыЧисла(13,3);
	ОписаниеЧисло10_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла10_3);
	
	Возврат ТипЗначенияПризнака = ОписаниеЧисло2_2
		Или ТипЗначенияПризнака = ОписаниеЧисло10_20  
		Или ТипЗначенияПризнака = ОписаниеЧисло2_3
		Или ТипЗначенияПризнака = ОписаниеЧисло4_0
		Или ТипЗначенияПризнака = ОписаниеЧисло4_2
		Или ТипЗначенияПризнака = ОписаниеЧисло3_0
		Или ТипЗначенияПризнака = ОписаниеЧисло3_3
		Или ТипЗначенияПризнака = ОписаниеЧисло3_5
		Или ТипЗначенияПризнака = ОписаниеЧисло3_10
		Или ТипЗначенияПризнака = ОписаниеЧисло3_20
		Или ТипЗначенияПризнака = ОписаниеЧисло5_0
		Или ТипЗначенияПризнака = ОписаниеЧисло5_2
		Или ТипЗначенияПризнака = ОписаниеЧисло5_3
		Или ТипЗначенияПризнака = ОписаниеЧисло5_6
		Или ТипЗначенияПризнака = ОписаниеЧисло10_0
		Или ТипЗначенияПризнака = ОписаниеЧисло10_3;
	
КонецФункции

&НаСервере
Функция ЕстьСуществующаяЗаписьПризнакаВКеше(СсылкаНоменклатуры, СсылкаПризнака, КешДанных)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("бит_Номенклатура", СсылкаНоменклатуры);
	ПараметрыОтбора.Вставить("бит_Признак", СсылкаПризнака);
	
	Возврат КешДанных.СуществующиеЗаписи.НайтиСтроки(ПараметрыОтбора).Количество() > 0;
	
КонецФункции

&НаСервере
Функция ПостроитьКешДанныхДляТаблицыПризнаков(ТаблицаПризнаков)
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Новый ТаблицаЗначений);
	Результат.Вставить("СуществующиеЗаписи", Новый ТаблицаЗначений);
	Результат.Вставить("Признаки", Новый ТаблицаЗначений);
	
	Если ТаблицаПризнаков = Неопределено Или ТаблицаПризнаков.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивНоменклатуры = ТаблицаПризнаков.Выгрузить(, "Наименование");
	МассивАртикулов = ТаблицаПризнаков.Выгрузить(, "Код");
	МассивКодовПризнаков = ТаблицаПризнаков.Выгрузить(, "КодПризнака");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК СсылкаНоменклатура,
	|	Номенклатура.Наименование КАК НаименованиеНоменклатура,
	|	Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование В(&МассивНоменклатуры)
	|	И Номенклатура.Артикул В(&МассивАртикулов)
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура КАК бит_Номенклатура,
	|	бит_ЗначенияПризнаковНоменклатуры.бит_Признак КАК бит_Признак
	|ИЗ
	|	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
	|ГДЕ
	|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура.Наименование В(&МассивНоменклатуры)
	|	И бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура.Артикул В(&МассивАртикулов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПризнакиНоменклатуры.Ссылка КАК Ссылка,
	|	бит_ПризнакиНоменклатуры.Код КАК Код
	|ИЗ
	|	ПланВидовХарактеристик.бит_ПризнакиНоменклатуры КАК бит_ПризнакиНоменклатуры
	|ГДЕ
	|	бит_ПризнакиНоменклатуры.Код В(&МассивКодовПризнаков)";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("МассивАртикулов", МассивАртикулов);
	Запрос.УстановитьПараметр("МассивКодовПризнаков", МассивКодовПризнаков);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Результат.Номенклатура = РезультатЗапроса[0].Выгрузить();
	Результат.СуществующиеЗаписи = РезультатЗапроса[1].Выгрузить();
	Результат.Признаки = РезультатЗапроса[2].Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаСервере 
Процедура СоздатьЭлементыПризнакиНоменклатуры()
	
	КешДанных = ПостроитьКешДанныхДляТаблицыПризнаков(СозданиеПризнакиНоменклатуры);
	ВсеПодразделенияБезПрификса = ПолучитьВсеПодразделенияБезПрификса();

	Для каждого СтрокаПризнакиНоменклатуры Из СозданиеПризнакиНоменклатуры Цикл
		РезультатПодготовки = ПодготовитьДанныеСтрокиПризнакаДляЗаписи(СтрокаПризнакиНоменклатуры, КешДанных, ВсеПодразделенияБезПрификса);
		Если РезультатПодготовки.ТекстОшибки <> "" Тогда
			СтрокаПризнакиНоменклатуры.Создано = Ложь;
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.бит_ЗначенияПризнаковНоменклатуры.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.бит_Номенклатура = РезультатПодготовки.СсылкаНоменклатура;
		МенеджерЗаписи.бит_Признак = РезультатПодготовки.СсылкаПризнак;
		МенеджерЗаписи.бит_ПризнакСертификации = РезультатПодготовки.СсылкаПризнак.бит_ПризнакСертификации;
		МенеджерЗаписи.бит_Значение = РезультатПодготовки.ЗначениеДляЗаписи;
		
		Попытка	
			МенеджерЗаписи.Записать();  
			СтрокаПризнакиНоменклатуры.Создано = Истина;
			СтрокаПризнакиНоменклатуры.Предупреждение = Ложь;
		Исключение 
			СтрокаПризнакиНоменклатуры.Создано = Ложь;
		КонецПопытки;	
		
	КонецЦикла;	
	//ВсеПодразделенияБезПрификса = ПолучитьВсеПодразделенияБезПрификса();
	//
	//Для каждого СтрокаПризнакиНоменклатуры Из СозданиеПризнакиНоменклатуры Цикл
	//	
	//	// Проверяем, что все необходимые данные заполнены
	//	Если НЕ ЗначениеЗаполнено(СтрокаПризнакиНоменклатуры.бит_Номенклатура) 
	//		ИЛИ НЕ ЗначениеЗаполнено(СтрокаПризнакиНоменклатуры.бит_Признак) Тогда
	//		СтрокаПризнакиНоменклатуры.Создано = Ложь;
	//		СтрокаПризнакиНоменклатуры.Предупреждение = Истина;
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	// Создаем новый менеджер записи для каждой строки
	//	МенеджерЗаписи = РегистрыСведений.бит_ЗначенияПризнаковНоменклатуры.СоздатьМенеджерЗаписи();
	//	
	//	// Заполняем реквизиты
	//	МенеджерЗаписи.бит_Номенклатура = СтрокаПризнакиНоменклатуры.бит_Номенклатура;
	//	МенеджерЗаписи.бит_Признак = СтрокаПризнакиНоменклатуры.бит_Признак;
	//	МенеджерЗаписи.бит_Значение = СтрокаПризнакиНоменклатуры.бит_Значение;
	//	МенеджерЗаписи.бит_ПризнакСертификации = МенеджерЗаписи.бит_Признак.бит_ПризнакСертификации;
	//	
	//	// Устанавливаем период (если регистр сведений периодический)
	//	// МенеджерЗаписи.Период = ТекущаяДата();
	//	
	//	Попытка	
	//		МенеджерЗаписи.Записать();  
	//		СтрокаПризнакиНоменклатуры.Создано = Истина;
	//		СтрокаПризнакиНоменклатуры.Предупреждение = Ложь;
	//	Исключение
	//		СтрокаПризнакиНоменклатуры.Создано = Ложь;
	//		СтрокаПризнакиНоменклатуры.Предупреждение = Истина;
	//		// При необходимости записать текст ошибки
	//		// СтрокаПризнакиНоменклатуры.Ошибка = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	//		Продолжить;
	//	КонецПопытки;	
	//	
	//КонецЦикла;	
	
	// Настройка условного оформления для таблицы СозданиеПризнакиНоменклатуры
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеПризнакиНоменклатуры.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеПризнакиНоменклатуры.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеПризнакиНоменклатуры.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьЗначениеПризнака(СтрокаПризнакиНоменклатуры, бит_Признак, бит_Номенклатура, ВсеПодразделенияБезПрификса)
	
	Если Объект.ИдентификаторСправочника = "ПризнакиНоменклатуры" Тогда  
		бит_Значение = ПолучитьЗначениеПризнакаНоменкллатуры(СтрокаПризнакиНоменклатуры,
																бит_Признак, бит_Номенклатура, ВсеПодразделенияБезПрификса); 
	ИначеЕсли Объект.ИдентификаторСправочника = "ПризнакиОтходов" Тогда  
		бит_Значение = ПолучитьЗначениеПризнакаОтход(СтрокаПризнакиНоменклатуры, 
																бит_Признак, бит_Номенклатура, ВсеПодразделенияБезПрификса);	
	ИначеЕсли Объект.ИдентификаторСправочника = "ПризнакиТара" Тогда 
		бит_Значение = ПолучитьЗначениеПризнакаТара(СтрокаПризнакиНоменклатуры, 
																бит_Признак, бит_Номенклатура, ВсеПодразделенияБезПрификса);	
	КонецЕсли;
	
	Возврат бит_Значение;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеПризнакаОтход(СтрокаПризнакиНоменклатуры, бит_Признак, бит_Номенклатура, ВсеПодразделенияБезПрификса)
		
	Если СтрокаПризнакиНоменклатуры.КодПризнака = "003/00" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "10/06"  
		Тогда
		бит_Значение = Истина;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "CEXV_OSNMA" Тогда
		ПараметрыОтбора = Новый Структура; 
		Если СтрокаПризнакиНоменклатуры.ЗначениеПризнака = "" Тогда
			бит_Значение = Неопределено;
		Иначе
			ПараметрыОтбора.Вставить("Код",Число(СтрокаПризнакиНоменклатуры.ЗначениеПризнака)); 
			Значение = ВсеПодразделенияБезПрификса.НайтиСтроки(ПараметрыОтбора);
			Если Значение.Количество() > 0 Тогда  
				бит_Значение = Значение[0].Ссылка;
			Иначе
				бит_Значение = Неопределено;
			КонецЕсли;
		КонецЕсли;
	 ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "ISP_OUTSID" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KODMAR"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KPROD" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "NAPR" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "RAZMER"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "TYPE_MAT"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "TYPE_VZOTX"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "VID_OTX"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "VIDIZ_OSNM"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "WISP"
		Тогда
		ПараметрыОтбора = Новый Структура;
		Отбор = Новый Структура;  
		ДлинаНаименования = Метаданные.Справочники.бит_ДополнительныеПризнакиНоменклатуры.ДлинаНаименования;
		НаименованиеДопПризнака = Лев(СтрокаПризнакиНоменклатуры.ЗначениеПризнака, ДлинаНаименования);

		Отбор.Вставить("Наименование", НаименованиеДопПризнака); 
		Отбор.Вставить("Владелец", бит_Признак[0].Значение);   
		ПараметрыОтбора.Вставить("Отбор", Отбор);
        Значение = Справочники.бит_ДополнительныеПризнакиНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если Значение = Неопределено Или Значение.Количество() = 0 Тогда
			ДополнительныйПризнак = Справочники.бит_ДополнительныеПризнакиНоменклатуры.СоздатьЭлемент();
			ДополнительныйПризнак.Наименование = СтрокаПризнакиНоменклатуры.ЗначениеПризнака;
			ДополнительныйПризнак.Владелец = бит_Признак[0].Значение; 
			ДополнительныйПризнак.Записать();
			Значение = ДополнительныйПризнак;
		КонецЕсли;
		бит_Значение = Значение;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "MARKA" Тогда
		Значение = Справочники.Марки.НайтиПоНаименованию(СтрокаПризнакиНоменклатуры.ЗначениеПризнака);	
		Если Значение = Неопределено Или Значение.Пустая() Тогда
			Марка = Справочники.Марки.СоздатьЭлемент();
			Марка.Наименование = СтрокаПризнакиНоменклатуры.ЗначениеПризнака;
			Марка.Записать();
			Значение = Марка.Ссылка;
		КонецЕсли;
		НоменклатураТ = бит_Номенклатура.ПолучитьОбъект();
		НоменклатураТ.Марка = Значение;
		НоменклатураТ.Записать();
		бит_Значение = Значение;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "MKF2"  
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "SECH"
		 Тогда 
		бит_Значение = СтрокаПризнакиНоменклатуры.ЗначениеПризнака; 
	Иначе
		бит_Значение = Неопределено;
	КонецЕсли;	
	
	Возврат бит_Значение;
	
КонецФункции	
	
&НаСервере
Функция ПолучитьЗначениеПризнакаНоменкллатуры (СтрокаПризнакиНоменклатуры, бит_Признак, бит_Номенклатура, ВсеПодразделенияБезПрификса) 
		
	Если СтрокаПризнакиНоменклатуры.КодПризнака = "10/01"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "10/06" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "PM"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "PMDAV" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "XR" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "АЛЮМИНИЙ" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "МЕДЬ" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "СТАЛЬ"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "БРУТТО"
		Тогда
		бит_Значение = Истина;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "ORGAN1" Тогда
		Если СтрокаПризнакиНоменклатуры.ЗначениеПризнака = "" Тогда
			бит_Значение = Ложь;
		Иначе 
			бит_Значение = Истина;
		КонецЕсли	
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "ANALOG" Тогда
		бит_Значение = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаПризнакиНоменклатуры.ЗначениеПризнака); 
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "OTD_MAT	" Тогда 
		 Подразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию(СтрокаПризнакиНоменклатуры.ЗначениеПризнака);
		 Если  Подразделение = Неопределено Тогда 
			бит_Значение = Справочники.СтруктураПредприятия.ПустаяСсылка();
		Иначе 
			бит_Значение = Подразделение;
		КонецЕсли;
	//ИначеЕсли //Или СтрокаПризнакиНоменклатуры.КодПризнака = "CEX2"
	//	//Или СтрокаПризнакиНоменклатуры.КодПризнака = "CEX3"
	//	//Или СтрокаПризнакиНоменклатуры.КодПризнака = "CEXV_OSNMA"
	//	Тогда
	//	ПараметрыОтбора = Новый Структура; 
	//	Если СтрокаПризнакиНоменклатуры.ЗначениеПризнака = "" Тогда
	//		бит_Значение = Неопределено;
	//	Иначе
	//		ПараметрыОтбора.Вставить("Код",Число(СтрокаПризнакиНоменклатуры.ЗначениеПризнака)); 
	//		Значение = ВсеПодразделенияБезПрификса.НайтиСтроки(ПараметрыОтбора);
	//		Если Значение.Количество() > 0 Тогда  
	//			бит_Значение = Значение[0].Ссылка;
	//		Иначе
	//			бит_Значение = Неопределено;
	//		КонецЕсли;
	//	КонецЕсли;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "GOST" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "GR" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "GR1 (KKSS)"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "GR6"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KAT_UNIV"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KODGR6"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KODMAR"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KODRAZ"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KPROD"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "RAZMER"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "TYPE_MAT"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "WISP"
		Тогда
		ПараметрыОтбора = Новый Структура;
		Отбор = Новый Структура;   
		ДлинаНаименования = Метаданные.Справочники.бит_ДополнительныеПризнакиНоменклатуры.ДлинаНаименования;
		НаименованиеДопПризнака = Лев(СтрокаПризнакиНоменклатуры.ЗначениеПризнака, ДлинаНаименования);


		Отбор.Вставить("Наименование", НаименованиеДопПризнака); 
		Отбор.Вставить("Владелец", бит_Признак);   
		ПараметрыОтбора.Вставить("Отбор", Отбор);
        Значение = Справочники.бит_ДополнительныеПризнакиНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если Значение = Неопределено Или Значение.Количество() = 0 Тогда
			ДополнительныйПризнак = Справочники.бит_ДополнительныеПризнакиНоменклатуры.СоздатьЭлемент();
			ДополнительныйПризнак.Наименование = СтрокаПризнакиНоменклатуры.ЗначениеПризнака;
			Если ТипЗнч(бит_Признак) = Тип("Структура") Тогда
				ДополнительныйПризнак.Владелец = бит_Признак[0].Значение;
			Иначе
				ДополнительныйПризнак.Владелец = бит_Признак;
			КонецЕсли;
			ДополнительныйПризнак.Записать();
			Значение = ДополнительныйПризнак;
		КонецЕсли;
		бит_Значение = Значение;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "MARKA" Тогда
		Если ЗначениеЗаполнено(СтрокаПризнакиНоменклатуры.ЗначениеПризнака) Тогда
			Значение = Справочники.Марки.НайтиПоНаименованию(СтрокаПризнакиНоменклатуры.ЗначениеПризнака);	
			Если Значение = Неопределено Или Значение.Пустая() Тогда
				Марка = Справочники.Марки.СоздатьЭлемент();
				Марка.Наименование = СтрокаПризнакиНоменклатуры.ЗначениеПризнака;
				Марка.Записать();
				Значение = Марка.Ссылка;
			КонецЕсли; 
			НоменклатураТ = бит_Номенклатура.ПолучитьОбъект();
			НоменклатураТ.Марка = Значение;
			НоменклатураТ.Записать();
		Иначе
			Значение = Справочники.Марки.ПустаяСсылка();
		КонецЕсли;
		бит_Значение = Значение;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "PRP" Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаПризнакиНоменклатуры.ЗначениеПризнака);	
		Если Не(Номенклатура.Пустая()) Тогда
			НоменклатураЭлемент = Номенклатура.ПолучитьОбъект();
			НоменклатураЭлемент.ПометкаУдаления = Истина;
			НоменклатураЭлемент.Записать();
			бит_Значение = Ложь;
		Иначе бит_Значение = Истина;	
		КонецЕсли;
		//НоменклатураТ = бит_Номенклатура.ПолучитьОбъект();
		//НоменклатураТ.ПометкаУдаления = Истина;
		//НоменклатураТ.Записать();
    ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "CODE" Тогда
		бит_Значение = СтрокаПризнакиНоменклатуры.ЗначениеПризнака;
		Попытка
		МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = бит_Номенклатура;
		МенеджерЗаписи.Штрихкод = бит_Значение;
		МенеджерЗаписи.Упаковка = бит_Номенклатура.ЕдиницаИзмерения;
		МенеджерЗаписи.Записать(); 
		Исключение
		КонецПопытки;
		
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "04082022"  
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KODDOP_PF"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KODMAT_ZAG"  
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KOEFF_PROD"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KPR"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "OTH_PROV"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "VNCODE"
	Тогда 
		бит_Значение = СтрокаПризнакиНоменклатуры.ЗначениеПризнака; 
	Иначе
		бит_Значение = Неопределено;
	КонецЕсли;	
	
	Возврат бит_Значение;
	
КонецФункции	
	
&НаСервере
Функция	ПолучитьЗначениеПризнакаТара(СтрокаПризнакиНоменклатуры, бит_Признак, бит_Номенклатура, ВсеПодразделенияБезПрификса)
	
	Если СтрокаПризнакиНоменклатуры.КодПризнака = "003/00" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "10/01"  
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "10/04" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "10/09"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "11" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "4"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "41/01"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "41/02" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MULTIL"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "TZR" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "БРУТТО" 
		Тогда
		бит_Значение = Истина;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "ANALOG" Тогда
		бит_Значение = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаПризнакиНоменклатуры.ЗначениеПризнака); 
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "CEX1" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "CEXV_OSNMA"
		Тогда
		ПараметрыОтбора = Новый Структура; 
		Если СтрокаПризнакиНоменклатуры.ЗначениеПризнака = "" Тогда
			бит_Значение = Неопределено;
		Иначе
			ПараметрыОтбора.Вставить("Код",Число(СтрокаПризнакиНоменклатуры.ЗначениеПризнака)); 
			Значение = ВсеПодразделенияБезПрификса.НайтиСтроки(ПараметрыОтбора);
			Если Значение.Количество() > 0 Тогда  
				бит_Значение = Значение[0].Ссылка;
			Иначе
				бит_Значение = Неопределено;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "GR6" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "ISP_NAPR"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "ISP_OUTSID"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KAT_UNIV" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KODGR6"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KODMAR"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KODRAZ"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KPROD" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MATERIALPF"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "RAZMER"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "TYPE_MAT"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "VIDIZ_OSNM"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "WISP"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "PGR"
		Тогда
		ПараметрыОтбора = Новый Структура;
		Отбор = Новый Структура; 
		ДлинаНаименования = Метаданные.Справочники.бит_ДополнительныеПризнакиНоменклатуры.ДлинаНаименования;
		НаименованиеДопПризнака = Лев(СтрокаПризнакиНоменклатуры.ЗначениеПризнака, ДлинаНаименования);


		Отбор.Вставить("Наименование", НаименованиеДопПризнака); 
		Отбор.Вставить("Владелец", бит_Признак[0].Значение);   
		ПараметрыОтбора.Вставить("Отбор", Отбор);
        Значение = Справочники.бит_ДополнительныеПризнакиНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если Значение = Неопределено Или Значение.Количество() = 0 Тогда
			ДополнительныйПризнак = Справочники.бит_ДополнительныеПризнакиНоменклатуры.СоздатьЭлемент();
			ДополнительныйПризнак.Наименование = СтрокаПризнакиНоменклатуры.ЗначениеПризнака;
			ДополнительныйПризнак.Владелец = бит_Признак[0].Значение; 
			ДополнительныйПризнак.Записать();
			Значение = ДополнительныйПризнак;
		КонецЕсли;
		бит_Значение = Значение;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "MARKA" Тогда
		Значение = Справочники.Марки.НайтиПоНаименованию(СтрокаПризнакиНоменклатуры.ЗначениеПризнака);	
		Если Значение = Неопределено Или Значение.Пустая() Тогда
			Марка = Справочники.Марки.СоздатьЭлемент();
			Марка.Наименование = СтрокаПризнакиНоменклатуры.ЗначениеПризнака;
			Марка.Записать();
			Значение = Марка.Ссылка;
		КонецЕсли; 
		НоменклатураТ = бит_Номенклатура.ПолучитьОбъект();
		НоменклатураТ.Марка = Значение;
		НоменклатураТ.Записать();
		бит_Значение = Значение;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "PRP" Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаПризнакиНоменклатуры.ЗначениеПризнака);	
		Если Не(Номенклатура.Пустая()) Тогда
			НоменклатураЭлемент = Номенклатура.ПолучитьОбъект();
			НоменклатураЭлемент.ПометкаУдаления = Истина;
			НоменклатураЭлемент.Записать();
			бит_Значение = Ложь;
		Иначе бит_Значение = Истина;	
		КонецЕсли;
	ИначеЕсли СтрокаПризнакиНоменклатуры.КодПризнака = "DIAMETRSB"  
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "GOST_NAME" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "LIMIT"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "KPR" 
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MKF"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MKF1"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MKF2"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MKF3"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MKF4"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MKF5"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MKF6"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MKF7"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MKF8"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "MKF9"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "NETTO_NOM"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "OTD_MAT"
		Или СтрокаПризнакиНоменклатуры.КодПризнака = "OUTNAM"
		Тогда 
		бит_Значение = СтрокаПризнакиНоменклатуры.ЗначениеПризнака; 
	Иначе
		бит_Значение = Неопределено;
	КонецЕсли;	
	
	Возврат бит_Значение;
	
КонецФункции	

&НаСервере 
Процедура ПроверитьЭлементыПризнакиНоменклатуры()
	
	//ВсеПодразделенияБезПрификса = ПолучитьВсеПодразделенияБезПрификса();
	
	Для каждого СтрокаПризнакиНоменклатуры Из ПроверкиПризнакиНоменклатуры Цикл   
		
		МенеджерЗаписи = РегистрыСведений.бит_ЗначенияПризнаковНоменклатуры.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаПризнакиНоменклатуры, "бит_Номенклатура,бит_Признак,бит_Значение"); 
		МенеджерЗаписи.бит_ПризнакСертификации = МенеджерЗаписи.бит_Признак.бит_ПризнакСертификации;
		
		Попытка	
			МенеджерЗаписи.Записать();  
			СтрокаПризнакиНоменклатуры.Изменено = Истина;
		Исключение
			СтрокаПризнакиНоменклатуры.Изменено = Ложь;
		КонецПопытки;

		//ПараметрыОтбора = Новый Структура;
		//Отбор = Новый Структура;
		//Отбор.Вставить("Наименование", СтрокаПризнакиНоменклатуры.Наименование); 
		//Отбор.Вставить("Артикул", СтрокаПризнакиНоменклатуры.Код);   
		//ПараметрыОтбора.Вставить("Отбор", Отбор);
		//бит_Номенклатура = Справочники.Номенклатура.ПолучитьДанныеВыбора(ПараметрыОтбора);
		//Если Не (бит_Номенклатура = Неопределено
		//	Или бит_Номенклатура.Количество() = 0) Тогда 
		//	НоменклатураТ = бит_Номенклатура[0].Значение;
		//	НоменклатураТ = НоменклатураТ.Значение;
		//	Если  НоменклатураТ.Артикул <> СтрокаПризнакиНоменклатуры.Код Тогда
		//		НоменклатураТ = бит_Номенклатура[1].Значение;
		//		НоменклатураТ = НоменклатураТ.Значение;
		//		Если  НоменклатураТ.Артикул <> СтрокаПризнакиНоменклатуры.Код Тогда
		//			НоменклатураТ = бит_Номенклатура[2].Значение;
		//			НоменклатураТ = НоменклатураТ.Значение;
		//			Если  НоменклатураТ.Артикул <> СтрокаПризнакиНоменклатуры.Код Тогда 
		//				Продолжить;
		//			КонецЕсли;	
		//		КонецЕсли;	
		//	КонецЕсли;
		//КонецЕсли;

		//
		//ПараметрыОтбора = Новый Структура;
		//Отбор = Новый Структура;
		////Отбор.Вставить("Наименование", СтрокаПризнакиНоменклатуры.НаименованиеПризнака); 
		//Отбор.Вставить("Код", СтрокаПризнакиНоменклатуры.КодПризнака);   
		//ПараметрыОтбора.Вставить("Отбор", Отбор);
		//бит_Признак = ПланыВидовХарактеристик.бит_ПризнакиНоменклатуры.ПолучитьДанныеВыбора(ПараметрыОтбора);
		//
		//Если бит_Признак = Неопределено
		//	Или бит_Признак.Количество() = 0 Тогда 
		//	Продолжить;
		//КонецЕсли;
		//
		//бит_Значение = ПолучитьЗначениеПризнака(СтрокаПризнакиНоменклатуры, бит_Признак, НоменклатураТ, ВсеПодразделенияБезПрификса); 
		//
		//Если бит_Значение <> Неопределено Тогда 
		//	Если ТипЗнч(бит_Значение) = Тип("СправочникСсылка.ПодразделенияОрганизаций")
		//		//Или ТипЗнч(бит_Значение) = Тип("СправочникСсылка.Номенклатура") 
		//		Или ТипЗнч(бит_Значение) = Тип("СправочникСсылка.бит_ДополнительныеПризнакиНоменклатуры") 
		//		//Или ТипЗнч(бит_Значение) = Тип("СправочникСсылка.Марки")
		//		Тогда
		//		Если бит_Значение.Пустая() Тогда 
		//			Продолжить;
		//		КонецЕсли;
		//	КонецЕсли;
		//Иначе 		
		//	Продолжить;
		//КонецЕсли; 
		//		  
		//МенеджерЗаписи = РегистрыСведений.бит_ЗначенияПризнаковНоменклатуры.СоздатьМенеджерЗаписи();
		//
		//МенеджерЗаписи.бит_Номенклатура = НоменклатураТ;
		//МенеджерЗаписи.бит_Признак = бит_Признак[0].Значение;
		//МенеджерЗаписи.бит_ПризнакСертификации = МенеджерЗаписи.бит_Признак.бит_ПризнакСертификации;
		//МенеджерЗаписи.бит_Значение = бит_Значение;
		//
		//Попытка	
		//	МенеджерЗаписи.Записать();  
		//	СтрокаПризнакиНоменклатуры.Изменено = Истина;
		//Исключение
		//	СтрокаПризнакиНоменклатуры.Изменено = Ложь;
		//КонецПопытки;	
		
	КонецЦикла;	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиПризнакиНоменклатуры.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиПризнакиНоменклатуры.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.ПроверкиПризнакиНоменклатуры.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПризнакиНоменклатуры(Команда)
	
	ЗаполнитьПризнакиНоменклатурыНаСервере();

КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьПризнакиНоменклатурыНаСервере()
	
	СтруктураПризнаков = ПолучитьСтруктуруПризнаковНоменклатуры();
	
#Область ОписаниеТиповПризнаков	
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
    ОписаниеНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура"); 
	ОписаниеСтруктураПредприятия = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
	ОписаниеДопЗначение = Новый ОписаниеТипов("СправочникСсылка.бит_ДополнительныеПризнакиНоменклатуры");
	КвалификаторЧисла2_2 = Новый КвалификаторыЧисла(4,2);
	ОписаниеЧисло2_2 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла2_2);
	КвалификаторЧисла2_3 = Новый КвалификаторыЧисла(5,3);
	ОписаниеЧисло2_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла2_3);
    КвалификаторЧисла4_0 = Новый КвалификаторыЧисла(4,0);
	ОписаниеЧисло4_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла4_0);
	КвалификаторЧисла4_2 = Новый КвалификаторыЧисла(6,2);
	ОписаниеЧисло4_2 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла4_2);
	КвалификаторЧисла4_3 = Новый КвалификаторыЧисла(7,3);
	ОписаниеЧисло4_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла4_3);
	КвалификаторЧисла3_0 = Новый КвалификаторыЧисла(3,0);
	ОписаниеЧисло3_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла3_0);
	КвалификаторЧисла3_3 = Новый КвалификаторыЧисла(6,3);
	ОписаниеЧисло3_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла3_3);
	КвалификаторЧисла3_5 = Новый КвалификаторыЧисла(8,5);
	ОписаниеЧисло3_5 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла3_5);
	КвалификаторЧисла3_10 = Новый КвалификаторыЧисла(13,10);
	ОписаниеЧисло3_10 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла3_10);
	КвалификаторЧисла3_20 = Новый КвалификаторыЧисла(23,20);
	ОписаниеЧисло3_20 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла3_20); 
	КвалификаторЧисла5_0 = Новый КвалификаторыЧисла(5,0);
	ОписаниеЧисло5_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла5_0); 
	КвалификаторЧисла5_2 = Новый КвалификаторыЧисла(7,2);
	ОписаниеЧисло5_2 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла5_2); 
	КвалификаторЧисла5_3 = Новый КвалификаторыЧисла(8,3);
	ОписаниеЧисло5_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла5_3); 
	КвалификаторЧисла5_6 = Новый КвалификаторыЧисла(11,6);
	ОписаниеЧисло5_6 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла5_6);
	КвалификаторЧисла9_2 = Новый КвалификаторыЧисла(11,2);
	ОписаниеЧисло9_2 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла9_2); 
	КвалификаторЧисла10_0 = Новый КвалификаторыЧисла(10,0);
	ОписаниеЧисло10_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла10_0); 
	КвалификаторЧисла10_3 = Новый КвалификаторыЧисла(13,3);
	ОписаниеЧисло10_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла10_3);
   	КвалификаторЧисла10_20 = Новый КвалификаторыЧисла(30,20);
	ОписаниеЧисло10_20 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла10_20);
	КвалификаторЧисла32_0 = Новый КвалификаторыЧисла(32,0);
	ОписаниеЧисло32_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла32_0);
	КвалификаторыСтроки100 = Новый КвалификаторыСтроки(100);
	ОписаниеСтроки100 = Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки100); 
	КвалификаторыСтроки250 = Новый КвалификаторыСтроки(250);
	ОписаниеСтроки250 = Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки250);
	КвалификаторыСтроки50 = Новый КвалификаторыСтроки(50);
	ОписаниеСтроки50 = Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки50);
	КвалификаторыСтроки20 = Новый КвалификаторыСтроки(20);
	ОписаниеСтроки20 = Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки20); 
	КвалификаторыСтроки150 = Новый КвалификаторыСтроки(150);
	ОписаниеСтроки150 = Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки150);
	КвалификаторыСтроки200 = Новый КвалификаторыСтроки(200);
	ОписаниеСтроки200 = Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки200);
	КвалификаторыСтроки300 = Новый КвалификаторыСтроки(300);   
	ОписаниеСтроки300 = Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки300);
	ОписаниеМарки = Новый ОписаниеТипов("СправочникСсылка.Марки");
#КонецОбласти

#Область ЗаполненияПризнаков	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "04082022";
	Признак.Наименование = "Пусковой конец (отходы), кг";
	Признак.ТипЗначения = ОписаниеЧисло4_3;
	Признак.бит_ПризнакСертификации = Ложь; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "10/01";
	Признак.Наименование = "ОСНОВНЫЕ МАТЕРИАЛЫ";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь; 
	
	//Признак = СтруктураПризнаков.Добавить();
	//Признак.Код = "10/04";
	//Признак.Наименование = "ТАРА";
	//Признак.ТипЗначения = ОписаниеБулево;
	//Признак.бит_ПризнакСертификации = Ложь; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "10/06";
	Признак.Наименование = "ПРОЧИЕ МАТЕРИАЛЫ";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь;
		
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "ANALOG";
	Признак.Наименование = "Аналог марки готовой продукции";
	Признак.ТипЗначения = ОписаниеНоменклатура;
	Признак.бит_ПризнакСертификации = Ложь; 

	Признак = СтруктураПризнаков.Добавить();
	Признак.Код = "COND_CORE";
	Признак.Наименование = "Токопроводящая жила";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь;  
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "CODE";
	Признак.Наименование = "Штрихкод";
	Признак.ТипЗначения = ОписаниеСтроки150;
	Признак.бит_ПризнакСертификации = Ложь;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "GOST";
	Признак.Наименование = "Стандарт";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Истина; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "GR";
	Признак.Наименование = "АГруппа";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Ложь;
	    
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "GR1 (KKSS)";
	Признак.Наименование = "АЭмаль/Обмотка";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Ложь; 

	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "GR6";
	Признак.Наименование = "Группа 6";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Ложь; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "KAT_UNIV";
	Признак.Наименование = "Катушка-типопредставитель";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Ложь;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "KODDOP_PF";
	Признак.Наименование = "Код дополнительного полуфабриката";
	Признак.ТипЗначения = ОписаниеСтроки50;
	Признак.бит_ПризнакСертификации = Ложь;	

	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "KODGR6";
	Признак.Наименование = "Код Группы 6";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Ложь;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "KODMAR";
	Признак.Наименование = "Код марки готовой продукции";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Ложь; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "KODMAT_ZAG";
	Признак.Наименование = "Код материала заготовки";
	Признак.ТипЗначения = ОписаниеСтроки20;
	Признак.бит_ПризнакСертификации = Ложь;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "KODRAZ";
	Признак.Наименование = "Код размера готовой продукции";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Ложь;	
	 
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "KOEFF_PROD";
	Признак.Наименование = "Коэффициент продажи";
	Признак.ТипЗначения = ОписаниеЧисло3_3;
	Признак.бит_ПризнакСертификации = Ложь;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "KPR";
	Признак.Наименование = "Коэффициент приведения";
	Признак.ТипЗначения = ОписаниеЧисло3_3;
	Признак.бит_ПризнакСертификации = Ложь;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "KPROD";
	Признак.Наименование = "Тип продукта";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Ложь; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "MARKA";
	Признак.Наименование = "Марка готовой продукции";
	Признак.ТипЗначения = ОписаниеМарки;
	Признак.бит_ПризнакСертификации = Ложь;
		
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "ORGAN1";
	Признак.Наименование = "ВОЛМАГ";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "OTD_MAT";
	Признак.Наименование = "Подразделение для материала";
	Признак.ТипЗначения = ОписаниеСтруктураПредприятия;
	Признак.бит_ПризнакСертификации = Ложь; 
	 
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "OTH_PROV";
	Признак.Наименование = "Процент отходов на медную проволоку";
	Признак.ТипЗначения = ОписаниеЧисло9_2;
	Признак.бит_ПризнакСертификации = Ложь;
		
	//Признак = СтруктураПризнаков.Добавить();
	//Признак.Код = "OP_IE_TARA";
	//Признак.Наименование = "Описание тары";
	//Признак.ТипЗначения = ОписаниеСтроки200;
	//Признак.бит_ПризнакСертификации = Ложь; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "PM";
	Признак.Наименование = "Признак материала";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "PRP";
	Признак.Наименование = "Признак продукции";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "PMDAV";
	Признак.Наименование = "Признак давальческого материала";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь;  
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "RAZMER";
	Признак.Наименование = "Размер готовой продукции";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Истина;
	
	//Признак = СтруктураПризнаков.Добавить();
	//Признак.Код = "RazmTara";
	//Признак.Наименование = "Размер тары для количественного учета";
	//Признак.ТипЗначения = ОписаниеДопЗначение;
	//Признак.бит_ПризнакСертификации = Ложь; 
	
	//Признак = СтруктураПризнаков.Добавить();
	//Признак.Код = "TARA_CODE";
	//Признак.Наименование = "Код типа тары";
	//Признак.ТипЗначения = ОписаниеДопЗначение;
	//Признак.бит_ПризнакСертификации = Ложь;
	// 
	//Признак = СтруктураПризнаков.Добавить();
	//Признак.Код = "TIP_TARA";
	//Признак.Наименование = "Тип тары";
	//Признак.ТипЗначения = ОписаниеДопЗначение;
	//Признак.бит_ПризнакСертификации = Ложь;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "TYPE_MAT";
	Признак.Наименование = "Тип материала";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Истина;
	 
	//Признак = СтруктураПризнаков.Добавить();
	//Признак.Код = "UNICODE_T";
	//Признак.Наименование = "Код изделия унифицированный";
	//Признак.ТипЗначения = ОписаниеДопЗначение;
	//Признак.бит_ПризнакСертификации = Ложь;
	// 
	//Признак = СтруктураПризнаков.Добавить();
	//Признак.Код = "VES";
	//Признак.Наименование = "Вес_тары";
	//Признак.ТипЗначения = ОписаниеЧисло4_3;
	//Признак.бит_ПризнакСертификации = Ложь;
	 
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "VNCODE";
	Признак.Наименование = "Внешний код";
	Признак.ТипЗначения = ОписаниеСтроки50;
	Признак.бит_ПризнакСертификации = Истина;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "WISP";
	Признак.Наименование = "Вид исполнения ГП";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	Признак.бит_ПризнакСертификации = Истина; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "XR";
	Признак.Наименование = "Ходовой размер";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "АЛЮМИНИЙ";
	Признак.Наименование = "АЛЮМИНИЙ";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "МЕДЬ";
	Признак.Наименование = "МЕДЬ";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "СТАЛЬ";
	Признак.Наименование = "СТАЛЬ";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь; 
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "БРУТТО";
	Признак.Наименование = "БРУТТО";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь;
	
	Признак = СтруктураПризнаков.Добавить();
    Признак.Код = "Исп_Агр_Кф";
	Признак.Наименование = "Использование агрегирующего коэфициента";
	Признак.ТипЗначения = ОписаниеБулево;
	Признак.бит_ПризнакСертификации = Ложь;
#КонецОбласти
		
	СоздатьПризнакиНоменклатуры(СтруктураПризнаков);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСтруктуруПризнаковНоменклатуры()        
	
	Признаки = Новый ТаблицаЗначений;  
	КвалификаторыСтроки = Новый КвалификаторыСтроки(10);
	Признаки.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки));
	КвалификаторыСтроки = Новый КвалификаторыСтроки(150);
    Признаки.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки)); 
	Признаки.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("ОписаниеТипов"));
    Признаки.Колонки.Добавить("бит_ПризнакСертификации", Новый ОписаниеТипов("Булево")); 
			
	Возврат Признаки;

КонецФункции	

&НаСервере
Функция ПолучитьВсеПодразделенияБезПрификса();
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СОКРЛП(СтруктураПредприятия.Код) КАК Код,
		|	СтруктураПредприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаПодразделений = Новый ТаблицаЗначений;
	КвалификаторЧисла4_0 = Новый КвалификаторыЧисла(4,2);
	ТаблицаПодразделений.Колонки.Добавить("Код", Новый ОписаниеТипов("Число", , , КвалификаторЧисла4_0));
	ТаблицаПодразделений.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	Для Каждого Запись Из РезультатЗапроса Цикл
		
		Значение = ТаблицаПодразделений.Добавить();
        //Значение.Код = Число(ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Запись.Код));
		Значение.Код = Запись.Код; 
		Значение.Ссылка = Запись.Ссылка;
		
	 КонецЦикла; 
		
	Возврат ТаблицаПодразделений; 
	
КонецФункции

&НаСервере 
Процедура СоздатьПризнакиНоменклатуры(СтруктураПризнаков)
	
	Для каждого Признак Из СтруктураПризнаков Цикл    
		Если ПланыВидовХарактеристик.бит_ПризнакиНоменклатуры.НайтиПоКоду(Признак.Код).Пустая() Тогда 
			Элемент = ПланыВидовХарактеристик.бит_ПризнакиНоменклатуры.СоздатьЭлемент();
			Элемент.Код = Признак.Код;
			Элемент.Наименование = Признак.Наименование;
	        Элемент.ТипЗначения = Признак.ТипЗначения;
			Элемент.бит_ПризнакСертификации = Признак.бит_ПризнакСертификации;  
			Попытка	
				Элемент.Записать(); 
			Исключение
				ТекстСообщения = "Не удалось создать признак " +  Элемент.Наименование;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	
#КонецОбласти

#Область СозданияАтрибутыКонтрагентов
&НаКлиенте 
Процедура ДействияСТаблицамиАтрибутыКонтрагентов(ПредставлениеИсточника)
	
	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникАтрибутыКонтрагентов.Видимость 	= Истина;
		ЗаполнитьТаблицуИсточникАтрибутыКонтрагентов(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда 
		Элементы.СозданиеАтрибутыКонтрагентов.Видимость 	= Истина;
		Элементы.ПроверкиАтрибутыКонтрагентов.Видимость 	= Истина;
		Элементы.ОшибокАтрибутыКонтрагентов.Видимость 	= Истина;
		ЗаполнитьТаблицыПроверкиАтрибутыКонтрагентов();
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыАтрибутыКонтрагентов();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыАтрибутыКонтрагентов();	
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.Контрагенты.ФормаСписка");
	Иначе
		Возврат;
	КонецЕсли; 
			
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТаблицуИсточникАтрибутыКонтрагентов(ПредставлениеИсточника)
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточникАтрибутыКонтрагентов = ИсточникАтрибутыКонтрагентов.Добавить();	 
		
		ТекстКолонки = ПредставлениеИсточника.Область(НомерСтроки, 3).Текст;
		СтрИсточникАтрибутыКонтрагентов.Наименование = ТекстКолонки;  
		СтрИсточникАтрибутыКонтрагентов.ИДКлиента = ПредставлениеИсточника.Область(НомерСтроки, 1).Текст;
	    СтрИсточникАтрибутыКонтрагентов.ИНН = ПредставлениеИсточника.Область(НомерСтроки, 2).Текст;
		СтрИсточникАтрибутыКонтрагентов.Код = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст;
		СтрИсточникАтрибутыКонтрагентов.НаименоваиеАтрибута = ПредставлениеИсточника.Область(НомерСтроки, 5).Текст;
		СтрИсточникАтрибутыКонтрагентов.Значение = ПредставлениеИсточника.Область(НомерСтроки, 6).Текст;
							
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникАтрибутыКонтрагентов.Удалить(СтрИсточникАтрибутыКонтрагентов);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиАтрибутыКонтрагентов()
	
	УсловноеОформление.Элементы.Очистить();
	
	МассивКонтрагентов = ИсточникАтрибутыКонтрагентов.Выгрузить( , "ИДКлиента");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.бит_ИДКлиента КАК ИДКлиента
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.бит_ИДКлиента В (&МассивКонтрагентов)
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЗначенияАтрибутовКонтрагентов.бит_Контрагент КАК Контрагент,
	|	бит_ЗначенияАтрибутовКонтрагентов.бит_Признак.Код КАК ПризнакКод,
	|	бит_ЗначенияАтрибутовКонтрагентов.бит_Значение КАК Значение,
	|	бит_ЗначенияАтрибутовКонтрагентов.бит_Контрагент.бит_ИДКлиента КАК ИДКлиента
	|ИЗ
	|	РегистрСведений.бит_ЗначенияАтрибутовКонтрагентов КАК бит_ЗначенияАтрибутовКонтрагентов
	|ГДЕ
	|	бит_ЗначенияАтрибутовКонтрагентов.бит_Контрагент.бит_ИДКлиента В(&МассивКонтрагентов)";
	
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаКонтрагенты = РезультатЗапроса[0].Выгрузить();
	ВыборкаАтрибут = РезультатЗапроса[1].Выгрузить();		
	ЗаполнениеТаблицАтрибутыКонтрагентов(ВыборкаКонтрагенты, ВыборкаАтрибут);
   
КонецПроцедуры

&НаСервере 
Процедура ЗаполнениеТаблицАтрибутыКонтрагентов(ВыборкаКонтрагенты, ВыборкаАтрибут)
			
	Для каждого СтрокаАтрибутыКонтрагентов Из ИсточникАтрибутыКонтрагентов Цикл
		
		ТекстСообщения = ""; 
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ИДКлиента", СтрокаАтрибутыКонтрагентов.ИДКлиента);
        ИдентификаторКонтрагента = ВыборкаКонтрагенты.НайтиСтроки(ПараметрыОтбора);
		Если ИдентификаторКонтрагента = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Контрагент не найден! "; 
		ИначеЕсли ИдентификаторКонтрагента.Количество() = 0 Тогда
			ТекстСообщения = ТекстСообщения + "Контрагент не найден! "
		Иначе	
			Если Не ИдентификаторКонтрагента[0].ИНН = СтрокаАтрибутыКонтрагентов.ИНН Тогда
			ТекстСообщения = ТекстСообщения + "Контрагент не найден! "  
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура;
	    ПараметрыОтбора.Вставить("ИДКлиента", СтрокаАтрибутыКонтрагентов.ИДКлиента); 
		ПараметрыОтбора.Вставить("ПризнакКод", СтрокаАтрибутыКонтрагентов.Код);
	    Атрибут = ВыборкаАтрибут.НайтиСтроки(ПараметрыОтбора);
					
		Если ТекстСообщения <> "" Тогда
			СтрокаОшибокАтрибутыКонтрагентов = ОшибокАтрибутыКонтрагентов.Добавить();
			ЗаполнитьСтрокуТаблицыАтрибутыКонтрагентов(СтрокаОшибокАтрибутыКонтрагентов, 
			СтрокаАтрибутыКонтрагентов);
			СтрокаОшибокАтрибутыКонтрагентов.Ошибка = ТекстСообщения;
		ИначеЕсли Атрибут.Количество() > 0 Тогда 
			СтрокаПроверкиАтрибутыКонтрагентов = ПроверкиАтрибутыКонтрагентов.Добавить(); 
			ЗаполнитьСтрокуТаблицыАтрибутыКонтрагентов(СтрокаПроверкиАтрибутыКонтрагентов, 
			СтрокаАтрибутыКонтрагентов);
		Иначе 
			СтрокаСозданиеАтрибутыКонтрагентов = СозданиеАтрибутыКонтрагентов.Добавить(); 
			ЗаполнитьСтрокуТаблицыАтрибутыКонтрагентов(СтрокаСозданиеАтрибутыКонтрагентов,
			СтрокаАтрибутыКонтрагентов);
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыАтрибутыКонтрагентов(СтрокаПриемник, СтрокаИсточник)  
		                 
	СтрокаПриемник.ИДКлиента = СтрокаИсточник.ИДКлиента; 
	СтрокаПриемник.ИНН = СтрокаИсточник.ИНН;
	СтрокаПриемник.Наименование = СтрокаИсточник.Наименование;
	СтрокаПриемник.Код = СтрокаИсточник.Код;
	СтрокаПриемник.НаименоваиеАтрибута = СтрокаИсточник.НаименоваиеАтрибута;
	СтрокаПриемник.Значение = СтрокаИсточник.Значение;
	
КонецПроцедуры

&НаСервере 
Процедура СоздатьЭлементыАтрибутыКонтрагентов()
	
	Для каждого СтрокаАтрибутыКонтрагентов Из СозданиеАтрибутыКонтрагентов Цикл
		
		бит_Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("бит_ИДКлиента", СтрокаАтрибутыКонтрагентов.ИДКлиента); 
		        	
		Если СтрокаАтрибутыКонтрагентов.Код = "OKVED"
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "VP1"
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "VP2"
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "VP3" 
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "VP4"
			Тогда
			ПараметрыОтбора = Новый Структура;
			Отбор = Новый Структура;
			Отбор.Вставить("Код", СтрокаАтрибутыКонтрагентов.Код);   
			ПараметрыОтбора.Вставить("Отбор", Отбор);
			бит_Атрибут = ПланыВидовХарактеристик.бит_ПризнакиКонтрагентов.ПолучитьДанныеВыбора(ПараметрыОтбора);
			Если бит_Атрибут = Неопределено
				Или бит_Атрибут.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;

			ДействияПоСтратегииАтрибут(СтрокаАтрибутыКонтрагентов, бит_Контрагент, бит_Атрибут);
		ИначеЕсли СтрокаАтрибутыКонтрагентов.Код = "BYH_PHONE"	
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "EMAIL"
			Тогда
			ДействияПоСтратегииКонтактнаяИнформация(СтрокаАтрибутыКонтрагентов, бит_Контрагент);
		ИначеЕсли СтрокаАтрибутыКонтрагентов.Код = "KPP"
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "KPP_FILIAL"
            ИЛИ СтрокаАтрибутыКонтрагентов.Код = "OGRN" 
			Тогда
			ДействияПоСтратегииИзменениеКонтрагента(СтрокаАтрибутыКонтрагентов, бит_Контрагент);
		КонецЕсли;
				
	КонецЦикла;	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеАтрибутыКонтрагентов.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеАтрибутыКонтрагентов.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для Каждого элПоля Из Элементы.СозданиеАтрибутыКонтрагентов.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;
			
КонецПроцедуры 

&НаСервере
Процедура ДействияПоСтратегииАтрибут(СтрокаАтрибутыКонтрагентов, бит_Контрагент, бит_Атрибут)
	
	бит_Значение = ПолучитьЗначениеАтрибута(СтрокаАтрибутыКонтрагентов, бит_Атрибут, бит_Контрагент); 
	
	Если бит_Значение <> Неопределено Тогда 
		Если ТипЗнч(бит_Значение) = Тип("СправочникСсылка.Номенклатура")    
			Или ТипЗнч(бит_Значение) = Тип("СправочникСсылка.ПодразделенияОрганизаций") 
			Или ТипЗнч(бит_Значение) = Тип("СправочникСсылка.бит_ДополнительныеАтрибутыКонтрагентов") 
			Или ТипЗнч(бит_Значение) = Тип("СправочникСсылка.Марки")
			Тогда
			Если НЕ (бит_Значение.Пустая()) Тогда 
				МенеджерЗаписи = РегистрыСведений.бит_ЗначенияАтрибутовКонтрагентов.СоздатьМенеджерЗаписи();
				
				МенеджерЗаписи.бит_Контрагент = бит_Контрагент;
				МенеджерЗаписи.бит_Признак = бит_Атрибут[0].Значение;
				МенеджерЗаписи.бит_Значение = бит_Значение;
				
				Попытка	
					МенеджерЗаписи.Записать();  
					СтрокаАтрибутыКонтрагентов.Создано = Истина;
				Исключение
					СтрокаАтрибутыКонтрагентов.Создано = Ложь;
				КонецПопытки;	
			КонецЕсли;  
		ИначеЕсли ТипЗнч(бит_Значение) = Тип("Строка") и бит_Значение <> "" Тогда 
			МенеджерЗаписи = РегистрыСведений.бит_ЗначенияАтрибутовКонтрагентов.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.бит_Контрагент = бит_Контрагент;
			МенеджерЗаписи.бит_Признак = бит_Атрибут[0].Значение;
			МенеджерЗаписи.бит_Значение = бит_Значение;
			
			Попытка	
				МенеджерЗаписи.Записать();  
				СтрокаАтрибутыКонтрагентов.Создано = Истина;
			Исключение
				СтрокаАтрибутыКонтрагентов.Создано = Ложь;
			КонецПопытки;	
			
		КонецЕсли;
	КонецЕсли;  
		
КонецПроцедуры	

&НаСервере
Процедура ДействияПоСтратегииКонтактнаяИнформация(СтрокаАтрибутыКонтрагентов, бит_Контрагент)
	
	Контрагент = бит_Контрагент.Партнер.ПолучитьОбъект();
    Партнер = бит_Контрагент.Партнер.ПолучитьОбъект();
	
	Если СтрокаАтрибутыКонтрагентов.Код = "BYH_PHONE" Тогда 
				 
		Контакты =  Партнер.КонтактнаяИнформация;
		ЗаписьНеУникальна = Ложь;
		Для Каждого Запись из Контакты Цикл
			
			Если Запись.Представление = СтрокаАтрибутыКонтрагентов.Значение Тогда
				ЗаписьНеУникальна = Истина;
			КонецЕсли;
		КонецЦикла;
		Если ЗаписьНеУникальна Тогда
			СтрокаОшибокАтрибутыКонтрагентов = ОшибокАтрибутыКонтрагентов.Добавить();
			ЗаполнитьСтрокуТаблицыАтрибутыКонтрагентов(СтрокаОшибокАтрибутыКонтрагентов, 
			СтрокаАтрибутыКонтрагентов);
			СтрокаОшибокАтрибутыКонтрагентов.Ошибка = "Телефон не уникален";	 
		Иначе	 
			КонтактнаяИнформация = Партнер.КонтактнаяИнформация.Добавить();
			КонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			КонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.бит_ТелефонБухгалтерииПартнера;
			КонтактнаяИнформация.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.бит_ТелефонБухгалтерииПартнера;
			Текст =  СтрокаАтрибутыКонтрагентов.Значение;
			Комментарий = "";
			КонтактнаяИнформация.Значение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Текст, КонтактнаяИнформация.Вид, Комментарий);
			КонтактнаяИнформация.Представление = Текст;
			ЗначенияПолей = УправлениеКонтактнойИнформациейЛокализация.КонтактнаяИнформацияИзJSONВXML(КонтактнаяИнформация.Значение, Перечисления.ТипыКонтактнойИнформации.Телефон);
			КонтактнаяИнформация.ЗначенияПолей = ЗначенияПолей;
			//ЗаполнитьРеквизитыТабличнойЧастиДляТелефона(КонтактнаяИнформация, СтрокаАтрибутыКонтрагентов.Значение);
			
			Попытка	
				Партнер.Записать();
				СтрокаАтрибутыКонтрагентов.Создано = Истина;
			Исключение
				СтрокаАтрибутыКонтрагентов.Создано = Ложь;
			КонецПопытки;
		КонецЕсли;
	ИначеЕсли СтрокаАтрибутыКонтрагентов.Код = "EMAIL" Тогда
		
		Контакты =  Партнер.КонтактнаяИнформация;
		ЗаписьНеУникальна = Ложь;
		Для Каждого Запись из Контакты Цикл
			
			Если Запись.Представление = СтрокаАтрибутыКонтрагентов.Значение Тогда
				ЗаписьНеУникальна = Истина;
			КонецЕсли;
		КонецЦикла;
		Если ЗаписьНеУникальна Тогда
			СтрокаОшибокАтрибутыКонтрагентов = ОшибокАтрибутыКонтрагентов.Добавить();
			ЗаполнитьСтрокуТаблицыАтрибутыКонтрагентов(СтрокаОшибокАтрибутыКонтрагентов, 
			СтрокаАтрибутыКонтрагентов);
			СтрокаОшибокАтрибутыКонтрагентов.Ошибка = "EMAIL не уникален";	 
		Иначе	 
			
			
			КонтактнаяИнформация = Партнер.КонтактнаяИнформация.Добавить();
			КонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			КонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
			
			КонтактнаяИнформация.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
			
			Текст =  СтрокаАтрибутыКонтрагентов.Значение;
			Комментарий = "";
			КонтактнаяИнформация.Значение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Текст, КонтактнаяИнформация.Вид, Комментарий);
			КонтактнаяИнформация.Представление = Текст;
			ЗначенияПолей = УправлениеКонтактнойИнформациейЛокализация.КонтактнаяИнформацияИзJSONВXML(КонтактнаяИнформация.Значение, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			КонтактнаяИнформация.ЗначенияПолей = ЗначенияПолей;
			Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(КонтактнаяИнформация.Представление, Ложь);
			
			Если Результат.Количество() > 0 Тогда
				КонтактнаяИнформация.АдресЭП = Результат[0].Адрес;
				
				Поз = СтрНайти(КонтактнаяИнформация.АдресЭП, "@");
				Если Поз <> 0 Тогда
					КонтактнаяИнформация.ДоменноеИмяСервера = Сред(КонтактнаяИнформация.АдресЭП, Поз+1);
				КонецЕсли;
			КонецЕсли;
			
			Попытка	
				Партнер.Записать();
				СтрокаАтрибутыКонтрагентов.Создано = Истина;
			Исключение
				СтрокаАтрибутыКонтрагентов.Создано = Ложь;
			КонецПопытки;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьРеквизитыТабличнойЧастиДляТелефона(СтрокаТабличнойЧасти, Телефон)
	
	Если НЕ ЗначениеЗаполнено(Телефон) Тогда
		Возврат;
	КонецЕсли;
	
	// Умолчания
	СтрокаТабличнойЧасти.НомерТелефонаБезКодов = "";
	СтрокаТабличнойЧасти.НомерТелефона         = "";
	
	КодСтраны     = Телефон.CountryCode;
	КодГорода     = Телефон.AreaCode;
	НомерТелефона = Телефон.Number;
	
	Если СтрНачинаетсяС(КодСтраны, "+") Тогда
		КодСтраны = Сред(КодСтраны, 2);
	КонецЕсли;
	
	Поз = СтрНайти(НомерТелефона, ",");
	Если Поз <> 0 Тогда
		НомерТелефона = Лев(НомерТелефона, Поз-1);
	КонецЕсли;
	
	Поз = СтрНайти(НомерТелефона, Символы.ПС);
	Если Поз <> 0 Тогда
		НомерТелефона = Лев(НомерТелефона, Поз-1);
	КонецЕсли;
	
	СтрокаТабличнойЧасти.НомерТелефонаБезКодов = УбратьРазделителиВНомерТелефона(НомерТелефона);
	СтрокаТабличнойЧасти.НомерТелефона         = УбратьРазделителиВНомерТелефона(Строка(КодСтраны) + КодГорода + НомерТелефона);
	
КонецПроцедуры

&НаСервере
Функция УбратьРазделителиВНомерТелефона(Знач НомерТелефона)
	
	Поз = СтрНайти(НомерТелефона, ",");
	Если Поз <> 0 Тогда
		НомерТелефона = Лев(НомерТелефона, Поз-1);
	КонецЕсли;
	
	НомерТелефона = СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, " ", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "+", "");
	
	Возврат НомерТелефона;
	
КонецФункции

&НаСервере
Процедура ДействияПоСтратегииИзменениеКонтрагента(СтрокаАтрибутыКонтрагентов, бит_Контрагент)
	
	Контрагент = бит_Контрагент.ПолучитьОбъект();
	
	Если СтрокаАтрибутыКонтрагентов.Код = "KPP"
		ИЛИ СтрокаАтрибутыКонтрагентов.Код = "KPP_FILIAL" Тогда
		Если Контрагент.КПП = Неопределено Или Контрагент.КПП = "" Тогда
			Контрагент.КПП = СтрокаАтрибутыКонтрагентов.Значение;
			Попытка	
				Контрагент.Записать();  
				СтрокаАтрибутыКонтрагентов.Создано = Истина;
			Исключение
				СтрокаАтрибутыКонтрагентов.Создано = Ложь;
			КонецПопытки;
		Иначе
		СтрокаАтрибутыКонтрагентов.Создано = Ложь;
		КонецЕсли;	
	ИначеЕсли СтрокаАтрибутыКонтрагентов.Код = "OGRN" Тогда
		Если Контрагент.РегистрационныйНомер = Неопределено Или Контрагент.РегистрационныйНомер = "" Тогда
			Контрагент.РегистрационныйНомер = СтрокаАтрибутыКонтрагентов.Значение;
			Попытка	
				Контрагент.Записать();  
				СтрокаАтрибутыКонтрагентов.Создано = Истина;
			Исключение
				СтрокаАтрибутыКонтрагентов.Создано = Ложь;
			КонецПопытки;
		Иначе
		СтрокаАтрибутыКонтрагентов.Создано = Ложь;	
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеАтрибута(СтрокаАтрибутыКонтрагентов, бит_Атрибут, бит_Контрагент)
	
	Если Объект.ИдентификаторСправочника = "АтрибутыКонтрагентов" Тогда  
		
		бит_Значение = ПолучитьЗначениеАтрибутыКонтрагентов(СтрокаАтрибутыКонтрагентов, бит_Атрибут, бит_Контрагент); 
		
	КонецЕсли;
	
	Возврат бит_Значение;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеАтрибутыКонтрагентов(СтрокаАтрибутыКонтрагентов, бит_Атрибут, бит_Контрагент)
		
	Если СтрокаАтрибутыКонтрагентов.Код = "OKVED" 
		Или СтрокаАтрибутыКонтрагентов.Код = "VP1"
		Или СтрокаАтрибутыКонтрагентов.Код = "VP2"
		Или СтрокаАтрибутыКонтрагентов.Код = "VP3"
		Тогда 
		бит_Значение = СтрокаАтрибутыКонтрагентов.Значение;
	ИначеЕсли СтрокаАтрибутыКонтрагентов.Код = "VP4" Тогда
		ПараметрыОтбора = Новый Структура;
		Отбор = Новый Структура;
		Отбор.Вставить("Наименование", СтрокаАтрибутыКонтрагентов.Значение); 
		Отбор.Вставить("Владелец", бит_Атрибут[0].Значение);   
		ПараметрыОтбора.Вставить("Отбор", Отбор);
		Значение = Справочники.бит_ДополнительныеАтрибутыКонтрагентов.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если Значение = Неопределено Или Значение.Количество() = 0 Тогда
			ДополнительныйАтрибут = Справочники.бит_ДополнительныеАтрибутыКонтрагентов.СоздатьЭлемент();
			ДополнительныйАтрибут.Наименование = СтрокаАтрибутыКонтрагентов.Значение;
			ДополнительныйАтрибут.Владелец = бит_Атрибут[0].Значение; 
			ДополнительныйАтрибут.Записать();
			Значение = ДополнительныйАтрибут;
		Иначе
		    Значение = Значение[0].Значение;	
		КонецЕсли;
		бит_Значение = Значение;
	Иначе
		бит_Значение = Неопределено;
	КонецЕсли;	
	
	Возврат бит_Значение;

КонецФункции	
	
&НаСервере 
Процедура ПроверитьЭлементыАтрибутыКонтрагентов() 

	Для каждого СтрокаАтрибутыКонтрагентов Из СозданиеАтрибутыКонтрагентов Цикл
		
		ПараметрыОтбора = Новый Структура;
		Отбор = Новый Структура;
		Отбор.Вставить("бит_ИДКлиента", СтрокаАтрибутыКонтрагентов.ИДКлиента); 
		ПараметрыОтбора.Вставить("Отбор", Отбор);
		бит_Контрагент = Справочники.Контрагенты.ПолучитьДанныеВыбора(ПараметрыОтбора);
		Если Не (бит_Контрагент = Неопределено
			Или бит_Контрагент.Количество() = 0) Тогда 
			бит_Контрагент = бит_Контрагент[0].Значение;
			//бит_Контрагент = бит_Контрагент.Значение;
		КонецЕсли;
        	
		Если СтрокаАтрибутыКонтрагентов.Код = "OKVED"
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "VP1"
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "VP2"
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "VP3" 
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "VP4"
			Тогда
			ПараметрыОтбора = Новый Структура;
			Отбор = Новый Структура;
			Отбор.Вставить("Код", СтрокаАтрибутыКонтрагентов.Код);   
			ПараметрыОтбора.Вставить("Отбор", Отбор);
			бит_Атрибут = ПланыВидовХарактеристик.бит_ПризнакиКонтрагентов.ПолучитьДанныеВыбора(ПараметрыОтбора);
			Если бит_Атрибут = Неопределено
				Или бит_Атрибут.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;

			ДействияПоСтратегииАтрибут(СтрокаАтрибутыКонтрагентов, бит_Контрагент, бит_Атрибут);
		ИначеЕсли СтрокаАтрибутыКонтрагентов.Код = "BYH_PHONE"	
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "EMAIL"
			Тогда
			ДействияПоСтратегииКонтактнаяИнформация(СтрокаАтрибутыКонтрагентов, бит_Контрагент);
		ИначеЕсли СтрокаАтрибутыКонтрагентов.Код = "KPP"
			ИЛИ СтрокаАтрибутыКонтрагентов.Код = "KPP_FILIAL"
            ИЛИ СтрокаАтрибутыКонтрагентов.Код = "OGRN" 
			Тогда
			ДействияПоСтратегииИзменениеКонтрагента(СтрокаАтрибутыКонтрагентов, бит_Контрагент);
		КонецЕсли;
				
	КонецЦикла;	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиАтрибутыКонтрагентов.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиАтрибутыКонтрагентов.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.ПроверкиАтрибутыКонтрагентов.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;

КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьАтрибутыКонтрагентов(Команда)
	
	ЗаполнитьАтрибутыКонтрагентовНаСервере()
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьАтрибутыКонтрагентовНаСервере()
	
	СтруктураАтрибутов = ПолучитьСтруктуруАтрибутыКонтрагентов();
	
#Область ОписаниеТиповПризнаков	
    КвалификаторыСтроки50 = Новый КвалификаторыСтроки(50);
	ОписаниеСтроки50 = Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки50);
    ОписаниеДопЗначение = Новый ОписаниеТипов("СправочникСсылка.бит_ДополнительныеАтрибутыКонтрагентов");
#КонецОбласти

#Область ЗаполненияПризнаков	
	Признак = СтруктураАтрибутов.Добавить();
    Признак.Код = "OKVED";
	Признак.Наименование = "ОКВЭД";
	Признак.ТипЗначения = ОписаниеСтроки50;
	
	
	Признак = СтруктураАтрибутов.Добавить();
    Признак.Код = "VP1";
	Признак.Наименование = "Покупатель (для сделки ВП Волмаг)";
	Признак.ТипЗначения = ОписаниеСтроки50;
	 
	
	Признак = СтруктураАтрибутов.Добавить();
    Признак.Код = "VP2";
	Признак.Наименование = "Начальник отдела (для сделки ВП Волмаг)";
	Признак.ТипЗначения = ОписаниеСтроки50;
	
	
	Признак = СтруктураАтрибутов.Добавить();
    Признак.Код = "VP3";
	Признак.Наименование = "Название отдела (для сделки ВП Волмаг";
	Признак.ТипЗначения = ОписаниеСтроки50;
	
		
	Признак = СтруктураАтрибутов.Добавить();
    Признак.Код = "VP4";
	Признак.Наименование = "Должность ответственного лица (для сделки ВП Волмаг)";
	Признак.ТипЗначения = ОписаниеДопЗначение;
	 
#КонецОбласти
		
	СоздатьАтрибутыКонтрагентов(СтруктураАтрибутов);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСтруктуруАтрибутыКонтрагентов()        
	
	Атрибуты = Новый ТаблицаЗначений;  
	КвалификаторыСтроки = Новый КвалификаторыСтроки(10);
	Атрибуты.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки));
	КвалификаторыСтроки = Новый КвалификаторыСтроки(150);
    Атрибуты.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки)); 
	Атрибуты.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("ОписаниеТипов"));
    			
	Возврат Атрибуты;

КонецФункции	

&НаСервере 
Процедура СоздатьАтрибутыКонтрагентов(СтруктураАтрибутов) 
		
	Для каждого Атрибут Из СтруктураАтрибутов Цикл  
		Элемент = ПланыВидовХарактеристик.бит_ПризнакиКонтрагентов.СоздатьЭлемент();
		Элемент.Код = Атрибут.Код;
		Элемент.Наименование = Атрибут.Наименование;
        Элемент.ТипЗначения = Атрибут.ТипЗначения;
		Попытка	
			Элемент.Записать(); 
		Исключение
			ТекстСообщения = "Не удалось создать атрибут " +  Элемент.Наименование;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;	
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти   

 #Область СозданияВидыРабочихЦентров  

&НаСервере 
Процедура ЗаполнитьТаблицуИсточникВидыРабочихЦентров(ПредставлениеИсточника)             
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточник = ИсточникВидыРабочихЦентров.Добавить();	            
		
		ТекстКолонки = ПредставлениеИсточника.Область(НомерСтроки, 3).Текст;
		СтрИсточник.Наименование = ТекстКолонки;           
		СтрИсточник.Подразделение = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст;
		СтрИсточник.ЕдиницаИзмеренияДоступностиРЦ = ПредставлениеИсточника.Область(НомерСтроки, 10).Текст;
	    СтрИсточник.ЕдиницаВремениПереналадки = ПредставлениеИсточника.Область(НомерСтроки, 13).Текст;	
		СтрИсточник.Описание = ПредставлениеИсточника.Область(НомерСтроки, 14).Текст;
		СтрИсточник.ЕдиницаИзмеренияЗагрузки = ПредставлениеИсточника.Область(НомерСтроки, 17).Текст;
		СтрИсточник.ВариантЗагрузки = ПредставлениеИсточника.Область(НомерСтроки, 18).Текст;
		СтрИсточник.ЕдиницаИзмерения = ПредставлениеИсточника.Область(НомерСтроки, 20).Текст;
			
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникВидыРабочихЦентров.Удалить(СтрИсточник);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
Процедура ДействияСТаблицамиВидыРабочихЦентров(ПредставлениеИсточника)        

	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникВидыРабочихЦентров.Видимость 	= Истина;
		ЗаполнитьТаблицуИсточникВидыРабочихЦентров(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда 
		Элементы.СозданиеВидыРабочихЦентров.Видимость 	= Истина;
		Элементы.ПроверкиВидыРабочихЦентров.Видимость 	= Истина;
		Элементы.ОшибокВидыРабочихЦентров.Видимость 	= Истина;
		ЗаполнитьТаблицыПроверкиВидыРабочихЦентров();
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыТаблицыВидыРабочихЦентров();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыТаблицыВидыРабочихЦентров();	
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.ВидыРабочихЦентров.ФормаСписка"); 
	Иначе
		Возврат;
	КонецЕсли; 
			
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиВидыРабочихЦентров()
	
	УсловноеОформление.Элементы.Очистить();
	
	МассивКодовВРЦ = ИсточникВидыРабочихЦентров.Выгрузить( , "Описание");
	//МассивПодразделений = ИсточникВидыРабочихЦентров.Выгрузить( , "Подразделение");
	ВсеПодразделенияБезПрификса = ПолучитьВсеПодразделенияБезПрификса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРабочихЦентров.Ссылка КАК Ссылка,
		|	ВидыРабочихЦентров.Наименование КАК Наименование,
		|	ВидыРабочихЦентров.бит_КодВРЦ КАК бит_КодВРЦ
		|ИЗ
		|	Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
		|ГДЕ
		|	ВидыРабочихЦентров.ЭтоГруппа = ЛОЖЬ
		|	И ВидыРабочихЦентров.бит_КодВРЦ В (&МассивКодовВРЦ)";
		
	Запрос.УстановитьПараметр("МассивКодовВРЦ", МассивКодовВРЦ);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();  
	
	Для каждого СтрокаВидыРабочихЦентров Из ИсточникВидыРабочихЦентров Цикл 
		
		ТекстСообщения = ""; 
		ТекущееПодразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
		Если Не ЗначениеЗаполнено(СтрокаВидыРабочихЦентров.Подразделение) Тогда
			ТекстСообщения = ТекстСообщения + "Подразделение не найдено! ";
		ИначеЕсли СтрокаВидыРабочихЦентров.Подразделение = "Основное производство" 
			Или СтрокаВидыРабочихЦентров.Подразделение = "ОСНОВНОЕ ПРОИЗВОДСТВО"
			Или СтрокаВидыРабочихЦентров.Подразделение = "1" Тогда
			ТекущееПодразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("1"); 
			//ТекущееПодразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию("Основное производство"); 
			
		ИначеЕсли  СтрокаВидыРабочихЦентров.Подразделение = "Цех №2"
			Или СтрокаВидыРабочихЦентров.Подразделение = "2" Тогда
			ТекущееПодразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("2");
			//ТекущееПодразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию("Цех №2"); 
		Иначе
			ТекстСообщения = ТекстСообщения + "Подразделение не удалось сопоставить! ";
			//ПараметрыОтбора = Новый Структура; 
			//ПараметрыОтбора.Вставить("Код", Число(СтрокаВидыРабочихЦентров.Подразделение)); 
			//Подразлеление = ВсеПодразделенияБезПрификса.НайтиСтроки(ПараметрыОтбора);
			//Если Подразлеление.Количество() = 0 Или  Подразлеление.Количество() > 1 Тогда  
			//	ТекстСообщения = ТекстСообщения + "Подразделение не удалось сопоставить! ";
			//Иначе
			//	ТекущееПодразделение = Подразлеление[0].Ссылка;
			//КонецЕсли;	
		КонецЕсли; 
				
		СтрокаВРЦ = РезультатЗапроса.Найти(СтрокаВидыРабочихЦентров.Описание);
		Если ТекстСообщения <> "" Тогда	
			СтрокаОшибокВидыРабочихЦентров = ОшибокВидыРабочихЦентров.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиВидыРабочихЦентров(СтрокаОшибокВидыРабочихЦентров, 
			                                                         СтрокаВидыРабочихЦентров, ТекущееПодразделение);
			СтрокаОшибокВидыРабочихЦентров.Ошибка = ТекстСообщения;
			СтрокаОшибокВидыРабочихЦентров.Подразделение = СтрокаВидыРабочихЦентров.Подразделение;
		ИначеЕсли СтрокаВРЦ = Неопределено Тогда
			СтрокаСозданиеВидыРабочихЦентров = СозданиеВидыРабочихЦентров.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиВидыРабочихЦентров(СтрокаСозданиеВидыРабочихЦентров,
			                                                         СтрокаВидыРабочихЦентров, ТекущееПодразделение);
		Иначе 
			СтрокаПроверкиВидыРабочихЦентров = ПроверкиВидыРабочихЦентров.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиВидыРабочихЦентров(СтрокаПроверкиВидыРабочихЦентров, 
			                                                         СтрокаВидыРабочихЦентров, ТекущееПодразделение);
	    КонецЕсли; 
    КонецЦикла;
		
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыПроверкиВидыРабочихЦентров(СтрокаПриемник, СтрокаИсточник, ТекущееПодразделение)
	
	СтрокаПриемник.Наименование = СтрокаИсточник.Наименование;
	СтрокаПриемник.Подразделение = ТекущееПодразделение;
	СтрокаПриемник.ЕдиницаИзмеренияДоступностиРЦ = СтрокаИсточник.ЕдиницаИзмеренияДоступностиРЦ;
	СтрокаПриемник.ЕдиницаВремениПереналадки = СтрокаИсточник.ЕдиницаВремениПереналадки;
	СтрокаПриемник.Описание = СтрокаИсточник.Описание;
	СтрокаПриемник.ЕдиницаИзмеренияЗагрузки = СтрокаИсточник.ЕдиницаИзмеренияЗагрузки;
	СтрокаПриемник.ВариантЗагрузки = СтрокаИсточник.ВариантЗагрузки;
	СтрокаПриемник.ЕдиницаИзмерения = СтрокаИсточник.ЕдиницаИзмерения;
	
КонецПроцедуры

&НаСервере 
Процедура СоздатьЭлементыТаблицыВидыРабочихЦентров()
	
	//ОсновноеПодразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ОСНОВНОЕ ПРОИЗВОДСТВО");
	//ЦехДва = Справочники.СтруктураПредприятия.НайтиПоНаименованию("Цех №2");
	
	Для каждого СтрокаВидыРабочихЦентров Из  СозданиеВидыРабочихЦентров Цикл
		Если СтрокаВидыРабочихЦентров.Наименование = "РУЧНАЯ ОПЕРАЦИЯ" 
			Или СтрокаВидыРабочихЦентров.Наименование = "Цех1 (волочил)"
			Или СтрокаВидыРабочихЦентров.Наименование = "РУЧНАЯ ОПЕРАЦИЯ КОРПУС 2/2" 
			Или СтрокаВидыРабочихЦентров.Наименование = "Цех4 (БПИ)" 
			Или СтрокаВидыРабочихЦентров.Наименование = "РУЧНАЯ ОПЕРАЦИЯ КОРПУС 2/5" 
			Или СтрокаВидыРабочихЦентров.Наименование = "КОРПУС 3/6" 
			Или СтрокаВидыРабочихЦентров.Наименование = "Цех7 (по про-ву сил. каб. низ. и сред. напряжения)" 
			Или СтрокаВидыРабочихЦентров.Наименование = "КОРПУС 5/8" 
			Или СтрокаВидыРабочихЦентров.Наименование = "простой" 
			Или СтрокаВидыРабочихЦентров.Наименование = "НОВОЕ ОБОРУДОВАНИЕ" 
			Или СтрокаВидыРабочихЦентров.Наименование = "КОРПУС 3/12" 
			Или СтрокаВидыРабочихЦентров.Наименование = "РУЧНАЯ ОПЕРАЦИЯ РУЧНАЯ ОПЕРАЦИЯ КОРПУС 3/12" 
			Или СтрокаВидыРабочихЦентров.Наименование = "РУЧНАЯ ОПЕРАЦИЯ РУЧНАЯ ОПЕРАЦИЯ Цех20 (по производству тары)" 
			Или СтрокаВидыРабочихЦентров.Наименование = "РУЧНАЯ ОПЕРАЦИЯ Цех29 (по переработке отходов)"
			Или СтрокаВидыРабочихЦентров.Наименование = "Нет оборудования"
		Тогда
		Продолжить;
		КонецЕсли;
			
	ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.СоздатьЭлемент();
	ВидРабочегоЦентра.Наименование = СтрокаВидыРабочихЦентров.Наименование; 
	//Если СтрокаВидыРабочихЦентров.Подразделение = "ОСНОВНОЕ ПРОИЗВОДСТВО" Тогда
	//ВидРабочегоЦентра.Подразделение	= ОсновноеПодразделение;
	//ИначеЕсли СтрокаВидыРабочихЦентров.Подразделение = "Цех №2" Тогда
	//ВидРабочегоЦентра.Подразделение	= ЦехДва;
	//КонецЕсли;
	ВидРабочегоЦентра.Подразделение	= СтрокаВидыРабочихЦентров.Подразделение;
	ВидРабочегоЦентра.МинимальныйЗначимыйБуфер = 0;
	ВидРабочегоЦентра.УчитыватьДоступностьПоГрафикуРаботы = Истина;
    ВидРабочегоЦентра.МаксимальнаяДоступностьРЦ = 1;
    ВидРабочегоЦентра.ЕдиницаИзмеренияДоступностиРЦ = Перечисления.ЕдиницыИзмеренияВремени.Час;
	ВидРабочегоЦентра.ПериодОжидания = 0;
	ВидРабочегоЦентра.ИспользуютсяВариантыНаладки = Ложь;
	//ВидРабочегоЦентра.ЕдиницаВремениПереналадки = Неопределено;
    ВидРабочегоЦентра.Описание = СтрокаВидыРабочихЦентров.Описание;
	ВидРабочегоЦентра.бит_КодВРЦ = СтрокаВидыРабочихЦентров.Описание; 
	ВидРабочегоЦентра.РезервДоступности = 0;
	ВидРабочегоЦентра.ПараллельнаяЗагрузка = Ложь;
	//ВидРабочегоЦентра.ЕдиницаИзмеренияЗагрузки = Неопределено;
	//ВидРабочегоЦентра.ВариантЗагрузки = Неопределено;
	ВидРабочегоЦентра.ВремяРаботы = 0;
	ВидРабочегоЦентра.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Минута;
	ВидРабочегоЦентра.ПланироватьРаботуРабочихЦентров = Истина;
	ВидРабочегоЦентра.КоличествоРабочихЦентров = 0;
    ВидРабочегоЦентра.ВводитьДоступностьДляВидаРЦ = Ложь;
	   //ВидРабочегоЦентра.УдалитьПланироватьРаботу = Ложь;
	
	Попытка	
		ВидРабочегоЦентра.Записать();
		СтрокаВидыРабочихЦентров.Создано = Истина;
	Исключение
		СтрокаВидыРабочихЦентров.Создано = Ложь;
	КонецПопытки;	
		
	КонецЦикла;	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеВидыРабочихЦентров.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеВидыРабочихЦентров.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеВидыРабочихЦентров.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;

КонецПроцедуры

&НаСервере 
Процедура ПроверитьЭлементыТаблицыВидыРабочихЦентров()
	
	Для каждого СтрокаВидыРабочихЦентров Из ПроверкиВидыРабочихЦентров Цикл 
		
		ТекущийВРЦ = Справочники.ВидыРабочихЦентров.НайтиПоРеквизиту("бит_КодВРЦ", СтрокаВидыРабочихЦентров.Описание);

		Если Не ЗначениеЗаполнено(ТекущийВРЦ.Подразделение) Тогда
			 ТекущийВРЦ.Подразделение = СтрокаВидыРабочихЦентров.Подразделение;
			 СтрокаВидыРабочихЦентров.Изменено = Истина;
		КонецЕсли;	
		
		Если ТекущийВРЦ.Описание = "" Тогда
			 ТекущийВРЦ.Описание = СтрокаВидыРабочихЦентров.Описание;
			 СтрокаВидыРабочихЦентров.Изменено = Истина;
		 КонецЕсли;
		 
		Если СтрокаВидыРабочихЦентров.Изменено Тогда
			
			Попытка
				ТекущийВРЦ.Записать();
			Исключение 
				СтрокаВидыРабочихЦентров.Изменено = Ложь;
			КонецПопытки;
		КонецЕсли;
	    		
		КонецЦикла;
	
	ИзменениеУсловногоОформленияВидыРабочихЦентров();
	
КонецПроцедуры

 &НаСервере 
Процедура ИзменениеУсловногоОформленияВидыРабочихЦентров()

 	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиВидыРабочихЦентров.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); 
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиВидыРабочихЦентров.Изменено"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь; 
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки); 
	
	Для каждого элПоля Из Элементы.ПроверкиВидыРабочихЦентров.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле1 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

 #Область СозданияРабочиеЦентры  

&НаСервере 
Процедура ЗаполнитьТаблицуИсточникРабочиеЦентры(ПредставлениеИсточника)
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточник = ИсточникРабочиеЦентры.Добавить();	 
		
		ТекстКолонки = ПредставлениеИсточника.Область(НомерСтроки, 3).Текст;
		СтрИсточник.Наименование = ТекстКолонки;           
		СтрИсточник.ВидРабочегоЦентра = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст;   
		СтрИсточник.КоэффициентВремениРаботы = ПредставлениеИсточника.Область(НомерСтроки, 5).Текст;    
	    СтрИсточник.МаксимальнаяЗагрузка = ПредставлениеИсточника.Область(НомерСтроки, 6).Текст; 	
		СтрИсточник.Описание = ПредставлениеИсточника.Область(НомерСтроки, 8).Текст;             
		СтрИсточник.Подразделение = ПредставлениеИсточника.Область(НомерСтроки, 9).Текст;  
		СтрИсточник.КодРабЦентра = ПредставлениеИсточника.Область(НомерСтроки, 10).Текст;     
			
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникРабочиеЦентры.Удалить(СтрИсточник);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
Процедура ДействияСТаблицамиРабочиеЦентры(ПредставлениеИсточника)        

	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникРабочиеЦентры.Видимость 	= Истина;
		ЗаполнитьТаблицуИсточникРабочиеЦентры(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда 
		Элементы.СозданиеРабочиеЦентры.Видимость 	= Истина;
		Элементы.ПроверкиРабочиеЦентры.Видимость 	= Истина;
		Элементы.ОшибокРабочиеЦентры.Видимость 	= Истина;
		ЗаполнитьТаблицыПроверкиРабочиеЦентры();
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыТаблицыРабочиеЦентры();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыТаблицыРабочиеЦентры();	
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.РабочиеЦентры.ФормаСписка"); 
	Иначе
		Возврат;
	КонецЕсли; 
			
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиРабочиеЦентры()
	
	УсловноеОформление.Элементы.Очистить(); 
	
	МассивВРЦ = ИсточникРабочиеЦентры.Выгрузить( , "ВидРабочегоЦентра");
    МассивКодРЦ = ИсточникРабочиеЦентры.Выгрузить( , "КодРабЦентра");
 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРабочихЦентров.Ссылка КАК Ссылка,
		|	ВидыРабочихЦентров.Наименование КАК Наименование,
		|	ВидыРабочихЦентров.Описание КАК Описание
		|ИЗ
		|	Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
		|ГДЕ
		|	ВидыРабочихЦентров.ЭтоГруппа = ЛОЖЬ
		|	И ВидыРабочихЦентров.Наименование В(&МассивВРЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочиеЦентры.Ссылка КАК Ссылка,
		|	РабочиеЦентры.Наименование КАК Наименование,
		|	РабочиеЦентры.бит_КодРабЦентра КАК бит_КодРабЦентра
		|ИЗ
		|	Справочник.РабочиеЦентры КАК РабочиеЦентры
		|ГДЕ
		|	РабочиеЦентры.ЭтоГруппа = ЛОЖЬ
		|	И РабочиеЦентры.бит_КодРабЦентра В (&МассивКодРЦ)";
		
	Запрос.УстановитьПараметр("МассивВРЦ", МассивВРЦ);
	Запрос.УстановитьПараметр("МассивКодРЦ", МассивКодРЦ);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаВРЦ = РезультатЗапроса[0].Выгрузить();
	ВыборкаРЦ = РезультатЗапроса[1].Выгрузить();		
	ЗаполнениеТаблицРабочиеЦентры(ВыборкаВРЦ, ВыборкаРЦ);
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнениеТаблицРабочиеЦентры(ВыборкаВРЦ, ВыборкаРЦ);

   	Для каждого СтрокаРабочиеЦентры Из ИсточникРабочиеЦентры Цикл 
			
		ТекстСообщения = ""; 
		СтрокаВРЦ = ВыборкаВРЦ.Найти(СтрокаРабочиеЦентры.ВидРабочегоЦентра);
		Если СтрокаВРЦ = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Вид рабочих центров не найден! ";	
		КонецЕсли;
		
		СтрокаРЦ = ВыборкаРЦ.Найти(СтрокаРабочиеЦентры.КодРабЦентра);
		Если ТекстСообщения <> "" Тогда	
			СтрокаОшибокРабочиеЦентры = ОшибокРабочиеЦентры.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиРабочиеЦентры(СтрокаОшибокРабочиеЦентры, 
			                                                         СтрокаРабочиеЦентры);
			СтрокаОшибокРабочиеЦентры.Ошибка = ТекстСообщения;
		ИначеЕсли СтрокаРЦ = Неопределено Тогда
			СтрокаСозданиеРабочиеЦентры = СозданиеРабочиеЦентры.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиРабочиеЦентры(СтрокаСозданиеРабочиеЦентры,
			                                                         СтрокаРабочиеЦентры);
		Иначе 
			СтрокаПроверкиРабочиеЦентры = ПроверкиРабочиеЦентры.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиРабочиеЦентры(СтрокаПроверкиРабочиеЦентры, 
			                                                         СтрокаРабочиеЦентры);
	    КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыПроверкиРабочиеЦентры(СтрокаПриемник, СтрокаИсточник)
	
	СтрокаПриемник.Наименование = СтрокаИсточник.Наименование;
	СтрокаПриемник.ВидРабочегоЦентра = СтрокаИсточник.ВидРабочегоЦентра;
	СтрокаПриемник.КоэффициентВремениРаботы = СтрокаИсточник.КоэффициентВремениРаботы;
	СтрокаПриемник.МаксимальнаяЗагрузка = СтрокаИсточник.МаксимальнаяЗагрузка;
	СтрокаПриемник.Описание = СтрокаИсточник.Описание;
	СтрокаПриемник.Подразделение = СтрокаИсточник.Подразделение;
	СтрокаПриемник.КодРабЦентра = СтрокаИсточник.КодРабЦентра;
	 
КонецПроцедуры

&НаСервере 
Процедура СоздатьЭлементыТаблицыРабочиеЦентры()
	
	Для каждого СтрокаРабочиеЦентры Из СозданиеРабочиеЦентры Цикл
					
		Если СтрокаРабочиеЦентры.ВидРабочегоЦентра = "КОРПУС 3/12" 
			Или СтрокаРабочиеЦентры.ВидРабочегоЦентра = "КОРПУС 5/8"
			Или СтрокаРабочиеЦентры.ВидРабочегоЦентра = "Цех4 (БПИ)" 
			Или СтрокаРабочиеЦентры.ВидРабочегоЦентра = "Цех42" 
			Или СтрокаРабочиеЦентры.ВидРабочегоЦентра = "Нет оборудования" Тогда
			Продолжить;
		КонецЕсли;
		
		РабочийЦентр = Справочники.РабочиеЦентры.СоздатьЭлемент();
		РабочийЦентр.Наименование = СтрокаРабочиеЦентры.Наименование;
		РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.НайтиПоНаименованию(
		СтрокаРабочиеЦентры.ВидРабочегоЦентра);
		РабочийЦентр.КоэффициентВремениРаботы = 1;
		РабочийЦентр.МаксимальнаяЗагрузка = 0;
		РабочийЦентр.Описание = СтрокаРабочиеЦентры.Описание;
		РабочийЦентр.РасценкаРабота = 0;
		РабочийЦентр.РасценкаПереналадка = 0;
		//РабочийЦентр.Участок = Неопределено;  Справочники.ПроизводственныеУчастки.ПустаяСсылка() 
		РабочийЦентр.бит_КодРабЦентра = СтрокаРабочиеЦентры.КодРабЦентра;
		
		Попытка	
			РабочийЦентр.Записать();
			СтрокаРабочиеЦентры.Создано = Истина;
		Исключение
			СтрокаРабочиеЦентры.Создано = Ложь;
		КонецПопытки;
	КонецЦикла;	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеРабочиеЦентры.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеРабочиеЦентры.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеРабочиеЦентры.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;

КонецПроцедуры

&НаСервере 
Процедура ПроверитьЭлементыТаблицыРабочиеЦентры()
	
	Для каждого СтрокаРабочиеЦентры Из ПроверкиРабочиеЦентры Цикл 
			
	КонецЦикла;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиРабочиеЦентры.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); 
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиРабочиеЦентры.Изменено"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь; 
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки); 
	
	Для каждого элПоля Из Элементы.ПроверкиРабочиеЦентры.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле1 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
  	
КонецПроцедуры
#КонецОбласти 

#Область СозданияСпецификации
&НаСервере 
Процедура ЗаполнитьТаблицуИсточникСпецификации(ПредставлениеИсточника)
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточник = ИсточникСпецификации.Добавить();	                                    		
		ТекстКолонки = ПредставлениеИсточника.Область(НомерСтроки, 1).Текст;
		СтрИсточник.ИдПозВарианта = ТекстКолонки;                                                       
		СтрИсточник.ИдРодителя = ПредставлениеИсточника.Область(НомерСтроки, 2).Текст;             
		СтрИсточник.КодРодителя = ПредставлениеИсточника.Область(НомерСтроки, 3).Текст;        
	    СтрИсточник.Родитель = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст;  	
		СтрИсточник.ЕдИзмРодителя = ПредставлениеИсточника.Область(НомерСтроки, 5).Текст;               
		СтрИсточник.КодПФИлиМатериала = ПредставлениеИсточника.Область(НомерСтроки, 6).Текст;     
		СтрИсточник.НаименованиеПФИлиМатериала = ПредставлениеИсточника.Область(НомерСтроки, 7).Текст;         
		СтрИсточник.Обособленно = ПредставлениеИсточника.Область(НомерСтроки, 8).Текст; // исправление после сквозного задача 5                                                                                           
		СтрИсточник.ЕдИзм = ПредставлениеИсточника.Область(НомерСтроки, 9).Текст;                                                                                           
		СтрИсточник.Тип = ПредставлениеИсточника.Область(НомерСтроки, 10).Текст;                                                                                           
		СтрИсточник.КолвоПозицииВарианта = ПредставлениеИсточника.Область(НомерСтроки, 11).Текст;                                                                                           
		СтрИсточник.Процент = ПредставлениеИсточника.Область(НомерСтроки, 12).Текст;                                                                                           
		СтрИсточник.КоррКоэффициент = ПредставлениеИсточника.Область(НомерСтроки, 13).Текст;                                                                                           
		СтрИсточник.ИДТехмаршрутаРодителя = ПредставлениеИсточника.Область(НомерСтроки, 14).Текст;                                                                                           
		СтрИсточник.НомерОперации = ПредставлениеИсточника.Область(НомерСтроки, 15).Текст;                                                                                           
		СтрИсточник.КодОперации = ПредставлениеИсточника.Область(НомерСтроки, 16).Текст;                                                                                           
		СтрИсточник.НаименованиеОперации = ПредставлениеИсточника.Область(НомерСтроки, 17).Текст;                                                                                           
		СтрИсточник.КодЦеха = ПредставлениеИсточника.Область(НомерСтроки, 18).Текст;                                                                                           
		СтрИсточник.НаименованиеЦеха = ПредставлениеИсточника.Область(НомерСтроки, 19).Текст;                                                                                           
		СтрИсточник.КодОборудования = ПредставлениеИсточника.Область(НомерСтроки, 20).Текст;																						   
		СтрИсточник.НаименованиеОборудования = ПредставлениеИсточника.Область(НомерСтроки, 21).Текст;																						   
		СтрИсточник.НормаВыработки = ПредставлениеИсточника.Область(НомерСтроки, 22).Текст;
		СтрИсточник.ЕдИзмЧ = ПредставлениеИсточника.Область(НомерСтроки, 23).Текст;																						   
		СтрИсточник.ПризнакОснМаршрута = ПредставлениеИсточника.Область(НомерСтроки, 24).Текст;																						   
		СтрИсточник.КоэфтУкрутки = ПредставлениеИсточника.Область(НомерСтроки, 25).Текст;																						    
		СтрИсточник.ТехнОтход = ПредставлениеИсточника.Область(НомерСтроки, 26).Текст;																						   
		СтрИсточник.АгрегКоэфт = ПредставлениеИсточника.Область(НомерСтроки, 27).Текст;																						   
		СтрИсточник.ИДТехмаршрутаПФ = ПредставлениеИсточника.Область(НомерСтроки, 28).Текст;	
		СтрИсточник.АгрегКоэф_Материалов = ПредставлениеИсточника.Область(НомерСтроки, 29).Текст;	
		
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникСпецификации.Удалить(СтрИсточник);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
Процедура ДействияСТаблицамиСпецификации(ПредставлениеИсточника)        

	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникСпецификации.Видимость 	= Истина;
		ЗаполнитьТаблицуИсточникСпецификации(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда 
		Элементы.СозданиеСпецификации.Видимость 	= Истина;
		Элементы.ПроверкиСпецификации.Видимость 	= Истина;
		Элементы.ОшибокСпецификации.Видимость 	= Истина;
		ЗаполнитьТаблицыПроверкиСпецификации();
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыТаблицыСпецификации();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыТаблицыСпецификации();	
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.РесурсныеСпецификации.ФормаСписка"); 
	Иначе
		Возврат;
	КонецЕсли; 
			
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиСпецификации()
	
	УсловноеОформление.Элементы.Очистить();
	//ПроверкаКод оборудования это код ВРЦ  или РЦ
	МассивКодовОборудования = ИсточникСпецификации.Выгрузить( , "КодОборудования");
	МассивИзделий = ИсточникСпецификации.Выгрузить( , "КодРодителя");
	МассивМатериалов = ИсточникСпецификации.Выгрузить( , "КодПФИлиМатериала");
	МассивОпераций = ИсточникСпецификации.Выгрузить( , "КодОперации");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул В(&МассивИзделий)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул В(&МассивМатериалов)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РесурсныеСпецификацииВыходныеИзделия.Ссылка КАК Ссылка,
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК Номенклатура,
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура.Артикул КАК НоменклатураАртикул
		|ИЗ
		|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
		|ГДЕ
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура.Артикул В(&МассивИзделий)
		|	И РесурсныеСпецификацииВыходныеИзделия.Ссылка.ПометкаУдаления = Ложь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочиеЦентры.Ссылка КАК Ссылка,
		|	РабочиеЦентры.Наименование КАК Наименование,
		|	РабочиеЦентры.бит_КодРабЦентра КАК бит_КодРабЦентра
		|ИЗ
		|	Справочник.РабочиеЦентры КАК РабочиеЦентры
		|ГДЕ
		|	РабочиеЦентры.ЭтоГруппа = ЛОЖЬ
		|	И РабочиеЦентры.бит_КодРабЦентра В(&МассивКодовОборудования)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыРабочихЦентров.Ссылка КАК Ссылка,
		|	ВидыРабочихЦентров.Наименование КАК Наименование,
		|	ВидыРабочихЦентров.Описание КАК Описание
		|ИЗ
		|	Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
		|ГДЕ
		|	(ВидыРабочихЦентров.ЭтоГруппа = ЛОЖЬ
		|				И ВЫРАЗИТЬ(ВидыРабочихЦентров.Описание КАК СТРОКА(100)) В (&МассивКодовОборудования)
		|			ИЛИ ВидыРабочихЦентров.бит_КодВРЦ В (&МассивКодовОборудования))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочиеЦентры.Ссылка КАК Ссылка,
		|	РабочиеЦентры.Наименование КАК Наименование,
		|	РабочиеЦентры.ВидРабочегоЦентра КАК ВидРабочегоЦентра
		|ИЗ
		|	Справочник.РабочиеЦентры КАК РабочиеЦентры
		|ГДЕ
		|	РабочиеЦентры.ЭтоГруппа = ЛОЖЬ
		|	И РабочиеЦентры.ВидРабочегоЦентра В
		|			(ВЫБРАТЬ
		|				ВидыРабочихЦентров.Ссылка КАК Ссылка
		|			ИЗ
		|				Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
		|			ГДЕ
		|				(ВидыРабочихЦентров.ЭтоГруппа = ЛОЖЬ
		|						И ВЫРАЗИТЬ(ВидыРабочихЦентров.Описание КАК СТРОКА(100)) В (&МассивКодовОборудования)
		|					ИЛИ ВидыРабочихЦентров.бит_КодВРЦ В (&МассивКодовОборудования)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_КодыОпераций.Наименование КАК Наименование,
		|	бит_КодыОпераций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.бит_КодыОпераций КАК бит_КодыОпераций
		|ГДЕ
		|	бит_КодыОпераций.Наименование В(&МассивОпераций)";		
	
	
	Запрос.УстановитьПараметр("МассивИзделий", МассивИзделий);
	Запрос.УстановитьПараметр("МассивМатериалов", МассивМатериалов);
	Запрос.УстановитьПараметр("МассивКодовОборудования", МассивКодовОборудования);
    Запрос.УстановитьПараметр("МассивОпераций", МассивОпераций);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаИзделия = РезультатЗапроса[0].Выгрузить();
	ВыборкаМатериалы = РезультатЗапроса[1].Выгрузить();
	ВыборкаСпецификации = РезультатЗапроса[2].Выгрузить();
	ВыборкаРЦ = РезультатЗапроса[3].Выгрузить();
	ВыборкаВРЦ = РезультатЗапроса[4].Выгрузить();
	ВыборкаРЦВладельца = РезультатЗапроса[5].Выгрузить();
    ВыборкаКодовОпераций = РезультатЗапроса[6].Выгрузить();
	
	Для каждого СтрокаСпецификации Из ИсточникСпецификации Цикл
	
		ТекстСообщения = ""; 

		Изделие = ВыборкаИзделия.Найти(СтрокаСпецификации.КодРодителя);
		Если Изделие = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Выпускаемая номенклатура не найдена! ";
		//ИначеЕсли Изделие.Количество() = 1 Тогда
		//	Изделие = Изделие[0].Ссылка;
		Иначе 
			//ТекстСообщения = ТекстСообщения + "Выпускаемая номенклатура не сопоставлена! "; 
			Изделие = Изделие.Ссылка;
		КонецЕсли;
		
		Материал = ВыборкаМатериалы.Найти(СтрокаСпецификации.КодПФИлиМатериала);
		Если Материал = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Материал не найден! ";
		//ИначеЕсли Материал.Количество() = 1 Тогда
		//	Материал = Материал[0].Ссылка;
		Иначе 
			//ТекстСообщения = ТекстСообщения + "Материал не сопоставлен! ";  
			Материал = Материал.Ссылка;
		КонецЕсли;
		
		
		Если СтрНайти(СтрокаСпецификации.НаименованиеОборудования, "ОСНОВНОЕ ПРОИЗВОДСТВО")  <> 0 
			Или СтрНайти(СтрокаСпецификации.НаименованиеОборудования, "Нет оборудования")  <> 0 Тогда  
			ЦехБезОборудования = Истина;
		Иначе
			ЦехБезОборудования = Ложь;
		КонецЕсли;
		//Если СтрНайти(СтрокаСпецификации.НаименованиеОборудования, "Цех42")  = 0 Тогда 
		Если Не ЦехБезОборудования Тогда	
			РЦ = ВыборкаРЦ.Найти(СтрокаСпецификации.КодОборудования);
			ВРЦ = ВыборкаВРЦ.Найти(СтрокаСпецификации.КодОборудования);
			Если РЦ = Неопределено и ВРЦ = Неопределено Тогда
				ТекстСообщения = ТекстСообщения + "Рабочий центр не найден! ";
			ИначеЕсли РЦ <> Неопределено Тогда
				РЦ = РЦ.Ссылка;
				ВРЦ = Справочники.ВидыРабочихЦентров.ПустаяСсылка();
			ИначеЕсли ВРЦ <> Неопределено Тогда
				РЦ  = Справочники.РабочиеЦентры.ПустаяСсылка();
				ВРЦ = ВРЦ.Ссылка;	
			КонецЕсли;
		Иначе	
			ВРЦ = Справочники.ВидыРабочихЦентров.ПустаяСсылка();
			РЦ  = Справочники.РабочиеЦентры.ПустаяСсылка();
		КонецЕсли;
	
		Если ЗначениеЗаполнено(ВРЦ) Тогда 
			Отбор = Новый Структура();
			Отбор.Вставить("ВидРабочегоЦентра", ВРЦ);
			РЦВладельца = ВыборкаРЦВладельца.НайтиСтроки(Отбор);
			Если РЦВладельца.Количество() = 1 Тогда
				РЦВладельца = РЦВладельца[0].Ссылка;
			Иначе 
				РЦВладельца = Справочники.РабочиеЦентры.ПустаяСсылка();
			КонецЕсли;
		Иначе 
			РЦВладельца = Справочники.РабочиеЦентры.ПустаяСсылка();
		КонецЕсли;
		
		КодОперацииСсылка = ВыборкаКодовОпераций.Найти(СтрокаСпецификации.КодОперации, "Наименование"); 
		Спецификация = ВыборкаСпецификации.Найти(СтрокаСпецификации.КодРодителя); 
		Если ТекстСообщения <> "" Тогда
			СтрокаОшибокСпецификации = ОшибокСпецификации.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиСпецификации(СтрокаОшибокСпецификации, 
			                                                         СтрокаСпецификации);
			СтрокаОшибокСпецификации.Ошибка = ТекстСообщения;
		ИначеЕсли Спецификация = Неопределено Тогда
			СтрокаСозданиеСпецификации = СозданиеСпецификации.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиСпецификации(СтрокаСозданиеСпецификации,
			                                                         СтрокаСпецификации);
			СтрокаСозданиеСпецификации.Изделие = Изделие;
			СтрокаСозданиеСпецификации.Материал = Материал;
			//СтрокаСозданиеСпецификации.РЦ = РЦ;
			СтрокаСозданиеСпецификации.РЦ = РЦВладельца;
			СтрокаСозданиеСпецификации.ВРЦ = ВРЦ;
			Если ЗначениеЗаполнено(КодОперацииСсылка) Тогда
				СтрокаСозданиеСпецификации.КодОперацииСсылка = КодОперацииСсылка.Ссылка;
			КонецЕсли;	
		Иначе 
			СтрокаПроверкиСпецификации = ПроверкиСпецификации.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиСпецификации(СтрокаПроверкиСпецификации, 
			                                                         СтрокаСпецификации);
			СтрокаПроверкиСпецификации.Изделие = Изделие;
			СтрокаПроверкиСпецификации.Материал = Материал;
			//СтрокаПроверкиСпецификации.РЦ = РЦ; 
			//СтрокаСозданиеСпецификации.РЦ = РЦВладельца;
			СтрокаПроверкиСпецификации.ВРЦ = ВРЦ;
			СтрокаПроверкиСпецификации.СсылкаСпецификация = Спецификация[0].Ссылка;
			Если ЗначениеЗаполнено(КодОперацииСсылка) Тогда
				СтрокаПроверкиСпецификации.КодОперацииСсылка = КодОперацииСсылка.Ссылка;
			КонецЕсли;
	    КонецЕсли;
		
	КонецЦикла;
	
	//СозданиеСпецификации.Сортировать("ИдРодителя"); 
	СозданиеСпецификации.Сортировать("КодРодителя Возр");
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыПроверкиСпецификации(СтрокаПриемник, СтрокаИсточник)
	
	СтрокаПриемник.ИдПозВарианта = СтрокаИсточник.ИдПозВарианта;
	СтрокаПриемник.ИдРодителя = СтрокаИсточник.ИдРодителя;
	СтрокаПриемник.КодРодителя = СтрокаИсточник.КодРодителя;
	СтрокаПриемник.Родитель = СтрокаИсточник.Родитель;
	СтрокаПриемник.ЕдИзмРодителя = СтрокаИсточник.ЕдИзмРодителя;
	СтрокаПриемник.КодПФИлиМатериала = СтрокаИсточник.КодПФИлиМатериала;
	СтрокаПриемник.НаименованиеПФИлиМатериала = СтрокаИсточник.НаименованиеПФИлиМатериала;
	СтрокаПриемник.ЕдИзм = СтрокаИсточник.ЕдИзм;
	СтрокаПриемник.Тип = СтрокаИсточник.Тип;
	СтрокаПриемник.КолвоПозицииВарианта = СтрокаИсточник.КолвоПозицииВарианта;
	СтрокаПриемник.Процент = СтрокаИсточник.Процент;
	СтрокаПриемник.КоррКоэффициент = СтрокаИсточник.КоррКоэффициент;
	СтрокаПриемник.ИДТехмаршрутаРодителя = СтрокаИсточник.ИДТехмаршрутаРодителя;
	СтрокаПриемник.НомерОперации = СтрокаИсточник.НомерОперации;
	СтрокаПриемник.КодОперации = СтрокаИсточник.КодОперации;
	СтрокаПриемник.НаименованиеОперации = СтрокаИсточник.НаименованиеОперации;
	СтрокаПриемник.КодЦеха = СтрокаИсточник.КодЦеха;
	СтрокаПриемник.НаименованиеЦеха = СтрокаИсточник.НаименованиеЦеха; 
	СтрокаПриемник.КодОборудования = СтрокаИсточник.КодОборудования;
	СтрокаПриемник.НаименованиеОборудования = СтрокаИсточник.НаименованиеОборудования;
	СтрокаПриемник.НормаВыработки = СтрокаИсточник.НормаВыработки;
	СтрокаПриемник.ЕдИзмЧ = СтрокаИсточник.ЕдИзмЧ;
	СтрокаПриемник.ПризнакОснМаршрута = СтрокаИсточник.ПризнакОснМаршрута;
	СтрокаПриемник.КоэфтУкрутки = СтрокаИсточник.КоэфтУкрутки;
	СтрокаПриемник.ТехнОтход = СтрокаИсточник.ТехнОтход;
	СтрокаПриемник.АгрегКоэфт = СтрокаИсточник.АгрегКоэфт;
	СтрокаПриемник.ИДТехмаршрутаПФ = СтрокаИсточник.ИДТехмаршрутаПФ;
	СтрокаПриемник.АгрегКоэф_Материалов = СтрокаИсточник.АгрегКоэф_Материалов;
	СтрокаПриемник.Обособленно = ?(СтрокаИсточник.Обособленно = "", Ложь, Истина);
	
КонецПроцедуры

&НаСервере 
Процедура СоздатьЭлементыТаблицыСпецификации()
	
	ВсеПодразделенияБезПрификса = ПолучитьВсеПодразделенияБезПрификса();
	ПерегруппированныеСпецификации = ПерегруппировкаТаблтцыЗначенийПоСпецификациям(); //критерий ид родителя если -1 это головное 
	
	Для Каждого ТекущаяСпецификация из ПерегруппированныеСпецификации Цикл
		 	
		//Попытка
		ЗаполняемаяСпецификация = Справочники.РесурсныеСпецификации.СоздатьЭлемент();
		ПредварительноЗаполнитьСпецификацию(ТекущаяСпецификация.Значение, ЗаполняемаяСпецификация);
		ЗаполнитьВыходныеИзделия(ТекущаяСпецификация.Значение, ЗаполняемаяСпецификация);
	    ЗаполнитьМатериалы(ТекущаяСпецификация.Значение, ЗаполняемаяСпецификация);
       	Этап = Неопределено;
		СозданиеЭтапов(ТекущаяСпецификация.Значение, ЗаполняемаяСпецификация, Этап, ВсеПодразделенияБезПрификса); 
		Если Этап.ПланироватьРаботуВидовРабочихЦентров = Истина и Этап.ВидыРабочихЦентров.Количество() > 0 Тогда
			СозданиеОпераций(ТекущаяСпецификация.Значение, ЗаполняемаяСпецификация, Этап); 
		КонецЕсли;
		//ПроверкаЦех42 = ТекущаяСпецификация.Значение;
		//ПроверкаЦех42 = СтрНайти(ПроверкаЦех42[0].НаименованиеОборудования,"Цех42");
		//Если ПроверкаЦех42  > 0  Тогда
		//	СозданиеОперацииЦех42(ТекущаяСпецификация.Значение, ЗаполняемаяСпецификация, Этап);
		//КонецЕсли;	
		ЗаполняемаяСпецификация.Статус = Перечисления.СтатусыСпецификаций.Действует;
		ЗаполняемаяСпецификация.Записать(); 
		ЗаполнениеСпецификацийВВерхгнуровневыхСпецификациях(ЗаполняемаяСпецификация);
		ЗаполниитьРезультатЗаписи(ТекущаяСпецификация.Значение, ЗаполняемаяСпецификация);
		//Исключение
		//	СтрокаСпецификации.Создано = Ложь;
		//КонецПопытки; 
	КонецЦикла;  
	
	СозданиеСпецификации.Очистить();
	
	Для Каждого ТекущаяСпецификация из ПерегруппированныеСпецификации Цикл
		ТекущаяСпецификация = ТекущаяСпецификация.Значение;
		Если ТекущаяСпецификация[0].ИдРодителя = "-1" Тогда
			 СсылкаНаСпецификацию = ТекущаяСпецификация[0].СсылкаСпецификация;
		     ПрисвоениеПризнаковАгрКоэффициент(СсылкаНаСпецификацию); 
			 Прервать;
		 КонецЕсли;
	КонецЦикла;	 
		
	Для каждого ТекущаяСпецификация Из ПерегруппированныеСпецификации Цикл
		ВыводРезультатаСоздания(ТекущаяСпецификация); 
	КонецЦикла;
	
	ИзменениеУсловногоОформленияСозданияСпецификации();

КонецПроцедуры

&НаСервере 
Функция ПерегруппировкаТаблтцыЗначенийПоСпецификациям()
	
	ПерегруппированныеСпецификации = Новый Структура; 
	ИдентификаторУпорядочивания = 0;
	ТекущаяСпецификация = СозданиеСпецификации.Выгрузить();
	ТекущаяСпецификация.Очистить();
	ИдентификаторРодителя = Неопределено;
	
	
	КодОборудования = Неопределено;
	//Тригер = Неопределено;
	//КолонкиКлюча = "ИдРодителя,КодОборудования";
	КолонкиКлюча = "КодРодителя,КодОборудования";
	мКлючи = СтрРазделить(КолонкиКлюча, ",");
	УникальныеСтроки = СозданиеСпецификации.Выгрузить(, КолонкиКлюча);
	УникальныеСтроки.Свернуть(КолонкиКлюча);
	Для стр = 0 по УникальныеСтроки.Количество() - 1 Цикл 
		СтруктураОтбора = Новый Структура;
		Для каждого текКлюч из мКлючи Цикл
			СтруктураОтбора.Вставить(текКлюч, УникальныеСтроки[стр][текКлюч]);
		КонецЦикла;
		строкиПоКлючу = СозданиеСпецификации.НайтиСтроки(СтруктураОтбора);
		//НадоПрерывать = Ложь;
		Для каждого найдСтрока Из строкиПоКлючу Цикл   
			// исключим приемо сдаточные работы. их добавляют к другим операциям
			Если найдСтрока.НаименованиеОперации = "ПРИЕМО-СДАТОЧНЫЕ ИСПЫТАНИЯ ГОТОВОГО ИЗДЕЛИЯ" Тогда 
				//Надо прерывать. не наша итерация
				//НадоПрерывать = Истина;
				Продолжить;
			КонецЕсли;
			
		//----
			ТекущаяСтрокаСпецификации = ТекущаяСпецификация.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрокаСпецификации, найдСтрока);
			// перенесем норму выработки
			Если ТекущаяСтрокаСпецификации.НормаВыработки = 0 И ТекущаяСтрокаСпецификации.ПризнакОснМаршрута = 0 Тогда
				строкиНормаВырботки =  СозданиеСпецификации.НайтиСтроки(новый Структура("КодРодителя, КодОперации, ПризнакОснМаршрута", ТекущаяСтрокаСпецификации.КодРодителя, ТекущаяСтрокаСпецификации.КодОперации, 1));	
				Если строкиНормаВырботки.количество() Тогда
					ТекущаяСтрокаСпецификации.НормаВыработки = строкиНормаВырботки[0].НормаВыработки;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;  
		//Если НадоПрерывать = Истина Тогда
		//	Продолжить;
		//КонецЕсли;
		
		// теперь проверим наличие приемо сдаточных операций
		//строкиПоКлючу = СозданиеСпецификации.НайтиСтроки(Новый Структура("КодРодителя, ИДТехмаршрутаРодителя, НаименованиеОперации", строкиПоКлючу[0].КодРодителя, строкиПоКлючу[0].ИДТехмаршрутаРодителя, "ПРИЕМО-СДАТОЧНЫЕ ИСПЫТАНИЯ ГОТОВОГО ИЗДЕЛИЯ"));
		//Для каждого найдСтрока Из строкиПоКлючу Цикл
		//	ТекущаяСтрокаСпецификации = ТекущаяСпецификация.Добавить();
		//	ЗаполнитьЗначенияСвойств(ТекущаяСтрокаСпецификации, найдСтрока);
		//КонецЦикла; 
		Если ТекущаяСпецификация.Количество() Тогда
			//ПерегруппированныеСпецификации.Вставить("Спецификация" + стр, ТекущаяСпецификация.Скопировать());
			ПерегруппированныеСпецификации.Вставить("Спец" + формат(стр, "ЧГ=0"), ТекущаяСпецификация.Скопировать());
			ТекущаяСпецификация.Очистить();
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПерегруппированныеСпецификации;
	
КонецФункции 

&НаСервере 
Процедура ДобавитьНовуюСпецификациюВСтруктуру(Ключ, СтараяТекущаяСпецификация, ПерегруппированныеСпецификации)

	ПерегруппированныеСпецификации.Вставить(Ключ, СтараяТекущаяСпецификация);

КонецПроцедуры

&НаСервере 
Процедура ПредварительноЗаполнитьСпецификацию(ТекущаяСпецификация, ЗаполняемаяСпецификация)
	
	ЗаполняемаяСпецификация.Статус = Перечисления.СтатусыСпецификаций.ВРазработке;
	Если ТекущаяСпецификация[0].ПризнакОснМаршрута <> 1 Тогда
		ЗаполняемаяСпецификация.НачалоДействия = Дата - 1;
	Иначе
		ЗаполняемаяСпецификация.НачалоДействия = Дата;
	КонецЕсли;
	ЗаполняемаяСпецификация.Ответственный = Пользователи.ТекущийПользователь();
	ЗаполняемаяСпецификация.Наименование =  ТекущаяСпецификация[0].Родитель + ", " + ТекущаяСпецификация[0].ВРЦ.бит_КрНоим;
	ЗаполняемаяСпецификация.ВариантНазначения = Перечисления.ВариантыНазначенияСпецификации.Номенклатура;
	ЗаполняемаяСпецификация.ВариантПодбораВДокументы = Перечисления.ВариантыПодбораСпецификацииВДокументы.Автоматически;
	ЗаполняемаяСпецификация.ВариантПромежуточногоВыпуска = Перечисления.ВариантыПромежуточногоВыпуска.НеИспользуется;
	ЗаполняемаяСпецификация.ВыпускПроизвольнымиПорциями = Истина;
	ЗаполняемаяСпецификация.ДопустимоеПревышениеОптимальнойПартииВыпуска = 0;
	ЗаполняемаяСпецификация.МногоэтапныйПроизводственныйПроцесс = Ложь; 
	ВидНоменклатуры = ТекущаяСпецификация[0].Изделие.ВидНоменклатуры;
	ЗаполняемаяСпецификация.ОсновноеИзделиеВидНоменклатуры = ВидНоменклатуры; 
	Номенклатура = ТекущаяСпецификация[0].Изделие;
	ЗаполняемаяСпецификация.ОсновноеИзделиеНоменклатура = Номенклатура;
	Если ТекущаяСпецификация[0].ЕдИзмРодителя = "ТН" Тогда 
		ЗаполняемаяСпецификация.ОсновноеИзделиеКоличествоУпаковок = 1000;	
	Иначе 	
		ЗаполняемаяСпецификация.ОсновноеИзделиеКоличествоУпаковок = 1; 
	КонецЕсли; 
	//ЗаполняемаяСпецификация.ОсновноеИзделиеКоличествоУпаковок = 1;
	Если ТекущаяСпецификация[0].ЕдИзмРодителя = "ТН" Тогда 
		//ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("168");
		//Ключ = "168";
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("166");
		Ключ = "166";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ИзделиеЕдИзм;
	ИначеЕсли ТекущаяСпецификация[0].ЕдИзмРодителя = "КМ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("008");
		Ключ = "008";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ИзделиеЕдИзм;
	ИначеЕсли ТекущаяСпецификация[0].ЕдИзмРодителя = "КВМ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("055");
		Ключ = "055";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ИзделиеЕдИзм;
	ИначеЕсли ТекущаяСпецификация[0].ЕдИзмРодителя = "КУБМ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("113");
		Ключ = "113";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ИзделиеЕдИзм;	
	ИначеЕсли ТекущаяСпецификация[0].ЕдИзмРодителя = "ТШТ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("798");
		Ключ = "798";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ИзделиеЕдИзм;		
	Иначе 
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ТекущаяСпецификация[0].Изделие.ЕдиницаДляОтчетов;
	КонецЕсли;
	ЗаполняемаяСпецификация.СпособРаспределенияЗатратНаВыходныеИзделия = Перечисления.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости; 
	ЗаполняемаяСпецификация.ТипПроизводственногоПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Сборка;
		
КонецПроцедуры 

&НаСервере 
Процедура ЗаполнитьВыходныеИзделия(ТекущаяСпецификация, ЗаполняемаяСпецификация)
	
	ПерваяСтрокаТекущейСпецификации = ТекущаяСпецификация[0];
	СтрокаТЗВыходныеИзделия = ЗаполняемаяСпецификация.ВыходныеИзделия.Добавить();
	СтрокаТЗВыходныеИзделия.ВидНоменклатуры = ПерваяСтрокаТекущейСпецификации.Изделие.ВидНоменклатуры;
	СтрокаТЗВыходныеИзделия.Номенклатура = ПерваяСтрокаТекущейСпецификации.Изделие;
	//СтрокаТЗВыходныеИзделия.Характеристика = ПерваяСтрокаТекущейСпецификации.Изделие.Характеристика;  
	Если ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "ТН" Тогда
		//ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("168");
		//Ключ = "168"; 
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("166");
		Ключ = "166"; 
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		СтрокаТЗВыходныеИзделия.Упаковка = ИзделиеЕдИзм;
    ИначеЕсли ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "КМ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("008");
		Ключ = "008";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		СтрокаТЗВыходныеИзделия.Упаковка = ИзделиеЕдИзм;
	 ИначеЕсли ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "КВМ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("055");
		Ключ = "055";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		СтрокаТЗВыходныеИзделия.Упаковка = ИзделиеЕдИзм;
	 ИначеЕсли ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "КУБМ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("113");
		Ключ = "113";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		СтрокаТЗВыходныеИзделия.Упаковка = ИзделиеЕдИзм;	 
	 ИначеЕсли ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "ТШТ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("798");
		Ключ = "798";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		СтрокаТЗВыходныеИзделия.Упаковка = ИзделиеЕдИзм;	 
	 Иначе
		СтрокаТЗВыходныеИзделия.Упаковка = ПерваяСтрокаТекущейСпецификации.Изделие.ЕдиницаДляОтчетов;
	КонецЕсли;
	Если ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "ТН" Тогда 
		СтрокаТЗВыходныеИзделия.КоличествоУпаковок = 1000;	
	Иначе 	
		СтрокаТЗВыходныеИзделия.КоличествоУпаковок = 1; 
	КонецЕсли;
	//СтрокаТЗВыходныеИзделия.КоличествоУпаковок = 1;
	СтрокаТЗВыходныеИзделия.ТребуетсяУказыватьСерии = Ложь;
	СтрокаТЗВыходныеИзделия.ПроцентБрака = 0;
	СтрокаТЗВыходныеИзделия.ОбработатьПоСпецификации = Ложь;
	СтрокаТЗВыходныеИзделия.СпособАвтовыбораНоменклатуры = Перечисления.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ;
	СтрокаТЗВыходныеИзделия.СпособАвтовыбораХарактеристики = Перечисления.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ;
	СтрокаТЗВыходныеИзделия.КлючСвязи = Новый УникальныйИдентификатор();
	
	ВидНоменклатуры = ПерваяСтрокаТекущейСпецификации.Изделие.ВидНоменклатуры;
	ЗаполняемаяСпецификация.ОсновноеИзделиеВидНоменклатуры = ВидНоменклатуры; 
	Номенклатура = ПерваяСтрокаТекущейСпецификации.Изделие;
	ЗаполняемаяСпецификация.ОсновноеИзделиеНоменклатура = Номенклатура;
	Если ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "ТН" Тогда 
		ЗаполняемаяСпецификация.ОсновноеИзделиеКоличествоУпаковок = 1000;	
	Иначе 	
		ЗаполняемаяСпецификация.ОсновноеИзделиеКоличествоУпаковок = 1; 
	КонецЕсли;
	//ЗаполняемаяСпецификация.ОсновноеИзделиеКоличествоУпаковок = 1;   
	Если ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "ТН" Тогда 
		//ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("168");
		//Ключ = "168";
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("166");
		Ключ = "166";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ИзделиеЕдИзм;
	ИначеЕсли ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "КМ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("008");
		Ключ = "008";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ИзделиеЕдИзм;
	ИначеЕсли ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "КВМ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("055");
		Ключ = "055";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ИзделиеЕдИзм;	
	ИначеЕсли ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "КУБМ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("113");
		Ключ = "113";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ИзделиеЕдИзм;	
	ИначеЕсли ПерваяСтрокаТекущейСпецификации.ЕдИзмРодителя = "ТШТ" Тогда
		ЕдИзмИзделие = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("798");
		Ключ = "798";
		ИзделиеЕдИзм = ЕдИзмИзделие.Получить(Ключ); 
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ИзделиеЕдИзм;	
	Иначе
		ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка = ПерваяСтрокаТекущейСпецификации.Изделие.ЕдиницаДляОтчетов;
	КонецЕсли;

КонецПроцедуры

 &НаСервере 
Процедура ЗаполнитьМатериалы(ТекущаяСпецификация, ЗаполняемаяСпецификация)
	
	ТекущийМатериал = Неопределено;
	ТекущаяСпецификация.Сортировать("КодПФИлиМатериала, ИДТехмаршрутаРодителя Убыв");
	
	Для Каждого Строка из ТекущаяСпецификация Цикл
		
		Если ТекущийМатериал <> Строка.Материал Тогда 
			ЗаполнитьСтрокуМатериалы(ЗаполняемаяСпецификация, Строка);
		КонецЕсли;	
		
		ТекущийМатериал = Строка.Материал;
		
	КонецЦикла;	
	
	ЗаполняемаяСпецификация.Записать();
	Для Каждого Запись Из ТекущаяСпецификация Цикл
		 Запись.СсылкаСпецификация = ЗаполняемаяСпецификация.Ссылка;
	 КонецЦикла;
	 
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСтрокуМатериалы(ЗаполняемаяСпецификация, Строка)
	
	ДоработкаПризнаков(Строка);
	
	СтрокаТЗМатериалыИУслуги = ЗаполняемаяСпецификация.МатериалыИУслуги.Добавить(); 
	СтрокаТЗМатериалыИУслуги.Номенклатура = Строка.Материал; 
	Если Строка.Тип = "4" Тогда 
		СтрокаТЗМатериалыИУслуги.СтатьяКалькуляции =  Справочники.СтатьиКалькуляции.ПолуфабрикатыПроизводимыеВПроцессе; 
		СтрокаТЗМатериалыИУслуги.ПроизводитсяВПроцессе = Истина;
		СтрокаТЗМатериалыИУслуги.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации;
		ПопыткаЗаполнитьСпецификациюМатериала(СтрокаТЗМатериалыИУслуги);
    ИначеЕсли Строка.Тип = "6" Тогда 
		СтрокаТЗМатериалыИУслуги.СтатьяКалькуляции =  Справочники.СтатьиКалькуляции.НайтиПоРеквизиту("ИдентификаторДляФормул", "Материалы"); 
		СтрокаТЗМатериалыИУслуги.ПроизводитсяВПроцессе =  Ложь;
		СтрокаТЗМатериалыИУслуги.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.Обеспечивать;
		СтрокаТЗМатериалыИУслуги.Обособленно = Ложь;
	КонецЕсли;
	СтрокаТЗМатериалыИУслуги.СпособАвтовыбораНоменклатуры = Перечисления.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ;
	СтрокаТЗМатериалыИУслуги.СпособАвтовыбораХарактеристики = Перечисления.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ;
	СтрокаТЗМатериалыИУслуги.КлючСвязи = Новый УникальныйИдентификатор(); 
	СтрокаТЗМатериалыИУслуги.ТребуетсяУказыватьСерии = Ложь;
	СтрокаТЗМатериалыИУслуги.Альтернативный = Ложь; 
	//ЗаполнениеКоличестваИЕдИзмМатериала(Строка, СтрокаТЗМатериалыИУслуги);
	ЗаполнениеКоличестваИЕдИзмМатериалаПоЛТ33(Строка, СтрокаТЗМатериалыИУслуги);
	
	// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 9:00:07] +        
	// задача 5
	СтрокаТЗМатериалыИУслуги.Обособленно = Строка.Обособленно;
	// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 9:00:07] -
КонецПроцедуры	

&НаСервере 
Процедура ДоработкаПризнаков(Строка)
	
	МассивНедопустимыхОпераций = Новый Массив;
	//МассивНедопустимыхОпераций.Добавить("302429");
	//МассивНедопустимыхОпераций.Добавить("306001");
	//МассивНедопустимыхОпераций.Добавить("306003"); 
	//МассивНедопустимыхОпераций.Добавить("306008");
	//МассивНедопустимыхОпераций.Добавить("306009");
	//МассивНедопустимыхОпераций.Добавить("306010");
	//МассивНедопустимыхОпераций.Добавить("306011");
	//МассивНедопустимыхОпераций.Добавить("306012");
	//МассивНедопустимыхОпераций.Добавить("306013");
	//МассивНедопустимыхОпераций.Добавить("306014");
	//МассивНедопустимыхОпераций.Добавить("306015");
	//МассивНедопустимыхОпераций.Добавить("306023");
	//МассивНедопустимыхОпераций.Добавить("306026");
	//МассивНедопустимыхОпераций.Добавить("307002");
	//МассивНедопустимыхОпераций.Добавить("307014");
	//МассивНедопустимыхОпераций.Добавить("307064");
	//МассивНедопустимыхОпераций.Добавить("308055");
	
	ЕстьАгрКоэфПредшественника = ПроверкаАгрКоэф(Строка);
	
	Если ЗначениеЗаполнено(Строка.АгрегКоэфт) Или ЕстьАгрКоэфПредшественника Тогда
		ТекАгрК =  Число(Строка.АгрегКоэфт);	
		Если ТекАгрК > 1 или ЕстьАгрКоэфПредшественника Тогда
			СоздатьПризнак(Строка);
		ИначеЕсли ((ТекАгрК < 1) и (ТекАгрК > 0)) или ЕстьАгрКоэфПредшественника Тогда
			Если МассивНедопустимыхОпераций.Найти(Строка.КодОперации) = Неопределено Тогда
				СоздатьПризнак(Строка);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	  
КонецПроцедуры 

&НаСервере 
Функция ПроверкаАгрКоэф(Строка)  
	
	ЕстьАгрКоэфПредшественника = Ложь;
	Отбор = Новый Структура();
    Отбор.Вставить("Изделие", Строка.Материал);
	ВыдоркаСтрок = СозданиеСпецификации.НайтиСтроки(Отбор);
	Если ВыдоркаСтрок.Количество() > 0 Тогда
		Для Каждого Элемент из ВыдоркаСтрок Цикл
			Если ЗначениеЗаполнено(Элемент.АгрегКоэфт) Тогда
				ТекАгрК =  Число(Элемент.АгрегКоэфт);
				Если ТекАгрК > 1 Тогда
					ЕстьАгрКоэфПредшественника = Истина;
				ИначеЕсли (ТекАгрК < 1) и (ТекАгрК > 0) Тогда
					ЕстьАгрКоэфПредшественника = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Возврат ЕстьАгрКоэфПредшественника;
	
КонецФункции

&НаСервере 
Процедура СоздатьПризнак(Строка);
	
	бит_Признак = ПланыВидовХарактеристик.бит_ПризнакиНоменклатуры.НайтиПоКоду("COND_CORE");
	Отбор = Новый Структура;
	Отбор.Вставить("бит_Номенклатура", Строка.Материал);
	ПризнакиНоменклатуры = РегистрыСведений.бит_ЗначенияПризнаковНоменклатуры.Выбрать(Отбор);
	Итератор = 0;
	Пока ПризнакиНоменклатуры.Следующий() Цикл
		Если ПризнакиНоменклатуры.бит_Признак = бит_Признак и ПризнакиНоменклатуры.бит_Значение = Истина Тогда
			Итератор = Итератор +1;
		КонецЕсли;
	КонецЦикла;
	
	Если Итератор = 0  Тогда
		МенеджерЗаписи = РегистрыСведений.бит_ЗначенияПризнаковНоменклатуры.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.бит_Номенклатура = Строка.Материал;
		МенеджерЗаписи.бит_Признак = ПланыВидовХарактеристик.бит_ПризнакиНоменклатуры.НайтиПоКоду("COND_CORE");
		МенеджерЗаписи.бит_ПризнакСертификации = МенеджерЗаписи.бит_Признак.бит_ПризнакСертификации;
		МенеджерЗаписи.бит_Значение = Истина;
		
		МенеджерЗаписи.Записать();	
	КонецЕсли;	
			
КонецПроцедуры

&НаСервере 
Процедура ПопыткаЗаполнитьСпецификациюМатериала(СтрокаТЗМатериалыИУслуги)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсныеСпецификации.Ссылка КАК Ссылка,
		|	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура
		|ИЗ
		|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|ГДЕ
		|	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура = &Номенклатура
		|	И РесурсныеСпецификации.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТЗМатериалыИУслуги.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();;
	Если РезультатЗапроса.Количество() = 1 Тогда; 
		//СтрокаТЗМатериалыИУслуги.ИсточникПолученияПолуфабриката = РезультатЗапроса[0].Ссылка;
		СтрокаТЗМатериалыИУслуги.Обособленно = Истина;
	Иначе 
		СтрокаТЗМатериалыИУслуги.Обособленно = Ложь;  
	КонецЕсли;	 
	    
КонецПроцедуры

&НаСервере 
Процедура  ЗаполнениеКоличестваИЕдИзмМатериала(Строка, СтрокаТЗМатериалыИУслуги)

	ЕдИзмМатериал = Неопределено; 
	КоличествоМатериала = Строка.КолвоПозицииВарианта;
	Если Строка.ЕдИзм = "КМ" Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("008");
		Ключ = "008";
	//ИначеЕсли Строка.ЕдИзм = "ТН" Тогда
	//	ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("168");
	//	 Ключ = "168"; 
	//ИначеЕсли Строка.ЕдИзм = "КГ" Тогда
	//	ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("166");
	//	Ключ = "166";
	ИначеЕсли (Строка.ЕдИзм = "КГ") или (Строка.ЕдИзм = "ТН") Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("166");
		Ключ = "166";
	ИначеЕсли Строка.ЕдИзм = "М" Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("006");
		Ключ = "006";
	ИначеЕсли Строка.ЕдИзм = "КВМ" Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("055");
		Ключ = "055";
	ИначеЕсли Строка.ЕдИзм = "КУБМ" Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("113");
		Ключ = "113";
	ИначеЕсли Строка.ЕдИзм = "ТШТ" Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("798");
		Ключ = "798";	
	Иначе
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(Строка.ЕдИзм);
	КонецЕсли;	
	
	Если ЕдИзмМатериал  = Неопределено Тогда
		СтрокаОшибокСпецификации = ОшибокСпецификации.Добавить(); 
		ЗаполнитьСтрокуТаблицыПроверкиСпецификации(СтрокаОшибокСпецификации, 
		Строка);
		СтрокаОшибокСпецификации.Ошибка = "Материал записан с некорректной единицей измерения!";
		ЕдИзмМатериал =  Строка.Материал.ЕдиницаИзмерения;
	КонецЕсли;
 
	БазоваяЕдИзм = Строка.Материал.ЕдиницаИзмерения;
	
	Если  БазоваяЕдИзм = ЕдИзмМатериал.Получить(Ключ) Тогда
		СтрокаТЗМатериалыИУслуги.Упаковка = БазоваяЕдИзм;
		СтрокаТЗМатериалыИУслуги.КоличествоУпаковок = КоличествоМатериала;
		Если Строка.ЕдИзм = "ТН" Тогда 
			СтрокаТЗМатериалыИУслуги.Упаковка = ЕдИзмМатериал.Получить(Ключ);
			СтрокаТЗМатериалыИУслуги.КоличествоУпаковок = КоличествоМатериала *1000;
		КонецЕсли;
	Иначе 
		ЕдИзмМатериал = ЕдИзмМатериал.Получить(Ключ);
		СтрокаТЗМатериалыИУслуги.Упаковка = Строка.Материал.ЕдиницаИзмерения;
		СтрокаТЗМатериалыИУслуги.КоличествоУпаковок = КоличествоМатериала * ЕдИзмМатериал.Числитель / ЕдИзмМатериал.Знаменатель;
		Если Строка.ЕдИзм = "ТН" Тогда 
			СтрокаТЗМатериалыИУслуги.Упаковка = ЕдИзмМатериал.Получить(Ключ);
			СтрокаТЗМатериалыИУслуги.КоличествоУпаковок = КоличествоМатериала *1000;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаСервере 
Процедура ЗаполнениеКоличестваИЕдИзмМатериалаПоЛТ33(Строка, СтрокаТЗМатериалыИУслуги)
	
	БазоваяЕдИзм = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	ЕдИзмМатериал = Неопределено; 
	КоличествоМатериала = Строка.КолвоПозицииВарианта;
	Если Строка.ЕдИзм = "КМ" Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("008");
		Ключ = "008";
	//ИначеЕсли Строка.ЕдИзм = "ТН" Тогда
	//	ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("168");
	//	 Ключ = "168";
	//ИначеЕсли Строка.ЕдИзм = "КГ" Тогда
	//	ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("166");
	//	Ключ = "166"; 
	ИначеЕсли (Строка.ЕдИзм = "КГ") или (Строка.ЕдИзм = "ТН") Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("166");
		Ключ = "166";
	ИначеЕсли Строка.ЕдИзм = "М" Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("006");
		Ключ = "006"; 
	ИначеЕсли Строка.ЕдИзм = "КВМ" Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("055");
		Ключ = "055";
	ИначеЕсли Строка.ЕдИзм = "КУБМ" Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("113");
		Ключ = "113";
	ИначеЕсли Строка.ЕдИзм = "ТШТ" Тогда
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора("798");
		Ключ = "798";	
	Иначе
		ЕдИзмМатериал = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию(Строка.ЕдИзм);
	КонецЕсли;
	
	Если ЕдИзмМатериал  = Неопределено Тогда
		СтрокаОшибокСпецификации = ОшибокСпецификации.Добавить(); 
		ЗаполнитьСтрокуТаблицыПроверкиСпецификации(СтрокаОшибокСпецификации, 
		Строка);
		СтрокаОшибокСпецификации.Ошибка = "Материал записан с некорректной единицей измерения!";
		ЕдИзмМатериал =  Строка.Материал.ЕдиницаИзмерения;
	КонецЕсли;
 
	//СтрокаТЗМатериалыИУслуги.бит_ТехнологическийОтход = (Число(Строка.ТехнОтход) - 1) * 100;
	Если ЗначениеЗаполнено(Строка.ТехнОтход) Тогда
		Если Строка.ТехнОтход > 0 Тогда
			бит_ТехОтход = Строка.ТехнОтход;
			Если Строка.ТехнОтход >= 1 Тогда
				СтрокаТЗМатериалыИУслуги.бит_ТехнологическийОтход = (Строка.ТехнОтход - 1) * 100;
			Иначе
				СтрокаТЗМатериалыИУслуги.бит_ТехнологическийОтход = Строка.ТехнОтход * 100;
			КонецЕсли;  
		Иначе
			СтрокаТЗМатериалыИУслуги.бит_ТехнологическийОтход = Строка.ТехнОтход;	
		КонецЕсли;
	Иначе
		бит_ТехОтход = 0;
	КонецЕсли;
	СтрокаТЗМатериалыИУслуги.бит_КоэффициентУкрутки = Строка.КоэфтУкрутки;
			
	БазоваяЕдИзм = Строка.Материал.ЕдиницаИзмерения;
	Если (Строка.ЕдИзм = "КГ") 
		Или (Строка.ЕдИзм = "ТН")  
		Или (Строка.ЕдИзм = "М")
		Или  (Строка.ЕдИзм = "КМ") 
		Или  (Строка.ЕдИзм = "КВМ") 
		Или  (Строка.ЕдИзм = "КУБМ")
		Или  (Строка.ЕдИзм = "ТШТ") Тогда
		ЕдИзм = ЕдИзмМатериал.Получить(Ключ); 
	Иначе
		ЕдИзм = ЕдИзмМатериал; 
	КонецЕсли;
	
	Если  БазоваяЕдИзм = ЕдИзм Тогда
		СтрокаТЗМатериалыИУслуги.Упаковка = БазоваяЕдИзм;
		СтрокаТЗМатериалыИУслуги.бит_КоличествоПозиции = КоличествоМатериала; 
		Если Строка.ЕдИзм = "ТН" Тогда 
			СтрокаТЗМатериалыИУслуги.Упаковка = ЕдИзмМатериал.Получить(Ключ);
			СтрокаТЗМатериалыИУслуги.бит_КоличествоПозиции = КоличествоМатериала *1000;
		КонецЕсли;
	Иначе
		СтрокаТЗМатериалыИУслуги.Упаковка = Строка.Материал.ЕдиницаИзмерения;
		СтрокаТЗМатериалыИУслуги.бит_КоличествоПозиции = КоличествоМатериала * ЕдИзм.Числитель / ЕдИзм.Знаменатель;
		Если Строка.ЕдИзм = "ТН" Тогда 
			СтрокаТЗМатериалыИУслуги.Упаковка = ЕдИзмМатериал.Получить(Ключ);
			СтрокаТЗМатериалыИУслуги.бит_КоличествоПозиции = КоличествоМатериала *1000;
		КонецЕсли;
	КонецЕсли;	
	
	
	Если ЕстьМеталлосодержащаяТокопроводящаяЖила(СтрокаТЗМатериалыИУслуги.Номенклатура) Тогда
		Если бит_ТехОтход = 0 Тогда 
			СтрокаТЗМатериалыИУслуги.бит_АгрегирующийКоэффициент = Строка.АгрегКоэф_Материалов;
			СтрокаТЗМатериалыИУслуги.КоличествоУпаковок = СтрокаТЗМатериалыИУслуги.бит_КоличествоПозиции * 
			?(СтрокаТЗМатериалыИУслуги.бит_АгрегирующийКоэффициент = 0, 1, СтрокаТЗМатериалыИУслуги.бит_АгрегирующийКоэффициент) * 
			?(СтрокаТЗМатериалыИУслуги.бит_КоэффициентУкрутки = 0, 1, СтрокаТЗМатериалыИУслуги.бит_КоэффициентУкрутки);
		Иначе
			СтрокаТЗМатериалыИУслуги.бит_АгрегирующийКоэффициент = 0;
			СтрокаТЗМатериалыИУслуги.КоличествоУпаковок = СтрокаТЗМатериалыИУслуги.бит_КоличествоПозиции * 
			(1 + СтрокаТЗМатериалыИУслуги.бит_ТехнологическийОтход/100) * 
			?(СтрокаТЗМатериалыИУслуги.бит_КоэффициентУкрутки = 0, 1, СтрокаТЗМатериалыИУслуги.бит_КоэффициентУкрутки);
		КонецЕсли;
	Иначе  
		СтрокаТЗМатериалыИУслуги.бит_АгрегирующийКоэффициент = 0;		  
		СтрокаТЗМатериалыИУслуги.КоличествоУпаковок = СтрокаТЗМатериалыИУслуги.бит_КоличествоПозиции * 
		(1 + СтрокаТЗМатериалыИУслуги.бит_ТехнологическийОтход/100) * 
		?(СтрокаТЗМатериалыИУслуги.бит_КоэффициентУкрутки = 0, 1, СтрокаТЗМатериалыИУслуги.бит_КоэффициентУкрутки);
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьМеталлосодержащаяТокопроводящаяЖила(Номенклатура) 
		
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура КАК бит_Номенклатура
	                      |ИЗ
	                      |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
	                      |ГДЕ
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &Номенклатура
	                      |	И бит_ЗначенияПризнаковНоменклатуры.бит_ПризнакСертификации В(&мПризнаков)
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура
	                      |ИЗ
	                      |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
	                      |ГДЕ
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &Номенклатура
	                      |	И бит_ЗначенияПризнаковНоменклатуры.бит_Признак В(&мПризнаков)");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("мПризнаков", Справочники.бит_ЗначенияПоУмолчанию.ПризнакиДляРасчетаАгрегКоэффициента.Значения.ВыгрузитьКолонку("Значение")); 

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

 &НаСервере 
Процедура СозданиеЭтапов(ТекущаяСпецификация, ЗаполняемаяСпецификация, Этап, ВсеПодразделенияБезПрификса)
	     
	   НовыйЭтап = Справочники.ЭтапыПроизводства.СоздатьЭлемент();
	   НовыйЭтап.Наименование = ЗаполняемаяСпецификация.Номенклатура.Наименование;
	   НовыйЭтап.Владелец = ЗаполняемаяСпецификация.Ссылка;
	   НовыйЭтап.НомерЭтапа = 1;
	   НовыйЭтап.НомерСледующегоЭтапа = 0;  
	   ВыпускающийЦех = ТекущаяСпецификация[0].НаименованиеЦеха;
	   Если ВыпускающийЦех = "ОСНОВНОЕ ПРОИЗВОДСТВО" Тогда
		   НовыйЭтап.Подразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ОСНОВНОЕ ПРОИЗВОДСТВО");
	   ИначеЕсли ВыпускающийЦех = "Цех №2" Тогда 
		   НовыйЭтап.Подразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию("Цех №2");
	   Иначе
		   СтрокаОшибокСпецификации = ОшибокСпецификации.Добавить(); 
		   ЗаполнитьСтрокуТаблицыПроверкиСпецификации(СтрокаОшибокСпецификации, 
		   ТекущаяСпецификация[0]);
		   СтрокаОшибокСпецификации.Ошибка = "Подразделение этапа не сопоставлено!";
		   НовыйЭтап.Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();    
	   КонецЕсли;   
	   НовыйЭтап.ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий = 0; // но это не точно
	   НовыйЭтап.ПланироватьРаботуВидовРабочихЦентров = Истина;
	   НовыйЭтап.ПредварительныйБуфер = 0;
	   НовыйЭтап.ЗавершающийБуфер = 0;
	   НовыйЭтап.ЕдиницаИзмеренияПредварительногоБуфера =  Перечисления.ЕдиницыИзмеренияВремени.День; //Стоит день, но возможно нужно подбирать
	   НовыйЭтап.ЕдиницаИзмеренияЗавершающегоБуфера =  Перечисления.ЕдиницыИзмеренияВремени.День; //Стоит день, но возможно нужно подбирать
	   НовыйЭтап.Непрерывный = Ложь; // но это не точно
	   НовыйЭтап.ПроизводствоНаСтороне = Ложь;
	   НовыйЭтап.МаксимальноеКоличествоЕдиницПартийИзделия = 0;
	   НовыйЭтап.ЗанимаемаяМощность = 100;
	   НовыйЭтап.КоэффициентМаршрутнойКарты = 0;
	   НовыйЭтап.ЕстьПараметризацияРесурсов = Ложь;
	   //НовыйЭтап.УдалитьВидыРабочихЦентровСФормуламиОбновлены = Ложь;
	   //НовыйЭтап.УдалитьОдновременноПроизводимоеКоличествоЕдиницПартийИзделий = 1;
	  НовыйЭтап.ПорядокРаботыВидовРабочихЦентров = Перечисления.ПорядокРаботыВидовРабочихЦентров.Одновременно;  
	  
	   ТЗЭтапа = ТекущаяСпецификация.Скопировать(, "ИДТехмаршрутаРодителя, НомерОперации, КодОперации, НаименованиеОперации, КодЦеха, НаименованиеЦеха, КодОборудования, НаименованиеОборудования, НормаВыработки, ПризнакОснМаршрута, ВРЦ");
	   ТЗЭтапа.Свернуть("ИДТехмаршрутаРодителя, НомерОперации, КодОперации, НаименованиеОперации, КодЦеха, НаименованиеЦеха, КодОборудования, НаименованиеОборудования, НормаВыработки, ПризнакОснМаршрута,ВРЦ");
	   ПроверкаНаличияОсновногоМаршрута(ТЗЭтапа);
	   ТЗЭтапа.Сортировать("НомерОперации Возр, ПризнакОснМаршрута Убыв");
	   ЗаполнениеВРЦАльтернативныеВРЦ(НовыйЭтап, ТЗЭтапа);
	  
	   Если НовыйЭтап.ВидыРабочихЦентров.Количество() = 0 
		   Или (НовыйЭтап.ВидыРабочихЦентров.Количество() = 1 и НовыйЭтап.ВидыРабочихЦентров[0].ВремяРаботы = 0) Тогда 
		   НовыйЭтап.ПланироватьРаботуВидовРабочихЦентров = Ложь; 
		   НовыйЭтап.ДлительностьЭтапа = 1; 
		   НовыйЭтап.ЕдиницаИзмеренияДлительностиЭтапа = Перечисления.ЕдиницыИзмеренияВремени.Час;
	   Иначе
		   ПодобратьИнтервалПланирования(НовыйЭтап);
		   НовыйЭтап.ПорядокРаботыВидовРабочихЦентров = Перечисления.ПорядокРаботыВидовРабочихЦентров.Последовательно; 
	   КонецЕсли; 
		
	   Попытка  
		   НовыйЭтап.Записать();   
		   ЗаполняемаяСпецификация.ОсновноеИзделиеЭтап = НовыйЭтап;
		   ЗаполняемаяСпецификация.ВыходныеИзделия[0].Этап = НовыйЭтап;
		   Для Каждого Материал из ЗаполняемаяСпецификация.МатериалыИУслуги Цикл
			   Материал.Этап = НовыйЭтап; 
			   Материал.ЭтапРедактирование = НовыйЭтап;
		   КонецЦикла;	 
		   Этап = НовыйЭтап;
		Исключение
			Для Каждого Запись Из ТекущаяСпецификация Цикл
			СтрокаОшибокСпецификации = ОшибокСпецификации.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиСпецификации(СтрокаОшибокСпецификации, 
			                                                         Запись);
			СтрокаОшибокСпецификации.Ошибка = "Этап не записан/записан некорректно!";	
			КонецЦикла;	
		КонецПопытки; 
		
КонецПроцедуры

&НаСервере 
Процедура ПроверкаНаличияОсновногоМаршрута(ТЗЭтапа)
	
	ИдентификаторОснМаршрута = 1;
	СтрокаОсновногоМаршрута = ТЗЭтапа.Найти(ИдентификаторОснМаршрута, "ПризнакОснМаршрута");
	Если СтрокаОсновногоМаршрута = Неопределено Тогда
		ТЗЭтапа.Сортировать("ИДТехмаршрутаРодителя Убыв");
		ТекИдентификатор = Неопределено;
		Для Каждого Строка из ТЗЭтапа Цикл
			
			Если ТекИдентификатор = Строка.ИДТехмаршрутаРодителя или ТекИдентификатор = Неопределено Тогда 
				Строка.ПризнакОснМаршрута = 1;
			КонецЕсли;
			
			ТекИдентификатор =  Строка.ИДТехмаршрутаРодителя;
			
		КонецЦикла;	
	КонецЕсли; 

КонецПроцедуры

 &НаСервере 
Процедура ЗаполнениеВРЦАльтернативныеВРЦ(НовыйЭтап, ТЗЭтапа)
	
	НомерОпрации = Неопределено; 
	 
	Для Каждого ВидРЦ из ТЗЭтапа Цикл
		
		// Если СтрНайти(ВидРЦ.НаименованиеОперации, "ФИКТИВНАЯ ОПЕРАЦИЯ")  > 0
		//    Или СтрНайти(ВидРЦ.НаименованиеОперации, "Фиктивная операция")  > 0 
		//	Или СтрНайти(ВидРЦ.НаименованиеОборудования, "Цех42")  > 0 Тогда 
		//	НовыйЭтап.ВидыРабочихЦентров.Очистить();
		//	НовыйЭтап.АльтернативныеВидыРабочихЦентров.Очистить();
		//	Прервать
		//КонецЕсли; 
				
		ВРЦФиктивный = Неопределено;
		
		Если ВидРЦ.ПризнакОснМаршрута = 1 и (НомерОпрации = Неопределено или НомерОпрации <> ВидРЦ.НомерОперации) Тогда
			
			//Если    СтрНайти(ВидРЦ.НаименованиеОборудования, "РУЧНАЯ ОПЕРАЦИЯ")  > 0
			//	Или СтрНайти(ВидРЦ.НаименованиеОборудования, "Ручная операция")  > 0
			//	Или СтрНайти(ВидРЦ.НаименованиеОборудования, "ФИКТИВНАЯ ОПЕРАЦИЯ")  > 0
			//    Или СтрНайти(ВидРЦ.НаименованиеОборудования, "Фиктивная операция")  > 0
			//    Тогда
			//	ОсновнойВРЦФиктивный = Истина;
			//	ВРЦФиктивный = Истина;
			//	Продолжить;
			//Иначе
			//	ОсновнойВРЦФиктивный = Ложь;
			//	ВРЦФиктивный = Ложь;  
			//КонецЕсли;
			
			Если ЗначениеЗаполнено(ВидРЦ.ВРЦ) Тогда
				ОсновнойВидРабочегоЦента = НовыйЭтап.ВидыРабочихЦентров.Добавить();
				ОсновнойВидРабочегоЦента.ВидРабочегоЦентра = ВидРЦ.ВРЦ;
				ПолучитьВремяРаботыИЕдИзмВремени(ОсновнойВидРабочегоЦента, ВидРЦ);
				Если ОсновнойВидРабочегоЦента.ВремяРаботы = 0 Тогда
					ОсновнойВидРабочегоЦента.ВремяРаботы = 1;
					ОсновнойВидРабочегоЦента.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час;
				КонецЕсли;
				ОсновнойВидРабочегоЦента.КлючСвязи = Новый УникальныйИдентификатор();
			Иначе
				Продолжить;
			КонецЕсли;
			
		ИначеЕсли ВидРЦ.ПризнакОснМаршрута = 0 
			И НомерОпрации = ВидРЦ.НомерОперации 
			И ЗначениеЗаполнено(ОсновнойВидРабочегоЦента.ВидРабочегоЦентра) Тогда
			Если ОсновнойВидРабочегоЦента.ВидРабочегоЦентра <> ВидРЦ.ВРЦ Тогда	 
				//Если    СтрНайти(ВидРЦ.НаименованиеОборудования, "РУЧНАЯ ОПЕРАЦИЯ") > 0
				//	Или СтрНайти(ВидРЦ.НаименованиеОборудования, "Ручная операция") > 0
				//	Или СтрНайти(ВидРЦ.НаименованиеОборудования, "ФИКТИВНАЯ ОПЕРАЦИЯ") > 0
				//	Или СтрНайти(ВидРЦ.НаименованиеОборудования, "Фиктивная операция") > 0
				//	Или ОсновнойВРЦФиктивный = Истина
				//	Тогда 
				//	АльтернативныйВРЦФиктивный = Истина;
				//	ВРЦФиктивный = Истина;
				//	Продолжить;
				//Иначе
				//	АльтернативныйВРЦФиктивный = Ложь;
				//	ВРЦФиктивный = Ложь;  
				//КонецЕсли;
				Если ЗначениеЗаполнено(ВидРЦ.ВРЦ) Тогда
					АльтернативныйВидРабочегоЦентра = НовыйЭтап.АльтернативныеВидыРабочихЦентров.Добавить();
					АльтернативныйВидРабочегоЦентра.ВидРабочегоЦентра =  ВидРЦ.ВРЦ;
					ПолучитьВремяРаботыИЕдИзмВремени(АльтернативныйВидРабочегоЦентра, ВидРЦ);
					Если АльтернативныйВидРабочегоЦентра.ВремяРаботы = 0 Тогда
						АльтернативныйВидРабочегоЦентра.ВремяРаботы = ОсновнойВидРабочегоЦента.ВремяРаботы;
						АльтернативныйВидРабочегоЦентра.ЕдиницаИзмерения = ОсновнойВидРабочегоЦента.ЕдиницаИзмерения;
					КонецЕсли;
					АльтернативныйВидРабочегоЦентра.КлючСвязиВидыРабочихЦентров = ОсновнойВидРабочегоЦента.КлючСвязи;
					АльтернативныйВидРабочегоЦентра.КлючСвязи = Новый УникальныйИдентификатор();
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
		
		Если  НовыйЭтап.ВидыРабочихЦентров.Количество() > 0 Тогда 
			Если ЗначениеЗаполнено(ОсновнойВидРабочегоЦента.ВидРабочегоЦентра) Тогда
				НомерОпрации = ВидРЦ.НомерОперации; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры 

&НаСервере 
Процедура ПолучитьВремяРаботыИЕдИзмВремени(ВидРабочегоЦента, ВидРЦ)
	
	Если Число(ВидРЦ.НормаВыработки) = 0 Тогда
		ВидРабочегоЦента.ВремяРаботы = 0;
		ВидРабочегоЦента.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час;
	Иначе
		КоличествоИзделийВЧас = 1 / ВидРЦ.НормаВыработки; 
		КоличествоИзделийВМинуту = КоличествоИзделийВЧас * 60;
		Если КоличествоИзделийВМинуту < 0.1 Тогда
			КоличествоИзделийВСекунду = КоличествоИзделийВМинуту * 60; 
			ВидРабочегоЦента.ВремяРаботы = КоличествоИзделийВСекунду;
			ВидРабочегоЦента.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Секунда;
		Иначе
			ВидРабочегоЦента.ВремяРаботы = КоличествоИзделийВМинуту;  
			ВидРабочегоЦента.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Минута; 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

 &НаСервере 
Процедура ПодобратьИнтервалПланирования(НовыйЭтап)
	
	ТаблицаДокумента = НовыйЭтап.ВидыРабочихЦентров;
	ТаблицаПодбора = ТаблицаДокумента.Выгрузить(, "ВидРабочегоЦентра, ВремяРаботы, ЕдиницаИзмерения");
	Для Каждого Запись из ТаблицаПодбора Цикл
		Если Запись.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда
			Запись.ВремяРаботы =  Запись.ВремяРаботы * 60;
			Запись.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час; 
		ИначеЕсли Запись.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда 	
			Запись.ВремяРаботы =  Запись.ВремяРаботы * 60 * 60;
			Запись.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час;
		КонецЕсли;
	КонецЦикла;
	//ТаблицаПодбора.Свернуть("ВидРабочегоЦентра, ЕдиницаИзмерения","ВремяРаботы");
	//ТаблицаПодбора.Сортировать("ВремяРаботы Убыв");
	СуммарноеВремяРаботы = 0; 
	Для Каждого Запись из ТаблицаПодбора Цикл
	СуммарноеВремяРаботы = Запись.ВремяРаботы + СуммарноеВремяРаботы;	
	КонецЦикла;
	МаксимальноеВремя = СуммарноеВремяРаботы /60 /60;
	Если МаксимальноеВремя = Окр(МаксимальноеВремя, 0) Тогда
		НовыйЭтап.ДлительностьЭтапа = МаксимальноеВремя;
	ИначеЕсли МаксимальноеВремя < Окр(МаксимальноеВремя, 0) Тогда
		НовыйЭтап.ДлительностьЭтапа = Окр(МаксимальноеВремя, 0);
	Иначе
		НовыйЭтап.ДлительностьЭтапа = Окр(МаксимальноеВремя, 0) + 1;
	КонецЕсли;
	НовыйЭтап.ЕдиницаИзмеренияДлительностиЭтапа = Перечисления.ЕдиницыИзмеренияВремени.Час; 	
КонецПроцедуры

&НаСервере 
Процедура СозданиеОпераций(ТекущаяСпецификация, ЗаполняемаяСпецификация, Этап)
	
	ТЗОперация = ТекущаяСпецификация.Скопировать(, "ИДТехмаршрутаРодителя, НомерОперации, КодОперации, НаименованиеОперации, КодЦеха, НаименованиеЦеха, КодОборудования, НаименованиеОборудования, НормаВыработки, ПризнакОснМаршрута, ВРЦ, РЦ, КодОперацииСсылка");
	ТЗОперация.Свернуть("ИДТехмаршрутаРодителя, НомерОперации, КодОперации, НаименованиеОперации, КодЦеха, НаименованиеЦеха, КодОборудования, НаименованиеОборудования, НормаВыработки, ПризнакОснМаршрута, ВРЦ, РЦ, КодОперацииСсылка");
	ПроверкаНаличияОсновногоМаршрута(ТЗОперация);
	ТЗОперация.Сортировать("ПризнакОснМаршрута Убыв, НомерОперации");
	ИтераторОпераций = 1;
	КоличествоОпераций = 0;
	Для Каждого СтрокаОперации Из ТЗОперация Цикл; 
		Если СтрокаОперации.ПризнакОснМаршрута <> 0 Тогда
			//Если СтрНайти(СтрокаОперации.НаименованиеОборудования, "РУЧНАЯ ОПЕРАЦИЯ")  > 0 
			//	Или СтрНайти(СтрокаОперации.НаименованиеОборудования, "Ручная операция")  > 0
			//	Или СтрНайти(СтрокаОперации.НаименованиеОборудования, "ФИКТИВНАЯ ОПЕРАЦИЯ")  > 0
			//	Или СтрНайти(СтрокаОперации.НаименованиеОборудования, "Фиктивная операция")  > 0
			//	Тогда
			//	КоличествоОпераций = КоличествоОпераций;
			//Иначе
				КоличествоОпераций = КоличествоОпераций + 1;
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//КоличествоОпераций = ТЗОперация.Количество();
		
	ТЗОперация = ТекущаяСпецификация.Скопировать(, "ИДТехмаршрутаРодителя, НомерОперации, КодОперации, НаименованиеОперации, КодЦеха, НаименованиеЦеха, КодОборудования, НаименованиеОборудования, НормаВыработки, ПризнакОснМаршрута, АгрегКоэф_Материалов, ВРЦ, РЦ, КодОперацииСсылка");
	ТЗОперация.Свернуть("ИДТехмаршрутаРодителя, НомерОперации, КодОперации, НаименованиеОперации, КодЦеха, НаименованиеЦеха, КодОборудования, НаименованиеОборудования, НормаВыработки, ПризнакОснМаршрута, АгрегКоэф_Материалов, ВРЦ, РЦ, КодОперацииСсылка");
	ПроверкаНаличияОсновногоМаршрута(ТЗОперация);
	ТЗОперация.Сортировать("ПризнакОснМаршрута Убыв, НомерОперации, АгрегКоэф_Материалов Убыв");
	ИтераторОпераций = Неопределено;
	
	Для каждого ТекущаяСтрока из ТЗОперация Цикл
		
		Если ТекущаяСтрока.ПризнакОснМаршрута = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если СтрНайти(ТекущаяСтрока.НаименованиеОперации, "ПРИЕМО-СДАТОЧНЫЕ ИСПЫТАНИЯ ГОТОВОГО ИЗДЕЛИЯ")  > 0 
			И КоличествоОпераций > 1
			И ЗначениеЗаполнено(ТекОперация) Тогда
			НоваяОперация = ТекОперация.ПолучитьОбъект();
			НоваяОперация.НомерСледующейОперации = 0;
			НоваяОперация.Контроль = Перечисления.ВариантыКонтроляТехнологическихОпераций.Требуется;
			Попытка  
				НоваяОперация.Записать();  
			Исключение
				СтрокаОшибокСпецификации = ОшибокСпецификации.Добавить(); 
				СтрокаОшибокСпецификации.ИДТехмаршрутаРодителя = ТекущаяСтрока.ИДТехмаршрутаРодителя;
				СтрокаОшибокСпецификации.НомерОперации = ТекущаяСтрока.НомерОперации;
				СтрокаОшибокСпецификации.КодОперации = ТекущаяСтрока.КодОперации;
				СтрокаОшибокСпецификации.НаименованиеОперации = ТекущаяСтрока.НаименованиеОперации;
				СтрокаОшибокСпецификации.КодЦеха = ТекущаяСтрока.КодЦеха;
				СтрокаОшибокСпецификации.НаименованиеЦеха = ТекущаяСтрока.НаименованиеЦеха; 
				СтрокаОшибокСпецификации.КодОборудования = ТекущаяСтрока.КодОборудования;
				СтрокаОшибокСпецификации.НаименованиеОборудования = ТекущаяСтрока.НаименованиеОборудования;
				СтрокаОшибокСпецификации.НормаВыработки = ТекущаяСтрока.НормаВыработки;
				СтрокаОшибокСпецификации.ПризнакОснМаршрута = ТекущаяСтрока.ПризнакОснМаршрута;
				//СтрокаОшибокСпецификации.АгрегКоэф_Материалов = ТекущаяСтрока.АгрегКоэф_Материалов;
				СтрокаОшибокСпецификации.Ошибка = "Операция не создана!";	
				
			КонецПопытки;
			Прервать;
		ИначеЕсли СтрНайти(ТекущаяСтрока.НаименованиеОперации, "ПРИЕМО-СДАТОЧНЫЕ ИСПЫТАНИЯ ГОТОВОГО ИЗДЕЛИЯ")  > 0 и КоличествоОпераций > 1 Тогда 
			Прервать;
		КонецЕсли;	
			
		//Если СтрНайти(ТекущаяСтрока.НаименованиеОборудования, "РУЧНАЯ ОПЕРАЦИЯ")  > 0 
		//	Или СтрНайти(ТекущаяСтрока.НаименованиеОборудования, "Ручная операция")  > 0
		//	Или СтрНайти(ТекущаяСтрока.НаименованиеОборудования, "ФИКТИВНАЯ ОПЕРАЦИЯ")  > 0
		//	Или СтрНайти(ТекущаяСтрока.НаименованиеОборудования, "Фиктивная операция")  > 0
		//	Тогда
		//	Продолжить;
		//	
		//КонецЕсли;
		
		Если ИтераторОпераций = Неопределено Или ИтераторОпераций <> ТекущаяСтрока.НомерОперации Тогда 
			
			НоваяОперация = Справочники.ТехнологическиеОперации.СоздатьЭлемент();
			НоваяОперация.Наименование = ТекущаяСтрока.НаименованиеОперации;
			НоваяОперация.Владелец = Этап.Ссылка;
			Если ИтераторОпераций = Неопределено Тогда
				ИтераторОпераций = 1;
			КонецЕсли;
			НоваяОперация.НомерОперации = ИтераторОпераций;
			Если ИтераторОпераций = КоличествоОпераций Тогда 
				НоваяОперация.НомерСледующейОперации = 0;
			Иначе
				НоваяОперация.НомерСледующейОперации = ИтераторОпераций +1;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекущаяСтрока.РЦ) Тогда
				НоваяОперация.РабочийЦентр = ТекущаяСтрока.РЦ;
			Иначе
				НоваяОперация.РабочийЦентр = ТекущаяСтрока.ВРЦ; 
			КонецЕсли;	
			НоваяОперация.СодержитВложенныйМаршрут = Ложь;
			ПолучитьВремяРаботы(НоваяОперация, ТекущаяСтрока);
			НоваяОперация.ВремяПЗ = 0; 
			НоваяОперация.ВремяПЗЕдИзм = НоваяОперация.ВремяШтучноеЕдИзм;
			НоваяОперация.Загрузка = 0; //но это не точно
			НоваяОперация.Непрерывная = Ложь;
			//НоваяОперация.Количество = 1; //непонятно что писать
			//НоваяОперация.ЕдиницаИзмерения = //пустое но это не точно
			ЕдДляОтчетов = ЗаполняемаяСпецификация.ОсновноеИзделиеНоменклатура.ЕдиницаДляОтчетов; 
			ЕдБазовая = ЗаполняемаяСпецификация.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения;
			//НоваяОперация.ЕдиницаИзмерения = ЕдДляОтчетов;
			НоваяОперация.ЕдиницаИзмерения = ЗаполняемаяСпецификация.ОсновноеИзделиеУпаковка;
			//Если ЗначениеЗаполнено(ЗаполняемаяСпецификация.ОсновноеИзделиеНоменклатура.КоэффициентЕдиницыДляОтчетов) Тогда
			//	КоэффициентДляОтчетов = ?(ЗаполняемаяСпецификация.ОсновноеИзделиеНоменклатура.КоэффициентЕдиницыДляОтчетов = 0, 1,
			//	ЗаполняемаяСпецификация.ОсновноеИзделиеНоменклатура.КоэффициентЕдиницыДляОтчетов);
			//Иначе
			//	КоэффициентДляОтчетов = 1;
			//КонецЕсли;
			//Если ЕдДляОтчетов = ЕдБазовая Тогда 
			//	 НоваяОперация.Количество = 1;
			//Иначе	 
			//	НоваяОперация.Количество = 1 / КоэффициентДляОтчетов;
			//КонецЕсли;
            НоваяОперация.Количество =  ЗаполняемаяСпецификация.ОсновноеИзделиеКоличествоУпаковок;
			НоваяОперация.Идентификатор = ИтераторОпераций; //непонятно что писать
			НоваяОперация.ПередаточнаяПартия = 0;
			//////НоваяОперация.ВидОперации = //пустое но это не точно
			НоваяОперация.МожноПовторить = Ложь;
			НоваяОперация.МожноПропустить = Ложь;
			НоваяОперация.СодержитТехнологическийПроцесс = Ложь;
			//НоваяОперация.ТехнологическийПроцесс = //пустое
			НоваяОперация.КоэффициентТехнологическогоПроцесса = 0;
			НоваяОперация.Спецификация = ЗаполняемаяСпецификация;
			//НоваяОперация.Основание = //пустое
			НоваяОперация.Контроль = Перечисления.ВариантыКонтроляТехнологическихОпераций.НеТребуется;
			//НоваяОперация.Участок = //пустое
			Если ЗначениеЗаполнено(ТекущаяСтрока.КодОперацииСсылка) Тогда
				НоваяОперация.бит_КодОперации = ТекущаяСтрока.КодОперацииСсылка; 
			ИначеЕсли ЗначениеЗаполнено(Справочники.бит_КодыОпераций.НайтиПоНаименованию("ТекущаяСтрока.КодОперации")) Тогда
				НоваяОперация.бит_КодОперации = Справочники.бит_КодыОпераций.НайтиПоНаименованию("ТекущаяСтрока.КодОперации");
			Иначе
				НоваяОперация.бит_КодОперации = СоздатьКодОперации(ТекущаяСтрока.КодОперации, ТекущаяСтрока.НаименованиеОперации);
			КонецЕсли;
			//ЛТ33
			НоваяОперация.бит_АгрегирующийКоэффициент = ?(ТекущаяСтрока.АгрегКоэф_Материалов = 0, 1, ТекущаяСтрока.АгрегКоэф_Материалов); 
			
			Попытка  
				НоваяОперация.Записать(); 
				ТекОперация = НоваяОперация.Ссылка; 
			Исключение
				СтрокаОшибокСпецификации = ОшибокСпецификации.Добавить(); 
				СтрокаОшибокСпецификации.ИДТехмаршрутаРодителя = ТекущаяСтрока.ИДТехмаршрутаРодителя;
				СтрокаОшибокСпецификации.НомерОперации = ТекущаяСтрока.НомерОперации;
				СтрокаОшибокСпецификации.КодОперации = ТекущаяСтрока.КодОперации;
				СтрокаОшибокСпецификации.НаименованиеОперации = ТекущаяСтрока.НаименованиеОперации;
				СтрокаОшибокСпецификации.КодЦеха = ТекущаяСтрока.КодЦеха;
				СтрокаОшибокСпецификации.НаименованиеЦеха = ТекущаяСтрока.НаименованиеЦеха; 
				СтрокаОшибокСпецификации.КодОборудования = ТекущаяСтрока.КодОборудования;
				СтрокаОшибокСпецификации.НаименованиеОборудования = ТекущаяСтрока.НаименованиеОборудования;
				СтрокаОшибокСпецификации.НормаВыработки = ТекущаяСтрока.НормаВыработки;
				СтрокаОшибокСпецификации.ПризнакОснМаршрута = ТекущаяСтрока.ПризнакОснМаршрута;
				//СтрокаОшибокСпецификации.АгрегКоэф_Материалов = ТекущаяСтрока.АгрегКоэф_Материалов;
				СтрокаОшибокСпецификации.Ошибка = "Операция не создана!";	
				
			КонецПопытки;
					
			ИтераторОпераций = ИтераторОпераций + 1; 
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ТипЗнч(НоваяОперация) = Тип("СправочникСсылка.ТехнологическиеОперации") Тогда 
		ЗаполняемаяСпецификация.ВыходныеИзделия[0].Операция = НоваяОперация;
		Для Каждого Строка Из ЗаполняемаяСпецификация.МатериалыИУслуги Цикл
			Строка.Операция = НоваяОперация;
			Строка.ОперацияРедактирование = НоваяОперация;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере 
Функция СоздатьКодОперации(КодОперации, НаименованиеОперации)
	
	ТекущийКодОперации = Справочники.бит_КодыОпераций.СоздатьЭлемент();
	ТекущийКодОперации.Наименование = КодОперации;
	ТекущийКодОперации.НаименованиеОперации = НаименованиеОперации;
	
	Попытка
		ТекущийКодОперации.Записать();
		Код =  ТекущийКодОперации.Ссылка;
	Исключение
		Код = Справочники.бит_КодыОпераций.ПустаяСсылка();
	КонецПопытки;
	
	Возврат Код;
	
КонецФункции

&НаСервере 
Процедура ПолучитьВремяРаботы(НоваяОперация, ТекущаяСтрока)
	
	Если ТекущаяСтрока.НормаВыработки = 0 Тогда
		НоваяОперация.ВремяШтучное = 0;
		НоваяОперация.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Час;
	Иначе
		КоличествоИзделийВЧас = 1 / ТекущаяСтрока.НормаВыработки; 
		КоличествоИзделийВМинуту = КоличествоИзделийВЧас * 60;
		Если КоличествоИзделийВМинуту < 0.1 Тогда
			КоличествоИзделийВСекунду = КоличествоИзделийВМинуту * 60; 
			НоваяОперация.ВремяШтучное = КоличествоИзделийВСекунду;
			НоваяОперация.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Секунда;
		Иначе
			НоваяОперация.ВремяШтучное = КоличествоИзделийВМинуту;  
			НоваяОперация.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута; 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере 
Процедура ЗаполнениеСпецификацийВВерхгнуровневыхСпецификациях(ЗаполняемаяСпецификация);
	
	// Нужно получить все спецификации где в материалах головное изделие из текущей спецификации и там дописать в материалы  
	//////СтрокаТЗМатериалыИУслуги.ИсточникПолученияПолуфабриката = ссылка на спецификацию
	//////СтрокаТЗМатериалыИУслуги.Обособленно = Истина;

КонецПроцедуры

&НаСервере 
Процедура ЗаполниитьРезультатЗаписи(ТекущаяСпецификация, ЗаполняемаяСпецификация)
	
	Для Каждого Строка из ТекущаяСпецификация Цикл
		   Строка.Создано = Истина;
		   Строка.СсылкаСпецификация = ЗаполняемаяСпецификация.Ссылка;
	КонецЦикла;	
	
КонецПроцедуры  

&НаСервере 
Процедура ПрисвоениеПризнаковАгрКоэффициент(Спецификация)

КонецПроцедуры

&НаСервере 
Процедура ВыводРезультатаСоздания(ТекущаяСпецификация);
	
	Для Каждого Строка из ТекущаяСпецификация.Значение Цикл
		 НоваяСтрока = СозданиеСпецификации.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура ИзменениеУсловногоОформленияСозданияСпецификации()

 	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеСпецификации.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеСпецификации.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеСпецификации.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура ПроверитьЭлементыТаблицыСпецификации()
	
	Для каждого СтрокаСпецификации Из ПроверкиСпецификации Цикл 

	КонецЦикла;
	
	ИзменениеУсловногоОформленияПроверкиСпецификации();
	
КонецПроцедуры

 &НаСервере 
Процедура ИзменениеУсловногоОформленияПроверкиСпецификации()

 	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиСпецификации.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); 
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиСпецификации.Изменено"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь; 
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки); 
	
	Для каждого элПоля Из Элементы.ПроверкиСпецификации.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле1 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

 #Область СозданияОходыСпецификаций

&НаСервере 
Процедура ЗаполнитьТаблицуИсточникОходыСпецификаций(ПредставлениеИсточника)
	
	НомерСтроки = 1;
	ФлагПрерывания = Ложь;
	Пока НЕ ФлагПрерывания Цикл 
		НомерСтроки = НомерСтроки + 1;
		СтрИсточник = ИсточникОходыСпецификаций.Добавить();	 
		
		ТекстКолонки = ПредставлениеИсточника.Область(НомерСтроки, 1).Текст;
		СтрИсточник.КодРодителя = ТекстКолонки;           
		СтрИсточник.Родитель = ПредставлениеИсточника.Область(НомерСтроки, 2).Текст;   
		СтрИсточник.ИДТехмаршрутаРодителя = ПредставлениеИсточника.Область(НомерСтроки, 3).Текст;    
	    СтрИсточник.НомерОперации = ПредставлениеИсточника.Область(НомерСтроки, 4).Текст; 	
		СтрИсточник.КодОперации = ПредставлениеИсточника.Область(НомерСтроки, 5).Текст;
		СтрИсточник.ТипОборудования = ПредставлениеИсточника.Область(НомерСтроки, 7).Текст;  
		СтрИсточник.ОсновнойМаршрут = ПредставлениеИсточника.Область(НомерСтроки, 8).Текст;     
		СтрИсточник.ОткходыКодВн = ПредставлениеИсточника.Область(НомерСтроки, 9).Текст;    
		СтрИсточник.КраткоеНаименование = ПредставлениеИсточника.Область(НомерСтроки, 10).Текст;	
		СтрИсточник.Норма = ПредставлениеИсточника.Область(НомерСтроки, 11).Текст;	
		
		Если ПустаяСтрока(ТекстКолонки) Тогда
			ФлагПрерывания = Истина;
			ИсточникОходыСпецификаций.Удалить(СтрИсточник);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте 
Процедура ДействияСТаблицамиОходыСпецификаций(ПредставлениеИсточника)        

	Если ИдентификаторСостояния = "Состояние1" Тогда
		Элементы.ИсточникОходыСпецификаций.Видимость 	= Истина;
		ЗаполнитьТаблицуИсточникОходыСпецификаций(ПредставлениеИсточника);
	ИначеЕсли ИдентификаторСостояния = "Состояние2" Тогда 
		Элементы.СозданиеОходыСпецификаций.Видимость 	= Истина;
		Элементы.ПроверкиОходыСпецификаций.Видимость 	= Истина;
		Элементы.ОшибокОходыСпецификаций.Видимость 	= Истина;
		ЗаполнитьТаблицыПроверкиОходыСпецификаций();
	ИначеЕсли ИдентификаторСостояния = "Состояние3" Тогда
		СоздатьЭлементыТаблицыОходыСпецификаций();
	ИначеЕсли ИдентификаторСостояния = "Состояние4" Тогда
	    ПроверитьЭлементыТаблицыОходыСпецификаций();	
	ИначеЕсли ИдентификаторСостояния = "Состояние5" Тогда
		ОткрытьФорму("Справочник.РесурсныеСпецификации.ФормаСписка"); 
	Иначе
		Возврат;
	КонецЕсли; 
			
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТаблицыПроверкиОходыСпецификаций()
	
	УсловноеОформление.Элементы.Очистить(); 
	
	МассивНоменклатураИсточник = ИсточникОходыСпецификаций.Выгрузить( , "КодРодителя"); 
	МассивНоменклатураОтход = ИсточникОходыСпецификаций.Выгрузить( , "ОткходыКодВн"); 
    МассивОпераций = ИсточникОходыСпецификаций.Выгрузить( , "КодОперации");  
	МассивСпецификаций = ИсточникОходыСпецификаций.Выгрузить( , "Родитель");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул В(&МассивНоменклатураИсточник)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул В(&МассивНоменклатураОтход)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РесурсныеСпецификацииВыходныеИзделия.Ссылка КАК Ссылка,
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК Номенклатура,
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	ЭтапыПроизводстваВидыРабочихЦентров.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ЭтапыПроизводстваВидыРабочихЦентров.ВидРабочегоЦентра.Наименование КАК ВидРабочегоЦентраНаименование
		|ИЗ
		|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства.ВидыРабочихЦентров КАК ЭтапыПроизводстваВидыРабочихЦентров
		|		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = ЭтапыПроизводстваВидыРабочихЦентров.Ссылка.Владелец
		|ГДЕ
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура.Артикул В(&МассивНоменклатураИсточник)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТехнологическиеОперации.Наименование КАК Наименование,
		|	ТехнологическиеОперации.Ссылка КАК Ссылка,
		|	ТехнологическиеОперации.бит_КодОперации КАК бит_КодОперации,
		|	ТехнологическиеОперации.бит_КодОперации.Наименование КАК бит_КодОперацииНаименование
		|ИЗ
		|	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|ГДЕ
		|	ТехнологическиеОперации.бит_КодОперации.Наименование В(&МассивОпераций)";
		
	Запрос.УстановитьПараметр("МассивНоменклатураИсточник", МассивНоменклатураИсточник);
	Запрос.УстановитьПараметр("МассивНоменклатураОтход", МассивНоменклатураОтход);
	Запрос.УстановитьПараметр("МассивОпераций", МассивОпераций);
	Запрос.УстановитьПараметр("МассивСпецификаций", МассивСпецификаций);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНоменклатураИсточник = РезультатЗапроса[0].Выгрузить();
	ВыборкаНоменклатураОтход = РезультатЗапроса[1].Выгрузить();
	ВыборкаОпераций = РезультатЗапроса[3].Выгрузить();
	ВыборкаСпецификаций = РезультатЗапроса[2].Выгрузить();
	
	ЗаполнениеТаблицОходыСпецификаций(ВыборкаНоменклатураИсточник, ВыборкаНоменклатураОтход, ВыборкаОпераций, ВыборкаСпецификаций);
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнениеТаблицОходыСпецификаций(ВыборкаНоменклатураИсточник, ВыборкаНоменклатураОтход, ВыборкаОпераций, ВыборкаСпецификаций)
		
   	Для каждого СтрокаОходыСпецификаций Из ИсточникОходыСпецификаций Цикл 
		
		ТекстСообщения = "";
		
		Если ЗначениеЗаполнено(СтрокаОходыСпецификаций.КодРодителя) Тогда
			Изделие = ВыборкаНоменклатураИсточник.Найти(СтрокаОходыСпецификаций.КодРодителя);
			Если Изделие = Неопределено Тогда
				ТекстСообщения = ТекстСообщения + "Выпускаемая номенклатура не найдена! ";
			Иначе 
				Изделие = Изделие.Ссылка;
			КонецЕсли;
		Иначе
			ТекстСообщения = ТекстСообщения + "Выпускаемая номенклатура не найдена! ";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаОходыСпецификаций.ОткходыКодВн) Тогда
			Отход = ВыборкаНоменклатураОтход.Найти(СтрокаОходыСпецификаций.ОткходыКодВн);
			Если Отход = Неопределено Тогда
				ТекстСообщения = ТекстСообщения + "Отход не найден! ";
			Иначе 
				Отход = Отход.Ссылка;
			КонецЕсли;
		Иначе
			ТекстСообщения = ТекстСообщения + "Отход не найден! ";
		КонецЕсли;
	
		КодОперации = ВыборкаОпераций.Найти(СтрокаОходыСпецификаций.КодОперации);
		Если КодОперации = Неопределено Тогда
			ТекстСообщения = ТекстСообщения + "Операция не найдена! ";
		Иначе
			//КодОперации = КодОперации.Ссылка;
			//Операция = Справочники.ТехнологическиеОперации.НайтиПоРеквизиту("бит_КодОперации", КодОперации);
			Операция = КодОперации.Ссылка;
		КонецЕсли;
		
		КоличествоОтходов = -1;
		Спецификация = ВыборкаСпецификаций.НайтиСтроки(новый Структура("НоменклатураАртикул, ВидРабочегоЦентраНаименование", СтрокаОходыСпецификаций.КодРодителя, СтрокаОходыСпецификаций.ТипОборудования)); 
        Если Спецификация.Количество() =0 Тогда
			ТекстСообщения = ТекстСообщения + "Спецификация не найдена! ";
		Иначе  
			Спецификация = Спецификация[0].Ссылка; 
			ТекущаяСпецификация = Спецификация.ПолучитьОбъект();
			КоличествоОтходов = ТекущаяСпецификация.ВозвратныеОтходы.Количество();
		КонецЕсли;
		
		Если ТекстСообщения <> "" Тогда	
			СтрокаОшибокОходыСпецификаций = ОшибокОходыСпецификаций.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиОходыСпецификаций(СтрокаОшибокОходыСпецификаций, 
			                                                         СтрокаОходыСпецификаций);
			СтрокаОшибокОходыСпецификаций.Ошибка = ТекстСообщения;
		ИначеЕсли КоличествоОтходов < 1 Тогда
			СтрокаСозданиеОходыСпецификаций = СозданиеОходыСпецификаций.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиОходыСпецификаций(СтрокаСозданиеОходыСпецификаций,
			                                                         СтрокаОходыСпецификаций);
			СтрокаСозданиеОходыСпецификаций.НоменклатураИсточник = Изделие; 
			СтрокаСозданиеОходыСпецификаций.НоменклатураОтход = Отход;
			СтрокаСозданиеОходыСпецификаций.Операция = Операция;
			СтрокаСозданиеОходыСпецификаций.Спецификация = Спецификация;
		Иначе 
			СтрокаПроверкиОходыСпецификаций = ПроверкиОходыСпецификаций.Добавить(); 
			ЗаполнитьСтрокуТаблицыПроверкиОходыСпецификаций(СтрокаПроверкиОходыСпецификаций, 
			                                                         СтрокаОходыСпецификаций); 
			СтрокаПроверкиОходыСпецификаций.НоменклатураИсточник = Изделие; 
			СтрокаПроверкиОходыСпецификаций.НоменклатураОтход = Отход;
			СтрокаПроверкиОходыСпецификаций.Операция = Операция;
			СтрокаПроверкиОходыСпецификаций.Спецификация = Спецификация;
	    КонецЕсли; 
	КонецЦикла;
	
	СозданиеОходыСпецификаций.Сортировать("КодРодителя Возр");
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьСтрокуТаблицыПроверкиОходыСпецификаций(СтрокаПриемник, СтрокаИсточник)
	
	СтрокаПриемник.КодРодителя = СтрокаИсточник.КодРодителя;             
	СтрокаПриемник.Родитель = СтрокаИсточник.Родитель;    
	СтрокаПриемник.ИДТехмаршрутаРодителя = СтрокаИсточник.ИДТехмаршрутаРодителя;
	СтрокаПриемник.НомерОперации = СтрокаИсточник.НомерОперации;  
	СтрокаПриемник.КодОперации = СтрокаИсточник.КодОперации;                    
	СтрокаПриемник.ТипОборудования = СтрокаИсточник.ТипОборудования;          
	СтрокаПриемник.ОсновнойМаршрут = СтрокаИсточник.ОсновнойМаршрут;            
	СтрокаПриемник.ОткходыКодВн = СтрокаИсточник.ОткходыКодВн;              
	СтрокаПриемник.КраткоеНаименование = СтрокаИсточник.КраткоеНаименование; 			 
	СтрокаПриемник.Норма = СтрокаИсточник.Норма; 			   
	
КонецПроцедуры

&НаСервере 
Процедура СоздатьЭлементыТаблицыОходыСпецификаций()
	
	ПерегруппированныеОтходы = ПерегруппировкаОтходовПоСпецификациям(); 
	СозданиеОходыСпецификаций.Очистить();
	Для Каждого ТекущаяОтходы из ПерегруппированныеОтходы Цикл
		
		ЗаполнитьОтходы(ТекущаяОтходы.Значение);
		
	КонецЦикла;
	
	Для каждого ТекущаяОтходы Из ПерегруппированныеОтходы Цикл
		ВыводРезультатаСозданияОтходов(ТекущаяОтходы); 
	КонецЦикла;
    	
	ИзменениеУсловногоОформленияСозданияОходыСпецификаций();
    	
КонецПроцедуры 

&НаСервере 
Процедура ВыводРезультатаСозданияОтходов(ТекущаяОтходы)
	
	Для Каждого Строка из ТекущаяОтходы.Значение Цикл
		 НоваяСтрока = СозданиеОходыСпецификаций.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ПерегруппировкаОтходовПоСпецификациям()
	
	ПерегруппированныеОтходы = Новый Структура;     
	ИдентификаторУпорядочивания = 0;
	ТекущаяОтходы = СозданиеОходыСпецификаций.Выгрузить();
	ТекущаяОтходы.Очистить();
	ИдентификаторРодителя = Неопределено;    
	
	ТипОборудования = Неопределено;
	КолонкиКлюча = "КодРодителя,ТипОборудования";
	мКлючи = СтрРазделить(КолонкиКлюча, ",");
    УникальныеСтроки = СозданиеОходыСпецификаций.Выгрузить(, КолонкиКлюча);
	УникальныеСтроки.Свернуть(КолонкиКлюча);  
	Для стр = 0 по УникальныеСтроки.Количество() - 1 Цикл
		СтруктураОтбора = Новый Структура;
		Для каждого текКлюч из мКлючи Цикл
			СтруктураОтбора.Вставить(текКлюч, УникальныеСтроки[стр][текКлюч]);
		КонецЦикла;
		строкиПоКлючу = СозданиеОходыСпецификаций.НайтиСтроки(СтруктураОтбора);	
		Для каждого найдСтрока Из строкиПоКлючу Цикл
			ТекущаяСтрокаОходыСпецификации = ТекущаяОтходы.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрокаОходыСпецификации, найдСтрока);
		КонецЦикла;
		Если ТекущаяОтходы.Количество() Тогда
			ПерегруппированныеОтходы.Вставить("Спецификация" + формат(стр, "ЧГ=0"), ТекущаяОтходы.Скопировать());
			ТекущаяОтходы.Очистить();
		КонецЕсли;
	КонецЦикла;
	
			
	//		
	//	.
	//Для каждого СтрокаОтходы Из СозданиеОходыСпецификаций Цикл    
	//	
	//	Если ИдентификаторРодителя = СтрокаОтходы.КодРодителя или ИдентификаторРодителя = Неопределено Тогда
	//		ТекущаяСтрокаОтходы = ТекущаяОтходы.Добавить();
	//		ЗаполнитьЗначенияСвойств(ТекущаяСтрокаОтходы, СтрокаОтходы);
	//	Иначе
	//		Ключ = "Спецификация" + Строка(ИдентификаторУпорядочивания);
	//		СтараяТекущаяОтходы = ТекущаяОтходы.Скопировать();
	//		ДобавитьНовуюСпецификациюВСтруктуру(Ключ, СтараяТекущаяОтходы, ПерегруппированныеОтходы);  
	//		ТекущаяОтходы.Очистить(); 
	//		ИдентификаторУпорядочивания = ИдентификаторУпорядочивания + 1;
	//		ТекущаяСтрокаОтходы = ТекущаяОтходы.Добавить();
	//		ЗаполнитьЗначенияСвойств(ТекущаяСтрокаОтходы, СтрокаОтходы);
	//	КонецЕсли;
	//	
	//	ИдентификаторРодителя = СтрокаОтходы.КодРодителя;        
	//	
	//КонецЦикла;
	//
	//Ключ = "Спецификация" + Строка(ИдентификаторУпорядочивания);
	//СтараяТекущаяОтходы = ТекущаяОтходы.Скопировать();
	//ДобавитьНовуюСпецификациюВСтруктуру(Ключ, СтараяТекущаяОтходы, ПерегруппированныеОтходы);
	//
	Возврат ПерегруппированныеОтходы;
	//

КонецФункции

&НаСервере 
Процедура ЗаполнитьОтходы(ТекущаяОтходы)
	
	ЗаполняемаяСпецификация = ТекущаяОтходы[0].Спецификация;
	ЗаполняемаяСпецификация = ЗаполняемаяСпецификация.ПолучитьОбъект(); 
	ЗаполняемаяСпецификация.Статус = Перечисления.СтатусыСпецификаций.ВРазработке;
	ЗаполняемаяСпецификация.Записать();
	
	//ТекущаяОтходы.Свернуть("КодРодителя, Родитель, НомерОперации, КодОперации, ТипОборудования, ОсновнойМаршрут, ОткходыКодВн, КраткоеНаименование, Норма, Создано, НоменклатураОтход, Операция, Спецификация");  //ОсновнойМаршрут под вопросом и ТипОборудования исключить
	ТекущаяОтходы.Свернуть("КодРодителя, Родитель, НомерОперации, КодОперации, ОткходыКодВн, КраткоеНаименование, Норма, Создано, НоменклатураОтход, Операция, Спецификация");
	
	Для каждого Строка Из ТекущаяОтходы Цикл  
		
		Если ЗначениеЗаполнено(Строка.Норма) Тогда	
			Если Строка.Норма = 0 Или Строка.Норма = "0" Тогда
				Продолжить;
			КонецЕсли;
			Попытка
				
				СтрокаОтходов = ЗаполняемаяСпецификация.ВозвратныеОтходы.Добавить();  
				СтрокаОтходов.Номенклатура = Строка.НоменклатураОтход;
				Норма =  Строка.Норма; 
				//СтрокаОтходов.КоличествоУпаковок = 1 * Норма /100; 
				СтрокаОтходов.КоличествоУпаковок = Норма;
				СтрокаОтходов.СтатьяКалькуляции = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Возвратные отходы");
				СтрокаОтходов.СпособАвтовыбораНоменклатуры = Перечисления.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ;
				СтрокаОтходов.СпособАвтовыбораХарактеристики = Перечисления.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ;
				СтрокаОтходов.ОбработатьПоСпецификации = Ложь;
				СтрокаОтходов.Операция = Строка.Операция; 
				//СтрокаОтходов.ОперацияРедактирование = Строка.Операция; 
				СтрокаОтходов.Этап = ЗаполняемаяСпецификация.ОсновноеИзделиеЭтап;
				//СтрокаОтходов.ЭтапРедактирование = ЗаполняемаяСпецификация.ОсновноеИзделиеЭтап;
				//СтрокаОтходов.КлючСвязи =  // непонятно какой брать 
				ЗаполняемаяСпецификация.Записать(); 
				Строка.Создано = Истина
			Исключение
			КонецПопытки;	
		Иначе 
			Продолжить;
		КонецЕсли;
		
		
	КонецЦикла; 
	ЗаполняемаяСпецификация.Статус = Перечисления.СтатусыСпецификаций.Действует;
	ЗаполняемаяСпецификация.Записать(); 
	  
КонецПроцедуры

&НаСервере 
Процедура ИзменениеУсловногоОформленияСозданияОходыСпецификаций()

 	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеОходыСпецификаций.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;  
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);  
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СозданиеОходыСпецификаций.Создано");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось); 
	
	Для каждого элПоля Из Элементы.СозданиеОходыСпецификаций.ПодчиненныеЭлементы Цикл
      ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	  ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
      ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	  ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
    КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура ПроверитьЭлементыТаблицыОходыСпецификаций()
	
	Для каждого СтрокаОходыСпецификаций Из ПроверкиОходыСпецификаций Цикл 
			
	КонецЦикла;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиОходыСпецификаций.Изменено");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); 
	
	ЭлементУсловногоОформления2 = УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементУсловногоОформления2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкиОходыСпецификаций.Изменено"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь; 
	ЭлементУсловногоОформления2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки); 
	
	Для каждого элПоля Из Элементы.ПроверкиОходыСпецификаций.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле1 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле2 = ЭлементУсловногоОформления2.Поля.Элементы.Добавить();
		ОформляемоеПоле1.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
		ОформляемоеПоле2.Поле = Новый ПолеКомпоновкиДанных(элПоля.Имя);
	КонецЦикла;
  	
КонецПроцедуры
#КонецОбласти
//Первыйбит ЛТ1 + ЛТ1.1 + ЛТ1.3 + ЛТ2 + ЛТ3 ЛапшовГ "GVLapshov@1cbit.ru" 09.09.2024 + 