
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗакрытиеРазрешено;

&НаКлиенте
Перем ИдетПолучениеКонстант;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.ЗначенияКонстант);
	
	ОтображатьНедоступные = Ложь;
	ИмяПоследнейКонстанты = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "Имя");
	
	Состояние = НСтр("ru = 'Получение списка констант...';
					|en = 'Getting a list of constants...'");
	ИТК_ФормаКлиентСервер.ОтображениеСостоянияТабличногоДокумента(Элементы.ИдетПолучениеКонстантТабличныйДокумент, Состояние);
	
	// Подключение команд
	ИТК_ПодключаемыеКоманды.ИнструментыКТаблицеЗначений(ЭтотОбъект, "ЗначенияКонстант");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИТК_ОбщийКлиент.ОбработчикПриОткрытии(Отказ);
	
	ИдетПолучениеКонстант = Ложь;
	ОбновитьКонстанты();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Истина Тогда
		
		Если Модифицированность Тогда
			
			ТекстПредупреждения = НСтр("ru = 'Имеются несохраненные данные, они будут потеряны.
                                        |Для сохранения изменений нажмите ""Продолжить работу"", сохраните данные, а потом завершите работу.';
                                        |en = 'There is unsaved data, it will be lost.
                                        |To save changes, click Continue, save the data, and then exit.'");
			
			Отказ = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗакрытиеРазрешено = Неопределено Тогда
			
			Отказ = Истина;
			ЗапуститьОбработчикСПроверкойНаСохранностьДанных(Новый ОписаниеОповещения("ОбработчикЗакрытиеРазрешеноЗакрыть", ЭтотОбъект));

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьКонстанты();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если ОтсутствуетИзменения() Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Нет изменений для записи';
									|en = 'No changes to record'");
		ПоказатьПредупреждение( , ТекстПредупреждения, , ИТК_РедакторКонстантКлиентСервер.Представление());
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОЗавершении = Новый ОписаниеОповещения("ЗавершенВопросЗаписи", ЭтотОбъект);
	
	ЗаголовокВопроса = НСтр("ru = 'Записать?';
							|en = 'Write?'");
	ТекстВопроса = "";
	ПоказатьВопрос(ОписаниеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, ЗаголовокВопроса, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьНедоступные(Команда)
	
	ОтображатьНедоступные = Не ОтображатьНедоступные;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура ПодключаемаяКоманда(Команда)
	
	ИТК_ПодключаемыеКомандыКлиент.ОбработатьКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйОбработчикКоманд(Команда)
	
	ИТК_ПараметрыЗаписиКлиент.ОбработатьКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначенияКонстант

&НаКлиенте
Процедура ЗначенияКонстантПриАктивизацииЯчейки(Элемент)
	
	ИТК_ПодключаемыеКомандыКлиент.ОбновитьЭлементы(ЭтотОбъект, Элемент, "Значение");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонстантПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоследнейКонстанты = ТекущиеДанные.Имя;

	ЭлементЗначение = Элементы.ЗначенияКонстантЗначение;
	ЭлементЗначение.ТолькоПросмотр = НЕ ТекущиеДанные.Доступность;
	ИТК_ФормаКлиент.АктивизацияЗначенияВФорме(ЭлементЗначение, ТекущиеДанные.Значение, ТекущиеДанные.Тип);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонстантПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ИТК_ПодключаемыеКомандыКлиент.ОбновитьЭлементы(ЭтотОбъект, Элементы.ЗначенияКонстант);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонстантПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Элемент.ТекущийЭлемент.ОграничениеТипа = ТекущиеДанные.Тип;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонстантЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗначенияКонстант.ТекущиеДанные;
	ТекущиеДанные.Изменять = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонстантЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗначенияКонстант.ТекущиеДанные;
	
	Имя = ТекущиеДанные.Имя;
	ЗаголовокФормы = СтрШаблон(НСтр("ru = 'Константа ""%1""';
									|en = 'Constant ""%1""'"), Имя);

	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВводЗначенияКонстантыЗавершен", ЭтотОбъект, Новый Структура);
	Если ТекущиеДанные.Тип.СодержитТип(Тип("ОписаниеТипов")) Тогда
		
		ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(Элемент, ЗаголовокФормы, ИТК_Перечисления.РежимРедактированияТипаЗначенияРедактированиеОписанияТипов(),
																	ТекущиеДанные.Значение, ОписаниеОповещенияЗавершение, СтандартнаяОбработка);
	Иначе
		
		ИТК_ФормаКлиент.ВводЗначенияСтрокиВФорме(ЗаголовокФормы, Элемент, ТекущиеДанные.Значение, ТекущиеДанные.Тип, СтандартнаяОбработка, ОписаниеОповещенияЗавершение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонстантЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОчисткаЗначенияСтрокиВФорме(Элемент, СтандартнаяОбработка);
	
	Строка = Элементы.ЗначенияКонстант.ТекущиеДанные;
	Строка.Изменять = Истина;
	Строка.Значение = Строка.Тип.ПривестиЗначение(Неопределено);
	
	ОбновитьДанныеСтроки(Строка);
	
	ИТК_ФормаКлиент.АктивизацияЗначенияВФорме(Элемент, Неопределено, Строка.Тип);
	
	ЗначенияКонстантПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонстантЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОбработкаВыбораЗначенияВФорме(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	ОбновитьДанныеСтроки(Элементы.ЗначенияКонстант.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонстантЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.АвтоПодборЗначенияВФорме(Текст, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьКонстанты()
	
	ИдетПолучениеКонстант = Истина;
	
	ДлительнаяОперация = ОбновитьКонстантыНаСервере(УникальныйИдентификатор);
	
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеКонстант", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьКонстантыНаСервере(УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_РедакторКонстант.Данные", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноОбновлениеКонстант(Результат, ДополнительныеПараметры) Экспорт
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбновитьКонстантыНаФорме(Результат.АдресРезультата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяПоследнейКонстанты) Тогда
		
		Отбор = Новый Структура("Имя", ИмяПоследнейКонстанты);
		НайденныеСтроки = ЗначенияКонстант.НайтиСтроки(Отбор);
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Элементы.ЗначенияКонстант.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
	ИдетПолучениеКонстант = Ложь;
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ОбновитьКонстантыНаФорме(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗначениеВРеквизитФормы(Результат, "ЗначенияКонстант");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Оформление = Новый Структура("ТолькоПросмотр", Истина);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ЗначенияКонстантИзменять", Оформление, "ЗначенияКонстант.Доступность", Ложь);
	
	Оформление = Новый Структура("ЦветТекста", ИТК_ОбщийКлиентСервер.ЦветТекстаНедоступно());
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ЗначенияКонстант", Оформление, "ЗначенияКонстант.Доступность", Ложь);
	
	Оформление = Новый Структура("Шрифт", ИТК_ОбщийКлиентСервер.ШрифтЖирный());
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ЗначенияКонстантИмя", Оформление, "ЗначенияКонстант.Изменять", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводЗначенияКонстантыЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЗначенияКонстант.ТекущиеДанные;
	ТекущиеДанные.Изменять = Истина;
	
	ИТК_ФормаКлиент.ОбработкаЗавершенВводЗначенияВФорме(Элементы.ЗначенияКонстантЗначение, Результат, ДополнительныеПараметры,
																ТекущиеДанные.Значение, ТекущиеДанные.Тип, Модифицированность); 
	ОбновитьДанныеСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Функция ОтсутствуетИзменения()
	
	Отбор = Новый Структура("Изменять", Истина);
	ИзменяемыеКонстанты = ЗначенияКонстант.НайтиСтроки(Отбор);
	
	Возврат НЕ ЗначениеЗаполнено(ИзменяемыеКонстанты);
	
КонецФункции

&НаКлиенте
Процедура ЗавершенВопросЗаписи(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
		
	Ошибка = ЗаписатьЗначенияКонстант();
	Если ЗначениеЗаполнено(Ошибка) Тогда
		
		ПоказатьПредупреждение( , Ошибка, , ИТК_РедакторКонстантКлиентСервер.Представление());
		
	Иначе 
		
		Модифицированность = Ложь;
		ОбновитьКонстанты();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьЗначенияКонстант()
	
	Попытка
		
		ИзменяемыеКонстанты = Новый Массив;
		ЗначенияЗаполнения = Новый Соответствие;
		Для Каждого ЗначениеКонстанты Из ЗначенияКонстант Цикл 
			
			Если Не ЗначениеКонстанты.Изменять Тогда
				Продолжить;
			КонецЕсли;
			
			ИзменяемыеКонстанты.Добавить(ЗначениеКонстанты.Имя);
			ЗначенияЗаполнения.Вставить(ЗначениеКонстанты.Имя, ЗначениеКонстанты.Значение);
			
		КонецЦикла;
		
		НаборКонстант = Константы.СоздатьНабор(ИзменяемыеКонстанты);
	
		// Заполнение значений
		Для Каждого ЗначениеЗаполнения Из ЗначенияЗаполнения Цикл 
			НаборКонстант[ЗначениеЗаполнения.Ключ] = ЗначениеЗаполнения.Значение;
		КонецЦикла;
		
		НаборКонстант.Записать();
		
		Результат = "";
		
	Исключение
		
		Результат = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
		
КонецФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ЗначенияКонстант.Видимость = Не ИдетПолучениеКонстант;
	Элементы.ИдетПолучениеКонстантТабличныйДокумент.Видимость = ИдетПолучениеКонстант;
	
	Элементы.ФормаЗаписать.Заголовок = ИТК_ФормаКлиентСервер.ЗаголовокСКоличеством(НСтр("ru = 'Записать';
																						|en = 'Write'"), КоличествоИзменяемыхКонстант());
	
	Элементы.ЗначенияКонстантОтображатьНедоступные.Пометка = ОтображатьНедоступные;
	
	Если ОтображатьНедоступные Тогда
		ОтборСтрок = Неопределено;
	Иначе
		ОтборСтрок = Новый ФиксированнаяСтруктура("Доступность", Истина);
	КонецЕсли;
	Элементы.ЗначенияКонстант.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеСтроки(Строка)
	
	Строка.ЗначениеКартинка = ИТК_Типы.КартинкаЗначения(Строка.Значение, Строка.Тип);

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбработчикСПроверкойНаСохранностьДанных(ОписаниеОбработчика)
	
	Если Модифицированность Тогда
		
		// Список вариантов ответа
		ВариантыОтвета = Новый СписокЗначений;
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Да,		НСтр("ru = 'Закрыть';
																	|en = 'Close'"));
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Отмена,	НСтр("ru = 'Отмена';
																	|en = 'Cancel'"));
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросСохраненияЗавершение", ЭтотОбъект, ОписаниеОбработчика),
								НСтр("ru = 'При закрытии изменения будут потеряны';
									|en = 'Changes will be lost on close'"), ВариантыОтвета, , КодВозвратаДиалога.Отмена,
								ИТК_РедакторКонстантКлиентСервер.Представление());
		
	Иначе 
		
		ВыполнитьОбработкуОповещения(ОписаниеОбработчика);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросСохраненияЗавершение(Результат, ОписаниеОбработчика) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытиеРазрешеноЗакрыть(Результат, ДополнительныеПараметры) Экспорт
	
	ЗакрытиеРазрешено = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция КоличествоИзменяемыхКонстант()
	
	Отбор = Новый Структура("Изменять", Истина);
	НайденныеСтроки = ЗначенияКонстант.НайтиСтроки(Отбор);
	
	Возврат НайденныеСтроки.Количество();
	
КонецФункции

#КонецОбласти
