
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму("ОбщаяФорма.бит_НастройкиПрограммы", ПараметрыФормы());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", ПараметрыФормы());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыФормы()
	
	Подразделение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойЦФО", Пользователи.ТекущийПользователь());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктурноеПодразделение", Неопределено);
	ПараметрыФормы.Вставить("РежимНастройки"		  , Истина);
	
	Возврат ПараметрыФормы;
	
КонецФункции

#КонецОбласти