	  
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//-------------------------------------------------------------------------------------------------------
Функция бит_СобратьЭтапыПоЗаказу(ЗаказНаПроизводствоСсылка, ТолькоДокументы = Ложь) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [29.03.2026 18:33:09] +        
	Если Не ЗначениеЗаполнено(ЗаказНаПроизводствоСсылка) Тогда   
		Возврат бит_СоздатьПустуюТаблицуПар();
	КонецЕсли;
	
	ПФ = Новый Структура;
	ПФ.Вставить("Заказ", ЗаказНаПроизводствоСсылка);
	ПФ.Вставить("ПоказыватьЭтапы", Истина);
	ПФ.Вставить("ПоказыватьПеремещения", Ложь);
	ПФ.Вставить("ПоказыватьМатериалы", Истина);
	ПФ.Вставить("Назначение", Справочники.Назначения.ПустаяСсылка());
	ПФ.Вставить("Этапы", Новый ФиксированныйМассив(Новый Массив));
	
	СтруктураЭтапыАналитика = Новый Структура;
	СтруктураЭтапыАналитика.Вставить("Назначение", Справочники.Назначения.ПустаяСсылка());	
	СтруктураЭтапыАналитика.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	СтруктураЭтапыАналитика.Вставить("Склад", Неопределено);
	СтруктураЭтапыАналитика.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());  
	
	ПФ.Вставить("ЭтапыАналитика", СтруктураЭтапыАналитика);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
	
	// Отчет строит дерево через менеджер                                                    
	Отчеты.СтруктураЗаказаНаПроизводствоДинамическая.ПостроитьДеревоЗаказа(ПФ, АдресХранилища);
	
	ДеревоДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Результат = Новый Массив;
	
	Если ДеревоДанных <> Неопределено Тогда
		Если ТипЗнч(ДеревоДанных) = Тип("ДеревоЗначений") Тогда
			бит_СобратьЭтапы(ДеревоДанных.Строки, Результат, ТолькоДокументы);
		КонецЕсли;
	КонецЕсли;
	
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	ЭтапПроизводства2_2.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	                      |ГДЕ
	                      |	ЭтапПроизводства2_2.Проведен
	                      |	И ЭтапПроизводства2_2.Распоряжение = &Распоряжение
	                      |	И НЕ ЭтапПроизводства2_2.Ссылка В (&мЭтапов)");
	Запрос.УстановитьПараметр("мЭтапов", Результат);
	Запрос.УстановитьПараметр("Распоряжение", ЗаказНаПроизводствоСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат Результат;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [29.03.2026 18:33:09] -
КонецФункции

Функция бит_СоздатьПустуюТаблицуПар() 
	// {{ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:01:01] +        
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Номенклатура");
	Таблица.Колонки.Добавить("Характеристика");
	
	Возврат Таблица;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:01:01] -	
КонецФункции

Процедура бит_СобратьЭтапы(СтрокиДерева, Результат, ТолькоДокументы)
// {{ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:01:16] +        
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если ЗначениеЗаполнено(СтрокаДерева.ЭтапСсылка) Тогда
			Если ТолькоДокументы Тогда
				Если ТипЗнч(СтрокаДерева.ЭтапСсылка) = Тип("ДокументСсылка.ЭтапПроизводства2_2") Тогда
					Результат.Добавить(СтрокаДерева.ЭтапСсылка);
				КонецЕсли;
			Иначе
				Результат.Добавить(СтрокаДерева.ЭтапСсылка);
			КонецЕсли;
				
		КонецЕсли;
				
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			бит_СобратьЭтапы(СтрокаДерева.Строки, Результат, ТолькоДокументы);
		КонецЕсли;
		
	КонецЦикла;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:01:16] -	
КонецПроцедуры

//-------------------------------------------------------------------------------------------------------
Процедура РаспределитьСверхнормативныеМатериалыПоМассивуЗаказовНаПроизводство(мЗаказов) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [30.03.2026 2:22:03] +        
	Для каждого ЗаказНаПроизводство из мЗаказов Цикл
		РаспределитьСверхнормативныеМатериалы(ЗаказНаПроизводство);
	КонецЦикла;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [30.03.2026 2:22:03] -
КонецПроцедуры

Процедура РаспределитьСверхнормативныеМатериалы(ЗаказНаПроизводство) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [29.03.2026 20:40:07] +      
	// Для каждого материала сначала происходит удаление строк из этапов производства по совпадению ключей 
	// "Номенклатура" + "Характеристика" + "Статья калькуляции". 
	
	// Далее происходит повторное распределение материала между этапами "Заказа на производство" 
	// пропорционально использованному материала от общего объема в заказе на производство по логике, аналогичной в задаче 1, за исключением:
	
	// Если этап находится в статусе "Закрыт", то происходит перезаполнение не только вкладки "Обеспечение", 
	// но и вкладки "Расход". 
	
	// На вкладке "Обеспечение" устанавливается признак "Отгрузить". 
	// "Дата отгрузки" в строке распределенного материала устанавливается "Текущая дата" для обоих вкладок документа. 
	// На вкладке "Дополнительно" в поле "Завершен" устанавливается текущая  дата. 
	мЭтапов = Документы.ЗаказНаПроизводство2_2.бит_СобратьЭтапыПоЗаказу(ЗаказНаПроизводство.Ссылка, Истина);  
	Если мЭтапов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;  
	ТекДата = ТекущаяДатаСеанса();
	
	НачатьТранзакцию();
	Попытка           
		// получим объект заказа
		Если ТипЗнч(ЗаказНаПроизводство) = Тип("ДокументОбъект.ЗаказНаПроизводство2_2") Тогда
			ОбъектЗаказ = ЗаказНаПроизводство; 
			ЭтоСсылка = Ложь;
		Иначе
			ОбъектЗаказ = ЗаказНаПроизводство.ПолучитьОбъект();
			ЭтоСсылка = Истина;
		КонецЕсли;
		// Строки сверхнормативных материалов, которые еще не распределены
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаказНаПроизводство2_2бит_СверхнормативныеМатериалы.Номенклатура КАК Номенклатура,
		                      |	ЗаказНаПроизводство2_2бит_СверхнормативныеМатериалы.Характеристика КАК Характеристика,
		                      |	ЗаказНаПроизводство2_2бит_СверхнормативныеМатериалы.СтатьяКалькуляции КАК СтатьяКалькуляции,
		                      |	ЗаказНаПроизводство2_2бит_СверхнормативныеМатериалы.Количество КАК Количество, 
							  |	ЗаказНаПроизводство2_2бит_СверхнормативныеМатериалы.Склад КАК Склад,
		                      |	ЗаказНаПроизводство2_2бит_СверхнормативныеМатериалы.НомерСтроки КАК НомерСтроки
		                      |ПОМЕСТИТЬ втТаблицаКРаспредению
		                      |ИЗ
		                      |	Документ.ЗаказНаПроизводство2_2.бит_СверхнормативныеМатериалы КАК ЗаказНаПроизводство2_2бит_СверхнормативныеМатериалы
		                      |ГДЕ
		                      |	НЕ ЗаказНаПроизводство2_2бит_СверхнормативныеМатериалы.ПризнакРаспределенияМатериалов
		                      |	И ЗаказНаПроизводство2_2бит_СверхнормативныеМатериалы.Ссылка = &ЗаказНаПроизводство
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка КАК Этап,
		                      |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НомерСтроки КАК НомерСтроки
		                      |ИЗ
		                      |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТаблицаКРаспредению КАК втТаблицаКРаспредению
		                      |		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = втТаблицаКРаспредению.Номенклатура
		                      |			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика = втТаблицаКРаспредению.Характеристика
		                      |			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции = втТаблицаКРаспредению.СтатьяКалькуляции
		                      |ГДЕ
		                      |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В(&мЭтапов)
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Этап,
		                      |	НомерСтроки УБЫВ
		                      |ИТОГИ ПО
		                      |	Этап
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка КАК Этап,
		                      |	ЭтапПроизводства2_2РасходМатериаловИРабот.НомерСтроки КАК НомерСтроки
		                      |ИЗ
		                      |	Документ.ЭтапПроизводства2_2.РасходМатериаловИРабот КАК ЭтапПроизводства2_2РасходМатериаловИРабот
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТаблицаКРаспредению КАК втТаблицаКРаспредению
		                      |		ПО ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура = втТаблицаКРаспредению.Номенклатура
		                      |			И ЭтапПроизводства2_2РасходМатериаловИРабот.Характеристика = втТаблицаКРаспредению.Характеристика
		                      |			И ЭтапПроизводства2_2РасходМатериаловИРабот.СтатьяКалькуляции = втТаблицаКРаспредению.СтатьяКалькуляции
		                      |ГДЕ
		                      |	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка В(&мЭтапов)
		                      |	И ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Этап,
		                      |	НомерСтроки УБЫВ
		                      |ИТОГИ ПО
		                      |	Этап
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка КАК Этап,
		                      |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
		                      |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика КАК Характеристика,
		                      |	СУММА(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество) КАК Количество
		                      |ИЗ
		                      |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТаблицаКРаспредению КАК втТаблицаКРаспредению
		                      |		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = втТаблицаКРаспредению.Номенклатура
		                      |			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика = втТаблицаКРаспредению.Характеристика
		                      |ГДЕ
		                      |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В(&мЭтапов)
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка,
		                      |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
		                      |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика");
		Запрос.УстановитьПараметр("ЗаказНаПроизводство", ЗаказНаПроизводство.Ссылка);  
		Запрос.УстановитьПараметр("мЭтапов", мЭтапов);     
		Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		ТаблицаКРаспредению 		= Результат[0].Выгрузить();
		ВыборкаКУдалениюматериалы   = Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаКУдалениюРасход		= Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТаблицаКДобавлению 			= Результат[3].Выгрузить();
		
		// Получим соответствие этап ссылка - этап объект в память один раз  
		ЭтапыПоСсылке = Новый Соответствие;
		Для Каждого ЭтапСсылка Из мЭтапов Цикл
			Если ЗначениеЗаполнено(ЭтапСсылка) Тогда
				ЭтапыПоСсылке.Вставить(ЭтапСсылка, ЭтапСсылка.ПолучитьОбъект());
			КонецЕсли;
		КонецЦикла;
		// Сначала удаляем старые строки из этапов по полному ключу: Номенклатура + Характеристика + СтатьяКалькуляции
			// ОбеспечениеМатериаламиИРаботами
		Пока ВыборкаКУдалениюМатериалы.Следующий() Цикл
			ЭтапОбъект = ЭтапыПоСсылке.Получить(ВыборкаКУдалениюматериалы.Этап); 
			ЭтапОбъект.ДополнительныеСвойства.Вставить("Изменен", истина);
			Детали = ВыборкаКУдалениюМатериалы.Выбрать();
			Пока Детали.Следующий() Цикл
				СтрокаКУдалению = ЭтапОбъект.ОбеспечениеМатериаламиИРаботами.Найти(Детали.НомерСтроки, "НомерСтроки");
				ЭтапОбъект.ОбеспечениеМатериаламиИРаботами.Удалить(СтрокаКУдалению);
			КонецЦикла;
		КонецЦикла;
			// РасходМатериаловИРабот 
		Пока ВыборкаКУдалениюРасход.Следующий() Цикл
			ЭтапОбъект = ЭтапыПоСсылке.Получить(ВыборкаКУдалениюРасход.Этап);
			Если не ЭтапОбъект.ДополнительныеСвойства.Свойство("Изменен") Тогда
				ЭтапОбъект.ДополнительныеСвойства.Вставить("Изменен", истина);
			КонецЕсли;
			
			Детали = ВыборкаКУдалениюРасход.Выбрать();
			Пока Детали.Следующий() Цикл
				СтрокаКУдалению = ЭтапОбъект.РасходМатериаловИРабот.Найти(Детали.НомерСтроки, "НомерСтроки");
				ЭтапОбъект.РасходМатериаловИРабот.Удалить(СтрокаКУдалению);
			КонецЦикла;
		КонецЦикла;
		// ------------------------------------------------------------------------------------------------------------
		// Теперь распределяем:
		РаспределитьПоЭтапам(ЭтапыПоСсылке, ТаблицаКРаспредению, ТаблицаКДобавлению);
		// ------------------------------------------------------------------------------------------------------------
		// записываем все оставшиеся этапы
		Для каждого стр из ЭтапыПоСсылке Цикл
			Если стр.Значение.ДополнительныеСвойства.Свойство("Изменен") Тогда
				стр.Значение.Записать();
			КонецЕсли;
		КонецЦикла;
		// проставляем флаг в заказе распределено = истина 
		// (необязательно, т.к. все равно пересчитывается, но сделаем - вдруг понадобится где то еще)
		Для каждого стр из ТаблицаКРаспредению Цикл
			строкаПоКлючу = ОбъектЗаказ.бит_СверхнормативныеМатериалы.Найти(стр.НомерСтроки, "НомерСтроки");
			строкаПоКлючу.ПризнакРаспределенияМатериалов = Истина;
		КонецЦикла;
		// если передан объект то записывать не будем. Если ссылка - будем.
		Если ЭтоСсылка Тогда
			ОбъектЗаказ.Записать();
		КонецЕсли;
		// ------------------------------
		ЗафиксироватьТранзакцию();
	Исключение               
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось завершить распределение по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [29.03.2026 20:40:07] -	
КонецПроцедуры     

Процедура РаспределитьПоЭтапам(ЭтапыПоСсылке, ТаблицаКРаспредению, ТаблицаКДобавлению) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [30.03.2026 0:09:05] +        
	ТекДата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаКРаспредению.СтатьяКалькуляции КАК СтатьяКалькуляции,
	                      |	ТаблицаКРаспредению.Номенклатура КАК Номенклатура,
	                      |	ТаблицаКРаспредению.Характеристика КАК Характеристика,
	                      |	ТаблицаКРаспредению.Склад КАК Склад,
	                      |	ТаблицаКРаспредению.Количество КАК ОбщееКоличество
	                      |ПОМЕСТИТЬ втОбщее
	                      |ИЗ
	                      |	&ТаблицаКРаспредению КАК ТаблицаКРаспредению
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаКДобавлению.Этап КАК Этап,
	                      |	ТаблицаКДобавлению.Номенклатура КАК Номенклатура,
	                      |	ТаблицаКДобавлению.Характеристика КАК Характеристика,
	                      |	ТаблицаКДобавлению.Количество КАК КоличествоЭтапа
	                      |ПОМЕСТИТЬ втЭтапы
	                      |ИЗ
	                      |	&ТаблицаКДобавлению КАК ТаблицаКДобавлению
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втЭтапы.Номенклатура КАК Номенклатура,
	                      |	втЭтапы.Характеристика КАК Характеристика,
	                      |	СУММА(втЭтапы.КоличествоЭтапа) КАК КоличествоПоВсемЭтапам
	                      |ПОМЕСТИТЬ втОбщееПоВсемЭтапам
	                      |ИЗ
	                      |	втЭтапы КАК втЭтапы
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	втЭтапы.Номенклатура,
	                      |	втЭтапы.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втЭтапы.Этап КАК Этап,
	                      |	втЭтапы.Номенклатура КАК Номенклатура,
	                      |	втЭтапы.Характеристика КАК Характеристика,
	                      |	втЭтапы.КоличествоЭтапа / втОбщееПоВсемЭтапам.КоличествоПоВсемЭтапам КАК Доля
	                      |ПОМЕСТИТЬ втДоля
	                      |ИЗ
	                      |	втЭтапы КАК втЭтапы
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОбщееПоВсемЭтапам КАК втОбщееПоВсемЭтапам
	                      |		ПО втЭтапы.Номенклатура = втОбщееПоВсемЭтапам.Номенклатура
	                      |			И втЭтапы.Характеристика = втОбщееПоВсемЭтапам.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втДоля.Этап КАК Этап,
	                      |	втДоля.Номенклатура КАК Номенклатура,
	                      |	втДоля.Характеристика КАК Характеристика,
	                      |	ВЫРАЗИТЬ(втОбщее.ОбщееКоличество * втДоля.Доля КАК ЧИСЛО(15, 3)) КАК Количество,
	                      |	втОбщее.СтатьяКалькуляции КАК СтатьяКалькуляции,
	                      |	втОбщее.Склад КАК Склад
	                      |ПОМЕСТИТЬ База
	                      |ИЗ
	                      |	втДоля КАК втДоля
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОбщее КАК втОбщее
	                      |		ПО втДоля.Номенклатура = втОбщее.Номенклатура
	                      |			И втДоля.Характеристика = втОбщее.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	влДельта.Номенклатура КАК Номенклатура,
	                      |	влДельта.Характеристика КАК Характеристика,
	                      |	СУММА(влДельта.Дельта) КАК Дельта
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ЕСТЬNULL(влБаза.Номенклатура, влОбщее.Номенклатура) КАК Номенклатура,
	                      |		ЕСТЬNULL(влБаза.Характеристика, влОбщее.Характеристика) КАК Характеристика,
	                      |		ЕСТЬNULL(влБаза.Количество, 0) - ЕСТЬNULL(влОбщее.Количество, 0) КАК Дельта
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			База.Номенклатура КАК Номенклатура,
	                      |			База.Характеристика КАК Характеристика,
	                      |			СУММА(База.Количество) КАК Количество
	                      |		ИЗ
	                      |			База КАК База
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			База.Номенклатура,
	                      |			База.Характеристика) КАК влБаза
	                      |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |				втОбщее.Номенклатура КАК Номенклатура,
	                      |				втОбщее.Характеристика КАК Характеристика,
	                      |				СУММА(втОбщее.ОбщееКоличество) КАК Количество
	                      |			ИЗ
	                      |				втОбщее КАК втОбщее
	                      |			
	                      |			СГРУППИРОВАТЬ ПО
	                      |				втОбщее.Номенклатура,
	                      |				втОбщее.Характеристика) КАК влОбщее
	                      |			ПО влБаза.Номенклатура = влОбщее.Номенклатура
	                      |				И влБаза.Характеристика = влОбщее.Характеристика) КАК влДельта
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	влДельта.Номенклатура,
	                      |	влДельта.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	База.Этап КАК Этап,
	                      |	База.Номенклатура КАК Номенклатура,  
						  |	База.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
	                      |	База.Характеристика КАК Характеристика,
	                      |	База.Количество КАК Количество,
	                      |	База.Количество КАК КоличествоУпаковок,
	                      |	База.СтатьяКалькуляции КАК СтатьяКалькуляции,
	                      |	База.Склад КАК Склад
	                      |ИЗ
	                      |	База КАК База
	                      |ИТОГИ ПО
	                      |	Этап");

	Запрос.УстановитьПараметр("ТаблицаКРаспредению", ТаблицаКРаспредению);
	Запрос.УстановитьПараметр("ТаблицаКДобавлению", ТаблицаКДобавлению);  
	Результат = Запрос.ВыполнитьПакет();
	таблицаДельта = Результат[5].Выгрузить();
	ВыборкаЭтапы = Результат[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЭтапы.Следующий() Цикл
		ЭтапОбъект = ЭтапыПоСсылке.Получить(ВыборкаЭтапы.Этап);
		ЕстьИзменения = Ложь;
		
		ВыборкаДетали = ВыборкаЭтапы.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			ЕстьИзменения = Истина;
			// Обеспечение   
			НоваяСтрокаОбеспечение = Неопределено;
			НоваяСтрокаРасход = Неопределено;
			
			ОстатокНаСкладе = ОпределитьОстатокНаСкладе(ВыборкаДетали.Номенклатура, ВыборкаДетали.Характеристика, ВыборкаДетали.Склад, КонецДня(ВыборкаЭтапы.Этап.Дата));
			Если ОстатокНаСкладе = 0 Тогда
				Отгрузить = 0;
				Обеспечить = ВыборкаДетали.Количество;
			ИначеЕсли ОстатокНаСкладе >= ВыборкаДетали.Количество Тогда
				Отгрузить = ВыборкаДетали.Количество;
				Обеспечить = 0;
			Иначе         
				Отгрузить = ОстатокНаСкладе;
				Обеспечить = ВыборкаДетали.Количество - Отгрузить;
			КонецЕсли;
			
			Если Отгрузить > 0 Тогда
				НоваяСтрокаОбеспечение = ЭтапОбъект.ОбеспечениеМатериаламиИРаботами.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаОбеспечение, ВыборкаДетали);
				НоваяСтрокаОбеспечение.Количество = Отгрузить; 
				НоваяСтрокаОбеспечение.КоличествоУпаковок = НоваяСтрокаОбеспечение.Количество;
				НоваяСтрокаОбеспечение.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
				НоваяСтрокаОбеспечение.ДатаОтгрузки = ТекДата;
			КонецЕсли;
			Если Обеспечить > 0 Тогда
				НоваяСтрокаОбеспечение = ЭтапОбъект.ОбеспечениеМатериаламиИРаботами.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаОбеспечение, ВыборкаДетали);
				НоваяСтрокаОбеспечение.Количество = Обеспечить; 
				НоваяСтрокаОбеспечение.КоличествоУпаковок = НоваяСтрокаОбеспечение.Количество;
				НоваяСтрокаОбеспечение.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
			КонецЕсли;
			
			// Расход
			Если ЭтапОбъект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда
				
				ЭтапОбъект.ФактическоеОкончаниеЭтапа = ТекДата;
				
				НоваяСтрокаРасход = ЭтапОбъект.РасходМатериаловИРабот.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРасход, ВыборкаДетали);
				НоваяСтрокаРасход.ДатаРасхода = ТекДата;
			КонецЕсли;    
			// спишем сразу дельту
			СтрокаПоКлючу = таблицаДельта.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ВыборкаДетали.Номенклатура, ВыборкаДетали.Характеристика));
			Если СтрокаПоКлючу.Количество() И СтрокаПоКлючу[0].Дельта <> 0 Тогда
				Если НоваяСтрокаОбеспечение <> Неопределено Тогда
					НоваяСтрокаОбеспечение.Количество = НоваяСтрокаОбеспечение.Количество + СтрокаПоКлючу[0].Дельта;
				    НоваяСтрокаОбеспечение.КоличествоУпаковок = НоваяСтрокаОбеспечение.КоличествоУпаковок + СтрокаПоКлючу[0].Дельта;
				КонецЕсли;
				Если НоваяСтрокаРасход <> Неопределено Тогда
					НоваяСтрокаРасход.Количество = НоваяСтрокаРасход.Количество + СтрокаПоКлючу[0].Дельта;
				    НоваяСтрокаРасход.КоличествоУпаковок = НоваяСтрокаРасход.КоличествоУпаковок + СтрокаПоКлючу[0].Дельта;
				КонецЕсли;
				СтрокаПоКлючу[0].Дельта = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		// сразу запишем этап, чтобы двинулись остатки по складам.                      
		Изменен = Неопределено;
		ЭтапОбъект.ДополнительныеСвойства.Свойство("Изменен", Изменен);
		
		Если ЕстьИзменения = Истина Или Изменен = Истина Тогда
			ЭтапОбъект.Записать();                          
			Если ЭтапОбъект.ДополнительныеСвойства.Свойство("Изменен") Тогда
				ЭтапОбъект.ДополнительныеСвойства.Удалить("Изменен");
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [30.03.2026 0:09:05] -
КонецПроцедуры

Функция ОпределитьОстатокНаСкладе(Номенклатура, Характеристика, Склад, Период) Экспорт
// {{ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:57:35] +        
	Если не ЗначениеЗаполнено(Склад) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Остаток
	                      |ПОМЕСТИТЬ втОбщий
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                      |			&Период,
	                      |			Номенклатура = &Номенклатура
	                      |				И Характеристика = &Характеристика
	                      |				И Склад = &Склад
	                      |				И Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ТоварыНаСкладахОстатки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СУММА(ТоварыКОтгрузкеОстатки.ВРезервеОстаток + ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.КОформлениюОстаток + ТоварыКОтгрузкеОстатки.КСборкеОстаток + ТоварыКОтгрузкеОстатки.СобираетсяОстаток + ТоварыКОтгрузкеОстатки.СобраноОстаток) КАК Недоступно
	                      |ПОМЕСТИТЬ втрезерв
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	                      |			&Период,
	                      |			Номенклатура = &Номенклатура И Характеристика = &Характеристика
	                      |				И Склад = &Склад
	                      |				И Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ТоварыКОтгрузкеОстатки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЕСТЬNULL(втОбщий.Остаток, 0) - ЕСТЬNULL(втРезерв.Недоступно, 0) КАК остаток
	                      |ИЗ
	                      |	втОбщий КАК втОбщий,
	                      |	втрезерв КАК втРезерв");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Остаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.6]  [VUVaynula@1cbit.ru] [25.03.2026 19:57:35] -:
КонецФункции

// -------------------------------------------------------------------------------------------------------------------------
Функция ДоступностьКомандыРаспределения(ЗаказНаПроизводство) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [29.03.2026 18:31:45] +        
	Если Не УправлениеДоступом.ЕстьРоль("бит_ПервыйБит_РаспределениеМатериаловВЗаказеНаПроизводство") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказНаПроизводство) Тогда
		Этапы = бит_СобратьЭтапыПоЗаказу(ЗаказНаПроизводство, Истина);
		Если ЕстьЭтапыВЗакрытомПериоде(Этапы) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [29.03.2026 18:31:45] -
КонецФункции

Функция ЕстьЭтапыВЗакрытомПериоде(Этапы)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [29.03.2026 18:46:48] +        
	Результат = Ложь;
	Для каждого стр из Этапы Цикл
		Если ДатыЗапретаИзменения.ИзменениеЗапрещено(стр) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.17]  [VUVaynula@1cbit.ru] [29.03.2026 18:46:48] -
КонецФункции

#КонецЕсли