
#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет группу на форме "ГруппаРедакторФормул".
// 
// Параметры:
//  ЭтаФорма  - УправляемаяФорма
//  ЕстьМакет - Булево (По умолчанию = Ложь).
// 
Процедура рф_ИнициализацияРедактораФормул(ЭтаФорма, ЕстьМакет = Ложь) Экспорт
	
	Элементы = ЭтаФорма.Элементы;
	Команды  = ЭтаФорма.Команды;
	
	// ----------------------------------------------------------------------
	// Реквизиты формы
	ОП_Строка = Новый ОписаниеТипов("Строка");
	ОП_Булево = Новый ОписаниеТипов("Булево");
	ОП_ТЗ     = Новый ОписаниеТипов("ТаблицаЗначений");
	
	// Новые реквизиты формы.	
	РеквизитыРФ = Новый Массив;
	ТекстЗаголовка = НСтр("ru='Редактор формул открыт';en='The formula editor is open'");
	РеквизитыРФ.Добавить(Новый РеквизитФормы("рфРедакторФормулОткрыт", ОП_Булево,, ТекстЗаголовка));
	ТекстЗаголовка = НСтр("ru='Формула';en='Formula'");
	РеквизитыРФ.Добавить(Новый РеквизитФормы("рфФормула", ОП_Строка,, ТекстЗаголовка));
	ТекстЗаголовка = НСтр("ru='Старая формула';en='Old formula'");
	РеквизитыРФ.Добавить(Новый РеквизитФормы("рфСтараяФормула", ОП_Строка,, ТекстЗаголовка));
	ТекстЗаголовка =  НСтр("ru='Это добавление';en='This addition'");
	РеквизитыРФ.Добавить(Новый РеквизитФормы("рфЭтоДобавление", ОП_Булево,, ТекстЗаголовка));
	ТекстЗаголовка = НСтр("ru='Строка возврата';en='Return a string'");
	РеквизитыРФ.Добавить(Новый РеквизитФормы("рфСтрокаНазад", ОП_Строка,, ТекстЗаголовка));
	ТекстЗаголовка = НСтр("ru='Имя области - получателя';en='Name of the recipient area'");
	РеквизитыРФ.Добавить(Новый РеквизитФормы("рфИмяОбластиПолучатель", ОП_Строка,, ТекстЗаголовка));
	ТекстЗаголовка = НСтр("ru='Выбранные области';en='Selected area'");
	РеквизитыРФ.Добавить(Новый РеквизитФормы("рфВыбранныеОбласти", ОП_ТЗ,, ТекстЗаголовка));
	РеквизитыРФ.Добавить(Новый РеквизитФормы("ИмяОбласти", ОП_Строка, "рфВыбранныеОбласти", ТекстЗаголовка));
	РеквизитыРФ.Добавить(Новый РеквизитФормы("ЗаголовокОбласти", ОП_Строка, "рфВыбранныеОбласти", ТекстЗаголовка));
	ТекстЗаголовка = НСтр("ru='Это первая активизация поля-получателя';en='This is the first activation of the recipient field'");
	РеквизитыРФ.Добавить(Новый РеквизитФормы("рфПерваяАктивизацияПоляПолучателя", ОП_Булево, , ТекстЗаголовка));
	
	ЭтаФорма.ИзменитьРеквизиты(РеквизитыРФ);
	
	рф_ДобавитьЭлементыРедактораФормул(Элементы, Команды); 		
	
КонецПроцедуры // Рф_ИнициализацияРедактораФормул()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция добавляет группу
// 
// Параметры:
//  Элементы 				- ВсеЭлементыФормы.
//  ИмяГруппы  				- Строка.
//  ГруппаРодитель  		- Строка.
//  ГруппировкаВертикальная - Булево (По умолчанию = Истина).
//  
// Возвращаемое значение:
//   Тип.Вид   - описание.
// 
Функция рф_ДобавитьКоманднуюПанель(Элементы, ИмяГруппы, ГруппаРодитель, ГоризонтальноеПоложение, ШиринаЭлемента)
	
	НоваяГруппа = Элементы.Добавить("ГруппаКоманднаяПанель" + ИмяГруппы, Тип("ГруппаФормы"), ГруппаРодитель);
	НоваяГруппа.Вид 					 = ВидГруппыФормы.КоманднаяПанель;
	НоваяГруппа.ГоризонтальноеПоложение  = ГоризонтальноеПоложение;
	НоваяГруппа.Ширина					 = ШиринаЭлемента;
	НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
	
	Возврат НоваяГруппа;
	
КонецФункции // Рф_ДобавитьКоманднуюПанель()

// Функция добавляет группу
// 
// Параметры:
//  Элементы 				- ВсеЭлементыФормы.
//  ИмяГруппы  				- Строка.
//  ГруппаРодитель  		- Строка.
//  ГруппировкаВертикальная - Булево (По умолчанию = Истина).
//  
// Возвращаемое значение:
//   Тип.Вид   - описание.
// 
Функция рф_ДобавитьОбычнуюГруппу(Элементы, ИмяГруппы, ГруппаРодитель, ГруппировкаВертикальная = Истина)
	
	НоваяГруппа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаРодитель);
	НоваяГруппа.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка 		= ?(ГруппировкаВертикальная, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная);
	НоваяГруппа.Отображение 		= ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	
	Возврат НоваяГруппа;
	
КонецФункции // Рф_ДобавитьОбычнуюГруппу()

// Процедура добавляет команду и кнопку.
// 
// Параметры:
//  Элементы		 - ВсеЭлементыФормы.
//  Команды			 - КомандыФормы.
//  ПостфиксИмени    - Строка.
//  ПараметрыКоманды - Структура:
//						Действие  - Строка,
//						Заголовок - Строка,
//						Подсказка - Строка.
//  ПараметрыКнопки  - Структура:
//						ГруппаРодитель,
//						ШиринаКнопки - Число,
//						ВысотаКнопки - Число.
// 
Процедура рф_ДобавитьКомандуКнопку(Элементы, Команды, ПостфиксИмени, ПараметрыКоманды, ПараметрыКнопки)
	
	НоваяКоманда = Команды.Добавить("РедакторФормул_" + ПостфиксИмени);
	НоваяКоманда.Действие  = ПараметрыКоманды.Действие;
	НоваяКоманда.Заголовок = ПараметрыКоманды.Заголовок;
	НоваяКоманда.Подсказка = ПараметрыКоманды.Подсказка;
	
	НоваяКнопка = Элементы.Добавить("РедакторФормул_" + ПостфиксИмени, Тип("КнопкаФормы"), ПараметрыКнопки.ГруппаРодитель);
	НоваяКнопка.ИмяКоманды = НоваяКоманда.Имя;	
	НоваяКнопка.Ширина     = ПараметрыКнопки.Ширина;
	НоваяКнопка.Высота     = ПараметрыКнопки.Высота;
	
КонецПроцедуры // Рф_ДобавитьКомандуКнопку()

// Процедура добавляет команду и кнопку.
// 
// Параметры:
//  Элементы		 - ВсеЭлементыФормы.
//  Команды			 - КомандыФормы.
//  ПостфиксИмени    - Строка.
//  ДействиеКоманды  - Строка,
//	ЗаголовокКоманды - Строка,
//	ГруппаРодитель.
// 
Процедура рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, ПостфиксИмени, ДействиеКоманды, ЗаголовокКоманды, ГруппаРодитель)
	
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", ДействиеКоманды, ЗаголовокКоманды, "");
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаРодитель, 0, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, ПостфиксИмени, ПараметрыКоманды, ПараметрыКнопки);
	
КонецПроцедуры // рф_ДобавитьПростуюКомандуКнопку()

// Процедура добавялет кнопки редактора формул.
// 
// Параметры:
//  Элементы		 				   - ВсеЭлементыФормы.
//  Команды			 				   - КомандыФормы.
//  ГруппаРедакторФормулГоризонтальная - ГруппаФормы.
// 
Процедура рф_ДобавитьЭлементыКалькулятора(Элементы, Команды, ГруппаРедакторФормулГоризонтальная)
	
	// Имя обработчика команд:
	// "РедакторФормул_Цифра", "РедакторФормул_Запятая", "РедакторФормул_СкобкаЛевая", "РедакторФормул_СкобкаПравая",
	// "РедакторФормул_Плюс" , "РедакторФормул_Минус"  , "РедакторФормул_Умножить"   , "РедакторФормул_Разделить",
	// "РедакторФормул_Обратное", "РедакторФормул_Очистить" .
	ИмяОбработчикаПростыхКоманд = "Подключаемый_РедакторФормул_ПростыеКоманды";
	
	#Область ГруппаЦифры
	
	ГруппаЦифры = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаЦифры", ГруппаРедакторФормулГоризонтальная);
	
	// ГруппаЦифры0Запятая
	ГруппаЦифры0Скобки = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаЦифры0Скобки", ГруппаЦифры, Ложь);
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "Цифра_0"	 , ИмяОбработчикаПростыхКоманд, "0", ГруппаЦифры0Скобки);// "РедакторФормул_Цифра"
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "СкобкаЛевая" , ИмяОбработчикаПростыхКоманд, "(", ГруппаЦифры0Скобки);// "РедакторФормул_СкобкаЛевая"
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "СкобкаПравая", ИмяОбработчикаПростыхКоманд, ")", ГруппаЦифры0Скобки);// "РедакторФормул_СкобкаПравая"
	
	// ГруппаЦифры123
	ГруппаЦифры123 = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаЦифры123", ГруппаЦифры, Ложь);
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "Цифра_1", ИмяОбработчикаПростыхКоманд, "1", ГруппаЦифры123);// "РедакторФормул_Цифра"
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "Цифра_2", ИмяОбработчикаПростыхКоманд, "2", ГруппаЦифры123);// "РедакторФормул_Цифра"
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "Цифра_3", ИмяОбработчикаПростыхКоманд, "3", ГруппаЦифры123);// "РедакторФормул_Цифра"
	
	// ГруппаЦифры456
	ГруппаЦифры456 = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаЦифры456", ГруппаЦифры, Ложь);
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "Цифра_4", ИмяОбработчикаПростыхКоманд, "4", ГруппаЦифры456);// "РедакторФормул_Цифра"
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "Цифра_5", ИмяОбработчикаПростыхКоманд, "5", ГруппаЦифры456);// "РедакторФормул_Цифра"
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "Цифра_6", ИмяОбработчикаПростыхКоманд, "6", ГруппаЦифры456);// "РедакторФормул_Цифра"
	
	// ГруппаЦифры789
	ГруппаЦифры789 = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаЦифры789", ГруппаЦифры, Ложь);
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "Цифра_7", ИмяОбработчикаПростыхКоманд, "7", ГруппаЦифры789);// "РедакторФормул_Цифра"
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "Цифра_8", ИмяОбработчикаПростыхКоманд, "8", ГруппаЦифры789);// "РедакторФормул_Цифра"
	рф_ДобавитьПростуюКомандуКнопку(Элементы, Команды, "Цифра_9", ИмяОбработчикаПростыхКоманд, "9", ГруппаЦифры789);// "РедакторФормул_Цифра"
	
	#КонецОбласти
	
	#Область ГруппаЗнаки
	
	ГруппаЗнаки = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаЗнаки", ГруппаРедакторФормулГоризонтальная);
	
	// ГруппаФункции1
	ГруппаФункции1 = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаФункции1", ГруппаЗнаки, Ложь);
	// Кнопка "Очистить".
	ТекстПодсказки = НСтр("ru='Очистить формулу';en='Clear the formula'");
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", "Подключаемый_РедакторФормул_Очистить", "C", ТекстПодсказки);
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаФункции1, 5, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, "Очистить", ПараметрыКоманды, ПараметрыКнопки);
	// Кнопка "Плюс".
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", ИмяОбработчикаПростыхКоманд, "+", "");
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаФункции1, 4, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, "Плюс", ПараметрыКоманды, ПараметрыКнопки);
	// Кнопка "Минус".
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", ИмяОбработчикаПростыхКоманд, "-", "");
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаФункции1, 4, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, "Минус", ПараметрыКоманды, ПараметрыКнопки);
	
	// ГруппаФункции2
	ГруппаФункции2 = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаФункции2", ГруппаЗнаки, Ложь);
	// Кнопка "Обратное".
	ТекстПодсказки = НСтр("ru='Обратное от 1';en='Reverse of 1'");
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", ИмяОбработчикаПростыхКоманд, "1/x", ТекстПодсказки);
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаФункции2, 5, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, "Обратное", ПараметрыКоманды, ПараметрыКнопки);
	// Кнопка "Умножить".
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", ИмяОбработчикаПростыхКоманд, "*", "");
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаФункции2, 4, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, "Умножить", ПараметрыКоманды, ПараметрыКнопки);
	// Кнопка "Разделить".
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", ИмяОбработчикаПростыхКоманд, "/", "");
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаФункции2, 4, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, "Разделить", ПараметрыКоманды, ПараметрыКнопки);
	
	// ГруппаФункции3
	ГруппаФункции3 = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаФункции3", ГруппаЗнаки, Ложь);
	// Кнопка "Вставить функцию".
	ТекстПодсказки = НСтр("ru='Вставить функцию';en='Insert a function'");
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", "Подключаемый_РедакторФормул_Функция", "f(x)", ТекстПодсказки);
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаФункции3, 5, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, "Функция", ПараметрыКоманды, ПараметрыКнопки);
	Элементы.РедакторФормул_Функция.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.F, Ложь, Ложь, Истина);
	// Кнопка "Запятая".
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", ИмяОбработчикаПростыхКоманд, ",", "");
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаФункции3, 4, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, "Запятая", ПараметрыКоманды, ПараметрыКнопки);
	// Кнопка "Закончить редактирование".
	ТекстПодсказки = НСтр("ru='Закончить редактирование';en='To finish editing'");
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", "Подключаемый_РедакторФормул_ЗавершитьРедактирование", "=", ТекстПодсказки);
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаФункции3, 4, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, "Равно", ПараметрыКоманды, ПараметрыКнопки);
	
	#КонецОбласти
	
КонецПроцедуры // Рф_ДобавитьЭлементыКалькулятора()

// Процедура заполняет группу на форме "ГруппаРедакторФормул".
// 
// Параметры:
//  Элементы - ВсеЭлементыФормы.
//  Команды	 - КомандыФормы.
// 
Процедура рф_ДобавитьЭлементыРедактораФормул(Элементы, Команды)
	
	// ----------------------------------------------------------------------
	// ГруппаКоманднаяПанельРедактораФормул
	ГруппаКомПанельРф = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаКоманднаяПанельРедактораФормул", Элементы.ГруппаРедакторФормул, Ложь);
	// ОТКЛЮЧЕНО до решения проблемы представления элементов списка.
	// ГруппаКоманднаяПанельРедактораФормулЛево
	ГруппаКоманднаяПанельРедактораФормулЛево = рф_ДобавитьКоманднуюПанель(Элементы, "РедактораФормулЛево", ГруппаКомПанельРф, ГоризонтальноеПоложениеЭлемента.Лево, 3);
	
	// ГруппаКоманднаяПанельРедактораФормулПоля
	ГруппаКоманднаяПанельРедактораФормулПоля = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаКоманднаяПанельРедактораФормулПоля", ГруппаКомПанельРф, Ложь);
	// РфФормула (Текст)
	ПолеПросмотраФормулы = Элементы.Добавить("рфФормулаТекст", Тип("ПолеФормы"), ГруппаКоманднаяПанельРедактораФормулПоля);
	ПолеПросмотраФормулы.Вид 		    		  = ВидПоляФормы.ПолеВвода;
	ПолеПросмотраФормулы.ПутьКДанным    		  = "рфФормула";
	ПолеПросмотраФормулы.ТолькоПросмотр 		  = Истина;
	ПолеПросмотраФормулы.РедактированиеТекста	  = Ложь;
	ПолеПросмотраФормулы.ЦветТекста	    		  = ЦветаСтиля.бит_ЦветГиперссылки;
	ПолеПросмотраФормулы.РастягиватьПоГоризонтали = Истина;
	// РфСтрокаНазад
	ПолеСписокДействий = Элементы.Добавить("рфСтрокаНазад", Тип("ПолеФормы"), ГруппаКоманднаяПанельРедактораФормулПоля);
	ПолеСписокДействий.Вид 		 		 	 	= ВидПоляФормы.ПолеВвода; 
	ПолеСписокДействий.ПутьКДанным 		 	    = "рфСтрокаНазад";
	ПолеСписокДействий.КнопкаВыпадающегоСписка  = Истина;
	ПолеСписокДействий.РежимВыбораИзСписка		= Истина;
	ПолеСписокДействий.АвтоМаксимальнаяШирина	= Ложь;
	ПолеСписокДействий.МаксимальнаяШирина 		= 1;
	ПолеСписокДействий.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеСписокДействий.РастягиватьПоГоризонтали = Ложь;
	ПолеСписокДействий.УстановитьДействие("ОбработкаВыбора", "Подключаемый_СтрокаНазадОбработкаВыбора");
	
	// ГруппаКоманднаяПанельРедактораФормулПраво.
	ГруппаКоманднаяПанельРедактораФормулПраво = рф_ДобавитьКоманднуюПанель(Элементы, "РедактораФормулПраво", ГруппаКомПанельРф, ГоризонтальноеПоложениеЭлемента.Право, 16);
	// Кнопка "Закончить редактирование".
	ТекстПодсказки = НСтр("ru='Закончить редактирование';en='To finish editing'");
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", "Подключаемый_РедакторФормул_ЗавершитьРедактирование", "ОК", ТекстПодсказки);
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаКоманднаяПанельРедактораФормулПраво, 0, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, "ОК", ПараметрыКоманды, ПараметрыКнопки);
	// Кнопка "Закрыть редактор формул".
	ТекстПодсказки = НСтр("ru='Закрыть редактор формул';en='Close the formula editor'");
	ПараметрыКоманды = Новый Структура("Действие, Заголовок, Подсказка", "Подключаемый_РедакторФормул_ЗавершитьРедактирование", "Закрыть", ТекстПодсказки);
	ПараметрыКнопки  = Новый Структура("ГруппаРодитель, Ширина, Высота", ГруппаКоманднаяПанельРедактораФормулПраво, 0, 0);
	рф_ДобавитьКомандуКнопку(Элементы, Команды, "Закрыть", ПараметрыКоманды, ПараметрыКнопки);
	КомандаЗакрыть = Команды.Найти("РедакторФормул_Закрыть");
	КомандаЗакрыть.Картинка    = БиблиотекаКартинок.Закрыть;
	КомандаЗакрыть.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	// ----------------------------------------------------------------------
	// ГруппаРедакторФормулГоризонтальная
	ГруппаРедакторФормулГоризонтальная = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаРедакторФормулГоризонтальная", Элементы.ГруппаРедакторФормул, Ложь);
	ГруппаРедакторФормулГоризонтальная.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	
	// Калькулятор
	рф_ДобавитьЭлементыКалькулятора(Элементы, Команды, ГруппаРедакторФормулГоризонтальная);
	
	// РфФормула (Поле ввода формулы)
	ПолеВводаФормулы = Элементы.Добавить("рфФормула", Тип("ПолеФормы"), ГруппаРедакторФормулГоризонтальная);
	ПолеВводаФормулы.Вид 		 			= ВидПоляФормы.ПолеТекстовогоДокумента;
	ПолеВводаФормулы.ПутьКДанным 			= "рфФормула";
	ПолеВводаФормулы.Высота 	 			= 4;
	ПолеВводаФормулы.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеВводаФормулы.УстановитьДействие("ПриИзменении", "Подключаемый_ФормулаПриИзменении");
	
	// ГруппаВыбранныеОбласти
	ГруппаВыбранныеОбласти = рф_ДобавитьОбычнуюГруппу(Элементы, "ГруппаВыбранныеОбласти", ГруппаРедакторФормулГоризонтальная);
	НоваяТаблица = Элементы.Добавить("рфВыбранныеОбласти", Тип("ТаблицаФормы"), ГруппаВыбранныеОбласти);
	НоваяТаблица.ПутьКДанным 			  = "рфВыбранныеОбласти";
	НоваяТаблица.ИзменятьПорядокСтрок 	  = Ложь;
	НоваяТаблица.ИзменятьСоставСтрок  	  = Истина;
	НоваяТаблица.Высота 				  = 4;
	НоваяТаблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	НоваяТаблица.УстановитьДействие("Выбор"				    , "Подключаемый_ВыбранныеОбластиВыбор");
	НоваяТаблица.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_ВыбранныеОбластиПередНачаломДобавления");
	НоваяТаблица.УстановитьДействие("ПередУдалением"		, "Подключаемый_ВыбранныеОбластиПередУдалением");
	НовоеПолеТаблицы = Элементы.Добавить("рфВыбранныеОбластиИмяОбласти", Тип("ПолеФормы"), НоваяТаблица);
	НовоеПолеТаблицы.Вид 		 	= ВидПоляФормы.ПолеВвода;
	НовоеПолеТаблицы.ПутьКДанным 	= "рфВыбранныеОбласти.ИмяОбласти";
	НовоеПолеТаблицы.ТолькоПросмотр = Ложь; 	
	Если Элементы.найти("Бюджет") <> Неопределено Тогда
		НовоеПолеТаблицы.Видимость      = Ложь;
		НовоеПолеТаблицы = Элементы.Добавить("рфВыбранныеОбластиЗаголовокОбласти", Тип("ПолеФормы"), НоваяТаблица);
		НовоеПолеТаблицы.Вид 		 	= ВидПоляФормы.ПолеВвода;
		НовоеПолеТаблицы.ПутьКДанным 	= "рфВыбранныеОбласти.ЗаголовокОбласти";
		НовоеПолеТаблицы.ТолькоПросмотр = Истина; 
	КонецЕсли;
	
КонецПроцедуры // Рф_ДобавитьЭлементыРедактораФормул()

#КонецОбласти
