#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли; 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		бит_ОбщегоНазначения.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ВидНастройки) Тогда
		ВидНастройки = Перечисления.бит_ВидыНастроекРаспределенияБюджета.Простая;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(СпособРаспределения) Тогда
		СпособРаспределения = Перечисления.бит_СпособыРаспределенияРесурсовБюджета.Независимо;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли