
&НаКлиенте
Процедура СерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если не ЗначениеЗаполнено(Объект.Номенклатура) Тогда 
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	
	СписокДоступныхСерий = ПолучитьСписокДоступныхСерийНаСервере(Объект.Номенклатура);
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораСерии", ЭтотОбъект);
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = СписокДоступныхСерий;
	
	ВладелецСерий = бит_ПечатьСерийЭтикетокВызовСервера.ВладелецСерийВидаНоменклатуры(Объект.Номенклатура);
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидНоменклатуры", ВладелецСерий);
			
	ПФ = Новый Структура;
	ПФ.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	ПФ.Вставить("Отбор", ПараметрыОтбора); 
    ПФ.Вставить("ВидНоменклатуры", ВладелецСерий);
	ПФ.Вставить("РежимВыбора", Истина);
	ПФ.Вставить("МножественныйВыбор", Ложь);
	ПФ.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаВыбора", ПФ, ЭтотОбъект, УникальныйИдентификатор, , , Оповещение);

КонецПроцедуры             

&НаКлиенте
Процедура ПослеВыбораСерии(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		Объект.Серия = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДоступныхСерийНаСервере(Номенклатура)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	бит_СерииЭтикетокВСменномЗадании.СерияНоменклатуры КАК СерияНоменклатуры
	|ИЗ
	|	РегистрСведений.бит_СерииЭтикетокВСменномЗадании КАК бит_СерииЭтикетокВСменномЗадании
	|ГДЕ
	|	бит_СерииЭтикетокВСменномЗадании.Номенклатура = &Номенклатура
	|	И бит_СерииЭтикетокВСменномЗадании.ПроизводственнаяОперация ССЫЛКА Документ.ПроизводственнаяОперация2_2"); 
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СерияНоменклатуры"));
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	
	КомандаПечать();
	
КонецПроцедуры      

&НаКлиенте
Процедура КомандаПечать() 
	
	АдресТаблицыТоваров = ПолучитьАдресДанныеДляПечатиНаСервере();
	Если АдресТаблицыТоваров <> Неопределено Тогда                   
		бит_ПечатьСерийЭтикетокКлиент.ОткрытьФормуПечати(АдресТаблицыТоваров, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресДанныеДляПечатиНаСервере()
	Если не ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура", Объект.Номенклатура);
	Структура.Вставить("Исполнитель", Объект.Серия.бит_Эмалировщик); // Для ДопСвойство ШтампЭмалировщика
	Структура.Вставить("ВидРабочегоЦентра", Объект.Серия.бит_ВидРабочегоЦентра);
	МассивСерий = Новый Массив;
	МассивСерий.Добавить(Объект.Серия);
	Структура.Вставить("МассивСерий", МассивСерий);
	Структура.Вставить("Смена", Объект.Серия.бит_Смена);
	
	Возврат РегистрыСведений.бит_СерииЭтикетокВСменномЗадании.СформироватьДанныеДляПечатиЭтикетокИзСменногоЗадания(Структура);

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
		Объект.Номенклатура = Параметры.Номенклатура;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Серия) Тогда
		Объект.Серия = Параметры.Серия;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ПечатьСразу) ТОгда
		Объект.ПечатьСразу = Параметры.ПечатьСразу;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ПечатьСразу и ЗначениеЗаполнено(Объект.Номенклатура) И ЗначениеЗаполнено(Объект.Серия) Тогда
		КомандаПечать();
	КонецЕсли;
	
КонецПроцедуры
