
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("СправочникСсылка.Пользователи")       , НСтр("ru = 'Пользователь'; en = 'Пользователь'"));
	СписокТипов.Добавить(Тип("СправочникСсылка.ГруппыПользователей"), НСтр("ru = 'Группа пользователей'; en = 'Группа пользователей'"));	
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект
	                                                   ,Элемент
	                                                   ,Запись
	                                                   ,"Пользователь"
													   ,СписокТипов
													   ,СтандартнаяОбработка);
													   
КонецПроцедуры

&НаКлиенте
Процедура ПользовательОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("СправочникСсылка.бит_ОбъектыСистемы")       );
	СписокТипов.Добавить(Тип("СправочникСсылка.бит_ГруппыОбъектовСистемы"));	
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект
	                                                   ,Элемент
	                                                   ,Запись
	                                                   ,"ОбъектСистемы"
													   ,СписокТипов
													   ,СтандартнаяОбработка);
													   
	Если ТипЗнч(Запись.ОбъектСистемы) = Тип("СправочникСсылка.бит_ОбъектыСистемы") Тогда
		СтандартнаяОбработка = Ложь;
		
		СписокВидовОбъектов = Новый СписокЗначений;
		СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТекущийОбъектСистемы", Запись.ОбъектСистемы);
		ПараметрыФормы.Вставить("ВидыОбъектов"        , СписокВидовОбъектов);
		
		ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы",ПараметрыФормы,Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

#КонецОбласти




