#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция определяет имя объекта ссылочного типа по описанию типов.
//
// Параметры:
//  Аналитика - ПланВидовХарактеристикСсылка.бит_ВидыДополнительныхАналитик - Дополнительная аналитика.
// 
// Возвращаемое значение:
//  Массив - массив выбора.
//
Функция ТипыДополнительнойАналитики(Аналитика) Экспорт
	
	МассивТипов = Аналитика.ТипЗначения.Типы();	 
	МассивВыбора = Новый Массив;
	
	Для Каждого ТекущийТип Из МассивТипов Цикл
		
		МассивДляОписания = Новый Массив;
		МассивДляОписания.Добавить(ТекущийТип);
		
		Описание = Новый ОписаниеТипов(МассивДляОписания);		
		ПустоеЗначение = Описание.ПривестиЗначение();
		
		МассивВыбора.Добавить(ПустоеЗначение.Метаданные().ПолноеИмя());
		
	КонецЦикла; // По типам
	
	Возврат МассивВыбора;
	
КонецФункции // ТипыДополнительнойАналитики()

#КонецОбласти

#КонецЕсли
