#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

//  Функция инициализирует компоновщик.
//
// Параметры:
//  Компоновщик              		- КомпоновщикНастроекСхемыКомпоновкиДанных.
//  УникальныйИдентификатор  		- УникальныйИдентификатор.
//	ИмяМакета				 		- Строка.
//
// Возвращаемое значение:
//   АдресСхемыКомпоновкиДанных   	- Строка.
//
Функция ИнициализироватьКомпоновщик(Компоновщик, УникальныйИдентификатор) Экспорт

	СхемаКомпоновкиДанных = Обработки.бит_кзн_ПодборЗаявокНаРасходованиеИПеремещение.ПолучитьМакет("СКД");
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
    Компоновщик.Инициализировать(ИсточникНастроек);
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

	Возврат АдресСхемыКомпоновкиДанных;
	
КонецФункции // ИнициализироватьКомпоновщик()

//  Функция выполняет запрос по настройке компновщика.
//
// Параметры:
//  Компоновщик - КомпоновщикНастроекКомпоновкиДанных
//  АдресСхемыКомпоновкиДанных - Строка
//  СтруктураПараметров - Структура
//
// Возвращаемое значение:
//   Результат - РезультатЗапроса
//
Функция ВыполнитьЗапросПоНастройке(Компоновщик, АдресСхемыКомпоновкиДанных, СтруктураПараметров)  Экспорт

	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);

	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(Компоновщик, "Период", СтруктураПараметров.Период);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.ПолучитьНастройки(),,,
							Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), Ложь);
							
	// Выполнение компоновки с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , );
	
	Результат = Новый ТаблицаЗначений;

	// Вывод таблицы   	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода = Ложь;
	ПроцессорВывода.УстановитьОбъект(Результат); 	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Возврат Результат;
	
КонецФункции // ВыполнитьЗапросПоНастройке()

#КонецОбласти

#КонецЕсли
