#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли; 
	
	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Вид) Тогда
		Вид = Перечисления.бит_ВидыПрофилейРаспределения.ПоПериодам;
	КонецЕсли; 
	
	Ответственный = бит_УправлениеПользователямиСервер.ЗначениеПоУмолчаниюТиповой("ОсновнойОтветственный");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если Вид = Перечисления.бит_ВидыПрофилейРаспределения.ПоПериодам Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Аналитика");
	КонецЕсли;  
	
	ПроверитьПрофиль(Отказ); 
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	Если Вид = Перечисления.бит_ВидыПрофилейРаспределения.ПоПериодам Тогда
		Аналитика = Неопределено;
		Для каждого СтрокаТаблицы Из Профиль Цикл
			СтрокаТаблицы.ЗначениеАналитики = Неопределено;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = бит_УправлениеПользователямиСервер.ЗначениеПоУмолчаниюТиповой("ОсновнойОтветственный");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПрофиль(Отказ)

	Если Профиль.Итог("Процент") <> 100 Тогда
		ТекстСообщения = НСтр("ru='Сумма процентов по профилю должна равняться 100.';
							  |en='percent profile amount should be 100.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,,Отказ); 
	КонецЕсли; 
	
	// Проверка на дубли номеров.
	Если Вид = Перечисления.бит_ВидыПрофилейРаспределения.ПоПериодам Тогда
		
		ШаблонСообщения = НСтр("ru='Номера периодов повторяются.';en='Non periods are repeated.'") ;
		Для Каждого ТекСтрока Из Профиль Цикл
			НайденнаяСтрока = Профиль.Найти(ТекСтрока.НомерПериода, "НомерПериода");
			Если НайденнаяСтрока <> Неопределено И ТекСтрока.НомерСтроки <> НайденнаяСтрока.НомерСтроки Тогда
				
				Поле 		   = СтрШаблон("Профиль[%1].НомерПериода", Формат(ТекСтрока.НомерСтроки - 1, "ЧН=0; ЧГ="));
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА","КОРРЕКТНОСТЬ",
									НСтр("ru='Номер периода';en='Period No.'"), 
									ТекСтрока.НомерСтроки, 
									НСтр("ru='Профиль';en='Profile'"), 
									ШаблонСообщения);									
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры
 
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли