#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Основание") Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма       = Метаданные.Задачи.бит_Задача.Формы.ФормаСозданияЗадачи;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СозданиеЗадач

// Конструктор структуры задачи.
// 
// Возвращаемое значение:
//  Структура.
// 
Функция СтруктураЗадачи() Экспорт

	СвойстваЗадачи = Новый Структура;
	СвойстваЗадачи.Вставить("Важность", 		   Перечисления.бит_ВидыВажностиЗадач.Средняя);
	СвойстваЗадачи.Вставить("Наименование",		   "");
	СвойстваЗадачи.Вставить("Описание",			   "");
	СвойстваЗадачи.Вставить("СпособАдресации", 	   0);
	СвойстваЗадачи.Вставить("СрокИсполнения", 	   ТекущаяДатаСеанса());
	СвойстваЗадачи.Вставить("Исполнитель", 		   Справочники.Пользователи.ПустаяСсылка());
	СвойстваЗадачи.Вставить("РольИсполнителя", 	   Справочники.бит_РолиИсполнителей.ПустаяСсылка());
	СвойстваЗадачи.Вставить("Предмет", 			   Неопределено);
	СвойстваЗадачи.Вставить("Виза", 			   Справочники.бит_Визы.ПустаяСсылка());
	СвойстваЗадачи.Вставить("ЗадачаОснование", 	   Задачи.бит_Задача.ПустаяСсылка());
	СвойстваЗадачи.Вставить("БизнесПроцесс", 	   Неопределено);
	СвойстваЗадачи.Вставить("ТочкаМаршрута", 	   Неопределено);
	СвойстваЗадачи.Вставить("Алгоритм", 		   Неопределено);
	СвойстваЗадачи.Вставить("АлгоритмПодчиненный", Неопределено);
	СвойстваЗадачи.Вставить("ТочкаАлгоритма",  	   Неопределено);
	СвойстваЗадачи.Вставить("ЭтоПроверочнаяЗадача",Ложь);
	СвойстваЗадачи.Вставить("ЭтоПереадресация",    Ложь);
	СвойстваЗадачи.Вставить("МассивНаПроверку",    Новый Массив);
	СвойстваЗадачи.Вставить("ПараметрыПроцесса",   Новый Структура);
	СвойстваЗадачи.Вставить("Состояние",   		   Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
	
	МаксКоличествоОбъектов = бит_УправлениеПроцессами.МаксимальноеКоличествоОбъектовАдресации();
	
	Для н = 1 По МаксКоличествоОбъектов Цикл
		СвойстваЗадачи.Вставить("ОбъектАдресации_" + н);
	КонецЦикла; 
	
	Возврат СвойстваЗадачи;
	
КонецФункции

// Функция заполняет вновь созданную задачу.
// 
// Параметры:
//  ДанныеЗаполнения - Структура - См. СтруктураЗадачи() 
//  МаксКоличествоОбъектов - Число.
// 
// Возвращаемое значение:
//  ЗадачаОбъект.бит_Задача.
// 
Функция ЗаполнитьОбъектЗадачи(ДанныеЗаполнения, МаксКоличествоОбъектов) Экспорт

	ЗадачаОбъект = Задачи.бит_Задача.СоздатьЗадачу();
	ЗадачаОбъект.Дата           = ТекущаяДатаСеанса();
	ЗадачаОбъект.Автор 		  	= Пользователи.ТекущийПользователь(); 
	ЗадачаОбъект.Важность 	  	= ДанныеЗаполнения.Важность;
	ЗадачаОбъект.Наименование   = ДанныеЗаполнения.Наименование;
	ЗадачаОбъект.Описание       = ДанныеЗаполнения.Описание;
	
	СрокИсполнения = ДанныеЗаполнения.СрокИсполнения;
	Если ЗначениеЗаполнено(СрокИсполнения) И СрокИсполнения > ТекущаяДатаСеанса() Тогда
		ПараметрыРасчета = бит_ВизированиеСервер.НовыеПараметрыРасчетаСрокаИсполнения();
		ПараметрыРасчета.ОбъектРасчета = ДанныеЗаполнения.Предмет;
		ПараметрыРасчета.ДатаОтсчета   = СрокИсполнения;
		СрокИсполнения = бит_ВизированиеСервер.СрокИсполнения(ПараметрыРасчета);
	КонецЕсли;
	ЗадачаОбъект.СрокИсполнения = СрокИсполнения;
	
	ЗадачаОбъект.УстановитьНовыйНомер();
	
	Если ДанныеЗаполнения.СпособАдресации = 0 Тогда
		
		ЗадачаОбъект.Исполнитель = ДанныеЗаполнения.Исполнитель;
		
	ИначеЕсли ДанныеЗаполнения.СпособАдресации = 1 Тогда	
		
		ЗадачаОбъект.РольИсполнителя = ДанныеЗаполнения.РольИсполнителя;
		
		Для н = 1 По МаксКоличествоОбъектов Цикл
			ИмяРеквизита 	 = "ОбъектАдресации_" + н;
			Настройка        = Новый Структура("Значение", ДанныеЗаполнения[ИмяРеквизита]);
			ОбъектАдресации  = БизнесПроцессы.бит_Процесс.ПолучитьЗначениеПараметраПроцесса(Настройка, ДанныеЗаполнения.ПараметрыПроцесса);
			ЗадачаОбъект[ИмяРеквизита] = ОбъектАдресации;
		КонецЦикла; 
	КонецЕсли; 

	ДанныеЗаполнения.Свойство("Состояние",ЗадачаОбъект.Состояние);
	
	Если НЕ ЗначениеЗаполнено(ЗадачаОбъект.Состояние) Тогда
		ЗадачаОбъект.Состояние = Справочники.бит_СтатусыОбъектов.Задача_Создана;
	КонецЕсли; 
	
	ЗадачаОбъект.Предмет         	  = ДанныеЗаполнения.Предмет;
	ЗадачаОбъект.Виза			   	  = ДанныеЗаполнения.Виза;
	ЗадачаОбъект.ЗадачаОснование 	  = ДанныеЗаполнения.ЗадачаОснование;
	ЗадачаОбъект.БизнесПроцесс   	  = ДанныеЗаполнения.БизнесПроцесс;
	ЗадачаОбъект.ТочкаМаршрута   	  = ДанныеЗаполнения.ТочкаМаршрута;
	ЗадачаОбъект.Алгоритм        	  = ДанныеЗаполнения.Алгоритм;
	ЗадачаОбъект.АлгоритмПодчиненный  = ДанныеЗаполнения.АлгоритмПодчиненный;
	ЗадачаОбъект.ТочкаАлгоритма       = ДанныеЗаполнения.ТочкаАлгоритма;
	ЗадачаОбъект.ЭтоПроверочнаяЗадача = ДанныеЗаполнения.ЭтоПроверочнаяЗадача;
	
	Если ДанныеЗаполнения.ЭтоПроверочнаяЗадача И ТипЗнч(ДанныеЗаполнения.МассивНаПроверку) = Тип("Массив") Тогда
		Для каждого Элемент Из ДанныеЗаполнения.МассивНаПроверку Цикл
			 НоваяСтрока = ЗадачаОбъект.НаПроверку.Добавить();
			 НоваяСтрока.Задача = Элемент;
		КонецЦикла; 
	КонецЕсли; 
	
	Если ДанныеЗаполнения.ЭтоПереадресация Тогда
		ЗадачаОбъект.ДополнительныеСвойства.Вставить("ЭтоПереадресация", Истина);
	КонецЕсли;
	
	Возврат ЗадачаОбъект;
	
КонецФункции

// Функция создает и записывает новую задачу.
// 
// Параметры:
//  СтруктураЗадачи - Структура
//  МаксКоличествоОбъектов - Число
//  РежимСообщений - Строка.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция СоздатьНовуюЗадачу(СтруктураЗадачи, МаксКоличествоОбъектов, РежимСообщений = "Ошибки") Экспорт
	
	СсылкаНаЗадачу    = Задачи.бит_Задача.ПустаяСсылка();
	НоваяЗадача       = ЗаполнитьОбъектЗадачи(СтруктураЗадачи, МаксКоличествоОбъектов);
	Если бит_ОбщегоНазначения.ЗаписатьЗадачу(НоваяЗадача, РежимСообщений) Тогда
		СсылкаНаЗадачу = НоваяЗадача.Ссылка;
	КонецЕсли;
	
	Возврат СсылкаНаЗадачу;
	
КонецФункции

#КонецОбласти

#Область ДействияСЗадачами

// Функция перенаправляет задачу другому исполнителю/исполнителям.
// 
// Параметры:
//  СтрПар - Структура
//  МаксКоличествоОбъектов - Число
//  ОтмечатьВыполнениеОснования - Булево
//  РежимСообщений - Строка.
// 
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПеренаправитьЗадачу(СтрПар, МаксКоличествоОбъектов, ОтмечатьВыполнениеОснования = Истина, РежимСообщений = "Ошибки") Экспорт

	ТекПользователь = Пользователи.ТекущийПользователь();
	РежимыВывода    = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);
	
	СтрЗадачи = СтруктураЗадачи();
	СтрЗадачи.Важность = СтрПар.ЗадачаОснование.Важность;
	СтрЗадачи.СрокИсполнения = СтрПар.СрокИсполнения;
	СтрЗадачи.Наименование   = СтрПар.ЗадачаОснование.Наименование;
	СтрЗадачи.Описание       = СтрПар.ЗадачаОснование.Описание;
	Если ЗначениеЗаполнено(СтрПар.Комментарий) Тогда
		
		Если ПустаяСтрока(СтрЗадачи.Описание) Тогда
			СтрокаОписание = "%1%2 %3:
							 |%4";
		Иначе	
			СтрокаОписание = "%1
						 	 |------------------------
						 	 |%2 %3:
							 |%4";
			
		КонецЕсли;
		СтрЗадачи.Описание = СтрШаблон(СтрокаОписание, 
										СтрЗадачи.Описание,
										Строка(ТекПользователь),
										ТекущаяДатаСеанса(),
										СтрПар.Комментарий);
			
	КонецЕсли; 

	СтрЗадачи.Предмет 		   = СтрПар.ЗадачаОснование.Предмет;
	СтрЗадачи.СпособАдресации  = СтрПар.СпособАдресации;
	СтрЗадачи.Исполнитель      = СтрПар.Исполнитель;
	СтрЗадачи.РольИсполнителя  = СтрПар.РольИсполнителя;
	СтрЗадачи.ЗадачаОснование  = СтрПар.ЗадачаОснование;
	СтрЗадачи.Виза			   = СтрПар.ЗадачаОснование.Виза;
	СтрЗадачи.ЭтоПереадресация = Истина;
	
	Для н = 1 По МаксКоличествоОбъектов Цикл
		
		ИмяРеквизита = "ОбъектАдресации_" + н;
		СтрЗадачи[ИмяРеквизита] = СтрПар[ИмяРеквизита];
		
	КонецЦикла; 
	
	СтрЗадачи.БизнесПроцесс = СтрПар.ЗадачаОснование.БизнесПроцесс;
	СтрЗадачи.ТочкаМаршрута = СтрПар.ЗадачаОснование.ТочкаМаршрута;
	СтрЗадачи.Алгоритм      = СтрПар.ЗадачаОснование.Алгоритм;
	СтрЗадачи.ТочкаАлгоритма= СтрПар.ЗадачаОснование.ТочкаАлгоритма;
	
	СтрЗадачи.ЭтоПроверочнаяЗадача = СтрПар.ЗадачаОснование.ЭтоПроверочнаяЗадача;
	СтрЗадачи.МассивНаПроверку     = СтрПар.ЗадачаОснование.НаПроверку.ВыгрузитьКолонку("Задача");
	
	НачатьТранзакцию();
	Попытка
		ЗадачаСсылка = СоздатьНовуюЗадачу(СтрЗадачи, МаксКоличествоОбъектов, РежимСообщений);
		Выполнено    = ЗначениеЗаполнено(ЗадачаСсылка);
		Если Выполнено Тогда
			Если ОтмечатьВыполнениеОснования Тогда
				ОтметитьВыполнение(СтрПар.ЗадачаОснование, Истина,  РежимСообщений);
			КонецЕсли;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Выполнено = Ложь;
	КонецПопытки;
	
	Если Выполнено Тогда	
		ТекстСообщения = НСтр("ru='Задача ""%1"" перенаправлена.';en='Task ""%1"" was redirected.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(СтрПар.ЗадачаОснование.Наименование));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли; 
	
	Возврат Выполнено;
	
КонецФункции // ПеренаправитьЗадачу()

// Функция принимает задачи к исполнению.
// 
// Параметры:
//   ЗадачиДляОбработки - Массив/ЗадачаСсылка.бит_Задача
//   РежимСообщений - Строка
//   СтрПар - Структура.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПринятьЗадачу(ЗадачиДляОбработки, РежимСообщений = "Ошибки", СтрПар = Неопределено) Экспорт
	
	флВыполнено = Ложь;
	
	МассивЗадачи = МассивВходящихЗадач(ЗадачиДляОбработки);
	
	Для каждого ЗадачаСсылка Из МассивЗадачи Цикл
		
		Если РазрешеноПринятьКИсполнению(ЗадачаСсылка) Тогда
			
			ЗадачаОбъект = ЗадачаСсылка.ПолучитьОбъект();
			ЗадачаОбъект.ПринятьКИсполнению();
			флВыполнено = бит_ОбщегоНазначения.ЗаписатьЗадачу(ЗадачаОбъект, РежимСообщений);
			
			флЗаблокировано = бит_ОбщегоНазначения.ЗаблокироватьОбъект(ЗадачаОбъект);
			
			Если флЗаблокировано Тогда
				
				ЗадачаОбъект.ПринятьКИсполнению();
				Если ТипЗнч(СтрПар) = Тип("Структура") И СтрПар.Свойство("РезультатВыполнения") Тогда					
					ЗадачаОбъект.РезультатВыполнения = СтрПар.РезультатВыполнения;					
				КонецЕсли; 							
				флВыполнено = бит_ОбщегоНазначения.ЗаписатьЗадачу(ЗадачаОбъект, РежимСообщений);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат флВыполнено;
	
КонецФункции // ПринятьЗадачу()

// Функция отменяет выполнение задач.
// 
// Параметры:
//   ЗадачиДляОбработки - Массив/ЗадачаСсылка.бит_Задача
//   ЭтоПеренаправление - Булево
//   РежимСообщений - Строка
//   СтрПар - Структура.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ОтметитьВыполнение(ЗадачиДляОбработки, ЭтоПеренаправление = Ложь, РежимСообщений = "Ошибки", СтрПар = Неопределено) Экспорт
	
	флВыполнено = Ложь;
	
	МассивЗадачи = МассивВходящихЗадач(ЗадачиДляОбработки);
	
	Для каждого ЗадачаСсылка Из МассивЗадачи Цикл
		
		Если РазрешеноОтметитьВыполнение(ЗадачаСсылка, ЭтоПеренаправление) Тогда
			
			ЗадачаОбъект    = ЗадачаСсылка.ПолучитьОбъект();
			флЗаблокировано = бит_ОбщегоНазначения.ЗаблокироватьОбъект(ЗадачаОбъект);
			
			Если флЗаблокировано Тогда
				
				ЗадачаОбъект.ОтметитьВыполнение(Истина, ЭтоПеренаправление);
				Если ТипЗнч(СтрПар) = Тип("Структура") И СтрПар.Свойство("РезультатВыполнения") Тогда					
					ЗадачаОбъект.РезультатВыполнения = СтрПар.РезультатВыполнения;					
				КонецЕсли; 				
				флВыполнено = бит_ОбщегоНазначения.ЗаписатьЗадачу(ЗадачаОбъект, РежимСообщений);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат флВыполнено;
	
КонецФункции // ОтметитьВыполнение()

// Функция останавливает задачи.
// 
// Параметры:
//   ЗадачиДляОбработки - Массив/ЗадачаСсылка.бит_Задача
//   ВыполнятьБезусловно - Булево
//   РежимСообщений - Строка.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция Остановить(ЗадачиДляОбработки, ВыполнятьБезусловно = Ложь, РежимСообщений = "Ошибки")  Экспорт
	
	флВыполнено  = Ложь;
	РежимыВывода = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);
	
	МассивЗадачи = МассивВходящихЗадач(ЗадачиДляОбработки);
	
	Для каждого ЗадачаСсылка Из МассивЗадачи Цикл
		
		Если ВыполнятьБезусловно ИЛИ РазрешеноОстановить(ЗадачаСсылка, РежимыВывода.ВыводитьОшибки) Тогда
			
			ЗадачаОбъект    = ЗадачаСсылка.ПолучитьОбъект();
			
			ЗадачаОбъект.Остановить();
			флВыполнено = бит_ОбщегоНазначения.ЗаписатьЗадачу(ЗадачаОбъект, РежимСообщений);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат флВыполнено;
	
КонецФункции // Остановить()

// Функция отменяет задачи.
// 
// Параметры:
//   ЗадачиДляОбработки - Массив/ЗадачаСсылка.бит_Задача
//   ВыполнятьБезусловно - Булево
//   РежимСообщений - Строка.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция Отменить(ЗадачиДляОбработки, ВыполнятьБезусловно = Ложь, РежимСообщений = "Ошибки")  Экспорт
	
	флВыполнено  = Ложь;
	РежимыВывода = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);
	
	МассивЗадачи = МассивВходящихЗадач(ЗадачиДляОбработки);
	
	Для каждого ЗадачаСсылка Из МассивЗадачи Цикл
		
		Если ВыполнятьБезусловно ИЛИ РазрешеноОтменить(ЗадачаСсылка, РежимыВывода.ВыводитьОшибки) Тогда
			
			ЗадачаОбъект = ЗадачаСсылка.ПолучитьОбъект();
			
			ЗадачаОбъект.Выполнена = Ложь;
			ЗадачаОбъект.Состояние = Справочники.бит_СтатусыОбъектов.Задача_Создана;

			флВыполнено = бит_ОбщегоНазначения.ЗаписатьЗадачу(ЗадачаОбъект, РежимСообщений);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат флВыполнено;
	
КонецФункции // Отменить()

// Функция возобновляет выполнение остановленных задач.
// 
// Параметры:
//   ЗадачиДляОбработки - Массив/ЗадачаСсылка.бит_Задача
//   ВыполнятьБезусловно - Булево
//   РежимСообщений - Строка.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПродолжитьВыполнение(ЗадачиДляОбработки, ВыполнятьБезусловно = Ложь, РежимСообщений = "Ошибки")  Экспорт
	
	Выполнено    = Ложь;
	РежимыВывода = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);
	
	МассивЗадачи = МассивВходящихЗадач(ЗадачиДляОбработки);
	
	Для каждого ЗадачаСсылка Из МассивЗадачи Цикл
		
		Если ВыполнятьБезусловно ИЛИ РазрешеноПродолжитьВыполнение(ЗадачаСсылка, РежимыВывода.ВыводитьОшибки) Тогда
			
			ЗадачаОбъект    = ЗадачаСсылка.ПолучитьОбъект();
			флЗаблокировано = бит_ОбщегоНазначения.ЗаблокироватьОбъект(ЗадачаОбъект);
			
			Если флЗаблокировано Тогда
				
				ЗадачаОбъект.ПродолжитьВыполнение();
				Выполнено = бит_ОбщегоНазначения.ЗаписатьЗадачу(ЗадачаОбъект, РежимСообщений);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Выполнено;
	
КонецФункции

// Функция отправляет задачи на доработку.
// 
// Параметры:
//  МассивНаДоработку - Массив
// 
// Возвращаемое значение:
//  Булево.
// 
Функция НаДоработку(МассивНаДоработку, РежимСообщений = "Ошибки")  Экспорт
	
	флВыполнено  = Ложь;
	РежимыВывода = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);
	
	ТекПользователь = Пользователи.ТекущийПользователь();	
	
	Для каждого СтрПар Из МассивНаДоработку Цикл
		
		ЗадачаСсылка = СтрПар.Задача;
		
		Если РазрешеноОтменить(ЗадачаСсылка) Тогда
		
			ЗадачаОбъект = ЗадачаСсылка.ПолучитьОбъект();
			ЗадачаОбъект.Выполнена = Ложь;
			ЗадачаОбъект.Состояние = Справочники.бит_СтатусыОбъектов.Задача_Создана;
			
			Если ПустаяСтрока(ЗадачаОбъект.Описание) Тогда
				СтрокаОписание = "%1%2 %3 %4";
			Иначе	
				СтрокаОписание = "%1
							 	 |------------------------
							 	 |%2 %3 %4";
				
			КонецЕсли;
			ЗадачаОбъект.Описание = СтрШаблон(СтрокаОписание, 
										ЗадачаОбъект.Описание,
										НСтр("ru='Задача возвращена на доработку';en='Task was returned for revision'"),
										Строка(ТекПользователь),
										ТекущаяДатаСеанса());
																		 
			Если НЕ ПустаяСтрока(СтрПар.Комментарий) Тогда
			
				ЗадачаОбъект.Описание = СтрШаблон("%1:
												  |%2", 
											ЗадачаОбъект.Описание, СтрПар.Комментарий);
			
			КонецЕсли; 					 
			
			флВыполнено = бит_ОбщегоНазначения.ЗаписатьЗадачу(ЗадачаОбъект, РежимСообщений);
		
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат флВыполнено;
	
КонецФункции // ПродолжитьВыполнение()

#КонецОбласти

#Область ПроверочныеФункции

// Функция определяет можно ли данную задачу принимать к исполнению.
// 
// Параметры:
//  ЗадачаСсылка - ЗадачаСсылка.бит_Задача.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция РазрешеноПринятьКИсполнению(ЗадачаОбъект) Экспорт

	РазрешеноПродолжить = Ложь;
	
	Если ЗадачаОбъект.Состояние = Справочники.бит_СтатусыОбъектов.Задача_Создана Тогда
		РазрешеноПродолжить = Истина;
	Иначе	
		ТекстСообщения = НСтр("ru='Обработка задачи ""%1"". К исполнению может быть принята задача в состоянии ""Создана"".';
							  |en='Processing task ""%1"". By the execution of the task may be adopted in a state of ""Started"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения,Строка(ЗадачаОбъект.Ссылка));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЗадачаОбъект.Ссылка);
	КонецЕсли; 

	ТекПользователь = Пользователи.ТекущийПользователь();
	Исполнитель     = ЗадачаОбъект.Исполнитель;
	Если ЗначениеЗаполнено(Исполнитель) И Исполнитель <> ТекПользователь
		И Не ПользовательЗаместительИсполнителя(Исполнитель, ТекПользователь) Тогда		
		ТекстСообщения = НСтр("ru='Обработка задачи ""%1"". Задача может быть принята к исполнению только пользователем ""%2"".';
							  |en='Processing task ""%1"". This objective may be accepted for execution by the user only ""%2"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения,Строка(ЗадачаОбъект), Исполнитель);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЗадачаОбъект.Ссылка);		
		РазрешеноПродолжить = Ложь;		
	КонецЕсли; 
	
	Возврат РазрешеноПродолжить;
	
КонецФункции // РазрешеноПринятьКИсполнению()

// Функция определяет можно ли данную задачу отметить как выполненную.
// 
// Параметры:
//  ЗадачаСсылка - ЗадачаСсылка.бит_Задача.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция РазрешеноОтметитьВыполнение(ЗадачаСсылка, ЭтоПеренаправление = Ложь) Экспорт

	РазрешеноПродолжить = Ложь;
	
	Если ЗадачаСсылка.Состояние = Справочники.бит_СтатусыОбъектов.Задача_Создана 
	    ИЛИ ЗадачаСсылка.Состояние = Справочники.бит_СтатусыОбъектов.Задача_Принята Тогда	
		РазрешеноПродолжить = Истина;		
	Иначе		
		ТекстСообщения = НСтр("ru='Обработка задачи ""%1"". Выполнена может быть задача в состоянии ""Создана"" или ""Принята к исполнению"".';
							  |en='Processing task ""%1"". Executed task can be able to ""Create"" or ""Accepted for execution"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения,Строка(ЗадачаСсылка));		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли; 

	Если НЕ ЭтоПеренаправление Тогда		
		ТекПользователь = Пользователи.ТекущийПользователь();
		Если ЗначениеЗаполнено(ЗадачаСсылка.Исполнитель) И ЗадачаСсылка.Исполнитель <> ТекПользователь Тогда			
			ТекстСообщения = НСтр("ru='Обработка задачи ""%1"". Задача может быть выполнена только пользователем ""%2"".';
								  |en='Processing task ""%1"". User task can only be performed ""%2"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ЗадачаСсылка), ЗадачаСсылка.Исполнитель);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
			РазрешеноПродолжить = Ложь;			
		КонецЕсли; 		
	КонецЕсли; 
	
	Если ЗадачаСсылка.ЭтоПроверочнаяЗадача Тогда	
		ВсеЗадачиПриняты = Истина;		
		Для каждого СтрокаТаблицы Из ЗадачаСсылка.НаПроверку Цикл		
			Если НЕ СтрокаТаблицы.Принято Тогда			
				ВсеЗадачиПриняты = Ложь;
			    Прервать;
			КонецЕсли; 		
		КонецЦикла; 		
		Если НЕ ВсеЗадачиПриняты Тогда			
			РазрешеноПродолжить = Ложь;			
			ТекстСообщения = НСтр("ru='Обработка задачи ""%1"". Проверочная задача может быть выполнена только после того, как приняты все задачи, подлежащие проверке.';
								  |en='Processing task ""%1"". The inspection task can be performed only after taking all the tasks to be checked.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ЗадачаСсылка));		
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		КонецЕсли;		
	КонецЕсли; 
	
	Возврат РазрешеноПродолжить;
	
КонецФункции // РазрешеноОтметитьВыполнение()

// Функция определяет разрешено ли для данной задачи возвращаться из текущего состояния в предыдущее.
// 
// Параметры:
//  ЗадачаСсылка - ЗадачаСсылка.бит_Задача.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция РазрешеноВернуться(ЗадачаСсылка, ВыводитьСообщения = Истина) Экспорт
	
	РазрешеноПродолжить = Истина;
	
	Если ЗначениеЗаполнено(ЗадачаСсылка.БизнесПроцесс) Тогда
		
		флЗаполненыНижние = ВыполненыНижестоящиеЗадачи(ЗадачаСсылка);		
		Если флЗаполненыНижние Тогда			
			РазрешеноПродолжить = Ложь;			
			Если ВыводитьСообщения Тогда				
				ТекстСообщения = НСтр("ru='Обработка задачи ""%1"". В процессе ""%2"" обнаружены выполненные нижестоящие задачи. Команда ""Вернуться"" недоступна.';
									  |en='Processing task ""%1"". Process ""%2"" has completed subordinate tasks. Command ""Go back"" is unvailable.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ЗадачаСсылка), Строка(ЗадачаСсылка.БизнесПроцесс));	
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);				
			КонецЕсли; 			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат РазрешеноПродолжить;
	
КонецФункции // РазрешеноВернуться()

// Функция определяет разрешено ли для данной задачи выполнение команды Отменить.
// 
// Параметры:
//  ЗадачаСсылка - ЗадачаСсылка.бит_Задача.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция РазрешеноОтменить(ЗадачаСсылка, ВыводитьСообщения = Истина) Экспорт
	
	РазрешеноПродолжить = Истина;
	
	Если ЗначениеЗаполнено(ЗадачаСсылка.БизнесПроцесс) Тогда
		
		флЗаполненыНижние = ВыполненыНижестоящиеЗадачи(ЗадачаСсылка);				
		Если флЗаполненыНижние Тогда			
			РазрешеноПродолжить = Ложь;			
			Если ВыводитьСообщения Тогда				
				ТекстСообщения = НСтр("ru='Обработка задачи ""%1"". В процессе ""%2"" обнаружены выполненные нижестоящие задачи.';
									  |en='Processing task ""%1"". Process ""%2"" has completed subordinate tasks.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ЗадачаСсылка),Строка(ЗадачаСсылка.БизнесПроцесс));	
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);				
			КонецЕсли; 			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат РазрешеноПродолжить;
	
КонецФункции // РазрешеноОтменить()

#КонецОбласти

// Функция считывает из макета таблицу доступных действий.
// 
// Возвращаемое значение:
//  РезСтруктура.Данные - ТаблицаЗначений.
// 
Функция КонструкторТаблицаДоступныхДействий() Экспорт
	
	Макет = Задачи.бит_Задача.ПолучитьМакет("ДоступныеДействия");
	РезСтруктура = бит_ОбщегоНазначения.ПрочитатьXMLВТаблицу(Макет.ПолучитьТекст());
	
	Возврат РезСтруктура.Данные;
	
КонецФункции // КонструкторТаблицаДоступныхДействий()

// Функция определяет какие роли для данной задачи выполняет пользователь.
// 
// Параметры:
//  Задача - ЗадачаСсылка.бит_Задача.
// 
// Возвращаемое значение:
//  СтрРоли - Структура {Автор - Булево, Исполнитель - Булево}.
// 
Функция РольВЗадаче(Задача) Экспорт

	СтрРоли = Новый Структура("Автор, Исполнитель, Заместитель", Ложь, Ложь, Ложь);
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	Если ТекПользователь = Задача.Автор Тогда	
		СтрРоли.Автор = Истина;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Исполнитель", ТекПользователь);
	Запрос.УстановитьПараметр("Задача", Задача.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗадачиИсполнителя.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.бит_Задача.ЗадачиПоИсполнителю(&Исполнитель, Ссылка = &Задача) КАК ЗадачиИсполнителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК УсловиеВыполнено
	|ИЗ
	|	Задача.бит_Задача КАК Задача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗаместителиПоЗадачам КАК ЗаместителиПоЗадачам
	|		ПО Задача.Исполнитель = ЗаместителиПоЗадачам.Пользователь
	|ГДЕ
	|	ЗаместителиПоЗадачам.Заместитель = &Исполнитель
	|	И Задача.Ссылка = &Задача";
				   
	Результат = Запрос.ВыполнитьПакет();
	
	СтрРоли.Исполнитель = НЕ Результат[0].Пустой();
    СтрРоли.Заместитель = НЕ Результат[1].Пустой();
	
	Возврат СтрРоли;
	
КонецФункции // РольВЗадаче()

// Функция возвращает нижестоящие задачи в процессе по отношение к текущей задаче.
// 
// Параметры:
//  ЗадачаСсылка - ЗадачаСсылка.бит_Задача.
// 
// Возвращаемое значение:
//  МассивЗадача - Массив.
// 
Функция НижестоящиеЗадачи(ЗадачаСсылка, Режим) Экспорт
	
	МассивЗадач = Новый Массив;
	
	ТаблицаЗадач = БизнесПроцессы.бит_Процесс.ПолучитьЗадачиПроцесса(ЗадачаСсылка.БизнесПроцесс);		
	ТаблицаТочек = бит_УправлениеПроцессами.ОписаниеТочекАлгоритма(ЗадачаСсылка.Алгоритм,, ТаблицаЗадач);
	ОбойтиНижестоящиеЗадачи(ТаблицаТочек, ЗадачаСсылка.ТочкаАлгоритма, МассивЗадач, Режим);
	
	Возврат МассивЗадач;
	
КонецФункции // НижестоящиеЗадачи()

// Функция выполняет поиск подчиненного задаче бизнес процесса.
// 
// Параметры:
//  ТекущаяЗадача - ЗадачаСсылка.бит_Задача.
// 
// Возвращаемое значение:
//  БизнесПроцессСсылка.бит_Процесс - подчиненный процесс.
// 
Функция НайтиПодчиненныйПроцесс(ТекущаяЗадача) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВедущаяЗадача", ТекущаяЗадача);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_Процесс.Ссылка
	|ИЗ
	|	БизнесПроцесс.бит_Процесс КАК бит_Процесс
	|ГДЕ
	|	бит_Процесс.ВедущаяЗадача = &ВедущаяЗадача";
	
	Результат = Запрос.Выполнить();
	
	ПодчиненныйПроцесс = БизнесПроцессы.бит_Процесс.ПустаяСсылка();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда	
		 ПодчиненныйПроцесс = Выборка.Ссылка;	
	КонецЕсли; 
				   
	Возврат ПодчиненныйПроцесс;
	
КонецФункции // НайтиПодчиненныйПроцесс()

// Функция создает бизнес-процесс, подчиненный задаче. 
// При необходимости выполняется старт бизнес процесса.
// 
// Параметры:
//   ТекущаяЗадача  - ЗадачаСсылка.бит_Задача
//   Стартовать     - Булево
//   РежимСообщений - Строка.
// 
// Возвращаемое значение:
//  БизнесПроцессОбъект.бит_Процесс - новый процесс.
// 
Функция СоздатьПодчиненныйБизнесПроцесс(ТекущаяЗадача, Стартовать, РежимСообщений = "Все") Экспорт
	
	НовыйПроцесс = Неопределено;
	
	Если ЗначениеЗаполнено(ТекущаяЗадача.АлгоритмПодчиненный) Тогда
		
		ПараметрыПроцессаВнеш = БизнесПроцессы.бит_Процесс.ПолучитьПараметрыПроцесса(ТекущаяЗадача.БизнесПроцесс);
		
		НовыйПроцесс = БизнесПроцессы.бит_Процесс.СоздатьБизнесПроцесс();
		
		// Заполнение реквизитов процесса.
		НовыйПроцесс.Алгоритм     = ТекущаяЗадача.АлгоритмПодчиненный;
		НовыйПроцесс.Автор        = Пользователи.ТекущийПользователь();
		НовыйПроцесс.Наименование = ТекущаяЗадача.Наименование;
		НовыйПроцесс.Описание     = ТекущаяЗадача.Описание;
		НовыйПроцесс.ВедущаяЗадача= ТекущаяЗадача;
		НовыйПроцесс.Дата         = ТекущаяДатаСеанса();
		НовыйПроцесс.УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним);		
		НовыйПроцесс.УстановитьНовыйНомер();
		
		// Установка параметров процесса.
		Для каждого СтрокаТаблицы Из ТекущаяЗадача.ТочкаАлгоритма.ПользовательскоеДействие.ДополнительныеПараметры Цикл
		
			НоваяСтрока = НовыйПроцесс.ПараметрыПроцесса.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			ТекЗначение = БизнесПроцессы.бит_Процесс.ПолучитьЗначениеПараметраПроцесса(СтрокаТаблицы, ПараметрыПроцессаВнеш);
			НоваяСтрока.Значение = ТекЗначение;
		
		КонецЦикла; 
		
		// Установка динамических параметров из точки действия.
		Для каждого СтрокаТаблицы Из ТекущаяЗадача.ТочкаАлгоритма.ПараметрыПроцесса Цикл
			
			СтрОтбор = Новый Структура("Имя", СтрокаТаблицы.Имя);
			
			НайденныеСтроки = НовыйПроцесс.ПараметрыПроцесса.НайтиСтроки(СтрОтбор);
			
			Если НайденныеСтроки.Количество() > 0 Тогда				
				СтрокаПараметр = НайденныеСтроки[0];
				СтрокаПараметр.Значение = СтрокаТаблицы.Значение;
				СтрокаПараметр.СтрТип = СтрокаТаблицы.СтрТип;				
			КонецЕсли;	
			
		КонецЦикла;	// по параметрам точки действия
		
		флВыполнено = бит_ОбщегоНазначения.ЗаписатьБизнесПроцесс(НовыйПроцесс, РежимСообщений);		
		Если флВыполнено И Стартовать Тогда			
			флВыполнено = бит_ОбщегоНазначения.СтартоватьБизнесПроцесс(НовыйПроцесс, РежимСообщений);			
		КонецЕсли; // Нужно стартовать
		
	КонецЕсли; // ЗначениеЗаполнено(ТекущаяЗадача.Алгоритм).
	
	Возврат НовыйПроцесс;
	
КонецФункции

// Функция определяет является ли данная задача ведущей или нет.
// 
// Параметры:
//  Задача - ЗадачаСсылка.бит_Задача, ЗадачаОбъект.бит_Задача.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ЭтоВедущаяЗадача(Задача) Экспорт
	
	флВедущая = ЗначениеЗаполнено(Задача.АлгоритмПодчиненный);
	
	Возврат флВедущая;
	
КонецФункции // ЭтоВедущаяЗадача()

// Функция определяет наличие невыполненных автоматических действий по или по процессу.
//
// Параметры:
//  Задача - ЗадачаСсылка.бит_Задача, БизнесПроцессСсылка.бит_Процесс.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЕстьНевыполненныеАвтоДействия(Задача) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таб.ИД
	|ИЗ
	|	РегистрСведений.бит_ПротоколВыполненияАвтоДействийПроцесса КАК Таб
	|ГДЕ
	|	НЕ Таб.Выполнено";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	Если ТипЗнч(Задача) = Тип("ЗадачаСсылка.бит_Задача") Тогда
		
		Отбор = "Таб.Задача = &Задача";
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить(Отбор);
		
	ИначеЕсли ТипЗнч(Задача) = Тип("БизнесПроцессСсылка.бит_Процесс") Тогда	
		
		Отбор = "Таб.Процесс = &Задача";
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить(Отбор);
		
	КонецЕсли; 			   
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Результат = Запрос.Выполнить();
	
	флЕсть = НЕ Результат.Пустой();
				   
	Возврат флЕсть;
	
КонецФункции // ЕстьНевыполненныеАвтоДействия()

// Функция возвращает состояние задачи в указанной точке алгоритма.
// 
// Параметры:
//  Точка - СправочникСсылка.бит_ТочкиАлгоритмов.
// 
// Возвращаемое значение:
//  СправочникСсылка.бит_СтатусыОбъектов.
// 
Функция СостояниеЗадачиВТочке(Точка, Процесс) Экспорт

	РезСостояние = Справочники.бит_СтатусыОбъектов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТочкаАлгоритма", Точка);
	Запрос.УстановитьПараметр("БизнесПроцесс" , Процесс);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_Задача.Состояние
	|ИЗ
	|	Задача.бит_Задача КАК бит_Задача
	|ГДЕ
	|	бит_Задача.ТочкаАлгоритма = &ТочкаАлгоритма
	|	И бит_Задача.Алгоритм <> ЗНАЧЕНИЕ(Справочник.бит_АлгоритмыПроцессов.ПустаяСсылка)
	|	И бит_Задача.БизнесПроцесс = &БизнесПроцесс";
				   
	Результат = Запрос.Выполнить();	
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда	
		РезСостояние = Выборка.Состояние;	
	КонецЕсли; 

	Возврат РезСостояние;
	
КонецФункции // СостояниеЗадачиВТочке()

// Функция получает массив задач для проверки.
// 
// Параметры:
//  Процесс - БизнесПроцессСсылка.бит_Процесс
//  Точки   - Массив.
// 
// Возвращаемое значение:
//  Массив.
// 
Функция ПолучитьЗадачиНаПроверку(Процесс, Точки) Экспорт
	
	НаПроверку = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БизнесПроцесс", Процесс);
	Запрос.УстановитьПараметр("Точки", Точки);
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_Задача.Ссылка КАК Задача
	|ИЗ
	|	Задача.бит_Задача КАК бит_Задача
	|ГДЕ
	|	бит_Задача.БизнесПроцесс = &БизнесПроцесс
	|	И бит_Задача.ТочкаАлгоритма В(&Точки)";
				   				   
	Результат = Запрос.Выполнить();	
	
	НаПроверку = Результат.Выгрузить().ВыгрузитьКолонку("Задача");
	
	Возврат НаПроверку;
	
КонецФункции // ПолучитьЗадачиНаПроверку()

// Функция выполняет поиск задачи по точке алгоритма.
// 
// Параметры:
//   Процесс - БизнесПроцессСсылка.бит_Процесс
//   Точка   - СправочникСсылка.бит_ТочкиАлгоритмов.
// 
// Возвращаемое значение:
//  ЗадачаСсылка.бит_Задача.
// 
Функция НайтиЗадачу(Процесс, Точка) Экспорт
	
	ЗадачаПроцесса = Задачи.бит_Задача.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Процесс", Процесс);
	Запрос.УстановитьПараметр("Точка"  , Точка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_Задача.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.бит_Задача КАК бит_Задача
	|ГДЕ
	|	бит_Задача.БизнесПроцесс = &Процесс
	|	И бит_Задача.ТочкаАлгоритма = &Точка";
				   				   
	Результат = Запрос.Выполнить();	
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда	
		ЗадачаПроцесса = Выборка.Ссылка;	
	КонецЕсли; 				   
	
	Возврат ЗадачаПроцесса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПользовательЗаместительИсполнителя(Пользователь, Заместитель)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заместитель",  Заместитель);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Состояние",    Перечисления.бит_СостоянияЗаместителей.Назначен);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаместителиПоЗадачам.Заместитель КАК Заместитель
	|ИЗ
	|	РегистрСведений.бит_ЗаместителиПоЗадачам КАК ЗаместителиПоЗадачам
	|ГДЕ
	|	ЗаместителиПоЗадачам.Пользователь = &Пользователь
	|	И ЗаместителиПоЗадачам.Заместитель = &Заместитель
	|	И ЗаместителиПоЗадачам.Состояние = &Состояние";
			
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = Истина;
	КонецЕсли; 

	Возврат Результат;

КонецФункции 

// Функция возвращает массив задач в зависимости от типа входящего значения.
// 
// Параметры:
//  ЗадачиДляОбработки - Массив/ЗадачаСсылка.бит_Задача.
// 
// Возвращаемое значение:
//  Массив.
// 
Функция МассивВходящихЗадач(ЗадачиДляОбработки) 
	
	МассивЗадачи = Новый Массив;
	Если ТипЗнч(ЗадачиДляОбработки) = Тип("ЗадачаСсылка.бит_Задача") Тогда		
		МассивЗадачи.Добавить(ЗадачиДляОбработки);
	Иначе		
		МассивЗадачи = ЗадачиДляОбработки;		
	КонецЕсли; 
	
	Возврат МассивЗадачи;
	
КонецФункции

// Функция определяет можно ли данную задачу остановить.
// 
// Параметры:
//  ЗадачаСсылка - ЗадачаСсылка.бит_Задача.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция РазрешеноОстановить(ЗадачаСсылка, ВыводитьСообщения = Истина)
	
	РазрешеноПродолжить = Ложь;
	
	Если ЗадачаСсылка.Состояние = Справочники.бит_СтатусыОбъектов.Задача_Создана 
		ИЛИ ЗадачаСсылка.Состояние = Справочники.бит_СтатусыОбъектов.Задача_Принята Тогда		
		РазрешеноПродолжить = Истина;		
	Иначе		
		Если ВыводитьСообщения Тогда			
			ТекстСообщения = НСтр("ru='Обработка задачи ""%1"". Остановлена может быть задача в состоянии ""Создана"" или ""Принята к исполнению"".';
								  |en='Processing task ""%1"". Stopped can be a task in the ""Creation"" or ""Accepted for execution"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения,Строка(ЗадачаСсылка));		
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		КонецЕсли; 		
	КонецЕсли; 
	
	Возврат РазрешеноПродолжить;
	
КонецФункции

// Функция определяет можно ли данную задачу возобновить.
// 
// Параметры:
//  ЗадачаСсылка - ЗадачаСсылка.бит_Задача.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция РазрешеноПродолжитьВыполнение(ЗадачаСсылка, ВыводитьСообщения = Истина)

	РазрешеноПродолжить = Ложь;
	
	Если ЗадачаСсылка.Состояние = Справочники.бит_СтатусыОбъектов.Задача_Остановлена Тогда	
		РазрешеноПродолжить = Истина;		
	Иначе		
		Если ВыводитьСообщения Тогда			
			ТекстСообщения = НСтр("ru='Обработка задачи ""%1"". Продолжить выполнение разрешено для задача в состоянии ""%2"".';
								  |en='Processing task ""%1"". Continue running allowed for the task in the ""%2"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ЗадачаСсылка), Строка(Справочники.бит_СтатусыОбъектов.Задача_Остановлена));	
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		КонецЕсли; 		
	КонецЕсли; 

	Возврат РазрешеноПродолжить;
	
КонецФункции

// Функция определяет выполнены ли нижестоящие задачи по процессу.
// 
// Параметры:
//  ЗадачаСсылка - ЗадачаСсылка.бит_Задача.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ВыполненыНижестоящиеЗадачи(ЗадачаСсылка)
	
	ЗаполненыНижние = Ложь;
	
	ТаблицаЗадач = БизнесПроцессы.бит_Процесс.ПолучитьЗадачиПроцесса(ЗадачаСсылка.БизнесПроцесс);		
	ТаблицаТочек = бит_УправлениеПроцессами.ОписаниеТочекАлгоритма(ЗадачаСсылка.Алгоритм,, ТаблицаЗадач);
	
	бит_УправлениеПроцессами.ПроверитьНижестоящиеТочки(ТаблицаТочек, ЗадачаСсылка.ТочкаАлгоритма, ЗаполненыНижние, "ЗадачиВыполнены", 0);
	
	Возврат ЗаполненыНижние;
	
КонецФункции

// Процедура обходит нижестоящие задачи в процессе и заполняет массив задач.
// 
// Параметры:
//  ТаблицаТочек    - ТаблицаЗначений.
//  ТочкаНачальная  - СправочникСсылка.бит_ТочкиАлгоритмов.
//  МассивЗадач     - Массив.
//  Режим           - Строка.
//  СтекВызова      - СписокЗначений, Неопределено.
// 
Процедура ОбойтиНижестоящиеЗадачи(ТаблицаТочек, ТочкаНачальная, МассивЗадач, Режим, СтекВызова = Неопределено) 
	
	Если СтекВызова = Неопределено Тогда
		СтекВызова = Новый СписокЗначений;
	КонецЕсли;
	
	Если СтекВызова.НайтиПоЗначению(ТочкаНачальная) = Неопределено Тогда
		СтекВызова.Добавить(ТочкаНачальная);
	Иначе
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицыНачальная = ТаблицаТочек.Найти(ТочкаНачальная, "Точка");
	Если СтрокаТаблицыНачальная = Неопределено Тогда		
		Возврат;		
	КонецЕсли;
	
	ИсходящиеТочки      = СтрокаТаблицыНачальная.ИсходящиеТочки;
	ВидТочкиДействие   = Перечисления.бит_ВидыТочекАлгоритмов.Действие;
	
	Для Каждого СтрокаИсходящие Из ИсходящиеТочки Цикл
		
		Если СтрокаИсходящие.ВидТочки = ВидТочкиДействие Тогда
			
			// Проверим принято решение в данной точке или нет.
			СтрокаТаблицы = ТаблицаТочек.Найти(СтрокаИсходящие.Точка,"Точка");
			Если СтрокаТаблицы <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицы.Задача) Тогда
				
				Если Режим = "Активные" Тогда				
					Если ЗначениеЗаполнено(СтрокаТаблицы.Задача) 
						И НЕ СтрокаТаблицы.Состояние = Справочники.бит_СтатусыОбъектов.Задача_Остановлена Тогда						
						МассивЗадач.Добавить(СтрокаТаблицы.Задача);						
					КонецЕсли; 					
				ИначеЕсли Режим = "Остановленные" Тогда						
					Если ЗначениеЗаполнено(СтрокаТаблицы.Задача) 
						 И СтрокаТаблицы.Состояние = Справочники.бит_СтатусыОбъектов.Задача_Остановлена Тогда						
						МассивЗадач.Добавить(СтрокаТаблицы.Задача);						
					КонецЕсли;					
				КонецЕсли; 
				
			КонецЕсли;	  
			
		Иначе
			
			Если Режим = "Остановленные" Тогда				
				ОбойтиНижестоящиеЗадачи(ТаблицаТочек, СтрокаИсходящие.Точка, МассивЗадач, Режим, СтекВызова);				
			КонецЕсли; 
			
		КонецЕсли;	// Точка действия
		
		Если Режим = "Активные" Тогда			
			ОбойтиНижестоящиеЗадачи(ТаблицаТочек, СтрокаИсходящие.Точка, МассивЗадач, Режим, СтекВызова);			
		КонецЕсли; 
		
	КонецЦикла;	// По входящим точкам
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
