#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// 	Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
 
// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти = Неопределено) Экспорт
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ВалютаРегламентированногоУчета.Пустая() Тогда
		// ++ ЕРП
		// АПК:277-выкл Используется служебный программный интерфейс.
		ОбновлениеИнформационнойБазыБП.ЗаполнитьПустуюИБ();
		// АПК:277-вкл 
		// -- ЕРП
		ВалютаРегламентированногоУчета = Справочники.Валюты.НайтиПоКоду("643");
	КонецЕсли;
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных  = "ФАКТ";
	Элемент.Наименование			   = НСтр("ru = 'ФАКТ'; en = 'FACT'", КодОсновногоЯзыка);
	Элемент.Код						   = "000000001";
	Элемент.Валюта					   = ВалютаРегламентированногоУчета;
	Элемент.бит_Периодичность		   = Перечисления.бит_ПериодичностьПланирования.Месяц;
	Элемент.ПродолжительностьИнтервала = 12;
	Элемент.ПериодичностьКонтроля	   = Перечисления.бит_ПериодичностьПланирования.Месяц;
	Элемент.ИспользоватьКурсыСценария  = Ложь;
	
КонецПроцедуры
	
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт

	МетаданныеОбъекта			  = Метаданные.Справочники.СценарииПланирования;
	ПредопределенныеДанныеОбъекта = бит_ОбновлениеИнформационнойБазыБФ.ПредопределенныеДанныеОбъекта(МетаданныеОбъекта, 
											Справочники.СценарииПланирования);
											
	Для каждого СтрокаТаблицы Из ПредопределенныеДанныеОбъекта Цикл
		НачатьТранзакцию();
		Попытка
			ТекущийОбъект = Справочники.СценарииПланирования[СтрокаТаблицы.ИмяПредопределенныхДанных].ПолучитьОбъект();	
			ЗаполнитьЗначенияСвойств(ТекущийОбъект, СтрокаТаблицы); 
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекущийОбъект);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Процедуре ""ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию"" не удалось обработать элемент ""%1"" по причине: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.Наименование, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
							УровеньЖурналаРегистрации.Ошибка, МетаданныеОбъекта, ТекущийОбъект, ТекстСообщения);
		КонецПопытки;											
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли