
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	МетаданныеОбъекта = Метаданные.Справочники.бит_ПользовательскиеФункции;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ПоказатьОписаниеФункции", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура формирует описание функции или группы функций.
// 
// Параметры:
// 	Ссылка - СправочникСсылка.бит_ПользовательскиеФункции.
// 
&НаСервере
Процедура ПоказатьОписаниеФункцииСервер(Знач Ссылка)
	
	СсылкаЭтоГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ЭтоГруппа");
	Если СсылкаЭтоГруппа Тогда
		
		ТекстОписания = НСтр("ru='#В группе: ';en='#In Group:'") + Символы.ПС;
		
		Выборка = Справочники.бит_ПользовательскиеФункции.Выбрать(Ссылка);		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ЭтоГруппа Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеСКомментариями = СтрЗаменить(СокрЛП(Выборка.Описание), Символы.ПС, Символы.ПС + "// ");
			Если СокрЛП(Выборка.Описание) = "" Тогда
				ОписаниеФункции = НСтр("ru='// <нет описания>';en='// <No description>'");
			Иначе	
				ОписаниеФункции = СтрШаблон("// %1", ОписаниеСКомментариями);
			КонецЕсли;
			
			бит_ОбщегоНазначения.ДобавитьСтрокуКТексту(ТекстОписания, ОписаниеФункции);			
			СтруктураЗаголовка = Справочники.бит_ПользовательскиеФункции.ПолучитьНазваниеПодпрограммыСПараметрами(Выборка.Ссылка);			
			бит_ОбщегоНазначения.ДобавитьСтрокуКТексту(ТекстОписания, СтруктураЗаголовка.ЗаголовокФункции + Символы.ПС);
			
		КонецЦикла;
		
		ПолеОписания = ТекстОписания;
		
	Иначе
		СтруктураЗаголовка = Справочники.бит_ПользовательскиеФункции.ПолучитьНазваниеПодпрограммыСПараметрами(Ссылка);
		
		Элементы.ДекорацияНазваниеСПараметрами.Заголовок = СтруктураЗаголовка.НазваниеСПараметрами;
		СсылкаКодПодпрограммы = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "КодПодпрограммы"));
		ПолеОписания = СтруктураЗаголовка.ОписаниеПараметров + Символы.ПС + СсылкаКодПодпрограммы;
	КонецЕсли;
	
	Элементы.Описание.Видимость			   = НЕ СсылкаЭтоГруппа;
	Элементы.ГруппаШапкаФункции.Видимость  = НЕ СсылкаЭтоГруппа;
	Элементы.ГруппаПодвалФункции.Видимость = НЕ СсылкаЭтоГруппа;
		
КонецПроцедуры

// Процедура обработчик ожидания активизации строки.
// 
&НаКлиенте
Процедура ПоказатьОписаниеФункции()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьОписаниеФункцииСервер(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

