//{{******************************}}//
//{{      БИТ ЛТ 2.4     	      }}//
//{{******************************}}//
// [AVZhelansky@1cbit.ru] [05.06.2025 16:59:18]

Процедура бит_ОтобразитьНехваткуМеста(Форма, ДанныеКоличествоМест) Экспорт
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:51:02] +
	ЖирныйШрифт = Форма.ЖирныйШрифт; // ШрифтыСтиля
	ЦветЗеленый = Форма.ЦветЗеленый; // ЦветаСтиля 
	ЦветКрасный = Форма.ЦветКрасный; // ЦветаСтиля
	
	ПлановоеКоличество = ДанныеКоличествоМест.бит_КоличествоМестПлан;
	Элементы = Форма.Элементы;
	
	Шаблон = НСтр("ru = '(бит) Количество мест: %КоличествоФакт%/%КоличествоПлан%';
					|en = '(бит) Количество мест: %КоличествоФакт%/%КоличествоПлан%'");
	
	Если ДанныеКоличествоМест = Неопределено
	 ИЛИ ПлановоеКоличество = 0 Тогда
	 
	 	Текст = СтрЗаменить(Шаблон, "%КоличествоФакт%", "0");
		Текст = СтрЗаменить(Текст, "%КоличествоПлан%", "0");
		Форма.бит_НадписьКоличествоМест = Новый ФорматированнаяСтрока(Текст, ЖирныйШрифт, ЦветКрасный);
		Элементы.бит_ДекорацияКоличествоМест.Картинка = БиблиотекаКартинок.Остановить;		
		//Форма.бит_НадписьКоличествоМест = Новый ФорматированнаяСтрока("");
		//Элементы.бит_ДекорацияКоличествоМест.Картинка = Новый Картинка;
		
	ИначеЕсли ДанныеКоличествоМест.бит_КоличествоМест <= ПлановоеКоличество Тогда
		
		Текст = СтрЗаменить(Шаблон, "%КоличествоФакт%", Строка(ДанныеКоличествоМест.бит_КоличествоМест));
		Текст = СтрЗаменить(Текст, "%КоличествоПлан%", Строка(ПлановоеКоличество));
		
		Форма.бит_НадписьКоличествоМест = Новый ФорматированнаяСтрока(Текст, ЖирныйШрифт, ЦветЗеленый);
		
		ЗаполненностьВес = ДанныеКоличествоМест.бит_КоличествоМест / ПлановоеКоличество * 100;
		Если ЗаполненностьВес > 95 Тогда
			Элементы.бит_ДекорацияКоличествоМест.Картинка = БиблиотекаКартинок.Состояние100Процентов;
		ИначеЕсли ЗаполненностьВес > 45 Тогда
			Элементы.бит_ДекорацияКоличествоМест.Картинка = БиблиотекаКартинок.Состояние66Процентов;
		ИначеЕсли ЗаполненностьВес > 5 Тогда
			Элементы.бит_ДекорацияКоличествоМест.Картинка = БиблиотекаКартинок.Состояние33Процента;
		Иначе
			Элементы.бит_ДекорацияКоличествоМест.Картинка = БиблиотекаКартинок.Состояние0Процентов;
		КонецЕсли;
		
	Иначе
		
		Текст = СтрЗаменить(Шаблон, "%КоличествоФакт%", Строка(ДанныеКоличествоМест.бит_КоличествоМест));
		Текст = СтрЗаменить(Текст, "%КоличествоПлан%", Строка(ПлановоеКоличество));
		Форма.бит_НадписьКоличествоМест = Новый ФорматированнаяСтрока(Текст, ЖирныйШрифт, ЦветКрасный);
		Элементы.бит_ДекорацияКоличествоМест.Картинка = БиблиотекаКартинок.Остановить;
		
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:50:59] -	
КонецПроцедуры

