#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокТиповойКонфигурации = "";
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ЗаголовокТиповойКонфигурации = НСтр("ru = 'Бухгалтерия предприятия';
									   		|en = 'Accounting enterprise'");
	ИначеЕсли бит_ОбщегоНазначения.ЭтоERP() Тогда
		ЗаголовокТиповойКонфигурации = НСтр("ru = 'ERP';
									   		|en = 'ERP'");
	ИначеЕсли бит_ОбщегоНазначения.ЭтоУТ() Тогда
		ЗаголовокТиповойКонфигурации = НСтр("ru = 'Управление торговлей';
									   		|en = 'Trade management'");
	ИначеЕсли бит_ОбщегоНазначения.ЭтоКомплекснаяАвтоматизация() Тогда
		ЗаголовокТиповойКонфигурации = НСтр("ru = 'Комплексная автоматизация';
									   		|en = 'Integrated automation'");
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоУПП() Тогда
		ЗаголовокТиповойКонфигурации = НСтр("ru = 'УПП';
									   		|en = 'PEM'");
	КонецЕсли;
	Элементы.ДеревоРеквизитовУстановитьПодсистемаТиповойКонфигурации.Заголовок = ЗаголовокТиповойКонфигурации;
	
	УстановитьВидимостьЭлементов();
	
	Если НЕ ЭтоТекущийУзел() Тогда
		НарисоватьДеревоВидовОбъектов();
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИзмененФильтрРеквизитов Тогда
		ПрименитьФильтрРеквизитов(ТекущийОбъект);
		ИзмененФильтрРеквизитов = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_УзелПланаОбмена");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоРеквизитов

&НаКлиенте
Процедура ДеревоРеквизитовПередРазворачиванием(Элемент, Строка, Отказ)
	
	ПодготовитьСтруктуруРеквизитов(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрРеквизитовИспользуетсяПриИзменении(Элемент)
	
	ПриИзмененииФлагаИспользуетсяСтроки(Элементы.ДеревоРеквизитов.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВсе(Команда)
	
	ГрупповаяУстановкаПризнакаИспользованияФильтра("Включить");
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	ГрупповаяУстановкаПризнакаИспользованияФильтра("Снять");
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьВсе(Команда)
	
	ГрупповаяУстановкаПризнакаИспользованияФильтра("Инвертировать");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПодсистемаТиповойКонфигурации(Команда)
	
	УстановитьПризнакИспользованияПоПодсистеме("ТиповаяКонфигурация", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПодсистемаБитФинанс(Команда)
	
	УстановитьПризнакИспользованияПоПодсистеме("БитФинанс", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПодсистемаТиповойКонфигурации(Команда)
	
	УстановитьПризнакИспользованияПоПодсистеме("ТиповаяКонфигурация", 0);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПодсистемаБитФинанс(Команда)
	
	УстановитьПризнакИспользованияПоПодсистеме("БитФинанс", 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПодсистемаНалоговыйМониторинг(Команда)
	
	УстановитьПризнакИспользованияПоПодсистеме("НалоговыйМониторинг", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПодсистемаНалоговыйМониторинг(Команда)
	
	УстановитьПризнакИспользованияПоПодсистеме("НалоговыйМониторинг", 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПрисоединенныеФайлы(Команда)
	
	УстановитьПризнакИспользованияПоПодсистеме("ПрисоединенныеФайлы", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПрисоединенныеФайлы(Команда)
	
	УстановитьПризнакИспользованияПоПодсистеме("ПрисоединенныеФайлы", 0);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтоТекущийУзел()
	
	Возврат (ПланыОбмена.бит_АудиторскаяВыгрузка.ЭтотУзел() = Объект.Ссылка);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Если ЭтоТекущийУзел() Тогда
		Элементы.Организации.Видимость                     = Ложь;
		Элементы.НачалоПериодаВыгрузкиДокументов.Видимость = Ложь;
		Элементы.КонецПериодаВыгрузкиДокументов.Видимость  = Ложь;
		Элементы.ДеревоРеквизитов.Видимость                = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НарисоватьДеревоВидовОбъектов()
	
	ОписаниеПрочихОбъектов = Новый ТаблицаЗначений;
	ОписаниеПрочихОбъектов.Колонки.Добавить("РегистрируемыйОбъект", Новый ОписаниеТипов("Строка", ,
																	Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная)));
	ОписаниеПрочихОбъектов.Колонки.Добавить("ВидОбъекта", Новый ОписаниеТипов("Строка", ,
														  Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	ОписаниеПрочихОбъектов.Колонки.Добавить("ИндексКартинки", Новый ОписаниеТипов("Число",
															  Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный)));
	ОписаниеПрочихОбъектов.Колонки.Добавить("НаименованиеОбъекта", Новый ОписаниеТипов("Строка", ,
																   Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	
	МассивИменМетаданных = Новый Массив;
	Для каждого ЭлементСостава Из Метаданные.ПланыОбмена.бит_АудиторскаяВыгрузка.Состав Цикл
		МетаданныеОбмена = ЭлементСостава.Метаданные;
		ПолноеИмяОбъекта = МетаданныеОбмена.ПолноеИмя();
		Если Метаданные.Константы.Содержит(МетаданныеОбмена) Тогда
			ОписаниеОбъекта = ОписаниеПрочихОбъектов.Добавить();	
			ОписаниеОбъекта.РегистрируемыйОбъект = ПолноеИмяОбъекта;
			ОписаниеОбъекта.ВидОбъекта           = НСтр("ru = 'Константы';
												   		|en = 'Constants'");
			ОписаниеОбъекта.ИндексКартинки       = 10;
			ОписаниеОбъекта.НаименованиеОбъекта  = МетаданныеОбмена.Синоним;
		ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(МетаданныеОбмена) Тогда
			ОписаниеОбъекта = ОписаниеПрочихОбъектов.Добавить();	
			ОписаниеОбъекта.РегистрируемыйОбъект = ПолноеИмяОбъекта;
			ОписаниеОбъекта.ВидОбъекта           = НСтр("ru = 'Планы видов расчета';
												   		|en = 'Payment type plans'");
			ОписаниеОбъекта.ИндексКартинки       = 14;
			ОписаниеОбъекта.НаименованиеОбъекта  = МетаданныеОбмена.Синоним;
		ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(МетаданныеОбмена) Тогда
			ОписаниеОбъекта = ОписаниеПрочихОбъектов.Добавить();	
			ОписаниеОбъекта.РегистрируемыйОбъект = ПолноеИмяОбъекта;
			ОписаниеОбъекта.ВидОбъекта           = НСтр("ru = 'Регистры расчета';
												   		|en = 'Calculation registers'");
			ОписаниеОбъекта.ИндексКартинки       = 16;
			ОписаниеОбъекта.НаименованиеОбъекта  = МетаданныеОбмена.Синоним;
		Иначе	
			МассивИменМетаданных.Добавить(ПолноеИмяОбъекта);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаФильтров = Объект.ФильтрРеквизитов.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ОбъектыСистемы.Ссылка КАК РегистрируемыйОбъект,
	|	бит_ОбъектыСистемы.Родитель КАК ВидОбъекта,
	|	бит_ОбъектыСистемы.Родитель.Код КАК ПорядокВидовОбъектов,
	|	ВЫБОР
	|		КОГДА бит_ОбъектыСистемы.Родитель = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.Справочники)
	|			ТОГДА 4
	|		КОГДА бит_ОбъектыСистемы.Родитель = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.Документы)
	|			ТОГДА 5
	|		КОГДА бит_ОбъектыСистемы.Родитель = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.РегистрыСведений)
	|			ТОГДА 8
	|		КОГДА бит_ОбъектыСистемы.Родитель = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.РегистрыНакопления)
	|			ТОГДА 9
	|		КОГДА бит_ОбъектыСистемы.Родитель = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПланыСчетов)
	|			ТОГДА 13
	|		КОГДА бит_ОбъектыСистемы.Родитель = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПланыВидовХарактеристик)
	|			ТОГДА 12
	|		КОГДА бит_ОбъектыСистемы.Родитель = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.РегистрыБухгалтерии)
	|			ТОГДА 15
	|		КОГДА бит_ОбъектыСистемы.Родитель = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.Задачи)
	|			ТОГДА 18
	|		КОГДА бит_ОбъектыСистемы.Родитель = ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.БизнесПроцессы)
	|			ТОГДА 17
	|	КОНЕЦ КАК ИндексКартинки,
	|	бит_ОбъектыСистемы.Наименование КАК НаименованиеОбъекта,
	|	ВЫБОР
	|		КОГДА бит_ОбъектыСистемы.ИмяОбъектаПолное = ""Справочник.бит_ОбъектыСистемы""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыгружатьВсегда,
	|	бит_ОбъектыСистемы.ИмяОбъектаПолное КАК ОбъектСистемыСтрокой
	|ПОМЕСТИТЬ РегистрируемыеОбъектыСистемы
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|ГДЕ
	|	НЕ бит_ОбъектыСистемы.ПометкаУдаления
	|	И бит_ОбъектыСистемы.ИмяОбъектаПолное В(&МассивИменМетаданных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОписаниеПрочихОбъектов.РегистрируемыйОбъект КАК РегистрируемыйОбъект,
	|	ОписаниеПрочихОбъектов.ВидОбъекта КАК ВидОбъекта,
	|	ОписаниеПрочихОбъектов.ИндексКартинки КАК ИндексКартинки,
	|	ОписаниеПрочихОбъектов.НаименованиеОбъекта КАК НаименованиеОбъекта
	|ПОМЕСТИТЬ ОписаниеПрочихОбъектов
	|ИЗ
	|	&ОписаниеПрочихОбъектов КАК ОписаниеПрочихОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаФильтров.ОбъектСистемы КАК ОбъектСистемы,
	|	ТаблицаФильтров.ИмяРеквизита КАК ИмяРеквизита
	|ПОМЕСТИТЬ ТаблицаФильтров
	|ИЗ
	|	&ТаблицаФильтров КАК ТаблицаФильтров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрируемыеОбъектыСистемы.РегистрируемыйОбъект КАК РегистрируемыйОбъект,
	|	РегистрируемыеОбъектыСистемы.ВидОбъекта КАК ВидОбъекта,
	|	РегистрируемыеОбъектыСистемы.ПорядокВидовОбъектов КАК ПорядокВидовОбъектов,
	|	РегистрируемыеОбъектыСистемы.ИндексКартинки КАК ИндексКартинки,
	|	РегистрируемыеОбъектыСистемы.НаименованиеОбъекта КАК НаименованиеОбъекта,
	|	ИСТИНА КАК ИспользуютсяОбъкетыСистемы,
	|	РегистрируемыеОбъектыСистемы.ВыгружатьВсегда КАК ВыгружатьВсегда,
	|	РегистрируемыеОбъектыСистемы.ОбъектСистемыСтрокой КАК ОбъектСистемыСтрокой
	|ПОМЕСТИТЬ РегистрируемыеОбъекты
	|ИЗ
	|	РегистрируемыеОбъектыСистемы КАК РегистрируемыеОбъектыСистемы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОписаниеПрочихОбъектов.РегистрируемыйОбъект,
	|	ОписаниеПрочихОбъектов.ВидОбъекта,
	|	"""",
	|	ОписаниеПрочихОбъектов.ИндексКартинки,
	|	ОписаниеПрочихОбъектов.НаименованиеОбъекта,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ОписаниеПрочихОбъектов.РегистрируемыйОбъект
	|ИЗ
	|	ОписаниеПрочихОбъектов КАК ОписаниеПрочихОбъектов";
	Запрос.УстановитьПараметр("МассивИменМетаданных", МассивИменМетаданных);
	Запрос.УстановитьПараметр("ОписаниеПрочихОбъектов", ОписаниеПрочихОбъектов);
	Запрос.УстановитьПараметр("ТаблицаФильтров",      ТаблицаФильтров);
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрируемыеОбъекты.ВидОбъекта КАК ВидОбъекта,
	|	РегистрируемыеОбъекты.РегистрируемыйОбъект КАК РегистрируемыйОбъект,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТаблицаФильтров.ОбъектСистемы ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВариативностьФильтра,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТаблицаФильтров.ОбъектСистемы ЕСТЬ NULL
	|				ТОГДА 1
	|			КОГДА ТаблицаФильтров.ИмяРеквизита <> """"
	|				ТОГДА 2
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыгрузкаОбъекта,
	|	МАКСИМУМ(РегистрируемыеОбъекты.ИспользуютсяОбъкетыСистемы) КАК ИспользуютсяОбъкетыСистемы,
	|	МАКСИМУМ(РегистрируемыеОбъекты.ПорядокВидовОбъектов) КАК ПорядокВидовОбъектов,
	|	МАКСИМУМ(РегистрируемыеОбъекты.НаименованиеОбъекта) КАК НаименованиеОбъекта,
	|	МАКСИМУМ(РегистрируемыеОбъекты.ИндексКартинки) КАК ИндексКартинки,
	|	МАКСИМУМ(РегистрируемыеОбъекты.ВыгружатьВсегда) КАК ВыгружатьВсегда,
	|	МАКСИМУМ(ОбъектСистемыСтрокой) КАК ОбъектСистемыСтрокой
	|ИЗ
	|	РегистрируемыеОбъекты КАК РегистрируемыеОбъекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаФильтров КАК ТаблицаФильтров
	|		ПО РегистрируемыеОбъекты.РегистрируемыйОбъект = ТаблицаФильтров.ОбъектСистемы
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрируемыеОбъекты.ВидОбъекта,
	|	РегистрируемыеОбъекты.РегистрируемыйОбъект
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИспользуютсяОбъкетыСистемы УБЫВ,
	|	ПорядокВидовОбъектов,
	|	НаименованиеОбъекта
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВариативностьФильтра),
	|	МАКСИМУМ(ВыгрузкаОбъекта),
	|	МАКСИМУМ(ИспользуютсяОбъкетыСистемы),
	|	МАКСИМУМ(ИндексКартинки)
	|ПО
	|	ВидОбъекта";
	
	ДеревоМетаданных = РеквизитФормыВЗначение("ДеревоРеквизитов");
	
	СтрокиПервогоУровня = ДеревоМетаданных.Строки;
	СтрокиПервогоУровня.Очистить();
	
	ВыборкаВидовОбъектов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидовОбъектов.Следующий() Цикл
		СтрокаПервогоУровня = СтрокиПервогоУровня.Добавить();
		СтрокаПервогоУровня.Представление  = ВыборкаВидовОбъектов.ВидОбъекта;
		СтрокаПервогоУровня.ИндексКартинки = ВыборкаВидовОбъектов.ИндексКартинки;
		СтрокаПервогоУровня.Используется   = ?(ВыборкаВидовОбъектов.ВариативностьФильтра > 1, 2,
												ВыборкаВидовОбъектов.ВыгрузкаОбъекта);
												
		ВыборкаОбъектов = ВыборкаВидовОбъектов.Выбрать();
		Пока ВыборкаОбъектов.Следующий() Цикл
			СтрокаОбъекта = СтрокаПервогоУровня.Строки.Добавить();
			СтрокаОбъекта.ОбъектСистемы        = ВыборкаОбъектов.РегистрируемыйОбъект;
			СтрокаОбъекта.Представление        = ВыборкаОбъектов.НаименованиеОбъекта;
			СтрокаОбъекта.ИндексКартинки       = ВыборкаОбъектов.ИндексКартинки;
			СтрокаОбъекта.Используется         = ВыборкаОбъектов.ВыгрузкаОбъекта;
			СтрокаОбъекта.ВыгружатьВсегда      = ВыборкаОбъектов.ВыгружатьВсегда;
			СтрокаОбъекта.ОбъектСистемыСтрокой = ВыборкаОбъектов.ОбъектСистемыСтрокой;
			Если ВыборкаОбъектов.ВидОбъекта <> "Константы"
				И ВыборкаОбъектов.ВидОбъекта <> "Constants" Тогда
				СтрокаОбъекта.ОбработатьСтруктуру = Истина;
				СтрокаОбъекта.Строки.Добавить();
			КонецЕсли;
			Если СтрокаОбъекта.Используется <> 1 Тогда
				// Если присутствую фильтры, то структуру реквизитов необходимо заполнять сразу.
				ФильтрыОбъекта = ТаблицаФильтров.НайтиСтроки(Новый Структура("ОбъектСистемы", СтрокаОбъекта.ОбъектСистемы));
				ПодготовитьСтруктуруРеквизитов(СтрокаОбъекта, ФильтрыОбъекта);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоМетаданных, "ДеревоРеквизитов");
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьСтруктуруРеквизитов(Знач ИдентификаторСтрокиДерева, Знач ФильтрыОбъекта = Неопределено)
	
	Если ТипЗнч(ИдентификаторСтрокиДерева) = Тип("СтрокаДереваЗначений")
		ИЛИ ТипЗнч(ИдентификаторСтрокиДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокаДерева = ИдентификаторСтрокиДерева;
	Иначе
		СтрокаДерева = ДеревоРеквизитов.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
	КонецЕсли;
	
	Если ФильтрыОбъекта = Неопределено Тогда
		ФильтрыОбъекта = Новый Массив;
	КонецЕсли;
	
	Если СтрокаДерева = Неопределено
		ИЛИ НЕ СтрокаДерева.ОбработатьСтруктуру Тогда
		Возврат;
	КонецЕсли;
	
	ПодчиненныеСтроки = ПодчиненныеСтроки(СтрокаДерева);
	ПодчиненныеСтроки.Очистить();
	
	ОбъектСистемы = СтрокаДерева.ОбъектСистемы;
	Если ТипЗнч(ОбъектСистемы) = Тип("СправочникСсылка.бит_ОбъектыСистемы") Тогда
		ПолноеИмяОбъектаСистемы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСистемы, "ИмяОбъектаПолное"); 
	Иначе
		ПолноеИмяОбъектаСистемы = ОбъектСистемы;
	КонецЕсли;
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаСистемы);
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоРегистр = Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта)
					ИЛИ Метаданные.РегистрыНакопления.Содержит(МетаданныеОбъекта)
					ИЛИ Метаданные.РегистрыБухгалтерии.Содержит(МетаданныеОбъекта);
	
	Если ЭтоРегистр Тогда
		ДобавитьКлючевыеПоля(СтрокаДерева, МетаданныеОбъекта, "Измерения", ФильтрыОбъекта);
		
		ДобавитьКлючевыеПоля(СтрокаДерева, МетаданныеОбъекта, "Ресурсы", ФильтрыОбъекта);
	КонецЕсли;

	ДобавитьКлючевыеПоля(СтрокаДерева, МетаданныеОбъекта, "Реквизиты", ФильтрыОбъекта);
	
	Если НЕ ЭтоРегистр Тогда
		КоллекцияСтрокТабличныхЧастей = ПодчиненныеСтроки(СтрокаДерева);
		Для каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			СтрокаТабличнойЧасти = КоллекцияСтрокТабличныхЧастей.Добавить();
			СтрокаТабличнойЧасти.ОбъектСистемы     = ОбъектСистемы;
			СтрокаТабличнойЧасти.ИмяТабличнойЧасти = ТабличнаяЧасть.Имя;
			СтрокаТабличнойЧасти.Представление     = ТабличнаяЧасть.Синоним;
			СтрокаТабличнойЧасти.ИндексКартинки    = 2;
			СтрокаТабличнойЧасти.Используется      = СтрокаДерева.Используется;
			СтрокаТабличнойЧасти.ВыгружатьВсегда   = СтрокаДерева.ВыгружатьВсегда;
			
			ДобавитьКлючевыеПоля(СтрокаТабличнойЧасти, ТабличнаяЧасть, "Реквизиты", ФильтрыОбъекта);
			УстановитьФлагИспользуетсяРодительскихСтрок(СтрокаТабличнойЧасти, Истина);
		КонецЦикла;
	КонецЕсли;
	
	СтрокаДерева.ОбработатьСтруктуру = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьКлючевыеПоля(СтрокаРодителя, Источник, ВидКлюча, ФильтрыОбъекта)
	
	ПодчиненныеСтроки = ПодчиненныеСтроки(СтрокаРодителя);
	
	Для каждого КлючевоеПоле Из Источник[ВидКлюча] Цикл
		СтрокаКлючевогоПоля = ПодчиненныеСтроки.Добавить();
		СтрокаКлючевогоПоля.ОбъектСистемы     = СтрокаРодителя.ОбъектСистемы;
		СтрокаКлючевогоПоля.ИмяТабличнойЧасти = СтрокаРодителя.ИмяТабличнойЧасти;
		СтрокаКлючевогоПоля.ИмяРеквизита      = КлючевоеПоле.Имя;
		СтрокаКлючевогоПоля.Представление     = КлючевоеПоле.Синоним;
		Если ВидКлюча = "Реквизиты" Тогда
			СтрокаКлючевогоПоля.ИндексКартинки = 1;
		ИначеЕсли ВидКлюча = "Измерения" Тогда
			СтрокаКлючевогоПоля.ИндексКартинки = 19;
		ИначеЕсли ВидКлюча = "Ресурсы" Тогда
			СтрокаКлючевогоПоля.ИндексКартинки = 20;
		КонецЕсли;
		
		СтрокаКлючевогоПоля.ВыгружатьВсегда = СтрокаРодителя.ВыгружатьВсегда;
		
		СтрокаКлючевогоПоля.Используется = СтрокаРодителя.Используется;
		Если СтрокаКлючевогоПоля.Используется = 2 Тогда
			// Признак говорит о том, что часть полей включена, часть нет.
			СтрокаКлючевогоПоля.Используется = 1;
			Для каждого СтрокаФильтра Из ФильтрыОбъекта Цикл
				Если СтрокаКлючевогоПоля.ИмяТабличнойЧасти = СтрокаФильтра.ИмяТабличнойЧасти
					И СтрокаКлючевогоПоля.ИмяРеквизита = СтрокаФильтра.ИмяРеквизита Тогда
					СтрокаКлючевогоПоля.Используется = 0;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	// Блокировка выгрузки измерений регистров запрещена, т.к. может привести к нарушению уникальности записей.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл ошибка типовой конфигурации - отсутствует разметка областей в типовом модуле.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ФильтрРеквизитовИспользуется");
	
	ГруппаЭлементовОтбора = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементУО.Отбор.Элементы,
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	// АПК:547-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаЭлементовОтбора,
			"ДеревоРеквизитов.ИндексКартинки", ВидСравненияКомпоновкиДанных.Равно, 19);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаЭлементовОтбора,
			"ДеревоРеквизитов.ВыгружатьВсегда", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииФлагаИспользуетсяСтроки(Знач ИдентификаторСтрокиДерева)
	
	ИзмененФильтрРеквизитов = Истина;
	
	ПодготовитьСтруктуруРеквизитов(ИдентификаторСтрокиДерева);
	
	СтрокаДерева = ДеревоРеквизитов.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
	
	Если СтрокаДерева.Используется = 2 Тогда
		СтрокаДерева.Используется = 0;
	КонецЕсли;
	
	УстановитьФлагИспользуетсяПодчиненныхСтрок(СтрокаДерева);
	УстановитьФлагИспользуетсяРодительскихСтрок(СтрокаДерева);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагИспользуетсяПодчиненныхСтрок(СтрокаРодитель, ГрупповаяУстановка = Ложь)
	
	ПодчиненныеСтроки = ПодчиненныеСтроки(СтрокаРодитель);
	Для каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
		Если ПодчиненнаяСтрока.ВыгружатьВсегда Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ГрупповаяУстановка Тогда
			ПодготовитьСтруктуруРеквизитов(ПодчиненнаяСтрока);
		КонецЕсли;
		ПодчиненнаяСтрока.Используется = СтрокаРодитель.Используется;
		УстановитьФлагИспользуетсяПодчиненныхСтрок(ПодчиненнаяСтрока, ГрупповаяУстановка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнвертироватьФлагИспользовать(СтрокаРодитель)
	
	ПодчиненныеСтроки = ПодчиненныеСтроки(СтрокаРодитель);
	Для каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
		Если ПодчиненнаяСтрока.ВыгружатьВсегда Тогда
			Продолжить;
		КонецЕсли;
		Если ПодчиненнаяСтрока.Используется = 0 Тогда
			ПодчиненнаяСтрока.Используется = 1;
		ИначеЕсли ПодчиненнаяСтрока.Используется = 1 Тогда
			ПодчиненнаяСтрока.Используется = 0;
		ИначеЕсли ПодчиненнаяСтрока.Используется = 2 Тогда
			ПодготовитьСтруктуруРеквизитов(ПодчиненнаяСтрока);
		КонецЕсли;
		ИнвертироватьФлагИспользовать(ПодчиненнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагИспользуетсяРодительскихСтрок(ПодчиненнаяСтрока, ЭтоСтрокаРодитель = Ложь)
	
	Если ЭтоСтрокаРодитель Тогда
		СтрокаРодитель = ПодчиненнаяСтрока;
	ИначеЕсли ТипЗнч(ПодчиненнаяСтрока) = Тип("СтрокаДереваЗначений") Тогда
		СтрокаРодитель = ПодчиненнаяСтрока.Родитель;
	Иначе
		СтрокаРодитель = ПодчиненнаяСтрока.ПолучитьРодителя();
	КонецЕсли;
	
	Если СтрокаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоСтрокаРодитель И СтрокаРодитель.Используется = ПодчиненнаяСтрока.Используется Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоСтрокаРодитель И ПодчиненнаяСтрока.Используется = 2 Тогда
		СтрокаРодитель.Используется = 2;
		УстановитьФлагИспользуетсяРодительскихСтрок(СтрокаРодитель);
		Возврат;
	КонецЕсли;
	
	ЕстьИспользуемые = Ложь;
	ЕстьОтключенные  = Ложь;
	
	СтрокиРодителя = ПодчиненныеСтроки(СтрокаРодитель);
	Для каждого СтрокаРодителя Из СтрокиРодителя Цикл
		Если СтрокаРодителя.Используется = 0 Тогда
			ЕстьОтключенные = Истина;
			Если ЕстьИспользуемые Тогда
				Прервать;
			КонецЕсли;
		ИначеЕсли СтрокаРодителя.Используется = 1 Тогда
			ЕстьИспользуемые = Истина;
			Если ЕстьОтключенные Тогда
				Прервать;
			КонецЕсли;
		ИначеЕсли СтрокаРодителя.Используется = 2 Тогда
			ЕстьИспользуемые = Истина;
			ЕстьОтключенные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьИспользуемые И ЕстьОтключенные Тогда 
		СтрокаРодитель.Используется = 2;
	ИначеЕсли ЕстьИспользуемые Тогда
		СтрокаРодитель.Используется = 1;
	Иначе
		СтрокаРодитель.Используется = 0;
	КонецЕсли;
	
	УстановитьФлагИспользуетсяРодительскихСтрок(СтрокаРодитель);
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьФильтрРеквизитов(ТекущийОбъект)
	
	ФильтрРеквизитов = ТекущийОбъект.ФильтрРеквизитов;
	ФильтрРеквизитов.Очистить();
	
	ВидыМетаданных = ПодчиненныеСтроки(ДеревоРеквизитов);
	
	Для каждого СтрокаВидаМетаданных Из ВидыМетаданных Цикл
		Если СтрокаВидаМетаданных.Используется = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектыМетаданных = ПодчиненныеСтроки(СтрокаВидаМетаданных);
		Для каждого СтрокаОбъекта Из ОбъектыМетаданных Цикл
			Если СтрокаОбъекта.Используется = 1 Тогда
				Продолжить;
			ИначеЕсли СтрокаОбъекта.Используется = 0 Тогда
				НовыйФильтр = ФильтрРеквизитов.Добавить();
				НовыйФильтр.ОбъектСистемы = СтрокаОбъекта.ОбъектСистемы;
				Продолжить;
			КонецЕсли;
			ПрименитьФильтрДляПодчиненныхСтрок(СтрокаОбъекта, ФильтрРеквизитов);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьФильтрДляПодчиненныхСтрок(СтрокаРодитель, ФильтрРеквизитов)
	
	Если СтрокаРодитель.Используется = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ПодчиненныеСтроки = ПодчиненныеСтроки(СтрокаРодитель);
	Если ПодчиненныеСтроки.Количество() = 0 Тогда
		// Строка последнего уровня вложенности.
		Если СтрокаРодитель.Используется = 0 Тогда
			НовыйФильтр = ФильтрРеквизитов.Добавить();	
			ЗаполнитьЗначенияСвойств(НовыйФильтр, СтрокаРодитель);
		КонецЕсли;
	Иначе
		Для каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
			ПрименитьФильтрДляПодчиненныхСтрок(ПодчиненнаяСтрока, ФильтрРеквизитов);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодчиненныеСтроки(СтрокаРодитель)
	
	Если ТипЗнч(СтрокаРодитель) = Тип("СтрокаДереваЗначений") Тогда
		ПодчиненныеСтроки = СтрокаРодитель.Строки;
	Иначе
		ПодчиненныеСтроки = СтрокаРодитель.ПолучитьЭлементы();
	КонецЕсли;
	
	Возврат ПодчиненныеСтроки;
	
КонецФункции

&НаСервере
Процедура ГрупповаяУстановкаПризнакаИспользованияФильтра(Знач ГрупповоеДействие)
	
	ИзмененФильтрРеквизитов = Истина;
	
	Если ГрупповоеДействие = "Инвертировать" Тогда
		ИнвертироватьФлагИспользовать(ДеревоРеквизитов);
		Возврат;
	КонецЕсли;
		
	ПодчиненныеСтроки = ПодчиненныеСтроки(ДеревоРеквизитов);
	Для каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
		Если ГрупповоеДействие = "Включить" Тогда
			ПодчиненнаяСтрока.Используется = Истина;
		ИначеЕсли ГрупповоеДействие = "Снять" Тогда
			ПодчиненнаяСтрока.Используется = Ложь;
		КонецЕсли;
		УстановитьФлагИспользуетсяПодчиненныхСтрок(ПодчиненнаяСтрока, Истина);
		УстановитьФлагИспользуетсяРодительскихСтрок(ПодчиненнаяСтрока, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакИспользованияПоПодсистеме(Знач Раздел, Знач Используется)
	
	ИзмененФильтрРеквизитов = Истина;
	
	СтрокиВидовОбъектов = ПодчиненныеСтроки(ДеревоРеквизитов);
	Для каждого СтрокаВидаОбъекта Из СтрокиВидовОбъектов Цикл
		БылиИзменения  = Ложь;
		СтрокиОбъектов = ПодчиненныеСтроки(СтрокаВидаОбъекта);
		Для каждого СтрокаОбъекта Из СтрокиОбъектов Цикл
			Если СтрокаОбъекта.Используется = Используется Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаОбъекта.ВыгружатьВсегда
				ИЛИ НЕ ОбъектПринадлежитРазделу(СтрокаОбъекта.ОбъектСистемыСтрокой, Раздел) Тогда
				Продолжить;
			КонецЕсли;
			БылиИзменения = Истина;
			СтрокаОбъекта.Используется = Используется;
			УстановитьФлагИспользуетсяПодчиненныхСтрок(СтрокаОбъекта);
		КонецЦикла;
		Если БылиИзменения Тогда
			УстановитьФлагИспользуетсяРодительскихСтрок(СтрокаВидаОбъекта, Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбъектПринадлежитРазделу(ИмяОбъектаПолное, Раздел)
	
	Если Раздел = "ТиповаяКонфигурация" Тогда
		Возврат (СтрНайти(ИмяОбъектаПолное, "_") = 0);
	ИначеЕсли Раздел = "БитФинанс" Тогда
	    Возврат (СтрНайти(ИмяОбъектаПолное, "бит_") > 0);
	ИначеЕсли Раздел = "НалоговыйМониторинг" Тогда
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяОбъектаПолное);
		Возврат Метаданные.Подсистемы.бит_НалоговыйМониторинг.Состав.Содержит(МетаданныеОбъекта);
	ИначеЕсли Раздел = "ПрисоединенныеФайлы" Тогда
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяОбъектаПолное);
		Если НЕ ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта) Тогда
			Возврат Ложь;
		КонецЕсли;
		ИмяТипаСсылки = СтрШаблон("СправочникСсылка.%1", МетаданныеОбъекта.Имя); 
		Возврат Метаданные.ОпределяемыеТипы.ПрисоединенныйФайл.Тип.СодержитТип(Тип(ИмяТипаСсылки));
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
