
#Область СлужебныйПрограммныйИнтерфейс

#Область Сообщения

// Процедура выводит сообщение пользователю.
//
// Параметры:
//  ТекстСообщения	 - Строка	 - Текст сообщения.
//  ТекущийОбъект	 - Произвольный	 - Объект для которого выводим сообщение.
//  ТекущееПоле		 - Строка		 - Поле для которого выводим сообщение.
//  Отказ			 - Булево		 - Выходной параметр.
//
Процедура ВывестиСообщение(ТекстСообщения, Знач ТекущийОбъект = Неопределено, ТекущееПоле = "",Отказ = Ложь) Экспорт

	Если ТипЗнч(ТекущийОбъект) = Тип("ДанныеФормыСтруктура")
		И ТекущийОбъект.Свойство("Ссылка") Тогда
		Объект = ТекущийОбъект.Ссылка;
	Иначе
		Объект = ТекущийОбъект;
	КонецЕсли; 
    
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, ТекущееПоле, , Отказ);
	#Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект, ТекущееПоле, , Отказ);
	#КонецЕсли

КонецПроцедуры // ВывестиСообщение()

// Функция определяет режимы вывода сообщений.
// 
// Параметры:
//  РежимСообщений - Строка - "Нет","Все","Ошибки".
// 
// Возвращаемое значение:
//  Структура.
// 
Функция ОпределитьРежимыВывода(РежимСообщений) Экспорт

	РежимыВывода = Новый Структура("ВыводитьОшибки,ВыводитьИнформацию");
	
	РежимыВывода.ВыводитьОшибки     = ВРег(РежимСообщений)= ВРег("Все") ИЛИ ВРег(РежимСообщений) = ВРег("Ошибки");
	РежимыВывода.ВыводитьИнформацию = ВРег(РежимСообщений)= ВРег("Все");

	Возврат РежимыВывода;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииПоРаботеСЕдиницамиИзмеренияСумм

// Функция пересчитывает сумму из размерности РазмерностьНач в РазмерностьКон.
// 
// Параметры:      
// 	Сумма		   - Число, сумма которую следует пересчитать.
// 	РазмерностьНач - Число, размерность из которой надо пересчитать.
// 	РазмерностьКон - Число, размерность в которую надо пересчитать.
// 
// Возвращаемое значение: 
//  СуммаРез - Число, пересчитанная в другую размерность.
// 
Функция ПересчитатьИзРазмерностиВРазмерность(Сумма, РазмерностьНач, РазмерностьКон) Экспорт

	Если РазмерностьНач = РазмерностьКон Тогда
		// Считаем, что пересчет не нужен.
		СуммаРез = Сумма;
	Иначе
		Если РазмерностьНач = 0 ИЛИ РазмерностьКон = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Процедура ""ПересчитатьИзРазмерностиВРазмерность()"": при пересчете обнаружена нулевая размерность.'");
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			#Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			#КонецЕсли 
			
			СуммаРез = 0;
		Иначе
			СуммаРез = (Сумма * РазмерностьНач / РазмерностьКон);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СуммаРез;

КонецФункции // ПересчитатьИзРазмерностиВРазмерность()

#КонецОбласти

#Область СистемнаяИнформация

// Функция определяет, используется ли Windows.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ЭтоВинОС() Экспорт
	
	флВин = Ложь;
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Если СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 
		ИЛИ СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
	
		флВин = Истина;
	
	КонецЕсли; 
	
	Возврат флВин;
	
КонецФункции // ЭтоВинОС()

// Функция получает из системной информации текущую редакцию платформы.
// 
// Возвращаемое значение:
//  ТекущаяРедакцияПлатформы - Строка.
// 
Функция РедакцияПлатформы() Экспорт

	СисИнфо = Новый СистемнаяИнформация;
	ТекущаяРедакцияПлатформы = Лев(СисИнфо.ВерсияПриложения,3);
	
	Возврат ТекущаяРедакцияПлатформы;
	
КонецФункции // РедакцияПлатформы()

#КонецОбласти

#Область ФункцииРаботыСоЗначениямиТипаДата

// Формирирует строковый аналог значения перечисления.
//  Необходимо использовать из-за того, что у англоязычного пользователя конструкция
//  Значение = Строка(Периодичность) возвращает ангоязычное представление значения.
//  Это приводит к ошибке, т.к. "day" <> "День".
//
// Параметры:
//  Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования 
// 
// Возвращаемое значение:
//  ЗначениеСтрокой - Строка - строковый аналог значения перечисления.
//
Функция ПериодичностьПланированияСтрокой(Периодичность) Экспорт

	ЗначениеСтрокой = "";
	
	Если Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.ПустаяСсылка") Тогда
		ЗначениеСтрокой = "";
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Год") Тогда
		ЗначениеСтрокой = "Год";	
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Декада") Тогда
		ЗначениеСтрокой = "Декада";
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.День") Тогда
		ЗначениеСтрокой = "День";
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Квартал") Тогда
		ЗначениеСтрокой = "Квартал";
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Месяц") Тогда
		ЗначениеСтрокой = "Месяц";
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Неделя") Тогда
		ЗначениеСтрокой = "Неделя";
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Полугодие") Тогда
		ЗначениеСтрокой = "Полугодие";
	КонецЕсли;
	
	Возврат ЗначениеСтрокой;
	
КонецФункции

// Функция получает период по сдвигу исходя из текущего периода и периодичности.
// 
// Параметры:
//  ДатаНачала  	   - Дата
//  Сдвиг       	   - Число
//  Периодичность      - ПеречислениеСсылка.бит_ПериодичностьПланирования
//  НеприводитьКНачалу - Булево, по умолчанию Ложь
// 
// Возвращаемое значение:
//  ТекущийПериод   - Дата
// 
Функция ПолучитьПериодПоСдвигу(ДатаНачала,Сдвиг,Периодичность,НеприводитьКНачалу = Ложь) Экспорт
	
	Если Не НеприводитьКНачалу Тогда
		ТекущийПериод = ПолучитьНачалоПериода(ДатаНачала,Периодичность);
	Иначе
		ТекущийПериод = ДатаНачала;
	КонецЕсли;
	
	Если Сдвиг >=0 Тогда
		Для й = 1 По Сдвиг Цикл
			КонецПериода  = ПолучитьКонецПериода(ТекущийПериод  ,Периодичность);
			ТекущийПериод = ПолучитьНачалоПериода(КонецПериода+1,Периодичность);
		КонецЦикла;	
	Иначе
		КоличествоПериодов = МодульЧисла(Сдвиг);
		Для й = 1 По КоличествоПериодов Цикл
			НачалоПериода = ПолучитьНачалоПериода(ТекущийПериод  ,Периодичность);
			ТекущийПериод = ПолучитьНачалоПериода(ТекущийПериод-1,Периодичность);
		КонецЦикла; 
	КонецЕсли; 
	
   Возврат ТекущийПериод;
   
КонецФункции

// Функция получает начало периода исходя из периодичности.
// 
// Параметры:
//  Период  - Дата.
//  Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования, Строка - значение периодичности.
// 
// Возвращаемое значение:
//  ТекущийПериод   - Дата.
// 
Функция ПолучитьНачалоПериода(Период, Периодичность) Экспорт
	
	Если ЗначениеЗаполнено(Период) Тогда
		НачалоПериода = НачалоДня(Период);
	Иначе 
		НачалоПериода = НачалоДня(ДатаСеанса());
	КонецЕсли; 
	
	Если ТипЗнч(Периодичность) <> Тип("Строка") Тогда
		ПериодичностьСтр = ПериодичностьПланированияСтрокой(Периодичность);
	Иначе
		ПериодичностьСтр = Периодичность;
	КонецЕсли; 
	
	Если СтрСравнить(ПериодичностьСтр, "День") = 0 Тогда
		НачалоПериода = НачалоДня(НачалоПериода);
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Неделя") = 0 Тогда
		НачалоПериода = НачалоНедели(НачалоПериода);
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Декада") = 0 Тогда
		
		Сутки      = 86400;
		ДеньМесяца   = День(НачалоПериода);
		НачалоМесяца = НачалоМесяца(НачалоПериода);
		
		Если ДеньМесяца = 1 Или ДеньМесяца = 11 Или ДеньМесяца = 21 Тогда
			НачалоПериода = НачалоДня(НачалоПериода);
		ИначеЕсли ДеньМесяца <= 10 Тогда
			НачалоПериода = НачалоМесяца
		ИначеЕсли ДеньМесяца <= 20 Тогда
			НачалоПериода = НачалоМесяца + Сутки * 10;
		Иначе
			НачалоПериода = НачалоМесяца + Сутки * 20;
		КонецЕсли;
		
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Месяц") = 0 Тогда
		НачалоПериода = НачалоМесяца(НачалоПериода);
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Квартал") = 0 Тогда
		НачалоПериода = НачалоКвартала(НачалоПериода);
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Полугодие") = 0 Тогда
		
		Если НачалоПериода < ДобавитьМесяц(НачалоГода(НачалоПериода), 6) Тогда
			НачалоПериода = НачалоГода(НачалоПериода);
		Иначе
			НачалоПериода = ДобавитьМесяц(НачалоГода(НачалоПериода), 6);
		КонецЕсли; 
		
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Год") = 0 Тогда
		НачалоПериода = НачалоГода(НачалоПериода);
	КонецЕсли; 
	
	Возврат НачалоПериода;
   
КонецФункции

// Функция получает конец периода исходя из периодичности.
// 
// Параметры:
//  Период  - Дата.
//  Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования.
// 
// Возвращаемое значение:
//  ТекущийПериод   - Дата.
// 
Функция ПолучитьКонецПериода(Период, Периодичность) Экспорт
	
	КонецПериода = КонецДня(Период);
	Если ТипЗнч(Периодичность) <> Тип("Строка") Тогда
		ПериодичностьСтр = ПериодичностьПланированияСтрокой(Периодичность);
	Иначе
		ПериодичностьСтр = Периодичность;
	КонецЕсли; 
	
	Если СтрСравнить(ПериодичностьСтр, "День") = 0 Тогда
		КонецПериода = КонецДня(КонецПериода);
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Неделя") = 0 Тогда
		КонецПериода = КонецНедели(КонецПериода);
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Декада") = 0 Тогда
		
		Сутки     = 86400;
		ДеньМесяца   = День(КонецПериода);
		КонецМесяца  = КонецМесяца(КонецПериода);
		НачалоМесяца = НачалоМесяца(КонецПериода);
		
		Если ДеньМесяца = 10 Или ДеньМесяца = 20 Или ДеньМесяца = День(КонецМесяца) Тогда
			КонецПериода = КонецДня(КонецПериода);
		ИначеЕсли ДеньМесяца <= 9 Тогда
			КонецПериода = НачалоМесяца - 1 + Сутки * 10
		ИначеЕсли ДеньМесяца <= 19 Тогда
			КонецПериода = НачалоМесяца - 1 + Сутки * 20;
		Иначе
			КонецПериода = КонецМесяца;
		КонецЕсли;
		
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Месяц") = 0 Тогда
		КонецПериода = КонецМесяца(КонецПериода);
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Квартал") = 0 Тогда
		КонецПериода = КонецКвартала(КонецПериода);
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Полугодие") = 0 Тогда
		
		Если КонецПериода < ДобавитьМесяц(НачалоГода(КонецПериода), 6) Тогда
			КонецПериода = ДобавитьМесяц(НачалоГода(КонецПериода), 6) - 1;
		Иначе
			КонецПериода = КонецГода(КонецПериода);
		КонецЕсли; 
		
	ИначеЕсли СтрСравнить(ПериодичностьСтр, "Год") = 0 Тогда
		КонецПериода = КонецГода(КонецПериода);
	КонецЕсли; 
	
	Возврат КонецПериода;
   
КонецФункции

// Функция вычисляет разность дат исходя из заданной периодичности.
// 
// Параметры:
//  НачалоПериода    - Дата
//  ОкончаниеПериода - Дата
//  ТипРазности - Строка, ПеречислениеСсылка.бит_ПериодичностьПланирования.
// 
// Возвращаемое значение:
//   Разность   - Число
// 
Функция РазностьДат(НачалоПериода, ОкончаниеПериода, ТипРазности) Экспорт
	
	Если ТипЗнч(ТипРазности) <> Тип("Строка") Тогда
		ТипРазностиСтр = ПериодичностьПланированияСтрокой(ТипРазности);
	Иначе
		ТипРазностиСтр = ТипРазности;
	КонецЕсли; 
	
	Разность = 0;
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(ОкончаниеПериода) Тогда
		
		Если СтрСравнить(ТипРазностиСтр, "День") = 0 Тогда
			
			Разность = Цел((НачалоДня(ОкончаниеПериода) - НачалоДня(НачалоПериода))/(24 * 60 *60));						
						
		ИначеЕсли СтрСравнить(ТипРазностиСтр, "Неделя") = 0 Тогда
			
			Разность = Цел((НачалоНедели(ОкончаниеПериода) - НачалоНедели(НачалоПериода))/(7 * 24 * 60 *60));
			
		ИначеЕсли СтрСравнить(ТипРазностиСтр, "Декада") = 0 Тогда
			
			РазностьМесяцев = РазностьДат(НачалоПериода, ОкончаниеПериода, "Месяц");
			Разность = РазностьМесяцев * 3 + НомерДекады(ОкончаниеПериода) - НомерДекады(НачалоПериода);
			
		ИначеЕсли СтрСравнить(ТипРазностиСтр, "Месяц") = 0 Тогда
			
			Если НачалоМесяца(НачалоПериода) <= НачалоМесяца(ОкончаниеПериода)  Тогда
				Коэф = 1;
			Иначе
				Коэф = - 1;
			КонецЕсли;
			
			КонецПериода = НачалоМесяца(НачалоПериода);
			Пока КонецПериода <> НачалоМесяца(ОкончаниеПериода) Цикл
				Разность = Разность + Коэф;
				КонецПериода = ДобавитьМесяц(КонецПериода, Коэф);
			КонецЦикла;

		ИначеЕсли СтрСравнить(ТипРазностиСтр, "Квартал") = 0 Тогда
			
			РазностьМесяцев = РазностьДат(НачалоПериода,ОкончаниеПериода,"Месяц");
			Разность		= Цел(РазностьМесяцев / 3);
			
		ИначеЕсли СтрСравнить(ТипРазностиСтр, "Полугодие") = 0 Тогда
			
			РазностьМесяцев = РазностьДат(НачалоПериода,ОкончаниеПериода,"Месяц");
			Разность	    = Цел(РазностьМесяцев / 6);
			
		ИначеЕсли СтрСравнить(ТипРазностиСтр, "Год") = 0 Тогда	
			
			РазностьМесяцев = РазностьДат(НачалоПериода,ОкончаниеПериода,"Месяц");
			Разность		 = Цел(РазностьМесяцев / 12);
			
		КонецЕсли; 
		
	КонецЕсли; 
	       	 
	Возврат Разность;
	 
КонецФункции // РазностьДат()

#КонецОбласти 

Функция МодульЧисла(ВхЧисло) Экспорт

	Если ТипЗнч(ВхЧисло) = Тип("Число") Тогда
		Результат = Макс(ВхЧисло, - ВхЧисло);
	Иначе
		ВызватьИсключение НСтр("ru='Вычисление модуля для нечисловых данных не поддерживается.';
							   |en='Calculation module for non-numeric data is not supported.'");
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции

// Процедура УстановитьОтборУСпискаНаРавенство добавляет элемент
// в отбор компоновки данных левому и правому значениям на равенство.
// 
// Параметры:
//  ОтборСКД           	   - ОтборКомпоновкиДанных.
//  ЛевоеЗначение      	   - ПолеКомпоновкиДанных.
//  ПравоеЗначение	   	   - Произвольный, значение, проверяемое на равно.
//  ВидСравненияОтбора 	   - ВидСравненияКомпоновкиДанных. По умолчанию Равно.
//  ОбновлятьЭлементОтбора - Булево. По умолчанию Истина.
//  РежимОтображения       - РежимОтображенияЭлементаНастройкиКомпоновкиДанных.
// 
//  Пример использования:
//   бит_ОбщегоНазначенияКлиентСервер.УстановитьОтборУСписка(
//                   Список.Отбор,
//                   Новый ПолеКомпоновкиДанных("ИмяСвойства"),
//                   ЗначениеОтбора);
// 
Процедура УстановитьОтборУСписка(ОтборСКД
                                ,Знач ЛевоеЗначение
                                ,Знач ПравоеЗначение
								,ВидСравненияОтбора = Неопределено
								,ОбновлятьЭлементОтбора = Истина
								,РежимОтображения = Неопределено) Экспорт
	
	ЭлементыОтбора 		= ОтборСКД.Элементы;
	ЭлементОтбораДанных = Неопределено;
	
	Если ВидСравненияОтбора = Неопределено Тогда
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	// Если необходимо обновить условие для существующего элемента отбора, тогда.
	Если ОбновлятьЭлементОтбора Тогда
		
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			
			Если ЭлементОтбора.ЛевоеЗначение = ЛевоеЗначение Тогда
				
				Если ЭлементОтбораДанных = Неопределено Тогда
					ЭлементОтбораДанных = ЭлементОтбора;
				Иначе
					ЭлементОтбора.Использование = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭлементОтбораДанных = Неопределено Тогда
		
		ЭлементОтбораДанных = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораДанных.ЛевоеЗначение = ЛевоеЗначение;
		
	КонецЕсли;
	
	ЭлементОтбораДанных.ВидСравнения   = ВидСравненияОтбора;
	ЭлементОтбораДанных.ПравоеЗначение = ПравоеЗначение;
	ЭлементОтбораДанных.Использование  = Истина;
	
	Если РежимОтображения <> Неопределено Тогда
	
		ЭлементОтбораДанных.РежимОтображения = РежимОтображения
	
	КонецЕсли; 
	
КонецПроцедуры // УстановитьОтборУСписка()

// Процедура вычисляет цену в строке табличной части.
// 
// Параметры:
//  ТекущаяСтрока        - Строка табличной части.
//  ПоказательСуммы      - Строка, по умолчанию "Сумма".
//  ПоказательЦены       - Строка, по умолчанию "Цена".
//  ПоказательКоличества - Строка, по умолчанию "Количество".
// 
Процедура РассчитатьЦенуВСтрокеТЧ(ТекущаяСтрока,
									ПоказательСуммы = "Сумма",
									ПоказательЦены = "Цена",
									ПоказательКоличества = "Количество") Экспорт

	РасчетноеКоличество = ТекущаяСтрока[ПоказательКоличества];
	Если РасчетноеКоличество = 0 Тогда
		ТекущаяСтрока[ПоказательЦены] = 0;
	Иначе
		ТекущаяСтрока[ПоказательЦены] = ТекущаяСтрока[ПоказательСуммы] / ТекущаяСтрока[ПоказательКоличества];
	КонецЕсли; 

КонецПроцедуры // ПриИзмененииСуммыТабЧасти()

// Процедура устанавливает параметры выбора элемента.
// 
// Параметры:
//  Элемент 		- ПолеФормы.
//  СтруктураОтбора - Структура.
// 
Процедура УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураОтбора) Экспорт

	МассивПараметров = Новый Массив;
	
	Для Каждого ЭлементСтруктуры Из СтруктураОтбора Цикл
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор." + ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		МассивПараметров.Добавить(НовыйПараметр);
		
	КонецЦикла;
	
	ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
	Элемент.ПараметрыВыбора = ПараметрыВыбора;

КонецПроцедуры // УстановитьПараметрыВыбораЭлемента()

// Процедура разбирает строку с разделителями и упаковывает значения в массив.
// 
// Параметры:
//  ИсходнаяСтрока - Строка.
//  Разделитель    - Строка.
// 
// Возвращаемое значение:
//  Массив - части строки.
// 
Функция РазобратьСтрокуСРазделителями(ИсходнаяСтрока,Разделитель = ",") Экспорт
	
	РезМассив = Новый Массив;
	
	// Разделитель бывает динной строки > 1, учитывая особенность "СтрЗаменить",
	// заменим его на редкий односимвольный разделитель (смайлик) Символ(9786).
	Сепаратор = Символ(9786);
	Образец   = СтрЗаменить(ИсходнаяСтрока, Разделитель, Сепаратор);
	РезМассив = СтрРазделить(Образец, Сепаратор, Ложь);
		
	Возврат РезМассив;
	
КонецФункции // РазобратьСтрокуСРазделителями()

// Преобразует строку в допустимое наименование колонки таблицы значений, заменяя недопустимые
// символы на символ подчеркивания.
//
// Параметры:
//  Строка - Строка - Строка для преобразования.
// 
// Возвращаемое значение:
//  Результат - Строка, содержащая только допустимые символы для наименования колонок таблицы значений.
//
Функция ПреобразоватьСтрокуВДопустимоеНаименованиеКолонки(Строка) Экспорт  
	
	Результат = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(Строка, "_");
	
	ЗаменяемыеСимволы = " .,;:[]{}'""/\?!@#$%^&*+=<>~`|()№";
	Для Индекс = 1 По СтрДлина(ЗаменяемыеСимволы) Цикл
		Результат = СтрЗаменить(Результат, Сред(ЗаменяемыеСимволы, Индекс, 1), "_");
	КонецЦикла;
	
	Цмфры = СтрРазделить("1,2,3,4,5,6,7,8,9,0", ",");
	Индекс = 9;
	Пока Индекс >=0 Цикл
		Если Лев(Результат, 1) = Цмфры[Индекс] Тогда
			// Колонка не может начинаться с цифры.
			Результат = "_" + Результат;
			Индекс = -1;
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция формирует текст на разных языках.
// 
// Параметры:
//  СтрЯзыки  - Структура - Ключ:КодЯзыка, Значение: Текст на этом языке.
// 
// Возвращаемое значение:
//  Строка.
// 
Функция СформироватьТекстНаРазныхЯзыках(СтрЯзыки) Экспорт

	РезСтрока = "";
	
	Для каждого КиЗ Из СтрЯзыки Цикл
		
		Если ЗначениеЗаполнено(КиЗ.Значение) Тогда
			
		  Если НЕ ПустаяСтрока(РезСтрока) Тогда
		  
		  	  РезСтрока = РезСтрока + "; ";
		  
		  КонецЕсли; 	
		  РезСтрока = РезСтрока + КиЗ.Ключ + " = """ + КиЗ.Значение + """";
		
		КонецЕсли; 
	
	КонецЦикла; 

	Возврат РезСтрока;
	
КонецФункции // СформироватьТекстНаРазныхЯзыках()

// Функция получает имя варианта стандартного периода.
// 
// Параметры:
//  ТекущийВариант - ВариантСтандартногоПериода.
// 
// Возвращаемое значение:
//  Строка.
// 
Функция ИмяВариантаСтандартногоПериода(ТекущийВариант) Экспорт
	
	ИмяВарианта = "ПроизвольныйПериод";
	
	Имена = Новый Структура;
	Имена.Вставить("Вчера");
	Имена.Вставить("ДоКонцаЭтогоГода");
	Имена.Вставить("ДоКонцаЭтогоКвартала");
	Имена.Вставить("ДоКонцаЭтогоМесяца");
	Имена.Вставить("ДоКонцаЭтогоПолугодия");
	Имена.Вставить("ДоКонцаЭтойДекады");
	Имена.Вставить("ДоКонцаЭтойНедели");
	Имена.Вставить("Завтра");
	Имена.Вставить("Месяц");
	Имена.Вставить("Последние7Дней");
	Имена.Вставить("ПроизвольныйПериод");
	Имена.Вставить("ПрошлаяДекада");
	Имена.Вставить("ПрошлаяДекадаДоТакогоЖеНомераДня");
	Имена.Вставить("ПрошлаяНеделя");
	Имена.Вставить("ПрошлаяНеделяДоТакогоЖеДняНедели");
	Имена.Вставить("ПрошлоеПолугодие");
	Имена.Вставить("ПрошлоеПолугодиеДоТакойЖеДаты");
	Имена.Вставить("ПрошлыйГод");
	Имена.Вставить("ПрошлыйГодДоТакойЖеДаты");
	Имена.Вставить("ПрошлыйКвартал");
	Имена.Вставить("ПрошлыйКварталДоТакойЖеДаты");
	Имена.Вставить("ПрошлыйМесяц");
	Имена.Вставить("ПрошлыйМесяцДоТакойЖеДаты");
	Имена.Вставить("Сегодня");
	Имена.Вставить("СледующаяДекада");
	Имена.Вставить("СледующаяДекадаДоТакогоЖеНомераДня");
	Имена.Вставить("СледующаяНеделя");
	Имена.Вставить("СледующаяНеделяДоТакогоЖеДняНедели");
	Имена.Вставить("СледующееПолугодие");
	Имена.Вставить("СледующееПолугодиеДоТакойЖеДаты");
	Имена.Вставить("Следующие7Дней");
	Имена.Вставить("СледующийГод");
	Имена.Вставить("СледующийГодДоТакойЖеДаты");
	Имена.Вставить("СледующийКвартал");
	Имена.Вставить("СледующийКварталДоТакойЖеДаты");
	Имена.Вставить("СледующийМесяц");
	Имена.Вставить("СледующийМесяцДоТакойЖеДаты");
	Имена.Вставить("СНачалаЭтогоГода");
	Имена.Вставить("СНачалаЭтогоКвартала");
	Имена.Вставить("СНачалаЭтогоМесяца");
	Имена.Вставить("СНачалаЭтогоПолугодия");
	Имена.Вставить("СНачалаЭтойДекады");
	Имена.Вставить("СНачалаЭтойНедели");
	Имена.Вставить("ЭтаДекада");
	Имена.Вставить("ЭтаНеделя");
	Имена.Вставить("ЭтоПолугодие");
	Имена.Вставить("ЭтотГод");
	Имена.Вставить("ЭтотКвартал");
	Имена.Вставить("ЭтотМесяц");
	
	Для каждого КиЗ Из Имена Цикл
		
		Если ТекущийВариант = ВариантСтандартногоПериода[КиЗ.Ключ] Тогда
			ИмяВарианта = КиЗ.Ключ;
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат ИмяВарианта;
	
КонецФункции // ИмяВариантаСтандартногоПериода()

// Функция определяет формат для строки правил. Первый приоритет настройка формата из строки,
// далее из шапки, если формат не задан, то Число(15,2).
// 
// Параметры:
//  СтрокаПравил - СтрокаТабличнойЧасти.ПравилаЗаполнения.
//  ФорматЧисел  - Строка - Формат поумолчанию.
//  КодСтраны    - Строка.
// 
// Возвращаемое значение:
//  Строка.
// 
Функция ОпределитьФорматПоСтрокеПравил(СтрокаПравил,ФорматЧисел,КодСтраны) Экспорт
	
	// Определим, какую настройку формата применять.
	Если НЕ ПустаяСтрока(СтрокаПравил.ФорматЧисел) Тогда
		
		СтрФормат = СтрокаПравил.ФорматЧисел;
		
	Иначе	
		
		Если НЕ ПустаяСтрока(ФорматЧисел) Тогда			
			СтрФормат = ФорматЧисел;			
		Иначе			
			СтрФормат = "ЧЦ=15; ЧДЦ=2";			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// Если язык не установлен установки из шапки отчета.
	Если Найти(СтрокаПравил.ФорматЧисел, "Л=") = 0 Тогда		
		СтрФормат = "Л=" + КодСтраны + ";" + СтрФормат;	
	КонецЕсли; 
	
	Возврат СтрФормат;
	
КонецФункции // ОпределитьФорматПоСтрокеПравил()

// АПК:142-выкл Количество необязательных параметров более 3 для совместимости с предыдущими версиями библиотеки.

// Функция проверяет, правильно ли задан интервал дат.
// 
// Параметры:
//  ДатаНачала           - Дата.
//  ДатаОкончания        - Дата.
//  СинонимДатаНачала    - Строка (По умолчанию = "Дата начала").
//  СинонимДатаОкончания - Строка (По умолчанию = "Дата окончания").
//  Режим                - Строка.
//  ВыводитьСообщения    - Булево.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ВременнойИнтервалКорректный(ДатаНачала
	                                , ДатаОкончания
									, СинонимДатаНачала = Неопределено
									, СинонимДатаОкончания = Неопределено
									, Режим = ""
									, ВыводитьСообщения =  Истина) Экспорт
	
	РезультатПроверки = Истина;
	ТекстОшибок = "";
	
	Если СинонимДатаНачала = Неопределено Тогда
		СинонимДатаНачала = НСтр("ru='Дата начала периода';en='Period start date'");	
	КонецЕсли;
	Если СинонимДатаОкончания = Неопределено Тогда
		СинонимДатаОкончания = НСтр("ru='даты конца периода';en='the date of the end of the period'");	
	КонецЕсли;
	
	ПроверятьДатуОкончания = ДатаОкончания <> '00010101000000';
	
	Если ПроверятьДатуОкончания 
		И ДатаОкончания < ДатаНачала Тогда
		
		РезультатПроверки = Ложь;
		ТекстОшибок = НСтр("ru='%1 не может быть больше %2';en='%1 can not be more than %2'");
		ТекстОшибок = СтрШаблон(ТекстОшибок, СинонимДатаНачала, СинонимДатаОкончания); 
	КонецЕсли; 
	
	Если НЕ РезультатПроверки И ВыводитьСообщения Тогда		
		ВывестиСообщение(ТекстОшибок); 		
	КонецЕсли; 
	
	Возврат РезультатПроверки;
	
КонецФункции // ВременнойИнтервалКорректный()

// АПК:142-вкл

// Процедура управляет состояние поля табличного документа.
// 
// Параметры:
//  ПолеТабличногоДокумента - ПолеФормы - поле формы с видом ПолеТабличногоДокумента,
//                            для которого необходимо установить состояние.
//  Состояние               - Строка - задает вид состояния.
// 
Процедура УстановитьСостояниеПоляТабличногоДокумента(ПолеТабличногоДокумента, Состояние = "НеИспользовать") Экспорт
	
	Если ТипЗнч(ПолеТабличногоДокумента) = Тип("ПолеФормы") 
		И ПолеТабличногоДокумента.Вид = ВидПоляФормы.ПолеТабличногоДокумента Тогда
		ОтображениеСостояния = ПолеТабличногоДокумента.ОтображениеСостояния;
		Если ВРег(Состояние) = "НЕИСПОЛЬЗОВАТЬ" Тогда
			ОтображениеСостояния.Видимость                      = Ложь;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
			ОтображениеСостояния.Картинка                       = Новый Картинка;
			ОтображениеСостояния.Текст                          = "";
		ИначеЕсли ВРег(Состояние) = "НЕАКТУАЛЬНОСТЬОТЧЕТА" Тогда
			ОтображениеСостояния.Видимость                      = Истина;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
			ОтображениеСостояния.Картинка                       = Новый Картинка;
			ОтображениеСостояния.Текст                          = НСтр("ru='Отчет не сформирован. Нажмите ""Сформировать"" для получения отчета.';
																	   |en='Report was not generated. Click ""Generate"" to get the report.'");
		ИначеЕсли ВРег(Состояние) = "НЕАКТУАЛЬНОСТЬТАБДОК" Тогда
			ОтображениеСостояния.Видимость                      = Истина;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
			ОтображениеСостояния.Картинка                       = Новый Картинка;
			ОтображениеСостояния.Текст                          = НСтр("ru='Табличный документ не сформирован. Нажмите ""Обновить"".';
																	   |en='Spreadsheet document is not formed. Click on ""Update"".'");
		ИначеЕсли ВРег(Состояние) = "ФОРМИРОВАНИЕОТЧЕТА" Тогда  
			ОтображениеСостояния.Видимость                      = Истина;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
			ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
			ОтображениеСостояния.Текст                          = НСтр("ru='Отчет формируется...';en='Report is being generated ...'");
		Иначе
			ВызватьИсключение(НСтр("ru='Недопустимое значение параметра (параметр №2)';en='Invalid parameter value (parameter №2)'"));
		КонецЕсли;
	Иначе
		ВызватьИсключение(НСтр("ru='Недопустимое значение параметра (параметр №1)';en='Invalid parameter value (parameter №1)'"));
	КонецЕсли;
	
КонецПроцедуры // УстановитьСостояниеПоляТабличногоДокумента()

// Функция разбирает полное имя объекта на ИмяОбъекта и имя "Класса" (Справочник, Документ и т.п.).
// По имени класса определяется ИмяКоллекции.
// 
// Параметры:
//  ИмяОбъектаПолное - Строка.
// 
// Возвращаемое значение:
//  РезСтр - Структура("ИмяКоллекции,ИмяКласса,ИмяОбъекта").
// 
Функция РазобратьПолноеИмяОбъекта(ИмяОбъектаПолное) Экспорт

	РезСтр = Новый Структура("ИмяКоллекции,ИмяКласса,ИмяОбъекта","","","");
	
	ПозицияТочки = Найти(ИмяОбъектаПолное,".");
	
	Если ПозицияТочки >0 Тогда
			
		
	  РезСтр.ИмяКласса        = Лев(ИмяОбъектаПолное,ПозицияТочки-1);
	  РезСтр.ИмяОбъекта       = Сред(ИмяОбъектаПолное,ПозицияТочки+1);
	  
	  ИмяКоллекции = ПолучитьИмяКоллекции(РезСтр.ИмяКласса);
	  
	  Если ТипЗнч(ИмяКоллекции) = Тип("Строка") Тогда
	  
	  	  РезСтр.ИмяКоллекции = ИмяКоллекции;
	  
	  КонецЕсли; 
	  
	КонецЕсли; 

	Возврат РезСтр;
	
КонецФункции // РазобратьПолноеИмяОбъекта()

// Функция формирует список возможных в системе периодичностей.
// 
// Возвращаемое значение:
//  РезКоллекция - Соответствие, СписокЗначений.
//
// Возвращаемое значение:
//  СписокЗначений.
// 
Функция ПолучитьПериодичности(ТипКоллекции = "СписокЗначений") Экспорт

	Периодичность = Новый Соответствие;
	Периодичность.Вставить(0, "Период");
	Периодичность.Вставить(1, "Запись");
	Периодичность.Вставить(2, "Регистратор");
	Периодичность.Вставить(3, "Секунда");
	Периодичность.Вставить(4, "Минута");
	Периодичность.Вставить(5, "Час");
	Периодичность.Вставить(6, "День");
	Периодичность.Вставить(7, "Неделя");
	Периодичность.Вставить(8, "Декада");
	Периодичность.Вставить(9, "Месяц");
	Периодичность.Вставить(10, "Квартал");
	Периодичность.Вставить(11, "Полугодие");
	Периодичность.Вставить(12, "Год");
	Периодичность.Вставить(13, "Авто");
	
	Если ВРег(ТипКоллекции) = ВРег("СписокЗначений") Тогда
		
		РезКоллекция = Новый СписокЗначений;
		
		Для каждого КиЗ Из Периодичность Цикл		
			РезКоллекция.Добавить(КиЗ.Ключ, КиЗ.Значение);		
		КонецЦикла; 
		
	Иначе	
		
		РезКоллекция = Периодичность;
		
	КонецЕсли; 
	
	Возврат РезКоллекция;	

КонецФункции // ПолучитьПериодичности()

// Функция определяет, запущена ли база в режиме WEB-клиента.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ЭтоВебКлиент() Экспорт
	
	СтандартныйПрефикс = ПолучитьНавигационнуюСсылкуИнформационнойБазы() + "/";
	ЭтоВебКлиент = Найти(СтандартныйПрефикс, "http://") > 0;
	
	Возврат ЭтоВебКлиент;
	
КонецФункции

// Функция определяет, является ли данный объект объектом БИТ.
//
// Параметры:
//  ИмяОбъекта - Строка.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЭтоОбъектБИТ(ИмяОбъекта) Экспорт

	ОбъектБИТ = ВРЕГ(Лев(ИмяОбъекта, 4)) = ВРЕГ("бит_");
	
	Возврат ОбъектБИТ;
	
КонецФункции

// Функция формирует массив типов по строковому представлению.
// 
// Параметры:
//   СтрТипы     - Строка, Массив.
//   Разделитель - Строка.
// 
// Возвращаемое значение:
//  МассивТипов - Массив(Тип).
// 
Функция ПолучитьТипыИзСтроки(СтрТипы, Разделитель = "/") Экспорт

	Если ТипЗнч(СтрТипы) = Тип("Массив") Тогда		
		МассивСтрок = СтрТипы;		
	Иначе		
		МассивСтрок = РазобратьСтрокуСРазделителями(СтрТипы, Разделитель);		
	КонецЕсли; 
	
	МассивТипов = Новый Массив;
	
	Для каждого ТекСтр Из МассивСтрок Цикл
		
		ИмяТипаСтр = ТекСтр;
		
		Если Найти(ИмяТипаСтр,"Строка(") > 0 Тогда		
			ИмяТипаСтр = "Строка";		
		КонецЕсли; 
		
		Если Найти(ИмяТипаСтр, "Число(") > 0 Тогда		
			ИмяТипаСтр = "Число";		
		КонецЕсли; 
		
		Если Найти(ИмяТипаСтр, "Дата(") > 0 Тогда		
			ИмяТипаСтр = "Дата";		
		КонецЕсли; 
		
		Попытка		
			Если НЕ ИмяТипаСтр = "ДокументСсылка.бит_му_ШаблонДокумента" Тогда
				ТекТип = Тип(ИмяТипаСтр);
				МассивТипов.Добавить(ТекТип);		
			КонецЕсли; 
		Исключение			
           ОбработкаИсключения = НСтр("ru = 'Обработка не требуется'"); 		
		КонецПопытки;
	
	КонецЦикла; 

	Возврат МассивТипов;
	
КонецФункции // ПолучитьТипыИзСтроки()

// Функция создает описание типов по строковому представлению.
// 
// Параметры:
//  СтрТипы        - Строка.
//  Разделитель    - Строка.
//  ТипПоУмолчанию - ОписаниеТипов.
// 
// Возвращаемое значение:
//  Описание - ОписаниеТипов.
// 
Функция ПолучитьОписаниеИзСтроки(СтрТипы, Разделитель = "/", ТипПоУмолчанию = Неопределено ) Экспорт
	
	МассивСтрок = РазобратьСтрокуСРазделителями(СтрТипы, Разделитель);
	
	МассивТипов = ПолучитьТипыИзСтроки(МассивСтрок, Разделитель);
	
	// Определение квалификаторов при необходимости.
	КвалификаторыЧисла  = Неопределено;
	КвалификаторыСтроки = Неопределено;
	КвалификаторыДаты   = Неопределено;
	
	Для каждого СтрТип Из МассивСтрок Цикл
		
		Если Найти(СтрТип,"Строка(") > 0 Тогда
			
		   // Определение квалификаторов строки.	
		   
			ПозНач = Найти(СтрТип,"(");
			ПозКон = Найти(СтрТип,")");
			
			СтрДлина = Сред(СтрТип,ПозНач+1,ПозКон-ПозНач-1);
			
			Попытка			
				Длина = Число(СтрДлина);			
			Исключение				
				Длина = 0;				
			КонецПопытки;
			
			Если Длина > 0  Тогда			
				КвалификаторыСтроки = Новый КвалификаторыСтроки(Длина);			
			КонецЕсли; 
		
		ИначеЕсли Найти(СтрТип, "Дата(") > 0 Тогда
			
		    // Определение квалификаторов даты.			
			
			ПозНач = Найти(СтрТип,"(");
			ПозКон = Найти(СтрТип,")");
			
			СоставДаты = Сред(СтрТип,ПозНач+1,ПозКон-ПозНач-1);
			
			Если СоставДаты = "Дата" Тогда				
				КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);				
			ИначеЕсли СоставДаты = "Время" Тогда				
				КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Время);				
			Иначе
				
				КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);				
			КонецЕсли; 
		
		ИначеЕсли Найти(СтрТип, "Число(") > 0 Тогда
			
		    // Определение квалификаторов числа.
		
			ПозНач = Найти(СтрТип,"(");
			ПозКон = Найти(СтрТип,")");
			
			СтрПараметры = Сред(СтрТип,ПозНач+1,ПозКон-ПозНач-1);

			ПозНач = Найти(СтрПараметры,",");
			
			СтрДлина = Лев(СтрПараметры, ПозНач-1);
			СтрТочность = Сред(СтрПараметры, ПозНач+1);
			
			Попытка			
				Длина = Число(СтрДлина);			
			Исключение				
				Длина = 0;				
			КонецПопытки;
			
			Попытка			
				Точность = Число(СтрТочность);			
			Исключение				
				Точность = 0;				
			КонецПопытки;
			
			Если Длина > 0 Тогда			
				КвалификаторыЧисла = Новый КвалификаторыЧисла(Длина, Точность);			
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; // МассивСтрок.	
	
	Описание = Новый ОписаниеТипов(МассивТипов, КвалификаторыЧисла, КвалификаторыСтроки, КвалификаторыДаты);	
	Если НЕ ЗначениеЗаполнено(Описание) И ЗначениеЗаполнено(ТипПоУмолчанию) Тогда
	
		Описание = ТипПоУмолчанию;
	
	КонецЕсли; 	
	
	Возврат Описание;
	
КонецФункции // ПолучитьОписаниеИзСтроки()

// Функция определяет принадлежит ли тип переданного значения к примитивным типам.
// 
// Параметры:
// 	ТекущееЗначение - любое значение, ТипЗначение.
// 
// Возвращаемое значение:
// 	Булево.
// 
Функция ЭтоПримитивныйТип(ТекущееЗначение) Экспорт
	
	ПримитивныйТип = Ложь;
	
	Если ТипЗнч(ТекущееЗначение) = Тип("Тип") Тогда
		
		Если ТекущееЗначение = Тип("Строка") 
			 ИЛИ ТекущееЗначение = Тип("Число") 
			 ИЛИ ТекущееЗначение = Тип("Дата") 
			 ИЛИ ТекущееЗначение = Тип("Булево") 
			 ИЛИ ТекущееЗначение = Тип("ХранилищеЗначения") 
			 ИЛИ ТекущееЗначение = Тип("NULL") 
			 ИЛИ ТекущееЗначение = Тип("Неопределено") Тогда
		
			ПримитивныйТип = Истина;
		
		КонецЕсли; 
		
	Иначе	
		
		Если ТипЗнч(ТекущееЗначение) = Тип("Строка") 
			ИЛИ ТипЗнч(ТекущееЗначение) = Тип("Число")
			ИЛИ ТипЗнч(ТекущееЗначение) = Тип("Дата")
			ИЛИ ТипЗнч(ТекущееЗначение) = Тип("Булево")
			ИЛИ ТипЗнч(ТекущееЗначение) = Тип("ХранилищеЗначения")		 		 
			ИЛИ ТекущееЗначение = Неопределено
			ИЛИ ТекущееЗначение = NULL Тогда
			
			ПримитивныйТип = Истина;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ПримитивныйТип;
	
КонецФункции // ЭтоПримитивныйТип()

// Функция создает ключ пригодный для структуры из уникального идентификатора.
// 
// Параметры:
//  ИД - УникальныйИдентификатор, Строка.
// 
// Возвращаемое значение:
//  Строка.
// 
Функция КлючСтруктурыИзИД(ИД) Экспорт

	Если ТипЗнч(ИД) = Тип("Строка") Тогда
		
		СтрИД = ИД;
		
	Иначе	
		
		СтрИД = Строка(ИД);
		
	КонецЕсли; 
	
	Ключ = "_" + СтрЗаменить(СтрИД, "-", "_");

	Возврат Ключ;
	
КонецФункции // КлючСтруктурыИзИД()
 
// Функция проверяет является ли переданный параметр структурой с заданным именем.
// 
// Параметры:
//  вхПараметр - Произвольный.
//  Имя        - Строка.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПроверитьИмяКласса(вхПараметр, Имя) Экспорт
	
	флОК = Ложь;
	
	Если ТипЗнч(вхПараметр) = Тип("Структура") 
		 И вхПараметр.Свойство("ИмяКласса") 
		 И вхПараметр.ИмяКласса = Имя Тогда
		
		флОК = Истина;
		
	КонецЕсли; 
	
	Возврат флОК;
	
КонецФункции // ПроверитьИмяКласса()

// Функция проверяет соответсвует ли тип элемента указанному типу.
// 
// Параметры:
//  ТипЭлемента - Тип.
//  СтрокаТипа  - Строка.
//  
// Возвращаемое значение:
//   Булево.
// 
Функция ЭтоУказанныйТип(ТипЭлемента, СтрокаТипа) Экспорт

	Результат = Ложь;
	
	Попытка
		Результат = ТипЭлемента = Тип(СтрокаТипа);	
	Исключение	
		ОбработкаИсключения = НСтр("ru = 'Обработка не требуется'");
	КонецПопытки; 	

	Возврат Результат;
	
КонецФункции // ЭтоУказанныйТип()

// Выполняет разложение на отдельные слова по заглавным буквам.
//
// Параметры:
//	ИсходнаяСтрока - Строка.
//
// Возвращаемое значение:
//	Строка - Строка разбитая на отдельные слова.
// 
Функция РазбитьНаОтдельныеСлова(ИсходнаяСтрока) Экспорт
	
	ИтоговаяСтрока = ВРег(Лев(ИсходнаяСтрока, 1));
	Для Сч = 2 По СтрДлина(ИсходнаяСтрока) Цикл
		ТекущийСимвол = Сред(ИсходнаяСтрока, Сч, 1); 
		Если ТекущийСимвол = ВРег(ТекущийСимвол) Тогда
			// Заглавная буква.
			ИтоговаяСтрока = ИтоговаяСтрока + " " + НРег(ТекущийСимвол);
		Иначе
			ИтоговаяСтрока = ИтоговаяСтрока + ТекущийСимвол;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИтоговаяСтрока;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДатаСеанса()

	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		ДатаСеанса = ТекущаяДатаСеанса();
	#Иначе
		ДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	#КонецЕсли 

	Возврат ДатаСеанса;
	
КонецФункции

// Функция вычисляет номер декады в месяце.
// 
// Параметры:
//  ТекущаяДата  - Дата
// 
// Возвращаемое значение:
//   НомерДекады   - Число.
// 
Функция НомерДекады(ТекущаяДата)

	НомерДня = День(ТекущаяДата);
	Если НомерДня <= 10 Тогда
		НомерДекады = 1;
	ИначеЕсли НомерДня <= 20 Тогда
	 	НомерДекады = 2;
	Иначе
	 	НомерДекады = 3;
	КонецЕсли; 

	Возврат НомерДекады;

КонецФункции

// Функция получает имя коллекции по имени класса объекта.
// 
// Параметры:
//   ИмяКласса - Строка.
// 
// Возвращаемое значение:
//  Строка.
// 
Функция ПолучитьИмяКоллекции(ИмяКласса)

	ИмяКоллекции = "";
	
	Если ИмяКласса = "Справочник" Тогда
	
		ИмяКоллекции = "Справочники";
		
	ИначеЕсли ИмяКласса = "Документ" Тогда 
		
		ИмяКоллекции = "Документы";
		
	ИначеЕсли ИмяКласса = "ЖурналДокументов" Тогда 
		
		ИмяКоллекции = "ЖурналыДокументов";
	
	ИначеЕсли ИмяКласса = "Перечисление" Тогда 
		
		ИмяКоллекции = "Перечисления";
	
	ИначеЕсли ИмяКласса = "Отчет" Тогда 
		
		ИмяКоллекции = "Отчеты";
	
	ИначеЕсли ИмяКласса = "Обработка" Тогда 
		
		ИмяКоллекции = "Обработки";
	
	ИначеЕсли ИмяКласса = "ПланВидовХарактеристик" Тогда 
		
		ИмяКоллекции = "ПланыВидовХарактеристик";
	
	ИначеЕсли ИмяКласса = "ПланСчетов" Тогда 
		
		ИмяКоллекции = "ПланыСчетов";
	
	ИначеЕсли ИмяКласса = "ПланВидовРасчета" Тогда 
		
		ИмяКоллекции = "ПланыВидовРасчета";
	
	ИначеЕсли ИмяКласса = "РегистрСведений" Тогда 
		
		ИмяКоллекции = "РегистрыСведений";
	
	ИначеЕсли ИмяКласса = "РегистрНакопления" Тогда 
		
		ИмяКоллекции = "РегистрыНакопления";
	
	ИначеЕсли ИмяКласса = "РегистрБухгалтерии" Тогда 
		
		ИмяКоллекции = "РегистрыБухгалтерии";
	
	ИначеЕсли ИмяКласса = "РегистрРасчета" Тогда 
		
		ИмяКоллекции = "РегистрыРасчета";
	
	ИначеЕсли ИмяКласса = "БизнесПроцесс" Тогда 
		
		ИмяКоллекции = "БизнесПроцессы";
		
	ИначеЕсли ИмяКласса = "Задача" Тогда 
		
		ИмяКоллекции = "Задачи";		
		
	КонецЕсли; 

	Возврат ИмяКоллекции;
	
КонецФункции // ПолучитьИмяКоллекции()

#КонецОбласти 