
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_КлючиСценарийЦФО.Ссылка КАК КлючСценарийЦФО
	|ИЗ
	|	Справочник.бит_КлючиСценарийЦФО КАК бит_КлючиСценарийЦФО
	|ГДЕ
	|	бит_КлючиСценарийЦФО.ГруппаЗапретаИзменения = &ГруппаЗапрета";
	
	Запрос.УстановитьПараметр("ГруппаЗапрета", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	СоставГруппы.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СписокКлючей = СоставГруппы.Выгрузить().ВыгрузитьКолонку("КлючСценарийЦФО");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаЗапрета", Объект.Ссылка);
	Запрос.УстановитьПараметр("СписокКлючей",  СписокКлючей);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ключи.Ссылка КАК КлючСсылка,
	|	ВЫБОР
	|		КОГДА НЕ Ключи.ГруппаЗапретаИзменения = &ГруппаЗапрета
	|			ТОГДА &ГруппаЗапрета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.бит_ГруппыЗапретаИзмененияДанныхБюджетирования.ПустаяСсылка)
	|	КОНЕЦ КАК ГруппаЗапрета
	|ИЗ
	|	Справочник.бит_КлючиСценарийЦФО КАК Ключи
	|ГДЕ
	|	(Ключи.Ссылка В (&СписокКлючей)
	|				И НЕ Ключи.ГруппаЗапретаИзменения = &ГруппаЗапрета
	|			ИЛИ НЕ Ключи.Ссылка В (&СписокКлючей)
	|				И Ключи.ГруппаЗапретаИзменения = &ГруппаЗапрета)
	|	И НЕ Ключи.ЭтоГруппа";

	КлючСсылка = Справочники.бит_КлючиСценарийЦФО.ПустаяСсылка();
	НачатьТранзакцию();
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			КлючСсылка = Выборка.КлючСсылка;
			КлючОбъект = КлючСсылка.ПолучитьОбъект();
			КлючОбъект.ГруппаЗапретаИзменения = Выборка.ГруппаЗапрета;
			КлючОбъект.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ШаблонСообщения = НСтр("ru = 'Не удалось обновить элемент справочника.
                                |%1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Установка группы запрета изменения'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.бит_КлючиСценарийЦФО,
			КлючСсылка, 
			ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		// Поиск перебором, что бы не делать неявный серверный вызов.
		Для каждого ЭлементВыбора Из ВыбранноеЗначение Цикл
			НоваяЗапись = Истина;
			Для каждого СтрокаТаблицы Из СоставГруппы Цикл
				Если СтрокаТаблицы.КлючСценарийЦФО = ЭлементВыбора Тогда
					НоваяЗапись = Ложь;
					Прервать;	
				КонецЕсли;
			КонецЦикла;
			
			Если НоваяЗапись Тогда
				СтрокаТаблицы = СоставГруппы.Добавить();
				СтрокаТаблицы.КлючСценарийЦФО = ЭлементВыбора;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь); 
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина); 
	
	ТекущиеДанные = Элементы.СоставГруппы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.КлючСценарийЦФО) Тогда
		ПараметрыФормы.Вставить("ТекущаяСтрока", ТекущиеДанные.КлючСценарийЦФО);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.бит_КлючиСценарийЦФО.ФормаВыбора", ПараметрыФормы, 
		ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти