#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Функция определяет новый статус объекта.
// Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_ФормаВводаБюджета.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_СтатусыОбъектов - новый статус объекта.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Возврат бит_ВизированиеСервер.НовыйСтатусПоСтандартномуАлгоритму(ТекущийОбъект, ПараметрыУстановкиСтатуса);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает структуру параметров документа,
// ответ на запрос налогового мониторинга.
//
// Параметры:
//  ОтветНаЗапросСсылка  - ДокументСсылка - ссылка на документ "бит_ОтветНаЗапросНалоговогоМониторинга".
//
// Возвращаемое значение:
//   Структура   - структура реквизитов.
//
Функция РеквизитыОтветаНаЗапрос(ОтветНаЗапросСсылка) Экспорт

	Если ЗначениеЗаполнено(ОтветНаЗапросСсылка) Тогда
		
		РеквизитыДокумента = Новый Структура(
			"ОтветНаЗапрос, Проведен, КраткоеПредставление",
			ОтветНаЗапросСсылка, Ложь, "");
			
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтветНаЗапросСсылка,
				"Проведен, Номер, Дата");
			
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ЗначенияРеквизитов);
		
		КраткоеПредставление = НСтр("ru = '%1 от %2'; en = '%1 from %2'");
		КраткоеПредставление = СтрШаблон(КраткоеПредставление, ЗначенияРеквизитов.Номер, ЗначенияРеквизитов.Дата);
		
        РеквизитыДокумента.КраткоеПредставление = КраткоеПредставление;	
		
	Иначе
		РеквизитыДокумента = Неопределено;
	КонецЕсли;
	
	Возврат РеквизитыДокумента;

КонецФункции

#КонецОбласти

#КонецЕсли