#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Функция - получает настройки статьи оборотов.
//
// Параметры:
//  СтатьяОборотов	 - СправочникСсылка.бит_СтатьиОборотов - статья.
// 
// Возвращаемое значение:
//  Настройки - Структура.
//
Функция ПолучитьНастройки(СтатьяОборотов) Экспорт
	
	Настройки = НовыеНастройкиСтатьи();
	
	Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", СтатьяОборотов);
		Запрос.Текст =  
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
		|ГДЕ
		|	бит_СтатьиОборотов.Ссылка = &Ссылка";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Настройки, Выборка);
			
			НастройкиИзмерений = бит_Бюджетирование.НастройкиИзмеренийБюджетирования();
			КэшПровеки         = Новый Соответствие;
			
			Для каждого КиЗ Из НастройкиИзмерений Цикл
				
				ИмяАналитики 	   = КиЗ.Ключ;
				НастройкиАналитики = НовыеНастройкиАналитики(ИмяАналитики);
				
				НастройкиАналитики.Учет 		= ЗначениеИзВыборки("Учет_" + ИмяАналитики, Ложь, Результат, Выборка, КэшПровеки);
				НастройкиАналитики.Обязательный = ЗначениеИзВыборки("Обязательный_" + ИмяАналитики, Ложь, Результат, Выборка,
													КэшПровеки);
				ИмяТипаПоУмолчанию 		        = ЗначениеИзВыборки("ИмяТипаПоУмолчанию_" + ИмяАналитики, "", Результат, Выборка,
													КэшПровеки);
				
				Если ПустаяСтрока(ИмяТипаПоУмолчанию) Тогда
					ИмяТипа   = Новый Массив(); 
					Настройка = КиЗ.Значение;
					Если ТипЗнч(Настройка) = Тип("Структура") И Настройка.ЗначениеПоУмолчанию <> Неопределено Тогда
						ИмяТипа.Добавить(ТипЗнч(Настройка.ЗначениеПоУмолчанию));
					КонецЕсли; 
				Иначе					
					ИмяТипа = СтрЗаменить(НастройкиАналитики.ИмяТипаПоУмолчанию,".","Ссылка.");
				КонецЕсли; 
				
				НастройкиАналитики.ИмяТипаПоУмолчанию = ИмяТипаПоУмолчанию;
				НастройкиАналитики.ТипПоУмолчанию 	= Новый ОписаниеТипов(ИмяТипа);
				
				Настройки.Измерения.Вставить(ИмяАналитики, НастройкиАналитики);
				
			КонецЦикла; // по измерениям
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Настройки;
	
КонецФункции

// Получает настройки статей оборотов.
//
// Параметры:
//  СтатьиОборотов - Массив.
// 
// Возвращаемое значение:
//  Соответствие.
//
Функция НастройкиСтатейОборотов(СтатьиОборотов) Экспорт
	
	НастройкиСтатей = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатьиОборотов", СтатьиОборотов);
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|ГДЕ
	|	СтатьиОборотов.Ссылка В (&СтатьиОборотов)";
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	НастройкиИзмерений = бит_Бюджетирование.НастройкиИзмеренийБюджетирования();
	КэшПровеки         = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		НастройкаСтатьи = НовыеНастройкиСтатьи();
		ЗаполнитьЗначенияСвойств(НастройкаСтатьи, Выборка);
		
		Для каждого КиЗ Из НастройкиИзмерений Цикл
			ИмяАналитики 	   = КиЗ.Ключ;
			НастройкиАналитики = НовыеНастройкиАналитики(ИмяАналитики);
			
			НастройкиАналитики.Учет 		= ЗначениеИзВыборки("Учет_" + ИмяАналитики, Ложь, Результат, Выборка, КэшПровеки);
			НастройкиАналитики.Обязательный = ЗначениеИзВыборки("Обязательный_" + ИмяАналитики, Ложь, Результат, Выборка,
																КэшПровеки);
			ИмяТипаПоУмолчанию 		        = ЗначениеИзВыборки("ИмяТипаПоУмолчанию_" + ИмяАналитики, "", Результат, Выборка,
																КэшПровеки);
			
			Если ПустаяСтрока(ИмяТипаПоУмолчанию) Тогда
				ИмяТипа   = Новый Массив(); 
				Настройка = КиЗ.Значение;
				Если ТипЗнч(Настройка) = Тип("Структура") И Настройка.ЗначениеПоУмолчанию <> Неопределено Тогда
					ИмяТипа.Добавить(ТипЗнч(Настройка.ЗначениеПоУмолчанию));
				КонецЕсли; 
			Иначе					
				ИмяТипа = СтрЗаменить(НастройкиАналитики.ИмяТипаПоУмолчанию,".","Ссылка.");
			КонецЕсли; 
			
			НастройкиАналитики.ИмяТипаПоУмолчанию = ИмяТипаПоУмолчанию;
			НастройкиАналитики.ТипПоУмолчанию 	  = Новый ОписаниеТипов(ИмяТипа);
			
			НастройкаСтатьи.Измерения.Вставить(ИмяАналитики, НастройкиАналитики);
		КонецЦикла;
		
		НастройкиСтатей.Вставить(Выборка.Ссылка, НастройкаСтатьи);
	КонецЦикла;
	
	Возврат НастройкиСтатей;
	
КонецФункции
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти = Неопределено) Экспорт
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	// ++ ЕРП 
   	НайтиСоздатьСтавкиНДС();

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "КурсовыеРазницыБДРОтрицательные";
	Элемент.Наименование						= НСтр("ru = 'Курсовые разницы БДР (отрицательные)';
														|en = ' P&L exchange rate differences (negative)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000018";
	Элемент.НаименованиеПолное 					= НСтр("ru = 'Курсовые разницы БДР (отрицательные)';
														|en = 'P&L exchange rate differences (negative)'", КодОсновногоЯзыка);
	Элемент.ВидСтатьи							= Справочники.бит_ВидыСтатейОборотов.КурсовыеРазницы;
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДР;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Расходование;
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.СтавкаНДС							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.БезНДС);
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "КурсовыеРазницыБДРПоложительные";
	Элемент.Наименование						= НСтр("ru = 'Курсовые разницы БДР (положительные)';
														|en = 'P&L exchange rate differences (positive)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000019";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Курсовые разницы БДР (положительные)';
														|en = 'P&L exchange rate differences (positive)'", КодОсновногоЯзыка);
	Элемент.ВидСтатьи							= Справочники.бит_ВидыСтатейОборотов.КурсовыеРазницы;
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДР;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Поступление;
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.СтавкаНДС							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.БезНДС);
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "ВнутренняяПередачаДС_поступление";
	Элемент.Наименование						= НСтр("ru = 'Внутренняя передача ДС (поступление)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000013";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Внутренняя передача ДС (поступление)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Поступление;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "ВнутренняяПередачаДС_расходование";
	Элемент.Наименование						= НСтр("ru = 'Внутренняя передача ДС (расходование)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000012";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Внутренняя передача ДС (расходование)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Расходование;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "ВыдачаДенежныхСредствВДругуюКассу";
	Элемент.Наименование						= НСтр("ru = 'Выдача денежных средств в другую кассу'", КодОсновногоЯзыка);
	Элемент.Код									= "000000004";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Выдача денежных средств в другую кассу'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Расходование;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты 			= Ложь;
	Элемент.НеКонтролировать_Графики 			= Ложь;
	Элемент.Учет_Аналитика_1 					= Ложь;
	Элемент.Обязательный_Аналитика_1 			= Ложь;
	Элемент.Учет_Аналитика_2 					= Ложь;
	Элемент.Обязательный_Аналитика_2 			= Ложь;
	Элемент.Учет_Аналитика_3 					= Ложь;
	Элемент.Обязательный_Аналитика_3 			= Ложь;
	Элемент.Учет_Аналитика_4 					= Ложь;
	Элемент.Обязательный_Аналитика_4 			= Ложь;
	Элемент.Учет_Аналитика_5 					= Ложь;
	Элемент.Обязательный_Аналитика_5 			= Ложь;
	Элемент.Учет_Аналитика_6 					= Ложь;
	Элемент.Обязательный_Аналитика_6 			= Ложь;
	Элемент.Учет_Аналитика_7 					= Ложь;
	Элемент.Обязательный_Аналитика_7 			= Ложь;
	Элемент.Учет_Аналитика_8 					= Ложь;
	Элемент.Обязательный_Аналитика_8 			= Ложь;
	Элемент.Учет_Аналитика_9 					= Ложь;
	Элемент.Обязательный_Аналитика_9 			= Ложь;
	Элемент.Учет_Аналитика_10 					= Ложь;
	Элемент.Обязательный_Аналитика_10 			= Ложь;
	Элемент.Учет_Аналитика_11 					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "КонвертацияВалюты_Поступление";
	Элемент.Наименование						= НСтр("ru = 'Конвертация валюты (поступление)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000011";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Конвертация валюты (поступление)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Поступление;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.БезНДС);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "КонвертацияВалюты_Списание";
	Элемент.Наименование						= НСтр("ru = 'Конвертация валюты (списание)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000010";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Конвертация валюты (списание)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Расходование;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.БезНДС);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "КурсовыеРазницыДСОтрицательные";
	Элемент.Наименование						= НСтр("ru = 'Курсовые разницы ДС (отрицательные)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000017";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Курсовые разницы ДС (отрицательные)'", КодОсновногоЯзыка);
	Элемент.ВидСтатьи							= Справочники.бит_ВидыСтатейОборотов.КурсовыеРазницы;
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Расходование;
	Элемент.СтавкаНДС							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.БезНДС);
	Элемент.РазрешитьПроводитьБезЗаявки 		= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество 		= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "КурсовыеРазницыДСПоложительные";
	Элемент.Наименование						= НСтр("ru = 'Курсовые разницы ДС (положительные)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000016";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Курсовые разницы ДС (положительные)'", КодОсновногоЯзыка);
	Элемент.ВидСтатьи							= Справочники.бит_ВидыСтатейОборотов.КурсовыеРазницы;
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Поступление;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.БезНДС);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "ОплатаВДругуюОрганизацию_Поступление";
	Элемент.Наименование						= НСтр("ru = 'Оплата в другую организацию (поступление)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000015";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Оплата в другую организацию (поступление)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Поступление;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "ОплатаВДругуюОрганизацию_Расходование";
	Элемент.Наименование						= НСтр("ru = 'Оплата в другую организацию (расходование)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000014";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Оплата в другую организацию (расходование)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Расходование;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "ПеречислениеДенежныхСредствНаДругойСчет_поступление";
	Элемент.Наименование						= НСтр("ru = 'Перечисление денежных средств на другой счет (поступление)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000002";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Перечисление денежных средств на другой счет (поступление)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Поступление;
	Элемент.СтавкаНДС							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты 			= Ложь;
	Элемент.НеКонтролировать_Графики 			= Ложь;
	Элемент.Учет_Аналитика_1 					= Ложь;
	Элемент.Обязательный_Аналитика_1 			= Ложь;
	Элемент.Учет_Аналитика_2 					= Ложь;
	Элемент.Обязательный_Аналитика_2 			= Ложь;
	Элемент.Учет_Аналитика_3 					= Ложь;
	Элемент.Обязательный_Аналитика_3 			= Ложь;
	Элемент.Учет_Аналитика_4 					= Ложь;
	Элемент.Обязательный_Аналитика_4 			= Ложь;
	Элемент.Учет_Аналитика_5 					= Ложь;
	Элемент.Обязательный_Аналитика_5 			= Ложь;
	Элемент.Учет_Аналитика_6 					= Ложь;
	Элемент.Обязательный_Аналитика_6 			= Ложь;
	Элемент.Учет_Аналитика_7 					= Ложь;
	Элемент.Обязательный_Аналитика_7 			= Ложь;
	Элемент.Учет_Аналитика_8 					= Ложь;
	Элемент.Обязательный_Аналитика_8 			= Ложь;
	Элемент.Учет_Аналитика_9 					= Ложь;
	Элемент.Обязательный_Аналитика_9 			= Ложь;
	Элемент.Учет_Аналитика_10 					= Ложь;
	Элемент.Обязательный_Аналитика_10 			= Ложь;
	Элемент.Учет_Аналитика_11 					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "ПеречислениеДенежныхСредствНаДругойСчет_расходование";
	Элемент.Наименование						= НСтр("ru = 'Перечисление денежных средств на другой счет (расходование)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000001";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Перечисление денежных средств на другой счет (расходование)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Расходование;
	Элемент.СтавкаНДС							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты 			= Ложь;
	Элемент.НеКонтролировать_Графики 			= Ложь;
	Элемент.Учет_Аналитика_1 					= Ложь;
	Элемент.Обязательный_Аналитика_1 			= Ложь;
	Элемент.Учет_Аналитика_2 					= Ложь;
	Элемент.Обязательный_Аналитика_2 			= Ложь;
	Элемент.Учет_Аналитика_3 					= Ложь;
	Элемент.Обязательный_Аналитика_3 			= Ложь;
	Элемент.Учет_Аналитика_4 					= Ложь;
	Элемент.Обязательный_Аналитика_4 			= Ложь;
	Элемент.Учет_Аналитика_5 					= Ложь;
	Элемент.Обязательный_Аналитика_5 			= Ложь;
	Элемент.Учет_Аналитика_6 					= Ложь;
	Элемент.Обязательный_Аналитика_6 			= Ложь;
	Элемент.Учет_Аналитика_7 					= Ложь;
	Элемент.Обязательный_Аналитика_7 			= Ложь;
	Элемент.Учет_Аналитика_8 					= Ложь;
	Элемент.Обязательный_Аналитика_8 			= Ложь;
	Элемент.Учет_Аналитика_9 					= Ложь;
	Элемент.Обязательный_Аналитика_9 			= Ложь;
	Элемент.Учет_Аналитика_10 					= Ложь;
	Элемент.Обязательный_Аналитика_10 			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "ПолучениеОплатыПоДоговорамЭквайринга";
	Элемент.Наименование						= НСтр("ru = 'Получение оплаты по договорам эквайринга'", КодОсновногоЯзыка);
	Элемент.Код									= "000000009";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Получение оплаты по договорам эквайринга'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Поступление;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "ПоступлениеДенежныхСредствИзБанка_ПоступлениеВКассу";
	Элемент.Наименование						= НСтр("ru = 'Поступление денежных средств из банка (поступление в кассу)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000005";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Поступление денежных средств из банка (поступление в кассу)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Поступление;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты 			= Ложь;
	Элемент.НеКонтролировать_Графики 			= Ложь;
	Элемент.Учет_Аналитика_1 					= Ложь;
	Элемент.Обязательный_Аналитика_1 			= Ложь;
	Элемент.Учет_Аналитика_2 					= Ложь;
	Элемент.Обязательный_Аналитика_2 			= Ложь;
	Элемент.Учет_Аналитика_3 					= Ложь;
	Элемент.Обязательный_Аналитика_3 			= Ложь;
	Элемент.Учет_Аналитика_4 					= Ложь;
	Элемент.Обязательный_Аналитика_4 			= Ложь;
	Элемент.Учет_Аналитика_5 					= Ложь;
	Элемент.Обязательный_Аналитика_5 			= Ложь;
	Элемент.Учет_Аналитика_6 					= Ложь;
	Элемент.Обязательный_Аналитика_6 			= Ложь;
	Элемент.Учет_Аналитика_7 					= Ложь;
	Элемент.Обязательный_Аналитика_7 			= Ложь;
	Элемент.Учет_Аналитика_8 					= Ложь;
	Элемент.Обязательный_Аналитика_8 			= Ложь;
	Элемент.Учет_Аналитика_9 					= Ложь;
	Элемент.Обязательный_Аналитика_9 			= Ложь;
	Элемент.Учет_Аналитика_10 					= Ложь;
	Элемент.Обязательный_Аналитика_10 			= Ложь;
	Элемент.Учет_Аналитика_11 					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "ПоступлениеДенежныхСредствИзБанка_РасходПоБанку";
	Элемент.Наименование						= НСтр("ru = 'Поступление денежных средств из банка (расход по банку)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000006";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Поступление денежных средств из банка (расход по банку)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Расходование;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты 			= Ложь;
	Элемент.НеКонтролировать_Графики 			= Ложь;
	Элемент.Учет_Аналитика_1 					= Ложь;
	Элемент.Обязательный_Аналитика_1 			= Ложь;
	Элемент.Учет_Аналитика_2 					= Ложь;
	Элемент.Обязательный_Аналитика_2 			= Ложь;
	Элемент.Учет_Аналитика_3 					= Ложь;
	Элемент.Обязательный_Аналитика_3 			= Ложь;
	Элемент.Учет_Аналитика_4 					= Ложь;
	Элемент.Обязательный_Аналитика_4 			= Ложь;
	Элемент.Учет_Аналитика_5 					= Ложь;
	Элемент.Обязательный_Аналитика_5 			= Ложь;
	Элемент.Учет_Аналитика_6 					= Ложь;
	Элемент.Обязательный_Аналитика_6 			= Ложь;
	Элемент.Учет_Аналитика_7 					= Ложь;
	Элемент.Обязательный_Аналитика_7 			= Ложь;
	Элемент.Учет_Аналитика_8 					= Ложь;
	Элемент.Обязательный_Аналитика_8 			= Ложь;
	Элемент.Учет_Аналитика_9 					= Ложь;
	Элемент.Обязательный_Аналитика_9 			= Ложь;
	Элемент.Учет_Аналитика_10 					= Ложь;
	Элемент.Обязательный_Аналитика_10 			= Ложь;
	Элемент.Учет_Аналитика_11 					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "ПоступлениеДенежныхСредствИзДругойКассы";
	Элемент.Наименование						= НСтр("ru = 'Поступление денежных средств из другой кассы'", КодОсновногоЯзыка);
	Элемент.Код									= "000000003";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Поступление денежных средств из другой кассы'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Поступление;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты 			= Ложь;
	Элемент.НеКонтролировать_Графики 			= Ложь;
	Элемент.Учет_Аналитика_1 					= Ложь;
	Элемент.Обязательный_Аналитика_1 			= Ложь;
	Элемент.Учет_Аналитика_2 					= Ложь;
	Элемент.Обязательный_Аналитика_2 			= Ложь;
	Элемент.Учет_Аналитика_3 					= Ложь;
	Элемент.Обязательный_Аналитика_3 			= Ложь;
	Элемент.Учет_Аналитика_4 					= Ложь;
	Элемент.Обязательный_Аналитика_4 			= Ложь;
	Элемент.Учет_Аналитика_5 					= Ложь;
	Элемент.Обязательный_Аналитика_5 			= Ложь;
	Элемент.Учет_Аналитика_6 					= Ложь;
	Элемент.Обязательный_Аналитика_6 			= Ложь;
	Элемент.Учет_Аналитика_7 					= Ложь;
	Элемент.Обязательный_Аналитика_7 			= Ложь;
	Элемент.Учет_Аналитика_8 					= Ложь;
	Элемент.Обязательный_Аналитика_8 			= Ложь;
	Элемент.Учет_Аналитика_9 					= Ложь;
	Элемент.Обязательный_Аналитика_9 			= Ложь;
	Элемент.Учет_Аналитика_10 					= Ложь;
	Элемент.Обязательный_Аналитика_10 			= Ложь;
	Элемент.Учет_Аналитика_11 					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "СдачаДенежныхСредствВБанк_ПоступлениеВБанк";
	Элемент.Наименование						= НСтр("ru = 'Сдача денежных средств в банк (поступление в банк)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000007";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Сдача денежных средств в банк (поступление в банк)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Поступление;
	Элемент.СтавкаНДС							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1			 		= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2			 		= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных			= "СдачаДенежныхСредствВБанк_РасходованиеПоКассе";
	Элемент.Наименование						= НСтр("ru = 'Сдача денежных средств в банк (расходование по кассе)'", КодОсновногоЯзыка);
	Элемент.Код									= "000000008";
	Элемент.НаименованиеПолное					= НСтр("ru = 'Сдача денежных средств в банк (расходование по кассе)'", КодОсновногоЯзыка);
	Элемент.ТипСтатьи							= Перечисления.бит_ТипыСтатейОборотов.БДДС;
	Элемент.РасходДоход							= Перечисления.бит_РасходДоход.Расходование;
	Элемент.СтавкаНДС 							= бит_СтавкиНДС.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
	Элемент.РазрешитьПроводитьБезЗаявки			= Истина;
	Элемент.Учет_Количество						= Ложь;
	Элемент.Учет_Сумма							= Истина;
	Элемент.ЭтоКоэффициент						= Ложь;
	Элемент.НеКонтролировать_Сумма				= Ложь;
	Элемент.НеКонтролировать_Количество			= Ложь;
	Элемент.НеКонтролировать_Заявки				= Ложь;
	Элемент.НеКонтролировать_Бюджеты			= Ложь;
	Элемент.НеКонтролировать_Графики			= Ложь;
	Элемент.Учет_Аналитика_1					= Ложь;
	Элемент.Обязательный_Аналитика_1			= Ложь;
	Элемент.Учет_Аналитика_2					= Ложь;
	Элемент.Обязательный_Аналитика_2			= Ложь;
	Элемент.Учет_Аналитика_3					= Ложь;
	Элемент.Обязательный_Аналитика_3			= Ложь;
	Элемент.Учет_Аналитика_4					= Ложь;
	Элемент.Обязательный_Аналитика_4			= Ложь;
	Элемент.Учет_Аналитика_5					= Ложь;
	Элемент.Обязательный_Аналитика_5			= Ложь;
	Элемент.Учет_Аналитика_6					= Ложь;
	Элемент.Обязательный_Аналитика_6			= Ложь;
	Элемент.Учет_Аналитика_7					= Ложь;
	Элемент.Обязательный_Аналитика_7			= Ложь;
	Элемент.Учет_Аналитика_8					= Ложь;
	Элемент.Обязательный_Аналитика_8			= Ложь;
	Элемент.Учет_Аналитика_9					= Ложь;
	Элемент.Обязательный_Аналитика_9			= Ложь;
	Элемент.Учет_Аналитика_10					= Ложь;
	Элемент.Обязательный_Аналитика_10			= Ложь;
	Элемент.Учет_Аналитика_11					= Ложь;
	Элемент.Обязательный_Аналитика_11			= Ложь;
	Элемент.Учет_Аналитика_12					= Ложь;
	Элемент.Обязательный_Аналитика_12			= Ложь;
	Элемент.РазрешитьЗаявкиБезВложений			= Ложь;
	Элемент.НеФормироватьПроводкиБюджетирования = Ложь;
	// -- ЕРП 
	
КонецПроцедуры

Процедура СкопироватьШаблоныПроводок(ОбъектКопирования, Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектКопирования", ОбъектКопирования);
	Запрос.УстановитьПараметр("Ссылка", 		   Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Ссылка КАК ОбъектСШаблонами,
	|	ШаблоныПроводок.ШаблонПроводки КАК ШаблонПроводки,
	|	ЛОЖЬ КАК Назначено
	|ИЗ
	|	РегистрСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов КАК ШаблоныПроводок
	|ГДЕ
	|	ШаблоныПроводок.ОбъектСШаблонами = &ОбъектКопирования";	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = РезультатЗапроса.Выбрать();
	
	НаборЗаписей = РегистрыСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектСШаблонами.Установить(Ссылка);
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьШаблоныПроводокСвязаннымСтатьям(ОбъектСШаблонами) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектСШаблонами", ОбъектСШаблонами);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СтатьиОборотов.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ИндивидуальныеНастройки.Назначено, ЛОЖЬ) КАК Назначено,
	|	бит_СтатьиОборотов.ЭтоГруппа КАК ЭтоГруппа
	|ПОМЕСТИТЬ СтатьиОборотов
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НаличиеШаблоновПроводокБюджетирования КАК ИндивидуальныеНастройки
	|		ПО бит_СтатьиОборотов.Ссылка = ИндивидуальныеНастройки.ОбъектСШаблонами
	|ГДЕ
	|	бит_СтатьиОборотов.Ссылка В ИЕРАРХИИ(&ОбъектСШаблонами)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиОборотов.Ссылка КАК Ссылка
	|ИЗ
	|	СтатьиОборотов КАК СтатьиОборотов
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиОборотов.Ссылка КАК Ссылка,
	|	СтатьиОборотов.Назначено КАК Назначено,
	|	СтатьиОборотов.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	СтатьиОборотов КАК СтатьиОборотов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныПроводок.ОбъектСШаблонами КАК ОбъектСШаблонами,
	|	ШаблоныПроводок.ШаблонПроводки КАК ШаблонПроводки
	|ИЗ
	|	РегистрСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов КАК ШаблоныПроводок
	|ГДЕ
	|	ШаблоныПроводок.ОбъектСШаблонами = &ОбъектСШаблонами";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	ИерархияСтатей 	 = РезультатЗапроса[1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
	ПроверкаИерархии = РезультатЗапроса[2].Выгрузить();
	ШаблоныПроводок  = РезультатЗапроса[3].Выгрузить();

	ПроверкаИерархии.Индексы.Добавить("Ссылка");

	// Обход дерева значений без рекурсии.
	Стек = Новый Массив; 
	Для каждого СтрокаТаблицы Из ИерархияСтатей.Строки Цикл
		
		Стек.Добавить(СтрокаТаблицы);
	
		Пока Стек.Количество() > 0 Цикл
			
			ТекущийОбъект = Стек.Получить(Стек.ВГраница());
			Стек.Удалить(Стек.ВГраница());
			
			ПропуститьУзел 		= Ложь;
			ФормироватьПроводки = Ложь;
			РезультатПроверки 	= ПроверкаИерархии.Найти(ТекущийОбъект.Ссылка, "Ссылка");
			
			ФормироватьПроводки = РезультатПроверки <> Неопределено И НЕ РезультатПроверки.Назначено;

			Если РезультатПроверки <> Неопределено Тогда
				ПропуститьУзел = РезультатПроверки.ЭтоГруппа И РезультатПроверки.Назначено И ТекущийОбъект.Ссылка <> ОбъектСШаблонами;
			КонецЕсли;
			
			Если ТекущийОбъект.Ссылка <> ОбъектСШаблонами
			   И ФормироватьПроводки Тогда
				НаборЗаписей = РегистрыСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ОбъектСШаблонами.Установить(ТекущийОбъект.Ссылка);
				Для каждого Запись Из ШаблоныПроводок Цикл
					НоваяСтрока = НаборЗаписей.Добавить();
					НоваяСтрока.ОбъектСШаблонами = ТекущийОбъект.Ссылка;
					НоваяСтрока.ШаблонПроводки 	 = Запись.ШаблонПроводки;
				КонецЦикла;
				НаборЗаписей.Записать();
			КонецЕсли;
			Если НЕ ПропуститьУзел Тогда
				Для каждого Элемент Из ТекущийОбъект.Строки Цикл
					Стек.Добавить(Элемент);
				КонецЦикла; 
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 

КонецПроцедуры

Процедура СкопироватьГруппуСтатейОборотовСПодчиненными(ОбъектКопирования) Экспорт
	
	ТаблицаСсылок = Новый ТаблицаЗначений(); 
	ТаблицаСсылок.Колонки.Добавить("ЧтоЗаменить");
	ТаблицаСсылок.Колонки.Добавить("НаЧтоЗаменить");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ОбъектКопирования);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СтатьиОборотов.Ссылка КАК Ссылка,
	|	бит_СтатьиОборотов.Родитель,
	|	бит_СтатьиОборотов.Ссылка = &Ссылка КАК ЭтоИсточник
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
	|ГДЕ
	|	бит_СтатьиОборотов.Ссылка В ИЕРАРХИИ(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Значение = Выборка.Ссылка.Скопировать();
		
		Родитель = Выборка.Родитель;
		Если НЕ Выборка.ЭтоИсточник Тогда
			ОбработатьСсылкуВТаблицеСсылок(Родитель, ТаблицаСсылок);
		КонецЕсли; 
		
		Ссылка = Выборка.Ссылка;
		ОбработатьСсылкуВТаблицеСсылок(Ссылка, ТаблицаСсылок);

		Значение.Родитель = Родитель;
		Значение.УстановитьСсылкуНового(Ссылка);
		Значение.УстановитьНовыйКод();
		Значение.ОбменДанными.Загрузка = Истина;
		
		Значение.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
	
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт

	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);

КонецПроцедуры

Процедура ОбновитьЭлементыКурсовыхРазницБДР() Экспорт

	Элементы = Новый Массив;
	Элементы.Добавить(Справочники.бит_СтатьиОборотов.КурсовыеРазницыБДРОтрицательные);
	Элементы.Добавить(Справочники.бит_СтатьиОборотов.КурсовыеРазницыБДРПоложительные);
	
	МетаданныеОбъекта	= ПустаяСсылка().Метаданные(); 
	ПараметрыОбновления = ОбновлениеИнформационнойБазы.ПараметрыОбновленияПредопределенныхЭлементов();
	ПараметрыОбновления.Элементы  = Элементы;
	
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта, ПараметрыОбновления);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеНастройкиСтатьи()
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("Измерения",       Новый Структура);
	Настройки.Вставить("Учет_Сумма",      Ложь);
	Настройки.Вставить("Учет_Количество", Ложь);
	Настройки.Вставить("ЭтоКоэффициент",  Ложь);
	Настройки.Вставить("СтавкаНДС",       Неопределено);
	Настройки.Вставить("ТипСтатьи",       Перечисления.бит_ТипыСтатейОборотов.ПустаяСсылка());
	Настройки.Вставить("Код",             "");
	Настройки.Вставить("Кодификатор",     "");
	
	Возврат Настройки;
	
КонецФункции

Функция ЗначениеИзВыборки(Поле, ЗначениеПоУмолчанию, ПоляВыборки, Выборка, КэшПровеки)

	ВыборкаСодержитПоле = КэшПровеки.Получить(Поле);
	Если ВыборкаСодержитПоле = Неопределено Тогда
		ВыборкаСодержитПоле = (ПоляВыборки.Колонки.Найти(Поле) <> Неопределено);
		КэшПровеки.Вставить(Поле, ВыборкаСодержитПоле);
	КонецЕсли;
	
	Если ВыборкаСодержитПоле Тогда
		ЗначениеИзВыборки = Выборка[Поле];
	Иначе
		ЗначениеИзВыборки = ЗначениеПоУмолчанию;
	КонецЕсли; 	

	Возврат ЗначениеИзВыборки;
	
КонецФункции

Функция НовыеНастройкиАналитики(ИмяАналитики)
	
	НастройкиАналитики = Новый Структура; 
	НастройкиАналитики.Вставить("Имя",				  ИмяАналитики);
	НастройкиАналитики.Вставить("Учет",				  Ложь);
	НастройкиАналитики.Вставить("Обязательный",		  Ложь);
	НастройкиАналитики.Вставить("ИмяТипаПоУмолчанию", "");
	НастройкиАналитики.Вставить("ТипПоУмолчанию", 	  Неопределено);

	Возврат НастройкиАналитики;
	
КонецФункции

Процедура ОбработатьСсылкуВТаблицеСсылок(ЧтоЗаменить, ТаблицаСсылок)
		
	СтрокаСсылка = ТаблицаСсылок.Найти(ЧтоЗаменить,"ЧтоЗаменить");
	Если СтрокаСсылка = Неопределено Тогда
		НаЧтоЗаменить = Справочники.бит_СтатьиОборотов.ПолучитьСсылку(Новый УникальныйИдентификатор());
		НоваяСтрока = ТаблицаСсылок.Добавить();
		НоваяСтрока.ЧтоЗаменить   = ЧтоЗаменить;
		НоваяСтрока.НаЧтоЗаменить = НаЧтоЗаменить;
		ЧтоЗаменить = НаЧтоЗаменить;
	Иначе
		ЧтоЗаменить = СтрокаСсылка.НаЧтоЗаменить;
	КонецЕсли;

КонецПроцедуры

Процедура НайтиСоздатьСтавкиНДС()
	
	// ++ ЕРП
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК Таблица
	|ГДЕ
	|	Таблица.Предопределенный = ЛОЖЬ";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		// АПК:277-выкл Используется служебный программный интерфейс.
		УчетНДСЛокализация.ЗаполнитьСправочникСтавкиНДС();
		// АПК:277-вкл 
	КонецЕсли;
	// -- ЕРП 

КонецПроцедуры

#КонецОбласти

#КонецЕсли
