#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	
	РегистрыСведений.бит_МаскиКодов.ЗаполнитьКодификаторДляЭлементаСправочника(ДанныеЗаполнения, Ссылка, Кодификатор);
	
	Если Не ЭтоГруппа Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);			
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ТипСтатьи) Тогда
			ТипСтатьи  = Перечисления.бит_ТипыСтатейОборотов.БДДС;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(СтавкаНДС) Тогда
			СтавкаНДС = бит_УправлениеПользователямиСервер.ЗначениеПоУмолчаниюТиповой("ОсновнаяСтавкаНДС");  					
		КонецЕсли; 
		Учет_Сумма = Истина;
		
		МетаОбъект = Метаданные();
		
		// заполнение по умолчанию типов составных аналитик
		НастройкиИзмерений = бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений();
		
		Для каждого КиЗ Из НастройкиИзмерений Цикл
			
			ИмяИзмерения = КиЗ.Ключ;
			ТекНастройка = КиЗ.Значение;
			Если ТекНастройка.ЭтоСоставнойТип Тогда
				
				ИмяРеквизита = "ИмяТипаПоУмолчанию_"+ИмяИзмерения;
				Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, МетаОбъект) Тогда
					ЭтотОбъект[ИмяРеквизита] = ТекНастройка.ИмяТипаПоУмолчанию;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	НепроверяемыеРеквизиты = Новый Массив();
	
	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	Если ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.НефинансовыйПоказатель 
		ИЛИ ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.ФинансовыйПоказатель Тогда
		НепроверяемыеРеквизиты.Добавить("РасходДоход");
	КонецЕсли;
		
	// Должен быть указан ввод хотя бы одного показателя.
	Если НЕ Учет_Количество И НЕ Учет_Сумма Тогда
		ПроверяемыеРеквизиты.Добавить("Учет_Сумма");
	КонецЕсли; 
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	ЭтоНовый = ЭтоНовый();
	
	ДанныеСсылки = Новый Структура("Родитель, ПометкаУдаления, ЭтоНовый");
	ЗаполнитьЗначенияСвойств(ДанныеСсылки, ЭтотОбъект);
	
	Если НЕ ЭтоНовый Тогда
		ДанныеСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Родитель, ПометкаУдаления");				
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый);
	ДополнительныеСвойства.Вставить("ДанныеСсылки", ДанныеСсылки);
		
	Если НЕ ЭтоНовый И НЕ ПометкаУдаления = ДанныеСсылки.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	// Очистка кодификатора, если в нем нет значимых символов.
	КодификаторЧистый = СокрЛП(бит_БухгалтерияКлиентСервер.УдалитьРазделителиИзСтроки(Кодификатор));
	Если ПустаяСтрока(КодификаторЧистый) Тогда
		Кодификатор = "";	
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		// Проверяем, если есть движения по статье в регистре бит_ОборотыПоБюджетам 
		// и изменены ключевые реквизиты, то выводим сообщение об ошибке и запрещаем сохранение изменений.
		ДанныеБазы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Учет_Количество, Учет_Сумма");
		
		ИзмененныеРеквизиты = Новый Структура("Количество, Сумма", Ложь, Ложь);
		ИзмененныеРеквизиты.Количество = НЕ Учет_Количество И ДанныеБазы.Учет_Количество;
		ИзмененныеРеквизиты.Сумма	   = НЕ Учет_Сумма И ДанныеБазы.Учет_Сумма;
		
		ШаблонСообщения = НСтр("ru = '%1.
                                |По этому виду учета есть данные в регистре накопления ""Обороты по бюджету"".';
								|en = '%1.
                                |For this type of accounting, there is data in the accumulation register ""Turnovers on the budget"".'");
		КоличествоПредставление = Метаданные().Реквизиты.Учет_Количество.Представление();
		СуммаПредставление		= Метаданные().Реквизиты.Учет_Сумма.Представление();
		
		Если ИзмененныеРеквизиты.Количество ИЛИ ИзмененныеРеквизиты.Сумма  Тогда
			ДвиженияПоСтатье = ДвиженияПоСтатье();
			Если НЕ ДвиженияПоСтатье.Пустой() Тогда
				Выборка = ДвиженияПоСтатье.Выбрать();
				Выборка.Следующий();
				Если ИзмененныеРеквизиты.Количество И Выборка.ВедетсяКоличественныйУчет Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ" , "Заполнение", КоличествоПредставление);
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекстСообщения);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Учет_Количество", ,Отказ);
				КонецЕсли;	
				Если ИзмененныеРеквизиты.Сумма И Выборка.ВедетсяСуммовойУчет Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ" , "Заполнение", СуммаПредставление);
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекстСообщения);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Учет_Сумма", ,Отказ);					
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	Если НЕ Отказ Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
	ЕстьПраваНаШаблоныПроводок = ПравоДоступа("Редактирование",
		Метаданные.РегистрыСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов);
		
	Если ЕстьПраваНаШаблоныПроводок Тогда
		УстановитьШаблоныПроводок();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Кодификатор = "";
	
	Если ЗначениеЗаполнено(ОбъектКопирования.Родитель) Тогда
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Родитель", ОбъектКопирования.Родитель);
	Иначе
		ДанныеЗаполнения = Неопределено;
	КонецЕсли;
	
	РегистрыСведений.бит_МаскиКодов.ЗаполнитьКодификаторДляЭлементаСправочника(ДанныеЗаполнения, Ссылка, Кодификатор);
	
КонецПроцедуры // ПриКопировании()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДвиженияПоСтатье()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатьяОборотов", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОборотыПоБюджетам.СтатьяОборотов КАК СтатьяОборотов,
	|	МАКСИМУМ(ОборотыПоБюджетам.Количество <> 0) КАК ВедетсяКоличественныйУчет,
	|	МАКСИМУМ(ОборотыПоБюджетам.Сумма <> 0) КАК ВедетсяСуммовойУчет
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам КАК ОборотыПоБюджетам
	|ГДЕ
	|	ОборотыПоБюджетам.СтатьяОборотов = &СтатьяОборотов
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыПоБюджетам.СтатьяОборотов";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура УстановитьШаблоныПроводок()

	ЭтоНовый 	 = ДополнительныеСвойства.ЭтоНовый;
	ДанныеСсылки = ДополнительныеСвойства.ДанныеСсылки;

	Если НЕ ЭтоНовый И ДанныеСсылки.Родитель = Родитель Тогда
		Возврат;
	КонецЕсли;
	
	Если ШаблоныПроводокНазначены() Тогда
		Возврат;	
	КонецЕсли;
	
	СкопироватьШаблоныПроводок(Родитель);
	
КонецПроцедуры

Функция ШаблоныПроводокНазначены()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектСШаблонами", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаличиеШаблонов.ОбъектСШаблонами КАК ОбъектСШаблонами,
	|	НаличиеШаблонов.Количество КАК Количество,
	|	НаличиеШаблонов.Назначено КАК Назначено
	|ИЗ
	|	РегистрСведений.бит_НаличиеШаблоновПроводокБюджетирования КАК НаличиеШаблонов
	|ГДЕ
	|	НаличиеШаблонов.ОбъектСШаблонами = &ОбъектСШаблонами
	|	И НаличиеШаблонов.Назначено";	
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Процедура СкопироватьШаблоныПроводок(ОбъектКопирования)
	
	Справочники.бит_СтатьиОборотов.СкопироватьШаблоныПроводок(ОбъектКопирования, Ссылка);
	
	Если ЭтоГруппа Тогда
		Справочники.бит_СтатьиОборотов.УстановитьШаблоныПроводокСвязаннымСтатьям(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли