
&НаКлиенте
Процедура бит_ЗагрузитьДанныеИзExcel() Экспорт 
	
	бит_ОткрытьExcel();
	
КонецПроцедуры
	
 
&НаКлиенте
Процедура бит_ОткрытьExcel()
	ФайлExcel = "";
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите excel - файл для загрузки норм выборки";
	Диалог.ПолноеИмяФайла = "c:\";
	Диалог.Фильтр = "Таблицы (*.xls,*.xlsx)|*.xls;*.xlsx;|Microsoft Excel 97/2000/XP/2003 (*.xls)|*.xls|Microsoft Excel 2007/2010 (*.xlsx)|*.xlsx";
	
	Если Диалог.Выбрать() Тогда
		ФайлExcel = Диалог.ПолноеИмяФайла;
	КонецЕсли;  
	ОбработкаТабицы(ФайлExcel);
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаТабицы(ФайлExcel)
	// Попытка открытия файла Excel
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлExcel);
	Исключение
		Сообщить("При открытии файла произошла ошибка! Операция прервана!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	// Попытка выбрать первый лист
	// Можно указать любой другой
	Попытка 
		Excel.Sheets(1).Select();    
	Исключение
		// Закрытие файла в том случае, если первый лист не найден
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Первый лист не найден!");
		Возврат;
	КонецПопытки;
	
	// Вычисление количества строк и колонок в зависимости от версии Excel
	vExcel = Лев(Excel.Version, Найти(Excel.Version,".")-1);
	Если vExcel = "8" тогда
		КоличествоСтрок = Excel.Cells.CurrentRegion.Rows.Count;
		КоличествоКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		КоличествоСтрок = Excel.Cells(1,1).SpecialCells(11).Row;
		КоличествоКолонок = Excel.Cells(1,1).SpecialCells(11).Column;
	Конецесли;	
	////Excel.Cells(Строка, Столбец).Text
	
	СчетчикОшибочныхСтрок = 1;
	Для Строка = 2 По КоличествоСтрок Цикл     
		
		КодТТ			= СтрЗаменить(Excel.Cells(Строка, 3).Text, Символы.НПП, "");
		КодКА			= СтрЗаменить(Excel.Cells(Строка, 4).Text, Символы.НПП, "");
		
		//Если ЗначениеЗаполнено (КодТТ) И ЗначениеЗаполнено (КодКА) Тогда
		//	ОбработкаТабицыНаСервере(КодТТ, КодКА);					
		//КонецЕсли;
			
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Обработка прошла успешно";
	Сообщение.Сообщить();

КонецПроцедуры 

