#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Процедура устанавливает значения регистра по умолчанию
//
// Параметры:
//   Запись           - РегистрСведенийЗапись - запись регистра
//   ДанныеЗаполнения - Структура - где ключ - имя ресурса
//
Процедура УстановкаНастроекПоУмолчанию(Запись, ДанныеЗаполнения) Экспорт
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Период",
		ТекущаяДатаСеанса());
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СтруктурноеПодразделение",
		Неопределено);
		
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ИспользоватьКалендарьДляРасчетаКрайнейДаты",
		Ложь);

	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"НачалоРабочегоДня",
		'0001-01-01');

	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ОкончаниеРабочегоДня",
		'0001-01-01');

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли