
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [бн] [ASHolyavko@1cbit.ru] [20.01.2026] +        
	
	ТекстКоличествоОпераций = 
	"ВЫБРАТЬ
	|	ПроизводственнаяОперация2_2.СменноеЗадание КАК СменноеЗадание,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПроизводственнаяОперация2_2.Ссылка) КАК КоличествоОпераций
	|ПОМЕСТИТЬ вт_ПроизводственныеОперации
	|ИЗ
	|	Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
	|ГДЕ
	|	НЕ ПроизводственнаяОперация2_2.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроизводственнаяОперация2_2.СменноеЗадание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НарядОперации.Ссылка.ДокументОснование КАК СменноеЗадание,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_НарядОперации.ДокументОснование) КАК КоличествоОпераций
	|ПОМЕСТИТЬ вт_Наряды
	|ИЗ
	|	Документ.бит_Наряд.Операции КАК бит_НарядОперации
	|ГДЕ
	|	НЕ бит_НарядОперации.Ссылка.ПометкаУдаления
	|	И бит_НарядОперации.Ссылка.ДокументОснование ССЫЛКА Документ.СменноеЗадание
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НарядОперации.Ссылка.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Список.ТекстЗапроса = ТекстКоличествоОпераций + Список.ТекстЗапроса;
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, 
	"Документ.СменноеЗадание КАК ДокументПереопределяемый",
	"Документ.СменноеЗадание КАК ДокументПереопределяемый
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ПроизводственныеОперации КАК вт_ПроизводственныеОперации
	|		ПО ДокументПереопределяемый.Ссылка = вт_ПроизводственныеОперации.СменноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Наряды КАК вт_Наряды
	|		ПО ДокументПереопределяемый.Ссылка = вт_Наряды.СменноеЗадание");
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, 
	"ДокументПереопределяемый.Ссылка        КАК Ссылка,", 
	"ДокументПереопределяемый.Ссылка        КАК Ссылка, 
	|	вт_Наряды.КоличествоОпераций = вт_ПроизводственныеОперации.КоличествоОпераций        КАК ВсеОперацииВНарядах,");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ВсеОперацииВНарядах", Тип("ПолеФормы"), Элементы.Список, Элементы.Комментарий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ВсеОперацииВНарядах";
	НовыйЭлемент.Заголовок = "(бит) ВсеОперацииВНарядах";
	НовыйЭлемент.Видимость = Ложь;
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыСменныхЗаданий.Закрыто;
	ОтборЭлемента.Использование = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ВсеОперацииВНарядах");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
	Элемент.Использование = Истина;

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыСменныхЗаданий.Закрыто;
	ОтборЭлемента.Использование = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ВсеОперацииВНарядах");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин);
	Элемент.Использование = Истина;
	
	// }}ПервыйБИТ ЛистТребований [бн] [ASHolyavko@1cbit.ru] [20.01.2026] -
	
КонецПроцедуры
