
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодЯзыкаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЯзыкСтрана) Тогда
		Объект.ЯзыкСтрана = Объект.КодЯзыка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти