Функция ПолучитьТаблицуДляДвижений() Экспорт
	
	КвалификаторыСтроки = Новый КвалификаторыСтроки(150);
	ОписаниеСтроки = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("ВидДвижения", Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаЗначений.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
	ТаблицаЗначений.Колонки.Добавить("КорНоменклатура", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
	ТаблицаЗначений.Колонки.Добавить("ГФУ", Новый ОписаниеТипов("СправочникСсылка.ГруппыФинансовогоУчетаНоменклатуры"));
	ТаблицаЗначений.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаЗначений.Колонки.Добавить("Партия", Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ДокументПартии.Тип));
	ТаблицаЗначений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТаблицаЗначений.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаЗначений.Колонки.Добавить("Содержание", ОписаниеСтроки);
	ТаблицаЗначений.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаЗначений.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаЗначений.Колонки.Добавить("ДополнительныеРасходы", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));	
	ТаблицаЗначений.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ТаблицаЗначений.Колонки.Добавить("ДатаНазначения", Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("ДатаПартии", Новый ОписаниеТипов("Дата"));
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Процедура ЗаполнитьТаблицуДвиженийПоВидуДвижения(ТаблицаДвижений_СтоимостьТМЦ_УУ, ТаблицаДвижений_СебестоимостьТоваров, ВидДвижения, Склад = Неопределено, ПодразделениеЦФО = Неопределено, Дата = '00010101') Экспорт
	
	Для Каждого СтрокаСебестоимостьТоваров Из ТаблицаДвижений_СебестоимостьТоваров Цикл
		
		Если ВидДвижения = СтрокаСебестоимостьТоваров.ВидДвижения Тогда
			
			СтрокаСтоимостьТМЦ_УУ = ТаблицаДвижений_СтоимостьТМЦ_УУ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСтоимостьТМЦ_УУ, СтрокаСебестоимостьТоваров);
			СтрокаСтоимостьТМЦ_УУ.Номенклатура = СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры;
			Если ВидДвижения = ВидДвиженияНакопления.Расход Тогда 
				СтрокаСтоимостьТМЦ_УУ.КорНоменклатура = СтрокаСебестоимостьТоваров.КорАналитикаУчетаНоменклатуры;
			КонецЕсли;
			СтрокаСтоимостьТМЦ_УУ.ГФУ = СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета;
			
			Если ЗначениеЗаполнено(Склад) Тогда
				СтрокаСтоимостьТМЦ_УУ.Склад = Склад;	
			Иначе	
				СтрокаСтоимостьТМЦ_УУ.Склад = СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры.СкладскаяТерритория;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПодразделениеЦФО) Тогда
				СтрокаСтоимостьТМЦ_УУ.Подразделение = ПодразделениеЦФО;	
			Иначе	
				ПодразделениеЦФО = РегистрыСведений.бит_СоответствияАналитик.ПолучитьПравуюАналитику(Справочники.бит_ВидыСоответствийАналитик.СтруктураПредприятия_ЦФО, СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение, Дата); 
			    СтрокаСтоимостьТМЦ_УУ.Подразделение = ПодразделениеЦФО;
			КонецЕсли;
			
			СтрокаСтоимостьТМЦ_УУ.Назначение = СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры.Назначение;
			
			Если ЗначениеЗаполнено(СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры.Назначение.Заказ) 
				И ТипЗнч(СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры.Назначение.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				СтрокаСтоимостьТМЦ_УУ.ДатаНазначения = СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры.Назначение.Заказ.Дата;
			ИначеЕсли ЗначениеЗаполнено(СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры.Назначение.Заказ)
				И ТипЗнч(СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры.Назначение.Заказ) = Тип("ДокументСсылка.ЗаказКлиента")
				И ЗначениеЗаполнено(СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры.Назначение.Заказ.ДокументОснование) Тогда
				СтрокаСтоимостьТМЦ_УУ.ДатаНазначения = СтрокаСебестоимостьТоваров.АналитикаУчетаНоменклатуры.Назначение.Заказ.ДокументОснование.Дата;
			Иначе
				Если ЗначениеЗаполнено(СтрокаСтоимостьТМЦ_УУ.Партия) Тогда 
					СтрокаСтоимостьТМЦ_УУ.ДатаНазначения = СтрокаСтоимостьТМЦ_УУ.Партия.Дата;
				Иначе     
					СтрокаСтоимостьТМЦ_УУ.ДатаНазначения = СтрокаСтоимостьТМЦ_УУ.Период;
				КонецЕсли;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаСтоимостьТМЦ_УУ.Партия) Тогда 
				СтрокаСтоимостьТМЦ_УУ.ДатаПартии = СтрокаСтоимостьТМЦ_УУ.Партия.Дата;
			Иначе     
				СтрокаСтоимостьТМЦ_УУ.ДатаПартии = СтрокаСтоимостьТМЦ_УУ.Период;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;   
	
	ТаблицаДвижений_СтоимостьТМЦ_УУ.Свернуть("Период, ВидДвижения, Организация, Партия, Номенклатура, КорНоменклатура, ГФУ, Подразделение, Склад, Содержание, ДатаНазначения, ДатаПартии", "Количество, Стоимость, ДополнительныеРасходы");
	
КонецПроцедуры		

// Получает данные стоимости номенклатуры по партиям.
//
// Параметры:
//  ДатаОтбора - дата на которую осуществляется отбор
//  ВходящиеДанные - "Организация, Подразделение, Склад, Номенклатура, Партия"
//
// Возвращаемое значение:
//  ТаблицаЗначений - "Организация, Подразделение, Склад, Номенклатура, Партия, Количество, Стоимость, Цена".
//
Функция ПолучитьСтоимостьНоменклатурыПоПартиям(ДатаОтбора, ВходящиеДанные, ИспользоватьКорНоменклатуру = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВходящиеДанные.Организация КАК Организация,
		|	ВходящиеДанные.Подразделение КАК Подразделение,
		|	ВходящиеДанные.Склад КАК Склад,
		|	ВходящиеДанные.Номенклатура КАК Номенклатура,
		|	ВходящиеДанные.КорНоменклатура КАК КорНоменклатура,
		|	ВходящиеДанные.Партия КАК Партия
		|ПОМЕСТИТЬ вт_ВходящиеДанные
		|ИЗ
		|	&ВходящиеДанные КАК ВходящиеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_СтоимостьТМЦ_УУОстатки.Организация КАК Организация,
		|	бит_СтоимостьТМЦ_УУОстатки.Подразделение КАК Подразделение,
		|	бит_СтоимостьТМЦ_УУОстатки.Склад КАК Склад,
		|	ВЫБОР
		|		КОГДА &ИспользоватьКорНоменклатуру
		|			ТОГДА вт_ВходящиеДанные.КорНоменклатура
		|		ИНАЧЕ бит_СтоимостьТМЦ_УУОстатки.Номенклатура
		|	КОНЕЦ КАК Номенклатура,
		|	бит_СтоимостьТМЦ_УУОстатки.Партия КАК Партия,
		|	СУММА(бит_СтоимостьТМЦ_УУОстатки.КоличествоОстаток) КАК Количество,
		|	СУММА(бит_СтоимостьТМЦ_УУОстатки.СтоимостьОстаток) КАК Стоимость,
		|	СУММА(бит_СтоимостьТМЦ_УУОстатки.СтоимостьОстаток / бит_СтоимостьТМЦ_УУОстатки.КоличествоОстаток) КАК Цена
		|ИЗ
		|	РегистрНакопления.бит_СтоимостьТМЦ_УУ.Остатки(
		|			&ДатаОтбора,
		|			(Организация, Подразделение, Склад, Партия, Номенклатура) В
		|				(ВЫБРАТЬ
		|					вт_ВходящиеДанные.Организация КАК Организация,
		|					вт_ВходящиеДанные.Подразделение КАК Подразделение,
		|					вт_ВходящиеДанные.Склад КАК Склада,
		|					вт_ВходящиеДанные.Партия КАК Партия,
		|					вт_ВходящиеДанные.Номенклатура КАК Номенклатура
		|				ИЗ
		|					вт_ВходящиеДанные КАК вт_ВходящиеДанные)) КАК бит_СтоимостьТМЦ_УУОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ВходящиеДанные КАК вт_ВходящиеДанные
		|		ПО бит_СтоимостьТМЦ_УУОстатки.Организация = вт_ВходящиеДанные.Организация
		|			И бит_СтоимостьТМЦ_УУОстатки.Партия = вт_ВходящиеДанные.Партия
		|			И бит_СтоимостьТМЦ_УУОстатки.Номенклатура = вт_ВходящиеДанные.Номенклатура
		|			И бит_СтоимостьТМЦ_УУОстатки.Подразделение = вт_ВходящиеДанные.Подразделение
		|			И бит_СтоимостьТМЦ_УУОстатки.Склад = вт_ВходящиеДанные.Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_СтоимостьТМЦ_УУОстатки.Подразделение,
		|	бит_СтоимостьТМЦ_УУОстатки.Партия,
		|	бит_СтоимостьТМЦ_УУОстатки.Склад,
		|	бит_СтоимостьТМЦ_УУОстатки.Организация,
		|	ВЫБОР
		|		КОГДА &ИспользоватьКорНоменклатуру
		|			ТОГДА вт_ВходящиеДанные.КорНоменклатура
		|		ИНАЧЕ бит_СтоимостьТМЦ_УУОстатки.Номенклатура
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДатаОтбора", ДатаОтбора);
	Запрос.УстановитьПараметр("ВходящиеДанные", ВходящиеДанные);
	Запрос.УстановитьПараметр("ИспользоватьКорНоменклатуру", ИспользоватьКорНоменклатуру);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции	

// Получает данные стоимости номенклатуры по партиям.
//
// Параметры:                                                                 
//  ВидЦен - вид цен по которой необходимо получить стоимость
//  ВходящиеДанные - "Организация, Подразделение, Склад, Номенклатура, Партия"
//
// Возвращаемое значение:
//  ТаблицаЗначений - "Организация, Подразделение, Склад, Номенклатура, Партия, Количество, Стоимость, Цена".
//
Функция ПолучитьСтоимостьНоменклатурыПоВидуЦены(ВидЦены, ВходящиеДанные) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВходящиеДанные.Организация КАК Организация,
		|	ВходящиеДанные.Подразделение КАК Подразделение,
		|	ВходящиеДанные.Склад КАК Склад,
		|	ВходящиеДанные.Номенклатура КАК Номенклатура,
		|	ВходящиеДанные.КорНоменклатура КАК КорНоменклатура,
		|	ВходящиеДанные.Партия КАК Партия,
		|	ВходящиеДанные.ДатаНазначения КАК ДатаНазначения
		|ПОМЕСТИТЬ вт_ВходящиеДанные
		|ИЗ
		|	&ВходящиеДанные КАК ВходящиеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_ВходящиеДанные.ДатаНазначения КАК Дата,
		|	вт_ВходящиеДанные.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ вт_ДатаНоменклатура
		|ИЗ
		|	вт_ВходящиеДанные КАК вт_ВходящиеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ДатаНоменклатура.Дата КАК Дата,
		|	вт_ДатаНоменклатура.Номенклатура КАК Номенклатура,
		|	Максимум(ЦеныНоменклатуры25.Период) КАК Период
		|ПОМЕСТИТЬ вт_ДатаЦены
		|ИЗ
		|	вт_ДатаНоменклатура КАК вт_ДатаНоменклатура
		|		Левое СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25 КАК ЦеныНоменклатуры25
		|		ПО вт_ДатаНоменклатура.Номенклатура.Номенклатура = ЦеныНоменклатуры25.Номенклатура
		|			И ЕстьNull(вт_ДатаНоменклатура.Номенклатура.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, Значение(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) = ЕстьNull(ЦеныНоменклатуры25.ХарактеристикаЦО, Значение(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))
		|			И вт_ДатаНоменклатура.Дата >= ЦеныНоменклатуры25.Период
		|			И (ЦеныНоменклатуры25.ВидЦены = &ВидЦены)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ДатаНоменклатура.Дата,
		|	вт_ДатаНоменклатура.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ДатаЦены.Дата КАК Дата,
		|	вт_ДатаЦены.Номенклатура КАК Номенклатура,
		|	вт_ДатаЦены.Период КАК Период,
		|	ЦеныНоменклатуры25.Цена КАК Цена
		|ПОМЕСТИТЬ вт_ЦеныНоменклатурыСрез
		|ИЗ
		|	вт_ДатаЦены КАК вт_ДатаЦены
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25 КАК ЦеныНоменклатуры25
		|		ПО вт_ДатаЦены.Номенклатура.Номенклатура = ЦеныНоменклатуры25.Номенклатура
		|			И ЕстьNull(вт_ДатаЦены.Номенклатура.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, Значение(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)) = ЕстьNull(ЦеныНоменклатуры25.ХарактеристикаЦО, Значение(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))
		|			И вт_ДатаЦены.Период = ЦеныНоменклатуры25.Период
		|			И (ЦеныНоменклатуры25.ВидЦены = &ВидЦены)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ВходящиеДанные.Организация КАК Организация,
		|	вт_ВходящиеДанные.Подразделение КАК Подразделение,
		|	вт_ВходящиеДанные.Склад КАК Склад,
		|	вт_ВходящиеДанные.Номенклатура КАК Номенклатура, 
		|	вт_ВходящиеДанные.КорНоменклатура КАК КорНоменклатура,
		|	вт_ВходящиеДанные.Партия КАК Партия,
		|	вт_ВходящиеДанные.ДатаНазначения КАК ДатаНазначения,
		|	вт_ЦеныНоменклатурыСрез.Цена КАК Цена
		|ИЗ
		|	вт_ВходящиеДанные КАК вт_ВходящиеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатурыСрез КАК вт_ЦеныНоменклатурыСрез
		|		ПО вт_ВходящиеДанные.ДатаНазначения = вт_ЦеныНоменклатурыСрез.Дата
		|			И вт_ВходящиеДанные.Номенклатура = вт_ЦеныНоменклатурыСрез.Номенклатура";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ВходящиеДанные", ВходящиеДанные);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ЗаполнитьСтоимостьВТаблицеДвижений(ТаблицаДвижений_СтоимостьТМЦ_УУ, ТаблицаСтоимостиНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Период КАК Период,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Номенклатура КАК Номенклатура,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.КорНоменклатура КАК КорНоменклатура,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.ГФУ КАК ГФУ,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Организация КАК Организация,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Партия КАК Партия,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Подразделение КАК Подразделение,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Склад КАК Склад,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Содержание КАК Содержание,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Количество КАК Количество,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Стоимость КАК Стоимость,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.ДополнительныеРасходы КАК ДополнительныеРасходы
		|ПОМЕСТИТЬ вт_ТаблицаДвижений
		|ИЗ
		|	&ТаблицаДвижений_СтоимостьТМЦ_УУ КАК ТаблицаДвижений_СтоимостьТМЦ_УУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСтоимостиНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТаблицаСтоимостиНоменклатуры.Организация КАК Организация,
		|	ТаблицаСтоимостиНоменклатуры.Партия КАК Партия,
		|	ТаблицаСтоимостиНоменклатуры.Подразделение КАК Подразделение,
		|	ТаблицаСтоимостиНоменклатуры.Склад КАК Склад,
		|	ТаблицаСтоимостиНоменклатуры.Цена КАК Цена
		|ПОМЕСТИТЬ вт_ТаблицаСтоимости
		|ИЗ
		|	&ТаблицаСтоимостиНоменклатуры КАК ТаблицаСтоимостиНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТаблицаДвижений.Период КАК Период,
		|	вт_ТаблицаДвижений.ВидДвижения КАК ВидДвижения,
		|	вт_ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	вт_ТаблицаДвижений.КорНоменклатура КАК КорНоменклатура,
		|	вт_ТаблицаДвижений.ГФУ КАК ГФУ,
		|	вт_ТаблицаДвижений.Организация КАК Организация,
		|	вт_ТаблицаДвижений.Партия КАК Партия,
		|	вт_ТаблицаДвижений.Подразделение КАК Подразделение,
		|	вт_ТаблицаДвижений.Склад КАК Склад,
		|	вт_ТаблицаДвижений.Содержание КАК Содержание,
		|	вт_ТаблицаДвижений.Количество КАК Количество,
		|	вт_ТаблицаДвижений.Количество * вт_ТаблицаСтоимости.Цена КАК Стоимость,
		|	вт_ТаблицаДвижений.ДополнительныеРасходы КАК ДополнительныеРасходы
		|ИЗ
		|	вт_ТаблицаДвижений КАК вт_ТаблицаДвижений
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТаблицаСтоимости КАК вт_ТаблицаСтоимости
		|		ПО вт_ТаблицаДвижений.Номенклатура = вт_ТаблицаСтоимости.Номенклатура
		|			И вт_ТаблицаДвижений.Организация = вт_ТаблицаСтоимости.Организация
		|			И вт_ТаблицаДвижений.Партия = вт_ТаблицаСтоимости.Партия
		|			И вт_ТаблицаДвижений.Подразделение = вт_ТаблицаСтоимости.Подразделение";
		//|			И вт_ТаблицаДвижений.Склад = вт_ТаблицаСтоимости.Склад";
	
	Запрос.УстановитьПараметр("ТаблицаДвижений_СтоимостьТМЦ_УУ", ТаблицаДвижений_СтоимостьТМЦ_УУ);
	Запрос.УстановитьПараметр("ТаблицаСтоимостиНоменклатуры", ТаблицаСтоимостиНоменклатуры);
	
	ТаблицаДвижений_СтоимостьТМЦ_УУ = Запрос.Выполнить().Выгрузить();
	
	//Возврат ТаблицаДвижений_СтоимостьТМЦ_УУ;
	
КонецПроцедуры		

Процедура ДополнитьСчетаУчатНоменклатуры(ТаблицаДвижений_СтоимостьТМЦ_УУ) Экспорт
	
	СоответствиеАналитикСчетаУчета = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений("СоответствиеАналитикСчетаУчета", Неопределено, Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Период КАК Период,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.ВидДвижения КАК ВидДвижения,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Номенклатура КАК Номенклатура,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.ГФУ КАК ГФУ,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Организация КАК Организация,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Партия КАК Партия,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Подразделение КАК Подразделение,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Склад КАК Склад,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Содержание КАК Содержание,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Количество КАК Количество,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.Стоимость КАК Стоимость,
		|	ТаблицаДвижений_СтоимостьТМЦ_УУ.ДополнительныеРасходы КАК ДополнительныеРасходы
		|ПОМЕСТИТЬ вт_ТаблицаДвижений
		|ИЗ
		|	&ТаблицаДвижений_СтоимостьТМЦ_УУ КАК ТаблицаДвижений_СтоимостьТМЦ_УУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТаблицаДвижений.Период КАК Период,
		|	вт_ТаблицаДвижений.ВидДвижения КАК ВидДвижения,
		|	вт_ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	вт_ТаблицаДвижений.ГФУ КАК ГФУ,
		|	вт_ТаблицаДвижений.Организация КАК Организация,
		|	вт_ТаблицаДвижений.Партия КАК Партия,
		|	вт_ТаблицаДвижений.Подразделение КАК Подразделение,
		|	вт_ТаблицаДвижений.Склад КАК Склад,
		|	вт_ТаблицаДвижений.Содержание КАК Содержание,
		|	вт_ТаблицаДвижений.Количество КАК Количество,
		|	вт_ТаблицаДвижений.Стоимость КАК Стоимость,
		|	вт_ТаблицаДвижений.ДополнительныеРасходы КАК ДополнительныеРасходы,
		|	ПорядокОтраженияНаСчетахУчета.СчетУчета КАК СчетУчета,
		|	бит_СоответствияАналитик.ПраваяАналитика_1 КАК СчетУчетаБюджет
		|ИЗ
		|	вт_ТаблицаДвижений КАК вт_ТаблицаДвижений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК ПорядокОтраженияНаСчетахУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СоответствияАналитик КАК бит_СоответствияАналитик
		|			ПО ПорядокОтраженияНаСчетахУчета.СчетУчета = бит_СоответствияАналитик.ЛеваяАналитика_1
		|				И (бит_СоответствияАналитик.ВидСоответствия = &СоответствиеАналитикСчетаУчета)
		|		ПО вт_ТаблицаДвижений.ГФУ = ПорядокОтраженияНаСчетахУчета.АналитикаУчета
		|			И (ПорядокОтраженияНаСчетахУчета.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))";
	
	Запрос.УстановитьПараметр("ТаблицаДвижений_СтоимостьТМЦ_УУ", ТаблицаДвижений_СтоимостьТМЦ_УУ);
	Запрос.УстановитьПараметр("СоответствиеАналитикСчетаУчета", СоответствиеАналитикСчетаУчета);
	
	ТаблицаДвижений_СтоимостьТМЦ_УУ = Запрос.Выполнить().Выгрузить();
		
КонецПроцедуры		

