#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;     	
	КонецЕсли; 
	
	ИспользуетсяСинхронизация 	  = ПолучитьФункциональнуюОпцию("бит_СинхронизироватьПодразделенияРеглЦФО");
	СинхронизацияСПодразделениями = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, 
										"СинхронизацияСПодразделениями", Ложь);
	Если ИспользуетсяСинхронизация И НЕ СинхронизацияСПодразделениями Тогда
		ТекстПояснения = НСтр("ru = 'Включен режим синхронизации подразделений и ЦФО. Изменения запрещены.'");
		Если ЭтоНовый() Тогда
			ВызватьИсключение ТекстПояснения;	
		КонецЕсли;
		
		КонтролируемыеРеквизиты = Справочники.Подразделения.РеквизитыКонтролируемыеПриСинхронизации();
		РеквизитыСтрокой		= ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(КонтролируемыеРеквизиты, ",");
		ДанныеБазы 				= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, РеквизитыСтрокой);
		Для каждого КлючЗначение Из КонтролируемыеРеквизиты Цикл
			Если ДанныеБазы[КлючЗначение.Ключ] <> ЭтотОбъект[КлючЗначение.Ключ] Тогда
				Если КлючЗначение.Ключ = "ПометкаУдаления" Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстПояснения, ЭтотОбъект, , ,Отказ);
				Иначе	
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ" , "КОРРЕКТНОСТЬ", 
										КлючЗначение.Значение,,, ТекстПояснения);				
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, КлючЗначение.Ключ, ,Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаЗаполнения" объекта справочника.
// 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИспользуетсяСинхронизация = ПолучитьФункциональнуюОпцию("бит_СинхронизироватьПодразделенияРеглЦФО");
	СинхронизацияСПодразделениями = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, 
										"СинхронизацияСПодразделениями", Ложь);
	Если ИспользуетсяСинхронизация И НЕ СинхронизацияСПодразделениями Тогда
		ТекстСообщения =  НСтр("ru = 'Включен режим синхронизации подразделений и ЦФО. Ввод запрещен.'");
		ВызватьИсключение ТекстСообщения;	
	КонецЕсли; 
	
	Если ЭтоНовый() Тогда
		РегистрыСведений.бит_МаскиКодов.ЗаполнитьКодификаторДляЭлементаСправочника(ДанныеЗаполнения, Ссылка, Кодификатор);
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Кодификатор = "";
	
	Если ЗначениеЗаполнено(ОбъектКопирования.Родитель) Тогда
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Родитель", ОбъектКопирования.Родитель);
	Иначе
		ДанныеЗаполнения = Неопределено;
	КонецЕсли;
	
	РегистрыСведений.бит_МаскиКодов.ЗаполнитьКодификаторДляЭлементаСправочника(ДанныеЗаполнения, Ссылка, Кодификатор);
	
КонецПроцедуры // ПриКопировании()

#КонецОбласти

#КонецЕсли
