#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//   Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
//   Реквизиты - Массив - список имен реквизитов объекта.
//
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("НаборыЗначенийДоступа.*");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП 
	СовместимоУП = Истина;
	// -- ЕРП 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылка);
	Запрос.УстановитьПараметр("ПустойСценарий", Справочники.СценарииПланирования.ПустаяСсылка());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.СторнироватьДанные КАК СторнироватьДанные,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента
	|ИЗ
	|	Документ.бит_РаспределениеБюджета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	
	Если НЕ бит_ОбщегоНазначения.ВалютаУпрУчетаУстановлена(Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;

	КурсыВалют = бит_Бюджетирование.КурсыВалютСценария(Реквизиты.Регистратор, Реквизиты.Дата, 
					Новый Структура("Документ, Регл, Упр, Сценарий"));
					
	Реквизиты.Вставить("КурсыВалют", КурсыВалют);
	
	Запрос.УстановитьПараметр("СторнироватьДанные", Реквизиты.СторнироватьДанные);
	Запрос.УстановитьПараметр("Сценарий", 			Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("Валюта", 			Реквизиты.ВалютаДокумента);
	Запрос.УстановитьПараметр("СинонимРаспределение", 		НСтр("ru='Результат распределения';en='Allocation Result'"));
	Запрос.УстановитьПараметр("СинонимДанные", 	НСтр("ru='Данные';en='Data'"));

	ИнициализироватьКлючиАналитик(Реквизиты);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)
				 + ТекстЗапросаТаблицыВалютногоПерерасчета(НомераТаблиц)
				 + ТекстЗапросаТаблицаОборотыПоБюджетам(НомераТаблиц);

	Результат = Запрос.ВыполнитьПакет();
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	ПодготовитьТаблицыДокументаРасчетыВВалюте(ПараметрыПроведения, Реквизиты);	
												
	Возврат ПараметрыПроведения;
	
КонецФункции

Процедура СформироватьДвиженияОборотыПоБюджетам(ДанныеБюджета, Реквизиты, Движения, Отказ) Экспорт 
	
	Для каждого СтрокаТаблицы Из ДанныеБюджета Цикл
		Движение = Движения.бит_ОборотыПоБюджетам.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);
	КонецЦикла; 
	Движения.бит_ОборотыПоБюджетам.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьДвиженияБюджетирование(ДанныеБюджета, Реквизиты, Движения, Отказ) Экспорт 
	
	Если ЗначениеЗаполнено(ДанныеБюджета) Тогда
		бит_Бюджетирование.СформироватьПроводкиБюджетирования(ДанныеБюджета,
			Движения.бит_Бюджетирование, Ложь);
	КонецЕсли;
	Движения.бит_Бюджетирование.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти // Проведение

Функция ПодготовитьТаблицуЗаполнения(ОбъектСтруктура, ЭтоДанные, СтрЗаполненияАналитик = Неопределено) Экспорт

	Если ЭтоДанные Тогда
		ДатаНачала = ОбъектСтруктура.Данные_ДатаНачала;
		ДатаОкончания = ОбъектСтруктура.Данные_ДатаОкончания;
		Источник = ОбъектСтруктура.НастройкаРаспределения.ИсточникДанные;
	Иначе	
		ДатаНачала = ОбъектСтруктура.База_ДатаНачала;
		ДатаОкончания = ОбъектСтруктура.База_ДатаОкончания;
		Источник = ОбъектСтруктура.НастройкаРаспределения.ИсточникБаза;
	КонецЕсли; 
	
	Если ОбъектСтруктура.НастройкаРаспределения.ВидНастройки = Перечисления.бит_ВидыНастроекРаспределенияБюджета.Простая Тогда
		
		ПараметрыСКД = НовыеПараметрыПолученияДанных();
		ПараметрыСКД.Вставить("НачалоПериода"	  , ДатаНачала);
		ПараметрыСКД.Вставить("КонецПериода"	  , КонецДня(ДатаОкончания));
		ПараметрыСКД.Вставить("ДатаДокумента"	  , ОбъектСтруктура.Дата);
		ПараметрыСКД.Вставить("ВалютаДокумента"   , ОбъектСтруктура.ВалютаДокумента);
		ПараметрыСКД.Вставить("КурсДокумента"	  , ОбъектСтруктура.КурсДокумента);
		ПараметрыСКД.Вставить("КратностьДокумента", ОбъектСтруктура.КратностьДокумента);
		ПараметрыСКД.Вставить("Регистратор", 		ОбъектСтруктура.Ссылка);
		ПараметрыСКД.Вставить("Периодичность", ПолучитьНомерПериодичности(ОбъектСтруктура.Сценарий.бит_Периодичность));
		
		ТаблицаРезультат = ТаблицаОборотыПоБюджету(ОбъектСтруктура.НастройкаРаспределения, ПараметрыСКД, ЭтоДанные, СтрЗаполненияАналитик);
		
	ИначеЕсли ОбъектСтруктура.НастройкаРаспределения.ВидНастройки = Перечисления.бит_ВидыНастроекРаспределенияБюджета.ИсточникиДанных Тогда
		
		ГраницаНач = ДатаНачала;
		ГраницаКон = Новый Граница(КонецДня(ДатаОкончания), ВидГраницы.Включая);
		
		Параметры = Новый Структура;		
		Параметры.Вставить("ДатаДокумента"	   , ОбъектСтруктура.Дата);
		Параметры.Вставить("ВалютаДокумента"   , ОбъектСтруктура.ВалютаДокумента);
		Параметры.Вставить("КурсДокумента"	   , ОбъектСтруктура.КурсДокумента);
		Параметры.Вставить("КратностьДокумента", ОбъектСтруктура.КратностьДокумента);
		Параметры.Вставить("Сценарий"          , ОбъектСтруктура.Сценарий);
		
		СтрПар = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоИсточнику();
		СтрПар.Параметры = Параметры;		
		
		ТаблицаРезультат = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточнику(Источник
																		, ГраницаНач
																		, ГраницаКон
																		, СтрПар);
	            		
	КонецЕсли; 

	Возврат ТаблицаРезультат;
	
КонецФункции // ЗаполнитьДанные()

Функция НовыеПараметрыРаспределения() Экспорт

	ПараметрыРаспределения = Новый Структура("Данные, База, НастройкаРаспределения"); 	
	Возврат ПараметрыРаспределения;
	
КонецФункции
 
Процедура РаспределитьБюджет(ПараметрыРаспределения, АдресРезультата) Экспорт
	
	ТаблицаДанные  		   = ПараметрыРаспределения.Данные;
	ТаблицаБаза    		   = ПараметрыРаспределения.База;
	НастройкаРаспределения = ПараметрыРаспределения.НастройкаРаспределения;
	РезультатРаспределения = НоваяТаблицаРаспределения();	
	
	РеквизитыНастройки	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаРаспределения, 
								"СпособРаспределения, УсловияРаспределения, ПравилаЗаполнения");
	УсловияРаспределения = РеквизитыНастройки.УсловияРаспределения.Выгрузить();
	ПравилаЗаполнения    = РеквизитыНастройки.ПравилаЗаполнения.Выгрузить();
	
	ТекстЗапроса = ТекстЗапросаВременныеТаблицыРаспределения(ПравилаЗаполнения)
				 + ТекстЗапросаСоединениеТаблицРаспределения(УсловияРаспределения, ПравилаЗаполнения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Данные", ТаблицаДанные);
	Запрос.УстановитьПараметр("База", 	ТаблицаБаза);
	
	Для каждого СтрокаТаблицы Из ПравилаЗаполнения Цикл
		Если СтрокаТаблицы.ПравилоЗаполнения = "УказаноЯвно" Тогда
			Запрос.УстановитьПараметр(СтрокаТаблицы.ИмяПоля, СтрокаТаблицы.Значение);
		КонецЕсли; 
	КонецЦикла; 
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ВыборкаРазделитель = Пакет[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаСоединения  = НоваяТаблицаСоединенияТаблиц(Пакет[2]);
	
	СвязанныеКолонки	 = Новый Структура;
	СпособыРаспределения = Перечисления.бит_СпособыРаспределенияРесурсовБюджета; 
	
	Если РеквизитыНастройки.СпособРаспределения = СпособыРаспределения.Независимо Тогда
		СвязанныеКолонки.Вставить("Количество", "КоэфКоличество");
		СвязанныеКолонки.Вставить("Сумма", 		"КоэфСумма");
	ИначеЕсли РеквизитыНастройки.СпособРаспределения = СпособыРаспределения.ПоКоличеству Тогда
		СвязанныеКолонки.Вставить("Количество", "КоэфКоличество");
		СвязанныеКолонки.Вставить("Сумма", 		"КоэфКоличество");
	ИначеЕсли РеквизитыНастройки.СпособРаспределения = СпособыРаспределения.ПоСумме Тогда
		СвязанныеКолонки.Вставить("Количество", "КоэфСумма");
		СвязанныеКолонки.Вставить("Сумма", 		"КоэфСумма");
	КонецЕсли;

	Пока ВыборкаРазделитель.Следующий() Цикл
		ДетальныеЗаписи = ВыборкаРазделитель.Выбрать();
		РезультатСоединения = ТаблицаСоединения.СкопироватьКолонки();
		Пока ДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(РезультатСоединения.Добавить(), ДетальныеЗаписи);
		КонецЦикла; 
		
		// Если РезультатСоединения[0].БазаНомерСтроки = 0, значит к данным не удалось подобрать базу.
		// Распределять нечего.
		Если РезультатСоединения[0].БазаНомерСтроки <> 0 Тогда
			Для каждого ПараКолонок Из СвязанныеКолонки Цикл
				Точность 				  = ?(ПараКолонок.Ключ = "Сумма", 2, 3);
				РаспределяемаяСумма 	  = РезультатСоединения[0][ПараКолонок.Ключ];
				КоэффициентыРаспределения = РезультатСоединения.ВыгрузитьКолонку(ПараКолонок.Значение);
				
				РаспределенноеЗначение = РаспределитьСуммуПропорциональноКоэффициентам(
											РаспределяемаяСумма, КоэффициентыРаспределения, Точность);	
				
				Если РаспределенноеЗначение = Неопределено Тогда
					РаспределенноеЗначение = Новый Массив(КоэффициентыРаспределения.Количество());
				КонецЕсли;								
				РезультатСоединения.ЗагрузитьКолонку(РаспределенноеЗначение, ПараКолонок.Ключ);
			КонецЦикла; 
		КонецЕсли;

		Для каждого СтрокаТаблицы Из РезультатСоединения Цикл
			ЗаполнитьЗначенияСвойств(РезультатРаспределения.Добавить(), СтрокаТаблицы);
		КонецЦикла; 
	КонецЦикла; 
	
	Если РезультатРаспределения.Количество() > 99999 Тогда
		ТекстСообщения = НСтр("ru = 'Количество строк в результате распределения (%1) превышает возможности программы (%2).
                               |Рекомендуем использовать отборы в настройке распределения, данных и базе.'");
		Ошибка = СтрШаблон(ТекстСообщения,
						   Формат(РезультатРаспределения.Количество(), "ЧЦ=15; ЧДЦ=0"),
						   Формат(99999, "ЧЦ=15; ЧДЦ=0"));
		ВызватьИсключение Ошибка;								
	КонецЕсли;
	
	РезультатОбновления = Новый Структура(); 
	РезультатОбновления.Вставить("РезультатРаспределения", РезультатРаспределения);
	
	ПоместитьВоВременноеХранилище(РезультатОбновления, АдресРезультата);

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область РаспределитьБюджет
	
Функция РаспределитьСуммуПропорциональноКоэффициентам(Знач РаспределяемаяСумма, Знач Коэффициенты, Знач Точность = 2)
	
	// Распределение по коэффициентам с разными знаками не поддерживает 
	// ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам().
	// Надо подготовить коэффициенты.

	Если Не ЗначениеЗаполнено(РаспределяемаяСумма) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если Коэффициенты.Количество() = 0 Тогда 
		// Недопустимо значение параметра Коэффициенты
		// Ожидалось: хотя бы один коэффициент будет задан.
		Возврат Неопределено;
	КонецЕсли;

	СуммаКоэффициентов 		  = 0;
	ВГраница		  		  = Коэффициенты.ВГраница();
	Для Индекс = 0 По ВГраница Цикл
		Коэффициент			 = Коэффициенты[Индекс];
		НовоеЗначение		 = Макс(- Коэффициент, Коэффициент);
		Коэффициенты[Индекс] = НовоеЗначение;
		СуммаКоэффициентов	 = СуммаКоэффициентов + НовоеЗначение;
	КонецЦикла;
	
	Если СуммаКоэффициентов = 0 Тогда
		// Недопустимо значение параметра Коэффициенты
		// Ожидалось: хотя бы один коэффициент будет отличен от нуля.
		Возврат Неопределено;
	КонецЕсли;

	Результат = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(РаспределяемаяСумма, Коэффициенты, Точность);
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаВременныеТаблицыРаспределения(ПравилаЗаполнения)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Данные.НомерСтроки КАК Разделитель,
	|	Данные.НомерСтроки КАК НомерСтроки,
	|	Данные.Период КАК Период,
	|	Данные.ЦФО КАК ЦФО,
	|	Данные.СтатьяОборотов КАК СтатьяОборотов,
	|	Данные.Количество КАК Количество,
	|	Данные.Сумма КАК Сумма,
	|	Данные.СуммаРегл КАК СуммаРегл,
	|	Данные.СуммаУпр КАК СуммаУпр,
	|	Данные.СуммаСценарий КАК СуммаСценарий,
	|	Данные.Аналитика_1 КАК Аналитика_1,
	|	Данные.Аналитика_2 КАК Аналитика_2,
	|	Данные.Аналитика_3 КАК Аналитика_3,
	|	Данные.Аналитика_4 КАК Аналитика_4,
	|	Данные.Аналитика_5 КАК Аналитика_5,
	|	Данные.Аналитика_6 КАК Аналитика_6,
	|	Данные.Аналитика_7 КАК Аналитика_7,
	// ++ ЕРП
	|	Данные.Аналитика_8 КАК Аналитика_8,
	|	Данные.Аналитика_9 КАК Аналитика_9,
	|	Данные.Аналитика_10 КАК Аналитика_10,
	|	Данные.Аналитика_11 КАК Аналитика_11,
	|	Данные.Аналитика_12 КАК Аналитика_12
	// -- ЕРП
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	&Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	База.НомерСтроки КАК НомерСтроки,
	|	База.Период КАК Период,
	|	База.ЦФО КАК ЦФО,
	|	База.СтатьяОборотов КАК СтатьяОборотов,
	|	База.Количество КАК Количество,
	|	База.Сумма КАК Сумма,
	|	База.Аналитика_1 КАК Аналитика_1,
	|	База.Аналитика_2 КАК Аналитика_2,
	|	База.Аналитика_3 КАК Аналитика_3,
	|	База.Аналитика_4 КАК Аналитика_4,
	|	База.Аналитика_5 КАК Аналитика_5,
	|	База.Аналитика_6 КАК Аналитика_6,
	|	База.Аналитика_7 КАК Аналитика_7,
	// ++ ЕРП
	|	База.Аналитика_8 КАК Аналитика_8,
	|	База.Аналитика_9 КАК Аналитика_9,
	|	База.Аналитика_10 КАК Аналитика_10,
	|	База.Аналитика_11 КАК Аналитика_11,
	|	База.Аналитика_12 КАК Аналитика_12
	// -- ЕРП
	|ПОМЕСТИТЬ База
	|ИЗ
	|	&База КАК База";
		
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаСоединениеТаблицРаспределения(УсловияРаспределения, ПравилаЗаполнения)
	
	// Запрос возвращает результат объединения 2х запросов: 
	// - Данных и Базы,
	// - Данных, для которых не нашлась база.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ПоляВыбораСоединение,
	|	Данные.НомерСтроки КАК ДанныеНомерСтроки,
	|	База.НомерСтроки КАК БазаНомерСтроки,
	|	Данные.Количество КАК Количество,
	|	Данные.Сумма КАК Сумма,
	|	Данные.СуммаРегл КАК СуммаРегл,
	|	Данные.СуммаУпр КАК СуммаУпр,
	|	Данные.СуммаСценарий КАК СуммаСценарий,
	|	База.Количество КАК КоэфКоличество,
	|	База.Сумма КАК КоэфСумма,
	|	Данные.Разделитель КАК Разделитель
	|ИЗ
	|	Данные КАК Данные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ База КАК База
	|		ПО (&УсловияСоединения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|		ПО (&СоединениеСоСтатьиОборотов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПоляВыбораДанные,
	|	Данные.НомерСтроки,
	|	0,
	|	Данные.Количество,
	|	Данные.Сумма,
	|	Данные.СуммаРегл,
	|	Данные.СуммаУпр,
	|	Данные.СуммаСценарий,
	|	Данные.Количество,
	|	Данные.Сумма,
	|	Данные.НомерСтроки
	|ИЗ
	|	Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ База КАК База
	|		ПО (&УсловияСоединения)
	|ГДЕ
	|	База.НомерСтроки ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Разделитель
	|ИТОГИ ПО
	|	Разделитель";
		
	НайденнаяСтрока = ПравилаЗаполнения.Найти("СтатьяОборотов", "ИмяПоля");
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат "";	
	КонецЕсли; 

	// Определяем из какой таблицы барать данные статьи оборотов.
	Если НайденнаяСтрока.ПравилоЗаполнения = "УказаноЯвно" Тогда
		СоединениеСоСтатьиОборотов = "&СтатьяОборотов = СтатьиОборотов.Ссылка";	
	ИначеЕсли СтрНачинаетсяС(НайденнаяСтрока.ПравилоЗаполнения, "Данные") Тогда
		СоединениеСоСтатьиОборотов = "Данные.СтатьяОборотов = СтатьиОборотов.Ссылка";
	ИначеЕсли СтрНачинаетсяС(НайденнаяСтрока.ПравилоЗаполнения, "База") Тогда
		СоединениеСоСтатьиОборотов = "База.СтатьяОборотов = СтатьиОборотов.Ссылка";
	Иначе	
		СоединениеСоСтатьиОборотов = "Данные.СтатьяОборотов = СтатьиОборотов.Ссылка";
	КонецЕсли; 
	
	// Описываем шаблоны фрагментов запроса.
	ШаблонФиксПолей   = "	%1 КАК %2";
	ШаблонПараметра	  = "	&%1";
	ШаблонПоляДанные  = "	Данные.%1 КАК %1"; 
	ШаблонУсловия	  = "Данные.%1 = База.%2";
	
	ШаблонПоля = 
	"	ВЫБОР КОГДА ISNULL(СтатьиОборотов.Учет_%1, ЛОЖЬ) ТОГДА 
	|		%2
	|	ИНАЧЕ
	|		НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК %3";
	
	ФиксированныеПоля = Новый Массив;
	ФиксированныеПоля.Добавить("Период");
	ФиксированныеПоля.Добавить("ЦФО");
	ФиксированныеПоля.Добавить("СтатьяОборотов");
	
	// Собираем поля выбора.	
	ПоляТаблицы			 = ПоляЗапросаСоединениеТаблицРаспределения();
	ПоляВыбораСоединение = Новый Массив;
	ПоляВыбораДанные	 = Новый Массив;

	Для каждого ТекущееПоле Из ПоляТаблицы Цикл
		СтрокаТаблицы = ПравилаЗаполнения.Найти(ТекущееПоле, "ИмяПоля"); 
		Если СтрокаТаблицы = Неопределено Тогда
			Поле = СтрШаблон("	НЕОПРЕДЕЛЕНО КАК %1", ТекущееПоле);
		Иначе	
			Если СтрокаТаблицы.ПравилоЗаполнения = "УказаноЯвно" Тогда
				ПутьКДанным = СтрШаблон(ШаблонПараметра, СтрокаТаблицы.ИмяПоля);
			ИначеЕсли СтрНачинаетсяС(СтрокаТаблицы.ПравилоЗаполнения, "Данные") Тогда
				ПутьКДанным = СтрЗаменить(СтрокаТаблицы.ПравилоЗаполнения, 
								"Данные", "Данные.");
			ИначеЕсли СтрНачинаетсяС(СтрокаТаблицы.ПравилоЗаполнения, "База") Тогда
				ПутьКДанным = СтрЗаменить(СтрокаТаблицы.ПравилоЗаполнения, 
								"База", "База.");
			КонецЕсли; 
			
			Если ФиксированныеПоля.Найти(СтрокаТаблицы.ИмяПоля) <> Неопределено Тогда
				Поле = СтрШаблон(ШаблонФиксПолей, ПутьКДанным, СтрокаТаблицы.ИмяПоля);
			Иначе	
				Поле = СтрШаблон(ШаблонПоля, СтрокаТаблицы.ИмяПоля, ПутьКДанным, СтрокаТаблицы.ИмяПоля);
			КонецЕсли;
		КонецЕсли;
		ПоляВыбораСоединение.Добавить(Поле);
		ПоляВыбораДанные.Добавить(СтрШаблон(ШаблонПоляДанные, ТекущееПоле));
	КонецЦикла;

	// Накладываем отборы на соединение таблиц
	УсловияСоединения = Новый Массив;
	Для каждого СтрокаТаблицы Из УсловияРаспределения Цикл
		УсловияСоединения.Добавить(СтрШаблон(ШаблонУсловия, СтрокаТаблицы.ПолеДанных, СтрокаТаблицы.ПолеБазы));	
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(УсловияСоединения) Тогда
		// Условия соединения не заданы.  
		УсловияСоединения.Добавить("ИСТИНА");
	КонецЕсли;

	// Собираем текст запроса.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СоединениеСоСтатьиОборотов", СоединениеСоСтатьиОборотов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыбораСоединение", СтрСоединить(ПоляВыбораСоединение, "," + Символы.ВК));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыбораДанные", СтрСоединить(ПоляВыбораДанные, "," + Символы.ВК));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловияСоединения", СтрСоединить(УсловияСоединения, " И " +  Символы.ВК));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПоляЗапросаСоединениеТаблицРаспределения()
	
	Перем ПоляТаблицы;
	
	ПоляТаблицы = Новый Массив;
	ПоляТаблицы.Добавить("Период");
	ПоляТаблицы.Добавить("ЦФО");
	ПоляТаблицы.Добавить("СтатьяОборотов");
	ПоляТаблицы.Добавить("Аналитика_1");
	ПоляТаблицы.Добавить("Аналитика_2");
	ПоляТаблицы.Добавить("Аналитика_3");
	ПоляТаблицы.Добавить("Аналитика_4");
	ПоляТаблицы.Добавить("Аналитика_5");
	ПоляТаблицы.Добавить("Аналитика_6");
	ПоляТаблицы.Добавить("Аналитика_7");
	// ++ ЕРП
	ПоляТаблицы.Добавить("Аналитика_8");
	ПоляТаблицы.Добавить("Аналитика_9");
	ПоляТаблицы.Добавить("Аналитика_10");
	ПоляТаблицы.Добавить("Аналитика_11");
	ПоляТаблицы.Добавить("Аналитика_12");
	// -- ЕРП

	Возврат ПоляТаблицы;

КонецФункции

Функция НоваяТаблицаРаспределения()

	ТаблицаРаспределения = Новый ТаблицаЗначений();	
	Реквизиты = Метаданные.Документы.бит_РаспределениеБюджета.ТабличныеЧасти.РезультатРаспределения.Реквизиты;
	Для каждого Реквизит Из Реквизиты Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаРаспределения.Колонки.Добавить(), Реквизит);
	КонецЦикла; 
	
	Возврат ТаблицаРаспределения;
	
КонецФункции
 
Функция НоваяТаблицаСоединенияТаблиц(РезультатЗапроса)

	ТаблицаСоединения = Новый ТаблицаЗначений(); 
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ТаблицаСоединения.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла; 

	Возврат ТаблицаСоединения;
	
КонецФункции

#КонецОбласти 

#Область Проведение

Процедура ИнициализироватьКлючиАналитик(Реквизиты)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Реквизиты.Регистратор);
	Запрос.УстановитьПараметр("Сценарий", 	 Реквизиты.Сценарий);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеБюджета.ЦФО КАК ЦФО,
	|	&Сценарий КАК Сценарий
	|ПОМЕСТИТЬ ДанныеБюджета
	|ИЗ
	|	Документ.бит_РаспределениеБюджета.РезультатРаспределения КАК ДанныеБюджета
	|ГДЕ
	|	ДанныеБюджета.Ссылка = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеБюджета.ЦФО,
	|	&Сценарий
	|ИЗ
	|	Документ.бит_РаспределениеБюджета.ЗависимыеОбороты КАК ДанныеБюджета
	|ГДЕ
	|	ДанныеБюджета.Ссылка = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеБюджета.ЦФО,
	|	&Сценарий
	|ИЗ
	|	Документ.бит_РаспределениеБюджета.Данные КАК ДанныеБюджета
	|ГДЕ
	|	ДанныеБюджета.Ссылка = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеБюджета.Сценарий КАК Сценарий,
	|	ДанныеБюджета.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ УникальныеДанныеБюджета
	|ИЗ
	|	ДанныеБюджета КАК ДанныеБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УникальныеДанныеБюджета.Сценарий КАК Сценарий,
	|	УникальныеДанныеБюджета.ЦФО КАК ЦФО,
	|	АналитикаСценарийЦФО.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	УникальныеДанныеБюджета КАК УникальныеДанныеБюджета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО УникальныеДанныеБюджета.Сценарий = АналитикаСценарийЦФО.Сценарий
	|			И УникальныеДанныеБюджета.ЦФО = АналитикаСценарийЦФО.ЦФО
	|ГДЕ
	|	АналитикаСценарийЦФО.КлючАналитики ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Справочники.бит_КлючиСценарийЦФО.КлючиСценарийЦФОДокумента(Выборка);
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""РезультатРаспределения"" КАК ИмяСписка,
	|	&СинонимРаспределение КАК СинонимСписка,
	|	Распределение.НомерСтроки КАК НомерСтроки,
	|	Распределение.Период КАК Период,
	|	&Сценарий КАК Сценарий,
	|	&Валюта КАК Валюта,
	|	Распределение.Количество КАК Количество,
	|	Распределение.Сумма КАК Сумма,
	|	0 КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаСценарий,
	|	Распределение.ЦФО КАК ЦФО,
	|	Распределение.СтатьяОборотов КАК СтатьяОборотов,
	|	ИСТИНА КАК ВыполнятьВалютныеРасчеты,
	|	Распределение.Комментарий КАК Комментарий,
	|	Распределение.СтатьяОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	Распределение.Аналитика_1 КАК Аналитика_1,
	|	Распределение.Аналитика_2 КАК Аналитика_2,
	|	Распределение.Аналитика_3 КАК Аналитика_3,
	|	Распределение.Аналитика_4 КАК Аналитика_4,
	|	Распределение.Аналитика_5 КАК Аналитика_5,
	|	Распределение.Аналитика_6 КАК Аналитика_6,
	|	Распределение.Аналитика_7 КАК Аналитика_7,
	// ++ ЕРП
	|	Распределение.Аналитика_8 КАК Аналитика_8,
	|	Распределение.Аналитика_9 КАК Аналитика_9,
	|	Распределение.Аналитика_10 КАК Аналитика_10,
	|	Распределение.Аналитика_11 КАК Аналитика_11,
	|	Распределение.Аналитика_12 КАК Аналитика_12
	// -- ЕРП
	|ПОМЕСТИТЬ ВременнаяТаблицаДокумента
	|ИЗ
	|	Документ.бит_РаспределениеБюджета.РезультатРаспределения КАК Распределение
	|ГДЕ
	|	Распределение.Ссылка = &Ссылка
	|	И (Распределение.Сумма <> 0
	|			ИЛИ Распределение.Количество <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ЗависимыеОбороты"",
	|	&СинонимРаспределение,
	|	Зависимые.НомерСтроки,
	|	Зависимые.Период,
	|	&Сценарий,
	|	&Валюта,
	|	Зависимые.Количество,
	|	Зависимые.Сумма,
	|	0,
	|	0,
	|	0,
	|	Зависимые.ЦФО,
	|	Зависимые.СтатьяОборотов,
	|	ИСТИНА,
	|	"""",
	|	Зависимые.СтатьяОборотов.ЭтоКоэффициент,
	|	Зависимые.Аналитика_1,
	|	Зависимые.Аналитика_2,
	|	Зависимые.Аналитика_3,
	|	Зависимые.Аналитика_4,
	|	Зависимые.Аналитика_5,
	|	Зависимые.Аналитика_6,
	|	Зависимые.Аналитика_7,
	// ++ ЕРП
	|	Зависимые.Аналитика_8,
	|	Зависимые.Аналитика_9,
	|	Зависимые.Аналитика_10,
	|	Зависимые.Аналитика_11,
	|	Зависимые.Аналитика_12
	// -- ЕРП
	|ИЗ
	|	Документ.бит_РаспределениеБюджета.ЗависимыеОбороты КАК Зависимые
	|ГДЕ
	|	Зависимые.Ссылка = &Ссылка
	|	И (Зависимые.Сумма <> 0
	|			ИЛИ Зависимые.Количество <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Данные"",
	|	&СинонимДанные,
	|	Данные.НомерСтроки,
	|	Данные.Период,
	|	ВЫБОР
	|		КОГДА Данные.Сценарий = &ПустойСценарий
	|			ТОГДА &Сценарий
	|		ИНАЧЕ Данные.Сценарий
	|	КОНЕЦ,
	|	&Валюта,
	|	-Данные.Количество,
	|	-Данные.Сумма,
	|	-Данные.СуммаРегл,
	|	-Данные.СуммаУпр,
	|	-Данные.СуммаСценарий,
	|	Данные.ЦФО,
	|	Данные.СтатьяОборотов,
	|	Данные.Регистратор = НЕОПРЕДЕЛЕНО,
	|	"""",
	|	Данные.СтатьяОборотов.ЭтоКоэффициент,
	|	Данные.Аналитика_1,
	|	Данные.Аналитика_2,
	|	Данные.Аналитика_3,
	|	Данные.Аналитика_4,
	|	Данные.Аналитика_5,
	|	Данные.Аналитика_6,
	|	Данные.Аналитика_7,
	// ++ ЕРП
	|	Данные.Аналитика_8,
	|	Данные.Аналитика_9,
	|	Данные.Аналитика_10,
	|	Данные.Аналитика_11,
	|	Данные.Аналитика_12
	// -- ЕРП
	|ИЗ
	|	Документ.бит_РаспределениеБюджета.Данные КАК Данные
	|ГДЕ
	|	Данные.Ссылка = &Ссылка
	|	И &СторнироватьДанные";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Функция ТекстЗапросаТаблицыВалютногоПерерасчета(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВремТаблицаПериодов",НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПериодов",	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Сценарии",			НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Период КАК Период,
	|	Распределение.Сценарий КАК Сценарий,
	|	Распределение.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВремТаблицаПериодов
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК Распределение
	|
	|ГДЕ
	|	Распределение.ВыполнятьВалютныеРасчеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремТаблицаПериодов.Период КАК Период,
	|	ВремТаблицаПериодов.Сценарий КАК Сценарий
	|ИЗ
	|	ВремТаблицаПериодов КАК ВремТаблицаПериодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремТаблицаПериодов.Сценарий КАК Сценарий,
	|	ВремТаблицаПериодов.Валюта КАК Валюта
	|ИЗ
	|	ВремТаблицаПериодов КАК ВремТаблицаПериодов";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаТаблицаОборотыПоБюджетам(НомераТаблиц)
	
	НомераТаблиц.Вставить("ТаблицаОборотыПоБюджетам", НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДанные.ИмяСписка КАК ИмяСписка,
	|	ТаблицаДанные.СинонимСписка КАК СинонимСписка,
	|	ТаблицаДанные.ВыполнятьВалютныеРасчеты КАК ВыполнятьВалютныеРасчеты,
	|	ТаблицаДанные.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанные.Сценарий КАК Сценарий,
	|	ТаблицаДанные.Валюта КАК Валюта,
	|	ТаблицаДанные.ЦФО КАК ЦФО,
	|	ТаблицаДанные.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДанные.Количество КАК Количество,
	|	ТаблицаДанные.Сумма КАК Сумма,
	|	ТаблицаДанные.Период КАК Период,
	|	ТаблицаДанные.Комментарий КАК Комментарий,
	|	ТаблицаДанные.СуммаРегл КАК СуммаРегл,
	|	ТаблицаДанные.СуммаУпр КАК СуммаУпр,
	|	ТаблицаДанные.СуммаСценарий КАК СуммаСценарий,
	|	ЕСТЬNULL(АналитикаСценарийЦФО.КлючАналитики, ЗНАЧЕНИЕ(Справочник.бит_КлючиСценарийЦФО.ПустаяСсылка)) КАК КлючСценарийЦФО,
	|	ТаблицаДанные.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	ТаблицаДанные.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаДанные.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаДанные.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаДанные.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаДанные.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаДанные.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаДанные.Аналитика_7 КАК Аналитика_7,
	// ++ ЕРП
	|	ТаблицаДанные.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаДанные.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаДанные.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаДанные.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаДанные.Аналитика_12 КАК Аналитика_12
	// -- ЕРП
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ТаблицаДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО ТаблицаДанные.ЦФО = АналитикаСценарийЦФО.ЦФО
	|			И ТаблицаДанные.Сценарий = АналитикаСценарийЦФО.Сценарий
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИмяСписка,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Процедура ПодготовитьТаблицыДокументаРасчетыВВалюте(ПараметрыПроведения, Реквизиты)

	Если ПараметрыПроведения.ТаблицаОборотыПоБюджетам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПериодов	  = ПараметрыПроведения.ТаблицаПериодов;
	ОборотыПоБюджетам = ПараметрыПроведения.ТаблицаОборотыПоБюджетам;
		
	Валюты			= бит_Бюджетирование.ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(Реквизиты.Сценарий, Реквизиты.ВалютаДокумента);
	КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, Валюты, Реквизиты.Сценарий);
	
	ДанныеДляПерерасчета = ОборотыПоБюджетам.НайтиСтроки(Новый Структура("ВыполнятьВалютныеРасчеты", Истина));
	
	бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(ДанныеДляПерерасчета, КурсыПоПериодам, Реквизиты.КурсыВалют);	
	
КонецПроцедуры

#КонецОбласти // Проведение

Функция ТаблицаОборотыПоБюджету(НастройкаРаспределения, ПараметрыПолученияДанных, ЭтоДанные = Истина, ДополнительныйОтбор = Неопределено)

	Если НЕ ЗначениеЗаполнено(НастройкаРаспределения) Тогда
		ВызватьИсключение НСтр("ru='Не заполнена настройка распределения.';en='Distribution configuration in incomplete.'");
	КонецЕсли;
	
	СписокРеквизитовНастройки = "ХранилищеНастроекДанные, ХранилищеНастроекБаза";
	РеквизитыНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаРаспределения, СписокРеквизитовНастройки);

	Если ЭтоДанные Тогда
		НастройкиПользователя = РеквизитыНастройки.ХранилищеНастроекДанные.Получить();
	Иначе	
	    НастройкиПользователя = РеквизитыНастройки.ХранилищеНастроекБаза.Получить();
	КонецЕсли;   
	
	ПараметрыЗаполнены = Истина;
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	ПараметрыПолученияДанных.Вставить("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	
	СКД = Справочники.бит_НастройкиРаспределенияБюджета.ПолучитьМакет("СхемаКомпоновкиДанных");
	
	Если ДополнительныйОтбор <> Неопределено Тогда
		Для каждого ЭлементОтбора Из ДополнительныйОтбор Цикл
			Если ЭлементОтбора.Значение.Использовать Тогда
				Элемент = НастройкиПользователя.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				Элемент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ЭлементОтбора.Ключ);
				Элемент.ПравоеЗначение = ЭлементОтбора.Значение.Значение;
				Элемент.Использование  = ЭлементОтбора.Значение.Использовать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	// Скопируем отборы пользователя в настройки по умолчанию СКД.
	Если НастройкиПользователя <> Неопределено Тогда
		ДобавитьЭлементыНастроекСКД(СКД, НастройкиПользователя);
	КонецЕсли;
	
	// Заполним параметры в СКД
	Для каждого Параметр Из СКД.Параметры Цикл
		Если НЕ ПараметрыПолученияДанных.Свойство(Параметр.Имя, Параметр.Значение) Тогда
			ТекстСообщения = НСтр("ru='Не задано значение параметра: %1';en='Not defined value: %1'");
			ВызватьИсключение СтрШаблон(ТекстСообщения, Параметр.Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	// Инициализация настроек	
	АдресСкд 	 = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСкд);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
	ОтключенныеПоляГруппировок = Новый Массив;
	Если НастройкиПользователя <> Неопределено Тогда
		Для каждого ПолеВыбора Из НастройкиПользователя.Выбор.Элементы Цикл
			Если НЕ ПолеВыбора.Использование Тогда
				ОтключенныеПоляГруппировок.Добавить(ПолеВыбора.Поле);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОтключенныеПоляГруппировок.Количество() > 0 Тогда
		Для каждого ПолеВыбора Из КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
			Если ОтключенныеПоляГруппировок.Найти(ПолеВыбора.Поле) <> Неопределено Тогда
				ПолеВыбора.Использование = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	// Передаем в макет компоновки схему, настройки и данные расшифровки.
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.ПолучитьНастройки(), , ,
	Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Выполним компоновку с помощью процессора компоновки.
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	// Вывод таблицы.
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// Группировка по указанным полям группировок.
	ТипРесурса = Тип("Число");
	СтрокаПолей = ""; СтрокаРесурсов = "";
	Для каждого КолонкаТаблицы Из ТаблицаРезультат.Колонки Цикл
		Если КолонкаТаблицы.ТипЗначения.СодержитТип(ТипРесурса) Тогда
			СтрокаРесурсов = ?(СтрокаРесурсов = "", КолонкаТаблицы.Имя, СтрокаРесурсов + ", " + КолонкаТаблицы.Имя);	
		Иначе	
			СтрокаПолей = ?(СтрокаПолей = "", КолонкаТаблицы.Имя, СтрокаПолей + ", " + КолонкаТаблицы.Имя);
		КонецЕсли;   	
	КонецЦикла;
	ТаблицаРезультат.Свернуть(СтрокаПолей, СтрокаРесурсов);
		
	Возврат ТаблицаРезультат;
	
КонецФункции

Процедура ДобавитьЭлементыОтбора(Элементы, КоллекцияЭлементов)

	Для каждого Элем Из КоллекцияЭлементов Цикл
		Если ТипЗнч(Элем) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЭлементОтбора = Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ЭлементОтбора, Элем);
		Иначе	
			ЭлементОтбора = Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ЭлементОтбора, Элем);
			ДобавитьЭлементыОтбора(ЭлементОтбора.Элементы, Элем.Элементы);
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры

Процедура ДобавитьЭлементыНастроекСКД(СКД, НастройкиПользователя) 

	СКД.НастройкиПоУмолчанию.Отбор.Элементы.Очистить();
	ДобавитьЭлементыОтбора(СКД.НастройкиПоУмолчанию.Отбор.Элементы, НастройкиПользователя.Отбор.Элементы);

КонецПроцедуры

Функция ПолучитьНомерПериодичности(Периодичность)

	Если Периодичность = Перечисления.бит_ПериодичностьПланирования.Неделя Тогда
	
		НомерПериодичности = 7;
		
	ИначеЕсли Периодичность = Перечисления.бит_ПериодичностьПланирования.Декада Тогда
	
		НомерПериодичности = 8;
		
	ИначеЕсли Периодичность = Перечисления.бит_ПериодичностьПланирования.Месяц Тогда
	
		НомерПериодичности = 9;
		
	ИначеЕсли Периодичность = Перечисления.бит_ПериодичностьПланирования.Квартал Тогда
	
		НомерПериодичности = 10;
		
	ИначеЕсли Периодичность = Перечисления.бит_ПериодичностьПланирования.Полугодие Тогда
	
		НомерПериодичности = 11;
		
	ИначеЕсли Периодичность = Перечисления.бит_ПериодичностьПланирования.Год Тогда
	
		НомерПериодичности = 12;
	Иначе	
		НомерПериодичности = 6;
	КонецЕсли; 
	
	Возврат НомерПериодичности;	

КонецФункции // СформироватьСоответствиеПериодичность()

Функция НовыеПараметрыПолученияДанных()
	
	НовыеПараметры = Новый Структура;
	НовыеПараметры.Вставить("НачалоПериода", 	  '0001-01-01');
	НовыеПараметры.Вставить("КонецПериода", 	  '0001-01-01');
	НовыеПараметры.Вставить("ДатаДокумента", 	  '0001-01-01');
	НовыеПараметры.Вставить("ВалютаДокумента", 	  Справочники.Валюты.ПустаяСсылка());
	НовыеПараметры.Вставить("КурсДокумента", 	  1);
	НовыеПараметры.Вставить("КратностьДокумента", 1);
	НовыеПараметры.Вставить("Регистратор", 		  Неопределено);
	НовыеПараметры.Вставить("Периодичность",	  0 );
	
	Возврат НовыеПараметры;

КонецФункции

#КонецОбласти

#КонецЕсли
