

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 	
	
	// Выведем установленный заголовок.
    бит_НазначениеСинонимовОбъектов.ВывестиЗаголовокФормы(МетаданныеОбъекта
														 ,ЭтотОбъект
														 ,Перечисления.бит_ВидыФормОбъекта.Элемента
														 ,Объект);
														 
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.Код) Тогда
	
		Объект.Код = СтрЗаменить(ТРег(Объект.Наименование)," ","");
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	Объект.Код = СтрЗаменить(Объект.Код," ","");
	СпецСимволы = " ,;:[]{}'""/\?!@#$%^&*+=<>~`|()1234567890№";
	Объект.Код = бит_СтрокиКлиент.ПроверитьСпецСимволы(Объект.Код,СпецСимволы,"Имя");
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = СокрЛП(Объект.Код);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()

	Элементы.Код.ТолькоПросмотр         = Объект.Предопределенный;
	Элементы.ТипЗначения.ТолькоПросмотр = Объект.Предопределенный;

КонецПроцедуры // УстановитьВидимость()

#КонецОбласти