
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [15.08.2025 0:35:57] +        
	ИзменитьОперации();
	ИзменитьОперацииНаКонтроле();
	// }}ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [15.08.2025 0:35:57] -
КонецПроцедуры                   

&НаСервере
Процедура ИзменитьОперации() 
	// {{ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [15.08.2025 0:37:28] +        
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОперацииПереопределяемый.Этап КАК Этап,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ КАК ЗаказКлиента
		|ПОМЕСТИТЬ втЗаказыКлиентаВсе
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2 КАК ОперацииПереопределяемый
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
		|		ПО (ОперацииПереопределяемый.Этап = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка)
		|ГДЕ
		|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
		|	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаказыКлиентаВсе.Этап КАК Этап,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втЗаказыКлиентаВсе.ЗаказКлиента) КАК ЗаказКлиента
		|ПОМЕСТИТЬ втОдинЭтапОдинЗаказ
		|ИЗ
		|	втЗаказыКлиентаВсе КАК втЗаказыКлиентаВсе
		|
		|СГРУППИРОВАТЬ ПО
		|	втЗаказыКлиентаВсе.Этап
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втЗаказыКлиентаВсе.ЗаказКлиента) = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////

		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииПереопределяемый.Ссылка            КАК Ссылка,
		|	ОперацииПереопределяемый.Номер             КАК Номер,
		|	ОперацииПереопределяемый.Дата              КАК Дата,
		|	ОперацииПереопределяемый.Статус            КАК Статус,
		|	ОперацииПереопределяемый.Операция          КАК Операция,
		|	ОперацииПереопределяемый.Наименование      КАК ОперацияНаименование,
		|	ОперацииПереопределяемый.Этап              КАК Этап,
		|	&ПредставлениеЭтапа                        КАК ПредставлениеЭтапа,
		|	ОперацииПереопределяемый.Участок           КАК Участок,
		|	ОперацииПереопределяемый.Исполнитель       КАК Исполнитель,
		|	ОперацииПереопределяемый.СменноеЗадание    КАК СменноеЗадание,
		|	ОперацииПереопределяемый.РабочийЦентр      КАК РабочийЦентр,
		|	ОперацииПереопределяемый.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ОперацииПереопределяемый.ВариантНаладки    КАК ВариантНаладки,
		|	ОперацииПереопределяемый.ТребуетПовторения КАК ТребуетПовторения,
		|	ОперацииПереопределяемый.МожноПропустить   КАК МожноПропустить,
		|	
		|	ВЫБОР
		|		КОГДА ОперацииПереопределяемый.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроизводственныхОпераций.Выполнена)
		|			ТОГДА ОперацииПереопределяемый.КоличествоФакт
		|					+ ОперацииПереопределяемый.КоличествоНаКонтроле
		|					+ ОперацииПереопределяемый.КоличествоНаДоработке
		|					+ ОперацииПереопределяемый.КоличествоБрак
		|		ИНАЧЕ ОперацииПереопределяемый.Количество
		|					- ОперацииПереопределяемый.КоличествоОтменено
		|	КОНЕЦ                                      КАК Количество,
		|	
		|	ОперацииПереопределяемый.Проведен
		|		И ОперацииПереопределяемый.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроизводственныхОпераций.Создана)
		|		И НЕ ЕСТЬNULL(ОчередьПереопределяемый.ВАрхиве, ИСТИНА)
		|		И ЕСТЬNULL(ОчередьПереопределяемый.МожноВыполнять, 0) <> 0 КАК МожноВыполнять,
		|	
		|	ВЫБОР
		|		КОГДА ОперацииПереопределяемый.Проведен
		|			И ОперацииПереопределяемый.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроизводственныхОпераций.Создана)
		|			И НЕ ЕСТЬNULL(ОчередьПереопределяемый.ВАрхиве, ИСТИНА)
		|			ТОГДА ЕСТЬNULL(ОчередьПереопределяемый.МожноВыполнять, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ                                      КАК КоличествоКВыполнению,
		|	
		|	ОперацииПереопределяемый.КоличествоНаКонтроле  КАК КоличествоНаКонтроле,
		|	ОперацииПереопределяемый.КоличествоНаДоработке КАК КоличествоНаДоработке,
		|	ОперацииПереопределяемый.КоличествоБрак        КАК КоличествоБрак,
		|	ОперацииПереопределяемый.КоличествоОтменено    КАК КоличествоОтменено,
		|	ОперацииПереопределяемый.КоличествоФакт        КАК КоличествоФакт 
		|, ЕСТЬNULL(влКомментарийЗаказаКлиента.бит_КомментарийЗаказаКлиента, """") КАК бит_КомментарийЗаказаКлиента
		|	
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2 КАК ОперацииПереопределяемый
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПроизводственныхОпераций КАК ОчередьПереопределяемый
		|		ПО ОперацииПереопределяемый.Подразделение            = ОчередьПереопределяемый.Подразделение
		|			И ОперацииПереопределяемый.Этап                  = ОчередьПереопределяемый.Этап
		|			И ОперацииПереопределяемый.Операция              = ОчередьПереопределяемый.Операция
		|			И ОперацииПереопределяемый.ИдентификаторОперации = ОчередьПереопределяемый.ИдентификаторОперации
		|   
		
		|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВЫРАЗИТЬ(втЗаказыКлиентаВсе.ЗаказКлиента.Комментарий КАК СТРОКА(1024)) КАК бит_КомментарийЗаказаКлиента,
		|			втЗаказыКлиентаВсе.Этап КАК Этап
		|		ИЗ
		|			втЗаказыКлиентаВсе КАК втЗаказыКлиентаВсе
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОдинЭтапОдинЗаказ КАК втОдинЭтапОдинЗаказ
		|				ПО втЗаказыКлиентаВсе.Этап = втОдинЭтапОдинЗаказ.Этап) КАК влКомментарийЗаказаКлиента
		|		ПО (влКомментарийЗаказаКлиента.Этап = ОперацииПереопределяемый.Этап)

		
		|"; 
	
	Операции.ТекстЗапроса = ТекстЗапроса;
	
	НовыйЭлемент = Элементы.Вставить("Операциибит_КомментарийЗаказаКлиента", Тип("ПолеФормы"), Элементы.Операции, Элементы.ОперацииСменноеЗадание);
	НовыйЭлемент.ПутьКДанным = "Операции.бит_КомментарийЗаказаКлиента";
	НовыйЭлемент.Заголовок = "(бит) Комментарий заказа клиента";

	// }}ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [15.08.2025 0:37:28] -
КонецПроцедуры

&НаСервере
Процедура ИзменитьОперацииНаКонтроле() 
	// {{ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [15.08.2025 0:37:28] +        
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОперацииПереопределяемый.Этап КАК Этап,
		|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ КАК ЗаказКлиента
		|ПОМЕСТИТЬ втЗаказыКлиентаВсе
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2 КАК ОперацииПереопределяемый
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
		|		ПО (ОперацииПереопределяемый.Этап = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка)
		|ГДЕ
		|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
		|	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И ОперацииПереопределяемый.Проведен
		|	И ОперацииПереопределяемый.КоличествоНаКонтроле > 0

		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаказыКлиентаВсе.Этап КАК Этап,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втЗаказыКлиентаВсе.ЗаказКлиента) КАК ЗаказКлиента
		|ПОМЕСТИТЬ втОдинЭтапОдинЗаказ
		|ИЗ
		|	втЗаказыКлиентаВсе КАК втЗаказыКлиентаВсе
		|
		|СГРУППИРОВАТЬ ПО
		|	втЗаказыКлиентаВсе.Этап
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втЗаказыКлиентаВсе.ЗаказКлиента) = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////

	    |ВЫБРАТЬ
		|	Операции.Ссылка КАК Ссылка,
		|	Операции.Номер КАК Номер,
		|	Операции.Дата КАК Дата,
		|	Операции.Статус КАК Статус,
		|	Операции.Операция КАК Операция,
		|	Операции.Наименование КАК ОперацияНаименование,
		|	Операции.Участок КАК Участок,
		|	Операции.Исполнитель КАК Исполнитель,
		|	Операции.СменноеЗадание КАК СменноеЗадание,
		|	Операции.Этап.ПартияПроизводства.ОсновноеИзделиеНоменклатура   КАК Номенклатура,
		|	Операции.Этап.ПартияПроизводства.ОсновноеИзделиеХарактеристика КАК Характеристика,
		|	Операции.РабочийЦентр КАК РабочийЦентр,
		|	Операции.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	Операции.КоличествоНаКонтроле КАК КоличествоНаКонтроле,
		|	Операции.ПовторныйКонтроль КАК ПовторныйКонтроль,
		|	Операции.НаОснованииНСИ КАК НаОснованииНСИ,
		|	Операции.ОперацияКакРаспоряжениеВыработки КАК ОперацияКакРаспоряжениеВыработки,
		|	Операции.Этап КАК Этап
		
		|, ЕСТЬNULL(влКомментарийЗаказаКлиента.бит_КомментарийЗаказаКлиента, """") КАК бит_КомментарийЗаказаКлиента
		
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2 КАК Операции   
		
		|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВЫРАЗИТЬ(втЗаказыКлиентаВсе.ЗаказКлиента.Комментарий КАК СТРОКА(1024)) КАК бит_КомментарийЗаказаКлиента,
		|			втЗаказыКлиентаВсе.Этап КАК Этап
		|		ИЗ
		|			втЗаказыКлиентаВсе КАК втЗаказыКлиентаВсе
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОдинЭтапОдинЗаказ КАК втОдинЭтапОдинЗаказ
		|				ПО втЗаказыКлиентаВсе.Этап = втОдинЭтапОдинЗаказ.Этап) КАК влКомментарийЗаказаКлиента
		|		ПО (влКомментарийЗаказаКлиента.Этап = Операции.Этап)
		|ГДЕ
		|	Операции.Проведен
		|	И Операции.КоличествоНаКонтроле > 0
		|";
	
	ОперацииНаКонтроле.ТекстЗапроса = ТекстЗапроса;
	
	НовыйЭлемент = Элементы.Вставить("ОперацииНаКонтролебит_КомментарийЗаказаКлиента", Тип("ПолеФормы"), Элементы.ОперацииНаКонтроле, Элементы.ОперацииНаКонтролеСменноеЗадание);
	НовыйЭлемент.ПутьКДанным = "ОперацииНаКонтроле.бит_КомментарийЗаказаКлиента";
	НовыйЭлемент.Заголовок = "(бит) Комментарий заказа клиента";

	// }}ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [15.08.2025 0:37:28] -
КонецПроцедуры
