#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;
	КонецЕсли;
	
    СтруктураИзмерений = Новый Структура;
    СтруктураИзмерений.Вставить("ИмяРегистра"          , "бит_СоответствиеСтатейПоступленияИРасходованияДС");
    СтруктураИзмерений.Вставить("ИмяИзмерения_Объект"  , "СтатьяПоступления");
    СтруктураИзмерений.Вставить("ИмяИзмерения_Значения", "СтатьяРасходования");
    
    // Проверим уникальность набора записей.
    бит_Бюджетирование.ПроверитьУникальностьСопоставленныхЗначений_ОбъектамВНабореЗаписей(ЭтотОбъект, СтруктураИзмерений, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли