#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// 	Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
// 	Реквизиты - Массив - список имен реквизитов объекта.
//
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("НаборыЗначенийДоступа.*");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
			
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП 
	СовместимоУП = Истина;
	// -- ЕРП 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	// ++ ЕРП 	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки 		 = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_БюджетнаяОперация КАК Таблица
	|ГДЕ
	|	Таблица.Проведен
	|	И НЕ Таблица.ОтправленНаСогласование";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	// -- ЕРП 	
	
КонецПроцедуры

// Обработчик обновления
// 
// Параметры:
// 	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки 
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	// ++ ЕРП 	
	Параметры.ОбработкаЗавершена = Ложь;
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ПолноеИмяОбъекта  = МетаданныеОбъекта.ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена =
			ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	ИсключенияПриОбновлении = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеДляОбновления", ОбновляемыеДанные);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДляОбновления.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	&ДанныеДляОбновления КАК ДанныеДляОбновления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокумента.ВерсияДанных КАК ВерсияДанных
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_БюджетнаяОперация КАК ДанныеДокумента
	|		ПО ТаблицаДокументов.Ссылка = ДанныеДокумента.Ссылка";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПричинаИсключения = 0;
		Рекомендация = "";
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = 1; // Блокировка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			ПредставлениеСсылки = Строка(Выборка.Ссылка);
			ДокументОбъект	    = Выборка.Ссылка.ПолучитьОбъект();
			
			Если ДокументОбъект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			ИначеЕсли ДокументОбъект.ВерсияДанных <> Выборка.ВерсияДанных Тогда
				ДокументОбъект = Неопределено;
			КонецЕсли;	
							
			ОбъектИзменен = Ложь;
			
			Если ДокументОбъект <> Неопределено Тогда
				ДокументОбъект.ОтправленНаСогласование = Истина;
				ОбъектИзменен = Истина;
			КонецЕсли;
			
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(Выборка.Ссылка, ПредставлениеСсылки, 
				ИнформацияОбОшибке());			
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена =
		ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		
	ИмяПроцедуры = "ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Процедуре ""%1"" не удалось обработать некоторые документы ""Бюджетная операция (БИТ)"" (пропущены): %2'; 
								|en = '""%1"": some documents ""Budget Transaction"" could not be processed (skipped): %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ИмяПроцедуры, ПроблемныхОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция документов ""Бюджетная операция (БИТ)"": %1';
								|en = 'The next batch of documents ""Budget Transaction"" has been processed: %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	// -- ЕРП 	
	
КонецПроцедуры

#КонецОбласти

// Функция определяет новый статус объекта.
// Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_БюджетнаяОперация.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_СтатусыОбъектов - новый статус объекта.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Возврат бит_ВизированиеСервер.НовыйСтатусПоСтандартномуАлгоритму(ТекущийОбъект, ПараметрыУстановкиСтатуса);
	
КонецФункции

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.КурсДокумента КАК Курс,
	|	Реквизиты.КратностьДокумента КАК Кратность,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.Сценарий.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария,
	|	Реквизиты.ЕдиницаИзмеренияСумм КАК ЕдиницаИзмеренияСумм,
	|	Реквизиты.СписатьЛимиты КАК СписатьЛимиты,
	|	Реквизиты.РежимПринятияКУчету КАК РежимПринятияКУчету
	|ИЗ
	|	Документ.бит_БюджетнаяОперация КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Результат    	 = Запрос.Выполнить();
	ТаблицаРеквизиты = Результат.Выгрузить();
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
		
	Если НЕ бит_ОбщегоНазначения.ВалютаУпрУчетаУстановлена(Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	ПриниматьКУчету 		  = Истина;
	ПроводитьПослеУтверждения = ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения");   
	
	Если ПроводитьПослеУтверждения И Реквизиты.РежимПринятияКУчету = 1 Тогда
		ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(ДокументСсылка);
		Если НЕ Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ТекущийСтатус,
				Перечисления.бит_ТипыСтатусовОбъектов.Утвержден) Тогда
			ПриниматьКУчету = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыПроведения.Вставить("ТаблицаОборотыПоБюджетам", Новый ТаблицаЗначений);
	
	КоэффициентСуммы = бит_ОбщегоНазначения.ПолучитьРазмерностьЕдиницыИзмеренияСумм(Реквизиты.ЕдиницаИзмеренияСумм);
	КурсыВалют = бит_Бюджетирование.КурсыВалютСценария(Реквизиты.Регистратор, 
											Реквизиты.Дата, Новый Структура("Документ, Регл, Упр, Сценарий"));
	Реквизиты.Вставить("КоэффициентСуммы", КоэффициентСуммы);
	Реквизиты.Вставить("КурсыВалют", КурсыВалют);

	ПараметрыНастройки 		= Новый Структура("ЦФО", Реквизиты.ЦФО);
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(ПараметрыНастройки, Реквизиты.Дата);
	
	Запрос.УстановитьПараметр("НеУчитыватьСверхБюджета",НеУчитыватьСверхБюджета);
	Запрос.УстановитьПараметр("КоэффициентСуммы",		Реквизиты.КоэффициентСуммы);
	Запрос.УстановитьПараметр("Сценарий",				Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("Валюта",					Реквизиты.Валюта);
	Запрос.УстановитьПараметр("СинонимБДДС",			НСтр("ru = 'Данные бюджета'; en = 'Budget Data'"));
	Запрос.УстановитьПараметр("СинонимЗависимыеОбороты",НСтр("ru = 'Зависимые обороты'; en = 'Dependent Line-Items'"));
	
	ИнициализироватьКлючиАналитик(Реквизиты);
	
	НомераТаблиц = Новый Структура(); 
	ТекстЗапроса = ТекстЗапросаВременнаяТаблицаДокумента(НомераТаблиц)
				 + ТекстЗапросаТаблицыВалютногоПерерасчета(НомераТаблиц)
				 + ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц)
				 + ТекстЗапросаТаблицаОборотыПоБюджетам(НомераТаблиц, ПриниматьКУчету);

	Запрос.Текст = ТекстЗапроса;			 
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);

	ПодготовитьТаблицыДокументаРасчетыВВалюте(ПараметрыПроведения, Реквизиты);
	
	ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ПараметрыПроведения.ИсполнениеБюджета, 
		ПараметрыПроведения.ИсполнениеБюджетаРеквизиты);
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

// Формирует движения по регистру накопления: Обороты по бюджетам (БИТ).
//
// Параметры:
//  ДанныеБюджета	 - ТаблицаЗначений	 - получаемая ранее.
//  Реквизиты		 - ТаблицаЗначений	 - таблица реквизитов по документу.
//  Движения		 - КоллекцияДвижений - Ссылка на движения документа.
//  Отказ			 - Булево			 - флаг отказа от проведения.
//
Процедура СформироватьДвиженияОборотыПоБюджетам(ДанныеБюджета, Реквизиты, Движения, Отказ) Экспорт 
	
	Для каждого СтрокаТаблицы Из ДанныеБюджета Цикл
		Движение = Движения.бит_ОборотыПоБюджетам.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);
	КонецЦикла; 
	Движения.бит_ОборотыПоБюджетам.Записывать = Истина;
	
КонецПроцедуры

// Формирует движения по регистру бухгалтерии: Журнал проводок (бюджетирование).
//
// Параметры:
//  ДанныеБюджета	 - ТаблицаЗначений	 - получаемая ранее.
//  Реквизиты		 - ТаблицаЗначений	 - таблица реквизитов по документу.
//  Движения		 - КоллекцияДвижений - Ссылка на движения документа.
//  Отказ			 - Булево			 - флаг отказа от проведения.
//
Процедура СформироватьДвиженияБюджетирование(ДанныеБюджета, Реквизиты, Движения, Отказ) Экспорт 
	
	Если ДанныеБюджета.Количество() > 0 Тогда
		бит_Бюджетирование.СформироватьПроводкиБюджетирования(ДанныеБюджета,
			Движения.бит_Бюджетирование, Ложь);
	КонецЕсли;
	Движения.бит_Бюджетирование.Записывать = Истина;
	
КонецПроцедуры

Функция ДанныеПоКурсовымРазницам(СхемаКомпоновкиДанных, ПараметрыЗадания) Экспорт

	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ПараметрыЗадания.КлючФоновогоЗадания, 
		"НастройкиФоновогоЗадания_" + ПараметрыЗадания.ИдентификаторФормы);
	
	Если ТипЗнч(Настройки) <> Тип("НастройкиКомпоновкиДанных") Тогда
		ВызватьИсключение НСтр("ru = 'Тип параметра несоответствует ожидаемому.'");
	КонецЕсли;
	
	АдресХранилищаСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ПолучитьИзВременногоХранилища(АдресХранилищаСКД), Настройки,,,
						Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	// Выполнение компоновки с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	Результат = Новый ТаблицаЗначений;
	
	// Вывод таблицы   	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.УстановитьОбъект(Результат); 	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьКомпоновщикПолученияДанныхПоКурсовымРазницам(КомпоновщикНастроек, 
			НастройкиКомпоновкиДанных, АдресСхемыКомпоновкиДанных) Экспорт
			
	СхемаКомпоновкиДанных = МакетОтражениеКурсовыхРазниц();
	
	ИмяДопИзмененияОрганизация = бит_МеханизмДопИзмерений.ИмяДопИзмененияОрганизация();
	НастройкиИзмерений 		   = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	ВГраница		   		   = бит_МеханизмДопИзмеренийКлиентСерверПереопределяемый.КоличествоДополнительныхИзмерений();
	
	Для Номер = 1 По ВГраница Цикл
		ИмяПоля			= "Аналитика_" + Номер;  
		НастройкаИзмерения = НастройкиИзмерений.Получить(ИмяПоля);
		
		Если НастройкаИзмерения = Неопределено Тогда
			ЗаголовокПоля	= НСтр("ru = 'Не используется'; en = 'obsolete'");
			Выражение 		= "";
			ДоступОграничен = Истина;
		ИначеЕсли ИмяПоля = ИмяДопИзмененияОрганизация Тогда
			ЗаголовокПоля 	= НСтр("ru = 'Организация (аналитика)'");
			Выражение	  	= "Организация";
			ДоступОграничен = Ложь;
		// ++ ЕРП 	
		ИначеЕсли НастройкаИзмерения.Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Контрагент Тогда
			ЗаголовокПоля 	= НастройкаИзмерения.Синоним;
			Выражение	  	= "Контрагент";
			ДоступОграничен = Ложь;  
		ИначеЕсли НастройкаИзмерения.Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ДоговорКонтрагента Тогда
			ЗаголовокПоля 	= НастройкаИзмерения.Синоним;
			Выражение	  	= "ДоговорКонтрагента";
			ДоступОграничен = Ложь;
		ИначеЕсли НастройкаИзмерения.Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.БанковскийСчет Тогда
			ЗаголовокПоля 	= НастройкаИзмерения.Синоним;
			Выражение	  	= "БанковскийСчет";
			ДоступОграничен = Ложь;
		// -- ЕРП 	
		Иначе
			ЗаголовокПоля	= НСтр("ru = 'Не используется'; en = 'obsolete'");
			Выражение 		= "";
			ДоступОграничен = Истина;
		КонецЕсли;                                                                                                  
		
		ВычисляемоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти(ИмяПоля);
		Если ВычисляемоеПоле <> Неопределено Тогда
			ВычисляемоеПоле.Заголовок = ЗаголовокПоля; 
			ВычисляемоеПоле.Выражение = Выражение; 
			ВычисляемоеПоле.ОграничениеИспользования.Поле 		 = ДоступОграничен; 
			ВычисляемоеПоле.ОграничениеИспользования.Группировка = ДоступОграничен;
            ВычисляемоеПоле.ОграничениеИспользования.Порядок 	 = ДоступОграничен;
			ВычисляемоеПоле.ОграничениеИспользования.Условие 	 = ДоступОграничен; 
		КонецЕсли;	
	КонецЦикла;   
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	Попытка
		КомпоновщикНастроек.Инициализировать(ИсточникНастроек);	
	Исключение 
		ТекстСообщения = НСтр("ru='Невозможно применить настройки. По причине: %1';
							  |en='It is impossible to apply the settings. Due to: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		 
	КонецПопытки;
	
	Если НастройкиКомпоновкиДанных.Выбор.Элементы.Количество() = 0 Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе	
		НастройкиКомпоновкиДанных.Выбор.Элементы.Очистить();
		ШаблонКоллекции = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Выбор.Элементы;
		Коллекция		= НастройкиКомпоновкиДанных.Выбор.Элементы; 
		Для каждого Элемент Из ШаблонКоллекции Цикл
			НовоеПоле = Коллекция.Добавить(ТипЗнч(Элемент));
			ЗаполнитьЗначенияСвойств(НовоеПоле, Элемент);	
		КонецЦикла;   
		
		НастройкиКомпоновкиДанных.Структура.Очистить();
		НастройкиИсточник = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Структура Цикл
			ЭлементСтруктурыПриемник = НастройкиКомпоновкиДанных.Структура.Добавить(ТипЗнч(ЭлементСтруктурыИсточник));
			бит_ОтчетыБФКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаВременнаяТаблицаДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""БДДС"" КАК ИмяСписка,
	|	&СинонимБДДС КАК СинонимСписка,
	|	1 КАК НомерТаблицы,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Период КАК Период,
	|	&Сценарий КАК Сценарий,
	|	&Валюта КАК Валюта,
	|	Таблица.ЦФО КАК ЦФО,
	|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
	|	ЕСТЬNULL(Таблица.СтатьяОборотов.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)) КАК СтавкаНДС,
	|	ЕСТЬNULL(Таблица.СтатьяОборотов.ЭтоКоэффициент, ЛОЖЬ) КАК ЭтоКоэффициент,
	|	Таблица.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА Таблица.СтатьяОборотов.ЭтоКоэффициент
	|			ТОГДА ЕСТЬNULL(Таблица.Сумма, 0)
	|		ИНАЧЕ ЕСТЬNULL(Таблица.Сумма, 0) * &КоэффициентСуммы
	|	КОНЕЦ КАК Сумма,
	|	0 КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаСценарий,
	|	Таблица.Комментарий КАК Комментарий,
	|	Таблица.Аналитика_1 КАК Аналитика_1,
	|	Таблица.Аналитика_2 КАК Аналитика_2,
	|	Таблица.Аналитика_3 КАК Аналитика_3,
	|	Таблица.Аналитика_4 КАК Аналитика_4,
	|	Таблица.Аналитика_5 КАК Аналитика_5,
	|	Таблица.Аналитика_6 КАК Аналитика_6,
	|	Таблица.Аналитика_7 КАК Аналитика_7,
	|	Таблица.Аналитика_8 КАК Аналитика_8,
	|	Таблица.Аналитика_9 КАК Аналитика_9,
	|	Таблица.Аналитика_10 КАК Аналитика_10,
	|	Таблица.Аналитика_11 КАК Аналитика_11,
	|	Таблица.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ ВременнаяТаблицаДокумента
	|ИЗ
	|	Документ.бит_БюджетнаяОперация.БДДС КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ЗависимыеОбороты"",
	|	&СинонимЗависимыеОбороты,
	|	2,
	|	Таблица.Ссылка,
	|	Таблица.НомерСтроки,
	|	Таблица.Период,
	|	&Сценарий,
	|	&Валюта,
	|	Таблица.ЦФО,
	|	Таблица.СтатьяОборотов,
	|	ЕСТЬNULL(Таблица.СтатьяОборотов.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)),
	|	ЕСТЬNULL(Таблица.СтатьяОборотов.ЭтоКоэффициент, ЛОЖЬ),
	|	Таблица.Количество,
	|	Таблица.Сумма * &КоэффициентСуммы,
	|	0,
	|	0,
	|	0,
	|	"""",
	|	Таблица.Аналитика_1,
	|	Таблица.Аналитика_2,
	|	Таблица.Аналитика_3,
	|	Таблица.Аналитика_4,
	|	Таблица.Аналитика_5,
	|	Таблица.Аналитика_6,
	|	Таблица.Аналитика_7,
	|	Таблица.Аналитика_8,
	|	Таблица.Аналитика_9,
	|	Таблица.Аналитика_10,
	|	Таблица.Аналитика_11,
	|	Таблица.Аналитика_12
	|ИЗ
	|	Документ.бит_БюджетнаяОперация.ЗависимыеОбороты КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаТаблицыВалютногоПерерасчета(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВремТаблицаПериодов",НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПериодов",	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Сценарии",			НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДанныеБюджета.Период КАК Период,
	|	ТаблицаДанныеБюджета.Сценарий КАК Сценарий,
	|	ТаблицаДанныеБюджета.Сценарий.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария,
	|	ТаблицаДанныеБюджета.Сценарий.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВремТаблицаПериодов
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ТаблицаДанныеБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТаблицаПериодов.Период КАК Период,
	|	ВремТаблицаПериодов.Сценарий КАК Сценарий,
	|	ВремТаблицаПериодов.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария
	|ИЗ
	|	ВремТаблицаПериодов КАК ВремТаблицаПериодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремТаблицаПериодов.Сценарий КАК Сценарий,
	|	ВремТаблицаПериодов.Валюта КАК Валюта
	|ИЗ
	|	ВремТаблицаПериодов КАК ВремТаблицаПериодов";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаТаблицаОборотыПоБюджетам(НомераТаблиц, ПриниматьКУчету)
	
	Если НЕ ПриниматьКУчету Тогда
		Возврат "";
	КонецЕсли;

	НомераТаблиц.Вставить("ТаблицаОборотыПоБюджетам", НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДанные.ИмяСписка КАК ИмяСписка,
	|	ТаблицаДанные.СинонимСписка КАК СинонимСписка,
	|	ТаблицаДанные.Ссылка КАК Ссылка,
	|	ТаблицаДанные.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанные.Период КАК Период,
	|	ТаблицаДанные.Сценарий КАК Сценарий,
	|	ТаблицаДанные.Валюта КАК Валюта,
	|	ТаблицаДанные.ЦФО КАК ЦФО,
	|	ТаблицаДанные.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДанные.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДанные.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	ТаблицаДанные.Количество КАК Количество,
	|	ТаблицаДанные.Сумма КАК Сумма,
	|	ТаблицаДанные.СуммаРегл КАК СуммаРегл,
	|	ТаблицаДанные.СуммаУпр КАК СуммаУпр,
	|	ТаблицаДанные.СуммаСценарий КАК СуммаСценарий,
	|	ТаблицаДанные.Комментарий КАК Комментарий,
	|	ТаблицаДанные.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаДанные.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаДанные.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаДанные.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаДанные.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаДанные.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаДанные.Аналитика_7 КАК Аналитика_7,
	|	ТаблицаДанные.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаДанные.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаДанные.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаДанные.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаДанные.Аналитика_12 КАК Аналитика_12,
	|	ЕСТЬNULL(АналитикаСценарийЦФО.КлючАналитики, ЗНАЧЕНИЕ(Справочник.бит_КлючиСценарийЦФО.ПустаяСсылка)) КАК КлючСценарийЦФО
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ТаблицаДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО ТаблицаДанные.ЦФО = АналитикаСценарийЦФО.ЦФО
	|			И ТаблицаДанные.Сценарий = АналитикаСценарийЦФО.Сценарий";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц)
	
	НомераТаблиц.Вставить("ИсполнениеБюджетаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ИсполнениеБюджета", НомераТаблиц.Количество());
    НомераТаблиц.Вставить("ВозвратЛимита", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.СверхБюджета КАК СверхБюджета,
	|	Реквизиты.КурсДокумента КАК Курс,
	|	Реквизиты.КратностьДокумента КАК Кратность,
	|	Реквизиты.Сценарий.Валюта КАК ВалютаСценария,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.Сценарий КАК СценарийКонтролируемый,
	|	ЗНАЧЕНИЕ(Перечисление.бит_РежимыКонтроляПоБюджету.Бюджет) КАК РежимКонтроля,
	|	ИСТИНА КАК КонтролироватьБюджет,
	|	&НеУчитыватьСверхБюджета КАК НеУчитыватьСверхБюджета,
	|	Реквизиты.СписатьЛимиты КАК СписатьЛимиты,
	|	ЛОЖЬ КАК КонтролироватьВозвратЛимита
	|ИЗ
	|	Документ.бит_БюджетнаяОперация КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДокумента.ИмяСписка КАК ИмяСписка,
	|	ВременнаяТаблицаДокумента.СинонимСписка КАК СинонимСписка,
	|	ВременнаяТаблицаДокумента.НомерТаблицы КАК НомерТаблицы,
	|	ВременнаяТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаДокумента.Период КАК Период,
	|	ВременнаяТаблицаДокумента.Сценарий КАК Сценарий,
	|	ВременнаяТаблицаДокумента.Валюта КАК Валюта,
	|	ВременнаяТаблицаДокумента.ЦФО КАК ЦФО,
	|	ВременнаяТаблицаДокумента.СтатьяОборотов КАК СтатьяОборотов,
	|	ВременнаяТаблицаДокумента.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	ВременнаяТаблицаДокумента.Количество КАК Количество,
	|	ВременнаяТаблицаДокумента.Сумма КАК Сумма,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Сумма КАК КонтролироватьСумму,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Количество КАК КонтролироватьКоличество,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Бюджеты КАК КонтролироватьПоСтатье,
	|	ВременнаяТаблицаДокумента.Аналитика_1 КАК Аналитика_1,
	|	ВременнаяТаблицаДокумента.Аналитика_2 КАК Аналитика_2,
	|	ВременнаяТаблицаДокумента.Аналитика_3 КАК Аналитика_3,
	|	ВременнаяТаблицаДокумента.Аналитика_4 КАК Аналитика_4,
	|	ВременнаяТаблицаДокумента.Аналитика_5 КАК Аналитика_5,
	|	ВременнаяТаблицаДокумента.Аналитика_6 КАК Аналитика_6,
	|	ВременнаяТаблицаДокумента.Аналитика_7 КАК Аналитика_7,
	|	ВременнаяТаблицаДокумента.Аналитика_8 КАК Аналитика_8,
	|	ВременнаяТаблицаДокумента.Аналитика_9 КАК Аналитика_9,
	|	ВременнаяТаблицаДокумента.Аналитика_10 КАК Аналитика_10,
	|	ВременнаяТаблицаДокумента.Аналитика_11 КАК Аналитика_11,
	|	ВременнаяТаблицаДокумента.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ВременнаяТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкаКонтроляПоСценариям КАК НастройкаКонтроляПоСценариям
	|		ПО (НастройкаКонтроляПоСценариям.Сценарий = &Сценарий)
	|			И ВременнаяТаблицаДокумента.Период >= НастройкаКонтроляПоСценариям.Период
	|			И (ВременнаяТаблицаДокумента.Период <= НастройкаКонтроляПоСценариям.ДатаОкончания
	|				ИЛИ НастройкаКонтроляПоСценариям.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|ГДЕ
	|	ВременнаяТаблицаДокумента.Сумма > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТаблицы,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДокумента.ИмяСписка КАК ИмяСписка,
	|	ВременнаяТаблицаДокумента.СинонимСписка КАК СинонимСписка,
	|	ВременнаяТаблицаДокумента.НомерТаблицы КАК НомерТаблицы,
	|	ВременнаяТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаДокумента.Период КАК Период,
	|	ВременнаяТаблицаДокумента.Сценарий КАК Сценарий,
	|	ВременнаяТаблицаДокумента.Валюта КАК Валюта,
	|	ВременнаяТаблицаДокумента.ЦФО КАК ЦФО,
	|	ВременнаяТаблицаДокумента.СтатьяОборотов КАК СтатьяОборотов,
	|	ВременнаяТаблицаДокумента.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	-ВременнаяТаблицаДокумента.Количество КАК Количество,
	|	-ВременнаяТаблицаДокумента.Сумма КАК Сумма,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Сумма КАК КонтролироватьСумму,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Количество КАК КонтролироватьКоличество,
	|	НЕ ВременнаяТаблицаДокумента.СтатьяОборотов.НеКонтролировать_Бюджеты КАК КонтролироватьПоСтатье,
	|	ВременнаяТаблицаДокумента.Аналитика_1 КАК Аналитика_1,
	|	ВременнаяТаблицаДокумента.Аналитика_2 КАК Аналитика_2,
	|	ВременнаяТаблицаДокумента.Аналитика_3 КАК Аналитика_3,
	|	ВременнаяТаблицаДокумента.Аналитика_4 КАК Аналитика_4,
	|	ВременнаяТаблицаДокумента.Аналитика_5 КАК Аналитика_5,
	|	ВременнаяТаблицаДокумента.Аналитика_6 КАК Аналитика_6,
	|	ВременнаяТаблицаДокумента.Аналитика_7 КАК Аналитика_7,
	|	ВременнаяТаблицаДокумента.Аналитика_8 КАК Аналитика_8,
	|	ВременнаяТаблицаДокумента.Аналитика_9 КАК Аналитика_9,
	|	ВременнаяТаблицаДокумента.Аналитика_10 КАК Аналитика_10,
	|	ВременнаяТаблицаДокумента.Аналитика_11 КАК Аналитика_11,
	|	ВременнаяТаблицаДокумента.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ВременнаяТаблицаДокумента
	|ГДЕ
	|	ВременнаяТаблицаДокумента.Сумма < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТаблицы,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Процедура ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ИсполнениеБюджета, ИсполнениеБюджетаРеквизиты)

	Если НЕ ЗначениеЗаполнено(ИсполнениеБюджета) ИЛИ НЕ ЗначениеЗаполнено(ИсполнениеБюджетаРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ИсполнениеБюджетаРеквизиты[0];
	
	КурсВалютыСценария 	= РаботаСКурсамиВалют.ПолучитьКурсВалюты(Реквизиты.ВалютаСценария, Реквизиты.Дата);
	КурсВалютыДокумента = Новый Структура("Валюта, Курс, Кратность");
	ЗаполнитьЗначенияСвойств(КурсВалютыДокумента, Реквизиты); 
	
	Для каждого СтрокаДокумента Из ИсполнениеБюджета Цикл
		СтрокаДокумента.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
									СтрокаДокумента.Сумма, КурсВалютыДокумента, КурсВалютыСценария);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТаблицыДокументаРасчетыВВалюте(ПараметрыПроведения, Реквизиты)

	Если ПараметрыПроведения.ТаблицаОборотыПоБюджетам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Сценарии		  = ПараметрыПроведения.Сценарии;
	ТаблицаПериодов	  = ПараметрыПроведения.ТаблицаПериодов;
	ОборотыПоБюджетам = ПараметрыПроведения.ТаблицаОборотыПоБюджетам;
	КурсыПоПериодам	  = Неопределено;
	
	Если Реквизиты.ИспользоватьКурсыСценария Тогда
		Для каждого СтрокаТаблицы Из Сценарии Цикл
			
			Отбор	= Новый Структура("Сценарий", СтрокаТаблицы.Сценарий);
			Периоды = ТаблицаПериодов.Скопировать(Отбор);
			Валюты  =  бит_Бюджетирование.ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(СтрокаТаблицы.Сценарий, Реквизиты.Валюта);
		
			КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(Периоды, Валюты, СтрокаТаблицы.Сценарий);
			
			НайденныеСтроки = ОборотыПоБюджетам.НайтиСтроки(Отбор);
			бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(НайденныеСтроки, 
								КурсыПоПериодам, Реквизиты.КурсыВалют);

		КонецЦикла; 
	Иначе
		
		бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(ОборотыПоБюджетам, 
								Неопределено, Реквизиты.КурсыВалют);
	КонецЕсли;
							
КонецПроцедуры

Процедура ИнициализироватьКлючиАналитик(Реквизиты)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Реквизиты.Регистратор);
	Запрос.УстановитьПараметр("Сценарий", 	 Реквизиты.Сценарий);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеБюджета.ЦФО КАК ЦФО,
	|	&Сценарий КАК Сценарий
	|ПОМЕСТИТЬ ДанныеБюджета
	|ИЗ
	|	Документ.бит_БюджетнаяОперация.БДДС КАК ДанныеБюджета
	|ГДЕ
	|	ДанныеБюджета.Ссылка = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗависимыеОбороты.ЦФО,
	|	&Сценарий
	|ИЗ
	|	Документ.бит_БюджетнаяОперация.ЗависимыеОбороты КАК ЗависимыеОбороты
	|ГДЕ
	|	ЗависимыеОбороты.Ссылка = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеБюджета.Сценарий КАК Сценарий,
	|	ДанныеБюджета.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ УникальныеДанныеБюджета
	|ИЗ
	|	ДанныеБюджета КАК ДанныеБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УникальныеДанныеБюджета.Сценарий КАК Сценарий,
	|	УникальныеДанныеБюджета.ЦФО КАК ЦФО,
	|	АналитикаСценарийЦФО.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	УникальныеДанныеБюджета КАК УникальныеДанныеБюджета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК АналитикаСценарийЦФО
	|		ПО УникальныеДанныеБюджета.Сценарий = АналитикаСценарийЦФО.Сценарий
	|			И УникальныеДанныеБюджета.ЦФО = АналитикаСценарийЦФО.ЦФО
	|ГДЕ
	|	АналитикаСценарийЦФО.КлючАналитики ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Справочники.бит_КлючиСценарийЦФО.КлючиСценарийЦФОДокумента(Выборка);
	КонецЦикла;

КонецПроцедуры

Функция МакетОтражениеКурсовыхРазниц()

	// ++ ЕРП 
	Возврат ПолучитьМакет("ОтражениеКурсовыхРазницУП");
	// -- ЕРП 

КонецФункции

#КонецОбласти 

#КонецЕсли
