#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мИзмерения Экспорт; // Хранит измерения бюджетирования.

Перем мИзмеренияДоп Экспорт; // Хранит дополнительные измерения бюджетирования.

Перем мНастройкиИзмерений Экспорт; // Хранит настройки дополнительных измерений.

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Заполняет наборы значений доступа.
// Параметры:
//  Таблица - ТаблицаЗначений - передает в этот параметр подготовленные наборы значений
//            доступа. Описание колонок см. в функции УправлениеДоступом.ТаблицаНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
		ЦФО, СтатьяОборотов);
	ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	ДобавитьСтрокуВНаборЗначенийДоступа(Ответственный, Таблица);
	
	// Таблица "БДДС"
	Для каждого СтрокаТаблицы Из БДДС Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
			
	// Удалим дубли
	ПоляГруппировки = "";
	Для каждого Колонка Из Таблица.Колонки Цикл
		ПоляГруппировки = "," + Колонка.Имя + ПоляГруппировки;
	КонецЦикла; 
	
	ПоляГруппировки = Сред(ПоляГруппировки, 2);
	Таблица.Свернуть(ПоляГруппировки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	НаименованиеТаблицы = НСтр("ru = 'БДДС'; en = 'БДДС'"); 
	Если бит_УправлениеДоступомБФСлужебный.ДоступЗапрещен(БДДС, НаименованиеТаблицы, Истина) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("ЦФО", ЦФО);
								
	ОтражатьСверхБюджета = НЕ бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету(
									ПараметрыНастройки, Дата);
									
	Если ОтражатьСверхБюджета ИЛИ НЕ СверхБюджета Тогда
		СписатьЛимиты = Ложь;	
	КонецЕсли;		
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("ПроводитьПослеУтверждения", ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения"));
	
	// Очистка неиспользуемых разрезов бюджетирования по статье оборотов.
	бит_Бюджетирование.ОчиститьНеИспользуемыеАналитикиСтатейОборотов(БДДС);
	бит_ОбщегоНазначения.ЗаполнитьАналитикуВШапкеДокумента(ЭтотОбъект, БДДС, Отказ);
	
	Если ЭтоНовый()
		ИЛИ (РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения 
		И ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления")) Тогда
		УстановитьПривилегированныйРежим(Истина);
		ЗаполнитьЗависимыеОбороты();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ДополнительныеСвойства.ПроводитьПослеУтверждения Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ОтправленНаСогласование = Истина;
		Иначе
			ОтправленНаСогласование = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЭтоНовый() Тогда
		Если ДополнительныеСвойства.ПроводитьПослеУтверждения Тогда
			// Если документ был проведен в системе ранее, без отправки на согласование,
			// при повторном проведении его движения стирать нельзя.
			Если НЕ Проведен ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				РежимПринятияКУчету = 1;
			КонецЕсли;
		Иначе
			РежимПринятияКУчету = 0;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
    ДополнительныеСвойства.Вставить("НаборыЗначенийДоступаЗаписаны", Истина);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект, Ложь);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.бит_БюджетнаяОперация.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
		
	ТаблицаИсполнениеБюджета = бит_КонтрольИсполненияБюджета.ПодготовитьТаблицуВозвратЛимита(
									ПараметрыПроведения.ВозвратЛимита,
									ПараметрыПроведения.ИсполнениеБюджетаРеквизиты,
									Отказ);
	
	бит_КонтрольИсполненияБюджета.СформироватьДвиженияКонтрольныеЗначенияБюджетов(
		ТаблицаИсполнениеБюджета, Движения);
	// АПК:105-выкл Явная запись требуеся для анализа движений.	
	Движения.бит_КонтрольныеЗначенияБюджетов.Записать();
	// АПК:105-вкл
	
	ТаблицаИсполнениеБюджета = бит_КонтрольИсполненияБюджета.ПодготовитьТаблицуИсполнениеБюджета(
									ПараметрыПроведения.ИсполнениеБюджета,
									ПараметрыПроведения.ИсполнениеБюджетаРеквизиты,
									Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	бит_КонтрольИсполненияБюджета.СформироватьДвиженияКонтрольныеЗначенияБюджетов(ТаблицаИсполнениеБюджета, Движения);
	
	Документы.бит_БюджетнаяОперация.СформироватьДвиженияОборотыПоБюджетам(
		ПараметрыПроведения.ТаблицаОборотыПоБюджетам, ПараметрыПроведения.Реквизиты, Движения, Отказ);
	Документы.бит_БюджетнаяОперация.СформироватьДвиженияБюджетирование(
		ПараметрыПроведения.ТаблицаОборотыПоБюджетам, ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СверхБюджета 			= Ложь;
	СписатьЛимиты			= Ложь;   
	ОтправленНаСогласование = Ложь;
	Ответственный			= Пользователи.ТекущийПользователь();
	
	Если ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения") Тогда
		РежимПринятияКУчету = 1;
	Иначе
		РежимПринятияКУчету = 0;
	КонецЕсли;

	АктуализироватьКурсы();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		
		// Заполнение шапки
		бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), Неопределено);
													   
		Если ЗначениеЗаполнено(Сценарий) Тогда
			ИзменениеСценарияОбъект(); 
		КонецЕсли;
		
		// По умолчанию режим зависимых оборотов "Автоматический".
		РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.Автоматический;
		
	КонецЕсли;	
	
	Если ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения") Тогда
		РежимПринятияКУчету = 1;	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Обязательные измерения из разряда дополнительных.
	Для каждого КлючИЗначение Из мНастройкиИзмерений Цикл
	
		ИмяИзмерения = "БДДС." + КлючИЗначение.Ключ;
		Настройка    = КлючИЗначение.Значение;
		
		Если Настройка.Обязательное Тогда  			
			ПроверяемыеРеквизиты.Добавить(ИмяИзмерения);		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Для каждого СтрокаТаблицы Из БДДС Цикл	
		Если СтрокаТаблицы.Количество = 0 И СтрокаТаблицы.Сумма = 0 Тогда			
			ТекстСообщения = НСтр("ru = 'В строке №%1 табличной части ""Данные бюджета"" не заполнены ни сумма ни количество.';
								  |en='In line №%1 tabule ""Budget data"" must be filled amount or quantity.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);		
		КонецЕсли;	
	КонецЦикла; 
	
	бит_Бюджетирование.ПроверитьОбязательныеРазрезыСтатейОборотов(ЭтотОбъект, "БДДС", Отказ, мИзмерения);
	УстановитьПривилегированныйРежим(Истина);
	бит_Бюджетирование.ПроверитьОбязательныеРазрезыСтатейОборотов(ЭтотОбъект, "ЗависимыеОбороты", Отказ, мИзмерения);
	УстановитьПривилегированныйРежим(Ложь);

	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура очищает табличную часть ЗависимыеОбороты.
// 
// Параметры:
//  Нет.
// 
Процедура ОчиститьЗависимыеОбороты() Экспорт

	ЗависимыеОбороты.Очистить();

КонецПроцедуры

// Процедура заполняет табличную часть ЗависимыеОбороты.
// 
// Параметры:
//  Нет.
// 
Процедура ЗаполнитьЗависимыеОбороты() Экспорт

	УстановитьПривилегированныйРежим(Истина);	
	
	ОчиститьЗависимыеОбороты();
	
	Если РежимЗависимыхОборотов = Перечисления.бит_РежимыЗависимыхОборотов.НеФормировать Тогда
		// Не формируем зависимые обороты.
		Возврат;
	КонецЕсли;
	
	ПараметыЗаполнения = бит_Бюджетирование.НовыеПараметыЗаполненияЗависимыхОборотов();
	ПараметыЗаполнения.ТаблицаИсточник      = БДДС.Выгрузить();
	ПараметыЗаполнения.ТаблицаПриемник      = ЗависимыеОбороты.ВыгрузитьКолонки();
	ПараметыЗаполнения.ЕдиницаИзмеренияСумм = ЕдиницаИзмеренияСумм;
	ПараметыЗаполнения.Сценарий             = Сценарий;
	ПараметыЗаполнения.ВестиПротокол        = (ПараметыЗаполнения.ТаблицаПриемник.Колонки.Найти("КомментарийРасчета")
												<> Неопределено);
	ЗависимыеОбороты.Загрузить(бит_Бюджетирование.ЗависимыеОборотыПоИсточнику(ПараметыЗаполнения));
	
	УстановитьПривилегированныйРежим(Ложь);	
	бит_Бюджетирование.ОчиститьНеИспользуемыеАналитикиСтатейОборотов(ЗависимыеОбороты);
	
КонецПроцедуры

// Процедура обрабатывает изменение валюты документа.
// 
// Параметры:
//  Нет.
// 
Процедура ИзменениеВалютыОбъект() Экспорт
	
	СтрКурса = бит_Бюджетирование.ПолучитьКурсПоСценарию(Сценарий, ВалютаДокумента, Дата);
	КурсДокумента      = СтрКурса.Курс;
	КратностьДокумента = СтрКурса.Кратность;
	
КонецПроцедуры

// Процедура обрабатывает изменение сценария в шапке документа.
// 
// Параметры:
//  Нет.
// 
Процедура ИзменениеСценарияОбъект()  Экспорт

	ВалютаДокумента = Сценарий.Валюта;
		
	ИзменениеВалютыОбъект();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСтрокуВНаборЗначенийДоступа(ЗначениеДоступа, Таблица)
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = ЗначениеДоступа;

КонецПроцедуры

Процедура АктуализироватьКурсы()

	Если ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		Возврат;
	КонецЕсли; 
	
	СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, ОбщегоНазначения.ТекущаяДатаПользователя());

	КурсДокумента 		= СтрКурса.Курс;
	КратностьДокумента 	= СтрКурса.Кратность;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

мИзмеренияДоп       = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним");
мИзмерения          = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Произвольные"  , "Синоним");
мНастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли