#Область МодульФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	ЗакрытьФорму("Добавить");
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗакрытьФорму("Загрузить");
	
КонецПроцедуры

// Процедура закрывает форму насмтройки.
//
// Параметры:
//  Действие - Строка.
//
&НаКлиенте
Процедура ЗакрытьФорму(Действие)

	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("СтатьяРасходованияПоступления", СтатьяРасходованияПоступления);
	ПараметрыЗакрытия.Вставить("СтатьяОсновнойДолг",            СтатьяОсновнойДолг);
    ПараметрыЗакрытия.Вставить("СтатьяБДРПроценты",             СтатьяБДРПроценты);
    ПараметрыЗакрытия.Вставить("СтатьяПроценты",                СтатьяПроценты);
	ПараметрыЗакрытия.Вставить("СтатьяБДРКомиссии",             СтатьяБДРКомиссии);
    ПараметрыЗакрытия.Вставить("СтатьяКомиссии",                СтатьяКомиссии);

    ПараметрыЗакрытия.Вставить("ЗагрузитьДобавить", Действие);

	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры // ЗакрытьФорму() 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДоговорКредитовИДепозитов") Тогда
		
		Если Параметры.ДоговорКредитовИДепозитов.ХарактерДоговора = Перечисления.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм Тогда
			Элементы.СтатьяРасходованияПоступления.Заголовок = "Статья поступления (транш)";
			ВидБДР = "Расход";
		Иначе
			Элементы.СтатьяРасходованияПоступления.Заголовок = "Статья расходования (транш)";
			ВидБДР = "Доход";
		КонецЕсли;
		
		Если Параметры.ДоговорКредитовИДепозитов.ТипКомиссии <> Перечисления.ТипыКомиссииКредитовИДепозитов.Нет Тогда
			Элементы.СтатьяБДРКомиссии.Видимость = Истина;
			Элементы.СтатьяКомиссии.Видимость    = Истина;
		КонецЕсли;
			
		ЗаполнитьСтатьиОборотов(Параметры.ДоговорКредитовИДепозитов, ВидБДР, ТекущаяДатаСеанса());
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура 
//
// Параметры:
//  Параметр1 - Строка.
//
&НаСервере
Процедура ЗаполнитьСтатьиОборотов(Договор, ВидБДР, Период)

	// график платежей
	СоотвСтатьяПоступленияРасходования = Договор.СтатьяДДСПоступленияВыдачи;
	СоотвСтатьяОсновнойДолг            = Договор.СтатьяДДСОсновногоДолга;
	СоотвСтатьяПроценты                = Договор.СтатьяДДСПроцентов;	
	СоотвСтатьяКомиссии                = Договор.СтатьяДДСКомиссии;
	
	// график начислений
	СоотвСтатьяБДРПроценты             = Договор.СтатьяДоходовРасходовПроцентов;
	СоотвСтатьяБДРКомиссии             = Договор.СтатьяДоходовРасходовКомиссии;

	Если ВидБДР = "Расход" Тогда
		ВидСоответствия = Справочники.бит_ВидыСоответствийАналитик.СтатьиРасходов_СтатьиОборотов;
	Иначе
		ВидСоответствия = Справочники.бит_ВидыСоответствийАналитик.СтатьиДоходов_СтатьиОборотов;
	КонецЕсли;
	
	СтатьяБДРПроценты      = ПолучитьСтатьюОборотов(ВидСоответствия, СоотвСтатьяБДРПроценты, Период);
    СтатьяБДРКомиссии      = ПолучитьСтатьюОборотов(ВидСоответствия, СоотвСтатьяБДРКомиссии, Период);
 
	ОбщийВидСоответствия = Справочники.бит_ВидыСоответствийАналитик.СтатьиДДС_СтатьиОборотов;
	
	СтатьяРасходованияПоступления = ПолучитьСтатьюОборотов(ОбщийВидСоответствия, СоотвСтатьяПоступленияРасходования, Период);
	СтатьяОсновнойДолг            = ПолучитьСтатьюОборотов(ОбщийВидСоответствия, СоотвСтатьяОсновнойДолг, Период);
	СтатьяПроценты	              = ПолучитьСтатьюОборотов(ОбщийВидСоответствия, СоотвСтатьяПроценты, Период);
	СтатьяКомиссии	              = ПолучитьСтатьюОборотов(ОбщийВидСоответствия, СоотвСтатьяКомиссии, Период);

КонецПроцедуры // ЗаполнитьСтатьиОборотов()

// Функция возвращает найденную статью оборотов по соответствию. 
//
// Параметры:
//  ВидСоответствия - СправочникСсылка.
//  СтатьяСоответствия - СправочникСсылка.
//
&НаСервере
Функция ПолучитьСтатьюОборотов(ВидСоответствия, СтатьяСоответствия, Период)

	СтатьяОборотов = РегистрыСведений.бит_СоответствияАналитик.ПолучитьПравуюАналитику(ВидСоответствия, 
							СтатьяСоответствия, Период); 	
	Если НЕ ЗначениеЗаполнено(СтатьяОборотов) Тогда
		// Приведение к типу.						
		СтатьяОборотов  = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтатьяОборотов

КонецФункции // ПолучитьСтатьюОборотов()

#КонецОбласти





