#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП 
	СовместимоУП = Истина;
	// -- ЕРП 
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИБ

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция подготавливает параметры проведения.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.бит_КорректировкаКонтрольныхЗначений - ссылка на документ.
//  Отказ          - Булево - признак обнаружения ошибки и отказа от дальнейших действий.
//
// Возвращаемое значение:
//  Структура - структура параметров проведения.
//
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	НомераТаблиц = Новый Структура(); 
	ТекстЗапроса = ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)
				 + ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
				 + ТекстЗапросаВременнаяТаблицаПереопределение(НомераТаблиц)
				 + ТекстЗапросаКонтрольныеЗначения(НомераТаблиц)
				 + ТекстЗапросаСрокиКонтроля(НомераТаблиц);
	
	Запрос.Текст = ТекстЗапроса;
	Результат 	 = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла; 	
	
	КонтрольныеЗначения = КонтрольныеЗначенияБюджетов(ПараметрыПроведения.РеквизитыДокумента);
	СрокиКонтроля		= СрокиКонтроляПоБюджету(КонтрольныеЗначения, ПараметрыПроведения.СрокиКонтроляРеквизиты);
	
	ПараметрыПроведения.Вставить("КонтрольныеЗначения", КонтрольныеЗначения);
	ПараметрыПроведения.Вставить("СрокиКонтроля", СрокиКонтроля);
		
	Возврат ПараметрыПроведения;
	
КонецФункции 

// Параметры регламентного задания "бит_УстановкаКонтрольныхЗначений".
// 
// Возвращаемое значение:
//  Параметры - структура, ключи: Сценарий, ВидКонтроля, НачалоПериода.
//
Функция НовыеПараметрыУстановкиВФоне() Экспорт

	Параметры = Новый Структура; 
	Параметры.Вставить("Сценарий",Справочники.СценарииПланирования.ПустаяСсылка());
	Параметры.Вставить("ВидКонтроля", Перечисления.бит_РежимыКонтроляПоБюджету.ПустаяСсылка());
	Параметры.Вставить("НачалоПериода", '0001-01-01');

	Возврат Параметры;
	
КонецФункции

// Проведение документов по переданным параметрам.
//
// Параметры:
//  ПараметрыВыполнения	 - структура - см. НовыеПараметрыУстановкиВФоне().
//
Процедура ФоновоеПроведение(ПараметрыЗадания) Экспорт

	ПараметрыВыполнения = НовыеПараметрыУстановкиВФоне();
	Для каждого КлючЗначение Из ПараметрыВыполнения Цикл
		Значение = Неопределено;
		Если ПараметрыЗадания.Свойство(КлючЗначение.Ключ, Значение) Тогда
			ПараметрыВыполнения.Вставить(КлючЗначение.Ключ, Значение);
		КонецЕсли; 
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидКонтроля",   ПараметрыВыполнения.ВидКонтроля);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыВыполнения.НачалоПериода);
	Запрос.УстановитьПараметр("Сценарий", 	   ПараметрыВыполнения.Сценарий);

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_УстановкаКонтрольныхЗначений КАК Таблица
	|ГДЕ
	|	Таблица.Проведен
	|	И Таблица.Сценарий = &Сценарий
	|	И Таблица.ДатаНачала >= &НачалоПериода
	|	И Таблица.ВидКонтроля = &ВидКонтроля";
	
	Если НЕ ЗначениеЗаполнено(ПараметрыВыполнения.Сценарий) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Таблица.Сценарий = &Сценарий", "");
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(ПараметрыВыполнения.ВидКонтроля) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Таблица.ВидКонтроля = &ВидКонтроля", "");
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(ПараметрыВыполнения.НачалоПериода) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Таблица.ДатаНачала >= &НачалоПериода", "");
	КонецЕсли; 
	
	Запрос.Текст 	 = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ТекущийОбъект.Заблокировать();
		Исключение
			ТекстСообщения = НСтр("ru = 'Невозможно заблокировать документ.'; 
										|en = 'Can''t lock the document.'"); 
			ЗарегистрироватьОшибкуФоновогоПроведения(ТекущийОбъект, ТекстСообщения);
			Продолжить;
		КонецПопытки; 
		
		НачатьТранзакцию();
		Попытка			
			ТекущийОбъект.ДополнительныеСвойства.Вставить("Допроведение", Истина);
			ТекущийОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗарегистрироватьОшибкуФоновогоПроведения(ТекущийОбъект, 
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));	
		КонецПопытки; 
	КонецЦикла;

КонецПроцедуры
 
Процедура ИнициализироватьПостроительОтчета(ПостроительОтчета, Реквизиты) Экспорт
	
	// Текст запроса переопределяется в коде.
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|   &ПоляВыборки, 
	|	&РежимКонтроля				 			КАК РежимКонтроля,
	|	бит_ОборотыПоБюджетам.Сценарий 			КАК Сценарий,
	|	&СценарийКонтролируемый 				КАК СценарийКонтролируемый,
	|	бит_ОборотыПоБюджетам.СтатьяОборотов 	КАК СтатьяОборотов,
	|	СУММА(бит_ОборотыПоБюджетам.СуммаСценарийОборот) КАК СуммаСценарийКонтроль,
	|	СУММА(бит_ОборотыПоБюджетам.КоличествоОборот) КАК КоличествоСценарийКонтроль,
	|	ВЫБОР &Периодичность  
	|		КОГДА 6 ТОГДА НАЧАЛОПЕРИОДА(Период, День)
	|		КОГДА 7 ТОГДА НАЧАЛОПЕРИОДА(Период, Неделя)
	|		КОГДА 8 ТОГДА НАЧАЛОПЕРИОДА(Период, Декада)
	|		КОГДА 9 ТОГДА НАЧАЛОПЕРИОДА(Период, Месяц)
	|		КОГДА 10 ТОГДА НАЧАЛОПЕРИОДА(Период, Квартал)
	|		КОГДА 11 ТОГДА НАЧАЛОПЕРИОДА(Период, Полугодие)
	|		КОГДА 12 ТОГДА НАЧАЛОПЕРИОДА(Период, Год)
	|		ИНАЧЕ &ДатаНачалаКонтроля 
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ОборотыПоБюджетам	
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(&ДатаНачала, &ДатаОкончания, ДЕНЬ {&Периодичность}, Сценарий = &Сценарий
	|			{(СтатьяОборотов.*)}) КАК бит_ОборотыПоБюджетам
	|{ГДЕ ИСТИНА КАК ПОЛЕ1
	|// УсловияНаФиксированныеИзмерения
	|// УсловияНаДополнительныеИзмерения
	|}
	|СГРУППИРОВАТЬ ПО
	|   &ПоляГруппировки, 	
	|	&РежимКонтроля,
	|	Сценарий,
	|	&СценарийКонтролируемый,
	|	СтатьяОборотов,
	|	ВЫБОР &Периодичность  
	|		КОГДА 6 ТОГДА НАЧАЛОПЕРИОДА(Период, День)
	|		КОГДА 7 ТОГДА НАЧАЛОПЕРИОДА(Период, Неделя)
	|		КОГДА 8 ТОГДА НАЧАЛОПЕРИОДА(Период, Декада)
	|		КОГДА 9 ТОГДА НАЧАЛОПЕРИОДА(Период, Месяц)
	|		КОГДА 10 ТОГДА НАЧАЛОПЕРИОДА(Период, Квартал)
	|		КОГДА 11 ТОГДА НАЧАЛОПЕРИОДА(Период, Полугодие)
	|		КОГДА 12 ТОГДА НАЧАЛОПЕРИОДА(Период, Год)
	|		ИНАЧЕ &ДатаНачалаКонтроля 
	|	КОНЕЦ
	|	;	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПоляВременнойТаблицы,
	|	ОборотыПоБюджетам.РежимКонтроля КАК РежимКонтроля,
	|	ОборотыПоБюджетам.Сценарий КАК Сценарий,
	|	ОборотыПоБюджетам.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	ОборотыПоБюджетам.СтатьяОборотов КАК СтатьяОборотов,
	|	ОборотыПоБюджетам.Период КАК Период,
	|	ВЫБОР
	|		КОГДА &ВидОтклонения = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОтклоненийКонтрольныхЗначений.Процент)
	|			ТОГДА ОборотыПоБюджетам.СуммаСценарийКонтроль + ОборотыПоБюджетам.СуммаСценарийКонтроль * &ЗначениеОтклонения / 100
	|		КОГДА &ВидОтклонения = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОтклоненийКонтрольныхЗначений.Абсолютное)
	|			ТОГДА ОборотыПоБюджетам.СуммаСценарийКонтроль + &ЗначениеОтклонения
	|		ИНАЧЕ ОборотыПоБюджетам.СуммаСценарийКонтроль
	|	КОНЕЦ КАК СуммаСценарийКонтроль,
	|	ВЫБОР
	|		КОГДА &ВидОтклоненияКоличество = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОтклоненийКонтрольныхЗначений.Процент)
	|			ТОГДА ОборотыПоБюджетам.КоличествоСценарийКонтроль + ОборотыПоБюджетам.КоличествоСценарийКонтроль * &ЗначениеОтклоненияКоличество / 100
	|		КОГДА &ВидОтклоненияКоличество = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОтклоненийКонтрольныхЗначений.Абсолютное)
	|			ТОГДА ОборотыПоБюджетам.КоличествоСценарийКонтроль + &ЗначениеОтклоненияКоличество
	|		ИНАЧЕ ОборотыПоБюджетам.КоличествоСценарийКонтроль
	|	КОНЕЦ КАК КоличествоСценарийКонтроль
	|ИЗ
	|	ОборотыПоБюджетам КАК ОборотыПоБюджетам";
	
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	ТекстыПолей   	  			= Новый Массив;
	ТекстыГруппировок 			= Новый Массив;
	ТекстыПолейВременнойТаблицы = Новый Массив;
	ПоляУсловий					= Новый Массив; 
	
	ШаблонПоля = 
	"
	|	ВЫБОР
	|		КОГДА &НЗ_%1
	|			ТОГДА бит_ОборотыПоБюджетам.%1
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК %1";
	
	ШаблонУсловия = "бит_ОборотыПоБюджетам.%1.*";
	
	ШаблонГруппировки = 
	"
	|	ВЫБОР
	|		КОГДА &НЗ_%1
	|			ТОГДА бит_ОборотыПоБюджетам.%1
	|		ИНАЧЕ NULL
	|	КОНЕЦ";
	
	ШаблонПоляВременнойТаблицы = 
	"
	|	ОборотыПоБюджетам.%1 КАК %1";
	
	Для каждого ТекИзмерение Из Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения Цикл		
		
		ИмяИзмерения = ТекИзмерение.Имя;
		Если ИмяИзмерения = "Валюта" Или ИмяИзмерения = "Сценарий" Или ИмяИзмерения = "СтатьяОборотов" Тогда
			Продолжить;		
		КонецЕсли;
		
		ТекстыПолей.Добавить(СтрШаблон(ШаблонПоля, ИмяИзмерения));
		ТекстыГруппировок.Добавить(СтрШаблон(ШаблонГруппировки, ИмяИзмерения));
		ТекстыПолейВременнойТаблицы.Добавить(СтрШаблон(ШаблонПоляВременнойТаблицы, ИмяИзмерения));
		
		Если Лев(ИмяИзмерения, 10) <> "Аналитика_" Тогда
			ПоляУсловий.Добавить(СтрШаблон(ШаблонУсловия, ИмяИзмерения));
		КонецЕсли;					
	КонецЦикла;  

	СоответствиеИмен 	   = Новый Структура;
	ТекстОтбораПостроителя = "";
	
	Для Каждого ЭлементНастройки Из НастройкиИзмерений Цикл
		ТекстОтбораПостроителя = ТекстОтбораПостроителя 
								+ бит_МеханизмДопИзмерений.СформироватьТекстПоляОтбора("бит_ОборотыПоБюджетам", 
									ЭлементНастройки.Ключ, ЭлементНастройки.Значение);
								
		СоответствиеИмен.Вставить(ЭлементНастройки.Ключ, ЭлементНастройки.Значение.Синоним);						
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИСТИНА КАК ПОЛЕ1", ""); // Удаление технологического поля.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыборки", СтрСоединить(ТекстыПолей, ","));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// УсловияНаФиксированныеИзмерения", СтрСоединить(ПоляУсловий, ","));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// УсловияНаДополнительныеИзмерения", ТекстОтбораПостроителя);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляГруппировки", СтрСоединить(ТекстыГруппировок, ","));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВременнойТаблицы", СтрСоединить(ТекстыПолейВременнойТаблицы, ","));
	
	ПостроительОтчета.Текст = ТекстЗапроса;
	СохраненнаяНастройка 	= Реквизиты.ХранилищеНастроекОтбора.Получить();								 

	Если ТипЗнч(СохраненнаяНастройка) = Тип("НастройкиПостроителяОтчета") Тогда
		
		ПостроительОтчета.УстановитьНастройки(СохраненнаяНастройка);	
		
	ИначеЕсли ТипЗнч(СохраненнаяНастройка) = Тип("Структура") Тогда	
		                       		
		Для каждого СтрокаОтбора Из СохраненнаяНастройка.Отбор Цикл
			Если ЗначениеЗаполнено(СтрокаОтбора.ПутьКДанным) Тогда
				ЭлементОтбора = ПостроительОтчета.Отбор.Добавить(СтрокаОтбора.ПутьКДанным);
				ЗаполнитьЗначенияСвойств(ЭлементОтбора, СтрокаОтбора);
			КонецЕсли;									
		КонецЦикла;			
	КонецЕсли;
	
	ПостроительОтчета.Параметры.Вставить("РежимКонтроля", 				 Реквизиты.РежимКонтроля);
	ПостроительОтчета.Параметры.Вставить("Сценарий", 					 Реквизиты.Сценарий);
	ПостроительОтчета.Параметры.Вставить("СценарийКонтролируемый",		 Реквизиты.СценарийКонтролируемый);	
	ПостроительОтчета.Параметры.Вставить("ДатаНачала", 					 Реквизиты.ДатаНачала);
	ПостроительОтчета.Параметры.Вставить("ДатаОкончания", 				 Реквизиты.ДатаОкончания);
	ПостроительОтчета.Параметры.Вставить("ВидОтклонения", 				 Реквизиты.ВидОтклонения);
	ПостроительОтчета.Параметры.Вставить("ЗначениеОтклонения", 			 Реквизиты.ЗначениеОтклонения);
	ПостроительОтчета.Параметры.Вставить("ВидОтклоненияКоличество", 	 Реквизиты.ВидОтклоненияКоличество);
	ПостроительОтчета.Параметры.Вставить("ЗначениеОтклоненияКоличество", Реквизиты.ЗначениеОтклоненияКоличество);
	Для каждого ТекИзмерение Из Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения Цикл		
		ИмяИзмерения = ТекИзмерение.Имя;
		Если ИмяИзмерения = "Валюта" Или ИмяИзмерения = "Сценарий" Или ИмяИзмерения = "СтатьяОборотов" Тогда
			Продолжить;		
		КонецЕсли;
		ИмяПараметра = "НЗ_" + ИмяИзмерения;
		ПостроительОтчета.Параметры.Вставить(ИмяПараметра, Реквизиты[ИмяПараметра]);
	КонецЦикла;
	
	ПостроительОтчета.Параметры.Вставить("ДатаНачалаКонтроля", Реквизиты.ДатаНачалаКонтроля);
	
	Периодичность = Реквизиты.Периодичность;
	
	Менеджер = Перечисления.бит_ПериодичностьПланирования;
	Если Периодичность = Менеджер.День Тогда
		Значение = 6;
	ИначеЕсли Периодичность = Менеджер.Неделя Тогда 	
		Значение = 7;
	ИначеЕсли Периодичность = Менеджер.Декада Тогда 	
		Значение = 8;
	ИначеЕсли Периодичность = Менеджер.Месяц Тогда 	
		Значение = 9;
	ИначеЕсли Периодичность = Менеджер.Квартал Тогда 	
		Значение = 10;
	ИначеЕсли Периодичность = Менеджер.Полугодие Тогда 	
		Значение = 11;
	ИначеЕсли Периодичность = Менеджер.Год Тогда 	
		Значение = 12;
	Иначе 
		Значение = 0;
	КонецЕсли; 
	
	ПостроительОтчета.Параметры.Вставить("Периодичность", Значение);
	Если ЗначениеЗаполнено(Периодичность) Тогда
		ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("Периодичность");
		ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
		ЭлементОтбора.Значение = Значение;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция РеквизитыДокумента(Ссылка) Экспорт

	ПараметрыПроведения = Новый Структура(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	НомераТаблиц = Новый Структура(); 
	ТекстЗапроса = ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)
				 + ТекстЗапросаРеквизитыДокумента(НомераТаблиц);
	
	Запрос.Текст = ТекстЗапроса;
	Результат 	 = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;

	Возврат ПараметрыПроведения.РеквизитыДокумента;
	
КонецФункции

Процедура ВыполнитьКонтрольПересеченияНастроек(СрокиКонтроля, СрокиКонтроляРеквизиты, Отказ, Допроведение) Экспорт

	Запрос = Новый Запрос;
	Если СрокиКонтроляРеквизиты.Количество() = 0 ИЛИ Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СрокиКонтроляРеквизиты[0]);
	
	Периодичность = бит_КонтрольИсполненияБюджета.ПериодичностьКонтроляСценария(Реквизиты.Сценарий);
	
	ИзмеренияКонтроля = Новый Структура; 
	Для каждого КлючЗначение Из Реквизиты Цикл
		Если СтрНачинаетсяС(КлючЗначение.Ключ, "Контроль") И КлючЗначение.Значение Тогда
			ИзмеренияКонтроля.Вставить(СтрЗаменить(КлючЗначение.Ключ, "Контроль", ""));
		КонецЕсли;
	КонецЦикла; 

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Реквизиты", 				СрокиКонтроляРеквизиты);
	Запрос.УстановитьПараметр("СрокиКонтроля", 			СрокиКонтроля);
	Запрос.УстановитьПараметр("Периодичность", 	   		Периодичность);
	Запрос.УстановитьПараметр("СценарийКонтролируемый", Реквизиты.СценарийКонтролируемый);
	Запрос.УстановитьПараметр("Сценарий", 				Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("РежимКонтроля", 	   		Реквизиты.РежимКонтроля);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.КонтрольЦФО КАК КонтрольЦФО,
	|	Таблица.ДатаНачалаКонтроля КАК ДатаНачалаКонтроля,
	|	Таблица.ДатаОкончанияКонтроля КАК ДатаОкончанияКонтроля,
	|	Таблица.Периодичность КАК Периодичность,
	|	Таблица.НастройкаКонтроля КАК НастройкаКонтроля,
	|	Таблица.РежимКонтроля КАК РежимКонтроля,
	|	Таблица.Сценарий КАК Сценарий,
	|	Таблица.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	Таблица.КонтрольАналитика_1 КАК КонтрольАналитика_1,
	|	Таблица.КонтрольАналитика_2 КАК КонтрольАналитика_2,
	|	Таблица.КонтрольАналитика_3 КАК КонтрольАналитика_3,
	|	Таблица.КонтрольАналитика_4 КАК КонтрольАналитика_4,
	|	Таблица.КонтрольАналитика_5 КАК КонтрольАналитика_5,
	|	Таблица.КонтрольАналитика_6 КАК КонтрольАналитика_6,
	|	Таблица.КонтрольАналитика_7 КАК КонтрольАналитика_7,
	|	Таблица.КонтрольАналитика_8 КАК КонтрольАналитика_8,
	|	Таблица.КонтрольАналитика_9 КАК КонтрольАналитика_9,
	|	Таблица.КонтрольАналитика_10 КАК КонтрольАналитика_10,
	|	Таблица.КонтрольАналитика_11 КАК КонтрольАналитика_11,
	|	Таблица.КонтрольАналитика_12 КАК КонтрольАналитика_12
	|ПОМЕСТИТЬ ВременнаяТаблицаРеквизиты
	|ИЗ
	|	&Реквизиты КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.ИмяСписка КАК ИмяСписка,
	|	Таблица.СинонимСписка КАК СинонимСписка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Период КАК Период,
	|	Таблица.ЦФО КАК ЦФО,
	|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
	|	Таблица.НачалоПериода КАК НачалоПериода,
	|	Таблица.КонецПериода КАК КонецПериода,
	|	Таблица.Аналитика_1 КАК Аналитика_1,
	|	Таблица.Аналитика_2 КАК Аналитика_2,
	|	Таблица.Аналитика_3 КАК Аналитика_3,
	|	Таблица.Аналитика_4 КАК Аналитика_4,
	|	Таблица.Аналитика_5 КАК Аналитика_5,
	|	Таблица.Аналитика_6 КАК Аналитика_6,
	|	Таблица.Аналитика_7 КАК Аналитика_7,
	|	Таблица.Аналитика_8 КАК Аналитика_8,
	|	Таблица.Аналитика_9 КАК Аналитика_9,
	|	Таблица.Аналитика_10 КАК Аналитика_10,
	|	Таблица.Аналитика_11 КАК Аналитика_11,
	|	Таблица.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	&СрокиКонтроля КАК Таблица";

	Запрос.Выполнить();
	
	ВыполнитьКонтрольПересеченияНастроекЧ1(Запрос, ИзмеренияКонтроля, Отказ, Допроведение);
	ВыполнитьКонтрольПересеченияНастроекЧ2(Запрос, ИзмеренияКонтроля, Отказ, Допроведение);
	ВыполнитьКонтрольПересеченияНастроекЧ3(Запрос, ИзмеренияКонтроля, Отказ, Допроведение);
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьОшибкуФоновогоПроведения(Данные, ТекстСообщения)
	
	ИмяСобытия = НСтр("ru = 'БИТ.Регламентные задания.Установка контрольных значений';
								|en = 'BIT.Reglamentnye zadaniya.Ustanovka control values'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, 
		Метаданные.Документы.бит_УстановкаКонтрольныхЗначений, Данные, ТекстСообщения);
				
КонецПроцедуры

Функция ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НЗ_ЦФО КАК НЗ_ЦФО,
	|	Таблица.ДатаНачалаКонтроля КАК ДатаНачалаКонтроля,
	|	Таблица.ДатаОкончанияКонтроля КАК ДатаОкончанияКонтроля,
	|	Таблица.ПериодичностьКонтроля КАК Периодичность,
	|	Таблица.ВидКонтроля КАК ВидКонтроля,
	|	Таблица.ВидКонтроля КАК РежимКонтроля,
	|	Таблица.Сценарий КАК Сценарий,
	|	Таблица.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	Таблица.ХранилищеНастроекОтбора КАК ХранилищеНастроекОтбора,
	|	Таблица.ВидОтклоненияКоличество КАК ВидОтклоненияКоличество,
	|	Таблица.ВидОтклонения КАК ВидОтклонения,
	|	Таблица.ЗначениеОтклоненияКоличество КАК ЗначениеОтклоненияКоличество,
	|	Таблица.ЗначениеОтклонения КАК ЗначениеОтклонения,
	|	Таблица.ДатаНачала КАК ДатаНачала,
	|	Таблица.ДатаОкончания КАК ДатаОкончания,
	|	Таблица.Сценарий.Валюта КАК ВалютаСценария,
	|	Таблица.СценарийКонтролируемый.Валюта КАК ВалютаСценарияКонтролируемого,
	|	Таблица.НЗ_Аналитика_1 КАК НЗ_Аналитика_1,
	|	Таблица.НЗ_Аналитика_2 КАК НЗ_Аналитика_2,
	|	Таблица.НЗ_Аналитика_3 КАК НЗ_Аналитика_3,
	|	Таблица.НЗ_Аналитика_4 КАК НЗ_Аналитика_4,
	|	Таблица.НЗ_Аналитика_5 КАК НЗ_Аналитика_5,
	|	Таблица.НЗ_Аналитика_6 КАК НЗ_Аналитика_6,
	|	Таблица.НЗ_Аналитика_7 КАК НЗ_Аналитика_7,
	|	Таблица.НЗ_Аналитика_8 КАК НЗ_Аналитика_8,
	|	Таблица.НЗ_Аналитика_9 КАК НЗ_Аналитика_9,
	|	Таблица.НЗ_Аналитика_10 КАК НЗ_Аналитика_10,
	|	Таблица.НЗ_Аналитика_11 КАК НЗ_Аналитика_11,
	|	Таблица.НЗ_Аналитика_12 КАК НЗ_Аналитика_12
	|ПОМЕСТИТЬ ВременнаяТаблицаДокумента
	|ИЗ
	|	Документ.бит_УстановкаКонтрольныхЗначений КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Функция ТекстЗапросаРеквизитыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("РеквизитыДокумента", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаДокумента.Ссылка КАК Ссылка,
	|	ВременнаяТаблицаДокумента.НЗ_ЦФО КАК НЗ_ЦФО,
	|	ВременнаяТаблицаДокумента.ДатаНачалаКонтроля КАК ДатаНачалаКонтроля,
	|	ВременнаяТаблицаДокумента.ДатаОкончанияКонтроля КАК ДатаОкончанияКонтроля,
	|	ВременнаяТаблицаДокумента.Периодичность КАК Периодичность,
	|	ВременнаяТаблицаДокумента.ВидКонтроля КАК ВидКонтроля,
	|	ВременнаяТаблицаДокумента.РежимКонтроля КАК РежимКонтроля,
	|	ВременнаяТаблицаДокумента.Сценарий КАК Сценарий,
	|	ВременнаяТаблицаДокумента.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	ВременнаяТаблицаДокумента.ХранилищеНастроекОтбора КАК ХранилищеНастроекОтбора,
	|	ВременнаяТаблицаДокумента.ВидОтклоненияКоличество КАК ВидОтклоненияКоличество,
	|	ВременнаяТаблицаДокумента.ВидОтклонения КАК ВидОтклонения,
	|	ВременнаяТаблицаДокумента.ЗначениеОтклоненияКоличество КАК ЗначениеОтклоненияКоличество,
	|	ВременнаяТаблицаДокумента.ЗначениеОтклонения КАК ЗначениеОтклонения,
	|	ВременнаяТаблицаДокумента.ДатаНачала КАК ДатаНачала,
	|	ВременнаяТаблицаДокумента.ДатаОкончания КАК ДатаОкончания,
	|	ВременнаяТаблицаДокумента.ВалютаСценария КАК ВалютаСценария,
	|	ВременнаяТаблицаДокумента.ВалютаСценарияКонтролируемого КАК ВалютаСценарияКонтролируемого,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_1 КАК НЗ_Аналитика_1,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_2 КАК НЗ_Аналитика_2,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_3 КАК НЗ_Аналитика_3,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_4 КАК НЗ_Аналитика_4,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_5 КАК НЗ_Аналитика_5,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_6 КАК НЗ_Аналитика_6,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_7 КАК НЗ_Аналитика_7,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_8 КАК НЗ_Аналитика_8,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_9 КАК НЗ_Аналитика_9,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_10 КАК НЗ_Аналитика_10,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_11 КАК НЗ_Аналитика_11,
	|	ВременнаяТаблицаДокумента.НЗ_Аналитика_12 КАК НЗ_Аналитика_12
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ВременнаяТаблицаДокумента";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Функция ТекстЗапросаВременнаяТаблицаПереопределение(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаПереопределение", НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Регистратор,
	|	Таблица.НЗ_ЦФО КАК КонтрольЦФО,
	|	Таблица.ДатаНачалаКонтроля КАК ДатаНачалаКонтроля,
	|	Таблица.ДатаОкончанияКонтроля КАК ДатаОкончанияКонтроля,
	|	Таблица.Периодичность КАК Периодичность,
	|	Таблица.ВидКонтроля КАК ВидКонтроля,
	|	Таблица.Ссылка КАК НастройкаКонтроля,
	|	Таблица.РежимКонтроля КАК РежимКонтроля,
	|	Таблица.Сценарий КАК Сценарий,
	|	Таблица.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	Таблица.НЗ_Аналитика_1 КАК КонтрольАналитика_1,
	|	Таблица.НЗ_Аналитика_2 КАК КонтрольАналитика_2,
	|	Таблица.НЗ_Аналитика_3 КАК КонтрольАналитика_3,
	|	Таблица.НЗ_Аналитика_4 КАК КонтрольАналитика_4,
	|	Таблица.НЗ_Аналитика_5 КАК КонтрольАналитика_5,
	|	Таблица.НЗ_Аналитика_6 КАК КонтрольАналитика_6,
	|	Таблица.НЗ_Аналитика_7 КАК КонтрольАналитика_7,
	|	Таблица.НЗ_Аналитика_8 КАК КонтрольАналитика_8,
	|	Таблица.НЗ_Аналитика_9 КАК КонтрольАналитика_9,
	|	Таблица.НЗ_Аналитика_10 КАК КонтрольАналитика_10,
	|	Таблица.НЗ_Аналитика_11 КАК КонтрольАналитика_11,
	|	Таблица.НЗ_Аналитика_12 КАК КонтрольАналитика_12
	|ПОМЕСТИТЬ ВременнаяТаблицаПереопределение
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК Таблица";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции 

Функция ТекстЗапросаСрокиКонтроля(НомераТаблиц)
	
	НомераТаблиц.Вставить("СрокиКонтроляРеквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.КонтрольЦФО КАК КонтрольЦФО,
	|	Таблица.ДатаНачалаКонтроля КАК ДатаНачалаКонтроля,
	|	Таблица.ДатаОкончанияКонтроля КАК ДатаОкончанияКонтроля,
	|	Таблица.Периодичность КАК Периодичность,
	|	Таблица.НастройкаКонтроля КАК НастройкаКонтроля,
	|	Таблица.РежимКонтроля КАК РежимКонтроля,
	|	Таблица.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	Таблица.Сценарий КАК Сценарий,
	|	Таблица.КонтрольАналитика_1 КАК КонтрольАналитика_1,
	|	Таблица.КонтрольАналитика_2 КАК КонтрольАналитика_2,
	|	Таблица.КонтрольАналитика_3 КАК КонтрольАналитика_3,
	|	Таблица.КонтрольАналитика_4 КАК КонтрольАналитика_4,
	|	Таблица.КонтрольАналитика_5 КАК КонтрольАналитика_5,
	|	Таблица.КонтрольАналитика_6 КАК КонтрольАналитика_6,
	|	Таблица.КонтрольАналитика_7 КАК КонтрольАналитика_7,
	|	Таблица.КонтрольАналитика_8 КАК КонтрольАналитика_8,
	|	Таблица.КонтрольАналитика_9 КАК КонтрольАналитика_9,
	|	Таблица.КонтрольАналитика_10 КАК КонтрольАналитика_10,
	|	Таблица.КонтрольАналитика_11 КАК КонтрольАналитика_11,
	|	Таблица.КонтрольАналитика_12 КАК КонтрольАналитика_12
	|ИЗ
	|	ВременнаяТаблицаПереопределение КАК Таблица";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Функция ТекстЗапросаКонтрольныеЗначения(НомераТаблиц)
	
	НомераТаблиц.Вставить("КонтрольныеЗначенияРеквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.КонтрольЦФО КАК КонтрольЦФО,
	|	Таблица.ДатаНачалаКонтроля КАК ДатаНачалаКонтроля,
	|	Таблица.ДатаОкончанияКонтроля КАК ДатаОкончанияКонтроля,
	|	Таблица.Периодичность КАК Периодичность,
	|	Таблица.НастройкаКонтроля КАК НастройкаКонтроля,
	|	Таблица.РежимКонтроля КАК РежимКонтроля,
	|	Таблица.Сценарий КАК Сценарий,
	|	Таблица.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	Таблица.КонтрольАналитика_1 КАК КонтрольАналитика_1,
	|	Таблица.КонтрольАналитика_2 КАК КонтрольАналитика_2,
	|	Таблица.КонтрольАналитика_3 КАК КонтрольАналитика_3,
	|	Таблица.КонтрольАналитика_4 КАК КонтрольАналитика_4,
	|	Таблица.КонтрольАналитика_5 КАК КонтрольАналитика_5,
	|	Таблица.КонтрольАналитика_6 КАК КонтрольАналитика_6,
	|	Таблица.КонтрольАналитика_7 КАК КонтрольАналитика_7,
	|	Таблица.КонтрольАналитика_8 КАК КонтрольАналитика_8,
	|	Таблица.КонтрольАналитика_9 КАК КонтрольАналитика_9,
	|	Таблица.КонтрольАналитика_10 КАК КонтрольАналитика_10,
	|	Таблица.КонтрольАналитика_11 КАК КонтрольАналитика_11,
	|	Таблица.КонтрольАналитика_12 КАК КонтрольАналитика_12
	|ИЗ
	|	ВременнаяТаблицаПереопределение КАК Таблица";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Функция КонтрольныеЗначенияБюджетов(ТаблицаРеквизиты)
	
	Реквизиты = ТаблицаРеквизиты[0];
	ПостроительОтчета = Новый ПостроительОтчета;

	ИнициализироватьПостроительОтчета(ПостроительОтчета, Реквизиты);
	
	ПостроительОтчета.Выполнить(); 
	ПланБюджета = ПостроительОтчета.Результат.Выгрузить();
	
	Если Реквизиты.ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Бюджет Тогда
		ПодготовитьТаблицуРасчетыВВалюте(ПланБюджета, Реквизиты);
	КонецЕсли; 
	
	КонтрольныеЗначения = бит_КонтрольИсполненияБюджета.ПустаяТаблицаКонтрольныеЗначения();

	Для каждого СтрокаТаблицы Из ПланБюджета Цикл
		НоваяСтрока = КонтрольныеЗначения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.ИмяСписка     = "КонтрольныеЗначения";
		НоваяСтрока.СинонимСписка = НСтр("ru = 'Контрольные значения'; en = 'Reference value'");
		НоваяСтрока.НомерСтроки   = КонтрольныеЗначения.Количество();
	КонецЦикла; 
	
	// Удаление строк плана бюджета, которые уже использовались для установки лимитов.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПланБюджета", КонтрольныеЗначения);
	Запрос.УстановитьПараметр("ИмяСписка",   "КонтрольныеЗначения");
	Запрос.УстановитьПараметр("Регистратор", Реквизиты.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланБюджета.Период КАК Период,
	|	ПланБюджета.НомерСтроки КАК НомерСтроки,
	|	ПланБюджета.РежимКонтроля КАК РежимКонтроля,
	|	ПланБюджета.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	ПланБюджета.Сценарий КАК Сценарий,
	|	ПланБюджета.ЦФО КАК ЦФО,
	|	ПланБюджета.СтатьяОборотов КАК СтатьяОборотов,
	|	ПланБюджета.СуммаСценарийКонтроль КАК СуммаСценарийКонтроль,
	|	ПланБюджета.СуммаСценарийИсполнение КАК СуммаСценарийИсполнение,
	|	ПланБюджета.СуммаСценарийСверхЛимита КАК СуммаСценарийСверхЛимита,
	|	ПланБюджета.КоличествоСценарийКонтроль КАК КоличествоСценарийКонтроль,
	|	ПланБюджета.КоличествоСценарийИсполнение КАК КоличествоСценарийИсполнение,
	|	ПланБюджета.КоличествоСценарийСверхЛимита КАК КоличествоСценарийСверхЛимита,
	|	ПланБюджета.ДокументПланирования КАК ДокументПланирования,
	|	ПланБюджета.ИмяСписка КАК ИмяСписка,
	|	ПланБюджета.СинонимСписка КАК СинонимСписка,
	|	ПланБюджета.Аналитика_1 КАК Аналитика_1,
	|	ПланБюджета.Аналитика_2 КАК Аналитика_2,
	|	ПланБюджета.Аналитика_3 КАК Аналитика_3,
	|	ПланБюджета.Аналитика_4 КАК Аналитика_4,
	|	ПланБюджета.Аналитика_5 КАК Аналитика_5,
	|	ПланБюджета.Аналитика_6 КАК Аналитика_6,
	|	ПланБюджета.Аналитика_7 КАК Аналитика_7,
	|	ПланБюджета.Аналитика_8 КАК Аналитика_8,
	|	ПланБюджета.Аналитика_9 КАК Аналитика_9,
	|	ПланБюджета.Аналитика_10 КАК Аналитика_10,
	|	ПланБюджета.Аналитика_11 КАК Аналитика_11,
	|	ПланБюджета.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ ПланБюджета
	|ИЗ
	|	&ПланБюджета КАК ПланБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланБюджета.Период КАК Период,
	|	ПланБюджета.НомерСтроки КАК НомерСтроки,
	|	ПланБюджета.РежимКонтроля КАК РежимКонтроля,
	|	ПланБюджета.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	ПланБюджета.Сценарий КАК Сценарий,
	|	ПланБюджета.ЦФО КАК ЦФО,
	|	ПланБюджета.СтатьяОборотов КАК СтатьяОборотов,
	|	ПланБюджета.СуммаСценарийКонтроль КАК СуммаСценарийКонтроль,
	|	ПланБюджета.СуммаСценарийИсполнение КАК СуммаСценарийИсполнение,
	|	ПланБюджета.СуммаСценарийСверхЛимита КАК СуммаСценарийСверхЛимита,
	|	ПланБюджета.КоличествоСценарийКонтроль КАК КоличествоСценарийКонтроль,
	|	ПланБюджета.КоличествоСценарийИсполнение КАК КоличествоСценарийИсполнение,
	|	ПланБюджета.КоличествоСценарийСверхЛимита КАК КоличествоСценарийСверхЛимита,
	|	ПланБюджета.ДокументПланирования КАК ДокументПланирования,
	|	ПланБюджета.ИмяСписка КАК ИмяСписка,
	|	ПланБюджета.СинонимСписка КАК СинонимСписка,
	|	НЕ КонтрольныеЗначенияБюджетов.Период ЕСТЬ NULL КАК ЛимитУстановлен,
	|	ПланБюджета.Аналитика_1 КАК Аналитика_1,
	|	ПланБюджета.Аналитика_2 КАК Аналитика_2,
	|	ПланБюджета.Аналитика_3 КАК Аналитика_3,
	|	ПланБюджета.Аналитика_4 КАК Аналитика_4,
	|	ПланБюджета.Аналитика_5 КАК Аналитика_5,
	|	ПланБюджета.Аналитика_6 КАК Аналитика_6,
	|	ПланБюджета.Аналитика_7 КАК Аналитика_7,
	|	ПланБюджета.Аналитика_8 КАК Аналитика_8,
	|	ПланБюджета.Аналитика_9 КАК Аналитика_9,
	|	ПланБюджета.Аналитика_10 КАК Аналитика_10,
	|	ПланБюджета.Аналитика_11 КАК Аналитика_11,
	|	ПланБюджета.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	ПланБюджета КАК ПланБюджета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_КонтрольныеЗначенияБюджетов КАК КонтрольныеЗначенияБюджетов
	|		ПО ПланБюджета.Период = КонтрольныеЗначенияБюджетов.Период
	|			И ПланБюджета.РежимКонтроля = КонтрольныеЗначенияБюджетов.РежимКонтроля
	|			И ПланБюджета.СценарийКонтролируемый = КонтрольныеЗначенияБюджетов.СценарийКонтролируемый
	|			И ПланБюджета.Сценарий = КонтрольныеЗначенияБюджетов.Сценарий
	|			И ПланБюджета.ЦФО = КонтрольныеЗначенияБюджетов.ЦФО
	|			И ПланБюджета.СтатьяОборотов = КонтрольныеЗначенияБюджетов.СтатьяОборотов
	|			И (ТИПЗНАЧЕНИЯ(КонтрольныеЗначенияБюджетов.Регистратор) = ТИП(Документ.бит_УстановкаКонтрольныхЗначений))
	|			И ПланБюджета.Аналитика_1 = КонтрольныеЗначенияБюджетов.Аналитика_1
	|			И ПланБюджета.Аналитика_2 = КонтрольныеЗначенияБюджетов.Аналитика_2
	|			И ПланБюджета.Аналитика_3 = КонтрольныеЗначенияБюджетов.Аналитика_3
	|			И ПланБюджета.Аналитика_4 = КонтрольныеЗначенияБюджетов.Аналитика_4
	|			И ПланБюджета.Аналитика_5 = КонтрольныеЗначенияБюджетов.Аналитика_5
	|			И ПланБюджета.Аналитика_6 = КонтрольныеЗначенияБюджетов.Аналитика_6
	|			И ПланБюджета.Аналитика_7 = КонтрольныеЗначенияБюджетов.Аналитика_7
	|			И ПланБюджета.Аналитика_8 = КонтрольныеЗначенияБюджетов.Аналитика_8
	|			И ПланБюджета.Аналитика_9 = КонтрольныеЗначенияБюджетов.Аналитика_9
	|			И ПланБюджета.Аналитика_10 = КонтрольныеЗначенияБюджетов.Аналитика_10
	|			И ПланБюджета.Аналитика_11 = КонтрольныеЗначенияБюджетов.Аналитика_11
	|			И ПланБюджета.Аналитика_12 = КонтрольныеЗначенияБюджетов.Аналитика_12
	|ГДЕ
	|	КонтрольныеЗначенияБюджетов.Регистратор ЕСТЬ NULL"; 
	
	КонтрольныеЗначения = Запрос.Выполнить().Выгрузить();

	Возврат КонтрольныеЗначения;
	
КонецФункции

Функция СрокиКонтроляПоБюджету(КонтрольныеЗначения, ТаблицаРеквизиты)

	ДанныеДокумента = КонтрольныеЗначения.Скопировать(); 
	ДанныеДокумента.Колонки.Добавить("НачалоПериода", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ДанныеДокумента.Колонки.Добавить("КонецПериода",  ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));

	Если НЕ ЗначениеЗаполнено(КонтрольныеЗначения) Тогда
		Возврат ДанныеДокумента;	
	КонецЕсли;
	
	Реквизиты = ТаблицаРеквизиты[0];
	Для каждого СтрокаТаблицы Из ДанныеДокумента Цикл
		СтрокаТаблицы.НачалоПериода	= СтрокаТаблицы.Период;
		Если ЗначениеЗаполнено(Реквизиты.Периодичность) Тогда
			СтрокаТаблицы.КонецПериода = бит_ОбщегоНазначенияКлиентСервер.ПолучитьКонецПериода(
											СтрокаТаблицы.Период, Реквизиты.Периодичность);
		Иначе
			// Это не ошибка. Контроль за весь период.
			СтрокаТаблицы.КонецПериода = КонецДня(Реквизиты.ДатаОкончанияКонтроля);							
		КонецЕсли;
	КонецЦикла; 

	// Выполняется подбор настроек, для исключения повторной регистрации.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", 	   	 	Реквизиты.Регистратор);
	Запрос.УстановитьПараметр("Периодичность", 	   	 	Реквизиты.Периодичность);
	Запрос.УстановитьПараметр("РежимКонтроля", 	   	 	Реквизиты.РежимКонтроля);
	Запрос.УстановитьПараметр("СценарийКонтролируемый", Реквизиты.СценарийКонтролируемый);
	Запрос.УстановитьПараметр("ДанныеДокумента", 		ДанныеДокумента);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Периодичность КАК Периодичность,
	|	&РежимКонтроля КАК РежимКонтроля,
	|	&СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	Таблица.Период КАК Период,
	|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
	|	Таблица.ЦФО КАК ЦФО,
	|	Таблица.НачалоПериода КАК НачалоПериода,
	|	Таблица.КонецПериода КАК КонецПериода,
	|	Таблица.ИмяСписка КАК ИмяСписка,
	|	Таблица.СинонимСписка КАК СинонимСписка,
	|	Таблица.Аналитика_1 КАК Аналитика_1,
	|	Таблица.Аналитика_2 КАК Аналитика_2,
	|	Таблица.Аналитика_3 КАК Аналитика_3,
	|	Таблица.Аналитика_4 КАК Аналитика_4,
	|	Таблица.Аналитика_5 КАК Аналитика_5,
	|	Таблица.Аналитика_6 КАК Аналитика_6,
	|	Таблица.Аналитика_7 КАК Аналитика_7,
	|	Таблица.Аналитика_8 КАК Аналитика_8,
	|	Таблица.Аналитика_9 КАК Аналитика_9,
	|	Таблица.Аналитика_10 КАК Аналитика_10,
	|	Таблица.Аналитика_11 КАК Аналитика_11,
	|	Таблица.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ ВТСрокиКонтроля
	|ИЗ
	|	&ДанныеДокумента КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСрокиКонтроля.Периодичность КАК Периодичность,
	|	ВТСрокиКонтроля.РежимКонтроля КАК РежимКонтроля,
	|	ВТСрокиКонтроля.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	ВТСрокиКонтроля.Период КАК Период,
	|	ВТСрокиКонтроля.СтатьяОборотов КАК СтатьяОборотов,
	|	ВТСрокиКонтроля.ЦФО КАК ЦФО,
	|	ВТСрокиКонтроля.НачалоПериода КАК НачалоПериода,
	|	ВТСрокиКонтроля.КонецПериода КАК КонецПериода,
	|	ВТСрокиКонтроля.ИмяСписка КАК ИмяСписка,
	|	ВТСрокиКонтроля.СинонимСписка КАК СинонимСписка,
	|	ВТСрокиКонтроля.Аналитика_1 КАК Аналитика_1,
	|	ВТСрокиКонтроля.Аналитика_2 КАК Аналитика_2,
	|	ВТСрокиКонтроля.Аналитика_3 КАК Аналитика_3,
	|	ВТСрокиКонтроля.Аналитика_4 КАК Аналитика_4,
	|	ВТСрокиКонтроля.Аналитика_5 КАК Аналитика_5,
	|	ВТСрокиКонтроля.Аналитика_6 КАК Аналитика_6,
	|	ВТСрокиКонтроля.Аналитика_7 КАК Аналитика_7,
	|	ВТСрокиКонтроля.Аналитика_8 КАК Аналитика_8,
	|	ВТСрокиКонтроля.Аналитика_9 КАК Аналитика_9,
	|	ВТСрокиКонтроля.Аналитика_10 КАК Аналитика_10,
	|	ВТСрокиКонтроля.Аналитика_11 КАК Аналитика_11,
	|	ВТСрокиКонтроля.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	ВТСрокиКонтроля КАК ВТСрокиКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СрокиКонтроляПоБюджету КАК СрокиКонтроляПоБюджету
	|		ПО ВТСрокиКонтроля.РежимКонтроля = СрокиКонтроляПоБюджету.РежимКонтроля
	|			И ВТСрокиКонтроля.СценарийКонтролируемый = СрокиКонтроляПоБюджету.СценарийКонтролируемый
	|			И ВТСрокиКонтроля.СтатьяОборотов = СрокиКонтроляПоБюджету.СтатьяОборотов
	|			И ВТСрокиКонтроля.ЦФО = СрокиКонтроляПоБюджету.ЦФО
	|			И ВТСрокиКонтроля.Период = СрокиКонтроляПоБюджету.Период
	|			И ВТСрокиКонтроля.Периодичность = СрокиКонтроляПоБюджету.Периодичность
	|			И ВТСрокиКонтроля.Аналитика_1 = СрокиКонтроляПоБюджету.Аналитика_1
	|			И ВТСрокиКонтроля.Аналитика_2 = СрокиКонтроляПоБюджету.Аналитика_2
	|			И ВТСрокиКонтроля.Аналитика_3 = СрокиКонтроляПоБюджету.Аналитика_3
	|			И ВТСрокиКонтроля.Аналитика_4 = СрокиКонтроляПоБюджету.Аналитика_4
	|			И ВТСрокиКонтроля.Аналитика_5 = СрокиКонтроляПоБюджету.Аналитика_5
	|			И ВТСрокиКонтроля.Аналитика_6 = СрокиКонтроляПоБюджету.Аналитика_6
	|			И ВТСрокиКонтроля.Аналитика_7 = СрокиКонтроляПоБюджету.Аналитика_7
	|			И ВТСрокиКонтроля.Аналитика_8 = СрокиКонтроляПоБюджету.Аналитика_9
	|			И ВТСрокиКонтроля.Аналитика_9 = СрокиКонтроляПоБюджету.Аналитика_10
	|			И ВТСрокиКонтроля.Аналитика_10 = СрокиКонтроляПоБюджету.Аналитика_11
	|			И ВТСрокиКонтроля.Аналитика_11 = СрокиКонтроляПоБюджету.Аналитика_11
	|			И ВТСрокиКонтроля.Аналитика_12 = СрокиКонтроляПоБюджету.Аналитика_12
	|ГДЕ
	|	СрокиКонтроляПоБюджету.Регистратор ЕСТЬ NULL";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	ДанныеДокумента.Очистить();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеДокумента.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат ДанныеДокумента;	
	
КонецФункции
 
Процедура ПодготовитьТаблицуРасчетыВВалюте(КонтрольныхЗначений, Реквизиты)
	
	// Приведем суммы к валюте контролируемого сценария.
	
	ТаблицаПериодов = КонтрольныхЗначений.Скопировать();
	ТаблицаПериодов.Свернуть("Период");
	
	// Установим настройки для получения курсов по периодам.
	КурсыВалют = Новый Структура;
	ВалютаСценария = Новый Структура;
	ВалютаСценария.Вставить("Валюта", Реквизиты.ВалютаСценария);
	КурсыВалют.Вставить("Сценарий", ВалютаСценария);
	
	ВалютаКонтролируемогоСценария = Новый Структура;
	ВалютаКонтролируемогоСценария.Вставить("Валюта", Реквизиты.ВалютаСценарияКонтролируемого);
	КурсыВалют.Вставить("СценарийКонтролируемый", ВалютаКонтролируемогоСценария);
	
	// Получим курсы по периодам
	КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, КурсыВалют, Реквизиты.Сценарий);
	
	Для каждого СтрокаТаблицы Из КонтрольныхЗначений Цикл
		КурсыПериода = КурсыПоПериодам[СтрокаТаблицы.Период];
		Если КурсыПериода <> Неопределено Тогда
			
			ПараметрыТекущегоКурса = Новый Структура("Валюта, Курс, Кратность");
			ЗаполнитьЗначенияСвойств(ПараметрыТекущегоКурса, КурсыПериода.Сценарий);
			
			ПараметрыНовогоКурса = Новый Структура("Валюта, Курс, Кратность");
			ЗаполнитьЗначенияСвойств(ПараметрыНовогоКурса, КурсыПериода.СценарийКонтролируемый);
			
			СтрокаТаблицы.СуммаСценарийКонтроль = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
			СтрокаТаблицы.СуммаСценарийКонтроль, 
			ПараметрыТекущегоКурса, ПараметрыНовогоКурса);
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

// Контроль на песечение большего количества разрезов к меньшему.
//
Процедура ВыполнитьКонтрольПересеченияНастроекЧ1(Запрос, ИзмеренияКонтроля, Отказ, Допроведение)
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка КАК ИмяСписка,
	|	МАКСИМУМ(НастройкиКонтроля.Период) КАК Период,
	|	НастройкиКонтроля.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	НастройкиКонтроля.Сценарий КАК Сценарий,
	|	НастройкиКонтроля.СтатьяОборотов КАК СтатьяОборотов,
	|	НастройкиКонтроля.ЦФО КАК ЦФО,
	|	НастройкиКонтроля.РежимКонтроля КАК РежимКонтроля,
	|	НастройкиКонтроля.Аналитика_1 КАК Аналитика_1,
	|	НастройкиКонтроля.Аналитика_2 КАК Аналитика_2,
	|	НастройкиКонтроля.Аналитика_3 КАК Аналитика_3,
	|	НастройкиКонтроля.Аналитика_4 КАК Аналитика_4,
	|	НастройкиКонтроля.Аналитика_5 КАК Аналитика_5,
	|	НастройкиКонтроля.Аналитика_6 КАК Аналитика_6,
	|	НастройкиКонтроля.Аналитика_7 КАК Аналитика_7,
	|	НастройкиКонтроля.Аналитика_8 КАК Аналитика_8,
	|	НастройкиКонтроля.Аналитика_9 КАК Аналитика_9,
	|	НастройкиКонтроля.Аналитика_10 КАК Аналитика_10,
	|	НастройкиКонтроля.Аналитика_11 КАК Аналитика_11,
	|	НастройкиКонтроля.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ СрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СрокиКонтроляПоБюджету КАК НастройкиКонтроля
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеквизиты КАК Реквизиты
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО (НастройкиКонтроля.СценарийКонтролируемый = &СценарийКонтролируемый)
	|			И (НастройкиКонтроля.Сценарий = &Сценарий)
	|			И (НастройкиКонтроля.РежимКонтроля = &РежимКонтроля)
	|			И НастройкиКонтроля.СтатьяОборотов = ВременнаяТаблица.СтатьяОборотов
	|			И (ВременнаяТаблица.Период МЕЖДУ НастройкиКонтроля.НачалоПериода И НастройкиКонтроля.КонецПериода
	|				ИЛИ НастройкиКонтроля.Период МЕЖДУ ВременнаяТаблица.НачалоПериода И ВременнаяТаблица.КонецПериода)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольЦФО
	|					ТОГДА НастройкиКонтроля.ЦФО = ВременнаяТаблица.ЦФО
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_1
	|					ТОГДА НастройкиКонтроля.Аналитика_1 = ВременнаяТаблица.Аналитика_1
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_2
	|					ТОГДА НастройкиКонтроля.Аналитика_2 = ВременнаяТаблица.Аналитика_2
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_3
	|					ТОГДА НастройкиКонтроля.Аналитика_3 = ВременнаяТаблица.Аналитика_3
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_4
	|					ТОГДА НастройкиКонтроля.Аналитика_4 = ВременнаяТаблица.Аналитика_4
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_5
	|					ТОГДА НастройкиКонтроля.Аналитика_5 = ВременнаяТаблица.Аналитика_5
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_6
	|					ТОГДА НастройкиКонтроля.Аналитика_6 = ВременнаяТаблица.Аналитика_6
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_7
	|					ТОГДА НастройкиКонтроля.Аналитика_7 = ВременнаяТаблица.Аналитика_7
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_8
	|					ТОГДА НастройкиКонтроля.Аналитика_8 = ВременнаяТаблица.Аналитика_8
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_9
	|					ТОГДА НастройкиКонтроля.Аналитика_9 = ВременнаяТаблица.Аналитика_9
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_10
	|					ТОГДА НастройкиКонтроля.Аналитика_10 = ВременнаяТаблица.Аналитика_10
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_11
	|					ТОГДА НастройкиКонтроля.Аналитика_11 = ВременнаяТаблица.Аналитика_11
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НастройкиКонтроля.КонтрольАналитика_12
	|					ТОГДА НастройкиКонтроля.Аналитика_12 = ВременнаяТаблица.Аналитика_12
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиКонтроля.СценарийКонтролируемый,
	|	НастройкиКонтроля.СтатьяОборотов,
	|	НастройкиКонтроля.ЦФО,
	|	ВременнаяТаблица.НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка,
	|	НастройкиКонтроля.РежимКонтроля,
	|	НастройкиКонтроля.Сценарий,
	|	НастройкиКонтроля.Аналитика_1,
	|	НастройкиКонтроля.Аналитика_2,
	|	НастройкиКонтроля.Аналитика_3,
	|	НастройкиКонтроля.Аналитика_4,
	|	НастройкиКонтроля.Аналитика_5,
	|	НастройкиКонтроля.Аналитика_6,
	|	НастройкиКонтроля.Аналитика_7,
	|	НастройкиКонтроля.Аналитика_8,
	|	НастройкиКонтроля.Аналитика_9,
	|	НастройкиКонтроля.Аналитика_10,
	|	НастройкиКонтроля.Аналитика_11,
	|	НастройкиКонтроля.Аналитика_12
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СрезПоследних.Период КАК Период,
	|	НастройкиКонтроля.ЦФО КАК ЦФО,
	|	НастройкиКонтроля.СтатьяОборотов КАК СтатьяОборотов,
	|	НастройкиКонтроля.НачалоПериода КАК НачалоПериода,
	|	КОНЕЦПЕРИОДА(НастройкиКонтроля.КонецПериода, ДЕНЬ) КАК КонецПериода,
	|	НастройкиКонтроля.Периодичность КАК Периодичность,
	|	НастройкиКонтроля.Сценарий КАК Сценарий,
	|	ВременнаяТаблица.ИмяСписка КАК ИмяСписка,
	|	ВременнаяТаблица.СинонимСписка КАК СинонимСписка,
	|	НастройкиКонтроля.РежимКонтроля КАК РежимКонтроля,
	|	НастройкиКонтроля.Регистратор КАК Регистратор,
	|	НастройкиКонтроля.Аналитика_1 КАК Аналитика_1,
	|	НастройкиКонтроля.Аналитика_2 КАК Аналитика_2,
	|	НастройкиКонтроля.Аналитика_3 КАК Аналитика_3,
	|	НастройкиКонтроля.Аналитика_4 КАК Аналитика_4,
	|	НастройкиКонтроля.Аналитика_5 КАК Аналитика_5,
	|	НастройкиКонтроля.Аналитика_6 КАК Аналитика_6,
	|	НастройкиКонтроля.Аналитика_7 КАК Аналитика_7,
	|	НастройкиКонтроля.Аналитика_8 КАК Аналитика_8,
	|	НастройкиКонтроля.Аналитика_9 КАК Аналитика_9,
	|	НастройкиКонтроля.Аналитика_10 КАК Аналитика_10,
	|	НастройкиКонтроля.Аналитика_11 КАК Аналитика_11,
	|	НастройкиКонтроля.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрезПоследних КАК СрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СрокиКонтроляПоБюджету КАК НастройкиКонтроля
	|			ПО СрезПоследних.Период = НастройкиКонтроля.Период
	|				И СрезПоследних.СценарийКонтролируемый = НастройкиКонтроля.СценарийКонтролируемый
	|				И СрезПоследних.ЦФО = НастройкиКонтроля.ЦФО
	|				И СрезПоследних.СтатьяОборотов = НастройкиКонтроля.СтатьяОборотов
	|				И СрезПоследних.РежимКонтроля = НастройкиКонтроля.РежимКонтроля
	|				И СрезПоследних.Сценарий = НастройкиКонтроля.Сценарий
	|				И СрезПоследних.Аналитика_1 = НастройкиКонтроля.Аналитика_1
	|				И СрезПоследних.Аналитика_2 = НастройкиКонтроля.Аналитика_2
	|				И СрезПоследних.Аналитика_3 = НастройкиКонтроля.Аналитика_3
	|				И СрезПоследних.Аналитика_4 = НастройкиКонтроля.Аналитика_4
	|				И СрезПоследних.Аналитика_5 = НастройкиКонтроля.Аналитика_5
	|				И СрезПоследних.Аналитика_6 = НастройкиКонтроля.Аналитика_6
	|				И СрезПоследних.Аналитика_7 = НастройкиКонтроля.Аналитика_7
	|				И СрезПоследних.Аналитика_8 = НастройкиКонтроля.Аналитика_8
	|				И СрезПоследних.Аналитика_9 = НастройкиКонтроля.Аналитика_9
	|				И СрезПоследних.Аналитика_10 = НастройкиКонтроля.Аналитика_10
	|				И СрезПоследних.Аналитика_11 = НастройкиКонтроля.Аналитика_11
	|				И СрезПоследних.Аналитика_12 = НастройкиКонтроля.Аналитика_12
	|		ПО ВременнаяТаблица.НомерСтроки = СрезПоследних.НомерСтроки
	|			И ВременнаяТаблица.ИмяСписка = СрезПоследних.ИмяСписка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИмяСписка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СрезПоследних";
	
	РезультатЗапроса  = Запрос.Выполнить();
	Выборка           = РезультатЗапроса.Выбрать();
	
	СообщитьОПересеченииНастроек(Выборка, ИзмеренияКонтроля, Отказ, Допроведение);
	
КонецПроцедуры

// Контроль на песечение меньшего количества разрезов к большего.
//
Процедура ВыполнитьКонтрольПересеченияНастроекЧ2(Запрос, ИзмеренияКонтроля, Отказ, Допроведение)

	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка КАК ИмяСписка,
	|	МАКСИМУМ(НастройкиКонтроля.Период) КАК Период,
	|	НастройкиКонтроля.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	НастройкиКонтроля.Сценарий КАК Сценарий,
	|	НастройкиКонтроля.СтатьяОборотов КАК СтатьяОборотов,
	|	НастройкиКонтроля.ЦФО КАК ЦФО,
	|	НастройкиКонтроля.РежимКонтроля КАК РежимКонтроля,
	|	НастройкиКонтроля.Аналитика_1 КАК Аналитика_1,
	|	НастройкиКонтроля.Аналитика_2 КАК Аналитика_2,
	|	НастройкиКонтроля.Аналитика_3 КАК Аналитика_3,
	|	НастройкиКонтроля.Аналитика_4 КАК Аналитика_4,
	|	НастройкиКонтроля.Аналитика_5 КАК Аналитика_5,
	|	НастройкиКонтроля.Аналитика_6 КАК Аналитика_6,
	|	НастройкиКонтроля.Аналитика_7 КАК Аналитика_7,
	|	НастройкиКонтроля.Аналитика_8 КАК Аналитика_8,
	|	НастройкиКонтроля.Аналитика_9 КАК Аналитика_9,
	|	НастройкиКонтроля.Аналитика_10 КАК Аналитика_10,
	|	НастройкиКонтроля.Аналитика_11 КАК Аналитика_11,
	|	НастройкиКонтроля.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ СрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СрокиКонтроляПоБюджету КАК НастройкиКонтроля
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеквизиты КАК ВременнаяТаблицаРеквизиты
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО (НастройкиКонтроля.СценарийКонтролируемый = &СценарийКонтролируемый)
	|			И (НастройкиКонтроля.Сценарий = &Сценарий)
	|			И (НастройкиКонтроля.РежимКонтроля = &РежимКонтроля)
	|			И НастройкиКонтроля.СтатьяОборотов = ВременнаяТаблица.СтатьяОборотов
	|			И (ВременнаяТаблица.Период МЕЖДУ НастройкиКонтроля.НачалоПериода И НастройкиКонтроля.КонецПериода
	|				ИЛИ НастройкиКонтроля.Период МЕЖДУ ВременнаяТаблица.НачалоПериода И ВременнаяТаблица.КонецПериода)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольЦФО
	|					ТОГДА НастройкиКонтроля.ЦФО = ВременнаяТаблица.ЦФО
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_1
	|					ТОГДА НастройкиКонтроля.Аналитика_1 = ВременнаяТаблица.Аналитика_1
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_2
	|					ТОГДА НастройкиКонтроля.Аналитика_2 = ВременнаяТаблица.Аналитика_2
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_3
	|					ТОГДА НастройкиКонтроля.Аналитика_3 = ВременнаяТаблица.Аналитика_3
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_4
	|					ТОГДА НастройкиКонтроля.Аналитика_4 = ВременнаяТаблица.Аналитика_4
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_5
	|					ТОГДА НастройкиКонтроля.Аналитика_5 = ВременнаяТаблица.Аналитика_5
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_6
	|					ТОГДА НастройкиКонтроля.Аналитика_6 = ВременнаяТаблица.Аналитика_6
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_7
	|					ТОГДА НастройкиКонтроля.Аналитика_7 = ВременнаяТаблица.Аналитика_7
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_8
	|					ТОГДА НастройкиКонтроля.Аналитика_8 = ВременнаяТаблица.Аналитика_8
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_9
	|					ТОГДА НастройкиКонтроля.Аналитика_9 = ВременнаяТаблица.Аналитика_9
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_10
	|					ТОГДА НастройкиКонтроля.Аналитика_10 = ВременнаяТаблица.Аналитика_10
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_11
	|					ТОГДА НастройкиКонтроля.Аналитика_11 = ВременнаяТаблица.Аналитика_11
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_12
	|					ТОГДА НастройкиКонтроля.Аналитика_12 = ВременнаяТаблица.Аналитика_12
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиКонтроля.СценарийКонтролируемый,
	|	НастройкиКонтроля.СтатьяОборотов,
	|	НастройкиКонтроля.ЦФО,
	|	ВременнаяТаблица.НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка,
	|	НастройкиКонтроля.РежимКонтроля,
	|	НастройкиКонтроля.Сценарий,
	|	НастройкиКонтроля.Аналитика_1,
	|	НастройкиКонтроля.Аналитика_2,
	|	НастройкиКонтроля.Аналитика_3,
	|	НастройкиКонтроля.Аналитика_4,
	|	НастройкиКонтроля.Аналитика_5,
	|	НастройкиКонтроля.Аналитика_6,
	|	НастройкиКонтроля.Аналитика_7,
	|	НастройкиКонтроля.Аналитика_8,
	|	НастройкиКонтроля.Аналитика_9,
	|	НастройкиКонтроля.Аналитика_10,
	|	НастройкиКонтроля.Аналитика_11,
	|	НастройкиКонтроля.Аналитика_12
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СрезПоследних.Период КАК Период,
	|	НастройкиКонтроля.ЦФО КАК ЦФО,
	|	НастройкиКонтроля.СтатьяОборотов КАК СтатьяОборотов,
	|	НастройкиКонтроля.Сценарий КАК Сценарий,
	|	ВременнаяТаблица.ИмяСписка КАК ИмяСписка,
	|	ВременнаяТаблица.СинонимСписка КАК СинонимСписка,
	|	НастройкиКонтроля.РежимКонтроля КАК РежимКонтроля,
	|	НастройкиКонтроля.Регистратор КАК Регистратор,
	|	ВременнаяТаблица.НачалоПериода КАК НачалоПериода,
	|	ВременнаяТаблица.КонецПериода КАК КонецПериода,
	|	НастройкиКонтроля.Периодичность КАК Периодичность,
	|	ВременнаяТаблица.Аналитика_1 КАК Аналитика_1,
	|	ВременнаяТаблица.Аналитика_2 КАК Аналитика_2,
	|	ВременнаяТаблица.Аналитика_3 КАК Аналитика_3,
	|	ВременнаяТаблица.Аналитика_4 КАК Аналитика_4,
	|	ВременнаяТаблица.Аналитика_5 КАК Аналитика_5,
	|	ВременнаяТаблица.Аналитика_6 КАК Аналитика_6,
	|	ВременнаяТаблица.Аналитика_7 КАК Аналитика_7,
	|	ВременнаяТаблица.Аналитика_8 КАК Аналитика_8,
	|	ВременнаяТаблица.Аналитика_9 КАК Аналитика_9,
	|	ВременнаяТаблица.Аналитика_10 КАК Аналитика_10,
	|	ВременнаяТаблица.Аналитика_11 КАК Аналитика_11,
	|	ВременнаяТаблица.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеквизиты КАК ВременнаяТаблицаРеквизиты
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрезПоследних КАК СрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СрокиКонтроляПоБюджету КАК НастройкиКонтроля
	|			ПО СрезПоследних.Период = НастройкиКонтроля.Период
	|				И СрезПоследних.СценарийКонтролируемый = НастройкиКонтроля.СценарийКонтролируемый
	|				И СрезПоследних.ЦФО = НастройкиКонтроля.ЦФО
	|				И СрезПоследних.СтатьяОборотов = НастройкиКонтроля.СтатьяОборотов
	|				И СрезПоследних.РежимКонтроля = НастройкиКонтроля.РежимКонтроля
	|				И СрезПоследних.Сценарий = НастройкиКонтроля.Сценарий
	|				И СрезПоследних.Аналитика_1 = НастройкиКонтроля.Аналитика_1
	|				И СрезПоследних.Аналитика_2 = НастройкиКонтроля.Аналитика_2
	|				И СрезПоследних.Аналитика_3 = НастройкиКонтроля.Аналитика_3
	|				И СрезПоследних.Аналитика_4 = НастройкиКонтроля.Аналитика_4
	|				И СрезПоследних.Аналитика_5 = НастройкиКонтроля.Аналитика_5
	|				И СрезПоследних.Аналитика_6 = НастройкиКонтроля.Аналитика_6
	|				И СрезПоследних.Аналитика_7 = НастройкиКонтроля.Аналитика_7
	|				И СрезПоследних.Аналитика_8 = НастройкиКонтроля.Аналитика_8
	|				И СрезПоследних.Аналитика_9 = НастройкиКонтроля.Аналитика_9
	|				И СрезПоследних.Аналитика_10 = НастройкиКонтроля.Аналитика_10
	|				И СрезПоследних.Аналитика_11 = НастройкиКонтроля.Аналитика_11
	|				И СрезПоследних.Аналитика_12 = НастройкиКонтроля.Аналитика_12
	|		ПО ВременнаяТаблица.НомерСтроки = СрезПоследних.НомерСтроки
	|			И ВременнаяТаблица.ИмяСписка = СрезПоследних.ИмяСписка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИмяСписка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СрезПоследних";
	
	РезультатЗапроса  = Запрос.Выполнить();
	Выборка           = РезультатЗапроса.Выбрать();
	
	СообщитьОПересеченииНастроек(Выборка, ИзмеренияКонтроля, Отказ, Допроведение);

КонецПроцедуры 

// Контроль на песечение значений аналитик.
//
Процедура ВыполнитьКонтрольПересеченияНастроекЧ3(Запрос, ИзмеренияКонтроля, Отказ, Допроведение)

	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка КАК ИмяСписка,
	|	МАКСИМУМ(НастройкиКонтроля.Период) КАК Период,
	|	НастройкиКонтроля.СценарийКонтролируемый КАК СценарийКонтролируемый,
	|	НастройкиКонтроля.Сценарий КАК Сценарий,
	|	НастройкиКонтроля.СтатьяОборотов КАК СтатьяОборотов,
	|	НастройкиКонтроля.ЦФО КАК ЦФО,
	|	НастройкиКонтроля.РежимКонтроля КАК РежимКонтроля,
	|	НастройкиКонтроля.Аналитика_1 КАК Аналитика_1,
	|	НастройкиКонтроля.Аналитика_2 КАК Аналитика_2,
	|	НастройкиКонтроля.Аналитика_3 КАК Аналитика_3,
	|	НастройкиКонтроля.Аналитика_4 КАК Аналитика_4,
	|	НастройкиКонтроля.Аналитика_5 КАК Аналитика_5,
	|	НастройкиКонтроля.Аналитика_6 КАК Аналитика_6,
	|	НастройкиКонтроля.Аналитика_7 КАК Аналитика_7,
	|	НастройкиКонтроля.Аналитика_8 КАК Аналитика_8,
	|	НастройкиКонтроля.Аналитика_9 КАК Аналитика_9,
	|	НастройкиКонтроля.Аналитика_10 КАК Аналитика_10,
	|	НастройкиКонтроля.Аналитика_11 КАК Аналитика_11,
	|	НастройкиКонтроля.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ СрезПоследних
	|ИЗ
	|	РегистрСведений.бит_СрокиКонтроляПоБюджету КАК НастройкиКонтроля
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеквизиты КАК ВременнаяТаблицаРеквизиты
	|			ПО (ИСТИНА)
	|		ПО (НастройкиКонтроля.СценарийКонтролируемый = &СценарийКонтролируемый)
	|			И (НастройкиКонтроля.Сценарий = &Сценарий)
	|			И (НастройкиКонтроля.РежимКонтроля = &РежимКонтроля)
	|			И НастройкиКонтроля.СтатьяОборотов = ВременнаяТаблица.СтатьяОборотов
	|			И (ВременнаяТаблица.Период МЕЖДУ НастройкиКонтроля.НачалоПериода И НастройкиКонтроля.КонецПериода
	|				ИЛИ НастройкиКонтроля.Период МЕЖДУ ВременнаяТаблица.НачалоПериода И ВременнаяТаблица.КонецПериода)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольЦФО
	|						И НастройкиКонтроля.КонтрольЦФО
	|					ТОГДА НастройкиКонтроля.ЦФО = ВременнаяТаблица.ЦФО
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_1
	|						И НастройкиКонтроля.КонтрольАналитика_1
	|					ТОГДА НастройкиКонтроля.Аналитика_1 = ВременнаяТаблица.Аналитика_1
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_2
	|						И НастройкиКонтроля.КонтрольАналитика_2
	|					ТОГДА НастройкиКонтроля.Аналитика_2 = ВременнаяТаблица.Аналитика_2
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_3
	|						И НастройкиКонтроля.КонтрольАналитика_3
	|					ТОГДА НастройкиКонтроля.Аналитика_3 = ВременнаяТаблица.Аналитика_3
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_4
	|						И НастройкиКонтроля.КонтрольАналитика_4
	|					ТОГДА НастройкиКонтроля.Аналитика_4 = ВременнаяТаблица.Аналитика_4
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_5
	|						И НастройкиКонтроля.КонтрольАналитика_5
	|					ТОГДА НастройкиКонтроля.Аналитика_5 = ВременнаяТаблица.Аналитика_5
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_6
	|						И НастройкиКонтроля.КонтрольАналитика_6
	|					ТОГДА НастройкиКонтроля.Аналитика_6 = ВременнаяТаблица.Аналитика_6
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_7
	|						И НастройкиКонтроля.КонтрольАналитика_7
	|					ТОГДА НастройкиКонтроля.Аналитика_7 = ВременнаяТаблица.Аналитика_7
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_8
	|						И НастройкиКонтроля.КонтрольАналитика_8
	|					ТОГДА НастройкиКонтроля.Аналитика_8 = ВременнаяТаблица.Аналитика_8
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_9
	|						И НастройкиКонтроля.КонтрольАналитика_9
	|					ТОГДА НастройкиКонтроля.Аналитика_9 = ВременнаяТаблица.Аналитика_9
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_10
	|						И НастройкиКонтроля.КонтрольАналитика_10
	|					ТОГДА НастройкиКонтроля.Аналитика_10 = ВременнаяТаблица.Аналитика_10
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_11
	|						И НастройкиКонтроля.КонтрольАналитика_11
	|					ТОГДА НастройкиКонтроля.Аналитика_11 = ВременнаяТаблица.Аналитика_11
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_12
	|						И НастройкиКонтроля.КонтрольАналитика_12
	|					ТОГДА НастройкиКонтроля.Аналитика_12 = ВременнаяТаблица.Аналитика_12
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиКонтроля.СценарийКонтролируемый,
	|	НастройкиКонтроля.СтатьяОборотов,
	|	НастройкиКонтроля.ЦФО,
	|	ВременнаяТаблица.НомерСтроки,
	|	ВременнаяТаблица.ИмяСписка,
	|	НастройкиКонтроля.РежимКонтроля,
	|	НастройкиКонтроля.Сценарий,
	|	НастройкиКонтроля.Аналитика_1,
	|	НастройкиКонтроля.Аналитика_2,
	|	НастройкиКонтроля.Аналитика_3,
	|	НастройкиКонтроля.Аналитика_4,
	|	НастройкиКонтроля.Аналитика_5,
	|	НастройкиКонтроля.Аналитика_6,
	|	НастройкиКонтроля.Аналитика_7,
	|	НастройкиКонтроля.Аналитика_8,
	|	НастройкиКонтроля.Аналитика_9,
	|	НастройкиКонтроля.Аналитика_10,
	|	НастройкиКонтроля.Аналитика_11,
	|	НастройкиКонтроля.Аналитика_12
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СрезПоследних.Период КАК Период,
	|	НастройкиКонтроля.СтатьяОборотов КАК СтатьяОборотов,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольЦФО
	|				И НастройкиКонтроля.КонтрольЦФО
	|			ТОГДА ВременнаяТаблица.ЦФО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЦФО,
	|	НастройкиКонтроля.НачалоПериода КАК НачалоПериода,
	|	НастройкиКонтроля.КонецПериода КАК КонецПериода,
	|	НастройкиКонтроля.Периодичность КАК Периодичность,
	|	НастройкиКонтроля.Сценарий КАК Сценарий,
	|	ВременнаяТаблица.ИмяСписка КАК ИмяСписка,
	|	ВременнаяТаблица.СинонимСписка КАК СинонимСписка,
	|	НастройкиКонтроля.РежимКонтроля КАК РежимКонтроля,
	|	НастройкиКонтроля.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_1
	|				И НастройкиКонтроля.КонтрольАналитика_1
	|			ТОГДА ВременнаяТаблица.Аналитика_1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_1,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_2
	|				И НастройкиКонтроля.КонтрольАналитика_2
	|			ТОГДА ВременнаяТаблица.Аналитика_2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_2,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_3
	|				И НастройкиКонтроля.КонтрольАналитика_3
	|			ТОГДА ВременнаяТаблица.Аналитика_3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_3,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_4
	|				И НастройкиКонтроля.КонтрольАналитика_4
	|			ТОГДА ВременнаяТаблица.Аналитика_4
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_4,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_5
	|				И НастройкиКонтроля.КонтрольАналитика_5
	|			ТОГДА ВременнаяТаблица.Аналитика_5
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_5,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_6
	|				И НастройкиКонтроля.КонтрольАналитика_6
	|			ТОГДА ВременнаяТаблица.Аналитика_6
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_6,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_7
	|				И НастройкиКонтроля.КонтрольАналитика_7
	|			ТОГДА ВременнаяТаблица.Аналитика_7
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_7,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_8
	|				И НастройкиКонтроля.КонтрольАналитика_8
	|			ТОГДА ВременнаяТаблица.Аналитика_8
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_8,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_9
	|				И НастройкиКонтроля.КонтрольАналитика_9
	|			ТОГДА ВременнаяТаблица.Аналитика_9
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_9,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_10
	|				И НастройкиКонтроля.КонтрольАналитика_10
	|			ТОГДА ВременнаяТаблица.Аналитика_10
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_10,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_11
	|				И НастройкиКонтроля.КонтрольАналитика_11
	|			ТОГДА ВременнаяТаблица.Аналитика_11
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_11,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРеквизиты.КонтрольАналитика_12
	|				И НастройкиКонтроля.КонтрольАналитика_12
	|			ТОГДА ВременнаяТаблица.Аналитика_12
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Аналитика_12
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрезПоследних КАК СрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СрокиКонтроляПоБюджету КАК НастройкиКонтроля
	|			ПО СрезПоследних.Период = НастройкиКонтроля.Период
	|				И СрезПоследних.СценарийКонтролируемый = НастройкиКонтроля.СценарийКонтролируемый
	|				И СрезПоследних.ЦФО = НастройкиКонтроля.ЦФО
	|				И СрезПоследних.СтатьяОборотов = НастройкиКонтроля.СтатьяОборотов
	|				И СрезПоследних.РежимКонтроля = НастройкиКонтроля.РежимКонтроля
	|				И СрезПоследних.Сценарий = НастройкиКонтроля.Сценарий
	|				И СрезПоследних.Аналитика_1 = НастройкиКонтроля.Аналитика_1
	|				И СрезПоследних.Аналитика_2 = НастройкиКонтроля.Аналитика_2
	|				И СрезПоследних.Аналитика_3 = НастройкиКонтроля.Аналитика_3
	|				И СрезПоследних.Аналитика_4 = НастройкиКонтроля.Аналитика_4
	|				И СрезПоследних.Аналитика_5 = НастройкиКонтроля.Аналитика_5
	|				И СрезПоследних.Аналитика_6 = НастройкиКонтроля.Аналитика_6
	|				И СрезПоследних.Аналитика_7 = НастройкиКонтроля.Аналитика_7
	|				И СрезПоследних.Аналитика_8 = НастройкиКонтроля.Аналитика_8
	|				И СрезПоследних.Аналитика_9 = НастройкиКонтроля.Аналитика_9
	|				И СрезПоследних.Аналитика_10 = НастройкиКонтроля.Аналитика_10
	|				И СрезПоследних.Аналитика_11 = НастройкиКонтроля.Аналитика_11
	|				И СрезПоследних.Аналитика_12 = НастройкиКонтроля.Аналитика_12
	|		ПО ВременнаяТаблица.НомерСтроки = СрезПоследних.НомерСтроки
	|			И ВременнаяТаблица.ИмяСписка = СрезПоследних.ИмяСписка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеквизиты КАК ВременнаяТаблицаРеквизиты
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИмяСписка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СрезПоследних";
	
	РезультатЗапроса  = Запрос.Выполнить();
	Выборка           = РезультатЗапроса.Выбрать();
	
	СообщитьОПересеченииНастроек(Выборка, ИзмеренияКонтроля, Отказ, Допроведение);

КонецПроцедуры 

Процедура СообщитьОПересеченииНастроек(Выборка, ИзмеренияКонтроля, Отказ, Допроведение)
	
	Перем КлючЗначение, Поля, Счетчик, ТекстСообщения;
	ТекстИсключения = Новый Массив;
	
	Счетчик = 1;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ИзмеренияКонтроля, Выборка);
		Поля = Новый Массив; 
		Поля.Добавить(ПредставлениеПериода(Выборка.НачалоПериода, Выборка.КонецПериода, "ФП = Истина"));
		Поля.Добавить(Выборка.СтатьяОборотов);
		Для каждого КлючЗначение Из ИзмеренияКонтроля Цикл
			Поля.Добавить(КлючЗначение.Значение);
		КонецЦикла; 
		
		ТекстСообщения = НСтр("ru = 'Для настроек контроля %1 уже установлены лимиты документом %2'; 
							|en = 'The %1 control settings already have limits set for % 2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтрСоединить(Поля, "/"), Выборка.Регистратор);
		Если Допроведение Тогда
			ТекстИсключения.Добавить(ТекстСообщения);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Регистратор, , ,Отказ);
		КонецЕсли;
		
		Если Счетчик = 25 Тогда
			ТекстСообщения = НСтр("ru = 'И еще %1 таких же ошибок.'; en = 'And another %1 of the same errors.'"); 	
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Количество() - Счетчик);
			Если Допроведение Тогда
				ТекстИсключения.Добавить(ТекстСообщения);
			Иначе	
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , ,Отказ);
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;

	Если Допроведение И ЗначениеЗаполнено(ТекстИсключения) Тогда
		ТекстСообщения = СтрСоединить(ТекстИсключения, Символы.ПС);
		ВызватьИсключение ТекстСообщения;	
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти 

#КонецЕсли
