
#Область ПрограммныйИнтерфейс

// Процедура проверяет использование аналитики в статье, устанавливает типы по-умолчанию.
//
// Параметры:
//  ТекущиеДанные		 - Произвольный - набор данных, позволяющий устанавливать значение свойств по имени.
//  НастройкиСтатьи		 - Структура - см. Справочники.бит_СтатьиОборотов.ПолучитьНастройки.
//  НастройкиИзмерений	 - Структура - см. бит_Бюджетирование.ПолучитьИзмеренияБюджетирования.
//
Процедура УстановитьИспользованиеАналитики(ТекущиеДанные, НастройкиСтатьи, НастройкиИзмерений)  Экспорт
	
	Для каждого КлючИЗначение Из НастройкиИзмерений Цикл
		ИмяИзмерения = КлючИЗначение.Ключ;
		Настройка    = Неопределено;
		
		НастройкиСтатьи.Измерения.Свойство(ИмяИзмерения, Настройка);
		Если ТипЗнч(Настройка) = Тип("Структура") Тогда
			Если ТипЗнч(Настройка.ТипПоУмолчанию) = Тип("ОписаниеТипов") Тогда
				ТекущиеДанные[ИмяИзмерения] = Настройка.ТипПоУмолчанию.ПривестиЗначение(ТекущиеДанные[ИмяИзмерения]);
			КонецЕсли; 
			
			Если НЕ Настройка.Учет Тогда
				ТекущиеДанные[ИмяИзмерения] = Неопределено;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

// Функция позволяет получить имена измерений используемых в бюджетировании.
// 
// Параметры:
//  Режим  - Строка - "все","обязательные","произвольные","дополнительные".
//  СпособЗаполнения - Строка - "тип","имя","синоним".
//  ТипРезультата    - Строка - "Структура","Массив","СписокЗначений".
//  МассивИсключений - Массив - элементы, имена измерений, которые не должны попасть в результат.
// 
// Возвращаемое значение:
//   Структура - Ключ: ИмяИзмерения; Значение: Тип измерения; Строка.
//
Функция ПолучитьИзмеренияБюджетирования(Режим, СпособЗаполнения, ТипРезультата = Неопределено, 
			МассивИсключений = Неопределено) Экспорт
	
	// Определим тип возвращаемого результата
	РезультатМассив    = ВРег(ТипРезультата) = "МАССИВ";
	РезультатСписок    = ВРег(ТипРезультата) = "СПИСОКЗНАЧЕНИЙ";
	РезультатСтруктура = НЕ РезультатМассив И НЕ РезультатСписок;
	
	Если РезультатСтруктура Тогда
		Измерения = Новый Структура;
	КонецЕсли; 
	Если РезультатМассив Тогда
		Измерения = Новый Массив;
	КонецЕсли; 
	Если РезультатСписок Тогда
		Измерения = Новый СписокЗначений;
	КонецЕсли;  
	
	Если МассивИсключений = Неопределено Тогда	
		МассивИсключений = Новый Массив;	
	КонецЕсли; 
	
	МассивИсключений.Добавить("Валюта");
	
	// Обязательные измерения
	ОбязательныеИзмерения = Новый Массив;
	ОбязательныеИзмерения.Добавить("Сценарий");
	ОбязательныеИзмерения.Добавить("ЦФО");
	ОбязательныеИзмерения.Добавить("СтатьяОборотов");
	
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	Для каждого Измерение Из Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения Цикл
		
		// Проверим наличие исключений
		Если МассивИсключений.Найти(Измерение.Имя) <> Неопределено Тогда		
			Продолжить; 		
		КонецЕсли; 
		
		ТекущаяНастройка = НастройкиИзмерений[Измерение.Имя];
		
		Заполнять = Ложь;
		
		// Обязательные ОБЯЗАТЕЛЬНЫЕ
		Если СтрСравнить(Режим, "обязательные") = 0 И ОбязательныеИзмерения.Найти(Измерение.Имя) <> Неопределено Тогда			
			Заполнять = Истина;   			
		КонецЕсли; 
		// Не обязательные 
		Если СтрСравнить(Режим, "произвольные") = 0 И ОбязательныеИзмерения.Найти(Измерение.Имя) = Неопределено  Тогда			
			Заполнять = Истина;  			
		КонецЕсли;   		
		// Произвольно назначаемые аналитики
		Если СтрСравнить(Режим, "дополнительные") = 0 И Найти(Измерение.Имя, "Аналитика") > 0 Тогда 			
			Заполнять = Истина;			
		КонецЕсли; 
		// Все
		Если СтрСравнить(Режим, "все") = 0 Тогда			
			Заполнять = Истина;			
		КонецЕсли; 
		
		Если Заполнять Тогда
			Если СтрСравнить(СпособЗаполнения, "тип") = 0 Тогда
			  	Значение = Измерение.Тип;
			ИначеЕсли СтрСравнить(СпособЗаполнения, "синоним") = 0 Тогда	
			  	Значение = Измерение.Синоним;
		    ИначеЕсли СтрСравнить(СпособЗаполнения, "имя") = 0 Тогда
				Если ТекущаяНастройка = Неопределено Тогда
					Значение = бит_РаботаСМетаданными.ПолучитьИмяОбъектаПоОписаниюТипов(Измерение.Тип);
				Иначе	
					Значение = бит_РаботаСМетаданными.ПолучитьИмяОбъектаПоОписаниюТипов(ТекущаяНастройка.Аналитика.ТипЗначения);
				КонецЕсли; 
		    КонецЕсли;
			
			Если РезультатСтруктура Тогда
				Измерения.Вставить(Измерение.Имя, Значение);
			КонецЕсли; 
			Если РезультатМассив Тогда
				Измерения.Добавить(Измерение.Имя);
			КонецЕсли; 
			Если РезультатСписок Тогда
				Измерения.Добавить(Значение, Измерение.Имя);
			КонецЕсли;  
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Измерения;
	
КонецФункции
 
// Функция получает настройку видимости колонок по массиву статей оборотов. 
// Если аналитика, соответствующая колонке, используется хотя бы в одной статье колонка должна быть видима.
// Также анализируются назначенные доп. измерения - если измерение не назначено колонка не выводится.
// 
// Параметры:
//  МассивСтатей  		  - Массив.
//  НастройкиИзмерений 	  - Соответствие (По умолчанию = Неопределено).
// 
// Возвращаемое значение:
//   НастройкаВидимости   - Структура - Ключ:ИмяКолонки; Значение:Видимость.
// 
Функция ПолучитьНастройкуВидимостиКолонок(МассивСтатей, НастройкиИзмерений = Неопределено)  Экспорт
    	
	Если НастройкиИзмерений = Неопределено Тогда 		
		НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");		
	КонецЕсли;

	ПустаяСтатьяОборотов = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
	Если МассивСтатей.Найти(ПустаяСтатьяОборотов) <> Неопределено Тогда
		МассивСтатей = Новый Массив;
		МассивСтатей.Добавить(ПустаяСтатьяОборотов);	
	КонецЕсли;
	
   	НастройкаВидимости = Новый Структура;

	ТекстПолей_1 = Новый Массив; 
	ТекстПолей_2 = Новый Массив; 
	
	Для каждого РеквизитУчет Из бит_РаботаСДиалогамиСервер.СформироватьМассивРеквизитовСтатей() Цикл
		ТекстПолей_1.Добавить(СтрШаблон("ЕСТЬNULL(ВидимостьКолонок.Учет_%1, ИСТИНА) КАК %1", РеквизитУчет));
		ТекстПолей_2.Добавить(СтрШаблон("МАКСИМУМ(бит_СтатьиОборотов.Учет_%1) КАК Учет_%1", РеквизитУчет));
	КонецЦикла;
	
	ТекстЗамены1 = СтрСоединить(ТекстПолей_1, "," + Символы.ПС);
	ТекстЗамены2 = СтрСоединить(ТекстПолей_2, "," + Символы.ПС);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ТекстПолей_1,
	|	ЕСТЬNULL(ВидимостьКолонок.Учет_Сумма, ИСТИНА) КАК НДС,
	|	ЕСТЬNULL(ВидимостьКолонок.Учет_Сумма, ИСТИНА) КАК СуммаНДС,
	|	ЕСТЬNULL(ВидимостьКолонок.Учет_Количество, ИСТИНА)
	|		ИЛИ ЕСТЬNULL(ВидимостьКолонок.Учет_Сумма, ИСТИНА) КАК Норма
	|ИЗ
	|	(ВЫБРАТЬ
	|		&ТекстПолей_2
	|	ИЗ
	|		Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
	|	ГДЕ
	|		бит_СтатьиОборотов.Ссылка В(&МассивСтатей)) КАК ВидимостьКолонок
	|";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстПолей_1", ТекстЗамены1);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстПолей_2", ТекстЗамены2);
	
	Запрос = Новый Запрос;
  	Запрос.УстановитьПараметр("МассивСтатей", МассивСтатей);				     
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
   	Выборка	  = Результат.Выбрать();   
   	Если Выборка.Следующий() Тогда
	   	Для каждого КолонкаРезультат Из Результат.Колонки Цикл
		   	ИмяКолонки = КолонкаРезультат.Имя;
		   	Видимость  = Выборка[ИмяКолонки];
			// Для дополнительных измерений анализируем используется измерение или нет.
			Если Найти(ИмяКолонки, "Аналитика_") > 0 И НастройкиИзмерений[ИмяКолонки] = Неопределено Тогда
				Видимость = Ложь; 
			КонецЕсли; 
		   НастройкаВидимости.Вставить(ИмяКолонки,Видимость);
	   	КонецЦикла;
   	КонецЕсли; 

   	Возврат НастройкаВидимости;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПодпискиНаСобытия

// Процедура обработчик подписки "бит_ПриЗаписиСтруктурнойЕдиницы" на событие  "ПриЗаписи".
// Выполняет синхронизацию структуры предприятия (Организациии, ПодразделенияОрганизаций) и ЦФО.
// 
// Параметры:
// 	Источник - СправочникОбъект.
// 	Отказ - Булево.
// 
Процедура бит_ПриЗаписиСтруктурнойЕдиницыПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Отказ Тогда	
		Возврат;	
	КонецЕсли; 
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда		
	    // Функционал БФ может работать только в узлах, созданных с помощью ПО бит_Полный.
		Возврат;	
	КонецЕсли; 				
	
	Если ПолучитьФункциональнуюОпцию("бит_СинхронизироватьПодразделенияРеглЦФО") Тогда	
		СинхронизироватьСтруктурнуюЕдиницуРеглЦФО(Источник);	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СинхронизацияСтруктурыПредприятияРеглИЦФО

Процедура СинхронизацияПодразделенийЦФОВфоне(ПараметрыВыполнения, АдресВоВременномХранилище) Экспорт

	ПервоначальнаяСинхронизацияПодразделенийРеглЦФО();

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСВалютамиСценария

// Возвращает курс валюты сценария на дату.
// 
// Параметры:
// 	Сценарий   - Сценарий - элемент справочника "СценарииПланирования".	
//  Валюта     - Валюта - элемент справочника "Валюты".
//  Дата       - Дата - на которую следует получить курс.
// 
// Возвращаемое значение: 
//  Структура, содержащая:
//   Курс      - курс валюты.
//   Кратность - кратность валюты.
// 
Функция ПолучитьКурсПоСценарию(Сценарий, Валюта, Дата) Экспорт
	
	СтруктураКурса = Новый Структура("Курс,Кратность",0,0);
	
	Если ЗначениеЗаполнено(Сценарий)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "ИспользоватьКурсыСценария") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период",		Дата);
		Запрос.УстановитьПараметр("Сценарий",	Сценарий);
		Запрос.УстановитьПараметр("Валюта",		Валюта);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(КурсыСценариев.Курс, 0) КАК Курс,
		|	ЕСТЬNULL(КурсыСценариев.Кратность, 0) КАК Кратность
		|ИЗ
		|	РегистрСведений.бит_КурсыСценариевПланирования.СрезПоследних(
		|			&Период,
		|			Сценарий = &Сценарий
		|				И Валюта = &Валюта) КАК КурсыСценариев";
		Результат = Запрос.Выполнить();
		Выборка	  = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураКурса, Выборка);
		КонецЕсли;
	Иначе
		СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(Валюта, Дата);
	КонецЕсли;
	
	Возврат СтруктураКурса;
	
КонецФункции

// Проверяет наличие установленного курса и кратности сценария на 1 января 1980 года.
// В случае отсутствия устанавливает курс и кратность равными единице.
// 
// Параметры:
//  Сценарий - ссылка на элемент справочника СценарииПланирования.
// 	Валюта - СправочникСсылка.Валюты.
// 
Процедура ПроверитьКорректностьКурсаНа01_01_1980(Сценарий, Валюта) Экспорт

	ДатаКурса = '1980-01-01';
	СтруктураКурса = ПолучитьКурсПоСценарию(Сценарий, Валюта, ДатаКурса);

	Если (СтруктураКурса.Курс = 0) 
		Или (СтруктураКурса.Кратность = 0) Тогда

		// Установим курс и кратность = 1 на 01.01.1980, чтобы не было ошибок при создании документов.

		РегистрКурсыСценария = РегистрыСведений.бит_КурсыСценариевПланирования.СоздатьМенеджерЗаписи();

		РегистрКурсыСценария.Период    = ДатаКурса;
		РегистрКурсыСценария.Сценарий  = Сценарий;
		РегистрКурсыСценария.Валюта	   = Валюта;
		РегистрКурсыСценария.Курс      = 1;
		РегистрКурсыСценария.Кратность = 1;
		
		РегистрКурсыСценария.Записать();

	КонецЕсли;

КонецПроцедуры

// Функция получает курсы валют сценария необходимые при пересчетах 
// для формирования движений по регистру бит_ОборотыПоБюджетам.
// 
// Параметры:
//   ТекущийДокумент - ДокументОбъект - текущий документ.
//   ДатаКурсов 	- Дата - дата.
//   ВидыКурсов 	- Структура - виды курсов.
// 
// Возвращаемое значение:
//   СтруктураКурсыВалют - Структура.
// 
Функция КурсыВалютСценария(ТекущийДокумент, ДатаКурсов, ВидыКурсов = Неопределено) Экспорт

	ТипДокумента    = ТипЗнч(ТекущийДокумент);
	ЭтоСсылка       =  ОбщегоНазначения.ЭтоСсылка(ТипДокумента);
	
	СтруктураКурсыВалют = Новый Структура;
	
	МетаданныеДокумента = ТекущийДокумент.Метаданные();
	
	Если бит_РаботаСМетаданными.ЕстьРеквизит("Сценарий", МетаданныеДокумента) Тогда
		Если ЭтоСсылка Тогда
			Сценарий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийДокумент, "Сценарий");
		Иначе
			Сценарий = ТекущийДокумент.Сценарий;
		КонецЕсли;
	Иначе
		Сценарий = Справочники[бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования()].ПустаяСсылка();
	КонецЕсли;
	
	// Курс документа
	Если ВидыКурсов = Неопределено ИЛИ ВидыКурсов.Свойство("Документ") Тогда
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит("ВалютаДокумента", МетаданныеДокумента) 
			И бит_РаботаСМетаданными.ЕстьРеквизит("КурсДокумента", МетаданныеДокумента)
			И бит_РаботаСМетаданными.ЕстьРеквизит("КратностьДокумента", МетаданныеДокумента) Тогда
			
			Если ЭтоСсылка Тогда
				ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийДокумент,
							"КурсДокумента, КратностьДокумента, ВалютаДокумента");
			Иначе
				ДанныеДокумента = ТекущийДокумент;
			КонецЕсли;
			
			СтрКурса = Новый Структура;
			СтрКурса.Вставить("Курс"     , ДанныеДокумента.КурсДокумента);
			СтрКурса.Вставить("Кратность", ДанныеДокумента.КратностьДокумента);
			СтрКурса.Вставить("Валюта"   , ДанныеДокумента.ВалютаДокумента);
			СтруктураКурсыВалют.Вставить("Документ", СтрКурса);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// Курс упр. учета
	Если ВидыКурсов = Неопределено ИЛИ ВидыКурсов.Свойство("Упр") Тогда	
		
		Валюта = Константы.бит_ВалютаУправленческогоУчета.Получить();
		
		СтрКурса = ПолучитьКурсПоСценарию(Сценарий, Валюта, ДатаКурсов);
		СтрКурса.Вставить("Валюта", Валюта);
		СтруктураКурсыВалют.Вставить("Упр", СтрКурса);
		
	КонецЕсли;
	
	// Курс сценария
	Если ВидыКурсов = Неопределено ИЛИ ВидыКурсов.Свойство("Сценарий") И Сценарий <> Неопределено Тогда
		
		Если бит_РаботаСМетаданными.ЕстьРеквизит("Сценарий", МетаданныеДокумента) Тогда 
			
			Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "Валюта");
			
			СтрКурса = ПолучитьКурсПоСценарию(Сценарий, Валюта, ДатаКурсов);
			СтрКурса.Вставить("Валюта", Валюта);
			СтруктураКурсыВалют.Вставить("Сценарий", СтрКурса);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Валюта регламентированного учета
	Если ВидыКурсов = Неопределено ИЛИ ВидыКурсов.Свойство("Регл") Тогда
		
		СтрКурса = Новый Структура;
		СтрКурса.Вставить("Курс"	 , 1);
		СтрКурса.Вставить("Кратность", 1);
		СтрКурса.Вставить("Валюта"	 , Константы.ВалютаРегламентированногоУчета.Получить());
		СтруктураКурсыВалют.Вставить("Регл", СтрКурса);
	
	КонецЕсли;
	
    Возврат СтруктураКурсыВалют;
	
КонецФункции

#КонецОбласти

#Область РаботаСТабличнымиЧастямиДокументовБюджетирования

// Процедура заполняет норму в строке документов бюджетирования.
// 
// Параметры:
//  ТекущиеДанные - СтрокаТабличнойЧасти.
//  ВидПараметра - ПланВидовХарактеристик.бит_ВидыПроизвольныхПараметров.
//  Сценарий     - СправочникСсылка.СценарииПланирования.
//  СтрКурсаДок  - Структура.
//  ИменаПараметраНорм - Структура.
//  ЕдиницыИзмеренияСумм - ПеречислениеСсылка.бит_ЕдиницыИзмеренияСумм.
// 
Процедура ЗаполнитьНормуВСтроке(ТекущиеДанные, ВидПараметра, Сценарий, СтрКурсаДок, ИменаПараметраНорм, ЕдиницыИзмеренияСумм) Экспорт

	СвойстваСтатьи = бит_БюджетированиеПовтИспСервер.ПолучитьСвойстваСтатьи(ТекущиеДанные.СтатьяОборотов);
	
	Если СвойстваСтатьи.Количественный И СвойстваСтатьи.Суммовой Тогда
		
	   МассивОтбор = Новый Массив;
	   Для каждого КиЗ Из ИменаПараметраНорм.БП Цикл
	   
	   	   Отбор = Новый Структура;
		   Отбор.Вставить("Имя"     ,КиЗ.Значение);
		   Отбор.Вставить("Значение", ТекущиеДанные[КиЗ.Ключ]);
		   
		   МассивОтбор.Добавить(Отбор);
	   
	   КонецЦикла; 
	   
	   Если НЕ ЗначениеЗаполнено(МассивОтбор) Тогда
		 // Если нет отбора, нет смысла получать норму.
	   	 Возврат;
	   КонецЕсли; 	   
	   
	   ТекущиеДанные.Норма = РегистрыСведений.бит_ЗначенияПроизвольныхПараметров.ПолучитьЗначениеНормы(
	   							ВидПараметра, ТекущиеДанные.Период, Сценарий, МассивОтбор, СтрКурсаДок);	
																												   
	   РазмерностьНач      = 1;
	   РазмерностьКон      = бит_ОбщегоНазначения.ПолучитьРазмерностьЕдиницыИзмеренияСумм(ЕдиницыИзмеренияСумм);
	   ТекущиеДанные.Норма = бит_ОбщегоНазначенияКлиентСервер.ПересчитатьИзРазмерностиВРазмерность(
	   							ТекущиеДанные.Норма, РазмерностьНач, РазмерностьКон);																				   
																												   
	   бит_БюджетированиеКлиентСервер.РассчитатьПоНорме(ТекущиеДанные, Истина);
	
	КонецЕсли; 

КонецПроцедуры

// Процедура перезаполняет нормы в табличной части.
// 
// Параметры:
//  ВидПараметра - ПланВидовХарактеристикСсылка.бит_ВидыПроизвольныхПараметров.
//  Сценарий - СправочникСсылка.СценарииПланирования.
//  ТабЧасть - ТабличнаяЧасть.
//  СтрКурсаДок - Структура.
//  ИменаПараметровНорм - Структура.
//  ЕдИзмСумм - ПеречислениеСсылка.бит_ЕдиницыИзмеренияСумм.
// 
Процедура ПерезаполнитьНормыТабЧасти(ВидПараметра, Сценарий, ТабЧасть, СтрКурсаДок, ИменаПараметраНорм, ЕдиницыИзмеренияСумм) Экспорт
	
	Для каждого СтрокаТаблицы Из ТабЧасть Цикл
		
		СвойстваСтатьи = бит_БюджетированиеПовтИспСервер.ПолучитьСвойстваСтатьи(СтрокаТаблицы.СтатьяОборотов);
	
		Если СвойстваСтатьи.Количественный И СвойстваСтатьи.Суммовой Тогда	
			  ЗаполнитьНормуВСтроке(СтрокаТаблицы, ВидПараметра, Сценарий, СтрКурсаДок, ИменаПараметраНорм, ЕдиницыИзмеренияСумм);
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

// Процедура обнуляет ресурсы бюджетирования в строке табличной части, 
// если по статье не ведется учет по ним. 
//
// Параметры:
//  ТекущиеДанные - СтрокаТабличнойЧасти.
//  НастройкиСтатьи - Структура.
//
Процедура УстановитьИспользованиеРесурсов(ТекущиеДанные, НастройкиСтатьи) Экспорт
	
	Если Не НастройкиСтатьи.Учет_Количество Тогда
		ТекущиеДанные.Количество = 0;
	КонецЕсли;
	
	Если Не НастройкиСтатьи.Учет_Сумма Тогда
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
	
КонецПроцедуры

// Процедура очищает аналитики бюджетирования, не используемые по статье оборотов,
// соответствующей строки переданной таблицы. 
//
// Параметры:
//  ТаблицаДанных - табличная часть / таблица значений с данными по аналитикам статьям оборотов.
//
Процедура ОчиститьНеИспользуемыеАналитикиСтатейОборотов(ТаблицаДанных) Экспорт
	
	ПараметрыУчета = ПараметрыУчета();
	ПоляУчета	   = ПараметрыУчета.ПоляУчета;
	ТекстЗапроса   = ПараметрыУчета.ТекстЗапроса;
	
	Запрос = Новый Запрос();
	СтатьиОборотов = ТаблицаДанных.ВыгрузитьКолонку("СтатьяОборотов");
	Запрос.УстановитьПараметр("СтатьиОборотов",	СтатьиОборотов);
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	
	ТаблицаУчетаАналитик = Результат.Выгрузить();
	ТаблицаУчетаАналитик.Индексы.Добавить("СтатьяОборотов");
	
	Для каждого СтрТД Из ТаблицаДанных Цикл
		Если ЗначениеЗаполнено(СтрТД.СтатьяОборотов) Тогда
			ПравилаУчета = ТаблицаУчетаАналитик.Найти(СтрТД.СтатьяОборотов, "СтатьяОборотов");
		Иначе	
			ПравилаУчета = Неопределено;
		КонецЕсли; 

		Для Инд = 1 По ПоляУчета.Количество() Цикл
			ИмяПоля = ПоляУчета["Аналитика_" + Строка(Инд)];
			Если ПравилаУчета = Неопределено Тогда
				СтрТД[ИмяПоля] = Неопределено;
			ИначеЕсли ПравилаУчета[ИмяПоля] = Ложь Тогда
				СтрТД[ИмяПоля] = Неопределено;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Процедура перезаполняет цены в табличной части.
// 
// Параметры:
//  ТабЧасть - ТабличнаяЧасть.
//  ПараметрыРасчетаЦен - Структура.
//
Процедура ПерезаполнитьЦеныТабличнойЧасти(ТабЧасть, ПараметрыРасчетаЦен) Экспорт
	
	ТаблицаДанных = ТабЧасть.Выгрузить();
	Если НЕ ЗначениеЗаполнено(ТаблицаДанных)
		ИЛИ ПараметрыРасчетаЦен = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьЦеныНоменклатурыТЧ(ТаблицаДанных, ПараметрыРасчетаЦен);
	ТабЧасть.Загрузить(ТаблицаДанных);
	
КонецПроцедуры

// Процедура перезаполняет цены в строке табличной части.
// 
// Параметры:
//  СтрокаТабЧасти - СтрокаТабличнойЧасти, Структура.
//  ПараметрыРасчетаЦен - Структура.
//  СтатьяОборотов - СправочникСсылка.бит_СтатьиОборотов (необязательный). 
//					 Если указана, то пересчет будет производиться только для статей с количественным и суммовым учетом.
//
Процедура ПерезаполнитьЦеныСтрокиТабличнойЧасти(СтрокаТабЧасти, ПараметрыРасчетаЦен, СтатьяОборотов = Неопределено) Экспорт
	
	Если СтатьяОборотов <> Неопределено Тогда
		РеквизитыСтатьи = бит_БюджетированиеПовтИспСервер.ПолучитьСвойстваСтатьи(СтатьяОборотов);
		Если НЕ РеквизитыСтатьи.Количественный ИЛИ НЕ РеквизитыСтатьи.Суммовой Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", СтрокаТабЧасти.Номенклатура);
	Если бит_ОбщегоНазначенияПовтИсп.ЭтоСемействоБП() Тогда
		Отбор.Вставить("ТипЦен", ПараметрыРасчетаЦен.ТипЦен);
	ИначеЕсли бит_ОбщегоНазначенияПовтИсп.ЭтоСемействоERP() Тогда
		Отбор.Вставить("ВидЦены", ПараметрыРасчетаЦен.ТипЦен);
	КонецЕсли;
	
	СтруктураЦены           = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(СтрокаТабЧасти.Период, Отбор);
	СтруктураКурсаДокумента = ПараметрыРасчетаЦен.СтруктураКурсаДокумента;
	ЦенаНоменклатуры        = СтруктураЦены.Цена;
	Если ЦенаНоменклатуры <> 0 И СтруктураЦены.Валюта <> СтруктураКурсаДокумента.Валюта Тогда
		ПараметрыКурсаЦены = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ПараметрыРасчетаЦен.ДатаДокумента,
								Новый Структура("Валюта", СтруктураЦены.Валюта));
		ЦенаНоменклатуры = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(ЦенаНоменклатуры, 
						СтруктураЦены.Валюта, СтруктураКурсаДокумента.Валюта, ПараметрыКурсаЦены.Курс, СтруктураКурсаДокумента.Курс,
						ПараметрыКурсаЦены.Кратность, СтруктураКурсаДокумента.Кратность);
	КонецЕсли;
		
	СтрокаТабЧасти.Цена = ЦенаНоменклатуры;
	Если СтрокаТабЧасти.Цена <> 0 Тогда
		СтрокаТабЧасти.Сумма = СтрокаТабЧасти.Цена * СтрокаТабЧасти.Количество;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РасчетыВДеревеФормыВвода

// Функция получает зависимости ячеек табличного документа, 
// т.е какие ячейки следует пересчитать при изменении данной ячейки.
// 
// Параметры:
//  ТабДокДанные - ТабличныйДокумент - таблица.
// 
// Возвращаемое значение:
//  ЗависимостиЯчеек - Структура.
// 
Функция ПолучитьЗависимостиЯчеек(ТабДокДанные) Экспорт
	
	ЗависимостиЯчеек = Новый Структура;
	Для каждого Обл Из ТабДокДанные.Области Цикл
		
		Если Обл.Расшифровка <> Неопределено Тогда
			
			Если Обл.Расшифровка.Вид = "Формула" ИЛИ Обл.Расшифровка.Вид = "Значение" Тогда
				
				Для каждого ИмяАргумента Из Обл.Расшифровка.Аргументы Цикл
					
					Если НЕ ЗависимостиЯчеек.Свойство(ИмяАргумента) Тогда
						
						МассивИмен = Новый Массив;
						МассивИмен.Добавить(Обл.Имя);
						ЗависимостиЯчеек.Вставить(ИмяАргумента, МассивИмен); 
						
					Иначе	
						
						ЗависимостиЯчеек[ИмяАргумента].Добавить(Обл.Имя);
						
					КонецЕсли; 
					
				КонецЦикла; // Обл.Расшифровка.Аргументы
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; // ТабДокДанные.Области
	
	Возврат ЗависимостиЯчеек;
	
КонецФункции // ПолучитьЗависимостиЯчеек()
 
#КонецОбласти

#Область ФормированиеДереваВАктуализацииИФормыВвода

// Процедура выполняет расчеты в дереве данных в форме ввода бюджета.
// 
// Параметры:
//  ТабДокДанные - ТабличныйДокумент.
// 
Процедура ВыполнитьРасчеты(ТабДокДанные) Экспорт

	Для каждого Обл Из ТабДокДанные.Области Цикл
		Если Обл.Расшифровка.Вид = "Формула" 
			 ИЛИ Обл.Расшифровка.Вид = "Значение" Тогда
		
			бит_БюджетированиеКлиентСервер.ВычислитьФормулу(ТабДокДанные, Обл);
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

// Процедура устанавливает формат отрицательных чисел в скобках. 
// Используется при построении дерева с учетом коэффициентов.
// 
// Параметры:
//  Сч - ОбластьЯчеекТабличногоДокумента.
// 
Процедура УстановитьФорматОтрицательныхЧисел(Сч) Экспорт

	 СтрФормат = "ЧЦ=%1; ЧДЦ=%2; ЧО=0";
	 СтрФормат = СтрШаблон(СтрФормат, 
	 					   Сч.ТипЗначения.КвалификаторыЧисла.Разрядность, 
						   Сч.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти);
																			 
	 Сч.Формат = СтрФормат;																		 

КонецПроцедуры

// Функция формирует имя колонки по периоду. 
// 
// Параметры:
//  Префикс  - Строка.
//  ТекущийПериод  - Дата.
// 
// Возвращаемое значение:
//   Строка.   
// 
Функция СформироватьИмяКолонкиПериод(Префикс,ТекущийПериод) Экспорт
	
	ИмяКолонкиПериод = СтрШаблон("%1_%2", Префикс, Формат(ТекущийПериод,"ДФ=yyyyMMdd"));
	Возврат ИмяКолонкиПериод;

КонецФункции

// Возвращает шаблон параметров функции "бит_Бюджетирование.ОписаниеПериода".
// 
// Возвращаемое значение:
//  Параметры - структура с ключами:
//		* Период 			 - дата - начало периода
//		* Синоним 			 - строка - представление периода
//		* Имя	  			 - строка 
//		* ЭтоИтог 			 - булево
//		* ЭтоНарастающийИтог - булево
//		* КонецПериода 		 - дата
//		* Периодичность		 - ПеречислениСсылка.бит_ПериодичностьПланирования.	
//
Функция НовыеПараметрыОписаниеПериода() Экспорт

	Параметры = Новый Структура; 
	Параметры.Вставить("Период",			'0001-01-01');
	Параметры.Вставить("Синоним",			"");
	Параметры.Вставить("Имя",				"");
	Параметры.Вставить("ЭтоИтог",			Ложь);
	Параметры.Вставить("ЭтоНарастающийИтог",Ложь);
	Параметры.Вставить("КонецПериода",		Неопределено);
	Параметры.Вставить("Периодичность",		Неопределено);
			
	Возврат Параметры;
	
КонецФункции
 
// Конструктор структуры, описывающей колонку дерева.
// 
// Параметры:
//  Параметры - См. бит_Бюджетирование.НовыеПараметрыОписаниеПериода(). 
// 
// Возвращаемое значение:
//  РезСтр - Структура.ОписаниеКолонкиПериод.
// 
Функция ОписаниеПериода(Параметры) Экспорт
						 
	Период 			   = Параметры.Период;
	Синоним 		   = Параметры.Синоним;
	Имя 			   = Параметры.Имя;
	ЭтоИтог 		   = Параметры.ЭтоИтог;
	ЭтоНарастающийИтог = Параметры.ЭтоНарастающийИтог;
	КонецПериода 	   = Параметры.КонецПериода;
	Периодичность 	   = Параметры.Периодичность;					 
	
	ОписаниеПериода = Новый Структура; 
	ОписаниеПериода.Вставить("ИмяКласса", 		   "ОписаниеКолонкиПериод");
	ОписаниеПериода.Вставить("Период", 			   Период);
	ОписаниеПериода.Вставить("Синоним", 		   Синоним);
	ОписаниеПериода.Вставить("ЭтоИтог",			   ЭтоИтог);
	ОписаниеПериода.Вставить("ЭтоНарастающийИтог", ЭтоНарастающийИтог);
	ОписаниеПериода.Вставить("КонецПериода", 	   КонецПериода);
	ОписаниеПериода.Вставить("Периодичность", 	   Периодичность);
	ОписаниеПериода.Вставить("ЭтоВыходной", 	   Ложь);
	
	Префиксы = Новый Структура;					 
	Префиксы.Вставить("ИмяСумма",		  "СП");
	Префиксы.Вставить("ИмяСуммаФакт",	  "СФ");
	Префиксы.Вставить("ИмяКоличество",	  "КП");
	Префиксы.Вставить("ИмяКоличествоФакт","КФ");
	
	Для каждого КиЗ Из Префиксы Цикл
		Префикс		 = КиЗ.Значение;
		ПрефиксИмени = Префикс;
		Если ЭтоИтог Тогда
			ПрефиксИмени = ПрефиксИмени + "_Ит";
		КонецЕсли;
		Если ПустаяСтрока(Имя) Тогда
			ТекИмя = СформироватьИмяКолонкиПериод(ПрефиксИмени, Период); 
		Иначе	
			ТекИмя = Префикс + "_" + Имя;
		КонецЕсли;		
		ОписаниеПериода.Вставить(КиЗ.Ключ, ТекИмя);
	КонецЦикла; 
	
    Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		ОписаниеПериода.КонецПериода = КонецПериода;
	Иначе	
		ОписаниеПериода.КонецПериода = КонецДня(Период);
	КонецЕсли; 							  

	Возврат ОписаниеПериода;
	
КонецФункции

// Конструктор структуры, описывающей параметры ячейки дерева.
// 
// Параметры:
//  Имя - Строка
//  Измерения - Структура
//	Период - Дата
//  Вид - Строка
//  Формула - Строка
//  Значение - Произвольный
// 
// Возвращаемое значение:
//  РезСтр - Структура.РасшифровкаЯчейкиФормыВвода.
// 
Функция РасшифровкаЯчейки(Имя,Измерения,Период,Вид,Формула="",Значение=Неопределено) Экспорт
	
	РезСтр = Новый Структура;
	РезСтр.Вставить("ИмяКласса", 	 "РасшифровкаЯчейкиФормыВвода");
	РезСтр.Вставить("Имя"      , 	 Имя);
	РезСтр.Вставить("Измерения", 	 Измерения);
	РезСтр.Вставить("Период"       , Период);
	РезСтр.Вставить("Периодичность", Неопределено);
	РезСтр.Вставить("Значение" , 	 Значение);
	РезСтр.Вставить("Вид"      , 	 Вид);
	РезСтр.Вставить("ПланФакт",	     "П");
	РезСтр.Вставить("ИмяРесурса", 	 "");
	
	ИмяРесурса  = "";
	НачалоИмени = ВРег(Лев(Имя,1));
	Если НачалоИмени = "С" Тогда
		ИмяРесурса = "Сумма";
	ИначеЕсли НачалоИмени = "К" Тогда
		ИмяРесурса = "Количество";
	КонецЕсли; 
	РезСтр.ИмяРесурса = ИмяРесурса;
	
	КонецИмени = ВРег(Сред(Имя,2,1));
	Если КонецИмени = "Ф" Тогда
		РезСтр.ПланФакт = "Ф";
	КонецЕсли; 
	
	РезСтр.Вставить("Формула"  , Формула);
	РезСтр.Вставить("Аргументы", Новый Массив);
	
	Возврат РезСтр;
	
КонецФункции

// Определяет есть ли подчиненные строки с группами для данной строки дерева.
// 
Процедура ПроверитьНаличиеПодчиненныхЭлементов(СтрокаВерх, ИзмеренияРазворачивать, ЭтоНовыйЗапрос, ТолькоГруппы ) Экспорт
	
	Для каждого Имя Из ИзмеренияРазворачивать Цикл
		
		Если ЭтоНовыйЗапрос Тогда
			// Новый формат запроса может содержать несколько измерений.
			ТекЗначение = СтрокаВерх[Имя];
		Иначе	
			// Формат запроса редакции 2.8 содержал, только одно измерение с именем Ссылка.
			ТекЗначение = СтрокаВерх.Ссылка; 
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ТекЗначение) И НЕ ТекЗначение.ЭтоГруппа Тогда
			
			ТолькоГруппы = Ложь;
			Возврат;
			
		КонецЕсли; 
		
	КонецЦикла;  // По именам измерений
	
	Для каждого СтрокаДерева Из СтрокаВерх.Строки Цикл
		
		ПроверитьНаличиеПодчиненныхЭлементов(СтрокаДерева, ИзмеренияРазворачивать, ЭтоНовыйЗапрос, ТолькоГруппы);
		
	КонецЦикла; 
	
КонецПроцедуры

// Формирует и устанавливает формулу, для вычисления итогов по группировке. 
// 
// Параметры:
//  ТабДок - ТабличныйДокумент.
//  ИменаЯчеекПодч - Соответствие
//  ИмяКолонки - Строка
//  НомСтроки - Число.
// 
Процедура УстановитьФормулуИтоговПоГруппе(ТабДок, ИменаПодчиненныхЯчеек, ИмяКолонки, ИдСтроки) Экспорт
	
	МассивИмен = ИменаПодчиненныхЯчеек[ИмяКолонки];
	Аргументы  = Новый Массив;
	
	СтрФормула = "";
	СтрокиФормулы = Новый Массив(); 
	Если ТипЗнч(МассивИмен) = Тип("Массив") Тогда
		
		Для каждого ТекОписаниеЯчейки Из МассивИмен Цикл
			
			СтрЗнак = "+";			
			Если ТекОписаниеЯчейки.Коэф < 0  Тогда
				СтрЗнак = "-";			
			КонецЕсли; 
		
			Если ЗначениеЗаполнено(СтрокиФормулы) ИЛИ СтрЗнак = "-" Тогда
				ЧастьФормулы = СтрШаблон(" %1 ", СтрЗнак);
				СтрокиФормулы.Добавить(ЧастьФормулы);
			КонецЕсли;
			
			Если ТекОписаниеЯчейки.Коэф = 0 Тогда
				СтрокиФормулы.Добавить(1);
			Иначе
				СтрокиФормулы.Добавить(бит_ОбщегоНазначенияКлиентСервер.МодульЧисла(ТекОписаниеЯчейки.Коэф));
			КонецЕсли;
			ЧастьФормулы = СтрШаблон("*[%1]", ТекОписаниеЯчейки.Имя); 
			СтрокиФормулы.Добавить(ЧастьФормулы);
								   
			Аргументы.Добавить(ТекОписаниеЯчейки.Имя);
			
		КонецЦикла; 
		СтрФормула = СтрСоединить(СтрокиФормулы);
		
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(СтрФормула) Тогда
		
		ТекИмяЯчейки = СтрШаблон("%1_%2", ИмяКолонки, ИдСтроки);
		Обл = ТабДок.Область(ТекИмяЯчейки);
		Если ТипЗнч(Обл) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			
			Обл.Расшифровка.Формула = СтрФормула;
			Обл.Расшифровка.Аргументы = Аргументы;						
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

// Функция создает структуру, используемую при проверке объединения ячеек в форме ввода.
// 
// Параметры:
//   ИзмеренияРазворачивать - Массив - Разворачивать.
//	 ВыводитьКодификатор	- Булево.
// 
// Возвращаемое значение:
//  ДанныеВрем - Структура.
// 
Функция КонструкторСтруктурыПроверкиОбъединения(ИзмеренияРазворачивать, ВыводитьКодификатор = Истина) Экспорт
	
	ДанныеВрем = Новый Структура;
	
	Если ВыводитьКодификатор Тогда
		НомерКолонки = 2;	
	Иначе	
		НомерКолонки = 1;
	КонецЕсли;
	
	Для каждого Имя Из ИзмеренияРазворачивать Цикл
		НовыеДанные = Новый Структура;
		НовыеДанные.Вставить("ТекЗначение", 		Неопределено);
		НовыеДанные.Вставить("НомерСтроки", 		0);
		НовыеДанные.Вставить("НомерКолонки", 		НомерКолонки);
		НовыеДанные.Вставить("ВыводитьКодификатор", ВыводитьКодификатор);
		
		ДанныеВрем.Вставить(Имя, НовыеДанные);
		
		НомерКолонки = НомерКолонки+1;
	КонецЦикла; 
	
	Возврат ДанныеВрем;
	
КонецФункции

// Процедура проверяет необходимость объединить ячейки со значениями измерений 
// и выполняет объединение при необходимости. 
// 
Процедура ПроверитьВыполнитьОбъединениеЯчеек(ТабДок, ДанныеВрем, Имя, ТекЗначение, ЕстьПодчиненные, ПоследняяСтрокаУровня = Ложь) Экспорт
	
	ОписаниеИзмерения = ДанныеВрем[Имя];
	Если ОписаниеИзмерения.ТекЗначение <> ТекЗначение Тогда
		
		Если ОписаниеИзмерения.НомерСтроки > 0 Тогда
			
			// Выполнить объединение
			Если ПоследняяСтрокаУровня Тогда
				ТекНомер = ТабДок.ВысотаТаблицы;
			Иначе	
				ТекНомер = ТабДок.ВысотаТаблицы-1;
			КонецЕсли; 
			Если (ТекНомер - ОписаниеИзмерения.НомерСтроки) > 0  Тогда
				ТабДок.Область(ОписаниеИзмерения.НомерСтроки, ОписаниеИзмерения.НомерКолонки, 
					ТекНомер, ОписаниеИзмерения.НомерКолонки).Объединить(); 
				
				Если ОписаниеИзмерения.НомерКолонки = 2 И ОписаниеИзмерения.ВыводитьКодификатор Тогда
					// Объединение кодификатора
					ТабДок.Область(ОписаниеИзмерения.НомерСтроки, 1, ТекНомер, 1).Объединить(); 
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
		ОписаниеИзмерения.ТекЗначение =  ТекЗначение;
		ОписаниеИзмерения.НомерСтроки =  ТабДок.ВысотаТаблицы;
		
	КонецЕсли; 
	
КонецПроцедуры

// Возвращает шаблон параметров функции "бит_Бюджетирование.ДоработатьЯчейку".
// 
// Возвращаемое значение:
//  Параметры - структура параметров функции.
//
// Пример:
//	ПараметрыДоработки = бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки();
//	ПараметрыДоработки.ТД 			   = Неопределено;
//	ПараметрыДоработки.НомСтроки 	   = 0;
//	ПараметрыДоработки.НомСтолбца 	   = 0;
//	ПараметрыДоработки.Имя 			   = "";
//	ПараметрыДоработки.Измерения 	   = Неопределено;
//	ПараметрыДоработки.ОписаниеПериода = Неопределено;
//	ПараметрыДоработки.Вид 			   = Неопределено;
//	ПараметрыДоработки.Цвет 		   = Неопределено;
//	ПараметрыДоработки.Аргументы 	   = Неопределено;
//
Функция НовыеПараметрыДоработкиЯчейки() Экспорт

	Параметры = Новый Структура; 
	Параметры.Вставить("ТД",			  Неопределено);
	Параметры.Вставить("НомСтроки", 	  0);
	Параметры.Вставить("НомСтолбца", 	  0);
	Параметры.Вставить("Имя", 			  "");
	Параметры.Вставить("Измерения", 	  Неопределено);
	Параметры.Вставить("ОписаниеПериода", Неопределено);
	Параметры.Вставить("Вид", 			  Неопределено);
	Параметры.Вставить("Цвет", 			  Неопределено);
	Параметры.Вставить("Аргументы", 	  Неопределено);
		
	Возврат Параметры;

КонецФункции
 
// Процедура форматирует ячееку табличного документа перед выводом.
//
// Параметры:
//  Параметры - См. бит_Бюджетирование.НовыеПараметрыДоработкиЯчейки(). 
//
Процедура ДоработатьЯчейку(Параметры) Экспорт 
							
	ТД 				= Параметры.ТД;
	НомСтроки 		= Параметры.НомСтроки;
	НомСтолбца 		= Параметры.НомСтолбца;
	Имя 			= Параметры.Имя;
	Измерения 		= Параметры.Измерения;
	ОписаниеПериода = Параметры.ОписаниеПериода;
	Вид 			= Параметры.Вид;
	Цвет 			= Параметры.Цвет;
	Аргументы 		= Параметры.Аргументы;						
	
	Область = ТД.Область(НомСтроки,НомСтолбца,НомСтроки,НомСтолбца);
	Область.ИспользованиеРасшифровки = ИспользованиеРасшифровкиТабличногоДокумента.БезОбработки;
	Область.Имя = Имя;
	
	Расшифровка = РасшифровкаЯчейки(Имя, Измерения, ОписаниеПериода.Период, Вид);
	
	Если Вид = "Формула" И НЕ Аргументы = Неопределено Тогда
		УстановитьФормулуИтоговПоПериодам(Расшифровка, ОписаниеПериода, Аргументы); 
	КонецЕсли; 
	
	Область.Расшифровка = Расшифровка;
	Если НЕ Цвет = Неопределено Тогда
		Область.ЦветФона = Цвет;	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСГрафамиПроверкаЦикла

// Выполняет проверку формул табличного документа на цикличные ссылки.
//
// Параметры:
//  ТабДокДанные	 - ТабличныйДокумент. 
//  СписокСмежности	 - Структура - см. СписокСмежностиПоискаЦикла. 
// 
// Возвращаемое значение:
//  Структура - результат проверки:
//   * ЕстьЦикл - Булево - наличие циклических ссылок.
//   * ТекстСообщения - Строка - текст сообщения для пользователя. 
//
Функция ЕстьЦиклыВФормулах(ТабДокДанные, СписокСмежности = Неопределено) Экспорт
	
	Результат = Новый Структура("ЕстьЦикл, ТекстСообщения", Ложь, Неопределено);
	Если СписокСмежности = Неопределено Тогда
		СписокСмежности = СписокСмежностиПоискаЦикла(ТабДокДанные);
	КонецЕсли;
	
	СтатусыВершин = Новый Соответствие();
	Для каждого Элемент Из СписокСмежности Цикл
		Вершина = Элемент.Ключ;
		Если СтатусыВершин[Вершина] = Неопределено Тогда // Не проверенная вершина.
			МаршрутЦикла = Новый Массив();
			Результат.ЕстьЦикл = ПоискЦиклаВГлубину(Вершина, СписокСмежности, МаршрутЦикла, СтатусыВершин);
		КонецЕсли;
		Если Результат.ЕстьЦикл Тогда
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	
	СтатусыВершин = Неопределено;
	
	Если Результат.ЕстьЦикл Тогда
		ТекстСообщения = бит_БюджетированиеКлиентСервер.ТекстСообщенияОЦиклическихСсылках(МаршрутЦикла, ТабДокДанные); 
		Результат.ТекстСообщения = ТекстСообщения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ФиксацияБюджета

// Проверяет наличие зафиксированных данных бюджетных данных в таблице.
// 
// Параметры:
//   Сценарий - СправочникСсылка.СценарииПланирования
//   ТаблицаДанных - ТаблицаЗначений
//   Отказ - Булево
//   ВыводитьСообщения - Булево.
//   ГраницыФиксацииБюджета - ТаблицаЗначений, Неопределено. Предрасчетные границы фиксации бюджета.
// 
Процедура ПроверитьФиксацию(Сценарий, ТаблицаДанных, Отказ, ВыводитьСообщения = Ложь) Экспорт
	
	Если НЕ ФиксироватьБюджет() Тогда
		Возврат;
	КонецЕсли;
	
	ТабВрем = ТаблицаДанных.Скопировать();
	ТабВрем.Свернуть("Период, ЦФО");
	
	СписокЦФО = ТабВрем.ВыгрузитьКолонку("ЦФО");
	
	ИмяЦФО = бит_ОбщегоНазначения.ПолучитьИмяСправочникаЦФО();
	ПустоеЦФО = Справочники[ИмяЦФО].ПустаяСсылка();
	СписокЦФО.Добавить(ПустоеЦФО);
	
	Если ТранзакцияАктивна() Тогда
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.бит_ГраницыФиксацииБюджета.ПолноеИмя());
		ЭлементБлокировки.УстановитьЗначение("Сценарий", Сценарий);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.ИсточникДанных = ТабВрем;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЦФО", "ЦФО");
		Блокировка.Заблокировать();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сценарий",  Сценарий);
	Запрос.УстановитьПараметр("СписокЦФО", СписокЦФО);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ГраницыФиксацииБюджета.Сценарий КАК Сценарий,
	|	бит_ГраницыФиксацииБюджета.ЦФО КАК ЦФО,
	|	МАКСИМУМ(бит_ГраницыФиксацииБюджета.ДатаФиксации) КАК ДатаФиксации
	|ПОМЕСТИТЬ ГраницыФиксации
	|ИЗ
	|	РегистрСведений.бит_ГраницыФиксацииБюджета КАК бит_ГраницыФиксацииБюджета
	|ГДЕ
	|	бит_ГраницыФиксацииБюджета.Сценарий = &Сценарий
	|	И бит_ГраницыФиксацииБюджета.ЦФО В(&СписокЦФО)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ГраницыФиксацииБюджета.Сценарий,
	|	бит_ГраницыФиксацииБюджета.ЦФО";
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("ПустоеЦФО", ПустоеЦФО);
	Запрос.УстановитьПараметр("ТабДанные", ТабВрем);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТабДанные.Период, ДЕНЬ) КАК Период,
	|	ТабДанные.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ ТабДанные
	|ИЗ
	|	&ТабДанные КАК ТабДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТабДанные.ЦФО КАК ЦФО,
	|	ТабДанные.Период КАК Период,
	|	ГраницыФиксации.ДатаФиксации КАК ДатаФиксации
	|ИЗ
	|	ТабДанные КАК ТабДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыФиксации КАК ГраницыФиксации
	|		ПО ТабДанные.Период <= ГраницыФиксации.ДатаФиксации
	|			И (ТабДанные.ЦФО = ГраницыФиксации.ЦФО
	|				ИЛИ ГраницыФиксации.ЦФО = &ПустоеЦФО)";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		Если ВыводитьСообщения Тогда 
			ТекстСообщения = НСтр("ru='Попытка изменения зафиксированных данных бюджета. Изменение отклонено.'; 
			|en='Attempted to change fixed budget data. Change rejected.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Проверяет наличие зафиксированных данных бюджетных данных в таблице.
// 
// Параметры:
//   ТекущаяФорма - УправляемаяФорма
//   ДокументСсылка - ДокументСсылка
//   ВыводитьСообщения - Булево.
// 
Процедура ПроверитьФиксациюВФорме(ТекущаяФорма, ДокументСсылка, ВыводитьСообщения = Ложь) Экспорт
	
	Если НЕ ФиксироватьБюджет() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	Набор = РегистрыНакопления.бит_ОборотыПоБюджетам.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(ДокументСсылка);
	Набор.Прочитать();
	
	Если ЗначениеЗаполнено(Набор) Тогда
		
		ТабДвижений = Набор.Выгрузить();
		ПерваяСтрока = ТабДвижений[0];
		
		ПроверитьФиксацию(ПерваяСтрока.Сценарий, ТабДвижений, Отказ, Ложь);
		
	КонецЕсли;
	
	Если Отказ Тогда
		ТекущаяФорма.ТолькоПросмотр = Истина;
		Если ВыводитьСообщения Тогда 
			ТекстСообщения = НСтр("ru='Документ содержит зафиксированные данных бюджета. Форма заблокирована.'; 
								  |en='The document contains fixed budget data. The form is locked.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ЗависимыеОбороты

// Возвращает шаблон параметров для вычисления зависимых оборотов.
// 
// Возвращаемое значение:
//  Структура.
//
Функция НовыеПараметыЗаполненияЗависимыхОборотов() Экспорт
	
	ПараметыЗаполнения = Новый Структура;
	ПараметыЗаполнения.Вставить("ТаблицаИсточник",      Неопределено);
	ПараметыЗаполнения.Вставить("ТаблицаПриемник",      Неопределено);
	ПараметыЗаполнения.Вставить("ЕдиницаИзмеренияСумм", Перечисления.бит_ЕдиницыИзмеренияСумм.Единицы);
	ПараметыЗаполнения.Вставить("Сценарий",             Неопределено);
	ПараметыЗаполнения.Вставить("СценарийЗависимый",    Справочники.СценарииПланирования.ПустаяСсылка());
	ПараметыЗаполнения.Вставить("ВестиПротокол",        Ложь);
	
	ПоляСоединений = ПодготовитьПроверяемыеПоляЗавОборотов();
	ПоляСоединений.Вставить("СтатьяОборотов", "ЗНАЧЕНИЕ(Справочник.бит_СтатьиОборотов.ПустаяСсылка)");
	ПараметыЗаполнения.Вставить("ПоляСоединений", ПоляСоединений);
	
	Возврат ПараметыЗаполнения;
	
КонецФункции

// Вычисляет значение зависимых оборотов.
// 
// Параметры:
//  ПараметыЗаполнения - Структура - см. НовыеПараметыЗаполненияЗависимыхОборотов().
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Зависимые обороты.
//
Функция ЗависимыеОборотыПоИсточнику(ПараметыЗаполнения) Экспорт
	
	ТаблицаИсточник = ПараметыЗаполнения.ТаблицаИсточник;
	Если ТаблицаИсточник.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ИнициализироватьИсточникЗависимыхОборотов(Запрос, ПараметыЗаполнения);
	ИнициализироватьНастройкиЗависимыхОборотов(Запрос, ПараметыЗаполнения);
	
	ВыборкаНастроек = НастройкиЗависимыхОборотов(Запрос, ПараметыЗаполнения);
	ТаблицаПриемник = ПараметыЗаполнения.ТаблицаПриемник;
	КопияПриемника  = ТаблицаПриемник.СкопироватьКолонки();
	ВестиПротокол   = ПараметыЗаполнения.ВестиПротокол;
	
	Пока ВыборкаНастроек.Следующий() Цикл
		НоваяСтрока = КопияПриемника.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНастроек,, "НомерСтроки");
		
		// Заполним показатели
		ПараметрыРасчета = ЗависимыеОборотыВыполнитьРасчет(ВыборкаНастроек,
															ТаблицаИсточник[ВыборкаНастроек.НомерСтрокиИсточника - 1],
															НоваяСтрока,
															ВестиПротокол,
															ВыборкаНастроек.Сценарий);
		Если ВестиПротокол Тогда
			НоваяСтрока.КомментарийРасчета = ЗависимыеОборотыКомментарийРасчета(ПараметрыРасчета);
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаНастроек.ПрофильРаспределения) Тогда
			РаспределитьПоПрофилю(ВыборкаНастроек.ПрофильРаспределения,
 								КопияПриемника,
								НоваяСтрока,
								ВыборкаНастроек.ПериодичностьСценария,
								ВестиПротокол);
		КонецЕсли;
	КонецЦикла;
	
	Если КопияПриемника.Количество() > 0 Тогда
		Сч = 1;
		Для каждого СтрокаОборотов Из КопияПриемника Цикл
			НоваяСтрока = ТаблицаПриемник.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОборотов);
			СтрокаОборотов.НомерСтроки = Сч;
			Сч = Сч + 1;
		КонецЦикла;
		
		ПараметыЗаполнения.ТаблицаИсточник      = КопияПриемника;
		ПараметыЗаполнения.ЕдиницаИзмеренияСумм = Перечисления.бит_ЕдиницыИзмеренияСумм.Единицы;
		ЗависимыеОборотыПоИсточнику(ПараметыЗаполнения);
	КонецЕсли;
	
	Возврат ПараметыЗаполнения.ТаблицаПриемник;
	
КонецФункции

#КонецОбласти

#Область РучнаяКорректировкаФакта

// Обработчик подписки "бит_ПередЗаписьюДокументаРучнаяКорректировкаФактаБП".
// Процедура выполняет действия для ручной корректировки факта перед записью документа.
// 
Процедура ПередЗаписьюДокументаРучнаяКорректировкаФакта(Источник, Отказ, РежимЗаписи, РежимПроведения)	Экспорт

	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
	
КонецПроцедуры

// Процедура выполняет действия для ручной корректировки факта при записи операции для целей трансляции.
// 
// Параметры:
//  Источник.
//
Процедура ПриЗаписиОперацииРучнаяКорректировкаФакта(Источник, Активность = Истина) Экспорт

	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 

КонецПроцедуры // ПриЗаписиОперацииРучнаяКорректировкаФакта()
 
// Процедура изменяет активность в наборах записей при отмене проведения, если есть ручное редактирование фактических данных.
//
// Параметры:
//  Объект	            - ДокументОбъект.
//  МассивИменРегистров - Массив.
//
Процедура ПодготовитьНаборыЗаписейКОтменеПроведенияРучнаяКорректировкаФакта(Объект, МассивИменРегистров) Экспорт 

	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 

КонецПроцедуры // ПодготовитьНаборыЗаписейКОтменеПроведенияРучнаяКорректировкаФакта()

// Функция проверяет ручную корректировку.   
// 
Функция ЕстьРучнаяКорректировкаФакта(Объект) Экспорт 

	// ++ ЕРП 
	Возврат Ложь;
	// -- ЕРП 
	
КонецФункции

// Обработчик подписки "бит_ИспользоватьРучнуюКорректировкуДвиженийПриЗаписи".
//
// Параметры:
//  Источник - КонстантаМенеджерЗначения.ИспользоватьРучнуюКорректировкуДвижений. 
//  Отказ	 - Булево.
//
Процедура ИспользоватьРучнуюКорректировкуДвиженийПриЗаписи(Источник, Отказ) Экспорт 
	
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
	
КонецПроцедуры

#КонецОбласти

// Возвращает настройки измерений бюджетирования.
// 
// Параметры:
//  Исключения - Строка.
// 
// Возвращаемое значение:
//  Настройки - Соответствие.
// 
Функция НастройкиИзмеренийБюджетирования(Исключения = "") Экспорт

	Настройки = Новый Соответствие;
	
	Если ПустаяСтрока(Исключения) Тогда
		МассивИсключений = Новый Массив;
	Иначе	
		МассивИсключений = бит_ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСРазделителями(Исключения, ",");
	КонецЕсли; 
	МассивИсключений.Добавить("Валюта");
	
	НастройкиДоп = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	Для каждого Измерение Из Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения Цикл
		
		// Проверим наличие исключений
		Если МассивИсключений.Найти(Измерение.Имя) <> Неопределено Тогда
		
			 Продолжить;
		
		КонецЕсли; 
		
		Имя = Измерение.Имя;
		
		ТекНастройка = НастройкиДоп[Имя];
		
		Если ТекНастройка = Неопределено И Найти(Имя,"Аналитика_") = 0 Тогда
		
			 ТекНастройка = бит_МеханизмДопИзмерений.КонструкторНастроекАналитик();
			 ТекНастройка.Синоним = Измерение.Синоним;
			 ТекНастройка.ТипЗначения = Измерение.Тип;
			 ТекНастройка.ЗначениеПоУмолчанию = Измерение.Тип.ПривестиЗначение();
		
		КонецЕсли; 
		
		Настройки.Вставить(Имя, ТекНастройка);
		
	КонецЦикла;	

	Возврат Настройки;
	
КонецФункции

// Функция формирует структуру параметров для получения курсов по периодам для документов бюджетирования.
// 
// Параметры:
//  Сценарий  - СправочникСсылка.СценарииПланирования.
//  ВалютаДокумента - СправочникСсылка.бит_Валюты.
// 
// Возвращаемое значение:
//   СтруктураПараметров   - Структура.
// 
Функция ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(Сценарий,ВалютаДокумента) Экспорт

	СтруктураПараметров = Новый Структура;
	Параметры = Новый Структура;
	Параметры.Вставить("Валюта",Константы.бит_ВалютаУправленческогоУчета.Получить());
	СтруктураПараметров.Вставить("Упр",Параметры);
	Параметры = Новый Структура;
	Параметры.Вставить("Валюта",Сценарий.Валюта);
	СтруктураПараметров.Вставить("Сценарий",Параметры);
	Параметры = Новый Структура;
	Параметры.Вставить("Валюта",ВалютаДокумента);
	СтруктураПараметров.Вставить("Документ",Параметры);
	

	Возврат СтруктураПараметров;

КонецФункции

// Процедура выполняет пересчеты из валюты документа в различные валюты, 
// необходимые для подготовки таблицы оборотов для проведения.
// 
// Параметры:
//  ТаблицаОборотов  - ТаблицаЗначений.
//  СтруктураКурсыВалют - Структура- значениями являются структуры с ключами "Валюта","Курс","Кратность".
// 
Процедура ВыполнитьПересчетыВТаблицеОборотов(ТаблицаОборотов,КурсыПоПериодам,СтруктураКурсыВалют, ДопРеквизит = Неопределено) Экспорт

	
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("Сумма");
	
	Если ЗначениеЗаполнено(ДопРеквизит) Тогда
		ИменаРеквизитов.Добавить(ДопРеквизит);
	КонецЕсли;

	Для каждого СтрокаТаблицы Из ТаблицаОборотов Цикл
		
		ТекущиеКурсы = Новый Структура;
		
		ТекущиеКурсы.Вставить("Регл",СтруктураКурсыВалют.Регл);
		
		Если КурсыПоПериодам = Неопределено Тогда
			
				ТекущиеКурсы.Вставить("Упр"     ,СтруктураКурсыВалют.Упр);
				ТекущиеКурсы.Вставить("Сценарий",СтруктураКурсыВалют.Сценарий);
				ТекущиеКурсы.Вставить("Документ",СтруктураКурсыВалют.Документ);			
			
		Иначе	
			// Получаем курсы текущего периода
			КурсыПериода = КурсыПоПериодам[СтрокаТаблицы.Период];
			
			Если КурсыПериода = Неопределено Тогда
				
				ТекущиеКурсы.Вставить("Упр"     ,СтруктураКурсыВалют.Упр);
				ТекущиеКурсы.Вставить("Сценарий",СтруктураКурсыВалют.Сценарий);
				ТекущиеКурсы.Вставить("Документ",СтруктураКурсыВалют.Документ);
				
			Иначе
				
				ТекущиеКурсы.Вставить("Упр"     ,КурсыПериода.Упр);
				ТекущиеКурсы.Вставить("Сценарий",КурсыПериода.Сценарий);
				ТекущиеКурсы.Вставить("Документ",КурсыПериода.Документ);
				
			КонецЕсли; 
		КонецЕсли; 
		
		Если СтрокаТаблицы.ЭтоКоэффициент Тогда
			
			// Это безразмерный коэффициент - пересчеты по валютам не выполняются.
			Для каждого КиЗ Из ТекущиеКурсы Цикл
				
				 Постфикс = КиЗ.Ключ;
				 Если Постфикс = "Документ" Тогда
				 
				 	Продолжить;
				 
				 КонецЕсли; 
				 
				 Имя = "Сумма"+Постфикс;
				 СтрокаТаблицы[Имя] = СтрокаТаблицы.Сумма;
				 
			КонецЦикла; 
			
		Иначе
			
			бит_КурсыВалют.ВыполнитьПересчетыДляОбъекта(СтрокаТаблицы,ИменаРеквизитов,ТекущиеКурсы,СтруктураКурсыВалют.Документ);
			
		КонецЕсли; 
		
	КонецЦикла; // По строкам таблицы
	
КонецПроцедуры

// Процедура выполняет пересчет сумм в табличных частях документов бюджетирования при изменении валюты. 
// 
// Параметры:
//  ТабЧасть - ТабличнаяЧасть.
//  Сценарий - СправочникСсылка.СценарииПланирования.
//  КурсыДок - Структура.
//  ПоляПересчета - Массив.
// 
Процедура ПересчитатьТабЧастьПоВалюте(ТабЧасть, Сценарий, КурсыДок, ПоляПересчета, ИмяКолонкиСтатьяОборотов = "СтатьяОборотов") Экспорт
		
	ИспользоватьКурсыСценария = Сценарий.ИспользоватьКурсыСценария;
	
	Если ИспользоватьКурсыСценария Тогда
		
		// Пересчет с использованием курсов сценария.
		ТаблицаПериодов = ТабЧасть.Выгрузить();
		ТаблицаПериодов.Свернуть("Период");
		
		СтруктураПараметров = Новый Структура;
		Парам = Новый Структура;
		Парам.Вставить("Валюта",КурсыДок.Нач.Валюта);
		СтруктураПараметров.Вставить("Нач",Парам);
		Парам = Новый Структура;
		Парам.Вставить("Валюта",КурсыДок.Кон.Валюта);
		СтруктураПараметров.Вставить("Кон",Парам);
		
		// Получим курсы по периодам
		КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураПараметров, Сценарий);
		
	КонецЕсли;	
	
	
	Для каждого СтрокаТаблицы Из ТабЧасть Цикл
		
		Если СтрокаТаблицы[ИмяКолонкиСтатьяОборотов].ЭтоКоэффициент Тогда
		
			 Продолжить;
		
		КонецЕсли; 
		
		Если ИспользоватьКурсыСценария Тогда
			
			ТекКурсы = КурсыПоПериодам[СтрокаТаблицы.Период];
			
		Иначе
			
			ТекКурсы = КурсыДок;
			
		КонецЕсли; 
		
		Если ТекКурсы = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		СтрКурсаНач = ТекКурсы.Нач;
		СтрКурсаКон = ТекКурсы.Кон;
		
		Для каждого Поле Из ПоляПересчета Цикл
			
			СтрокаТаблицы[Поле] = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы[Поле]
																							, СтрКурсаНач.Валюта
																							, СтрКурсаКон.Валюта
																							, СтрКурсаНач.Курс
																							, СтрКурсаКон.Курс
																							, СтрКурсаНач.Кратность
																							, СтрКурсаНач.Кратность);
			
		КонецЦикла; // ПоляПересчета 
		
	КонецЦикла; // Объект.БДДС
	
	
КонецПроцедуры

// Функция определяет текущий ИД по табличной части.
// 
// Параметры:
//  ТабличнаяЧасть  - ТабличнаяЧасть - табличная часть.
//  ИмяРеквизитаИД  - Строка - имя.
// 
// Возвращаемое значение:
//   ТекущийИД      - Число.
// 
Функция ОпределитьТекущийИД(ТабличнаяЧасть,ИмяРеквизитаИд) Экспорт
	
	ТекущийИД = 1;
	
	Если ТабличнаяЧасть.Количество()>0 Тогда
		
		ВремСписок = Новый СписокЗначений;
		ВремСписок.ЗагрузитьЗначения(ТабличнаяЧасть.ВыгрузитьКолонку("ИД"));
		ВремСписок.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		ТекущийИД = ВремСписок[0].Значение+1;
	КонецЕсли; 

   Возврат ТекущийИД;
   
КонецФункции

// Извлекает настройки аналитик по массиву статей оборотов и упаковывает из в сответствие.
// 
// Параметры:
//  вхСтатьи - Массив, СправочникСсылка.бит_СтатьиОборотов
//  НастройкиСтатей - Соответствие- Ключ: СтатьяОборотов, Значение: Структура.НастройкиСтатейОборотов.
// 
Процедура ПолучитьНастройкиСтатейОборотов(вхСтатьи, НастройкиСтатей) Экспорт

	Если ТипЗнч(вхСтатьи) = Тип("СправочникСсылка.бит_СтатьиОборотов") Тогда		
		МассивСтатей = Новый Массив;
		МассивСтатей.Добавить(вхСтатьи);		
	Иначе		
		МассивСтатей = вхСтатьи;		
	КонецЕсли;
	
	ТекстПолей = "";
	Для каждого РеквизитУчет Из бит_РаботаСДиалогамиСервер.СформироватьМассивРеквизитовСтатей() Цикл
		
	 	ТекстПолей = ТекстПолей + "	бит_СтатьиОборотов.Учет_" + РеквизитУчет + "," + Символы.ПС;
		
	КонецЦикла;
	
	Для каждого РеквизитУчет Из бит_РаботаСДиалогамиСервер.СформироватьМассивРеквизитовСтатейИмяТипа() Цикл
		
		ТекстПолей = ТекстПолей + " бит_СтатьиОборотов.ИмяТипаПоУмолчанию_"+РеквизитУчет + "," + Символы.ПС
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСтатей", МассивСтатей);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СтатьиОборотов.Ссылка КАК СтатьяОборотов,	
	|" + ТекстПолей + "
	|	ИСТИНА КАК Учет_ЦФО
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
	|ГДЕ
	|	НЕ бит_СтатьиОборотов.ЭтоГруппа
	|	И бит_СтатьиОборотов.Ссылка В(&МассивСтатей)
	|";
			   
	Результат = Запрос.Выполнить();
	ТабДанные = Результат.Выгрузить();
	 
	Для каждого СтрокаТаблицы Из ТабДанные Цикл
		 
		Настройка = Новый Структура;
		Настройка.Вставить("ИмяКласса", "НастройкаСтатьиОборотов");
	 	Для каждого Колонка Из ТабДанные.Колонки Цикл
		 
			Если Колонка.Имя = "СтатьяОборотов" Тогда
				Продолжить;
			КонецЕсли; 
			
			Если Найти(Колонка.Имя, "ИмяТипаПоУмолчанию_") > 0  Тогда
				
				ИмяТипа = СтрокаТаблицы[Колонка.Имя];
				Если ЗначениеЗаполнено(ИмяТипа) Тогда
					ИмяТипа = СтрЗаменить(ИмяТипа,".","Ссылка.");
					ТекТип = Новый ОписаниеТипов(ИмяТипа);					
				Иначе	
					ТекТип = Неопределено;
				КонецЕсли; 
				
				Настройка.Вставить(Колонка.Имя, ТекТип);
				
			Иначе	
				
				Настройка.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
				
			КонецЕсли; 
			  
		КонецЦикла; 
		 
		НастройкиСтатей.Вставить(СтрокаТаблицы.СтатьяОборотов, Настройка);
		 
	КонецЦикла;		   
	
КонецПроцедуры

// Возвращает шаблон параметров функции "бит_Бюджетирование.СформироватьЗависимыеОборотыПоСтроке".
// 
// Возвращаемое значение:
//  Параметры - структура параметров функции.
//
// Пример:
//	ПараметрыФормирования = бит_Бюджетирование.НовыеПараметрыФормированияЗависимыхОборотовПоСтроке();
//	ПараметрыФормирования.ДатаЗаполнения 			= '0001-01-01';
//	ПараметрыФормирования.ТекущийОбъект 			= Неопределено;
//	ПараметрыФормирования.СтрокаТабличнойЧасти		= Неопределено;
//	ПараметрыФормирования.ИмяТабличнойЧастиИсточник = "";
//	ПараметрыФормирования.ИмяТабличнойЧастиПриемник = "";
//	ПараметрыФормирования.ИзмеренияБюджетирования	= Неопределено;
//	ПараметрыФормирования.НастройкиЗависимых		= Неопределено;
//	ПараметрыФормирования.УровеньРекурсии 			= 0;
//	
Функция НовыеПараметрыФормированияЗависимыхОборотовПоСтроке() Экспорт

	Параметры = Новый Структура; 
	Параметры.Вставить("ДатаЗаполнения", 			'0001-01-01');
	Параметры.Вставить("ТекущийОбъект", 			Неопределено);
	Параметры.Вставить("СтрокаТабличнойЧасти",		Неопределено);
	Параметры.Вставить("ИмяТабличнойЧастиИсточник", "");
	Параметры.Вставить("ИмяТабличнойЧастиПриемник", "");
	Параметры.Вставить("ИзмеренияБюджетирования",	Неопределено);
	Параметры.Вставить("НастройкиЗависимых",		Неопределено);
	Параметры.Вставить("УровеньРекурсии", 			0);
	
	Возврат Параметры;

КонецФункции

// АПК:581-выкл. Используется в ЕРП.

// Функция получает максимальное значение периода из табличной части.
// 
// Параметры:
//    ТабЧасть - ТабличнаяЧасть
//    ИмяКолонки - Строка
// 
// Возвращаемое значение:
//  МаксПериод - Дата.
// 
Функция ПолучитьМаксПериод(ТабЧасть, ИмяКолонки = "Период") Экспорт

	МаксПериод = ТекущаяДата();
	МассивПериодов = ТабЧасть.ВыгрузитьКолонку(ИмяКолонки);
	СписокПериодов = Новый СписокЗначений;
	СписокПериодов.ЗагрузитьЗначения(МассивПериодов);
	СписокПериодов.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Если СписокПериодов.Количество() > 0 Тогда
	
		МаксПериод = СписокПериодов[0].Значение;
	
	КонецЕсли; 

	Возврат МаксПериод;
	
КонецФункции

// Возвращает кэш параметров функции "бит_Бюджетирование.СформироватьЗависимыеОборотыПоСтроке".
// 
// Параметры:
//  ПараметрыФормирования - Стурктура - см. НовыеПараметрыФормированияЗависимыхОборотовПоСтроке.
//
// Возвращаемое значение:
//  Структура.
//
Функция КешПараметровФормированияЗависимыхОборотовПоСтроке(ПараметрыФормирования) Экспорт

	КешПараметров = Новый Структура;
	КешПараметров.Вставить("СтрокиНастроекСПустымиСтатьями");
	КешПараметров.Вставить("ПустаяТаблицаНастроек");
	КешПараметров.Вставить("КолонкиСверткиНастроек");
	
	НастройкиЗависимыхОборотов = ПараметрыФормирования.НастройкиЗависимых;
	
	Отбор = Новый Структура("СтатьяОборотов", Справочники.бит_СтатьиОборотов.ПустаяСсылка());
	СтрокиНастроекСПустымиСтатьями = НастройкиЗависимыхОборотов.НайтиСтроки(Отбор);
	КешПараметров.СтрокиНастроекСПустымиСтатьями = СтрокиНастроекСПустымиСтатьями;
	
	
	ПустаяТаблицаНастроек = НастройкиЗависимыхОборотов.СкопироватьКолонки();
	КешПараметров.ПустаяТаблицаНастроек = ПустаяТаблицаНастроек;
	
	
	НеключевыеКолонки = Новый СписокЗначений;
	НеключевыеКолонки.Добавить("ДатаОкончания");
	НеключевыеКолонки.Добавить("КоэффициентКоличество");
	НеключевыеКолонки.Добавить("КоэффициентСумма");
	НеключевыеКолонки.Добавить("НомерСтроки");
	НеключевыеКолонки.Добавить("Период");
	НеключевыеКолонки.Добавить("ПрофильРаспределения");
	НеключевыеКолонки.Добавить("Регистратор");
	НеключевыеКолонки.Добавить("РеквизитКоличество");
	НеключевыеКолонки.Добавить("РеквизитСумма");
	НеключевыеКолонки.Добавить("ФункцияКоличество");
	НеключевыеКолонки.Добавить("ФункцияСумма");
	
	КолонкиСверткиНастроек = "";
	Для каждого Колонка Из ПустаяТаблицаНастроек.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		Если НеключевыеКолонки.НайтиПоЗначению(ИмяКолонки) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(КолонкиСверткиНастроек) Тогда
			КолонкиСверткиНастроек = КолонкиСверткиНастроек + ", ";
		КонецЕсли;
		
		КолонкиСверткиНастроек = КолонкиСверткиНастроек + ИмяКолонки;
	КонецЦикла;
	КешПараметров.КолонкиСверткиНастроек = КолонкиСверткиНастроек;
	
	Возврат КешПараметров;

КонецФункции

// Функция получает настройки зависимых оборотов.
// 
// Параметры:
//  Сценарий - СправочникСсылка.СценарииПланирования - Сценарий.
//  ДатаЗапроса - Дата - дата для запроса.
// 
// Возвращаемое значение:
//  НастройкиЗависимыхОборотов - ТаблицаЗначений.
// 
Функция ПолучитьНастройкиЗависимыхОборотов(Сценарий, ДатаЗапроса) Экспорт

	ИмяСправочникаСценарии = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаЗапроса);
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.УстановитьПараметр("ПустойСценарий", Справочники[ИмяСправочникаСценарии].ПустаяСсылка());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	*
	|ИЗ
	|	РегистрСведений.бит_ЗависимыеОбороты КАК ЗависимыеОбороты
	|ГДЕ
	|	ЗависимыеОбороты.Период <= &Дата
	|	И ЗависимыеОбороты.СценарийЗависимый = &ПустойСценарий
	|	И (ЗависимыеОбороты.Сценарий = &Сценарий
	|			ИЛИ ЗависимыеОбороты.Сценарий = &ПустойСценарий)";
				   
	Результат = Запрос.Выполнить();
	НастройкиЗависимыхОборотов = Результат.Выгрузить();
    НастройкиЗависимыхОборотов.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	
	Возврат НастройкиЗависимыхОборотов;
	
КонецФункции

// АПК:581-вкл.

// Процедура выполняе формирование зависимых оборотов по строке оборотов. Рекурсивный вызов.
// 
// Параметры:
//	Параметры - Структура - см. НовыеПараметрыФормированияЗависимыхОборотовПоСтроке.
//  КешПараметровФоромирования - Структура - см. КешПараметровФормированияЗависимыхОборотовПоСтроке. 
// 
Процедура СформироватьЗависимыеОборотыПоСтроке(Параметры, КешПараметровФоромирования = Неопределено) Экспорт

	ДатаЗаполнения 			  = Параметры.ДатаЗаполнения;
	ТекущийОбъект 			  = Параметры.ТекущийОбъект;
	СтрокаТабличнойЧасти 	  = Параметры.СтрокаТабличнойЧасти;
	ИмяТабличнойЧастиИсточник = Параметры.ИмяТабличнойЧастиИсточник;
	ИмяТабличнойЧастиПриемник = Параметры.ИмяТабличнойЧастиПриемник;
	ИзмеренияБюджетирования   = Параметры.ИзмеренияБюджетирования;
	НастройкиЗависимых 	  	  = Параметры.НастройкиЗависимых;
	УровеньРекурсии 		  = Параметры.УровеньРекурсии;
	
	// Защита от зацикливания
	Если УровеньРекурсии>1000 Тогда
		ТекстСообщения = НСтр("ru='Превышен уровень рекурсии. Проверьте настройки зависимых оборотов на зацикливание.';
							  |en='Exceeded the level of recursion. Check the settings dependent on the speed loop.'"); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	    Возврат;
	КонецЕсли; 
	
	УровеньРекурсии = УровеньРекурсии+1;
	
	// Получим данные необходимые для выполнения процедуры.
	
	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	
	// Получаем имя справочника Сценарии бюджетирования в зависимости от текущего решения.
	ИмяСправочникаСценарии = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();
	
	Сценарий = Справочники[ИмяСправочникаСценарии].ПустаяСсылка();
	
	Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("Сценарий",МетаданныеОбъекта,ИмяТабличнойЧастиИсточник) Тогда
		Сценарий = СтрокаТабличнойЧасти.Сценарий;
	ИначеЕсли бит_РаботаСМетаданными.ЕстьРеквизит("Сценарий",МетаданныеОбъекта) Тогда
		Сценарий = ТекущийОбъект.Сценарий;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Сценарий) Тогда
		Возврат;
	КонецЕсли;

	флВестиПротокол = бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("КомментарийРасчета", МетаданныеОбъекта, ИмяТабличнойЧастиПриемник);
	
	// Получаем имена справочников в зависимости от текущего решения.
	ИмяСправочникаЦФО 	  = бит_ОбщегоНазначения.ПолучитьИмяСправочникаЦФО();
	ИмяСправочникаПроекты = бит_ОбщегоНазначения.ПолучитьИмяСправочникаПроекты();
	
	Периодичность = Сценарий.бит_Периодичность;
	
	ТаблицаПриемник = ТекущийОбъект[ИмяТабличнойЧастиПриемник];
	ПроверяемыеПоля = ПодготовитьПроверяемыеПоляЗавОборотов();
	
	// Получим структуру зависимых оборотов для данной строки таблицы оборотов.
	Если НастройкиЗависимых = Неопределено Тогда
		
		Результат = ВыполнитьЗапросДляФормированияЗависимыхОборотов(ДатаЗаполнения, Сценарий, ИзмеренияБюджетирования, СтрокаТабличнойЧасти);	
		Если Результат.Пустой() Тогда
			
			Возврат;
			
		КонецЕсли; 
		
		НастройкиЗависимыхОборотов = Результат.Выгрузить();
		НастройкиЗависимыхОборотов.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
		Для каждого СтрокаНастройки Из НастройкиЗависимыхОборотов Цикл
			ВычислитьПриоритетСтрокиЗависимыхОборотов(СтрокаТабличнойЧасти, СтрокаНастройки, ПроверяемыеПоля);
		КонецЦикла;
		
	Иначе	
		
		Если КешПараметровФоромирования = Неопределено Тогда
			КешПараметровФоромирования = КешПараметровФормированияЗависимыхОборотовПоСтроке(Параметры);
			НастройкиЗависимыхОборотов = КешПараметровФоромирования.ПустаяТаблицаНастроек;
		Иначе
			НастройкиЗависимыхОборотов = КешПараметровФоромирования.ПустаяТаблицаНастроек.СкопироватьКолонки();
		КонецЕсли;
		СтрокиНастроекСПустымиСтатьями = КешПараметровФоромирования.СтрокиНастроекСПустымиСтатьями;
		
		// По статьи в настройке указаны практически всегда, поэтому в первую очередь отберем по статьям
		// по остальным полям будем фильтровать отдельно.
		Отбор = Новый Структура("СтатьяОборотов", СтрокаТабличнойЧасти.СтатьяОборотов);
		НастройкиСтатьи = НастройкиЗависимых.НайтиСтроки(Отбор);
		Для каждого СтрокаНастройки Из НастройкиСтатьи Цикл
			Если УсловиеНаПоляЗависимыхОборотов(СтрокаТабличнойЧасти, СтрокаНастройки, ПроверяемыеПоля, ДатаЗаполнения) Тогда
				ВычислитьПриоритетСтрокиЗависимыхОборотов(СтрокаТабличнойЧасти, СтрокаНастройки, ПроверяемыеПоля);
				НоваяСтрока = НастройкиЗависимыхОборотов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНастройки);
			КонецЕсли;
		КонецЦикла;
		
		// Настройки на пустые статьи.
		Для каждого СтрокаНастройки Из СтрокиНастроекСПустымиСтатьями Цикл
			Если УсловиеНаПоляЗависимыхОборотов(СтрокаТабличнойЧасти, СтрокаНастройки, ПроверяемыеПоля, ДатаЗаполнения) Тогда
				ВычислитьПриоритетСтрокиЗависимыхОборотов(СтрокаТабличнойЧасти, СтрокаНастройки, ПроверяемыеПоля);
				НоваяСтрока = НастройкиЗависимыхОборотов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНастройки);
			КонецЕсли;
		КонецЦикла;
		
		// Выполним "срез последних" для полученной таблицы.
		НастройкиЗависимыхОборотов.Сортировать("Период");
		
		КолонкиСверткиНастроек = КешПараметровФоромирования.КолонкиСверткиНастроек;
		
		ТаблицаСвертки = НастройкиЗависимыхОборотов.Скопировать(, КолонкиСверткиНастроек); 
		ТаблицаСвертки.Колонки.Добавить("КоличествоДублей", Новый ОписаниеТипов("Число"));
		ТаблицаСвертки.ЗаполнитьЗначения(1,"КоличествоДублей");
		ТаблицаСвертки.Свернуть(КолонкиСверткиНастроек, "КоличествоДублей");
		ТаблицаСвертки.Сортировать("КоличествоДублей Убыв");
		
		Для каждого СтрокаСрветки Из ТаблицаСвертки Цикл
			КоличествоДублей = СтрокаСрветки.КоличествоДублей;
			Если КоличествоДублей = 1 Тогда
				Прервать;
			КонецЕсли;
			
			// Найдем дублирующиеся строки в таблице НастройкиЗависимыхОборотов.
			Отбор = Новый Структура(КолонкиСверткиНастроек);
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаСрветки);
			
			НайденныеСтроки  = НастройкиЗависимыхОборотов.НайтиСтроки(Отбор);
			Для Сч = 2 По КоличествоДублей Цикл
				// Т.к. таблица отсортирована по периоду по возрастанию - оставляем строку с самым большим индексом.
				НастройкиЗависимыхОборотов.Удалить(НайденныеСтроки[КоличествоДублей - Сч]);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
		
	НастройкиЗависимыхОборотов.Сортировать("Приоритет УБЫВ");

	ТекущийПриоритет = 0;
	
	Если НастройкиЗависимыхОборотов.Количество() > 0 Тогда
		ТекущийПриоритет = НастройкиЗависимыхОборотов[0].Приоритет;
	КонецЕсли;
	
	// Заполним строки зависимых оборотов
	Для каждого СтрокаНастройки Из НастройкиЗависимыхОборотов Цикл
		
		 // Применяем только строки наивысшего приоритета, например, если совпадает Статья и Проект, 
		 // то эта настройка имеет приоритет перед настройкой, когда совпадает только статья.
	     Если НЕ СтрокаНастройки.Приоритет = ТекущийПриоритет Тогда
		 	   Продолжить;
		 КонецЕсли; 
	
		 НоваяСтрока = ТаблицаПриемник.Добавить();
		 Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("Сценарий",МетаданныеОбъекта,ИмяТабличнойЧастиПриемник) Тогда
			 
			 НоваяСтрока.Сценарий = Сценарий;
			 
		 КонецЕсли;  
		 НоваяСтрока.Период = СтрокаТабличнойЧасти.Период;
		 
		 Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("Измерение",МетаданныеОбъекта,ИмяТабличнойЧастиПриемник) 
			 ИЛИ бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("Измерение",МетаданныеОбъекта,ИмяТабличнойЧастиИсточник) Тогда
		 
		 	НоваяСтрока.Измерение = СтрокаТабличнойЧасти.Измерение;
		 
		 КонецЕсли; 
		 Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("ИД",МетаданныеОбъекта,ИмяТабличнойЧастиПриемник) 
			 ИЛИ бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("ИД",МетаданныеОбъекта,ИмяТабличнойЧастиИсточник) Тогда
		 
		 	НоваяСтрока.ИД = СтрокаТабличнойЧасти.ИД;
		 
		 КонецЕсли; 
		 Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("ИД_Родитель",МетаданныеОбъекта,ИмяТабличнойЧастиПриемник) 
			 ИЛИ бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("ИД",МетаданныеОбъекта,ИмяТабличнойЧастиИсточник) Тогда
		 
		 	НоваяСтрока.ИД_Родитель = СтрокаТабличнойЧасти.ИД;
		 
		 КонецЕсли; 
		 
         Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("Расчетная",МетаданныеОбъекта,ИмяТабличнойЧастиПриемник) 
			 ИЛИ бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти("Расчетная",МетаданныеОбъекта,ИмяТабличнойЧастиИсточник) Тогда
		 
		 	НоваяСтрока.Расчетная = СтрокаТабличнойЧасти.Расчетная;
		 
		 КонецЕсли;		 
		 // Заполним измерения
		 ЗависимыеОборотыЗаполнитьИзмерения(ИзмеренияБюджетирования, СтрокаНастройки, СтрокаТабличнойЧасти, НоваяСтрока);
		 
		 // Заполним показатели
		ПарамРасчета = ЗависимыеОборотыВыполнитьРасчет(СтрокаНастройки, СтрокаТабличнойЧасти, НоваяСтрока, флВестиПротокол, Сценарий);
		Если флВестиПротокол Тогда
			НоваяСтрока.КомментарийРасчета = ЗависимыеОборотыКомментарийРасчета(ПарамРасчета);
		КонецЕсли; 
		 
		 Если ЗначениеЗаполнено(СтрокаНастройки.ПрофильРаспределения) Тогда
			 МассивСтрок = РаспределитьПоПрофилю(СтрокаНастройки.ПрофильРаспределения,ТаблицаПриемник,НоваяСтрока,Периодичность, флВестиПротокол);
			 Для каждого СозданнаяСтрока Из МассивСтрок Цикл
				 ПараметрыФормирования = НовыеПараметрыФормированияЗависимыхОборотовПоСтроке();
				 ПараметрыФормирования.ДатаЗаполнения 			= ДатаЗаполнения;
				 ПараметрыФормирования.ТекущийОбъект 			= ТекущийОбъект;
				 ПараметрыФормирования.СтрокаТабличнойЧасти		= СозданнаяСтрока;
				 ПараметрыФормирования.ИмяТабличнойЧастиИсточник = ИмяТабличнойЧастиПриемник;
				 ПараметрыФормирования.ИмяТабличнойЧастиПриемник = ИмяТабличнойЧастиПриемник;
				 ПараметрыФормирования.ИзмеренияБюджетирования	= ИзмеренияБюджетирования;
				 ПараметрыФормирования.НастройкиЗависимых		= НастройкиЗависимых;
				 ПараметрыФормирования.УровеньРекурсии 			= УровеньРекурсии;
	
				 СформироватьЗависимыеОборотыПоСтроке(ПараметрыФормирования, КешПараметровФоромирования);
			 КонецЦикла; 
		 Иначе	
			 ПараметрыФормирования = НовыеПараметрыФормированияЗависимыхОборотовПоСтроке();
			 ПараметрыФормирования.ДатаЗаполнения 			= ДатаЗаполнения;
			 ПараметрыФормирования.ТекущийОбъект 			= ТекущийОбъект;
			 ПараметрыФормирования.СтрокаТабличнойЧасти		= НоваяСтрока;
			 ПараметрыФормирования.ИмяТабличнойЧастиИсточник = ИмяТабличнойЧастиПриемник;
			 ПараметрыФормирования.ИмяТабличнойЧастиПриемник = ИмяТабличнойЧастиПриемник;
			 ПараметрыФормирования.ИзмеренияБюджетирования	= ИзмеренияБюджетирования;
			 ПараметрыФормирования.НастройкиЗависимых		= НастройкиЗависимых;
			 ПараметрыФормирования.УровеньРекурсии 			= УровеньРекурсии;
			 
			 СформироватьЗависимыеОборотыПоСтроке(ПараметрыФормирования, КешПараметровФоромирования);
		 КонецЕсли; 
	 КонецЦикла; // По выборке структуры зависимых оборотов
	
	// Сброс приоритетов.
	Если ЗначениеЗаполнено(НастройкиЗависимых) Тогда // Для ручных зависимых.
		НастройкиЗависимых.ЗаполнитьЗначения(0, "Приоритет");
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирует зависимые обороты по набору записей регистра бит_ОборотыПоБюджетам.
// 
Процедура СформироватьЗависимыеОборотыПоНаборуЗаписей(ДокументОбъект, НаборОбороты) Экспорт

	ТаблицаИсточник = НаборОбороты.Выгрузить();
	Если ТаблицаИсточник.Количество() = 0 Тогда
	     Возврат;
	КонецЕсли; 
	
	ТаблицаПриемник = ТаблицаИсточник.СкопироватьКолонки();
	ТаблицаПриемник.Колонки.Добавить("ЭтоКоэффициент", Новый ОписаниеТипов("Булево"));
	
	ИзмеренияБюджетирования = ПолучитьИзмеренияБюджетирования("все","имя");
	
	// Формируем зависимые обороты в ТаблицуПриемник.
	Для каждого СтрокаТаблицы Из ТаблицаИсточник Цикл
	
		СформироватьЗависимыеОборотыВТаблицу(СтрокаТаблицы.Период, СтрокаТаблицы,
			ТаблицаИсточник.Колонки, ТаблицаПриемник,ИзмеренияБюджетирования);
	
	КонецЦикла; 
	
	Если ТаблицаПриемник.Количество() > 0 Тогда
		
		// Из-за разнородности валют в наборе, барать валюту из первой строки не корректно.
		// Отсортируем таблицу по валютам.
		
		ВремТЗ = ТаблицаПриемник.Скопировать();
		ВремТЗ.Свернуть("Валюта");
		Валюты = ВремТЗ.ВыгрузитьКолонку("Валюта");
		
		Для каждого Валюта Из Валюты Цикл
			ТекТаблицаПриемник = ТаблицаПриемник.Скопировать(Новый Структура("Валюта", Валюта));
			
			// Выполним валютные пересчеты в ТаблицеПриемник.
			ПерваяСтрока    = ТекТаблицаПриемник[0];
			Сценарий        = ПерваяСтрока.Сценарий;
			ВалютаДокумента = ПерваяСтрока.Валюта;
			
			ДокМодель 			= Документы.бит_БюджетнаяОперация.СоздатьДокумент();
			ДокМодель.Сценарий  = Сценарий;
			ДокМодель.Дата      = ПерваяСтрока.Период;
			СтруктураКурсыВалют = КурсыВалютСценария(ДокМодель, 
												ПерваяСтрока.Период, Новый Структура("Регл, Упр, Сценарий"));
			
			СтрКурсаДок = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, ПерваяСтрока.Период);		 
			СтруктураКурсыВалют.Вставить("Документ",СтрКурсаДок);
			
			КурсыПоПериодам = Неопределено;
			Если Сценарий.ИспользоватьКурсыСценария Тогда
				
				// Получим таблицу периодов
				ТаблицаПериодов = ТекТаблицаПриемник.Скопировать(, "Период");
				ТаблицаПериодов.Свернуть("Период");
				
				// Установим настройки для получения курсов по периодам.
				СтруктураПараметров = ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(Сценарий, ВалютаДокумента);
				
				// Получим курсы по периодам
				КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураПараметров, Сценарий);
				
			КонецЕсли; 
			
			ВыполнитьПересчетыВТаблицеОборотов(ТекТаблицаПриемник,КурсыПоПериодам,СтруктураКурсыВалют);
			
			// Заполним полученные записи по зависимым оборотам в набор оборотов.
			Для каждого СтрокаТаблицы Из ТекТаблицаПриемник Цикл
				
				НоваяЗапись = НаборОбороты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
				НоваяЗапись.ТипЗаписи = Перечисления.бит_ТипыЗаписейОборотовПоБюджетам.ЗависимыйОборот;
				
			КонецЦикла; 
		КонецЦикла;
		
		НаборОбороты.УстановитьАктивность(НаборОбороты[0].Активность);
	КонецЕсли; 

КонецПроцедуры

// Функция выполняет распределение по профилю распределения.
// 
// Параметры:
//  ПрофильРаспределения  - СправочникСсылка.бит_ПрофилиРаспределения.
//  ТаблицаОбороты        - ТабличнаяЧасть,ТаблицаЗначений.
//  СтрокаИсточник        - СтрокаТабличнойЧасти,СтрокаТаблицыЗначений.
//  Периодичность         - ПеречислениеСсылка.бит_ПериодичностьПланирования.
// 	КомментироватьРасчет  - Булево.
// 
// Возвращаемое значение:
//   МассивСтрок   - Массив.
// 
Функция РаспределитьПоПрофилю(ПрофильРаспределения,ТаблицаОбороты,СтрокаИсточник,Периодичность, КомментироватьРасчет = Ложь) Экспорт

	МассивСтрок = Новый Массив;

	Если ПрофильРаспределения.Профиль.Количество()=0 Тогда
	
		МассивСтрок.Добавить(СтрокаИсточник);
		Возврат МассивСтрок;
	
	КонецЕсли;
	
	Итоги = Новый Структура("Сумма,Количество",0,0,0);
	
	Для каждого СтрокаПрофиля Из ПрофильРаспределения.Профиль Цикл
	
		НоваяСтрока = ТаблицаОбороты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаИсточник);
		
		НоваяСтрока.Период = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(СтрокаИсточник.Период,СтрокаПрофиля.НомерПериода,Периодичность);
		
		НоваяСтрока.Количество = СтрокаИсточник.Количество*СтрокаПрофиля.Процент/100;
		НоваяСтрока.Сумма      = СтрокаИсточник.Сумма*СтрокаПрофиля.Процент/100;
		
		Если КомментироватьРасчет Тогда
			НоваяСтрока.КомментарийРасчета = СтрЗаменить(НоваяСтрока.КомментарийРасчета, "%ПрофильРаспределения%", Строка(СтрокаПрофиля.Процент)+"%");
			НоваяСтрока.КомментарийРасчета = СтрЗаменить(НоваяСтрока.КомментарийРасчета, "%РезультатСумма%"		, Формат(НоваяСтрока.Сумма,"ЧЦ=15; ЧДЦ=2"));
			НоваяСтрока.КомментарийРасчета = СтрЗаменить(НоваяСтрока.КомментарийРасчета, "%РезультатКоличество%", Формат(НоваяСтрока.Количество,"ЧЦ=15; ЧДЦ=3"));
		КонецЕсли;
		
		МассивСтрок.Добавить(НоваяСтрока);
		
		// Соберем итоговые суммы
		Для каждого КлючИЗначение Из Итоги Цикл
		
			Итоги[КлючИЗначение.Ключ] = КлючИЗначение.Значение+НоваяСтрока[КлючИЗначение.Ключ];
		
		КонецЦикла; 
		
	КонецЦикла; 
	
	// Проверим распределение, при необходимости скорректируем суммы.
	Для каждого КлючИЗначение Из Итоги Цикл
		
		Разность = СтрокаИсточник[КлючИЗначение.Ключ] - КлючИЗначение.Значение;
		Если Разность<>0 Тогда
		
			НоваяСтрока[КлючИЗначение.Ключ] = НоваяСтрока[КлючИЗначение.Ключ]+Разность;
		
		КонецЕсли; 
		
	КонецЦикла; 
	
	ТаблицаОбороты.Удалить(СтрокаИсточник);
	
	Возврат МассивСтрок;
	
КонецФункции

// Функция распределения по настройкам, полученным из  обработки бит_РаспределениеБюджетныхДанныхПоПрофилю.
//
// Параметры:
//  НастройкиРаспределения - Структура.
//  ТаблицаОбороты         - ДанныеФормыКоллекция.
//  СтрокаИсточник         - ДанныеФормыЭлементКоллекции.
//  МассивРесурсов		   - Массив.
//
// Возвращаемое значение:
//  Массив.
//
Функция РаспределитьПоПрофилюАналитики(НастройкиРаспределения, ТаблицаОбороты, СтрокаИсточник, МассивРесурсов = Неопределено) Экспорт
	
	МассивСтрок = Новый Массив;
	
	Если НастройкиРаспределения.БазаРаспределения.Количество() = 0 Тогда  		
		Возврат МассивСтрок;  		
	КонецЕсли;
	
	Если МассивРесурсов = Неопределено Тогда
		МассивРесурсов = Новый Массив;	
		МассивРесурсов.Добавить("Сумма");
		МассивРесурсов.Добавить("Количество");
	КонецЕсли;
	
	Итоги = Новый Структура;
	Для каждого ИмяРесурса Из МассивРесурсов Цикл
	 	Итоги.Вставить(ИмяРесурса, 0);	
	КонецЦикла;
	
	Для каждого СтрокаПрофиля Из НастройкиРаспределения.БазаРаспределения Цикл
		
		НоваяСтрока = ТаблицаОбороты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
		
		Если НастройкиРаспределения.Вид = Перечисления.бит_ВидыПрофилейРаспределения.ПоАналитике Тогда
			НоваяСтрока[НастройкиРаспределения.ИмяКолонки] = СтрокаПрофиля.ЗначениеАналитики;
		Иначе	
			НоваяСтрока.Период = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(СтрокаИсточник.Период,СтрокаПрофиля.НомерПериода,НастройкиРаспределения.Периодичность);
		КонецЕсли; 
		
		Для каждого ИмяРесурса Из МассивРесурсов Цикл
		 	НоваяСтрока[ИмяРесурса] = (СтрокаИсточник[ИмяРесурса] * СтрокаПрофиля.Процент) / 100;
		КонецЦикла;
		
		МассивСтрок.Добавить(НоваяСтрока);
		
		// Соберем итоговые суммы
		Для каждого КлючИЗначение Из Итоги Цикл			
			Итоги[КлючИЗначение.Ключ] = КлючИЗначение.Значение + НоваяСтрока[КлючИЗначение.Ключ]; 			
		КонецЦикла;            		
		
	КонецЦикла;  // по профилю распределения
	
	// Проверим распределение, при необходимости скорректируем суммы.
	Для каждого КлючИЗначение Из Итоги Цикл
		
		Разность = СтрокаИсточник[КлючИЗначение.Ключ] - КлючИЗначение.Значение;
		Если Разность <> 0 Тогда			
			НоваяСтрока[КлючИЗначение.Ключ] = НоваяСтрока[КлючИЗначение.Ключ] + Разность;			
		КонецЕсли; 
		
	КонецЦикла;		
	
	// Удаление исходной строки
	Если НастройкиРаспределения.УдалятьИсходныеДанные Тогда		
		ТаблицаОбороты.Удалить(СтрокаИсточник);	 		
	КонецЕсли; 
	
	Возврат МассивСтрок;
	
КонецФункции

// Функция возвращает массив объектов соответствующих значению 
// из регистра сведений "бит_ЦФО_Подразделения".
// 
// Параметры:
//  ЗначениеОтбора - СправочникСсылка[бит_ЦФО/Организации/ПодразделенияОрганизаций].
//  Период 		   - Дата, период получения аналитики (По умолчанию = Неопределено для БП).
// 
// Возвращаемое значение:
//  Массив.
// 
Функция СвязанныеЦФОИПодразделения(ЗначениеОтбора, Период = Неопределено) Экспорт
	
	// ++ ЕРП
	МассивОбъектов = Новый Массив;
	
    Если Не ЗначениеЗаполнено(ЗначениеОтбора) Тогда
        Возврат МассивОбъектов;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.Организации") Тогда
		СвязанныйОбъект = РегистрыСведений.бит_СоответствияАналитик.ПолучитьПравуюАналитику(
								ПредопределенноеЗначение("Справочник.бит_ВидыСоответствийАналитик.Организации_ЦФО"), 
								ЗначениеОтбора, Период);
	ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		СвязанныйОбъект = РегистрыСведений.бит_СоответствияАналитик.ПолучитьПравуюАналитику(
								ПредопределенноеЗначение("Справочник.бит_ВидыСоответствийАналитик.СтруктураПредприятия_ЦФО"), 
								ЗначениеОтбора, Период);
	КонецЕсли;
							
	Если ТипЗнч(СвязанныйОбъект) = Тип("Массив") Тогда
		МассивОбъектов = СвязанныйОбъект;
	ИначеЕсли ЗначениеЗаполнено(СвязанныйОбъект) Тогда
		МассивОбъектов.Добавить(СвязанныйОбъект);
	КонецЕсли;
	
	Возврат МассивОбъектов;
	// -- ЕРП
    
КонецФункции

// Функция возвращает массив объектов соответствующих значению 
// из регистра сведений "бит_СтатьиОборотов_СтатьиРегл".
// 
// Параметры:
//  СтатьяОборотов - СправочникСсылка[бит_СтатьиОборотов/ПрочиеДоходыИРасходы/
//                                    СтатьиЗатрат/СтатьиДвиженияДенежныхСредств] - Статьи.
//  СтрокаТребуемыйТип - Строка - Строка требуемого типа.
// 
// Возвращаемое значение:
//  МассивОбъектов - Массив.
// 
Функция СвязанныеСтатьиОборотовИСтатьиРегл(СтатьяОборотов, СтрокаТребуемыйТип = Неопределено) Экспорт
	
	// Бывш. "ПолучитьСоответствиеСтатьиОборотовИСтатьиРегл".
	
    // ++ ЕРП 
	Возврат Новый Массив;
	// -- ЕРП 
    
КонецФункции

// Функция возвращает массив объектов соответствующих значению 
// из регистра сведений "бит_СтатьиОборотов_НоменклатурныеГруппы".
// 
// Параметры:
//  Источник - СправочникСсылка.бит_СтатьиОборотов или СправочникСсылка.НоменклатурныеГруппы.
// 
// Возвращаемое значение:
//  МассивОбъектов - Массив.
// 
Функция СвязанныеСтатьиОборотовИНоменклатурныеГруппы(Источник) Экспорт
	
	// Бывш. "ПолучитьСоответствиеСтатьиОборотовНомГруппы(Источник)".
	
    // ++ ЕРП 
	Возврат Новый Массив;
	// -- ЕРП 
    
КонецФункции

// Процедура проверяет на уникальность соспоставленные значения
// объектам в наборе записей регистра сведений (соспоставленное значение может быть сопоставлено одному объекту).
// 
// Параметры:
//  НаборЗаписейРегистра - НаборЗаписейРегистраСведений.
//  СтруктураИзмерений   - Структура, (Ключи: ИмяРегистра, ИмяИзмерения_Объект, ИмяИзмерения_Значения).
// 
//  Отказ - Булево, флаг отказа записи набора записей.
// 
Процедура ПроверитьУникальностьСопоставленныхЗначений_ОбъектамВНабореЗаписей(НаборЗаписейРегистра, СтруктураИзмерений, Отказ) Экспорт
    
    // Если набор записей не пуст, тогда
    Если НаборЗаписейРегистра.Количество() <> 0 Тогда
        
        ТаблицаДляПроверки = НаборЗаписейРегистра.Выгрузить();
        
        // Получаем значения для проверки.
        ИмяРегистраДляПроверки = СтруктураИзмерений["ИмяРегистра"];
        ИмяИзмерения_Объект    = СтруктураИзмерений["ИмяИзмерения_Объект"];
        ИмяИзмерения_Значения  = СтруктураИзмерений["ИмяИзмерения_Значения"];
        
        Запрос = Новый Запрос;
        Запрос.УстановитьПараметр("ТаблицаДляПроверки", НаборЗаписейРегистра.Выгрузить());
        
        Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
            |    ТаблицаДляПроверки." + ИмяИзмерения_Значения + " КАК Значение
            |ПОМЕСТИТЬ ТаблицаДляПроверки
            |ИЗ
            |    &ТаблицаДляПроверки КАК ТаблицаДляПроверки
            |;
            |
            |////////////////////////////////////////////////////////////////////////////////
            |ВЫБРАТЬ
            |    РегистрДляПроверки." + ИмяИзмерения_Объект + " КАК Объект,
            |    РегистрДляПроверки." + ИмяИзмерения_Значения + " КАК Значение
            |ИЗ
            |    РегистрСведений." + ИмяРегистраДляПроверки + " КАК РегистрДляПроверки
            |ГДЕ
            |    РегистрДляПроверки." + ИмяИзмерения_Значения + " В
            |            (ВЫБРАТЬ
            |                ТаблицаДляПроверки.Значение
            |            ИЗ
            |                ТаблицаДляПроверки КАК ТаблицаДляПроверки)
            |;
            |
            |////////////////////////////////////////////////////////////////////////////////
            |УНИЧТОЖИТЬ ТаблицаДляПроверки";
        
        РезультатЗапроса = Запрос.Выполнить();
        Если Не РезультатЗапроса.Пустой() Тогда
            ВыборкаЗапроса = РезультатЗапроса.Выбрать();
            Пока ВыборкаЗапроса.Следующий()Цикл
                
                ТекОбъект   = ВыборкаЗапроса.Объект;
                ТекЗначение = ВыборкаЗапроса.Значение;
                
                СинонимОбъекта  = ТекОбъект.Метаданные().Синоним;
                СинонимЗначения = ТекЗначение.Метаданные().Синоним;
                ТекстСообщения  = НСтр("ru='Значение ""%1"": элемент <%2> уже сопоставлено объекту ""%3"": элемент <%4>.';
		      					 	   |en='Value ""%1"": element <%2> is already mapped to object ""%3"": element <%4>.'");
                ТекстСообщения  = СтрШаблон(ТекстСообщения, СинонимЗначения, ТекЗначение, СинонимОбъекта, ТекОбъект);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
            КонецЦикла;
        КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет на уникальность массив соспоставленных значений
// объектам в наборе записей регистра сведений (соспоставленное значение может быть сопоставлено одному объекту).
// 
// Параметры:
//  НаборЗаписейРегистра - НаборЗаписейРегистраСведений.
//  СтруктураИзмерений   - Структура, (Ключи: ИмяРегистра, ИмяИзмерения_Объект, ИмяИзмерения_Значения).
// 
//  Отказ - Булево, флаг отказа записи набора записей.
// 
Процедура ПроверитьУникальностьСопоставленногоМассиваЗначений_ОбъектамВНабореЗаписей(НаборЗаписейРегистра, СтруктураИзмерений, Отказ) Экспорт
    
    // Если набор записей не пуст, тогда
    Если НаборЗаписейРегистра.Количество() <> 0 Тогда
        
        ТаблицаДляПроверки = НаборЗаписейРегистра.Выгрузить();
        
        // Получаем значения для проверки.
        ИмяРегистраДляПроверки = СтруктураИзмерений["ИмяРегистра"];
        ИмяИзмерения_Объект    = СтруктураИзмерений["ИмяИзмерения_Объект"];
        ИмяИзмерения_Значения  = СтруктураИзмерений["ИмяИзмерения_Значения"];
		
		Если ТипЗнч(ИмяИзмерения_Значения) = Тип("Массив") Тогда
			МассивПолей = ИмяИзмерения_Значения;
		Иначе
			МассивПолей = Новый Массив;
			МассивПолей.Добавить(ИмяИзмерения_Значения);
		КонецЕсли;
		
		ТекстПоляТаб = "";
		ТекстПоляРег = "";
		ТекстУсловияНач = "";
		ТекстУсловияКон = "";
		НомПоля = 0;
		Для Каждого ТекПоле Из ИмяИзмерения_Значения Цикл
			
			НомПоля = НомПоля + 1;
			
			ТекстПоляТаб = ТекстПоляТаб + ?(ПустаяСтрока(ТекстПоляТаб), "", ","+Символы.ПС);
			ТекстПоляТаб = ТекстПоляТаб + "    ТаблицаДляПроверки." + ТекПоле + " КАК Значение"+НомПоля;
			
			ТекстПоляРег = ТекстПоляРег + ?(ПустаяСтрока(ТекстПоляРег), "", ","+Символы.ПС);
			ТекстПоляРег = ТекстПоляРег + "    РегистрДляПроверки." + ТекПоле + " КАК Значение"+НомПоля;
			
			ТекстУсловияНач = ТекстУсловияНач + ?(ПустаяСтрока(ТекстУсловияНач), "", ", ");
			ТекстУсловияНач = ТекстУсловияНач + "РегистрДляПроверки."+ТекПоле;
			
			ТекстУсловияКон = ТекстУсловияКон + ?(ПустаяСтрока(ТекстУсловияКон), "", ", ");
			ТекстУсловияКон = ТекстУсловияКон + "ТаблицаДляПроверки.Значение"+НомПоля;
			
		КонецЦикла;
		
        Запрос = Новый Запрос;
        Запрос.УстановитьПараметр("ТаблицаДляПроверки", НаборЗаписейРегистра.Выгрузить());
        
        Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
            |    "+ТекстПоляТаб+"
            |ПОМЕСТИТЬ ТаблицаДляПроверки
            |ИЗ
            |    &ТаблицаДляПроверки КАК ТаблицаДляПроверки
            |;
            |
            |////////////////////////////////////////////////////////////////////////////////
            |ВЫБРАТЬ
            |    РегистрДляПроверки." + ИмяИзмерения_Объект + " КАК Объект,
            |    "+ТекстПоляРег+"
            |ИЗ
            |    РегистрСведений." + ИмяРегистраДляПроверки + " КАК РегистрДляПроверки
            |ГДЕ
            |    ("+ТекстУсловияНач+") В 
            |            (ВЫБРАТЬ
            |                "+ТекстУсловияКон+"
            |            ИЗ
            |                ТаблицаДляПроверки КАК ТаблицаДляПроверки)
            |;
            |
            |////////////////////////////////////////////////////////////////////////////////
            |УНИЧТОЖИТЬ ТаблицаДляПроверки";
        
        РезультатЗапроса = Запрос.Выполнить();
        Если Не РезультатЗапроса.Пустой() Тогда
            
            Отказ = Истина;
            
            ВыборкаЗапроса = РезультатЗапроса.Выбрать();
            Пока ВыборкаЗапроса.Следующий()Цикл
				
				ТекОбъект   = ВыборкаЗапроса.Объект;
				СинонимОбъекта  = ТекОбъект.Метаданные().Синоним;
				
				Структура = Новый Соответствие;
				
				ТекстСообщенияНач = НСтр("ru='Набор значений:';en='Set of values:'");
				ТекстСообщения = "";
				
				СоединяемыеСтроки = Новый Массив;
				Для Ном = 1 По НомПоля Цикл 
					ТекЗначение = ВыборкаЗапроса["Значение"+Ном];
					СинонимТекЗначения = ТекЗначение.Метаданные().Синоним;
					ТекстЗначение = НСтр("ru='значение ""%1"" - <%2>';en='value ""%1"" - <%2>'");
					СоединяемыеСтроки.Добавить(СтрШаблон(ТекстЗначение, СинонимТекЗначения, ТекЗначение));
				КонецЦикла;
				ТекстСообщения = СтрСоединить(СоединяемыеСтроки, СтрШаблон(НСтр("ru='%1и%1';en='%1and%1'"), " "));
				
				ТекстПромежуточный = НСтр("ru='%1 %2 уже сопоставлено объекту ""%3"": элемент <%4>.';
		      							  |en='%1 %2 has already been mapped to object ""%3"": element <%4>.'");
				ТекстСообщения = СтрШаблон(ТекстПромежуточный, ТекстСообщенияНач, ТекстСообщения, СинонимОбъекта, ТекОбъект);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
            КонецЦикла;
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

// Функция проверяет наличие механизма балансового учета для бюджетирования.
// 
// Параметры:
//  СообщатьОбОтсутствии - Булево, сообщать пользователю об отсутствии
//                         механизма балансового учета, по умолчанию Ложь.
// 
// Возвращаемое значение:
//   ЕстьМеханизм - Булево.
// 
Функция ЕстьМеханизмБалансовогоУчета(СообщатьОбОтсутствии = Ложь) Экспорт
	
	// Получим доступность функционала ПРОФ.
	ФункционалПРОФДоступен =  бит_ЛицензированиеБФСерверПереопределяемый.СборкаДоступна("ПРОФ");
	
	ЕстьМеханизм = ?(ФункционалПРОФДоступен, Истина, Ложь);

	Если СообщатьОбОтсутствии И Не ЕстьМеханизм Тогда
		ТекстСообщения = НСтр("ru='Механизм балансового учета в данной версии не доступен.';
							  |en='The balance sheet mechanism is not available in this version.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
    КонецЕсли;
    
	Возврат ЕстьМеханизм;
    
КонецФункции

// Процедура формирует проводки по регистру бухгалтерии бюджетирование.
// 
// Параметры:
//  ТаблицаДанные              - ТаблицаЗначений - Таблица по которой формируются движения 
// 												   по регистру бит_ОборотыПоБюджетам.
//  НаборЗаписейБюджетирование - РегистрБухгалтерииНаборЗаписей.бит_Бюджетирование.
//  ОчищатьНаборЗаписей		   - Булево (По умолчанию = Истина).
//  ДатаСторно                 - Дата (По умолчанию = Неопределено).
// 
Процедура СформироватьПроводкиБюджетирования(ТаблицаДанные, НаборЗаписейБюджетирование, ОчищатьНаборЗаписей = Истина, ДатаСторно = Неопределено) Экспорт
	
	бит_БюджетированиеБалансовыйУчет.СформироватьПроводкиБюджетирования(ТаблицаДанные
                                                    , НаборЗаписейБюджетирование
                                                    , ОчищатьНаборЗаписей
                                                    , ДатаСторно);
	
КонецПроцедуры

// Функция получает периодичность сценария. Если значение периодичности не удалось 
// определить возвращается периодичность МЕСЯЦ.
// 
// Параметры:
//  Сценарий  - СправочникСсылка.СценарииПланирования.
// 
// Возвращаемое значение:
//   Периодичность   - СправочникСсылка.бит_ПериодичностьПланирования.
// 
Функция ПолучитьПериодичностьСценария(Сценарий) Экспорт
	
	Перем Периодичность;
	
	Если ЗначениеЗаполнено(Сценарий) Тогда
		Периодичность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "бит_Периодичность");
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		Периодичность = Перечисления.бит_ПериодичностьПланирования.Месяц;
	КонецЕсли; 
	
	Возврат Периодичность;
	
КонецФункции

// Предназначена для получения конструкции языка запросов по значению перечисления.
// Необходимо использовать в условия применения локализации конфигурации.
//
// Параметры:
//  Периодичность	 - ПеречислениеСсылка.бит_ПериодичностьПланирования	 - значение периодичности.
// 
// Возвращаемое значение:
// 	Разворот - строка. См. синтакс-помощник "Конструкция языка запросов".  
//
Функция ПериодДляРазворотаТаблицыЗапроса(Периодичность) Экспорт

	Разворот = "Период";
	Если Периодичность  = Перечисления.бит_ПериодичностьПланирования.День Тогда
		Разворот = "День";
	ИначеЕсли Периодичность  = Перечисления.бит_ПериодичностьПланирования.Неделя Тогда
		Разворот = "Неделя";
	ИначеЕсли Периодичность  = Перечисления.бит_ПериодичностьПланирования.Декада Тогда
		Разворот = "Декада";
	ИначеЕсли Периодичность  = Перечисления.бит_ПериодичностьПланирования.Месяц Тогда
		Разворот = "Месяц";
	ИначеЕсли Периодичность  = Перечисления.бит_ПериодичностьПланирования.Квартал Тогда
		Разворот = "Квартал";
	ИначеЕсли Периодичность  = Перечисления.бит_ПериодичностьПланирования.Полугодие Тогда
		Разворот = "Полугодие";
	ИначеЕсли Периодичность  = Перечисления.бит_ПериодичностьПланирования.Год Тогда
		Разворот = "Год";
	КонецЕсли; 

	Возврат Разворот;
	
КонецФункции

Процедура ПроверитьОбязательныеРазрезыСтатейОборотов(Объект, ИмяТаблицы, Отказ, Измерения=Неопределено, НастройкиИзмерений=Неопределено) Экспорт
	
	Если Измерения = Неопределено Тогда
		Измерения = ПолучитьИзмеренияБюджетирования("Произвольные", "Синоним");
	КонецЕсли;
	
	Если НастройкиИзмерений = Неопределено Тогда
		НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	КонецЕсли;
	
	МетаОбъект	 = Объект.Метаданные();
	МетаТабЧасть = МетаОбъект.ТабличныеЧасти[ИмяТаблицы]; 
	ПредставлениеТабЧасти = МетаТабЧасть.Представление();
	
	МетаСтатьи = Метаданные.Справочники.бит_СтатьиОборотов;
	
	СтруктураОбязательныхРазрезов = Новый Структура;
	
	ИменаРеквизитов = Новый Массив;
	Для каждого ТекИзмерение Из Измерения Цикл
		ИмяРеквизита = "Обязательный_" + ТекИзмерение.Ключ;
		
		Если НЕ бит_РаботаСМетаданными.ЕстьРеквизит(ИмяРеквизита, МетаСтатьи)
			ИЛИ НЕ бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти(ТекИзмерение.Ключ, МетаОбъект, ИмяТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваИзмерения = НастройкиИзмерений[ТекИзмерение.Ключ];
		Если СвойстваИзмерения = Неопределено Тогда
			СинонимРеквизита = ТекИзмерение.Значение;
		Иначе	
			СинонимРеквизита = СвойстваИзмерения.Синоним;
		КонецЕсли;
		
		СтруктураОбязательныхРазрезов.Вставить(ТекИзмерение.Ключ, СинонимРеквизита);
		ИменаРеквизитов.Добавить("Учет_" + ТекИзмерение.Ключ);
		ИменаРеквизитов.Добавить(ИмяРеквизита);
	КонецЦикла;
	
	ДанныеСтатей = Новый Соответствие;
	Для каждого ТекСтрока Из Объект[ИмяТаблицы] Цикл
		
		СтатьяОборотов = ТекСтрока.СтатьяОборотов;
		Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
			ДанныеСтатьи = ДанныеСтатей.Получить(СтатьяОборотов);
			Если ДанныеСтатьи = Неопределено Тогда
				ДанныеСтатьи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяОборотов, ИменаРеквизитов);
				ДанныеСтатей.Вставить(СтатьяОборотов, ДанныеСтатьи);
			КонецЕсли;
			
			Для каждого КлючЗначение Из СтруктураОбязательныхРазрезов Цикл
				Если ДанныеСтатьи["Учет_"+КлючЗначение.Ключ]
					И ДанныеСтатьи["Обязательный_"+КлючЗначение.Ключ]
					И НЕ ЗначениеЗаполнено(ТекСтрока[КлючЗначение.Ключ]) Тогда
														
					ИндексСтроки   = Формат(ТекСтрока.НомерСтроки - 1, "ЧДЦ=0; ЧН=0; ЧГ=");
					Поле		   = ИмяТаблицы + "[" + ИндексСтроки + "]." + КлючЗначение.Ключ;
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", ,КлючЗначение.Значение,
										ТекСтрока.НомерСтроки, ПредставлениеТабЧасти);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, Поле, ,Отказ); 
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКлючиАналитикВНаборе(НаборДанных) Экспорт

	Если НЕ ЗначениеЗаполнено(НаборДанных) Тогда
		Возврат;	
	КонецЕсли;
	
	Таблица = Новый ТаблицаЗначений; 
	Таблица.Колонки.Добавить("ИндексВНаборе", ОбщегоНазначения.ОписаниеТипаЧисло(5));
	Таблица.Колонки.Добавить("Сценарий", 	  Новый ОписаниеТипов("СправочникСсылка.СценарииПланирования"));
	Таблица.Колонки.Добавить("ЦФО",			  Новый ОписаниеТипов("СправочникСсылка.Подразделения"));

	Индекс = 0;
	Для каждого Запись Из НаборДанных Цикл
		Если НЕ ЗначениеЗаполнено(Запись.КлючСценарийЦФО) Тогда
			НоваяСтрока = Таблица.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
			НоваяСтрока.ИндексВНаборе = Индекс;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(Таблица) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.ИндексВНаборе КАК ИндексВНаборе,
	|	Таблица.Сценарий КАК Сценарий,
	|	Таблица.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ ИсхожныеДанные
	|ИЗ
	|	&Таблица КАК Таблица;";
	
	Запрос.Выполнить();
	ИнициализироватьКлючиАналитик(Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсхожныеДанные.Сценарий КАК Сценарий,
	|	ИсхожныеДанные.ЦФО КАК ЦФО,
	|	КлючиАналитик.КлючАналитики КАК КлючСценарийЦФО,
	|	ИсхожныеДанные.ИндексВНаборе КАК ИндексВНаборе
	|ИЗ
	|	ИсхожныеДанные КАК ИсхожныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК КлючиАналитик
	|		ПО ИсхожныеДанные.Сценарий = КлючиАналитик.Сценарий
	|			И ИсхожныеДанные.ЦФО = КлючиАналитик.ЦФО";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = НаборДанных.Получить(Выборка.ИндексВНаборе);
		Запись.КлючСценарийЦФО = Выборка.КлючСценарийЦФО;
	КонецЦикла;

КонецПроцедуры

Функция СтатьиБезИтогов(Бюджет) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Бюджет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.СтатьяОборотов КАК СтатьяОборотов
	|ИЗ
	|	Справочник.бит_СтатьиБюджета КАК Таблица
	|ГДЕ
	|	НЕ Таблица.ЭтоГруппа
	|	И Таблица.НеВключатьВИтоги
	|	И Таблица.Владелец = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ссылка, Выборка.СтатьяОборотов);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗависимыеОбороты

Процедура ИнициализироватьИсточникЗависимыхОборотов(Запрос, ПараметыЗаполнения)
	
	ТаблицаИсточник  = ПараметыЗаполнения.ТаблицаИсточник;
	РазделительПолей = "," + Символы.ПС + Символы.Таб;
	
	Запрос.УстановитьПараметр("ТаблицаИсточник", ТаблицаИсточник);
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ИменаКолонокИсточника
	|ПОМЕСТИТЬ ТаблицаИсточник
	|ИЗ &ТаблицаИсточник КАК ТаблицаИсточник";
	
	ПутиКДаннымКолонок      = Новый Массив;
	ТекстВыборкиКолонок     = "";
	ШаблонПутиКДанным       = "ТаблицаИсточник.%1 КАК %1";
	КолонкиТаблицыИсточника = ТаблицаИсточник.Колонки;
	Для каждого Колонка Из КолонкиТаблицыИсточника Цикл
		ПутиКДаннымКолонок.Добавить(СтрШаблон(ШаблонПутиКДанным, Колонка.Имя));
	КонецЦикла;
	Если КолонкиТаблицыИсточника.Найти("Сценарий") = Неопределено
		И ПараметыЗаполнения.Сценарий <> Неопределено Тогда
		ПутиКДаннымКолонок.Добавить("&Сценарий КАК Сценарий");
		Запрос.УстановитьПараметр("Сценарий", ПараметыЗаполнения.Сценарий);
	КонецЕсли;
	ТекстВыборкиКолонок = СтрСоединить(ПутиКДаннымКолонок, РазделительПолей); 
	Если ПараметыЗаполнения.ЕдиницаИзмеренияСумм <> Перечисления.бит_ЕдиницыИзмеренияСумм.Единицы Тогда
		ТекстВыборкиКолонок = СтрЗаменить(ТекстВыборкиКолонок,
										"ТаблицаИсточник.Сумма",
										"(ТаблицаИсточник.Сумма * &РазмерностьЕдиницы)");
		РазмерностьЕдиницы  = бит_ОбщегоНазначения.ПолучитьРазмерностьЕдиницыИзмеренияСумм(
								ПараметыЗаполнения.ЕдиницаИзмеренияСумм);
		Запрос.УстановитьПараметр("РазмерностьЕдиницы", РазмерностьЕдиницы);
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ИменаКолонокИсточника", ТекстВыборкиКолонок);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ИнициализироватьНастройкиЗависимыхОборотов(Запрос, ПараметыЗаполнения)
	
	ТекстЗапроса = ТекстЗапросаМатрицаЗависимыхОборотов(ПараметыЗаполнения);
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаСрезПоследнихЗависимыхОборотов(ПараметыЗаполнения); 
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СценарийЗависимый", ПараметыЗаполнения.СценарийЗависимый);
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ТекстЗапросаМатрицаЗависимыхОборотов(ПараметыЗаполнения)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаИсточник.НомерСтроки КАК НомерСтрокиИсточника,
	|	ЗависимыеОбороты.Период КАК Период,
	|	ЗависимыеОбороты.Сценарий КАК Сценарий,
	|	&ИзмеренияЗависимыхОборотов КАК ИзмеренияЗависимыхОборотов,
	|	ЗависимыеОбороты.ПрофильРаспределения КАК ПрофильРаспределения,
	|	ЗависимыеОбороты.КоэффициентКоличество КАК КоэффициентКоличество,
	|	ЗависимыеОбороты.КоэффициентСумма КАК КоэффициентСумма,
	|	ЗависимыеОбороты.РеквизитКоличество КАК РеквизитКоличество,
	|	ЗависимыеОбороты.РеквизитСумма КАК РеквизитСумма,
	|	ЗависимыеОбороты.ФункцияКоличество КАК ФункцияКоличество,
	|	ЗависимыеОбороты.ФункцияСумма КАК ФункцияСумма,
	|	ЗависимыеОбороты.Регистратор КАК Регистратор,
	|	ЗависимыеОбороты.НомерСтроки КАК НомерСтроки,
	|	&Приоритет КАК Приоритет
	|ПОМЕСТИТЬ МатрицаЗависимыхОборотов
	|ИЗ
	|	ТаблицаИсточник КАК ТаблицаИсточник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗависимыеОбороты КАК ЗависимыеОбороты
	|		ПО ЗависимыеОбороты.СценарийЗависимый = &СценарийЗависимый
	|			И ТаблицаИсточник.Период >= ЗависимыеОбороты.Период
	|			И (ЗависимыеОбороты.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ЗависимыеОбороты.ДатаОкончания >= ТаблицаИсточник.Период)
	|			И (ЗависимыеОбороты.КоэффициентКоличество <> 0
	|				ИЛИ ЗависимыеОбороты.ФункцияКоличество <> ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеФункции.ПустаяСсылка)
	|				ИЛИ ЗависимыеОбороты.КоэффициентСумма <> 0
	|				ИЛИ ЗависимыеОбороты.ФункцияСумма <> ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеФункции.ПустаяСсылка))
	|			И (ЗависимыеОбороты.РеквизитКоличество <> ЗНАЧЕНИЕ(Перечисление.бит_РеквизитыДляРасчетаЗависимостей.ПустаяСсылка)
	|				ИЛИ ЗависимыеОбороты.РеквизитСумма <> ЗНАЧЕНИЕ(Перечисление.бит_РеквизитыДляРасчетаЗависимостей.ПустаяСсылка))
	|			И (ТаблицаИсточник.Сценарий = ЗависимыеОбороты.Сценарий
	|				ИЛИ ЗависимыеОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка))
	|			И (&УсловиеПолейСоединения)";
	
	ТекстВыборкиПолейСоединения = "";
	ШаблонВыборки               = "ЗависимыеОбороты.%1 КАК %1,
								|	ЗависимыеОбороты.%1_Зависимый КАК %1_Зависимый,";
	ТекстУсловияСоединения      = "";
	ШаблонУсловия               = "			И (ТаблицаИсточник.%1 = ЗависимыеОбороты.%1
								|				ИЛИ ЗависимыеОбороты.%1 = %2)";
	ТекстРасчетаПриоритета = "";
	ШаблонПриоритета       = "ВЫБОР
							|		КОГДА ЗависимыеОбороты.%1 = %2
							|			ТОГДА 0
							|		ИНАЧЕ 1
							|	КОНЕЦ";
	Для каждого ПолеСоединения Из ПараметыЗаполнения.ПоляСоединений Цикл
		ИмяПоля       = ПолеСоединения.Ключ;
		ПустоЗначение = ПолеСоединения.Значение;
		Если НЕ ПустаяСтрока(ТекстВыборкиПолейСоединения) Тогда
			ТекстВыборкиПолейСоединения = ТекстВыборкиПолейСоединения + "
											|	";
		КонецЕсли;
		Если НЕ ПустаяСтрока(ТекстРасчетаПриоритета) Тогда
			ТекстРасчетаПриоритета = ТекстРасчетаПриоритета + " +
											|	";
		КонецЕсли;
		ТекстВыборкиПолейСоединения = ТекстВыборкиПолейСоединения + СтрШаблон(ШаблонВыборки, ИмяПоля);
		ТекстУсловияСоединения = ТекстУсловияСоединения + Символы.ПС + СтрШаблон(ШаблонУсловия, ИмяПоля, ПустоЗначение);
		ТекстРасчетаПриоритета = ТекстРасчетаПриоритета + СтрШаблон(ШаблонПриоритета, ИмяПоля, ПустоЗначение);
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ИзмеренияЗависимыхОборотов КАК ИзмеренияЗависимыхОборотов,",
								ТекстВыборкиПолейСоединения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И (&УсловиеПолейСоединения)", ТекстУсловияСоединения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Приоритет", ТекстРасчетаПриоритета);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСрезПоследнихЗависимыхОборотов(ПараметыЗаполнения)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	МатрицаЗависимыхОборотов.НомерСтрокиИсточника КАК НомерСтрокиИсточника,
	|	МатрицаЗависимыхОборотов.Сценарий КАК Сценарий,
	|	&ИзмеренияЗависимыхОборотов КАК ИзмеренияЗависимыхОборотов,
	|	МатрицаЗависимыхОборотов.Приоритет КАК Приоритет,
	|	МАКСИМУМ(МатрицаЗависимыхОборотов.Период) КАК МаксимальныйПериод
	|ПОМЕСТИТЬ ПоследниеПериоды
	|ИЗ
	|	МатрицаЗависимыхОборотов КАК МатрицаЗависимыхОборотов
	|
	|СГРУППИРОВАТЬ ПО
	|	МатрицаЗависимыхОборотов.НомерСтрокиИсточника,
	|	МатрицаЗависимыхОборотов.Сценарий,
	// При использовании конструктура данная группировка удалится, нужно будет вернуть руками.
	|	&ГруппировкаИзмеренийЗависимыхОборотов,
	|	МатрицаЗависимыхОборотов.Приоритет";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	МатрицаЗависимыхОборотов.НомерСтрокиИсточника КАК НомерСтрокиИсточника,
	|	МатрицаЗависимыхОборотов.Сценарий КАК Сценарий,
	|	&ИзмеренияЗависимыхОборотов КАК ИзмеренияЗависимыхОборотов,
	|	МатрицаЗависимыхОборотов.ПрофильРаспределения КАК ПрофильРаспределения,
	|	МатрицаЗависимыхОборотов.КоэффициентКоличество КАК КоэффициентКоличество,
	|	МатрицаЗависимыхОборотов.КоэффициентСумма КАК КоэффициентСумма,
	|	МатрицаЗависимыхОборотов.РеквизитКоличество КАК РеквизитКоличество,
	|	МатрицаЗависимыхОборотов.РеквизитСумма КАК РеквизитСумма,
	|	МатрицаЗависимыхОборотов.ФункцияКоличество КАК ФункцияКоличество,
	|	МатрицаЗависимыхОборотов.ФункцияСумма КАК ФункцияСумма,
	|	МатрицаЗависимыхОборотов.Регистратор КАК Регистратор,
	|	МатрицаЗависимыхОборотов.НомерСтроки КАК НомерСтроки,
	|	МатрицаЗависимыхОборотов.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ЗависимыеОборотыСрезПоследних
	|ИЗ
	|	МатрицаЗависимыхОборотов КАК МатрицаЗависимыхОборотов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеПериоды КАК ПоследниеПериоды
	|		ПО МатрицаЗависимыхОборотов.НомерСтрокиИсточника = ПоследниеПериоды.НомерСтрокиИсточника
	|			И МатрицаЗависимыхОборотов.Период = ПоследниеПериоды.МаксимальныйПериод
	|			И МатрицаЗависимыхОборотов.Сценарий = ПоследниеПериоды.Сценарий
	|			И МатрицаЗависимыхОборотов.Приоритет = ПоследниеПериоды.Приоритет
	|			И (&УсловиеСоединенияСрезПоследних)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МатрицаЗависимыхОборотов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПоследниеПериоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗависимыеОборотыСрезПоследних.НомерСтрокиИсточника КАК НомерСтрокиИсточника,
	|	МАКСИМУМ(ЗависимыеОборотыСрезПоследних.Приоритет) КАК МаксимальныйПриоритет
	|ПОМЕСТИТЬ ПриоритетныеНастройкиЗависимыхОборотов
	|ИЗ
	|	ЗависимыеОборотыСрезПоследних КАК ЗависимыеОборотыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗависимыеОборотыСрезПоследних.НомерСтрокиИсточника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатрицаЗависимыхОборотов.НомерСтрокиИсточника КАК НомерСтрокиИсточника,
	|	МатрицаЗависимыхОборотов.Сценарий КАК Сценарий,
	|	&ИзмеренияЗависимыхОборотов КАК ИзмеренияЗависимыхОборотов,
	|	МатрицаЗависимыхОборотов.ПрофильРаспределения КАК ПрофильРаспределения,
	|	МатрицаЗависимыхОборотов.КоэффициентКоличество КАК КоэффициентКоличество,
	|	МатрицаЗависимыхОборотов.КоэффициентСумма КАК КоэффициентСумма,
	|	МатрицаЗависимыхОборотов.РеквизитКоличество КАК РеквизитКоличество,
	|	МатрицаЗависимыхОборотов.РеквизитСумма КАК РеквизитСумма,
	|	МатрицаЗависимыхОборотов.ФункцияКоличество КАК ФункцияКоличество,
	|	МатрицаЗависимыхОборотов.ФункцияСумма КАК ФункцияСумма,
	|	МатрицаЗависимыхОборотов.Регистратор КАК Регистратор,
	|	МатрицаЗависимыхОборотов.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ НастройкиЗависимыхОборотов
	|ИЗ
	|	ЗависимыеОборотыСрезПоследних КАК МатрицаЗависимыхОборотов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетныеНастройкиЗависимыхОборотов КАК ПриоритетныеНастройкиЗависимыхОборотов
	|		ПО МатрицаЗависимыхОборотов.НомерСтрокиИсточника = ПриоритетныеНастройкиЗависимыхОборотов.НомерСтрокиИсточника
	|			И МатрицаЗависимыхОборотов.Приоритет = ПриоритетныеНастройкиЗависимыхОборотов.МаксимальныйПриоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЗависимыеОборотыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПриоритетныеНастройкиЗависимыхОборотов";
	
	ТекстВыборкиПолейСоединения = "";
	ШаблонВыборки               = "МатрицаЗависимыхОборотов.%1 КАК %1,
								|	МатрицаЗависимыхОборотов.%1_Зависимый КАК %1_Зависимый,";
	ТекстГруппировкиПолейСоединения = "";
	ШаблонГруппировки               = "МатрицаЗависимыхОборотов.%1,
									|	МатрицаЗависимыхОборотов.%1_Зависимый,";
	ТекстУсловияСоединения      = "";
	ШаблонУсловия               = "			И МатрицаЗависимыхОборотов.%1 = ПоследниеПериоды.%1
								|			И МатрицаЗависимыхОборотов.%1_Зависимый = ПоследниеПериоды.%1_Зависимый";
	Для каждого ПолеСоединения Из ПараметыЗаполнения.ПоляСоединений Цикл
		ИмяПоля       = ПолеСоединения.Ключ;
		ПустоЗначение = ПолеСоединения.Значение;
		Если НЕ ПустаяСтрока(ТекстВыборкиПолейСоединения) Тогда
			ТекстВыборкиПолейСоединения = ТекстВыборкиПолейСоединения + "
											|	";
		КонецЕсли;
		ТекстВыборкиПолейСоединения = ТекстВыборкиПолейСоединения + СтрШаблон(ШаблонВыборки, ИмяПоля);
		
		Если НЕ ПустаяСтрока(ТекстГруппировкиПолейСоединения) Тогда
			ТекстГруппировкиПолейСоединения = ТекстГруппировкиПолейСоединения + "
											|	";
		КонецЕсли;
		ТекстГруппировкиПолейСоединения = ТекстГруппировкиПолейСоединения + СтрШаблон(ШаблонГруппировки, ИмяПоля);
		
		Если НЕ ПустаяСтрока(ТекстУсловияСоединения) Тогда
			ТекстУсловияСоединения = ТекстУсловияСоединения + Символы.ПС;
		КонецЕсли;
		ТекстУсловияСоединения = ТекстУсловияСоединения + СтрШаблон(ШаблонУсловия, ИмяПоля);
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ИзмеренияЗависимыхОборотов КАК ИзмеренияЗависимыхОборотов,",
								ТекстВыборкиПолейСоединения);
								
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ГруппировкаИзмеренийЗависимыхОборотов,",
								ТекстГруппировкиПолейСоединения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И (&УсловиеСоединенияСрезПоследних)", ТекстУсловияСоединения);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция НастройкиЗависимыхОборотов(Запрос, ПараметыЗаполнения)
	
	КолонкиИсточника = ПараметыЗаполнения.ТаблицаИсточник.Колонки;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НастройкиЗависимыхОборотов.НомерСтрокиИсточника КАК НомерСтрокиИсточника,
	|	ВЫБОР
	|		КОГДА &СценарийЗависимый = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
	|			ТОГДА ТаблицаИсточник.Сценарий
	|		ИНАЧЕ &СценарийЗависимый
	|	КОНЕЦ КАК Сценарий,
	|	&ПоляИсточника КАК ПоляИсточника,
	|	&ПоляИзмерений КАК ПоляИзмерений,
	|	НастройкиЗависимыхОборотов.ПрофильРаспределения КАК ПрофильРаспределения,
	|	НастройкиЗависимыхОборотов.КоэффициентКоличество КАК КоэффициентКоличество,
	|	НастройкиЗависимыхОборотов.КоэффициентСумма КАК КоэффициентСумма,
	|	НастройкиЗависимыхОборотов.РеквизитКоличество КАК РеквизитКоличество,
	|	НастройкиЗависимыхОборотов.РеквизитСумма КАК РеквизитСумма,
	|	НастройкиЗависимыхОборотов.ФункцияКоличество КАК ФункцияКоличество,
	|	НастройкиЗависимыхОборотов.ФункцияСумма КАК ФункцияСумма,
	|	НастройкиЗависимыхОборотов.Регистратор КАК Регистратор,
	|	НастройкиЗависимыхОборотов.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ЗависимыеОбороты
	|ИЗ
	|	ТаблицаИсточник КАК ТаблицаИсточник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиЗависимыхОборотов КАК НастройкиЗависимыхОборотов
	|		ПО ТаблицаИсточник.НомерСтроки = НастройкиЗависимыхОборотов.НомерСтрокиИсточника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаИсточник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиЗависимыхОборотов";
	
	ПоляИсточника        = Новый Массив;
	ПереопределяемыеПоля = Новый СписокЗначений;
	ПереопределяемыеПоля.Добавить(ВРег("НомерСтроки"));
	ПереопределяемыеПоля.Добавить(ВРег("Регистратор"));
	ПереопределяемыеПоля.Добавить(ВРег("Сценарий"));
	ШаблонВыборкиИзмерений =
	"ВЫБОР
	|		КОГДА НастройкиЗависимыхОборотов.%1_Зависимый = %2
	|			ТОГДА ТаблицаИсточник.%1
	|		ИНАЧЕ НастройкиЗависимыхОборотов.%1_Зависимый
	|	КОНЕЦ КАК %1,
	|	НастройкиЗависимыхОборотов.%1_Зависимый КАК %1_Зависимый,";
	ТекстВыборкиИзмерений  = "";
	Для каждого ПолеСоединения Из ПараметыЗаполнения.ПоляСоединений Цикл
		ИмяПоля       = ПолеСоединения.Ключ;
		ПустоЗначение = ПолеСоединения.Значение;
		Если НЕ ПустаяСтрока(ТекстВыборкиИзмерений) Тогда
			ТекстВыборкиИзмерений = ТекстВыборкиИзмерений + Символы.ПС + Символы.Таб;
		КонецЕсли;
		ТекстВыборкиИзмерений = ТекстВыборкиИзмерений + СтрШаблон(ШаблонВыборкиИзмерений, ИмяПоля, ПустоЗначение);
		ПереопределяемыеПоля.Добавить(ВРег(ИмяПоля));
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляИзмерений КАК ПоляИзмерений,", ТекстВыборкиИзмерений);
	
	ШаблонВыборкиПолейИсточника = "ТаблицаИсточник.%1 КАК %1,";
	ТекстВыборкиПолейИсточника  = "";
	Для каждого КолонкаИсточника Из КолонкиИсточника Цикл
		ИмяПоля = КолонкаИсточника.Имя;
		Если ПереопределяемыеПоля.НайтиПоЗначению(ВРег(ИмяПоля)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ТекстВыборкиПолейИсточника) Тогда
			ТекстВыборкиПолейИсточника = ТекстВыборкиПолейИсточника + Символы.ПС + Символы.Таб;
		КонецЕсли;
		ТекстВыборкиПолейИсточника = ТекстВыборкиПолейИсточника + СтрШаблон(ШаблонВыборкиПолейИсточника, ИмяПоля);
		ПоляИсточника.Добавить(ИмяПоля);
	КонецЦикла;
	Если КолонкиИсточника.Найти("ИД") <> Неопределено
		И КолонкиИсточника.Найти("ИД_Родитель") = Неопределено Тогда
		ТекстВыборкиПолейИсточника = ТекстВыборкиПолейИсточника + "
									|	ТаблицаИсточник.ИД КАК ИД_Родитель,";
		ПоляИсточника.Добавить("ИД_Родитель");
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляИсточника КАК ПоляИсточника,", ТекстВыборкиПолейИсточника);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗависимыеОбороты.Сценарий КАК Сценарий,
	|	ЗависимыеОбороты.Сценарий.бит_Периодичность КАК ПериодичностьСценария,
	|	&ПоляИсточника КАК ПоляИсточника,
	|	&ПоляИзмерений КАК ПоляИзмерений,
	|	ЗависимыеОбороты.ЦФО КАК ЦФО,
	|	ЗависимыеОбороты.СтатьяОборотов КАК СтатьяОборотов,
	|	ЗависимыеОбороты.ПрофильРаспределения КАК ПрофильРаспределения,
	|	ЗависимыеОбороты.КоэффициентКоличество КАК КоэффициентКоличество,
	|	ЗависимыеОбороты.КоэффициентСумма КАК КоэффициентСумма,
	|	ЗависимыеОбороты.РеквизитКоличество КАК РеквизитКоличество,
	|	ЗависимыеОбороты.РеквизитСумма КАК РеквизитСумма,
	|	ЗависимыеОбороты.ФункцияКоличество КАК ФункцияКоличество,
	|	ЗависимыеОбороты.ФункцияСумма КАК ФункцияСумма,
	|	ЗависимыеОбороты.Регистратор КАК Регистратор,
	|	ЗависимыеОбороты.НомерСтроки КАК НомерСтроки,
	|	ЗависимыеОбороты.НомерСтрокиИсточника КАК НомерСтрокиИсточника
	|ИЗ
	|	ЗависимыеОбороты КАК ЗависимыеОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗависимыеОбороты.НомерСтрокиИсточника";
	
	ШаблонВыборкиПолейИсточника = "ЗависимыеОбороты.%1 КАК %1,";
	ТекстВыборкиПолейИсточника  = "";
	Для каждого ПолеИсточника Из ПоляИсточника Цикл
		Если НЕ ПустаяСтрока(ТекстВыборкиПолейИсточника) Тогда
			ТекстВыборкиПолейИсточника = ТекстВыборкиПолейИсточника + Символы.ПС + Символы.Таб;
		КонецЕсли;
		ТекстВыборкиПолейИсточника = ТекстВыборкиПолейИсточника + СтрШаблон(ШаблонВыборкиПолейИсточника, ПолеИсточника);
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляИсточника КАК ПоляИсточника,", ТекстВыборкиПолейИсточника);
	
	ШаблонВыборкиИзмерений =
	"ВЫБОР
	|		КОГДА ЗависимыеОбороты.СтатьяОборотов.Учет_%1
	|			ТОГДА ЗависимыеОбороты.%1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК %1,
	|	ЗависимыеОбороты.%1_Зависимый КАК %1_Зависимый";
	ТекстВыборкиИзмерений  = "";
	Для каждого ПолеСоединения Из ПараметыЗаполнения.ПоляСоединений Цикл
		ИмяПоля = ПолеСоединения.Ключ;
		Если СтрСравнить(ИмяПоля, "СтатьяОборотов") = 0
			ИЛИ СтрСравнить(ИмяПоля, "ЦФО") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстВыборкиИзмерений) Тогда
			ТекстВыборкиИзмерений = ТекстВыборкиИзмерений + "," + Символы.ПС + Символы.Таб;
		КонецЕсли;
		ТекстВыборкиИзмерений = ТекстВыборкиИзмерений + СтрШаблон(ШаблонВыборкиИзмерений, ИмяПоля);
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляИзмерений КАК ПоляИзмерений", ТекстВыборкиИзмерений);
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Процедура выполняе формирование зависимых оборотов по строке оборотов. 
// Сформированные зависимые обороты записываются в ТаблицуЗначений. Рекурсивный вызов.
// 
// Параметры:
//  ДатаЗаполнения  - Дата.
//  СтрокаТабличнойЧасти - СтрокаТаблицыЗначений.
//  ТаблицаПриемник - ТаблицаЗначений.
//  ИзмеренияБюджетирования   - Структура.
//  СтрПар - Структура.
//  УровеньРекурсии - Число.
// 
Процедура СформироватьЗависимыеОборотыВТаблицу(ДатаЗаполнения, СтрокаТабличнойЧасти,
			КолонкиИсточник, ТаблицаПриемник, ИзмеренияБюджетирования, СтрПар = Неопределено, УровеньРекурсии = 0)

	// Защита от зацикливания
	Если УровеньРекурсии>1000 Тогда
		ТекстСообщения = НСтр("ru='Превышен уровень рекурсии. Проверьте настройки зависимых оборотов на зацикливание.';
		      				  |en='Exceeded the level of recursion. Check the settings dependent on the speed loop.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли; 
	УровеньРекурсии = УровеньРекурсии+1;
	
	КолонкиПриемник = ТаблицаПриемник.Колонки;
	// Получаем имя справочника Сценарии бюджетирования в зависимости от текущего решения.
	ИмяСправочникаСценарии = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();
	
	Сценарий = Справочники[ИмяСправочникаСценарии].ПустаяСсылка();	
	Если ТипЗнч(СтрПар) = Тип("Структура") И СтрПар.Свойство("Сценарий") Тогда
		
		Сценарий = СтрПар.Сценарий;
		
	Иначе	
		
		Если бит_РаботаСКоллекциями.ЕстьКолонка("Сценарий", КолонкиИсточник) Тогда		
			Сценарий = СтрокаТабличнойЧасти.Сценарий;		
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Сценарий) Тогда	
		Возврат;	
	КонецЕсли;

	Периодичность = Сценарий.бит_Периодичность;
	
	// Получим структуру зависимых оборотов для данной строки таблицы оборотов.
	Результат = ВыполнитьЗапросДляФормированияЗависимыхОборотов(ДатаЗаполнения, Сценарий, ИзмеренияБюджетирования, СтрокаТабличнойЧасти);
	Если Результат.Пустой() Тогда	
		Возврат;	
	КонецЕсли; 
	
	НастройкиЗависимыхОборотов = Результат.Выгрузить();
	
	ПроверяемыеПоля = ПодготовитьПроверяемыеПоляЗавОборотов();	
	
	ТекущийПриоритет = 0;
	НастройкиЗависимыхОборотов.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	Для каждого СтрокаНастройки Из НастройкиЗависимыхОборотов Цикл		
		ВычислитьПриоритетСтрокиЗависимыхОборотов(СтрокаТабличнойЧасти, СтрокаНастройки, ПроверяемыеПоля);		
	КонецЦикла; 
	
	НастройкиЗависимыхОборотов.Сортировать("Приоритет УБЫВ");
	ТекущийПриоритет = 0;
	
	Если НастройкиЗависимыхОборотов.Количество() > 0 Тогда	
		ТекущийПриоритет = НастройкиЗависимыхОборотов[0].Приоритет;	
	КонецЕсли;	
	
	// Заполним строки зависимых оборотов
	Для Каждого СтрокаНастройки Из НастройкиЗависимыхОборотов Цикл
		
		// Применяем только строки наивысшего приоритета, например, если совпадает Статья и Проект, 
		// то эта настройка имеет приоритет перед настройкой, когда совпадает только статья.		
		Если НЕ СтрокаНастройки.Приоритет = ТекущийПриоритет Тогда		 
			Продолжить;		 
		КонецЕсли; 		

		НоваяСтрока = ТаблицаПриемник.Добавить();
		Если бит_РаботаСКоллекциями.ЕстьКолонка("Сценарий", КолонкиПриемник) Тогда			 
			НоваяСтрока.Сценарий = Сценарий;			 
		КонецЕсли;  
		НоваяСтрока.Период = СтрокаТабличнойЧасти.Период;
		НоваяСтрока.Валюта = СтрокаТабличнойЧасти.Валюта;
		 
		Если бит_РаботаСКоллекциями.ЕстьКолонка("Измерение", КолонкиПриемник)
			ИЛИ бит_РаботаСКоллекциями.ЕстьКолонка("Измерение", КолонкиИсточник) Тогда		 
			НоваяСтрока.Измерение = СтрокаТабличнойЧасти.Измерение;		 
		КонецЕсли; 
		Если бит_РаботаСКоллекциями.ЕстьКолонка("ИД", КолонкиПриемник)
			ИЛИ бит_РаботаСКоллекциями.ЕстьКолонка("ИД", КолонкиИсточник) Тогда		 
			НоваяСтрока.ИД = СтрокаТабличнойЧасти.ИД;		 
		КонецЕсли; 
		Если бит_РаботаСКоллекциями.ЕстьКолонка("ИД_Родитель", КолонкиПриемник) 
			ИЛИ бит_РаботаСКоллекциями.ЕстьКолонка("ИД", КолонкиИсточник) Тогда		 
			НоваяСтрока.ИД_Родитель = СтрокаТабличнойЧасти.ИД;		 
		КонецЕсли; 
		 
		// Заполним измерения
		ЗависимыеОборотыЗаполнитьИзмерения(ИзмеренияБюджетирования, СтрокаНастройки, СтрокаТабличнойЧасти, НоваяСтрока);

		Если бит_РаботаСКоллекциями.ЕстьКолонка("ЭтоКоэффициент", КолонкиПриемник) Тогда		 
			НоваяСтрока.ЭтоКоэффициент = НоваяСтрока.СтатьяОборотов.ЭтоКоэффициент;		 
		КонецЕсли;		 
		 
		// Заполним показатели
		ЗависимыеОборотыВыполнитьРасчет(СтрокаНастройки, СтрокаТабличнойЧасти, НоваяСтрока);
		 
		Если ЗначениеЗаполнено(СтрокаНастройки.ПрофильРаспределения) Тогда
			МассивСтрок = РаспределитьПоПрофилю(СтрокаНастройки.ПрофильРаспределения,ТаблицаПриемник,НоваяСтрока,Периодичность);
			Для каждого СозданнаяСтрока Из МассивСтрок Цикл
				СформироватьЗависимыеОборотыВТаблицу(ДатаЗаполнения,
				СозданнаяСтрока, КолонкиИсточник, ТаблицаПриемник, ИзмеренияБюджетирования, СтрПар, УровеньРекурсии);
			КонецЦикла; 
		Иначе	

			СформироватьЗависимыеОборотыВТаблицу(ДатаЗаполнения,
			НоваяСтрока, КолонкиИсточник, ТаблицаПриемник, ИзмеренияБюджетирования, СтрПар, УровеньРекурсии);

		КонецЕсли; 

	КонецЦикла; // По выборке структуры зависимых оборотов
	
КонецПроцедуры

// Функция выполняет запрос для формирования зависимых оборотов.
// 
// Параметры:
//  ДатаЗаполнения 			- Дата - дата.
//  Сценарий 				- СправочникСсылка.бит_СценарииПланирования - сценарий.
//  ИзмеренияБюджетирования - Структура - измерения.
//  СтрокаТаблицы 			- СтрокаТабличнойЧасти - СтрокаТаблицыЗначений.
// 
// Возвращаемое значение:
//  РезультатЗапроса.
// 
Функция ВыполнитьЗапросДляФормированияЗависимыхОборотов(ДатаЗаполнения, Сценарий, ИзмеренияБюджетирования, СтрокаТаблицы)

	// Получаем имена справочников в зависимости от текущего решения.
	ИмяСправочникаСценарии = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();
	ИмяСправочникаЦФО 	   = бит_ОбщегоНазначения.ПолучитьИмяСправочникаЦФО();
	ИмяСправочникаПроекты  = бит_ОбщегоНазначения.ПолучитьИмяСправочникаПроекты();
	
	ТекстПоля    = "";
	ТекстУсловия = "";
	
	ПустоеЗначение = Неопределено;
	
	СтруктураПустых = Новый Структура;
	СтруктураПустых.Вставить("Сценарий"		 	   , "ЗНАЧЕНИЕ(Справочник." + ИмяСправочникаСценарии + ".ПустаяСсылка)");	
	СтруктураПустых.Вставить("ЦФО"			 	   , "ЗНАЧЕНИЕ(Справочник." + ИмяСправочникаЦФО + ".ПустаяСсылка)");
	СтруктураПустых.Вставить("Проект"		 	   , "ЗНАЧЕНИЕ(Справочник." + ИмяСправочникаПроекты + ".ПустаяСсылка)");
	СтруктураПустых.Вставить("СтатьяОборотов"	   , "ЗНАЧЕНИЕ(Справочник.бит_СтатьиОборотов.ПустаяСсылка)");
	СтруктураПустых.Вставить("Контрагент"	 	   , "ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)");
	СтруктураПустых.Вставить("ДоговорКонтрагента"  , "ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)");
    // ++ ЕРП 
	СтруктураПустых.Вставить("НоменклатурнаяГруппа", "ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)");
    // -- ЕРП 
	СтруктураПустых.Вставить("БанковскийСчет"	   , "ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)");
	
	Для каждого ТекИзмерение Из Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения Цикл		
		
		ИмяИзмерения = ТекИзмерение.Имя;
		Если ИмяИзмерения = "Валюта"
			ИЛИ ИмяИзмерения = "СценарийЗависимый" Тогда
			Продолжить;		
		КонецЕсли;
		
		// Поля запроса
		ТекстПоля = ТекстПоля + Символы.ПС + "	бит_ЗависимыеОборотыСрезПоследних." + ИмяИзмерения + ",";
		Если ИмяИзмерения <> "Сценарий" Тогда
			ТекстПоля = ТекстПоля + Символы.ПС + "	бит_ЗависимыеОборотыСрезПоследних." + ИмяИзмерения + "_Зависимый,";
		КонецЕсли;
				
		// Условия
		Если Не СтруктураПустых.Свойство(ИмяИзмерения, ПустоеЗначение) Тогда
			ПустоеЗначение = "НЕОПРЕДЕЛЕНО";			
		КонецЕсли;	
		ТекстУсловия = ТекстУсловия + Символы.ПС + ?(ТекстУсловия = "", "				", "				И") 
					   + " (" + ИмяИзмерения + " = &" + ИмяИзмерения + " ИЛИ " + ИмяИзмерения + " = " + ПустоеЗначение + ")";
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|" + ТекстПоля + "
	|	бит_ЗависимыеОборотыСрезПоследних.ПрофильРаспределения,
	|	бит_ЗависимыеОборотыСрезПоследних.КоэффициентКоличество,
	|	бит_ЗависимыеОборотыСрезПоследних.КоэффициентСумма,
	|	бит_ЗависимыеОборотыСрезПоследних.РеквизитКоличество,
	|	бит_ЗависимыеОборотыСрезПоследних.РеквизитСумма,
	|   бит_ЗависимыеОборотыСрезПоследних.ФункцияКоличество,
	|   бит_ЗависимыеОборотыСрезПоследних.ФункцияСумма,
	|   бит_ЗависимыеОборотыСрезПоследних.Регистратор,
	|   бит_ЗависимыеОборотыСрезПоследних.НомерСтроки,
	|	бит_ЗависимыеОборотыСрезПоследних.ДатаОкончания
	|ИЗ
	|	РегистрСведений.бит_ЗависимыеОбороты.СрезПоследних(
	|			&ДатаЗаполнения,
	|			СценарийЗависимый = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
	|			И " + ТекстУсловия + "
	|			) КАК бит_ЗависимыеОборотыСрезПоследних
	|ГДЕ
	|	(бит_ЗависимыеОборотыСрезПоследних.КоэффициентКоличество <> 0
	|			ИЛИ бит_ЗависимыеОборотыСрезПоследних.ФункцияКоличество <> ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеФункции.ПустаяСсылка)
	|			ИЛИ бит_ЗависимыеОборотыСрезПоследних.КоэффициентСумма <> 0
	|			ИЛИ бит_ЗависимыеОборотыСрезПоследних.ФункцияСумма <> ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеФункции.ПустаяСсылка))
	|	И (бит_ЗависимыеОборотыСрезПоследних.РеквизитКоличество <> ЗНАЧЕНИЕ(Перечисление.бит_РеквизитыДляРасчетаЗависимостей.ПустаяСсылка)
	|			ИЛИ бит_ЗависимыеОборотыСрезПоследних.РеквизитСумма <> ЗНАЧЕНИЕ(Перечисление.бит_РеквизитыДляРасчетаЗависимостей.ПустаяСсылка))
	|	И (КонецПериода(бит_ЗависимыеОборотыСрезПоследних.ДатаОкончания,День) >= &ДатаЗаполнения
	|					ИЛИ бит_ЗависимыеОборотыСрезПоследних.ДатаОкончания = &ПустаяДата)
	|";
	
	// Установка параметров запроса			             	
	Запрос.УстановитьПараметр("ПустаяДата"    , Дата('00010101'));
	Запрос.УстановитьПараметр("ДатаЗаполнения", ДатаЗаполнения);
	Запрос.УстановитьПараметр("Сценарий"      , Сценарий);
	
	Для каждого КлючИЗначение Из ИзмеренияБюджетирования Цикл
	
		ИмяИзмерения = КлючИЗначение.Ключ;
		Если ИмяИзмерения = "Сценарий" Тогда		
			Продолжить;		
		КонецЕсли; 
		
		Запрос.УстановитьПараметр(ИмяИзмерения,СтрокаТаблицы[ИмяИзмерения]);
		
	КонецЦикла; 
	
	Результат = Запрос.Выполнить();

	Возврат Результат;
	
КонецФункции

// Функция инициализирует структуру для хранения результатов расчета зависимых оборотов.
// 
// Возвращаемое значение:
//  СтрРасчет - Строка.
// 
Функция КонструкторСтруктураРасчетаРесурса()
	
	СтрРасчет    = Новый Структура("Функция,Коэффициент,ПрофильРаспределения,ИмяРесурса,ИмяРеквизита,Результат,Аргумент");
	
	Возврат СтрРасчет;
	
КонецФункции

// Функция выполняет расчет количества и суммы для зависимых оборотов.
// 
// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса.
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти, СтрокаТаблицыЗначений.
//  НоваяСтрока          - СтрокаТабличнойЧасти, НоваяСтрока.
//  КомментироватьРасчет - Булево.
// 
Функция ЗависимыеОборотыВыполнитьРасчет(Выборка, СтрокаТабличнойЧасти, НоваяСтрока, КомментироватьРасчет = Ложь, Сценарий = Неопределено)
	
	ПарамРасчета = Новый Структура;
	ПарамРасчета.Вставить("Количество",  КонструкторСтруктураРасчетаРесурса());
	ПарамРасчета.Вставить("Сумма",		 КонструкторСтруктураРасчетаРесурса());
	ПарамРасчета.Вставить("Регистратор", Выборка.Регистратор);
	ПарамРасчета.Вставить("НомерСтроки", Выборка.НомерСтроки);
	
	СтатьяОборотов = НоваяСтрока.СтатьяОборотов;
	СвойстваСтатьи = бит_БюджетированиеПовтИспСервер.ПолучитьСвойстваСтатьи(СтатьяОборотов);
	
	Если СвойстваСтатьи.Количественный Тогда
		Если ЗначениеЗаполнено(Выборка.ФункцияКоличество) Тогда
			
			НоваяСтрока.Количество = бит_ОбщегоНазначения.ВыполнитьПользовательскуюФункцию(
										Выборка.ФункцияКоличество,Выборка,СтрокаТабличнойЧасти,НоваяСтрока,Сценарий);
			
			Если КомментироватьРасчет Тогда
				ПарамРасчета.Количество.Результат = НоваяСтрока.Количество;
				ПарамРасчета.Количество.Функция   = Выборка.ФункцияКоличество;
				ПарамРасчета.Количество.ИмяРесурса= "Количество";
				ПарамРасчета.Количество.ПрофильРаспределения = Выборка.ПрофильРаспределения;
			КонецЕсли; 
		ИначеЕсли ЗначениеЗаполнено(Выборка.РеквизитКоличество) Тогда
			
			ИмяРеквизита = бит_ОбщегоНазначения.ПолучитьИмяЗначенияПеречисления(
								Перечисления.бит_РеквизитыДляРасчетаЗависимостей,Выборка.РеквизитКоличество);
			НоваяСтрока.Количество = СтрокаТабличнойЧасти[ИмяРеквизита]*Выборка.КоэффициентКоличество;
			
			Если КомментироватьРасчет Тогда
				ПарамРасчета.Количество.Результат    = НоваяСтрока.Количество;
				ПарамРасчета.Количество.Коэффициент  = Выборка.КоэффициентКоличество;
				ПарамРасчета.Количество.ИмяРеквизита = ИмяРеквизита;			
				ПарамРасчета.Количество.Аргумент     = СтрокаТабличнойЧасти[ИмяРеквизита];
				ПарамРасчета.Количество.ИмяРесурса	 = "Количество";
			    ПарамРасчета.Количество.ПрофильРаспределения = Выборка.ПрофильРаспределения;
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		НоваяСтрока.Количество = 0;
	КонецЕсли;
	
	Если СвойстваСтатьи.Суммовой Тогда
		Если ЗначениеЗаполнено(Выборка.ФункцияСумма) Тогда
			
			НоваяСтрока.Сумма = бит_ОбщегоНазначения.ВыполнитьПользовательскуюФункцию(Выборка.ФункцияСумма,
									Выборка,СтрокаТабличнойЧасти,НоваяСтрока,Сценарий);
			Если КомментироватьРасчет Тогда
				ПарамРасчета.Сумма.Результат = НоваяСтрока.Сумма;
				ПарамРасчета.Сумма.Функция   = Выборка.ФункцияСумма;
				ПарамРасчета.Сумма.ИмяРесурса= "Сумма";
				ПарамРасчета.Сумма.ПрофильРаспределения = Выборка.ПрофильРаспределения;
			КонецЕсли; 
		ИначеЕсли ЗначениеЗаполнено(Выборка.РеквизитСумма) Тогда
			
			ИмяРеквизита = бит_ОбщегоНазначения.ПолучитьИмяЗначенияПеречисления(
							Перечисления.бит_РеквизитыДляРасчетаЗависимостей,Выборка.РеквизитСумма);
			НоваяСтрока.Сумма = СтрокаТабличнойЧасти[ИмяРеквизита]*Выборка.КоэффициентСумма;
			
			Если КомментироватьРасчет Тогда
				ПарамРасчета.Сумма.Результат    = НоваяСтрока.Сумма;
				ПарамРасчета.Сумма.Коэффициент  = Выборка.КоэффициентСумма;
				ПарамРасчета.Сумма.ИмяРеквизита = ИмяРеквизита;
				ПарамРасчета.Сумма.Аргумент     = СтрокаТабличнойЧасти[ИмяРеквизита];
				ПарамРасчета.Сумма.ИмяРесурса	= "Сумма";
				ПарамРасчета.Сумма.ПрофильРаспределения = Выборка.ПрофильРаспределения;
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		НоваяСтрока.Сумма = 0;	
	КонецЕсли;

	Возврат ПарамРасчета;
	
КонецФункции

// Процедура заполняет измерения при формировании зависимых оборотов.
// 
// Параметры:
//  ИзмеренияБюджетирования - Структура.
//  Выборка              - ВыборкаИзРезультатаЗапроса.
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти, СтрокаТаблицыЗначений.
//  НоваяСтрока          - СтрокаТабличнойЧасти, НоваяСтрока.
// 
Процедура ЗависимыеОборотыЗаполнитьИзмерения(ИзмеренияБюджетирования, Выборка, СтрокаТабличнойЧасти, НоваяСтрока)
	
	НоваяСтрока.СтатьяОборотов = Выборка.СтатьяОборотов_Зависимый;
	
	СтатьяОборотов = НоваяСтрока.СтатьяОборотов;
	СвойстваСтатьи = бит_БюджетированиеПовтИспСервер.ПолучитьСвойстваСтатьи(СтатьяОборотов);

	Для каждого КлючИЗначение Из ИзмеренияБюджетирования Цикл
		
		ИмяИзмерения = КлючИЗначение.Ключ;
		ИмяИзмеренияЗависимый = КлючИЗначение.Ключ+"_Зависимый";
		Если ВРег(ИмяИзмерения) = ВРег("Сценарий") Тогда
			Продолжить;
		КонецЕсли; 
		
		ЗначениеИзмерения = СтрокаТабличнойЧасти[ИмяИзмерения];
		ЗначениеЗависимый = Выборка[ИмяИзмеренияЗависимый];
		
		Если ЗначениеЗаполнено(ЗначениеЗависимый)  Тогда
			НоваяСтрока[ИмяИзмерения] = ЗначениеЗависимый;
		Иначе
			НоваяСтрока[ИмяИзмерения] = ЗначениеИзмерения;
		КонецЕсли; 
		
		// Проверка допустимости установки аналитик по статье.
		
		Если ВРег(ИмяИзмерения) = ВРег("ЦФО") ИЛИ ВРег(ИмяИзмерения) = ВРег("СтатьяОборотов") Тогда
			// По цфо учет ведется всегда - реквизита учет_<...> нет.
			Продолжить;
		КонецЕсли; 
		
		ВедетсяУчет = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваСтатьи, ИмяИзмерения, Ложь);
		
		Если НЕ ВедетсяУчет Тогда
			НоваяСтрока[ИмяИзмерения] = Неопределено;
		КонецЕсли;
	КонецЦикла; // По измерениям бюджетирования
	
КонецПроцедуры

// Функция формирует комментарий выполнения расчета зависимых оборотов.
// 
// Параметры:
//  Выборка              - ВыборкаИзРезультатаЗапроса - выборка.
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - СтрокаТаблицыЗначений.
//  НоваяСтрока          - СтрокаТабличнойЧасти - НоваяСтрока.
// 
// Возвращаемое значение:
//  Результат - ТекстХТМЛ.
// 
Функция ЗависимыеОборотыКомментарийРасчета(ПарамРасчета)
	
	ТекстХТМЛ = "";
	
	Если ТипЗнч(ПарамРасчета) = Тип("Структура") Тогда
		
		// Заголовок
		ВремСтрока = НСтр("ru='Комментарий расчета зависимых оборотов';en='Comment to Dependent Turnovers Calculation'");
		ТекстХТМЛ  = "<p><h3>"+ВремСтрока+"</h3></p>";
		
		// Документ установки зависимых оборотов
		ВремСтрока  = НСтр("ru='Выполнен расчет по настройке:';en='Calculated according to configuration:'");
		ТекстСсылки = НСтр("ru = '%1, строка № %2';en='%1, line № %2'");
		ТекстСсылки = СтрШаблон(ТекстСсылки, ПарамРасчета.Регистратор, ПарамРасчета.НомерСтроки);
		Ссылка 		= СтрШаблон("#Документ.бит_УстановкаЗависимыхОборотов/%1/%2", 
							ПарамРасчета.Регистратор.УникальныйИдентификатор(), ПарамРасчета.НомерСтроки);
				 
		ТекстХТМЛ = ТекстХТМЛ+"<p><b><i>"+ВремСтрока+"</i></b><br><a id = ""CalcRef"" href = """+Ссылка+""" >"+ТекстСсылки+"</a><p>";
		
		// Расчет суммы и количества.
		ТекстЗаголовка = НСтр("ru='Расчет суммы:';en='The calculation of the amount of:'");
		ТекстСумма      = ЗависимыеОборотыКомментарийРасчетаРесурса(ПарамРасчета.Сумма, ТекстЗаголовка, "ЧЦ=15; ЧДЦ=2");
		ТекстЗаголовка = НСтр("ru='Расчет количества:';en='Calculating the amount of:'");
		ТекстКоличество = ЗависимыеОборотыКомментарийРасчетаРесурса(ПарамРасчета.Количество, ТекстЗаголовка, "ЧЦ=15; ЧДЦ=3");		
		
		ТекстХТМЛ = ТекстХТМЛ+"<p>";
		ТекстХТМЛ = ТекстХТМЛ+ТекстСумма;
		ТекстХТМЛ = ТекстХТМЛ+ТекстКоличество;
		
		Если ПустаяСтрока(ТекстСумма) И ПустаяСтрока(ТекстКоличество) Тогда
			ТекстХТМЛ = ТекстХТМЛ+НСтр("ru='Расчеты не выполнены.';en='Calculations are not completed.'");
		КонецЕсли; 
		ТекстХТМЛ = ТекстХТМЛ+"</p>"
	КонецЕсли; 
	
	Возврат ТекстХТМЛ;
	
КонецФункции

// Функция выводит комментарий расчета ресурса (суммы или количества).
// 
// Параметры:
//  СтрПар - Структура
//  СтрЗаголовок - Строка
//  СтрФормат    - Строка
// 
// Возвращаемое значение:
//  ТекстХТМЛ - Строка.
// 
Функция ЗависимыеОборотыКомментарийРасчетаРесурса(СтрПар, СтрЗаголовок, СтрФормат)
	
	ТекстХТМЛ = "";
	
	Если ТипЗнч(СтрПар) = Тип("Структура") И ТипЗнч(СтрПар.Результат) = Тип("Число") Тогда
		
		// Выполнялся расчет показателя
		ТекстХТМЛ = ТекстХТМЛ+"<b><i>"+СтрЗаголовок+"</b></i><br>";
		
		Если ЗначениеЗаполнено(СтрПар.ПрофильРаспределения) Тогда
			ТекстПрофильРаспределения		= "*ПрофильРаспределения";
			ТекстПрофильРаспределенияРасчет = "*%ПрофильРаспределения%";
			ТекстРезультат = "%Результат"+СтрПар.ИмяРесурса+"%";
		Иначе
			ТекстПрофильРаспределения		= "";
			ТекстПрофильРаспределенияРасчет = "";
			ТекстРезультат = Формат(СтрПар.Результат,СтрФормат);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрПар.Функция) Тогда
			
			// Расчет выполнялся через пользовательскую функцию.
			ТекстСсылки = Строка(СтрПар.Функция)+"()";
			Ссылка = "#Справочник.бит_ПользовательскиеФункции/"+Строка(СтрПар.Функция.УникальныйИдентификатор());
			
			ТекстХТМЛ = ТекстХТМЛ+ТекстРезультат+" = <a id = ""UserFunction"" href = """+Ссылка+""">"+ТекстСсылки+"</a>"+ТекстПрофильРаспределенияРасчет+"<br>";
			
		Иначе	
			
			// Расчет выполнялся умножением на коэффициент.
			ТекстХТМЛ = ТекстХТМЛ+ТекстРезультат+" = "+СтрПар.Коэффициент+"*"+СтрПар.ИмяРеквизита+ТекстПрофильРаспределения+"<br>";
			ТекстХТМЛ = ТекстХТМЛ+ТекстРезультат+" = "+СтрПар.Коэффициент+"*"+СтрПар.Аргумент+ТекстПрофильРаспределенияРасчет+"<br>";		   
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат ТекстХТМЛ;
	
КонецФункции

// Функция выполняет фильтрацию строк  настроек зависимых оборотов, 
// по которым необходимо выполнять расчет для данной строки оборотов бюджета.
// 
// Параметры:
//  СтрокаТаблицыДокумента - СтрокаТаблицы - строка таблицы.
//  СтрокаЗависимыхОборотов - СтрокаТаблицы - строка оборотов.
//  ПроверяемыеПоля - Структура - поля.
//  ДатаЗаполнения - Булево - Дата.
// 
// Возвращаемое значение:
//  флВыполнено - Булево.
// 
Функция УсловиеНаПоляЗависимыхОборотов(СтрокаТаблицыДокумента, СтрокаЗависимыхОборотов, ПроверяемыеПоля, ДатаЗаполнения)

	Если СтрокаЗависимыхОборотов.Период > ДатаЗаполнения Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Для каждого КиЗ Из ПроверяемыеПоля Цикл
		ИмяПоля = КиЗ.Ключ;
		ПустоеЗначение = КиЗ.Значение;
		
		Если НЕ (СтрокаТаблицыДокумента[ИмяПоля] = СтрокаЗависимыхОборотов[ИмяПоля] 
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаЗависимыхОборотов[ИмяПоля])) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла; 

	Если СтрокаЗависимыхОборотов.КоэффициентКоличество = 0
		И СтрокаЗависимыхОборотов.КоэффициентСумма = 0
		И НЕ ЗначениеЗаполнено(СтрокаЗависимыхОборотов.ФункцияКоличество)
		И НЕ ЗначениеЗаполнено(СтрокаЗависимыхОборотов.ФункцияСумма) Тогда
		Возврат Ложь;
	КонецЕсли; 
		
	Если НЕ ЗначениеЗаполнено(СтрокаЗависимыхОборотов.РеквизитКоличество)
		И НЕ ЗначениеЗаполнено(СтрокаЗависимыхОборотов.РеквизитСумма) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтрокаЗависимыхОборотов.ДатаОкончания)
		И КонецДня(СтрокаЗависимыхОборотов.ДатаОкончания) < ДатаЗаполнения Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Процедура вычисляет приоритет настройки зависимых оборотов.
// 
// Параметры:
//  СтрокаТаблицыДокумента - СтрокаТаблицыЗначений.
//  СтрокаЗависимыхОборотов - СтрокаТаблицыЗначений.
//  ПроверяемыеПоля - Структура.
// 
Процедура ВычислитьПриоритетСтрокиЗависимыхОборотов(СтрокаТаблицыДокумента, СтрокаЗависимыхОборотов, ПроверяемыеПоля)

	Для каждого КиЗ Из ПроверяемыеПоля Цикл
	
		ИмяПоля = КиЗ.Ключ;
		ПустоеЗначение = КиЗ.Значение;
		
		Если СтрокаТаблицыДокумента[ИмяПоля] = СтрокаЗависимыхОборотов[ИмяПоля] 
			  И ЗначениеЗаполнено(СтрокаЗависимыхОборотов[ИмяПоля]) Тогда
		
			СтрокаЗависимыхОборотов.Приоритет = СтрокаЗависимыхОборотов.Приоритет + 1;
		
		КонецЕсли; 
			
	КонецЦикла; 

	ИмяПоля = "СтатьяОборотов";
	Если СтрокаТаблицыДокумента[ИмяПоля] = СтрокаЗависимыхОборотов[ИмяПоля] 
			  И ЗначениеЗаполнено(СтрокаЗависимыхОборотов[ИмяПоля]) Тогда
	
			СтрокаЗависимыхОборотов.Приоритет = СтрокаЗависимыхОборотов.Приоритет + 1;
	
	КонецЕсли; 
	
КонецПроцедуры

// Функция формирует перечень полей по которым будет выполняться проверка приоритета настроек трансляции.
// 
// Возвращаемое значение:
//  ПроверяемыеПоля - Структура.
// 
Функция ПодготовитьПроверяемыеПоляЗавОборотов()

		// Получаем имена справочников в зависимости от текущего решения.
		ИмяСправочникаСценарии = бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования();
		ИмяСправочникаЦФО 	   = бит_ОбщегоНазначения.ПолучитьИмяСправочникаЦФО();
		ИмяСправочникаПроекты  = бит_ОбщегоНазначения.ПолучитьИмяСправочникаПроекты();		
		
		ПроверяемыеПоля = Новый Структура;
		ПроверяемыеПоля.Вставить("ЦФО"			 	   , "ЗНАЧЕНИЕ(Справочник." + ИмяСправочникаЦФО + ".ПустаяСсылка)");
		Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
			
			ПроверяемыеПоля.Вставить("Проект"		 	   , "ЗНАЧЕНИЕ(Справочник." + ИмяСправочникаПроекты + ".ПустаяСсылка)");
			ПроверяемыеПоля.Вставить("Контрагент"	 	   , "ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)");
			ПроверяемыеПоля.Вставить("ДоговорКонтрагента"  , "ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)");
			ПроверяемыеПоля.Вставить("НоменклатурнаяГруппа", "ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)");
			ПроверяемыеПоля.Вставить("БанковскийСчет"	   , "ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)");
			
		КонецЕсли; 
		
		КоличествоДопАналитик = бит_МеханизмДопИзмерений.ПолучитьМаксимальноеКоличествоДополнительныхИзмерений();
		Для Н = 1 По КоличествоДопАналитик Цикл
		
			ПроверяемыеПоля.Вставить("Аналитика_"+н, "Неопределено");
		
		КонецЦикла; 

	Возврат ПроверяемыеПоля;
	
КонецФункции

#КонецОбласти

#Область СинхронизацияСтруктурыПредприятияРеглИЦФО

// Функция выполняет первоначальную синхронизацию подразделений регл и ЦФО.
// 
Процедура ПервоначальнаяСинхронизацияПодразделенийРеглЦФО()
	
	Если Метаданные.Справочники.Найти("ПодразделенияОрганизаций") <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ,
		|	ПодразделенияОрганизаций.Представление";
					   
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		// Синхронизация организаций.
		Выборка = МассивРезультатов[0].Выбрать();		
		Пока Выборка.Следующий() Цикл		
			СинхронизироватьСтруктурнуюЕдиницуРеглЦФО(Выборка.Ссылка);		
		КонецЦикла; 
		
		// Синхронизация подразделений.
		Выборка = МассивРезультатов[1].Выбрать();		
		Пока Выборка.Следующий() Цикл		
			СинхронизироватьСтруктурнуюЕдиницуРеглЦФО(Выборка.Ссылка);		
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СмежностиГрафа

// Возвращает не полный список смежности графа.
// Только связанные формулами ячейки.
// Если ячейка не валяет на расчет последующих значений,
// то она не может образовывать циклы и не заносится в список (например итог).
//
// Параметры:
//  ТабДокДанные - ТабличныйДокумент.
// 
// Возвращаемое значение:
//   Структура - список смежности графа:
//    * Имя области
//    * Значение - Массив - имена зависимых по формуле областей.
//
Функция СписокСмежностиПоискаЦикла(ТабДокДанные)
	
	СписокСмежности = Новый Структура;
	Для каждого Обл Из ТабДокДанные.Области Цикл
		Если Обл.Расшифровка <> Неопределено 
			И (Обл.Расшифровка.Вид = "Формула" ИЛИ  Обл.Расшифровка.Вид = "Значение") Тогда
			
			// Обрабатываем вершины которые учавствуют формулах.
			Для каждого ИмяАргумента Из Обл.Расшифровка.Аргументы Цикл
				Если СписокСмежности.Свойство(ИмяАргумента) Тогда
					СписокСмежности[ИмяАргумента].Добавить(Обл.Имя);
				Иначе	
					СмежныеВершины = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Обл.Имя);
					СписокСмежности.Вставить(ИмяАргумента, СмежныеВершины); 
				КонецЕсли;
			КонецЦикла; // Аргументы формул.
			
		КонецЕсли;
	КонецЦикла; // Области.
	
	Возврат СписокСмежности;
	
КонецФункции

Функция ПоискЦиклаВГлубину(Вершина, СписокСмежности, МаршрутЦикла, СтатусыВершин)
	
	Результат = Ложь;
	МаршрутЦикла.Добавить(Вершина);
	
	СтатусыВершин[Вершина] = Истина; // Вершина на проверке. 
	СмежныеВершины = СписокСмежности[Вершина]; 
	Для каждого СмежнаяВершина Из СмежныеВершины Цикл
		Если СписокСмежности.Свойство(СмежнаяВершина) = Ложь Тогда
			// Достигнут конец маршрута.
			Продолжить;
		ИначеЕсли СтатусыВершин[СмежнаяВершина] = Неопределено Тогда
			// Переход на уровень ниже.
			Результат = ПоискЦиклаВГлубину(СмежнаяВершина, СписокСмежности, МаршрутЦикла, СтатусыВершин);
		ИначеЕсли СтатусыВершин[СмежнаяВершина] = Истина Тогда
			// Найден цикл, возврат к вершине в состоянии проверки.
			МаршрутЦикла.Добавить(СмежнаяВершина);
			Результат = Истина;
		КонецЕсли;
		
		Если Результат = Истина Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат = Ложь Тогда
		// Вершина проверена.
		СтатусыВершин[Вершина] = Ложь;
		МаршрутЦикла.Удалить(МаршрутЦикла.ВГраница());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Процедура синхронизирует справочники, отражающие структуру предприятия и ЦФО.
// 
// Параметры:
//  Источник - СправочникОбъект.
// 
Функция СинхронизироватьСтруктурнуюЕдиницуРеглЦФО(Источник)
	
	СинхрЦФО = НайтиСинхрЦФО(Источник.Ссылка);
	
	МетаИсточник = Источник.Метаданные();
	
	Если НЕ ЗначениеЗаполнено(СинхрЦФО) Тогда		
		// Не удалось найти синхронизированное ЦФО - нужно создать.		
		ЦФООбъект = Справочники.Подразделения.СоздатьЭлемент();
		ЦФООбъект.УстановитьНовыйКод();			
	Иначе		
		// Нашли синхронизированное ЦФО - синхронизируем наименование и пометку удаления.
		ЦФООбъект = СинхрЦФО.ПолучитьОбъект();		
	КонецЕсли; 
	
	ЦФООбъект.Наименование = Источник.Наименование;
	ЦФООбъект.СтруктурнаяЕдиницаРегл = Источник.Ссылка;
	ЦФООбъект.ПометкаУдаления = Источник.ПометкаУдаления;
	
	Если МетаИсточник.Имя = "Организации" Тогда
		
		Если Источник.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда			
			ЦФООбъект.ЯвляетсяЮрЛицом = Истина;			
		КонецЕсли; 
		
	ИначеЕсли МетаИсточник.Имя = "ПодразделенияОрганизаций" Тогда	
		
		Если ЗначениеЗаполнено(Источник.Родитель) Тогда			
			ЦФООбъект.Родитель = НайтиСинхрЦФО(Источник.Родитель);			
		Иначе			
			ЦФООрг = НайтиСинхрЦФО(Источник.Владелец);			
			Если НЕ ЗначениеЗаполнено(ЦФООрг) Тогда			
				ЦФООрг = СинхронизироватьСтруктурнуюЕдиницуРеглЦФО(Источник.Владелец);			
			КонецЕсли; 			
			ЦФООбъект.Родитель = ЦФООрг;			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ЦФООбъект.ДополнительныеСвойства.Вставить("СинхронизацияСПодразделениями", Истина);
	
	Успех = бит_ОбщегоНазначения.ЗаписатьСправочник(ЦФООбъект, "", "Ошибки", Истина);
	
	Если Успех Тогда
		ЗаписатьСоответствиеЦФОПодразделение(Источник.Ссылка, ЦФООбъект.Ссылка);
	КонецЕсли;
	
	Возврат ЦФООбъект.Ссылка;
	
КонецФункции

Процедура ЗаписатьСоответствиеЦФОПодразделение(Подразделение, ЦФО)
	
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
	
КонецПроцедуры

Функция ПараметрыУчета()
	
	ПараметрыУчета = Новый Структура;
	ПоляУчета = Новый Структура;

	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ПоляУчета.Вставить("Аналитика_1",	"Контрагент");
		ПоляУчета.Вставить("Аналитика_2",	"ДоговорКонтрагента");
		ПоляУчета.Вставить("Аналитика_3",	"Проект");
		ПоляУчета.Вставить("Аналитика_4",	"НоменклатурнаяГруппа");
		ПоляУчета.Вставить("Аналитика_5",	"БанковскийСчет");
		ПоляУчета.Вставить("Аналитика_6",	"Аналитика_1");
		ПоляУчета.Вставить("Аналитика_7",	"Аналитика_2");
		ПоляУчета.Вставить("Аналитика_8",	"Аналитика_3");
		ПоляУчета.Вставить("Аналитика_9",	"Аналитика_4");
		ПоляУчета.Вставить("Аналитика_10",	"Аналитика_5");
		ПоляУчета.Вставить("Аналитика_11",	"Аналитика_6");
		ПоляУчета.Вставить("Аналитика_12",	"Аналитика_7");
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СтатьиОборотов.Ссылка КАК СтатьяОборотов,
		|	СтатьиОборотов.Учет_Количество КАК Количество,
		|	СтатьиОборотов.Учет_Сумма КАК Сумма,
		|	СтатьиОборотов.Учет_Контрагент КАК Контрагент,
		|	СтатьиОборотов.Учет_ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СтатьиОборотов.Учет_Проект КАК Проект,
		|	СтатьиОборотов.Учет_НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	СтатьиОборотов.Учет_БанковскийСчет КАК БанковскийСчет,
		|	СтатьиОборотов.Учет_Аналитика_1 КАК Аналитика_1,
		|	СтатьиОборотов.Учет_Аналитика_2 КАК Аналитика_2,
		|	СтатьиОборотов.Учет_Аналитика_3 КАК Аналитика_3,
		|	СтатьиОборотов.Учет_Аналитика_4 КАК Аналитика_4,
		|	СтатьиОборотов.Учет_Аналитика_5 КАК Аналитика_5,
		|	СтатьиОборотов.Учет_Аналитика_6 КАК Аналитика_6,
		|	СтатьиОборотов.Учет_Аналитика_7 КАК Аналитика_7
		|ИЗ
		|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
		|ГДЕ
		|	СтатьиОборотов.Ссылка В(&СтатьиОборотов)";
	Иначе
		ПоляУчета.Вставить("Аналитика_1",	"Аналитика_1");
		ПоляУчета.Вставить("Аналитика_2",	"Аналитика_2");
		ПоляУчета.Вставить("Аналитика_3",	"Аналитика_3");
		ПоляУчета.Вставить("Аналитика_4",	"Аналитика_4");
		ПоляУчета.Вставить("Аналитика_5",	"Аналитика_5");
		ПоляУчета.Вставить("Аналитика_6",	"Аналитика_6");
		ПоляУчета.Вставить("Аналитика_7",	"Аналитика_7");
		ПоляУчета.Вставить("Аналитика_8",	"Аналитика_8");
		ПоляУчета.Вставить("Аналитика_9",	"Аналитика_9");
		ПоляУчета.Вставить("Аналитика_10",	"Аналитика_10");
		ПоляУчета.Вставить("Аналитика_11",	"Аналитика_11");
		ПоляУчета.Вставить("Аналитика_12",	"Аналитика_12");
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СтатьиОборотов.Ссылка КАК СтатьяОборотов,
		|	СтатьиОборотов.Учет_Количество КАК Количество,
		|	СтатьиОборотов.Учет_Сумма КАК Сумма,
		|	СтатьиОборотов.Учет_Аналитика_1 КАК Аналитика_1,
		|	СтатьиОборотов.Учет_Аналитика_2 КАК Аналитика_2,
		|	СтатьиОборотов.Учет_Аналитика_3 КАК Аналитика_3,
		|	СтатьиОборотов.Учет_Аналитика_4 КАК Аналитика_4,
		|	СтатьиОборотов.Учет_Аналитика_5 КАК Аналитика_5,
		|	СтатьиОборотов.Учет_Аналитика_6 КАК Аналитика_6,
		|	СтатьиОборотов.Учет_Аналитика_7 КАК Аналитика_7,
		|	СтатьиОборотов.Учет_Аналитика_8 КАК Аналитика_8,
		|	СтатьиОборотов.Учет_Аналитика_9 КАК Аналитика_9,
		|	СтатьиОборотов.Учет_Аналитика_10 КАК Аналитика_10,
		|	СтатьиОборотов.Учет_Аналитика_11 КАК Аналитика_11,
		|	СтатьиОборотов.Учет_Аналитика_12 КАК Аналитика_12
		|ИЗ
		|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
		|ГДЕ
		|	СтатьиОборотов.Ссылка В(&СтатьиОборотов)";
	КонецЕсли;
	
	ПараметрыУчета.Вставить("ПоляУчета",	ПоляУчета);
	ПараметрыУчета.Вставить("ТекстЗапроса",	ТекстЗапроса);
	
	Возврат ПараметрыУчета;
	
КонецФункции

// Функция выполняет поиск ЦФО, синхронизированного с регл. подразделением/организацией.
// 
// Параметры:
//   ИсточникСсылка - СправочникСсылка.
// 
// Возвращаемое значение:
//  СинхрЦФО - СправочникСсылка.Подразделения, Неопределено.
// 
Функция НайтиСинхрЦФО(ИсточникСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиницаРегл", ИсточникСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Подразделения.Ссылка
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|ГДЕ
	|	Подразделения.СтруктурнаяЕдиницаРегл = &СтруктурнаяЕдиницаРегл";
	
	Результат = Запрос.Выполнить();				
	Выборка = Результат.Выбрать();
	СинхрЦФО = Неопределено;
	Если Выборка.Следующий() Тогда
		СинхрЦФО = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат СинхрЦФО;
	
КонецФункции

Процедура ПересчитатьЦеныНоменклатурыТЧ(ТаблицаДанных, ПараметрыРасчетаЦен)
	
	АнализируемыеПоля = Новый СписокЗначений;
	АнализируемыеПоля.Добавить("НомерСтроки");
	АнализируемыеПоля.Добавить("Период");
	АнализируемыеПоля.Добавить("СтатьяОборотов");
	АнализируемыеПоля.Добавить("Сумма");
	АнализируемыеПоля.Добавить("Норма");
	АнализируемыеПоля.Добавить(ПараметрыРасчетаЦен.АналитикаНоменклатуры);
	
	ШаблонВыбораПоля   = "ТаблицаДанных.%1 КАК %1,";
	ДополнительныеПоля = Новый Массив; // Колонки таблицы, не участвуемые непосредственно в обработке данных.
	Для каждого КолонкаТаблицыИсточника Из ТаблицаДанных.Колонки Цикл
		ИмяКолонки = КолонкаТаблицыИсточника.Имя;
		Если АнализируемыеПоля.НайтиПоЗначению(ИмяКолонки) = Неопределено Тогда
			ДополнительныеПоля.Добавить(ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Виртуализация таблицы источника.
	ТекстЗапроса = "ВЫБРАТЬ";
	Для каждого ДопПоле Из ДополнительныеПоля Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + СтрШаблон(ШаблонВыбораПоля, ДопПоле);
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|	ТаблицаДанных.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанных.Период КАК ПериодСтрокиИсточника,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаДанных.Сумма КАК Сумма,
	|	ТаблицаДанных.Норма КАК Норма
	|ПОМЕСТИТЬ ТаблицаДанных
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаДанных.Номенклатура", "ТаблицаДанных." + ПараметрыРасчетаЦен.АналитикаНоменклатуры);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.Выполнить();
	
	// Расчет цен номенклатуры.
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДанных.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанных.ПериодСтрокиИсточника КАК ПериодСтрокиИсточника,
	|	ВЫРАЗИТЬ(ТаблицаДанных.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ ЗаполняемыеПозиции
	|ИЗ
	|	ТаблицаДанных КАК ТаблицаДанных
	|ГДЕ
	|	ТаблицаДанных.СтатьяОборотов.Учет_Сумма
	|	И ТаблицаДанных.СтатьяОборотов.Учет_Количество
	|	И НЕ ТаблицаДанных.Номенклатура В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	И (НЕ &ТолькоНулевыеСуммы
	|			ИЛИ ТаблицаДанных.Сумма = 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ПериодСтрокиИсточника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаполняемыеПозиции.ПериодСтрокиИсточника КАК ПериодСтрокиИсточника,
	|	ЗаполняемыеПозиции.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатуры.Валюта КАК Валюта,
	|	ЦеныНоменклатуры.Период КАК ПериодУстановкиЦены,
	|	ЦеныНоменклатуры.Цена КАК Цена
	|ПОМЕСТИТЬ МатрицаЦенообразования
	|ИЗ
	|	ЗаполняемыеПозиции КАК ЗаполняемыеПозиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ЗаполняемыеПозиции.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И (ЦеныНоменклатуры.ТипЦен = &ТипЦен)
	|			И ЗаполняемыеПозиции.ПериодСтрокиИсточника >= ЦеныНоменклатуры.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатрицаЦенообразования.ПериодСтрокиИсточника КАК ПериодСтрокиИсточника,
	|	МатрицаЦенообразования.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(МатрицаЦенообразования.ПериодУстановкиЦены) КАК ПериодПоследнейУстановкиЦены
	|ПОМЕСТИТЬ ДатыПоследнихУстановокЦен
	|ИЗ
	|	МатрицаЦенообразования КАК МатрицаЦенообразования
	|
	|СГРУППИРОВАТЬ ПО
	|	МатрицаЦенообразования.ПериодСтрокиИсточника,
	|	МатрицаЦенообразования.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыПоследнихУстановокЦен.ПериодСтрокиИсточника КАК ПериодСтрокиИсточника,
	|	ДатыПоследнихУстановокЦен.Номенклатура КАК Номенклатура,
	|	МатрицаЦенообразования.Валюта КАК Валюта,
	|	МатрицаЦенообразования.Цена КАК Цена
	|ПОМЕСТИТЬ АктуальныеЦеныНаДаты
	|ИЗ
	|	ДатыПоследнихУстановокЦен КАК ДатыПоследнихУстановокЦен
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МатрицаЦенообразования КАК МатрицаЦенообразования
	|		ПО ДатыПоследнихУстановокЦен.Номенклатура = МатрицаЦенообразования.Номенклатура
	|			И ДатыПоследнихУстановокЦен.ПериодСтрокиИсточника = МатрицаЦенообразования.ПериодСтрокиИсточника
	|			И ДатыПоследнихУстановокЦен.ПериодПоследнейУстановкиЦены = МатрицаЦенообразования.ПериодУстановкиЦены
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ПериодСтрокиИсточника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МатрицаЦенообразования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДатыПоследнихУстановокЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаполняемыеПозиции.НомерСтроки КАК НомерСтроки,
	|	АктуальныеЦеныНаДаты.Цена * ВЫБОР
	|		КОГДА АктуальныеЦеныНаДаты.Валюта = &ВалютаДокумента
	|			ТОГДА 1
	|		КОГДА КурсыВалют.Валюта ЕСТЬ NULL
	|				ИЛИ &КурсДокумента = 0
	|				ИЛИ &КратностьДокумента = 0
	|				ИЛИ КурсыВалют.Курс = 0
	|				ИЛИ КурсыВалют.Кратность = 0
	|			ТОГДА 0
	|		ИНАЧЕ КурсыВалют.Курс * &КратностьДокумента / (&КурсДокумента * КурсыВалют.Кратность)
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ЦеныСтрокИсточника
	|ИЗ
	|	АктуальныеЦеныНаДаты КАК АктуальныеЦеныНаДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаполняемыеПозиции КАК ЗаполняемыеПозиции
	|		ПО АктуальныеЦеныНаДаты.Номенклатура = ЗаполняемыеПозиции.Номенклатура
	|			И АктуальныеЦеныНаДаты.ПериодСтрокиИсточника = ЗаполняемыеПозиции.ПериодСтрокиИсточника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалют
	|		ПО АктуальныеЦеныНаДаты.Валюта = КурсыВалют.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ АктуальныеЦеныНаДаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЗаполняемыеПозиции";
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() + "	ВЫБРАТЬ";
	Для каждого ДопПоле Из ДополнительныеПоля Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + СтрШаблон(ШаблонВыбораПоля, ДопПоле);
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|	ТаблицаДанных.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанных.ПериодСтрокиИсточника КАК Период,
	|	ТаблицаДанных.Номенклатура КАК " + ПараметрыРасчетаЦен.АналитикаНоменклатуры + ",
	|	ТаблицаДанных.СтатьяОборотов КАК СтатьяОборотов,
	|	ВЫБОР
	|		КОГДА ЦеныСтрокИсточника.НомерСтроки ЕСТЬ NULL
	|			ИЛИ ЦеныСтрокИсточника.Цена = 0
	|			ТОГДА ТаблицаДанных.Сумма
	|		ИНАЧЕ ЦеныСтрокИсточника.Цена * ТаблицаДанных.Количество
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЦеныСтрокИсточника.НомерСтроки ЕСТЬ NULL
	|			ТОГДА ТаблицаДанных.Норма
	|		ИНАЧЕ ЦеныСтрокИсточника.Цена
	|	КОНЕЦ КАК Норма
	|ИЗ
	|	ТаблицаДанных КАК ТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСтрокИсточника КАК ЦеныСтрокИсточника
	|		ПО ТаблицаДанных.НомерСтроки = ЦеныСтрокИсточника.НомерСтроки
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Если бит_ОбщегоНазначенияПовтИсп.ЭтоСемействоERP() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЦеныНоменклатуры.ТипЦен", "ЦеныНоменклатуры.ВидЦены");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТипЦен"            , ПараметрыРасчетаЦен.ТипЦен);
	Запрос.УстановитьПараметр("ТолькоНулевыеСуммы", ПараметрыРасчетаЦен.ТолькоНулевыеСуммы);
	Запрос.УстановитьПараметр("ВалютаДокумента"   , ПараметрыРасчетаЦен.СтруктураКурсаДокумента.Валюта);
	Запрос.УстановитьПараметр("КурсДокумента"     , ПараметрыРасчетаЦен.СтруктураКурсаДокумента.Курс);
	Запрос.УстановитьПараметр("КратностьДокумента", ПараметрыРасчетаЦен.СтруктураКурсаДокумента.Кратность);
	Запрос.УстановитьПараметр("ДатаДокумента"     , ПараметрыРасчетаЦен.ДатаДокумента);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура ИнициализироватьКлючиАналитик(Запрос)

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсхожныеДанные.Сценарий КАК Сценарий,
	|	ИсхожныеДанные.ЦФО КАК ЦФО
	|ПОМЕСТИТЬ УникальныеКомбинации
	|ИЗ
	|	ИсхожныеДанные КАК ИсхожныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсхожныеДанные.Сценарий,
	|	ИсхожныеДанные.ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УникальныеКомбинации.Сценарий КАК Сценарий,
	|	УникальныеКомбинации.ЦФО КАК ЦФО,
	|	КлючиАналитик.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	УникальныеКомбинации КАК УникальныеКомбинации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_АналитикаСценарийЦФО КАК КлючиАналитик
	|		ПО УникальныеКомбинации.Сценарий = КлючиАналитик.Сценарий
	|			И УникальныеКомбинации.ЦФО = КлючиАналитик.ЦФО
	|ГДЕ
	|	КлючиАналитик.КлючАналитики ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Справочники.бит_КлючиСценарийЦФО.КлючиСценарийЦФОДокумента(Выборка);
	КонецЦикла;
	
КонецПроцедуры

// Формирует и устанавливает формулу для вычисления итогов по колонкам периодов.
// 
// Параметры:
//  Расшифровка - Структура
//  ИмяЯчейки - Строка
//  Аргументы - Массив.
// 
Функция УстановитьФормулуИтоговПоПериодам(Расшифровка,ТекОписание,Аргументы) 
	
	СтрФормула = "";
	СтрокиФормулы = Новый Массив(); 
	Арг = Новый Массив;
	
	флЭтоОбщийИтог = Найти(ТекОписание.ИмяСумма, "Итог") > 0 ИЛИ Найти(ТекОписание.ИмяКоличество, "Итог") > 0;
	СтрНачПериода = Формат(ТекОписание.Период, "ДФ=yyyyMMdd");
	СтрКонПериода = Формат(ТекОписание.КонецПериода, "ДФ=yyyyMMdd");
	
	Для каждого ИмяАрг Из Аргументы Цикл
		СтрПериод = Сред(ИмяАрг,4,8);
		Если флЭтоОбщийИтог Тогда
			флДобавлять = Истина;
		ИначеЕсли ТекОписание.ЭтоНарастающийИтог Тогда
			флДобавлять = СтрПериод < СтрКонПериода;
		Иначе	
			// BF-1692 Изменение кода. Начало. 28.11.2017{{
			флДобавлять = СтрПериод >= СтрНачПериода И СтрПериод <= СтрКонПериода; 
			// Изменение кода. Конец. 28.11.2017}}
		КонецЕсли; 
		
		Если флДобавлять Тогда
			СтрокиФормулы.Добавить("["+ИмяАрг+"]");	
			Арг.Добавить(ИмяАрг);
		КонецЕсли; 
		
	КонецЦикла; // Аргументы.
	СтрФормула = СтрСоединить(СтрокиФормулы, " + ");
	
	
	Расшифровка.Формула = СтрФормула;
	Расшифровка.Аргументы = Арг;
	
КонецФункции

Функция ФиксироватьБюджет()
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьФиксациюБюджета") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РазрешеноИзменятьЗафиксированныйБюджет = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(
												Пользователи.ТекущийПользователь(), 
												ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноИзменятьЗафиксированныйБюджет);
	Если РазрешеноИзменятьЗафиксированныйБюджет = Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти