
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ1.8] [ASHolyavko@1cbit.ru] [02.07.2025] +        
	
	Если ЭтаФорма.Элементы.Найти("бит_КодВРЦ") = Неопределено Тогда             
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_КодВРЦ", Тип("ПолеФормы"), ЭтаФорма.Элементы.СтраницаОсновное, ЭтаФорма.Элементы.Наименование);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_КодВРЦ";
	КонецЕсли;

	Если ЭтаФорма.Элементы.Найти("бит_ОсновноеКоличествоХодов") = Неопределено Тогда             
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ОсновноеКоличествоХодов", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаПараметрыИнтервальногоПланирования);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_ОсновноеКоличествоХодов";
	КонецЕсли;
	
	Если ЭтаФорма.Элементы.Найти("бит_ПроцентНадбавкиЗаРаботуНВО") = Неопределено Тогда             
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ПроцентНадбавкиЗаРаботуНВО", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаПараметрыИнтервальногоПланирования);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_ПроцентНадбавкиЗаРаботуНВО";
	КонецЕсли;
	
	Если ЭтаФорма.Элементы.Найти("бит_КоэффициентЗаУсловияТруда") = Неопределено Тогда             
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_КоэффициентЗаУсловияТруда", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаПараметрыИнтервальногоПланирования);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_КоэффициентЗаУсловияТруда";
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ1.8] [ASHolyavko@1cbit.ru] [02.07.2025] -
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.66] [ASHolyavko@1cbit.ru] [30.03.2026] +        
	
	Если ЭтаФорма.Элементы.Найти("бит_КраткоеНаименование") = Неопределено Тогда             
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_КраткоеНаименование", Тип("ПолеФормы"), ЭтаФорма.Элементы.СтраницаОсновное, ЭтаФорма.Элементы.Наименование);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_КраткоеНаименование";
	КонецЕсли; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.66] [ASHolyavko@1cbit.ru] [30.03.2026] -
	
	
КонецПроцедуры

&НаСервере
Процедура бит_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПризнакиВРЦДляОТиЗ.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	бит_ПризнакиВРЦДляОТиЗ.ПризнакОТиЗ КАК ПризнакОТиЗ,
		|	бит_ПризнакиВРЦДляОТиЗ.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.бит_ПризнакиВРЦДляОТиЗ КАК бит_ПризнакиВРЦДляОТиЗ
		|ГДЕ
		|	бит_ПризнакиВРЦДляОТиЗ.ПризнакОТиЗ = ЗНАЧЕНИЕ(Перечисление.бит_ТипыПризнаковДляОТиЗ.ОсновноеКоличествоХодов)
		|	И бит_ПризнакиВРЦДляОТиЗ.ВидРабочегоЦентра = &ВидРабочегоЦентра";

	Запрос.УстановитьПараметр("ВидРабочегоЦентра", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НоваяЗапись = РегистрыСведений.бит_ПризнакиВРЦДляОТиЗ.СоздатьМенеджерЗаписи();
		НоваяЗапись.ВидРабочегоЦентра = Объект.Ссылка;
		НоваяЗапись.ПризнакОТиЗ = Перечисления.бит_ТипыПризнаковДляОТиЗ.ОсновноеКоличествоХодов;
		НоваяЗапись.Значение = Объект.бит_ОсновноеКоличествоХодов;
		НоваяЗапись.Записать(Истина);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Значение <> Объект.бит_ОсновноеКоличествоХодов Тогда
			НоваяЗапись = РегистрыСведений.бит_ПризнакиВРЦДляОТиЗ.СоздатьМенеджерЗаписи();
			НоваяЗапись.ВидРабочегоЦентра = ВыборкаДетальныеЗаписи.ВидРабочегоЦентра;
			НоваяЗапись.ПризнакОТиЗ = Перечисления.бит_ТипыПризнаковДляОТиЗ.ОсновноеКоличествоХодов;
			НоваяЗапись.Значение = Объект.бит_ОсновноеКоличествоХодов;
			НоваяЗапись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры
