#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	Если бит_PowerBIВызовСервера.ПолучитьЛицензиюPowerBI() = Ложь Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПредставлениеОбъекта", "Выгрузить модель Power BI (*.pbit) для FTP или локального каталога");
		ОткрытьФорму("Обработка.бит_ПанельУправленияPowerBI.Форма.ПредупреждениеСистемыЛицензирования", ПараметрыФормы);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМакетаМоделиОтчета","МодельОтчетаFTPЛокальныйКаталог");
	ОткрытьФорму("Обработка.бит_ПанельУправленияPowerBI.Форма.ФормаВыгрузкиМодели", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, , ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
