
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.СвойстваОбъекта) <> Тип("Структура") Тогда
		ТекстСообщения = НСтр("ru = 'Непосредственное открытие этой формы не предусмотрено.';
							|en = 'You can''t open this form directly.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СвойстваОбъекта);
	
	НовыеНастройки = Документы.бит_кзн_РеестрПлатежей.НовыеНастройкиФормыДокумента();
	Если НЕ ЗначениеЗаполнено(РежимТабло) Тогда
		РежимТабло = НовыеНастройки.РежимТабло;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РежимЗаписиРасчетыЧерезБанк) Тогда
		РежимЗаписиРасчетыЧерезБанк = НовыеНастройки.РежимЗаписиРасчетыЧерезБанк;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РежимЗаписиРасчетыЧерезКассу) Тогда
		РежимЗаписиРасчетыЧерезКассу = НовыеНастройки.РежимЗаписиРасчетыЧерезКассу;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПрограммноеЗакрытие = Не Модифицированность;
	
	ТекстПредупреждения = НСтр("ru = 'Настройки были изменены. Закрыть без сохранения?';
								|en = 'Settings were changed. Close without saving?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтказеОтЗакрытияФормы", ЭтотОбъект); 
	
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(ЭтотОбъект,
		Отказ, ЗавершениеРаботы, ТекстПредупреждения, "ПрограммноеЗакрытие", ОписаниеОповещения);
	
КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//	
&НаКлиенте
Процедура ПриОтказеОтЗакрытияФормы(Результат, ВходящийКонтекст) Экспорт
	
	Модифицированность = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Модифицированность = Ложь;
  
	Закрыть(СохранитьНастройки());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СохранитьНастройки() 
	
	Настройки = Документы.бит_кзн_РеестрПлатежей.НовыеНастройкиФормыДокумента();
	ЗаполнитьЗначенияСвойств(Настройки, ЭтотОбъект);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиПользователя","НастройкиРеестраПлатежей", Настройки);
	Возврат Настройки;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции