#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль("РассчитатьИтогиПоСтрокеПротокола")
Процедура бит_РассчитатьИтогиПоСтрокеПротокола(Объект, ЗаписьПротокола)

	Событие             = ЗаписьПротокола.Событие;
	Количество          = ЗаписьПротокола.Количество;

	ПредыдущееСостояние = ЗаписьПротокола.ПредыдущееСостояние;
	НовоеСостояние      = "";

	Итоги = ОперативныйУчетПроизводстваКлиентСервер.СтруктураИтоговКонструктор(Объект);
		
	#Удаление // {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] +        
	
	Если Количество > Итоги[ЗаписьПротокола.ПредыдущееСостояние] Тогда
		ВызватьИсключение СтрШаблон("Превышено доступное количество в реквизите ""%1""", ПредыдущееСостояние);
	КонецЕсли; 
	
	#КонецУдаления // }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] -
	
	Если Событие = Перечисления.СобытияПротоколаПроизводственнойОперации.Выполнение Тогда

		Если ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольВыполненияОпераций")
			И Объект.Контроль = Перечисления.ВариантыКонтроляТехнологическихОпераций.Требуется Тогда
			НовоеСостояние = "КоличествоНаКонтроле";
		Иначе
			НовоеСостояние = "КоличествоФакт";
		КонецЕсли;

	ИначеЕсли Событие = Перечисления.СобытияПротоколаПроизводственнойОперации.Контроль Тогда

		НовоеСостояние = "КоличествоФакт";

	ИначеЕсли Событие = Перечисления.СобытияПротоколаПроизводственнойОперации.ОтправкаНаДоработку Тогда

		НовоеСостояние = "КоличествоНаДоработке";

	ИначеЕсли Событие = Перечисления.СобытияПротоколаПроизводственнойОперации.ПредъявлениеККонтролю Тогда

		НовоеСостояние = "КоличествоНаКонтроле";

		Объект.ПовторныйКонтроль = Истина;

	ИначеЕсли Событие = Перечисления.СобытияПротоколаПроизводственнойОперации.Брак Тогда

		НовоеСостояние = "КоличествоБрак";

	ИначеЕсли Событие = Перечисления.СобытияПротоколаПроизводственнойОперации.Отмена Тогда

		НовоеСостояние = "КоличествоОтменено";

	ИначеЕсли Событие = Перечисления.СобытияПротоколаПроизводственнойОперации.Аннулирование Тогда

		НовоеСостояние = "КоличествоКВыполнению";

	КонецЕсли;

	Итоги[ПредыдущееСостояние] = Итоги[ЗаписьПротокола.ПредыдущееСостояние] - Количество;
	Итоги[НовоеСостояние]      = Итоги[НовоеСостояние] + Количество;

	ЗаполнитьЗначенияСвойств(Объект, Итоги);

КонецПроцедуры

//Номенклатура/Оборудование/Тип_Операции/Бит_Расчитываемое_Количество_Ходов
Функция ПолучитьВидРаботПоОтбор(СтруктураОтбора) Экспорт 
		
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] +        
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРаботСотрудников.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыРаботСотрудников КАК ВидыРаботСотрудников
		|ГДЕ
		|	ВидыРаботСотрудников.бит_Номенклатура = &бит_Номенклатура
		|	И ВидыРаботСотрудников.бит_КодВРЦ = &бит_КодВРЦ
		|	И ВидыРаботСотрудников.бит_КодОперации = &бит_КодОперации
		|	И ВидыРаботСотрудников.бит_РассчитываемоеКоличествоХодов = &бит_РассчитываемоеКоличествоХодов";
	
	Запрос.УстановитьПараметр("бит_КодВРЦ", СтруктураОтбора.КодВРЦ);
	Запрос.УстановитьПараметр("бит_КодОперации", СтруктураОтбора.КодОперации);
	Запрос.УстановитьПараметр("бит_Номенклатура", СтруктураОтбора.Номенклатура);
	Запрос.УстановитьПараметр("бит_РассчитываемоеКоличествоХодов", СтруктураОтбора.РассчитываемоеКоличествоХодов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [21.11.2025] -
		
КонецФункции

&После("ДобавитьКомандыПечати")
Процедура бит_ДобавитьКомандыПечати(КомандыПечати)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.8.1]  [VUVaynula@1cbit.ru] [01.02.2026 21:35:29] +        
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_ЯрлыкПолуфабрикатов";
	КомандаПечати.Представление = НСтр("ru = '(бит) Ярлык полуфабрикатов'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.8.1]  [VUVaynula@1cbit.ru] [01.02.2026 21:35:29] -
КонецПроцедуры


&После("Печать")
Процедура бит_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.8.1]  [VUVaynula@1cbit.ru] [01.02.2026 21:37:07] +        
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "бит_ЯрлыкПолуфабрикатов");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Ярлык полуфабрикатов'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"бит_ЯрлыкПолуфабрикатов", 
		Заголовок,
		бит_СформироватьПечатнуюФормуЯрлыкПолуфабрикатов(МассивОбъектов),
		,
		"Документ.ПроизводственнаяОперация2_2.ПФ_MXL_бит_ЯрлыкПолуфабрикатов");
		
	КонецЕсли; 
	// }}ПервыйБИТ ЛистТребований [ЛТ5.8.1]  [VUVaynula@1cbit.ru] [01.02.2026 21:37:07] -
КонецПроцедуры

Функция бит_СформироватьПечатнуюФормуЯрлыкПолуфабрикатов(МассивОбъектов)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.8.1]  [VUVaynula@1cbit.ru] [01.02.2026 21:38:24] +   
	УстановитьПривилегированныйРежим(Истина);  
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;	
	ТабличныйДокумент.КлючПараметровПечати = "бит_ЯрлыкПолуфабрикатов";
	ТабличныйДокумент.ТолькоПросмотр = Ложь;
	
	Макет = ПолучитьМакет("ПФ_MXL_бит_ЯрлыкПолуфабрикатов");
	
	Для сч = 0 По МассивОбъектов.ВГраница() Цикл
		
		ТекОбъект = МассивОбъектов[сч];
		Если сч > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("НаименованиеОперации"	, ТекОбъект.Наименование);
		СтруктураЗаполнения.Вставить("Цех"					, НайтиВышестоящийЦех(ТекОбъект));
		СтруктураЗаполнения.Вставить("Станок"				, ТекОбъект.СменноеЗадание.бит_Оборудование); 
		
		ЗаказНаПроизводство = ТекОбъект.Этап.Распоряжение;
		
		СтруктураЗаполнения.Вставить("НомерЗаказа"			, ЗаказНаПроизводство.Номер);
		СтруктураЗаполнения.Вставить("АртикулПФ"			, ТекОбъект.ВыходныеИзделия[0].Номенклатура.Артикул);
		СтруктураЗаполнения.Вставить("НаименованиеПФ"		, ТекОбъект.ВыходныеИзделия[0].Номенклатура);
		СтруктураЗаполнения.Вставить("Длина"				, ТекОбъект.ВыходныеИзделия.Итог("Количество"));
		СтруктураЗаполнения.Вставить("ТабНомер"				, ТекОбъект.Исполнитель.Код);
		СтруктураЗаполнения.Вставить("Дата"					, ТекущаяДатаСеанса());
		
		Номенклатура = ЗаказНаПроизводство.Продукция[0].Номенклатура;
		ЗаказКлиента = ЗаказНаПроизводство.Продукция[0].Назначение.Заказ;
		Если ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Срок = ЗаказКлиента.бит_СрокИзготовления;
		Иначе
			Срок = "";
		КонецЕсли;
		
		СтруктураЗаполнения.Вставить("НоменклатураГП"		, Строка(Номенклатура) + " " + Номенклатура.Артикул);
		СтруктураЗаполнения.Вставить("Срок"					, Срок);
		СтруктураЗаполнения.Вставить("НомерПартииКатанки"	, ЗаказНаПроизводство.бит_НомерПартииКатанки);
		
		ОбластьШапка.Параметры.Заполнить(СтруктураЗаполнения);
		
		ШК = НайтиШК(ТекОбъект.ВыходныеИзделия[0].Номенклатура);
		Если ШК <> Неопределено Тогда
			ПараметрыШК = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
			Для каждого Рисунок Из ОбластьШапка.Рисунки Цикл
				Если Рисунок.Имя = "КартинкаШтрихкода" Тогда
					
					ПараметрыШК.Ширина = Рисунок.Ширина;
					ПараметрыШК.Высота = Рисунок.Высота;
					ПараметрыШК.ОтображатьТекст = Ложь;
					ПараметрыШК.ТипКода = 1;
					ПараметрыШК.Штрихкод = ШК;
					ПараметрыШК.Масштабировать = Истина;
					ПараметрыШК.СохранятьПропорции = Истина;

					
					Рисунок.Картинка = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК).Картинка;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.8.1]  [VUVaynula@1cbit.ru] [01.02.2026 21:38:24] -	
КонецФункции

Функция НайтиШК(Номенклатура)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.8.1]  [VUVaynula@1cbit.ru] [01.02.2026 22:05:01] +        
	Запрос = Новый Запрос("ВЫБРАТЬ Первые 1
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ШК = Выборка.Штрихкод;
	Иначе
		ШК = Неопределено;
	КонецЕсли;  
	
	Возврат ШК;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.8.1]  [VUVaynula@1cbit.ru] [01.02.2026 22:05:01] -
КонецФункции

Функция НайтиВышестоящийЦех(ТекОбъект)
	
	Этап = ТекОбъект.Этап;
	ЗаказНаПроизводство = Этап.Распоряжение;
	
	СтрокаАдреса = "";
	Дерево = Отчеты.СтруктураЗаказаНаПроизводствоДинамическая.ПостроитьДеревоЗаказа(Новый Структура("Заказ, ПоказыватьЭтапы", ЗаказНаПроизводство, Истина), СтрокаАдреса);

	//НачатьОжиданиеРасчетаПриОткрытии = Ложь;
	//ПодключитьОбработчикОжидания("НачатьОжиданиеЗавершенияРасчетаПриОткрытии", 0.1, Истина);

КонецФункции


#КонецЕсли