
&НаКлиенте
Процедура бит_ЗагрузитьДанныеИзExcel(Команда)
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 + 
	бит_ОткрытьExcel();
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -
	
КонецПроцедуры

 
&НаКлиенте
Процедура бит_ОткрытьExcel()    
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 21.03.2025 +
	
	ФайлExcel = "";
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите excel - файл для загрузки норм выборки";
	Диалог.ПолноеИмяФайла = "c:\";
	Диалог.Фильтр = "Таблицы (*.xls,*.xlsx)|*.xls;*.xlsx;|Microsoft Excel 97/2000/XP/2003 (*.xls)|*.xls|Microsoft Excel 2007/2010 (*.xlsx)|*.xlsx";
	
	Если Диалог.Выбрать() Тогда
		ФайлExcel = Диалог.ПолноеИмяФайла;
	КонецЕсли;  
	ОбработкаТабицы(ФайлExcel);    
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 21.03.2025 -
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаТабицы(ФайлExcel) 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 21.03.2025 +
	
	Элементы.ДекорацияЭтапЗагрузки.Видимость = ИСТИНА;   
	УстановитьДекорацииЗагрузки("Идет открытие excel...", "");

	// Попытка открытия файла Excel
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлExcel);
	Исключение
		Сообщить("При открытии файла произошла ошибка! Операция прервана!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	// Попытка выбрать первый лист
	// Можно указать любой другой
	Попытка 
		Excel.Sheets(1).Select();    
	Исключение
		// Закрытие файла в том случае, если первый лист не найден
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Первый лист не найден!");
		Возврат;
	КонецПопытки;
	
	// Вычисление количества строк и колонок в зависимости от версии Excel
	vExcel = Лев(Excel.Version, Найти(Excel.Version,".")-1);
	Если vExcel = "8" тогда
		КоличествоСтрок = Excel.Cells.CurrentRegion.Rows.Count;
		КоличествоКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		КоличествоСтрок = Excel.Cells(1,1).SpecialCells(11).Row;
		КоличествоКолонок = Excel.Cells(1,1).SpecialCells(11).Column;
	Конецесли;	
	////Excel.Cells(Строка, Столбец).Text
	
	Элементы.ДекорацияСостояниеЗагрузки.Видимость = ИСТИНА; 
	УстановитьДекорацииЗагрузки("Идет загрузка данных.", "Пожалуйста, подождите..."); 
	МассивДанныхExl = Новый Массив; 
	
	Шаг = Цел(КоличествоСтрок / 20);
	НомерСтрокиДляВывода = Шаг; 
	ИзКоличествоСтрок = " из " + КоличествоСтрок;

	Для Строка = 2 По КоличествоСтрок Цикл 
		
		Элт = Новый Структура("НомерСтроки,КодОперации,КодТМЦ,КодОборудования,НормаВыработки,КоличествоХодов,НормаВремени,ТехнологическаяСкорость,РасчетнаяМассаПровода,КоэффициентИспользованияОборудования,ВыработкаПроводаМашины");
		
		Элт.НомерСтроки 								= Строка;
		Элт.КодОперации									= СтрЗаменить(Excel.Cells(Строка, 2).Text, Символы.НПП, "");	
		Элт.КодТМЦ										= СтрЗаменить(Excel.Cells(Строка, 4).Text, Символы.НПП, "");
		Элт.КодОборудования								= СтрЗаменить(Excel.Cells(Строка, 6).Text, Символы.НПП, "");
		
		Элт.НормаВыработки								= СтрЗаменить(Excel.Cells(Строка, 8).Text, Символы.НПП, "");
		Элт.КоличествоХодов								= СтрЗаменить(Excel.Cells(Строка, 9).Text, Символы.НПП, ""); 
		Элт.НормаВремени 								= СтрЗаменить(Excel.Cells(Строка, 10).Text, Символы.НПП, "");
		Элт.ТехнологическаяСкорость						= СтрЗаменить(Excel.Cells(Строка, 11).Text, Символы.НПП, "");
		Элт.РасчетнаяМассаПровода						= СтрЗаменить(Excel.Cells(Строка, 12).Text, Символы.НПП, "");
		Элт.КоэффициентИспользованияОборудования		= СтрЗаменить(Excel.Cells(Строка, 13).Text, Символы.НПП, ""); 
						
		МассивДанныхExl.Добавить(Элт);
			
	КонецЦикла; 
	
	//Excel.Quit();  
	
	//УстановитьДекорацииЗагрузки("Идет загрузка. Этап 2/4", "Анализ данных..."); 

	ЗаполнитьНормыВыработкиНаСервере(МассивДанныхExl);
	
	УстановитьДекорацииЗагрузки("Готово!", "Обработка выполнена успешно.");
		
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 21.03.2025 -
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьНормыВыработкиНаСервере(МассивДанныхExl)  
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 21.03.2025 +
	
	ТабличныйДокумент.Очистить();
	
	Элементы.ТабличныйДокумент.Видимость = ИСТИНА;  
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.бит_ЗаполнитьНормыВыработкиИзExcel.МакетДляНезагруженныхДанных"); 
	
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокСтрок 	= Макет.ПолучитьОбласть("ЗаголовокСтрок");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапка.Параметры.Дата = ТекущаяДата();
		
	ТабличныйДокумент.Вывести(ОбластьШапка); 
		
	ТЗ = Новый ТаблицаЗначений;
	
	ОписаниеСтроки10 	= Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10));
	ОписаниеСтроки25 	= Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25));	
    ОписаниеЧисла14_5 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14, 5));
	ОписаниеЧисла12_3 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 3));
	ОписаниеЧисла11_2 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(11, 2));
	ОписаниеЧисла5_0 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 0));
	ОписаниеЧисла7_0 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0)); 
	
	ОписаниеЧисла16_7 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(16, 7));
	ОписаниеЧисла15_6 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)); 
	ОписаниеЧисла14_5 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14, 5));
	
	ТЗ.Колонки.Добавить("НомерСтроки",							ОписаниеЧисла7_0);
    ТЗ.Колонки.Добавить("КодОперации",							ОписаниеСтроки10);
    ТЗ.Колонки.Добавить("КодТМЦ", 								ОписаниеСтроки25); //Артикул номенклатуры
    ТЗ.Колонки.Добавить("КодОборудования", 						ОписаниеСтроки10); //Описание вида рабочего центра 
	ТЗ.Колонки.Добавить("НормаВыработки", 						ОписаниеЧисла16_7);
    ТЗ.Колонки.Добавить("КоличествоХодов", 						ОписаниеЧисла5_0);
    ТЗ.Колонки.Добавить("НормаВремени", 						ОписаниеЧисла15_6);
	ТЗ.Колонки.Добавить("ТехнологическаяСкорость", 				ОписаниеЧисла14_5);
    ТЗ.Колонки.Добавить("РасчетнаяМассаПровода", 				ОписаниеЧисла14_5);
    ТЗ.Колонки.Добавить("КоэффициентИспользованияОборудования", ОписаниеЧисла12_3);  
	
	ВыводитьЗаголовок = ИСТИНА;
	
	Для Каждого Эл из МассивДанныхExl Цикл
		
		Стр = ТЗ.Добавить();
		
		Если Эл.КодОперации = "" Или Эл.КодТМЦ = "" Или Эл.КодОборудования = "" Тогда
			
			Если ВыводитьЗаголовок Тогда 
				ОбластьЗаголовокСтрок.Параметры.Заголовок = "Незаполненные данные в excel:";
				ТабличныйДокумент.Вывести(ОбластьЗаголовокСтрок);
				ВыводитьЗаголовок = ЛОЖЬ;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.НомерСтроки 	= Эл.НомерСтроки;
			ОбластьСтрока.Параметры.КодОперации 	= Эл.КодОперации; 
			ОбластьСтрока.Параметры.КодТМЦ 			= Эл.КодТМЦ;
			ОбластьСтрока.Параметры.КодОборудования = Эл.КодОборудования; 
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
	
		Иначе
			Стр.НомерСтроки 							= Эл.НомерСтроки; 
			Стр.КодОперации 							= Эл.КодОперации; 
			Стр.КодТМЦ 									= Эл.КодТМЦ;
			Стр.КодОборудования 						= Эл.КодОборудования;
			
			Попытка
				Стр.НормаВыработки 							= ?(Эл.НормаВыработки 						= "", 0, Число(Эл.НормаВыработки));
				Стр.КоличествоХодов 						= ?(Эл.КоличествоХодов 						= "", 0, Число(Эл.КоличествоХодов));
				Стр.НормаВремени 							= ?(Эл.НормаВремени 						= "", 0, Число(Эл.НормаВремени));
				Стр.ТехнологическаяСкорость 				= ?(Эл.ТехнологическаяСкорость 				= "", 0, Число(Эл.ТехнологическаяСкорость));
				Стр.РасчетнаяМассаПровода 					= ?(Эл.РасчетнаяМассаПровода 				= "", 0, Число(Эл.РасчетнаяМассаПровода));
				Стр.КоэффициентИспользованияОборудования 	= ?(Эл.КоэффициентИспользованияОборудования = "", 0, Число(Эл.КоэффициентИспользованияОборудования));  
			Исключение 
				УстановитьДекорацииЗагрузки("При загрузке произошла ошибка!", "Строка " + Стр.НомерСтроки);
				Возврат;
			КонецПопытки;
			
			Если НЕ Стр.НормаВыработки = 0 Тогда
				Стр.НормаВремени = 1 / Стр.НормаВыработки;
			ИначеЕсли НЕ Стр.НормаВремени = 0 Тогда 
				Стр.НормаВыработки = 1 / Стр.НормаВремени;
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.НомерСтроки КАК НомерСтроки,
		|	ТЗ.КодОперации КАК КодОперации,
		|	ТЗ.КодТМЦ КАК КодТМЦ,
		|	ТЗ.КодОборудования КАК КодОборудования,
		|	ТЗ.НормаВыработки КАК НормаВыработки,
		|	ТЗ.КоличествоХодов КАК КоличествоХодов,
		|	ТЗ.НормаВремени КАК НормаВремени,
		|	ТЗ.ТехнологическаяСкорость КАК ТехнологическаяСкорость,
		|	ТЗ.РасчетнаяМассаПровода КАК РасчетнаяМассаПровода,
		|	ТЗ.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования
		|ПОМЕСТИТЬ вт_ТЗ
		|ИЗ
		|	&ТаблицаЗначений КАК ТЗ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КодОперации,
		|	КодТМЦ,
		|	КодОборудования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТЗ.НомерСтроки КАК НомерСтроки,
		|	вт_ТЗ.КодОперации КАК КодОперации,
		|	вт_ТЗ.КодТМЦ КАК КодТМЦ,
		|	вт_ТЗ.КодОборудования КАК КодОборудования,
		|	вт_ТЗ.НормаВыработки КАК НормаВыработки,
		|	вт_ТЗ.КоличествоХодов КАК КоличествоХодов,
		|	вт_ТЗ.НормаВремени КАК НормаВремени,
		|	вт_ТЗ.ТехнологическаяСкорость КАК ТехнологическаяСкорость,
		|	вт_ТЗ.РасчетнаяМассаПровода КАК РасчетнаяМассаПровода,
		|	вт_ТЗ.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования,
		|	бит_КодыОпераций.Ссылка КАК бит_КодОперации,
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ВидыРабочихЦентров.Ссылка КАК ВидРабочегоЦентра,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(бит_КодыОпераций.Ссылка, 0) = 0
		|				ИЛИ ЕСТЬNULL(Номенклатура.Ссылка, 0) = 0
		|				ИЛИ ЕСТЬNULL(ВидыРабочихЦентров.Ссылка, 0) = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьПустаяСсылка
		|ПОМЕСТИТЬ вт_СправочникиТЗ
		|ИЗ
		|	вт_ТЗ КАК вт_ТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО вт_ТЗ.КодТМЦ = Номенклатура.Артикул
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
		|		ПО (вт_ТЗ.КодОборудования = (ВЫРАЗИТЬ(ВидыРабочихЦентров.Описание КАК СТРОКА(25))))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_КодыОпераций КАК бит_КодыОпераций
		|		ПО вт_ТЗ.КодОперации = бит_КодыОпераций.Наименование
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КодОперации,
		|	КодТМЦ,
		|	КодОборудования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СправочникТехнологическиеОперации.Ссылка КАК Ссылка,
		|	СправочникТехнологическиеОперации.бит_КодОперации КАК бит_КодОперации,
		|	ВЫБОР
		|		КОГДА СправочникТехнологическиеОперации.РабочийЦентр ССЫЛКА Справочник.РабочиеЦентры
		|			ТОГДА ВЫРАЗИТЬ(СправочникТехнологическиеОперации.РабочийЦентр КАК Справочник.РабочиеЦентры).ВидРабочегоЦентра
		|		ИНАЧЕ СправочникТехнологическиеОперации.РабочийЦентр
		|	КОНЕЦ КАК ВидРабочегоЦентра,
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ вт_ТехнолоогическиеОперации
		|ИЗ
		|	Справочник.ТехнологическиеОперации КАК СправочникТехнологическиеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
		|		ПО СправочникТехнологическиеОперации.Спецификация = РесурсныеСпецификацииВыходныеИзделия.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_СправочникиТЗ.НомерСтроки КАК НомерСтроки,
		|	вт_СправочникиТЗ.КодОперации КАК КодОперации,
		|	вт_СправочникиТЗ.КодТМЦ КАК КодТМЦ,
		|	вт_СправочникиТЗ.КодОборудования КАК КодОборудования,
		|	вт_СправочникиТЗ.НормаВыработки КАК НормаВыработки,
		|	вт_СправочникиТЗ.КоличествоХодов КАК КоличествоХодов,
		|	вт_СправочникиТЗ.НормаВремени КАК НормаВремени,
		|	вт_СправочникиТЗ.ТехнологическаяСкорость КАК ТехнологическаяСкорость,
		|	вт_СправочникиТЗ.РасчетнаяМассаПровода КАК РасчетнаяМассаПровода,
		|	вт_СправочникиТЗ.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования,
		|	вт_СправочникиТЗ.бит_КодОперации КАК бит_КодОперации,
		|	вт_СправочникиТЗ.Номенклатура КАК Номенклатура,
		|	вт_СправочникиТЗ.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	вт_СправочникиТЗ.ЕстьПустаяСсылка КАК ЕстьПустаяСсылка
		|ПОМЕСТИТЬ вт_ДляСопоставления
		|ИЗ
		|	вт_СправочникиТЗ КАК вт_СправочникиТЗ
		|ГДЕ
		|	НЕ вт_СправочникиТЗ.ЕстьПустаяСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ДляСопоставления.НомерСтроки КАК НомерСтроки,
		|	вт_ДляСопоставления.КодОперации КАК КодОперации,
		|	вт_ДляСопоставления.КодТМЦ КАК КодТМЦ,
		|	вт_ДляСопоставления.КодОборудования КАК КодОборудования,
		|	вт_ДляСопоставления.НормаВыработки КАК НормаВыработки,
		|	вт_ДляСопоставления.КоличествоХодов КАК КоличествоХодов,
		|	вт_ДляСопоставления.НормаВремени КАК НормаВремени,
		|	вт_ДляСопоставления.ТехнологическаяСкорость КАК ТехнологическаяСкорость,
		|	вт_ДляСопоставления.РасчетнаяМассаПровода КАК РасчетнаяМассаПровода,
		|	вт_ДляСопоставления.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования,
		|	вт_ТехнолоогическиеОперации.Ссылка КАК ТехнологическаяОперация,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(вт_ТехнолоогическиеОперации.Ссылка, 0) = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ТехнологическаяОперацияНайдена,
		|	вт_ДляСопоставления.ТехнологическаяСкорость * вт_ДляСопоставления.РасчетнаяМассаПровода * вт_ДляСопоставления.КоличествоХодов * вт_ДляСопоставления.КоэффициентИспользованияОборудования * 60 / 1000 КАК ВыработкаПроводаСоВсейМашины,
		|	вт_ДляСопоставления.НормаВремени * 60 КАК ВремяШтучное
		|ИЗ
		|	вт_ДляСопоставления КАК вт_ДляСопоставления
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ТехнолоогическиеОперации КАК вт_ТехнолоогическиеОперации
		|		ПО вт_ДляСопоставления.бит_КодОперации = вт_ТехнолоогическиеОперации.бит_КодОперации
		|			И вт_ДляСопоставления.Номенклатура = вт_ТехнолоогическиеОперации.Номенклатура
		|			И вт_ДляСопоставления.ВидРабочегоЦентра = вт_ТехнолоогическиеОперации.ВидРабочегоЦентра
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТехнологическаяОперацияНайдена УБЫВ
		|ИТОГИ ПО
		|	ТехнологическаяОперацияНайдена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_СправочникиТЗ.НомерСтроки КАК НомерСтроки,
		|	вт_СправочникиТЗ.КодОперации КАК КодОперации,
		|	вт_СправочникиТЗ.КодТМЦ КАК КодТМЦ,
		|	вт_СправочникиТЗ.КодОборудования КАК КодОборудования
		|ИЗ
		|	вт_СправочникиТЗ КАК вт_СправочникиТЗ
		|ГДЕ
		|	вт_СправочникиТЗ.ЕстьПустаяСсылка";
	
	Запрос.УстановитьПараметр("ТаблицаЗначений", ТЗ);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаИтоги = РезультатыЗапросов[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТехнологическаяОперацияНайдена");  
	
	ВыводитьЗаголовок = ИСТИНА;
	ПеречислениеМинута = Перечисления.ЕдиницыИзмеренияВремени.Минута; 
	
	//УстановитьДекорацииЗагрузки("Идет загрузка. Этап 3/4", "Загрузка данных...");
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		Выборка = ВыборкаИтоги.Выбрать(); 
		
		Если ВыборкаИтоги.ТехнологическаяОперацияНайдена Тогда 
			Пока Выборка.Следующий() Цикл 
				
				ОбъектТехнологическаяОперация = Выборка.ТехнологическаяОперация.ПолучитьОбъект();
				
				ОбъектТехнологическаяОперация.бит_НормаВыработки 						= Выборка.НормаВыработки;
				ОбъектТехнологическаяОперация.бит_КоличествоХодов 						= Выборка.КоличествоХодов;
				ОбъектТехнологическаяОперация.бит_НормаВремени 							= Выборка.НормаВремени;
				ОбъектТехнологическаяОперация.бит_ТехнологическаяСкорость 				= Выборка.ТехнологическаяСкорость;
				ОбъектТехнологическаяОперация.бит_РасчетнаяМассаПровода 				= Выборка.РасчетнаяМассаПровода;
				ОбъектТехнологическаяОперация.бит_КоэффициентИспользованияОборудования 	= Выборка.КоэффициентИспользованияОборудования;   
				ОбъектТехнологическаяОперация.бит_ВыработкаПроводаСоВсейМашины 			= Выборка.ВыработкаПроводаСоВсейМашины;
				ОбъектТехнологическаяОперация.бит_ВыработкаПроводаСоВсейМашины 			= Выборка.ВыработкаПроводаСоВсейМашины; 
				ОбъектТехнологическаяОперация.ВремяШтучноеЕдИзм 						= ПеречислениеМинута;
				ОбъектТехнологическаяОперация.ВремяШтучное 								= Выборка.ВремяШтучное; 
				
				ОбъектТехнологическаяОперация.Записать();
				
			КонецЦикла;
		Иначе
			
			//УстановитьДекорацииЗагрузки("Данные загруженны. Этап 4/4", "Вывод ошибочных строк...");
			
			Пока Выборка.Следующий() Цикл 
				
				Если ВыводитьЗаголовок Тогда 
					ОбластьЗаголовокСтрок.Параметры.Заголовок = "Неоднозначное представление данных или не найдена технологическая операция:";
					ТабличныйДокумент.Вывести(ОбластьЗаголовокСтрок);
					ВыводитьЗаголовок = ЛОЖЬ;
				КонецЕсли;
				
				ОбластьСтрока.Параметры.НомерСтроки 	= Выборка.НомерСтроки;
				ОбластьСтрока.Параметры.КодОперации 	= Выборка.КодОперации; 
				ОбластьСтрока.Параметры.КодТМЦ 			= Выборка.КодТМЦ;
				ОбластьСтрока.Параметры.КодОборудования = Выборка.КодОборудования; 
				
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла; 
	
	//УстановитьДекорацииЗагрузки("Данные загруженны. Этап 4/4", "Вывод ошибочных строк...");
		
	Выборка = РезультатыЗапросов[5].Выбрать(); 
	ВыводитьЗаголовок = ИСТИНА;
	Пока Выборка.Следующий() Цикл   
		Если ВыводитьЗаголовок Тогда 
			ОбластьЗаголовокСтрок.Параметры.Заголовок = "Не найден код операции/номенклатура/вид рабочего центра:";
			ТабличныйДокумент.Вывести(ОбластьЗаголовокСтрок);
			ВыводитьЗаголовок = ЛОЖЬ;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.НомерСтроки 	= Выборка.НомерСтроки;
		ОбластьСтрока.Параметры.КодОперации 	= Выборка.КодОперации; 
		ОбластьСтрока.Параметры.КодТМЦ 			= Выборка.КодТМЦ;
		ОбластьСтрока.Параметры.КодОборудования = Выборка.КодОборудования; 
		
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 21.03.2025 -
	
КонецПроцедуры


&НаСервере
Процедура УстановитьДекорацииЗагрузки(НадписьЭтапЗагрузки, НадписьСостояниеЗагрузки)   
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 21.03.2025 +
	
	Элементы.ДекорацияЭтапЗагрузки.Заголовок = НадписьЭтапЗагрузки;
	Элементы.ДекорацияСостояниеЗагрузки.Заголовок = НадписьСостояниеЗагрузки; 
		
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 21.03.2025 -  
	
КонецПроцедуры