
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "ПриИзменении" переключателя "РасположениеБазы".
// 
&НаКлиенте
Процедура РасположениеБазыПриИзменении(Элемент)
	
	ИзменениеРасположенияБазы();
	
КонецПроцедуры

// Процедура - действие команды "КомандаПроверитьПодключение".
// 
&НаКлиенте
Процедура КомандаПроверитьПодключение(Команда)
	
	Если ПроверитьПодключение() Тогда		
		ТекстСообщения = НСтр("ru='Тестовое подключение успешно выполнено.';en='Test connection is successful done.'");		
	Иначе		
		ТекстСообщения = НСтр("ru='Не удалось выполнить тестовое подключение.';en='Unable to test connection.'");		
	КонецЕсли; 
	
	ЗаголовокСообщения = НСтр("ru='Тестовое подключение';en='Test connection'");
	
	ПоказатьПредупреждение(, ТекстСообщения, 15, ЗаголовокСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость доступность элементов формы.
// 
&НаСервереБезКонтекста
Процедура УправлениеЭлементамиФормы(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	ЭтоСервернаяБаза = ?(Объект.РасположениеБазы = Перечисления.бит_мпд_ВидыРасположенияИнформационныхБаз.Серверная, Истина, Ложь);
	ЭтоАвтоСервис    = ?(Объект.РасположениеБазы = Перечисления.бит_мпд_ВидыРасположенияИнформационныхБаз.RestСервис,Истина, Ложь);
	
	Элементы.ИмяСервера.Видимость = ЭтоСервернаяБаза ИЛИ ЭтоАвтоСервис;
	Элементы.ИмяБазы.Видимость    = ЭтоСервернаяБаза ИЛИ ЭтоАвтоСервис;
	Элементы.Путь.Видимость       = НЕ ЭтоСервернаяБаза И НЕ ЭтоАвтоСервис;
	
КонецПроцедуры

// Процедура обрабатывает изменение реквизита РасположениеБазы.
// 
&НаСервере
Процедура ИзменениеРасположенияБазы()

  УправлениеЭлементамиФормы(ЭтотОбъект);	

КонецПроцедуры // ИзменениеРасположенияБазы()

// Функция производит тестовое подключение.
// 
// Возвращаемое значение:
//  флУдалось - Булево.
// 
&НаСервере
Функция ПроверитьПодключение()

	флУдалось = Ложь;
	Если Объект.РасположениеБазы = Перечисления.бит_мпд_ВидыРасположенияИнформационныхБаз.RestСервис Тогда
		
		 флУдалось = Справочники.бит_мпд_НастройкиВнешнихПодключений.ТестовоеСоедениеREST(Объект, "Ошибки");
		
	Иначе	
		
		Подключение = Справочники.бит_мпд_НастройкиВнешнихПодключений.ПодключитьКОМ(Объект,"Ошибки");
		
		Если Подключение = Неопределено Тогда
			
			флУдалось = Ложь;
			
		Иначе	
			
			флУдалось = Истина;
			
		КонецЕсли; 
		
		Подключение = Неопределено;
		
	КонецЕсли; 
	
	Возврат флУдалось;
	
КонецФункции // ПроверитьПодключение()

#КонецОбласти

