&После("ПриСозданииНаСервере")
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.9] [Микляев К.А.] [10.06.2026] +
	бит_ДобавитьПолеКодаНазначения();
	// }}ПервыйБИТ ЛистТребований [ЛТ6.9] [Микляев К.А.] [10.06.2026] -
КонецПроцедуры

&НаСервере
Процедура бит_ДобавитьПолеКодаНазначения()
	
	Если Элементы.Найти("бит_КодНазначения") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйЭлемент = Элементы.Добавить("бит_КодНазначения", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КодНазначения";
	НовыйЭлемент.Заголовок = "(бит) Код назначения"; 
	НовыйЭлемент.ТолькоПросмотр = Истина;
		
КонецПроцедуры
