
&НаКлиенте
Процедура РеквизитХарактеристикиПриИзменении(Элемент)
	
	Перем мПараметрыВыбора, Параметр;
	
	мПараметрыВыбора = Новый Массив();
	
	Если ЗначениеЗаполнено(ЭтаФорма.Запись.РеквизитХарактеристики) Тогда
		Параметр = Новый ПараметрВыбора("Отбор.РеквизитХарактеристики", ЭтаФорма.Запись.РеквизитХарактеристики);
		мПараметрыВыбора.Добавить(Параметр);
	КонецЕсли;
	
	ЭтаФорма.Элементы.НаборОграничений.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Запись.ИДЗаписи) Тогда
		Запись.ИДЗаписи = ПолучитьИДЗаписи();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция	ПолучитьИДЗаписи()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	бит_НастройкиВыбораИОграниченияЗначенийПараметров.ИДЗаписи КАК ИДЗаписи
		|ИЗ
		|	РегистрСведений.бит_НастройкиВыбораИОграниченияЗначенийПараметров КАК бит_НастройкиВыбораИОграниченияЗначенийПараметров
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИДЗаписи УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ИДЗаписи + 1;
	КонецЦикла;
	
	Возврат 1;
	
КонецФункции