
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ТекущийОбъект.ЭтоГруппа Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидРешения",ТекущийОбъект.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НазначениеВидовРешений.ВидРешения КАК ВидРешения
		|ИЗ
		|	РегистрСведений.бит_НазначениеВидовРешенийСогласования КАК НазначениеВидовРешений
		|ГДЕ
		|	НазначениеВидовРешений.ВидРешения = &ВидРешения";
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			МенеджерЗаписи = РегистрыСведений.бит_НазначениеВидовРешенийСогласования.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ВидРешения = ТекущийОбъект.Ссылка;
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
				ТекстСообщения = НСтр("ru='Не удалось установить назначение вида решения.';
									|en='Can't set the solution view assignment.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти