
#Область ОбработчикиСобытий

Функция GetServiceInfo(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/service_info/'; en = 'approval/v1/service_info/'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		Данные = ИнформацияОСервисе();
		Ответ  = СформироватьОтветJSON(Данные);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода ServiceInfo.
                                   |Результат: %1';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the ServiceInfo method.
                                   |Result: %1'"); 
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода ServiceInfo.
                               |Описание ошибки: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. ServiceInfo method error.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;		
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Диагностический метод проверки доступности сервера и API.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле, см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция Ping(Запрос)
	
	Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
		ИмяСобытия = НСтр("ru = 'approval/v1/ping/'; en = 'approval/v1/ping/'", ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода Ping.';
								|en = 'HTTP service bit_ApprovalServiceNew. Call the Ping method.'");
		ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
	КонецЕсли; 
	
	Возврат СформироватьОтветJSON("pong");
	
КонецФункции

// Возвращает список с описанием объектов визирования настроенных в регистре сведений
//  "бит_ОбъектыМобильногоВизирования", а также настройки фильтрации по реквизитам для списка.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле, см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция GetObjectTypes(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/object_types/'; en = 'approval/v1/object_types/'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		Данные = ПолучитьТипыОбъектовВизирования();
		Ответ  = СформироватьОтветJSON(Данные);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода ObjectTypes.
                                   |Результат: %1';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the ObjectTypes method.
                                   |Result: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода ObjectTypes.
                               |Описание ошибки: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. Error of the ObjectTypes method.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция GetAssignmentOfAdditionalMeasurements(Запрос)

	ИмяСобытия = НСтр("ru = 'approval/v1/additional_measurements'; en = 'approval/v1/additional_measurements'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		Данные = ПолучитьНазначенияДополнительныхИзмерений();
		Ответ  = СформироватьОтветJSON(Данные);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода AssignmentOfAdditionalMeasurements.';
									|en = 'HTTP service bit_ApprovalServiceNew. Call the AssignmentOfAdditionalMeasurements method.'");
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода AssignmentOfAdditionalMeasurements.
                               |Описание ошибки: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. Error of AssignmentOfAdditionalMeasurements method.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция GetObjects(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/objects'; en = 'approval/v1/objects'", ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьОбъекты(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода Objects.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the Objects method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода Objects.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. Error of the Objects method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	   	   
	Возврат Ответ;   
	   
КонецФункции

Функция SetDecisionList(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/decision_list'; en = 'approval/v1/decision_list'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = УстановитьРешения(ДанныеЗапроса.Objects, ДанныеЗапроса.Decision);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода DecisionList.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the DecisionList method.
                                   |Parameters: %1
                                   |Result: %2'");		
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода DecisionList.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. Error of the DecisionList method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);				
		Ответ = Ложь;
	КонецПопытки;	
	
	Возврат Ответ;
	
КонецФункции

Функция GetObjectFileData(Запрос)

	ИмяСобытия = НСтр("ru = 'approval/v1/object_file_data'; en = 'approval/v1/object_file_data'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = бит_МобильноеПриложениеПереопределяемый.ПолучитьДанныеФайлаОбъекта(ДанныеЗапроса.Name,
																							ДанныеЗапроса.ID);		
		Ответ = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода ObjectFileData.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the ObjectFileData method.
                                   |Parameters: %1
                                   |Result: %2'");	
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка метода GetObjectFileData.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'GetObjectFileData method error.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция RefreshToken(Запрос)
		
	ИмяСобытия = НСтр("ru = 'approval/v1/refresh_token'; en = 'approval/v1/refresh_token'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ЗарегистрироватьУстройство(ДанныеЗапроса.Token, ДанныеЗапроса.DeviceId,
														ДанныеЗапроса.OS, ДанныеЗапроса.UserName);
		Ответ = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода RefreshToken.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the RefreshToken method.
                                   |Parameters: %1
                                   |Result: %2'");	
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 		
	Исключение
		Ответ = Новый Структура("code, message, error");
		Ответ.code     = "500";
		Ответ.message  = "Server error.";
		Ответ.error    = "500";
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода RefreshToken.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. Error of the RefreshToken method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);					
	КонецПопытки;
		
	Возврат Ответ;
	
КонецФункции

Функция GetAssignmentOfAdditionalMeasurementsForObjects(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/measurements_for_objects'; en = 'approval/v1/measurements_for_objects'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьОбъектыСДопИзмерениями(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода AssignmentOfAdditionalMeasurementsForObjects.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the AssignmentOfAdditionalMeasurementsForObjects method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода AssignmentOfAdditionalMeasurementsForObjects.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. Error of AssignmentOfAdditionalMeasurementsForObjects method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает список с задач от/для пользователя.
//
// Параметры:
//  Запрос	 - HTTPСервисЗапрос	 - Запрос от мобильного приложения,
//  	см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - Ответ с информацией в теле см. общий макет бит_ОписаниеСервисаМобильногоВизирования.
//
Функция GetTasks(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/tasks'; en = 'approval/v1/tasks'", ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьЗадачи(ДанныеЗапроса.User);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода Tasks.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the Tasks method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода Tasks.
                               |Параметры: %1
                               |Описание ошибки: %2'; en = 'HTTP service bit_ApprovalServiceNew. Tasks method error.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция Task(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/task'; en = 'approval/v1/task'", ОбщегоНазначения.КодОсновногоЯзыка());
	Action     = Запрос.ПараметрыURL.Получить("Action");
	Ответ      = Неопределено;
	Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода Task.
                               |Действие: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. Call the Task method.
                               |Action: %1'");	
		ТекстСообщения = СтрШаблон(ТекстСообщения, Action); 
		ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
	КонецЕсли;
	
	Если СтрСравнить(Action, "accept") = 0 Тогда	
		Ответ = ПринятьЗадачуЗапрос(Запрос);		
	ИначеЕсли СтрСравнить(Action, "perform") = 0 Тогда
		Ответ = ВыполнитьЗадачуЗапрос(Запрос);
	ИначеЕсли СтрСравнить(Action, "update") = 0 Тогда
		Ответ = ОбновитьЗадачуЗапрос(Запрос);
	ИначеЕсли СтрСравнить(Action, "create") = 0 Тогда
		Ответ = СоздатьЗадачуЗапрос(Запрос); 
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция GetObjectsForApproval(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/objects_for_approval'; en = 'approval/v1/objects_for_approval'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьОбъектыВизирования(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода GetObjectsForApproval.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetObjectsForApproval method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetObjectsForApproval.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetObjectsForApproval method.
                               |Parameters: %1
                               |Result: %2'");	
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция GetUsers(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/users'; en = 'approval/v1/users'", ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		Результат = ПолучитьПользователей();
		Ответ     = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода Users.
                                   |Результат: %1';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the Users method.
                                   |Result: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода Users.
                               |Описание ошибки: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. Error of the Users method.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;	
	
КонецФункции

Функция GetApprovalDecisions(Запрос)

	ИмяСобытия = НСтр("ru = 'approval/v1/approval_decisions'; en = 'approval/v1/approval_decisions'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ВидыРешенийСогласования(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода ApprovalDecisions.
                                   |Результат: %1';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the ApprovalDecisions method.
                                   |Result: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода ApprovalDecisions.
                               |Описание ошибки: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. Error of ApprovalDecisions method.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;	

КонецФункции 

Функция GetObjectTable(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/object_table'; en = 'approval/v1/object_table'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = СформироватьТабличнуюЧастьHTML(ДанныеЗапроса);
		Ответ         = СформироватьОтветHTML(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода GetObjectTable.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetObjectTable method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetObjectTable.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. GetObjectTable method error.
                               |Parameters: %1
                               |Error Description: %2'");	
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;	
	
КонецФункции

Функция GetInternalObjectTable(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/internal_object_table'; en = 'approval/v1/internal_object_table'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ДанныеТабличнойЧасти(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода GetInternalObjectTable.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetInternalObjectTable method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetInternalObjectTable.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. Error of the GetInternalObjectTable method.
                               |Parameters: %1
                               |Error description: %2'");	
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;	
	
КонецФункции

Функция SetInternalObjectTable(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/internal_object_table'; en = 'approval/v1/internal_object_table'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = УстановитьДанныеТабличнойЧасти(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода SetInternalObjectTable.
                                   |Параметры: %1
                                   |Результат: %2';
                                   |en = 'HTTP service bit_ApprovalServiceNew. Call the SetInternalObjectTable method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ);
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода SetInternalObjectTable.
                               |Параметры: %1
                               |Описание ошибки: %2';
                               |en = 'HTTP service bit_ApprovalServiceNew. Error of the SetInternalObjectTable method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
		    ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция GetApprovalHistory(Запрос)	
	
	ИмяСобытия = НСтр("ru = 'approval/v1/approval_history'; en = 'approval/v1/approval_history'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ИсторияВизирования(ДанныеЗапроса.Id, ДанныеЗапроса.Name);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода GetApprovalHistory.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetApprovalHistory method.
                                   |Parameters: %1
                                   |Result: %2'");		
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetApprovalHistory.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. GetApprovalHistory method error.
                               |Parameters: %1
                               |Error description: %2'");		
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;	
	
КонецФункции

Функция GetBudgetBalances(Запрос)

	ИмяСобытия = НСтр("ru = 'approval/v1/budget_balances'; en = 'approval/v1/budget_balances'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьОстаткиПоБюджету(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода BudgetBalances.
                                   |Результат: %1';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the BudgetBalances method.
                                   |Result: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода BudgetBalances.
                               |Описание ошибки: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. BudgetBalances method error.
                               |Error description: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;	

КонецФункции 

Функция HistoryApproval(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/history_approval'; en = 'approval/v1/history_approval'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьИсториюВизированияОбъектов(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода HistoryApproval.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the HistoryApproval method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода HistoryApproval.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. HistoryApproval method error.
                               |Parameters: %1
                               |Error description: %2'");	
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;

КонецФункции

Функция GetStatuses(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/Get_Statuses'; en = 'approval/v1/Get_Statuses'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON = Запрос.ПолучитьТелоКакСтроку();
		Результат  = ПолучитьСтатусы();
		Ответ      = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода GetStatuses.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetStatuses method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetStatuses.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. The error of the GetStatuses method.
                               |Parameters: %1
                               |Error description: %2'");	
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;

КонецФункции

Функция SetDecisionListDifferentStatuses(Запрос)
	
	Возврат Ложь;

КонецФункции

Функция GetObject(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/object'; en = 'approval/v1/object'", ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПолучитьОбъектПоИдентификатору(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода GetObject.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the GetObject method.
                                   |Parameters: %1
                                   |Result: %2'");		
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetObject.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. GetObject method error.
                               |Parameters: %1
                               |Error description: %2'");		
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Ответ = Неопределено;
	КонецПопытки;
	
	Возврат Ответ;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Визирование

Функция ПолучитьТипыОбъектовВизирования()
	
	Результат = Новый Массив;
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыВизирования.ОбъектСистемы КАК ОбъектСистемы,
	|	ОбъектыВизирования.ОбъектСистемы.Наименование КАК Наименование,
	|	ОбъектыВизирования.ОбъектСистемы.ИмяОбъектаПолное КАК ИмяОбъектаПолное,
	|	ОбъектыВизирования.Синоним КАК Синоним,
	|	ДопАналитики.Аналитика КАК Аналитика
	|ИЗ
	|	РегистрСведений.бит_ОбъектыМобильногоВизирования КАК ОбъектыВизирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НазначениеДополнительныхАналитик КАК ДопАналитики
	|		ПО ОбъектыВизирования.ОбъектСистемы = ДопАналитики.Объект
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Аналитика)
	|ПО
	|	ОбъектСистемы";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаОбъектСистемы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ФильтрПоОтображениюОстатков = бит_МобильноеПриложениеПереопределяемый.ТипыОбъектовДляОтображенияОстатков();
	ФильтрПоОтображениюТабЧастей = бит_МобильноеПриложениеПереопределяемый.ТипыОбъектовДляОтображенияТабличныхЧастей();
	
	Пока ВыборкаОбъектСистемы.Следующий() Цикл
		
		ОбъектСистемы = Новый Структура;
		ОбъектСистемы.Вставить("Name");
		ОбъектСистемы.Вставить("Title");
		ОбъектСистемы.Вставить("Synonim");
		ОбъектСистемы.Вставить("ShowBudgetBalances");
		ОбъектСистемы.Вставить("ShowTabularSection");
		ОбъектСистемы.Вставить("Properties");
		ОбъектСистемы.Вставить("ObjectFilter");
		ОбъектСистемы.Вставить("AdditionalPropsFilter");
		
		ИмяОбъекта = ВыборкаОбъектСистемы.ИмяОбъектаПолное;
		ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "Документ.", "ДокументСсылка.");
		ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "Справочник.", "СправочникСсылка.");
		
		ОбъектСистемы.Name = ИмяОбъекта;
		ОбъектСистемы.Title = ВыборкаОбъектСистемы.Наименование;
		// N.B. Отказаться от строкового варианта для проверки, перейти на метаданные.
		ОбъектСистемы.ShowBudgetBalances = ФильтрПоОтображениюОстатков.Найти(ИмяОбъекта) <> Неопределено;
		ОбъектСистемы.ShowTabularSection = ФильтрПоОтображениюТабЧастей.Найти(ИмяОбъекта) <> Неопределено;
		
		ДопАналитики = Новый Массив;
		ВыборкаДЗ    = ВыборкаОбъектСистемы.Выбрать();
		Пока ВыборкаДЗ.Следующий() Цикл
			Синоним = ВыборкаДЗ.Синоним;
			Если ЗначениеЗаполнено(ВыборкаДЗ.Аналитика) Тогда
				АналитикаСсылка = ВыборкаДЗ.Аналитика;
				УИДСтрока       = XMLСтрока(АналитикаСсылка);
				// N.B. Разименовать в запросе.
				АналитикаСтруктура = Новый Структура("Id, Description", УИДСтрока, СокрЛП(АналитикаСсылка.Наименование));
				ДопАналитики.Добавить(АналитикаСтруктура);
			КонецЕсли;
		КонецЦикла;
		ОбъектСистемы.Synonim    = Синоним;
		ОбъектСистемы.Properties = ДопАналитики;

		ОбъектСистемы.ObjectFilter = бит_МобильноеПриложениеПереопределяемый.ФильтрРеквизитовОбъекта(
		                              ВыборкаОбъектСистемы.ОбъектСистемы);
									  
		ОбъектСистемы.AdditionalPropsFilter = ФильтрыДопРеквизитовОбъекта(ВыборкаОбъектСистемы.ИмяОбъектаПолное);
		
		Результат.Добавить(ОбъектСистемы);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ФильтрыДопРеквизитовОбъекта(ИмяОбъектаПолное)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(ИмяОбъектаПолное) Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		ВидСвойств  = "ДополнительныеРеквизиты";
		ВладелецСвойств = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяОбъектаПолное).ПустаяСсылка();
		ОбъектМетаданных = ВладелецСвойств.Метаданные();
		ТабличнаяЧасть = ОбъектМетаданных.ТабличныеЧасти.Найти(ВидСвойств);
		Если НЕ ТабличнаяЧасть = Неопределено Тогда
			СвойстваОбъекта = УправлениеСвойствами.СвойстваОбъекта(ВладелецСвойств, Истина, Ложь);
			Для каждого Свойство Из СвойстваОбъекта Цикл
				УИДСтрока = XMLСтрока(Свойство.Ссылка);
				Описание = СокрЛП(Свойство.Наименование);
				ДопРеквизит = Новый Структура("Id, Description", УИДСтрока, Описание);
				Результат.Добавить(ДопРеквизит);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОбъекты(ДанныеЗапроса)
	
	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Массив") Тогда
		Возврат "";
	КонецЕсли;
	
	ВсеСсылки = Новый Массив;
	ОбъектыПоТипам = Новый Массив;
	УстановитьПривилегированныйРежим(Истина);
	// Получение ссылок запрашиваемых объектов.
	Для каждого Строка Из ДанныеЗапроса Цикл
		ТипОбъекта     = Строка.ObjectType;
		Идентификаторы = Строка.IDsArray;
		ТекущиеСсылки  = Новый Массив;
		Для каждого Строка Из Идентификаторы Цикл
			Ссылка = ПолучитьСсылку(ТипОбъекта, Строка);
			Если ЗначениеЗаполнено(Ссылка) Тогда
				ВсеСсылки.Добавить(Ссылка);
				ТекущиеСсылки.Добавить(Ссылка)
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		// Группировка объектов по типам.
		ТекущиеОбъекты = Новый Структура("ТипОбъекта, Ссылки", ТипОбъекта, ТекущиеСсылки);
		ОбъектыПоТипам.Добавить(ТекущиеОбъекты);
	КонецЦикла;
	
	// Получение сведений о прикрепленных файлах.
	ПрикрепленныеФайлы = ПолучитьИнформациюФайлов(ВсеСсылки);
	
	// Заполнение результата.
	ЗапросПлатежнойПозиции = бит_МобильноеПриложениеПереопределяемый.ЗапросПлатежнойПозиции();
	Результат = Новый Массив;
	Для каждого ТекущиеОбъекты Из ОбъектыПоТипам Цикл
		ДанныеОбъектов = Новый Массив;
		
		РеквизитыОбъектов = РеквизитыОбъектов(ТекущиеОбъекты.Ссылки, Истина, Истина);
		ДоступныеВизы = ПолучитьДоступныеВизыОбъектов(ТекущиеОбъекты.Ссылки);
		Для каждого СтрокаТаблицы Из РеквизитыОбъектов Цикл
		
			ДанныеОбъекта = Новый Структура;
			ДанныеОбъекта.Вставить("ID",                XMLСтрока(СтрокаТаблицы.ОбъектВизирования));
			ДанныеОбъекта.Вставить("Date",              Формат(СтрокаТаблицы.Дата, "ДЛФ=D"));
			ДанныеОбъекта.Вставить("Number",            СтрокаТаблицы.Номер);
			ДанныеОбъекта.Вставить("Company",           Строка(СтрокаТаблицы.Организация));
			ДанныеОбъекта.Вставить("Department",        СтрСоединить(СтрокаТаблицы.ЦФОСмешанная, ", "));
			ДанныеОбъекта.Вставить("TurnoverItem",      СтрСоединить(СтрокаТаблицы.СтатьяОборотовСмешанная, ", "));
			ДанныеОбъекта.Вставить("Partner",           Строка(СтрокаТаблицы.Контрагент));
			ДанныеОбъекта.Вставить("Amount",            Строка(СтрокаТаблицы.СуммаДокумента));
			ДанныеОбъекта.Вставить("Currency",          Строка(СтрокаТаблицы.ВалютаДокумента));
			ДанныеОбъекта.Вставить("ManagerialPurpose", Строка(СтрокаТаблицы.НазначениеПлатежаУпр));
			ДанныеОбъекта.Вставить("Status",            Строка(СтрокаТаблицы.Статус));
			ДанныеОбъекта.Вставить("ResponsiblePerson", Строка(СтрокаТаблицы.Ответственный));
			ДанныеОбъекта.Вставить("Scenario",          Строка(СтрокаТаблицы.Сценарий));
			ДанныеОбъекта.Вставить("Comment",           СтрокаТаблицы.Комментарий);
			ДанныеОбъекта.Вставить("OverBudget",        ?(ЗначениеЗаполнено(СтрокаТаблицы.СверхБюджета),СтрокаТаблицы.СверхБюджета,Ложь));
			ДанныеОбъекта.Вставить("BasisForecast",     Неопределено);
			ДанныеОбъекта.Вставить("Executor",          "");
			ДанныеОбъекта.Вставить("PaymentDate",       "");
			ДанныеОбъекта.Вставить("AdditionalProps",   ДополнительныеРеквизитыОбъекта(СтрокаТаблицы.ОбъектВизирования));
			
			ДоступныеВизыОбъекта = ДоступныеВизы[СтрокаТаблицы.ОбъектВизирования];
			Если ДоступныеВизыОбъекта = Неопределено Тогда
				ДоступныеВизыОбъекта = Новый Массив;
			КонецЕсли;
			ДанныеОбъекта.Вставить("AvailableVisas", ДоступныеВизыОбъекта);
			
			бит_МобильноеПриложениеПереопределяемый.ДополнитьДанныеОбъекта(ДанныеОбъекта, СтрокаТаблицы, ЗапросПлатежнойПозиции);
			
			// Данные о файлах.
			Файлы = ПрикрепленныеФайлы[СтрокаТаблицы.ОбъектВизирования];
			ДанныеОбъекта.Вставить("Files", Новый Массив);
			Если ЗначениеЗаполнено(Файлы) Тогда
				Для каждого ДанныеФайла Из Файлы Цикл
					ИнформацияОФайле = Новый Структура;
					ИнформацияОФайле.Вставить("Name",        ДанныеФайла.Наименование);
					ИнформацияОФайле.Вставить("DateChanged", ДанныеФайла.ДатаМодификацииФайла);
					ИнформацияОФайле.Вставить("ID",          ДанныеФайла.ИдФайла);
					ИнформацияОФайле.Вставить("VersionID",   ДанныеФайла.ИдВерсии);
					ИнформацияОФайле.Вставить("Ext",         ДанныеФайла.Расширение);
					ИнформацияОФайле.Вставить("Size",        ДанныеФайла.Размер);
					ДанныеОбъекта.Files.Добавить(ИнформацияОФайле);
				КонецЦикла;
			КонецЕсли;
			
			ДанныеОбъектов.Добавить(ДанныеОбъекта);
		
		КонецЦикла; 
		
		ДанныеПоТипам = Новый Структура("ObjectType, ObjectsArray", ТекущиеОбъекты.ТипОбъекта, ДанныеОбъектов);
		Результат.Добавить(ДанныеПоТипам);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции

// Функция устанавливает решения по указанным объектам.
//
// Параметры:
//   Objects - Массив из Структура- объекты визирования.
//   Decision - Строка.
//
// Возвращаемое значение:
//  Строка - список Id документов с пустыми комментариями, если установлена необходимость заполнения Комментария.
//
Функция УстановитьРешения(Objects, Decision)
	
	УстановитьПривилегированныйРежим(Истина);	
	
	// N.B. Решение = Справочники.бит_ВидыРешенийСогласования.ПолучитьСсылку(Новый УникальныйИдентификатор(Decision));
	Если ЗначениеЗаполнено(Decision) Тогда		
		Решение = Справочники.бит_ВидыРешенийСогласования.НайтиПоНаименованию(Decision);		
	Иначе			
		Решение = Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка();		
	КонецЕсли; 
	
	// Инициализация таблицы документов.
	ТаблицаДокументы = Новый ТаблицаЗначений;
	ТаблицаДокументы.Колонки.Добавить("Выполнять",           Новый ОписаниеТипов("Булево"));
	ТаблицаДокументы.Колонки.Добавить("ЕстьНеустановленные", Новый ОписаниеТипов("Булево"));
	ТаблицаДокументы.Колонки.Добавить("Ссылка");
	ТаблицаДокументы.Колонки.Добавить("ТипДокумента");
	ТаблицаДокументы.Колонки.Добавить("Организация",         Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДокументы.Колонки.Добавить("Комментарий",         Новый ОписаниеТипов("Строка"));
	ТаблицаДокументы.Колонки.Добавить("Id",                  Новый ОписаниеТипов("Строка"));
	ТаблицаДокументы.Колонки.Добавить("ПолноеИмяОбъекта",    Новый ОписаниеТипов("Строка"));
	
	// Разбор полученных данных и заполнение таблицы документов.
	Если Решение.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'Решение ""%1"" не найдено.'; en = 'Solution ""%1"" not found.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Decision); 
		Возврат ТекстСообщения;
	КонецЕсли;
	
	Для каждого Модель Из Objects Цикл
		МенеджерКоллекции = бит_ОбщегоНазначения.ПолучитьМенеджер(Модель.CollectionName);
		МенеджерОбъекта   = МенеджерКоллекции[Модель.ObjectName];
		Ссылка            = МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(Модель.ID));
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			МетаОбъект                      = Ссылка.Метаданные();
			НоваяСтрока                     = ТаблицаДокументы.Добавить();
			НоваяСтрока.Выполнять           = Истина;
			НоваяСтрока.ЕстьНеустановленные = Истина;
			НоваяСтрока.Ссылка              = Ссылка;
			НоваяСтрока.ТипДокумента        = ТипЗнч(Ссылка);
			НоваяСтрока.Комментарий         = Модель.Comment;
			НоваяСтрока.Id                  = Модель.Id;
			НоваяСтрока.ПолноеИмяОбъекта    = Ссылка.Метаданные().ПолноеИмя();
			
			Если бит_РаботаСМетаданными.ЕстьРеквизит("Организация", МетаОбъект) Тогда
				НоваяСтрока.Организация = Ссылка.Организация;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; // Массив для обработки.
	
	// Проверяем установлен ли комментарий, либо создана ли задача.
	СПустымиКомментариями = Новый Массив;
	Для каждого Строка Из ТаблицаДокументы Цикл
		Если НеобходимКомментарийЗадачаПолнаяПроверка(Строка.Организация, Строка.ПолноеИмяОбъекта, Решение) Тогда
			Если НЕ ЗначениеЗаполнено(Строка.Комментарий) Тогда
				Виза = ПолучитьТекущуюВизу(Строка.Ссылка);
				Если НЕ ЕстьЗадачиПоДокументу(Строка.Ссылка, Виза) Тогда
					СПустымиКомментариями.Добавить(Новый Структура("Id", Строка.Id));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если СПустымиКомментариями.Количество() > 0 Тогда
		Возврат СПустымиКомментариями;
	КонецЕсли;
	
	ОбъектыВизирования = ТаблицаДокументы.ВыгрузитьКолонку("Ссылка");
	ДоступныеВизы = ИдентификаторыДоступныхВизОбъектов(ОбъектыВизирования);
	// Выполнение установки решений.
	Для каждого СтрокаДанных Из ТаблицаДокументы Цикл
		ДоступныеВизыОбъекта = ДоступныеВизы[СтрокаДанных.Ссылка];
		Если ДоступныеВизыОбъекта = Неопределено Тогда
			ДоступныеВизыОбъекта = Новый Массив;
		КонецЕсли;
		
		ПараметрыПринятияРешения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыПринятияРешения();
		Для каждого ВизаОбъекта Из ДоступныеВизыОбъекта Цикл
			ПараметрыПринятияРешения.ОбъектВизирования         = СтрокаДанных.Ссылка;
			ПараметрыПринятияРешения.ИДВизы                    = ВизаОбъекта;
			ПараметрыПринятияРешения.Решение                   = Решение;
			ПараметрыПринятияРешения.Комментарий               = СтрокаДанных.Комментарий;
			ПараметрыПринятияРешения.ДатаУстановкиРешения      = ТекущаяДатаСеанса();
			ПараметрыПринятияРешения.ПроводитьПослеУтверждения = бит_ВизированиеСервер.ПриниматьКУчетуПослеУтверждения(СтрокаДанных.Ссылка);
			
			Обработки.бит_КонсольОперативногоВизирования.УстановитьРешениеПоВизе(ПараметрыПринятияРешения);
		КонецЦикла;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);	

	РезСтрока = "Ок";
	Возврат РезСтрока;
	
КонецФункции
 
Функция ПолучитьТекущуюВизу(ДокументСсылка)
	
	ДоступныеПустые = ПолучитьДоступныеВизыОбъекта(ДокументСсылка);
	
	ТекущаяВиза = Неопределено;
	Если ДоступныеПустые.Количество() > 0 Тогда
		ТекущаяВиза = ДоступныеПустые[0];
	КонецЕсли;
	
	Возврат ТекущаяВиза;
	
КонецФункции

Функция ЗарегистрироватьУстройство(Token, DeviceId, OS, UserName)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекПользователь = НайтиПользователя(UserName);
	МобУстройство   = Справочники.бит_МобильныеУстройства.НайтиПоРеквизиту("ИД", DeviceId);
	
	Если НЕ ЗначениеЗаполнено(МобУстройство) Тогда
		// Создаем новое мобильное устройство.
		МобУстройствоОб       = Справочники.бит_МобильныеУстройства.СоздатьЭлемент();
		МобУстройствоОб.ИД    = DeviceId;
		МобУстройствоОб.Токен = Token;
		
		Если НЕ Метаданные.Перечисления.бит_МобильныеОперационныеСистемы.ЗначенияПеречисления.Найти(OS)= Неопределено Тогда			
			ОС = Перечисления.бит_МобильныеОперационныеСистемы[OS];			
		Иначе			
			ОС = Перечисления.бит_МобильныеОперационныеСистемы.android;			
		КонецЕсли;
		
		МобУстройствоОб.ОперационнаяСистема =  ОС;
		МобУстройствоОб.Наименование = Строка(ОС) + " " + Строка(DeviceId);			
		МобУстройствоОб.ДатаРегистрации = ТекущаяДатаСеанса();
		МобУстройствоОб.УстановитьНовыйКод();
		
		УстройствоСоздано = бит_ОбщегоНазначения.ЗаписатьСправочник(МобУстройствоОб,"","Ошибки",Истина);
		
		Если УстройствоСоздано Тогда
			МобУстройство = МобУстройствоОб.Ссылка;			
		КонецЕсли; 
	Иначе	
		// Устройство было создано ранее.
		МобУстройствоОб                 = МобУстройство.ПолучитьОбъект();
		МобУстройствоОб.Токен           = Token;
		МобУстройствоОб.ПометкаУдаления = Ложь;
		бит_ОбщегоНазначения.ЗаписатьСправочник(МобУстройствоОб, "", "Ошибки", Истина);
		УстройствоСоздано = Истина;
	КонецЕсли; 

	УстройствоНазначено = Ложь;
	Если ЗначениеЗаполнено(ТекПользователь) Тогда
		Если УстройствоСоздано Тогда
			
			// Назначим устройство пользователю.
			МенеджерЗаписи = РегистрыСведений.бит_УстройстваПользователей.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Пользователь    = ТекПользователь;
			МенеджерЗаписи.Устройство      = МобУстройство;
			МенеджерЗаписи.ДатаПодключения = ТекущаяДатаСеанса();
			
			Попытка
				МенеджерЗаписи.Записать();
				УстройствоНазначено = Истина;
			Исключение
				
				ИмяСобытия = НСтр("ru = 'Регистрация устройства пользователя из мобильного приложения';
									|en = 'Registering a user''s device from a mobile application'",
									ОбщегоНазначения.КодОсновногоЯзыка());
				ТекстСообщения = НСтр("ru = 'Ошибка назначения устройства пользователю.
                                       |Описание ошибки: %1';
									   |en = 'Error assigning device to user.
                                       |Error description: %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);					
			КонецПопытки;
		КонецЕсли; 
	КонецЕсли; 
	
	РезультатСтруктура = Новый Структура("code, message, error");
	
	Если УстройствоСоздано И УстройствоНазначено Тогда
		РезультатСтруктура.code    = "200";
		РезультатСтруктура.error   = "0";
		РезультатСтруктура.message = НСтр("ru = 'New device created and assigned to user.';
											|en = 'New device created and assigned to user.'");
	ИначеЕсли НЕ УстройствоСоздано Тогда
		РезультатСтруктура.code    = "500";
		РезультатСтруктура.error   = "1";
		РезультатСтруктура.message = НСтр("ru = 'Cannot create device.'; en = 'Cannot create device.'");
	ИначеЕсли НЕ УстройствоНазначено Тогда
		РезультатСтруктура.code = "500";
		Если НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
			РезультатСтруктура.error   = "2";
			РезультатСтруктура.message = НСтр("ru = 'Cannot find the user.'; en = 'Cannot find the user.'");
		Иначе	
			РезультатСтруктура.error   = "3";
			РезультатСтруктура.message = НСтр("ru = 'Cannot assign device to user.'; en = 'Cannot assign device to user.'");
		КонецЕсли; 
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	Возврат РезультатСтруктура;
	
КонецФункции

// Функция получает объекты визирования.
//
// Параметры:
//  Пользователь	 - Строка	 - Пользователь для которого получаем список объектов визирования.
//  ИменаОбъектов	 - Строка	 - Имена типов объектов визирования, которые анализируем.
// 
// Возвращаемое значение:
//  Массив - массив структур.
//
Функция ПолучитьОбъектыВизирования(ДанныеЗапроса)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("User",       "");
	ПараметрыЗапроса.Вставить("Objects",    "");
	ПараметрыЗапроса.Вставить("DateStart",  Дата('00010101'));
	ПараметрыЗапроса.Вставить("DateFinish", Дата('00010101'));
	
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ДанныеЗапроса);
	
	Пользователь     = ПараметрыЗапроса.User;
	ИменаОбъектов    = ПараметрыЗапроса.Objects;
	НачалоПериода    = ПараметрыЗапроса.DateStart;
	ОкончаниеПериода = ПараметрыЗапроса.DateFinish;
  
	ТекПользователь  = НайтиПользователя(Пользователь);
	Если НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetObjectsForApproval.
                               |Не удалось найти пользователя по имени: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. GetObjectsForApproval method error.
                               |Could not find user by name: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Пользователь);
		ИмяСобытия = НСтр("ru = 'approval/v1/objects_for_approval'; en = 'approval/v1/objects_for_approval'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);	
	КонецЕсли; 
    
    ПараметрыСеанса.бит_ИдентификаторСеанса = Новый УникальныйИдентификатор;						 			
	
	ТипыОбъектов = Новый СписокЗначений();
	Если ТипЗнч(ИменаОбъектов) = Тип("Строка") И НЕ ПустаяСтрока(ИменаОбъектов) Тогда
		ПолученныеТипы = бит_ОбщегоНазначенияКлиентСервер.ПолучитьТипыИзСтроки(ИменаОбъектов);
		Если ПолученныеТипы.Количество()=0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		ТипыОбъектов.ЗагрузитьЗначения(ПолученныеТипы);
	КонецЕсли; 
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор); 
	МатрицаДоступа = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
	
	ПараметрыПолучения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
	ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
	ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
	ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
	ПараметрыПолучения.Отбор.ТипОбъекта         = ТипыОбъектов;

	// Отборы по дате.
	НастраиваемыеОтборы = Новый Структура;
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		НачалоПериода = СтрокаВДату(НачалоПериода);
		ЭлементОтбора                = Обработки.бит_КонсольОперативногоВизирования.НовыйЭлементВнешнегоОтбора();
		ЭлементОтбора.ЛевоеЗначение  = "Дата";
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = НачалоПериода;
		// АПК:1297-выкл Строковый параметр.
		ЭлементОтбора.Представление  = "НачалоПериода";
		// АПК:1297-вкл
		НастраиваемыеОтборы.Вставить("НачалоПериода", ЭлементОтбора);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОкончаниеПериода) Тогда
		ОкончаниеПериода = КонецДня(СтрокаВДату(ОкончаниеПериода));
		ЭлементОтбора                = Обработки.бит_КонсольОперативногоВизирования.НовыйЭлементВнешнегоОтбора();
		ЭлементОтбора.ЛевоеЗначение  = "Дата";
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = ОкончаниеПериода;
		// АПК:1297-выкл Строковый параметр.
		ЭлементОтбора.Представление  = "ОкончаниеПериода";
		// АПК:1297-вкл
		НастраиваемыеОтборы.Вставить("ОкончаниеПериода", ЭлементОтбора);
	КонецЕсли;
	Если ЗначениеЗаполнено(НастраиваемыеОтборы) Тогда
		ПараметрыПолучения.Отбор.ВнешниеОтборы = НастраиваемыеОтборы;
	КонецЕсли;
	
	// РМВ.
	Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);	
	
	Результат = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ТаблицаОбъектовВизирования = Результат.РезультатТаблицаЗначений;
	ОбъектыВизирования = Новый Массив;
	Если ТаблицаОбъектовВизирования.Количество() > 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		// Получение сведений о прикрепленных файлах.
		ВсеСсылки = ТаблицаОбъектовВизирования.ВыгрузитьКолонку("ОбъектВизирования");
		ВсеСсылки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВсеСсылки);
		ПрикрепленныеФайлы = ПолучитьИнформациюФайлов(ВсеСсылки);		
		ЗапросПлатежнойПозиции = бит_МобильноеПриложениеПереопределяемый.ЗапросПлатежнойПозиции();
		Для каждого СтрокаТаблицы Из ТаблицаОбъектовВизирования Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ОбъектВизирования) Тогда	
				Продолжить;
			КонецЕсли;
			ДанныеОбъекта = ЗаполнитьОбъектВизирования(СтрокаТаблицы, ПрикрепленныеФайлы, ЗапросПлатежнойПозиции);
			ОбъектыВизирования.Добавить(ДанныеОбъекта);		
		КонецЦикла; 
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
  
  	Возврат ОбъектыВизирования;
  	
КонецФункции
 
Функция ЗаполнитьОбъектВизирования(СтрокаТаблицы, ПрикрепленныеФайлы, ЗапросПлатежнойПозиции, ЭтоЗадача = Ложь)
	
	СтрВизы = "";
	ВизаИД = "";
	Для каждого Виза Из СтрокаТаблицы.ВизаСмешанная Цикл
		СтрВизы = СтрВизы +?(ПустаяСтрока(СтрВизы),"",", ")+ Строка(Виза);
		Если ЗначениеЗаполнено(Виза) И ПустаяСтрока(ВизаИД) Тогда			
			ВизаИД = XMLСтрока(Виза);			
		КонецЕсли; 
	КонецЦикла; 

	МетаОбъект = СтрокаТаблицы.ОбъектВизирования.Метаданные();
	Имена      = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(МетаОбъект.ПолноеИмя());
	
	МодельОбъекта = Новый Структура("ID, ObjectName, CollectionName");
	МодельОбъекта.ID             = XMLСтрока(СтрокаТаблицы.ОбъектВизирования);
	МодельОбъекта.ObjectName     = Имена.ИмяОбъекта;
	МодельОбъекта.CollectionName = Имена.ИмяКоллекции;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("Company",           Строка(СтрокаТаблицы.Организация));
	ДанныеОбъекта.Вставить("Department",        СтрСоединить(СтрокаТаблицы.ЦФОСмешанная, ", "));
	ДанныеОбъекта.Вставить("TurnoverItem",      СтрСоединить(СтрокаТаблицы.СтатьяОборотовСмешанная, ", "));
	ДанныеОбъекта.Вставить("Partner",           Строка(СтрокаТаблицы.Контрагент));
	ДанныеОбъекта.Вставить("Amount",            Формат(СтрокаТаблицы.СуммаДокумента, "ЧГ="));
	ДанныеОбъекта.Вставить("Currency",          Строка(СтрокаТаблицы.ВалютаДокумента));
	ДанныеОбъекта.Вставить("ManagerialPurpose", Строка(СтрокаТаблицы.НазначениеПлатежаУпр));
	ДанныеОбъекта.Вставить("OverBudget",        ?(ЗначениеЗаполнено(СтрокаТаблицы.СверхБюджета),СтрокаТаблицы.СверхБюджета,Ложь));
	ДанныеОбъекта.Вставить("Status",            Строка(СтрокаТаблицы.Статус));
	ДанныеОбъекта.Вставить("ResponsiblePerson", Строка(СтрокаТаблицы.Ответственный));
	ДанныеОбъекта.Вставить("Scenario",          Строка(СтрокаТаблицы.Сценарий));
	ДанныеОбъекта.Вставить("Comment",           СтрокаТаблицы.Комментарий);
	ДанныеОбъекта.Вставить("Date",              ?(ЭтоЗадача, СтрокаТаблицы.Дата, Формат(СтрокаТаблицы.Дата, "ДЛФ=D")));
	ДанныеОбъекта.Вставить("Number",            СтрокаТаблицы.Номер);
	ДанныеОбъекта.Вставить("AdditionalProps",   ДополнительныеРеквизитыОбъекта(СтрокаТаблицы.ОбъектВизирования));
	ДанныеОбъекта.Вставить("UseInternalTables", ИспользоватьВнутреннююТаблицу(СтрокаТаблицы.ОбъектВизирования));
	ДанныеОбъекта.Вставить("BasisForecast",     Неопределено);
	ДанныеОбъекта.Вставить("Executor",          "");
	ДанныеОбъекта.Вставить("PaymentDate",       "");
	
	бит_МобильноеПриложениеПереопределяемый.ДополнитьДанныеОбъекта(ДанныеОбъекта, СтрокаТаблицы, ЗапросПлатежнойПозиции, ЭтоЗадача);
	
	ОбъектВизирования = Новый Структура;		
	ОбъектВизирования.Вставить("Visas",             СтрВизы);
	ОбъектВизирования.Вставить("VisasID",           ВизаИД);
	ОбъектВизирования.Вставить("ObjectModel",       МодельОбъекта);
	ОбъектВизирования.Вставить("ObjectInfo",        ДанныеОбъекта);
	ОбъектВизирования.Вставить("ApplicationReestr", Неопределено);
	ОбъектВизирования.Вставить("Files",             Новый Массив);
	
	Если бит_МобильноеПриложениеПереопределяемый.ЭтоРеестр(СтрокаТаблицы.ОбъектВизирования) Тогда
		бит_МобильноеПриложениеПереопределяемый.ДополнитьДаннымиРеестраПлатежей(ОбъектВизирования, СтрокаТаблицы);
	КонецЕсли;
	
	// Данные о файлах.
	ПрикрепленныеФайлыОбъекта = ПрикрепленныеФайлы[СтрокаТаблицы.ОбъектВизирования];
	Если ТипЗнч(ПрикрепленныеФайлыОбъекта) = Тип("Массив") Тогда
		Для каждого ДанныеФайла Из ПрикрепленныеФайлыОбъекта Цикл
			ИнформацияОФайле = Новый Структура;
			ИнформацияОФайле.Вставить("Name",        ДанныеФайла.Наименование);
			ИнформацияОФайле.Вставить("DateChanged", ДанныеФайла.ДатаМодификацииФайла);
			ИнформацияОФайле.Вставить("ID",          ДанныеФайла.ИдФайла);
			ИнформацияОФайле.Вставить("VersionID",   ДанныеФайла.ИдВерсии);
			ИнформацияОФайле.Вставить("Ext",         ДанныеФайла.Расширение);
			ИнформацияОФайле.Вставить("Size",        ДанныеФайла.Размер);
			ОбъектВизирования.Files.Добавить(ИнформацияОФайле);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ОбъектВизирования;
	
КонецФункции

// Функция получает историю визирования.
//
// Параметры:
//  ПараметрыОбъекта - Структура - структура параметров объекта.
// 
// Возвращаемое значение:
//  Массив - массив структур.
//
Функция ПолучитьИсториюВизированияОбъектов(ДанныеЗапроса)
	
	Пользователь     = ДанныеЗапроса.User;
	ИменаОбъектов    = ДанныеЗапроса.Objects;
	НачалоПериода    = ДанныеЗапроса.DateStart;
	ОкончаниеПериода = ДанныеЗапроса.DateFinish;
	Статусы          = ДанныеЗапроса.Status;
  
	ТекПользователь  = НайтиПользователя(Пользователь);
	НачалоПериода    = СтрокаВДату(НачалоПериода);
	ОкончаниеПериода = КонецДня(СтрокаВДату(ОкончаниеПериода));
	Если НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода HistoryApproval.
                               |Не удалось найти пользователя по имени: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. HistoryApproval method error.
                               |Could not find user by name: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Пользователь);
		ИмяСобытия = НСтр("ru = 'approval/v1/HistoryApproval'; en = 'approval/v1/HistoryApproval'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);	
	КонецЕсли; 
    
    ПараметрыСеанса.бит_ИдентификаторСеанса = Новый УникальныйИдентификатор;						 			
	
	СписокТипов = Новый СписокЗначений;	
	Если ТипЗнч(ИменаОбъектов) = Тип("Строка") И НЕ ПустаяСтрока(ИменаОбъектов) Тогда
		
		ПолученныеТипы = бит_ОбщегоНазначенияКлиентСервер.ПолучитьТипыИзСтроки(ИменаОбъектов);
		Если ПолученныеТипы.Количество()=0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для каждого ТекТип Из ПолученныеТипы Цикл
			СписокТипов.Добавить(ТекТип);		
		КонецЦикла; 
	
	КонецЕсли;
	
	СписокСтатусов = Новый СписокЗначений;
	Если ТипЗнч(Статусы) = Тип("Строка") И НЕ ПустаяСтрока(Статусы) Тогда
		
		ПолученныеТипы =СтрРазделить(Статусы, ",", Ложь);
		Если ПолученныеТипы.Количество() = 0 Тогда
			СписокСтатусов.Добавить(Статусы);
		КонецЕсли;
		
		Для каждого ТекТип Из ПолученныеТипы Цикл
			СписокСтатусов.Добавить(ТекТип);		
		КонецЦикла; 
	
	КонецЕсли;
	
	ОбъектыВизирования = Новый Массив;
	АдресВХранилище    = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор); 
	МатрицаДоступа     = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
	ПараметрыПолучения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
	ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
	ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
	ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
	ПараметрыПолучения.РежимАрхива              = Истина;
	
	Если СписокТипов.Количество() > 0 Тогда
		ПараметрыПолучения.Отбор.ТипОбъекта = СписокТипов;
	КонецЕсли;
	
	НастраиваемыеОтборы = Новый Структура;
	Если СписокСтатусов.Количество() > 0 Тогда
		ЭлементОтбора                = Обработки.бит_КонсольОперативногоВизирования.НовыйЭлементВнешнегоОтбора();
		ЭлементОтбора.ЛевоеЗначение  = "Статус.Наименование";
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = СписокСтатусов;
		// АПК:1297-выкл Строковый параметр.
		ЭлементОтбора.Представление  = "ОтборПоСтатусам";
		// АПК:1297-вкл
		НастраиваемыеОтборы.Вставить("СтатусНаименование", ЭлементОтбора);
	КонецЕсли;
	
	// Отборы по дате последнего решения.
	ЭлементОтбора                = Обработки.бит_КонсольОперативногоВизирования.НовыйЭлементВнешнегоОтбора();
	ЭлементОтбора.ЛевоеЗначение  = "ДатаКрайняя";
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = НачалоПериода;
	// АПК:1297-выкл Строковый параметр.
	ЭлементОтбора.Представление  = "НачалоПериода";
	// АПК:1297-вкл
	НастраиваемыеОтборы.Вставить("НачалоПериода", ЭлементОтбора);
	
	ЭлементОтбора                = Обработки.бит_КонсольОперативногоВизирования.НовыйЭлементВнешнегоОтбора();
	ЭлементОтбора.ЛевоеЗначение  = "ДатаКрайняя";
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = ОкончаниеПериода;
	// АПК:1297-выкл Строковый параметр.
	ЭлементОтбора.Представление  = "ОкончаниеПериода";
	// АПК:1297-вкл
	НастраиваемыеОтборы.Вставить("ОкончаниеПериода", ЭлементОтбора);
	
	ПараметрыПолучения.Отбор.ВнешниеОтборы = НастраиваемыеОтборы;
	
	// РМВ.
	Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);	

	РезультатОбработки = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ТаблицаДокументов  = РезультатОбработки.РезультатТаблицаЗначений;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получение сведений о прикрепленных файлах.
	ВсеСсылки = ТаблицаДокументов.ВыгрузитьКолонку("ОбъектВизирования");
	ВсеСсылки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВсеСсылки);
	ПрикрепленныеФайлы = ПолучитьИнформациюФайлов(ВсеСсылки);
	
	ОбъектыВизирования = Новый Массив;
	Для каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ОбъектВизирования) Тогда	
			Продолжить;		
		КонецЕсли;
		// Извлекаем историю визирования.
		
		СтрВизы = "";
		ВизаИД = "";
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Объект", СтрокаТаблицы.ОбъектВизирования);
		Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияВиз.Период КАК Период,
		|	ИсторияВиз.Виза КАК Виза,
		|	ИсторияВиз.Пользователь КАК Пользователь,
		|	ИсторияВиз.Комментарий КАК Комментарий,
		|	ИсторияВиз.Решение КАК Решение
		|ИЗ
		|	РегистрСведений.бит_ИсторияИзмененияВиз КАК ИсторияВиз
		|ГДЕ
		|	ИсторияВиз.Объект = &Объект
		|	И ИсторияВиз.Пользователь = &Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		
		Результат = Запрос.Выполнить();
		Выборка   = Результат.Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		VisaHistory = Новый Структура("Row");
		Визы = Новый Массив();
		StatusDate = '00010101';
		Пока Выборка.Следующий() Цикл
			Если StatusDate = '00010101' Тогда
				StatusDate = Формат(Выборка.Период,"ДЛФ=D");
			КонецЕсли;
			
			Visa = Новый Структура;
			Visa.Вставить("Period",     Выборка.Период);
			Visa.Вставить("Visa",       Строка(Выборка.Виза));
			Visa.Вставить("User",       Строка(Выборка.Пользователь));
			Visa.Вставить("Comment",    Выборка.Комментарий);
			Visa.Вставить("Decision",   Строка(Выборка.Решение));
			Визы.Добавить(Visa);
			СтрВизы = СтрВизы +?(ПустаяСтрока(СтрВизы),"",", ")+ Строка(Выборка.Виза);
			
			Если ЗначениеЗаполнено(Выборка.Виза) Тогда			
				 ВизаИД = XMLСтрока(Выборка.Виза);			
			КонецЕсли;
		КонецЦикла;	
		VisaHistory.Row = Визы;

		МетаОбъект = СтрокаТаблицы.ОбъектВизирования.Метаданные();
		Имена      = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(МетаОбъект.ПолноеИмя());
		
		МодельОбъекта                = Новый Структура("ID, ObjectName, CollectionName");
		МодельОбъекта.ID             = XMLСтрока(СтрокаТаблицы.ОбъектВизирования);
		МодельОбъекта.ObjectName     = Имена.ИмяОбъекта;
		МодельОбъекта.CollectionName = Имена.ИмяКоллекции;
		
		ДанныеОбъекта = Новый Структура;
		ДанныеОбъекта.Вставить("Company",           Строка(СтрокаТаблицы.Организация));
		ДанныеОбъекта.Вставить("Department",        СтрСоединить(СтрокаТаблицы.ЦФОСмешанная, ", "));
		ДанныеОбъекта.Вставить("TurnoverItem",      СтрСоединить(СтрокаТаблицы.СтатьяОборотовСмешанная, ", "));
		ДанныеОбъекта.Вставить("Partner",           Строка(СтрокаТаблицы.Контрагент));
		ДанныеОбъекта.Вставить("Amount",            Формат(СтрокаТаблицы.СуммаДокумента, "ЧГ="));
		ДанныеОбъекта.Вставить("Currency",          Строка(СтрокаТаблицы.ВалютаДокумента));
		ДанныеОбъекта.Вставить("ManagerialPurpose", Строка(СтрокаТаблицы.НазначениеПлатежаУпр));
		ДанныеОбъекта.Вставить("OverBudget",        ?(ТипЗнч(СтрокаТаблицы.СверхБюджета) = Тип("Булево"), СтрокаТаблицы.СверхБюджета, Ложь));
		ДанныеОбъекта.Вставить("Status",            Строка(СтрокаТаблицы.Статус));
		ДанныеОбъекта.Вставить("StatusDate",        Формат(StatusDate,"ДЛФ=D"));
		ДанныеОбъекта.Вставить("ResponsiblePerson", Строка(СтрокаТаблицы.Ответственный));
		ДанныеОбъекта.Вставить("Scenario",          Строка(СтрокаТаблицы.Сценарий));
		ДанныеОбъекта.Вставить("Comment",           СтрокаТаблицы.Комментарий);
		ДанныеОбъекта.Вставить("Date",              Формат(СтрокаТаблицы.Дата, "ДЛФ=D"));
		ДанныеОбъекта.Вставить("Number",            СтрокаТаблицы.Номер);
		ДанныеОбъекта.Вставить("AdditionalProps",   ДополнительныеРеквизитыОбъекта(СтрокаТаблицы.ОбъектВизирования));
		ДанныеОбъекта.Вставить("UseInternalTables", ИспользоватьВнутреннююТаблицу(СтрокаТаблицы.ОбъектВизирования));
		ДанныеОбъекта.Вставить("BasisForecast",     Неопределено);
		ДанныеОбъекта.Вставить("Executor",          "");
		ДанныеОбъекта.Вставить("PaymentDate",       "");
		// N.B.
		Если СтрокаТаблицы.Статус.Наименование = "Проверен"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Утвержден"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Закрыта"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Исполнена"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Утверждена"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Оплачена"
			ИЛИ СтрокаТаблицы.Статус.Наименование = "Выполнена" Тогда
			
			ДанныеОбъекта.Вставить("Agreed", Истина);
		Иначе 
			ДанныеОбъекта.Вставить("Agreed", Ложь);
		КонецЕсли;
		бит_МобильноеПриложениеПереопределяемый.ДополнитьДанныеОбъекта(ДанныеОбъекта, СтрокаТаблицы); 
		
		ОбъектВизирования = Новый Структура;
		ОбъектВизирования.Вставить("Visas",             СтрВизы);
		ОбъектВизирования.Вставить("VisasID",           ВизаИД);
		ОбъектВизирования.Вставить("ObjectModel",       МодельОбъекта);
		ОбъектВизирования.Вставить("ObjectInfo",        ДанныеОбъекта);
		ОбъектВизирования.Вставить("VisaHistory",       VisaHistory);
		ОбъектВизирования.Вставить("ApplicationReestr", Неопределено);
		ОбъектВизирования.Вставить("Files",             Новый Массив);
		
		Если бит_МобильноеПриложениеПереопределяемый.ЭтоРеестр(СтрокаТаблицы.ОбъектВизирования) Тогда
			бит_МобильноеПриложениеПереопределяемый.ДополнитьДаннымиРеестраПлатежей(ОбъектВизирования, СтрокаТаблицы);
		КонецЕсли;
		
		// Данные о файлах.
		ПрикрепленныеФайлыОбъекта = ПрикрепленныеФайлы[СтрокаТаблицы.ОбъектВизирования];
		Если ТипЗнч(ПрикрепленныеФайлыОбъекта) = Тип("Массив") Тогда
			Для каждого ДанныеФайла Из ПрикрепленныеФайлыОбъекта Цикл
				ИнформацияОФайле = Новый Структура;
				ИнформацияОФайле.Вставить("Name",        ДанныеФайла.Наименование);
				ИнформацияОФайле.Вставить("DateChanged", ДанныеФайла.ДатаМодификацииФайла);
				ИнформацияОФайле.Вставить("ID",          ДанныеФайла.ИдФайла);
				ИнформацияОФайле.Вставить("VersionID",   ДанныеФайла.ИдВерсии);
				ИнформацияОФайле.Вставить("Ext",         ДанныеФайла.Расширение);
				ИнформацияОФайле.Вставить("Size",        ДанныеФайла.Размер);
				ОбъектВизирования.Files.Добавить(ИнформацияОФайле);
			КонецЦикла;
		КонецЕсли;
		
		ОбъектыВизирования.Добавить(ОбъектВизирования);		
		
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);
  
  	Возврат ОбъектыВизирования;
  	
КонецФункции

Функция ПолучитьСтатусы()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Статусы.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.бит_ОбъектыМобильногоВизирования КАК ОбъектыВизирования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_СтатусыОбъектов КАК Статусы
	|		ПО ОбъектыВизирования.ОбъектСистемы = Статусы.Объект";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПереченьСтатусов = Новый Массив();
	Пока Выборка.Следующий() Цикл
		ПереченьСтатусов.Добавить(Выборка.Наименование);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПереченьСтатусов;
	
КонецФункции

Функция ВидыРешенийСогласования(ДанныеЗапроса)

	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;		

	Результат = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВидыРешенийСогласования.ОбъектСистемы КАК ОбъектСистемы,
	|	ВидыРешенийСогласования.Организация КАК Организация,
	|	ВидыРешенийСогласования.ВидРешения КАК ВидРешения,
	|	ВидыРешенийСогласования.НеобходимКомментарийЗадача КАК НеобходимКомментарийЗадача,
	|	ВидыРешенийСогласования.КодСортировки КАК КодСортировки,
	|	ВЫБОР
	|		КОГДА Решения.ТипРешения = ЗНАЧЕНИЕ(Перечисление.бит_ТипыРешений.Согласующее)
	|			ТОГДА ИСТИНА
	|		КОГДА Решения.ТипРешения = ЗНАЧЕНИЕ(Перечисление.бит_ТипыРешений.Отклоняющее)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СогласующееРешение
	|ИЗ
	|	РегистрСведений.бит_НазначениеВидовРешенийСогласования КАК ВидыРешенийСогласования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ВидыРешенийСогласования КАК Решения
	|		ПО ВидыРешенийСогласования.ВидРешения = Решения.Ссылка
	|ГДЕ
	|	НЕ ВидыРешенийСогласования.ВидРешения.Отключено
	|	И &ДопУсловие
	|ИТОГИ ПО
	|	ОбъектСистемы,
	|	Организация";
	
	Запрос = Новый Запрос;
	Если ДанныеЗапроса.Количество() > 0 Тогда
		ОбъектыСистемы = ПолучитьОбъектыСистемы(ДанныеЗапроса);
		Запрос.УстановитьПараметр("ОбъектыСистемы", ОбъектыСистемы);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДопУсловие","ВидыРешенийСогласования.ОбъектСистемы В(&ОбъектыСистемы)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ДопУсловие","");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаОбъектСистемы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъектСистемы.Следующий() Цикл
		
		ОбъектСистемы             = Новый Структура("Id, Description, Organizations");
		ОбъектСистемы.Id          = XMLСтрока(ВыборкаОбъектСистемы.ОбъектСистемы);
		ОбъектСистемы.Description = Строка(ВыборкаОбъектСистемы.ОбъектСистемы);
		
		Организации = Новый Массив;
		ВыборкаОрганизация = ВыборкаОбъектСистемы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОрганизация.Следующий() Цикл
						
			Решения = Новый Массив;
			Выборка = ВыборкаОрганизация.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Решение                   = Новый Структура("Id, Description, NeedCommentOrTask, Priority, Approval");
				Решение.Id                = XMLСтрока(Выборка.ВидРешения);
				Решение.Description       = Строка(Выборка.ВидРешения);
				Решение.NeedCommentOrTask = Выборка.НеобходимКомментарийЗадача;
				Решение.Priority          = Выборка.КодСортировки;
				Решение.Approval          = Выборка.СогласующееРешение;
				
				Решения.Добавить(Решение);
			КонецЦикла;
			
			ТекущаяОрганизация             = Новый Структура("Id, Description, Decisions");
			ТекущаяОрганизация.Id          = XMLСтрока(ВыборкаОрганизация.Организация);
			ТекущаяОрганизация.Description = Строка(ВыборкаОрганизация.Организация);
			ТекущаяОрганизация.Decisions   = Решения;
			
			Организации.Добавить(ТекущаяОрганизация);
			
		КонецЦикла;
		
		ОбъектСистемы.Organizations = Организации;
		
		Результат.Добавить(ОбъектСистемы);
		
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции 

Функция ИсторияВизирования(Ид, Имя)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если бит_МобильноеПриложениеПереопределяемый.ЭтоСправочник(Имя) Тогда
		МенеджерОбъекта = Справочники[Имя];
	Иначе
		МенеджерОбъекта = Документы[Имя];
	КонецЕсли;
	УИД    = Новый УникальныйИдентификатор(Ид);
	Ссылка = МенеджерОбъекта.ПолучитьСсылку(УИД);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсторияВизирования.Период КАК Период,
	|	ИсторияВизирования.Виза КАК Виза,
	|	ИсторияВизирования.Пользователь КАК Пользователь,
	|	ИсторияВизирования.Комментарий КАК Комментарий,
	|	ИсторияВизирования.Решение КАК Решение
	|ИЗ
	|	РегистрСведений.бит_ИсторияИзмененияВиз КАК ИсторияВизирования
	|ГДЕ
	|	ИсторияВизирования.Объект = &Объект";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Запись = Новый Структура();
		Запись.Вставить("Period",   Выборка.Период);
		Запись.Вставить("Visa",     Строка(Выборка.Виза));
		Запись.Вставить("User",     Строка(Выборка.Пользователь));
		Запись.Вставить("Comment",  Строка(Выборка.Комментарий));
		Запись.Вставить("Decision", Строка(Выборка.Решение));
		Результат.Добавить(Запись);
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДоступныеВизыОбъекта(ОбъектВизирования)
	
	Результат          = Новый Массив;
	АдресВХранилище    = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор);
	МатрицаДоступа     = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
	ПараметрыПолучения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
	ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
	ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
	ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
	ПараметрыПолучения.Отбор.ОбъектВизирования  = ОбъектВизирования;
	Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);	
	РезультатОбработки = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ТаблицаОбъектов    = РезультатОбработки.РезультатТаблицаЗначений;
	
	Если ТаблицаОбъектов.Количество() > 0 Тогда
		СтрокаТаблицы = ТаблицаОбъектов[0];
		Для каждого Виза Из СтрокаТаблицы.ВизаСмешанная Цикл
			Результат.Добавить(Виза);
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьДоступныеВизыОбъектов(ОбъектыВизирования, ВозвращатьИДРегистраВиз = Ложь)
	
	Результат = Новый Соответствие;
	
	Если ОбъектыВизирования.Количество() > 0 Тогда
		ОтборОбъектыВизирования = Новый СписокЗначений;
		ОтборОбъектыВизирования.ЗагрузитьЗначения(ОбъектыВизирования);
		
		АдресВХранилище     = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор);
		МатрицаДоступа      = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
		ПараметрыПолучения  = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
		ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
		ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
		ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
		ПараметрыПолучения.Отбор.ОбъектВизирования  = ОтборОбъектыВизирования;
		Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);	
		РезультатОбработки = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ТаблицаОбъектов    = РезультатОбработки.РезультатТаблицаЗначений;
		
		Для каждого СтрокаТаблицы Из ТаблицаОбъектов Цикл
			Визы = Новый Массив;
			Для каждого Виза Из СтрокаТаблицы.ВизаСмешанная Цикл
				ПараметрыВизы = Новый Структура;
				ПараметрыВизы.Вставить("Id",          XMLСтрока(Виза));
				ПараметрыВизы.Вставить("Description", Виза.Наименование);
				Если ВозвращатьИДРегистраВиз Тогда
					ПараметрыВизы.Вставить("МассивИД", СтрокаТаблицы.ИД);
				КонецЕсли;
				Визы.Добавить(ПараметрыВизы);
			КонецЦикла;
			Результат.Вставить(СтрокаТаблицы.ОбъектВизирования, Визы)
		КонецЦикла; 
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторыДоступныхВизОбъектов(ОбъектыВизирования)
	
	Результат = Новый Соответствие;
	
	Если ОбъектыВизирования.Количество() > 0 Тогда
		ОтборОбъектыВизирования = Новый СписокЗначений;
		ОтборОбъектыВизирования.ЗагрузитьЗначения(ОбъектыВизирования);
		
		АдресВХранилище                             = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор);
		МатрицаДоступа                              = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
		ПараметрыПолучения                          = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
		ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
		ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
		ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
		ПараметрыПолучения.Отбор.ОбъектВизирования  = ОтборОбъектыВизирования;
		Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);	
		
		РезультатОбработки = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ТаблицаОбъектов    = РезультатОбработки.РезультатТаблицаЗначений;
		
		Для каждого СтрокаТаблицы Из ТаблицаОбъектов Цикл
			Результат.Вставить(СтрокаТаблицы.ОбъектВизирования, СтрокаТаблицы.ИД)
		КонецЦикла; 
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Задачи

Функция ПринятьЗадачуЗапрос(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/task/accept'; en = 'approval/v1/task/accept'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ПринятьЗадачу(ДанныеЗапроса.ID, ДанныеЗапроса.Result);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода AcceptTask.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the AcceptTask method.
                                   |Parameters: %1
                                   |Result: %2'");	
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода AcceptTask.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. Call the AcceptTask method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);				
		Ответ = Ложь;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ВыполнитьЗадачуЗапрос(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/task/perform'; en = 'approval/v1/task/perform'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ВыполнитьЗадачу(ДанныеЗапроса.ID, ДанныеЗапроса.Result);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода PerformTask.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the PerformTask method.
                                   |Parameters: %1
                                   |Result: %2'");	
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода PerformTask.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. Error of the PerformTask method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);				
		Ответ = Ложь;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ОбновитьЗадачуЗапрос(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/task/update'; en = 'approval/v1/task/update'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = ЗаписатьЗадачу(ДанныеЗапроса.ID, ДанныеЗапроса.Result);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода SaveTask.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the SaveTask method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода SaveTask.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. Error of SaveTask method.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);						
		Ответ = Ложь;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция СоздатьЗадачуЗапрос(Запрос)
	
	ИмяСобытия = НСтр("ru = 'approval/v1/task/create'; en = 'approval/v1/task/create'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Попытка
		ЗапросJSON    = Запрос.ПолучитьТелоКакСтроку();
		ДанныеЗапроса = ЗначениеИзСтрокиJSON(ЗапросJSON);
		Результат     = СоздатьЗадачу(ДанныеЗапроса);
		Ответ         = СформироватьОтветJSON(Результат);
		Если Константы.бит_РежимОтладкиВебСервисов.Получить() Тогда			
			ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Вызов метода CreateTask.
                                   |Параметры: %1
                                   |Результат: %2';
								   |en = 'HTTP service bit_ApprovalServiceNew. Call the CreateTask method.
                                   |Parameters: %1
                                   |Result: %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON, Ответ); 
			ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);				
		КонецЕсли; 
	Исключение
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода CreateTask.
                               |Параметры: %1
                               |Описание ошибки: %2';
							   |en = 'HTTP service bit_ApprovalServiceNew. CreateTask method error.
                               |Parameters: %1
                               |Error description: %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЗапросJSON,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		ЗарегистрироватьИнформацию(ИмяСобытия, ТекстСообщения);		
		Ответ = Ложь;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ЕстьЗадачиПоДокументу(Ссылка, Виза)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Задача.Ссылка КАК Ссылка,
	|	Задача.Предмет КАК Предмет
	|ИЗ
	|	Задача.бит_Задача КАК Задача
	|ГДЕ
	|	Задача.Виза = &Виза
	|	И Задача.Предмет = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Виза",   Виза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьЗадачи(User)
	
	УстановитьПривилегированныйРежим(Истина);	
	Результат = Новый Массив;
	ТекПользователь = НайтиПользователя(User);
	Если НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода Tasks.
                               |Не удалось найти пользователя по имени: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. Tasks method error.
                               |Could not find user by name: %1'");		
		ТекстСообщения = СтрШаблон(ТекстСообщения, User);
		ИмяСобытия = НСтр("ru = 'approval/v1/tasks'; en = 'approval/v1/tasks'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
	КонецЕсли; 
	
	ТипыОбъектовВизирования = бит_МобильноеПриложениеПереопределяемый.ТипыОбъектов();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекПользователь",         ТекПользователь);
	Запрос.УстановитьПараметр("ТипыОбъектовВизирования", ТипыОбъектовВизирования);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""MyTasks"" КАК Direction,
	|	ЗадачаПоИсполнителю.Ссылка КАК Ref,
	|	ЗадачаПоИсполнителю.Выполнена КАК IsCompleted,
	|	ЗадачаПоИсполнителю.Номер КАК Number,
	|	ЗадачаПоИсполнителю.Состояние КАК State,
	|	ЕСТЬNULL(ЗадачаПоИсполнителю.Состояние.Наименование, """") КАК StateName,
	|	ЗадачаПоИсполнителю.Дата КАК Date,
	|	ЗадачаПоИсполнителю.СрокИсполнения КАК Deadline,
	|	ЗадачаПоИсполнителю.Наименование КАК Name,
	|	ЗадачаПоИсполнителю.Автор КАК Author,
	|	ЕСТЬNULL(ЗадачаПоИсполнителю.Автор.Наименование, """") КАК AuthorName,
	|	ЗадачаПоИсполнителю.Исполнитель КАК Responsible,
	|	ЕСТЬNULL(ЗадачаПоИсполнителю.Исполнитель.Наименование, """") КАК ResponsibleName,
	|	ЗадачаПоИсполнителю.Важность КАК Importance,
	|	ЗадачаПоИсполнителю.Описание КАК Description,
	|	ЗадачаПоИсполнителю.РезультатВыполнения КАК Result,
	|	ЗадачаПоИсполнителю.Предмет КАК Object
	|ПОМЕСТИТЬ ВсеЗадачи
	|ИЗ
	|	Задача.бит_Задача.ЗадачиПоИсполнителю(
	|			&ТекПользователь,
	|			Выполнена = ЛОЖЬ
	|				И АлгоритмПодчиненный = ЗНАЧЕНИЕ(Справочник.бит_АлгоритмыПроцессов.ПустаяСсылка)
	|				И Состояние <> ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.Задача_Остановлена)) КАК ЗадачаПоИсполнителю
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""TasksFromMe"",
	|	Задача.Ссылка,
	|	Задача.Выполнена,
	|	Задача.Номер,
	|	Задача.Состояние,
	|	ЕСТЬNULL(Задача.Состояние.Наименование, """"),
	|	Задача.Дата,
	|	Задача.СрокИсполнения,
	|	Задача.Наименование,
	|	Задача.Автор,
	|	ЕСТЬNULL(Задача.Автор.Наименование, """"),
	|	Задача.Исполнитель,
	|	ЕСТЬNULL(Задача.Исполнитель.Наименование, """"),
	|	Задача.Важность,
	|	Задача.Описание,
	|	Задача.РезультатВыполнения,
	|	Задача.Предмет
	|ИЗ
	|	Задача.бит_Задача КАК Задача
	|ГДЕ
	|	Задача.Автор = &ТекПользователь
	|	И Задача.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.бит_Процесс.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеЗадачи.Object КАК Object
	|ИЗ
	|	ВсеЗадачи КАК ВсеЗадачи
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ВсеЗадачи.Object) В (&ТипыОбъектовВизирования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЗадачи.Direction КАК Direction,
	|	ВсеЗадачи.Ref КАК Ref,
	|	ВсеЗадачи.IsCompleted КАК IsCompleted,
	|	ВсеЗадачи.Number КАК Number,
	|	ВсеЗадачи.State КАК State,
	|	ВсеЗадачи.StateName КАК StateName,
	|	ВсеЗадачи.Date КАК Date,
	|	ВсеЗадачи.Deadline КАК Deadline,
	|	ВсеЗадачи.Name КАК Name,
	|	ВсеЗадачи.Author КАК Author,
	|	ВсеЗадачи.AuthorName КАК AuthorName,
	|	ВсеЗадачи.Responsible КАК Responsible,
	|	ВсеЗадачи.ResponsibleName КАК ResponsibleName,
	|	ВсеЗадачи.Importance КАК Importance,
	|	ВсеЗадачи.Description КАК Description,
	|	ВсеЗадачи.Result КАК Result,
	|	ВсеЗадачи.Object КАК Object
	|ИЗ
	|	ВсеЗадачи КАК ВсеЗадачи";
				   
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ОбъектыЗадач = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Object");
	РеквизитыОбъектовЗадач = Новый ТаблицаЗначений;
	Если ОбъектыЗадач.Количество() > 0 Тогда
		РеквизитыОбъектовЗадач = РеквизитыОбъектов(ОбъектыЗадач);	
		// Получение сведений о прикрепленных файлах.
		ПрикрепленныеФайлы = ПолучитьИнформациюФайлов(ОбъектыЗадач);
	КонецЕсли;
	
	ЗапросПлатежнойПозиции = бит_МобильноеПриложениеПереопределяемый.ЗапросПлатежнойПозиции();
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МетаОбъект = Выборка.Ref.Метаданные();
		Имена = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(МетаОбъект.ПолноеИмя());
		
		МодельОбъекта = Новый Структура("ID, ObjectName, CollectionName");
		МодельОбъекта.ID             = XMLСтрока(Выборка.Ref);
		МодельОбъекта.ObjectName     = Имена.ИмяОбъекта;
		МодельОбъекта.CollectionName = Имена.ИмяКоллекции;
		
		Задача = Новый Структура;
		Задача.Вставить("ObjectModel",     МодельОбъекта);
		Задача.Вставить("Direction",       Выборка.Direction);
		Задача.Вставить("IsCompleted",     Выборка.IsCompleted);
		Задача.Вставить("Number",          Выборка.Number);
		Задача.Вставить("State",           Выборка.StateName);
		Задача.Вставить("Date",            Выборка.Date);
		Задача.Вставить("Deadline",        Выборка.Deadline);
		Задача.Вставить("Name",            Выборка.Name);
		Задача.Вставить("Author",          Выборка.AuthorName);
		Задача.Вставить("Responsible",     Выборка.ResponsibleName);
		Задача.Вставить("Importance",      Строка(Выборка.Importance));
		Задача.Вставить("Description",     Выборка.Description);
		Задача.Вставить("Result",          Выборка.Result);
		Задача.Вставить("Object",          Строка(Выборка.Object));
		Задача.Вставить("RelatedDocument", Неопределено);
		
		Если ЗначениеЗаполнено(Выборка.Object)
			И РеквизитыОбъектовЗадач.Количество() > 0 Тогда
			
			ОбъектЗадачи = РеквизитыОбъектовЗадач.Найти(Выборка.Object ,"ОбъектВизирования");
			Если ОбъектЗадачи <> Неопределено Тогда
				Задача.RelatedDocument = ЗаполнитьОбъектВизирования(ОбъектЗадачи, ПрикрепленныеФайлы, ЗапросПлатежнойПозиции, Истина);
			КонецЕсли;
		КонецЕсли;
		
		Результат.Добавить(Задача);		
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыОбъектов(ОбъектыЗадач, РежимАрхива = Ложь, РежимПолученияРеквизитов = Ложь)
	
	СписокОбъектовВизирования = Новый СписокЗначений;
	СписокОбъектовВизирования.ЗагрузитьЗначения(ОбъектыЗадач);
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор); 
	МатрицаДоступа = Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа();
	
	ПараметрыПолучения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
	ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа;
	ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
	ПараметрыПолучения.ЭтоМобильноеПриложение   = Истина;
	ПараметрыПолучения.РежимАрхива              = РежимАрхива;
	ПараметрыПолучения.РежимПолученияРеквизитов = РежимПолученияРеквизитов;
	ПараметрыПолучения.Отбор.ОбъектВизирования  = СписокОбъектовВизирования;
 	Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);	
	
	Результат = ПолучитьИзВременногоХранилища(АдресВХранилище);
	Возврат Результат.РезультатТаблицаЗначений;
	
КонецФункции

Функция ПринятьЗадачу(ID, Result)
	
	Результат    = Ложь;
	ЗадачаСсылка = Задачи.бит_Задача.ПолучитьСсылку(Новый УникальныйИдентификатор(ID));
	Если ЗначениеЗаполнено(ЗадачаСсылка) Тогда
		Структура = Новый Структура;
		Если ЗначениеЗаполнено(Result) Тогда		
			Структура.Вставить("РезультатВыполнения", Result);		
		КонецЕсли; 		
		Результат = Задачи.бит_Задача.ПринятьЗадачу(ЗадачаСсылка,,Структура);		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьЗадачу(ID, Result)
	
	Результат    = Ложь;
	ЗадачаСсылка = Задачи.бит_Задача.ПолучитьСсылку(Новый УникальныйИдентификатор(ID));
	Если ЗначениеЗаполнено(ЗадачаСсылка) Тогда
		СтрПар = Новый Структура;
		Если ЗначениеЗаполнено(Result) Тогда		
			СтрПар.Вставить("РезультатВыполнения", Result);		
		КонецЕсли; 
		Результат = Задачи.бит_Задача.ОтметитьВыполнение(ЗадачаСсылка,,,СтрПар);
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьЗадачу(ID, Result)
	
	Результат    = Ложь;
	ЗадачаСсылка = Задачи.бит_Задача.ПолучитьСсылку(Новый УникальныйИдентификатор(ID));
	Если ЗначениеЗаполнено(ЗадачаСсылка) И ЗначениеЗаполнено(Result) Тогда
		ЗадачаОб = ЗадачаСсылка.ПолучитьОбъект();
		ЗадачаОб.РезультатВыполнения = Result;
		Результат = бит_ОбщегоНазначения.ЗаписатьЗадачу(ЗадачаОб);
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьЗадачу(ПараметрыЗадачи)
	
	Name        = ПараметрыЗадачи.Name;
	Description = ПараметрыЗадачи.Description;
	Importance  = ПараметрыЗадачи.Importance;
	Deadline    = ПараметрыЗадачи.Deadline;
	Responsible = ПараметрыЗадачи.Responsible;
	ObjectName  = ПараметрыЗадачи.ObjectName;
	ObjectID    = ПараметрыЗадачи.ObjectID;
	VisaID      = ПараметрыЗадачи.VisaID;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Ложь;
	
	// Попытаемся найти ответственного по строке.
	ОтветственныйСсылка = НайтиПользователя(Responsible);	
	Если НЕ ЗначениеЗаполнено(ОтветственныйСсылка) Тогда
		// Ответственный был указан неверно - ставим ответственным самого пользователя.
		ОтветственныйСсылка = Пользователи.ТекущийПользователь();
	КонецЕсли; 
	
	Попытка
		Важность = Перечисления.бит_ВидыВажностиЗадач[Importance];
	Исключение
		// Не удалось определить - по умолчанию.
		Важность = Перечисления.бит_Важность.Средняя;
	КонецПопытки;
	
	Попытка
		Срок = Дата(Deadline);
	Исключение
		// Не удалось определить - по умолчанию
		Срок = НачалоДня(КонецДня(ТекущаяДатаСеанса())+1);
	КонецПопытки;
	
	Предмет = Неопределено;
	Если ЗначениеЗаполнено(ObjectName) И ЗначениеЗаполнено(ObjectID) Тогда
		Если бит_РаботаСМетаданными.ОбъектПринадлежитКоллекцииМетаданных("Документы",ObjectName) Тогда
			Предмет = Документы[ObjectName].ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectID));
		ИначеЕсли бит_РаботаСМетаданными.ОбъектПринадлежитКоллекцииМетаданных("Справочники",ObjectName) Тогда	
			Предмет = Справочники[ObjectName].ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectID));
		КонецЕсли;	
	КонецЕсли; 
	
	Виза = Справочники.бит_Визы.ПустаяСсылка();
	Если ЗначениеЗаполнено(VisaID) Тогда
		Виза = Справочники.бит_Визы.ПолучитьСсылку(Новый УникальныйИдентификатор(VisaID));
	КонецЕсли; 
	
	СтрЗадача = Задачи.бит_Задача.СтруктураЗадачи();
	СтрЗадача.Наименование    = Name;
	СтрЗадача.Описание        = Description;
	СтрЗадача.Важность        = Важность;
	СтрЗадача.Исполнитель     = ОтветственныйСсылка;
	СтрЗадача.СрокИсполнения  = Срок;
	СтрЗадача.СпособАдресации = 0;
	СтрЗадача.Предмет         = Предмет;
	СтрЗадача.Виза            = Виза;
	
	МаксКоличествоОбъектов = бит_УправлениеПроцессами.МаксимальноеКоличествоОбъектовАдресации();	
	ЗадачаСсылка = Задачи.бит_Задача.СоздатьНовуюЗадачу(СтрЗадача, МаксКоличествоОбъектов);
	Результат = ?(ЗначениеЗаполнено(ЗадачаСсылка), Истина, Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Файлы

// Функция получает информацию о файлах, прикрепленных к документам.
Функция ПолучитьИнформациюФайлов(Объекты)
	
	ПрикрепленныеФайлы = Новый Соответствие;
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаХранения.ВладелецФайла КАК ВладелецФайла,
	|	ТаблицаХранения.Ссылка КАК Файл,
	|	ТаблицаХранения.Наименование КАК Наименование,
	|	ТаблицаХранения.ДатаМодификацииУниверсальная КАК ДатаМодификацииФайла,
	|	ТаблицаХранения.Расширение КАК Расширение,
	|	ТаблицаХранения.Размер КАК Размер
	|ИЗ
	|	&ИмяТаблицыХранения КАК ТаблицаХранения
	|ГДЕ
	|	НЕ ТаблицаХранения.ПометкаУдаления
	|	И ТаблицаХранения.ВладелецФайла В(&ИмяПараметраВладельцев)";
	
	Разделитель =
	"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	ШаблонЗапросаИтоги = 
	"
	|
	|ИТОГИ ПО
	|	ВладелецФайла";
	
	ТекстыЗапросов = Новый Массив;
	Ном = 1;
	// Группируем ссылки по именам объектов.
	СсылкиПоТипам = СгруппироватьОбъектыПоТипам(Объекты);
	Запрос = Новый Запрос;
	Для каждого КиЗ Из СсылкиПоТипам Цикл
		ИмяСправочника = КиЗ.Ключ + "ПрисоединенныеФайлы";
		Если Метаданные.Справочники.Найти(ИмяСправочника) = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		ИмяПараметраВладельцев = "МассивСсылок_" + Формат(Ном, "ЧГ=");
		Запрос.УстановитьПараметр(ИмяПараметраВладельцев, КиЗ.Значение);
		ТекстЗапроса = ШаблонЗапроса;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяПараметраВладельцев", ИмяПараметраВладельцев);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицыХранения", "Справочник." + ИмяСправочника);
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		Ном = Ном + 1;
	КонецЦикла;
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, Разделитель);
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		ТекстЗапроса = ТекстЗапроса + ШаблонЗапросаИтоги;
		Запрос.Текст = ТекстЗапроса;
		Результат = Запрос.Выполнить();
		ВыборкаВладелец = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВладелец.Следующий() Цикл
			Выборка = ВыборкаВладелец.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Файлы = Новый Массив;
			Пока Выборка.Следующий() Цикл
				ДанныеФайла = Новый Структура;
				ДанныеФайла.Вставить("Размер"              , Выборка.Размер);
				ДанныеФайла.Вставить("Расширение"          , Выборка.Расширение);
				ДанныеФайла.Вставить("Наименование"        , Выборка.Наименование);
				ДанныеФайла.Вставить("ДатаМодификацииФайла", Выборка.ДатаМодификацииФайла);
				ДанныеФайла.Вставить("ИдФайла"             , XMLСтрока(Выборка.Файл));
				ДанныеФайла.Вставить("ИдВерсии"            , XMLСтрока(Выборка.Файл));
				Файлы.Добавить(ДанныеФайла);
			КонецЦикла;
			ПрикрепленныеФайлы.Вставить(ВыборкаВладелец.ВладелецФайла, Файлы);
		КонецЦикла;
	КонецЕсли;
	
	// Дополним прикрепленные файлы файлами проектов договоров.
	бит_МобильноеПриложениеПереопределяемый.ПрикрепленныеФайлыПроектовДоговоров(ПрикрепленныеФайлы, СсылкиПоТипам);
	
	Возврат ПрикрепленныеФайлы;
	
КонецФункции

// Группирует массив объектов по типам объектов.
Функция СгруппироватьОбъектыПоТипам(Объекты)
	
	СсылкиПоТипам = Новый Структура;
	Для каждого ТекДок Из Объекты Цикл
		ИмяДок = ТекДок.Метаданные().Имя;
		Если СсылкиПоТипам.Свойство(ИмяДок) Тогда
			СсылкиПоТипам[ИмяДок].Добавить(ТекДок);
		Иначе
			СсылкиПоТипам.Вставить(ИмяДок, Новый Массив);
			СсылкиПоТипам[ИмяДок].Добавить(ТекДок);
		КонецЕсли;	  
	КонецЦикла;	  
	
	Возврат СсылкиПоТипам;
	
КонецФункции

#КонецОбласти

#Область ДопИзмерения

Функция ПолучитьНазначенияДополнительныхИзмерений()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДопИзмерения.ИмяИзмерения КАК ИмяИзмерения,
	|	ДопИзмерения.Синоним КАК Синоним
	|ИЗ
	|	РегистрСведений.бит_НазначениеДополнительныхИзмерений КАК ДопИзмерения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Измерения = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДопИзмерение = Новый Структура("Name, Description", Выборка.ИмяИзмерения, Выборка.Синоним);
		Измерения.Добавить(ДопИзмерение);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Измерения;
	
КонецФункции

Функция ПолучитьОбъектыСДопИзмерениями(ДанныеЗапроса)
	
	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = Новый Массив;
	ОбъектыКонфигурации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗапроса, "ObjectTypes", Неопределено);
	Если ТипЗнч(ОбъектыКонфигурации) = Тип("Массив") Тогда
		Для каждого ОбъектКонфигурации Из ОбъектыКонфигурации Цикл
			ТипОбъекта = ОбъектКонфигурации.ObjectType;
			Если СтрНачинаетсяС(ТипОбъекта, "ДокументСсылка.") Тогда
				ОбъектыВизирования = ОбъектКонфигурации.DocsArray;
				Аналитики    = ОбъектКонфигурации.AnalyticsArray;
				ИмяДокумента = СтрЗаменить(ТипОбъекта, "ДокументСсылка.", "");
				ДокументыСДопИзмерениями = Новый Массив;
				Для каждого ОбъектаУИД Из ОбъектыВизирования Цикл
					ДокументУИД    = Новый УникальныйИдентификатор(ОбъектаУИД);
					ДокументСсылка = Документы[ИмяДокумента].ПолучитьСсылку(ДокументУИД);
					ДокументыСДопИзмерениями.Добавить(ДокументСсылка);
				КонецЦикла;
				СуществующиеАналитики = ПолучитьСуществующиеАналитики(ИмяДокумента, Аналитики);
				СформироватьДанныеПоДопИзмерениям(ТипОбъекта, ИмяДокумента, ДокументыСДопИзмерениями, СуществующиеАналитики, Результат);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСуществующиеАналитики(ИмяДокумента, Аналитики)

	Результат     = Новый Массив;
	МетаДокумента = Метаданные.Документы[ИмяДокумента];
	Для каждого ИмяАналитики Из Аналитики Цикл
		Если МетаДокумента.Реквизиты.Найти(ИмяАналитики) <> Неопределено Тогда					
			Результат.Добавить(ИмяАналитики);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьДанныеПоДопИзмерениям(ТипОбъекта, ИмяДокумента, Документы, Аналитики, Результат)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документы", Документы);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|	&СписокАналитик
	|ИЗ
	|	Документ.&ИмяДокумента КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&Документы)
	|ИТОГИ ПО
	|	Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяДокумента", ИмяДокумента);
	Если Аналитики.Количество() = 0 Тогда
	    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СписокАналитик", "");	
	Иначе		
		СписокАналитик = " , ";
		Для каждого ИмяАналитики Из Аналитики Цикл
			СписокАналитик = СписокАналитик + "Документ." + ИмяАналитики + ", ";
		КонецЦикла;
		СписокАналитик = Сред(СписокАналитик, 0, СтрДлина(СписокАналитик) - 2);
		ТекстЗапроса   = СтрЗаменить(ТекстЗапроса, "&СписокАналитик", СписокАналитик);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСсылка.Следующий() Цикл
		АналитикиОтвет = Новый Массив;
		ВыборкаДЗ = ВыборкаСсылка.Выбрать();
		Пока ВыборкаДЗ.Следующий() Цикл
			Для каждого ИмяАналитики Из Аналитики Цикл
				ЗначениеАналитики = ВыборкаДЗ[ИмяАналитики];
				Если НЕ ЗначениеЗаполнено(ЗначениеАналитики) Тогда
					Продолжить;
				КонецЕсли;
				СтруктураАналитика = Новый Структура("Name, Value", ИмяАналитики, ЗначениеАналитики.Description);				
				АналитикиОтвет.Добавить(СтруктураАналитика);
			КонецЦикла;
		КонецЦикла;
		СтруктураОтвет = Новый Структура;
		СтруктураОтвет.Вставить("ObjectType", ТипОбъекта);
		СтруктураОтвет.Вставить("Id",         XMLСтрока(ВыборкаСсылка.Ссылка));
		СтруктураОтвет.Вставить("Analytics",  АналитикиОтвет);
		Результат.Добавить(СтруктураОтвет);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Пользователи

// Функция выполняет поиск пользователя по имени.
//
// Параметры:
//  ИмяПользователя - Строка
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи -  ссылка на пользователя.
//
Функция НайтиПользователя(ИмяПользователя)
	
	УстановитьПривилегированныйРежим(Истина);
	НайденныйПользователь = Справочники.Пользователи.ПустаяСсылка();
	
	НайденныйПользователь = Пользователи.НайтиПоИмени(ИмяПользователя);
	
	Если НЕ ЗначениеЗаполнено(НайденныйПользователь) Тогда
		НайденныйПользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(НайденныйПользователь) Тогда
		ПользовательИБ =  ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
		Если НЕ ПользовательИБ = Неопределено Тогда			
			НайденныйПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",ПользовательИБ.УникальныйИдентификатор);	
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(НайденныйПользователь) Тогда
		НайденныйПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Возврат НайденныйПользователь;
	
КонецФункции

Функция ПолучитьПользователей()
	
	УстановитьПривилегированныйРежим(Истина);
	ПользователиСистемы = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка,
	|	Пользователи.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(Пользователи.Подразделение.Наименование, """") КАК ПодразделениеНаименование,
	|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПользовательСсылка = Выборка.Ссылка;
		ПользовательИБ     = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
		// Если у пользователя нет доступа в базу,
		// тогда пропускаем его.
		Если ПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПользовательСистемы             = Новый Структура("Id, Name, Department");
		ПользовательСистемы.Name        = ПользовательИБ.Имя;
		ПользовательСистемы.Id          = XMLСтрока(ПользовательСсылка);
		ПользовательСистемы.Department  = Выборка.ПодразделениеНаименование;
		ПользователиСистемы.Добавить(ПользовательСистемы);
	КонецЦикла;
		
	УстановитьПривилегированныйРежим(Ложь);	
	
	Возврат ПользователиСистемы;
	
КонецФункции

#КонецОбласти

#Область ФормированиеТабличныхЧастейHTML

Функция СформироватьТабличнуюЧастьHTML(ДанныеЗапроса)

	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	
	ТипОбъекта = ДанныеЗапроса.ObjectType;
	ИдентификаторОбъекта = ДанныеЗапроса.ID;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектСсылка = ПолучитьСсылку(ТипОбъекта, ИдентификаторОбъекта);
	Если ОбъектСсылка = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Объект в системе не найден.'; en = 'An object was not found in the system.'");
		Возврат ТекстСообщения;
	КонецЕсли;	
	
	ДопАналитики = ПолучитьСоставДопАналитик();
	Если бит_МобильноеПриложениеПереопределяемый.ЕстьУникальнаяТабличнаяЧасть(ОбъектСсылка) Тогда
		Результат = бит_МобильноеПриложениеПереопределяемый.УникальнаяТабличнаяЧасть(ОбъектСсылка, ДопАналитики);
	Иначе	
		ШапкаHTMLДокумента = СформироватьШапкуHTML(Строка(ОбъектСсылка));
		BodyHTMLДокумента  = ПолучитьBodyHTMLДокумента(ОбъектСсылка, ДопАналитики);
		Результат          = ШапкаHTMLДокумента + Символы.ПС +  BodyHTMLДокумента;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции 

Функция СформироватьШапкуHTML(Заголовок)

	Шапка =
	"<!DOCTYPE html>
	|<html>
	|<head>
	|<meta charset=""utf-8"">
	|<title>%1</title>
	|%2
	|<!--[if lt IE 9]>      
	|<script src=""http://html5shiv.googlecode.com/svn/trunk/html5.js""></script
	|<![endif]-->
	|</head>";
	
	Стили = СформироватьСтили();
	Шапка = СтрШаблон(Шапка, Заголовок, Стили);

	Возврат Шапка;
	
КонецФункции 

Функция СформироватьСтили()

	ОписаниеСтилей =
	"<style>
	|table {
	|  border-collapse: collapse; 
	|  line-height: 1.1;
	|  font-family: ""Lucida Sans Unicode"", ""Lucida Grande"", sans-serif;
	|  color: #0C213B;
	|}
	|th {
	|  padding: 10px; 
	|  border: 1px solid grey;
	|  background: lightgrey;
	|}
	|td {
	|  font-size: 0.8em;
	|  padding: 5px 7px;
	|  border: 1px solid grey;
	|}
	|</style>";	

	Возврат ОписаниеСтилей;						
						
КонецФункции 

Функция ПолучитьBodyHTMLДокумента(ОбъектСсылка, ДопАналитики)

	МетаОбъект = ОбъектСсылка.Метаданные();
	
	ТелоHTMLДокумента = "<body>" + Символы.ПС;
	
	ИсключитьСтолбцы = Новый Массив;
	ИсключитьСтолбцы.Добавить("ИД");
	ИсключитьСтолбцы.Добавить("ИД_Прогноз");
	ИсключитьСтолбцы.Добавить("ИДВладельца");
	ИсключитьСтолбцы.Добавить("КоэффициентРаспределения");
	ИсключитьСтолбцы.Добавить("УдалитьНазначениеПлатежа");
	ИсключитьСтолбцы.Добавить("Расчетная");
	ИсключитьСтолбцы.Добавить("Удалить_Сценарий");
	ИсключитьСтолбцы.Добавить("Служебный");
	
	ИменаТабличныхЧастей = Новый Массив;
	
	Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_АктуализацияБюджета")
		ИЛИ ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_ФормаВводаБюджета") 
		ИЛИ ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_КорректировкаБюджета") Тогда
		
		ИменаТабличныхЧастей.Добавить("БДДС");		
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_ВерсияОтчета") Тогда
		
		ИменаТабличныхЧастей.Добавить("ПараметрыХранение");		
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_ДополнительныеУсловияПоДоговору") Тогда
		
		ИменаТабличныхЧастей.Добавить("ГрафикПлатежей");		
		ИменаТабличныхЧастей.Добавить("ГрафикНачислений");		
		ИменаТабличныхЧастей.Добавить("ГрафикВыдачиТраншей");		
	ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.бит_КорректировкаКонтрольныхЗначений") Тогда
		
		ИменаТабличныхЧастей.Добавить("УвеличениеЛимита");
		ИменаТабличныхЧастей.Добавить("УменьшениеЛимита");
	Иначе
		бит_МобильноеПриложениеПереопределяемый.ИменаТабличныхЧастей(ОбъектСсылка, ИменаТабличныхЧастей);
	КонецЕсли;	
	СформироватьBodyHTMLДокумента(ОбъектСсылка, МетаОбъект, ИменаТабличныхЧастей, ТелоHTMLДокумента, ИсключитьСтолбцы, ДопАналитики);		
	ТелоHTMLДокумента = ТелоHTMLДокумента + "</body>" + Символы.ПС + "</html>";
	
	Возврат ТелоHTMLДокумента;
	
КонецФункции 

Процедура СформироватьBodyHTMLДокумента(ОбъектСсылка, МетаОбъект, ИменТабличныхЧастей, ТелоHTMLДокумента, ИсключитьСтолбцы, ДопАналитики)
	
	// Формируем заголовки.
	ТелоHTMLДокумента = ТелоHTMLДокумента + "<h2>" + Строка(ОбъектСсылка) + "</h2>" + Символы.ПС;
	
	Для каждого ИмяТабличнойЧасти Из ИменТабличныхЧастей Цикл
		
		Попытка
			МетаТабличнаяЧасть = МетаОбъект.ТабличныеЧасти[ИмяТабличнойЧасти];
		Исключение
			Инфо = НСтр("ru = 'Табличной части с именем ""%1"" не существует.'; en = 'The table part named ""%1"" does not exist.'");
			Инфо = СтрШаблон(Инфо, МетаТабличнаяЧасть.Синоним);
			ТелоHTMLДокумента = ТелоHTMLДокумента + "<h3>" + Инфо + "</h3>" + Символы.ПС;
			Возврат;
		КонецПопытки;
		
		ТелоHTMLДокумента = ТелоHTMLДокумента + "<h3>" + МетаТабличнаяЧасть.Синоним + "</h3>" + Символы.ПС;
		ТелоHTMLДокумента = ТелоHTMLДокумента + "<table>" + Символы.ПС;
		
		// Формируем заголовок табличной части
		
		ЗаголовокТаблицы = "<tr>" + Символы.ПС;
		
		Для каждого метаРеквизит Из МетаТабличнаяЧасть.Реквизиты Цикл			
			
			ИмяКолонки = метаРеквизит.Синоним;
			
			Если НЕ ИсключитьСтолбцы.Найти(метаРеквизит.Имя) = Неопределено Тогда
				Продолжить;				
			КонецЕсли;
			
			// Игнорируем столбцы, оканчивающиеся на "_Старый".
			Если НЕ СтрНайти(метаРеквизит.Имя, "_Старый") = 0 Тогда
				Продолжить;	
			КонецЕсли;
			
			НайденнаяАналитика = Неопределено;
			ДопАналитики.Свойство(метаРеквизит.Имя, НайденнаяАналитика);
			
			Если НЕ НайденнаяАналитика = Неопределено Тогда
				
				Если НайденнаяАналитика.Используется Тогда
					ИмяКолонки = НайденнаяАналитика.Синоним;
				Иначе
					Продолжить;	
				КонецЕсли;
				
			КонецЕсли;
			
			ЗаголовокТаблицы = ЗаголовокТаблицы + "<th>" + ИмяКолонки + "</th>" + Символы.ПС;			
			
		КонецЦикла;
		
		ЗаголовокТаблицы = ЗаголовокТаблицы + "</tr>" + Символы.ПС;
		
		ТелоHTMLДокумента = ТелоHTMLДокумента + ЗаголовокТаблицы;
		
		// Формируем данные табличной части
		
		ДанныеТаблицы = "";
		
		Для каждого строка Из ОбъектСсылка[ИмяТабличнойЧасти] Цикл
			
			ДанныеТаблицы = ДанныеТаблицы + "<tr>" + Символы.ПС;
			
			Для каждого метаРеквизит Из МетаТабличнаяЧасть.Реквизиты Цикл
				
				Если НЕ ИсключитьСтолбцы.Найти(метаРеквизит.Имя) = Неопределено Тогда
					Продолжить;				
				КонецЕсли;
				
				// Игнорируем столбцы, оканчивающиеся на "_Старый".
				Если НЕ СтрНайти(метаРеквизит.Имя, "_Старый") = 0 Тогда
					Продолжить;	
				КонецЕсли;
				
				НайденнаяАналитика = Неопределено;
				ДопАналитики.Свойство(метаРеквизит.Имя, НайденнаяАналитика);
				
				Если НЕ НайденнаяАналитика = Неопределено И НЕ НайденнаяАналитика.Используется Тогда
					Продолжить;	
				КонецЕсли;
				
				ДанныеКолонки = строка[метаРеквизит.Имя];				
				
				ДанныеТаблицы = ДанныеТаблицы + "<td>" + ДанныеКолонки + "</td>" + Символы.ПС;			
				
			КонецЦикла;
			
			ДанныеТаблицы = ДанныеТаблицы + "</tr>" + Символы.ПС;
			
		КонецЦикла;
		
		ТелоHTMLДокумента = ТелоHTMLДокумента + ДанныеТаблицы;		
		ТелоHTMLДокумента = ТелоHTMLДокумента + "</table>" + Символы.ПС;
		ТелоHTMLДокумента = ТелоHTMLДокумента + "</br>" + Символы.ПС;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОстаткиПоБюджету

Функция ПолучитьОстаткиПоБюджету(ДанныеЗапроса)

	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если бит_МобильноеПриложениеПереопределяемый.ЭтоСправочник(ДанныеЗапроса.ObjectType) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТипДокумента            = ДанныеЗапроса.ObjectType;
	УникальныйИдентификатор = Новый УникальныйИдентификатор(ДанныеЗапроса.Id);
	ОбъектСсылка            = Документы[ТипДокумента].ПолучитьСсылку(УникальныйИдентификатор);
	
	Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат Неопределено;	
	КонецЕсли;		
	
	ДеревоИнформация = бит_МобильноеПриложениеПереопределяемый.ДанныеОбъекта(ОбъектСсылка);
	
	Если НЕ ЗначениеЗаполнено(ДеревоИнформация) Тогда
		ТекстСообщения = НСтр("ru = 'По данному объекту нет дополнительной информации.';
								|en = 'There is no additional information on this property.'");
		Возврат ТекстСообщения;
	КонецЕсли;
	
	Результат = Новый Массив;
	Для каждого Строка Из ДеревоИнформация.Строки Цикл	
		
		Если СтрСравнить(Строка.Имя, "СуммаДокумента") = 0 Тогда
			Имя      = "DocumentSums";
			Описание = Строка.ИмяПараметра;
		ИначеЕсли СтрСравнить(Строка.Имя, "СведенияОбОплате") = 0 Тогда
			Имя      = "PaymentDetails";
			Описание = Строка.ИмяПараметра;
		ИначеЕсли СтрСравнить(Строка.Имя, "ОстаткиПобюджету") = 0 Тогда
			Имя      = "Balances";
			Описание = Строка.ИмяПараметра;
		Иначе
			Продолжить;			
		КонецЕсли;
		
		Раздел = Новый Структура("Name, Description, Details", Имя, Описание);
		Детали = Новый Массив;
		
		Для каждого строка2 Из Строка.Строки Цикл
			Если строка2.ЭтоГруппа Тогда
				СтатьиОборотов = Новый Массив;
				Для каждого строка3 Из строка2.Строки Цикл
					Entry = Новый Структура("Name, Value", строка3.ИмяПараметра, Строка(строка3.ЗначениеПараметра));						
					СтатьиОборотов.Добавить(Entry);
				КонецЦикла;
				Detail = Новый Структура("Name, Entries", строка2.ИмяПараметра, СтатьиОборотов);
			Иначе
				Detail = Новый Структура("Name, Value", строка2.ИмяПараметра, Строка(строка2.ЗначениеПараметра));
			КонецЕсли;
			Детали.Добавить(Detail);
		КонецЦикла;
		
		Раздел.Details = Детали;
		Результат.Добавить(Раздел);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ИнформацияОСервисе()
	
	УстановитьПривилегированныйРежим(Истина);
	СисИнфо                                = бит_ОбщегоНазначения.ПолучитьСведенияОПрограмме();
	СведенияСтруктура                      = Новый Структура("ServiceVersion, ConfigurationName, ConfigurationVersion");
	СведенияСтруктура.ServiceVersion       = ВерсияСервиса();
	СведенияСтруктура.ConfigurationName    = СисИнфо.Имя_1С;
	СведенияСтруктура.ConfigurationVersion = СисИнфо.НомерРелиза_1С;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СведенияСтруктура;
	
КонецФункции

Функция ПолучитьСоставДопАналитик()
	
	ДопАналитики          = ПолучитьНазначенияДополнительныхИзмерений();
	МаксКолвоДопАналитик  = бит_МеханизмДопИзмерений.ПолучитьМаксимальноеКоличествоДополнительныхИзмерений();
	ДопАналитикиСтруктура = Новый Структура;
		
	Для Номер = 1 По МаксКолвоДопАналитик Цикл
		АналитикаСтруктура = Новый Структура("Синоним, Используется", "", Ложь);
		ДопАналитикиСтруктура.Вставить("Аналитика_"+Номер, АналитикаСтруктура);
	КонецЦикла;
	
	Для каждого Аналитика Из ДопАналитики Цикл
		Если НЕ ДопАналитикиСтруктура.Свойство(Аналитика) = Неопределено Тогда
			ДопАналитикиСтруктура[Аналитика.Name].Синоним = Аналитика.Description;
			ДопАналитикиСтруктура[Аналитика.Name].Используется = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДопАналитикиСтруктура;
	
КонецФункции

Функция ДополнительныеРеквизитыОбъекта(ОбъектСсылка)
	
	// N.B. Требуется рефакторинг.
	МетаОбъект  = ОбъектСсылка.Метаданные();
	Результат   = Новый Массив;
	ИмяТаблицы  = "ДополнительныеРеквизиты";
	МетаТаблица = МетаОбъект.ТабличныеЧасти.Найти(ИмяТаблицы);
	Если НЕ МетаТаблица = Неопределено Тогда
		Для каждого ТекущаяСтрока Из ОбъектСсылка[ИмяТаблицы] Цикл
			// Мобильное приложение чувствительно к регистру ключей этой структуры!!!!
			ДополнительныйРеквизит             = Новый Структура("ID, Description, Value");
			ДополнительныйРеквизит.Id          = XMLСтрока(ТекущаяСтрока.Свойство);
			ДополнительныйРеквизит.Description = ТекущаяСтрока.Свойство.Заголовок;
			ДополнительныйРеквизит.Value       = Строка(ТекущаяСтрока.Значение);
			Результат.Добавить(ДополнительныйРеквизит);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции 

Функция ИспользоватьВнутреннююТаблицу(ОбъектСсылка)
	
	Возврат Ложь;
		
КонецФункции
 
Функция ВерсияСервиса()
	
	Возврат "1.1.2.3";
	
КонецФункции

Процедура ЗарегистрироватьИнформацию(ИмяСобытия, ТекстИнформации = "")
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,
		Метаданные.HTTPСервисы.bit_ApprovalServiceNew,, ТекстИнформации);
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибку(ИмяСобытия, ТекстОшибки = "")
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,
		Метаданные.HTTPСервисы.bit_ApprovalServiceNew,, ТекстОшибки);
	
КонецПроцедуры

Функция ЗначениеИзСтрокиJSON(Значение)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьОтветJSON(ПередаваемыеДанные)

	СтрокаДляОтвета = СформироватьJSON(ПередаваемыеДанные);
	Ответ           = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/JSON; charset=utf-8"); 
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);	
	
	Возврат Ответ;
	
КонецФункции

Функция СформироватьJSON(ПередаваемыеДанные)

	ЗаписьJSON          = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON); 
	ЗаписатьJSON(ЗаписьJSON, ПередаваемыеДанные); 
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	Возврат СтрокаДляОтвета;
	
КонецФункции

Функция СформироватьОтветHTML(ТелоДокумента)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "text/html; charset=utf-8"); 
	Ответ.УстановитьТелоИзСтроки(ТелоДокумента, КодировкаТекста.UTF8);	
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьСсылку(ТипОбъекта, ИдентификаторОбъекта)
	
	ПозицияРазделителя = Найти(ТипОбъекта, ".");
	
	Если НЕ ПозицияРазделителя = 0 Тогда
		ТипОбъекта = Сред(ТипОбъекта, ПозицияРазделителя+1, СтрДлина(ТипОбъекта));
	КонецЕсли;
	
	Если бит_МобильноеПриложениеПереопределяемый.ЭтоСправочник(ТипОбъекта) Тогда
		МенеджерОбъекта = Справочники[ТипОбъекта];
	Иначе
		МенеджерОбъекта = Документы[ТипОбъекта];
	КонецЕсли;
	
	Попытка
		УИД            = Новый УникальныйИдентификатор(ИдентификаторОбъекта);
		ОбъектСсылка   = МенеджерОбъекта.ПолучитьСсылку(УИД);
		ДокументОбъект = ОбъектСсылка.ПолучитьОбъект();
	Исключение
		ДокументОбъект = Неопределено;
	КонецПопытки;
	
	Если ДокументОбъект = Неопределено Тогда
		ОбъектСсылка = Неопределено;
	КонецЕсли;
	
	Возврат ОбъектСсылка;
	
КонецФункции

// Функция реализует проверку настройки "Необходим комментарий или задача" по всем вариантам
Функция НеобходимКомментарийЗадачаПолнаяПроверка(Организация, ПолноеИмяОбъекта, ВидРешения)
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(ПолноеИмяОбъекта);
	
	// 1. Организация, ОбъектСистемы, ВидРешения - все реквизиты заполнены	
	Результат = бит_МобильноеПриложениеПереопределяемый.НеобходимКомментарийЗадача(Организация,
	    ОбъектСистемы, ВидРешения);

	Если Результат.ЗаписьСуществует Тогда
		Возврат Результат.НеобходимКомментарийЗадача; 
	КонецЕсли;
	
	// 2. ОбъектСистемы, ВидРешения - реквизиты заполнены, Организация - не заполнена.
	Результат = бит_МобильноеПриложениеПереопределяемый.НеобходимКомментарийЗадача(
							Справочники.Организации.ПустаяСсылка(), ОбъектСистемы, ВидРешения);	

	Если Результат.ЗаписьСуществует Тогда
		Возврат Результат.НеобходимКомментарийЗадача; 
	КонецЕсли;
	
	// 3. Организация, ВидРешения - реквизиты заполнены, ОбъектСистемы - не заполнен.
	Результат = бит_МобильноеПриложениеПереопределяемый.НеобходимКомментарийЗадача(
							Организация, Справочники.бит_ОбъектыСистемы.ПустаяСсылка(), ВидРешения);	

	Если Результат.ЗаписьСуществует Тогда
		Возврат Результат.НеобходимКомментарийЗадача; 
	КонецЕсли;
	
	// 4. ВидРешения - реквизит заполнены, Организация, ОбъектСистемы - не заполнены.
	Результат = бит_МобильноеПриложениеПереопределяемый.НеобходимКомментарийЗадача(
		Справочники.Организации.ПустаяСсылка(), Справочники.бит_ОбъектыСистемы.ПустаяСсылка(), ВидРешения);	

	Если Результат.ЗаписьСуществует Тогда
		Возврат Результат.НеобходимКомментарийЗадача; 
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьОбъектыСистемы(ИменаОбъектов)

	Результат = Новый Массив;
	Результат.Добавить(Справочники.бит_ОбъектыСистемы.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИменаОбъектов", ИменаОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыСистемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
	|ГДЕ
	|	ОбъектыСистемы.ИмяОбъекта В(&ИменаОбъектов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеТабличнойЧасти(ДанныеЗапроса)
	
	Результат = Новый Структура;
	Результат.Вставить("Version",      "");
	Результат.Вставить("ErrorMessage", "");
	Результат.Вставить("Lines",         Новый Массив);
	
	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Структура") Тогда
		Результат.ErrorMessage = НСтр("ru = 'Неверные данные для обработки.'; en = 'Incorrect data for processing.'",
		    ОбщегоНазначения.КодОсновногоЯзыка());
		Возврат Результат;
	КонецЕсли;
	
	ТипОбъекта = ДанныеЗапроса.ObjectType;
	ИдентификаторОбъекта = ДанныеЗапроса.ID;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектСсылка = ПолучитьСсылку(ТипОбъекта, ИдентификаторОбъекта);
	Если ОбъектСсылка = Неопределено Тогда
		Результат.ErrorMessage = НСтр("ru = 'Объект не найден.'; en = 'Object not found.'",
		    ОбщегоНазначения.КодОсновногоЯзыка());
		Возврат Результат;
	КонецЕсли;
	
	бит_МобильноеПриложениеПереопределяемый.ДанныеТабличнойЧасти(ОбъектСсылка, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция УстановитьДанныеТабличнойЧасти(ДанныеЗапроса = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("ErrorMessage", "");
	
	Если НЕ ТипЗнч(ДанныеЗапроса) = Тип("Структура") Тогда
		Результат.ErrorMessage = НСтр("ru = 'Неверные данные для обработки.'; en = 'Incorrect data for processing.'",
		    ОбщегоНазначения.КодОсновногоЯзыка());
		Возврат Результат;
	КонецЕсли;
	
	ТипОбъекта = ДанныеЗапроса.ObjectType;
	ИдентификаторОбъекта = ДанныеЗапроса.ID;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектСсылка = ПолучитьСсылку(ТипОбъекта, ИдентификаторОбъекта);
	Если ОбъектСсылка = Неопределено Тогда
		Результат.ErrorMessage = НСтр("ru = 'Объект не найден.'; en = 'Object not found.'",
		    ОбщегоНазначения.КодОсновногоЯзыка());
		Возврат Результат;
	КонецЕсли;
	
	Если ДанныеЗапроса.Lines.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	бит_МобильноеПриложениеПереопределяемый.УстановитьДанныеТабличнойЧасти(ОбъектСсылка, ДанныеЗапроса, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОбъектПоИдентификатору(ПараметрыОбъекта)
	
	Ид              = ПараметрыОбъекта.ID;
	Имя             = ПараметрыОбъекта.ObjectName;
	ИмяПользователя = ПараметрыОбъекта.User;
	
	УстановитьПривилегированныйРежим(Истина);
	ТекПользователь = НайтиПользователя(ИмяПользователя);
	Если НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetObject.
                               |Не удалось найти пользователя по имени: %1';
							   |en = 'HTTP service bit_ApprovalServiceNew. GetObject method error.
                               |Could not find user by name: %1'");		
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПользователя);
		ИмяСобытия = НСтр("ru = 'approval/v1/object'; en = 'approval/v1/object'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
	КонецЕсли; 
	
	Результат = Неопределено;
	
	// Получаем ссылку.
	Если НЕ ЗначениеЗаполнено(Имя) Тогда
		ТекстСообщения = НСтр("ru = 'HTTP-сервис bit_ApprovalServiceNew. Ошибка метода GetObject.
                               |Пустое значение обязательного параметра ObjectName';
							   |en = 'HTTP service bit_ApprovalServiceNew. GetObject method error.
                               |Empty value of the required parameter ObjectName'");		
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПользователя);
		ИмяСобытия = НСтр("ru = 'approval/v1/object'; en = 'approval/v1/object'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗарегистрироватьОшибку(ИмяСобытия, ТекстСообщения);			
		Возврат Результат;
	КонецЕсли;
	
	Если бит_МобильноеПриложениеПереопределяемый.ЭтоСправочник(Имя) Тогда
		МенеджерОбъекта = Справочники[Имя];
	Иначе
		МенеджерОбъекта = Документы[Имя];
	КонецЕсли;
	
	УИД = Новый УникальныйИдентификатор(Ид);
	СсылкаОбъекта = МенеджерОбъекта.ПолучитьСсылку(УИД);
	
	Если ОбщегоНазначения.СсылкаСуществует(СсылкаОбъекта) Тогда
		Объекты = Новый Массив();
		Объекты.Добавить(СсылкаОбъекта);
		РеквизитыОбъектов = РеквизитыОбъектов(Объекты);	
		// Получение сведений о прикрепленных файлах.
		ПрикрепленныеФайлы = ПолучитьИнформациюФайлов(Объекты);
		
		ЗаявкаНаРС = РеквизитыОбъектов.Найти(СсылкаОбъекта, "ОбъектВизирования");
		Если ЗаявкаНаРС <> Неопределено Тогда
			ЗапросПлатежнойПозиции = бит_МобильноеПриложениеПереопределяемый.ЗапросПлатежнойПозиции();
			Результат = ЗаполнитьОбъектВизирования(ЗаявкаНаРС, ПрикрепленныеФайлы, ЗапросПлатежнойПозиции);
		КонецЕсли;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
 
Функция СтрокаВДату(Знач Значение)
	
	Если НЕ ПустаяСтрока(Значение) Тогда
		Значение = Лев(Значение, 8);
		Значение = СтроковыеФункцииКлиентСервер.СтрокаВДату(Значение);
	Иначе
		Значение = Дата('0001.01.01');
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции 

#КонецОбласти