// БИТ
   
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктСрезкиГП";
	КомандаПечати.Представление = "Акт срезки ГП";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	//КомандаПечати.МестоРазмещения = "ПодменюПечать";
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	
КонецПроцедуры 

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСрезкиГП") Тогда 
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктСрезкиГП");
		Если ПечатнаяФорма <> Неопределено Тогда           
			ОфисныеДокументы = НапечататьОфисныйДокумент(МассивОбъектов, "АктСрезкиГП");
			ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;
			ПечатнаяФорма.СинонимМакета = "(бит) Акт срезки ГП";
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

//Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 	
//	
//	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
//	
//	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСрезкиГП") Тогда
//		
//	КонецЕсли;
//	
//КонецПроцедуры 
Функция ДоступныеДляШаблоновПечатныеФормы() Экспорт
	
	МассивДоступныхПечатныхФорм = Новый Массив;
	
	Возврат МассивДоступныхПечатныхФорм

КонецФункции

Функция НапечататьОфисныйДокумент(МассивОбъектов, Идентификатор)
	
	ОфисныеДокументы = Новый Соответствие;
	
    Шаблон = "Акт срезки ГП №[Номер] от [Дата]";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Номер, Дата, Ссылка");
	
    Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если Идентификатор = "АктСрезкиГП" Тогда
			НазваниеДокумента = "Акт срезки ГП";
			АдресДокумента = СформироватьАктСрезкиГП(Ссылка);
		КонецЕсли;
		
		РеквизитыДокумента = ЗначенияРеквизитов[Ссылка];
		РеквизитыДокумента.Дата = Формат(РеквизитыДокумента.Дата, "ДФ=dd.MM.yyyy");
		РеквизитыДокумента.Вставить("НазваниеДокумента", НазваниеДокумента);
		ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, РеквизитыДокумента) + "_" + Формат(ТекущаяДатаСеанса(), "ДФ=ddMMyyyyhhmmss");
		ОфисныеДокументы.Вставить(АдресДокумента, ИмяДокумента);
	КонецЦикла;
	
	Возврат ОфисныеДокументы;	
	
КонецФункции

Функция СформироватьАктСрезкиГП(Документ)   
	
	МакетДокумента = ПолучитьМакет("ПФ_DOC_АктСрезкиГП");
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, "");
	
	ОписаниеОбластей = Новый Структура;
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ОбластьПечати", "Общая");
	ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);
	//-------------------------  
	ДанныеЗаполнения = Новый Структура;
	ЗаполнитьДанныеЗаполненияАктСрезкиГП(Документ, ДанныеЗаполнения);
	//--------------
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["ОбластьПечати"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеЗаполнения);
	
	АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции 

Процедура ЗаполнитьДанныеЗаполненияАктСрезкиГП(Документ, ДанныеЗаполнения)
	ДанныеЗаполнения.Вставить("Номер", Документ.Номер); 
	ДанныеЗаполнения.Вставить("Дата", Формат(Документ.Дата, "ДФ='dd.MM.yyyy ''г'''"));
	
	ДанныеЗаполнения.Вставить("Причина", "" + Документ.ПричинаСрезки);
	
	Маркоразмеры = ""; 
	Шаблон = "[Номенклатура] - [ОкончательныйБракКг] кг";
	Для Каждого стр из Документ.Продукция Цикл  
		Разделитель = ?(Маркоразмеры = "", "", ";" + Символы.ПС); 
		ТекСтруктура = Новый Структура;
		ТекСтруктура.Вставить("Номенклатура", стр.Номенклатура);
		ТекСтруктура.Вставить("ОкончательныйБракКг", стр.ОкончательныйБракКг);
		
		ТекущаяСтрока = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ТекСтруктура);
		Маркоразмеры = Маркоразмеры + Разделитель + ТекущаяСтрока;	
	КонецЦикла;
	ДанныеЗаполнения.Вставить("Маркоразмеры", Маркоразмеры);
КонецПроцедуры
#КонецОбласти 
#КонецЕсли