
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АвтоТест", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Ссылка) Тогда
		ТекстСообщения = НСтр("ru = 'Непосредственное открытие этой формы не предусмотрено.';
							 | en = 'This form cannot be opened directly.'") + Символы.ПС 
					   + НСтр("ru = 'Для открытия формы можно воспользоваться командой ""Аналитики (БИТ)"" в формах документов.';
						 	  |en = 'To open the form, you can use the ""Analytics (bit)"" command in document forms.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 	
	
	СсылкаНаОбъект = Параметры.Ссылка;
	ВызовИзСписка  = Параметры.ВызовИзСписка;
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если бит_МеханизмДопИзмерений.ВключенРежимЗаполнятьВсегда() Тогда
		ПараметрыОбъекты = Новый Структура("ЗапретитьПерезаполнениеАналитик", ЗапретитьПерезаполнениеАналитик);
		бит_МеханизмДопИзмерений.ЗаписатьДополнительныеПараметрыОбъекта(СсылкаНаОбъект.Ссылка, ПараметрыОбъекты);
	КонецЕсли;
		
	МетаданныеДокумента = СсылкаНаОбъект.Метаданные();
	Если бит_ДатыЗапретаРедактирования.ПропуститьПроверкуДатыЗапрета(МетаданныеДокумента, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = бит_ДатыЗапретаРедактирования.ВыполнитьПроверкуДатыЗапретаРедактирования(МетаданныеДокумента, СсылкаНаОбъект);
	Если РезультатПроверки Тогда
		Отказ = Истина;
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("Отказ", Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаписатьДокумент(ПараметрыЗаписи);
	
	ДоработатьТаблицуАналитик();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(СсылкаНаОбъект);
	ЗаписатьИЗакрыть = ?(ПараметрыЗаписи.Свойство("ЗаписатьИЗакрыть"), ПараметрыЗаписи.ЗаписатьИЗакрыть, Ложь);

	# Если НЕ ВебКлиент Тогда
		// В ВебКлиенте обновление формы владельца приводит к ошибке.
		Если НЕ ПараметрыЗаписи.Отказ И ВладелецФормы <> Неопределено Тогда
			Попытка 				
				ВладелецФормы.Прочитать();				
			Исключение 
				ЗаписатьИЗакрыть = Ложь;
				ТекстСообщения = НСтр("ru = 'Не удалось обновить форму документа по причине: %1'; 
										|en = 'The document form could not be updated due to: %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ПоказатьПредупреждение(, ТекстСообщения);
			КонецПопытки;
		КонецЕсли; 
	# КонецЕсли 
	
	Если ВладелецФормы <> Неопределено Тогда
		Если ЗаписатьИЗакрыть Тогда
			// АПК:534-выкл Безопасное открытие формы документа.
			ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(СсылкаНаОбъект));
			// АПК:534-вкл
		КонецЕсли;
	Иначе
		Если ЗаписатьИЗакрыть И Открыта() Тогда
		     Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПроверитьМодификациюВладельцаФормы", 0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбъектИзмененВГрупповомРедактированииДополнительныхАналитик" И Источник = ЭтотОбъект Тогда
		Прочитать();	
	КонецЕсли;  
	
КонецПроцедуры
 
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗапретитьПерезаполнениеАналитикПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНаборДопАналитики

&НаКлиенте
Процедура НаборДопАналитикиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.НаборДопАналитики.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.Объект = СсылкаНаОбъект;
	КонецЕсли; 
	
	// Установим ограничение типа при редактировании.
	НастройкаАналитики = КэшЗначений.НастройкиАналитик[ТекущиеДанные.ИмяАналитики];
	Если НЕ НастройкаАналитики = Неопределено Тогда
	
		Элементы.НаборДопАналитикиЗначениеАналитики.ОграничениеТипа = НастройкаАналитики.ТипЗначения;
		
		Если НастройкаАналитики.ТипЗначения.СодержитТип(Тип("СправочникСсылка.бит_ДополнительныеЗначенияАналитик")) Тогда
			СтрОтбор = Новый Структура("Владелец", НастройкаАналитики.Аналитика);
			бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элементы.НаборДопАналитикиЗначениеАналитики, СтрОтбор);
		ИначеЕсли НастройкаАналитики.ТипЗначения.СодержитТип(Тип("СправочникСсылка.бит_СтатьиОборотов")) Тогда
			УстановитьПараметрыВыбораСтатьиОборотов();
		Иначе
			Элементы.НаборДопАналитикиЗначениеАналитики.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборДопАналитикиПослеУдаления(Элемент)
		
	ЗапретитьПерезаполнениеАналитик = Истина;
	
КонецПроцедуры
           
&НаКлиенте
Процедура НаборДопАналитикиАналитикаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаборДопАналитики.ТекущиеДанные;
	ИзменениеАналитики(ТекущиеДанные.ПолучитьИдентификатор());
	
	// Установим ограничение типа при редактировании.
	НастройкаАналитики = КэшЗначений.НастройкиАналитик[ТекущиеДанные.ИмяАналитики];
	Если НЕ НастройкаАналитики = Неопределено Тогда
	
		Элементы.НаборДопАналитикиЗначениеАналитики.ОграничениеТипа = НастройкаАналитики.ТипЗначения;
		
		Если НастройкаАналитики.ТипЗначения.СодержитТип(Тип("СправочникСсылка.бит_ДополнительныеЗначенияАналитик"))  Тогда
			
			СтрОтбор = Новый Структура("Владелец", НастройкаАналитики.Аналитика);
			бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элементы.НаборДопАналитикиЗначениеАналитики, СтрОтбор);
						
		Иначе
			
			Элементы.НаборДопАналитикиЗначениеАналитики.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
		
		КонецЕсли; 		
		
	КонецЕсли;

	ЗапретитьПерезаполнениеАналитик = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораЗначениеАналитикиШапки(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НаборДопАналитики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Элемент.ОграничениеТипа.Типы().Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
   
    бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, ТекущиеДанные, 
		ТекущиеДанные.ИмяАналитики, СтандартнаяОбработка, КэшЗначений.НастройкиАналитик, "ЗначениеАналитики");
    
	ЗапретитьПерезаполнениеАналитик = Истина;
															   
КонецПроцедуры

&НаКлиенте
Процедура НаборДопАналитикиЗначениеАналитикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачалоВыбораЗначениеАналитикиШапки(Элемент, СтандартнаяОбработка);
															   
КонецПроцедуры // НаборДопАналитикиЗначениеАналитикиНачалоВыбора()

&НаКлиенте
Процедура НаборДопАналитикиЗначениеАналитикиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	НачалоВыбораЗначениеАналитикиШапки(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // НаборДопАналитикиЗначениеАналитикиАвтоПодбор()
  
&НаКлиенте
Процедура НаборДопАналитикиЗначениеАналитикиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаборДопАналитики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗначениеАналитики = ТекущиеДанные.ЗначениеАналитики;
	Если ЗначениеЗаполнено(ЗначениеАналитики) Тогда
		Если бит_МеханизмДопИзмеренийКлиент.ЭтотДокументОбОплатеБит(ЗначениеАналитики) 
		   И ВозможноЗаполнениеАналитикПоДокументу(ЗначениеАналитики) Тогда
			ЗаполнениеДополнительныхАналитикПоДокументуБит(ТекущиеДанные.Аналитика, ЗначениеАналитики);
		КонецЕсли;
	КонецЕсли;
	
	ЗапретитьПерезаполнениеАналитик = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборДопАналитикиЗначениеАналитикиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НаборДопАналитики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контейнер = Новый Структура;
	Контейнер.Вставить(ТекущиеДанные.ИмяАналитики, ТекущиеДанные.ЗначениеАналитики);	

	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент
																			, Контейнер
																		   	, ТекущиеДанные.ИмяАналитики
																		   	, СтандартнаяОбработка
																		   	, КэшЗначений.НастройкиАналитик);
																		
	ТекущиеДанные.ЗначениеАналитики = Контейнер[ТекущиеДанные.ИмяАналитики];
			
	ЗапретитьПерезаполнениеАналитик = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры // НаборДопАналитикиЗначениеАналитикиОчистка()

&НаКлиенте
Процедура НаборДопАналитикиПриИзменении(Элемент)
	
	Кандидат = ОсновнаяСтатьяОборотов(ЭтотОбъект);
	Если ОсновнаяСтатьяОборотов <> Кандидат Тогда
		ОсновнаяСтатьяОборотов = Кандидат;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура("ЗаписатьИЗакрыть", Истина); 
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьШапку(Команда)
	
	Оповещение = Новый ОписаниеОповещения("КомандаЗаполнитьШапкуЗавершение",ЭтотОбъект);
	Если НаборДопАналитики.Количество()>0 Тогда
		ТекстВопроса = НСтр("ru='Дополнительные аналитики будут очищены. Продолжить?';
						    |en='Additional analysts will be cleared. Continue?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;	
		
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
// 
&НаКлиенте 
Процедура КомандаЗаполнитьШапкуЗавершение(Результат, ДополнительныеДанные) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьШапку(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповаяТрансляция(Команда)
	
	Если Модифицированность Тогда
		ПредложитьЗаписатьОбъект();
	Иначе
		ОткрытьФормуГрупповойТрансляции();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПредложитьЗаписатьОбъект()
		
	ЧастиСообщения = Новый Массив; 
	ЧастиСообщения.Добавить(НСтр("ru = 'Данные еще не записаны.'; en = 'The data has not been recorded yet.'"));
	ЧастиСообщения.Добавить(НСтр("ru = 'Переход к ""%1"" возможен только после записи данных.';
								|en = 'The transition to ""%1"" is possible only after writing the data.'"));
	ЧастиСообщения.Добавить(НСтр("ru = 'Данные будут записаны.'; en = 'The data will be recorded.'"));   
	ЧастиСообщения.Добавить(НСтр("ru = 'Продолжить?'; en = 'Continue?'"));   
	
	ПредставлениеОбработки = НСтр("ru = 'Групповая трансляция и редактирование дополнительных аналитик'; 
									|en = 'Batch Conversion and Additional Dimension Editing'");

	Оповещение 	   = Новый ОписаниеОповещения("ПредложитьЗаписатьОбъектЗавершение", ЭтотОбъект);
	ТекстСообщения = СтрСоединить(ЧастиСообщения, Символы.ПС);
	ТекстСообщения = СтрШаблон(ТекстСообщения, ПредставлениеОбработки);
	
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаписатьОбъектЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Записать();	
		ОткрытьФормуГрупповойТрансляции();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуГрупповойТрансляции()
	
	ОбъектыДляОбработки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаОбъект);
	ПараметрыФормы 		= Новый Структура("ДокументыДляОбработки", ОбъектыДляОбработки);
	
	ОткрытьФорму("Обработка.бит_ГрупповоеРедактированиеДополнительныхАналитик.Форма.Форма", 
					ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры 
				
&НаКлиенте
Функция ВозможноЗаполнениеАналитикПоДокументу(ДокументПланирования)

	ВозможноЗаполнение = Истина;
	
	Если НЕ ТипЗнч(ДокументПланирования) = Тип("ДокументСсылка.бит_ПлатежнаяПозиция")
		И НЕ ТипЗнч(ДокументПланирования) = Тип("ДокументСсылка.бит_ПланируемоеПоступлениеДенежныхСредств") Тогда
		Возврат Истина;
	КонецЕсли; 

	ДокументыПоступленияДенежныхСредств = бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ДокументыПоступленияДенежныхСредств();
	ДокументыСписанияДенежныхСредств 	= бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ДокументыСписанияДенежныхСредств();
	
	Если ТипЗнч(ДокументПланирования) = Тип("ДокументСсылка.бит_ПлатежнаяПозиция")
		И ДокументыПоступленияДенежныхСредств.Найти(ТипЗнч(СсылкаНаОбъект)) <> Неопределено Тогда
		Возврат Ложь;	
	КонецЕсли; 
	
	Если ТипЗнч(ДокументПланирования) = Тип("ДокументСсылка.бит_ПланируемоеПоступлениеДенежныхСредств")
		И ДокументыСписанияДенежныхСредств.Найти(ТипЗнч(СсылкаНаОбъект)) <> Неопределено Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат ВозможноЗаполнение;

КонецФункции 
 
&НаСервере
Процедура ЗаписатьДокумент(ПараметрыЗаписи)
		
	// ТекущийОбъект в параметрам процедуры - РегистрСведенийНаборЗаписей.бит_УстановленныеВизы, 
	// т.к. набор записей установлен основным реквизитом формы.
	ДокументОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		
	УстановитьПривилегированныйРежим(Истина);
	ЗаписатьДокументИзменениеЗапрещено(ДокументОбъект);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокументИзменениеЗапрещено(ДокументОбъект)
		
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	Если МетаданныеДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить
		И НЕ ДокументОбъект.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	// Где еще встречается: см. бит_ГрупповоеРедактированиеДополнительныхАналитик.Форма.ВыполнитьПроведениеБитСервер();
	МетаданныеДвижения 	= МетаданныеДокумента.Движения;
	
	Отказ 		    = Ложь;
	РежимПроведения = РежимПроведенияДокумента.Неоперативный; 
	
	ОборотыПоБюджетам 	   = Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам;
	ПроводкиБюджетирования = Метаданные.РегистрыБухгалтерии.бит_Бюджетирование;
	
	ВозможныОборотыПоБюджетам      = МетаданныеДвижения.Содержит(ОборотыПоБюджетам);	
	ВозможныПроводкиБюджетирования = МетаданныеДвижения.Содержит(ПроводкиБюджетирования);
	
	Если ВозможныОборотыПоБюджетам И ВозможныПроводкиБюджетирования Тогда
		// Необходимо для подготовки (очистки) набора записей.
		// Когда проводки формируются по шаблону из статьи и "Обороты по бюджету" пустой,
		// набор проводок ни как не обрабатывается и остается с данными.
		ДокументОбъект.Движения.бит_Бюджетирование.Записывать = Истина;	
	КонецЕсли;
	
	ЕстьМеханизмКонтроляЗакрытогоПериода = бит_ОбщегоНазначения.ЕстьМеханизмКонтроляЗакрытогоПериода();
	Если ЕстьМеханизмКонтроляЗакрытогоПериода Тогда			
		бит_КонтрольЗакрытогоПериода.КонсервироватьДвижения(ДокументОбъект, Отказ, 
			РежимЗаписиДокумента.Проведение, РежимПроведения);	
	КонецЕсли;
	
	бит_МеханизмХозяйственныхОперацийСервер.бит_мхо_НастраиваемыеДвиженияДокументовОбработкаПроведения(ДокументОбъект, Отказ, РежимПроведения);
	
	бит_МеханизмТрансляции.ВыполнитьТрансляцию(ДокументОбъект, Неопределено, Неопределено, Истина, Перечисления.бит_РежимыТрансляции.Ручной);
														   
	Если ЕстьМеханизмКонтроляЗакрытогоПериода Тогда			
		бит_КонтрольЗакрытогоПериода.КонтрольПриОбработкеПроведения(ДокументОбъект, Отказ, РежимПроведения, Истина);	
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	Для каждого НаборЗаписей Из ДокументОбъект.Движения Цикл
		Если НаборЗаписей.Записывать Тогда
			НаборЗаписей.Записать();
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция ОсновнаяСтатьяОборотов(Форма)

	ОсновнаяСтатьяОборотов = ПредопределенноеЗначение("Справочник.бит_СтатьиОборотов.ПустаяСсылка");
	ПВХСтатьяОборотов	   = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов");
	
	Для каждого СтрокаТаблицы Из Форма.НаборДопАналитики Цикл
		Если СтрокаТаблицы.Аналитика = ПВХСтатьяОборотов Тогда
			ОсновнаяСтатьяОборотов = СтрокаТаблицы.ЗначениеАналитики;		
		КонецЕсли; 
	КонецЦикла; 

	Возврат ОсновнаяСтатьяОборотов;
	
КонецФункции
 
&НаСервере
Функция АналитическиеРазрезы()

	Разрезы = Новый Массив();
	Разрезы.Добавить("Проект");
	Разрезы.Добавить("НоменклатурнаяГруппа");
	Для Индекс = 1 По 7 Цикл
		Разрезы.Добавить("Аналитика_" + Индекс);
	КонецЦикла; 
	
	Возврат Разрезы;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьМодификациюВладельцаФормы()
	
	СистемнаяИнформация        = Новый СистемнаяИнформация;
	ТекущаяВерсияПлатформы     = СистемнаяИнформация.ВерсияПриложения;
	МинимальнаяВерсияПлатформы = "8.3.14.0";
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ТекущаяВерсияПлатформы, МинимальнаяВерсияПлатформы) >= 0 Тогда
		ИмяТипаФормы = "ФормаКлиентскогоПриложения";
	Иначе
		ИмяТипаФормы = "УправляемаяФорма"; //Платформа 8.3.13
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = Тип(ИмяТипаФормы) Тогда
		Если НЕ ВладелецМодифицирован = ВладелецФормы.Модифицированность Тогда
			ТолькоПросмотр 		  = ВладелецФормы.Модифицированность;
			ВладелецМодифицирован = ВладелецФормы.Модифицированность;
			Если ТолькоПросмотр Тогда
				Модифицированность = Ложь;
			КонецЕсли; 
			ПодготовитьФормуНаСервере();
		КонецЕсли; 
		ПодключитьОбработчикОжидания("ПроверитьМодификациюВладельцаФормы", 0.5, Истина);
	КонецЕсли; 
	
КонецПроцедуры
 
&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Если ВызовИзСписка Тогда
		Заголовок = Строка(СсылкаНаОбъект);
		Элементы.СсылкаНаОбъект.Видимость = Ложь;
	КонецЕсли; 
	
	ЗаполнитьКэшЗначений();
	ЗаполнитьФлаги();
	
	ПрочитатьРеквизитыВладельцаАналитик();
		
	ДоработатьТаблицуАналитик();	
			
	ЗапретитьПерезаполнениеАналитик = бит_МеханизмДопИзмерений.ПолучитьЗначениеДополнительногоПараметраОбъекта(
		СсылкаНаОбъект, "ЗапретитьПерезаполнениеАналитик");
	
	Элементы.ЗапретитьПерезаполнениеАналитик.Видимость = бит_МеханизмДопИзмерений.ВключенРежимЗаполнятьВсегда();

	ОсновнаяСтатьяОборотов 	 = ОсновнаяСтатьяОборотов(ЭтотОбъект);
	ВладелецМодифицирован  	 = ТолькоПросмотр;
		
	УстановитьИзменениеЗапрещено();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИзменениеЗапрещено()
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.бит_ФормаСбораДанных")
		ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.бит_ПроизвольнаяФорма") Тогда
		ОрганизацияПроверка = бит_РаботаСПроизвольнымиФормами.ОрганизацияПроизвольнойФормы(СсылкаНаОбъект);
	Иначе
		ОрганизацияПроверка = Организация
	КонецЕсли;  
	
	ДанныеДляПроверки = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
	НоваяСтрока = ДанныеДляПроверки.Добавить();
	НоваяСтрока.Дата   = СсылкаНаОбъект.Дата;
	НоваяСтрока.Раздел = "БухгалтерскийУчет";
	НоваяСтрока.Объект = ОрганизацияПроверка;	
	
	ОписаниеДанных = Новый Структура; 
	ОписаниеДанных.Вставить("НоваяВерсия", Ложь);
	ОписаниеДанных.Вставить("Данные ", СсылкаНаОбъект);
	
	ОписаниеОшибки = "";
	
	ИзменениеЗапрещено = ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ДанныеДляПроверки, ОписаниеДанных,
							ОписаниеОшибки);
	
	УточнениеИнформации = НСтр("ru = 'При записи проведенного документа движения формируются только по регистрам подсистемы ""БИТ.ФИНАНС"".';
							   |en = 'При записи проведенного документа движения формируются только по регистрам подсистемы ""БИТ.ФИНАНС"".'");
	
	Элементы.ДекорацияНадписьИнформация1.Заголовок = ОписаниеОшибки + Символы.ПС + УточнениеИнформации;

КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьФлаги()
	
	ИспользуетсяГрупповаяТрансляция = ПравоДоступа("Использование", 
		Метаданные.Обработки.бит_ГрупповоеРедактированиеДополнительныхАналитик);
	
КонецПроцедуры

// Процедура заполняет значения, необходимые для работы на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ИзмеренияДоп"      , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним"));
	// Настройки дополнительных измерений
	КэшЗначений.Вставить("НастройкиИзмерений", бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	// Настройки всех дополнительных аналитик
	КэшЗначений.Вставить("НастройкиАналитик", бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхАналитик());

КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаКлиентеНаСервереБезКонтекста 
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ПредупреждениеОЗапретеИзменения.Видимость = Форма.ИзменениеЗапрещено;
	
	Элементы.ПредупреждениеОНезаписанномДокументе.Видимость = Форма.ВладелецМодифицирован;
	Элементы.ФормаЗаписатьИЗакрыть.Доступность 				= НЕ Форма.ВладелецМодифицирован;
	Элементы.ЗапретитьПерезаполнениеАналитик.Доступность    = НЕ Форма.ВладелецМодифицирован;
	
	Элементы.ФормаГрупповаяТрансляция.Видимость   = Форма.ИспользуетсяГрупповаяТрансляция;
	Элементы.ФормаГрупповаяТрансляция.Доступность = НЕ Форма.ВладелецМодифицирован;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРеквизитыВладельцаАналитик()
	
	МетаданныеСсылки = СсылкаНаОбъект.Метаданные();
	ИменаРеквизитов  = Новый Массив;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеСсылки) Тогда
		ИменаРеквизитов.Добавить("Организация");
	КонецЕсли; 
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеСсылки) Тогда
		ИменаРеквизитов.Добавить("Контрагент");
	КонецЕсли;
	
	Если ИменаРеквизитов.Количество() <> 0 Тогда
		РеквизитыСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСсылки);
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура ДоработатьТаблицуАналитик()

	Для каждого СтрокаТаблицы Из НаборДопАналитики Цикл
		ДозаполнитьСтрокуАналитик(СтрокаТаблицы);
	КонецЦикла; 

КонецПроцедуры

// Процедура дозаполняет строку аналитик. 
// 
&НаСервере
Процедура ДозаполнитьСтрокуАналитик(ТекущиеДанные)

	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Аналитика) Тогда
			
			ОписаниеТиповАналитики = ТекущиеДанные.Аналитика.ТипЗначения;
			ТекущиеДанные.ЗначениеАналитики = ОписаниеТиповАналитики.ПривестиЗначение(ТекущиеДанные.ЗначениеАналитики);
			
			// Для дополнительных значений аналитик необходимо проверить владельца.
			Если ТипЗнч(ТекущиеДанные.ЗначениеАналитики) = Тип("СправочникСсылка.бит_ДополнительныеЗначенияАналитик") 
				 И ЗначениеЗаполнено(ТекущиеДанные.ЗначениеАналитики) Тогда
			
				Если НЕ ТекущиеДанные.ЗначениеАналитики.Владелец = ТекущиеДанные.Аналитика Тогда
				
					ТекущиеДанные.ЗначениеАналитики = Справочники.бит_ДополнительныеЗначенияАналитик.ПустаяСсылка();
				
				КонецЕсли; 
			
			КонецЕсли; 
			
			ТекущиеДанные.ИмяАналитики = СокрЛП(ТекущиеДанные.Аналитика.Код);
			
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры

// Обрабатывает изменение аналитики в строке таблицы НаборДопАналитики. 
// 
// Параметры:
//  ИдСтроки - Число.
// 
&НаСервере
Процедура ИзменениеАналитики(ИдСтроки)
	
	ТекущиеДанные = НаборДопАналитики.НайтиПоИдентификатору(ИдСтроки);
	ДозаполнитьСтрокуАналитик(ТекущиеДанные);
	
	Если КэшЗначений.НастройкиАналитик.Получить(ТекущиеДанные.ИмяАналитики) = Неопределено Тогда
		КэшЗначений.Вставить("НастройкиАналитик", бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхАналитик());	
	КонецЕсли;
	
КонецПроцедуры // ИзменениеАналитики()

&НаСервере
Процедура ЗаполнитьШапку(ЗаполнитьДополнительныеКолонки)
	
	НаборДопАналитики.Очистить();
	бит_МеханизмДопИзмерений.ЗаполнитьДополнительныеАналитикиПоУмолчанию(
		СсылкаНаОбъект, НаборДопАналитики, Истина, Ложь);
	
	Кандидат = ОсновнаяСтатьяОборотов(ЭтотОбъект);
	Если ЗаполнитьДополнительныеКолонки Тогда
		Если ОсновнаяСтатьяОборотов <> Кандидат Тогда
			ОсновнаяСтатьяОборотов = Кандидат;
		КонецЕсли;	
	Иначе
		ОсновнаяСтатьяОборотов = Кандидат;
	КонецЕсли; 
		
КонецПроцедуры

// Процедура заполняет дополнительные аналитики по платежной позиции.
// Параметры:
//  ДокументБит - ДокументСсылка.бит_ПлатежнаяПозиция 
// 				  или ДокументСсылка.бит_РасходнаяПозиция 
// 				  или ДокументСсылка.бит_ПланируемоеПоступлениеДенежныхСредств.
// 
&НаСервере
Процедура ЗаполнениеДополнительныхАналитикПоДокументуБит(Аналитика, ЗначениеАналитики)
	
	// Указатель текущей строки списка.
	Ключ = Новый Структура("Аналитика", Аналитика);

	НаборДопАналитики.Очистить();
	
	НаборЗаписейАналитики = РеквизитФормыВЗначение("НаборДопАналитики");
	бит_МеханизмДопИзмерений.ЗаполнитьДополнительныеАналитикиПоДокументуБит(
		НаборЗаписейАналитики, СсылкаНаОбъект, ЗначениеАналитики);
	ЗначениеВРеквизитФормы(НаборЗаписейАналитики, "НаборДопАналитики");	
	
	Для каждого ТекущаяСтрока Из НаборДопАналитики Цикл
		ДозаполнитьСтрокуАналитик(ТекущаяСтрока);	
	КонецЦикла;
	
	// Поиск активной строки до операции заполнения набора
	// и установка курсора в результат поиска.
	РезультатПоиска = НаборДопАналитики.НайтиСтроки(Ключ);
	Если РезультатПоиска <> Неопределено Тогда
		Идентификатор = РезультатПоиска[0].ПолучитьИдентификатор();
		Элементы.НаборДопАналитики.ТекущаяСтрока = Идентификатор;
	КонецЕсли;
	 	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораСтатьиОборотов()

	ТипыДокументовБанкКасса = Новый Массив(); 
	ТипыДокументовБанкКасса.Добавить(Тип("ДокументСсылка." 
		+ бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ИмяДокументаПоступленияБезналичныхДенежныхСредств()));
	ТипыДокументовБанкКасса.Добавить(Тип("ДокументСсылка." 
		+ бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ИмяДокументаСписанияБезналичныхДенежныхСредств()));
	ТипыДокументовБанкКасса.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	ТипыДокументовБанкКасса.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	
	Если ТипыДокументовБанкКасса.Найти(ТипЗнч(СсылкаНаОбъект)) <> Неопределено Тогда
		Фильтр = Новый Структура("ТипСтатьи", ПредопределенноеЗначение("Перечисление.бит_ТипыСтатейОборотов.БДДС"));
		бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элементы.НаборДопАналитикиЗначениеАналитики, Фильтр);		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти