
&НаКлиенте
Процедура бит_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
		
	// {{ПервыйБИТ ЛистТребований [6.2] [ASHolyavko@1cbit.ru] [02.04.2026] +        
	
	ПроверитьПредставление(); 
	
	// }}ПервыйБИТ ЛистТребований [6.2] [ASHolyavko@1cbit.ru] [02.04.2026] -
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПредставление()
	
	// {{ПервыйБИТ ЛистТребований [6.2] [ASHolyavko@1cbit.ru] [02.04.2026] +
	
	СтруктураПредставления = Новый Структура;
	СтруктураПредставления.Вставить("НаборСвойств", Объект.НаборСвойств);
	СтруктураПредставления.Вставить("Заголовок", Объект.Заголовок);
	СтруктураПредставления.Вставить("Ссылка", Объект.Ссылка);
	
	Представление = "";
	ОбработкаПолученияПредставления(СтруктураПредставления, Представление);
	
	Если Представление <> Объект.бит_Представление Тогда
		Объект.бит_Представление = Представление;	
	КонецЕсли;

	// }}ПервыйБИТ ЛистТребований [6.2] [ASHolyavko@1cbit.ru] [02.04.2026] -
	
КонецПроцедуры    

&НаСервере
Процедура ОбработкаПолученияПредставления(Данные, Представление)
	
	// {{ПервыйБИТ ЛистТребований [6.2] [ASHolyavko@1cbit.ru] [02.04.2026] +
	
	ПредставлениеНабора = "";
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Если Не УправлениеСвойствамиПовтИсп.ЭтоОсновнойЯзык()
		И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
		МодульМультиязычностьКлиентСервер = ОбщегоНазначения.ОбщийМодуль("МультиязычностьКлиентСервер");
		МодульМультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, Ложь, "Заголовок");
	КонецЕсли;
	     
	Если ЗначениеЗаполнено(Данные.НаборСвойств) Тогда
		ПредставленияНаборовСвойств = УправлениеСвойствамиПовтИсп.ПредставленияНаборовСвойств();
		ПредставлениеНабора = ПредставленияНаборовСвойств.Получить(Данные.НаборСвойств);
	КонецЕсли;
#Иначе
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
		МодульМультиязычностьКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("МультиязычностьКлиентСервер");
		МодульМультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, Ложь, "Заголовок");
	КонецЕсли;
#КонецЕсли
	
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Представление = Данные.Заголовок;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.НаборСвойств) Тогда
		Если Не ЗначениеЗаполнено(ПредставлениеНабора) Тогда
			ПредставлениеНабора = Строка(Данные.НаборСвойств);
		КонецЕсли;
		Представление = Представление + " (" + ПредставлениеНабора + ")";
	КонецЕсли;
	//СтандартнаяОбработка = Ложь; 
	
	// }}ПервыйБИТ ЛистТребований [6.2] [ASHolyavko@1cbit.ru] [02.04.2026] -
	
КонецПроцедуры

&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [6.2] [ASHolyavko@1cbit.ru] [02.04.2026] +
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Представление", Тип("ПолеФормы"), Элементы.ГруппаДляРазработчиков);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Представление";
	
	// }}ПервыйБИТ ЛистТребований [6.2] [ASHolyavko@1cbit.ru] [02.04.2026] -
	
КонецПроцедуры
