
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ОбластьЗамещения = ?(ЗначениеЗаполнено(Запись.РольИсполнителя), 1, 0);
	
	МаксКоличествоОбъектов = бит_УправлениеПроцессами.МаксимальноеКоличествоОбъектовАдресации();
	НастройкиАдресации = Справочники.бит_РолиИсполнителей.НастройкиОбъектовАдресации(Запись.РольИсполнителя);
	
	УстановитьВидимость();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбластьЗамещения = 1 Тогда
		
		ПроверяемыеРеквизиты.Добавить("РольИсполнителя");
		
	Иначе	
		
		ПроверяемыеРеквизиты.Добавить("Виза");
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбластьЗамещенияПриИзменении(Элемент)
	
	ОбластьЗамещенияИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура ВизаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("СправочникСсылка.бит_Визы")	  , НСтр("ru = 'Визы'; en = 'Visas'"));
	СписокТипов.Добавить(Тип("СправочникСсылка.бит_ГруппыВиз"), НСтр("ru = 'Группы виз'; en = 'Visa groups'"));	
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект, Элемент, Запись, "Виза", СписокТипов, СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВизаОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РольИсполнителяПриИзменении(Элемент)
	
	РольИсполнителяИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресации_1Очистка(Элемент, СтандартнаяОбработка)
	
	ОчисткаОбъектаАдресации("ОбъектАдресации_1");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресации_2Очистка(Элемент, СтандартнаяОбработка)
	
	ОчисткаОбъектаАдресации("ОбъектАдресации_2");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектАдресации_3Очистка(Элемент, СтандартнаяОбработка)
	
	ОчисткаОбъектаАдресации("ОбъектАдресации_3");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура управляет видимостью/доступностью элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()

   ЭтоВизы = ОбластьЗамещения = 0;	
   
   Элементы.Виза.Видимость = ЭтоВизы;
   Элементы.ПользовательскоеУсловие.Видимость = ЭтоВизы;
   Элементы.РольИсполнителя.Видимость = НЕ ЭтоВизы;
   
	НачалоИмени = "ОбъектАдресации_";
	Для Сч = 1 По МаксКоличествоОбъектов Цикл
		
		Имя          = НачалоИмени + Сч;
		ТекНастройка = Неопределено;
		НастройкиАдресации.Свойство(Имя, ТекНастройка);
		
		флВидимость    = Ложь;
		флОбязательный = Ложь;
		ТекЗаголовок   = СтрШаблон(НСтр("ru='Объект адресации №%1';en='Addressing object №%1'"), Сч);
		Если ТекНастройка <> Неопределено Тогда
			
			флВидимость    = Истина;
			ТекЗаголовок   = ТекНастройка.Синоним;
			флОбязательный = ТекНастройка.Обязательный;
			
		КонецЕсли; 
		
		Элементы[Имя].Видимость = флВидимость;
		Элементы[Имя].Заголовок = ТекЗаголовок;
		Элементы[Имя].АвтоОтметкаНезаполненного = флОбязательный;
		
	КонецЦикла; 
   
КонецПроцедуры // УстановитьВидимость()

// Процедура обрабатывает изменение области замещения.
// 
&НаСервере
Процедура ОбластьЗамещенияИзменение()
	
	УстановитьВидимость();	
	
	Если ОбластьЗамещения = 1 Тогда	
		Запись.Виза = Неопределено;		
	Иначе	
		Запись.РольИсполнителя = Неопределено;        
        Для Сч = 1 По МаксКоличествоОбъектов Цикл		
			Запись["ОбъектАдресации_" + Сч] = Неопределено;		
		КонецЦикла;	
	КонецЕсли; 
	
КонецПроцедуры // ОбластьЗамещенияИзменение()

// Процедура обрабатывает изменение роли исполнителя. 
// 
&НаСервере
Процедура РольИсполнителяИзменение()
	
	НастройкиАдресации = Справочники.бит_РолиИсполнителей.НастройкиОбъектовАдресации(Запись.РольИсполнителя);
	
	// Присвоим типы объектам адресации
	НачалоИмени = "ОбъектАдресации_";
	Для Сч = 1 По МаксКоличествоОбъектов Цикл
		
		Имя          = НачалоИмени + Сч;
		ТекНастройка = Неопределено;
		НастройкиАдресации.Свойство(Имя, ТекНастройка);
		
		Если ТекНастройка <> Неопределено Тогда			
			Запись[Имя] = ТекНастройка.Тип.ПривестиЗначение(Запись[Имя]);			
		Иначе			
			Запись[Имя] = Неопределено;			
		КонецЕсли; 
		
	КонецЦикла; // МаксКоличествоОбъектов	
	
	УстановитьВидимость();	
	
КонецПроцедуры // РольИсполнителяИзменение()

// Процедура осуществляет очистку объекта адресации. 
// 
// Параметры:
//  Имя - Строка.
// 
&НаКлиенте
Процедура ОчисткаОбъектаАдресации(Имя)
	
	ТекНастройка = Неопределено;
	НастройкиАдресации.Свойство(Имя, ТекНастройка);
	
	Если ТекНастройка <> Неопределено Тогда
		
		Запись[Имя] = ТекНастройка.Тип.ПривестиЗначение(Запись[Имя]);
		
	Иначе
		
		Запись[Имя] = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры // ОчисткаОбъектаАдресации()

#КонецОбласти
