#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Переносит сохраненные настройки в данные подсистемы "Варианты отчетов".
//
Процедура ПеренестиСохраненныхНастройкиВПодсистемуВариантыОтчетов() Экспорт

	ПрототипСсылка = ПредопределенныйВариант();
	Если Не ЗначениеЗаполнено(ПрототипСсылка) Тогда
		ВызватьИсключение НСтр("ru = 'Не найден вариант-прототип.'");
	КонецЕсли;
	
	ДанныеДляПереноса = ДанныеДляПереноса();
	Для каждого Данные Из ДанныеДляПереноса Цикл
		ПеренестиСохраненнуюНастройку(Данные, ПрототипСсылка);
	КонецЦикла;	

КонецПроцедуры

// Добавляет фиксированные переметры в сохраенные настройки. 
//
Процедура ДобавитьФиксированныеПереметрыСКДПриПереходеНаНовуюВерсию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкиОтчетов.Ссылка КАК Ссылка,
	|	бит_НастройкиОтчетов.СхемаКомпоновкиДанных КАК СхемаКомпоновкиДанных,
	|	бит_НастройкиОтчетов.ВариантОтчета КАК ВариантОтчета
	|ИЗ
	|	Справочник.бит_НастройкиОтчетов КАК бит_НастройкиОтчетов
	|ГДЕ
	|	НЕ бит_НастройкиОтчетов.ПометкаУдаления
	|	И НЕ бит_НастройкиОтчетов.ЭтоГруппа";
	
	Выборка= Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка			
			ПодготовитьСхемуКомпоновкиДанных(Выборка.Ссылка);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			бит_ОбновлениеИнформационнойБазыБФ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Выборка.Ссылка);
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьФиксированныеПереметры(СхемаКомпоновкиДанных) Экспорт
	
	Если ТипЗнч(СхемаКомпоновкиДанных) = Тип("СхемаКомпоновкиДанных") Тогда
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Иначе
		Настройки = СхемаКомпоновкиДанных;
	КонецЕсли;
	
	ОсновнаяСхема			= Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ПредопределенныйВариант = ОсновнаяСхема.НастройкиПоУмолчанию;
	ФиксированныеПараметры	= НовыеФиксированныеПараметры();

	Для каждого ФиксированныйПереметр Из ФиксированныеПараметры Цикл
		ИмяПараметра = ФиксированныйПереметр.Ключ;
		Если ТипЗнч(СхемаКомпоновкиДанных) = Тип("СхемаКомпоновкиДанных") Тогда
			Параметр = бит_ОтчетыБФСервер.ПолучитьПараметрСКД(СхемаКомпоновкиДанных,  ИмяПараметра);
			Если Параметр = Неопределено Тогда
				ПараметрИсточник = бит_ОтчетыБФСервер.ПолучитьПараметрСКД(ОсновнаяСхема,  ИмяПараметра);
				НовыйПараметр = бит_ОтчетыБФСервер.ДобавитьПараметр(СхемаКомпоновкиДанных, ИмяПараметра); 
				ЗаполнитьЗначенияСвойств(НовыйПараметр, ПараметрИсточник);
			КонецЕсли;
		КонецЕсли;

		Параметр = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(Настройки, ИмяПараметра);
		Если Параметр = Неопределено Тогда
			ПараметрИсточник = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(ПредопределенныйВариант,  ИмяПараметра);
			НовыйПараметр = Настройки.ПараметрыДанных.Элементы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйПараметр,ПараметрИсточник); 
		КонецЕсли;
	КонецЦикла;

	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		РежимыОтображенияФиксированныхПараметров = РежимыОтображенияФиксированныхПараметров(Настройки);
		УстановитьРежимыОтображенияФиксированныхПараметров(Настройки, РежимыОтображенияФиксированныхПараметров);
	КонецЕсли;
		
КонецПроцедуры

Функция ДоступныеЗначенияПараметровИзНастройкиОтчета(НастройкаОтчета) Экспорт

	Если НЕ ЗначениеЗаполнено(НастройкаОтчета) Тогда
		Возврат Новый Структура;	
	КонецЕсли;
	
	Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотГод);
	
	РеквизитыНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаОтчета, 
							"ВариантОтчета, ИсточникДанных, Язык");
	
	ВариантИзНастройки = РеквизитыНастройки.ВариантОтчета.Получить();
	Если ТипЗнч(ВариантИзНастройки) = Тип("Строка") Тогда
		ОсновнойВариантОтчета = ОбщегоНазначения.ЗначениеИзСтрокиXML(ВариантИзНастройки);
		ПараметрПериод = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(ОсновнойВариантОтчета, "Период");
		Если ПараметрПериод <> Неопределено Тогда
			Период = ПараметрПериод.Значение;		
		КонецЕсли;
	КонецЕсли; 
	
	НастройкиИсточника = НовыеНастройкиИсточника();

	бит_МеханизмПолученияДанных.ОбновитьТаблицуПараметров(РеквизитыНастройки.ИсточникДанных, 
			НастройкиИсточника.ПараметрыИсточника, Истина);
			
	бит_МеханизмПолученияДанных.ЗаполнитьОтборВОтчете(РеквизитыНастройки.ИсточникДанных, 
			НастройкиИсточника.ОтборыИсточника);
	
	ДоступныеЗначения = Новый Структура;
	ДоступныеЗначения.Вставить("Период",			 Период);
	ДоступныеЗначения.Вставить("Язык",				 РеквизитыНастройки.Язык);
	ДоступныеЗначения.Вставить("НастройкиИсточника", Новый ХранилищеЗначения(НастройкиИсточника));
	
	Возврат ДоступныеЗначения;
	
КонецФункции

// Функция заполняет схему компоновки данных по умолчанию.
// 
// 
// Возвращаемое значение:
//   СКД   - СхемаКомпоновкиДанных.
// 
Функция ЗаполнитьСхемуКомпоновки(ПараметрыЗаполнения, СпособЗаполнения = "") Экспорт
	
	ИсточникДанных = ПараметрыЗаполнения.ИсточникДанных;
	Наименование   = ПараметрыЗаполнения.Наименование;
	
	СКД = Новый СхемаКомпоновкиДанных;
	
	ИсточникиДанныхКомпоновки = СКД.ИсточникиДанных.Добавить();
	ИсточникиДанныхКомпоновки.Имя                = "ИсточникДанных1";
	ИсточникиДанныхКомпоновки.ТипИсточникаДанных = "Local";
	
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя 		   = "мТаблицаРезультат";
	НаборДанных.ИмяОбъекта 	   = "мТаблицаРезультат";
	НаборДанных.ИсточникДанных = ИсточникиДанныхКомпоновки.Имя;
	
	// Поля набора данных.
	Если ТипЗнч(ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		
		РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсточникДанных, "ЗапросБД, Поля");
		РеквизитыИсточника.Поля = РеквизитыИсточника.Поля.Выгрузить();
		
		ТекстЗапроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыИсточника.ЗапросБД, "ТекстЗапроса");
		
		Схема = Новый СхемаЗапроса;
		Схема.УстановитьТекстЗапроса(ТекстЗапроса);
		
		ЗапросПакета = Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1]; // Может быть НЕ ВЫБОР
		
		Для каждого ПолеИсточника Из РеквизитыИсточника.Поля Цикл
			
			Если ПолеИсточника.Использование Тогда
				
				ИмяПоля = ?(НЕ ПустаяСтрока(ПолеИсточника.Синоним),ПолеИсточника.Синоним,ПолеИсточника.Имя);
				ЭтоИзмерение = ВРЕГ(ПолеИсточника.ВидПоля) = ВРЕГ("Поле");
				Если ЭтоИзмерение Тогда
					Колонка = ЗапросПакета.Колонки.Найти(ПолеИсточника.Имя);
					Если НЕ Колонка = Неопределено  Тогда
					    ОписаниеТипов = Колонка.ТипЗначения;
					Иначе	
					    ОписаниеТипов = Неопределено;
					КонецЕсли; 
				Иначе	
					ОписаниеТипов = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3);
				КонецЕсли; 
				ДобавитьПолеНабораДанныхКомпоновки(НаборДанных, ИмяПоля,, ОписаниеТипов, ЭтоИзмерение);			
				
				// Заполним ресурсы компоновки
				Если НЕ ЭтоИзмерение Тогда
					ПолеИтога = СКД.ПоляИтога.Добавить();
					ПолеИтога.Выражение   = "Сумма(" + ИмяПоля + ")";
					ПолеИтога.ПутьКДанным = ИмяПоля;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		
	ИначеЕсли ТипЗнч(ИсточникДанных) = Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных") Тогда	
		
		// Добавим поля, специфичные для работы через способы компоновки источников данных.
		ОписаниеЭлементыДанных = Новый ОписаниеТипов("СправочникСсылка.бит_ЭлементыДанных");
		ДобавитьПолеНабораДанныхКомпоновки(НаборДанных, "Кодификатор"		 , НСтр("ru = 'Кодификатор'; en = 'Codifier'"));				
		ДобавитьПолеНабораДанныхКомпоновки(НаборДанных, "ЭлементДанных"		 , НСтр("ru = 'Элемент данных'; en = 'Data element'") , ОписаниеЭлементыДанных);
		ДобавитьПолеНабораДанныхКомпоновки(НаборДанных, "ГруппаЭлементДанных", НСтр("ru = 'Группа элементов данных'; en = 'Group of data elements'") , ОписаниеЭлементыДанных);
		
		РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсточникДанных, "КолонкиТаблицы, НеРассчитыватьИтогиПоГруппам");
		РеквизитыИсточника.КолонкиТаблицы = РеквизитыИсточника.КолонкиТаблицы.Выгрузить();
		Для каждого ПолеИсточника Из РеквизитыИсточника.КолонкиТаблицы Цикл
			
			ИмяПоля = ПолеИсточника.ИмяКолонки;
			ЭтоИзмерение = ВРЕГ(ПолеИсточника.ВидКолонки) = ВРЕГ("Поле");
			Если ЭтоИзмерение Тогда
				ОписаниеТипов = ПолеИсточника.ОписаниеТипов.Получить();
			Иначе	
				ОписаниеТипов = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3);
			КонецЕсли; 
			ДобавитьПолеНабораДанныхКомпоновки(НаборДанных, ИмяПоля,, ОписаниеТипов, ЭтоИзмерение);			
			
			// Заполним ресурсы компоновки
			Если НЕ ЭтоИзмерение Тогда
				ПолеИтога = СКД.ПоляИтога.Добавить();
				Если РеквизитыИсточника.НеРассчитыватьИтогиПоГруппам Тогда
					ПолеИтога.Выражение = "Сумма(" + ИмяПоля + ")";
				Иначе	
					ПолеИтога.Выражение = ИмяПоля;
				КонецЕсли; 
				ПолеИтога.ПутьКДанным = ИмяПоля;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
		
	// Поля
	Для каждого ПолеНабора Из НаборДанных.Поля Цикл
		ВыбранноеПоле  = СКД.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеКомпоновки = Новый  ПолеКомпоновкиДанных(ПолеНабора.ПутьКДанным);
		ВыбранноеПоле.Поле          = ПолеКомпоновки;
		ВыбранноеПоле.Использование = Истина;
	КонецЦикла; 
	
	// Структура
	Если СпособЗаполнения = "ИерархияЭлементовДанных" Тогда
		
		ГруппировкаКомпоновки = СКД.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ВыбранноеПоле         = ГруппировкаКомпоновки.Выбор.Элементы.Добавить(Тип("АвтовыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Использование = Истина;
		
		ВыбранноеПоле         = ГруппировкаКомпоновки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле      	= Новый  ПолеКомпоновкиДанных("ЭлементДанных.Кодификатор");
		
		ВыбранноеПоле         = ГруппировкаКомпоновки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле      	= Новый  ПолеКомпоновкиДанных("ЭлементДанных");
		
		ПолеГруппировки = ГруппировкаКомпоновки.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Использование  = Истина;
		ПолеГруппировки.Поле           = Новый  ПолеКомпоновкиДанных("ЭлементДанных");
		ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
		ПолеГруппировки.ТипДополнения  = ТипДополненияПериодаКомпоновкиДанных.БезДополнения;
		
	Иначе	
		
		ГруппировкаКомпоновки = СКД.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ВыбранноеПоле         = ГруппировкаКомпоновки.Выбор.Элементы.Добавить(Тип("АвтовыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Использование = Истина;
		
	КонецЕсли; 
	
	// Заголовок отчета
	ЗначениеПараметра = СКД.НастройкиПоУмолчанию.ПараметрыВывода.Элементы.Найти("Title");
	ЗначениеПараметра.Использование = Истина;
	ЗначениеПараметра.Значение      = Наименование;
	
	// Вывод заголовка
	ЗначениеПараметра = СКД.НастройкиПоУмолчанию.ПараметрыВывода.Элементы.Найти("TitleOutput");
	ЗначениеПараметра.Использование = Истина;
	ЗначениеПараметра.Значение      = ТипВыводаТекстаКомпоновкиДанных.Выводить;
	
	// Вывод итогов по горизонтали
	ЗначениеПараметра = СКД.НастройкиПоУмолчанию.ПараметрыВывода.Элементы.Найти("HorizontalOverallPlacement");
	ЗначениеПараметра.Использование = Истина;
	ЗначениеПараметра.Значение      = РасположениеИтоговКомпоновкиДанных.Нет;
	
	// Вывод итогов по вертикали
	ЗначениеПараметра = СКД.НастройкиПоУмолчанию.ПараметрыВывода.Элементы.Найти("VerticalOverallPlacement");
	ЗначениеПараметра.Использование = Истина;
	ЗначениеПараметра.Значение      = РасположениеИтоговКомпоновкиДанных.Нет;
	
	// Способ вывода реквизитов
	ЗначениеПараметра = СКД.НастройкиПоУмолчанию.ПараметрыВывода.Элементы.Найти("AttributePlacement");
	ЗначениеПараметра.Использование = Истина;
	ЗначениеПараметра.Значение      = РасположениеРеквизитовКомпоновкиДанных.Отдельно;
	
	ДобавитьФиксированныеПереметры(СКД);
	
	Возврат СКД;
	
КонецФункции // ЗаполнитьСхемуКомпоновки()

Функция РежимыОтображенияФиксированныхПараметров(Настройки) Экспорт
	
	РежимыОтображения = Новый Структура();
	РежимыОтображения.Вставить("Период", 		  		   РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	РежимыОтображения.Вставить("НастройкаОтчета", 		   РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	РежимыОтображения.Вставить("НастройкаПулаПодключений", РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	РежимыОтображения.Вставить("Язык", 					   РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	РежимыОтображения.Вставить("ВалютДокумента", 		   РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	РежимыОтображения.Вставить("НастройкиИсточника", 	   РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	Параметры = Настройки.ПараметрыДанных.Элементы;
	
	Для Каждого РежимОтображения Из РежимыОтображения Цикл 
		
		НайденныйПараметр = Параметры.Найти(РежимОтображения.Ключ);
		
		Если НайденныйПараметр <> Неопределено Тогда 
			РежимыОтображения[РежимОтображения.Ключ] = НайденныйПараметр.РежимОтображения;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РежимыОтображения;
	
КонецФункции

Функция НовыеНастройкиИсточника() Экспорт

	ПараметрыИсточника = НовыеПараметрыИсточника();
	ОтборыИсточника    = НовыеОтборыИсточника();
	НастройкиИсточника = Новый Структура("ПараметрыИсточника, ОтборыИсточника", 
							ПараметрыИсточника, ОтборыИсточника);
							
	Возврат НастройкиИсточника;						

КонецФункции

Функция НовыеПараметрыИсточника() Экспорт

	Таблица = Новый ТаблицаЗначений;	
	Таблица.Колонки.Добавить("ИмяПараметра");
	Таблица.Колонки.Добавить("ВидПараметра");
	Таблица.Колонки.Добавить("ЗначениеПараметра");
	Таблица.Колонки.Добавить("ДоступныеТипы");
	
	Возврат Таблица;

КонецФункции

Функция НовыеОтборыИсточника() Экспорт

	Таблица = Новый ТаблицаЗначений;	
	Таблица.Колонки.Добавить("Имя");
	Таблица.Колонки.Добавить("ВидСравнения");
	Таблица.Колонки.Добавить("Значение");
	Таблица.Колонки.Добавить("Использование");
	
	Возврат Таблица;

КонецФункции

Функция ПредопределенныйВариант() Экспорт

	Перем Вариант;
	
	ИдентификаторОтчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторОтчета", ИдентификаторОтчета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВариантыОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО ВариантыОтчетов.ПредопределенныйВариант.Отчет = ИдентификаторыОбъектовМетаданных.Ссылка
	|			И (ИдентификаторыОбъектовМетаданных.Ссылка = &ИдентификаторОтчета)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Вариант = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Вариант;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИБ

Функция ДанныеДляПереноса()

	ДанныеДляПереноса = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипНастройки"	   , Перечисления.бит_ТипыСохраненныхНастроек.Отчеты);
	Запрос.УстановитьПараметр("НастраиваемыйОбъект", "Отчет.бит_УниверсальныйОтчетИсточникиДанных_Скд");
	Запрос.УстановитьПараметр("КлючОбъекта"		   , "Отчет.бит_УниверсальныйОтчетИсточникиДанных_Скд");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СохраненныеНастройки.Ссылка КАК НастройкаСсылка,
	|	СохраненныеНастройки.Ответственный КАК Ответственный,
	|	СохраненныеНастройки.КлючНастройки КАК КлючНастройки,
	|	СохраненныеНастройки.Описание КАК Описание,
	|	СохраненныеНастройки.КлючОбъекта КАК КлючОбъекта,
	|	СохраненныеНастройки.НастраиваемыйОбъект КАК НастраиваемыйОбъект,
	|	СохраненныеНастройки.ХранилищеНастроек КАК ХранилищеНастроек,
	|	СохраненныеНастройки.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТ_СохраненныеНастройки
	|ИЗ
	|	Справочник.бит_СохраненныеНастройки КАК СохраненныеНастройки
	|ГДЕ
	|	СохраненныеНастройки.ТипНастройки = &ТипНастройки
	|	И СохраненныеНастройки.НастраиваемыйОбъект = &НастраиваемыйОбъект
	|	И СохраненныеНастройки.КлючОбъекта = &КлючОбъекта
	|	И НЕ СохраненныеНастройки.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СохраненныеНастройки.НастройкаСсылка КАК НастройкаСсылка,
	|	ВТ_СохраненныеНастройки.Ответственный КАК Автор,
	|	ВТ_СохраненныеНастройки.КлючНастройки КАК КлючВарианта,
	|	ВТ_СохраненныеНастройки.Описание КАК Описание,
	|	ВТ_СохраненныеНастройки.КлючОбъекта КАК КлючОбъекта,
	|	ВТ_СохраненныеНастройки.НастраиваемыйОбъект КАК НастраиваемыйОбъект,
	|	ВТ_СохраненныеНастройки.ХранилищеНастроек КАК ХранилищеНастроек,
	|	ВТ_СохраненныеНастройки.Наименование КАК Наименование
	|ИЗ
	|	ВТ_СохраненныеНастройки КАК ВТ_СохраненныеНастройки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиДоступностиВариантовОтчетов.ВариантНастройка КАК НастройкаСсылка,
	|	НастройкиДоступностиВариантовОтчетов.Пользователь КАК Пользователь
	|ИЗ
	|	ВТ_СохраненныеНастройки КАК ВТ_СохраненныеНастройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкиДоступностиВариантовОтчетов КАК НастройкиДоступностиВариантовОтчетов
	|		ПО ВТ_СохраненныеНастройки.НастройкаСсылка = НастройкиДоступностиВариантовОтчетов.ВариантНастройка
	|ГДЕ
	|	НастройкиДоступностиВариантовОтчетов.Просмотр
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкаСсылка";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаСохраненныеНастройки = Результат[1].Выбрать();
	ВыборкаНастройкиДоступности = Результат[2].Выгрузить();
	
	Пока ВыборкаСохраненныеНастройки.Следующий() Цикл
		СохраненнаяНастройка = Новый Структура;
		СохраненнаяНастройка.Вставить("НастройкаСсылка",  ВыборкаСохраненныеНастройки.НастройкаСсылка);
		СохраненнаяНастройка.Вставить("Автор", 			  ВыборкаСохраненныеНастройки.Автор);
		СохраненнаяНастройка.Вставить("КлючВарианта", 	  ВыборкаСохраненныеНастройки.КлючВарианта);
		СохраненнаяНастройка.Вставить("Описание",		  ВыборкаСохраненныеНастройки.Описание);
		СохраненнаяНастройка.Вставить("ХранилищеНастроек",ВыборкаСохраненныеНастройки.ХранилищеНастроек);
		СохраненнаяНастройка.Вставить("Наименование",	  ВыборкаСохраненныеНастройки.Наименование);
		
		НастройкиДоступности = Новый СписокЗначений;
		РезультатПоиска = ВыборкаНастройкиДоступности.НайтиСтроки(Новый Структура("НастройкаСсылка", ВыборкаСохраненныеНастройки.НастройкаСсылка));
		Для каждого СтрокаТаблицы Из РезультатПоиска Цикл
			НастройкиДоступности.Добавить(СтрокаТаблицы.Пользователь);
		КонецЦикла;
		
		Данные = Новый Структура("СохраненнаяНастройка, НастройкиДоступности");
		Данные.СохраненнаяНастройка = СохраненнаяНастройка;
		Данные.НастройкиДоступности = НастройкиДоступности;
		
		ДанныеДляПереноса.Добавить(Данные);
	КонецЦикла;
	
	Возврат ДанныеДляПереноса;

КонецФункции

Процедура ПеренестиСохраненнуюНастройку(Данные, ПрототипСсылка)
	
	СохраненнаяНастройка = Данные.СохраненнаяНастройка;
	ПользователиВарианта = Данные.НастройкиДоступности;
	
	ДеревоПодсистем = ДеревоПодсистем(Справочники.ВариантыОтчетов.ПустаяСсылка());
	
	КлючОтчета = Метаданные.Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.ПолноеИмя();
	
	// АПК:278-выкл Допустимое исключение.
	ОтчетИнформация = ВариантыОтчетов.ИнформацияОбОтчете(КлючОтчета, Истина);
	// АПК:278-вкл	
	
	Если ЗначениеЗаполнено(СохраненнаяНастройка.Автор) Тогда
		ТекущийПользователь = СохраненнаяНастройка.Автор;
	Иначе	
		ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ТекущийПользователь", ТекущийПользователь);
	Контекст.Вставить("ПолныеПраваНаВарианты", ВариантыОтчетов.ПолныеПраваНаВарианты());
	Контекст.Вставить("ОтчетСсылка", ОтчетИнформация.Отчет);
	Контекст.Вставить("ОтчетИмя", ОтчетИнформация.ОтчетИмя);
	Контекст.Вставить("ТипОтчета", ОтчетИнформация.ТипОтчета);
	Контекст.Вставить("ЭтоВнешний", ОтчетИнформация.ТипОтчета = Перечисления.ТипыОтчетов.Внешний);
	Контекст.Вставить("ПоискПоНаименованию", Новый Соответствие);

	Объект		  = Справочники.ВариантыОтчетов.СоздатьЭлемент();
	ВариантСсылка = Справочники.ВариантыОтчетов.ПустаяСсылка();
		
	НачатьТранзакцию();
	
	Попытка
		
		ВариантОбъект				   = Справочники.ВариантыОтчетов.СоздатьЭлемент();
		ВариантОбъект.Отчет 		   = Контекст.ОтчетСсылка;
		ВариантОбъект.ТипОтчета		   = Контекст.ТипОтчета;
		ВариантОбъект.КлючВарианта	   = Строка(Новый УникальныйИдентификатор());
		ВариантОбъект.Пользовательский = Истина;
		ВариантОбъект.Автор			   = Контекст.ТекущийПользователь;
		ВариантОбъект.Родитель		   = ПрототипСсылка;
		
		ИзмененныеРазделы = ДеревоПодсистем.Строки.НайтиСтроки(Новый Структура("Использование", 1), Истина);
		ВариантыОтчетов.ДеревоПодсистемЗаписать(ВариантОбъект, ИзмененныеРазделы);
		
		Описание = Новый Массив;
		Если ЗначениеЗаполнено(СохраненнаяНастройка.Описание) Тогда
			Описание.Добавить(СохраненнаяНастройка.Описание);
		КонецЕсли;
		Описание.Добавить(НСтр("ru = 'Перенесен из сохраненных настроек БИТ.ФИНАНС.'"));
		
		ВариантОбъект.Наименование 	  = СохраненнаяНастройка.Наименование;
		ВариантОбъект.Описание 		  = СтрСоединить(Описание, Символы.ПС);
		ВариантОбъект.ТолькоДляАвтора = ПользователиВарианта.Количество() <= 1;
		
		СоставНастройки = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		Если НЕ ТипЗнч(СоставНастройки) = Тип("Структура") Тогда
			ТекстСообщения = НСтр("ru = 'Сохраненная настройка %1 не содержит данных для переноса.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СохраненнаяНастройка.Наименование);
			
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СоставНастройки.НастройкаОтчета) Тогда
			ТекстСообщения = НСтр("ru = 'Сохраненная настройка %1 не содержит данных для переноса.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СохраненнаяНастройка.Наименование);
			
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		
		НастройкаОтчета = СоставНастройки.НастройкаОтчета;
		// Установка обязательных параметров.
		ПодготовитьСхемуКомпоновкиДанных(НастройкаОтчета);

		РеквизитыНастройкиОтчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаОтчета, 
										"ЗаголовокОтчета, СхемаКомпоновкиДанных, ВариантОтчета");		
		
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
			МодульМультиязычностьСервер = ОбщегоНазначения.ОбщийМодуль("МультиязычностьСервер");
			// АПК:278-выкл Допустимое исключение.
			МультиязычныеРеквизитыОбъекта =  МодульМультиязычностьСервер.МультиязычныеРеквизитыОбъекта(ВариантОбъект.Ссылка);
			// АПК:278-вкл	
			Если МультиязычныеРеквизитыОбъекта.Количество() > 0 Тогда
				
				НаборМультиязычныхРеквизитов = Новый Массив;
				Для Каждого ОписаниеРеквизита Из МультиязычныеРеквизитыОбъекта Цикл
					НаборМультиязычныхРеквизитов.Добавить(ОписаниеРеквизита.Ключ + "Язык1"); 
					НаборМультиязычныхРеквизитов.Добавить(ОписаниеРеквизита.Ключ + "Язык2");
				КонецЦикла;
				СписокМультиязычныхРеквизитов  = СтрСоединить(НаборМультиязычныхРеквизитов, ",");
				
				ЗаполнитьЗначенияСвойств(ВариантОбъект, Объект, СписокМультиязычныхРеквизитов);
				
			КонецЕсли;

			ТекстНаРазныхЯзыках = бит_СтрокиСервер.РазобратьТекстНаЯзыки(РеквизитыНастройкиОтчета.ЗаголовокОтчета);
			Для каждого КлючЗначение Из ТекстНаРазныхЯзыках Цикл
				Если КлючЗначение.Ключ = "ru" Тогда
					Продолжить;			
				КонецЕсли;
				НоваяСтрока = ВариантОбъект.Представления.Добавить();
				НоваяСтрока.КодЯзыка = КлючЗначение.Ключ;
				НоваяСтрока.Наименование = КлючЗначение.Значение;			
			КонецЦикла; 
			
			МодульМультиязычностьСервер.ПередЗаписьюНаСервере(ВариантОбъект);
			
		КонецЕсли;
		
		ВариантОбъект.ДополнительныеСвойства.Вставить("ПользователиВарианта", ПользователиВарианта); 
		ВариантОбъект.ДополнительныеСвойства.Вставить("УведомитьПользователей", Ложь);
		
		ВариантОбъект.Записать();
		
		ВариантСсылка       = ВариантОбъект.Ссылка;
		ВариантКлючВарианта = ВариантОбъект.КлючВарианта;
		
		// Подготовка старого варианта отчета для помещения в хранилище.
		СхемаКомпоновкиДанных 	  = РеквизитыНастройкиОтчета.СхемаКомпоновкиДанных.Получить();
		ВариантИзНастройки 		  = РеквизитыНастройкиОтчета.ВариантОтчета.Получить();
		
		ОсновнойВариантОтчета = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		Если ТипЗнч(ВариантИзНастройки) = Тип("Строка") Тогда
			ОсновнойВариантОтчета = ОбщегоНазначения.ЗначениеИзСтрокиXML(ВариантИзНастройки);
		КонецЕсли;
		
		НастройкиКомпоновщика	  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СоставНастройки, "НастройкиКомпоновщика");
		ПользовательскиеНастройки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СоставНастройки, "ПользовательскиеНастройки");

		НастройкаПулаПодключений  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СоставНастройки, "НастройкаПулаПодключений"); 
		ОтборВОтчете		      = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СоставНастройки, "ОтборВОтчете"); 
		Период					  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СоставНастройки, "Период");
		ТаблицаПараметры 		  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СоставНастройки, "ТаблицаПараметры");
		Язык 					  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СоставНастройки, "Язык");
		ВалютаДокумента			  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СоставНастройки, "ВалютаДокумента");
		
		НовыеНастройкиИсточника = Справочники.бит_НастройкиОтчетов.НовыеНастройкиИсточника();
		Если ТипЗнч(ТаблицаПараметры) = Тип("ХранилищеЗначения") Тогда
			Значение = ТаблицаПараметры.Получить();
			Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Значение, НовыеНастройкиИсточника.ПараметрыИсточника);		
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(ОтборВОтчете) = Тип("ХранилищеЗначения") Тогда
			Значение = ОтборВОтчете.Получить();
			Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Значение, НовыеНастройкиИсточника.ОтборыИсточника);		
			КонецЕсли;
		КонецЕсли;
		НастройкиИсточника = Новый ХранилищеЗначения(НовыеНастройкиИсточника, Новый СжатиеДанных(9));
				
		АдресХранилищаСКД 	= ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
		ИсточникНастроек 	= Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресХранилищаСКД);
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
		
		Если ТипЗнч(НастройкиКомпоновщика) = Тип("НастройкиКомпоновкиДанных") Тогда
			ВсеГруппировки		   = бит_ОтчетыБФКлиентСервер.ПолучитьГруппировки(НастройкиКомпоновщика);
			Если ЗначениеЗаполнено(ВсеГруппировки) Тогда
				ОсновнойВариантОтчета.Структура.Очистить();
				Для каждого ЭлементСтруктры Из НастройкиКомпоновщика.Структура Цикл
					ЭлементСтруктурыПриемник = ОсновнойВариантОтчета.Структура.Добавить(ТипЗнч(ЭлементСтруктры));
					бит_ОтчетыБФКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктры);
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;		
		КомпоновщикНастроек.ЗагрузитьНастройки(ОсновнойВариантОтчета);	
		КомпоновщикНастроек.Восстановить();
		
		ОсновнойВариантОтчета = КомпоновщикНастроек.ПолучитьНастройки();
		// В сохраненных настройках нет новых фикс. параметров.
		Справочники.бит_НастройкиОтчетов.ДобавитьФиксированныеПереметры(ОсновнойВариантОтчета);

		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(ОсновнойВариантОтчета,"НастройкаОтчета", СоставНастройки.НастройкаОтчета);
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(ОсновнойВариантОтчета,"НастройкаПулаПодключений", НастройкаПулаПодключений);
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(ОсновнойВариантОтчета,"ВалютаДокумента", ВалютаДокумента);
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(ОсновнойВариантОтчета,"Язык", Язык);
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(ОсновнойВариантОтчета,"Период", Период);
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(ОсновнойВариантОтчета,"НастройкиИсточника", НастройкиИсточника);
		
		ОсновнойВариантОтчета.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Истина);
		ОсновнойВариантОтчета.ДополнительныеСвойства.Вставить("АдресСхемы", АдресХранилищаСКД);
		ОсновнойВариантОтчета.ДополнительныеСвойства.Вставить("ВариантНаименование", Строка(ВариантСсылка));
		ОсновнойВариантОтчета.ДополнительныеСвойства.Вставить("КлючВарианта", ВариантКлючВарианта);
		ОсновнойВариантОтчета.ДополнительныеСвойства.Вставить("КонтекстВарианта", "");
		
		ХранилищаНастроек.ХранилищеВариантовОтчетов.Сохранить(КлючОтчета, ВариантКлючВарианта, ОсновнойВариантОтчета);
				
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		бит_ОбновлениеИнформационнойБазыБФ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), 
			СохраненнаяНастройка.НастройкаСсылка);
	КонецПопытки;

КонецПроцедуры

Функция ДеревоПодсистем(ВариантОснование)
	
	// Пустое дерево без настроек.
	Прототип = НовоеДеревоПодсистем();
	ДеревоПодсистем = ВариантыОтчетовПовтИсп.ПодсистемыТекущегоПользователя().Дерево.Скопировать();
	Для Каждого КолонкаПрототипа Из Прототип.Колонки Цикл
		Если ДеревоПодсистем.Колонки.Найти(КолонкаПрототипа.Имя) = Неопределено Тогда
			ДеревоПодсистем.Колонки.Добавить(КолонкаПрототипа.Имя, КолонкаПрототипа.ТипЗначения);
		КонецЕсли;
	КонецЦикла;
	
	// Параметры.
	Контекст = Новый Структура("ДеревоПодсистем");
	Контекст.ДеревоПодсистем = ДеревоПодсистем;
	
	// Размещение, настроенное администратором.
	Подсистемы = Новый Массив;
	Для Каждого СтрокаРазмещения Из ВариантОснование.Размещение Цикл
		Подсистемы.Добавить(СтрокаРазмещения.Подсистема);
		ДеревоПодсистемЗарегистрироватьНастройкиПодсистемы(Контекст, СтрокаРазмещения, СтрокаРазмещения.Использование);
	КонецЦикла;
	
	// Размещение, предопределенное разработчиком.
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Размещение.Ссылка,
	|	Размещение.НомерСтроки,
	|	Размещение.Подсистема,
	|	Размещение.Важный,
	|	Размещение.СмТакже
	|ИЗ
	|	Справочник.ПредопределенныеВариантыОтчетов.Размещение КАК Размещение
	|ГДЕ
	|	Размещение.Ссылка = &Ссылка
	|	И НЕ Размещение.Подсистема В (&Подсистемы)";
	
	Если ТипЗнч(ВариантОснование.ПредопределенныйВариант) = Тип("СправочникСсылка.ПредопределенныеВариантыОтчетовРасширений") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПредопределенныеВариантыОтчетов", "ПредопределенныеВариантыОтчетовРасширений");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ВариантОснование.ПредопределенныйВариант);
	// Не зачитывать настройки подсистем, переопределенные администратором.
	Запрос.УстановитьПараметр("Подсистемы", Подсистемы);
	РазмещениеПредопределенного = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаРазмещения Из РазмещениеПредопределенного Цикл
		ДеревоПодсистемЗарегистрироватьНастройкиПодсистемы(Контекст, СтрокаРазмещения, Истина);
	КонецЦикла;
	
	ПолучениеДанных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Подсистемы.бит_КомИнт_ПолучениеДанных);
	РезультатПоиска = Контекст.ДеревоПодсистем.Строки.Найти(ПолучениеДанных, "ссылка", Истина);
	Если РезультатПоиска <> Неопределено Тогда
		РезультатПоиска.Использование = 1;
	КонецЕсли;
	
	Возврат Контекст.ДеревоПодсистем;
	
КонецФункции

Функция НовоеДеревоПодсистем()
	
	ОписаниеТиповСсылки = Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовРасширений, СправочникСсылка.ИдентификаторыОбъектовМетаданных");
	
	ДеревоПодсистем = Новый ДеревоЗначений;
	ДеревоПодсистем.Колонки.Добавить("Ссылка",ОписаниеТиповСсылки);
	ДеревоПодсистем.Колонки.Добавить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ДеревоПодсистем.Колонки.Добавить("Имя", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДеревоПодсистем.Колонки.Добавить("ПолноеИмя", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ДеревоПодсистем.Колонки.Добавить("Приоритет", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДеревоПодсистем.Колонки.Добавить("Использование", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	ДеревоПодсистем.Колонки.Добавить("Важность", ОбщегоНазначения.ОписаниеТипаСтрока(15));
	ДеревоПодсистем.Колонки.Добавить("Модифицированность", Новый ОписаниеТипов("Булево"));
	ДеревоПодсистем.Колонки.Добавить("Пользователи", Новый ОписаниеТипов("СписокЗначений"));
	ДеревоПодсистем.Колонки.Добавить("ПользователиПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Возврат ДеревоПодсистем; 

КонецФункции

Процедура ДеревоПодсистемЗарегистрироватьНастройкиПодсистемы(Контекст, СтрокаРазмещения, Использование)
	Поиск = Новый Структура("Ссылка", СтрокаРазмещения.Подсистема);
	Найденные = Контекст.ДеревоПодсистем.Строки.НайтиСтроки(Поиск, Истина);
	Если Найденные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = Найденные[0];
	
	СтрокаДерева.Важность = "";
	СтрокаДерева.Использование = Использование;
КонецПроцедуры

Процедура ПодготовитьСхемуКомпоновкиДанных(НастройкаУниверсальногоОтчета)
	
	ТекущийОбъект 		  = НастройкаУниверсальногоОтчета.ПолучитьОбъект();
	СхемаКомпоновкиДанных = ТекущийОбъект.СхемаКомпоновкиДанных.Получить();
	ОсновнойВариантОтчета = ТекущийОбъект.ВариантОтчета.Получить();
	
	ДобавитьФиксированныеПереметры(СхемаКомпоновкиДанных);
	
	Если ТипЗнч(ОсновнойВариантОтчета) = Тип("Строка") Тогда
		ОсновнойВариантОтчета = ОбщегоНазначения.ЗначениеИзСтрокиXML(ОсновнойВариантОтчета);
	Иначе
		ОсновнойВариантОтчета = СхемаКомпоновкиДанных.ВариантыНастроек.Получить(0).Настройки;
	КонецЕсли;
	ДобавитьФиксированныеПереметры(ОсновнойВариантОтчета);
	
	ОсновнойВариантОтчета.Выбор.ИдентификаторПользовательскойНастройки = "";
	
	ТекущийОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных, Новый СжатиеДанных(9));
	ТекущийОбъект.ВариантОтчета			= Новый ХранилищеЗначения(ОбщегоНазначения.ЗначениеВСтрокуXML(ОсновнойВариантОтчета), 
													Новый СжатиеДанных(9));
													
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекущийОбъект);

КонецПроцедуры

#КонецОбласти // ОбновлениеИБ

Функция НовыеФиксированныеПараметры()
	
	ФиксированныеПараметры = Новый Структура;
	ФиксированныеПараметры.Вставить("НастройкаОтчета", 			Справочники.бит_НастройкиОтчетов.ПустаяСсылка());
	ФиксированныеПараметры.Вставить("Период", 					Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотГод));
	ФиксированныеПараметры.Вставить("НастройкаПулаПодключений", Справочники.бит_мпд_НастройкиПуловПодключений.ПустаяСсылка());
	ФиксированныеПараметры.Вставить("Язык", 					Справочники.бит_Языки.ПустаяСсылка());
	ФиксированныеПараметры.Вставить("ВалютаДокумента", 			Справочники.Валюты.ПустаяСсылка());
	ФиксированныеПараметры.Вставить("НастройкиИсточника", 		Новый ХранилищеЗначения(НовыеНастройкиИсточника()));
	
	Возврат ФиксированныеПараметры;
	
КонецФункции

// Процедура добавляет поле  в набор данных компоновки данных.
//
// Параметры:
//  НаборДанных   - НаборДанныхКомпоновкиДанных.
//  ИмяПоля       - Строка.
//  Заголовок  	  - Строка.
//  ОписаниеТипов.
//  Измерение 	  - Булево.
// 
Процедура ДобавитьПолеНабораДанныхКомпоновки(НаборДанных, ИмяПоля, Заголовок = "", ОписаниеТипов = Неопределено, Измерение = Истина)

	Если ТипЗнч(ОписаниеТипов)<> Тип("ОписаниеТипов") Тогда
		ОписаниеТиповПоля = Новый ОписаниеТипов;
	Иначе
		ОписаниеТиповПоля = ОписаниеТипов;
	КонецЕсли;
	
	ПолеКомпоновки = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	
	ПолеКомпоновки.Поле        = ИмяПоля;	
	ПолеКомпоновки.Заголовок   = ?(НЕ ПустаяСтрока(Заголовок), Заголовок, ИмяПоля);
	ПолеКомпоновки.ПутьКДанным = ИмяПоля;
	
	ПолеКомпоновки.Роль.Измерение = Измерение;
	
	Если ЗначениеЗаполнено(ОписаниеТиповПоля.Типы()) Тогда
		ПолеКомпоновки.ТипЗначения = ОписаниеТипов;	
	КонецЕсли; 

КонецПроцедуры // ДобавитьПолеНабораДанных()

Процедура УстановитьРежимыОтображенияФиксированныхПараметров(Настройки, РежимыОтображения)
	
	Параметры = Настройки.ПараметрыДанных.Элементы;
	
	Для Каждого РежимОтображения Из РежимыОтображения Цикл 
		
		НайденныйПараметр = Параметры.Найти(РежимОтображения.Ключ);
		
		Если НайденныйПараметр <> Неопределено Тогда 
			НайденныйПараметр.РежимОтображения = РежимыОтображения[РежимОтображения.Ключ];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли