 &Перед("ПриСозданииНаСервере") 
&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	Если Элементы.Найти("бит_НомерЗаказа") = Неопределено Тогда
		бит_СоздатьЭлементыБит(); 
	КонецЕсли;
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -  
	
КонецПроцедуры 

&НаСервере
Процедура бит_СоздатьЭлементыБит()

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	
	КвалификаторЧисла10_0 = Новый КвалификаторыЧисла(10,0);
	ОписаниеЧисло10_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла10_0);
	КвалификаторыСтроки40 = Новый КвалификаторыСтроки(40);
	ОписаниеСтроки40 = Новый ОписаниеТипов("Строка", , , , КвалификаторыСтроки40);
	КвалификаторЧисла9_3 = Новый КвалификаторыЧисла(9,3);
	ОписаниеЧисло9_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла9_3);
	КвалификаторыСтроки1024 = Новый КвалификаторыСтроки(1024);
	ОписаниеСтроки = Новый ОписаниеТипов("Строка", , , КвалификаторыСтроки1024);
	ОписаниеНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		
	ДобавляемыеРеквизитыОстаткиСерий =  Новый Массив; 
	
	//бит_НомерЗаказаОстатки = Новый РеквизитФормы("бит_НомерЗаказаОстатки", ОписаниеЧисло10_0, "ОстаткиСерий", "(бит) № заказа");
	//бит_НамоткиОстатки = Новый РеквизитФормы("бит_НамоткиОстатки", ОписаниеСтроки40, "ОстаткиСерий", "(бит) Намотки");
	//бит_БруттоОстатки = Новый РеквизитФормы("бит_БруттоОстатки", ОписаниеЧисло9_3, "ОстаткиСерий", "(бит) Брутто, кг");
	//бит_ПримечаниеОстатки = Новый РеквизитФормы("бит_ПримечаниеОстатки", ОписаниеСтроки, "ОстаткиСерий", "(бит) Примечание");
	//бит_ТараОстатки = Новый РеквизитФормы("бит_ТараОстатки", ОписаниеНоменклатура, "ОстаткиСерий", "(бит) Тара");
	//бит_ПрежнийНомерТарыОстатки = Новый РеквизитФормы("бит_ПрежнийНомерТарыОстатки", ОписаниеСтроки, "ОстаткиСерий", "(бит) Прежний № тары");
	
	бит_НомерЗаказаОстатки = Новый РеквизитФормы("бит_НомерЗаказа", ОписаниеЧисло10_0, "ОстаткиСерий", "(бит) № заказа");
	бит_НамоткиОстатки = Новый РеквизитФормы("бит_Намотки", ОписаниеСтроки40, "ОстаткиСерий", "(бит) Намотки");
	бит_БруттоОстатки = Новый РеквизитФормы("бит_Брутто", ОписаниеЧисло9_3, "ОстаткиСерий", "(бит) Брутто, кг");
	бит_ПримечаниеОстатки = Новый РеквизитФормы("бит_Примечание", ОписаниеСтроки, "ОстаткиСерий", "(бит) Примечание");
	//бит_ТараОстатки = Новый РеквизитФормы("бит_Тара", ОписаниеНоменклатура, "ОстаткиСерий", "(бит) Тара");
	бит_ПрежнийНомерТарыОстатки = Новый РеквизитФормы("бит_ПрежнийНомерТары", ОписаниеСтроки, "ОстаткиСерий", "(бит) Прежний № тары");
	
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_НомерЗаказаОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_НамоткиОстатки); 
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_БруттоОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ПримечаниеОстатки);
	//ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ТараОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ПрежнийНомерТарыОстатки);
		
	бит_НомерЗаказа = Новый РеквизитФормы("бит_НомерЗаказа", ОписаниеЧисло10_0, , "(бит) № заказа");
	бит_Намотки = Новый РеквизитФормы("бит_Намотки", ОписаниеСтроки40, , "(бит) Намотки");
	бит_Брутто = Новый РеквизитФормы("бит_Брутто", ОписаниеЧисло9_3, , "(бит) Брутто, кг");
	бит_Примечание = Новый РеквизитФормы("бит_Примечание", ОписаниеСтроки, , "(бит) Примечание");
	//бит_Тара = Новый РеквизитФормы("бит_Тара", ОписаниеНоменклатура, , "(бит) Тара");
	бит_ПрежнийНомерТары = Новый РеквизитФормы("бит_ПрежнийНомерТары", ОписаниеСтроки, , "(бит) Прежний № тары");
    	
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_НомерЗаказа);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_Намотки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_Брутто);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_Примечание);
	//ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_Тара);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ПрежнийНомерТары);
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизитыОстаткиСерий);
	
	//(бит) № заказа
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_НомерЗаказа", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_НомерЗаказа";
	
	//(бит) Намотки
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Намотки", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_Намотки";
	
	//(бит) Брутто, кг
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Брутто", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_Брутто";
	
	//(бит) Примечание
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Примечание", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_Примечание";
	
	//(бит) Тара
	//НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Тара", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_Тара";
	
	//(бит) Прежний № тары
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ПрежнийНомерТары", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ПрежнийНомерТары";
		
	НоваяГруппа  = Элементы.Вставить("бит_ГруппаДополнительныеРеквизиты",Тип("ГруппаФормы"), Элементы.СтраницаВводСерии, Элементы.ГруппаДополнительныеРеквизиты);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Истина; 
	НоваяГруппа.Заголовок = "(бит) Дополнительно";  
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;  
		
	//(бит) № заказа
	НовыйЭлемент = Элементы.Вставить("бит_НомерЗаказа", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_НомерЗаказа";
	
	//(бит) Намотки
	НовыйЭлемент = Элементы.Вставить("бит_Намотки", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Намотки";
	
	//(бит) Брутто, кг
	НовыйЭлемент = Элементы.Вставить("бит_Брутто", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Брутто";
	
	//(бит) Примечание
	НовыйЭлемент = Элементы.Вставить("бит_Примечание", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Примечание";
	
	//(бит) Тара
	//НовыйЭлемент = Элементы.Вставить("бит_Тара", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "бит_Тара";
	
	//(бит) Прежний № тары
	НовыйЭлемент = Элементы.Вставить("бит_ПрежнийНомерТары", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_ПрежнийНомерТары"; 
		
    // Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 - 
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37доп]  [VUVaynula@1cbit.ru] [03.06.2025 17:22:41] +        
	ДобавляемыеРеквизитыОстаткиСерий =  Новый Массив; 
	
	ОписаниеЧисло2_0 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеЧисло7_0 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Неотрицательный));
	
	бит_ВидЗаказаОстатки 		= Новый РеквизитФормы("бит_ВидЗаказа", ОписаниеЧисло2_0, "ОстаткиСерий", "(бит) Вид заказа");
	бит_ПартияОстатки 			= Новый РеквизитФормы("бит_Партия", ОписаниеСтроки, "ОстаткиСерий", "(бит) Партия");
	бит_ТипОбшивкиБарабанаОстатки = Новый РеквизитФормы("бит_ТипОбшивкиБарабана", ОписаниеНоменклатура, "ОстаткиСерий", "(бит) Тип обшивки барабана");
	бит_ТипБарабанаОстатки 		= Новый РеквизитФормы("бит_ТипБарабана", ОписаниеНоменклатура, "ОстаткиСерий", "(бит) Тип барабана");
	бит_ВесПродукцииОстатки 	= Новый РеквизитФормы("бит_ВесПродукции", ОписаниеЧисло7_0, "ОстаткиСерий", "(бит) Вес продукции");
	бит_ВесОбшивкиОстатки 		= Новый РеквизитФормы("бит_ВесОбшивки", ОписаниеЧисло7_0, "ОстаткиСерий", "(бит) Вес обшивки");
	бит_ВесБарабанаОстатки 	= Новый РеквизитФормы("бит_ВесБарабана", ОписаниеЧисло7_0, "ОстаткиСерий", "(бит) Вес барабана");
	//бит_ПереченьДлинНаБарабанеСтрокойОстатки = Новый РеквизитФормы("бит_ПереченьДлинНаБарабанеСтрокой", ОписаниеСтроки, "ОстаткиСерий", "(бит) Перечень длин на барабане");
    бит_ЦветОстатки = Новый РеквизитФормы("бит_Цвет", Новый ОписаниеТипов("СправочникСсылка.бит_Цвета"), "ОстаткиСерий", "(бит) Цвет"); 
	
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВидЗаказаОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ПартияОстатки); 
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ТипОбшивкиБарабанаОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ТипБарабанаОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВесПродукцииОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВесОбшивкиОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВесБарабанаОстатки);
	//ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ПереченьДлинНаБарабанеСтрокойОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ЦветОстатки);
	
	
	бит_ВидЗаказа 		= Новый РеквизитФормы("бит_ВидЗаказа", ОписаниеЧисло2_0, , "(бит) Вид заказа");
	бит_Партия 			= Новый РеквизитФормы("бит_Партия", ОписаниеСтроки, , "(бит) Партия");
	бит_ТипОбшивкиБарабана = Новый РеквизитФормы("бит_ТипОбшивкиБарабана", ОписаниеНоменклатура, , "(бит) Тип обшивки барабана");
	бит_ТипБарабана 		= Новый РеквизитФормы("бит_ТипБарабана", ОписаниеНоменклатура, , "(бит) Тип барабана");
	бит_ВесПродукции 	= Новый РеквизитФормы("бит_ВесПродукции", ОписаниеЧисло7_0, , "(бит) Вес продукции");
	бит_ВесОбшивки 		= Новый РеквизитФормы("бит_ВесОбшивки", ОписаниеЧисло7_0, , "(бит) Вес обшивки");
	бит_ВесБарабана 	= Новый РеквизитФормы("бит_ВесБарабана", ОписаниеЧисло7_0, , "(бит) Вес барабана");
	//бит_ПереченьДлинНаБарабанеСтрокой = Новый РеквизитФормы("бит_ПереченьДлинНаБарабанеСтрокой", ОписаниеСтроки, , "(бит) Перечень длин на барабане");
    бит_Цвет = Новый РеквизитФормы("бит_Цвет", Новый ОписаниеТипов("СправочникСсылка.бит_Цвета"), , "(бит) Цвет");

	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВидЗаказа);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_Партия); 
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ТипОбшивкиБарабана);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ТипБарабана);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВесПродукции);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВесОбшивки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ВесБарабана);
	//ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ПереченьДлинНаБарабанеСтрокой);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_Цвет);

	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизитыОстаткиСерий);
	
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ВидЗаказа", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ВидЗаказа";
	
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Партия", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_Партия";

	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ТипОбшивкиБарабана", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ТипОбшивкиБарабана";

	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ТипБарабана", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ТипБарабана";

	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ВесПродукции", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ВесПродукции";

	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ВесОбшивки", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ВесОбшивки";

	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ВесБарабана", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ВесБарабана";
	
	//НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ПереченьДлинНаБарабанеСтрокой", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ПереченьДлинНаБарабанеСтрокой"; 
	
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Цвет", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_Цвет";
	
	// Серии
	
	НовыйЭлемент = Элементы.Вставить("бит_ВидЗаказа", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_ВидЗаказа";
	
	НовыйЭлемент = Элементы.Вставить("бит_Партия", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Партия";      
	
	НовыйЭлемент = Элементы.Вставить("бит_ТипОбшивкиБарабана", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_ТипОбшивкиБарабана"; 
	
	НовыйЭлемент = Элементы.Вставить("бит_ТипБарабана", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_ТипБарабана"; 
	
	НовыйЭлемент = Элементы.Вставить("бит_ВесПродукции", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_ВесПродукции";  
	
	НовыйЭлемент = Элементы.Вставить("бит_ВесОбшивки", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_ВесОбшивки";  
	
	НовыйЭлемент = Элементы.Вставить("бит_ВесБарабана", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_ВесБарабана"; 
	
	//НовыйЭлемент = Элементы.Вставить("бит_ПереченьДлинНаБарабанеСтрокой", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "бит_ПереченьДлинНаБарабанеСтрокой"; 
	
	НовыйЭлемент = Элементы.Вставить("бит_Цвет", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Цвет";
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37доп]  [VUVaynula@1cbit.ru] [03.06.2025 17:22:41] -
КонецПроцедуры