
#Область ОписаниеПеременных

&НаКлиенте
Перем ИдетПолучениеДанныхОбъекта Экспорт;

&НаКлиенте
Перем ИдетИзменениеОбъекта Экспорт;

&НаКлиенте
Перем ИдетПолучениеТабличнойЧасти;

&НаКлиенте
Перем ТабличныеЧастиИдентификаторПоследней Экспорт;

&НаКлиенте
Перем ДвиженияИдентификаторПоследней Экспорт;

&НаКлиенте
Перем ИдетПолучениеДвижений;

&НаКлиенте
Перем ЗакрытиеРазрешено;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображатьПустыеТабличныеЧасти = Ложь;
	ОтображатьРегистрыБезДвижений = Ложь;
	
	Если Параметры.Свойство("Объект") Тогда
		ОбрабатываемыйОбъект = Параметры.Объект;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	ДобавитьСвойствоВРеквизиты();
	ОбновитьСписокИсторииВыбранных();
	
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.Реквизиты);
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.РедактируемаяТабличнаяЧасть);
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.РедактируемыеДвижения);
	
	ИТК_ПараметрыЗаписи.СоздатьЭлементыИРеквизиты(ЭтотОбъект, Элементы.ГруппаПараметрыЗаписиОбъекта);
	
	Состояние = НСтр("ru = 'Получение данных объекта...';
					|en = 'Getting object data...'");
	ИТК_ФормаКлиентСервер.ОтображениеСостоянияТабличногоДокумента(Элементы.ИдетПолучениеДанныхОбъектаТабличныйДокумент, Состояние);

	Состояние = НСтр("ru = 'Получение данных табличной части...';
					|en = 'Retrieving tabular section data...'");
	ИТК_ФормаКлиентСервер.ОтображениеСостоянияТабличногоДокумента(Элементы.ИдетПолучениеТабличнойЧастиТабличныйДокумент, Состояние);
			
	Состояние = НСтр("ru = 'Получение данных движений...';
					|en = 'Getting motion data...'");
	ИТК_ФормаКлиентСервер.ОтображениеСостоянияТабличногоДокумента(Элементы.ИдетПолучениеДвиженийТабличныйДокумент, Состояние);
	
	// Подключение команд
	ИТК_ПодключаемыеКоманды.ИнструментыКПолю(ЭтотОбъект, "ОбрабатываемыйОбъект", , Истина);
	
	ИТК_ПодключаемыеКоманды.ИнструментыКТаблицеЗначений(ЭтотОбъект, "Реквизиты");
	
	ИТК_ПодключаемыеКоманды.ДополнительныеКТаблицеЗначений(ЭтотОбъект, "РедактируемаяТабличнаяЧасть");
	ИТК_ПодключаемыеКоманды.ИнструментыКТаблицеЗначений(ЭтотОбъект, "РедактируемаяТабличнаяЧасть");
	
	ИТК_ПодключаемыеКоманды.ДополнительныеКТаблицеЗначений(ЭтотОбъект, "РедактируемыеДвижения");
	ИТК_ПодключаемыеКоманды.ИнструментыКТаблицеЗначений(ЭтотОбъект, "РедактируемыеДвижения");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИТК_ОбщийКлиент.ОбработчикПриОткрытии(Отказ);
	
	ИдетПолучениеДанныхОбъекта = Ложь;
	ИдетПолучениеТабличнойЧасти = Ложь;
	ИдетПолучениеДвижений = Ложь;
	ИдетИзменениеОбъекта = Ложь;
	
	ОбрабатываемыйОбъектИзменен(ОбрабатываемыйОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбновитьДанныеОбъекта(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = ИТК_ПодключаемыеКомандыКлиентСервер.ИмяОповещенияЗаполненаКолонкаТаблицыЗначений() Тогда
		
		Если Параметр = Элементы.РедактируемаяТабличнаяЧасть Тогда
			
			РедактируемаяТабличнаяЧастьПриИзменении(Параметр);
			
		ИначеЕсли Параметр = Элементы.РедактируемыеДвижения Тогда
			
			РедактируемыеДвиженияПриИзменении(Параметр);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИТК_РаботаСОбъектомКлиент.ТребуетсяОбновлениеИсторииВыбранныхПослеОбработкиОповещения(ЭтотОбъект, ИТК_Перечисления.ИнструментРедакторОбъекта(), ИмяСобытия, Параметр, Источник) Тогда
		ОбновитьСписокИсторииВыбранных();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Истина Тогда
		
		Если Модифицированность Тогда
			
			ТекстПредупреждения = НСтр("ru = 'Имеются несохраненные данные, они будут потеряны.
                                        |Для сохранения изменений нажмите ""Продолжить работу"", сохраните данные, а потом завершите работу.';
                                        |en = 'There is unsaved data, it will be lost.
                                        |To save changes, click Continue, save the data, and then exit.'");
			
			Отказ = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗакрытиеРазрешено = Неопределено Тогда
			
			Отказ = Истина;
			ЗапуститьОбработчикСПроверкойНаСохранностьДанных(Новый ОписаниеОповещения("ОбработчикЗакрытиеРазрешеноЗакрыть", ЭтотОбъект));

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбрабатываемыйОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачалоВыбораОбъекта(СтандартнаяОбработка);
														
КонецПроцедуры

&НаКлиенте
Процедура ОбрабатываемыйОбъектОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИТК_РаботаСОбъектомКлиент.ЗавершенаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
	ИТК_ФормаКлиент.ОбработкаВыбораЗначенияВФорме(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	ОбрабатываемыйОбъектИзменен(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура ОбрабатываемыйОбъектОчистка(Элемент, СтандартнаяОбработка)
	
	НовоеЗначение = ИТК_ФормаКлиент.ОчисткаВыбранногоОбъекта(ЭтотОбъект, "ОбрабатываемыйОбъект", СтандартнаяОбработка);
	ОбрабатываемыйОбъектИзменен(НовоеЗначение, Ложь);
	
	ОбновитьДанныеОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбрабатываемыйОбъектАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.АвтоПодборЗначенияВФорме(Текст, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипВыбранногоОбъектаНажатие(Элемент, СтандартнаяОбработка)
	
	НачалоВыбораОбъекта(СтандартнаяОбработка, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизиты

&НаКлиенте
Процедура РеквизитыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Элементы.РеквизитыЗначение.ТолькоПросмотр = НЕ ТекущиеДанные.Доступность;
	ИТК_ФормаКлиент.АктивизацияЗначенияВФорме(Элементы.РеквизитыЗначение, ТекущиеДанные.Значение, ТекущиеДанные.Тип);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПриАктивизацииЯчейки(Элемент)
	
	ИТК_ПодключаемыеКомандыКлиент.ОбновитьЭлементы(ЭтотОбъект, Элемент, "Значение");
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ИТК_ПодключаемыеКомандыКлиент.ОбновитьЭлементы(ЭтотОбъект, Элементы.Реквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные.Заблокирован Тогда
		
		Отказ = Истина;
		ВопросРазблокироватьРеквизит(ТекущиеДанные);
		
	КонецЕсли;
	
	Элемент.ТекущийЭлемент.ОграничениеТипа = ТекущиеДанные.Тип;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Реквизиты.ТекущиеДанные;
	ТекущиеДанные.Изменять = Истина;

КонецПроцедуры

&НаКлиенте
Процедура РеквизитыЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Реквизиты.ТекущиеДанные;
	
	Имя = ТекущиеДанные.Имя;
	ЗаголовокФормы = СтрШаблон(НСтр("ru = 'Реквизит ""%1""';
									|en = 'Atribute ""%1""'"), Имя);

	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВводЗначенияРеквизитаЗавершен", ЭтотОбъект, Новый Структура);
	Если ТекущиеДанные.Тип.СодержитТип(Тип("ОписаниеТипов")) Тогда
		
		ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(Элемент, ЗаголовокФормы, ИТК_Перечисления.РежимРедактированияТипаЗначенияРедактированиеОписанияТипов(),
																	ТекущиеДанные.Значение, ОписаниеОповещенияЗавершение, СтандартнаяОбработка);
	Иначе
		
		ДополнительныеПараметры = Новый Структура;
		Если ЗначениеЗаполнено(ТекущиеДанные.Свойство) Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("Владелец", ТекущиеДанные.Свойство);
			ДополнительныеПараметры.Вставить("Отбор", Отбор);
			
		КонецЕсли;	
		
		ИТК_ФормаКлиент.ВводЗначенияСтрокиВФорме(ЗаголовокФормы, Элемент, ТекущиеДанные.Значение, ТекущиеДанные.Тип, СтандартнаяОбработка, ОписаниеОповещенияЗавершение, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОчисткаЗначенияСтрокиВФорме(Элемент, СтандартнаяОбработка);
	
	СтрокаРеквизит = Элементы.Реквизиты.ТекущиеДанные;
	СтрокаРеквизит.Изменять = Истина;
	СтрокаРеквизит.Значение = СтрокаРеквизит.Тип.ПривестиЗначение(Неопределено);
	
	ОбновитьДанныеСтроки(СтрокаРеквизит);
	
	ИТК_ФормаКлиент.АктивизацияЗначенияВФорме(Элемент, Неопределено, СтрокаРеквизит.Тип);
	
	РеквизитыПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОбработкаВыбораЗначенияВФорме(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	ОбновитьДанныеСтроки(Элементы.Реквизиты.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.АвтоПодборЗначенияВФорме(Текст, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабличныеЧасти

&НаКлиенте
Процедура ТабличныеЧастиПриАктивизацииСтроки(Элемент)
	
	ИдентификаторТекущейСтроки = Элемент.ТекущаяСтрока;
	
	Если ТабличныеЧастиИдентификаторПоследней <> ИдентификаторТекущейСтроки Тогда 
		
		ТабличныеЧастиИдентификаторПоследней = ИдентификаторТекущейСтроки;
		
		СохранитьИзмененнуюТаблицуЗначений("ТабличныеЧасти", "РедактируемаяТабличнаяЧасть");
		
		РедактируемаяТабличнаяЧастьИмя = Неопределено;
		РедактируемаяТабличнаяЧастьМодифицированность = Ложь;
		
		ПодключитьОбработчикОжидания("ПодключаемыйОбновитьРедактируемуюТабличнуюЧасть", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРедактируемаяТабличнаяЧасть

&НаКлиенте
Процедура РедактируемаяТабличнаяЧастьПриАктивизацииЯчейки(Элемент)
	
	ИТК_ПодключаемыеКомандыКлиент.ОбновитьЭлементы(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемаяТабличнаяЧастьПриИзменении(Элемент)
	
	ИзмененаРедактируемаяТаблицаЗначений(Элементы.ТабличныеЧасти, "РедактируемаяТабличнаяЧасть");
	ИТК_ПодключаемыеКомандыКлиент.ОбновитьЭлементы(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемаяТабличнаяЧастьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОбработкаТаблицаЗначенийВыбор(ЭтотОбъект, Элемент, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемаяТабличнаяЧастьПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ИзмененаРедактируемаяТаблицаЗначений(Элементы.ТабличныеЧасти, "РедактируемаяТабличнаяЧасть");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаЗначенийРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОбработкаТаблицаЗначенийРеквизитНачалоВыбора(ЭтотОбъект, Элемент, СтандартнаяОбработка);
										
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаЗначенийРеквизитОчистка(Элемент, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОбработкаТаблицаЗначенийРеквизитОчистка(Элемент, СтандартнаяОбработка);
										
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДвижения

&НаКлиенте
Процедура ДвиженияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ИдентификаторТекущейСтроки = Элемент.ТекущаяСтрока;
	
	Если ДвиженияИдентификаторПоследней <> ИдентификаторТекущейСтроки Тогда 
		
		ДвиженияИдентификаторПоследней = ИдентификаторТекущейСтроки;
		
		СохранитьИзмененнуюТаблицуЗначений("Движения", "РедактируемыеДвижения");
		
		РедактируемыеДвиженияИмя = Неопределено;
		РедактируемыеДвиженияМодифицированность = Ложь;

		ПодключитьОбработчикОжидания("ПодключаемыйОбновитьРедактируемыеДвижения", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРедактируемыеДвижения

&НаКлиенте
Процедура РедактируемыеДвиженияПриАктивизацииЯчейки(Элемент)
	
	ИТК_ПодключаемыеКомандыКлиент.ОбновитьЭлементы(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыеДвиженияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОбработкаТаблицаЗначенийВыбор(ЭтотОбъект, Элемент, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыеДвиженияПриИзменении(Элемент)
	
	ИзмененаРедактируемаяТаблицаЗначений(Элементы.Движения, "РедактируемыеДвижения");
	ИТК_ПодключаемыеКомандыКлиент.ОбновитьЭлементы(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыеДвиженияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока 
			И НЕ Копирование  Тогда
		
		Элемент.ТекущиеДанные.Активность = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыеДвиженияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ИзмененаРедактируемаяТаблицаЗначений(Элементы.Движения, "РедактируемыеДвижения");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтображатьПустыеТабличныеЧасти(Команда)
	
	ОтображатьПустыеТабличныеЧасти = Не ОтображатьПустыеТабличныеЧасти;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьРегистрыБезДвижений(Команда)
	
	ОтображатьРегистрыБезДвижений = Не ОтображатьРегистрыБезДвижений;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Действие(Команда)
	
	ИмяДействия = Команда.Имя;
	
	Если ИмяДействия = "Записать" Тогда
		
		Если ОтсутствуетИзменениеОбъекта() Тогда
			
			ТекстПредупреждения = НСтр("ru = 'Нет изменений для записи объекта';
										|en = 'No changes to record an object'");
			ПоказатьПредупреждение( , ТекстПредупреждения, , ИТК_РедакторОбъектаКлиентСервер.Представление());
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СохранитьИзмененнуюТаблицуЗначений("ТабличныеЧасти", "РедактируемаяТабличнаяЧасть");
	СохранитьИзмененнуюТаблицуЗначений("Движения", "РедактируемыеДвижения");
	
	ОписаниеВопроса = ИТК_РедакторОбъектаКлиент.ОписаниеВопросаВыполненияДействия(ИмяДействия, ОбрабатываемыйОбъект);
	
	ДополнительныеПараметры = Новый Структура("ИмяДействия", ИмяДействия);
	ОписаниеОЗавершении = Новый ОписаниеОповещения("ЗавершенВопросДействия", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВопрос(ОписаниеОЗавершении, ОписаниеВопроса.Текст, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, ОписаниеВопроса.Заголовок, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьДанныеОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзДругогоОбъекта(Команда)
	
	ИТК_ФормаКлиент.ОткрытьФормуВыбора(ОбрабатываемыйОбъект, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзXML(Команда)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Форматы = Новый СписокЗначений;
	Форматы.Добавить("*.xml", НСтр("ru = 'XML файлы';
									|en = 'XML files'"));
	ДиалогОткрытияФайла.Фильтр = ИТК_ОбщийКлиентСервер.ФильтрФайлов(Форматы);
	
	ДиалогОткрытияФайла.Расширение = "xml";
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Загрузка данных объекта';
										|en = 'Loading object data'");
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ЗагрузкаДанныхОбъектаИзXMLЗакончено", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВXML(Команда)
	
	ПолучитьФайл(ИТК_XML.ФайлПоСсылкеВоВременномХранилище(ОбрабатываемыйОбъект, УникальныйИдентификатор), "object.xml");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура ПодключаемаяКоманда(Команда)
	
	ИТК_ПодключаемыеКомандыКлиент.ОбработатьКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемаяКомандаРаботаСТаблицейЗначений(Команда)
	
	ИТК_ПодключаемыеКомандыКлиент.ОбработатьКомандуРаботыСТаблицейЗначений(ЭтотОбъект, Команда.Имя, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйОбработчикКоманд(Команда)
	
	ИТК_ПараметрыЗаписиКлиент.ОбработатьКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	ВыбранОбъект = ИТК_ФормаКлиентСервер.ВыбранОбъект(ОбрабатываемыйОбъект);
	ОбъектЗаполнен = ВыбранОбъект И НЕ БитаяСсылка;
	ТипОбъектаВыбран = (ОбрабатываемыйОбъект <> Неопределено
							И ТипЗнч(ОбрабатываемыйОбъект) <> Тип("Строка"));
	ДоступноСозданиеНового = БитаяСсылка ИЛИ ТипОбъектаВыбран;
	
	Если ВыбранОбъект Тогда
		
		Заголовок = СокрЛП(ОбрабатываемыйОбъект);
		
	Иначе
		
		Заголовок = Неопределено;
		
	КонецЕсли;
	
	ИТК_ПодключаемыеКомандыКлиент.ОбновитьЭлементы(ЭтотОбъект, Элементы.ОбрабатываемыйОбъект);
	
	Элементы.ФормаГруппаОбъект.Видимость = НЕ ИдетПолучениеДанныхОбъекта;
	Элементы.ГруппаДанныеОбъекта.Видимость = НЕ ИдетПолучениеДанныхОбъекта;
	Элементы.ИдетПолучениеДанныхОбъектаТабличныйДокумент.Видимость = ИдетПолучениеДанныхОбъекта;
	
	// Реквизиты
	Элементы.РеквизитыИспользование.Видимость = БитаяСсылка;
	
	// Табличные части
	Элементы.ТабличныеЧастиОтображатьПустыеТабличныеЧасти.Пометка = ОтображатьПустыеТабличныеЧасти;
	Если ОтображатьПустыеТабличныеЧасти Тогда
		ОтборСтрок = Неопределено;
	Иначе
		ОтборСтрок = Новый ФиксированнаяСтруктура("Пустая", Ложь);
	КонецЕсли;
	Элементы.ТабличныеЧасти.ОтборСтрок = ОтборСтрок;
	Элементы.СтраницаТабличныеЧасти.Видимость = ЗначениеЗаполнено(ТабличныеЧасти);
	Элементы.ТабличныеЧастиИспользование.Видимость = БитаяСсылка;
	Элементы.ИдетПолучениеТабличнойЧастиТабличныйДокумент.Видимость = ИдетПолучениеТабличнойЧасти;
	Элементы.РедактируемаяТабличнаяЧасть.Видимость = Не ИдетПолучениеТабличнойЧасти;
	
	// Движения
	Элементы.ДвиженияОтображатьРегистрыБезДвижений.Пометка = ОтображатьРегистрыБезДвижений;
	Если ОтображатьРегистрыБезДвижений Тогда
		ОтборСтрок = Неопределено;
	Иначе
		ОтборСтрок = Новый ФиксированнаяСтруктура("Пустая", Ложь);
	КонецЕсли;
	Элементы.Движения.ОтборСтрок = ОтборСтрок;
	Элементы.СтраницаДвижения.Видимость = ЭтоДокумент И ЗначениеЗаполнено(Движения);
	Элементы.ИдетПолучениеДвиженийТабличныйДокумент.Видимость = ИдетПолучениеДвижений;
	Элементы.РедактируемыеДвижения.Видимость = Не ИдетПолучениеДвижений;
	
	// Действия с объектом
	Элементы.ФормаЗаписать.Видимость = ОбъектЗаполнен;
	Элементы.ФормаЗаписатьЕще.Видимость = ОбъектЗаполнен;
	Элементы.ФормаЗаписатьЕще.КнопкаПоУмолчанию = ОбъектЗаполнен;
	
	Элементы.ФормаВыполнитьЗадачу.Видимость = ЭтоЗадача;
	
	Элементы.ФормаПровести.Видимость = ДоступноПроведение И ОбъектЗаполнен;
	Элементы.ФормаПровестиЕще.Видимость = ДоступноПроведение И ОбъектЗаполнен;
	
	Элементы.ФормаОтменаПроведения.Видимость = ДоступноПроведение И ОбъектЗаполнен;
	Элементы.ФормаУдалитьНепосредственно.Видимость = ОбъектЗаполнен;
	
	Элементы.ФормаСозданиеНового.Видимость = ДоступноСозданиеНового;
	Элементы.ФормаСозданиеНовогоЕще.Видимость = ДоступноСозданиеНового;
	Элементы.ФормаСозданиеНовогоЕще.КнопкаПоУмолчанию = НЕ ВыбранОбъект;
	
	// Командная панель объекта
	Элементы.КоманднаяПанельЗаполнениеОбъекта.Видимость = ТипОбъектаВыбран;
	Элементы.КоманднаяПанельЗаполнениеОбъектаПодменюЗаполнить.Доступность = ТипОбъектаВыбран;
	Элементы.ВыгрузитьВXML.Видимость = ОбъектЗаполнен;
	Элементы.ФормаОбновить.Доступность = ОбъектЗаполнен;

	ИТК_ПараметрыЗаписиКлиент.ОбновитьЭлементы(ЭтотОбъект, ЭтоДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеСтроки(Строка)
	
	Строка.ЗначениеКартинка = ИТК_Типы.КартинкаЗначения(Строка.Значение, Строка.Тип);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользуетсяПоле(Использование, ЭтоГруппа)
	
	Если ЭтоГруппа = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Использование = БиблиотекаКартинок.ИТК_Папка Тогда
		
		Результат = ЭтоГруппа;
		
	ИначеЕсли Использование = БиблиотекаКартинок.Реквизит Тогда
		
		Результат = НЕ ЭтоГруппа;

	Иначе
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыборТипаОбъектаЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанныеОбъекта(, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ВводЗначенияРеквизитаЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыТекущиеДанные = Элементы.Реквизиты.ТекущиеДанные;
	РеквизитыТекущиеДанные.Изменять = Истина;
	
	ИТК_ФормаКлиент.ОбработкаЗавершенВводЗначенияВФорме(Элементы.РеквизитыЗначение, Результат, ДополнительныеПараметры,
																РеквизитыТекущиеДанные.Значение, РеквизитыТекущиеДанные.Тип, Модифицированность); 
	ОбновитьДанныеСтроки(РеквизитыТекущиеДанные);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеТаблицыЗначений(Синоним, КоличествоСтрок)
	
	Результат = Новый Структура;
	Результат.Вставить("Представление", ПредставлениеТаблицыЗначений(Синоним, КоличествоСтрок));
	
	Пустая = (КоличествоСтрок = 0);
	Результат.Вставить("Пустая", Пустая);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеТаблицыЗначений(Синоним, КоличествоСтрок)
	
	Результат = Синоним;
	
	Если ЗначениеЗаполнено(КоличествоСтрок) Тогда
		Результат = СтрШаблон("%1 (%2)", Результат, КоличествоСтрок);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключаемыйОбновитьРедактируемуюТабличнуюЧасть()
	
	ОбновитьРедактируемуюТаблицуЗначений(Элементы.ТабличныеЧасти, "РедактируемаяТабличнаяЧасть");
		
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйОбновитьРедактируемыеДвижения()
	
	ОбновитьРедактируемуюТаблицуЗначений(Элементы.Движения, "РедактируемыеДвижения");
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРедактируемуюТаблицуЗначений(ЭлементКоллекция, ИмяРеквизита)
	
	ТекущиеДанные = ЭлементКоллекция.ТекущиеДанные;
	ЭлементТаблицаЗначений = Элементы[ИмяРеквизита];
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ЭлементТаблицаЗначений.Видимость = Ложь;
		ЭлементТаблицаЗначений.ТолькоПросмотр = Истина;
		Возврат;
		
	КонецЕсли;
	
	ЭлементТаблицаЗначений.Видимость = Истина;
	ЭлементТаблицаЗначений.ТолькоПросмотр = НЕ ТекущиеДанные.Доступность;
	
	ИТК_ПодключаемыеКомандыКлиент.УстановитьДоступностьТаблицыЗначений(ЭтотОбъект, ИмяРеквизита, ТекущиеДанные.Доступность);
	
	Адрес = ТекущиеДанные.Значение;
	Если ЗначениеЗаполнено(Адрес) Тогда 
			
		ОбновитьРедактируемуюТаблицуЗначенийНаСервере(ИмяРеквизита, Адрес);
		ЭтотОбъект[ИмяРеквизита + "Имя"] = ЭлементКоллекция.ТекущиеДанные.Имя;

	Иначе
			
		Если ЭлементКоллекция = Элементы.ТабличныеЧасти Тогда
				
			ЗапуститьПолучениеТабличнойЧастиОбъекта(ТекущиеДанные.Имя);
				
		ИначеЕсли ЭлементКоллекция = Элементы.Движения Тогда
				
			ЗапуститьПолучениеДвиженийОбъекта(ТекущиеДанные.ПолноеИмя);
				
		КонецЕсли;
			
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьРедактируемуюТаблицуЗначенийНаСервере(ИмяЭлементаРеквизита, Адрес)
	
	ТаблицаЗначений = ПолучитьИзВременногоХранилища(Адрес);
	ИмяРеквизита = "Объект." + ИмяЭлементаРеквизита;
	
	// Собираем удаляемые реквизиты
	ПолеНомерСтроки = "НомерСтроки";
	Если ИТК_ОбщийПовтИсп.ВариантВстроенногоЯзыкаАнглийский() Тогда
		ПолеНомерСтроки = "LineNumber";
	КонецЕсли;
	
	УдаляемыеРеквизиты = Новый Массив;
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого ЭлементКолонкаТЧ Из Элементы[ИмяЭлементаРеквизита].ПодчиненныеЭлементы Цикл 
		
		Если ЭлементКолонкаТЧ.ПутьКДанным = ИмяРеквизита + "." + ПолеНомерСтроки Тогда
			Продолжить;
		КонецЕсли;
		
		УдаляемыеРеквизиты.Добавить(ЭлементКолонкаТЧ.ПутьКДанным);
		УдаляемыеЭлементы.Добавить(ЭлементКолонкаТЧ);
		
	КонецЦикла;
	
	// Удаляем элементы
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл 
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	// Собираем добавляемые реквизиты
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл 
		ИТК_Форма.ДобавитьРеквизитВТаблицуЗначений(ДобавляемыеРеквизиты, Колонка.Имя, Колонка.ТипЗначения, ИмяРеквизита);
	КонецЦикла;

	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	// Добавляем элементы колонки
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл 
		ИТК_Форма.ДобавитьЭлементКолонкуВТаблицуЗначений(ЭтотОбъект, Колонка.Имя, Колонка.ТипЗначения, ИмяЭлементаРеквизита, ИмяРеквизита, Колонка.Заголовок);
	КонецЦикла;
	
	// Загружаем данные
	ЭтотОбъект.Объект[ИмяЭлементаРеквизита].Загрузить(ТаблицаЗначений);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Варианты оформления
	ОформлениеЦветТекстаСерый = Новый Структура("ЦветТекста", WebЦвета.Серый);
	ОформлениеТолькоПросмотр = Новый Структура("ТолькоПросмотр", Истина);
	ОформлениеШрифтЖирный = Новый Структура("Шрифт", ИТК_ОбщийКлиентСервер.ШрифтЖирный());
	
	ОформлениеЦветТекстаСерыйТекстАвто = Новый Структура;
	ОформлениеЦветТекстаСерыйТекстАвто.Вставить("ЦветТекста", WebЦвета.Серый);
	ОформлениеЦветТекстаСерыйТекстАвто.Вставить("Текст", НСтр("ru = '<Авто>';
																|en = '<Auto>'"));
	
	// Реквизиты
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "Реквизиты", ОформлениеЦветТекстаСерый, "Реквизиты.Заблокирован", Истина);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "Реквизиты", ОформлениеЦветТекстаСерый, "Реквизиты.Доступность", Ложь);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "РеквизитыИзменять", ОформлениеТолькоПросмотр, "Реквизиты.Доступность", Ложь);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "РеквизитыИмя", ОформлениеШрифтЖирный, "Реквизиты.Изменять", Истина);
	
	// Оформление авто полей
	Условия = Новый Массив;
	Условия.Добавить(Новый Структура("Поле, Значение", "Реквизиты.АвтоПоле", Истина));
	Условия.Добавить(Новый Структура("Поле, Значение", "Реквизиты.Изменять", Ложь));
	Условия.Добавить(Новый Структура("Поле, Значение", "Реквизиты.Доступность", Истина));
	ИТК_Форма.ДобавитьУсловноеОформлениеГруппой(УсловноеОформление, "РеквизитыЗначение", ОформлениеЦветТекстаСерыйТекстАвто, Условия);
	
	// Табличные части
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ТабличныеЧастиПредставление", ОформлениеШрифтЖирный, "ТабличныеЧасти.Изменять", Истина);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ТабличныеЧасти", ОформлениеЦветТекстаСерый, "ТабличныеЧасти.Доступность", Ложь);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ТабличныеЧастиИзменять", ОформлениеТолькоПросмотр, "ТабличныеЧасти.Доступность", Ложь);
	
	// Движения
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ДвиженияПредставление", ОформлениеШрифтЖирный, "Движения.Изменять", Истина);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "Движения", ОформлениеЦветТекстаСерый, "Движения.Доступность", Ложь);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ДвиженияИзменять", ОформлениеТолькоПросмотр, "Движения.Доступность", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьУсловноеОформлениеДанныхОбъекта(ДанныеОбъекта)
	
	ИдентификаторПользовательскойНастройки = "Объект";
	
	// Очистка
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого Элемент Из УсловноеОформление.Элементы Цикл 
		
		Если Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки Тогда
			
			УдаляемыеЭлементы.Добавить(Элемент);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл 
		
		УсловноеОформление.Элементы.Удалить(Элемент);
		
	КонецЦикла;
	
	// Добавление
	Для Каждого Реквизит Из ДанныеОбъекта.Реквизиты Цикл 
		
		Формат = ИТК_ФормаКлиентСервер.ФорматРедактированияДаты(Реквизит.Тип);
		Если ЗначениеЗаполнено(Формат) Тогда
			
			ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "РеквизитыЗначение", Новый Структура("Формат", Формат), "Реквизиты.Имя", Реквизит.Имя, , ИдентификаторПользовательскойНастройки);
			
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененнуюТаблицуЗначений(ИмяРеквизитаКоллекции, ИмяРеквизита)
	
	ИзмененаТаблицаЗначений = ЭтотОбъект[ИмяРеквизита + "Модифицированность"];
	
	Если НЕ ИзмененаТаблицаЗначений Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияСтрок = ЭтотОбъект[ИмяРеквизитаКоллекции];
	Если НЕ ЗначениеЗаполнено(КоллекцияСтрок) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = ЭтотОбъект[ИмяРеквизита + "Имя"];
	ОтборСтрок = Новый Структура("Имя", ИмяТаблицы);
	НайденныеСтроки = КоллекцияСтрок.НайтиСтроки(ОтборСтрок);
	НайденнаяСтрока = НайденныеСтроки[0];
	
	Если НЕ НайденнаяСтрока.Доступность Тогда 
		Возврат;
	КонецЕсли;
	
	НайденнаяСтрока.Значение = СохранитьИзмененнуюТаблицуЗначенийНаСервере(ИмяРеквизитаКоллекции, ИмяРеквизита, НайденнаяСтрока.Значение);
	
КонецПроцедуры

&НаСервере
Функция СохранитьИзмененнуюТаблицуЗначенийНаСервере(ИмяРеквизитаКоллекции, ИмяРеквизита, Адрес)
	
	ИзмененнаяТаблицаЗначений = ИТК_РаботаСОбъектом.ВыгрузитьТабличнуюЧастьВТаблицуЗначений(Объект[ИмяРеквизита]);
	Возврат ИТК_ВременноеХранилище.Поместить(ИзмененнаяТаблицаЗначений, Адрес, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ЗавершенВопросДействия(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ИдетИзменениеОбъекта = Истина;
	Действие = ДополнительныеПараметры.ИмяДействия;
	
	ДлительнаяОперацияИзменениеОбъекта = ИзменитьОбъектаНаСервере(УникальныйИдентификатор, ОбрабатываемыйОбъект, Действие);
	
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ПолеТекстСообщения = "ТекстСообщения";
	ПолеВыводитьОкноОжидания = "ВыводитьОкноОжидания";
	Если ИТК_БСПКлиентСерверПовтИсп.АнглийскаяБСП() Тогда
		
		ПолеТекстСообщения = "MessageText";
		ПолеВыводитьОкноОжидания = "OutputIdleWindow";
		
	КонецЕсли;

	ПараметрыОжидания[ПолеВыводитьОкноОжидания] = Истина;
	ПараметрыОжидания[ПолеТекстСообщения] = НСтр("ru = 'Запись объекта'; en = 'Object entry'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноИзменениеДанныхОбъекта", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияИзменениеОбъекта, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Функция ИзменитьОбъектаНаСервере(УникальныйИдентификатор, ВыбранныйОбъект, Действие)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Действие", Действие);
	ПараметрыПроцедуры.Вставить("ВыбранныйОбъект", ВыбранныйОбъект);
	ПараметрыПроцедуры.Вставить("НастройкиЗаписи", НастройкиЗаписиОбъекта());
	
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_РедакторОбъекта.ИзменитьДанныеОбъекта", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Функция НастройкиЗаписиОбъекта()

	ЭтоГруппа = ЗначениеРеквизитаЭтоГруппа(); 
	
	НастройкиЗаписи = Новый Структура;
	
	// Основные
	ПараметрыЗаписи = ИТК_ПараметрыЗаписиКлиентСервер.Значения(ЭтотОбъект);
	НастройкиЗаписи.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	
	НастройкиЗаписи.Вставить("ЭтоГруппа", ЭтоГруппа);
	
	// Изменяемые реквизиты, свойства, ссылка нового
	UIDНового = Неопределено;
	ИзменяемыеРеквизиты = Новый Соответствие;
	ИзменяемыеСвойства = Новый Соответствие;
	
	Для Каждого Реквизит Из Реквизиты Цикл 
		
		ИмяРеквизита = Реквизит.Имя;
		
		Если ИмяРеквизита = "ЭтоГруппа"
				ИЛИ НЕ ИспользуетсяПоле(Реквизит.Использование, ЭтоГруппа) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Реквизит.Изменять Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяРеквизита = ИТК_РаботаСОбъектом.ИмяУникальногоИдентификаторСсылки() Тогда
			UIDНового = Реквизит.Значение;
		ИначеЕсли ЗначениеЗаполнено(Реквизит.Свойство) Тогда
			ИзменяемыеСвойства.Вставить(Реквизит.Свойство, Реквизит.Значение);
		Иначе
			ИзменяемыеРеквизиты.Вставить(ИмяРеквизита, Реквизит.Значение);
		КонецЕсли;
		
	КонецЦикла;
	НастройкиЗаписи.Вставить("UIDНового", UIDНового);
	НастройкиЗаписи.Вставить("ИзменяемыеРеквизиты", ИзменяемыеРеквизиты);
	НастройкиЗаписи.Вставить("ИзменяемыеСвойства", ИзменяемыеСвойства);
	
	// Изменяемые Табличные части
	ИзменяемыеТабличныеЧасти = Новый Соответствие;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл 
		
		Если НЕ ИспользуетсяПоле(ТабличнаяЧасть.Использование, НастройкиЗаписи.ЭтоГруппа) Тогда
			Продолжить;
		КонецЕсли;
		
		Адрес = ТабличнаяЧасть.Значение;
		Если ТабличнаяЧасть.Изменять И ЗначениеЗаполнено(Адрес) Тогда
			
			ТаблицаЗначений = ПолучитьИзВременногоХранилища(ТабличнаяЧасть.Значение);
			ИзменяемыеТабличныеЧасти.Вставить(ТабличнаяЧасть.Имя, ТаблицаЗначений);
			
		КонецЕсли;
		
	КонецЦикла;
	НастройкиЗаписи.Вставить("ИзменяемыеТабличныеЧасти", ИзменяемыеТабличныеЧасти);
	
	// Записываемые Движения
	ЗаписываемыеДвижения = Новый Соответствие;
	Для Каждого ЭлементДвижений Из Движения Цикл 
		
		Если НЕ ЭлементДвижений.Изменять Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДвижений = ПолучитьИзВременногоХранилища(ЭлементДвижений.Значение);
		ЗаписываемыеДвижения.Вставить(ЭлементДвижений.Имя, ТаблицаДвижений);
		
	КонецЦикла;
	НастройкиЗаписи.Вставить("ЗаписываемыеДвижения", ЗаписываемыеДвижения);
	
	Возврат НастройкиЗаписи;
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноИзменениеДанныхОбъекта(Результат, ДополнительныеПараметры) Экспорт
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОбновитьДанныеПослеИзмененияОбъектаНаФорме(Результат.АдресРезультата);
		
		ОповеститьОбИзменении(ОбрабатываемыйОбъект);
		ОбновитьДанныеОбъекта();
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( , Результат.КраткоеПредставлениеОшибки, , ИТК_РедакторОбъектаКлиентСервер.Представление());
	КонецЕсли;
	
	ИдетИзменениеОбъекта = Ложь;
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПослеИзмененияОбъектаНаФорме(АдресРезультата)
	
	СсылкаНаНовыйОбъект = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если СсылкаНаНовыйОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбрабатываемыйОбъект = СсылкаНаНовыйОбъект;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОбъекта(ОбъектЗаполнения = Неопределено, ДобавитьВИсториюВыбранных = Ложь)
	
	ИдетПолучениеДанныхОбъекта = Истина;
	Модифицированность = (ОбъектЗаполнения <> Неопределено);
	
	ИнициализироватьПоВыбранномуТипуОбъекта();
	ДлительнаяОперацияПолучениеДанныхОбъекта = ОбновитьДанныеОбъектаНаСервере(УникальныйИдентификатор, ОбрабатываемыйОбъект, ОбъектЗаполнения, ДобавитьВИсториюВыбранных);
	
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеДанныхОбъекта", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияПолучениеДанныхОбъекта, ОповещениеОЗавершении, ПараметрыОжидания);
	
	Если ДобавитьВИсториюВыбранных Тогда
		Оповестить("ИзмененаИсторияВыбранных", ИТК_Перечисления.ИнструментРедакторОбъекта(), ЭтотОбъект);
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьДанныеОбъектаНаСервере(УникальныйИдентификатор, ВыбранныйОбъект, ОбъектЗаполнения, ДобавитьВИсториюВыбранных)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ВыбранныйОбъект", ВыбранныйОбъект);
	ПараметрыПроцедуры.Вставить("ДобавитьВИсториюВыбранных", ДобавитьВИсториюВыбранных);
	
	Если ЭтоАдресВременногоХранилища(ОбъектЗаполнения) Тогда
		ОбъектЗаполнения = ПолучитьИзВременногоХранилища(ОбъектЗаполнения);
	КонецЕсли;
	ПараметрыПроцедуры.Вставить("ОбъектЗаполнения", ОбъектЗаполнения);
	
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_РедакторОбъекта.ДанныеОбъекта", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноОбновлениеДанныхОбъекта(Результат, ДополнительныеПараметры) Экспорт
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбновитьДанныеОбъектаНаФорме(Результат.АдресРезультата);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( , Результат.КраткоеПредставлениеОшибки, , ИТК_РедакторОбъектаКлиентСервер.Представление());
	КонецЕсли;
	
	ИдетПолучениеДанныхОбъекта = Ложь;
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьПоВыбранномуТипуОбъекта()
	
	// Очистить временные хранилища
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл 
		ИТК_ВременноеХранилище.Удалить(ТабличнаяЧасть.Значение);
	КонецЦикла;
	
	Для Каждого Движение Из Движения Цикл 
		ИТК_ВременноеХранилище.Удалить(Движение.Значение);
	КонецЦикла;
	
	Реквизиты.Очистить();
	ТабличныеЧасти.Очистить();
	Движения.Очистить();
	
	// Получение данных объекта
	ТипЗначенияОбъекта = ТипЗнч(ОбрабатываемыйОбъект);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначенияОбъекта);

	Если ОбъектМетаданных = Неопределено Тогда
		
		ТипОбъекта = НСтр("ru = 'Объект';
							|en = 'Object'");
		ЭтоДокумент = Ложь;
		ЭтоЗадача = Ложь;
		ДоступноПроведение = Ложь;
		
	Иначе
		
		ТипОбъекта = ИТК_Метаданные.ПолноеИмя(ОбъектМетаданных);
		ЭтоДокумент = ИТК_Метаданные.ЭтоДокумент(ОбъектМетаданных);
		ЭтоЗадача = ИТК_Метаданные.ЭтоЗадача(ОбъектМетаданных);
		
		ДоступноПроведение = ЭтоДокумент И (ОбъектМетаданных.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить);
		
	КонецЕсли;
	
	ЗаполнитьТипОбъекта();
	
	//Модифицированность = (ОбъектЗаполнения <> Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеОбъектаНаФорме(АдресРезультата)
	
	ДанныеОбъекта = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ДанныеОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьПоВыбранномуТипуОбъекта();
	ОбновитьУсловноеОформлениеДанныхОбъекта(ДанныеОбъекта);
	
	Для Каждого СтрокаРеквизит Из ДанныеОбъекта.Реквизиты Цикл 
		
		Если НЕ ИТК_Типы.РедактируетсяВТаблицеЗначений(СтрокаРеквизит.Тип) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Реквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРеквизит);
		НоваяСтрока.КартинкаТип = ИТК_Типы.КартинкаОписания(СтрокаРеквизит.Тип);
		НоваяСтрока.Значение = СтрокаРеквизит.Тип.ПривестиЗначение(СтрокаРеквизит.Значение);
		НоваяСтрока.ЗначениеКартинка = ИТК_Типы.КартинкаЗначения(СтрокаРеквизит.Значение, СтрокаРеквизит.Тип);
		НоваяСтрока.ТипПредставление = ИТК_Типы.ПредставлениеОписания(СтрокаРеквизит.Тип);
		
	КонецЦикла;
	
	Для Каждого СтрокаТабличнаяЧасть Из ДанныеОбъекта.ТабличныеЧасти Цикл 
		
		НоваяСтрока = ТабличныеЧасти.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнаяЧасть);
		
		ДанныеТабличнойЧасти = ДанныеТаблицыЗначений(СтрокаТабличнаяЧасть.Имя, НоваяСтрока.КоличествоСтрок);
		НоваяСтрока.Представление = ДанныеТабличнойЧасти.Представление;
		НоваяСтрока.Пустая = ДанныеТабличнойЧасти.Пустая;
		
		Если СтрокаТабличнаяЧасть.Значение <> Неопределено Тогда
			НоваяСтрока.Значение = ПоместитьВоВременноеХранилище(СтрокаТабличнаяЧасть.Значение, УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаДвижение Из ДанныеОбъекта.Движения Цикл 
		
		НоваяСтрока = Движения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДвижение);
		
		ДанныеДвижений = ДанныеТаблицыЗначений(СтрокаДвижение.Имя, НоваяСтрока.КоличествоСтрок);
		НоваяСтрока.Представление = ДанныеДвижений.Представление;
		НоваяСтрока.Пустая = ДанныеДвижений.Пустая;
		
		Если СтрокаДвижение.Значение <> Неопределено Тогда
			НоваяСтрока.Значение = ПоместитьВоВременноеХранилище(СтрокаДвижение.Значение, УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЦикла;
	
	РеквизитыКоличество = Реквизиты.Количество();
	ТабличныеЧастиКоличество = ТабличныеЧасти.Количество();
	ДвиженияКоличество = Движения.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененаРедактируемаяТаблицаЗначений(ЭлементКоллекция, Имя)
	
	Модифицированность = Истина;
	ЭтотОбъект[Имя + "Модифицированность"] = Истина;
	
	ТекущиеДанные = ЭлементКоллекция.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.Изменять = Истина;
		
		КоличествоСтрок = Объект[Имя].Количество();
		ТекущиеДанные.КоличествоСтрок = КоличествоСтрок;
		
		Пустая = (КоличествоСтрок = 0);
		ТекущиеДанные.КоличествоСтрок = Пустая;

		ТекущиеДанные.Представление = ПредставлениеТаблицыЗначений(ТекущиеДанные.Имя, КоличествоСтрок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОтсутствуетИзменениеОбъекта()
	
	Отбор = Новый Структура("Изменять", Истина);
	ИзменяемыеРеквизиты = Реквизиты.НайтиСтроки(Отбор);
	ИзменяемыеТабличныеЧасти = ТабличныеЧасти.НайтиСтроки(Отбор);
	ИзменяемыеДвижения = Движения.НайтиСтроки(Отбор);
	
	Возврат НЕ (ЗначениеЗаполнено(ИзменяемыеРеквизиты)
			ИЛИ ЗначениеЗаполнено(ИзменяемыеТабличныеЧасти)
			ИЛИ ЗначениеЗаполнено(ИзменяемыеДвижения));
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьОбработчикСПроверкойНаСохранностьДанных(ОписаниеОбработчика)
	
	Если Модифицированность Тогда
		
		// Список вариантов ответа
		ВариантыОтвета = Новый СписокЗначений;
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Да,		НСтр("ru = 'Закрыть';
																	|en = 'Close'"));
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Отмена,	НСтр("ru = 'Отмена';
																	|en = 'Cancel'"));
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросСохраненияЗавершение", ЭтотОбъект, ОписаниеОбработчика),
								НСтр("ru = 'При закрытии не применненые к объекту изменения будут потеряны';
									|en = 'When closing, changes that are not applied to the object will be lost'"), ВариантыОтвета, , КодВозвратаДиалога.Отмена,
								ИТК_РедакторОбъектаКлиентСервер.Представление());
		
	Иначе 
		
		ВыполнитьОбработкуОповещения(ОписаниеОбработчика);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросСохраненияЗавершение(Результат, ОписаниеОбработчика) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытиеРазрешеноЗакрыть(Результат, ДополнительныеПараметры) Экспорт
	
	ЗакрытиеРазрешено = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхОбъектаИзXMLЗакончено(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		
		ПолноеИмяФайла = ВыбранныеФайлы[0];
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗаконченоПомещениеXMLФайлаВХранилищеДляЗаполнения", ЭтотОбъект), , ПолноеИмяФайла, Ложь);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаконченоПомещениеXMLФайлаВХранилищеДляЗаполнения(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанныеОбъекта(Адрес);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнениеОбъектаДанныхПоФайлуXML(Адрес)
	
	ТекстОшибки = Неопределено;
	АдресОбъекта = Неопределено;
	
	ЧтениеXML = Новый ЧтениеXML;
	
	ФайлXMLДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ЧтениеXML.ОткрытьПоток(ФайлXMLДвоичныеДанные.ОткрытьПотокДляЧтения()); 
	
	Попытка
		
		ОбъектМетаданных = ОбрабатываемыйОбъект.Метаданные();
		ТипИзменяемогоОбъекта = Тип(СтрШаблон("%1Объект.%2", ИТК_Метаданные.ИмяОбъектаКоллекции(ОбъектМетаданных), ОбъектМетаданных.Имя));
		
		ПрочитанныеДанные = ПрочитатьXML(ЧтениеXML, ТипИзменяемогоОбъекта);
		
		АдресОбъекта = ПоместитьВоВременноеХранилище(ПрочитанныеДанные);
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	ЧтениеXML.Закрыть();
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстОшибки", ТекстОшибки);
	Результат.Вставить("АдресОбъекта", АдресОбъекта);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура НачалоВыбораОбъекта(СтандартнаяОбработка, ВыбиратьТип = Неопределено)
	
	ОповещениеОповещения = Новый ОписаниеОповещения("ВыборТипаОбъектаЗавершен", ЭтотОбъект);
	ИТК_ФормаКлиент.НачалоВыбораЗначенияВФорме(ЭтотОбъект, "ОбрабатываемыйОбъект", НСтр("ru = 'Объект';
																						|en = 'Object'"), СтандартнаяОбработка, ОповещениеОповещения, ВыбиратьТип);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСвойствоВРеквизиты()
	
	Если ИТК_БСППовтИсп.СуществуетПодсистема("СтандартныеПодсистемы.Свойства") Тогда
		
		ТипЗначения = "ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения";
		Если ИТК_БСППовтИсп.АнглийскаяБСП() Тогда
			ТипЗначения = "ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo";
		КонецЕсли;
		
	Иначе
		ТипЗначения = "Неопределено";
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ИТК_Форма.ДобавитьРеквизит(ДобавляемыеРеквизиты, "Свойство", ТипЗначения, , "Реквизиты");
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

КонецПроцедуры

&НаКлиенте
Процедура ВопросРазблокироватьРеквизит(ОписаниеРеквизита)
	
	Шаблон = НСтр("ru = 'Для того чтобы не допустить рассогласования данных в программе,
	|реквизит ""%1"" не доступен для редактирования.
	|
	|Перед тем, как разрешить его редактирование, рекомендуется оценить последствия,
	|проверив все места использования выбранных элементов в программе.
	|
	|Разблокировать реквизит ""%1"" для изменения?';
	|en = 'In order to prevent data mismatch in the program,
	|variable ""%1"" is not editable.
	|
	|Before you allow editing it, it is recommended to evaluate the consequences,
	|by checking all the places where the selected elements are used in the program.
	|
	|Unlock props ""%1"" for change?'");
	Текст = СтрШаблон(Шаблон, ОписаниеРеквизита.Имя);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(Истина, НСтр("ru = 'Разблокировать'"));
	Кнопки.Добавить(Ложь, НСтр("ru = 'Отмена'"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросРазблокироватьРеквизитЗавершение", ЭтотОбъект, ОписаниеРеквизита);
	ПоказатьВопрос(ОписаниеОповещения, Текст, Кнопки, , Истина, НСтр("ru = 'Реквизит заблокирован'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросРазблокироватьРеквизитЗавершение(Разблокировать, ОписаниеРеквизита) Экспорт
	
	Если НЕ Разблокировать Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеРеквизита.Заблокирован = Ложь;
	ОписаниеРеквизита.Изменять = Истина;
	
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаЭтоГруппа()
	
	Результат = Ложь;
	
	Для Каждого Реквизит Из Реквизиты Цикл 
		
		Если Реквизит.Имя = "ЭтоГруппа" Тогда
			
			Результат = Реквизит.Значение;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТипОбъекта()
	
	ИТК_РаботаСОбъектом.ЗаполнитьТипВыбранного(ЭтотОбъект, "ОбрабатываемыйОбъект");

КонецПроцедуры

&НаКлиенте
Процедура ОбрабатываемыйОбъектИзменен(Значение, ДобавитьВИсториюВыбранных = Истина)
	
	Элемент = Элементы.ОбрабатываемыйОбъект;
	
	ДвиженияИдентификаторПоследней = Неопределено;
	
	РедактируемаяТабличнаяЧастьИмя = Неопределено;
	РедактируемаяТабличнаяЧастьМодифицированность = Ложь;
	
	ОбрабатываемыйОбъект = Значение;
	ИТК_ФормаКлиент.АктивизацияЗначенияВФорме(Элемент, ОбрабатываемыйОбъект, Новый ОписаниеТипов);
	ОбновитьДанныеОбъекта(, ДобавитьВИсториюВыбранных);
	
	Элемент.КнопкаВыпадающегоСписка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПолучениеТабличнойЧастиОбъекта(ИмяТабличнойЧасти)
	
	ИдетПолучениеТабличнойЧасти = Истина;
	
	ДлительнаяОперацияПолучениеТабличнойЧасти = ДанныеТабличнойЧастиНаСервере(ОбрабатываемыйОбъект, ИмяТабличнойЧасти, УникальныйИдентификатор);
	
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноПолучениеТабличнойЧасти", ЭтотОбъект, ДополнительныеПараметры);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияПолучениеТабличнойЧасти, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеТабличнойЧастиНаСервере(Объект, ИмяТабличнойЧасти, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Объект", Объект);
	ПараметрыПроцедуры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_РедакторОбъекта.ДанныеТабличнойЧасти", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноПолучениеТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	
	ИдетПолучениеТабличнойЧасти = Ложь;
	ОбновитьЭлементыФормы();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат.Статус = "Выполнено" Тогда
		
		ИмяТабличнойЧасти = ДополнительныеПараметры.ИмяТабличнойЧасти;
		
		Фильтр = Новый Структура("Имя", ИмяТабличнойЧасти);
		НайденныеСтроки = ТабличныеЧасти.НайтиСтроки(Фильтр);
		НайденныеСтроки[0].Значение = Результат.АдресРезультата;
		
		ОбновитьРедактируемуюТаблицуЗначений(Элементы.ТабличныеЧасти, "РедактируемаяТабличнаяЧасть");
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПолучениеДвиженийОбъекта(ПолноеИмяРегистра)
	
	ИдетПолучениеДвижений = Истина;
	
	ДлительнаяОперацияПолучениеДвижений = ДанныеДвиженийНаСервере(ОбрабатываемыйОбъект, ПолноеИмяРегистра, УникальныйИдентификатор);
	
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПолноеИмяРегистра", ПолноеИмяРегистра);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноПолучениеДвижений", ЭтотОбъект, ДополнительныеПараметры);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияПолучениеДвижений, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеДвиженийНаСервере(Объект, ПолноеИмяРегистра, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Объект", Объект);
	ПараметрыПроцедуры.Вставить("ПолноеИмяРегистра", ПолноеИмяРегистра);
	
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_РедакторОбъекта.ДанныеДвижений", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноПолучениеДвижений(Результат, ДополнительныеПараметры) Экспорт
	
	ИдетПолучениеДвижений = Ложь;
	ОбновитьЭлементыФормы();
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ПолноеИмяРегистра = ДополнительныеПараметры.ПолноеИмяРегистра;
		
		Фильтр = Новый Структура("ПолноеИмя", ПолноеИмяРегистра);
		НайденныеСтроки = Движения.НайтиСтроки(Фильтр);
		НайденныеСтроки[0].Значение = Результат.АдресРезультата;
		
		ОбновитьРедактируемуюТаблицуЗначений(Элементы.Движения, "РедактируемыеДвижения");
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокИсторииВыбранных()
	
	ИТК_РаботаСОбъектом.ОбновитьСписокИсторииВыбранных(Элементы.ОбрабатываемыйОбъект, ИТК_Перечисления.ИнструментРедакторОбъекта());
	
КонецПроцедуры

#КонецОбласти