
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	бит_РаботаСДиалогамиСервер.ФормаВыбораПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Если установлен отбор по владельцу выведем в заголовке формы.
	ЭлементОтбора = Неопределено;
	Параметры.Отбор.Свойство("Владелец", ЭлементОтбора);
	
	Если НЕ ЭлементОтбора = Неопределено Тогда
		ЭтотОбъект.АвтоЗаголовок = Ложь;
		ТекстЗаголовка = НСтр("ru = 'Дополнительные значения: %1'; en = 'Additional values: %1'");
		ТекстЗаголовка = СтрШаблон(ТекстЗаголовка, ЭлементОтбора); 
		ЭтотОбъект.Заголовок = ТекстЗаголовка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
