
#Область ОписаниеПеременных

&НаКлиенте 
Перем мКэшРеквизитовФормы; // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	ВалютаЗаполнения = Объект.Валюта;
	
	ЗаполнитьКэшЗначений();
	
	// Если объект новый
	Если Параметры.Ключ.Пустая() Тогда
		
		// Если это копирование
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			
			фЗадатьВопросОКопированииКурсов = Параметры.ЗначениеКопирования.ИспользоватьКурсыСценария;					
			фКэшЗначений.Вставить("ЗначениеКопирования", Параметры.ЗначениеКопирования);
					 			
		КонецЕсли; 	
	
	КонецЕсли;   
	
	// Вызов процедуры установки доступности элементов управления
	УстановитьДоступностьЭлементов();
	
	// Установка параметров динамических список на случай записи нового элемента.	
	УстановитьОтборыДинамическихСписков();
		 	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Установка параметров динамических список на случай записи нового элемента.	
	УстановитьОтборыДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	мКэшРеквизитовФормы.Вставить("бит_Периодичность");
	                       	                                              		
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	мКэшРеквизитовФормы.Вставить("ВалютаЗаполнения", ВалютаЗаполнения);
	
	// Если это скопированный элемент с признаком использования курсов сценария, тогда
	Если фЗадатьВопросОКопированииКурсов Тогда
		ТекстСообщения = НСтр("ru='Выполнить копирование курсов сценария? Сценарий будет при этом записан.';
							  |en='To copy the script courses? The script will be written at the same time.'"); 
		Оповещение = Новый ОписаниеОповещения("ВопросОКопированииКурсовСценарияЗавершение", ЭтотОбъект, Отказ);
		ПоказатьВопрос(Оповещение,ТекстСообщения, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет кэш реквизитов формы данными объекта.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры

// Процедура добавляет в кэш реквизитов текущее значение заданного реквизита.
//
// Параметры:
// 	ИмяРеквизита - Строка.
//
&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	мКэшРеквизитовФормы[ИмяРеквизита] = Объект[ИмяРеквизита];	
	
КонецПроцедуры

// Процедура записывает данный объект
//
// Параметры:
//  Отказ 					- Булево.
//  КопироватьКурсыСценария - Булево (По умолчанию = Ложь).
//
&НаКлиенте
Процедура ЗаписатьЭтотОбъектКлиент(Отказ, КопироватьКурсыСценария = Ложь)

	ЗаписанСценарий = ЗаписатьЭтотОбъект(КопироватьКурсыСценария);
	Отказ = НЕ ЗаписанСценарий;
	
	Если ЗаписанСценарий Тогда
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

// Процедура открывает форму настройки заполнения курсов сценария
//
// Параметры:
//	СпособЗаполнения - Число (Номер способа в соответствии с которым будет заполняться регистр).
//
&НаКлиенте
Процедура ОткрытьФормуНастройкиЗаполненияКурсов(СпособЗаполнения) 	
	
	Отказ = Ложь;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВопросОЗаписиЭлементаЗавершение", ЭтотОбъект, СпособЗаполнения);
		ТекстВопроса = НСтр("ru='Элемент еще не записан. Записать?';
							|en='The element has not yet been recorded. Record?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		
		ОткрытиеФормыНастройкиЗаписиКурсов(СпособЗаполнения, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик оповещения "ВопросОЗаписиЭлементаЗавершение" 
//
&НаКлиенте
Процедура ВопросОЗаписиЭлементаЗавершение(Ответ, СпособЗаполнения) Экспорт
	
	Отказ = Ложь;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ЗаписатьЭтотОбъектКлиент(Отказ);
	Иначе
		Отказ = Истина;
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытиеФормыНастройкиЗаписиКурсов(СпособЗаполнения, Отказ);
		
КонецПроцедуры

// Процедура выполняет открытие формы настройки заполнения курсов сценария 
//
// Параметры:
//	СпособЗаполнения - Число (Номер способа в соответствии с которым будет заполняться регистр).
//
&НаКлиенте
Процедура ОткрытиеФормыНастройкиЗаписиКурсов(СпособЗаполнения, Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВалютаЗаполнения) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Валюта заполнения';en='filling Currency'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ВалютаЗаполнения",, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеКурса = Элементы.СписокКурсыСценариевПланирования.ТекущиеДанные;
	Если ТекущиеДанныеКурса = Неопределено Тогда
		флДатаНачала    = ОбщегоНазначенияКлиент.ДатаСеанса();
		флНачальныйКурс = 1;
	Иначе
		флДатаНачала    = ТекущиеДанныеКурса.Период;
		флНачальныйКурс = ТекущиеДанныеКурса.Курс;
	КонецЕсли;
	
	ИмяФормыЗаполненияКурсов = "Справочник.СценарииПланирования.Форма.ФормаНастройкиЗаполненияКурсов";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ"		  			  , Объект.Ссылка);
	ПараметрыФормы.Вставить("ВалютаЗаполнения"		  , ВалютаЗаполнения);
	ПараметрыФормы.Вставить("ДатаНачала"   			  , флДатаНачала);		
	ПараметрыФормы.Вставить("ДатаОкончания"	  		  , ОбщегоНазначенияКлиент.ДатаСеанса());
	ПараметрыФормы.Вставить("ДлинаИнтервала"  		  , 1);
	ПараметрыФормы.Вставить("КоличествоШагов" 		  , 1);
	ПараметрыФормы.Вставить("НачальныйКурс"			  , флНачальныйКурс);
	ПараметрыФормы.Вставить("СпособЗаполнения"		  , СпособЗаполнения);
	ОткрытьФорму(ИмяФормыЗаполненияКурсов, ПараметрыФормы, Элементы.СписокКурсыСценариевПланирования);

КонецПроцедуры // ОткрытиеФормыПомощникаЗаписиКурсов() 

// Процедура  - обработчик оповещения "ВопросКопированииКурсовСценарияЗавершение"
//             
&НаКлиенте    
Процедура ВопросОКопированииКурсовСценарияЗавершение(Ответ, Отказ) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаписатьЭтотОбъектКлиент(Отказ, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыКопироватьИзКурсовВалют(Команда)
	
	ОткрытьФормуНастройкиЗаполненияКурсов(1);
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыЗаполнитьИспользуяЛинейноеЗаполнение(Команда)
	
	ОткрытьФормуНастройкиЗаполненияКурсов(2);
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыЗаполнитьПоПроизвольномуАлгоритму(Команда)
	
	ОткрытьФормуНастройкиЗаполненияКурсов(3);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ПериодичностьПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодичностьКонтроля) 
		 ИЛИ Объект.бит_Периодичность <> Объект.ПериодичностьКонтроля Тогда
	
		 Объект.ПериодичностьКонтроля = Объект.бит_Периодичность;
	
	КонецЕсли; 
	
	ДобавитьВКэш("бит_Периодичность");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКурсыСценарияПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаЗаполненияПриИзменении(Элемент)
	
	УстановитьОтборыСпискаКурсовСценария();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКурсыСценариевПланированияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение(, НСтр("ru='Необходимо записать элемент.';en='You need to write element.'"));
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНастройкаКонтроляПоСценариямПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение(, НСтр("ru='Необходимо записать элемент.';en='You need to write element.'"));
	
	КонецЕсли; 
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	фКэшЗначений = Новый Структура;
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	фКэшЗначений.Вставить("ИмяОбъекта", МетаданныеОбъекта.Имя);
	фКэшЗначений.Вставить("ИмяТипаОбъекта", "СправочникОбъект." + МетаданныеОбъекта.Имя);
	
КонецПроцедуры

// Процедура устанавливает доступность элементов управления формы
//
&НаСервере
Процедура УстановитьДоступностьЭлементов()

	// Выясняем, есть ли по сценарию движения в регистре бит_ОборотыПоБюджетам 
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	ДоступностьОбязательныхЭлементов = Не СправочникОбъект.ЕстьДвиженияПоСценарию();
	ДоступностьКонтроля              = Не СправочникОбъект.ЕстьДвиженияПоКонтролю();
		
	// Если движений нет, то делаем доступными обязательные реквизиты   
	Элементы.Валюта.ТолькоПросмотр 					  	= Не ДоступностьОбязательныхЭлементов;
	Элементы.бит_Периодичность.ТолькоПросмотр	  		= Не ДоступностьОбязательныхЭлементов;
	Элементы.ПродолжительностьИнтервала.ТолькоПросмотр  = Не ДоступностьОбязательныхЭлементов;
	Элементы.ИспользоватьКурсыСценария.ТолькоПросмотр 	= Не ДоступностьОбязательныхЭлементов;
	
	Элементы.СтраницаКурсыСценария.Доступность = Объект.ИспользоватьКурсыСценария;
	Элементы.СписокКурсыСценариевПланирования.ТолькоПросмотр = Не ДоступностьКонтроля;
	
	Элементы.ПериодичностьКонтроля.ТолькоПросмотр = НЕ ДоступностьКонтроля;
	
	Если ДоступностьКонтроля Тогда
		ТекстСообщения = ""; 
		ПериодичностьКонтроляОтображениеПодсказки =	ОтображениеПодсказки.Авто;
	Иначе	
		ТекстСообщения = НСтр("ru='Изменение периодичности контроля запрещено, т.к. зафиксированы движения по исполнению в регистре ""Контрольные значения бюджетов"".';
								|en='Changing the frequency control is prohibited, as recorded motion on execution in the register ""Control budget values.""'"); 
		ПериодичностьКонтроляОтображениеПодсказки =	ОтображениеПодсказки.ОтображатьСнизу;
	КонецЕсли;  

	Элементы.ГруппаПериодичностьКонтроля.Подсказка			  = ТекстСообщения;
	Элементы.ГруппаПериодичностьКонтроля.ОтображениеПодсказки = ПериодичностьКонтроляОтображениеПодсказки;
	
КонецПроцедуры

// Процедура устанавливает отборы списка курсов сценария.
//
&НаСервере
Процедура УстановитьОтборыСпискаКурсовСценария()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокКурсыСценариевПланирования, 
		"Сценарий", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,, Истина); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокКурсыСценариевПланирования, 
		"Валюта", ВалютаЗаполнения, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ВалютаЗаполнения)); 
	
КонецПроцедуры

// Процедура устанавливает отборы списка настроек контроля по сценарию.
//
&НаСервере
Процедура УстановитьОтборыСпискаНастроекКонтроляСценария()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокНастройкаКонтроляПоСценариям, 
		"Сценарий", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,, Истина); 
	
КонецПроцедуры

// Процедура устанавливает параметры динамических списков 
// (СписокКурсыСценариевПланирования и СписокНастройкаКонтроляПоСценариям)  
//
&НаСервере
Процедура УстановитьОтборыДинамическихСписков()

	УстановитьОтборыСпискаКурсовСценария();
	УстановитьОтборыСпискаНастроекКонтроляСценария();

КонецПроцедуры

// Процедура записывает данный объект.
//
// Параметры:
//  КопироватьКурсыСценария - Булево (По умолчанию = Ложь).
//
// Возвращаемое значение:
//  Булево - сценарий записан.
//
&НаСервере
Функция ЗаписатьЭтотОбъект(Знач КопироватьКурсыСценария = Ложь)

	ЗаписанСценарий = Ложь;
	
	Если ПроверитьЗаполнение() Тогда
			
		СправочникОбъект = РеквизитФормыВЗначение("Объект");
		ЗаписанСценарий = бит_ОбщегоНазначения.ЗаписатьСправочник(СправочникОбъект,, "Нет");
		          		
		Если ЗаписанСценарий И КопироватьКурсыСценария Тогда		
			СправочникОбъект.СкопироватьКурсыСценария(фКэшЗначений.ЗначениеКопирования);		
		КонецЕсли;
		
		ЗначениеВДанныеФормы(СправочникОбъект, Объект);
		УстановитьОтборыДинамическихСписков();
	
	КонецЕсли;
	
	Возврат ЗаписанСценарий;

КонецФункции

#КонецОбласти
