
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
				 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыгрузитьШаблоныExcel(Команда)
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	Если МассивСтрок.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru='Не выбраны шаблоны для выгрузки.';
							  |en='Not selected for upload templates.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	Иначе	
		
		ДанныеДляВыгрузки = ПодготовитьДанныеДляВыгрузки(МассивСтрок);
		Если ДанныеДляВыгрузки.МассивДанных.Количество() > 0 Тогда
			бит_ПроформыКлиент.ВыгрузитьШаблоныПроформ(ДанныеДляВыгрузки);
		Иначе
			ТекстСообщения = НСтр("ru='Нет данных для выгрузки.';
								  |en='There is no data to upload.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодготовитьДанныеДляВыгрузки(Знач МассивСтрок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка
	|ИЗ
	|	Справочник.бит_ВидыФормСбораДанных КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В(&Список)
	|	И НЕ Таблица.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Список", МассивСтрок);
	
	РезультатЗапроса 	   = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивВидовПроформ     = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивВидовПроформ.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
		
	ДанныеДляВыгрузки = Справочники.бит_ВидыФормСбораДанных.ПодготовитьДанныеДляВыгрузкиШаблона(МассивВидовПроформ);
	
	Возврат ДанныеДляВыгрузки;
	
КонецФункции

#КонецОбласти