
&ИзменениеИКонтроль("ОписаниеДанныхПозицииВХранилище")
Функция бит_ОписаниеДанныхПозицииВХранилище(Форма, Объект, ИдентификаторСтрокиТекущейПозиции, ДатаВступленияВСилу, ПодразделениеПозиций, ВыборПодчиненныхПодразделений)

	Форма.ИдентификаторРедактируемойСтроки = ИдентификаторСтрокиТекущейПозиции;

	ДанныеПозиции = Объект.Позиции.НайтиПоИдентификатору(Форма.ИдентификаторРедактируемойСтроки);

	ОписаниеПозиции = УправлениеШтатнымРасписанием.ОписаниеПозицииШтатногоРасписания();
	ОписаниеПозиции.Вставить("Действие");
	ОписаниеПозиции.Вставить("ТекущееКоличествоСтавок");
	ОписаниеПозиции.Вставить("ТекущийФОТ");
	ОписаниеПозиции.Вставить("КатегорияПерсонала");
	
	#Вставка
	ОписаниеПозиции.Вставить("бит_ВыплачиваетсяПремияЗаМногостаночноеОбслуживание", ДанныеПозиции.бит_ВыплачиваетсяПремияЗаМногостаночноеОбслуживание);
	ОписаниеПозиции.Вставить("бит_ВыплачиваетсяПремияЗаСложностьОборудования", ДанныеПозиции.бит_ВыплачиваетсяПремияЗаСложностьОборудования);
	#КонецВставки
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ТарификационнаяОтчетностьУчрежденийФМБА") Тогда
		ОписаниеПозиции.Вставить("ТарификационнаяГруппа");
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ОписаниеПозиции, ДанныеПозиции);

	ОписаниеПозиции.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр ИЛИ ДанныеПозиции.Действие = Перечисления.ДействияСПозициямиШтатногоРасписания.ЗакрытьПозицию);
	ОписаниеПозиции.Вставить("ДатаУтверждения", ДатаВступленияВСилу);
	Если Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьИсториюИзмененияШтатногоРасписания") Тогда
		ОписаниеПозиции.Вставить("Регистратор", Объект.Ссылка);
	КонецЕсли;
	ОписаниеПозиции.Вставить("ПодразделениеПозиций", ПодразделениеПозиций);
	Если ВыборПодчиненныхПодразделений Тогда
		ОписаниеПозиции.Вставить("ВыборПодчиненныхПодразделений", Истина);
	КонецЕсли; 

	ОписаниеПозиции.Организация = Объект.Организация;
	ОписаниеПозиции.ПозицияШтатногоРасписания = ДанныеПозиции.Позиция;

	ФОИспользоватьВилкуСтавокВШтатномРасписании = Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьВилкуСтавокВШтатномРасписании");

	// Начисления с показателями
	НачисленияПозиции = Объект.Начисления.Выгрузить(Новый Структура("ИдентификаторСтрокиПозиции", ДанныеПозиции.ИдентификаторСтрокиПозиции));
	ОписаниеПозиции.Начисления = НачисленияПозиции;

	// Показатели и коэффициенты.
	ПоказателиПозиции = Объект.Показатели.Выгрузить(Новый Структура("ИдентификаторСтрокиПозиции", ДанныеПозиции.ИдентификаторСтрокиПозиции));

	ОписаниеПозиции.Вставить("Показатели", ПоказателиПозиции);

	// Ежегодные отпуска
	ЕжегодныеОтпускаПозиции = Объект.ЕжегодныеОтпуска.Выгрузить(Новый Структура("ИдентификаторСтрокиПозиции", ДанныеПозиции.ИдентификаторСтрокиПозиции));
	ОписаниеПозиции.ЕжегодныеОтпуска = ЕжегодныеОтпускаПозиции;

	// Специальности
	СпециальностиПозиции = Объект.Специальности.Выгрузить(Новый Структура("ИдентификаторСтрокиПозиции", ДанныеПозиции.ИдентификаторСтрокиПозиции));
	ОписаниеПозиции.Специальности = СпециальностиПозиции;

	ОписаниеДанныхПозицииВХранилище = Новый Структура;
	ОписаниеДанныхПозицииВХранилище.Вставить("Ключ", ОписаниеПозиции.ПозицияШтатногоРасписания);
	ОписаниеДанныхПозицииВХранилище.Вставить("АдресДанныхПозицииВХранилище", ПоместитьВоВременноеХранилище(ОписаниеПозиции, Форма.УникальныйИдентификатор));

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		МодульУправленческаяЗарплатаФормы = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплатаФормы");
		МодульУправленческаяЗарплатаФормы.ДополнитьОписаниеДанныхПозицииВХранилище(Объект, ОписаниеПозиции, ДанныеПозиции);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ХарактеристикиПерсонала") Тогда
		МодульХарактеристикиПерсоналаФормы = ОбщегоНазначения.ОбщийМодуль("ХарактеристикиПерсоналаФормы");
		МодульХарактеристикиПерсоналаФормы.ПоместитьХарактеристикиПерсоналаВОписаниеПозиции(Форма, ОписаниеПозиции, ДанныеПозиции);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ЛьготыСотрудников") Тогда
		МодульЛьготыСотрудников = ОбщегоНазначения.ОбщийМодуль("ЛьготыСотрудников");
		МодульЛьготыСотрудников.ПоместитьЛьготыВОписаниеПозиции(Форма, ОписаниеПозиции, ДанныеПозиции);
	КонецЕсли;

	Возврат ОписаниеДанныхПозицииВХранилище;

КонецФункции
