#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Функция определяет данный вид ИБ описывает внешнюю базу или нет.
// 
// Параметры:
//  ВидИБ - ПеречислениеСсылка.бит_мпд_ВидыИнформационныхБаз.
// 
// Возвращаемое значение:
//  Внешняя - Булево.
// 
Функция ЭтоВнешняяБаза(ВидИБ) Экспорт
    
    Внешняя = ВидИБ.РасположениеДанных = Перечисления.бит_мпд_ВидыРасположенияДанных.ВнешняяИнформационнаяБаза;
    
    Возврат Внешняя;
    
КонецФункции
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти = Неопределено) Экспорт
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ТекущаяИнформационнаяБаза";
	Элемент.Наименование			  = НСтр("ru = 'Текущая информационная база'; en = 'Current information base'", КодОсновногоЯзыка);
	Элемент.Код						  = "000000001";
	Элемент.РасположениеДанных		  = Перечисления.бит_мпд_ВидыРасположенияДанных.ТекущаяИнформационнаяБаза;
	
КонецПроцедуры
	
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт

	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли	
