#Область ОписаниеПеременных

&НаКлиенте
Перем ИдетФормированиеОтчета;

&НаКлиенте
Перем ПоследнееВыделение;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборМетаданных = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "ОтборМетаданных");
	ГруппироватьМетаданныеПоКоллекциям = Истина;
	ОтборИсключитьНедоступныхПользователей = Истина;
	
	Если Параметры.Свойство("ОтборПравДоступа") Тогда
		ОтборПравДоступа = Параметры.ОтборПравДоступа;
	Иначе
		ОтборПравДоступа = ИТК_АнализПравДоступаПовтИсп.ВсеПраваДоступаКромеИсторииДанных();
	КонецЕсли;
	
	СформироватьПриОткрытии = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "СформироватьПриОткрытии");
	
	ОбновитьЭлементыФормыПриСозданииНаСервере();
	
	ИТК_Настройки.ИнициализироватьФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИТК_ОбщийКлиент.ОбработчикПриОткрытии(Отказ);
	
	ИдетФормированиеОтчета = Ложь;

	Если СформироватьПриОткрытии Тогда
		ОбновитьОтчет();
	КонецЕсли;
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ИТК_НастройкиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТабличныйДокументРезультатПриАктивизацииОбласти(Элемент)
	
	ОформитьАктивнуюОбластьВРезультате(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	//ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);
	//ПоляРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМетаданныхПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	ДополнительныеПараметрыОповещения = Новый Структура;
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("НастройкаОтбораМетаданныхЗавершена", ЭтотОбъект, ДополнительныеПараметрыОповещения);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Исключаемые", "Перечисления,Последовательности,ХранилищаНастроек");
	
	ИТК_ФормаКлиент.ОткрытьРедактированиеТипаЗначения(ЭтотОбъект, Неопределено, ИТК_Перечисления.РежимРедактированияТипаЗначенияОтборМетаданных(),
														ОтборМетаданных, ОписаниеОповещенияЗавершение, СтандартнаяОбработка, ДополнительныеПараметры);
														
КонецПроцедуры

&НаКлиенте
Процедура ОтборРолиПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВыборРолейЗавершен", ЭтотОбъект);
	ИТК_ФормаКлиент.ОткрытьВыборРолей(ЭтотОбъект, ОтборРолей, ОписаниеОповещенияЗавершение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПользователейПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВыборПользователейЗавершен", ЭтотОбъект);
	ИТК_ФормаКлиент.ОткрытьВыборПользователей(ЭтотОбъект, ОтборПользователей, ОписаниеОповещенияЗавершение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПравДоступаПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВыборПравДоступаЗавершен", ЭтотОбъект);
	ИТК_ФормаКлиент.ОткрытьВыборПравДоступа(ЭтотОбъект, ОтборПравДоступа, ОписаниеОповещенияЗавершение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеКолонокПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеКолонкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГруппировкиСтрок

&НаКлиенте
Процедура ГруппировкиСтрокПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГруппировкиСтрок.ТекущиеДанные;
	
	Если ТекущиеДанные.Пометка = Ложь
			И ИТК_ФормаКлиент.КоличествоПомеченныхВКоллекции(ГруппировкиСтрок) = 0 Тогда
			
		ТекущийЭлементСписка = ГруппировкиСтрок.НайтиПоЗначению(ТекущиеДанные.Значение);
		ТекущийЭлементСписка.Пометка = Истина;
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкиСтрокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкиСтрокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтрокаПриемник = ГруппировкиСтрок.НайтиПоИдентификатору(Строка);
	СтрокаИсточник = ГруппировкиСтрок.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
	
	ИндексПриемника = ГруппировкиСтрок.Индекс(СтрокаПриемник);
	ИндексИсточника = ГруппировкиСтрок.Индекс(СтрокаИсточник);
	
	ГруппировкиСтрок.Сдвинуть(СтрокаИсточник, ИндексПриемника - ИндексИсточника);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОбновитьОтчет();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	Элемент = Элементы.ФормаНастройки;
	Элемент.Пометка = НЕ Элемент.Пометка;
	
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтборМетаданных(Команда)
	
	ОтборМетаданных = Неопределено;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтборРолей(Команда)
	
	ОтборРолей = Неопределено;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтборПользователей(Команда)
	
	ОтборПользователей = Неопределено;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтборПравДоступа(Команда)
	
	ОтборПравДоступа = Неопределено;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкиСтрокПереместитьВверх(Команда)
	
	СдвинутьЭлементСписка("ГруппировкиСтрок", -1);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкиСтрокПереместитьВниз(Команда)
	
	СдвинутьЭлементСписка("ГруппировкиСтрок", +1);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ИдетФормированиеОтчетаТабличныйДокумент.Видимость = ИдетФормированиеОтчета;
	Элементы.ТабличныйДокументРезультат.Видимость = НЕ ИдетФормированиеОтчета;
	
	ОбновитьОтображениеОтбора("ОтборМетаданных", "Метаданные");
	Элементы.ГруппироватьМетаданныеПоКоллекциям.Доступность = ПолеИспользуетсяВОтчете("Метаданные");
	
	ОбновитьОтображениеОтбора("ОтборРолей", "Роль");
	ОбновитьОтображениеОтбора("ОтборПользователей", "Пользователь");
	
	ОбновитьОтображениеОтбора("ОтборПравДоступа", "ПравоДоступа");
	Элементы.ОтображатьНеустановленныеПраваДоступа.Доступность = ПолеИспользуетсяВОтчете("ПравоДоступа");

	Элементы.ГруппаНастройки.Видимость = Элементы.ФормаНастройки.Пометка;
	
	ЗаполнитьОшибкиНастроекОтчета();
	
	ОшибкиНастроекОтчета = ИТК_ФормаКлиент.ОшибкиНастроекОтчетаСписок(ЭтотОбъект);
	КоличествоВажныхОшибок = ИТК_ФормаКлиент.КоличествоПомеченныхВКоллекции(ОшибкиНастроекОтчета);
	Элементы.ФормаСформировать.Доступность = (КоличествоВажныхОшибок = 0);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормыПриСозданииНаСервере()
	
	Элементы.ФормаНастройки.Пометка = Истина;
	ИТК_Форма.ОшибкиНастроекОтчетаИнициализировать(ЭтотОбъект, Элементы.ГруппаОшибкиНастроек);
	
	ЗаполнениеДоступныхГруппировокИПолейОтчета();
	ПолеКолонок = "ПравоДоступа";

КонецПроцедуры

&НаСервере
Процедура ЗаполнениеДоступныхГруппировокИПолейОтчета()
	
	ПоляОтчета = Новый ТаблицаЗначений;
	ПоляОтчета.Колонки.Добавить("Имя", ИТК_ТипыКлиентСервер.ОписаниеИмяМетаданных());
	ПоляОтчета.Колонки.Добавить("Группировка", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	ПоляОтчета.Колонки.Добавить("ГруппировкаПорядок", ИТК_ТипыКлиентСервер.ОписаниеЧисло(10));
	ПоляОтчета.Колонки.Добавить("ПолеКолонок", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	ПоляОтчета.Колонки.Добавить("ПолеКолонокПорядок", ИТК_ТипыКлиентСервер.ОписаниеЧисло(10));
	ПоляОтчета.Колонки.Добавить("ИспользуетсяПоУмолчанию", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	ПоляОтчета.Колонки.Добавить("ИспользуетсяВБСП", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	
	НовоеПоле = ПоляОтчета.Добавить();
	НовоеПоле.Имя = "Метаданные";
	НовоеПоле.Группировка = Истина;
	НовоеПоле.ГруппировкаПорядок = 10;
	НовоеПоле.ИспользуетсяПоУмолчанию = Истина;
	
	НовоеПоле = ПоляОтчета.Добавить();
	НовоеПоле.Имя = "ПрофильГруппДоступа";
	НовоеПоле.ИспользуетсяВБСП = Истина;
	НовоеПоле.Группировка = Истина;
	НовоеПоле.ГруппировкаПорядок = 20;
	НовоеПоле.ПолеКолонок = Истина;
	НовоеПоле.ПолеКолонокПорядок = 20;
	
	НовоеПоле = ПоляОтчета.Добавить();
	НовоеПоле.Имя = "Роль";
	НовоеПоле.Группировка = Истина;
	НовоеПоле.ГруппировкаПорядок = 30;
	НовоеПоле.ПолеКолонок = Истина;
	НовоеПоле.ПолеКолонокПорядок = 30;
	НовоеПоле.ИспользуетсяПоУмолчанию = Истина;
	
	НовоеПоле = ПоляОтчета.Добавить();
	НовоеПоле.Имя = "ГруппаПользователей";
	НовоеПоле.ИспользуетсяВБСП = Истина;
	НовоеПоле.Группировка = Истина;
	НовоеПоле.ГруппировкаПорядок = 40;
	НовоеПоле.ПолеКолонок = Истина;
	НовоеПоле.ПолеКолонокПорядок = 40;
	
	НовоеПоле = ПоляОтчета.Добавить();
	НовоеПоле.Имя = "ГруппаДоступа";
	НовоеПоле.ИспользуетсяВБСП = Истина;
	НовоеПоле.Группировка = Истина;
	НовоеПоле.ГруппировкаПорядок = 50;
	НовоеПоле.ПолеКолонок = Истина;
	НовоеПоле.ПолеКолонокПорядок = 50;
	
	НовоеПоле = ПоляОтчета.Добавить();
	НовоеПоле.Имя = "Пользователь";
	НовоеПоле.Группировка = Истина;
	НовоеПоле.ГруппировкаПорядок = 60;
	НовоеПоле.ПолеКолонок = Истина;
	НовоеПоле.ПолеКолонокПорядок = 60;
	
	НовоеПоле = ПоляОтчета.Добавить();
	НовоеПоле.Имя = "ПравоДоступа";
	НовоеПоле.Группировка = Истина;
	НовоеПоле.ГруппировкаПорядок = 70;
	НовоеПоле.ПолеКолонок = Истина;
	НовоеПоле.ПолеКолонокПорядок = 10;
	
	ДобавитьДоступныеПоляОтчетаВСписок(ПоляОтчета, ГруппировкиСтрок, "Группировка");
	ДобавитьДоступныеПоляОтчетаВСписок(ПоляОтчета, Элементы.ПолеКолонок.СписокВыбора, "ПолеКолонок");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДоступныеПоляОтчетаВСписок(ПоляОтчета, Список, ПолеПризнак)
	
	ПоляОтчета.Сортировать(ПолеПризнак + "Порядок");
	
	Для Каждого Поле Из ПоляОтчета Цикл 
		
		//Если НЕ Поле[ПолеПризнак]
		//		ИЛИ (Поле.ИспользуетсяВБСП 
		//				И НЕ ИТК_БСПКлиентСервер.ИспользуетсяБСП()) Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Если Поле.ИспользуетсяВБСП Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = Поле.Имя;
		ПредставлениеПоля = ИТК_АнализПравДоступаКлиентСервер.ПредставлениеПоляОтчета(ИмяПоля);
		Список.Добавить(ИмяПоля, ПредставлениеПоля, Поле.ИспользуетсяПоУмолчанию); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтбораМетаданныхЗавершена(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборМетаданных = Результат;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРолейЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборРолей = Результат;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПравДоступаЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПравДоступа = Результат;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПользователейЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПользователей = Результат;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьЭлементСписка(ИмяСписка, Смещение)
	
	Список = ЭтотОбъект[ИмяСписка];
	ИдентификаторТекущейСтроки = Элементы[ИмяСписка].ТекущаяСтрока;

	ЭлементСписка = Список.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	
	Если Смещение = -1 Тогда
		Граница = 0;
	Иначе 
		Граница = Список.Количество() - 1;
	КонецЕсли;
	
	Если Список.Индекс(ЭлементСписка) = Граница Тогда
		Возврат;
	КонецЕсли;
	
	Список.Сдвинуть(ЭлементСписка, Смещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтчет()

	ПоследнееВыделение = Неопределено;
	ИдетФормированиеОтчета = Истина;
	ИТК_ФормаКлиентСервер.ОтображениеСостоянияТабличногоДокумента(Элементы.ИдетФормированиеОтчетаТабличныйДокумент, НСтр("ru = 'Формирование отчета...';
																														|en = 'Report generation...'"));
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ОтборМетаданных", ОтборМетаданных);
	ПараметрыОперации.Вставить("ОтборРолей", ОтборРолей);
	ПараметрыОперации.Вставить("ОтборПользователей", ОтборПользователей);
	ПараметрыОперации.Вставить("ОтборПользователейИсключитьНедоступных", ОтборИсключитьНедоступныхПользователей);
	ПараметрыОперации.Вставить("ОтборПравДоступа", ОтборПравДоступа);
	ПараметрыОперации.Вставить("ПолеКолонок", ПолеКолонок);
	
	ИспользуемыеГруппировкиСтрок = Новый СписокЗначений;
	Для Каждого ЭлементСпискГруппировка Из ГруппировкиСтрок Цикл 
		
		Если НЕ ЭлементСпискГруппировка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ИспользуемыеГруппировкиСтрок.Добавить(ЭлементСпискГруппировка.Значение, ЭлементСпискГруппировка.Представление);
		
	КонецЦикла;
	ПараметрыОперации.Вставить("ГруппировкиСтрок", ИспользуемыеГруппировкиСтрок);
	ПараметрыОперации.Вставить("ГруппироватьМетаданныеПоКоллекциям", ГруппироватьМетаданныеПоКоллекциям);
	
	ПараметрыОперации.Вставить("ОтображатьНеустановленныеПраваДоступа", ОтображатьНеустановленныеПраваДоступа);
	
	ДлительнаяОперация = ОбновитьОтчетНаСервере(ПараметрыОперации, УникальныйИдентификатор);
	
	ОписаниеОперации = Новый Структура;
	ОписаниеОперации.Вставить("Источник", ИТК_Перечисления.ИнструментАнализПравДоступа());
	ОписаниеОперации.Вставить("Наименование", НСтр("ru = 'Анализ прав доступа';
													|en = 'Access rights analysis'"));
	
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОбработкаПрогрессаВыполнения", ЭтотОбъект);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеОтчета", ЭтотОбъект);
	ИТК_ОбработкаОбъектовКлиент.ИнициализацияДлительнойОперации(ЭтотОбъект, ДлительнаяОперация, ОписаниеОперации, ОповещениеОПрогрессеВыполнения, ОповещениеОЗавершении);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьОтчетНаСервере(ПараметрыОперации, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_АнализПравДоступа.ДанныеОтчета", ПараметрыОперации, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаПрогрессаВыполнения(Результат, ДополнительныеПараметры) Экспорт
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьПрогрессВыполнения(Результат);
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;

	Прогресс = Результат.Прогресс;
	Если НЕ ЗначениеЗаполнено(Прогресс) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСостояния = СтрШаблон("%1%% %2", Прогресс.Процент, Прогресс.Текст);
	ИТК_ФормаКлиентСервер.ОтображениеСостоянияТабличногоДокумента(Элементы.ИдетФормированиеОтчетаТабличныйДокумент, ТекстСостояния);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершеноОбновлениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Элементы.ФормаНастройки.Пометка = Ложь;
		ОбновитьДанныеОтчетаСервер(Результат.АдресРезультата);
		
		ОформитьАктивнуюОбластьВРезультате(Элементы.ТабличныйДокументРезультат);
		
	КонецЕсли;
	
	ИдетФормированиеОтчета = Ложь;
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеОтчетаСервер(АдресРезультата)
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ТабличныйДокументРезультат = РезультатВыполнения.ДокументРезультат;
	АдресДанныхРасшифровки = ИТК_ВременноеХранилище.Поместить(РезультатВыполнения.ДанныеРасшифровки, АдресДанныхРасшифровки, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеОтбора(ИмяЗначенияОтбора, ПолеОтбора)
	
	Отбор = ЭтотОбъект[ИмяЗначенияОтбора];
	ИмяОтборПредставление = ИмяЗначенияОтбора + "Представление";
	
	ЭлементОтборПредставление = Элементы[ИмяОтборПредставление];
	ВыделитьШрифтомЗаголовкаВключенныйОтбор(ЭлементОтборПредставление, Отбор);
	
	Если ПолеОтбора = "ПравоДоступа" Тогда
		ПредставлениеОтбора = ИТК_АнализПравДоступаКлиентСервер.ПредставлениеВыбранныхПравДоступа(Отбор);
	Иначе
		ПредставлениеОтбора = ИТК_ФормаКлиентСервер.ПредставлениеСписка(Отбор, 80);
	КонецЕсли;	
	ЭтотОбъект[ИмяОтборПредставление] = ПредставлениеОтбора;
	
	Элементы["Отключить" + ИмяЗначенияОтбора].Видимость = ЗначениеЗаполнено(Отбор);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьШрифтомЗаголовкаВключенныйОтбор(Элемент, Отбор)
	
	ШрифтЗаголовка = Новый Шрифт;
	Если ЗначениеЗаполнено(Отбор) Тогда
		ШрифтЗаголовка = ИТК_ОбщийКлиентСервер.ШрифтЖирный();
	КонецЕсли;
	Элемент.ШрифтЗаголовка = ШрифтЗаголовка;
	
КонецПроцедуры

&НаКлиенте
Функция ПолеИспользуетсяВОтчете(Поле)
	
	Если ПолеКолонок = Поле Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЭлементГруппировки = ГруппировкиСтрок.НайтиПоЗначению(Поле);
	Если ЭлементГруппировки <> Неопределено Тогда

		Если ЭлементГруппировки.Пометка Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НЕ НесколькоЗначенийВОтборе(Поле);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОшибкиНастроекОтчета()
	
	ИТК_ФормаКлиент.ОшибкиНастроекОтчетаОчистить(ЭтотОбъект);
	
	НайденныйЭлементГруппировкиСтрок = ГруппировкиСтрок.НайтиПоЗначению(ПолеКолонок);
	Если НайденныйЭлементГруппировкиСтрок <> Неопределено
			И НайденныйЭлементГруппировкиСтрок.Пометка Тогда
			
		ШаблонОшибки = НСтр("ru = 'Поле %1 дублируется в строках и колонках';
							|en = 'Field %1 is duplicated in rows and columns'");
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ПолеКолонок);
		ИТК_ФормаКлиент.ОшибкиНастроекОтчетаДобавить(ЭтотОбъект, ТекстОшибки, БиблиотекаКартинок.ИТК_ПредупреждениеВажное, Истина);
		
	КонецЕсли;
	
	Для Каждого ЭлементГруппировка Из ГруппировкиСтрок Цикл 
		
		Поле = ЭлементГруппировка.Значение;
		ПредставлениеПоля = ЭлементГруппировка.Представление;
		
		Если НЕ ПолеИспользуетсяВОтчете(Поле)
				И ЗаданыЗначенияОтбора(Поле)
				И НесколькоЗначенийВОтборе(Поле) Тогда
				
			ШаблонТекстаОшибки = НСтр("ru = 'Выбрано несколько значений отбора, необходимо включить использование группировки %1';
										|en = 'Multiple filter values selected, use grouping %1 must be enabled'");
			ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ПредставлениеПоля);
			ИТК_ФормаКлиент.ОшибкиНастроекОтчетаДобавить(ЭтотОбъект, ТекстОшибки, БиблиотекаКартинок.ИТК_ПредупреждениеВажное, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПолеИспользуетсяВОтчете("Метаданные")
			ИЛИ ПолеИспользуетсяВОтчете("ПравоДоступа") Тогда
			
		Если НЕ (ПолеИспользуетсяВОтчете("Метаданные")
				И ПолеИспользуетсяВОтчете("ПравоДоступа")
				И (ПолеИспользуетсяВОтчете("Роль")
					ИЛИ ПолеИспользуетсяВОтчете("Пользователь"))) Тогда
				
			ТекстОшибки = НСтр("ru = 'Для построения отчета по метаданнным требуются поля Метаданные, Право доступа и Роль / Пользователь';
								|en = 'To build a report on metadata, the fields Metadata, Access right and Role / User are required'");
			ИТК_ФормаКлиент.ОшибкиНастроекОтчетаДобавить(ЭтотОбъект, ТекстОшибки, БиблиотекаКартинок.ИТК_ПредупреждениеВажное, Истина);
			
		КонецЕсли;
		
	КонецЕсли;

	Если ПолеИспользуетсяВОтчете("Метаданные")
			И НЕ ЗначениеЗаполнено(ОтборМетаданных) Тогда
			
		ТекстОшибки = НСтр("ru = 'Отбор метаданных не установлен формирование отчета может занять много времени';
							|en = 'The selection of metadata is not set. Generation of the report can take a long time'");
		ИТК_ФормаКлиент.ОшибкиНастроекОтчетаДобавить(ЭтотОбъект, ТекстОшибки, БиблиотекаКартинок.ИТК_Предупреждение);
		
	КонецЕсли;
	
	ИТК_ФормаКлиент.ОшибкиНастроекОтчетаОбновитьОтображение(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция НесколькоЗначенийВОтборе(Поле)
	
	ОтборПоля = ЗначениеОтбораПоля(Поле);
	
	Если ТипЗнч(ОтборПоля) = Тип("СписокЗначений") Тогда
		ОдноЗначениеВОтборе = (ОтборПоля.Количество() = 1);
	Иначе
		
		ЭлементыОтбора = СтрРазделить(ОтборПоля, ", ");
		
		ОдноЗначениеВОтборе = (ЭлементыОтбора.Количество() = 1)
						И СтрНайти(ЭлементыОтбора[0], ".");
		
	КонецЕсли;
	
	Возврат НЕ ОдноЗначениеВОтборе;
	
КонецФункции

&НаКлиенте
Функция ЗначениеОтбораПоля(Поле)
	
	Если Поле = "Метаданные" Тогда
		ОтборПоля = ОтборМетаданных;
	ИначеЕсли Поле = "Роль" Тогда
		ОтборПоля = ОтборРолей;
	ИначеЕсли Поле = "Пользователь" Тогда
		ОтборПоля = ОтборПользователей;
	ИначеЕсли Поле = "ПравоДоступа" Тогда
		ОтборПоля = ОтборПравДоступа;
	Иначе
		ОтборПоля = Неопределено;
	КонецЕсли;
	
	Возврат ОтборПоля;
	
КонецФункции

&НаКлиенте
Функция ЗаданыЗначенияОтбора(Поле)
	
	ОтборПоля = ЗначениеОтбораПоля(Поле);
	Возврат ЗначениеЗаполнено(ОтборПоля);
	
КонецФункции

&НаКлиенте
Процедура ОформитьАктивнуюОбластьВРезультате(Элемент)
	
	ВосстановитьФонПредудущихОбластей();
	
	// Вычисление строки с которой начинается таблица
	СтрокаНачалаТаблицы = 0;
	Для НомерСтроки = 1 По ТабличныйДокументРезультат.ВысотаТаблицы Цикл
		
		Если ТабличныйДокументРезультат.Область(НомерСтроки, 1).ГраницаСверху.ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Сплошная Тогда
			
			СтрокаНачалаТаблицы = НомерСтроки;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрокаНачалаТаблицы = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Оформление и запоминание новой области
	ТекущаяОбласть = Элемент.ТекущаяОбласть;
	ОформлятьСтроку = (ТекущаяОбласть.Низ = ТекущаяОбласть.Верх)
						И ТекущаяОбласть.Низ > СтрокаНачалаТаблицы;
	ОформлятьСтолбец = (ТекущаяОбласть.Лево = ТекущаяОбласть.Право)
						И ТекущаяОбласть.Лево > 1
						И ТекущаяОбласть.Низ > СтрокаНачалаТаблицы;
						
	ЦветФона = WebЦвета.СветлоЗолотистый;

	ТекущаяСтрока = ТекущаяОбласть.Низ;
	ТекущаяКолонка = ТекущаяОбласть.Лево;
	
	ПоследнееВыделение = Новый Соответствие;
	
	// Строка
	Если ОформлятьСтроку Тогда
		
		Для НомерКолонки = 1 По ТабличныйДокументРезультат.ШиринаТаблицы Цикл 
			ЗапомнитьФонОбласти(ТекущаяСтрока, НомерКолонки, ЦветФона);
		КонецЦикла;
		
		Область = ТабличныйДокументРезультат.Область(ТекущаяСтрока, 1, ТекущаяСтрока, ТабличныйДокументРезультат.ШиринаТаблицы);
		Область.ЦветФона = ЦветФона;
		
	КонецЕсли;
	
	// Столбец
	Если ОформлятьСтолбец Тогда
		
		Для НомерСтроки = СтрокаНачалаТаблицы По ТабличныйДокументРезультат.ВысотаТаблицы Цикл
			ЗапомнитьФонОбласти(НомерСтроки, ТекущаяКолонка, ЦветФона);
		КонецЦикла;
		
		Область = ТабличныйДокументРезультат.Область(СтрокаНачалаТаблицы, ТекущаяКолонка, ТабличныйДокументРезультат.ВысотаТаблицы, ТекущаяКолонка);
		Область.ЦветФона = ЦветФона;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьФонПредудущихОбластей()

	Если ПоследнееВыделение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИмяОбластиЦвет Из ПоследнееВыделение Цикл 
		
		Область = ТабличныйДокументРезультат.Область(ИмяОбластиЦвет.Ключ);
		Область.ЦветФона = ИмяОбластиЦвет.Значение;
		
	КонецЦикла;

КонецПроцедуры

//&НаКлиенте
//Процедура ИзменитьФонОбласти(НомерСтроки, НомерКолонки, ЦветФона)

//	Область = ТабличныйДокументРезультат.Область(НомерСтроки, НомерКолонки);
//	Если ПоследнееВыделение.Получить(Область.Имя) = Неопределено Тогда
//		
//		ПоследнееВыделение.Вставить(Область.Имя, Область.ЦветФона);
//		Область.ЦветФона = ЦветФона;
//		
//	КонецЕсли;

//КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьФонОбласти(НомерСтроки, НомерКолонки, ЦветФона)

	Область = ТабличныйДокументРезультат.Область(НомерСтроки, НомерКолонки);
	Если ПоследнееВыделение.Получить(Область.Имя) = Неопределено Тогда
		ПоследнееВыделение.Вставить(Область.Имя, Область.ЦветФона);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
