
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Система = Новый СистемнаяИнформация;
	
	Продукт 		= Метаданные.Синоним;
	НомерРелиза 	= бит_ОбщегоНазначения.МетаданныеВерсия();
	ВерсияПлатформы = Система.ВерсияПриложения;
	Отправитель 	= Пользователи.ТекущийПользователь();
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Режим = НСтр("ru='Режим: Файловая';en='Mode: File'");
	Иначе	
		Режим = НСтр("ru='Режим: Серверная';en='Mode: Server'");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)

	ОчиститьСообщения();
	УспешныйВвод = Истина;
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Информация Тогда
		
		Если Не ЗначениеЗаполнено(РегистрационныйНомер) Тогда
			ТекстСообщения = НСтр("ru='Не заполнен регистрационный номер БИТ.ФИНАНС.';
								  |en='Do not fill in the registration number BIT.FINANS.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "РегистрационныйНомер");
			УспешныйВвод = Ложь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Организация) Тогда
			ТекстСообщения = НСтр("ru='Не заполнено название организации, на которую зарегистрирована программа.';
								  |en='Not filled name of the organization to which the program is recorded.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Организация");
			УспешныйВвод = Ложь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Продукт) Тогда
			ТекстСообщения = НСтр("ru='Не заполнено название продукта.';en='Not filled with the product name.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Продукт");
			УспешныйВвод = Ложь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НомерРелиза) Тогда
			ТекстСообщения = НСтр("ru='Не заполнен номер релиза.';en='Not full release number.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "НомерРелиза");
			УспешныйВвод = Ложь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВерсияПлатформы) Тогда
			ТекстСообщения = НСтр("ru='Не заполнена версия платформы.';en='Not full platform version.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ВерсияПлатформы");
			УспешныйВвод = Ложь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Отправитель) Тогда
			ТекстСообщения = НСтр("ru='Не заполнен Отправитель.';en='The sender is empty.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Отправитель");
			УспешныйВвод = Ложь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПочтаОтправителя) Тогда
			ТекстСообщения = НСтр("ru='Не заполнен Email отправителя.';en='Email Sender is empty.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ПочтаОтправителя");
			УспешныйВвод = Ложь;
		КонецЕсли;
		Если УспешныйВвод Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.Обращение;
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.Обращение Тогда
		Если Не ЗначениеЗаполнено(ТемаОбращения) Тогда
			ТекстСообщения = НСтр("ru='Не заполнена тема обращения.';en='Not full treatment topic.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ТемаОбращения");
			УспешныйВвод = Ложь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекстОбращения) Тогда
			ТекстСообщения = НСтр("ru='Не заполнен текст обращения.';en='Not full text of the address.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ТекстОбращения");
			УспешныйВвод = Ложь;
		КонецЕсли;
		Если УспешныйВвод Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.Отправка;
			СформироватьТекстКОтправке();
		КонецЕсли;
	КонецЕсли;
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Обращение Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.Информация;
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.Обращение;
	КонецЕсли;
	УправлениеВидимостью();

КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьЭП) Тогда
		ТекстСообщения = НСтр("ru='Не выбрана учетная запись электронной почты для отправки письма';
							  |en='Do not select an e-mail account to send a message'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "УчетнаяЗаписьЭП");
		Возврат;
	КонецЕсли;
	
	Результат = ВыполнитьОтправкуСервер();
	Если Результат = "" Тогда
		ПоказатьОповещениеПользователя(НСтр("ru='Письмо отправлено.';en='Letter sent.'"),,, БиблиотекаКартинок.Информация32);
	Иначе
		ПоказатьПредупреждение(Неопределено, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлы(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПрикрепитьФайлыРасширениеПодключено",
		ЭтотОбъект);
	
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыРасширениеПодключено(Результат, ДополнительныеПараметры) Экспорт 
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Диалог.Заголовок = НСтр("ru = 'Файлы для вложения (для выбора нескольких удерживайте клавишу ""Ctrl"")';
												|en = 'Files for attachment (hold down the ""Ctrl"" key to select multiplel)'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрикрепитьФайлыЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ЗагрузитьФайлы(ОписаниеОповещения, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

	Если ПомещенныеФайлы = Неопределено Или ПомещенныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОписаниеФайла Из ПомещенныеФайлы Цикл
		
		Если ОписаниеФайла = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ОписаниеФайла.Хранение) Тогда
			Продолжить;
		КонецЕсли;
		
		Размер = РазмерФайлаВоВременномХранилище(ОписаниеФайла.Хранение);
		ИнформацияОФайле = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ОписаниеФайла.Имя);
		
		ВложенияСтрока = Вложения.Добавить();
		ВложенияСтрока.Ссылка = Неопределено;
		ВложенияСтрока.Представление = ИнформацияОФайле.Имя;
		ВложенияСтрока.ИмяФайла = ИнформацияОФайле.ИмяБезРасширения;
		ВложенияСтрока.ИмяФайлаНаДиске = ОписаниеФайла.Имя;
		ВложенияСтрока.ИндексКартинки = ПолучитьИндексПиктограммыФайла(ИнформацияОФайле.Расширение);
		ВложенияСтрока.Размер = Размер;
		ВложенияСтрока.РазмерПредставление = РазмерСтрокой(Размер);
		ВложенияСтрока.Адрес = ОписаниеФайла.Хранение;
	КонецЦикла;
	
	ОтобразитьКоличествоФайлов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Информация Тогда
		Элементы.СтраницыПодвал.ТекущаяСтраница = Элементы.КомандыИнформация;
		Элементы.ИнформацияДалее.КнопкаПоУмолчанию = Истина;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.Обращение Тогда
		Элементы.СтраницыПодвал.ТекущаяСтраница = Элементы.КомандыОбращение;
		Элементы.ОбращениеДалее.КнопкаПоУмолчанию = Истина;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.Отправка Тогда
		Элементы.СтраницыПодвал.ТекущаяСтраница = Элементы.КомандыОтправка;
		Элементы.Отправить.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТекстКОтправке()

	ИтоговыйТекст = "";
	ИтоговыйТекст = ИтоговыйТекст + НСтр("ru='Регистрационный номер: ';en='Registration number:'") + РегистрационныйНомер + Символы.ПС;
	ИтоговыйТекст = ИтоговыйТекст + НСтр("ru='Компания: ';en='Company:'") + Организация + Символы.ПС;
	ИтоговыйТекст = ИтоговыйТекст + НСтр("ru='Город/регион: ';en='City / Region:'") + Местоположение + Символы.ПС;
	ИтоговыйТекст = ИтоговыйТекст + НСтр("ru='Продукт: ';en='Product:'") + Продукт + Символы.ПС;
	ИтоговыйТекст = ИтоговыйТекст + НСтр("ru='Номер релиза: ';en='Release Number:'") + НомерРелиза + Символы.ПС;
	ИтоговыйТекст = ИтоговыйТекст + НСтр("ru='Версия платформы: ';en='Platform version:'") + ВерсияПлатформы + Символы.ПС;
	ИтоговыйТекст = ИтоговыйТекст + Режим + Символы.ПС;
	
	Если ЗначениеЗаполнено(ТипСубд) Тогда
		ИтоговыйТекст = ИтоговыйТекст + НСтр("ru='Тип СУБД: ';en='Database Type:'") + ТипСубд + Символы.ПС;
	КонецЕсли; 
	Если ЗначениеЗаполнено(ВерсияСубд) Тогда
		ИтоговыйТекст = ИтоговыйТекст + НСтр("ru='Версия СУБД: ';en='The version of DBMS:'") + ВерсияСубд + Символы.ПС;
	КонецЕсли; 

	ИтоговыйТекст = ИтоговыйТекст 
					+ НСтр("ru='Контактные данные: ';en='Contact details:'") 
					+ Отправитель 
					+ НСтр("ru=', ответ прошу прислать на адрес: ';en='answer please send an email to:'")
					+ ПочтаОтправителя + Символы.ПС;
					
	ИтоговыйТекст = ИтоговыйТекст + Символы.ПС;
	
	ИтоговыйТекст = ИтоговыйТекст + НСтр("ru='Добрый день.';en='Good afternoon.'") + Символы.ПС;
	
	ИтоговыйТекст = ИтоговыйТекст + ТекстОбращения + Символы.ПС;
					
КонецПроцедуры

&НаКлиенте
Функция РазмерСтрокой(Размер)
	
	Если Размер = 0 Тогда
		Возврат "-";
	ИначеЕсли Размер < 1024 * 10 Тогда // < 10 Кб
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 Кб';en='%1 KB'"),
			Формат(Макс(1, Окр(Размер / 1024, 1, 1)), "ЧГ=0"));
	ИначеЕсли Размер < 1024 * 1024 Тогда // < 1 Мб
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 Кб';en='%1 KB'"),
			Формат(Цел(Размер / 1024), "ЧГ=0"));
	ИначеЕсли Размер < 1024 * 1024 * 10 Тогда // < 10 Мб
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 Мб';en='%1 MB'"),
			Формат(Окр(Размер / 1024 / 1024, 1, 1), "ЧГ=0"));
	Иначе // >= 10 Мб
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 Мб';en='%1 MB'"),
			Формат(Цел(Размер / 1024 / 1024), "ЧГ=0"));
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИндексПиктограммыФайла(Знач РасширениеФайла)
	
	Если ТипЗнч(РасширениеФайла) <> Тип("Строка")
	 ИЛИ ПустаяСтрока(РасширениеФайла) Тогда
		
		Возврат 0;
	КонецЕсли;
	
	РасширениеФайла = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(РасширениеФайла);
	
	Расширение = "." + НРег(РасширениеФайла) + ";";
	
	Если СтрНайти(".dt;.1cd;.cf;.cfu;", Расширение) <> 0 Тогда
		Возврат 6; // Файлы 1С.
		
	ИначеЕсли Расширение = ".mxl;" Тогда
		Возврат 8; // Табличный Файл.
		
	ИначеЕсли СтрНайти(".txt;.log;.ini;", Расширение) <> 0 Тогда
		Возврат 10; // Текстовый Файл.
		
	ИначеЕсли Расширение = ".epf;" Тогда
		Возврат 12; // Внешние обработки.
		
	ИначеЕсли СтрНайти(".ico;.wmf;.emf;",Расширение) <> 0 Тогда
		Возврат 14; // Картинки.
		
	ИначеЕсли СтрНайти(".htm;.html;.url;.mht;.mhtml;",Расширение) <> 0 Тогда
		Возврат 16; // HTML.
		
	ИначеЕсли СтрНайти(".doc;.dot;.rtf;",Расширение) <> 0 Тогда
		Возврат 18; // Файл Microsoft Word.
		
	ИначеЕсли СтрНайти(".xls;.xlw;",Расширение) <> 0 Тогда
		Возврат 20; // Файл Microsoft Excel.
		
	ИначеЕсли СтрНайти(".ppt;.pps;",Расширение) <> 0 Тогда
		Возврат 22; // Файл Microsoft PowerPoint.
		
	ИначеЕсли СтрНайти(".vsd;",Расширение) <> 0 Тогда
		Возврат 24; // Файл Microsoft Visio.
		
	ИначеЕсли СтрНайти(".mpp;",Расширение) <> 0 Тогда
		Возврат 26; // Файл Microsoft Visio.
		
	ИначеЕсли СтрНайти(".mdb;.adp;.mda;.mde;.ade;",Расширение) <> 0 Тогда
		Возврат 28; // База данных Microsoft Access.
		
	ИначеЕсли СтрНайти(".xml;",Расширение) <> 0 Тогда
		Возврат 30; // xml.
		
	ИначеЕсли СтрНайти(".msg;",Расширение) <> 0 Тогда
		Возврат 32; // Письмо электронной почты.
		
	ИначеЕсли СтрНайти(".zip;.rar;.arj;.cab;.lzh;.ace;",Расширение) <> 0 Тогда
		Возврат 34; // Архивы.
		
	ИначеЕсли СтрНайти(".exe;.com;.bat;.cmd;",Расширение) <> 0 Тогда
		Возврат 36; // Исполняемые файлы.
		
	ИначеЕсли СтрНайти(".grs;",Расширение) <> 0 Тогда
		Возврат 38; // Графическая схема.
		
	ИначеЕсли СтрНайти(".geo;",Расширение) <> 0 Тогда
		Возврат 40; // Географическая схема.
		
	ИначеЕсли СтрНайти(".jpg;.jpeg;.jp2;.jpe;",Расширение) <> 0 Тогда
		Возврат 42; // jpg.
		
	ИначеЕсли СтрНайти(".bmp;.dib;",Расширение) <> 0 Тогда
		Возврат 44; // bmp.
		
	ИначеЕсли СтрНайти(".tif;.tiff;",Расширение) <> 0 Тогда
		Возврат 46; // tif.
		
	ИначеЕсли СтрНайти(".gif;",Расширение) <> 0 Тогда
		Возврат 48; // gif.
		
	ИначеЕсли СтрНайти(".png;",Расширение) <> 0 Тогда
		Возврат 50; // png.
		
	ИначеЕсли СтрНайти(".pdf;",Расширение) <> 0 Тогда
		Возврат 52; // pdf.
		
	ИначеЕсли СтрНайти(".odt;",Расширение) <> 0 Тогда
		Возврат 54; // Open Office writer.
		
	ИначеЕсли СтрНайти(".odf;",Расширение) <> 0 Тогда
		Возврат 56; // Open Office math.
		
	ИначеЕсли СтрНайти(".odp;",Расширение) <> 0 Тогда
		Возврат 58; // Open Office Impress.
		
	ИначеЕсли СтрНайти(".odg;",Расширение) <> 0 Тогда
		Возврат 60; // Open Office draw.
		
	ИначеЕсли СтрНайти(".ods;",Расширение) <> 0 Тогда
		Возврат 62; // Open Office calc.
		
	ИначеЕсли СтрНайти(".mp3;",Расширение) <> 0 Тогда
		Возврат 64;
		
	ИначеЕсли СтрНайти(".erf;",Расширение) <> 0 Тогда
		Возврат 66; // Внешние отчеты.
		
	ИначеЕсли СтрНайти(".docx;",Расширение) <> 0 Тогда
		Возврат 68; // Файл Microsoft Word docx.
		
	ИначеЕсли СтрНайти(".xlsx;",Расширение) <> 0 Тогда
		Возврат 70; // Файл Microsoft Excel xlsx.
		
	ИначеЕсли СтрНайти(".pptx;",Расширение) <> 0 Тогда
		Возврат 72; // Файл Microsoft PowerPoint pptx.
		
	ИначеЕсли СтрНайти(".p7s;",Расширение) <> 0 Тогда
		Возврат 74; // Файл подписи.
		
	ИначеЕсли СтрНайти(".p7m;",Расширение) <> 0 Тогда
		Возврат 76; // зашифрованное сообщение.
	Иначе
		Возврат 4;
	КонецЕсли;
	
КонецФункции

#Область ОтправкаПисьма

&НаКлиенте
Процедура ОтобразитьКоличествоФайлов()
	
	Если Вложения.Количество() > 0 Тогда
		ТекстЗаголовка = НСтр("ru='Прикрепленные файлы (%1)';en='Attachments (%1)'");
		Элементы.ВложенияПредставление.Заголовок = СтрШаблон(ТекстЗаголовка, Вложения.Количество());
	Иначе
		Элементы.ВложенияПредставление.Заголовок = НСтр("ru='Прикрепленные файлы';en='Attached files'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция РазмерФайлаВоВременномХранилище(АдресВременногоХранилищаФайла)
	
	Попытка
		Данные = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаФайла);
	Исключение
		Возврат 0;
	КонецПопытки;
	Если ТипЗнч(Данные) <> Тип("ДвоичныеДанные") Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Данные.Размер();
	
КонецФункции

&НаСервере
Функция ВыполнитьОтправкуСервер()
	
	Попытка
		ИдентификаторПисьма = ВыполнитьОтправкуПисьма();
	Исключение
		Возврат ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат "";
	
КонецФункции

&НаСервере
Функция ВыполнитьОтправкуПисьма()
	
	Адресаты = Новый Массив;
	Адресаты.Добавить(Новый Структура("Адрес,Представление", "kazna@1cbit.ru", "kazna@1cbit.ru"));
	ВложенияПисьма = Новый Массив;
	Для каждого Вложение Из Вложения Цикл
		ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище");
		ОписаниеВложения.Представление				= Вложение.Представление;
		ОписаниеВложения.АдресВоВременномХранилище	= Вложение.Адрес;
		ВложенияПисьма.Добавить(ОписаниеВложения);
	КонецЦикла;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому",		Адресаты);
	ПараметрыПисьма.Вставить("Тема",		ТемаОбращения);
	ПараметрыПисьма.Вставить("Тело",		ИтоговыйТекст);
	ПараметрыПисьма.Вставить("Кодировка",	КодировкаТекста.UTF8);
	ПараметрыПисьма.Вставить("ТипТекста",	Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	ПараметрыПисьма.Вставить("Вложения",	ВложенияПисьма);
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗаписьЭП, ПараметрыПисьма);
	РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗаписьЭП, Письмо);
	
КонецФункции

#КонецОбласти

#КонецОбласти