#Область ПрограммныйИнтерфейс

Процедура ОткрытьПросмотрЛогаЗапросов(УникальныйИдентификаторФормы, Подсистема, АдресДанных = Неопределено) Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	
	Если АдресДанных = Неопределено Тогда
		МодульЛогированияЗапросовВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль(
			СтрШаблон("ЛогированиеЗапросов%1ВызовСервера", Подсистема));
		АдресДанных = МодульЛогированияЗапросовВызовСервера.АдресСодержанияЛоговЗапросов(УникальныйИдентификаторФормы);
		ДополнительныеПараметры.Вставить("АдресДанных", АдресДанных);
	КонецЕсли;
	
	ПараметрыОткрытияФормы = Новый Структура();
	ПараметрыОткрытияФормы.Вставить("АдресДанных", АдресДанных);
	ПараметрыОткрытияФормы.Вставить("Подсистема",  Подсистема);
	
	ОписаниеОповещенияЗакрытиеФормыПросмотраЛогов = Новый ОписаниеОповещения(
		"ОповещениеОбработчикЗакрытиеФормыПросмотраЛогов",
		ЛогированиеЗапросовИСКлиент,
		ДополнительныеПараметры);
	
	ОткрытьФорму(
		"ОбщаяФорма.ФормаПросмотраЛогаЗапросовИС",
		ПараметрыОткрытияФормы,
		УникальныйИдентификаторФормы,,,,
		ОписаниеОповещенияЗакрытиеФормыПросмотраЛогов);
		
КонецПроцедуры

Процедура ОткрытьПросмотрИнформацииОбОкружении(ФормаВладелец, Подсистема) Экспорт
	
	ПараметрыОткрытияФормы = Новый Структура();
	ПараметрыОткрытияФормы.Вставить("ЭтоИнформацияОбОкружении", Истина);
	ПараметрыОткрытияФормы.Вставить("Подсистема",               Подсистема);
	
	ОткрытьФорму(
		"ОбщаяФорма.ФормаПросмотраЛогаЗапросовИС",
		ПараметрыОткрытияФормы,
		ФормаВладелец);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОповещениеОбработчикЗакрытиеФормыПросмотраЛогов(Значение, ДополнительныеПараметры) Экспорт 
	
	Если ДополнительныеПараметры.Свойство("АдресДанных")
		И ЭтоАдресВременногоХранилища(ДополнительныеПараметры.АдресДанных) Тогда
		УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресДанных);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
