
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Режим открытия	
	Перем Режим;
    // Вид информационной базы
    Перем ВидИнформационнойБазы;  
	// Настройка подключения к информационной базе.
	Перем ИнформационнаяБаза;  
	// Имя объекта обмена
	Перем ИмяОбъекта;
	// Вид объекта обмена
	Перем ВидОбъектаСтр;
	
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Параметры.Свойство("Режим", Режим);
	Параметры.Свойство("ВидИнформационнойБазы", ВидИнформационнойБазы);
	Параметры.Свойство("ИнформационнаяБаза", ИнформационнаяБаза);
	Параметры.Свойство("Имя", ИмяОбъекта);
	Параметры.Свойство("Вид", ВидОбъектаСтр);
	
	Если ВРег(Режим) = ВРег("СписокОбъектов") Тогда
	
		Если ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		
			 ВидИнформационнойБазы = ИнформационнаяБаза.ВидИнформационнойБазы;
			 
		 Иначе
			 
			 ИнформационнаяБаза = Справочники.бит_мпд_НастройкиВнешнихПодключений.ПустаяСсылка();
		
		КонецЕсли; 
		
		ВидОбъекта = Перечисления.бит_мдм_ВидыОбъектовОбмена[ВидОбъектаСтр];
		ОписаниеОбъекта = Справочники.бит_мдм_ОписанияОбъектовОбмена.НайтиЭлемент(ВидИнформационнойБазы, ВидОбъекта, ИмяОбъекта);
		
		// Устнавливаем отбор для конкретной базы и описания объекта.
		
		эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		эо.Использование  = Истина;
		эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидИнформационнойБазы");
		эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		эо.ПравоеЗначение = ВидИнформационнойБазы;
		
		эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		эо.Использование  = Истина;
		эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнформационнаяБаза");
		эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		эо.ПравоеЗначение = ИнформационнаяБаза;
		
		эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		эо.Использование  = Истина;
		эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОписаниеОбъекта");
		эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		эо.ПравоеЗначение = ОписаниеОбъекта;
		
		ЭтотОбъект.Заголовок = ОписаниеОбъекта.Наименование;
		
	КонецЕсли;  	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервереБезКонтекста
Процедура КомандаОтправитьНаСервере(МассивОбъектов)
	
	Для каждого ОбъектОбмена Из МассивОбъектов Цикл
	
		бит_мдм_Транспорт.ОтправитьОбъект(ОбъектОбмена);
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправить(Команда)
	
	МассивОбъектов = Элементы.Список.ВыделенныеСтроки;
	
	КомандаОтправитьНаСервере(МассивОбъектов);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти