&Перед("ПриСозданииНаСервере") 
&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	Если Элементы.Найти("бит_ГруппаДополнительныеНастройкиСерий") = Неопределено Тогда
		бит_СоздатьЭлементыБит(); 
	КонецЕсли;
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -  
	
КонецПроцедуры 

&Перед("ПриЧтенииСозданииНаСервере")
&НаСервере
Процедура бит_ПриЧтенииСозданииНаСервереПеред() 
	
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	Если Элементы.Найти("бит_ГруппаДополнительныеНастройкиСерий") = Неопределено Тогда  
		бит_СоздатьЭлементыБит();	
	КонецЕсли;
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -
	
КонецПроцедуры

&НаСервере
Процедура бит_СоздатьЭлементыБит()

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	НоваяГруппа  = Элементы.Добавить("бит_ГруппаДополнительныеНастройкиСерий",Тип("ГруппаФормы"), Элементы.СворачиваемаяГруппаНастройкиСоставаРеквизитовСерий);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Истина; 
	НоваяГруппа.Заголовок = "(бит) Дополнтельно";  
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;  
	//НоваяГруппа.Группировка = ГруппировкаКолонок.Вертикальная;
	
	//(бит) № завеса
	НовыйЭлемент = Элементы.Вставить("бит_ИспользоватьНомерЗавеса", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеНастройкиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ИспользоватьНомерЗавеса";
	
	//(бит) № заказа
	НовыйЭлемент = Элементы.Вставить("бит_ИспользоватьНомерЗаказа", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеНастройкиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ИспользоватьНомерЗаказа";
		
	//(бит) Брутто, кг
	НовыйЭлемент = Элементы.Вставить("бит_ИспользоватьБрутто", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеНастройкиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ИспользоватьБрутто";
			
	//(бит)Тип тары
	НовыйЭлемент = Элементы.Вставить("бит_ИспользоватьТипТары", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеНастройкиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ИспользоватьТипТары";
	
	//(бит) Штрихкод
	НовыйЭлемент = Элементы.Вставить("бит_ИспользоватьШтрихкод", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеНастройкиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ИспользоватьШтрихкод";
    // Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 - 
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [29.11.2025 15:40:05] +        
	НоваяГруппа  = Элементы.Вставить("бит_ГруппаОсновное", Тип("ГруппаФормы"), Элементы.СтраницаОсновное, Элементы.ГруппаОсновноеКолонки);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь; 
	НоваяГруппа.Заголовок = "";  
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;  
	
	Элементы.Переместить(Элементы.Наименование, НоваяГруппа);
	
	НовыйЭлемент = Элементы.Добавить("бит_Код", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Код";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [29.11.2025 15:40:05] -
КонецПроцедуры	

