////////////////////////////////////////////////////////////////////////////////
//
// Учитывает особенности реализации в конфигурации-носителе.
// При обновлении библиотеки переносить только состав процедур и функций без содержимого.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипыОбъектовДляОтображенияОстатков() Экспорт
	
	Возврат бит_МобильноеПриложениеУП.ТипыОбъектовДляОтображенияОстатков();
	
КонецФункции 

Функция ТипыОбъектовДляОтображенияТабличныхЧастей() Экспорт
	
	Возврат бит_МобильноеПриложениеУП.ТипыОбъектовДляОтображенияТабличныхЧастей();
	
КонецФункции 

Функция ПолучитьДанныеФайлаОбъекта(ИмяОбъекта, Идентификатор) Экспорт
	
	Возврат бит_МобильноеПриложениеУП.ПолучитьДанныеФайлаОбъекта(ИмяОбъекта, Идентификатор);
	
КонецФункции

Функция УникальнаяТабличнаяЧасть(Ссылка, ДопАналитики) Экспорт
	
	Возврат бит_МобильноеПриложениеУП.УникальнаяТабличнаяЧасть(Ссылка, ДопАналитики);
	
КонецФункции

Функция НеобходимКомментарийЗадача(Организация, ОбъектСистемы, ВидРешения) Экспорт
	
	Возврат бит_МобильноеПриложениеУП.НеобходимКомментарийЗадача(Организация, ОбъектСистемы, ВидРешения);
	
КонецФункции

Функция ЭтоСправочник(Значение) Экспорт
	
	Возврат бит_МобильноеПриложениеУП.ЭтоСправочник(Значение);
	
КонецФункции

Функция ТипыОбъектов() Экспорт
	
	Возврат бит_МобильноеПриложениеУП.ТипыОбъектов();
	
КонецФункции

Функция ЭтоРеестр(Ссылка) Экспорт
	
	Возврат бит_МобильноеПриложениеУП.ЭтоРеестр(Ссылка);
	
КонецФункции

Функция ЕстьУникальнаяТабличнаяЧасть(Ссылка) Экспорт
	
	Возврат бит_МобильноеПриложениеУП.ЕстьУникальнаяТабличнаяЧасть(Ссылка);
	
КонецФункции

Процедура ДополнитьДанныеОбъекта(ДанныеОбъекта, Источник, ЗапросПлатежнойПозиции = Неопределено, ЭтоЗадача = Ложь) Экспорт 
	
	бит_МобильноеПриложениеУП.ДополнитьДанныеОбъекта(ДанныеОбъекта, Источник, ЗапросПлатежнойПозиции, ЭтоЗадача);
	
КонецПроцедуры

Процедура ДополнитьДаннымиРеестраПлатежей(ОбъектВизирования, Источник) Экспорт
	
	бит_МобильноеПриложениеУП.ДополнитьДаннымиРеестраПлатежей(ОбъектВизирования, Источник);
	
КонецПроцедуры

Функция ДанныеОбъекта(ОбъектСсылка) Экспорт
	
	Возврат бит_МобильноеПриложениеУП.ДанныеОбъекта(ОбъектСсылка);
	
КонецФункции 

Функция ЗапросПлатежнойПозиции() Экспорт 
	
	Возврат бит_МобильноеПриложениеУП.ЗапросПлатежнойПозиции();
	
КонецФункции

Процедура ПрикрепленныеФайлыПроектовДоговоров(ПрикрепленныеФайлы, СсылкиПоТипам) Экспорт
	
	бит_МобильноеПриложениеУП.ПрикрепленныеФайлыПроектовДоговоров(ПрикрепленныеФайлы, СсылкиПоТипам);
	
КонецПроцедуры

Процедура ИменаТабличныхЧастей(Объект, ИменаТабличныхЧастей) Экспорт
	
	бит_МобильноеПриложениеУП.ИменаТабличныхЧастей(Объект, ИменаТабличныхЧастей);
	
КонецПроцедуры

Функция ФильтрРеквизитовОбъекта(ОбъектСистемы) Экспорт
	
	Возврат бит_МобильноеПриложениеУП.ФильтрРеквизитовОбъекта(ОбъектСистемы);
	
КонецФункции

Процедура ДанныеТабличнойЧасти(ОбъектСсылка, Результат) Экспорт
	
	бит_МобильноеПриложениеУП.ДанныеТабличнойЧасти(ОбъектСсылка, Результат);
	
КонецПроцедуры

Процедура УстановитьДанныеТабличнойЧасти(ОбъектСсылка, ДанныеЗапроса, Результат) Экспорт
	
	бит_МобильноеПриложениеУП.УстановитьДанныеТабличнойЧасти(ОбъектСсылка, ДанныеЗапроса, Результат);
	
КонецПроцедуры

#КонецОбласти
