
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Установим доступные типы текстов.
	Для Каждого ТипТекста Из ТипТекстаПочтовогоСообщения Цикл
		Элементы.ТипТекстаСообщения.СписокВыбора.Добавить(Строка(ТипТекста));
	КонецЦикла;
	
	УстановитьВидимость();
	
КонецПроцедуры // ПриСозданииНаСервере()
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипТекстаСообщенияПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаСтраницаПредварительныйПросмотр Тогда
		
		Элементы.ПолеHTML.Заголовок = Запись.Сообщение_Заголовок;
		
		ПолеHTML = Запись.Сообщение_Текст + Символы.ПС + Запись.Сообщение_Подпись;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	
	Запись.СпособТранспорта = бит_ОповещенияКлиентСервер.ОпределитьСпособТранспорта(Запись.АдресПолучателя);
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
// Процедура управляет видимостью/доступностью элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()
	
	ЭтоHTMLСообщение = ВРег(Запись.ТипТекстаСообщения) = "HTML";
	ЭтоПуш = Запись.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.PushNotification;
	ЭтоЯблоко = Ложь;
	
	Если ЭтоПуш Тогда
	
		Если ТипЗнч(Запись.АдресПолучателя) = Тип("СправочникСсылка.бит_МобильныеУстройства") Тогда
		
			 Если Запись.АдресПолучателя.ОперационнаяСистема = Перечисления.бит_МобильныеОперационныеСистемы.ios Тогда
			 
			 	ЭтоЯблоко = Истина;
			 
			 КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЕсли; 
	
	Элементы.ГруппаСтраницаПредварительныйПросмотр.Видимость = ЭтоHTMLСообщение;
	Элементы.Бейджи.Видимость = ЭтоПуш И ЭтоЯблоко;
	
КонецПроцедуры

#КонецОбласти
