
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [16.07.2024] +  	
	ДобавляемыеРеквизиты = Новый Массив();
	
	// Описываем новые ревизиты формы
	бит_ОплатаРеквизит = Новый РеквизитФормы(
	"бит_Оплата",
	Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(16)),
	,
	"(бит) Оплата"
	);  
	
	// Заполняем массив новых реквизитов
	ДобавляемыеРеквизиты.Добавить(бит_ОплатаРеквизит);
	
	// Добавляем новые реквизиты в форму
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);	
	
	НовыйЭлемент = Элементы.Вставить("бит_Оплата", Тип("ПолеФормы"), ЭтаФорма, Элементы.ГруппаПользовательскихНастроек);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Оплата";
	НовыйЭлемент.Заголовок = "(бит) Оплата"; 
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ОплатаПриИзмененииКлиент");
	НовыйЭлемент.УстановитьДействие("Очистка", "бит_ОплатаОчисткаКлиент"); 
	
	бит_ЗаполнитьСпискиВыбораОплат();
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [16.07.2024] -  
	
КонецПроцедуры 

&НаСервере
Процедура бит_ЗаполнитьСпискиВыбораОплат()
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [16.07.2024] +  
	СписокВыбора = Элементы.бит_Оплата.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить("Оплачен", "Оплачен");
	СписокВыбора.Добавить("Частично оплачен", "Частично оплачен");
	СписокВыбора.Добавить("Не оплачен", "Не оплачен");
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [16.07.2024] - 
	
КонецПроцедуры


&НаКлиенте
Процедура бит_ОплатаПриИзмененииКлиент(Элемент)
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [16.07.2024] +  
	бит_УстановитьОтборЗаданияНаПеревозкуПоОплате()
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [16.07.2024] -	 
	
КонецПроцедуры   

&НаКлиенте
Процедура бит_ОплатаОчисткаКлиент(Элемент)
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [16.07.2024] -	
	бит_УстановитьОтборЗаданияНаПеревозкуПоОплате();
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [16.07.2024] -	   
	
КонецПроцедуры   

&НаСервере
Процедура бит_УстановитьОтборЗаданияНаПеревозкуПоОплате()
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [16.07.2024] - 
	Если Не ЗначениеЗаполнено(ЭтотОбъект.бит_Оплата) Тогда 
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"бит_Оплата",,,,Ложь);   
		
	ИначеЕсли ЭтотОбъект.бит_Оплата = "Оплачен" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"бит_Оплата", "Оплачен" , ВидСравненияКомпоновкиДанных.Равно,,Истина); 
		
	ИначеЕсли ЭтотОбъект.бит_Оплата = "Частично оплачен" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"бит_Оплата", "Частично оплачен" , ВидСравненияКомпоновкиДанных.Равно,,Истина);  
		
	ИначеЕсли ЭтотОбъект.бит_Оплата = "Не оплачен" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"бит_Оплата", "Не оплачен" , ВидСравненияКомпоновкиДанных.Равно,,Истина);
		
	КонецЕсли;
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [16.07.2024] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СписокВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] +	
	СсылкаДляОткрытия = Элемент.ТекущиеДанные.Ссылка;
	ПараметрыФормы = Новый Структура("Ключ", СсылкаДляОткрытия);
	ОткрытьФорму("Документ.ЗаданиеНаПеревозку.Форма.ФормаДокумента", ПараметрыФормы);  
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] -

КонецПроцедуры


