
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	УстановитьВидимостьАлгоритма();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОтключитьОбработчикОжидания("СписокОжиданиеАктивизацииСтроки");
	ПодключитьОбработчикОжидания("СписокОжиданиеАктивизацииСтроки",0.5,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОжиданиеАктивизацииСтроки()
	
	ТекущийАлгоритм = ТекущийАлгоритм();
	ОтобразитьКартуАлгоритма(ТекущийАлгоритм);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВидимостьАлгоритма(Команда)
	
	ТекущийАлгоритм = ТекущийАлгоритм();
	КомандаВидимостьАлгоритмаНаСервере(ТекущийАлгоритм);
	
КонецПроцедуры

&НаСервере
Процедура КомандаВидимостьАлгоритмаНаСервере(Знач ТекущийАлгоритм)
	
	ВидимостьАлгоритма = НЕ ВидимостьАлгоритма;
	Элементы.ФормаКомандаВидимостьАлгоритма.Пометка = ВидимостьАлгоритма;
	
	УстановитьВидимостьАлгоритма();
	ОтобразитьКартуАлгоритма(ТекущийАлгоритм);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСКартойАлгоритма

// Процедура устанавливает видимость табличного поля со схемой алгоритма.
// 
// Параметры:
//  ВидимостьАлгоритма - Булево.
// 
&НаСервере
Процедура УстановитьВидимостьАлгоритма()
	
	Элементы.ГруппаАлгоритм.Видимость = ВидимостьАлгоритма;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьКартуАлгоритма(Знач ТекущийАлгоритм)
	
	Если НЕ ВидимостьАлгоритма Тогда
		Возврат;
	КонецЕсли;
	
	ГрафическаяСхема = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ТекущийАлгоритм) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыАлгоритма = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийАлгоритм, "ЭтоГруппа, КартаМаршрута");
	Если РеквизитыАлгоритма.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ГрафическаяСхема = РеквизитыАлгоритма.КартаМаршрута.Получить();
	
КонецПроцедуры

&НаКлиенте
Функция ТекущийАлгоритм()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТекущиеДанные.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецОбласти
