#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
	
	Если НЕ ПометкаУдаления Тогда
		ТекстСообщения = НСтр("ru = 'Данный документ не используется. Для ввода данных используйте новую версию документа ""Установка значаний произвольных параметров"".';
							  |en = 'Данный документ не используется. Для ввода данных используйте новую версию документа ""Установка значаний произвольных параметров"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
		
КонецПроцедуры // ПередЗаписью()
	
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли