#Область ПрограммныйИнтерфейс

Процедура УстановитьУсловноеОформление(Форма, ПолеДеревоЗначений) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	
	Оформление = Новый Структура("Видимость", Ложь);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ПолеДеревоЗначений + "Представление", Оформление, ПолеДеревоЗначений + ".Представление", , ВидСравненияКомпоновкиДанных.НеЗаполнено);

	Оформление = Новый Структура("Видимость", Ложь);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ПолеДеревоЗначений + "ПредставлениеГиперссылки", Оформление, ПолеДеревоЗначений + ".ПредставлениеГиперссылки", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
КонецПроцедуры

Процедура РазвернутьСтрокуВФорме(Форма, ИмяКоллекции, ИдентификаторСтроки) Экспорт
	
	РазворачиваемаяСтрока = Форма[ИмяКоллекции].НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ОсновноеЗначение = Неопределено;
	ИсследуемоеЗначение = ИсследуемоеЗначение(Форма, РазворачиваемаяСтрока);
	Если ТипЗнч(ИсследуемоеЗначение) = Тип("СтрокаТаблицыЗначений")
			ИЛИ ТипЗнч(ИсследуемоеЗначение) = Тип("СтрокаДереваЗначений") Тогда
		
		СтрокаКоллекции = РазворачиваемаяСтрока.ПолучитьРодителя();
		ОсновноеЗначение = Форма.ИТК_ИсследованиеЗначенийОсновноеЗначение(СтрокаКоллекции);
		
	КонецЕсли;
	
	ИТК_ИсследованиеЗначенийКлиентСервер.РазвернутьСтрокуВФорме(ОсновноеЗначение, РазворачиваемаяСтрока, ИсследуемоеЗначение);
	
КонецПроцедуры

Функция АдресИсследуемогоЗначения(Форма, ИмяКоллекции, ИдентификаторСтроки) Экспорт
	
	Строка = Форма[ИмяКоллекции].НайтиПоИдентификатору(ИдентификаторСтроки);
	Значение = ИсследуемоеЗначение(Форма, Строка);
	
	Результат = Новый СписокЗначений;
	Результат.Добавить(Значение);
	
	Возврат ПоместитьВоВременноеХранилище(Результат, Форма.УникальныйИдентификатор);
	
КонецФункции

Процедура ПроверкаПередачиЗначенияНаСервер(Значение) Экспорт
КонецПроцедуры

Функция ПолноеИмяФормыЗначения(Адрес) Экспорт
	
	ПереданноеЗначение = ПолучитьИзВременногоХранилища(Адрес);
	Значение = ИзвлечениеПереданногоЗначения(ПереданноеЗначение);
	ТипЗначения = ТипЗнч(Значение);
	
	Результат = Неопределено;
	Если ТипЗначения = Тип("ТаблицаЗначений")
			ИЛИ ТипЗначения = Тип("ДеревоЗначений") Тогда 
			
		Результат = "Обработка.ИТК_ИсследованиеЗначений.Форма.РедактированиеТаблицыДереваЗначений";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИзвлечениеПереданногоЗначения(ПереданноеЗначение) Экспорт
	
	Возврат ПереданноеЗначение[0].Значение;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИсследуемоеЗначение(Форма, Строка)
	
	ОсновноеЗначение = Форма.ИТК_ИсследованиеЗначенийОсновноеЗначение(Строка);
	Результат = ИТК_ИсследованиеЗначенийКлиентСервер.ИсследуемоеЗначениеСтрокиФормы(ОсновноеЗначение, Строка);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
