Процедура бит_ПриКомпоновкеРезультатаРасчетныйЛисток(ОбъектОтчета, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, НаАванс = Ложь, ВнешнийНаборНормаВремени, ВнешнийНаборЧасовойТариф, МенеджерВременныхТаблиц) Экспорт
	
	КомпоновщикНастроек = ОбъектОтчета.КомпоновщикНастроек;
	КлючВарианта = КлючВарианта(КомпоновщикНастроек);
	
	Если (КлючВарианта = "РасчетныйЛистокПоРабочимМестам")
		Или (КлючВарианта = "РасчетныйЛистокПоРабочимМестамИСРазбивкойПоИсточникамФинансирования") Тогда
		
		ПриКомпоновкеРезультатаРасчетныйЛистокПоРабочимМестам(ОбъектОтчета, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, НаАванс)
		
	Иначе
		бит_ПриКомпоновкеРезультатаРасчетныйЛистокПоФизическимЛицам(ОбъектОтчета, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, НаАванс, ВнешнийНаборНормаВремени, ВнешнийНаборЧасовойТариф, МенеджерВременныхТаблиц);
	КонецЕсли;
	
КонецПроцедуры  

Процедура бит_ПриКомпоновкеРезультатаРасчетныйЛистокПоФизическимЛицам(ОбъектОтчета, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, НаАванс = Ложь, ВнешнийНаборНормаВремени, ВнешнийНаборЧасовойТариф, МенеджерВременныхТаблиц)
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		
		ДополнительныеПараметры = Новый Структура;
		
		ДанныеРасчетныхЛистков = Новый ТаблицаЗначений;
		ДанныеРасчетныхЛистков.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		ДанныеРасчетныхЛистков.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		ДанныеРасчетныхЛистков.Колонки.Добавить("ПредставлениеРабочегоМеста");
		ДанныеРасчетныхЛистков.Колонки.Добавить("Группа", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыНачисленияУдержанияВыплаты"));
		ДанныеРасчетныхЛистков.Колонки.Добавить("ВидРасчета");
		ДанныеРасчетныхЛистков.Колонки.Добавить("ВидРасчетаКраткоеНаименование");
		ДанныеРасчетныхЛистков.Колонки.Добавить("РегистраторВыплаты");
		ДанныеРасчетныхЛистков.Колонки.Добавить("ПриоритетВидаРасчета");
		ДанныеРасчетныхЛистков.Колонки.Добавить("ПериодДействия");
		ДанныеРасчетныхЛистков.Колонки.Добавить("ОплаченныеДниЧасы");
		ДанныеРасчетныхЛистков.Колонки.Добавить("Сумма");
		
		ДанныеРасчетныхЛистковСтруктура = Новый Структура("ОбщиеДанныеРасчетныхЛистков,ДанныеРасчетныхЛистков", Новый Соответствие, ДанныеРасчетныхЛистков);
		ДополнительныеПараметры.Вставить("ДанныеРасчетныхЛистковСтруктура", ДанныеРасчетныхЛистковСтруктура);
		
		КомпоновщикНастроек = ОбъектОтчета.КомпоновщикНастроек;
		СхемаКомпоновкиДанных = ОбъектОтчета.СхемаКомпоновкиДанных;
		
		КлючВарианта = КлючВарианта(КомпоновщикНастроек);
		
		УправленческийРасчетныйЛисток = (КлючВарианта = "РасчетныйЛистокУправленческий");
		
		// Параметры документа
		ДокументРезультат.ТолькоПросмотр = Истина;
		ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасчетныйЛисток";
		
		// Подготовка настроек
		НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
		
		
		//ЛТ6.5
		ИсключаемыеНачисленияИзРасчетногоЛистка = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ИсключаемыеНачисленияИзРасчетногоЛистка, Неопределено, Ложь);
		Начисление_033 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Премия_033, Неопределено, Истина);
		
		СписокНачислений = Новый СписокЗначений;
		СписокНачислений.ЗагрузитьЗначения(ИсключаемыеНачисленияИзРасчетногоЛистка);
			
		ПараметрИсключаемыеНачисленияИзРасчетногоЛистка = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИсключаемыеНачисленияИзРасчетногоЛистка"));
		ПараметрИсключаемыеНачисленияИзРасчетногоЛистка.Значение = СписокНачислений;
		
		//СписокНачислений = Новый СписокЗначений;
		//СписокНачислений.ЗагрузитьЗначения(Начисление_033);
			
		ПараметрНачисление_033 = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Начисление_033"));
		ПараметрНачисление_033.Значение = Начисление_033;
		
		//ЛТ6.5
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплата");
			Модуль.ДополнитьНастройкиОтчетаРасчетныйЛисток(НастройкиОтчета, КлючВарианта);
		КонецЕсли;
		
		ЗаполнитьПользовательскиеПоляВариантаОтчета(КлючВарианта, НастройкиОтчета, НаАванс);
		НастроитьВариантОтчетаРасчетныйЛисток(НастройкиОтчета);
		
		ПредварительныйПросмотр = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ПредварительныйПросмотр");
		Если ПредварительныйПросмотр Тогда
			
			ПараметрВыводитьОсобенностиРасчетаНДФЛ = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(
				Новый ПараметрКомпоновкиДанных("ВыводитьОсобенностиРасчетаНДФЛ"));
			Если ПараметрВыводитьОсобенностиРасчетаНДФЛ <> Неопределено Тогда
				ПараметрВыводитьОсобенностиРасчетаНДФЛ.Значение = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		НастройкиВывода = НастройкиВыводаРасчетногоЛистка(НастройкиОтчета, КлючВарианта, ПредварительныйПросмотр, НаАванс);
		ДополнительныеПараметры.Вставить("НастройкиВывода", НастройкиВывода);
		
		ОтключитьНеИспользуемыеПоляРасчетногоЛистка(НастройкиОтчета, НастройкиВывода);
		
		// Подготовка внешнего набора данных
		Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ДанныеДокумента") Тогда
			
			НаборыВнешнихДанных = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.ДанныеДокумента;
			КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Удалить("ДанныеДокумента");
			
		Иначе
			НаборыВнешнихДанных = НаборыВнешнихДанныхАнализНачисленийИУдержаний();
		КонецЕсли;
		
		Если Не ПредварительныйПросмотр И Не УправленческийРасчетныйЛисток Тогда
			
			ГруппировкиОтчета = Новый Массив;
			
			Если НастройкиВывода.ГруппировкаОтчета = "ПоСотрудникамИОрганизациям" Тогда
				ГруппировкиОтчета.Добавить("ФизическоеЛицо");
				ГруппировкиОтчета.Добавить("ОрганизацияСортировки");
				ГруппировкиОтчета.Добавить("ПодразделениеСортировки");
				ГруппировкиОтчета.Добавить("МесяцНачисления");
			ИначеЕсли НастройкиВывода.ГруппировкаОтчета = "ПоОрганизациямИПодразделениям" Тогда
				ГруппировкиОтчета.Добавить("МесяцНачисления");
				ГруппировкиОтчета.Добавить("ОрганизацияСортировки");
				ГруппировкиОтчета.Добавить("ПодразделениеСортировки");
				ГруппировкиОтчета.Добавить("ФизическоеЛицо");
			Иначе // По умолчанию - "ПоОрганизациям"
				ГруппировкиОтчета.Добавить("МесяцНачисления");
				ГруппировкиОтчета.Добавить("ОрганизацияСортировки");
				ГруппировкиОтчета.Добавить("ФизическоеЛицо");
				ГруппировкиОтчета.Добавить("ПодразделениеСортировки");
			КонецЕсли;
			
			Для ИндексГруппировки = 0 По ГруппировкиОтчета.Количество() -1 Цикл
				
				ГруппировкаУстановлена = Ложь;
				ГруппировкаОтчета = ГруппировкиОтчета[ИндексГруппировки];
				Для Каждого ЭлементПорядка Из НастройкиОтчета.Порядок.Элементы Цикл
					
					Если СтрНачинаетсяС(Строка(ЭлементПорядка.Поле), ГруппировкаОтчета) Тогда
						
						ЭлементПорядка.Использование = Истина;
						
						ИндексЭлемента = НастройкиОтчета.Порядок.Элементы.Индекс(ЭлементПорядка);
						Если ИндексЭлемента <> ИндексГруппировки Тогда
							НастройкиОтчета.Порядок.Элементы.Сдвинуть(ЭлементПорядка, ИндексГруппировки - ИндексЭлемента);
						КонецЕсли;
						
						ГруппировкаУстановлена = Истина;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не ГруппировкаУстановлена Тогда
					
					Попытка
					
						ЭлементПорядка = НастройкиОтчета.Порядок.Элементы.Вставить(ИндексГруппировки, Тип("ЭлементПорядкаКомпоновкиДанных"));
						ЭлементПорядка.Использование = Истина;
						ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(ГруппировкаОтчета);
						
					Исключение
					
						ВызватьИсключение НСтр("ru = 'В настройку отчета ""Расчетный листок"" внесены критичные изменения. Отчет не будет сформирован.';
												|en = 'Critical changes have been made to the ""Payslip"" report settings. Cannot generate the report.'")
							+ " " + КраткоеПредставлениеОшибки(НСтр("ru = 'Нарушена структура (порядок сортировки полей) отчета';
																	|en = 'The structure (fields sort order) of the report is broken'"));
					
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		НаборыВнешнихДанных.Вставить("НаборНормаВремени", ВнешнийНаборНормаВремени);
		НаборыВнешнихДанных.Вставить("НаборЧасовойТариф", ВнешнийНаборЧасовойТариф);
				
		РезультатКомпоновки = бит_РезультатКомпоновкиМакетаПечатнойФормы(ОбъектОтчета, ДанныеРасшифровки, НастройкиОтчета, НаборыВнешнихДанных,, МенеджерВременныхТаблиц);
		
		Если ОбъектОтчета.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ОтчетПустой")
			И ОбъектОтчета.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.ОтчетПустой = Истина Тогда
			Возврат;
		КонецЕсли;
		
		СвойстваРегистраторов = СвойстваРегистраторовДляРасчетныхЛистков(РезультатКомпоновки.ДанныеОтчета, НастройкиВывода);
		ДополнительныеПараметры.Вставить("СвойстваРегистраторов", СвойстваРегистраторов);
		
		ДанныеПоНДФЛИВзносам = Новый Соответствие;
		ДополнительныеПараметры.Вставить("ДанныеПоНДФЛИВзносам", ДанныеПоНДФЛИВзносам);
		Если НастройкиВывода.ВыводитьОсобенностиРасчетаНДФЛ
			Или НастройкиВывода.ВыводитьИнформациюОНачисленныхВзносахВПФР Тогда
			
			МесяцыНачислений = ОбщегоНазначения.ВыгрузитьКолонку(РезультатКомпоновки.ДанныеОтчета.Строки, "МесяцНачисления", Истина);
			Для Каждого МесяцНачисления Из МесяцыНачислений Цикл
				ДанныеПоНДФЛИВзносам.Вставить(МесяцНачисления,
					ДанныеПоНДФЛИВзносамПоФизическимЛицам(РезультатКомпоновки.ДанныеОтчета.Строки, МесяцНачисления, НастройкиВывода.ВыводитьОсобенностиРасчетаНДФЛ, НастройкиВывода.ВыводитьИнформациюОНачисленныхВзносахВПФР));
			КонецЦикла;
			
		КонецЕсли;
		
		Если НастройкиВывода.РасшифровыватьСдельныйЗаработокПоВидамРабот Тогда
			СдельныйЗаработокСотрудников = ЗарплатаКадрыОтчетыВнутренний.СдельныйЗаработокСотрудников(РезультатКомпоновки.ДанныеОтчета.Строки);
		Иначе
			СдельныйЗаработокСотрудников = Неопределено;
		КонецЕсли;
		ДополнительныеПараметры.Вставить("СдельныйЗаработокСотрудников", СдельныйЗаработокСотрудников);
		
		Если ПредварительныйПросмотр Тогда
			ДокументРезультат.Вывести(РезультатКомпоновки.МакетПечатнойФормы.ПолучитьОбласть("ПредварительныйПросмотр"));
		КонецЕсли;
		
		ДокументРезультатСтраница = Новый ТабличныйДокумент;
		УстановитьПоОбразцуПараметрыСтраницы(ДокументРезультатСтраница, ДокументРезультат);
		
		ВыводимыеГруппировки = Новый Массив;
		
		ОрганизацияСортировки = Неопределено;
		ПодразделениеСортировки = Неопределено;
		Для каждого СтрокаМесяца Из РезультатКомпоновки.ДанныеОтчета.Строки Цикл
			
			Если Не УправленческийРасчетныйЛисток Тогда
				
				Если Не ЗначениеЗаполнено(НастройкиВывода.ГруппировкаОтчета)
					Или НастройкиВывода.ГруппировкаОтчета = "ПоОрганизациям"
					Или НастройкиВывода.ГруппировкаОтчета = "ПоОрганизациямИПодразделениям" Тогда
					
					Если ОрганизацияСортировки <> СтрокаМесяца. ОрганизацияСортировки Тогда
						
						ПараметрыГруппировки = Новый Структура;
						ПараметрыГруппировки.Вставить("НазваниеГруппировки", НСтр("ru = 'Организация';
																					|en = 'Company'"));
						ПараметрыГруппировки.Вставить("ЗначениеГруппировки", СтрокаМесяца.ОрганизацияСортировки);
						
						Область = РезультатКомпоновки.МакетПечатнойФормы.ПолучитьОбласть("Группировка");
						Область.Параметры.Заполнить(ПараметрыГруппировки);
						
						ВыводимыеГруппировки.Добавить(Область);
						ОрганизацияСортировки = СтрокаМесяца.ОрганизацияСортировки;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если НастройкиВывода.ГруппировкаОтчета = "ПоОрганизациямИПодразделениям" Тогда
					
					Если ПодразделениеСортировки <> СтрокаМесяца.ПодразделениеСортировки Тогда
						
						ПараметрыГруппировки = Новый Структура;
						ПараметрыГруппировки.Вставить("НазваниеГруппировки", НСтр("ru = 'Подразделение';
																					|en = 'Business unit'"));
						ПараметрыГруппировки.Вставить("ЗначениеГруппировки", СтрокаМесяца.ПодразделениеСортировки);
						
						Область = РезультатКомпоновки.МакетПечатнойФормы.ПолучитьОбласть("Группировка");
						Область.Параметры.Заполнить(ПараметрыГруппировки);
						
						ВыводимыеГруппировки.Добавить(Область);
						ПодразделениеСортировки = СтрокаМесяца.ПодразделениеСортировки;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ВыводимаяКоллекция = Новый Массив;
			Для Каждого СтрокаСотрудника Из СтрокаМесяца.Строки Цикл
				ВыводимаяКоллекция.Добавить(СтрокаСотрудника);
			КонецЦикла;
			
			ВывестиСотрудникаРасчетныйЛисток(ВыводимаяКоллекция, ДокументРезультат, ДокументРезультатСтраница, РезультатКомпоновки.МакетПечатнойФормы,
				РезультатКомпоновки.ИдентификаторыМакета, ВыводимыеГруппировки, НаАванс, ДополнительныеПараметры);
			
		КонецЦикла;
		
		Если ОбъектОтчета.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ГотовитьДанныеДляКабинетаСотрудников")
			И ОбъектОтчета.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.ГотовитьДанныеДляКабинетаСотрудников = Истина Тогда
			
			ОбъектОтчета.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ДанныеРасчетныхЛистков", ДанныеРасчетныхЛистковСтруктура);
		КонецЕсли;
		
		Если ДокументРезультатСтраница.ВысотаТаблицы > 0 Тогда
			
			Если Не ПредварительныйПросмотр И ДокументРезультат.ВысотаТаблицы > 0 Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ДокументРезультат.Вывести(ДокументРезультатСтраница);
			
		КонецЕсли;
		
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		ВызватьИсключение НСтр("ru = 'В настройку отчета ""Расчетный листок"" внесены критичные изменения. Отчет не будет сформирован.';
								|en = 'Critical changes have been made to the ""Payslip"" report settings. Cannot generate the report.'")
			+ " " + КраткоеПредставлениеОшибки(Инфо);
		
	КонецПопытки;
	
КонецПроцедуры

Функция бит_РезультатКомпоновкиМакетаПечатнойФормы(ОбъектОтчета, ДанныеРасшифровки = Неопределено, 
	НастройкиОтчета = Неопределено, ВнешниеНаборыДанных = Неопределено, ДополнительныеПараметры = Неопределено, МенеджерВременныхТаблиц) Экспорт
	
	РезультатКомпоновкиМакета = Новый Структура;
	КомпоновщикНастроек = ОбъектОтчета.КомпоновщикНастроек;
	
	// Заполняется коллекция идентификаторов пользовательских полей
	Если НастройкиОтчета = Неопределено Тогда
		НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	КонецЕсли;
	
	РезультатКомпоновкиМакета.Вставить("КлючВарианта", КлючВарианта(НастройкиОтчета));
	ДопСвойства = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		Если ДополнительныеПараметры.Свойство("Отбор") Тогда
			
			Для Каждого ОписаниеОтбора Из ДополнительныеПараметры.Отбор Цикл
				
				ЭлементОтбора = НастройкиОтчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ОписаниеОтбора.ЛевоеЗначение);
				ЭлементОтбора.ПравоеЗначение = ОписаниеОтбора.ПравоеЗначение;
				ЭлементОтбора.ВидСравнения = ОписаниеОтбора.ВидСравнения;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("КлючВарианта") Тогда
			РезультатКомпоновкиМакета.Вставить("КлючВарианта", ДополнительныеПараметры.КлючВарианта);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДопСвойства.Свойство("ИспользуютсяПользовательскиеНастройкиПечати") Тогда
		НастроитьВыводПользовательскихПолейОтчета(НастройкиОтчета);
	КонецЕсли;
	
	ИдентификаторыМакета = СоответствиеПользовательскихПолей(НастройкиОтчета);
	РезультатКомпоновкиМакета.Вставить("ИдентификаторыМакета", ИдентификаторыМакета);
	
	// Определяется макет печатной формы
	МакетПечатнойФормы = Неопределено;
	ДопСвойства.Свойство("МакетПечатнойФормы", МакетПечатнойФормы);
	
	Если МакетПечатнойФормы = Неопределено Тогда
		
		МакетыВариантовОтчетов = МакетыВариантовОтчетовПечатныхФорм();
		ПолноеИмяОбъекта = ОбъектОтчета.Метаданные().ПолноеИмя();
		
		ПутьКМакету = МакетыВариантовОтчетов.Получить(ПолноеИмяОбъекта + "." + РезультатКомпоновкиМакета.КлючВарианта);
		МакетПечатнойФормы = УправлениеПечатью.МакетПечатнойФормы(ПутьКМакету);
		
	КонецЕсли;
	
	РезультатКомпоновкиМакета.Вставить("МакетПечатнойФормы", МакетПечатнойФормы);
	
	Если ДопСвойства.Свойство("МакетКомпоновкиДанных")
		И ДопСвойства.МакетКомпоновкиДанных <> Неопределено Тогда
		
		МакетКомпоновки = ДопСвойства.МакетКомпоновкиДанных;
		ДопСвойства.Удалить("МакетКомпоновкиДанных");
		
	Иначе
		
		МакетКомпоновки = МакетКомпоновкиДанныхДляКоллекцииЗначений(ОбъектОтчета.СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
		
	КонецЕсли;
	
	Если ДопСвойства.Свойство("ФормированиеМакетаКомпоновкиДанных") Тогда
		
		ДопСвойства.Вставить("СкомпонованныйМакетКомпоновкиДанных", МакетКомпоновки);
		РезультатКомпоновкиМакета.Вставить("ДанныеОтчета", Новый Массив);
		
		ДопСвойства.Вставить("ОтчетПустой", Истина);
		ДопСвойства.Удалить("ФормированиеМакетаКомпоновкиДанных");
		
	Иначе
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, , Истина,,МенеджерВременныхТаблиц);
		
		ДанныеОтчета = Новый ДеревоЗначений;
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
		
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		ДопСвойства.Вставить("ОтчетПустой", ДанныеОтчета.Строки.Количество() = 0);
		
		РезультатКомпоновкиМакета.Вставить("ДанныеОтчета", ДанныеОтчета);
		
	КонецЕсли;
	
	РезультатКомпоновкиМакета.Вставить("ОтчетПустой", ДопСвойства.ОтчетПустой);
	
	Возврат РезультатКомпоновкиМакета;
	
КонецФункции
