#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//   Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
//   Реквизиты - Массив - список имен реквизитов объекта.
//
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("НаборыЗначенийДоступа.*");
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка.бит_ДополнительныеУсловияПоДоговору - ссылки на объекты,которые нужно распечатать;
//  ПараметрыПечати - Структура	 - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений	 - сформированные табличные документы (выходной параметр);
//  ОбъектыПечати - СписокЗначений	 - значение - ссылка на объект;
//  	представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура		 - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// Возвращает список имен элементово формы, которые не блокируются в зависимости от статуса.
//
// Возвращаемое значение:
//  СписокЗначений - список исключаемых элементов.
//
Функция ЭлементыИсключенияНастройкиДоступности() Экспорт
	
	ИсключаемыеЭлементы = Новый СписокЗначений;
	
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежей");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейУстановитьФлажкиПлатежи");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейСнятьФлажкиПлатежи");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейСоздатьИзменитьГрафикПлатежей");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейСоздатьФинансовыйГрафикПлатежей");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейЗаполнитьПоДоговоруКредистовДепозитов");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейЗаполнитьИзПообъектногоГрафика");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАктуализироватьГрафикПлатежей");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейЗаполнитьПоДогворуССобытиями");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейЗаполнитьПоГрафикуНачислений");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейРаспределитьПропорциональноПлатежи");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейРаспределитьПоКоэффициентуПлатежи");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейЗагрузитьПоНастройкеExcel");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейЗагрузитьЧерезТабДокГрафикПлатежей");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейВыолнитьСобытие");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейВыполнять");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейПериод");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейСобытие");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейНаименованиеСобытия");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейСостояниеСобытия");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейРасходДоход");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейЦФО");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейСтатьяОборотов");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейПроект");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейПодразделение");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_1");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_2");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_3");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_4");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_5");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_6");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_7");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_8");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_9");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_10");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_11");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейАналитика_12");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейКоэффициентРаспределения");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейСуммаБезНДС");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейСтавкаНДС");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейНДС");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейСумма");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейДокументПланирования");
	ИсключаемыеЭлементы.Добавить("ГрафикПлатежейНазначениеПлатежа");
	ИсключаемыеЭлементы.Добавить("НеОбъединятьДокументыПоДате");
	
	Возврат ИсключаемыеЭлементы;
	
КонецФункции

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

Процедура КонвертироватьПриПереходеНаНовуюВерсию() Экспорт
	
	ПолноеИмяОбъекта = ПустаяСсылка().Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""ДанныеДокумента"" КАК Источник,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.СтавкаНДСНачисления КАК СтавкаНДСНачисления
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору КАК ДанныеДокумента
	|ГДЕ
	|	(НЕ ДанныеДокумента.СтавкаНДС ССЫЛКА Справочник.СтавкиНДС
	|			ИЛИ НЕ ДанныеДокумента.СтавкаНДСНачисления ССЫЛКА Справочник.СтавкиНДС
	|			ИЛИ (ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийКазначейства.ПустаяСсылка)
	|				И ДанныеДокумента.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|				И ДанныеДокумента.УдалитьХозяйственнаяОперация.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ГрафикПлатежей"",
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.СтавкаНДС ССЫЛКА Справочник.СтавкиНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ГрафикНачислений"",
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикНачислений КАК ДанныеДокумента
	|ГДЕ
	|	НЕ ДанныеДокумента.СтавкаНДС ССЫЛКА Справочник.СтавкиНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВременнаяТаблица.Источник КАК Источник,
	|	ВременнаяТаблица.Ссылка КАК Ссылка
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|ИТОГИ ПО
	|	Ссылка";
	Результат = Запрос.Выполнить();

	ВидыОперацийБФ = Новый Соответствие; 
	
	ВыборкаДокумент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаДокумент.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаДокумент.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;			
			Блокировка.Заблокировать();
						
			ИзменяемыйОбъект = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
		
			ВыборкаДанные = ВыборкаДокумент.Выбрать();
			Пока ВыборкаДанные.Следующий() Цикл
				
				Если ВыборкаДанные.Источник = "ДанныеДокумента" Тогда
					Если ТипЗнч(ИзменяемыйОбъект.СтавкаНДС) <> Тип("СправочникСсылка.СтавкиНДС") Тогда
						ИзменяемыйОбъект.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(ИзменяемыйОбъект.СтавкаНДС);
					КонецЕсли;
					Если ТипЗнч(ИзменяемыйОбъект.СтавкаНДСНачисления) <> Тип("СправочникСсылка.СтавкиНДС") Тогда
						ИзменяемыйОбъект.СтавкаНДСНачисления = УчетНДСЛокализация.СтавкаНДСПоПеречислению(ИзменяемыйОбъект.СтавкаНДСНачисления);
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(ИзменяемыйОбъект.ХозяйственнаяОперация) 
						И ЗначениеЗаполнено(ИзменяемыйОбъект.УдалитьХозяйственнаяОперация)
						И ИзменяемыйОбъект.РасходДоход = Перечисления.бит_РасходДоход.Расходование Тогда
					
						ВидОперации = ВидыОперацийБФ.Получить(ИзменяемыйОбъект.УдалитьХозяйственнаяОперация);
						Если ВидОперации = Неопределено Тогда
							ВидОперацииУП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИзменяемыйОбъект.УдалитьХозяйственнаяОперация, 
												"ВидОперации");
							ВидОперации = бит_КазначействоКлиентСервер.ХозяйственнаяОперацияБФ(ВидОперацииУП);
							ВидыОперацийБФ.Вставить(ИзменяемыйОбъект.УдалитьХозяйственнаяОперация, ВидОперации);
						КонецЕсли;
						ИзменяемыйОбъект.ХозяйственнаяОперация = ВидОперации;
					КонецЕсли;
				ИначеЕсли ВыборкаДанные.Источник = "ГрафикПлатежей" Тогда
					Для каждого СтрокаГрафика Из ИзменяемыйОбъект.ГрафикПлатежей Цикл		
						Если ТипЗнч(СтрокаГрафика.СтавкаНДС) <> Тип("СправочникСсылка.СтавкиНДС") Тогда
							СтрокаГрафика.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(СтрокаГрафика.СтавкаНДС);
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ВыборкаДанные.Источник = "ГрафикНачислений" Тогда	
					Для каждого СтрокаГрафика Из ИзменяемыйОбъект.ГрафикНачислений Цикл		
						Если ТипЗнч(СтрокаГрафика.СтавкаНДС) <> Тип("СправочникСсылка.СтавкиНДС") Тогда
							СтрокаГрафика.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(СтрокаГрафика.СтавкаНДС);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
					
			КонецЦикла;			
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ИзменяемыйОбъект);
		
			// Движения документу по регистру "бит_ГрафикиДоговоров".
			ЗаписиРегистра = РегистрыНакопления.бит_ГрафикиДоговоров.СоздатьНаборЗаписей();
			ЗаписиРегистра.Отбор.Регистратор.Установить(ВыборкаДокумент.Ссылка);
			ЗаписиРегистра.Прочитать();
			Для Каждого СтрокаЗапись Из ЗаписиРегистра Цикл
				СтрокаЗапись.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(СтрокаЗапись.СтавкаНДС);;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(ЗаписиРегистра);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();			
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ИзменяемыйОбъект.Ссылка);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьКОбработкеДокументыБезПодразделения(Параметры) Экспорт

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	ОтработаныВсеДокументы			 = Ложь;
	Ссылка 				  			 = Неопределено;    
	ИспользуетсяСтруктураПредприятия = Ложь;
	ИмяАналитики					 = "";
	
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	Для каждого Настройка Из НастройкиИзмерений Цикл
		Если Настройка.Значение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.СтруктураПредприятия")) Тогда
			ИмяАналитики					 = Настройка.Ключ;
			ИспользуетсяСтруктураПредприятия = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;                                
	
	Если НЕ ИспользуетсяСтруктураПредприятия Тогда
		Возврат;	
	КонецЕсли;  
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыДляОбработки
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка > &Ссылка
	|	И Таблица.Подразделение = &ПустаяСсылка
	|	И &УсловиеДопАналитика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.Ссылка
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка > &Ссылка
	|	И Таблица.Подразделение = &ПустаяСсылка
	|	И &УсловиеДопАналитика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.Ссылка
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикНачислений КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка > &Ссылка
	|	И Таблица.Подразделение = &ПустаяСсылка
	|	И &УсловиеДопАналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	ДокументыДляОбработки.Ссылка КАК Ссылка
	|ИЗ
	|	ДокументыДляОбработки КАК ДокументыДляОбработки";
	
	ЧтоЗаменить	  = "&УсловиеДопАналитика";
	НаЧтоЗаменить = "(Таблица.%1 <> &ПустаяСсылка  ИЛИ Таблица.%1 <> НЕОПРЕДЕЛЕНО)";
	НаЧтоЗаменить = СтрШаблон(НаЧтоЗаменить, ИмяАналитики);
	ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса; 
    Запрос.УстановитьПараметр("ПустаяСсылка", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	Пока НЕ ОтработаныВсеДокументы Цикл
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		ДокументыДляОбработки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ДокументыДляОбработки);
		
		КоличествоСсылок = ДокументыДляОбработки.Количество();
		Если КоличествоСсылок < 1000 Тогда
			ОтработаныВсеДокументы = Истина;
		КонецЕсли;
		
		Если КоличествоСсылок > 0 Тогда
			Ссылка = ДокументыДляОбработки[КоличествоСсылок - 1];
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке.
//
Процедура ОбработатьДокументыБезПодразделенияОтложенно(Параметры) Экспорт
 
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ПолноеИмяОбъекта  = МетаданныеОбъекта.ПолноеИмя();
	ВыбранныеДанные   = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если НЕ ЗначениеЗаполнено(ВыбранныеДанные) Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;                                            
		
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
		
	ИспользуетсяСтруктураПредприятия = Ложь;
	ИмяАналитики					 = "";
	
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	Для каждого Настройка Из НастройкиИзмерений Цикл
		Если Настройка.Значение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.СтруктураПредприятия")) Тогда
			ИмяАналитики					 = Настройка.Ключ;
			ИспользуетсяСтруктураПредприятия = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;                                
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", ВыбранныеДанные.ВыгрузитьКолонку("Ссылка"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Реквизиты.Ссылка) КАК СсылкаПредставление,
	|	Реквизиты.Подразделение КАК Подразделение,
	|	Реквизиты.Аналитика_1 КАК Аналитика_1,
	|	Реквизиты.Аналитика_2 КАК Аналитика_2,
	|	Реквизиты.Аналитика_3 КАК Аналитика_3,
	|	Реквизиты.Аналитика_4 КАК Аналитика_4,
	|	Реквизиты.Аналитика_5 КАК Аналитика_5,
	|	Реквизиты.Аналитика_6 КАК Аналитика_6,
	|	Реквизиты.Аналитика_7 КАК Аналитика_7,
	|	Реквизиты.Аналитика_8 КАК Аналитика_8,
	|	Реквизиты.Аналитика_9 КАК Аналитика_9,
	|	Реквизиты.Аналитика_10 КАК Аналитика_10,
	|	Реквизиты.Аналитика_11 КАК Аналитика_11,
	|	Реквизиты.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка В(&Ссылки)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ИспользуетсяСтруктураПредприятия Тогда
			
			НачатьТранзакцию();
			
			Попытка
				
				Блокировка = Новый БлокировкаДанных;
				
				ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				
				Блокировка.Заблокировать();
				
				ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
				
				Если НЕ ЗначениеЗаполнено(ДокументОбъект.Подразделение) И ЗначениеЗаполнено(ДокументОбъект[ИмяАналитики]) Тогда
					ДокументОбъект.Подразделение = ДокументОбъект[ИмяАналитики];
				КонецЕсли;
				
				Для каждого СтрокаТаблицы Из ДокументОбъект.ГрафикПлатежей Цикл
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Подразделение) И ЗначениеЗаполнено(СтрокаТаблицы[ИмяАналитики]) Тогда
						СтрокаТаблицы.Подразделение = СтрокаТаблицы[ИмяАналитики];					
					КонецЕсли;
				КонецЦикла;				                                            
				
				Для каждого СтрокаТаблицы Из ДокументОбъект.ГрафикНачислений Цикл
					Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Подразделение) И ЗначениеЗаполнено(СтрокаТаблицы[ИмяАналитики]) Тогда
						СтрокаТаблицы.Подразделение = СтрокаТаблицы[ИмяАналитики];					
					КонецЕсли;
				КонецЦикла;
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);				
				
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				
				ОбъектовОбработано = ОбъектовОбработано + 1;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
				ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(Выборка.Ссылка, Выборка.СсылкаПредставление, ИнформацияОбОшибке());
			КонецПопытки;
		Иначе         
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			ОбъектовОбработано = ОбъектовОбработано + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые документы ""Дополнительные условия по договору"" (пропущены): %1'; 
								|en = 'Some documents ""Additional Contract Terms and Conditions"" could not be processed (skipped): %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПроблемныхОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция документов ""Дополнительные условия по договору"": %1';
								|en = 'The next batch of documents ""Additional Contract Terms and Conditions"" has been processed: %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
										Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

// Функция определяет новый статус объекта.
// Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_ДополнительныеУсловияПоДоговору.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   СправочникСсылка.бит_СтатусыОбъектов - новый статус объекта.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Возврат бит_ВизированиеСервер.НовыйСтатусПоСтандартномуАлгоритму(ТекущийОбъект, ПараметрыУстановкиСтатуса);
	
КонецФункции

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Сценарий.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.НеКонтролироватьПоБюджету КАК НеКонтролироватьПоБюджету,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.Сценарий.ОтключитьКонтрольГрафиковДоговоровПоЛимитам КАК ОтключитьКонтрольГрафиковДоговоровПоЛимитам
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	Результат    	 = Запрос.Выполнить();
	ТаблицаРеквизиты = Результат.Выгрузить();
	Реквизиты		 = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
		
	Если НЕ бит_ОбщегоНазначения.ВалютаУпрУчетаУстановлена(Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	Если Реквизиты.НеКонтролироватьПоБюджету Тогда
		ПараметрыПроведения.Вставить("ИсполнениеБюджетаРеквизиты", Новый ТаблицаЗначений);
		ПараметрыПроведения.Вставить("ИсполнениеБюджета", 		   Новый ТаблицаЗначений);
	КонецЕсли;
	
	Если Реквизиты.ОтключитьКонтрольГрафиковДоговоровПоЛимитам Тогда
		КонтролироватьБюджет = Ложь;
	Иначе	
		ПараметрыНастройки = Новый Структура;
		ПараметрыНастройки.Вставить("Организация", Реквизиты.Организация);
		ПараметрыНастройки.Вставить("ЦФО",		   Реквизиты.ЦФО);
		КонтролироватьБюджет = бит_НастройкиПрограммы.КонтролироватьГрафикиДоговоровПоБюджету(ПараметрыНастройки, Реквизиты.Период);
	КонецЕсли;
								
	Запрос.УстановитьПараметр("КонтролироватьБюджет", 	 КонтролироватьБюджет);							
	Запрос.УстановитьПараметр("СинонимГрафикПлатежей", 	 НСтр("ru = 'График платежей'; en = 'Payment Schedule'"));
	Запрос.УстановитьПараметр("СинонимГрафикНачислений", НСтр("ru = 'График начислений'; en = 'Accrual Schedule'"));
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаТаблицаПоПообъектномуГрафикуПлатежей(НомераТаблиц)
				 + ТекстЗапросаТаблицаПоГрафикуПлатежей(НомераТаблиц)
				 + ТекстЗапросаТаблицаПоГрафикамДоговоров(НомераТаблиц)
				 + ТекстЗапросаТаблицаПоГрафикуВыдачиТраншей(НомераТаблиц)
				 + ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц, Реквизиты);

	Результат = Запрос.ВыполнитьПакет();
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	ПодготовитьТаблицуПоГрафикамДоговоровРасчетыВВалюте(ПараметрыПроведения.ТаблицаПоГрафикамДоговоров, 
		Реквизиты);
		
	ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ПараметрыПроведения.ИсполнениеБюджета, 
		ПараметрыПроведения.ИсполнениеБюджетаРеквизиты);																	
											
	Возврат ПараметрыПроведения;
	
КонецФункции

// Функция получает массив периодов для заполнения графика платежей.
//
// Параметры:
//  Периодичность	 - ПеречислениеСсылка.бит_ПереодичностьПланирования	- периодичность гарфика.
//  ДатаНачала		 - Дата - Левая граница графика.
//  ДатаОкончания	 - Дата - Правая граница графика. 
// 
// Возвращаемое значение:
//  Периоды - Массив, содержанщий периоды, входящие в границы.  
//
Функция ПолучитьМассивПериодов(Периодичность, Знач ДатаНачала, Знач ДатаОкончания) Экспорт

	Периоды = Новый Массив;
	Смещение = 1;
	НачалоПериода = ДатаНачала; 
	Пока НачалоПериода <= ДатаОкончания Цикл
		Периоды.Добавить(НачалоПериода);
		НачалоПериода = ДобавитьИнтервал(ДатаНачала, Периодичность, Смещение);
		Смещение = Смещение + 1;
	КонецЦикла;
    
    Возврат Периоды;
    
КонецФункции

// Процедура управляет видимостью полей назначенных аналитик.
// 
Процедура ВидимостьНазначенныхАналитик(Форма) Экспорт 
	
	Объект = Форма.Объект;
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	Для каждого Аналит Из НастройкиИзмерений Цикл
		
		Если Аналит.Значение.ЭтоСоставнойТип Тогда
			Продолжить;
		КонецЕсли;		
		
		// ++ЕРП
		Если Аналит.Значение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Организации")) Тогда
			СкрытьВидимостьНазначеннойАналитики(Форма, Аналит.Ключ);
		ИначеЕсли Аналит.Значение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
			СкрытьВидимостьНазначеннойАналитики(Форма, Аналит.Ключ);    
		ИначеЕсли Аналит.Значение.ТипЗначения.СодержитТип(Тип("СправочникСсылка.СтруктураПредприятия")) Тогда
			СкрытьВидимостьНазначеннойАналитики(Форма, Аналит.Ключ);	
		Иначе
			ТипыДоговоров = Метаданные.ОпределяемыеТипы.бит_ДоговорыКонтрагентов.Тип.Типы();
			Для каждого ТипДоговора Из ТипыДоговоров Цикл
				Если Аналит.Значение.ТипЗначения.СодержитТип(ТипДоговора) Тогда
					СкрытьВидимостьНазначеннойАналитики(Форма, Аналит.Ключ);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		//--ЕРП
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СкрытьВидимостьНазначеннойАналитики(Форма, ИмяАналитики) 
	
	Форма.Элементы[ИмяАналитики].Видимость 					    = Ложь;
	Форма.Элементы["ГрафикПлатежей" + ИмяАналитики].Видимость   = Ложь;
	Форма.Элементы["ГрафикНачислений" + ИмяАналитики].Видимость = Ложь;
			
КонецПроцедуры

// Функция формирует табличный документ с печатной формой графика платежей.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма.
//
Функция ПечатьГрафикаПлатежей(МассивСсылок)
	
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокСсылка = МассивСсылок[0];
	
	// Создаем табличный документ.
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ДополнительныеУсловияПоДоговору_ГрафикПлатежей";
	
	Если ЗначениеЗаполнено(ДокСсылка.ДоговорКонтрагента) Тогда
		ИсточникПараметров = ДокСсылка.ДоговорКонтрагента;
	Иначе
		ИсточникПараметров = ДокСсылка.ПроектДоговора;
	КонецЕсли;
	
	ДеревоСоставляющих = бит_Договоры.ДанныеПараметровФинДоговоров(ИсточникПараметров);
	ДеревоСоставляющих.Колонки.Значение.Имя	  = "ЗначениеПараметра";
	ДеревоСоставляющих.Колонки.ТипПлатежа.Имя = "ТипПлатежаПоФинДоговору";
	
	СоставляющаяПроцент = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.Проценты;
	// получим параметры расчета для составляющей платежа с типом "Проценты".
	ПараметрыРасчета = Обработки.бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.ПараметрыСоставляющей(СоставляющаяПроцент, ДеревоСоставляющих);
	Если ПараметрыРасчета.ТипПроцентнойСтавки = Перечисления.бит_ТипыПроцентныхСтавокПоФинансовымДоговорам.Фиксированная Тогда
		ПроцентнаяСтавка = ПараметрыРасчета.ПроцентнаяСтавка;
	Иначе
		ПроцентнаяСтавка = 0;
	КонецЕсли;
	
	ТаблицаГрафика = ДокСсылка.ГрафикПлатежей.Выгрузить();
	ТаблицаГрафика.Колонки.Добавить("ЗадолженностьПоОсновномуДолгу", Новый ОписаниеТипов("Число"));
	
	Структура = Обработки.бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.ПолучитьРезультатЗапросаПоГрафикуПлатежей(ТаблицаГрафика);
	
	СуммаДолга				 = ДокСсылка.ГрафикВыдачиТраншей.Итог("СуммаТранша");
	КоличествоПериодовВыплат = ДокСсылка.ГрафикВыдачиТраншей.Итог("КоличествоПериодовВыплат");

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СуммаДолга"				, СуммаДолга);
	СтруктураПараметров.Вставить("КоличествоПериодовВыплат"	, КоличествоПериодовВыплат);
	СтруктураПараметров.Вставить("ПроцентнаяСтавка"			, ПроцентнаяСтавка);
	СтруктураПараметров.Вставить("РезультатЗапроса"			, Структура.РезультатЗапроса);
	СтруктураПараметров.Вставить("СтруктураДопКолонок"		, Структура.СтруктураДопКолонок);
	СтруктураПараметров.Вставить("РассчитыватьЗадолженность", Истина);
	
	Обработки.бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.Печать(СтруктураПараметров, "ГрафикПлатежей", ТабДокумент);
	
	Возврат ТабДокумент;	
		
КонецФункции

// Функция добавляет интервал к дате
//
// Параметры:
//	Дата          - Дата - произвольная дата.
//	Периодичность - ПеречислениеСсылка.Периодичность - периодичность планирования по сценарию.
//	Смещение      - Число - определяет направление и количество периодов, в котором сдвигается дата.
//
// Возвращаемое значение:
//	Дата - дата, отстоящая от исходной на заданное количество периодов.
//
Функция ДобавитьИнтервал(Дата, Периодичность, Смещение)
	
	Если Смещение = 0 Тогда
		Результат = Дата;
		
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Неделя") Тогда
		Результат = Дата + Смещение * 7 * 24 * 3600;
		
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Декада") Тогда
		Результат = Дата + Смещение * 11 * 24 * 3600;
		
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Месяц") Тогда
		Результат = ДобавитьМесяц(Дата, Смещение);
		
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Квартал") Тогда
		Результат = ДобавитьМесяц(Дата, Смещение * 3);
		
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Полугодие") Тогда
		Результат = ДобавитьМесяц(Дата, Смещение * 6);
		
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_ПериодичностьПланирования.Год") Тогда
		Результат = ДобавитьМесяц(Дата, Смещение * 12);
		
	Иначе
		Результат = НачалоДня(Дата) + Смещение * 24 * 3600;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаТаблицаПоПообъектномуГрафикуПлатежей(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаПоПообъектномуГрафикуПлатежей", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТабЧасть.Объект КАК Объект,
	|	ТабЧасть.Период КАК Период,
	|	СУММА(ТабЧасть.Сумма) КАК СуммаПлатежа
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ПообъектныйГрафикПлатежей КАК ТабЧасть
	|ГДЕ
	|	ТабЧасть.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабЧасть.Объект,
	|	ТабЧасть.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Объект,
	|	Период";

	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Функция ТекстЗапросаТаблицаПоГрафикуПлатежей(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаПоГрафикуПлатежей", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТабЧасть.Период КАК Период,
	|	СУММА(ТабЧасть.СуммаБезНДС) КАК СуммаПлатежа
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК ТабЧасть
	|ГДЕ
	|	ТабЧасть.Ссылка = &Ссылка
	|	И ТабЧасть.Период > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабЧасть.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Функция ТекстЗапросаТаблицаПоГрафикамДоговоров(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаПоГрафикамДоговоров", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикПлатежей.Период КАК Период,
	|	ГрафикПлатежей.Ссылка.Сценарий КАК Сценарий,
	|	ГрафикПлатежей.ЦФО КАК ЦФО,
	|	ГрафикПлатежей.СтатьяОборотов КАК СтатьяОборотов,
	|	ГрафикПлатежей.СтатьяОборотов.ТипСтатьи КАК ТипСтатьи,
	|	ГрафикПлатежей.Ссылка.Контрагент КАК Контрагент,
	|	ГрафикПлатежей.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ГрафикПлатежей.Проект КАК Проект,
	|	ГрафикПлатежей.Аналитика_1 КАК Аналитика_1,
	|	ГрафикПлатежей.Аналитика_2 КАК Аналитика_2,
	|	ГрафикПлатежей.Аналитика_3 КАК Аналитика_3,
	|	ГрафикПлатежей.Аналитика_4 КАК Аналитика_4,
	|	ГрафикПлатежей.Аналитика_5 КАК Аналитика_5,
	|	ГрафикПлатежей.Аналитика_6 КАК Аналитика_6,
	|	ГрафикПлатежей.Аналитика_7 КАК Аналитика_7,
	|	ГрафикПлатежей.Аналитика_8 КАК Аналитика_8,
	|	ГрафикПлатежей.Аналитика_9 КАК Аналитика_9,
	|	ГрафикПлатежей.Аналитика_10 КАК Аналитика_10,
	|	ГрафикПлатежей.Аналитика_11 КАК Аналитика_11,
	|	ГрафикПлатежей.Аналитика_12 КАК Аналитика_12,
	|	ГрафикПлатежей.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ГрафикПлатежей.Сумма) КАК Сумма,
	|	СУММА(ГрафикПлатежей.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ГрафикПлатежей.НДС) КАК НДС,
	|	ГрафикПлатежей.РасходДоход КАК РасходДоход,
	|	ГрафикПлатежей.СтатьяОборотов.РасходДоход КАК РасходДоходСтатьиОборотов,
	|	ГрафикПлатежей.СоставляющаяПлатежа КАК СоставляющаяПлатежа,
	|	0 КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаСценарий,
	|	0 КАК СуммаБезНДСРегл,
	|	0 КАК СуммаБезНДСУпр,
	|	0 КАК СуммаБезНДССценарий,
	|	ГрафикПлатежей.СтатьяОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК ГрафикПлатежей
	|ГДЕ
	|	ГрафикПлатежей.Ссылка = &Ссылка
	|	И ГрафикПлатежей.Период > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикПлатежей.Ссылка.Сценарий,
	|	ГрафикПлатежей.ЦФО,
	|	ГрафикПлатежей.СтатьяОборотов,
	|	ГрафикПлатежей.СтавкаНДС,
	|	ГрафикПлатежей.Проект,
	|	ГрафикПлатежей.Ссылка.ДоговорКонтрагента,
	|	ГрафикПлатежей.Аналитика_1,
	|	ГрафикПлатежей.Аналитика_2,
	|	ГрафикПлатежей.Аналитика_3,
	|	ГрафикПлатежей.Аналитика_4,
	|	ГрафикПлатежей.Аналитика_5,
	|	ГрафикПлатежей.Аналитика_6,
	|	ГрафикПлатежей.Аналитика_7,
	|	ГрафикПлатежей.Аналитика_8,
	|	ГрафикПлатежей.Аналитика_9,
	|	ГрафикПлатежей.Аналитика_10,
	|	ГрафикПлатежей.Аналитика_11,
	|	ГрафикПлатежей.Аналитика_12,
	|	ГрафикПлатежей.Ссылка.Контрагент,
	|	ГрафикПлатежей.РасходДоход,
	|	ГрафикПлатежей.Период,
	|	ГрафикПлатежей.СтатьяОборотов.ТипСтатьи,
	|	ГрафикПлатежей.СтатьяОборотов.РасходДоход,
	|	ГрафикПлатежей.СоставляющаяПлатежа,
	|	ГрафикПлатежей.СтатьяОборотов.ЭтоКоэффициент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГрафикНачислений.Период,
	|	ГрафикНачислений.Ссылка.Сценарий,
	|	ГрафикНачислений.ЦФО,
	|	ГрафикНачислений.СтатьяОборотовНачисления,
	|	ГрафикНачислений.СтатьяОборотовНачисления.ТипСтатьи,
	|	ГрафикНачислений.Ссылка.Контрагент,
	|	ГрафикНачислений.Ссылка.ДоговорКонтрагента,
	|	ГрафикНачислений.Проект,
	|	ГрафикНачислений.Аналитика_1,
	|	ГрафикНачислений.Аналитика_2,
	|	ГрафикНачислений.Аналитика_3,
	|	ГрафикНачислений.Аналитика_4,
	|	ГрафикНачислений.Аналитика_5,
	|	ГрафикНачислений.Аналитика_6,
	|	ГрафикНачислений.Аналитика_7,
	|	ГрафикНачислений.Аналитика_8,
	|	ГрафикНачислений.Аналитика_9,
	|	ГрафикНачислений.Аналитика_10,
	|	ГрафикНачислений.Аналитика_11,
	|	ГрафикНачислений.Аналитика_12,
	|	ГрафикНачислений.СтавкаНДС,
	|	СУММА(ГрафикНачислений.Сумма),
	|	СУММА(ГрафикНачислений.СуммаБезНДС),
	|	СУММА(ГрафикНачислений.НДС),
	|	ГрафикНачислений.РасходДоход,
	|	ГрафикНачислений.СтатьяОборотовНачисления.РасходДоход,
	|	ГрафикНачислений.СоставляющаяПлатежа,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ГрафикНачислений.СтатьяОборотовНачисления.ЭтоКоэффициент
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикНачислений КАК ГрафикНачислений
	|ГДЕ
	|	ГрафикНачислений.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикНачислений.Период,
	|	ГрафикНачислений.Ссылка.Сценарий,
	|	ГрафикНачислений.Ссылка.ДоговорКонтрагента,
	|	ГрафикНачислений.ЦФО,
	|	ГрафикНачислений.РасходДоход,
	|	ГрафикНачислений.СтатьяОборотовНачисления,
	|	ГрафикНачислений.Ссылка.Контрагент,
	|	ГрафикНачислений.Проект,
	|	ГрафикНачислений.СтавкаНДС,
	|	ГрафикНачислений.Аналитика_1,
	|	ГрафикНачислений.Аналитика_2,
	|	ГрафикНачислений.Аналитика_3,
	|	ГрафикНачислений.Аналитика_4,
	|	ГрафикНачислений.Аналитика_5,
	|	ГрафикНачислений.Аналитика_6,
	|	ГрафикНачислений.Аналитика_7,
	|	ГрафикНачислений.Аналитика_8,
	|	ГрафикНачислений.Аналитика_9,
	|	ГрафикНачислений.Аналитика_10,
	|	ГрафикНачислений.Аналитика_11,
	|	ГрафикНачислений.Аналитика_12,
	|	ГрафикНачислений.СтатьяОборотовНачисления.ТипСтатьи,
	|	ГрафикНачислений.СтатьяОборотовНачисления.РасходДоход,
	|	ГрафикНачислений.СоставляющаяПлатежа,
	|	ГрафикНачислений.СтатьяОборотовНачисления.ЭтоКоэффициент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Функция ТекстЗапросаТаблицаПоГрафикуВыдачиТраншей(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаПоГрафикуВыдачиТраншей", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.Ссылка КАК Ссылка,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.Ссылка.Организация КАК Организация,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.Ссылка.Контрагент КАК Контрагент,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.Ссылка.ПроектДоговора КАК ПроектДоговора,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.ДатаТранша КАК Период,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.ДатаТранша КАК ДатаТранша,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.ДатаПогашения КАК ДатаПогашения,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.СуммаТранша КАК Сумма,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.МесяцПервогоПлатежа КАК МесяцПервогоПлатежа,
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.КоличествоПериодовВыплат КАК КоличествоПериодовВыплат
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикВыдачиТраншей КАК бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей
	|ГДЕ
	|	бит_ДополнительныеУсловияПоДоговоруГрафикВыдачиТраншей.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Функция ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц, Реквизиты)

	Если Реквизиты.НеКонтролироватьПоБюджету Тогда
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ИсполнениеБюджетаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ИсполнениеБюджета", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.Сценарий.Валюта КАК ВалютаСценария,
	|	Реквизиты.Сценарий.ИспользоватьКурсыСценария КАК ИспользоватьКурсыСценария,
	|	&КонтролироватьБюджет КАК КонтролироватьБюджет,
	|	ЗНАЧЕНИЕ(Перечисление.бит_РежимыКонтроляПоБюджету.ГрафикиДоговоров) КАК РежимКонтроля,
	|	Реквизиты.Сценарий КАК СценарийКонтролируемый,
	|	ЛОЖЬ КАК НеУчитыватьСверхБюджета,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.КурсДокумента КАК КурсДокумента,
	|	Реквизиты.КратностьДокумента КАК КратностьДокумента,
	|	Реквизиты.СверхБюджета КАК СверхБюджета,
	|	ЛОЖЬ КАК СписатьЛимиты
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""ГрафикПлатежей"" КАК ИмяСписка,
	|	&СинонимГрафикПлатежей КАК СинонимСписка,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Период КАК Период,
	|	Таблица.ЦФО КАК ЦФО,
	|	Таблица.СтатьяОборотов КАК СтатьяОборотов,
	|	Таблица.Аналитика_1 КАК Аналитика_1,
	|	Таблица.Аналитика_2 КАК Аналитика_2,
	|	Таблица.Аналитика_3 КАК Аналитика_3,
	|	Таблица.Аналитика_4 КАК Аналитика_4,
	|	Таблица.Аналитика_5 КАК Аналитика_5,
	|	Таблица.Аналитика_6 КАК Аналитика_6,
	|	Таблица.Аналитика_7 КАК Аналитика_7,
	|	Таблица.Аналитика_8 КАК Аналитика_8,
	|	Таблица.Аналитика_9 КАК Аналитика_9,
	|	Таблица.Аналитика_10 КАК Аналитика_10,
	|	Таблица.Аналитика_11 КАК Аналитика_11,
	|	Таблица.Аналитика_12 КАК Аналитика_12,
	|	Таблица.Сумма КАК Сумма,
	|	0 КАК Количество,
	|	ИСТИНА КАК КонтролироватьСумму,
	|	ЛОЖЬ КАК КонтролироватьКоличество,
	|	НЕ Таблица.СтатьяОборотов.НеКонтролировать_Графики КАК КонтролироватьПоСтатье
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И Таблица.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ГрафикНачислений"",
	|	&СинонимГрафикНачислений,
	|	Таблица.НомерСтроки,
	|	Таблица.Период,
	|	Таблица.ЦФО,
	|	Таблица.СтатьяОборотовНачисления,
	|	Таблица.Аналитика_1,
	|	Таблица.Аналитика_2,
	|	Таблица.Аналитика_3,
	|	Таблица.Аналитика_4,
	|	Таблица.Аналитика_5,
	|	Таблица.Аналитика_6,
	|	Таблица.Аналитика_7,
	|	Таблица.Аналитика_8,
	|	Таблица.Аналитика_9,
	|	Таблица.Аналитика_10,
	|	Таблица.Аналитика_11,
	|	Таблица.Аналитика_12,
	|	Таблица.Сумма,
	|	0,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	НЕ Таблица.СтатьяОборотовНачисления.НеКонтролировать_Графики
	|ИЗ
	|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикНачислений КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И Таблица.СтатьяОборотовНачисления.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
		
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции

Процедура ПодготовитьТаблицуПоГрафикамДоговоровРасчетыВВалюте(ТаблицаГрафиковДоговоров, Реквизиты)
	
	Если НЕ Реквизиты.ИспользоватьКурсыСценария Тогда
		Возврат;
	КонецЕсли;
	
	ВидыКурсов = Новый Структура;
	ВидыКурсов.Вставить("Документ");
	ВидыКурсов.Вставить("Регл");
	ВидыКурсов.Вставить("Упр");
	ВидыКурсов.Вставить("Сценарий");
	КурсыВалют = бит_Бюджетирование.КурсыВалютСценария(Реквизиты.Регистратор, Реквизиты.Период, ВидыКурсов);
	
	КурсыПоПериодам = Неопределено;
	
	Если Реквизиты.ИспользоватьКурсыСценария Тогда
		ТаблицаПериодов = ТаблицаГрафиковДоговоров.Скопировать(, "Период");
		ТаблицаПериодов.Свернуть("Период");		
		ПараметрыКурсов = бит_Бюджетирование.ЗаполнитьСтруктуруПараметровПолученияКурсовПоПериодам(Реквизиты.Сценарий, Реквизиты.ВалютаДокумента);
		КурсыПоПериодам = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, ПараметрыКурсов, Реквизиты.Сценарий);
	КонецЕсли;
	
	бит_Бюджетирование.ВыполнитьПересчетыВТаблицеОборотов(ТаблицаГрафиковДоговоров, КурсыПоПериодам, 
		КурсыВалют, "СуммаБезНДС");
	
КонецПроцедуры

Процедура ПодготовитьТаблицуИсполнениеБюджетаРасчетыВВалюте(ИсполнениеБюджета, ИсполнениеБюджетаРеквизиты)

	Если НЕ ЗначениеЗаполнено(ИсполнениеБюджета) ИЛИ НЕ ЗначениеЗаполнено(ИсполнениеБюджетаРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ИсполнениеБюджетаРеквизиты[0];
	
	Если Реквизиты.ИспользоватьКурсыСценария Тогда
		Для каждого СтрокаТаблицы Из ИсполнениеБюджета Цикл			
			КурсВалютыСценария 	= бит_КурсыВалют.ПолучитьКурсВалюты(Реквизиты.ВалютаСценария, 
									СтрокаТаблицы.Период, "бит_КурсыСценариевПланирования", Реквизиты.Сценарий);			
			КурсВалютыДокумента = бит_КурсыВалют.ПолучитьКурсВалюты(Реквизиты.ВалютаДокумента, 
									СтрокаТаблицы.Период, "бит_КурсыСценариевПланирования", Реквизиты.Сценарий);
			
			СтрокаТаблицы.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
										СтрокаТаблицы.Сумма, КурсВалютыДокумента, КурсВалютыСценария);		
		КонецЦикла; 
	Иначе
		КурсВалютыДокумента = Новый Структура;
		КурсВалютыДокумента.Вставить("Валюта", 	 Реквизиты.ВалютаДокумента);
		КурсВалютыДокумента.Вставить("Курс", 	 Реквизиты.КурсДокумента);
		КурсВалютыДокумента.Вставить("Кратность", Реквизиты.КратностьДокумента);
		
		КурсВалютыСценария = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Реквизиты.ВалютаСценария, Реквизиты.Дата);
		
		Для каждого СтрокаТаблицы Из ИсполнениеБюджета Цикл
			СтрокаТаблицы.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
										СтрокаТаблицы.Сумма, КурсВалютыДокумента, КурсВалютыСценария);
		КонецЦикла;																	
	КонецЕсли;							

КонецПроцедуры
 
#КонецОбласти	

#КонецЕсли