#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 	
		бит_ОбщегоНазначения.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект, Ложь);

	ПараметрыПроведения = Документы.бит_УстановкаНеснижаемыхОстатков.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Документы.бит_УстановкаНеснижаемыхОстатков.СформироватНеснижаемыеОстатки(
		ПараметрыПроведения.НеснижаемыеОстаткиТаблица,
		ПараметрыПроведения.НеснижаемыеОстаткиРеквизиты,
		Движения, Отказ);
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
               
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
    ЕстьКассы = бит_РаботаСМетаданными.ЕстьСправочник("Кассы"); // Адаптация для ERP
    Если ЕстьКассы Тогда
         ПроверяемыеРеквизиты.Добавить("НеснижаемыеОстатки.БанковскийСчет");
    КонецЕсли;
    
	ПроверяемыеЗначения = Новый Соответствие; 
	Для каждого СтрокаТаблицы Из НеснижаемыеОстатки Цикл
		
		Если ЕстьКассы Тогда
			ЗначениеДляПроверки = СтрокаТаблицы.БанковскийСчет;
			СинонимПоля = НСтр("ru = 'Банковский счет / Касса';en = 'Bank Account / Cash account'"); 
			ИмяПоля 	= "БанковскийСчет";
		Иначе
			// Пустой БанковскийСчет понимается, как "Касса". 
			Если ЗначениеЗаполнено(СтрокаТаблицы.БанковскийСчет) Тогда
				ЗначениеДляПроверки = СтрокаТаблицы.БанковскийСчет;
				СинонимПоля = НСтр("ru = 'Банковский счет / Касса';en = 'Bank Account / Cash account'");
				ИмяПоля 	= "БанковскийСчет";
			Иначе	
				ЗначениеДляПроверки = СтрокаТаблицы.Валюта;
				СинонимПоля = НСтр("ru = 'Валюта';en = 'Currency'");
				ИмяПоля 	= "Валюта";
			КонецЕсли;
		КонецЕсли;
		
		Результат = ПроверяемыеЗначения.Получить(ЗначениеДляПроверки);
		Если Результат = Неопределено Тогда
			ПроверяемыеЗначения.Вставить(ЗначениеДляПроверки, ЗначениеДляПроверки);
			Продолжить;
		КонецЕсли;
		
		ТекстПояснения = НСтр("ru = 'Значение повторяется.'; en = 'The value is repeated.'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка" , "Корректность", 
							СинонимПоля, формат(СтрокаТаблицы.НомерСтроки, "ЧГ="), 
							НСтр("ru = 'Неснижаемые остатки';en = 'Minimum Balances'"), ТекстПояснения);
							
		Поле = СтрШаблон("НеснижаемыеОстатки[%1].%2", СтрокаТаблицы.НомерСтроки - 1, ИмяПоля);					
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, ,Отказ); 
	КонецЦикла; 

    
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	БсСоставной = бит_РаботаСМетаданными.ЭтотРеквизитСоставногоТипа("БанковскийСчет", Метаданные(), "НеснижаемыеОстатки");
    Если БсСоставной Тогда
        // Приведение пустого значения составного типа к Неопределено.
        Для каждого СтрТаб Из НеснижаемыеОстатки Цикл
            Если НЕ ЗначениеЗаполнено(СтрТаб.БанковскийСчет) Тогда
                СтрТаб.БанковскийСчет = Неопределено;           
            КонецЕсли;                                       
        КонецЦикла;
    КонецЕсли;
    		
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли