&После("ПриСозданииНаСервере")
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	ДобавитьКолонкуЗаказаНаПроизводство("Серии", "Объект.Серии.Серия.бит_ЗаказНаПроизводство");
	ДобавитьКолонкуЗаказаНаПроизводство("ОстаткиСерий", "ОстаткиСерий.Серия.бит_ЗаказНаПроизводство");
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкуЗаказаНаПроизводство(ИмяТаблицы, ПутьКДанным)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	ИмяКолонки = ИмяТаблицы + "бит_ЗаказНаПроизводство";
	Если Элементы.Найти(ИмяКолонки) <> Неопределено
		Или Элементы.Найти(ИмяТаблицы) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяКолонка = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), Элементы[ИмяТаблицы]);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ПутьКДанным = ПутьКДанным;
	НоваяКолонка.Заголовок = "(бит) Заказ на производство";
	НоваяКолонка.ТолькоПросмотр = Истина;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецПроцедуры
