#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

// Процедура формирует движения по регистру бит_ОборотыПоБюджетам. 
//
// Параметры:
//  Движения - ДвиженияДокумента
//  ТаблицаОбороты - ТаблицаЗначений
//  Отказ - Булево
//
Процедура ОтразитьДвижения(Движения, ТаблицаОбороты, Отказ) Экспорт

	Если Отказ ИЛИ ТаблицаОбороты.Количество() = 0 Тогда
	
		 Возврат;
	
	КонецЕсли; 
	
	// Движения по регистру обороты по бюджетам
	ТаблицаДвижений = Движения.бит_ОборотыПоБюджетам.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаОбороты Цикл
		
		НоваяСтрока = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла; 
	
	Движения.бит_ОборотыПоБюджетам.Записывать = Истина;
	Движения.бит_ОборотыПоБюджетам.мТаблицаДвижений = ТаблицаДвижений;
	Движения.бит_ОборотыПоБюджетам.ДобавитьДвижение();

КонецПроцедуры // ОтразитьДвижения()

#КонецОбласти

#КонецЕсли  