#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мПериод Экспорт; // Период движений.

Перем мТаблицаДвижений Экспорт; // Таблица движений.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// ++ ЕРП 
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	// -- ЕРП 
	
	ОтборРегистратор = ЭтотОбъект.Отбор.Найти("Регистратор");
	Если ОтборРегистратор = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не установлен отбор по регистратору.'"); 	
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	// В случае если типы значения дополнительных аналитик не совпадают с типами 
	// назначенных измерениям аналитик ставим Неопределено.
	бит_МеханизмДопИзмерений.КонтрольТиповДополнительныАналитик(ЭтотОбъект);
	
	бит_Бюджетирование.ЗаполнитьКлючиАналитикВНаборе(ЭтотОбъект);
	
	// Обработчик подписки "ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписей".
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписей(ЭтотОбъект, Отказ, Замещение);
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьФиксациюБюджета") Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка фиксации
	
	// Проверяем предыдущие движения на наличе зафиксированных данных.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ОтборРегистратор.Значение);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыПоБюджетам.Период КАК Период,
	|	ОборотыПоБюджетам.Сценарий КАК Сценарий,
	|	ОборотыПоБюджетам.ЦФО КАК ЦФО
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам КАК ОборотыПоБюджетам
	|ГДЕ
	|	ОборотыПоБюджетам.Регистратор = &Регистратор";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ДанныеБазы = Результат.Выгрузить();
		бит_Бюджетирование.ПроверитьФиксацию(ДанныеБазы[0].Сценарий, ДанныеБазы, Отказ, Истина);
	КонецЕсли;
	
	Если Количество() > 0 И НЕ Отказ Тогда
		// Проверяем текущие движения на наличе зафиксированных данных.
		ТабДвижений = Выгрузить();
		бит_Бюджетирование.ПроверитьФиксацию(ТабДвижений[0].Сценарий, ТабДвижений, Отказ, Истина);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - обработчик события "ДобавитьДвижение" объекта.
// 
Процедура ДобавитьДвижение() Экспорт
	
	мТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");

	бит_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект);
	
КонецПроцедуры // ДобавитьДвижение()
 
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли