
Процедура бит_СправочникиПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [27.02.2025 21:20:01] +        
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.РесурсныеСпецификации") Тогда
		бит_РасчетВозвратныхОтходов.ПодпискаПриЗаписиРесурснойСпецификации(Источник.Ссылка);	
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ 1.3.4.1]  [VUVaynula@1cbit.ru] [27.02.2025 21:20:01] -   
	
	// {{ПервыйБИТ ЛистТребований [ЛТ0.1]  [VUVaynula@1cbit.ru] [25.11.2025 21:40:24] +        
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура") Тогда
		Если Источник.ДополнительныеСвойства.Свойство("НеСинхронизироватьВес") = Ложь Тогда
			ОбновитьПризнакВесНЕТТО(Источник.Ссылка, Не Источник.ОбменДанными.Загрузка);	
		КонецЕсли;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ0.1]  [VUVaynula@1cbit.ru] [25.11.2025 21:40:24] -
КонецПроцедуры

Процедура бит_ДокументыПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ 5.32]  [VUVaynula@1cbit.ru] [05.05.2025 16:43:52] +
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЭтапПроизводства2_2") Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
			И Источник.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен 
			И Источник.бит_РучнойВводМатериалов = Ложь Тогда
			бит_ЭтапПроизводства.ПересчитатьОбеспечениеЭтапаПоСпецификации(Источник);
		КонецЕсли;
	КонецЕсли;	
	// }}ПервыйБИТ ЛистТребований [ЛТ 5.32]  [VUVaynula@1cbit.ru] [05.05.2025 16:43:52] -
КонецПроцедуры

Процедура бит_ДокументыОбработкаПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:18:19] +        
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПроизводственнаяОперация2_2") Тогда 
		бит_РаботаСАтрибутамиСерии.ПроверитьКоличествоВСтрокеИСерии(Источник, Отказ);	
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЭтапПроизводства2_2") Тогда 
		бит_РаботаСАтрибутамиСерии.ПроверитьКоличествоВСтрокеИСерии(Источник, Отказ);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ДвижениеПродукцииИМатериалов") Тогда 
		бит_РаботаСАтрибутамиСерии.ПроверитьКоличествоВСтрокеИСерии(Источник, Отказ);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПроизводствоБезЗаказа") Тогда 
		бит_РаботаСАтрибутамиСерии.ПроверитьКоличествоВСтрокеИСерии(Источник, Отказ);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:18:19] -
КонецПроцедуры

Процедура бит_СправочникиПередЗаписьюПередЗаписью(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.РесурсныеСпецификации") Тогда 
		// {{ПервыйБИТ ЛистТребований [ЛТ5.12]  [VUVaynula@1cbit.ru] [29.07.2025 3:32:58] +        
		бит_РасчетДанныхРесурснойСпецификации.РассчитатьНеттоРасчетный(Источник, Отказ);
		// }}ПервыйБИТ ЛистТребований [ЛТ5.12]  [VUVaynula@1cbit.ru] [29.07.2025 3:32:58] -
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбновитьПризнакВесНЕТТО(НоменклатураСсылка, ВыводитьСообщение = Ложь)
	// {{ПервыйБИТ ЛистТребований [ЛТ0.1]  [VUVaynula@1cbit.ru] [25.11.2025 21:43:15] +        
	ПризнакВес = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ПризнакВесНетто, , Истина);
	Если Не ЗначениеЗаполнено(ПризнакВес) 
		Или Не ЗначениеЗаполнено(НоменклатураСсылка.ВесЧислитель) 
		Или Не НоменклатураСсылка.ВесИспользовать Тогда
		Возврат;
	КонецЕсли;
	КГ = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду(166);
	
	НЗ = РегистрыСведений.бит_ЗначенияПризнаковНоменклатуры.СоздатьНаборЗаписей();
	НЗ.ДополнительныеСвойства.Вставить("НеСинхронизироватьВес", Истина);
	НЗ.Отбор.бит_Номенклатура.Установить(НоменклатураСсылка);
	НЗ.Отбор.бит_Признак.Установить(ПризнакВес);
	Запись = НЗ.Добавить();
	Запись.бит_Номенклатура = НоменклатураСсылка;
	Запись.бит_Признак = ПризнакВес;
	Запись.бит_ПризнакСертификации = ПризнакВес.бит_ПризнакСертификации;
	
	Если ЗначениеЗаполнено(НоменклатураСсылка.ВесЕдиницаИзмерения.Знаменатель) Тогда
		коэфУпак = НоменклатураСсылка.ВесЕдиницаИзмерения.Числитель / НоменклатураСсылка.ВесЕдиницаИзмерения.Знаменатель;
	Иначе                                                               
		коэфУпак = НоменклатураСсылка.ВесЕдиницаИзмерения.Числитель;
	КонецЕсли;
	Если коэфУпак = 0 Тогда 
		коэфУпак = 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(запись.бит_Номенклатура.ВесЗнаменатель) Тогда
		Вес = запись.бит_Номенклатура.ВесЧислитель/запись.бит_Номенклатура.ВесЗнаменатель;
	Иначе                                         
		Вес = запись.бит_Номенклатура.ВесЧислитель;
	КонецЕсли;
		
	Запись.бит_Значение = коэфУпак * Вес;
	
	НЗ.Записать();
	Если ВыводитьСообщение Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Скорректировано значение признака Вес НЕТТО (MKF)");
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ0.1]  [VUVaynula@1cbit.ru] [25.11.2025 21:43:15] -
КонецПроцедуры