
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] +        
	
	НовыйЭлемент = Элементы.Добавить("бит_ТоварыВесНетто", Тип("ПолеФормы"), Элементы.Товары); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_ВесНетто"; 
	НовыйЭлемент.ТолькоПросмотр = Истина;
    Элементы.Переместить(НовыйЭлемент, Элементы.Товары, Элементы.ТоварыВидЦены);
	
	НовыйЭлемент = Элементы.Добавить("бит_ТоварыВесБрутто", Тип("ПолеФормы"), Элементы.Товары); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_ВесБрутто";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	Элементы.Переместить(НовыйЭлемент, Элементы.Товары, Элементы.ТоварыВидЦены);
	
	НовыйЭлемент = Элементы.Добавить("бит_ТоварыТипТары", Тип("ПолеФормы"), Элементы.Товары); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_ТипТары";
	НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
	НовыйЭлемент.КнопкаВыбора = Истина;
	НовыйЭлемент.ОтображениеКНопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	Элементы.Переместить(НовыйЭлемент, Элементы.Товары, Элементы.ТоварыВидЦены);
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "бит_ТоварыТипТарыНачалоВыбора");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ТоварыТипТарыПриИзменении");
	
	
	НовыйЭлемент = Элементы.Добавить("бит_ТоварыКоличествоТары", Тип("ПолеФормы"), Элементы.Товары); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_КоличествоТары";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	Элементы.Переместить(НовыйЭлемент, Элементы.Товары, Элементы.ТоварыВидЦены);
	
	НовыйЭлемент = Элементы.Добавить("бит_Товарыбит_Толеранс", Тип("ПолеФормы"), Элементы.Товары); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_Толеранс";
	Элементы.Переместить(НовыйЭлемент, Элементы.Товары, Элементы.ТоварыВидЦены);
	
	НовыйЭлемент = Элементы.Добавить("бит_ТоварыНамотка", Тип("ПолеФормы"), Элементы.Товары); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_Намотка";
	//НовыйЭлемент.ТолькоПросмотр = Истина;
	Элементы.Переместить(НовыйЭлемент, Элементы.Товары, Элементы.ТоварыВидЦены);
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "НамоткаПриИзменении");
	
	ОписаниеКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3));
	
	МассивРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы("бит_ИтогоБрутто", ОписаниеКоличества);
	МассивРеквизитов.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("бит_ИтогоНетто", ОписаниеКоличества);
	МассивРеквизитов.Добавить(НовыйРеквизит);

	ИзменитьРеквизиты(МассивРеквизитов);
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ИтогоБрутто", Тип("ПолеФормы"), Элементы.ГруппаИтого);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_ИтогоБрутто";
	НовыйЭлемент.Заголовок = "(бит) Итого Брутто";
	НовыйЭлемент.ТолькоПросмотр = Истина; 
	НовыйЭлемент.ЦветРамки = ЦветаСтиля.ЦветРамки;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ИтогоНетто", Тип("ПолеФормы"), Элементы.ГруппаИтого);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_ИтогоНетто";
	НовыйЭлемент.Заголовок = "(бит) Итого Нетто";
	НовыйЭлемент.ТолькоПросмотр = Истина;
    НовыйЭлемент.ЦветРамки = ЦветаСтиля.ЦветРамки;
	
	ЭтаФорма.бит_ИтогоНетто = Объект.Товары.Итог("бит_ВесНетто");
	ЭтаФорма.бит_ИтогоБрутто = Объект.Товары.Итог("бит_ВесБрутто");	
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] -
		
	// {{ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [19.08.2024] +        
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
	
		Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
	
	КонецЕсли;
	
	Если НЕ РольДоступна("бит_ПравоРедактированияКомментария") 
		И НЕ РольДоступна("ПолныеПрава") Тогда
		
		Если Объект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда	
		
			Элементы.Комментарий.ТолькоПросмотр = Истина;
		
		КонецЕсли;
		
	КонецЕсли;
		
	//Элементы.Комментарий.ТолькоПросмотр = Истина;
	//
	//СписокСтатусов = Новый СписокЗначений;
	//СписокСтатусов.Добавить(Перечисления.СтатусыЗаказовКлиентов.КОбеспечению);
	//СписокСтатусов.Добавить(Перечисления.СтатусыЗаказовКлиентов.КОтгрузке);
	//СписокСтатусов.Добавить(Перечисления.СтатусыЗаказовКлиентов.Закрыт);
	//
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Комментарий.Имя);
	//Элемент.Отбор.Элементы.Очистить();
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Статус");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//ОтборЭлемента.ПравоеЗначение = СписокСтатусов;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	//Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветФонаВнимание);
	
	// }}ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [19.08.2024] -
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ12] [ASHolyavko@1cbit.ru] [20.08.2024] +        
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Толеранс", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Толеранс";
	НовыйЭлемент.Заголовок = "(бит) Толеранс";
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.бит_Толеранс = Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ12] [ASHolyavko@1cbit.ru] [20.08.2024] - 

// ПервыйБИТ ЛистТребований ЛТ 7  KAKravchenko@1cbit.ru 12.12.2024 +
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СрокИзготовления", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СрокИзготовления";
	НовыйЭлемент.Заголовок = "(бит) Срок изготовления";  
	
	НовыйЭлемент = Элементы.Добавить("бит_ИзготовитьК", Тип("ПолеФормы"), Элементы.Товары); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.бит_ИзготовитьК";
	// Отключено по просьбе М. Колногорова 06.05.25
	//НовыйЭлемент.ТолькоПросмотр = Истина; 
	
	Элементы.Переместить(НовыйЭлемент, Элементы.Товары, Элементы.ТоварыВидЦены);
// ПервыйБИТ ЛистТребований ЛТ 7  KAKravchenko@1cbit.ru 12.12.2024 –

	// Первыйбит ЛТ3.6 ЛапшовГ "GVLapshov@1cbit.ru" 03.03.2025  +
	НовыйЭлемент = Элементы.Добавить("бит_НомерСделкиИзККСС", Тип("ПолеФормы"), Элементы.ГруппаОсновное); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НомерСделкиИзККСС";
	// Первыйбит ЛТ3.6 ЛапшовГ "GVLapshov@1cbit.ru" 03.03.2025  -
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.20] [ASHolyavko@1cbit.ru] [04.08.2025] +        
	
	НовыйЭлемент = Элементы.Добавить("бит_ВидЗаказа", Тип("ПолеФормы"), Элементы.ГруппаОсновное); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВидЗаказа";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ВидЗаказаПриИзменении");
	
	НоваяГруппа = Этаформа.Элементы.Вставить("бит_ГруппаДат", Тип("ГруппаФормы"), Элементы.ГруппаОсновное, Неопределено);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок = "бит_ГруппаДат";
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = Элементы.Добавить("бит_ДатаПоступленияОригиналовДокументов", Тип("ПолеФормы"), НоваяГруппа); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ДатаПоступленияОригиналовДокументов"; 
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	Если РольДоступна("ПолныеПрава")
		ИЛИ РольДоступна("Администрирование")
		ИЛИ РольДоступна("бит_СотрудникОтделаОбработкиЗаказов") Тогда
		НовыйЭлемент.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	НовыйЭлемент = Элементы.Добавить("бит_РасчетнаяДатаДляПЗ", Тип("ПолеФормы"), НоваяГруппа); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_РасчетнаяДатаДляПЗ";
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.20] [ASHolyavko@1cbit.ru] [04.08.2025] -
		
КонецПроцедуры

&НаКлиенте
Процедура бит_ТоварыТипТарыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] + 
	
	СтандартнаяОбработка = Ложь;
	
   	//Создаем структуру с отбором и добавляем значения
    ПараметрыОтбора = Новый Структура;
    //ПараметрыОтбора.Вставить("ВидНоменклатуры", НоменклатураТара());
    //ПараметрыОтбора.Вставить("ПометкаУдаления", Ложь);
	ПараметрыОтбора.Вставить("НоменклатураГП", Элементы.Товары.ТекущиеДанные.Номенклатура);
	
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); ///Добавляем отбор в параметры формы

    ПараметрыФормы.Вставить("РежимВыбора",Истина);

    //ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма);

    ОткрытьФорму("РегистрСведений.бит_НамоткаНоменклатуры.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
КонецПроцедуры


&НаСервере
Функция НоменклатураТара()

	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] +	
	
	Возврат Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Тара").Ссылка;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
КонецФункции


&НаКлиенте
Процедура бит_ОбработкаВыбораПеред(ВыбранноеЗначение, ИсточникВыбора)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] +
	
	Если ИсточникВыбора.ИмяФормы = "РегистрСведений.бит_НамоткаНоменклатуры.Форма.ФормаВыбора" Тогда
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
		
			ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
			
			ПолучитьНамоткуПоТаре(ТекущиеДанные, ВыбранноеЗначение);
			
		КонецЕсли;
		
	КонецЕсли;	
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] -	
		
КонецПроцедуры

&НаКлиенте
Процедура бит_ТоварыТипТарыПриИзменении(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] +	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.бит_ТипТары) Тогда 
		ТекущиеДанные.бит_КоличествоТары = 0;
		ТекущиеДанные.бит_Намотка = 0;	
		РасчитатьВес(ТекущиеДанные, ТекущиеДанные.бит_Намотка)
	КонецЕсли;	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
КонецПроцедуры 

&НаКлиенте
Процедура ПолучитьНамоткуПоТаре(ТекущиеДанные, Структура)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [02.09.2024] +        
	
	Намотка = Структура.Намотка;

	Если ЗначениеЗаполнено(Структура.Номенклатура) Тогда
		
		Если Структура.Несопоставимо Тогда
			
			ПоказатьПредупреждение(, "Выбраны несопоставимые данные!");	
			
			ТекущиеДанные.бит_ТипТары = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			
			РасчитатьВес(ТекущиеДанные, 0)
			
		Иначе	
			
			ТекущиеДанные.бит_ТипТары = Структура.Номенклатура;
			
			ТекущиеДанные.бит_Намотка = Намотка;
			
			РасчитатьВес(ТекущиеДанные, Намотка);
			
		КонецЕсли;
		
	Иначе
		
		РасчитатьВес(ТекущиеДанные, 0);
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [02.09.2024] -
		
КонецПроцедуры

&НаСервере
Функция ПолучитьВесНоменклатуры(Номенклатура, Упаковка)
	
	Возврат Номенклатура.ВесЧислитель;
	
КонецФункции

&НаСервере
Функция ПолучитьНамоткуНоменклатуры(НоменклатураГП, УпаковкаГП, НоменклатураТара)

 	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] +
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НамоткаНоменклатуры.НоменклатураГП КАК НоменклатураГП,
		|	бит_НамоткаНоменклатуры.ЕдИзм КАК ЕдИзм,
		|	бит_НамоткаНоменклатуры.НоменклатураТара КАК НоменклатураТара,
		|	бит_НамоткаНоменклатуры.Намотка КАК Намотка,
		|	бит_НамоткаНоменклатуры.Несопоставимо КАК Несопоставимо
		|ИЗ
		|	РегистрСведений.бит_НамоткаНоменклатуры КАК бит_НамоткаНоменклатуры
		|ГДЕ
		|	бит_НамоткаНоменклатуры.НоменклатураГП = &НоменклатураГП
		//|	И бит_НамоткаНоменклатуры.ЕдИзм = &ЕдИзм
		|	И бит_НамоткаНоменклатуры.НоменклатураТара = &НоменклатураТара";
	
	Запрос.УстановитьПараметр("ЕдИзм", УпаковкаГП);
	Запрос.УстановитьПараметр("НоменклатураГП", НоменклатураГП);
	Запрос.УстановитьПараметр("НоменклатураТара", НоменклатураТара);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Несопоставимо Тогда
			
			Возврат - 1;	
			
		Иначе
			
			Возврат ВыборкаДетальныеЗаписи.Намотка;	
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат -1;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] -
  
КонецФункции

&НаКлиенте
Процедура НамоткаПриИзменении(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] +	

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.бит_ТипТары) Тогда
		
		Намотка = ПолучитьНамоткуНоменклатуры(ТекущиеДанные.Номенклатура, ТекущиеДанные.Упаковка, ТекущиеДанные.бит_ТипТары);
		
		Если ТекущиеДанные.бит_Намотка > Намотка Тогда
			
			ПоказатьПредупреждение(, "Введено количество больше, чем возможно. 
				|Установлено максимальное значение - " + Намотка);
			
			ТекущиеДанные.бит_Намотка = Намотка;
			
		КонецЕсли;
		
		РасчитатьВес(ТекущиеДанные, ТекущиеДанные.бит_Намотка);
		
	Иначе
		
		ПоказатьПредупреждение(, "Не указан тип тары!");
		
		ТекущиеДанные.бит_Намотка = 0;
		
	КонецЕсли;	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
КонецПроцедуры 

&НаКлиенте
Процедура РасчитатьВес(ТекущиеДанные, Намотка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] +
	
	//_1 "Вес нетто, т" - автоматический расчет (например 1км ГП весит 0,01т - заказали 10 км ГП - Вес нетто = 0,1т)
	//_2 "Вес брутто, т" - автоматический расчет 
	//(например 1км ГП весит 0,01т; 1 шт Тары весит 0,01т - заказали 10 км ГП 
	//(согласно Регистру сведений на 1 шт Тары максимально наматывается 5 км, т.е. необходимо 2шт Тары для намотки 10 км ГП) - Вес брутто = 0,12т)
	//_3 "Тип тары" (номенклатура) - заполняется из справочника Номенклатура - Вид номенклатуры - Тара
	//_4 "Количество тары" - автоматический расчет 
	//(например заказали 10 км ГП, указали Тип тары 
	//(согласно Регистру сведений на 1 шт Тары максимально наматывается 5 км) - Количество тары = 2 шт)
	//_5 "Намотка" - автоматическое заполнение из Регистра сведений (максимальное значение). 
	//При необходимости (по запросу клиента) изменяется на меньшее значение и производится автоматический пересчет значений "Количество тары", "Вес брутто".
				
	Если ТекущиеДанные <> Неопределено Тогда
		
		ВесНетто = ПолучитьВесНоменклатуры(ТекущиеДанные.Номенклатура, ТекущиеДанные.Упаковка);
		ТекущиеДанные.бит_ВесНетто = ВесНетто * ТекущиеДанные.КоличествоУпаковок;
		
		Если Намотка <> 0 Тогда
			ТекущиеДанные.бит_КоличествоТары = ТекущиеДанные.КоличествоУпаковок / Намотка;
		Иначе
			ТекущиеДанные.бит_КоличествоТары = 0;
			ТекущиеДанные.бит_Намотка = 0;	
		КонецЕсли;	
			
		Если Цел(ТекущиеДанные.бит_КоличествоТары) <> ТекущиеДанные.бит_КоличествоТары Тогда
			ТекущиеДанные.бит_КоличествоТары = Цел(ТекущиеДанные.бит_КоличествоТары) + 1;	
		КонецЕсли;
		
		ВесНетто = ПолучитьВесНоменклатуры(ТекущиеДанные.бит_ТипТары, ТекущиеДанные.Упаковка);
		ТекущиеДанные.бит_ВесБрутто = ТекущиеДанные.бит_ВесНетто + (ВесНетто * ТекущиеДанные.бит_КоличествоТары);
		
	КонецЕсли;
	
	ЭтаФорма.бит_ИтогоНетто = Объект.Товары.Итог("бит_ВесНетто");
	ЭтаФорма.бит_ИтогоБрутто = Объект.Товары.Итог("бит_ВесБрутто");
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ТоварыНоменклатураПартнераПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [02.09.2024] +        
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РасчитатьВес(ТекущиеДанные, ТекущиеДанные.бит_Намотка);
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [02.09.2024] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ТоварыПриИзмененииПосле(Элемент)

	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] +
	
	ЭтаФорма.бит_ИтогоНетто = Объект.Товары.Итог("бит_ВесНетто");
	ЭтаФорма.бит_ИтогоБрутто = Объект.Товары.Итог("бит_ВесБрутто");
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [02.09.2024] +        
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РасчитатьВес(ТекущиеДанные, ТекущиеДанные.бит_Намотка);
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [02.09.2024] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [06.12.2024] +        
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Структура = ПолучитьТаруПоУмолчанию(ТекущаяСтрока.Номенклатура);
	
	Если ЗначениеЗаполнено(Структура) 
		И ТекущаяСтрока <> Неопределено Тогда
		
		ТекущаяСтрока.бит_ТипТары = Структура.НоменклатураТара;
		ТекущаяСтрока.бит_Намотка = Структура.Намотка;
		НамоткаПриИзменении(Неопределено);
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [06.12.2024] -
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаруПоУмолчанию(Номенклатура)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [06.12.2024] +        
	
	Структура = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НамоткаНоменклатуры.НоменклатураГП КАК НоменклатураГП,
		|	бит_НамоткаНоменклатуры.ЕдИзм КАК ЕдИзм,
		|	бит_НамоткаНоменклатуры.НоменклатураТара КАК НоменклатураТара,
		|	бит_НамоткаНоменклатуры.ПоУмолчанию КАК ПоУмолчанию,
		|	бит_НамоткаНоменклатуры.Намотка КАК Намотка,
		|	бит_НамоткаНоменклатуры.Несопоставимо КАК Несопоставимо
		|ИЗ
		|	РегистрСведений.бит_НамоткаНоменклатуры КАК бит_НамоткаНоменклатуры
		|ГДЕ
		|	бит_НамоткаНоменклатуры.НоменклатураГП = &НоменклатураГП
		|	И бит_НамоткаНоменклатуры.ПоУмолчанию";
	
	Запрос.УстановитьПараметр("НоменклатураГП", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Структура.Вставить("НоменклатураТара", ВыборкаДетальныеЗаписи.НоменклатураТара);
		Структура.Вставить("Намотка", ВыборкаДетальныеЗаписи.Намотка);
		
		Возврат Структура
		
	КонецЦикла;	

	Возврат  Неопределено;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ8] [ASHolyavko@1cbit.ru] [06.12.2024] -
		
КонецФункции

&НаКлиенте
Процедура ВидЗаказаПриИзменении(Элемент)	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30] [ASHolyavko@1cbit.ru] [08.09.2025] +        
	
	Если Объект.бит_ВидЗаказа = ПредопределенноеЗначение("Справочник.бит_ТипизацияЗаказовКлиентов._3") Тогда 
		Объект.бит_ДатаПоступленияОригиналовДокументов = ПолучитьТекущуюДатуСеанса();
	КонецЕсли; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30] [ASHolyavko@1cbit.ru] [08.09.2025] -
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьТекущуюДатуСеанса()
	Возврат  ТекущаяДатаСеанса()
КонецФункции
