
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Регистратор", Объект.Регистратор);
	
	Если НЕ ЗначениеЗаполнено(Объект.Регистратор) Тогда
		ТекстСообщения = НСтр("ru='Обработка не предназначена для самостоятельного использования';
							  |en='Processing is not intended for independent use'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Регистратор, "Проведен") = Ложь Тогда
		ВызватьИсключение НСтр("ru='Операция возможна только после проведения документа';
							   |en='Operation is possible only after the document'");
	КонецЕсли;
	
	АдресСхемыКомпоновкиДанных = Обработки.бит_ФормированиеДокументовПланированияДДС.ИнициализироватьКомпоновщик(Объект.Компоновщик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы(Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2 Тогда
		Для Индекс = 0 по ТаблицаСтатьиОборотовВидОперации.Количество()-1 Цикл
		    СтрокаВидОперации = ТаблицаСтатьиОборотовВидОперации.Получить(Индекс);
			Если Не ЗначениеЗаполнено(СтрокаВидОперации.ХозяйственнаяОперация) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА","ЗАПОЛНЕНИЕ","Вид операции"
																					,Индекс + 1,"Шаг 2");
				ВидОперацииПоле = "ТаблицаСтатьиОборотовВидОперации[" + Индекс + "].ХозяйственнаяОперация";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ВидОперацииПоле,,Отказ);
		    КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг3 Тогда
		Для Индекс = 0 по ТаблицаСтатьиОборотовФормаОплаты.Количество()-1 Цикл
		    СтрокаФормаОплаты = ТаблицаСтатьиОборотовФормаОплаты.Получить(Индекс);
			Если Не ЗначениеЗаполнено(СтрокаФормаОплаты.ФормаОплаты) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА","ЗАПОЛНЕНИЕ","Форма оплаты"
																					,Индекс + 1 ,"Шаг 3");
		        ФормаОплатыПоле = "ТаблицаСтатьиОборотовФормаОплаты[" + Индекс + "].ФормаОплаты";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ФормаОплатыПоле,,Отказ);
		    КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатьиОборотовВидОперацииПередУдалением(Элемент, Отказ)
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатьиОборотовФормаОплатыПередУдалением(Элемент, Отказ)
	Отказ=Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыПланирования

&НаКлиенте
Процедура ДокументыПланированияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ДокументыПланированияДокументПланирования Тогда
		ТекущиеДанные = Элементы.ДокументыПланирования.ТекущиеДанные;
		Если ТипЗнч(ТекущиеДанные.ДокументПланирования) <> Тип("Строка") Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(, ТекущиеДанные.ДокументПланирования);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПланированияВыполнятьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДокументыПланирования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	// Затемненный флажок устанавливается только программно.
	Если ТекущиеДанные.Выполнять = 2 Тогда
		ТекущиеДанные.Выполнять = 0;
	КонецЕсли;
	
	ИзменитьФлажкиДерево(ТекущиеДанные.ПолучитьЭлементы(), ТекущиеДанные.Выполнять);
	
	ИзменитьФлажкиРодителей(ТекущиеДанные.ПолучитьРодителя(), ТекущиеДанные.Выполнять);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	Если Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг1 Тогда
			
		ОбработатьСКД();
		Если ТаблицаДляДокументов.Количество() > 0 Тогда
			Если ТаблицаСтатьиОборотовВидОперации.Количество() > 0 Тогда
				Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2;
			ИначеЕсли ТаблицаСтатьиОборотовФормаОплаты.Количество() > 0 Тогда
				Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг3;
			Иначе
				Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг4;
			КонецЕсли;			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Нет данных удовлетворяющих отбору.';
															 |en='There is no data satisfying the selection.'"));
		КонецЕсли;
				
	ИначеЕсли Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2 Тогда 
		Если ПроверитьЗаполнение() Тогда
			Если ТаблицаСтатьиОборотовФормаОплаты.Количество() > 0 Тогда
				Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг3;
			Иначе
				Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг4;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг3 Тогда 
		Если ПроверитьЗаполнение() Тогда
			ОбновитьДанные();
			Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг4;
		КонецЕсли;
	КонецЕсли;
	
	УправлениеЭлементамиФормы(Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2 Тогда
		Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг1;
		
	ИначеЕсли Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг3 Тогда 
		Если ТаблицаСтатьиОборотовВидОперации.Количество() > 0 Тогда
			Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2;
		Иначе
			Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг1;
		КонецЕсли;	
		
	ИначеЕсли Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг4 Тогда 
		Если ТаблицаСтатьиОборотовФормаОплаты.Количество() > 0 Тогда
			Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг3;
		ИначеЕсли ТаблицаСтатьиОборотовВидОперации.Количество() > 0 Тогда
			Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг2;
		Иначе
			Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг1;
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеЭлементамиФормы(Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПланированияПоБюджету(Команда)
	
	ОчиститьСообщения();
	СоздатьДокументыПланированияСервер();
	УправлениеЭлементамиФормы(Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПрогнозированияПоБюджету(Команда)
	
	ОчиститьСообщения();
	СоздатьДокументыПрогнозированияСервер();
	УправлениеЭлементамиФормы(Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиДокументы(Команда)
	
	ИзменитьФлажкиДерево(ДокументыПланирования.ПолучитьЭлементы(), 1);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиДокументы(Команда)
	
	ИзменитьФлажкиДерево(ДокументыПланирования.ПолучитьЭлементы(), 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокументы(Команда)
	
	ОчиститьСообщения();
	ЗаписатьДокументыПланированияНаСервере(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведениеДокументов(Команда)
	
	ОчиститьСообщения();
	ЗаписатьДокументыПланированияНаСервере(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеЭлементамиФормы(Страница)
	
	Элементы.ГруппаСоздатьДокументы.Видимость = Ложь;
    Элементы.Назад.Видимость = Истина;
	Элементы.Далее.Видимость = Истина;
	
    Если Страница = Элементы.СтраницаШаг1 Тогда
		Элементы.ПодЗаголовок.Заголовок = НСтр("ru='Шаг 1 из 4. Отбор';en='Step 1 of 4. Selection'");
		Элементы.Назад.Видимость = Ложь;
	ИначеЕсли Страница = Элементы.СтраницаШаг2 Тогда
		Элементы.ПодЗаголовок.Заголовок = НСтр("ru='Шаг 2 из 4. Заполнение вида операции для статьи оборотов';
											   |en='Step 2 of 4: Filling the type of operation for the speed Article'");
	ИначеЕсли Страница = Элементы.СтраницаШаг3 Тогда
		Элементы.ПодЗаголовок.Заголовок = НСтр("ru='Шаг 3 из 4. Заполнение формы оплаты для статьи оборотов';
											   |en='Step 3 of 4: Filling the form of payment for an article revolutions'");
	ИначеЕсли Страница = Элементы.СтраницаШаг4 Тогда
		Элементы.ПодЗаголовок.Заголовок = НСтр("ru='Шаг 4 из 4. Создание документов планирования';
											   |en='Step 4 of 4: Create planning documents'");
		Элементы.ГруппаСоздатьДокументы.Видимость = Истина;
		Элементы.Далее.Видимость = Ложь;
	ИначеЕсли Страница = Элементы.СтраницаШаг5 Тогда
		Элементы.ПодЗаголовок.Заголовок = НСтр("ru='Документы планирования';en='Planning Documents'");
		Элементы.ГруппаКоманднаПанельНиз.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные()

	Для Каждого СтрокаТаблица Из ТаблицаДляДокументов Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("СтатьяОборотов", СтрокаТаблица.СтатьяОборотов);
		
		СтатьяОборотовВидОперации = ТаблицаСтатьиОборотовВидОперации.НайтиСтроки(СтруктураОтбора);
		СтатьяОборотовФормаОплаты = ТаблицаСтатьиОборотовФормаОплаты.НайтиСтроки(СтруктураОтбора);

		Если СтатьяОборотовВидОперации.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблица, СтатьяОборотовВидОперации[0]);
		КонецЕсли;
		Если СтатьяОборотовФормаОплаты.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблица, СтатьяОборотовФормаОплаты[0]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСКД()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Регистратор", Объект.Регистратор);
	
	ТаблицаОборотов = Обработки.бит_ФормированиеДокументовПланированияДДС.ПолучитьТаблицуДокументов(
						АдресСхемыКомпоновкиДанных, Объект.Компоновщик, СтруктураПараметров);

	Если ТаблицаОборотов.Количество() > 0 Тогда
		ЗаполнитьТЗСтатьиОборотовВидОперации(ТаблицаОборотов);
		ЗаполнитьТЗСтатьиОборотовФормаОплаты(ТаблицаОборотов);
		ЗаполнитьТабЧастьНаФорме(ТаблицаОборотов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТабЧастьНаФорме(ТаблицаОборотов)	
	
	// Удалим колонки ТЗ "ТаблицаДляДокументов", если они есть.
	ТаблицаУдалениеКолонок = РеквизитФормыВЗначение("ТаблицаДляДокументов");
	МассивУдаляемыхРеквизитов = Новый Массив;
	Для Каждого Колонка Из ТаблицаУдалениеКолонок.Колонки Цикл
		Если Не Колонка.Имя = "Выполнять" Тогда
			МассивУдаляемыхРеквизитов.Добавить("ТаблицаДляДокументов." + Колонка.Имя);   
		КонецЕсли;
	КонецЦикла;
	ИзменитьРеквизиты(,МассивУдаляемыхРеквизитов);

	// Создадим колонки ТЗ "ТаблицаДляДокументов".
	МассивДобавляемыхРеквизитов = Новый Массив;
	Для Каждого Колонка Из ТаблицаОборотов.Колонки Цикл
		РеквизитФормы = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаДляДокументов", Колонка.Имя); 
		МассивДобавляемыхРеквизитов.Добавить(РеквизитФормы); 
	КонецЦикла;
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	// Создаем элементы формы (колонки) с привязкой к ТаблицаДляДокументов.
	Если Элементы.ТаблицаДляДокументов.ПодчиненныеЭлементы.Количество() = 1 Тогда
		РедактируемыеАналитики = ПолучитьРедактируемыеАналитики();
		Для Каждого Колонка Из ТаблицаОборотов.Колонки Цикл
			Если СтрСравнить(Колонка.Имя, "Регистратор") = 0 ИЛИ СтрСравнить(Колонка.Имя, "ОрганизацияЦФО") = 0 Тогда
				Продолжить;
			КонецЕсли;
			Элемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.ТаблицаДляДокументов); 
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			Элемент.ПутьКДанным = "ТаблицаДляДокументов." + Колонка.Имя;
			Элемент.Заголовок = Колонка.Заголовок;
			Элемент.ТолькоПросмотр = Истина;
			Если СтрНачинаетсяС(Колонка.Имя, "Аналитика_") Тогда
				Для Каждого Элт Из РедактируемыеАналитики Цикл
					Если НЕ Элт.Пометка И Колонка.ТипЗначения.СодержитТип(Элт.Значение) Тогда
						Элт.Пометка = Истина;
						Элемент.ТолькоПросмотр = Ложь;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	бит_МеханизмДопИзмерений.ОтобразитьДополнительныеИзмеренияВТабличномПоле_Управляемая(ЭтотОбъект, "");
	
	ТаблицаДляДокументов.Загрузить(ТаблицаОборотов);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРедактируемыеАналитики()
	
	РедактируемыеАналитики = Новый СписокЗначений;
	РедактируемыеАналитики.Добавить(Тип("СправочникСсылка.Организации"));
	РедактируемыеАналитики.Добавить(Тип("СправочникСсылка.Контрагенты"));
	РедактируемыеАналитики.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	РедактируемыеАналитики.Добавить(Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"));
	Если бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды() Тогда
		РедактируемыеАналитики.Добавить(Тип("СправочникСсылка.ДоговорыАренды"));
	КонецЕсли;	

	Возврат РедактируемыеАналитики;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТЗСтатьиОборотовВидОперации(ТаблицаОборотов)
	
	ТаблицаСтатьиОборотовВидОперации.Очистить();
	
	ТаблицаДляОбработки = ТаблицаОборотов.Скопировать();
	ТаблицаДляОбработки.Свернуть("СтатьяОборотов, ХозяйственнаяОперация");
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ХозяйственнаяОперация", Перечисления.бит_ВидыОперацийКазначейства.ПустаяСсылка());
	
	МассивСтрок = ТаблицаДляОбработки.НайтиСтроки(СтруктураОтбора);
	
	Для Каждого ЭлМассива из МассивСтрок Цикл
		ПараметрыСтатьи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлМассива.СтатьяОборотов, "РасходДоход, ТипСтатьи");
		Если ПараметрыСтатьи.РасходДоход = Перечисления.бит_РасходДоход.Расходование 
			И ПараметрыСтатьи.ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.БДДС Тогда
			НоваяСтрока = ТаблицаСтатьиОборотовВидОперации.Добавить();
			НоваяСтрока.СтатьяОборотов = ЭлМассива.СтатьяОборотов;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЗСтатьиОборотовФормаОплаты(ТаблицаОборотов)

	ТаблицаСтатьиОборотовФормаОплаты.Очистить();
	
	ТаблицаДляОбработки = ТаблицаОборотов.Скопировать();
	ТаблицаДляОбработки.Свернуть("СтатьяОборотов, ФормаОплаты");
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ФормаОплаты", Перечисления.бит_ВидыДенежныхСредств.ПустаяСсылка());
	
	МассивСтрок = ТаблицаДляОбработки.НайтиСтроки(СтруктураОтбора);
	Для Каждого ЭлМассива из МассивСтрок Цикл
		РеквизитыСтатьи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлМассива.СтатьяОборотов, "ТипСтатьи, ВидОперации");
		Если ЗначениеЗаполнено(РеквизитыСтатьи.ВидОперации) Тогда
			ЗаполнятьФормуОплаты = бит_КазначействоКлиентСервер.ВидыОперацийЗаявкаНаПеремещение().Найти(РеквизитыСтатьи.ВидОперации) = Неопределено;
		Иначе	
			ЗаполнятьФормуОплаты = Истина;
		КонецЕсли;
		Если РеквизитыСтатьи.ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.БДДС 
			И ЗаполнятьФормуОплаты Тогда
			НоваяСтрока = ТаблицаСтатьиОборотовФормаОплаты.Добавить();
			НоваяСтрока.СтатьяОборотов = ЭлМассива.СтатьяОборотов;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокументыПланированияНаСервере(РежимЗаписи)
	
	ДеревоДокументовПланирования = РеквизитФормыВЗначение("ДокументыПланирования");
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Выполнять", 1);
	
	МассивДокументов = ДеревоДокументовПланирования.Строки.НайтиСтроки(СтруктураОтбора, Истина);
	
    Если МассивДокументов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не указаны документы планирования.';en='Not specified planning documents.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
		Возврат;
    КонецЕсли;

	Для Каждого ДокументКУдалению Из МассивДокументов Цикл
		
		Если ТипЗнч(ДокументКУдалению.ДокументПланирования) = Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		
		ДокОбъект = ДокументКУдалению.ДокументПланирования.ПолучитьОбъект();
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ДокументЗаполнен = ДокОбъект.ПроверитьЗаполнение();
		Иначе
			ДокументЗаполнен = Истина;
		КонецЕсли;
		
		Если ДокументЗаполнен Тогда
			бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокОбъект, РежимЗаписи,,"Ошибки");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажкиДерево(ЭлементыДерева, ЗначениеФлажка)
	
	Для Каждого ТекущаяВетка Из ЭлементыДерева Цикл
		
		ТекущаяВетка.Выполнять = ЗначениеФлажка;
		
		ИзменитьФлажкиДерево(ТекущаяВетка.ПолучитьЭлементы(), ЗначениеФлажка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажкиРодителей(ВеткаРодитель, ЗначениеФлажка)
	
	Если ВеткаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыРодителя = ВеткаРодитель.ПолучитьЭлементы();
	
	СостояниеРодителя = ЗначениеФлажка;
	
	Для Каждого ТекущаяВетка Из ЭлементыРодителя Цикл
		Если НЕ ТекущаяВетка.Выполнять = ЗначениеФлажка Тогда
			СостояниеРодителя = 2;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВеткаРодитель.Выполнять = СостояниеРодителя;
	
	ИзменитьФлажкиРодителей(ВеткаРодитель.ПолучитьРодителя(), ЗначениеФлажка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеВидОперации(Команда)
	ОбновитьДанныеПоТаблице("ТаблицаСтатьиОборотовВидОперации", "ХозяйственнаяОперация");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеФормаОплаты(Команда)
	ОбновитьДанныеПоТаблице("ТаблицаСтатьиОборотовФормаОплаты", "ФормаОплаты");
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоТаблице(Таблица, ИмяРеквизита)
	
	ТаблицаДляРедактирования = РеквизитФормыВЗначение(Таблица);
	
	Для Каждого Стр из ТаблицаДляРедактирования Цикл
		Стр[ИмяРеквизита] = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.СтатьяОборотов, ?(ИмяРеквизита = "ХозяйственнаяОперация", "ВидОперации", ИмяРеквизита));
	КонецЦикла;

	ЗначениеВРеквизитФормы(ТаблицаДляРедактирования, Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиТаблицаДляДокументов(Команда)
	ИзменитьФлажкиТаблицаДляДокументов(1);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиТаблицаДляДокументов(Команда)
	ИзменитьФлажкиТаблицаДляДокументов(0);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажкиТаблицаДляДокументов(ЗначениеФлажка)
	
	Для Каждого Стр Из ТаблицаДляДокументов Цикл
		Стр.Выполнять = ЗначениеФлажка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПланированияСервер()
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Выполнять", Истина);
	МассивДокументов = ТаблицаДляДокументов.НайтиСтроки(СтруктураОтбора);
	Если МассивДокументов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не выбраны данные для создания документов.';en='Not selected data to create documents.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	МассивЗаявок      = Новый Массив;
	МассивПоступлений = Новый Массив;
	
	Обработки.бит_ФормированиеДокументовПланированияДДС.СоздатьДокументыПланирования(МассивДокументов, МассивЗаявок, МассивПоступлений);
	
	ДокументыПоТипам = Новый Соответствие;
	ДокументыПоТипам.Вставить("Заявки", МассивЗаявок);
	ДокументыПоТипам.Вставить("Планируемые поступления", МассивПоступлений);
	
	СформироватьДеревоДокументовПланирования(ДокументыПоТипам, МассивДокументов);
	Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг5;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПрогнозированияСервер()
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Выполнять", Истина);
	МассивДокументов = ТаблицаДляДокументов.НайтиСтроки(СтруктураОтбора);
	Если МассивДокументов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не выбраны данные для создания документов.';en='Not selected data to create documents.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	МассивЗаявок      = Новый Массив;
	МассивПоступлений = Новый Массив;
	
	Обработки.бит_ФормированиеДокументовПланированияДДС.СоздатьДокументыПрогнозирования(МассивДокументов, МассивЗаявок, МассивПоступлений);
	
	ДокументыПоТипам = Новый Соответствие;
	ДокументыПоТипам.Вставить("Прогнозы платежей"   , МассивЗаявок);
	ДокументыПоТипам.Вставить("Прогнозы поступлений", МассивПоступлений);
	
	СформироватьДеревоДокументовПланирования(ДокументыПоТипам, МассивДокументов);
	Элементы.ГруппаОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаШаг5;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоДокументовПланирования(ДокументыПоТипам, МассивДокументов)
	
	// Сформируем дерево по типам документов.
	ДеревоДокументовПланирования = РеквизитФормыВЗначение("ДокументыПланирования");
	
	Для Каждого ТекТип Из ДокументыПоТипам Цикл
		
		МассивДокументов = ТекТип.Значение;
		
		Если МассивДокументов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяГруппы = ТекТип.Ключ;
		НайденнаяСтрока = ДеревоДокументовПланирования.Строки.Найти(ИмяГруппы, "ДокументПланирования");
		
		Если НайденнаяСтрока = Неопределено Тогда
			ГруппаДокументов = ДеревоДокументовПланирования.Строки.Добавить();
			ГруппаДокументов.ДокументПланирования = ИмяГруппы;
		Иначе
			ГруппаДокументов = НайденнаяСтрока;
		КонецЕсли;
		
		Для Каждого ТекДокумент Из ТекТип.Значение Цикл
			СтрокаДок = ГруппаДокументов.Строки.Добавить();
			СтрокаДок.ДокументПланирования = ТекДокумент;
			Если ТипЗнч(ТекДокумент) = Тип("Строка") Тогда
				СтрокаДок.ЭтоСсылка = Ложь;
			Иначе
				СтрокаДок.ЭтоСсылка = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ДеревоДокументовПланирования, ДокументыПланирования);

КонецПроцедуры

#КонецОбласти
