
#Область ПрограммныйИнтерфейс

#Область Субконто

// Процедура устанавливает свойства субконто шапки при изменении счета.
// 
// Параметры:
//  Форма   		   - Форма.
//  Объект   		   - Объект.
//	ПараметрыУстановки - Структура.
//
Процедура УстановитьСвойстваСубконтоШапкиПриИзмененииСчета(Форма, Объект, ПараметрыУстановки) Экспорт
	
	бит_БухгалтерияКлиентСервер.УстановитьСвойстваСубконтоШапки(Форма, Объект, ПараметрыУстановки);
	
	ДанныеОбъекта = бит_БухгалтерияКлиентСервер.ДанныеУстановкиПараметровСубконто(Объект, ПараметрыУстановки);
	
	бит_БухгалтерияКлиентСервер.УстановитьПараметрыВыбораСубконто(Форма, Объект, ПараметрыУстановки, ДанныеОбъекта);
	
	бит_БухгалтерияКлиентСервер.УстановитьЗначенияСубконтоПоУмолчанию(Объект, ПараметрыУстановки);
	
КонецПроцедуры

// Процедура устанавливает свойства субконто шапки при изменении субконто.
// 
// Параметры:
//  Форма   		   - Форма.
//  Объект   		   - Объект.
//  НомерСубконто	   - Число.
//	ПараметрыУстановки - Структура.
//
Процедура УстановитьСвойстваСубконтоШапкиПриИзмененииСубконто(Форма, Объект, НомерСубконто, ПараметрыУстановки) Экспорт
	
	ДанныеОбъекта = бит_БухгалтерияКлиентСервер.ДанныеУстановкиПараметровСубконто(Объект, ПараметрыУстановки);
	
	бит_БухгалтерияКлиентСервер.УстановитьПараметрыВыбораСубконто(Форма, Объект, ПараметрыУстановки, ДанныеОбъекта);
	
	ОчиститьСубконтоПриИзмененииСубконто(Объект, НомерСубконто, ПараметрыУстановки, ДанныеОбъекта);
	
КонецПроцедуры

// Процедура устанавливает свойства субконто строки при изменении субконто.
// 
// Параметры:
//  Форма   		   - Форма.
//  СтрокаТаблицы      - СтрокаТаблицы.
//  НомерСубконто	   - Число.
//	ПараметрыУстановки - Структура.
//
Процедура УстановитьСвойстваСубконтоСтрокиПриИзмененииСубконто(Форма, СтрокаТаблицы, НомерСубконто, ПараметрыУстановки) Экспорт
	
	ДанныеОбъекта = бит_БухгалтерияКлиентСервер.ДанныеУстановкиПараметровСубконто(СтрокаТаблицы, ПараметрыУстановки);
	
	бит_БухгалтерияКлиентСервер.УстановитьПараметрыВыбораСубконто(Форма, СтрокаТаблицы, ПараметрыУстановки, ДанныеОбъекта);
	
	ОчиститьСубконтоПриИзмененииСубконто(СтрокаТаблицы, НомерСубконто, ПараметрыУстановки, ДанныеОбъекта);
	
КонецПроцедуры

// Функция заполняет значения субконто в структуру. 
// Необходимо для уменьшения трафика при последующих серверных вызовах. 
// Т.е. дальше на сервер будем передавать не всю форму а только структуру субконто.
// 
// Параметры:
//  Контейнер  		   - Произвольный.
//  ИмяСубконто		   - Строка.
//  КоличествоСубконто - Число.
// 
// Возвращаемое значение:
//   СтруктураСубконто - Структура - Ключ:ИмяСубконто, Значение:ЗначениеСубконто.
// 
Функция ПодготовитьСтруктуруСубконто(Контейнер, ИмяСубконто, КоличествоСубконто) Экспорт
	
	СтруктураСубконто = Новый Структура;
	
	Для Н = 1 По КоличествоСубконто Цикл
	
		Имя = ИмяСубконто+Н;
		СтруктураСубконто.Вставить(Имя,Контейнер[Имя]);
	
	КонецЦикла; 

	Возврат СтруктураСубконто;
	
КонецФункции // ПодготовитьСтруктуруСубконто()

// Процедура формирует структуру для последующей установки параметров выбора.
// 
// Параметры:
//  Контейнер            - Произвольный.
//  ИмяСубконто          - Строка.
//  ЗначениеСубконто     - Произвольный.
//  КоличествоСубконто   - Число.
//  КонтейнерШапка       - Произвольный (По умолчанию = Неопределено).
//	ИсключитьОрганизацию - Булево (По умолчанию = Ложь).
//
// Возвращаемое значение:
//   СтруктураСубконто - Структура - Ключ:ИмяСубконто, Значение:ЗначениеСубконто.
//
Функция ПодготовитьПараметрыВыбораСубконто(Контейнер, ИмяСубконто, ЗначениеСубконто, КоличествоСубконто,
	Знач КонтейнерШапка = Неопределено, ИсключитьОрганизацию = Ложь) Экспорт

	Если КонтейнерШапка = Неопределено Тогда
		КонтейнерШапка = Контейнер;
	КонецЕсли; 
	// ++ ЕРП 
	флДоговорыНезависимые = Истина;
	// -- ЕРП 
	СтруктураПараметров   = Новый Структура;
	
	// ++ ЕРП
	ТипСубконто = ТипЗнч(ЗначениеСубконто);
	
	Если НЕ ИсключитьОрганизацию 
		И ТипСубконто <> Тип("СправочникСсылка.Номенклатура")
		И (бит_ОбщегоНазначенияВызовСервера.ЭтоУТ()
			ИЛИ ТипСубконто <> Тип("СправочникСсылка.ОбъектыЭксплуатации")
				И ТипСубконто <> Тип("СправочникСсылка.НематериальныеАктивы")) Тогда
	// -- ЕРП 
		
		ОрганизацияВШапкеЕсть = Истина;
		
		Если ТипЗнч(КонтейнерШапка) = Тип("ДанныеФормыЭлементКоллекции")
			Или ТипЗнч(КонтейнерШапка) = Тип("ДанныеФормыСтруктура") Тогда
			
			Если КонтейнерШапка.Свойство("Организация") Тогда
				СтруктураПараметров.Вставить("Организация", КонтейнерШапка.Организация);
			Иначе
				ОрганизацияВШапкеЕсть = Ложь;
			КонецЕсли;
			
		Иначе
			СтруктураПараметров.Вставить("Организация", КонтейнерШапка.Организация);
		КонецЕсли;
		
	Иначе
		ОрганизацияВШапкеЕсть = Ложь;
	КонецЕсли;
	
	Для Ном = 1 По КоличествоСубконто Цикл
		
		Имя = ИмяСубконто+Ном;
		ТекЗначениеСубконто = Контейнер[Имя];
		ТипТекСубконто      = ТипЗнч(ТекЗначениеСубконто);
		
		Если ТипТекСубконто = Тип("СправочникСсылка.Контрагенты") Тогда
			СтруктураПараметров.Вставить("Контрагент", ТекЗначениеСубконто);
			
		ИначеЕсли ТипТекСубконто = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если НЕ флДоговорыНезависимые Тогда
				СтруктураПараметров.Вставить("ДоговорКонтрагента", ТекЗначениеСубконто);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ТипЭлемента = ТипЗнч(ЗначениеСубконто);
	
	ИмяСправочникаБанковскихСчетов = бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ИмяСправочникаБанковскихСчетов();
	
	Если бит_ОбщегоНазначенияКлиентСервер.ЭтоУказанныйТип(ТипЭлемента, "СправочникСсылка." + ИмяСправочникаБанковскихСчетов)		
	 ИЛИ Не бит_ОбщегоНазначенияВызовСервера.ЭтоУТ()
	 	И бит_ОбщегоНазначенияКлиентСервер.ЭтоУказанныйТип(ТипЭлемента, "СправочникСсылка.ПодразделенияОрганизаций") Тогда
		
		Если ОрганизацияВШапкеЕсть Тогда
			СтруктураПараметров.Вставить("Владелец", КонтейнерШапка.Организация);
		КонецЕсли;
		
	ИначеЕсли ТипЭлемента = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда

		Если ОрганизацияВШапкеЕсть Тогда
			СтруктураПараметров.Вставить("Организация", бит_ОбщегоНазначенияВызовСервера.ГоловнаяОрганизация(КонтейнерШапка.Организация));
		КонецЕсли;
		
		Если СтруктураПараметров.Свойство("Контрагент") Тогда
			Если флДоговорыНезависимые Тогда
				СтруктураПараметров.Вставить("Контрагент", СтруктураПараметров.Контрагент);	
			Иначе	
				СтруктураПараметров.Вставить("Владелец", СтруктураПараметров.Контрагент);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	Возврат СтруктураПараметров;

КонецФункции

// Процедура заполняет значения субконто в приемник, если значения в приемнике и источнике не совпадают.
// 
// Параметры:
//  КонтейнерИсточник   - Произвольный.
//  КонтейнерПриемник   - Произвольный.
//  ИмяСубконтоИсточник - Строка.
//  ИмяСубконтоПриемник - Строка.
//  КоличествоСубконто  - Число.
// 
Процедура ЗаполнитьСубконтоПоСтруктуре(КонтейнерИсточник, КонтейнерПриемник, 
	ИмяСубконтоИсточник, ИмяСубконтоПриемник, КоличествоСубконто) Экспорт

	Для Н = 1 По КоличествоСубконто Цикл
	
		ИмяИсточник = ИмяСубконтоИсточник+Н;
		Если ПустаяСтрока(ИмяСубконтоПриемник) Тогда
			ИмяПриемник = ИмяСубконтоИсточник+Н;
		Иначе	
			ИмяПриемник = ИмяСубконтоПриемник+Н;
		КонецЕсли; 
		
		Если КонтейнерИсточник[ИмяИсточник] <> КонтейнерПриемник[ИмяПриемник] Тогда		
			КонтейнерПриемник[ИмяПриемник] = КонтейнерИсточник[ИмяИсточник];		
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьСубконтоПоСтруктуре()

// Процедура обрабатывает автоподбор субконто. Устанавливаются необходимые отборы.
// 
// Параметры:
//  Элемент              - ПолеФормы.
//  Параметры            - Структура.
//  Контейнер            - Произвольный.
//  КонтейнерШапка       - Произвольный.
//  ПараметрыСубконто    - Структура:
//							ИмяСубконто - Строка,
//							ЗначениеСубконто,
//							КоличествоСубконто - Число.
//  ИсключитьОрганизацию - Булево (По умолчанию = Ложь).
// 
Процедура СубконтоАвтоПодбор(Элемент, Параметры, Контейнер, Знач КонтейнерШапка, 
	ПараметрыСубконто, ИсключитьОрганизацию = Ложь) Экспорт

	ИмяСубконто 	   = ПараметрыСубконто.ИмяСубконто;
	ЗначениеСубконто   = ПараметрыСубконто.ЗначениеСубконто;
	КоличествоСубконто = ПараметрыСубконто.КоличествоСубконто;
	
	СтруктураПараметров = ПодготовитьПараметрыВыбораСубконто(Контейнер,
		ИмяСубконто, ЗначениеСубконто, КоличествоСубконто, КонтейнерШапка, ИсключитьОрганизацию);
																	 
	// Установим параметры выбора субконто.
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураПараметров);

	Для каждого КиЗ Из СтруктураПараметров Цикл	
		Параметры.Отбор.Вставить(КиЗ.Ключ, КиЗ.Значение);	
	КонецЦикла;																 

КонецПроцедуры // СубконтоАвтоПодбор()

#КонецОбласти

// Процедура заполняет план счетов из документа MS Excel.
//
// Параметры:
//  ИмяПланаСчетов	 - Строка	 - Имя плана счетов.
//
Процедура ЗаполнитьПланСчетовИзЭксель(ИмяПланаСчетов) Экспорт
	
	#Если ВебКлиент Тогда 
		ВызватьИсключение НСтр("ru='Работа с файлами Excel в режиме Веб-клиента недоступна.';
							   |en='Working with Excel files in the Web client mode is not available.'");
	#КонецЕсли

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = НСтр("ru='Все файлы Excel (*.xls, *.xlsx)|*.xls; *.xlsx';en='All Excel files (*.xls, *.xlsx)|*.xls; *.xlsx'");

	Дополнительно = Новый Структура("ИмяПланаСчетов", ИмяПланаСчетов); 
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПланСчетовИзЭксельЗавершение", ЭтотОбъект, Дополнительно); 
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, Диалог);
	
КонецПроцедуры

// Процедура обработчик оповещения "ЗаполнитьПланСчетовИзЭксельЗавершение".
//
// Параметры:
//  ВыбранныеФайлы			 - Массив	 - Имена выбранных файлов.
//  ДополнительныеПараметры	 - 			 - Структура.
//
Процедура ЗаполнитьПланСчетовИзЭксельЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	// Открытие эксель
	ПолноеИмя = ВыбранныеФайлы[0];
	Отказ 	  = Ложь;		
	Эксель 	  = бит_ОбменДаннымиКлиент.InitExcel(Ложь, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ИмяПланаСчетов = ДополнительныеПараметры.ИмяПланаСчетов;

	ЭксельКнига = бит_ОбменДаннымиКлиент.OpenExcelFile(Эксель, ПолноеИмя, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Лист = бит_ОбменДаннымиКлиент.GetExcelSheet(ЭксельКнига, 1, Отказ);
	
	ИмяЛистаИсточник = бит_ПроформыКлиентСервер.ListSourceSheetName();
	Попытка
		ЛистИсточникСписков = Эксель.Sheets(ИмяЛистаИсточник);
		// Есть списки.
		// Чтение источников выпадающих списков.
		СпискиИсточники = бит_ПроформыКлиентСервер.ПрочитатьСпискиИсточники(ЭксельКнига);
	Исключение
		// Списков нет.
		СпискиИсточники = Новый Соответствие;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВидыСчета = Новый Соответствие;
	ВидыСчета.Вставить("А" , ВидСчета.Активный);
	ВидыСчета.Вставить("П" , ВидСчета.Пассивный);
	ВидыСчета.Вставить("АП", ВидСчета.АктивноПассивный);
	
	ПоляСтруктуры = бит_БухгалтерияКлиентСервер.ОпределитьСтрокуПолейПланаСчетов(ИмяПланаСчетов);
	
	МассивПолей = бит_СтрокиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПоляСтруктуры);				 
	МассивСтрокДляЗаполнения = Новый Массив;
	
	КоличествоСтолбцов = МассивПолей.Количество();
	Сч   = 2;
	СчАп = 0;
	// Наименование всегда заполнено, поэтому опираемся на него.
	ДанныеЯчейки = Лист.Cells(Сч,4).Value;
	ЕстьДанные = ТипЗнч(ДанныеЯчейки) = Тип("Строка") 
	И ЗначениеЗаполнено(ДанныеЯчейки);
	
	Пока ЕстьДанные Цикл
		
		СтруктураСтроки = Новый Структура(ПоляСтруктуры);
		
		Для каждого ИмяПоля Из МассивПолей Цикл
			
			Индекс = МассивПолей.Найти(ИмяПоля);
			
			ЗначениеЯчейки = Лист.Cells(Сч,Индекс+1).Value;
			
			Если ИмяПоля = "Вид" Тогда
				ЗначениеСчета 	= ВРег(ЗначениеЯчейки);
				ТекущийВид 		= ВидыСчета[ЗначениеСчета];	
				Значение 		= ?(ТекущийВид = Неопределено, ВидСчета.АктивноПассивный, ТекущийВид);
			ИначеЕсли ИмяПоля  = "Забалансовый" 
				ИЛИ ИмяПоля = "Валютный" 
				ИЛИ ИмяПоля = "Количественный"
				ИЛИ ИмяПоля = "ОбСубконто1"
				ИЛИ ИмяПоля = "ОбСубконто2"
				ИЛИ ИмяПоля = "ОбСубконто3"
				ИЛИ ИмяПоля = "ОбСубконто4"
				ИЛИ ИмяПоля = "ИспользоватьИсторическиеКурсы"
				ИЛИ ИмяПоля = "ПометкаУдаления" Тогда	
				Значение = ОпределитьЗначениеБулевогоТипа(Строка(ЗначениеЯчейки));	  
			ИначеЕсли ИмяПоля = "Субконто1"
				ИЛИ ИмяПоля = "Субконто2"
				ИЛИ ИмяПоля = "Субконто3"
				ИЛИ ИмяПоля = "Субконто4" Тогда
				
				
				СписокИсточникExcel = СпискиИсточники.Получить("СписокВидыСубконто");
				Если СписокИсточникExcel <> Неопределено Тогда
					
					СтруктураЗначенияExcel = СписокИсточникExcel.Получить(ЗначениеЯчейки);
					Если СтруктураЗначенияExcel <> Неопределено Тогда                            
						ЗначениеСсылка = СтруктураЗначенияExcel.Ссылка;
						ИмяСписка = Лев(ЗначениеСсылка, Найти(ЗначениеСсылка, "/")-1);
						Значение = бит_ОбменДаннымиВызовСервера.ПолучитьЗначениеПоСсылкеExcel(ЗначениеСсылка, 
						ИмяСписка, 
						ЗначениеЯчейки);               	      					
					Иначе                            
						Значение = ?(ТипЗнч(ЗначениеЯчейки) = Тип("Число"), Формат(ЗначениеЯчейки, "ЧГ=15"), СокрЛП(ЗначениеЯчейки));                            
					КонецЕсли;
					
				КонецЕсли;     
			Иначе
				Значение = ?(ТипЗнч(ЗначениеЯчейки) = Тип("Число"), Формат(ЗначениеЯчейки, "ЧГ=15"), СокрЛП(ЗначениеЯчейки));
			КонецЕсли;	
			
			СтруктураСтроки.Вставить(ИмяПоля, Значение);
			
		КонецЦикла; 
		
		МассивСтрокДляЗаполнения.Добавить(СтруктураСтроки);
		
		Сч   = Сч + 1;
		СчАп = СчАп + 1;
		
		ДанныеЯчейки = Лист.Cells(Сч,4).Value;
		ЕстьДанные = ТипЗнч(ДанныеЯчейки) = Тип("Строка") 
		И ЗначениеЗаполнено(ДанныеЯчейки);
		
		// Проверка на зацикливание.
		Если СчАп > 30000 Тогда				
			Прервать;  			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// Закрытие Excel
	бит_ОбменДаннымиКлиент.CloseExcelFile(ЭксельКнига, Ложь);
	бит_ОбменДаннымиКлиент.QuitExcel(Эксель);		
	
	бит_БухгалтерияВызовСервера.ЗаполнитьПланСчетовПоУмолчанию(ИмяПланаСчетов, МассивСтрокДляЗаполнения);
	
	ОповеститьОбИзменении(Тип("ПланСчетовСсылка." + ИмяПланаСчетов));
	
КонецПроцедуры

// Осуществляет выгрузку шаблона плана счетов в Excel.
//
// Параметры:
//  ИмяПланаСчетов	 - Строка	 - Имя плана счетов.
//  МассивДанных	 - Массив	 - Массив с данными по плану счетов.
//  СпискиВыбора	 - Структура - Структура со списками для выгрузки.
//
Процедура ВыгрузитьШаблонЭксель(ИмяПланаСчетов, МассивДанных, СпискиВыбора) Экспорт
	
	ТекстСостояния =  НСтр("ru='Выгрузка шаблона Excel...';en='Uploading Excel template...'");
	Состояние(ТекстСостояния);
	
	Отказ = Ложь;
	Excel = бит_ОбменДаннымиКлиент.InitExcel(Истина, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	XlEnums = бит_ОбменДаннымиКлиент.InitExcelEnums();
	
	// Определим разделитель согласно региональным настройкам и подготовим форматы.
	Разделитель = Excel.International(XlEnums.XlApplicationInternational.xlDecimalSeparator);
	ФорматСумма = "# ##0" + Разделитель + "00";
	ФорматКоличество = "# ##0" + Разделитель + "000";
	
	Wb = Excel.Application.WorkBooks.Add(1);		
	
	// Создание и установка параметров для листа, являющегося источником выпадающих списков.
	ExcelSheet = Wb.Worksheets.Add(,Wb.Worksheets(Wb.Worksheets.Count));
	ExcelSheet.Name = бит_ПроформыКлиентСервер.ListSourceSheetName();
	ExcelSheet.StandardWidth           = 25;
	ExcelSheet.Cells.WrapText          = Истина;
	ExcelSheet.Cells.VerticalAlignment = XlEnums.xlConsts.xlCenter;
	ExcelSheet.Cells.NumberFormat      = "@";
	
	СтСтрока = 1;
	СтКолонка = 1;
	СчН=0;
	Для каждого Список Из СпискиВыбора Цикл
		
		ТекКолонка = СтКолонка + СчН;			
		
		Cell = ExcelSheet.Cells(СтСтрока, ТекКолонка);
		Cell.Value = Список.Ключ;
		
		СчК=1;
        Если ТипЗнч(Список.Значение) = Тип("Массив") Тогда
        
            Для каждого Эл Из Список.Значение Цикл			
    			ТекСтрока = СтСтрока + СчК;    			
    			Cell = ExcelSheet.Cells(ТекСтрока, ТекКолонка);
    			Cell.Value = Эл;    			
    			СчК = СчК+1;    			
    		КонецЦикла;	
        
        Иначе
        
        	Для каждого Эл Из Список.Значение Цикл			
    			ТекСтрока = СтСтрока + СчК;    			
    			Cell = ExcelSheet.Cells(ТекСтрока, ТекКолонка);
    			Cell.Value = Эл.Представление;
                Cell = ExcelSheet.Cells(ТекСтрока, ТекКолонка+1);
    			Cell.Value = Эл.Значение;
    			СчК = СчК+1;    			
    		КонецЦикла;
        
        КонецЕсли;
		 
		
		PosStart = бит_ОбменДаннымиКлиентСервер.CellPosition(СтСтрока+1,ТекКолонка);
		PosEnd   = бит_ОбменДаннымиКлиентСервер.CellPosition(ТекСтрока,ТекКолонка);			
		Selection = ExcelSheet.Range(ExcelSheet.Cells(PosStart.Row, PosStart.Column),ExcelSheet.Cells(PosEnd.Row, PosEnd.Column));
		Selection.Name = Список.Ключ;
		
		СчН=СчН+2;
		
	КонецЦикла; 
	
	// Закрепим шапку.
	Selection = ExcelSheet.Range(ExcelSheet.Cells(2, 1), ExcelSheet.Cells(2, 1)).Select();
	Excel.Application.ActiveWindow.FreezePanes = True;
	
	// Лист для плана счетов
	ExcelSheet = Wb.Worksheets.Add(Wb.Worksheets(Wb.Worksheets.Count));
	ExcelSheet.Name = НСтр("ru='План счетов';en='Chart of Accounts'");
	ExcelSheet.StandardWidth = 15;
	ExcelSheet.Cells.NumberFormat = "@";
	
	// Структура полей
    СтруктураПолей = ОпределитьСтруктуруПолейПланаСчетов(ИмяПланаСчетов);
	// Списки номеров колонок из процедуры бит_БухгалтерияКлиентСервер.ОпределитьСтрокуПолейПланаСчетов(ИмяПланаСчетов).
	Если ИмяПланаСчетов = "бит_Дополнительный_2" Тогда       
		// 1-РодительКод,2-Код,3-Порядок,4-Наименование,5-НаименованиеПолное,
		// 6-Вид,7-Забалансовый,8-Валютный,9-Количественный,10-ИспользоватьИсторическиеКурсы,11-Группа,
		// 12-Субконто1,13-ОбСубконто1,14-Субконто2,15-ОбСубконто2,16-Субконто3,
		// 17-ОбСубконто3,18-Субконто4,19-ОбСубконто4,
		// 20-ПометкаУдаления.
	 	СписокНомеровБулево   = "7,8,9,10,11,13,15,17,19,20";
		СписокНомеровСубконто = "12,14,16,18";
		Н_ВидСчета	 		  = 6;
	Иначе
		// 1-РодительКод,2-Код,3-Порядок,4-Наименование,5-НаименованиеПолное,
		// 6-Вид,7-Забалансовый,8-Валютный,9-Количественный,10-Группа,
		// 11-Субконто1,12-ОбСубконто1,13-Субконто2,14-ОбСубконто2,15-Субконто3,16-ОбСубконто3,
		// 17-Субконто4,18-ОбСубконто4,
		// 19-ПометкаУдаления.
		СписокНомеровБулево   = "7,8,9,10,12,14,16,18,19";
		СписокНомеровСубконто = "11,13,15,17";
		Н_ВидСчета 			  = 6;
	КонецЕсли;       
	
	// Вывод шапки.
    СчПоля = 1;
    Для каждого КлЗнчПоля Из СтруктураПолей Цикл
               
        Cell = ExcelSheet.Cells(1, СчПоля);
        		
		Cell.WrapText 	  = True;
		Cell.Font.Size 	  = 8;
		Cell.Font.Bold 	  = True;
		Cell.NumberFormat = "@";				
		Cell.Value 		  = КлЗнчПоля.Значение; // Представление;	
        
        СчПоля = СчПоля + 1;
		
	КонецЦикла; 
	
	// Закрепим шапку.
	Selection = ExcelSheet.Range(ExcelSheet.Cells(2, 1), ExcelSheet.Cells(2, 1)).Select();
	Excel.Application.ActiveWindow.FreezePanes = True;
       
	// Заполняем строки из текущего плана счетов.
	Для каждого Стр Из МассивДанных Цикл
		
		ИндексСтроки = МассивДанных.Найти(Стр)+1;
        
        СчПоля = 1;        
        Для каждого КлЗнчПоля Из СтруктураПолей Цикл
        
            ИмяПоля = КлЗнчПоля.Ключ;
            
            Cell = ExcelSheet.Cells(ИндексСтроки+1, СчПоля);
			
			Cell.WrapText  = True;
			Cell.Font.Size = 8;
			Cell.Value 	   = Строка(Стр[ИмяПоля]);			
            
            СчПоля = СчПоля + 1;
            
		КонецЦикла; 
	
	КонецЦикла; 
	
	НомПервойСтроки = 1;
	КолСтрок   = МассивДанных.Количество()+1;
    КолКолонок = СтруктураПолей.Количество();
		
	// Установка области для списка видов счетов.
	Selection = ExcelSheet.Range(ExcelSheet.Cells(НомПервойСтроки+1, Н_ВидСчета),ExcelSheet.Cells(КолСтрок+100, Н_ВидСчета));
	бит_ОбменДаннымиКлиент.SetList(Selection, "СписокВидСчета", XlEnums);
        
	// Установка областей для списка Булево.
	МассивНомеров = бит_СтрокиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокНомеровБулево);				 
	Для каждого Номер Из МассивНомеров Цикл
	
		Selection = ExcelSheet.Range(ExcelSheet.Cells(НомПервойСтроки+1, Число(Номер)),ExcelSheet.Cells(КолСтрок+100, Число(Номер)));
		бит_ОбменДаннымиКлиент.SetList(Selection, "СписокДаНет", XlEnums);
	
	КонецЦикла;
	
	// Установка областей для списка субконто.
	МассивНомеров = бит_СтрокиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокНомеровСубконто);				 
	Для каждого Номер Из МассивНомеров Цикл
	
		Selection = ExcelSheet.Range(ExcelSheet.Cells(НомПервойСтроки+1, Число(Номер)),ExcelSheet.Cells(КолСтрок+100, Число(Номер)));
		бит_ОбменДаннымиКлиент.SetList(Selection, "СписокВидыСубконто", XlEnums);
	
	КонецЦикла;
	
	// Установка сетки
	posStart  = бит_ОбменДаннымиКлиентСервер.CellPosition(НомПервойСтроки,1);
	PosEnd    = бит_ОбменДаннымиКлиентСервер.CellPosition(КолСтрок+1,КолКолонок);
	бит_ОбменДаннымиКлиент.SetBorderLines(ExcelSheet, XlEnums ,posStart ,PosEnd); 
	
	Excel.Visible = Истина;
	
	// Лист "по-умолчанию" удаляем.
	Wb.Worksheets(1).Delete();		
	
	ТекстСостояния =  НСтр("ru='Выгрузка шаблона Excel завершена.';en='Excel template Upload complete.'");
	Состояние(ТекстСостояния);
	
КонецПроцедуры // ВыгрузитьШаблонЭксель()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция определяет значение для булевого типа.
//
// Возвращаемое значение:
//  Значение - Булево.
//
Функция ОпределитьЗначениеБулевогоТипа(ЗначениеЯчейки)

	Значение = ?(ЗначениеЯчейки = "1"
	            ИЛИ ВРег(ЗначениеЯчейки) = "ДА"
				ИЛИ ВРег(ЗначениеЯчейки) = "ИСТИНА"
				, Истина
				, Ложь);	  

	Возврат Значение;
	
КонецФункции // ОпределитьЗначениеБулевогоТипа()

// Функция определяет структуру полей для загрузки/выгрузки планов счетов.
//
// Параметры:
//  ИмяПланаСчетов  - Строка.
//  ПометкаУдаления - Булево (По умолчанию = Истина). 
//  ПоМакету        - Булево (По умолчанию = Ложь).
//
// Возвращаемое значение:
//  Структура.
//
Функция ОпределитьСтруктуруПолейПланаСчетов(ИмяПланаСчетов, ПометкаУдаления = Истина, ПоМакету = Ложь)
    
    СтруктуруПолей = Новый Структура;
    
    СтруктуруПолей.Вставить("РодительКод" , НСтр("ru='Родитель';en='Parent'"));
    СтруктуруПолей.Вставить("Код"         , НСтр("ru='Код';en='The code'"));
    СтруктуруПолей.Вставить("Порядок"     , НСтр("ru='Порядок';en='Order'"));
    СтруктуруПолей.Вставить("Наименование", НСтр("ru='Наименование';en='Name'"));
    
    Если Не ПоМакету Тогда
        СтруктуруПолей.Вставить("НаименованиеПолное", НСтр("ru='Полное наименование';en='Full name'"));
    КонецЕсли;
    
    СтруктуруПолей.Вставить("Вид"           , НСтр("ru='Вид';en='View'"));
    СтруктуруПолей.Вставить("Забалансовый"  , НСтр("ru='Забалансовый;en='Off-balance''"));
    СтруктуруПолей.Вставить("Валютный"      , НСтр("ru='Валютный';en='Currency'"));
    СтруктуруПолей.Вставить("Количественный", НСтр("ru='Количественный';en='Quantitative'"));
    
    Если Не ПоМакету И бит_БухгалтерияВызовСервера.ЕстьИсторическиеКурсы(ИмяПланаСчетов) Тогда
        СтруктуруПолей.Вставить("ИспользоватьИсторическиеКурсы", НСтр("ru='Использовать исторические курсы';en='Use historical rates'"));
    КонецЕсли;
    
    СтруктуруПолей.Вставить("Группа", НСтр("ru='Группа';en='Group'"));
    
    СтруктуруПолей.Вставить("Субконто1"  , НСтр("ru='Субконто 1';en='Extra dimension 1'"));
    СтруктуруПолей.Вставить("ОбСубконто1", НСтр("ru='Только обороты субконто 1';en='Only turnovers extra dimension 1'"));
    СтруктуруПолей.Вставить("Субконто2"  , НСтр("ru='Субконто 2';en='Extra dimension 2'"));
    СтруктуруПолей.Вставить("ОбСубконто2", НСтр("ru='Только обороты субконто 2';en='Only turnovers extra dimension 2'"));
    СтруктуруПолей.Вставить("Субконто3"  , НСтр("ru='Субконто 3';en='Extra dimension 3'"));
    СтруктуруПолей.Вставить("ОбСубконто3", НСтр("ru='Только обороты субконто 3';en='Only turnovers extra dimension 3'"));
    СтруктуруПолей.Вставить("Субконто4"  , НСтр("ru='Субконто 4';en='Extra dimension 4'"));
    СтруктуруПолей.Вставить("ОбСубконто4", НСтр("ru='Только обороты субконто 4';en='Only turnovers extra dimension 4'"));
    
    Если ПометкаУдаления Тогда
        СтруктуруПолей.Вставить("ПометкаУдаления", НСтр("ru='Пометка удаления';en='Deletion mark'"));
    КонецЕсли;
    
	Возврат СтруктуруПолей;
	
КонецФункции // ОпределитьСтруктуруПолейПланаСчетов()

Процедура ОчиститьСубконтоПриИзмененииСубконто(Объект, НомерСубконто, ПараметрыУстановки, ДанныеОбъекта)
	
	Если бит_ОбщегоНазначенияВызовСервера.ЭтоУТ() Тогда
		Возврат;
	КонецЕсли;
	
	ПоляОбъекта = ПараметрыУстановки.ПоляОбъекта;
	
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	ОбщийМодуль              = ОбщегоНазначенияКлиент.ОбщийМодуль("БухгалтерскийУчетВызовСервераПовтИсп");
	ВсеТипыСвязанныхСубконто = ОбщийМодуль.ВсеТипыСвязанныхСубконто();
	// АПК:277-вкл.
	ТипыСубконтоДляОчистки   = Новый ОписаниеТипов(Новый Массив);
	Для каждого СвойствоОбъекта Из ДанныеОбъекта Цикл
		СвязанныеТипы = ВсеТипыСвязанныхСубконто[СвойствоОбъекта.Ключ];
		Если СвязанныеТипы <> Неопределено Тогда
			ТипыСубконтоДляОчистки = Новый ОписаниеТипов(ТипыСубконтоДляОчистки, СвязанныеТипы.Типы());
		КонецЕсли;
	КонецЦикла;
	
	Для Индекс = НомерСубконто + 1 По 4 Цикл
		
		Если НЕ ЗначениеЗаполнено(ПоляОбъекта["Субконто" + Индекс]) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяСубконто = ПоляОбъекта["Субконто" + Индекс];
		ТипСубконто = ТипЗнч(Объект[ИмяСубконто]);
		
		Если ЗначениеЗаполнено(Объект[ИмяСубконто])
			И ТипыСубконтоДляОчистки.СодержитТип(ТипСубконто) Тогда
			Объект[ИмяСубконто] = Новый (ТипСубконто);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
