

// Получает договор по умолчанию. Взято из БСП и удалены лишние фильтры  
//
//Параметры:
// СтруктураДанных - Структура (ФиксированнаяСтруктура): Партнер, Контрагент, Договор
// 
// Возвращаемое значение:
//  Договор: контрагента либо пустая ссылка
//
Функция ПолучитьДоговорПоУмолчанию(СтруктураДанных) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 19:05:30] +        
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами") Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	СписокПартнеров = Новый СписокЗначений;
	ПартнерыИКонтрагенты.ЗаполнитьСписокПартнераСРодителями(СтруктураДанных.Партнер, СписокПартнеров);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	                      |	ДоговорыКонтрагентов.Партнер КАК Партнер,
	                      |	ДоговорыКонтрагентов.РазрешенаРаботаСДочернимиПартнерами КАК РазрешенаРаботаСДочернимиПартнерами
	                      |ИЗ
	                      |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |ГДЕ
	                      |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	                      |	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	                      |	И ДоговорыКонтрагентов.Партнер В(&СписокПартнеров)
	                      |	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	                      |	И ДоговорыКонтрагентов.Ссылка = &ТекущийДоговор
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	                      |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	                      |	ДоговорыКонтрагентов.Партнер КАК Партнер,
	                      |	ДоговорыКонтрагентов.РазрешенаРаботаСДочернимиПартнерами КАК РазрешенаРаботаСДочернимиПартнерами
	                      |ИЗ
	                      |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |ГДЕ
	                      |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	                      |	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	                      |	И ДоговорыКонтрагентов.Партнер В(&СписокПартнеров)
	                      |	И ДоговорыКонтрагентов.Контрагент = &Контрагент");
	Запрос.УстановитьПараметр("ТекущийДоговор", СтруктураДанных.Договор);
	Запрос.УстановитьПараметр("СписокПартнеров", СписокПартнеров);
	Запрос.УстановитьПараметр("Контрагент", СтруктураДанных.Контрагент);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ПартнерДоговора = Справочники.Партнеры.ПустаяСсылка();
	РазрешенаРаботаСДочернимиПартнерами = Ложь;
	Если Не МассивРезультатов[0].Пустой() Тогда
		
		Выборка = МассивРезультатов[0].Выбрать();
		Выборка.Следующий();
		
		ДоговорПоУмолчанию = Выборка.Ссылка;
		
		ПартнерДоговора = Выборка.Партнер;
		РазрешенаРаботаСДочернимиПартнерами = Выборка.РазрешенаРаботаСДочернимиПартнерами;
		
	Иначе
		Выборка = МассивРезультатов[1].Выбрать();
		
		Если Не Выборка.Следующий() Тогда
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		ИначеЕсли Выборка.Количество() = 1 Тогда
			ДоговорПоУмолчанию = Выборка.Ссылка;	
			ПартнерДоговора = Выборка.Партнер;
			РазрешенаРаботаСДочернимиПартнерами = Выборка.РазрешенаРаботаСДочернимиПартнерами;
		Иначе
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ РазрешенаРаботаСДочернимиПартнерами И ПартнерДоговора <> СтруктураДанных.Партнер Тогда
		ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат ДоговорПоУмолчанию;
	// }}ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 19:05:30] -	
КонецФункции