
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов.
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов.
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МинутыВоВремя();	
	
	фКэшЗначений = Новый Структура;
	
	МассивТипов  = Объект.Ссылка.Метаданные().Реквизиты.ОбъектСвязи.Тип.Типы();
	СписокВыбора = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	
	фКэшЗначений.Вставить("СписокТиповОбъектСвязи",СписокВыбора);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидСвязиПриИзменении(Элемент)
	
	ИзменениеВидаСвязи();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСвязиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект
	                                                   ,Элемент
	                                                   ,Объект
	                                                   ,"ОбъектСвязи"
													   ,фКэшЗначений.СписокТиповОбъектСвязи
													   ,СтандартнаяОбработка);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСвязиОчистка(Элемент, СтандартнаяОбработка)
	
	ИзменениеВидаСвязи();
	
	Если Объект.ОбъектСвязи = Неопределено Тогда
		
		Элемент.ВыбиратьТип = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура фВремя_ДниПриИзменении(Элемент)
	
	ВычислитьВремяНаУстановку();
	
КонецПроцедуры

&НаКлиенте
Процедура фВремя_ЧасыПриИзменении(Элемент)
	
	ВычислитьВремяНаУстановку();
	
КонецПроцедуры

&НаКлиенте
Процедура фВремя_МинутыПриИзменении(Элемент)
	
	ВычислитьВремяНаУстановку();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура раскладывает время на установку на дни, часы и минуты.
// 
&НаСервере
Процедура МинутыВоВремя()

	// Заполним поля редактирования времени.
	СтрВремя = бит_ОбщегоНазначения.МинутыВоВремя(Объект.ВремяНаУстановку);
	фВремя_Дни    = СтрВремя.Дни;
	фВремя_Часы   = СтрВремя.Часы;
	фВремя_Минуты = СтрВремя.Минуты;

КонецПроцедуры

// Обрабатывает изменение вида связи. 
// 
&НаСервере
Процедура ИзменениеВидаСвязи()

	ДокОб = РеквизитФормыВЗначение("Объект");
	ДокОб.ИзменениеВидаСвязи();
	ЗначениеВРеквизитФормы(ДокОб, "Объект");

КонецПроцедуры // ИзменениеВидаСвязи()

// Процедура Вычисляет время на установку визы в минутах.
// 
&НаКлиенте
Процедура ВычислитьВремяНаУстановку()

	СтрВремя = Новый Структура("Дни,Часы,Минуты",фВремя_Дни,фВремя_Часы,фВремя_Минуты);
	Объект.ВремяНаУстановку = бит_ОбщегоНазначенияКлиент.ВремяВМинуты(СтрВремя);
	
КонецПроцедуры

#КонецОбласти
