////////////////////////////////////////////////////////////////////////////////
// Модуль содержит процедуры подключения к внешним базам. 
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Получает структуру метаданных целевой внешней базы по HTTP.
// 
// Параметры:
//  НастройкаПодключения - СправочникСсылка.бит_мпд_НастройкиВнешнихПодключений.
// 
// Возвращаемое значение:
//  HTTPОтвет.
// 
Функция ПолучитьМетаданныеHTTP(НастройкаПодключения) Экспорт
	
	Возврат бит_ПолучениеДанныхСерверПовтИсп.ПолучитьМетаданныеHTTP(НастройкаПодключения);
	
КонецФункции

// Функция выполняет подключение к внешней базе посредством OLE.
// 
// Параметры:
//  НастройкаПодключения - СправочникСсылка.бит_НастройкиПодключений.
// 
// Возвращаемое значение:
//  ComObject.
// 
Функция ПодключитьОЛЕ(НастройкаПодключения) Экспорт

	Возврат бит_ПолучениеДанныхСерверПовтИсп.ПодключитьОЛЕ(НастройкаПодключения);
	
КонецФункции

// Функция выполняет подключение к внешней базе посредством ComConnector.
// 
// Параметры:
//  НастройкаПодключения - СправочникСсылка.бит_НастройкиПодключений.
// 
// Возвращаемое значение:
//  ComObject.
// 
Функция ПодключитьКОМ(НастройкаПодключения) Экспорт

	Возврат бит_ПолучениеДанныхСерверПовтИсп.ПодключитьКОМ(НастройкаПодключения);
	
КонецФункции

// Функция генерирует имя области ячейки в стиле RC.
//
// Параметры:
// 	Верх - Число
//	Лево - Число.
//
// Возвращаемое значение:
//	Строка - Имя области.
//
Функция СформироватьТиповоеИмяОбласти(Верх, Лево) Экспорт

	ИмяОбласти = "R"+Формат(Верх,"ЧГ=")+"C"+Формат(Лево,"ЧГ=");

	Возврат ИмяОбласти;
	
КонецФункции

// Функция возвращает строку признак обращения к встроенному REST сервису по протоколу OData.
// 
// Возвращаемое значение:
//  РезСтрока - Строка.
// 
Функция ПризнакОбращенияОДата() Экспорт

	РезСтрока = "/odata/standard.odata/";

	Возврат РезСтрока;
	
КонецФункции

#КонецОбласти
