
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущиеЗадания = ТекущиеЗадания();
	Для каждого Элемент Из ТекущиеЗадания Цикл
		НоваяСтрока = Настройки.Добавить();
		Если Элемент.Параметры.Количество() <> 0 Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.Параметры[0]);
		КонецЕсли; 
		
		НоваяСтрока.Использование = Элемент.Использование;
		ЗаполнитьДобавленныеКолонкиСтроки(НоваяСтрока, Элемент.Расписание);
	КонецЦикла; 
	
	УстановитьУсловноеОформление();

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверкаНаДубли(Отказ);
	ПроверитьНаВытеснение(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыВыполнения

&НаКлиенте
Процедура ПараметрыВыполненияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
		ТекущиеДанные.Использование = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВыполненияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
		ТекущиеДанные.НастроитьРасписание = НСтр("ru='Настроить расписание';en='Set up Schedule'");
		
		Расписание = Новый РасписаниеРегламентногоЗадания;
		ЗаполнитьДобавленныеКолонкиСтроки(ТекущиеДанные, Расписание);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВыполненияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.НастройкиНастроитьРасписание Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
		Если ПустаяСтрока(ТекущиеДанные.Расписание) Тогда
			Расписание = Новый РасписаниеРегламентногоЗадания;
		Иначе	
			Расписание = ЗначениеИзСтрокиXML(ТекущиеДанные.Расписание);
		КонецЕсли; 
		
		Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
		Диалог.Показать(Новый ОписаниеОповещения("ПараметрыВыполненияВыборЗавершение", ЭтотОбъект));
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВыполненияВыборЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
		ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
		ТекущиеДанные.Расписание = ЗначениеВСтрокуXML(Расписание);
		ТекущиеДанные.РасписаниеПредставление = Строка(Расписание);
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	ОчиститьСообщения();
	
	Если ПроверитьЗаполнение() Тогда
		СохранениеНесохраненныхДанныхНаСервере();
		Закрыть(АвтоматическиПроводитьДокументы);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере 
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	бит_ОтчетыБФКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НастройкиСценарий");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Настройки.Сценарий", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<Любой сценарий>';en='<Any script>'"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	бит_ОтчетыБФКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НастройкиВидКонтроля");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Настройки.ВидКонтроля", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<Любой вид операции>';en='<Any type of operation>'"));
		
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	бит_ОтчетыБФКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НастройкиНачалоПериода");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Настройки.НачалоПериода", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<За весь период>';en='<For the whole period>'"));
	
КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДобавленныеКолонкиСтроки(СтрокаТаблицы, Расписание)

	СтрокаТаблицы.НастроитьРасписание = НСтр("ru='Настроить расписание';en='Set up Schedule'");	
	СтрокаТаблицы.Расписание = ЗначениеВСтрокуXML(Расписание);
	СтрокаТаблицы.РасписаниеПредставление = Строка(Расписание);

КонецПроцедуры
 
&НаСервере
Функция ТекущиеЗадания()

	Возврат РегламентныеЗаданияСервер.НайтиЗадания(Новый Структура("Метаданные", 
				Метаданные.РегламентныеЗадания.бит_УстановкаКонтрольныхЗначений));
	
КонецФункции
 
&НаСервереБезКонтекста
Функция ЗначениеВСтрокуXML(Знач Расписание)

	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(Расписание);

КонецФункции
 
&НаСервереБезКонтекста
Функция ЗначениеИзСтрокиXML(Знач Расписание)

	Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML(Расписание);

КонецФункции
 
&НаСервере
Процедура СохранениеНесохраненныхДанныхНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущиеЗадания = ТекущиеЗадания();
	
	Для каждого Элемент Из ТекущиеЗадания Цикл
		РегламентныеЗаданияСервер.УдалитьЗадание(Элемент);
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из Настройки Цикл
		
		ПараметрыУстановки = Документы.бит_УстановкаКонтрольныхЗначений.НовыеПараметрыУстановкиВФоне();
		ЗаполнитьЗначенияСвойств(ПараметрыУстановки, СтрокаТаблицы); 
				
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.бит_УстановкаКонтрольныхЗначений);
		ПараметрыЗадания.Вставить("Использование", СтрокаТаблицы.Использование);
		ПараметрыЗадания.Вставить("Параметры",  ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыУстановки));
		ПараметрыЗадания.Вставить("Ключ",  		ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ПараметрыУстановки));
		ПараметрыЗадания.Вставить("Расписание", ЗначениеИзСтрокиXML(СтрокаТаблицы.Расписание));

		ПредставлениеЗадания = ПредставлениеЗадания(СтрокаТаблицы);
		Наименование		 = СтрШаблон(НСтр("ru='Установка контрольных значений по: %1';
													|en='Setting the reference values by: %1'"), 
											  ПредставлениеЗадания);
		ПараметрыЗадания.Вставить("Наименование", Наименование);
		
		НовоеЗадание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		АвтоматическиПроводитьДокументы = Макс(АвтоматическиПроводитьДокументы, СтрокаТаблицы.Использование);
	КонецЦикла; 
		
КонецПроцедуры

&НаСервере
Функция ПредставлениеЗадания(СтрокаТаблицы)

	Сценарий      = ?(ЗначениеЗаполнено(СтрокаТаблицы.Сценарий), 
						Строка(СтрокаТаблицы.Сценарий), НСтр("ru='<Любой сценарий>';en='<Any script>'"));
	ВидКонтроля   = ?(ЗначениеЗаполнено(СтрокаТаблицы.ВидКонтроля), 
						Строка(СтрокаТаблицы.ВидКонтроля), НСтр("ru='<Любой вид контроля>';en='<Any type of control>'"));
	НачалоПериода = ?(ЗначениеЗаполнено(СтрокаТаблицы.НачалоПериода),
						Формат(СтрокаТаблицы.НачалоПериода,"ДЛФ=D"), НСтр("ru='<За весь период>';en='<For the whole period>'"));
						
	Возврат СтрШаблон("%1, %2, %3", Сценарий, ВидКонтроля, НачалоПериода);
	
КонецФункции 

&НаСервере
Процедура ПроверкаНаДубли(Отказ)

	ШаблонСообщения = НСтр("ru='Сценарий и вид операции строки %1 списка ""Настройки"" повторяются в строке %2.';
						   |en='Scenario and transaction type %1 line list ""Settings"" is repeated in the row %2.'");
	Поле  		    = "Настройки[%1].Сценарий";
	
	ТаблицаДляПроверки = РеквизитФормыВЗначение("Настройки");
	ТаблицаДляПроверки.Колонки.Добавить("Проверено", Новый ОписаниеТипов("Булево"));
	Для каждого СтрокаТаблицы Из ТаблицаДляПроверки Цикл
		СтрокаТаблицы.Проверено = Истина;
		ТекущийИндекс = ТаблицаДляПроверки.Индекс(СтрокаТаблицы);
		Фильтр = Новый Структура("Сценарий, ВидКонтроля, Проверено",,,Ложь); 
		ЗаполнитьЗначенияСвойств(Фильтр, СтрокаТаблицы,, "Проверено");
		НайденныеСтроки = ТаблицаДляПроверки.НайтиСтроки(Фильтр);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Индекс 		   = ТаблицаДляПроверки.Индекс(НайденнаяСтрока);
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущийИндекс + 1, Индекс + 1);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, СтрШаблон(Поле, ТекущийИндекс),, Отказ);
				НайденнаяСтрока.Проверено = Истина;
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаВытеснение(Отказ)
	
	// Пустой (любой) сценарий и пустой (любой) вид операции обработают все документы.
	// Другие записи не имеют смысла.
	ШаблонСценарий = НСтр("ru='Сценарий или вид операции в строке %1 списка ""Настройки"" будет обработан по настройке в строке %2.';
						  |en='Scenario or transaction type Row %1 ""Settings"" list has been processed by setting in row %2.'");
	ПолеСценарий   = "Настройки[%1].Сценарий";
	
	ТаблицаДляПроверки = РеквизитФормыВЗначение("Настройки");
	ТаблицаДляПроверки.Колонки.Добавить("Проверено", Новый ОписаниеТипов("Булево"));
	
	Для каждого СтрокаТаблицы Из ТаблицаДляПроверки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сценарий) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВидКонтроля) Тогда
			СтрокаТаблицы.Проверено = Истина;
			ТекущийИндекс = ТаблицаДляПроверки.Индекс(СтрокаТаблицы);
			Фильтр = Новый Структура("Проверено",Ложь);
			НайденныеСтроки = ТаблицаДляПроверки.НайтиСтроки(Фильтр);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Индекс = ТаблицаДляПроверки.Индекс(НайденнаяСтрока);
					ТекстСообщения = СтрШаблон(ШаблонСценарий, Индекс + 1, ТекущийИндекс + 1);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, СтрШаблон(ПолеСценарий, Индекс),, Отказ);
					НайденнаяСтрока.Проверено = Истина;
				КонецЦикла;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;

	// Пустой (любой) сценарий обработают документы с любым сченарием по назначенным видом операции.	
	ШаблонСценарий = НСтр("ru='Сценарий в строке %1 списка ""Настройки"" будет обработан по настройке в строке %2.';
						  |en='The script at line %1 ""Settings"" list will be processed on setting up on line %2.'");
	ПолеСценарий   = "Настройки[%1].Сценарий";
	ТаблицаДляПроверки.ЗаполнитьЗначения(Ложь, "Проверено");
	
	Для каждого СтрокаТаблицы Из ТаблицаДляПроверки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Сценарий) Тогда
			СтрокаТаблицы.Проверено = Истина;
			ТекущийИндекс = ТаблицаДляПроверки.Индекс(СтрокаТаблицы);
			Фильтр = Новый Структура("ВидКонтроля, Проверено",,Ложь);
			ЗаполнитьЗначенияСвойств(Фильтр, СтрокаТаблицы,, "Проверено");
			НайденныеСтроки = ТаблицаДляПроверки.НайтиСтроки(Фильтр);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Индекс = ТаблицаДляПроверки.Индекс(НайденнаяСтрока);
					ТекстСообщения = СтрШаблон(ШаблонСценарий, Индекс + 1, ТекущийИндекс + 1);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, СтрШаблон(ПолеСценарий, Индекс),, Отказ);
					НайденнаяСтрока.Проверено = Истина;
				КонецЦикла;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	ШаблонОперация = НСтр("ru='Вид операции в строке %1 списка ""Настройки"" будет обработан по настройке в строке %2.';
						  |en='Transaction type on line %1 list ""Settings"" will be processed on setting up on line %2.'");
	ПолеОперация   = "Настройки[%1].ВидКонтроля";
	ТаблицаДляПроверки.ЗаполнитьЗначения(Ложь, "Проверено");
	
	Для каждого СтрокаТаблицы Из ТаблицаДляПроверки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВидКонтроля) Тогда
			СтрокаТаблицы.Проверено = Истина;
			ТекущийИндекс = ТаблицаДляПроверки.Индекс(СтрокаТаблицы);
			Фильтр = Новый Структура("Сценарий, Проверено",,Ложь);
			ЗаполнитьЗначенияСвойств(Фильтр, СтрокаТаблицы,, "Проверено");
			НайденныеСтроки = ТаблицаДляПроверки.НайтиСтроки(Фильтр);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Индекс = ТаблицаДляПроверки.Индекс(НайденнаяСтрока);
					ТекстСообщения = СтрШаблон(ШаблонОперация, Индекс + 1, ТекущийИндекс + 1);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, СтрШаблон(ПолеОперация, Индекс),, Отказ);
					НайденнаяСтрока.Проверено = Истина;
				КонецЦикла;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти