#Область ПрограммныйИнтерфейс

Процедура ДанныеПользователей(Параметры, АдресРезультата) Экспорт

	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Пользователь", ИТК_ТипыКлиентСервер.ОписаниеСтрока(100));
	Результат.Колонки.Добавить("ПолноеИмя", ИТК_ТипыКлиентСервер.ОписаниеСтрока(100));
	Результат.Колонки.Добавить("Отключен", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Результат.Колонки.Добавить("УникальныйИдентификатор", ИТК_ТипыКлиентСервер.ОписаниеУникальныйИдентификатор());
	Результат.Колонки.Добавить("АутентификацияСтандартная", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Результат.Колонки.Добавить("АутентификацияOpenID", ИТК_ТипыКлиентСервер.ОписаниеБулево());		
	Результат.Колонки.Добавить("ПоказыватьВСпискеВыбора", ИТК_ТипыКлиентСервер.ОписаниеБулево());		
	Результат.Колонки.Добавить("АутентификацияОС", ИТК_ТипыКлиентСервер.ОписаниеБулево());		
	Результат.Колонки.Добавить("ПользовательОС", ИТК_ТипыКлиентСервер.ОписаниеСтрока());		
	Результат.Колонки.Добавить("Язык", ИТК_ТипыКлиентСервер.ОписаниеСтрока());		
	Результат.Колонки.Добавить("ЗапрещеноИзменятьПароль", ИТК_ТипыКлиентСервер.ОписаниеБулево());		
	Результат.Колонки.Добавить("ЗащитаОтОпасныхДействий", ИТК_ТипыКлиентСервер.ОписаниеБулево());		
	Результат.Колонки.Добавить("РежимЗапуска");
	Результат.Колонки.Добавить("АдресЭлектроннойПочты", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Результат.Колонки.Добавить("ЗапрещеноВосстанавливатьПароль", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Результат.Колонки.Добавить("АутентификацияOpenIDConnect", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Результат.Колонки.Добавить("АутентификацияТокеномДоступа", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого Пользователь Из ПользователиИБ Цикл 
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Пользователь);
		
		НоваяСтрока.Пользователь = Пользователь.Имя;
		НоваяСтрока.Отключен = НЕ ВключенаАутентификация(Пользователь);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Процедура ДанныеАктивныхПользователей(Параметры, АдресРезультата) Экспорт

	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Пользователь", ИТК_ТипыКлиентСервер.ОписаниеСтрока(100));
	Результат.Колонки.Добавить("Приложение", ИТК_ТипыКлиентСервер.ОписаниеСтрока(50));
	Результат.Колонки.Добавить("Компьютер", ИТК_ТипыКлиентСервер.ОписаниеСтрока(100));
	Результат.Колонки.Добавить("НачалоСеанса", ИТК_ТипыКлиентСервер.ОписаниеДата());
	Результат.Колонки.Добавить("НомерСеанса", ИТК_ТипыКлиентСервер.ОписаниеЧисло(10, , Истина));
	Результат.Колонки.Добавить("НомерСоединения", ИТК_ТипыКлиентСервер.ОписаниеЧисло(10, , Истина));
	Результат.Колонки.Добавить("УникальныйИдентификатор", ИТК_ТипыКлиентСервер.ОписаниеУникальныйИдентификатор());
	Результат.Колонки.Добавить("Конфигуратор", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	
	СеансыИБ = ПолучитьСеансыИнформационнойБазы();
	Для Каждого ОписаниеСеанса Из СеансыИБ Цикл 
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеСеанса);
		НоваяСтрока.УникальныйИдентификатор = ОписаниеСеанса.Пользователь.УникальныйИдентификатор;
		НоваяСтрока.Приложение = ПредставлениеПриложения(ОписаниеСеанса.ИмяПриложения);
		НоваяСтрока.Компьютер = ОписаниеСеанса.ИмяКомпьютера;
		
		НоваяСтрока.Конфигуратор = (ОписаниеСеанса.ИмяПриложения = "Designer");
		
	КонецЦикла;
	
	Результат.Сортировать("Конфигуратор Убыв");
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Функция ВключенаАутентификация(Пользователь) Экспорт
	
	Возврат (Пользователь.АутентификацияСтандартная
				ИЛИ Пользователь.АутентификацияОС
				ИЛИ Пользователь.АутентификацияOpenID);
	
КонецФункции

#КонецОбласти