#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НастройкиСубконто(Счет)

	КоличествоСубконтоМУ = Метаданные.ПланыСчетов.бит_Дополнительный_2.МаксКоличествоСубконто;
	НастройкиСубконто    = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(Счет,КоличествоСубконтоМУ);									  
    Возврат НастройкиСубконто;
	
КонецФункции // НастройкиСубконто()
 
Процедура ПриИзмененииСчета(Реквизиты, Счет, РеквизитыСубконто) Экспорт 
	
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(Реквизиты, НастройкиСубконто(Счет),РеквизитыСубконто);

КонецПроцедуры
 
#КонецОбласти 
 
#КонецЕсли
