#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль("СформироватьДокументы")
Процедура бит_СформироватьДокументы(СтруктураОтбора, АдресРезультата, УдалятьДокументыСОшибками)

	Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Документ.ВыработкаСотрудников.МодульМенеджера.СформироватьДокументы");

	Результат = Новый Структура;

	СписокДокументов = Новый СписокЗначений;
	СписокОшибок = Новый Массив;
	
	
	#Удаление // {{ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [09.04.2026] +        
	
	СтруктураШапки = Новый Структура("Бригада,ВидНаряда,Организация,НачалоПериода,КонецПериода,Подразделение"); 
	
	#КонецУдаления // }}ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [09.04.2026] -
	
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [09.04.2026] +        
	
	СтруктураШапки = Новый Структура("Бригада,ВидНаряда,Организация,НачалоПериода,КонецПериода,Подразделение,Распоряжение"); 
	
	#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [09.04.2026] -
	
	ТекущийДокумент = Неопределено;

	Выборка = ТрудозатратыКОформлению(СтруктураОтбора).Выбрать();

	Пока Выборка.Следующий() Цикл

		Если (СтруктураШапки.Бригада <> Выборка.Бригада И ЗначениеЗаполнено(Выборка.Бригада))
			Или СтруктураШапки.ВидНаряда <> Выборка.ВидНаряда
			Или СтруктураШапки.Организация <> Выборка.Организация
			
			#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [09.04.2026] +        
	
			Или СтруктураШапки.Распоряжение <> Выборка.Распоряжение 
	
			#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [09.04.2026] -

			Или СтруктураШапки.НачалоПериода <> Выборка.НачалоПериода
			Или СтруктураШапки.КонецПериода <> Выборка.КонецПериода
			Или СтруктураШапки.Подразделение <> Выборка.Подразделение Тогда

			ЗаполнитьЗначенияСвойств(СтруктураШапки, Выборка);

			ЗаписатьНовыйДокумент(ТекущийДокумент, СписокДокументов, СписокОшибок);

			ТекущийДокумент = Документы.ВыработкаСотрудников.СоздатьДокумент();
			ТекущийДокумент.ПолучитьСсылкуНового();

			ТекущийДокумент.Заполнить(Выборка);

			Если СтруктураОтбора.Свойство("ВключатьВПериодВыполненияРабот") 
				И СтруктураОтбора.ВключатьВПериодВыполненияРабот Тогда
				ТекущийДокумент.Дата = Выборка.КонецПериода;
				ТекущийДокумент.Месяц = НачалоМесяца(Выборка.ДатаВыполненияРабот);
			Иначе
				ТекущийДокумент.Дата = ТекущаяДатаСеанса();
				ТекущийДокумент.Месяц = НачалоМесяца(ТекущаяДатаСеанса());
			КонецЕсли;

			ТекущийДокумент.УчетТрудозатратВРазрезеСотрудников = ПроизводствоСервер.ИспользуетсяУчетТрудозатратВРазрезеСотрудников(ТекущийДокумент.Месяц);

		КонецЕсли;

		НоваяСтрока = ТекущийДокумент.ВидыРабот.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [26.03.2026] +        
		
		СтатьяКалькуляции = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СтатьяКалькуляцииДляВыработкиСотрудников, Неопределено, Истина);
		
		//Для Каждого СтрокаТЧ Из ТекущийДокумент.ВидыРабот Цикл
		НоваяСтрока.СтатьяКалькуляции = СтатьяКалькуляции;	
		//КонецЦикла;
		
		Документы.ВыработкаСотрудников.РаспределитьСуммуПоУчастникам(ТекущийДокумент);
		
		#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [26.03.2026] -
		
	КонецЦикла;
			
	ЗаписатьНовыйДокумент(ТекущийДокумент, СписокДокументов, СписокОшибок);

	Если УдалятьДокументыСОшибками = Истина Тогда

		Для Каждого Строка Из СписокОшибок Цикл

			Если Строка.ТипОшибки = "ДокументСуществует" Тогда
				Продолжить;
			КонецЕсли;

			НачатьТранзакцию();

			Попытка

				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("Документ.ВыработкаСотрудников");
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Строка.Документ);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

				Блокировка.Заблокировать();
				ДокументОбъект = Строка.Документ.ПолучитьОбъект(); // ДокументОбъект.ВыработкаСотрудников
				ДокументОбъект.Удалить();
				ЗафиксироватьТранзакцию();

			Исключение

				ОтменитьТранзакцию();
				ДобавитьОшибкуАвтоматическогоСоздания(ДокументОбъект, СписокОшибок, "Заполнение", ОписаниеОшибки());

			КонецПопытки;

		КонецЦикла;

	КонецЕсли;

	ПолучитьСообщенияПользователю(Истина);

	Владелец = Пользователи.АвторизованныйПользователь();

	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Владелец, СписокДокументов.ВыгрузитьЗначения(), "ФормаСозданияВыработкиСотрудников");
	УстановитьПривилегированныйРежим(Ложь);

	Результат.Вставить("СписокОшибок", СписокОшибок);
	Результат.Вставить("КоличествоДокументов", СписокДокументов.Количество());
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);

	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, СписокДокументов.Количество());

КонецПроцедуры

&ИзменениеИКонтроль("ЗаписатьНовыйДокумент")
Процедура бит_ЗаписатьНовыйДокумент(ТекущийДокумент, СписокДокументов, СписокОшибок)

	Если ТекущийДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	#Удаление // {{ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [09.04.2026] +  //Не заполняем сотрудников, т.к. были заполнены ранее      
	
	ЗаполнитьРаботников(ТекущийДокумент); 
	
	#КонецУдаления // }}ПервыйБИТ ЛистТребований [ЛТ6.1.2] [ASHolyavko@1cbit.ru] [09.04.2026] -

	ТекущийДокумент.Записать(РежимЗаписиДокумента.Запись);

	Если ТекущийДокумент.ПроверитьЗаполнение() Тогда
		Попытка
			ТекущийДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДобавитьОшибкуАвтоматическогоСоздания(ТекущийДокумент, СписокОшибок, "Проведение", ОписаниеОшибки());
		КонецПопытки;
	Иначе
		ДобавитьОшибкуАвтоматическогоСоздания(ТекущийДокумент, СписокОшибок, "Заполнение");
	КонецЕсли;

	СписокДокументов.Добавить(ТекущийДокумент.Ссылка);

КонецПроцедуры


#КонецЕсли

