#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Функция получает массив источников, используемых в данной настройке.
// 
// Параметры:
//  Настройка - СправочникСсылка.бит_мдп_НастройкиПрезентацииОтчетности.
// 
// Возвращаемое значение:
//  МассивИсточников - Массив.
// 
Функция ИсточникиНастройкиПрезентацииОтчетности(Настройка) Экспорт

	МассивИсточников = Новый Массив;
	
	ПолучитьИсточникиТабличнойЧасти(Настройка.ПараметрыПрезентации, МассивИсточников);
	ПолучитьИсточникиТабличнойЧасти(Настройка.СерииДиаграмм, МассивИсточников);
	ПолучитьИсточникиТабличнойЧасти(Настройка.ТаблицыПрезентации, МассивИсточников);

	Возврат МассивИсточников;
	
КонецФункции // ИсточникиНастройкиПрезентацииОтчетности()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получает источник по строка табличной части.
// 
// Параметры:
//  СтрокаТаблицы - СтрокаТабличнойЧасти.
// 
// Возвращаемое значение:
//  ИсточникДанных - СправочникСсылка.бит_ИсточникиДанных.
// 
Функция ПолучитьИсточникПоСтроке(СтрокаТаблицы)

	Источник = Справочники.бит_ИсточникиДанных.ПустаяСсылка();
	
	Если ТипЗнч(СтрокаТаблицы.ИсточникДанных) = Тип("СправочникСсылка.бит_ИсточникиДанных") 
		 И ЗначениеЗаполнено(СтрокаТаблицы.ИсточникДанных) Тогда
	
		ИсточникДанных = СтрокаТаблицы.ИсточникДанных;
		
	ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.ЭлементДанных) Тогда
		
		ИсточникДанных = СтрокаТаблицы.ЭлементДанных.ИсточникДанных;
	
	КонецЕсли; 

	Возврат ИсточникДанных;
	
КонецФункции // ПолучитьИсточникПоСтроке()

// Процедура получает массив источников, используемых в данной табличной части. 
// 
Процедура ПолучитьИсточникиТабличнойЧасти(ТабЧасть, МассивИсточников)

	Для каждого СтрокаТаблицы Из ТабЧасть Цикл
	
		ИсточникДанных = ПолучитьИсточникПоСтроке(СтрокаТаблицы);
		Если ЗначениеЗаполнено(ИсточникДанных) Тогда
		
			 МассивИсточников.Добавить(ИсточникДанных);
		
		КонецЕсли; 
	
	КонецЦикла; 

КонецПроцедуры // ПолучитьИсточникиТабличнойЧасти()
	
#КонецОбласти
 
#КонецЕсли	
