#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
// Процедура формирует список документов отражения ДДС, с указанными отборами.
//
Процедура ОбработатьДанные() Экспорт

	СКД = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 
	
	
	// Формирование макета, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//получаем период
	
	НачалоПериода = НачалоДня(Период.ДатаНачала);
	КонецПериода = КонецДня(Период.ДатаОкончания);
	
	бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(Компоновщик, 
		НачалоПериода, "НачалоПериода");
															 
	бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(Компоновщик, 
		КонецПериода, "КонецПериода");
	
	
	// Настройки
	Настройки = ЭтотОбъект.Компоновщик.ПолучитьНастройки();
																				  
	// Передача схемы, настроек и данных расшифровки в макет компоновки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Выполнение компоновки с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	  
	Таблица = Новый ТаблицаЗначений;
	
	// Вывод таблицы         
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.УстановитьОбъект(Таблица);              
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	ЭтотОбъект.ОбрабатываемыеДокументы.Очистить();
	ЭтотОбъект.ОбрабатываемыеДокументы.Загрузить(Таблица);

	Обработки.бит_ИзменениеОтраженийФакта.ЗаполнитьАналитикиТабличнойЧасти(АналитикиТЧ, Настройки.Отбор.Элементы);
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли