#Область ПрограммныйИнтерфейс

Функция ОбъектОбработкиИнструмента(Инструмент, Объект) Экспорт
	
	Если Объект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Инструмент = ИТК_Перечисления.ИнструментПоискИЗаменаСсылок()
			ИЛИ Инструмент = ИТК_Перечисления.ИнструментСравнениеОбъектов()	Тогда
			
		// Необходимо обработать и оставить только ссылочные объекты
		ИсключаяПеречисления = (Инструмент = ИТК_Перечисления.ИнструментСравнениеОбъектов());
		Результат = ИзОбъектаТолькоСсылки(Объект, ИсключаяПеречисления);
			
	Иначе
		
		Результат = Объект;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция СоответствиеОписаниеИнструментов() Экспорт
	
	Возврат ИТК_ТуллкитПовтИсп.СоответствиеОписаниеИнструментов();
	
КонецФункции

Функция Версия() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Имя", ИТК_ТуллкитКлиентСервер.Идентификатор());
	
	НайденныеРасширения = РасширенияКонфигурации.Получить(Отбор);
	
	Возврат НайденныеРасширения[0].Версия;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИзОбъектаТолькоСсылки(Объект, ИсключаяПеречисления = Ложь)
	
	ТипЗначенияОбъекта = ТипЗнч(Объект);
	
	Если ТипЗначенияОбъекта = Тип("СписокЗначений") Тогда
		
		Результат = Новый СписокЗначений;
		Для Каждого ЭлементСписка Из Объект Цикл 
			
			Значение = ЭлементСписка.Значение;
			Если НЕ ИТК_ТипыКлиентСервер.ЭтоСсылочный(ТипЗнч(Значение)) Тогда
				Продолжить;
			КонецЕсли;
			
			Результат.Добавить(Значение);
			
		КонецЦикла;
		
	Иначе
		
		Если ИТК_ТипыКлиентСервер.ЭтоСсылочный(ТипЗначенияОбъекта) Тогда
			Результат = Объект;
		Иначе
			Результат = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
