
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВсегоКИзготовлению = Параметры.КоличествоКИзготовлению;   
	
	Номенклатура = Параметры.Номенклатура;
	НормативнаяМасса = Параметры.МассаНеттоКГ;
	
	КоличествоТары = Параметры.КоличествоЭтикеток;
	
	ЗапросГенерацииСерии = Номенклатура.бит_ЗапросГенерацииНовойСерииВСменномЗадании;
	// При изменении поля "Нормативная масса, кг" рассчитывать 
	// "Количество тары, шт" = "Всего к изготовлению, кг"/"Нормативная масса, кг" с округлением до целого числа в большую сторону.

	// При изменении поля "Количество тары, шт" рассчитывать 
	// "Нормативная масса, кг" = "Всего к изготовлению, кг"/"Количество тары, шт".
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	Структура = новый Структура;
	Структура.Вставить("КоличествоТары", КоличествоТары);
	Структура.Вставить("НормативнаяМасса", НормативнаяМасса);
	
	Закрыть(Структура);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НормативнаяМассаКГПриИзменении(Элемент)
	// При изменении поля "Нормативная масса, кг" рассчитывать 
	// "Количество тары, шт" = "Всего к изготовлению, кг"/"Нормативная масса, кг" с округлением до целого числа в большую сторону.
	//Если ЗначениеЗаполнено(НормативнаяМасса) Тогда
	//	КоличествоТары = Окр((ВсегоКИзготовлению / НормативнаяМасса) + 0.5, 0, РежимОкругления.Окр15как10);
	//Иначе             
	//	КоличествоТары = 0;
	//КонецЕсли;
    ПересчетНормативнойМассыИтого();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоТарыПриИзменении(Элемент)
	// При изменении поля "Количество тары, шт" рассчитывать 
	// "Нормативная масса, кг" = "Всего к изготовлению, кг"/"Количество тары, шт".
	//Если ЗначениеЗаполнено(КоличествоТары) Тогда
	//	НормативнаяМасса = ВсегоКИзготовлению / КоличествоТары;
	//Иначе             
	//	КоличествоТары = 0;
	//КонецЕсли;
    ПересчетНормативнойМассыИтого();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетНормативнойМассыИтого()
	
	НормативнаяМассаИтого = НормативнаяМасса * КоличествоТары;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПересчетНормативнойМассыИтого();
	
КонецПроцедуры
