////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастройкиБюджетированияУправлениеФормой(Форма) Экспорт

	Элементы  = Форма.Элементы;
	Запись    = Форма.НастройкиБюджетирования;

	ОтражатьФакт = НЕ Запись.НеФормироватьДвиженияПоФактуАвтоматически;
	Элементы.СценарийОтраженияФактаБДДС.Доступность 									= ОтражатьФакт;
	Элементы.НеФормироватьПроводкиБюджетированияПриАвтоматическомСбореФакта.Доступность = ОтражатьФакт;
	Элементы.ФормироватьЗависимыеОборотыПриАвтоматическомСбореФакта.Доступность			= ОтражатьФакт;	
	Элементы.ОтражатьФактБДДСНаОснованииОперУчета.Доступность							= ОтражатьФакт;
	
КонецПроцедуры 

Процедура НастройкиКазначействаУправлениеФормой(Форма) Экспорт

	Элементы  = Форма.Элементы;
	Запись    = Форма.НастройкиКазначейства;
		
	Элементы.СценарийКонтроляПоБюджету.Доступность 							 = Запись.КонтролироватьЗаявкуПоБюджету;
	Элементы.НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету.Доступность = Запись.КонтролироватьЗаявкуПоБюджету;		
	
	Элементы.ДопустимыйПроцентПревышенияСуммыПрогнозаПлатежа.Доступность =
			(Запись.КонтролироватьОстаткиПоПрогнозуПлатежа = ПредопределенноеЗначение("Перечисление.бит_ВидыКонтроля.Контролировать")
		ИЛИ  Запись.КонтролироватьОстаткиПоПрогнозуПлатежа = ПредопределенноеЗначение("Перечисление.бит_ВидыКонтроля.Предупреждать"));
		
	Элементы.ДопустимыйПроцентПревышенияСуммыПрогнозаПоступления.Доступность =
			(Запись.КонтролироватьОстаткиПоПрогнозуПоступления = ПредопределенноеЗначение("Перечисление.бит_ВидыКонтроля.Контролировать")
		ИЛИ  Запись.КонтролироватьОстаткиПоПрогнозуПоступления = ПредопределенноеЗначение("Перечисление.бит_ВидыКонтроля.Предупреждать"));
	
КонецПроцедуры

Процедура НастройкиВизированияУправлениеФормой(Форма) Экспорт

	Элементы  = Форма.Элементы;
	Запись    = Форма.НастройкиВизирования;
	
	ИспользоватьКалендарь = Запись.ИспользоватьКалендарьДляРасчетаКрайнейДаты;
	Элементы.ВизированиеУчитыватьРасписаниеПредприятия.Видимость = ИспользоватьКалендарь;
	
	УчитыватьРасписание = ИспользоватьКалендарь И Форма.ВизированиеУчитыватьРасписаниеПредприятия;
	Элементы.НачалоРабочегоДня.Видимость                               = УчитыватьРасписание;
	Элементы.ОкончаниеРабочегоДня.Видимость                            = УчитыватьРасписание;
	Элементы.НастройкиВизированияУчитыватьПредпраздничныеДни.Видимость = УчитыватьРасписание;
	Элементы.ВизированиеУчитыватьОбеденныйПерерыв.Видимость            = УчитыватьРасписание;
	
	УчитыватьОбеденныйПерерыв = УчитыватьРасписание И Форма.ВизированиеУчитыватьОбеденныйПерерыв;
	Элементы.НастройкиВизированияНачалоОбеденногоПерерыва.Видимость    = УчитыватьОбеденныйПерерыв;
	Элементы.НастройкиВизированияОкончаниеОбеденногоПерерыва.Видимость = УчитыватьОбеденныйПерерыв;

КонецПроцедуры

Процедура НастройкиЗакупокУправлениеФормой(Форма) Экспорт

	Элементы  = Форма.Элементы;
	Запись    = Форма.НастройкиЗакупок;
	
	Элементы.ФормироватьЗависимыеОборотыПоФактуБюджетаЗакупок.Доступность = Запись.ФормироватьДвиженияПоФактуБюджетаЗакупок;
	
	Элементы.НеУчитыватьСверхБюджетныеЗаявкиНаЗатратыПриКонтролеПоБюджету.Доступность = 
		Запись.КонтролироватьЗаявкуНаЗатратыПоБюджету;

КонецПроцедуры

#КонецОбласти
