#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Отказ Тогда		
		Возврат;
	КонецЕсли; 
	
	бит_ОбщиеПеременныеСервер.ЗначениеПеременнойУстановить("бит_НачалоОткрытогоПериода", 
			бит_ОбщегоНазначения.ЗаполнениеДатОткрытогоПериода(), ИСТИНА);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект[0], ДанныеЗаполнения);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект[0].ОбъектСистемы) Тогда
		ОсновнойРегистр  	        = ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойРегистрБухгалтерииУУ;
		ЭтотОбъект[0].ОбъектСистемы = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(ОсновнойРегистр);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли