
	
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьКоманд(Отказ);
	
	МетаРегистрБюдж       = Метаданные.РегистрыБухгалтерии.бит_Бюджетирование;
	ПараметрыФормыОтчетов = Новый Структура("РФ_РегистрБухгалтерии", бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаРегистрБюдж));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОтчетАнализСубконто_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_АнализСубконтоБюджетирование.ФормаОбъекта", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетАнализСчета_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_АнализСчетаБюджетирование.ФормаОбъекта", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетКарточкаСубконто_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_КарточкаСубконтоБюджетирование.ФормаОбъекта", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетКарточкаСчета_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_КарточкаСчетаБюджетирование.ФормаОбъекта", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетОборотноСальдоваяВедомость_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_ОборотноСальдоваяВедомостьБюджетирование.ФормаОбъекта", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетОборотноСальдоваяВедомостьПоСчету_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_ОборотноСальдоваяВедомостьПоСчетуБюджетирование.ФормаОбъекта", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОборотыМеждуСубконто_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_ОборотыМеждуСубконтоБюджетирование.ФормаОбъекта", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
				 
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетОборотыСчета_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_ОборотыСчетаБюджетирование.ФормаОбъекта", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
				 
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетОтчетПоПроводкам_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_ОтчетПоПроводкамБюджетирование.ФормаОбъекта", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьКоманд(Отказ)
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.РегистрыБухгалтерии.бит_Бюджетирование) Тогда
		ВызватьИсключение НСтр("ru='Недостаточно прав доступа.';en='It is not enough access rights.'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
