#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список статусов, доступных для установки объекту системы.
//
// Параметры:
// 	ОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы.
//
// Возвращаемое значение:
// 	СписокЗначений - список элементов справочника СправочникСсылка.бит_СтатусыОбъектов.
//
Функция ДоступныеСтатусыОбъектаСистемы(Знач ОбъектСистемы) Экспорт
	
	СписокДоступныхСтатусов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектСистемы", ОбъектСистемы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_СтатусыОбъектов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_СтатусыОбъектов КАК бит_СтатусыОбъектов
	|ГДЕ
	|	(бит_СтатусыОбъектов.Объект = &ОбъектСистемы
	|			ИЛИ бит_СтатусыОбъектов.Родитель = ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов))
	|	И бит_СтатусыОбъектов.Ссылка <> ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.СтатусНеопределен)
	|	И бит_СтатусыОбъектов.Родитель <> ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.КУдалению)";
	
	Результат = Запрос.Выполнить();
	
	МассивСтатусов = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	СписокДоступныхСтатусов.ЗагрузитьЗначения(МассивСтатусов);
	
	Возврат СписокДоступныхСтатусов;
	
КонецФункции

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает тип статуса
//
// Параметры:
// 	Статус - СправочникСсылка.бит_СтатусыОбъектов, СправочникОбъект.бит_СтатусыОбъектов.
//
// Возвращаемое значение:
// 	ПеречислениеСсылка.бит_ТипыСтатусовОбъектов.
//
Функция ТипСтатусаОбъкта(Статус) Экспорт
	
	Если ТипЗнч(Статус) = Тип("СправочникСсылка.бит_СтатусыОбъектов") Тогда
		Возврат бит_ВизированиеПовтИсп.ТипСтатусаОбъкта(Статус);
	КонецЕсли;
	
	Возврат Статус.ТипСтатуса;
	
КонецФункции

// Проверяет принадлежность статуса заданному типу.
//
// Параметры:
// 	Статус - СправочникСсылка.бит_СтатусыОбъектов, СправочникОбъект.бит_СтатусыОбъектов,
// 	ТипСтатуса - ПеречислениеСсылка.бит_ТипыСтатусовОбъектов, Массив.
//
// Возвращаемое значение:
// 	Булево.
//
Функция ПроверитьТипСтатуса(Статус, ТипСтатуса) Экспорт
	
	Если ТипЗнч(ТипСтатуса) <> Тип("Массив") Тогда
		Возврат ТипСтатуса = ТипСтатусаОбъкта(Статус);
	КонецЕсли;
	
	Для каждого ПотенциальныйТип Из ТипСтатуса Цикл
		Если ПотенциальныйТип = ТипСтатусаОбъкта(Статус) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоБлокирующийСтатус(Статус) Экспорт
	
	ТипСтатуса = ТипСтатусаОбъкта(Статус);
	
	БлокирующиеТипы = Новый СписокЗначений;
	БлокирующиеТипы.Добавить(Перечисления.бит_ТипыСтатусовОбъектов.Закрыт);
	БлокирующиеТипы.Добавить(Перечисления.бит_ТипыСтатусовОбъектов.Исполнен);
	
	Возврат БлокирующиеТипы.НайтиПоЗначению(ТипСтатуса) <> Неопределено;
	
КонецФункции

Процедура УстановитьТипыСтатусовПриПереходеНаНовуюВерсию() Экспорт
	
	ПараметрыЗаполнения    = ОбновлениеИнформационнойБазыСлужебный.НаборПараметровДляЗаполненияОбъекта(
								Метаданные.Справочники.бит_СтатусыОбъектов);
	ПредопределенныеДанные = ПараметрыЗаполнения.ПредопределенныеДанные;
	ПредопределенныеДанные.Колонки.Добавить("СсылкаНаЭлемент",
		Новый ОписаниеТипов("СправочникСсылка.бит_СтатусыОбъектов"));
	МенеджерОбъекта        = Справочники.бит_СтатусыОбъектов;
	Для каждого СтрокаЭлемента Из ПредопределенныеДанные Цикл
		СтрокаЭлемента.СсылкаНаЭлемент = МенеджерОбъекта[СтрокаЭлемента.ИмяПредопределенныхДанных];
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредопределенныеДанные.СсылкаНаЭлемент КАК Ссылка,
	|	ПредопределенныеДанные.ТипСтатуса КАК ТипСтатуса
	|ПОМЕСТИТЬ ПредопределенныеДанные
	|ИЗ
	|	&ПредопределенныеДанные КАК ПредопределенныеДанные";
	Запрос.УстановитьПараметр("ПредопределенныеДанные", ПредопределенныеДанные);
	Запрос.Выполнить();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредопределенныеДанные.Ссылка КАК Статус,
	|	ПредопределенныеДанные.ТипСтатуса КАК ТипСтатуса
	|ПОМЕСТИТЬ ТипыСтатусов
	|ИЗ
	|	ПредопределенныеДанные КАК ПредопределенныеДанные
	|ГДЕ
	|	ПредопределенныеДанные.ТипСтатуса <> ЗНАЧЕНИЕ(Перечисление.бит_ТипыСтатусовОбъектов.ПустаяСсылка)
	|	И ПредопределенныеДанные.ТипСтатуса <> ЗНАЧЕНИЕ(Перечисление.бит_ТипыСтатусовОбъектов.Прочее)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправочникСтатусов.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ТипыСтатусов.ТипСтатуса, ЗНАЧЕНИЕ(Перечисление.бит_ТипыСтатусовОбъектов.Прочее)) КАК ТипСтатуса
	|ИЗ
	|	Справочник.бит_СтатусыОбъектов КАК СправочникСтатусов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТипыСтатусов КАК ТипыСтатусов
	|		ПО СправочникСтатусов.Ссылка = ТипыСтатусов.Статус
	|			И СправочникСтатусов.ТипСтатуса <> ТипыСтатусов.ТипСтатуса
	|ГДЕ
	|	НЕ СправочникСтатусов.ЭтоГруппа
	|	И (СправочникСтатусов.ТипСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ТипыСтатусовОбъектов.ПустаяСсылка)
	|			ИЛИ ТипыСтатусов.ТипСтатуса ЕСТЬ НЕ NULL )";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтатусОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(СтатусОбъект, Выборка);
		// АПК:1327-выкл вызывается при обновлении ИБ.
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СтатусОбъект);
		// АПК:1327-вкл
	КонецЦикла;
	
КонецПроцедуры

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти = Неопределено) Экспорт
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	#Область ОбщиеСтатусыОбъектов
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов;
	Элемент.ИмяПредопределенныхДанных = "Закрыт";
	Элемент.Наименование              = НСтр("ru='Закрыт';en='Closed'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000158";
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Закрыт;
	Элемент.Порядок                   = 4;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов;
	Элемент.ИмяПредопределенныхДанных = "НаСогласовании";
	Элемент.Наименование              = НСтр("ru='На согласовании';en='On approval'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000156";
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.НаСогласовании;
	Элемент.Порядок                   = 2;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов;
	Элемент.ИмяПредопределенныхДанных = "Оплачен";
	Элемент.Наименование              = НСтр("ru='Оплачен';en='Paid'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000167";
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Исполнен;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов;
	Элемент.ИмяПредопределенныхДанных = "Отклонен";
	Элемент.Наименование              = НСтр("ru='Отклонен';en='Refused'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000159";
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Отклонен;
	Элемент.Порядок                   = 5;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов;
	Элемент.ИмяПредопределенныхДанных = "Рабочий";
	Элемент.Наименование              = НСтр("ru='Рабочий';en='Operating'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000163";
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Утвержден;
	Элемент.Порядок                   = 6;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов;
	Элемент.ИмяПредопределенныхДанных = "СтатусНеопределен";
	Элемент.Наименование              = НСтр("ru='Статус неопределен';en='Status undefined'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000030";
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов;
	Элемент.ИмяПредопределенныхДанных = "Утвержден";
	Элемент.Наименование              = НСтр("ru='Утвержден';en='Approved'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000157";
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Утвержден;
	Элемент.Порядок                   = 3;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов;
	Элемент.ИмяПредопределенныхДанных = "ЧастичноОплачен";
	Элемент.Наименование              = НСтр("ru='Частично оплачен';en='Partially paid'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000168";
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов;
	Элемент.ИмяПредопределенныхДанных = "Черновик";
	Элемент.Наименование              = НСтр("ru='Черновик';en='Draft'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000155";
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Черновик;
	Элемент.Порядок                   = 1;
	
	#КонецОбласти
	
	#Область СостоянияЗадач
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(Метаданные.Задачи.бит_Задача);
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СостоянияЗадач;
	Элемент.ИмяПредопределенныхДанных = "Задача_Выполнена";
	Элемент.Наименование              = НСтр("ru='Выполнена';en='Completed'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000070";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Исполнен;
	Элемент.Порядок                   = 3;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СостоянияЗадач;
	Элемент.ИмяПредопределенныхДанных = "Задача_Остановлена";
	Элемент.Наименование              = НСтр("ru='Остановлена';en='Stopped'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000078";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.Порядок                   = 6;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СостоянияЗадач;
	Элемент.ИмяПредопределенныхДанных = "Задача_Отменена";
	Элемент.Наименование              = НСтр("ru='Отменена';en='Cancelled'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000071";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Отклонен;
	Элемент.Порядок                   = 4;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СостоянияЗадач;
	Элемент.ИмяПредопределенныхДанных = "Задача_Принята";
	Элемент.Наименование              = НСтр("ru='Принята';en='Accepted'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000069";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 2;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СостоянияЗадач;
	Элемент.ИмяПредопределенныхДанных = "Задача_Просрочена";
	Элемент.Наименование              = НСтр("ru='Просрочена';en='Expired'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000072";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 5;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СостоянияЗадач;
	Элемент.ИмяПредопределенныхДанных = "Задача_Создана";
	Элемент.Наименование              = НСтр("ru='Создана';en='Created'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000068";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 1;
	
	#КонецОбласти
	
	#Область СостоянияПроцессов
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.БизнесПроцессы.бит_Процесс);
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СостоянияПроцессов;
	Элемент.ИмяПредопределенныхДанных = "Процесс_Активный";
	Элемент.Наименование              = НСтр("ru='Активный';en='Active'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000075";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 2;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СостоянияПроцессов;
	Элемент.ИмяПредопределенныхДанных = "Процесс_Завершен";
	Элемент.Наименование              = НСтр("ru='Завершен';en='Completed'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000076";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 3;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СостоянияПроцессов;
	Элемент.ИмяПредопределенныхДанных = "Процесс_Записан";
	Элемент.Наименование              = НСтр("ru='Записан';en='Saved'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000074";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 1;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СостоянияПроцессов;
	Элемент.ИмяПредопределенныхДанных = "Процесс_Остановлен";
	Элемент.Наименование              = НСтр("ru='Остановлен';en='Stopped'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000077";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 4;
	
	#КонецОбласти
	
	#Область СтатусыАктуализацияБюджета
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Документы.бит_АктуализацияБюджета);
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СтатусыАктуализацияБюджета;
	Элемент.ИмяПредопределенныхДанных = "АктуализацияБюджета_Проверен";
	Элемент.Наименование              = НСтр("ru='Проверена';en='Verified'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000028";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 1;
	
	#КонецОбласти
	
	#Область СтатусыБюджетнойОперации
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Документы.бит_БюджетнаяОперация);
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СтатусыБюджетнойОперации;
	Элемент.ИмяПредопределенныхДанных = "БюджетнаяОперация_Проверена";
	Элемент.Наименование              = НСтр("ru='Проверена';en='Verified'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000126";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 1;
	
	#КонецОбласти
	
	#Область СтатусыДополнительныеУсловияПоДоговору
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Документы.бит_ДополнительныеУсловияПоДоговору);
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СтатусыДополнительныеУсловияПоДоговору;
	Элемент.ИмяПредопределенныхДанных = "ДополнительныеУсловияПоДоговору_Проверен";
	Элемент.Наименование              = НСтр("ru='Проверена';en='Verified'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000035";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 1;
	
	#КонецОбласти
	
	#Область СтатусыЗаявкаНаИзменение
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Документы.бит_мдм_ЗаявкаНаИзменение);
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СтатусыЗаявкаНаИзменение;
	Элемент.ИмяПредопределенныхДанных = "ЗаявкаНаИзменение_Исполнена";
	Элемент.Наименование              = НСтр("ru='Исполнена';en='Executed'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000114";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Исполнен;
	Элемент.Порядок                   = 1;
	
	#КонецОбласти
	
	#Область СтатусыЗаявкаНаУдаление
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Документы.бит_мдм_ЗаявкаНаУдаление);
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СтатусыЗаявкаНаУдаление;
	Элемент.ИмяПредопределенныхДанных = "ЗаявкаНаУдаление_Исполнена";
	Элемент.Наименование              = НСтр("ru='Исполнена';en='Executed'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000108";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Исполнен;
	Элемент.Порядок                   = 1;
	
	#КонецОбласти
	
	#Область СтатусыКорректировкаБюджета
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Документы.бит_КорректировкаБюджета);
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СтатусыКорректировкаБюджета;
	Элемент.ИмяПредопределенныхДанных = "КорректировкаБюджета_Проверена";
	Элемент.Наименование              = НСтр("ru='Проверена';en='Verified'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000040";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 1;
	
	#КонецОбласти
	
	#Область СтатусыПретензийИсков
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Документы.бит_Претензия);
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СтатусыПретензийИсков;
	Элемент.ИмяПредопределенныхДанных = "ПретензияИск_Исполнено";
	Элемент.Наименование              = НСтр("ru='Исполнено';en='Executed'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000103";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Исполнен;
	Элемент.Порядок                   = 3;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СтатусыПретензийИсков;
	Элемент.ИмяПредопределенныхДанных = "ПретензияИск_Отправлено";
	Элемент.Наименование              = НСтр("ru='Отправлено';en='Sent'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000101";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 1;
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СтатусыПретензийИсков;
	Элемент.ИмяПредопределенныхДанных = "ПретензияИск_Получено";
	Элемент.Наименование              = НСтр("ru='Получено';en='Received'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000102";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 2;
	
	#КонецОбласти
	
	#Область СтатусыФормыВводаБюджета
	
	ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(
						Метаданные.Документы.бит_ФормаВводаБюджета);
	
	Элемент = Элементы.Добавить();
	Элемент.Родитель				  = Справочники.бит_СтатусыОбъектов.СтатусыФормыВводаБюджета;
	Элемент.ИмяПредопределенныхДанных = "ФормаВвода_Проверен";
	Элемент.Наименование              = НСтр("ru='Проверена';en='Verified'", КодОсновногоЯзыка);
	Элемент.Код                       = "000000018";
	Элемент.Объект                    = ОбъектСистемы;
	Элемент.ТипСтатуса                = Перечисления.бит_ТипыСтатусовОбъектов.Прочее;
	Элемент.Порядок                   = 1;
	
	#КонецОбласти
	
	МодульВизирование = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
	МодульВизирование.ПриНачальномЗаполненииСтатусовОбъектов(КодыЯзыков, Элементы, ТабличныеЧасти);	
	
КонецПроцедуры

Процедура ПеренестиСсылкиУдаляемыхСтатусовПриПереходеНаНовуюВерсию() Экспорт
	
	МодульВизирование = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
	ПарыЗамен         = МодульВизирование.АктуальныеСтатусыДляЗамены();
	
	ПараметрыЗамены = Новый Структура;
	ПараметрыЗамены.Вставить("ВключатьБизнесЛогику", Ложь);
	ПараметрыЗамены.Вставить("ЗаменаПарыВТранзакции", Ложь);
	ПараметрыЗамены.Вставить("ПривилегированнаяЗапись", Истина);
	
	ТаблицаРезультата = ОбщегоНазначения.ЗаменитьСсылки(ПарыЗамен, ПараметрыЗамены);
	Для каждого СтрокаРезультата Из ТаблицаРезультата Цикл
		
		ТекстСообщения = НСтр("ru='Не удалось заменить статус для: %1 по причине: %2';
							|en='Unable to change status for: %1 due to: 2%'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаРезультата.ОбъектОшибки, СтрокаРезультата.ТекстОшибки);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
									УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.бит_СтатусыОбъектов,
									СтрокаРезультата.ОбъектОшибки, ТекстСообщения); 
		
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Точки.Владелец КАК Алгоритм
	|ИЗ
	|	Справочник.бит_ТочкиАлгоритмов КАК Точки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ПользовательскиеДействия КАК Действия
	|		ПО Точки.ПользовательскоеДействие = Действия.Ссылка
	|			И (Действия.Назначение = ЗНАЧЕНИЕ(Перечисление.бит_НазначенияПользовательскихДействий.ИзменениеСтатусовОбъектов))
	|			И (Действия.Статус = ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.НаСогласовании))
	|			И (Точки.Наименование = ""Рабочая""
	|				ИЛИ Точки.Наименование = ""Рабочий"")";
	ВыборкаАлгоритмов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаАлгоритмов.Следующий() Цикл
		Модифицированно = Ложь;
		Алгоритм = ВыборкаАлгоритмов.Алгоритм.ПолучитьОбъект();
		ГрафическаяСхема = Алгоритм.КартаМаршрута.Получить();
		Если ТипЗнч(ГрафическаяСхема) <> Тип("ГрафическаяСхема") Тогда
			Продолжить;
		КонецЕсли;
		Для каждого ЭлементСхемы Из ГрафическаяСхема.ЭлементыГрафическойСхемы Цикл
			Если ТипЗнч(ЭлементСхемы) <> Тип("ЭлементГрафическойСхемыДействие") Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементСхемы.Наименование = "Рабочая"
				ИЛИ ЭлементСхемы.Наименование = "Рабочий" Тогда
				ЭлементСхемы.Наименование = НСтр("ru='На согласовании';en='On approval'");
				Модифицированно = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Модифицированно Тогда
			Алгоритм.КартаМаршрута = Новый ХранилищеЗначения(ГрафическаяСхема, 
													Новый СжатиеДанных(9));
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Алгоритм);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Действия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ПользовательскиеДействия КАК Действия
	|ГДЕ
	|	Действия.Назначение = ЗНАЧЕНИЕ(Перечисление.бит_НазначенияПользовательскихДействий.ИзменениеСтатусовОбъектов)
	|	И Действия.Статус = ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.НаСогласовании)
	|	И (Действия.Наименование = ""Рабочая""
	|			ИЛИ Действия.Наименование = ""Рабочий"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Точки.Ссылка
	|ИЗ
	|	Справочник.бит_ТочкиАлгоритмов КАК Точки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ПользовательскиеДействия КАК Действия
	|		ПО Точки.ПользовательскоеДействие = Действия.Ссылка
	|			И (Действия.Назначение = ЗНАЧЕНИЕ(Перечисление.бит_НазначенияПользовательскихДействий.ИзменениеСтатусовОбъектов))
	|			И (Действия.Статус = ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.НаСогласовании))
	|			И (Точки.Наименование = ""Рабочая""
	|				ИЛИ Точки.Наименование = ""Рабочий"")";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Наименование = НСтр("ru='На согласовании';en='On approval'");
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает объект системы, соответствующий предопределенной группе статусов.
//
// Параметры:
// 	ГруппаСтатусов - СправочникСсылка.бит_СтатусыОбъектов
//
// Возвращаемое значение:
// 	ОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы
//
Функция ОбъектСистемыВГруппе(ГруппаСтатусов) Экспорт
	
	ОбъектСистемы 		   = Справочники.бит_ОбъектыСистемы.ПустаяСсылка();
	
	Если ГруппаСтатусов = Справочники.бит_СтатусыОбъектов.ОбщиеСтатусыОбъектов Тогда
		Возврат ОбъектСистемы;
	КонецЕсли;
	
	ОбъектыСистемыВГруппах = ОбъектыСистемыВПоставляемыхГруппах();
	РезультаПоиска 		   = ОбъектыСистемыВГруппах.Найти(ГруппаСтатусов, "Статус");
	
	Если РезультаПоиска <> Неопределено Тогда
		ОбъектСистемы = РезультаПоиска.Объект;
	КонецЕсли; 
	
	Возврат ОбъектСистемы;
	
КонецФункции

// Возвращает соответствие предопределенных групп статусов объектам системы.
//
// Возвращаемое значение:
//  Соответствие - Ключ - предопределенная группа, Значение - СправочникСсылка.бит_ОбъектыСистемы.
//
Функция ОбъектыСистемыВПоставляемыхГруппах() Экспорт
	
	ОбъектыСистемыВГруппах = Новый ТаблицаЗначений(); 
	ОбъектыСистемыВГруппах.Колонки.Добавить("Статус", 	 Новый ОписаниеТипов("СправочникСсылка.бит_СтатусыОбъектов"));
	ОбъектыСистемыВГруппах.Колонки.Добавить("ПолноеИмя", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ОбъектыСистемыВГруппах.Колонки.Добавить("Объект", 	 Новый ОписаниеТипов("СправочникСсылка.бит_ОбъектыСистемы"));
	
	Менеджер = Справочники.бит_СтатусыОбъектов;
	
	ДобавитьВОбъектыСистемы(Менеджер.СостоянияЗадач, 	 					  Метаданные.Задачи.бит_Задача, 							 ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СостоянияПроцессов, 					  Метаданные.БизнесПроцессы.бит_Процесс,					 ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыАктуализацияБюджета, 			  Метаданные.Документы.бит_АктуализацияБюджета, 			 ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыБюджетнойОперации, 				  Метаданные.Документы.бит_БюджетнаяОперация, 				 ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыВнутреннийДокумент,				  Метаданные.Справочники.бит_ВнутренниеДокументы,			 ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыДополнительныеУсловияПоДоговору,  Метаданные.Документы.бит_ДополнительныеУсловияПоДоговору,  ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыЗаявкаНаИзменение,				  Метаданные.Документы.бит_мдм_ЗаявкаНаИзменение, 			 ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыЗаявкаНаУдаление, 				  Метаданные.Документы.бит_мдм_ЗаявкаНаУдаление, 			 ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыКорректировкаБюджета, 		 	  Метаданные.Документы.бит_КорректировкаБюджета,             ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыКорректировкаКонтрольныхЗначений, Метаданные.Документы.бит_КорректировкаКонтрольныхЗначений, ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыОперации, 						  Метаданные.Документы.бит_ОперацияУправленческий, 			 ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыПретензийИсков, 				  Метаданные.Документы.бит_Претензия, 						 ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыПротоколовРасхожденийБюджета, 	  Метаданные.Документы.бит_ПротоколРасхожденийБюджета,		 ОбъектыСистемыВГруппах);
	ДобавитьВОбъектыСистемы(Менеджер.СтатусыФормыВводаБюджета, 				  Метаданные.Документы.бит_ФормаВводаБюджета, 				 ОбъектыСистемыВГруппах);

	МодульВизирование = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
	МодульВизирование.ЗаполнитьОбъектыСистемыВПоставляемыхГруппах(ОбъектыСистемыВГруппах);
	
	ЗаполнитьОбъектыСистемы(ОбъектыСистемыВГруппах);
	
	Возврат ОбъектыСистемыВГруппах;

КонецФункции

Процедура УстановитьШрифтАвто() Экспорт
	
	ШрифтПоУмолчаниюАвто = Новый Шрифт;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СтатусыОбъектов.Ссылка КАК Ссылка,
	|	бит_СтатусыОбъектов.Оформление КАК Оформление
	|ИЗ
	|	Справочник.бит_СтатусыОбъектов КАК бит_СтатусыОбъектов";
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		 		
		Если НЕ ЗначениеЗаполнено(Выборка.Оформление) Тогда
			Продолжить;		
		КонецЕсли;
		
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		СтрОформления = Выборка.Оформление.Получить();
		Если ТипЗнч(СтрОформления) = Тип("Структура") Тогда
			
			// НастройкаОформления: Шрифт, ЦветФона, ЦветТекста, + ШрифтАвто
			Если НЕ СтрОформления.Свойство("ШрифтАвто") Тогда
				
				Если СтрОформления.Свойство("Шрифт") И СтрОформления.Шрифт.Вид = ВидШрифта.WindowsШрифт Тогда
					// Шрифт "Авто"
			    	СтрОформления.Вставить("ШрифтАвто", Истина);
					СтрОформления.Вставить("Шрифт"    , ШрифтПоУмолчаниюАвто);
				Иначе
			      	СтрОформления.Вставить("ШрифтАвто", Ложь);
				КонецЕсли;
				
				// Запись нового оформления
				СпрОбъект.Оформление = Новый ХранилищеЗначения(СтрОформления);
				// Запись справочника
				бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОбъект, , "Ошибки"); 				
				
			КонецЕсли; 
		КонецЕсли;		
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьОбъектыСистемыПриПереходеНаНовуюВерсию() Экспорт
		
	ОбъектыСистемыВГруппах = Справочники.бит_СтатусыОбъектов.ОбъектыСистемыВПоставляемыхГруппах();

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Таблица", ОбъектыСистемыВГруппах);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Статус КАК Статус,
	|	Таблица.ПолноеИмя КАК ПолноеИмя,
	|	Таблица.Объект КАК Объект
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектов.Ссылка КАК Ссылка,
	|	Таблица.Объект КАК Объект
	|ИЗ
	|	Справочник.бит_СтатусыОбъектов КАК СтатусыОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Таблица КАК Таблица
	|		ПО СтатусыОбъектов.Родитель = Таблица.Статус
	|			И (НЕ СтатусыОбъектов.ЭтоГруппа)
	|			И (СтатусыОбъектов.Родитель.Предопределенный)
	|			И СтатусыОбъектов.Объект <> Таблица.Объект";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтатусОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(СтатусОбъект, Выборка);
		// АПК:1327-выкл вызывается при обновлении ИБ.
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СтатусОбъект);
		// АПК:1327-вкл
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьВОбъектыСистемы(Статус, ОбъектМетаданных, ОбъектыСистемыВГруппах) Экспорт

	СтрокаТаблицы = ОбъектыСистемыВГруппах.Добавить();
	СтрокаТаблицы.Статус 	= Статус;
	СтрокаТаблицы.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();

КонецПроцедуры
	
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт

	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОбъектыСистемы(ОбъектыСистемыВГруппах)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", ОбъектыСистемыВГруппах);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Статус КАК Статус,
	|	Таблица.ПолноеИмя КАК ПолноеИмя,
	|	Таблица.Объект КАК Объект
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Статус КАК Статус,
	|	Таблица.ПолноеИмя КАК ПолноеИмя,
	|	ОбъектыСистемы.Ссылка КАК Объект
	|ИЗ
	|	Таблица КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
	|		ПО Таблица.ПолноеИмя = ОбъектыСистемы.ИмяОбъектаПолное";
	
	РезультатЗапроса	   = Запрос.Выполнить();
	ОбъектыСистемыВГруппах = РезультатЗапроса.Выгрузить();			
	
КонецПроцедуры

#КонецОбласти 
 
#КонецЕсли
