#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДаннымиСервер.НадоВыполнитьОбработчикПослеЗагрузкиДанных(ЭтотОбъект, Ссылка) Тогда
		
		ПослеЗагрузкиДанных();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента)
	
	МетаданныеЭлемента  = ЭлементДанных.Метаданные();
	ПолноеИмяМетаданных = МетаданныеЭлемента.ПолноеИмя();
	
	Если НЕ бит_АудиторскаяВыгрузкаПовтИсп.ОбъектРазрешенДляВыгрузкиИзАудита(ПолноеИмяМетаданных) Тогда
		ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	МетаданныеЭлемента  = ЭлементДанных.Метаданные();
	ПолноеИмяМетаданных = МетаданныеЭлемента.ПолноеИмя();
	
	Если НЕ бит_АудиторскаяВыгрузкаПовтИсп.ОбъектРазрешенДляВыгрузкиИзАудита(ПолноеИмяМетаданных) Тогда
		ПолучениеЭлемента = ПолучениеЭлементаДанных.Игнорировать;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза)
	
	Если СозданиеНачальногоОбраза Тогда
		УзлыПолучатели = ОбменДаннымиСобытия.ОпределитьПолучателей(ЭлементДанных, "бит_АудиторскаяВыгрузка");
		Если УзлыПолучатели.Найти(Ссылка) = Неопределено Тогда
			ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	МетаданныеЭлемента  = ЭлементДанных.Метаданные();
	ПолноеИмяМетаданных = МетаданныеЭлемента.ПолноеИмя();
	
	ФильтрыРеквизитов = бит_АудиторскаяВыгрузкаПовтИсп.ФильтрыРеквизитовДляОбъектаМетаданных(Ссылка, ПолноеИмяМетаданных);
	
	ЭтоРегистр = Метаданные.РегистрыСведений.Содержит(МетаданныеЭлемента)
					ИЛИ Метаданные.РегистрыНакопления.Содержит(МетаданныеЭлемента)
					ИЛИ Метаданные.РегистрыБухгалтерии.Содержит(МетаданныеЭлемента);
					
	ПредопределенныйЭлемент = Ложь;
	Если Метаданные.Справочники.Содержит(МетаданныеЭлемента)
		ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеЭлемента)
		ИЛИ Метаданные.ПланыСчетов.Содержит(МетаданныеЭлемента)
		ИЛИ Метаданные.ПланыВидовРасчета.Содержит(МетаданныеЭлемента) Тогда
		ПредопределенныйЭлемент = ЭлементДанных.Предопределенный;
	КонецЕсли;
	
	Для каждого СтрокаФильтра Из ФильтрыРеквизитов Цикл
		ИмяТабличнойЧасти = СтрокаФильтра.ИмяТабличнойЧасти; 
		ИмяРеквизита      = СтрокаФильтра.ИмяРеквизита;
		Если СтрокаФильтра.ПолноеОграничение Тогда
			Если НЕ ПредопределенныйЭлемент Тогда
				ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
				Возврат;
			КонецЕсли;
		ИначеЕсли НЕ ПустаяСтрока(ИмяТабличнойЧасти) Тогда
			Для каждого СтрокаТабличнойЧасти Из ЭлементДанных[ИмяТабличнойЧасти] Цикл
				СтрокаТабличнойЧасти[ИмяРеквизита] = Неопределено;
			КонецЦикла;
		ИначеЕсли ЭтоРегистр Тогда
			Для каждого ЗаписьРегистра Из ЭлементДанных Цикл
				ЗаписьРегистра[ИмяРеквизита] = Неопределено;
			КонецЦикла;
		Иначе
			ЭлементДанных[ИмяРеквизита] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПослеЗагрузкиДанных()
	
	Если Ссылка <> ПланыОбмена.Полный.ЭтотУзел() Тогда
		
		// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
		ЗащитаПерсональныхДанных.ПослеЗагрузкиДанных(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных
		
	КонецЕсли;
	
	Справочники.бит_КлючиСценарийЦФО.ЗаменитьДублиКлючейАналитики();
	Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.ЗаменитьДублиКлючейАналитики();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли