
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.10]  [VUVaynula@1cbit.ru] [10.07.2026 2:07:01] +        
	Команда = Команды.Добавить("бит_ПечатьФайловГП");
	Команда.Заголовок = "(бит) Печать файлов ГП";
	Команда.Действие = "бит_ПечатьФайловГП";

	Кнопка = Элементы.Добавить("бит_ПечатьФайловГП", Тип("КнопкаФормы"), Элементы.ГруппаКоманды);
	Кнопка.ИмяКоманды = "бит_ПечатьФайловГП";
	// }}ПервыйБИТ ЛистТребований [ЛТ6.10]  [VUVaynula@1cbit.ru] [10.07.2026 2:07:01] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ПечатьФайловГП(Команда)
// {{ПервыйБИТ ЛистТребований [ЛТ6.10]  [VUVaynula@1cbit.ru] [10.07.2026 1:48:38] +  
	Для каждого ТекЭтап из Элементы.Список.ВыделенныеСтроки Цикл
		// есть требование сразу отмечать что распечатано. поэтому делаем так.
		ФайлыКПечати = ПолучитьФайлыГПНаСервере(ТекЭтап);
		Если ФайлыКПечати.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет прикрепленных файлов для печати.");
			Продолжить;
		КонецЕсли;
		РаботаСФайламиКлиент.НапечататьФайлы(ФайлыКПечати, УникальныйИдентификатор);    
		ОтметкаОРаспечатывании(ТекЭтап);
	КонецЦикла;
// }}ПервыйБИТ ЛистТребований [ЛТ6.10]  [VUVaynula@1cbit.ru] [10.07.2026 1:48:38] -	
КонецПроцедуры                     

&НаСервереБезКонтекста
Процедура ОтметкаОРаспечатывании(ТекЭтап)
	// {{ПервыйБИТ ЛистТребований [ЛТ6..10]  [VUVaynula@1cbit.ru] [10.07.2026 2:23:18] +        
	Док = ТекЭтап.ПолучитьОбъект();
	Док.бит_ПаспортРаспечатан = Истина;
	Док.Записать();
	// }}ПервыйБИТ ЛистТребований [ЛТ6..10]  [VUVaynula@1cbit.ru] [10.07.2026 2:23:18] -
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФайлыГПНаСервере(ТекЭтап)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.10]  [VUVaynula@1cbit.ru] [10.07.2026 1:55:11] +        
	Если не ТекЭтап.Проведен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + ТекЭтап + "Не проведен. Пропущен");
		Возврат Новый Массив;
	ИначеЕсли ТекЭтап.бит_ПечатьПаспорта = Ложь Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Из этапа " + ТекЭтап + " не печатается паспорт ГП");
		Возврат Новый Массив;
	КонецЕсли;  
	
	МассивЭтапов = Новый Массив;
	МассивЭтапов.Добавить(ТекЭтап);
	
	Возврат Документы.ЭтапПроизводства2_2.ПолучитьФайлыГП(МассивЭтапов);
	// }}ПервыйБИТ ЛистТребований [ЛТ6.10]  [VUVaynula@1cbit.ru] [10.07.2026 1:55:11] -
КонецФункции
