
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:29:29] +        
	// задача 6 
	НоваяГруппа = ЭтаФорма.Элементы.Вставить("бит_ГруппаСмены", Тип("ГруппаФормы"), ЭтаФорма, Элементы.ГруппаСтраницы);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь; 
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СменаВесовщика", Тип("ПолеФормы"), НоваяГруппа, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СменаВесовщика";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СменаПроизводства", Тип("ПолеФормы"), НоваяГруппа, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СменаПроизводства";
	
	НовыйЭлемент  = Элементы.Вставить("ВыходныеИзделиябит_ВидРабочегоЦентра", Тип("ПолеФормы"), Элементы.ВыходныеИзделия, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.ВыходныеИзделия.бит_ВидРабочегоЦентра";
	
    НовыйЭлемент  = Элементы.Вставить("ВыходныеИзделиябит_ШтампЭмалировщика", Тип("ПолеФормы"), Элементы.ВыходныеИзделия, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.ВыходныеИзделия.бит_ШтампЭмалировщика";
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "НачалоВыборабит_ШтампЭмалировщика");
	
	НовыйЭлемент  = Элементы.Вставить("ВыходныеИзделиябит_ШтампКонтролера", Тип("ПолеФормы"), Элементы.ВыходныеИзделия, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.ВыходныеИзделия.бит_ШтампКонтролера";
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "НачалоВыборабит_ШтампКонтролера");
	
	НовыйЭлемент  = Элементы.Вставить("ВыходныеИзделиябит_Тара", Тип("ПолеФормы"), Элементы.ВыходныеИзделия, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.ВыходныеИзделия.бит_Тара";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзменениибит_Тара");
	
	НовыйЭлемент  = Элементы.Вставить("ВыходныеИзделиябит_МассаТарыКг", Тип("ПолеФормы"), Элементы.ВыходныеИзделия, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.ВыходныеИзделия.бит_МассаТарыКг";  
	
	НовоеПодменю = ЭтаФорма.Элементы.Добавить("бит_Изменить",  Тип("ГруппаФормы"), ЭтаФорма.Элементы.ВыходныеИзделия.КоманднаяПанель);
	НовоеПодменю.Вид = ВидГруппыФормы.Подменю;             
	НовоеПодменю.Заголовок = "(бит) Изменить";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ЗаполнитьВРЦ");
	НоваяКоманда.Заголовок = "Заполнить ВРЦ";
	НоваяКоманда.Действие = "бит_ЗаполнитьВРЦ";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ЗаполнитьЭмалировщика");
	НоваяКоманда.Заголовок = "Заполнить эмалировщика";
	НоваяКоманда.Действие = "бит_ЗаполнитьЭмалировщика";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ЗаполнитьКонтроллера");
	НоваяКоманда.Заголовок = "Заполнить контроллера";
	НоваяКоманда.Действие = "бит_ЗаполнитьКонтроллера";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ЗаполнитьТару");
	НоваяКоманда.Заголовок = "Заполнить тару";
	НоваяКоманда.Действие = "бит_ЗаполнитьТару";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ЗаполнитьВРЦ", Тип("КнопкаФормы"), НовоеПодменю);
	НовыйЭлемент.ИмяКоманды = "бит_ЗаполнитьВРЦ";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ЗаполнитьЭмалировщика", Тип("КнопкаФормы"), НовоеПодменю);
	НовыйЭлемент.ИмяКоманды = "бит_ЗаполнитьЭмалировщика";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ЗаполнитьКонтроллера", Тип("КнопкаФормы"), НовоеПодменю);
	НовыйЭлемент.ИмяКоманды = "бит_ЗаполнитьКонтроллера";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ЗаполнитьТару", Тип("КнопкаФормы"), НовоеПодменю);
	НовыйЭлемент.ИмяКоманды = "бит_ЗаполнитьТару";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ПечатьЭтикеток");
	НоваяКоманда.Заголовок = "(бит) Печать этикеток";
	НоваяКоманда.Действие = "бит_ПечатьЭтикеток";               
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ПечатьЭтикеток", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ВыходныеИзделия.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "бит_ПечатьЭтикеток";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ПечатьВесовойЭтикетки");
	НоваяКоманда.Заголовок = "(бит) Печать весовой этикетки";
	НоваяКоманда.Действие = "бит_ПечатьВесовойЭтикетки";               
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ПечатьВесовойЭтикетки", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ВыходныеИзделия.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "бит_ПечатьВесовойЭтикетки";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ТранслироватьДанныеЗавесов");
	НоваяКоманда.Заголовок = "(бит) Транслировать данные завесов";
	НоваяКоманда.Действие = "бит_ТранслироватьДанныеЗавесов";               
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ТранслироватьДанныеЗавесов", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ВыходныеИзделия.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "бит_ТранслироватьДанныеЗавесов";
	// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:29:29] - 
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ_БН] [ASHolyavko@1cbit.ru] [28.07.2026] +        
	
	НовыйЭлемент = Элементы.Добавить("бит_Перемаркировка", Тип("ПолеФормы"), Элементы.ГруппаОсновное); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Перемаркировка";
	
	// }}ПервыйБИТ ЛистТребований [ЛТ_БН] [ASHolyavko@1cbit.ru] [28.07.2026] -
		
КонецПроцедуры

&НаКлиенте
Процедура бит_ЗаполнитьВРЦ(Команда) 
// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:52:35] +        
	мВыделенных = Элементы.ВыходныеИзделия.ВыделенныеСтроки;
	
	ПФ = Новый Структура;
	ПФ.Вставить("РежимВыбора", Истина);
	ПФ.Вставить("ЗакрыватьПриВыборе", Истина);
	ПФ.Вставить("МножественныйВыбор", Ложь);
	ОткрытьФорму("Справочник.ВидыРабочихЦентров.ФормаВыбора", ПФ, ЭтаФорма, УникальныйИдентификатор, , , Новый ОписаниеОповещения("ПослеВыбораВРЦ", ЭтотОбъект, мВыделенных)); 
		
// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:52:35] -	
КонецПроцедуры 

&НаКлиенте
Процедура бит_ЗаполнитьЭмалировщика(Команда) 
// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:52:35] +        
	ВыбратьЭмалировщика(Элементы.ВыходныеИзделия.ВыделенныеСтроки);
// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:52:35] -	
КонецПроцедуры

 &НаКлиенте
Процедура бит_ЗаполнитьТару(Команда) 
// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:52:35] +        
	ПФ = Новый Структура;
	ПФ.Вставить("Отбор", Новый Структура("ТипНоменклатуры", ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара"))); 
	ПФ.Вставить("РежимВыбора", Истина);
	ПФ.Вставить("ЗакрыватьПриВыборе", Истина);
	ПФ.Вставить("МножественныйВыбор", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПФ, ЭтаФорма, УникальныйИдентификатор, , , Новый ОписаниеОповещения("ПослеВыбораТары", ЭтотОбъект, Элементы.ВыходныеИзделия.ВыделенныеСтроки)); 
// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:52:35] -	
КонецПроцедуры 

&НаКлиенте
Процедура бит_ЗаполнитьКонтроллера(Команда) 
// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:52:35] +        
	ВыбратьКонтроллера(Элементы.ВыходныеИзделия.ВыделенныеСтроки);
// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:52:35] -	
КонецПроцедуры  

&НаКлиенте
Процедура бит_ВыходныеИзделияСтатусУказанияСерийПриИзмененииПосле(Элемент)
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:40:53] +        
	//бит_ПриИзмененииСерии();
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:40:53] -
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТаблицаСерияПриИзменении")
Процедура бит_ТаблицаСерияПриИзменении(ИмяТЧ)

	ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;

	ВыбранноеЗначение = НоменклатураКлиентСервер.ВыбраннаяСерия();

	ВыбранноеЗначение.Значение						= ТекущиеДанные.Серия;
	ВыбранноеЗначение.ИдентификаторТекущейСтроки	= ТекущиеДанные.ПолучитьИдентификатор();

	НоменклатураКлиент.ОбработатьУказаниеСерии(
	ЭтаФорма,
	ПараметрыУказанияСерий[ИмяТЧ],
	ВыбранноеЗначение,
	ТекущиеДанные);

	СтруктураДействий = Новый Структура;

	Если ЦенообразованиеКлиент.НеобходимПересчетЦеныПриИзменении(ТекущиеДанные.Номенклатура, "Серия", Объект.Дата) Тогда

		Если ИмяТЧ = "ВыходныеИзделия" Тогда
			СтруктураДействий.Вставить("ПроверитьЗаполнитьДолюСтоимости", ПараметрыРаспределенияЗатрат);
		КонецЕсли;

		Если (ИмяТЧ = "ВыходныеИзделия" И ИспользоватьПлановуюСтоимость)
			Или ИмяТЧ = "ПобочныеИзделия" Тогда

			СтруктураПараметров = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект);
			СтруктураПараметров.Вставить("ВидЦены", Объект.ВидЦены);
			СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", СтруктураПараметров);
			СтруктураДействий.Вставить("ПересчитатьСумму", "Количество");

		КонецЕсли;

	КонецЕсли;
	#Вставка 
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] +        
	Если ИмяТЧ = "ВыходныеИзделия" И ЗначениеЗаполнено(ТекущиеДанные.Серия) Тогда
		
		Количество = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Серия, "бит_МассаНетто");
		Если Количество > 0 Тогда
			ТекущиеДанные.Количество = Количество;
		КонецЕсли;
		
	    ТекущиеДанные.бит_ШтампЭмалировщика = бит_ШтампЭмалировщика(ТекущиеДанные.Серия);
		
		ТекущиеДанные.бит_Тара = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Серия, "бит_ТипТары");
	
		ТекущиеДанные.бит_МассаТарыКг = бит_ПересчитатьМассуТары(ТекущиеДанные.бит_Тара);
	
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] -
	#КонецВставки

	Если Не СтруктураДействий.Количество() = 0 Тогда
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Функция бит_ШтампЭмалировщика(Серия)
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] + 
	Если ЗначениеЗаполнено(Серия) И ЗначениеЗаполнено(Серия.бит_Эмалировщик) Тогда
		Свойство = СвойствоШтампЭмалировщика();
	 	бит_ШтампЭмалировщика = УправлениеСвойствами.ЗначениеСвойства(Серия.бит_Эмалировщик, Свойство);
	Иначе                                     
		бит_ШтампЭмалировщика = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
	КонецЕсли;     
	Возврат бит_ШтампЭмалировщика;
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] -
КонецФункции

&НаСервереБезКонтекста
Функция КГ()
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] + 
	Возврат Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("166")
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] -
КонецФункции    

&НаКлиенте
Процедура ПриИзменениибит_Тара()
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] + 
	ТД = Элементы.ВыходныеИзделия.ТекущиеДанные;
	ТД.бит_МассаТарыКг = бит_ПересчитатьМассуТары(ТД.бит_Тара);  
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] -
КонецПроцедуры

&НаСервере
Функция бит_ПересчитатьМассуТары(бит_Тара)
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] + 
	бит_МассаТарыКг = 0;
	Если ЗначениеЗаполнено(бит_Тара) И бит_Тара.ВесИспользовать Тогда
		Масса = бит_Тара.ВесЧислитель / ?(ЗначениеЗаполнено(бит_Тара.ВесЗнаменатель), бит_Тара.ВесЗнаменатель, 1);
		Если бит_Тара.ЕдиницаИзмерения <> КГ() Тогда
			бит_МассаТарыКг = Масса * ?(ЗначениеЗаполнено(бит_Тара.ЕдиницаИзмерения.Числитель), бит_Тара.ЕдиницаИзмерения.Числитель, 1) / ?(ЗначениеЗаполнено(бит_Тара.ЕдиницаИзмерения.Знаменатель), бит_Тара.ЕдиницаИзмерения.Знаменатель, 1);
		КонецЕсли;
	КонецЕсли;
	
	Возврат бит_МассаТарыКг;
    // }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] -
КонецФункции

&НаКлиенте
Процедура НачалоВыборабит_ШтампКонтролера(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] + 
	СтандартнаяОбработка = Ложь;
	ВыбратьКонтроллера(Элементы.ВыходныеИзделия.ТекущиеДанные);
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] -	
КонецПроцедуры 

&НаКлиенте
Процедура ВыбратьКонтроллера(ДопДанные)
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 12:35:03] +        
	Свойство = СвойствоШтампКонтроллера();
	ПФ = Новый Структура;
	ПФ.Вставить("Отбор", Новый Структура("Владелец", Свойство)); 
	ПФ.Вставить("РежимВыбора", Истина);
	ПФ.Вставить("ЗакрыватьПриВыборе", Истина);
	ПФ.Вставить("МножественныйВыбор", Ложь);
	ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.ФормаВыбора", ПФ, ЭтаФорма, УникальныйИдентификатор, , , Новый ОписаниеОповещения("ПослеВыбораКонтроллера", ЭтотОбъект, ДопДанные)); 
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 12:35:03] -
КонецПроцедуры  

&НаКлиенте
Процедура НачалоВыборабит_ШтампЭмалировщика(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] + 
	СтандартнаяОбработка = Ложь;
	ВыбратьЭмалировщика(Элементы.ВыходныеИзделия.ТекущиеДанные);
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] -	
КонецПроцедуры 

&НаКлиенте
Процедура ВыбратьЭмалировщика(ДопДанные) 
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] + 
	Свойство = СвойствоШтампЭмалировщика();
	ПФ = Новый Структура;
	ПФ.Вставить("Отбор", Новый Структура("Владелец", Свойство)); 
	ПФ.Вставить("РежимВыбора", Истина);
	ПФ.Вставить("ЗакрыватьПриВыборе", Истина);
	ПФ.Вставить("МножественныйВыбор", Ложь);
	ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.ФормаВыбора", ПФ, ЭтаФорма, УникальныйИдентификатор, , , Новый ОписаниеОповещения("ПослеВыбораЭмалировщика", ЭтотОбъект, ДопДанные)); 
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] -
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТары(ВыбЗначение, ДопДанные) Экспорт
// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:24:08] +        
	Если ВыбЗначение <> Неопределено Тогда  
		МассаТары = бит_ПересчитатьМассуТары(ВыбЗначение);
		Для каждого стр из ДопДанные Цикл
			ТекДанные = Элементы.ВыходныеИзделия.ДанныеСтроки(стр);
			ТекДанные.бит_Тара = ВыбЗначение;
			ТекДанные.бит_МассаТарыКг = МассаТары;
		КонецЦикла;
	КонецЕсли;
// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:24:08] -	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонтроллера(ВыбЗначение, ДопДанные) Экспорт
// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:24:08] +        
	Если ВыбЗначение <> Неопределено Тогда             
		Если ТипЗнч(ДопДанные) = Тип("Массив") Тогда  
			Для каждого стр из ДопДанные Цикл
				ТекДанные = Элементы.ВыходныеИзделия.ДанныеСтроки(стр);
				ТекДанные.бит_ШтампКонтролера = ВыбЗначение;
			КонецЦикла;
		Иначе
			ДопДанные.бит_ШтампКонтролера = ВыбЗначение;
		КонецЕсли;
	КонецЕсли;
// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:24:08] -	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораЭмалировщика(ВыбЗначение, ДопДанные) Экспорт
// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:24:08] +        
	Если ВыбЗначение <> Неопределено Тогда             
		Если ТипЗнч(ДопДанные) = Тип("Массив") Тогда  
			Для каждого стр из ДопДанные Цикл
				ТекДанные = Элементы.ВыходныеИзделия.ДанныеСтроки(стр);
				ТекДанные.бит_ШтампЭмалировщика = ВыбЗначение;
			КонецЦикла;
		Иначе
			ДопДанные.бит_ШтампЭмалировщика = ВыбЗначение;
		КонецЕсли;
	КонецЕсли;
// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 11:24:08] -	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВРЦ(ВыбЗначение, ДопДанные) Экспорт  
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 12:38:54] +        
	Если ВыбЗначение <> Неопределено Тогда             
		Для каждого стр из ДопДанные Цикл
			ТекДанные = Элементы.ВыходныеИзделия.ДанныеСтроки(стр);
			ТекДанные.бит_ВидРабочегоЦентра = ВыбЗначение;
		КонецЦикла;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 12:38:54] -
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвойствоШтампКонтроллера() 
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] + 
	Возврат Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ШтампКонтроллера, , Истина);
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] -	
КонецФункции  

&НаСервереБезКонтекста
Функция СвойствоШтампЭмалировщика() 
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] + 
	Возврат Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ШтампЭмалировщика, , Истина);
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 10:43:22] -	
КонецФункции

#Область ПечатьЭтикетки

&НаКлиенте
Процедура бит_ПечатьЭтикеток(Команда)
// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 12:38:54] +        
	мВыделенныхСтрок = Элементы.ВыходныеИзделия.ВыделенныеСтроки; 
	мСтрок = Новый Массив;
	Для каждого стр из мВыделенныхСтрок Цикл
		ТД = Элементы.ВыходныеИзделия.ДанныеСтроки(стр);
        Структура = Новый Структура;
		Структура.Вставить("Номенклатура", ТД.Номенклатура);
		Структура.Вставить("Тара", ТД.бит_Тара);
		Структура.Вставить("Спецификация", ТД.Спецификация); 
		Структура.Вставить("ВидРабочегоЦентра", ТД.бит_ВидРабочегоЦентра);
		Структура.Вставить("МассаНеттоКГ", ТД.Количество);
		Структура.Вставить("Серия", ТД.Серия);
		Структура.Вставить("ШтампЭмалировщика", ТД.бит_ШтампЭмалировщика);
		Структура.Вставить("ШтампКонтролера", ТД.бит_ШтампКонтролера);
		
		мСтрок.Добавить(Структура);
	КонецЦикла;
	
	Если мСтрок.Количество() Тогда
		АдресТаблицы = СформироватьДанныеДляПечатиЭтикеток(мСтрок, Объект.бит_СменаПроизводства, Объект.Дата);
		Если АдресТаблицы <> Неопределено Тогда                   
			ОткрытьФормуПечати(АдресТаблицы);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для печати");
	КонецЕсли;
// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 12:38:54] -
КонецПроцедуры                               

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПризнака(Знач Номенклатура, Знач ЭлементСправочникаПоУмолчанию)
// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] +        
	ИскомоеЗначение = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(ЭлементСправочникаПоУмолчанию, , Истина);
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК бит_Значение
	                      |ИЗ
	                      |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
	                      |ГДЕ
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &бит_Номенклатура
	                      |	И бит_ЗначенияПризнаковНоменклатуры.бит_Признак = &бит_Признак");
	Запрос.УстановитьПараметр("бит_Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("бит_Признак", ИскомоеЗначение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.бит_Значение;
	Иначе 
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] -	
 КонецФункции
 
 &НаСервереБезКонтекста
Функция ПолучитьШтрихкодНоменклатуры46(Знач Номенклатура)
// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] +        
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	                      |	И ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 1, 2) = ""46""");
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ШК = Выборка.Штрихкод;
	Иначе
		ШК = "";
	КонецЕсли;
	
	Возврат ШК;
// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] -	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьДанныеДляПечатиЭтикеток(мСтрок, СменаПроизводства, Дата)
	// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 13:09:14] +        
	ТипЧисло10_2 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10,2));
	ТипШаблон = Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников");
	ТипДата = Новый ОписаниеТипов("Дата");
	ТипСтрока1020 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1020));
	
	ТаблицаЗначений = новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаЗначений.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));	
	ТаблицаЗначений.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));	 	
	ТаблицаЗначений.Колонки.Добавить("Цена", ТипЧисло10_2);	
	ТаблицаЗначений.Колонки.Добавить("ЦенаДополнительно", ТипЧисло10_2);
	ТаблицаЗначений.Колонки.Добавить("Штрихкод", ТипСтрока1020); 
	ТаблицаЗначений.Колонки.Добавить("ШаблонЦенника", ТипШаблон);
	ТаблицаЗначений.Колонки.Добавить("КоличествоЦенников", ТипЧисло10_2);
	ТаблицаЗначений.Колонки.Добавить("ШаблонЭтикетки", ТипШаблон);	
	ТаблицаЗначений.Колонки.Добавить("ШаблонЭтикеткиПодготовлено", ТипШаблон);
	ТаблицаЗначений.Колонки.Добавить("КоличествоЭтикеток", ТипЧисло10_2);
	ТаблицаЗначений.Колонки.Добавить("ОстатокНаСкладе", ТипЧисло10_2);
	ТаблицаЗначений.Колонки.Добавить("КоличествоВДокументе", ТипЧисло10_2);
	ТаблицаЗначений.Колонки.Добавить("Весовой", Новый ОписаниеТипов("Булево"));	
	ТаблицаЗначений.Колонки.Добавить("ДатаПоследнегоИзмененияЦены", ТипДата);
	ТаблицаЗначений.Колонки.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно", ТипДата);
	
	ТаблицаЗначений.Колонки.Добавить("МаркаГотовойПродукции", ТипСтрока1020);	  
	ТаблицаЗначений.Колонки.Добавить("НомерСерии", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТаблицаЗначений.Колонки.Добавить("ШКСерии", ТипСтрока1020); 
	ТаблицаЗначений.Колонки.Добавить("СтандартGOST", ТипСтрока1020);
	ТаблицаЗначений.Колонки.Добавить("РазмерRAZMER", ТипСтрока1020);
	ТаблицаЗначений.Колонки.Добавить("МашинаХод", ТипСтрока1020);
	ТаблицаЗначений.Колонки.Добавить("СменаДата", ТипСтрока1020);
	ТаблицаЗначений.Колонки.Добавить("ШтампЭмалировщика", ТипСтрока1020); 
	ТаблицаЗначений.Колонки.Добавить("ШтампЭмалировщикаСсылка", Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов")); 
	
	СоответствиеКЗаписи = Новый Соответствие;
	//МассивДанныхДляПечати = Новый Массив;
	Для каждого стр из мСтрок Цикл
		нов = ТаблицаЗначений.Добавить();
		нов.Номенклатура = стр.Номенклатура;
		нов.Штрихкод = ПолучитьШтрихкодНоменклатуры46(стр.Номенклатура);
		нов.КоличествоЭтикеток = 1;
		нов.МаркаГотовойПродукции = ПолучитьЗначениеПризнака(стр.Номенклатура, Справочники.бит_ЗначенияПоУмолчанию.ПризнакMARKA);	  
		нов.НомерСерии = стр.Серия;
		Если ЗначениеЗаполнено(стр.Серия) Тогда
			нов.ШКСерии = Справочники.СерииНоменклатуры.СгенерироватьСтрокуШК(стр.Серия);
		КонецЕсли;
		нов.СтандартGOST = ПолучитьЗначениеПризнака(стр.Номенклатура, Справочники.бит_ЗначенияПоУмолчанию.ПризнакГОСТ);
		нов.РазмерRAZMER = ПолучитьЗначениеПризнака(Стр.Номенклатура, Справочники.бит_ЗначенияПоУмолчанию.ПризнакРазмерГотовойПродукции);
		нов.МашинаХод = "м. " + Стр.ВидРабочегоЦентра.Родитель + " x. " + Стр.ВидРабочегоЦентра;
		нов.СменаДата = СменаПроизводства.Наименование + "/" + формат(Дата, "ДФ=dd.MM.yyyy");
		нов.ШтампЭмалировщика = стр.ШтампЭмалировщика; 
		нов.ШтампЭмалировщикаСсылка = стр.ШтампЭмалировщика;
		
	КонецЦикла;                                                      
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	вт.ШтампЭмалировщикаСсылка КАК ШтампЭмалировщика,
	                      |	вт.НомерСерии КАК Серия
	                      |ПОМЕСТИТЬ вт
	                      |ИЗ
	                      |	&вт КАК вт
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	СотрудникиДополнительныеРеквизиты.Ссылка КАК Сотрудник,
	                      |	вт.Серия КАК Серия
	                      |ИЗ
	                      |	Справочник.Сотрудники.ДополнительныеРеквизиты КАК СотрудникиДополнительныеРеквизиты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	                      |		ПО СотрудникиДополнительныеРеквизиты.Значение = вт.ШтампЭмалировщика
	                      |ГДЕ
	                      |	вт.Серия <> ЗНАЧЕНИЕ(Справочник.Серииноменклатуры.ПустаяСсылка)");	
	Запрос.УстановитьПараметр("вт", ТаблицаЗначений);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			Серияобъект = Выборка.Серия.ПолучитьОбъект();
			Серияобъект.бит_Эмалировщик = Выборка.Сотрудник;
			Серияобъект.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать эмалировщика " + Выборка.Сотрудник + " в серию " + Выборка.Серия + "по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), Выборка.Серия);
		КонецПопытки;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаЗначений);
	// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 13:09:14] -
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПечати(Адрес)
// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] +        
	ПараметрыОткрытия = Новый Структура; 
	ПараметрыОткрытия.Вставить("ВладелецФормы");
	ПараметрыОткрытия.Вставить("ИменаМакетов", "бит_ЭтикеткаТовары");		
	ПараметрыОткрытия.Вставить("ИмяМенеджераПечати", "Обработка.ПечатьЭтикетокИЦенников");
	ПараметрыОткрытия.Вставить("ИсточникДанных");
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм");
	ПараметрыОткрытия.Вставить("ОбъектыПечати", Новый СписокЗначений);
	МассивПараметрКоманды = новый Массив;
	МассивПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	ПараметрыОткрытия.Вставить("ПараметрКоманды", МассивПараметрКоманды);
	ПараметрыОткрытия.Вставить("ПараметрыВывода"); 
	ПараметрыОткрытия.Вставить("ПараметрыИсточника");
	СтруктураПараметрыПечати = Новый Структура;
	СтруктураПараметрыПечати.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	СтруктураПараметрыПечати.Вставить("ВидЦеныДополнительно", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	СтруктураПараметрыПечати.Вставить("Дата", ТекущаяДата());
	СтруктураПараметрыПечати.Вставить("ДатаДополнительно", ТекущаяДата());
	СтруктураПараметрыПечати.Вставить("МаксимальныйКодВесовогоТовара", 99999);
	СтруктураПараметрыПечати.Вставить("Организация");
	СтруктураПараметрыПечати.Вставить("ПравилоВыгрузкиВВесы", Ложь);
	СтруктураПараметрыПечати.Вставить("ПравилоОбмена");
	СтруктураПараметрыПечати.Вставить("Склад");
	СтруктураПараметрыПечати.Вставить("СтранаРегистрации", ПредопределенноеЗначение("Справочник.СтраныМира.Россия"));
	СтруктураПараметрыПечати.Вставить("СтруктураМакетаШаблона");
	СтруктураПараметрыПечати.Вставить("Товары", Адрес);
	
	ПараметрыОткрытия.Вставить("ПараметрыПечати", СтруктураПараметрыПечати);
	ПараметрыОткрытия.Вставить("ТекущийЯзык");
	ПараметрыОткрытия.Вставить("УникальныйИдентификаторХранилища");
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] -	
КонецПроцедуры                     

#КонецОбласти

#Область ПечатьВесовойЭтикетки

&НаКлиенте
Процедура бит_ПечатьВесовойЭтикетки(Команда)
// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 12:38:54] +        
	мВыделенныхСтрок = Элементы.ВыходныеИзделия.ВыделенныеСтроки; 
	мСтрок = Новый Массив;
	Для каждого стр из мВыделенныхСтрок Цикл
		ТД = Элементы.ВыходныеИзделия.ДанныеСтроки(стр);
		Если Не ЗначениеЗаполнено(ТД.Серия) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена серия в строке " + ТД.НомерСтроки);
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТД.бит_Тара) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена тара в строке " + ТД.НомерСтроки);
			Продолжить;
		КонецЕсли;
		
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура", ТД.Номенклатура);
		Структура.Вставить("Тара", ТД.бит_Тара);
		Структура.Вставить("ВидРабочегоЦентра", ТД.бит_ВидРабочегоЦентра);
		Структура.Вставить("МассаНеттоКГ", ТД.Количество);
		Структура.Вставить("Серия", ТД.Серия);
		Структура.Вставить("ШтампЭмалировщика", ТД.бит_ШтампЭмалировщика);
		Структура.Вставить("ШтампКонтролера", ТД.бит_ШтампКонтролера);
		
		мСтрок.Добавить(Структура);
	КонецЦикла;
	
	Если мСтрок.Количество() Тогда
		АдресТаблицы = СформироватьДанныеДляПечатиВесовыхЭтикеток(мСтрок, Объект.бит_СменаВесовщика);
		Если АдресТаблицы <> Неопределено Тогда                   
			ОткрытьФормуПечатиВесовыхЭтикеток(АдресТаблицы);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для печати");
	КонецЕсли;
// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 12:38:54] -
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьДанныеДляПечатиВесовыхЭтикеток(мСтрок, СменаВесовщика)
// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 12:38:54] +
	ТекущееВремя = ТекущаяДатаСеанса();
	Шаблон = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ЭтикеткаЗавесовПоУмолчанию, , Истина);
	
	ТипЧисло10_3 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10 ,3));
	ТипШаблон = Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников");
	ТипДата = Новый ОписаниеТипов("Дата");
	ТипСтрока1020 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1020));
	ТипУпаковка = Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения");
	ТипСтрока10 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10));
	
	ТаблицаЗначений = новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаЗначений.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));	
	ТаблицаЗначений.Колонки.Добавить("Упаковка", ТипУпаковка);	 	
	ТаблицаЗначений.Колонки.Добавить("Цена", ТипЧисло10_3);	
	ТаблицаЗначений.Колонки.Добавить("ЦенаДополнительно", ТипЧисло10_3);
	ТаблицаЗначений.Колонки.Добавить("Штрихкод", ТипСтрока1020); 
	ТаблицаЗначений.Колонки.Добавить("ШаблонЦенника", ТипШаблон);
	ТаблицаЗначений.Колонки.Добавить("КоличествоЦенников", ТипЧисло10_3);
	ТаблицаЗначений.Колонки.Добавить("ШаблонЭтикетки", ТипШаблон);	
	ТаблицаЗначений.Колонки.Добавить("ШаблонЭтикеткиПодготовлено", ТипШаблон);
	ТаблицаЗначений.Колонки.Добавить("КоличествоЭтикеток", ТипЧисло10_3);
	ТаблицаЗначений.Колонки.Добавить("ОстатокНаСкладе", ТипЧисло10_3);
	ТаблицаЗначений.Колонки.Добавить("КоличествоВДокументе", ТипЧисло10_3);
	ТаблицаЗначений.Колонки.Добавить("Весовой", Новый ОписаниеТипов("Булево"));	
	ТаблицаЗначений.Колонки.Добавить("ДатаПоследнегоИзмененияЦены", ТипДата);
	ТаблицаЗначений.Колонки.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно", ТипДата);

	ТаблицаЗначений.Колонки.Добавить("ТекущееВремя", ТипДата);
	ТаблицаЗначений.Колонки.Добавить("МассаТары", ТипСтрока10);
	ТаблицаЗначений.Колонки.Добавить("МассаНетто", ТипСтрока10);
	ТаблицаЗначений.Колонки.Добавить("МассаБрутто", ТипСтрока10);
	ТаблицаЗначений.Колонки.Добавить("ЕдТары", ТипУпаковка);
	
	// {{ПервыйБИТ ЛистТребований [без номера] [ASHolyavko@1cbit.ru] [04.08.2026] +        
	//в этикетке появился новый параметр "серия", чтоб не создавать новый шаблон, передаем пустой параметр
	ТаблицаЗначений.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	// }}ПервыйБИТ ЛистТребований [без номера] [ASHolyavko@1cbit.ru] [04.08.2026] -
	
	Для каждого стр из мСтрок Цикл
		Штрихкод = ПолучитьШтрихкодНоменклатуры2(стр.Номенклатура);
		Если Штрихкод = "" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Штрихкод не найден. Печать не выполнена для " + стр.Номенклатура);
			Продолжить;
		Иначе                                                                 
			// вставим вес нетто        
			ВесСтрокой = СтрЗаменить(Формат(стр.МассаНеттоКГ, "ЧЦ=5; ЧДЦ=3; ЧРД=','; ЧН=Ноль; ЧВН="),",",""); 
			Штрихкод = ПодготовитьШтрихкод(Штрихкод, ВесСтрокой); 
			НовыйШтрихкод = Штрихкод; 
		
		КонецЕсли;
		нов = ТаблицаЗначений.Добавить();
		нов.Номенклатура = стр.Номенклатура;   
		нов.ШаблонЭтикетки = Шаблон;
		нов.Штрихкод = Штрихкод;
		нов.КоличествоЭтикеток = 1;  
		нов.ТекущееВремя = ТекущееВремя; 
		
		МассаТары = МассаТарыКГ(стр.Тара);
		нов.МассаТары   = Формат(МассаТары, "ЧЦ=10; ЧДЦ=3; ЧРД=,");
		
		нов.МассаНетто  = Формат(стр.МассаНеттоКГ, "ЧЦ=10; ЧДЦ=3; ЧРД=,");
		нов.МассаБрутто = Формат(стр.МассаНеттоКГ + МассаТары, "ЧЦ=10; ЧДЦ=3; ЧРД=,");
	    нов.ЕдТары = стр.Тара.ВесЕдиницаИзмерения;  
		нов.Весовой = Истина; 
		
		Попытка
			СерияОбъект = стр.Серия.ПолучитьОбъект();
			СерияОбъект.бит_ТипТары = стр.Тара;    
			СерияОбъект.бит_Брутто = нов.МассаБрутто;
			СерияОбъект.бит_Весовщик = Пользователи.АвторизованныйПользователь();  
			СерияОбъект.бит_ДатаВремяЗавеса = ТекущаяДатаСеанса();   
			СерияОбъект.бит_Штрихкод = нов.Штрихкод;
			СерияОбъект.бит_Контроллёр = НайтиКонтроллераПоШтампу(стр.ШтампКонтролера);
			СерияОбъект.бит_СменаВесовщика = СменаВесовщика;   
			СерияОбъект.бит_Завешено = Истина;
			СерияОбъект.бит_МассаНетто = стр.МассаНеттоКГ; 
			СерияОбъект.Записать();
		Исключение       
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выполнить трансляцию данных в серию " + стр.Серия, стр.Серия);
		КонецПопытки;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаЗначений);
// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 12:38:54] -
КонецФункции

&НаСервереБезКонтекста
Функция НайтиКонтроллераПоШтампу(ШтампКонтролера)
// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 14:41:00] +        
	Запрос = новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	спр.Ссылка КАК Ссылка
                      |ИЗ
                      |	Справочник.Сотрудники.ДополнительныеРеквизиты КАК спр
                      |ГДЕ
                      |	спр.Значение = &Штамп");  
	Запрос.УстановитьПараметр("Штамп", ШтампКонтролера);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Контролер = Выборка.Ссылка;
	Иначе
		Контролер = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;

	Возврат Контролер;
// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 14:41:00] -	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШтрихкодНоменклатуры2(Знач Номенклатура)
// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] +        
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	                      |	И ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 1, 1) = ""2""");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ШК = Выборка.Штрихкод;
	Иначе
		ШК = "";
	КонецЕсли;                                                   
	
	Возврат ШК;
// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] -	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПечатиВесовыхЭтикеток(Адрес)
// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] +        
	ПараметрыОткрытия = Новый Структура; 
	ПараметрыОткрытия.Вставить("ВладелецФормы");
	ПараметрыОткрытия.Вставить("ИменаМакетов", "ЭтикеткаТовары");		
	ПараметрыОткрытия.Вставить("ИмяМенеджераПечати", "Обработка.ПечатьЭтикетокИЦенников");
	ПараметрыОткрытия.Вставить("ИсточникДанных");
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм");
	ПараметрыОткрытия.Вставить("ОбъектыПечати", Новый СписокЗначений);
	МассивПараметрКоманды = новый Массив;
	МассивПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	ПараметрыОткрытия.Вставить("ПараметрКоманды", МассивПараметрКоманды);
	ПараметрыОткрытия.Вставить("ПараметрыВывода"); 
	ПараметрыОткрытия.Вставить("ПараметрыИсточника");
	СтруктураПараметрыПечати = Новый Структура;
	СтруктураПараметрыПечати.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	СтруктураПараметрыПечати.Вставить("ВидЦеныДополнительно", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	СтруктураПараметрыПечати.Вставить("Дата", ТекущаяДата());
	СтруктураПараметрыПечати.Вставить("ДатаДополнительно", ТекущаяДата());
	СтруктураПараметрыПечати.Вставить("МаксимальныйКодВесовогоТовара", 99999);
	СтруктураПараметрыПечати.Вставить("Организация");
	СтруктураПараметрыПечати.Вставить("ПравилоВыгрузкиВВесы", Ложь);
	СтруктураПараметрыПечати.Вставить("ПравилоОбмена");
	СтруктураПараметрыПечати.Вставить("Склад");
	СтруктураПараметрыПечати.Вставить("СтранаРегистрации", ПредопределенноеЗначение("Справочник.СтраныМира.Россия"));
	СтруктураПараметрыПечати.Вставить("СтруктураМакетаШаблона");
	СтруктураПараметрыПечати.Вставить("Товары", Адрес);
	
	
	ПараметрыОткрытия.Вставить("ПараметрыПечати", СтруктураПараметрыПечати);
	ПараметрыОткрытия.Вставить("ТекущийЯзык");
	ПараметрыОткрытия.Вставить("УникальныйИдентификаторХранилища");
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] -	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МассаТарыКГ(Знач Тара)
// {{ПервыйБИТ ЛистТребований [АРМ Завесы]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] +	
	Если Не ЗначениеЗаполнено(Тара) или Тара.ВесИспользовать = Ложь Тогда
		Масса = 0;
	Иначе
		кг = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("166");
		Масса = Тара.ВесЧислитель / ?(ЗначениеЗаполнено(Тара.ВесЗнаменатель), Тара.ВесЗнаменатель, 1);
		Если Тара.ЕдиницаИзмерения <> кг Тогда
			Масса = Масса * ?(ЗначениеЗаполнено(Тара.ЕдиницаИзмерения.Числитель), Тара.ЕдиницаИзмерения.Числитель, 1) / ?(ЗначениеЗаполнено(Тара.ЕдиницаИзмерения.Знаменатель), Тара.ЕдиницаИзмерения.Знаменатель, 1);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Масса;
// }}ПервыйБИТ ЛистТребований [АРМ Завесы]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] -	
КонецФункции             

&НаСервереБезКонтекста
Функция ПодготовитьШтрихкод(Знач Штрихкод, Знач ВесСтрокой) Экспорт
// {{ПервыйБИТ ЛистТребований [АРМ Завесы]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] +	
	Если СтрДлина(Штрихкод) = 13 И Лев(Штрихкод, 2) = "2_" Тогда
		Диапазон = ЗначениеНастроекПовтИсп.ДиапазонВесовыхШтрихкодовПоУмолчанию();
		
		Если Диапазон = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Не определены диапазоны весовых штрихкодов.';
									|en = 'Weight barcode ranges are not determined.'");	
		КонецЕсли;
		
		Строка = Диапазон + Сред(Штрихкод, 3, 5) + Лев(ВесСтрокой, 5);
		Возврат Строка + РегистрыСведений.ШтрихкодыНоменклатуры.КонтрольныйСимволEAN(Строка, 13);
	КонецЕсли;
	
	Возврат Штрихкод; 
// }}ПервыйБИТ ЛистТребований [АРМ Завесы]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] -	
КонецФункции
	
#КонецОбласти 

&НаКлиенте
Процедура бит_ТранслироватьДанныеЗавесов(Команда)
	// {{ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 14:52:07] +        
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок("ВыходныеИзделия", ЭтаФорма, СтруктураДействий);
	Для каждого стр из Объект.ВыходныеИзделия Цикл
		Если Не ЗначениеЗаполнено(стр.Серия) Или ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(стр.Серия, "бит_Завешено") = Ложь Тогда
			Продолжить;
		КонецЕсли;
		бит_МассаНетто = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(стр.Серия, "бит_МассаНетто"); 
		Если бит_МассаНетто <> стр.Количество Тогда
			стр.Количество 			= бит_МассаНетто;
			стр.КоличествоУпаковок 	= бит_МассаНетто;  
			
			СтруктураДействий.Вставить("ПересчитатьДолюСтоимости", ПараметрыРаспределенияЗатрат);
			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(стр, СтруктураДействий, КэшированныеЗначения);
		КонецЕсли;
	КонецЦикла;  
	ЭтаФорма.Модифицированность = Истина;
// }}ПервыйБИТ ЛистТребований [исправление после сквозного]  [VUVaynula@1cbit.ru] [16.03.2026 14:52:07] -	
КонецПроцедуры