#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИТК_ФормаКлиентСервер.Заголовок(ЭтотОбъект, НСтр("ru = 'Вставка ссылки на объект';
													|en = 'Insert object reference'"));
	
	КодЯзыкаПрограммирования = ИТК_Общий.КодЯзыкаПрограммирования();
	ИТК_Форма.ОбновитьСписокВыбораТипОбъекта(Элементы.Тип, КодЯзыкаПрограммирования);
	
	СтандартнаяИнициализация = Истина;
	Если ЗначениеЗаполнено(Параметры.Текст) Тогда
		
		СсылкаИнициализации = ИТК_Общий.ВычислитьВыражение(Параметры.Текст);
		
		Если ТипЗнч(СсылкаИнициализации) <> Тип("Структура") Тогда
			
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаИнициализации));
			
			Если ОбъектМетаданных <> Неопределено Тогда
				
				СтандартнаяИнициализация = Ложь;
				
				Тип = ИТК_Метаданные.ИмяОбъектаКоллекции(ОбъектМетаданных);
				ОбновитьСписокВыбораИмя();
				Имя = ОбъектМетаданных.Имя;
				
				Ссылка = СсылкаИнициализации;
				Элементы.Ссылка.ВыбиратьТип = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;		
	
	Если СтандартнаяИнициализация Тогда 
		Тип = Элементы.Тип.СписокВыбора[0];
		ОбновитьСписокВыбораИмя();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЭлементыУправления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	Ссылка = Неопределено;
	ОбновитьСписокВыбораИмя();
	ОбновитьЭлементыУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)

	Ссылка = Неопределено;
	
	Если ЗначениеЗаполнено(Имя) Тогда

		ТипСсылка = ИТК_МетаданныеКлиентСервер.ПолноеИмяТипаСсылка(Тип, Имя);
		ОписаниеТипов = ИТК_ТипыКлиентСервер.ОписаниеТиповПоТипу(ТипСсылка);
		
		Элементы.Ссылка.ОграничениеТипа = ОписаниеТипов;
		Элементы.Ссылка.ДоступныеТипы = ОписаниеТипов;
		
	КонецЕсли;
	
	ОбновитьЭлементыУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.АвтоПодборЗначенияВФорме(Текст, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИТК_ФормаКлиент.ОбработкаВыбораЗначенияВФорме(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(Результат());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокВыбораИмя()
	
	СписокВыбора = Элементы.Имя.СписокВыбора;
	СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Тип) Тогда
		
		ИмяКоллекции = ИТК_Метаданные.ИмяКоллекции(Тип, КодЯзыкаПрограммирования);
		КоллекцияМетаданных = ИТК_МетаданныеПовтИсп.КоллекцияМетаданныхПоИмени(ИмяКоллекции);

		Для Каждого ОбъектМетаданных Из КоллекцияМетаданных Цикл 
			СписокВыбора.Добавить(ОбъектМетаданных.Имя);
		КонецЦикла;
		
		СписокВыбора.СортироватьПоЗначению();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыУправления()

	Элементы.Имя.Доступность = ЗначениеЗаполнено(Тип);
	Элементы.Ссылка.Доступность = ЗначениеЗаполнено(Имя);
	
	Элементы.ФормаКомандаОК.Доступность = ЗначениеЗаполнено(Тип) И ЗначениеЗаполнено(Имя);
	
КонецПроцедуры

&НаСервере
Функция Результат()
	
	Возврат ИТК_Код.Значение(Ссылка);
	
КонецФункции

#КонецОбласти