
#Область ПрограммныйИнтерфейс

// Обработчик подкючаемой команды ввода на основании по шаблону.
//
// Параметры:
//  ПараметрыВыполнения - см. ПодключаемыеКомандыКлиент.ПараметрыВыполненияКоманды.
//  ПараметрыФормы - Структруа - Параметры открытия формы.
//
Процедура ЗаполнитьПоШаблонуВводаНаОснованииИОткрытьФорму(ПараметрыВыполнения, ПараметрыФормы) Экспорт
	
	ОписаниеКоманды        = ПараметрыВыполнения.ОписаниеКоманды;
	ШаблонВводаНаОсновании = ОписаниеКоманды.ДополнительныеПараметры.ШаблонВводаНаОсновании;
	
	ОснованиеШаблон = Новый Структура;
	ОснованиеШаблон.Вставить("Основание",              ПараметрыФормы.Основание);
	ОснованиеШаблон.Вставить("ШаблонВводаНаОсновании", ШаблонВводаНаОсновании);
	ПараметрыФормы.Вставить("Основание", ОснованиеШаблон);
	
	ОткрытьФорму(ОписаниеКоманды.ИмяФормы, ПараметрыФормы, ПараметрыВыполнения.Форма, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ДействияПриНачалеРаботыСистемы

#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда

// Процедура выполняет активацию приложения.
// 
// Параметры:
//  ИмяПриложения   - Ид приложения или заголовок окна.
//  ЖдатьЗавершения - Булево.
//  ВыводитьОшибки  - Булево.
// 
Процедура АктивироватьПриложение(ИмяПриложения, ЖдатьЗавершения = Ложь, ВыводитьОшибки = Истина) Экспорт

	// Готовим текст скрипта активации.
	Путь         = ПолучитьИмяВременногоФайла("vbs");
	Скрипт       = ПолучитьОбщийМакет("бит_мпд_АктивироватьПриложение");
	ТекстСкрипта = Скрипт.ПолучитьТекст();
	ТекстСкрипта = СтрЗаменить(ТекстСкрипта,"%AppID%", ИмяПриложения);
	Скрипт.УстановитьТекст(ТекстСкрипта);
	
	Дополнительно = Новый Структура;
	Дополнительно.Вставить("Путь", Путь);
	Дополнительно.Вставить("ЖдатьЗавершения", ЖдатьЗавершения);
	Дополнительно.Вставить("ВыводитьОшибки", ВыводитьОшибки);
	
	Оповещение 	  = Новый ОписаниеОповещения("АктивироватьПриложениеЗавершение", ЭтотОбъект, Дополнительно); 
	Скрипт.НачатьЗапись(Оповещение, Путь, КодировкаТекста.ANSI);
	
КонецПроцедуры

// Обработчик завершения записи текстового документа.
//  См. Синтакс-помощник: ТекстовыйДокумент.НачатьЗапись().
//
Процедура АктивироватьПриложениеЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = Истина Тогда
		ПараметрыЗапуска = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();
		ПараметрыЗапуска.ДождатьсяЗавершения = Дополнительно.ЖдатьЗавершения;
		ФайловаяСистемаКлиент.ЗапуститьПрограмму("""" + Дополнительно.Путь + """", ПараметрыЗапуска);
	Иначе
		Если Дополнительно.ВыводитьОшибки Тогда
			ТекстСообщения = НСтр("ru='Не удалось записать скрипт активации внешнего окна ""%1"".';
								  |en='Failed to write external window activation script ""%1"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения,  Дополнительно.Путь);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
 
#КонецЕсли 

// Процедура выполняет действия, необходимые при начале работы системы. 
// 
Процедура ДействияПриНачалеРаботыСистемы()  Экспорт
	
	// Инициализация клиента лицензирования.
	бит_ЛицензированиеБФКлиентПереопределяемый.ИнициализацияРешения();
	Если бит_ЛицензированиеБФСерверПереопределяемый.ТребуетсяОбновитьИнтерфес() Тогда		
		бит_ЛицензированиеБФСерверПереопределяемый.ТребуетсяОбновитьИнтерфес(Ложь);
		бит_РаботаСДиалогамиКлиент.ОбновитьИнтерфейсПользователя();		 
	КонецЕсли; 
	
	// Подключение обработчика действия сообщения системы взаимодействия.
	Если СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		Оповещение = Новый ОписаниеОповещения("ОткрытьНавигационнуюСсылку", бит_ОбщегоНазначенияКлиент);
		СистемаВзаимодействия.ПодключитьОбработчикДействияСообщения(Оповещение);
	КонецЕсли; 
	
	ПарамСтарта = бит_ПолныеПраваВызовСервера.ПолучитьПараметрыДляСтартаСистемы("ДействияПриНачалеРаботыСистемы");	
	Если ПарамСтарта.ЭтоЧужойПодчиненныйУзел Тогда	
		Возврат;	
	КонецЕсли; 
	
	// Здесь выключаю обновление и действия на клиенте при запуске БИТ.Финанс для перехода на БСП.
	// Интерактивное взаимодействие с пользователем:
	// - заполняем параметры: См. бит_ОбщегоНазначения.ПриДобавленииПараметровРаботыКлиентаПриЗапуске()
	// - выполнение по параметрам:
	// 		См. ОбщегоНазначенияКлиентПереопределяемый.ПослеНачалаРаботыСистемы() -> 
	// 		бит_ОбщегоНазначенияКлиент.ПослеНачалаРаботыСистемы().
	// Обработчики обновления:  бит_ОбновлениеИнформационнойБазыБФ.ПриДобавленииОбработчиковОбновления().
	
КонецПроцедуры
 
#КонецОбласти

#Область ФункцииРаботыСоЗначениямиТипаДата

Функция ВремяВМинуты(СтрВремя) Экспорт
	
	Время = Новый Структура("Дни, Часы, Минуты", 0, 0, 0);
	ЗаполнитьЗначенияСвойств(Время, СтрВремя);
	
	КоличествоМинут = Время.Дни*1440+Время.Часы*60+Время.Минуты;
	
	Возврат КоличествоМинут;
	
КонецФункции	

#КонецОбласти

Процедура ПослеНачалаРаботыСистемы() Экспорт

	// Доступные параметры работы клиента см. бит_ОбщегоНазначения.ПриДобавленииПараметровРаботыКлиентаПриЗапуске();
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	
	Если ПараметрыРаботыКлиента.бит_ПоказатьФормуКонстант Тогда
		ПоказатьФормуКонстант();
	КонецЕсли; 
	
	Если ПараметрыРаботыКлиента.бит_ПоказатьРабочееМестоВизирования Тогда
		ПоказатьРабочееМестоВизирования();
	КонецЕсли;
	
	Если ПараметрыРаботыКлиента.бит_ПодключитьОжиданиеУведомленияОбУстановкеВиз <> 0 Тогда
		ПодключитьОжиданиеУведомленияОбУстановкеВиз(ПараметрыРаботыКлиента.бит_ПодключитьОжиданиеУведомленияОбУстановкеВиз);
	КонецЕсли;
	
	Если ПараметрыРаботыКлиента.бит_ПоказатьДополнительнуюИнформацию Тогда
		ПоказатьДополнительнуюИнформацию();
	КонецЕсли;
	
КонецПроцедуры
	
// Устарела. Будет удалена процедура и вызовы после 01.01.2021.
Процедура УдалитьЗначениеКэша(Ключ) Экспорт
	
	
КонецПроцедуры

// Процедура открывает обработку рабочее место визирования с заполненным перечнем документов, 
// подлежащих визированию.
// 
// Параметры:
//  ОтключитьМеханизмЗащиты - Булево.
// 
Процедура УведомитьОбУстановкеВиз(ОтключитьМеханизмЗащиты) Экспорт
	
	КлючеваяОперация           = "ЕстьНеобработанныеВизы.бит_КонсольОперативногоВизирования";
	ИдентификаторЗамераВремени = ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
	ДлительнаяОперация         = бит_ОбщегоНазначенияВызовСервера.ПроверкаНаличияНеобработанныхВизВФоне(
									Новый УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru='Проверка наличия необработанных виз.'");  
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура("ИдентификаторЗамераВремени", ИдентификаторЗамераВремени);
	ОписаниеОповещения      = Новый ОписаниеОповещения("ПриЗавершенииУведомленияОбУстановкеВиз", ЭтотОбъект,
														ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

Процедура ПриЗавершенииУведомленияОбУстановкеВиз(ПараметрыРезультата, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(ДополнительныеПараметры.ИдентификаторЗамераВремени);
	
	Если ПараметрыРезультата.Статус = "Ошибка" Тогда
		// Ничего не делать или обработать ошибку.
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("en='Error during execution of %1';ru='Ошибка при выполнении: %1'"), 
		ПараметрыРезультата.КраткоеПредставлениеОшибки));
	Иначе
		ЕстьНеобработанныеВизы = ПолучитьИзВременногоХранилища(ПараметрыРезультата.АдресРезультата);
		Если ЕстьНеобработанныеВизы = Истина Тогда
			ОткрытьФорму("Обработка.бит_КонсольОперативногоВизирования.Форма",,, "бит_КонсольОперативногоВизирования");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура открывает обработку со списком задач текущего пользователя.
//
Процедура УведомитьОЗадачах() Экспорт
	
	Если бит_ОбщегоНазначенияВызовСервера.ЕстьАктивныеЗадачи() Тогда
		ОткрытьФорму("Обработка.бит_МоиЗадачи.Форма");
	КонецЕсли;
	
КонецПроцедуры

// Прцедура выбора периода.
//
// Параметры:
//  ПараметрыПередачи	 - Структура	 - данные для формирования периода.
//
Процедура ВыбратьПериод(ПараметрыПередачи) Экспорт
	
	// ПараметрыПередачи:
	//	ДатаНачала, ДатаОкончания, Контекст.		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект, ПараметрыПередачи);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод(ПараметрыПередачи.ДатаНачала, ПараметрыПередачи.ДатаОкончания);
	Диалог.Показать(ОписаниеОповещения); 
	
КонецПроцедуры

// Завершение немодального вызова "ВыбратьПериод".
//
// Параметры:
//  Результат			 - СтандартныйПериод
//  ПараметрыПередачи	 - Структура.
//
Процедура ВыбратьПериодЗавершение(Результат, ПараметрыПередачи) Экспорт 

	ПараметрыПередачи.Вставить("Результат", Результат);
	Оповестить("ВыбратьПериодЗавершение", ПараметрыПередачи, ПараметрыПередачи.Контекст);

КонецПроцедуры

Процедура ОткрытьНавигационнуюСсылку(Сообщение, Действие, Дополнительно) Экспорт

	Если Сообщение.Данные = "ОткрытьНавигационнуюСсылку" Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Действие);	
	КонецЕсли; 

КонецПроцедуры

Процедура ОткрытьФормуКонстант(ТекущийЭлемент = "") Экспорт
	
	Параметры = Новый Структура("ТекущийЭлемент", ТекущийЭлемент);
	КлючУникальности = "ed8e3531-5049-44c9-834e-f6595403de5f";
	ОткрытьФорму("ОбщаяФорма.бит_Константы", Параметры,, КлючУникальности);
	
КонецПроцедуры

// Функция-конструктор структуры, моделирующей отбор.
// 
// Возвращаемое значение:
//  Структура.
// 
Функция КонструкторСтруктураОтбор() Экспорт
	
	РезСтр = Новый Структура("ПутьКДанным
	                           |, Использование
							   |, ВидСравнения
							   |, Значение
							   |, ЗначениеС
							   |, ЗначениеПо
							   |, ТипЗначения
							   |, Представление");	
	Возврат РезСтр;
	
КонецФункции

// Возвращает значение указанного свойства поля структуры.
//
// Параметры:
//	ЭлементСтруктура - КомпоновщикНастроекКомпоновкиДанных, Произвольный - Структура, в которой хранится поле.
//	Поле - Произвольный - Поле, для которого определяется значение свойства.
//	Свойство - Строка - Имя свойства, значение которого требуется получить.
//
// Возвращаемое значение:
//	Произвольный - Значение запрашиваемого свойства поля либо Неопределено.
//
Функция ПолучитьСвойствоПоля(ЭлементСтруктура, Поле, Свойство = "Заголовок") Экспорт
	
	Если ТипЗнч(ЭлементСтруктура) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Коллекция = ЭлементСтруктура.Настройки.ДоступныеПоляВыбора;
	Иначе
		Коллекция = ЭлементСтруктура;
	КонецЕсли;
	
	ПолеСтрокой = Строка(Поле);
	ПозицияКвадратнойСкобки = СтрНайти(ПолеСтрокой, "[");
	Окончание = "";
	Заголовок = "";
	Если ПозицияКвадратнойСкобки > 0 Тогда
		Окончание = Сред(ПолеСтрокой, ПозицияКвадратнойСкобки);
		ПолеСтрокой = Лев(ПолеСтрокой, ПозицияКвадратнойСкобки - 2);
	КонецЕсли;
	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолеСтрокой, ".");
	
	Если Не ПустаяСтрока(Окончание) Тогда
		МассивСтрок.Добавить(Окончание);
	КонецЕсли;
	
	ДоступныеПоля = Коллекция.Элементы;
	ПолеПоиска = "";
	Для Индекс = 0 По МассивСтрок.Количество() - 1 Цикл
		ПолеПоиска = ПолеПоиска + ?(Индекс = 0, "", ".") + МассивСтрок[Индекс];
		ДоступноеПоле = ДоступныеПоля.Найти(ПолеПоиска);
		Если ДоступноеПоле <> Неопределено Тогда
			ДоступныеПоля = ДоступноеПоле.Элементы;
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступноеПоле <> Неопределено Тогда
		Если Свойство = "ДоступноеПоле" Тогда
			Результат = ДоступноеПоле;
		Иначе
			Результат = ДоступноеПоле[Свойство]; 
		КонецЕсли;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПоказатьФормуКонстант()

	ОткрытьФорму("ОбщаяФорма.бит_Константы");	

КонецПроцедуры

Процедура ПоказатьРабочееМестоВизирования()

	ПодключитьОбработчикОжидания("бит_ОжиданиеУведомленияОбУстановкеВизПриСтарте", 5, Истина); 

КонецПроцедуры
 
Процедура ПодключитьОжиданиеУведомленияОбУстановкеВиз(Интервал)

	ПодключитьОбработчикОжидания("бит_ОжиданиеУведомленияОбУстановкеВиз", Интервал * 60); 	

КонецПроцедуры

Процедура ПоказатьДополнительнуюИнформацию()

	ОткрытьФорму("Обработка.бит_ДополнительнаяИнформация.Форма");	

КонецПроцедуры

#КонецОбласти