#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений(); 
	ДанныеВыбора.Добавить(Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ЗаСчет);
	ДанныеВыбора.Добавить(Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.Изменение);
	
	Если Параметры.Свойство("ВидКонтроля") Тогда
		Если Параметры.ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Заявки Тогда
			ДанныеВыбора.Добавить(Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ВозвратЛимита);
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли