
Функция ЦФОПользователя(Знач Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();	
	КонецЕсли;
	ЦФО = Справочники.Подразделения.ПустаяСсылка();
	Если ЗначениеЗаполнено(Пользователь.Подразделение) Тогда 
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	бит_СоответствияАналитикСрезПоследних.ПраваяАналитика_1 КАК ЦФО
		                      |ИЗ
		                      |	РегистрСведений.бит_СоответствияАналитик.СрезПоследних(
		                      |			,
		                      |			Используется
		                      |				И ВидСоответствия = ЗНАЧЕНИЕ(Справочник.бит_ВидыСоответствийАналитик.СтруктураПредприятия_ЦФО)
		                      |				И ЛеваяАналитика_1 = &ПодразделениеПользователя) КАК бит_СоответствияАналитикСрезПоследних");
		Запрос.УстановитьПараметр("ПодразделениеПользователя", Пользователь.Подразделение);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ЦФО = Выборка.ЦФО;
		КонецЕсли;
	КонецЕсли;
	Возврат ЦФО;
	
КонецФункции

// быстрая вставка Таблица2 в Таблица1
//
Процедура ДополнитьТаблицуЗначениямиИзВторой(ТаблицаПриемник, ТаблицаИсточник) Экспорт 

	КоличествоСтрок = ТаблицаИсточник.Количество();
	
	Для Индекс = 1 По КоличествоСтрок Цикл 
		ТаблицаПриемник.Вставить(0); 
	КонецЦикла; 
	
	КоличествоКолонок = ТаблицаИсточник.Колонки.Количество() - 1;
	Для Индекс = 0 По КоличествоКолонок  Цикл 
		ТаблицаПриемник.ЗагрузитьКолонку(ТаблицаИсточник.ВыгрузитьКолонку(Индекс), Индекс); 
	КонецЦикла; 

КонецПроцедуры

Функция ВернутьТекстЗапросаПоКоллекцииКолонок(КоллекцияКолонок = Неопределено, СписокПолей = "", ИмяВременнойТаблицы, Разделитель = ",") Экспорт
	
	Если КоллекцияКолонок = Неопределено и СписокПолей = "" Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстВыбора = "";
	Если СписокПолей = "" Тогда
    	Для Каждого Колонка Из КоллекцияКолонок Цикл
			ТекстВыбора = ТекстВыбора + " ВТ." + Колонка.Имя + " КАК " + Колонка.Имя + ",";
		КонецЦикла;
	Иначе
		мКолонок = СтрРазделить(СписокПолей, Разделитель, Ложь);
		Для каждого КолонкаИмя Из мКолонок Цикл
			ТекстВыбора = ТекстВыбора + " ВТ." + КолонкаИмя + " КАК " + Колонка.Имя + ",";
		КонецЦикла;
	КонецЕсли;
    СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекстВыбора);	
	
    ТекстЗапроса =
        "ВЫБРАТЬ" + Символы.ПС +
        ТекстВыбора + Символы.ПС +
        "ПОМЕСТИТЬ " + ИмяВременнойТаблицы + Символы.ПС +
        "ИЗ" + Символы.ПС +
        "    &ИмяВременнойТаблицы КАК ВТ";

    Возврат ТекстЗапроса;

КонецФункции