#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция инициализирует компоновщик для получения записей 
// регистра сведений бит_фн_Оповещения для последующей обработки.
// 
// Параметры:
//  Компоновщик              - КомпоновщикНастроекСхемыКомпоновкиДанных.
//  УникальныйИдентификатор  - УникальныйИдентификатор.
// 
// Возвращаемое значение:
//   АдресСхемыКомпоновкиДанных   - Строка.
// 
Функция ИнициализироватьКомпоновщик(Компоновщик,УникальныйИдентификатор) Экспорт

	СхемаКомпоновкиДанных = Обработки.бит_ОбработкаЗаписейРегистраОповещений.ПолучитьМакет("СхемаКомпоновкиДанных");
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
    Компоновщик.Инициализировать(ИсточникНастроек);
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

	Возврат АдресСхемыКомпоновкиДанных;
	
КонецФункции // ИнициализироватьКомпоновщик()

// Процедура устанавливает отбор компоновщика по статусу в зависимости от вида операции.
// 
// Параметры:                                                  
//  Компоновщик  - КомпоновщикНастроекКомпоновкиДанных.
//  ВидОперации  - ПеречислениеСсылка.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.
// 
Процедура УстановитьОтборыКомпоновщика(Компоновщик,ВидОперации) Экспорт

    Для каждого ЭлементОтбора Из Компоновщик.Настройки.Отбор.Элементы Цикл
	
		Если Строка(ЭлементОтбора.ЛевоеЗначение) = "Статус" Тогда
			
			// Установим отбор по статусу в зависимости от вида операции.
			ЭлементОтбора.Использование = Истина;
			Если ВидОперации = Перечисления.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.ОтправитьОповещения Тогда
				
				ЭлементОтбора.ПравоеЗначение   = Перечисления.бит_фн_СтатусыОтправкиОповещений.ГотовоКОтправке;
				ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				
			ИначеЕсли ВидОперации = Перечисления.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.Удалить Тогда
				
				ЭлементОтбора.ПравоеЗначение   = Перечисления.бит_фн_СтатусыОтправкиОповещений.Отправлено;
				ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
				
			ИначеЕсли ВидОперации = Перечисления.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.ИзменитьСтатус Тогда	 
				
				ЭлементОтбора.ПравоеЗначение   = Перечисления.бит_фн_СтатусыОтправкиОповещений.ОшибкаОтправки;
				ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
				
			КонецЕсли; 
			
			// Синхронизируем элемент пользовательских настроек с настройкой отбора.
			ЭлементПН = бит_ОбщегоНазначения.НайтиЭлементПользовательскойНастройки(ЭлементОтбора.ИдентификаторПользовательскойНастройки
			                                                                                   ,Компоновщик);
			Если ЭлементПН <> Неопределено Тогда
				
				ЭлементПН.ПравоеЗначение = ЭлементОтбора.ПравоеЗначение;
				ЭлементПН.Использование  = ЭлементОтбора.Использование;
				ЭлементПН.РежимОтображения = ЭлементОтбора.РежимОтображения;
				
			КонецЕсли; 
			 
		КонецЕсли; // Отбор по статусу
	
	КонецЦикла; // По элементам отбора
	

КонецПроцедуры // УстановитьОтборыКомпоновщика()

// Функция выполняет запрос по настройке компновщика.
// 
// Параметры:
//  Компоновщик  - КомпоновщикНастроекКомпоновкиДанных.
//  АдресСхемыКомпоновкиДанных  - Строка.
//  ВидОперации  - ПеречислениеСсылка.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.
// 
// Возвращаемое значение:
//   Результат   - РезультатЗапроса.
// 
Функция ВыполнитьЗапросПоНастройке(Компоновщик,АдресСхемыКомпоновкиДанных,ВидОперации)  Экспорт

	 СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);

	// Выполняем компановку макета МакетСКД
	// (настройки берутся из схемы компановки данных и из пользовательских настроек).
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетСКД = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Компоновщик.ПолучитьНастройки());
	
	// Получаем запрос макета компановки данных
	Запрос = Новый Запрос(МакетСКД.НаборыДанных.Оповещения.Запрос);
	
	Если ВидОперации = Перечисления.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.ОтправитьОповещения Тогда
		
		// Для целей оптимизации необходима группировка по НастройкамДоставки.
		Запрос.Текст = Запрос.Текст +"
		        |ИТОГИ ПО
                |	НастройкаДоставки";
	
	КонецЕсли; 
	
	// Устанавливаем параметры запроса
	ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
	Для каждого ОписаниеПараметраЗапроса Из ОписаниеПараметровЗапроса Цикл
		Запрос.УстановитьПараметр(ОписаниеПараметраЗапроса.Имя, МакетСКД.ЗначенияПараметров[ОписаниеПараметраЗапроса.Имя].Значение);
	КонецЦикла;

	Результат = Запрос.Выполнить();

	Возврат Результат;
	
КонецФункции // ВыполнитьЗапросПоНастройке()

// Процедура отправляет оповещения.
// 
// Параметры:
//  Результат      - РезультатЗапроса.
//  РежимСообщений - Строка.
// 
Процедура ОтправитьОповещения(Результат = Неопределено,РежимСообщений = "Нет")  Экспорт
	
	 РежимыВывода = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);	
		
	 Если Результат = Неопределено Тогда		 
		 Результат = ПолучитьДанныеДляОбработки(Перечисления.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.ОтправитьОповещения);
	 КонецЕсли; 	
	 
	 ВыборкаНастройкаДоставки = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	 ВложенияШаблонов = Новый Соответствие();
	 Пока ВыборкаНастройкаДоставки.Следующий() Цикл
		 
		// Получим обработку доставки и настройки доставки.
		ОбработкаДоставки = бит_ОповещенияСервер.ПолучитьОбработкуДоставки(ВыборкаНастройкаДоставки.ОбработкаДоставки); 
		НастройкиДоставки = бит_ОповещенияСервер.НастройкиДоставки(ВыборкаНастройкаДоставки.НастройкаДоставки.НастройкиДоставки);
		
		Если ОбработкаДоставки <> Неопределено Тогда
			
			Выборка = ВыборкаНастройкаДоставки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка.Следующий() Цикл
				
				ТекстСообщения = НСтр("ru='Выполняется отправка сообщения %1 по адресу %2.';en='The message is sent %1 to %2.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.ИД, Выборка.АдресПолучателя);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				// Подготовим структуру сообщений и структуру параметров для отправки.
				СтруктураСообщения = Новый Структура;
				СтруктураСообщения.Вставить("Заголовок",				Выборка.Сообщение_Заголовок);
				СтруктураСообщения.Вставить("Текст",					Выборка.Сообщение_Текст);
				СтруктураСообщения.Вставить("Подпись",					Выборка.Сообщение_Подпись);
				СтруктураСообщения.Вставить("Бейджи",					Выборка.Бейджи);
				СтруктураСообщения.Вставить("ТипТекстаСообщения",		Выборка.ТипТекстаСообщения);
				СтруктураСообщения.Вставить("СсылкиВТекстеСообщения",	Выборка.СсылкиВТекстеСообщения);
				СтруктураСообщения.Вставить("Оповещение",				Выборка.Оповещение);
				СтруктураСообщения.Вставить("ВложенияШаблона",			Неопределено);
				Если СтрСравнить(Выборка.ТипТекстаСообщения, "HTML") = 0
					И ЗначениеЗаполнено(Выборка.ШаблонСообщения) Тогда
					ВложенияШаблона = ВложенияШаблонов[Выборка.ШаблонСообщения];
					Если ВложенияШаблона = Неопределено Тогда
						ВложенияШаблона = Справочники.бит_фн_ШаблоныСообщений.ВложенияШаблонаСообщений(Выборка.ШаблонСообщения);
						ВложенияШаблонов.Вставить(Выборка.ШаблонСообщения, ВложенияШаблона);
					КонецЕсли;
					СтруктураСообщения.Вставить("ВложенияШаблона", ВложенияШаблона);
				КонецЕсли;
				
				СтруктураПараметров = Новый Структура("АдресПолучателя",Выборка.АдресПолучателя);
				
				ПротоколОтправки    = "";
				флДействиеВыполнено = ОбработкаДоставки.ОтправитьСообщение(СтруктураСообщения
				                                                           ,НастройкиДоставки
																		   ,СтруктураПараметров
																		   ,ПротоколОтправки);
				
				// Зарегистрируем результаты отправки сообщения.
				МенеджерЗаписи = РегистрыСведений.бит_фн_Оповещения.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
				
				Попытка			
					МенеджерЗаписи.Удалить();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
					Если флДействиеВыполнено Тогда
					     МенеджерЗаписи.Статус = Перечисления.бит_фн_СтатусыОтправкиОповещений.Отправлено;
					Иначе	
					     МенеджерЗаписи.Статус = Перечисления.бит_фн_СтатусыОтправкиОповещений.ОшибкаОтправки;
					КонецЕсли; 
					МенеджерЗаписи.ПротоколОтправки = ПротоколОтправки; 
					МенеджерЗаписи.ДатаОтправки     = ТекущаяДатаСеанса();
					МенеджерЗаписи.Записать();				
				Исключение				
					Если РежимыВывода.ВыводитьОшибки Тогда					
						ТекстСообщения = НСтр("ru='Не удалось изменить статус оповещения с Идентификатором ""%1"".';
											  |en='Unable to change the alert status with ID ""%1"".'");
						ТекстСообщения = СтрШаблон(ТекстСообщения,МенеджерЗаписи.ИД);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);					
					КонецЕсли;				
				КонецПопытки;
					
			КонецЦикла; // По детальным записям
			
		КонецЕсли; // Удалось получить обработку отправки
	 	 
	 КонецЦикла; // По настройкам доставки

	 Если РежимыВывода.ВыводитьИнформацию Тогда		 
		 ТекстСообщения = НСтр("ru='Отправка оповещений завершена.';en='Sending notifications completed.'");
		 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		 
	 КонецЕсли; 
 
КонецПроцедуры // ОтправитьОповещения()

// Процедура выполняет удаление оповещений из регистра сведений бит_фн_Оповщения.
// 
// Параметры:
//  РезультатЗапроса  - РезультатЗапроса.
//  РежимСообщений    - Строка.
// 
Процедура УдалитьОповещения(РезультатЗапроса = Неопределено,РежимСообщений = "Нет") Экспорт
	
	РежимыВывода = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);
	
	Если РезультатЗапроса = Неопределено Тогда		
		РезультатЗапроса = ПолучитьДанныеДляОбработки(Перечисления.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.Удалить);		
	КонецЕсли; 	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Ном = 1;
	КоличествоЗаписей = Выборка.Количество();
	Пока Выборка.Следующий() Цикл
	
		МенеджерЗаписи = РегистрыСведений.бит_фн_Оповещения.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
		
		Попытка			
			МенеджерЗаписи.Удалить();		
		Исключение			
			Если РежимыВывода.ВыводитьОшибки Тогда			
				ТекстСообщения = НСтр("ru='Не удалось удалить запись об оповещении с Идентификатором ""%1"".';
									  |en='Failed to delete a record of the notification with the ID ""%1"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения,МенеджерЗаписи.ИД);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);				
			КонецЕсли;			
		КонецПопытки; 
		
		Ном = Ном+1;
		Если Ном%10 = 0 Тогда			
			 ТекстСостояния = НСтр("ru='Удаление оповещений %1 из %2';en='Remove notifications %1 from %2'");
			 ТекстСостояния = СтрШаблон(ТекстСостояния, Строка(Ном), Строка(КоличествоЗаписей));
			 ОбщегоНазначения.СообщитьПользователю(ТекстСостояния);			 
		КонецЕсли; 
	КонецЦикла; // По выборке
	
	Если РежимыВывода.ВыводитьИнформацию Тогда		
		ТекстСообщения = НСтр("ru='Удаление оповещений завершено.';en='Notifications successfully removed'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли; 
	
КонецПроцедуры // УдалитьОповещения()

// Процедура выполняет изменение статусов оповещений в регистре бит_фн_Оповещения.
// 
// Параметры:
//  РезультатЗапроса  - РезультатЗапроса.
//  НовыйСтатус       - ПеречислениеСсылка.бит_фн_СтатусыОтправкиОповещений.
//  РежимСообщения    - Строка.
// 
Процедура ИзменитьСтатусОповещений(РезультатЗапроса, НовыйСтатус, РежимСообщений = "Нет") Экспорт
	
	РежимыВывода = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);	
	
	Если РезультатЗапроса = Неопределено Тогда
		
		РезультатЗапроса = ПолучитьДанныеДляОбработки(Перечисления.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.ИзменитьСтатус);
		
	КонецЕсли; 	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Ном = 1;
	КоличествоЗаписей = Выборка.Количество();
	Пока Выборка.Следующий() Цикл
	
		МенеджерЗаписи = РегистрыСведений.бит_фн_Оповещения.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		
		Попытка			
			МенеджерЗаписи.Удалить();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.Статус = НовыйСтатус;
			МенеджерЗаписи.Записать();			
		Исключение			
			Если РежимыВывода.ВыводитьОшибки Тогда			
				ТекстСообщения = НСтр("ru='Не удалось изменить статус оповещения с Идентификатором ""%1"".';
									  |en='Unable to change the alert status with ID ""%1"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, МенеджерЗаписи.ИД);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);				
			КонецЕсли; 			
		КонецПопытки; 
		
		Ном = Ном+1;
		Если Ном%10 = 0 Тогда			
			 ТекстСостояния = НСтр("ru='Изменение статусов оповещений %1 из %2';en='Change of notification status %1 from %2'");
			 ТекстСостояния = СтрШаблон(ТекстСостояния, Строка(Ном), Строка(КоличествоЗаписей));
			 ОбщегоНазначения.СообщитьПользователю(ТекстСостояния);			 
		КонецЕсли; 
	КонецЦикла; // По выборке
	
	Если РежимыВывода.ВыводитьИнформацию Тогда		
		ТекстСообщения = НСтр("ru='Изменение статусов оповещений завершено.';en='Change of notification status completed.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли; 	
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получает записи регистра бит_фн_Оповещения для дальнейшей обработки. 
// Используется при программном вызове действий с записями регистра.
// 
// Параметры:
//  ВидОперации  - ПеречислениеСсылка.бит_фн_ВидыОперацийОбработкиЗаписейРегистраОповещений.
// 
// Возвращаемое значение:
//   Результат   - РезультатЗапроса.
// 
Функция ПолучитьДанныеДляОбработки(ВидОперации)

 	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	АдресСКД  = ИнициализироватьКомпоновщик(Компоновщик,Новый УникальныйИдентификатор);
	УстановитьОтборыКомпоновщика(Компоновщик,ВидОперации);
	Результат = ВыполнитьЗапросПоНастройке(Компоновщик,АдресСКД,ВидОперации);
    УдалитьИзВременногоХранилища(АдресСКД);
	
	Возврат Результат;
	
КонецФункции // ПолучитьДанныеДляОбработки()

#КонецОбласти

#КонецЕсли
