Процедура бит_ПересчитатьЦенуСоСкидкой(ТекущаяСтрока, СтруктураДействий) Экспорт 
	
	//БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024 +
		
	Если СтруктураДействий.Свойство("бит_ПересчитатьЦенуСоСкидкой") Тогда
		
		Если ТекущаяСтрока.ПроцентРучнойСкидки = 0 Тогда 
			ТекущаяСтрока.бит_ЦенаСоСкидкой = ТекущаяСтрока.Цена;
		Иначе			
			ТекущаяСтрока.бит_ЦенаСоСкидкой = Окр(ТекущаяСтрока.Цена - ТекущаяСтрока.Цена * ТекущаяСтрока.ПроцентРучнойСкидки / 100, 2);
		КонецЕсли;
		
	КонецЕсли;	
	//БИТ ЛТ3.3 KAKravchenko@cbit.ru 05.12.2024 -

КонецПроцедуры
