
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		УстановитьСостояниеДокумента();
	КонецЕсли; 
	
	ТекущийВидКонтроля = Объект.ВидКонтроля;
		
	УправлениеФормой(ЭтотОбъект);
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_ЗакрытиеКонтрольныхЗначений";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидКонтроляПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидКонтроля) Тогда
		Объект.ВидКонтроля = ТекущийВидКонтроля
	КонецЕсли; 
	
	// Если операция не поменялась, то выходим.
	Если ТекущийВидКонтроля = Объект.ВидКонтроля Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийВидКонтроля = Объект.ВидКонтроля;

	ИзменениеВидаОперации();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменениеВидаОперации()
	
	Если Объект.ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.Заявки
		ИЛИ Объект.ВидКонтроля = Перечисления.бит_РежимыКонтроляПоБюджету.ГрафикиДоговоров Тогда
	
		Объект.СценарийКонтролируемый = Справочники[бит_ОбщегоНазначения.ПолучитьИмяСправочникаСценарииБюджетирования()].ПустаяСсылка();
	КонецЕсли; 
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоКонтрольБюджета = Объект.ВидКонтроля = ПредопределенноеЗначение("Перечисление.бит_РежимыКонтроляПоБюджету.Бюджет");
	ЭтоКонтрольЗаявок  = Объект.ВидКонтроля = ПредопределенноеЗначение("Перечисление.бит_РежимыКонтроляПоБюджету.Заявки");
	
	Элементы.СценарийКонтролируемый.Видимость = ЭтоКонтрольБюджета;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

#КонецОбласти