
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция проверяет включение заявки в реестр платежей.
//
// Параметры:
//  Заявка - ДокументСсылка.бит_ЗаявкаНаРасходованиеСредств.
// 
// Возвращаемое значение:
//  Булево.
//
Функция ЗаявкаВключенаВРеестр(Заявка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеестрыПлатежей.Заявка КАК Заявка
	|ИЗ
	|	РегистрСведений.бит_РеестрыПлатежей КАК РеестрыПлатежей
	|ГДЕ
	|	РеестрыПлатежей.Заявка = &Заявка
	|	И РеестрыПлатежей.Активность";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// Функция проверяет включение платежной позиции в реестр платежей.
//
// Параметры:
//  ПлатежнаяПозиция - ДокументСсылка.бит_ПлатежнаяПозиция.
// 
// Возвращаемое значение:
//  Булево.
//
Функция ПозицияВключенаВРеестр(ПлатежнаяПозиция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РеестрыПлатежей.ПлатежнаяПозиция КАК ПлатежнаяПозиция
	|ИЗ
	|	РегистрСведений.бит_РеестрыПлатежей КАК РеестрыПлатежей
	|ГДЕ          	
	|	РеестрыПлатежей.ПлатежнаяПозиция = &ПлатежнаяПозиция
	|	И РеестрыПлатежей.Активность";
	Запрос.УстановитьПараметр("ПлатежнаяПозиция", ПлатежнаяПозиция);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли