
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [07.12.2025 20:29:45] +        
	Команда = ЭтаФорма.Команды.Добавить("бит_УстановитьРасценки");
	Команда.Действие = "бит_УстановитьРасценки";
	Команда.Заголовок = "(бит) Установить расценки";
	Команда.Подсказка = "(бит) Установить расценки";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_УстановитьРасценки", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "бит_УстановитьРасценки";
	//НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	//НовыйЭлемент.Картинка = БиблиотекаКартинок.АктивироватьЗадачу;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [07.12.2025 20:29:45] -
КонецПроцедуры 


&НаКлиенте
Процедура бит_УстановитьРасценки(Команда)
// {{ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [07.12.2025 21:01:23] +        
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВводаПараметровРасценки", ЭтотОбъект); 
	ОткрытьФорму("Обработка.бит_АРМНормирования.Форма.ФормаЗапросПараметровРасценки", , ЭтотОбъект, УникальныйИдентификатор, , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
// }}ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [07.12.2025 21:01:23] -
КонецПроцедуры                                                                  

&НаКлиенте
Процедура ПослеВводаПараметровРасценки(РезультатЗакрытия, ДопПараметры) Экспорт
// {{ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [07.12.2025 21:02:03] +        
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;                                        
	ПолеОтбора = Новый ПолеКомпоновкиДанных("ВидРабот");
	ВидРабот = Неопределено;
	Для каждого стр Из ЭтаФорма.Список.Отбор.Элементы Цикл
		Если стр.ЛевоеЗначение = ПолеОтбора Тогда
			ВидРабот = стр.ПравоеЗначение;
			Прервать;		
		КонецЕсли;
	КонецЦикла;
	Если ВидРабот <> Неопределено Тогда 
		ЗаписатьРасценку(РезультатЗакрытия, ВидРабот);
	КонецЕсли;
	Элементы.Список.Обновить();
	// }}ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [07.12.2025 21:02:03] -	
КонецПроцедуры       

&НаСервере
Процедура ЗаписатьРасценку(Знач РезультатЗакрытия, Знач ТекВидРабот)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [07.12.2025 21:02:31] +        
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РазрядыКатегорииДолжностей.Ссылка КАК КвалификационныйРазряд,
	                      |	&ВидРабот КАК ВидРабот,
	                      |	&Расценка КАК Расценка,
	                      |	&Период КАК Период
	                      |ИЗ
	                      |	Справочник.РазрядыКатегорииДолжностей КАК РазрядыКатегорииДолжностей
	                      |ГДЕ
	                      |	НЕ РазрядыКатегорииДолжностей.ПометкаУдаления
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка),
	                      |	&ВидРабот,
	                      |	&Расценка,
	                      |	&Период
	                      |ИЗ
	                      |	Справочник.РазрядыКатегорииДолжностей КАК РазрядыКатегорииДолжностей
	                      |ГДЕ
	                      |	НЕ РазрядыКатегорииДолжностей.ПометкаУдаления");
	Запрос.УстановитьПараметр("ВидРабот", ТекВидРабот);
	Запрос.УстановитьПараметр("Расценка", РезультатЗакрытия.Цена);
	Запрос.УстановитьПараметр("Период", РезультатЗакрытия.Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МЗ = РегистрыСведений.РасценкиРаботСотрудников.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
		МЗ.Записать();
	КонецЦикла;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [07.12.2025 21:02:31] -
КонецПроцедуры

