
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	ИзменитьДоступностьПриИзмененииНастроек(ЭтотОбъект, Ложь);
	
	КэшЗначений = Новый Структура;
	КэшЗначений.Вставить("ТекущийПользователь",	Пользователи.ТекущийПользователь());
	КэшЗначений.Вставить("НастраиваемыйОбъект",	Метаданные.Обработки.бит_РабочееМестоКазначея.ПолноеИмя());
	КэшЗначений.Вставить("ТипНастройки",		Перечисления.бит_ТипыСохраненныхНастроек.Обработки);
	КэшЗначений.Вставить("ИзмеренияДоп",		бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним"));
	КэшЗначений.Вставить("НастройкиИзмерений",	бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	
	// Настроим отображение полей доп. аналитик в дереве Дерево счета.
	бит_МеханизмДопИзмерений.ОтобразитьДополнительныеИзмеренияВТабличномПоле_Управляемая(
		ЭтотОбъект, "ДеревоСчета", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
	
	// Настроим отображение полей доп. аналитик в дереве ТекДокументТаблица.
	бит_МеханизмДопИзмерений.ОтобразитьДополнительныеИзмеренияВТабличномПоле_Управляемая(
		ЭтотОбъект, "ТекДокументТаблица", КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
																							
	ИмяСкдДляМассиваСчетов 	   = "СхемаКомпоновкиДанных";
	АдресСхемыКомпоновкиДанных = ИнициализироватьКомпоновщик(Объект.Компоновщик,ИмяСкдДляМассиваСчетов,
											УникальныйИдентификатор);
	
	ЗаполнитьФормуПоУмолчанию();
	ТекущийДень = НачалоДня(ТекущаяДатаСеанса());

	// Применим настройку по-умолчанию, если таковая есть.
	ТекущаяНастройка = ПолучитьНастройкиПриСозданииНаСервере();	
	ПрименитьНастройки(ТекущаяНастройка);
	
	МаксУровеньДеревоСчета = 7;
	// АПК:1297-выкл Строковый параметр.
	НастройкиПанелей = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователя",
								"Настройки панелей РМК", НастройкиПанелейПоУмолчанию(ЭтотОбъект));
	// АПК:1297-выкл
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,  НастройкиПанелей);	
	
	Элементы.ГруппаТекущийДокумент.Высота = Объект.ВысотаПанелиТекущийДокумент;
	УстановитьЗаголовокФормы(ЭтотОбъект);
		
	ИспользоватьПрогнозы = ПолучитьФункциональнуюОпцию("бит_кзн_ИспользоватьПрогнозыПлатежейИПоступлений");
	Если НЕ ИспользоватьПрогнозы Тогда
		Объект.ВыводитьПрогнозыПлатежей = Ложь;	
	КонецЕсли;

	УправлениеФормой(ЭтотОбъект);
	ВидимостьДанныхПоВыделеннымДокументам(ЭтотОбъект);
	УстановитьВидимостьДекорацияПерейтиКСформированнымДокументам(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
	// АПК:1297-выкл Строковый параметр.
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиПользователя",
			"Настройки панелей РМК", НастройкиПанелейПоУмолчанию(ЭтотОбъект));
	// АПК:1297-вкл
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	ИзменитьДоступностьПриИзмененииНастроек(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	ИзменитьДоступностьПриИзмененииНастроек(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОперативныйДеньПриИзменении(Элемент)
		
	ЭлементСписка = КолонкиПериодов.НайтиПоЗначению(Объект.ОперативныйДень);
	Если ЭлементСписка <> Неопределено Тогда
		УпралениеВидимостьюКолонкиПериода("ДеревоСчета" + ЭлементСписка.Представление, Истина, ЭтотОбъект);
	КонецЕсли; 
	УстановитьУсловниеОформлениеПериодов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоСчета
 
&НаКлиенте
Процедура ДеревоСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	 ТекущаяСтрока = ДеревоСчета.НайтиПоИдентификатору(ВыбраннаяСтрока);
	 Если НЕ ТекущаяСтрока = Неопределено Тогда
		Если ТекущаяСтрока.ИмяГруппировки = "Организация" Тогда
	 	    ПоказатьЗначение(,ТекущаяСтрока.Измерение);
		ИначеЕсли ТекущаяСтрока.ИмяГруппировки = "БанковскийСчет" Тогда
			ПоказатьЗначение(,ТекущаяСтрока.Измерение);
		ИначеЕсли ТекущаяСтрока.ИмяГруппировки = "ДокументПланирования" Тогда
			Если Поле.Имя = "ДеревоСчетаПлатежнаяПозиция" Тогда
				ПоказатьЗначение(,ТекущаяСтрока.ПлатежнаяПозиция);
			Иначе	
				ПоказатьЗначение(,ТекущаяСтрока.Измерение);
			КонецЕсли; 
		КонецЕсли;  
	 КонецЕсли; 

КонецПроцедуры
 
&НаКлиенте
Процедура ДеревоСчетаВыполнятьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСчета.ТекущиеДанные;
	
	Если ТекущаяСтрока.Выполнять = 2 Тогда
	    ТекущаяСтрока.Выполнять = 0
	КонецЕсли;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		Если ТекущаяСтрока.Выполнять > 0 Тогда
			КодДействия = 1;
		Иначе	
			КодДействия = 0;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ПлатежнаяПозиция) Тогда
			ПересчитатьЗначенияВыделенныхДокументов(ТекущаяСтрока.Выполнять, ТекущаяСтрока.Сумма, ТекущаяСтрока.ПлатежнаяПозиция);
		КонецЕсли; 
		
		ИзменитьФлажки(ТекущаяСтрока,КодДействия);
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ДеревоСчетаПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчик = Ложь;
	
	ТекущаяСтрока = Элементы.ДеревоСчета.ТекущиеДанные;
	
	// Необходимо вывести информацию в панель документа.
	Если ПанельТекущийДокументВидимость 
		 И НЕ ТекущаяСтрока = Неопределено 
		 И ТекущаяСтрока.ИмяГруппировки = "ДокументПланирования" Тогда
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ПлатежнаяПозиция) Тогда
			ТекущийДокумент = ТекущаяСтрока.ПлатежнаяПозиция;
		Иначе	
			ТекущийДокумент = ТекущаяСтрока.ДокументПланирования;
		КонецЕсли; 
		
		ПодключитьОбработчик = Истина;
	КонецЕсли; 
	
	// Необходимо вывести информацию в аналитическую панель.
	Если НЕ ТекущаяСтрока = Неопределено 
		 И ПанельАналитическаяВидимость Тогда
	     
		 ТекущиеПараметры = Новый Структура;
		 ТекущиеПараметры.Вставить("БанковскийСчет",		ТекущаяСтрока.БанковскийСчет);
		 ТекущиеПараметры.Вставить("ВалютаДенежныхСредств",	ТекущаяСтрока.ВалютаДенежныхСредств);
		 ТекущиеПараметры.Вставить("ИмяГруппировки",		ТекущаяСтрока.ИмяГруппировки);
		 
		 ПодключитьОбработчик = Истина; 
	КонецЕсли; 
	
	Если ПодключитьОбработчик Тогда
		// Используем обработчик ожидания, т.к. вызовы сервера в данном обработчике приводят к зацикливанию.
		ОтключитьОбработчикОжидания("ОжиданиеАктивазацииСтроки");
		ПодключитьОбработчикОжидания("ОжиданиеАктивазацииСтроки",0.1,Истина);
	КонецЕсли; 
	
	УправлениеВидимостьюКонтекстногоМеню();
	
 КонецПроцедуры

&НаКлиенте
Процедура ДеревоСчетаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если Элементы.ДеревоСчета.ВыделенныеСтроки.Количество() > 1 Тогда
		Выполнение = Ложь;
	Иначе
		ВыделенныеСтроки = Элементы.ДеревоСчета.ВыделенныеСтроки;
		Выполнение = КомандаВСтрокеНеПоддерживается(ВыделенныеСтроки) = Ложь;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ДеревоСчетаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	Выполнение 		 	 = Ложь;
	
	ИсходнаяСтрока = ДеревоСчета.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение[0]);
	ТекущаяСтрока  = ДеревоСчета.НайтиПоИдентификатору(Строка);
	
	Если ТекущаяСтрока.ИмяГруппировки = "БанковскийСчет" И Поле.Имя = "ДеревоСчетаИзмерение" Тогда
		// Перетаскивание на другой счет возможно в рамках одной организации и валюты и пр.
		// При этом блокируем пустой счет и кассу.
		Если ТекущаяСтрока.Организация 			  = ИсходнаяСтрока.Организация 
			И ТекущаяСтрока.ВалютаДенежныхСредств = ИсходнаяСтрока.ВалютаДенежныхСредств
			И ТекущаяСтрока.ВидДенежныхСредств 	  = ИсходнаяСтрока.ВидДенежныхСредств 
			И ЗначениеЗаполнено(ТекущаяСтрока.БанковскийСчет) Тогда
			
			Выполнение = Истина;
		КонецЕсли; 
	ИначеЕсли ТекущаяСтрока.ИмяГруппировки = "ДокументПланирования" Тогда
		// Перетаскивание по периодам поддерживаем только в рамках одной строки.
		Если Строка = ПараметрыПеретаскивания.Значение[0] Тогда
			
			// Определим принадлежность колонки.
			Если СтрНачинаетсяС(Поле.Имя, "ДеревоСчетаП_") Тогда
				Для каждого ЭлементСписка Из КолонкиПериодов Цикл
					Кандидат = "ДеревоСчета" + ЭлементСписка.Представление;
					Если Кандидат = Поле.Имя Тогда
						// Перенос выполняется в интервале: Опер. день - Конец периода.
						Если ЭлементСписка.Значение >= ТекущийДень И ЭлементСписка.Значение <= Объект.КонецПериода Тогда
							
							Выполнение = Истина;
							
						КонецЕсли; 
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	Если НЕ Выполнение Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСчетаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	ИсходнаяСтрока = ДеревоСчета.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение[0]);
	ТекущаяСтрока  = ДеревоСчета.НайтиПоИдентификатору(Строка);
	
	НовыйСчет = Неопределено;
	НоваяДата = Неопределено;
	
	Если ТекущаяСтрока.ИмяГруппировки = "БанковскийСчет" И Поле.Имя = "ДеревоСчетаИзмерение" Тогда
		// Перетаскивание на другой счет.
		НовыйСчет = ТекущаяСтрока.БанковскийСчет;
		
	ИначеЕсли ТекущаяСтрока.ИмяГруппировки = "ДокументПланирования" Тогда
		Для каждого ЭлементСписка Из КолонкиПериодов Цикл
			Если Поле.Имя = "ДеревоСчета" + ЭлементСписка.Представление Тогда
				НоваяДата = ЭлементСписка.Значение;			
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;

	ПараметрыИзменения = ПараметрыИзмененияРеквизитовДокументов(ПараметрыПеретаскивания.Значение, НоваяДата, НовыйСчет);
	
	Если ПараметрыИзменения.Количество()>0 Тогда
		ВыполнитьГрупповоеИзменениеРеквизитов(ПараметрыИзменения);
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТекДокумент

&НаКлиенте
Процедура ТекДокументШапкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТекДокументШапка.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ЗначениеПараметра) Тогда
		 ПоказатьЗначение(,ТекущаяСтрока.ЗначениеПараметра);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТекДокументТаблица

&НаКлиенте
Процедура ТекДокументТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТекДокументТаблица.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ИмяРеквизита = СтрЗаменить(Поле.Имя,"ТекДокументТаблица","");
		ТекЗначение = ТекущаяСтрока[ИмяРеквизита];
		ПоказатьЗначение(,ТекЗначение);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолеТабДокументаИнформация

&НаКлиенте
Процедура ПолеТабДокументаИнформацияОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолеТабДокументаАнализ

&НаКлиенте
Процедура ПолеТабДокументаАнализОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	НачатьОтложенноеОбновлениеДереваСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДействиеДеревоСчетаУровень(Команда)
	
	КнопкиУровней = Элементы.ДеревоСчетаУровни.ПодчиненныеЭлементы;
	НомПодчерк = Найти(Команда.Имя,"_");
	Если НомПодчерк > 0 Тогда
		 НомУровняСтр = Сред(Команда.Имя,НомПодчерк+1);
		 Попытка
			 НомУровня = Число(НомУровняСтр);
		 Исключение
			 НомУровня = -1;
		 КонецПопытки; 
		 
		 Если НомУровня > 0 Тогда
		   бит_РаботаСДиалогамиКлиент.РазвернутьДоУровня(Элементы.ДеревоСчета,ДеревоСчета,НомУровня);
		   инд = 1;
		   Для каждого Кнопка Из КнопкиУровней Цикл
		   	   Кнопка.Пометка = Ложь;
			   Если инд = НомУровня Тогда
			   	  Кнопка.Пометка = Истина;
			   КонецЕсли; 
			   инд = инд+1;
		   КонецЦикла; 
		 КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьНастройки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийОбъект",Объект);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьНастройкиОкончание",ЭтотОбъект);
	ОткрытьФорму("Обработка.бит_РабочееМестоКазначея.Форма.ФормаНастройки", ПараметрыФормы,
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьНастройкиОкончание(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") И РезультатВыбора.Команда = "ОК" Тогда
		ОбработкаИзмененияНастроек(РезультатВыбора);
		ВидимостьДанныхПоВыделеннымДокументам(ЭтотОбъект);
		УстановитьЗаголовокФормы(ЭтотОбъект);
		ИзменитьДоступностьПриИзмененииНастроек(ЭтотОбъект, Истина);
	КонецЕсли; 
	
КонецПроцедуры // ОткрытьНастройкиОкончание()

&НаКлиенте
Процедура КомандаВидимостьПанелиНастроек(Команда)
	
	ПанельНастройкиВидимость = НЕ ПанельНастройкиВидимость;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВОперДень(Команда)
	
	Если Объект.ОперативныйДень < Объект.НачалоПериода ИЛИ Объект.ОперативныйДень > Объект.КонецПериода Тогда
		ВызватьИсключение НСтр("ru='Дата переноса за границами периода рабочего места казначея.';
							   |en='Date of transfer outside the workplace treasurer period.'");
	КонецЕсли; 

	Если КомандаВКолонкеНеПоддерживается() Тогда
		Возврат;
	КонецЕсли; 
	
	ВыделенныеСтроки = Элементы.ДеревоСчета.ВыделенныеСтроки;
	Если КомандаВСтрокеНеПоддерживается(ВыделенныеСтроки) ИЛИ ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыИзменения = ПараметрыИзмененияРеквизитовДокументов(ВыделенныеСтроки, Объект.ОперативныйДень);
	
	Если ПараметрыИзменения.Количество()>0 Тогда
		 ВыполнитьГрупповоеИзменениеРеквизитов(ПараметрыИзменения);	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиНаДату(Команда)
	
	Если КомандаВКолонкеНеПоддерживается() Тогда
		Возврат;
	КонецЕсли; 

	ВыделенныеСтроки = Элементы.ДеревоСчета.ВыделенныеСтроки;
	Если КомандаВСтрокеНеПоддерживается(ВыделенныеСтроки) ИЛИ ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ИмяПоля 	  = СтрЗаменить(Элементы.ДеревоСчета.ТекущийЭлемент.Имя, "ДеревоСчета","");
	ТекущийПериод = '0001-01-01';
	Для каждого Элемент Из КолонкиПериодов Цикл
		Если ИмяПоля = Элемент.Представление Тогда
			ТекущийПериод = Элемент.Значение;
		КонецЕсли; 
	КонецЦикла;
	
	Если ТекущийПериод < Объект.ОперативныйДень Тогда	
		ДатаПереноса = Объект.ОперативныйДень;
	Иначе	
		ДатаПереноса = ТекущийПериод;
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения("КомандаПеренестиНаДатуЗавершение", ЭтотОбъект, ВыделенныеСтроки); 
	ТекстПодсказки = НСтр("ru='Введите новую дату платежа';en='Enter the new date of payment'"); 
	ПоказатьВводДаты(Оповещение, ДатаПереноса, ТекстПодсказки, ЧастиДаты.Дата);
	
КонецПроцедуры

// Обработчик завершения выбора диалога ввода даты.
//  См. Синтакс-помощник: ПоказатьВводДаты().
//
&НаКлиенте 
Процедура КомандаПеренестиНаДатуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		ДатаПереноса = ДатаСоСдвигом(Результат, Объект.Периодичность);
		
		Если ДатаПереноса < ДатаСоСдвигом(ТекущийДень, Объект.Периодичность) Тогда
			ВызватьИсключение НСтр("ru='Перенос в период ранее текущего дня не поддерживается.';
								   |en='Transferring the period before the current day are not supported.'");
		КонецЕсли;
		
		Если ДатаПереноса < ДатаСоСдвигом(Объект.НачалоПериода, Объект.Периодичность)
		 ИЛИ ДатаПереноса > ДатаСоСдвигом(Объект.КонецПериода, Объект.Периодичность, Ложь) Тогда
			ВызватьИсключение НСтр("ru='Дата переноса за границами периода рабочего места казначея.';
								   |en='Date of transfer outside the workplace treasurer period.'");
		КонецЕсли; 
		
		// Коллекция колонок всегда в рамках периода. Иначе - это ошибка при программировании.
		КолонкаПериода = КолонкиПериодов.НайтиПоЗначению(ДатаПереноса);
		КолонкаПериода.Пометка = Истина;
		
		УпралениеВидимостьюКолонкиПериода("ДеревоСчета" + КолонкаПериода.Представление, КолонкаПериода.Пометка, ЭтотОбъект);

		ПараметрыИзменения = ПараметрыИзмененияРеквизитовДокументов(ДополнительныеПараметры, ДатаПереноса);
		Если ПараметрыИзменения.Количество()>0 Тогда
			ВыполнитьГрупповоеИзменениеРеквизитов(ПараметрыИзменения);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиНаБанкСчет(Команда)
	
	Если КомандаВКолонкеНеПоддерживается() Тогда
		Возврат;
	КонецЕсли; 

	ТекстСообщения = ""; 
	Отказ 		   = Ложь;
	
	Отбор = ОтборСпискаДляПереносаНаСчет(ТекстСообщения, Отказ);
	Если Отказ Тогда
		ПоказатьПредупреждение(, ТекстСообщения,, НСтр("ru='Рабочее место казначея';en='Financial Officer Workplace'"));
	Иначе
		ВыделенныеСтроки = Элементы.ДеревоСчета.ВыделенныеСтроки;
		КомандаВСтрокеНеПоддерживается = КомандаВСтрокеНеПоддерживается(ВыделенныеСтроки) ИЛИ ВыделенныеСтроки.Количество() = 0;
		Если НЕ КомандаВСтрокеНеПоддерживается Тогда
			Оповещение = Новый ОписаниеОповещения("КомандаПеренестиНаБанкСчетЗавершение", ЭтотОбъект, ВыделенныеСтроки); 

			ПараметрыПередачи = Новый Структура();
			ПараметрыПередачи.Вставить("Отбор"			   , 	 Отбор);
			ПараметрыПередачи.Вставить("ЗакрыватьПриВыборе", 	 Истина);
			ПараметрыПередачи.Вставить("МножественныйВыбор", 	 Ложь);
			
			ИмяФормыВыбора = СтрШаблон("Справочник.%1.ФормаВыбора", 
								бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ИмяСправочникаБанковскихСчетов());
			ОткрытьФорму(ИмяФормыВыбора, ПараметрыПередачи,,,,,Оповещение);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте 
Процедура КомандаПеренестиНаБанкСчетЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВыбора = Неопределено Тогда
		ПараметрыИзменения = ПараметрыИзмененияРеквизитовДокументов(ДополнительныеПараметры, , РезультатВыбора);		
		Если ПараметрыИзменения.Количество()>0 Тогда
			ВыполнитьГрупповоеИзменениеРеквизитов(ПараметрыИзменения);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьВсе(Команда)
	 
	 КоллекцияОрганизации = ДеревоСчета.ПолучитьЭлементы();
	 Для каждого ТекЭлемент Из КоллекцияОрганизации Цикл
		 ТекЭлемент.Выполнять = 1;
		 ИзменитьФлажки(ТекЭлемент,1);
	 КонецЦикла; 
	 
 КонецПроцедуры

&НаКлиенте
Процедура КомандаОтметитьТекущие(Команда)
	
	ОчиститьЗначенияВыделенныхДокументов(ЭтотОбъект);
	ОтметитьТекущие();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсе(Команда)
	 
	 КоллекцияОрганизации = ДеревоСчета.ПолучитьЭлементы();
	 Для каждого ТекЭлемент Из КоллекцияОрганизации Цикл
		 ТекЭлемент.Выполнять = 0;
		 ИзменитьФлажки(ТекЭлемент,0);
	 КонецЦикла; 
	 
 КонецПроцедуры

&НаКлиенте
Процедура КомандаИнвертироватьФлажки(Команда)
	 
	 КоллекцияОрганизации = ДеревоСчета.ПолучитьЭлементы();
	 Для каждого ТекЭлемент Из КоллекцияОрганизации Цикл
		 Если ТекЭлемент.Выполнять = 0 Тогда
			 ТекЭлемент.Выполнять = 1;
		 ИначеЕсли ТекЭлемент.Выполнять = 1 Тогда	
			 ТекЭлемент.Выполнять = 0;
		 КонецЕсли;
		 ИзменитьФлажки(ТекЭлемент,2);
	 КонецЦикла; 
	 
 КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьПлатежныеДокументы(Команда)
	 
	ВыделенныеСтроки = Новый Массив;
	КоллекцияОрганизации = ДеревоСчета.ПолучитьЭлементы();
	Для каждого ТекЭлемент Из КоллекцияОрганизации Цикл
		СформироватьМассивОплаты(ТекЭлемент, ВыделенныеСтроки, "СоздатьПлатежныеДокументы");
	КонецЦикла; 
	 
	Если ВыделенныеСтроки.Количество()>0 Тогда
		СозданоРанее = СписокДокументовДвиженияДС.Количество();
		
		СформироватьПлатежныеДокументы(ВыделенныеСтроки);
		бит_РаботаСДиалогамиКлиент.РазвернутьДоУровня(Элементы.ДеревоСчета,ДеревоСчета,
			Объект.УровеньРаскрытияСчетов);
		ПослеЗаписиДокументовОплаты(СозданоРанее, СписокДокументовДвиженияДС.Количество());
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура КомандаСоздатьРеестрыПлатежей(Команда)
	 
	СоздатьРеестрыПлатежей(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьСводныйРеестр(Команда)
	
	СоздатьРеестрыПлатежей(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПанельТекущийДокумент(Команда)
	
	ПанельТекущийДокументВидимость = НЕ ПанельТекущийДокументВидимость;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаАналитическаяПанель(Команда)
	
	ПанельАналитическаяВидимость = НЕ ПанельАналитическаяВидимость;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазбитьПлатеж(Команда)
	
	Если КомандаВКолонкеНеПоддерживается() Тогда
		Возврат;
	КонецЕсли;
	
	РазбитьИзменитьПлатеж("Разбить"); 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьПлатеж(Команда)
	
	Если КомандаВКолонкеНеПоддерживается() Тогда
		Возврат;
	КонецЕсли; 

	РазбитьИзменитьПлатеж("Изменить"); 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьПрогнозПлатежа(Команда)
	
	СоздатьПоказатьНовыйДокумент("бит_кзн_ПлатежнаяПозиция", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаявкуНаРасходованиеДС(Команда)
	
	СоздатьПоказатьНовыйДокумент("бит_кзн_ПлатежнаяПозиция", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьПланируемоеПоступлениеДС(Команда)
	
	СоздатьПоказатьНовыйДокумент("бит_кзн_ПозицияПоступления", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Объект.НачалоПериода, Объект.КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Объект, РезультатВыбора, "НачалоПериода,КонецПериода");
	
	УстановитьЗаголовокФормы(ЭтотОбъект); 
	ИзменитьДоступностьПриИзмененииНастроек(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГрупповаяОплата(Команда)
	
	МассивОплата = Новый Массив;

	КоллекцияОрганизации = ДеревоСчета.ПолучитьЭлементы();
	Для каждого ТекЭлемент Из КоллекцияОрганизации Цикл
		СформироватьМассивОплаты(ТекЭлемент, МассивОплата, "ГрупповаяОплата");
	КонецЦикла;
	
	Позиции = СформироватьСтруктуруПозиций(МассивОплата);
	Если Позиции.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Отсутствуют платежные позиции для групповой оплаты.';
							   |en='No payment position for the group payment.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Позиции",	   					Новый ФиксированныйМассив(Позиции));
	ПараметрыФормы.Вставить("ДатаОплаты",  					Объект.ОперативныйДень);
	ПараметрыФормы.Вставить("РежимЗаписиРасчетыЧерезБанк",  Объект.РежимЗаписиРасчетыЧерезБанк);
	ПараметрыФормы.Вставить("РежимЗаписиРасчетыЧерезКассу", Объект.РежимЗаписиРасчетыЧерезКассу);
	
	Оповещение = Новый ОписаниеОповещения("КомандаГрупповаяОплатаЗавершение", ЭтотОбъект); 
	ОткрытьФорму("Обработка.бит_ГрупповаяОплатаЗаявок.Форма", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГрупповаяОплатаЗавершение(Результат, Дополнительно) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) ИЛИ НЕ ЭтоАдресВременногоХранилища(Результат) Тогда
		Возврат;	
	КонецЕсли;
	
	СозданоРанее   = СписокДокументовДвиженияДС.Количество(); 			
	НовыеДокументы = КомандаГрупповаяОплатаЗавершениеНаСервере(Результат);
	
	Для каждого Элемент Из НовыеДокументы Цикл
		СписокДокументовДвиженияДС.Добавить(Элемент);		
	КонецЦикла; 	
		
	ПослеЗаписиДокументовОплаты(СозданоРанее, СписокДокументовДвиженияДС.Количество());

	НачатьОтложенноеОбновлениеДереваСчетов();
	
КонецПроцедуры

&НаСервере
Функция КомандаГрупповаяОплатаЗавершениеНаСервере(АдресВХранишище)

	Результат = ПолучитьИзВременногоХранилища(АдресВХранишище);	
	НовыеДокументы = Результат.ВыгрузитьКолонку("ДокументОплаты");
	НовыеДокументы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НовыеДокументы);
	
	Возврат НовыеДокументы;
	
КонецФункции

&НаКлиенте
Процедура КомандаСоздатьПрогнозПоступления(Команда)
	
	СоздатьПоказатьНовыйДокумент("бит_кзн_ПозицияПоступления", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаявкуНаПеремещениеДС(Команда)
	
	СоздатьПоказатьНовыйДокумент("бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	
	ПараметрыФормы     = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураНастройки" , СохраняемыеНастройки());
	ПараметрыФормы.Вставить("ТипНастройки"		 , КэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", КэшЗначений.НастраиваемыйОбъект);
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		ПараметрыФормы.Вставить("СохраненнаяНастройка",ТекущаяНастройка);
	КонецЕсли; 
	
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ТекущаяНастройка = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВосстановитьНастройки(Команда)
	
	ПараметрыФормы     = Новый Структура;
	ПараметрыФормы.Вставить("ТипНастройки"		 , КэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", КэшЗначений.НастраиваемыйОбъект);
	
	Оповещение = Новый ОписаниеОповещения("ВосстановитьНастройкиЗавершение",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте 
Процедура ВосстановитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда        
		ТекущаяНастройка = Результат;
		ПрименитьНастройки(Результат);
	КонецЕсли;	
		
	УстановитьЗаголовокФормы(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПерейтиКДокументамОплатыНажатие(Элемент)
	
	ПоказатьСформированныеДокументы(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеестрПлатежей

&НаКлиенте
Процедура СоздатьРеестрыПлатежей(СводныйРеестр)
	
	Если СводныйРеестр Тогда
		МассивОплата = Новый Массив;		
		КоллекцияОрганизации = ДеревоСчета.ПолучитьЭлементы();
		Для каждого ТекЭлемент Из КоллекцияОрганизации Цикл
			СформироватьМассивОплаты(ТекЭлемент, МассивОплата, "СформироватьСводныйРеестр");
		КонецЦикла; 
		
		Если МассивОплата.Количество() >0 Тогда
			СозданоРанее = СписокРеестры.Количество();
			СоздатьСводныйРеестр(МассивОплата);
			ПослеЗаписиДокументовОплаты(СозданоРанее, СписокРеестры.Количество());
		КонецЕсли; 
	Иначе	
		РеестрыОрганизаций = Новый Соответствие;
		КоллекцияОрганизации = ДеревоСчета.ПолучитьЭлементы();
		Для каждого ТекЭлемент Из КоллекцияОрганизации Цикл
			МассивОплата = Новый Массив;		
			СформироватьМассивОплаты(ТекЭлемент, МассивОплата, "");
			Если МассивОплата.Количество()>0 Тогда
				РеестрыОрганизаций.Вставить(ТекЭлемент.Организация,МассивОплата);
			КонецЕсли; 
		КонецЦикла; 
		
		Если РеестрыОрганизаций.Количество() > 0 Тогда
			СозданоРанее = СписокРеестры.Количество();
			
			СоздатьРеестрыПлатежейНаСервере(РеестрыОрганизаций);
			ПослеЗаписиДокументовОплаты(СозданоРанее, СписокРеестры.Количество());
		КонецЕсли; 
	КонецЕсли;	

	НачатьОтложенноеОбновлениеДереваСчетов();
	
КонецПроцедуры

 &НаСервере
Процедура СоздатьСводныйРеестр(МассивИД)

	СоздатьРеестр(Справочники.Организации.ПустаяСсылка(), МассивИД);
	 
 КонецПроцедуры // СоздатьСводныйРеестр()

 &НаСервере
Процедура СоздатьРеестр(Организация, МассивИд)
	
	ДокРеестр = Документы.бит_кзн_РеестрПлатежей.СоздатьДокумент();
	
	ДокРеестр.Организация	= Организация;
	ДокРеестр.Дата			= Объект.ОперативныйДень;
	ДокРеестр.Ответственный	= бит_УправлениеПользователямиСервер.ЗначениеПоУмолчаниюТиповой("ОсновнойОтветственный", Пользователи.ТекущийПользователь());
	ДокРеестр.УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним);
	
	МассивЗаявокНаПеремещение = Новый Массив;
	
	Для каждого Ид Из МассивИд Цикл
		ЭлементДерева = ДеревоСчета.НайтиПоИдентификатору(Ид);
		Если НЕ ЭлементДерева = Неопределено Тогда
			
			Если (ТипЗнч(ЭлементДерева.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств")
				ИЛИ ТипЗнч(ЭлементДерева.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию"))
				И МассивЗаявокНаПеремещение.Найти(ЭлементДерева.ДокументПланирования) = Неопределено Тогда
			
				ДобавитьСтрокуРеестра(ДокРеестр, ЭлементДерева, Ложь);
				
				МассивЗаявокНаПеремещение.Добавить(ЭлементДерева.ДокументПланирования);
			ИначеЕсли ТипЗнч(ЭлементДерева.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда 
				Продолжить;
			ИначеЕсли ЗначениеЗаполнено(ЭлементДерева.ПлатежнаяПозиция)
				И НЕ ТипЗнч(ЭлементДерева.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств")
				И НЕ ТипЗнч(ЭлементДерева.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию") Тогда
			
				ДобавитьСтрокуРеестра(ДокРеестр, ЭлементДерева, Истина);
			Иначе 
				Для каждого Эл Из ЭлементДерева.ПолучитьЭлементы() Цикл
					ДобавитьСтрокуРеестра(ДокРеестр, Эл, Ложь);
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	Если ДокРеестр.ТаблицаПлатежи.Количество()>0 Тогда	
		бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокРеестр,РежимЗаписиДокумента.Запись,,Объект.РежимСообщений);
		СписокРеестры.Добавить(ДокРеестр.Ссылка);
	КонецЕсли;
	
КонецПроцедуры // СоздатьРеестрПлатежей()

&НаСервере
Процедура ДобавитьСтрокуРеестра(ДокРеестр, ЭлементДерева, ОдиночнаяПозиция)

	Если ЭлементДерева.Выполнять = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ДокРеестр.ТаблицаПлатежи.Добавить();
	НоваяСтрока.Организация 			= ЭлементДерева.Организация;
	НоваяСтрока.ЗаблокироватьСтроку 	= 0;
	НоваяСтрока.ЗаявкаПлатежнаяПозиция 	= ЭлементДерева.ДокументПланирования;
	НоваяСтрока.ОдиночнаяПозиция 		= ОдиночнаяПозиция;
	НоваяСтрока.ПлатежнаяПозиция 		= ЭлементДерева.ПлатежнаяПозиция;
	НоваяСтрока.Статус 					= ЭлементДерева.СтатусПозиции;
	НоваяСтрока.ФормаОплаты 			= ЭлементДерева.ПлатежнаяПозиция.ФормаОплаты;
	НоваяСтрока.СуммаКОплате 	= ЭлементДерева.Сумма;
	СтрОплата = Документы.бит_кзн_ПлатежнаяПозиция.ПолучитьОстаток(ЭлементДерева.ПлатежнаяПозиция);
	НоваяСтрока.СуммаОстаток 	= СтрОплата.Остаток;
	НоваяСтрока.СуммаДокумента 	= ЭлементДерева.ПлатежнаяПозиция.СуммаДокумента;	
	НоваяСтрока.СуммаПлан 		= ЭлементДерева.Сумма;
	НоваяСтрока.ВалютаПлатежа 	= ЭлементДерева.ВалютаДенежныхСредств;
	НоваяСтрока.ВалютаДокумента	= ЭлементДерева.ПлатежнаяПозиция.ВалютаДокумента;
	
КонецПроцедуры // ДобавитьСтрокуРеестраПлатежей()

 &НаСервере
Процедура СоздатьРеестрыПлатежейНаСервере(РеестрыОрганизаций)
	 	 
	 Для каждого КиЗ Из РеестрыОрганизаций Цикл	 
	 	  Организация = КиЗ.Ключ;
		  МассивИд = КиЗ.Значение;		  
		  СоздатьРеестр(КиЗ.Ключ, КиЗ.Значение);		  
	 КонецЦикла; 

КонецПроцедуры
 
#КонецОбласти // РеестрПлатежей

#Область Статистика

&НаКлиенте
Процедура ПересчитатьЗначенияВыделенныхДокументов(фВыполнять, Сумма, ПлатПозиция)

	НайденноеЗнач = ВыделенныеДокументыСписокПозиций.НайтиПоЗначению(ПлатПозиция);
	Если фВыполнять
		И НайденноеЗнач <> Неопределено Тогда	
		Возврат;
	ИначеЕсли НЕ фВыполнять
		И НайденноеЗнач = Неопределено Тогда	
		Возврат;
	КонецЕсли; 
	
	Если фВыполнять Тогда
		ВыделенныеДокументыСписок.Добавить(Сумма);
	Иначе	
		элСписка = ВыделенныеДокументыСписок.НайтиПоЗначению(Сумма);
		ВыделенныеДокументыСписок.Удалить(элСписка);
	КонецЕсли; 
	
	Если фВыполнять Тогда
		ВыделенныеДокументыКоличество = ВыделенныеДокументыКоличество + 1;
		ВыделенныеДокументыСумма = ВыделенныеДокументыСумма + Сумма;
	Иначе	
		ВыделенныеДокументыКоличество = ВыделенныеДокументыКоличество - 1;
		ВыделенныеДокументыСумма = ВыделенныеДокументыСумма - Сумма;
	КонецЕсли; 

	Если ВыделенныеДокументыСписок.Количество()>0 Тогда
		ВыделенныеДокументыСписок.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		ВыделенныеДокументыМаксимум = Число(Строка(ВыделенныеДокументыСписок[0]));
		
		ВыделенныеДокументыСписок.СортироватьПоЗначению(НаправлениеСортировки.Возр);
		ВыделенныеДокументыМинимум = Число(Строка(ВыделенныеДокументыСписок[0]));
	Иначе	
		ВыделенныеДокументыМаксимум = 0;
		ВыделенныеДокументыМинимум = 0;
	КонецЕсли; 
	
	Если ВыделенныеДокументыКоличество <> 0 Тогда
		ВыделенныеДокументыСреднее = ВыделенныеДокументыСумма/ВыделенныеДокументыКоличество;
	Иначе	
		ВыделенныеДокументыСреднее = 0;
	КонецЕсли; 
	
	Если фВыполнять Тогда
		ВыделенныеДокументыСписокПозиций.Добавить(ПлатПозиция);
	Иначе	
		элСписка = ВыделенныеДокументыСписокПозиций.НайтиПоЗначению(ПлатПозиция);
		ВыделенныеДокументыСписокПозиций.Удалить(элСписка);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьЗначенияВыделенныхДокументов(Форма)
	
	Форма.ВыделенныеДокументыСумма 			= 0;
	Форма.ВыделенныеДокументыКоличество 	= 0;
	Форма.ВыделенныеДокументыМаксимум 		= 0;
	Форма.ВыделенныеДокументыМинимум 		= 0;
	Форма.ВыделенныеДокументыСреднее 		= 0;
	Форма.ВыделенныеДокументыСписок 		= Новый СписокЗначений;
	Форма.ВыделенныеДокументыСписокПозиций 	= Новый СписокЗначений;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатистику()
	
	ОчиститьЗначенияВыделенныхДокументов(ЭтотОбъект);
	ДополнитьСтатистикуВыделенныхСтрок(ДеревоСчета);
	
	ВыделенныеДокументыКоличество = ВыделенныеДокументыСписокПозиций.Количество();
	
	Если ВыделенныеДокументыКоличество > 0 Тогда
		ВыделенныеДокументыСписок.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		ВыделенныеДокументыМаксимум = ВыделенныеДокументыСписок[0];
					
		ВыделенныеДокументыСписок.СортироватьПоЗначению(НаправлениеСортировки.Возр);
		ВыделенныеДокументыМинимум  = ВыделенныеДокументыСписок[0];
					
		ВыделенныеДокументыСреднее  = ВыделенныеДокументыСумма/ВыделенныеДокументыКоличество;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьСтатистикуВыделенныхСтрок(СтрокаРодитель)
	
	КоллекцияСтрок = СтрокаРодитель.ПолучитьЭлементы();
	Для каждого СтрокаДерева Из КоллекцияСтрок Цикл
		ПлатежнаяПозиция = СтрокаДерева.ПлатежнаяПозиция;
		СуммаСтроки      = СтрокаДерева.Сумма; 
		
		Если СтрокаДерева.Выполнять И ЗначениеЗаполнено(ПлатежнаяПозиция) Тогда
			НайденноеЗнач = ВыделенныеДокументыСписокПозиций.НайтиПоЗначению(ПлатежнаяПозиция);
			Если НайденноеЗнач <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ВыделенныеДокументыСписокПозиций.Добавить(ПлатежнаяПозиция);
			ВыделенныеДокументыСписок.Добавить(СуммаСтроки);
			
			ВыделенныеДокументыСумма = ВыделенныеДокументыСумма + СуммаСтроки;
		КонецЕсли;
		ДополнитьСтатистикуВыделенныхСтрок(СтрокаДерева);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // Статистика

#Область ЗаполнениеОсновнойОбластиРМК

&НаСервере
Функция ПараметрыОбновленияДереваСчетов()

	ДанныеФормы = Обработки.бит_РабочееМестоКазначея.НовыеПараметрыИзДанныхФормы();	
	ЗаполнитьЗначенияСвойств(ДанныеФормы, ЭтотОбъект);
	
	ДанныеФормы.ДеревоСчета = РеквизитФормыВЗначение("ДеревоСчета"); 
	
	ДанныеОбъекта = Обработки.бит_РабочееМестоКазначея.НовыеПараметрыИзДанныхОбъекта();
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	
	ДанныеОбъекта.ПользовательскиеНастройки = Объект.Компоновщик.ПользовательскиеНастройки;
	ДанныеОбъекта.Счета		  				= Объект.Счета.Выгрузить();

	ПараметрыОбновления = Новый Структура;
	ПараметрыОбновления.Вставить("ДанныеФормы",   ДанныеФормы);
	ПараметрыОбновления.Вставить("ДанныеОбъекта", ДанныеОбъекта);
	
	Возврат ПараметрыОбновления;
	
КонецФункции

&НаСервере
Процедура ОбновитьДеревоСчетов()

	// Проверка возможности формирования.
	Отказ = НЕ ПериодЗаполненПравильно(ЭтотОбъект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;  
	
	// Интерфейсное решение для сохранения текущей строки списка. 
	ТекущаяПозиция = Новый Структура("Измерение, ПлатежнаяПозиция, Искать", 
						Неопределено, Неопределено, Ложь);
	ТекущаяСтрока  = Элементы.ДеревоСчета.ТекущаяСтрока;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ТекущиеДанные = ДеревоСчета.НайтиПоИдентификатору(ТекущаяСтрока);
		ЗаполнитьЗначенияСвойств(ТекущаяПозиция, ТекущиеДанные);
		ТекущаяПозиция.Искать = Истина;
	КонецЕсли; 
	
	ПараметрыОбновления = ПараметрыОбновленияДереваСчетов();
	РезультатОбновления = Обработки.бит_РабочееМестоКазначея.ОбновитьДеревоСчетов(ПараметрыОбновления.ДанныеФормы, 
								ПараметрыОбновления.ДанныеОбъекта);
	
	АдресРезультата = ПоместитьВоВременноеХранилище(РезультатОбновления, Новый УникальныйИдентификатор);
	ОбновитьДеревоСчетовЗавершениеНаСервере(АдресРезультата, ТекущаяПозиция);

КонецПроцедуры

&НаКлиенте
Процедура НачатьОтложенноеОбновлениеДереваСчетов()
	
	Отказ = НЕ ПериодЗаполненПравильно(ЭтотОбъект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	// Интерфейсное решение для сохранения текущей строки списка. 
	ТекущаяСтрока = Элементы.ДеревоСчета.ТекущаяСтрока;

	ТекущаяПозиция = Новый Структура("Измерение, ПлатежнаяПозиция, Искать", 
							Неопределено, Неопределено, Ложь);
							
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ТекущиеДанные = ДеревоСчета.НайтиПоИдентификатору(ТекущаяСтрока);
		ЗаполнитьЗначенияСвойств(ТекущаяПозиция, ТекущиеДанные);
		ТекущаяПозиция.Искать = Истина;
	КонецЕсли; 

	ДлительнаяОперация    = НачатьОтложенноеОбновлениеДереваСчетовНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОтложенноеОбновлениеДереваСчетовЗавершение", ЭтотОбъект, ТекущаяПозиция);
	ПараметрыОжидания     = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьОтложенноеОбновлениеДереваСчетовНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ВыполняемыйМетод    = "Обработки.бит_РабочееМестоКазначея.ОбновитьДеревоСчетов";
	
	ПараметрыОбновления = ПараметрыОбновленияДереваСчетов();
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
				ПараметрыОбновления.ДанныеФормы, ПараметрыОбновления.ДанныеОбъекта);
КонецФункции
			
&НаКлиенте
Процедура ОтложенноеОбновлениеДереваСчетовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении, по причине: %1'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе	
		ОбновитьДеревоСчетовЗавершениеНаСервере(Результат.АдресРезультата, ДополнительныеПараметры);
		
		ОчиститьЗначенияВыделенныхДокументов(ЭтотОбъект);
		УстановитьВидимостьДекорацияПерейтиКСформированнымДокументам(ЭтотОбъект);
		
		бит_РаботаСДиалогамиКлиент.РазвернутьДоУровня(Элементы.ДеревоСчета,ДеревоСчета,Объект.УровеньРаскрытияСчетов);
		ИзменитьДоступностьПриИзмененииНастроек(ЭтотОбъект, Ложь);
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьДеревоСчетовЗавершениеНаСервере(АдресРезультата, ТекущаяПозиция)

	ОчиститьИнформационныеПоля();
	РезультатОбновления    = ПолучитьИзВременногоХранилища(АдресРезультата);
	КолонкиПериодов		   = РезультатОбновления.КолонкиПериодов;
	МаксУровеньДеревоСчета = РезультатОбновления.МаксУровеньДеревоСчета;
	
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	// Обновим реквизиты и элементы формы.
	ОбновитьРеквизитыИЭлементыФормыДереваСчетов();
	ЗначениеВРеквизитФормы(РезультатОбновления.ДеревоСчета, "ДеревоСчета");
	
	// Создадим подменю для управления уровнями дерева.
	СоздатьДействияУровней();

	// Установим оформление.
	УстановитьУсловноеОформление();

	// Поискать строку дерева по ключу: ТекПозиция.
	Если ТекущаяПозиция.Искать Тогда
		// Осторожно: Безрекурсивный обход дерева.
		Стек = Новый Массив; 
		ТекущаяСтрока = -1;
		СтрокиДерева  = ДеревоСчета.ПолучитьЭлементы();
		Для каждого СтрокаТаблицы Из СтрокиДерева Цикл
			Если ТекущаяСтрока >= 0 Тогда
				// Установить как текущую.
				Прервать; // Нашли что-то			
			КонецЕсли;
			Стек.Добавить(СтрокаТаблицы);
			
			Пока Стек.Количество() > 0 Цикл
				
				ТекущийОбъект = Стек.Получить(Стек.ВГраница());
				Стек.Удалить(Стек.ВГраница());
				
				Если ТекущийОбъект.Измерение = ТекущаяПозиция.Измерение
					И ТекущийОбъект.ПлатежнаяПозиция = ТекущаяПозиция.ПлатежнаяПозиция Тогда
					ТекущаяСтрока = ТекущийОбъект.ПолучитьИдентификатор();
					Прервать;				
				КонецЕсли;
				
				Для каждого Элемент Из ТекущийОбъект.ПолучитьЭлементы() Цикл
					Стек.Добавить(Элемент);
				КонецЦикла; 
			КонецЦикла;
		КонецЦикла; 
		Если ТекущаяСтрока >= 0 Тогда
			// Установить как текущую.
			Элементы.ДеревоСчета.ТекущаяСтрока = ТекущаяСтрока;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыИЭлементыФормыДереваСчетов()
	
	// Удалим колонки и реквизиты периодов
	МассивУдалить = Новый Массив;
	Для каждого Элемент Из Элементы.ДеревоСчета.ПодчиненныеЭлементы Цикл
		Если СтрНайти(Элемент.Имя,"ДеревоСчетаП_")>0 Тогда
			МассивУдалить.Добавить(Элемент);
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Элемент Из МассивУдалить Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла; 
	
	МассивРеквизитов = ПолучитьРеквизиты("ДеревоСчета");
	МассивУдалить = Новый Массив;
	
	Для каждого Реквизит Из МассивРеквизитов Цикл
		Если СтрНайти(Реквизит.Имя,"П_")>0 Тогда
			МассивУдалить.Добавить(Реквизит.Путь+"."+Реквизит.Имя);
		КонецЕсли; 
	КонецЦикла; 
	
	Если МассивУдалить.Количество()>0 Тогда
		ИзменитьРеквизиты(,МассивУдалить);
	КонецЕсли; 

	Если КолонкиПериодов.Количество() = 0 Тогда
		// Вообще нет данных - ничего не делаем
		Возврат;
	КонецЕсли;	
	
	// Добавим реквизиты и колонки дерева периодов
	// создадим колонки периодов.
	ПервыйПериод    = КолонкиПериодов[0].Значение;
	ПоследнийПериод = КолонкиПериодов[КолонкиПериодов.Количество() - 1].Значение;	
	ОписаниеЧисло   = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2));
	
	// Добавим реквизиты.
	ДобавляемыеРеквизиты = Новый Массив;
	Для каждого Элемент Из КолонкиПериодов Цикл
		
		ИмяКолонки = Элемент.Представление;
		Значение   = Элемент.Значение;
		
		Если Значение = ПоследнийПериод Тогда
			ЗаголовокКолонки = НСтр("ru = 'На конец периода';en = 'At the end of the period'");
		ИначеЕсли Значение = ПервыйПериод Тогда
			ЗаголовокКолонки = НСтр("ru = 'На начало периода';en = 'At the beginning of the period'");
		Иначе	
			ЗаголовокКолонки = Формат(Значение,"ДЛФ=D");
		КонецЕсли; 
		НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки,ОписаниеЧисло,"ДеревоСчета",ЗаголовокКолонки);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);		
		
	КонецЦикла; 
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавим элементы.
	Для каждого Элемент Из КолонкиПериодов Цикл
		
		Значение 	 = Элемент.Значение;
		ИмяКолонки   = Элемент.Представление;		
		ИмяЭлемента  = "ДеревоСчета" + ИмяКолонки;
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ДеревоСчета);
		
		НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 	= "ДеревоСчета."+ИмяКолонки;
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		// Установим ширину элемента периода.
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;

	КонецЦикла; 

КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ИмяКолонкиПериод(Префикс,ТекущийПериод)
	
	// АПК:***-выкл Задан формат строковой переменной. Форматную строку не менять. 
	Возврат Обработки.бит_РабочееМестоКазначея.ИмяКолонкиПериод(Префикс, ТекущийПериод);

КонецФункции
	
#КонецОбласти // ЗаполнениеОсновнойОбластиРМК

&НаКлиенте
Функция КомандаВСтрокеНеПоддерживается(ВыбраныеСтроки)
	
	Если ВыбраныеСтроки.Количество() > 1 Тогда
		
		// Обработка группы выделенных строк.
		// Остаются строки, которые, можно обработать.
		СтрокиДляОбработки = Новый Массив;
		Для каждого ВыбраннаяСтрока Из ВыбраныеСтроки Цикл
			СтрокаТаблицы = ДеревоСчета.НайтиПоИдентификатору(ВыбраннаяСтрока); 		
			СтрокиДляОбработки.Добавить(СтрокаТаблицы);
		КонецЦикла;
		
		Индекс = СтрокиДляОбработки.ВГраница();
		Пока Индекс >= 0 Цикл
			СтрокаТаблицы = СтрокиДляОбработки.Получить(Индекс);
			ПодчиненныеСтроки = СтрокаТаблицы.ПолучитьЭлементы();
			Для каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
				Если СтрокиДляОбработки.Найти(ПодчиненнаяСтрока) <> Неопределено Тогда
					СтрокиДляОбработки.Удалить(Индекс);
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			Индекс = Индекс - 1;
		КонецЦикла;
		
		ВыбраныеСтроки = Новый Массив;
		Для каждого СтрокаТаблицы Из СтрокиДляОбработки Цикл
			ВыбраныеСтроки.Добавить(СтрокаТаблицы.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЕсли;
	
	НеПоддерживается = Ложь;
	Шаблон = НСтр("ru='%1 Для текущих данных операция не поддерживается.';en='%1 In the current data is not supported.'");
	Для каждого ВыбраннаяСтрока Из ВыбраныеСтроки Цикл
		
		ТекущаяСтрока = ДеревоСчета.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если ТекущаяСтрока = Неопределено Тогда
			НеПоддерживается = Истина;	
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрока.ИмяГруппировки = "ДокументПланирования" Тогда 
			Если ЗначениеЗаполнено(ТекущаяСтрока.ПлатежнаяПозиция) Тогда
				
				ПричинаОтказа = ""; 
				Если ТекущаяСтрока.Оплачено Тогда
					ПричинаОтказа = НСтр("ru='Документ оплачен.';en='The document is paid.'");
					НеПоддерживается = Истина;
				ИначеЕсли ТекущаяСтрока.ЕстьПлатежныйДокумент Тогда
					ПричинаОтказа = НСтр("ru='На основании документа введен платежный документ или платежное поручение.';
					|en='billing document or the payment order based on the document is entered.'");
					НеПоддерживается = Истина;
				КонецЕсли; 
				
				Если НеПоддерживается Тогда
					ТекстСообщения = СтрШаблон(Шаблон, ПричинаОтказа); 
					ПоказатьПредупреждение(,ТекстСообщения);
				КонецЕсли; 
			Иначе
				ТекстСообщения = СтрШаблон(Шаблон, "");
				НеПоддерживается = Истина;
				ПоказатьПредупреждение(,ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = СтрШаблон(Шаблон, "");
			НеПоддерживается = Истина;
			ПоказатьПредупреждение(,ТекстСообщения);
		КонецЕсли; 
	КонецЦикла; 

	Возврат НеПоддерживается;
	
КонецФункции

&НаКлиенте
Функция КомандаВКолонкеНеПоддерживается()

	НеПоддерживается = (Элементы.ДеревоСчета.ТекущийЭлемент.Имя = "ДеревоСчетаСуммаФакт");
	Если НеПоддерживается Тогда
		ПоказатьПредупреждение(, НСтр("ru='Для колонки ""Факт"" не поддерживается.';
									  |en='For the column ""Fact"" is not supported.'"));
	КонецЕсли; 
	
	Возврат НеПоддерживается;
	
КонецФункции
  
&НаКлиенте
Функция РазрешенаОперацияСДаннымиДокумента(ПараметрыИзменения, ИмяРеквизита, ИзмененПериод)

	РазрешенаОперация = Истина;
	
	Если ПараметрыИзменения.ПричинаИзменения.БанковскийСчет Тогда
		// Проверки на этапе выбора счета.
		РазрешенаОперация = Истина;
	КонецЕсли;
	
	Если ПараметрыИзменения.ПричинаИзменения.Период Тогда
		
		СтрокаТекущая = ДеревоСчета.НайтиПоИдентификатору(ПараметрыИзменения.ТекущаяСтрока);
		Если ЗначениеЗаполнено(СтрокаТекущая.ИмяДатаПлатежаКрайняя) И ПараметрыИзменения.ПолеОбъектаНовыйПериод > СтрокаТекущая.ИмяДатаПлатежаКрайняя Тогда
			// Проверка на перетаскивание за рамки крайней даты платежа.
			Предупреждать = ПолучитьНастройкуКонтроляДатыПлатежаКрайней(СтрокаТекущая.Организация);
			
			Если Предупреждать Тогда
				Если СинхронизацияДатыПлатежа Тогда
					ТекстСообщения = НСтр("ru='В документе %1 превышена крайняя дата платежа %2. Данные синхронизированы.';
										  |en='The document %1 exceeded the extreme date of payment %2. Synchronized.'");
				Иначе	
					ТекстСообщения = НСтр("ru='В документе %1 превышена крайняя дата платежа %2.';
										  |en='The document %1 exceeded the extreme date of payment %2.'");
				КонецЕсли; 
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТекущая.ДокументПланирования,
										   Формат(СтрокаТекущая.ДатаПлатежаКрайняя,"ДЛФ=D"));
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Иначе	
				РазрешенаОперация = Ложь;
				
				ТекстСообщения = НСтр("ru = 'В документе %1 превышена крайняя дата платежа %2. Действие отменено.'; 
									  |en = 'In the document %1 exceeded the date of payment of %2. Action canceled.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТекущая.ДокументПланирования,
										   Формат(СтрокаТекущая.ДатаПлатежаКрайняя,"ДЛФ=D"));
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат РазрешенаОперация;
	
КонецФункции

&НаКлиенте
Функция НовыеПараметрыИзмененияРеквизитовДокументов(ТекущаяСтрока, ИзмененаДата, ИзмененБанковскийСчет)
	
	ПричинаИзменения = Новый Структура;
	ПричинаИзменения.Вставить("Период", 	   ИзмененаДата);
	ПричинаИзменения.Вставить("БанковскийСчет",ИзмененБанковскийСчет);
	
	ПараметрыИзменения = Новый Структура;
	ПараметрыИзменения.Вставить("ПричинаИзменения",ПричинаИзменения);
	ПараметрыИзменения.Вставить("Значение", Неопределено); // Новое значение для подстановк в документ.
	ПараметрыИзменения.Вставить("ПолеОбъектаНовыйПериод", "");  	
	ПараметрыИзменения.Вставить("ПолеОбъектаСтарыйПериод", "");// Имя реквизита дерева - колонка периода, где есть сумма.
	ПараметрыИзменения.Вставить("ТекущаяСтрока", -1); // Ид-р текущей строки.
	ПараметрыИзменения.Вставить("НоваяСтрока",   -1); // Ид-р принимающей строки (для периода).
	
	// Поиск строк документа при нескольких выделенных.
	ПараметрыИзменения.Вставить("ДокументПланирования",  Неопределено);  
	ПараметрыИзменения.Вставить("ИмяПоляДокумент", "");
	ПараметрыИзменения.Вставить("ИскатьСтроки", Ложь);
	
	Возврат ПараметрыИзменения;
	
КонецФункции

&НаКлиенте
Функция ПараметрыИзмененияРеквизитовДокументов(ВыделенныеСтроки, НоваяДата = Неопределено, НовыйСчет = Неопределено)

	ИзмененаДата          = ?(ЗначениеЗаполнено(НоваяДата), Истина, Ложь);
	ИзмененБанковскийСчет = ?(ЗначениеЗаполнено(НовыйСчет), Истина, Ложь);
	ПараметрыИзменения	  = Новый Массив;	
	
	Если НЕ ИзмененаДата И НЕ ИзмененБанковскийСчет Тогда
		Возврат ПараметрыИзменения;	
	КонецЕсли;
		
	Для каждого ИдСтроки Из ВыделенныеСтроки Цикл
	
		 ТекущаяСтрока = ДеревоСчета.НайтиПоИдентификатору(ИдСтроки);
		 
		 ПерейтиКСледующему = Ложь;
		 ТекущаяДатаРМК 	= '0001-01-01';
		 
		 Для каждого Элемент Из КолонкиПериодов Цикл
			 // Наличе суммы означает, что перенос состоится с этой даты.
			 ТекущееЗначение = ТекущаяСтрока[Элемент.Представление];
			 Если ЗначениеЗаполнено(ТекущееЗначение) Тогда					
				 ТекущаяДатаРМК = Элемент.Значение;
				 Прервать;
			 КонецЕсли; 
		 КонецЦикла; 
		 
		 Если ИзмененаДата Тогда				  
			 // Новая дата совпадает с датой колонки, в которой записанна сумма документа. Изменения не нужны.
			 Если ТекущаяДатаРМК = НоваяДата Тогда				 
				 ПерейтиКСледующему = Истина;
			 КонецЕсли; 
		 КонецЕсли;
		 
		 Если ИзмененБанковскийСчет Тогда
			 Если ТекущаяСтрока.БанковскийСчет = НовыйСчет Тогда
				 // Счет не изменился. Изменения не нужны.
				 ПерейтиКСледующему = Истина;				 
			 КонецЕсли; 
		 КонецЕсли; 
		 
		 Если ПерейтиКСледующему Тогда
			 Продолжить;
		 КонецЕсли;

		 НовыеПараметры = НовыеПараметрыИзмененияРеквизитовДокументов(ТекущаяСтрока, ИзмененаДата, ИзмененБанковскийСчет);
		 НовыеПараметры.ТекущаяСтрока     		= ИдСтроки;
		 НовыеПараметры.ПолеОбъектаСтарыйПериод = КолонкиПериодов.НайтиПоЗначению(ТекущаяДатаРМК).Представление;

		 // Когда выделяется несколько строк для замены б/счета, тогда "слетает" идентификатор строки
		 // при операциях вставки/удаления.
		 // Запомним документ для поиска строк.
		 НовыеПараметры.ИмяПоляДокумент 	 = "ПлатежнаяПозиция";
		 НовыеПараметры.ДокументПланирования = ТекущаяСтрока.ПлатежнаяПозиция;
		 
		 НовыеПараметры.ИскатьСтроки = ИзмененБанковскийСчет И ВыделенныеСтроки.Количество() > 1;
		
		 Если ИзмененаДата Тогда
			 НовыеПараметры.ПолеОбъектаНовыйПериод  = КолонкиПериодов.НайтиПоЗначению(НоваяДата).Представление;
			 НовыеПараметры.Значение    = НоваяДата;
			 НовыеПараметры.НоваяСтрока = ИдСтроки;
		 КонецЕсли; 
		 
		 Если ИзмененБанковскийСчет Тогда
			 НовыеПараметры.ПолеОбъектаНовыйПериод = НовыеПараметры.ПолеОбъектаСтарыйПериод;
			 НовыеПараметры.Значение = НовыйСчет;
			 
			 ОтборСтрок = НовыйОтборСтрокДереваСчетов("БанковскийСчет", "БанковскийСчет", НовыйСчет);
			 Идентификатор = -1;
			 НайтиСтрокуДереваСчетов(ЭтотОбъект, ДеревоСчета.ПолучитьЭлементы(), ОтборСтрок, Идентификатор);
			 НовыеПараметры.НоваяСтрока = Идентификатор;
		 КонецЕсли; 
		 
		РазрешенаОперация = РазрешенаОперацияСДаннымиДокумента(НовыеПараметры, НовыеПараметры.ПолеОбъектаСтарыйПериод, ИзмененаДата);			 
		Если РазрешенаОперация Тогда					 
			ПараметрыИзменения.Добавить(НовыеПараметры);					 
		КонецЕсли; 				 

	КонецЦикла; 

	Возврат ПараметрыИзменения;
	
КонецФункции // ПодготовитьМассивПереноса()

&НаКлиентеНаСервереБезКонтекста
Процедура НайтиСтрокуДереваСчетов(Форма, Коллекция, Отбор, Идентификатор)

	Для каждого Элемент Из Коллекция Цикл
		Если Элемент.ИмяГруппировки = Отбор.ИмяГруппировки И Элемент[Отбор.Поле] = Отбор.Значение Тогда
			Идентификатор = Элемент.ПолучитьИдентификатор();
		КонецЕсли;
		Если Идентификатор = -1 Тогда	
			СубКоллекция = Элемент.ПолучитьЭлементы();
			Если СубКоллекция.Количество() <> 0 Тогда
				НайтиСтрокуДереваСчетов(Форма, СубКоллекция, Отбор, Идентификатор);				
			КонецЕсли; 			
		КонецЕсли; 				
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыйОтборСтрокДереваСчетов(ИмяГруппировки, Поле, Значение)

	Отбор = Новый Структура; 
	Отбор.Вставить("ИмяГруппировки", ИмяГруппировки);
	Отбор.Вставить("Поле", Поле);
	Отбор.Вставить("Значение", Значение);
	
	Возврат Отбор;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьФлажки(РодительскаяСтрока,КодДействия)
	
	// Обход иерархии строк через стек без использования рекурсии.
	Стек = Новый Массив; 
	Для каждого СтрокаТаблицы Из РодительскаяСтрока.ПолучитьЭлементы() Цикл
		
		Стек.Добавить(СтрокаТаблицы);
		Пока Стек.Количество() > 0 Цикл
			
			ТекущийОбъект = Стек.Получить(Стек.ВГраница());
			Стек.Удалить(Стек.ВГраница());
			
			Если ТекущийОбъект.ДоступностьФлажка Тогда
				Если КодДействия = 0 Тогда
					ТекущийОбъект.Выполнять = 0;
				ИначеЕсли КодДействия = 1 Тогда
					ТекущийОбъект.Выполнять = 1;
				ИначеЕсли КодДействия = 2 Тогда
					Если ТекущийОбъект.Выполнять = 1 Тогда
						ТекущийОбъект.Выполнять = 0
					ИначеЕсли ТекущийОбъект.Выполнять = 0 Тогда
						ТекущийОбъект.Выполнять = 1
					КонецЕсли;
				КонецЕсли; 
				Если ЗначениеЗаполнено(ТекущийОбъект.ПлатежнаяПозиция) Тогда
					ПересчитатьЗначенияВыделенныхДокументов(ТекущийОбъект.Выполнять, ТекущийОбъект.Сумма, 
						ТекущийОбъект.ПлатежнаяПозиция);
				КонецЕсли;
			КонецЕсли;
			
			Для каждого Элемент Из ТекущийОбъект.ПолучитьЭлементы() Цикл
				Стек.Добавить(Элемент);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла; 
	
	ПереопределитьФлагРодителя(РодительскаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьИзменитьПлатеж(РежимРаботы="Разбить")
	
	ТекущаяСтрока = Элементы.ДеревоСчета.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекущаяСтрока.ИмяГруппировки <> "ДокументПланирования" Тогда
		Возврат;
	КонецЕсли; 
	
	Если (ЗначениеЗаполнено(ТекущаяСтрока.ПлатежнаяПозиция) ИЛИ ЗначениеЗаполнено(ТекущаяСтрока.Измерение))
		И НЕ ТекущаяСтрока.Оплачено 
		И НЕ ТекущаяСтрока.ЕстьПлатежныйДокумент Тогда
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ПлатежнаяПозиция) Тогда
			Подрежим = "Платеж";
			ДокументПланирования = ТекущаяСтрока.ПлатежнаяПозиция;
		Иначе	
			Подрежим = "Заявка";
			ДокументПланирования = ТекущаяСтрока.Измерение;
		КонецЕсли; 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДокументПланирования", ДокументПланирования);
		ПараметрыФормы.Вставить("ВалютаПлатежа",ТекущаяСтрока.ВалютаДенежныхСредств);
		ПараметрыФормы.Вставить("СуммаПлатежа",ТекущаяСтрока.Сумма);
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ДокументПланирования", ТекущаяСтрока.ДокументПланирования);
		ДопПараметры.Вставить("Сумма"				, ТекущаяСтрока.Сумма);
		ДопПараметры.Вставить("РежимРаботы"			, РежимРаботы);
		ДопПараметры.Вставить("ИДСтроки"			, ТекущаяСтрока.ПолучитьИдентификатор());
		ДопПараметры.Вставить("Подрежим"			, Подрежим);
		
		Оповещение = Новый ОписаниеОповещения("РазбитьИзменитьПлатежОкончание", ЭтотОбъект, ДопПараметры); 
		ОткрытьФорму("Обработка.бит_РабочееМестоКазначея.Форма.ФормаРазбиенияПозиции",ПараметрыФормы,ЭтотОбъект,,,,Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура РазбитьИзменитьПлатежОкончание(РезультатВыбора, ДопПараметры) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") И РезультатВыбора.Команда = "ОК" Тогда
	
		Если ТипЗнч(ДопПараметры.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств")
			ИЛИ ТипЗнч(ДопПараметры.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию") Тогда 
			
			ТекстСообщения = НСтр("ru='Запрещено изменять и разбивать платеж для Заявок на перемещение ДС и Заявок на перевод ДС в другую организацию.';
								  |en='It is forbidden to change and split payment for applications for moving the DS and DS Applications for transfer to another organization.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		ИначеЕсли РезультатВыбора.Сумма <= 0 Тогда
			ТекстСообщения = НСтр("ru='Запрещено вводить нулевую или отрицательную сумму.';
								  |en='It is forbidden to enter a zero or negative amount.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		ИначеЕсли РезультатВыбора.СуммаДокумента < РезультатВыбора.Сумма Тогда
			ТекстСообщения = НСтр("ru='Запрещено вводить сумму больше утвержденной.';
								  |en='It is forbidden to enter the amount of more than approved.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли; 
		
		Если ДопПараметры.РежимРаботы = "Разбить" Тогда
			Если ДопПараметры.Подрежим = "Платеж" Тогда
				ДействиеВыполнено = РазбитьПлатеж(ДопПараметры.ИДСтроки,РезультатВыбора.СуммаДокумента,РезультатВыбора.Сумма);
			Иначе	
				ДействиеВыполнено = ИзменитьЗаявку(ДопПараметры.ИДСтроки, РезультатВыбора.Сумма, Истина);
			КонецЕсли;
		ИначеЕсли ДопПараметры.РежимРаботы = "Изменить" Тогда
			Если ДопПараметры.Подрежим = "Платеж" Тогда
				ДействиеВыполнено = ИзменитьПлатеж(ДопПараметры.ИДСтроки,РезультатВыбора.СуммаДокумента,РезультатВыбора.Сумма);
			Иначе	
				ДействиеВыполнено = ИзменитьЗаявку(ДопПараметры.ИДСтроки, РезультатВыбора.Сумма, Ложь);
			КонецЕсли; 
		Иначе
			ДействиеВыполнено = Ложь;
		КонецЕсли;
		
		Если ДействиеВыполнено Тогда
			НачатьОтложенноеОбновлениеДереваСчетов();		
		КонецЕсли; 		
	КонецЕсли; 
	
КонецПроцедуры // РазбитьИзменитьПлатежОкончание()

&НаКлиенте
Процедура СоздатьПоказатьНовыйДокумент(ВидДокумента, Прогноз)
	
	ТекущаяСтрока = Элементы.ДеревоСчета.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ЗначенияЗаполнения = СоздатьСтруктуруЗаполнения(Прогноз, 
							ТекущаяСтрока.ПолучитьИдентификатор());
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Режим", "Заявка");
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ПолноеИмяФормы = СтрШаблон("Документ.%1.ФормаОбъекта", ВидДокумента);
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы, ЭтотОбъект);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ВидимостьДанныхПоВыделеннымДокументам(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Элементы.ВыделенныеДокументыКоличество.Видимость 	= Объект.ВыводитьВыделенныеДокументыКоличество;
	Элементы.ВыделенныеДокументыМаксимум.Видимость 		= Объект.ВыводитьВыделенныеДокументыМаксимум;
	Элементы.ВыделенныеДокументыМинимум.Видимость 		= Объект.ВыводитьВыделенныеДокументыМинимум;
	Элементы.ВыделенныеДокументыСреднее.Видимость 		= Объект.ВыводитьВыделенныеДокументыСреднее;
	Элементы.ВыделенныеДокументыСумма.Видимость 		= Объект.ВыводитьВыделенныеДокументыСумма;

КонецПроцедуры // ВидимостьДанныхПоВыделеннымДокументам()
  
&НаКлиенте
Процедура ОжиданиеАктивазацииСтроки()

 	ДействияПриАктивизацииСтроки();
	
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ТекДокументШапка,
		ТекДокументШапка.ПолучитьЭлементы());
	
КонецПроцедуры // ОжиданиеАктивазацииСтроки()

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиПанелейПоУмолчанию(Форма)

	Настройки = Новый Структура;
	Настройки.Вставить("ПанельАналитическаяВидимость", Ложь);
	Настройки.Вставить("ПанельНастройкиВидимость", Ложь);
	Настройки.Вставить("ПанельТекущийДокументВидимость", Ложь);
	
	ЗаполнитьЗначенияСвойств(Настройки, Форма);
	
	Возврат Настройки;
	
КонецФункции // НастройкиПанелейПоУмолчанию()
  
&НаСервере
Процедура ЗаполнитьФормуПоУмолчанию()
	
	// Значения по умолчанию.
	Объект.НачалоПериода 				= НачалоМесяца(ТекущаяДатаСеанса());
	Объект.КонецПериода  				= КонецМесяца(ТекущаяДатаСеанса());
	Объект.РежимОтображенияПериодов		= "НеПустые";
	Объект.РежимОтображенияСчетов   	= "НеПустые";
	Объект.РежимСообщений           	= "Ошибки";
	Объект.РежимЗаписиРасчетыЧерезБанк  = Перечисления.бит_РежимыЗаписиДокумента.Запись;
	Объект.РежимЗаписиРасчетыЧерезКассу = Перечисления.бит_РежимыЗаписиДокумента.Запись;
	Объект.ОперативныйДень				= ТекущаяДатаСеанса();
	Объект.УровеньРаскрытияСчетов      	= 4;
	Объект.ВысотаПанелиТекущийДокумент	= 10;
	Объект.Периодичность				= Перечисления.бит_кзн_ПериодичностьРМК.День;
	Объект.РежимОстатков				= Константы.бит_кзн_РежимОтображенияОстатковДС.Получить();
	Если НЕ ЗначениеЗаполнено(Объект.РежимОстатков) Тогда
		Объект.РежимОстатков = Перечисления.бит_кзн_РежимОтображенияОстатковДС.ДанныеРегУчета;
	КонецЕсли;
	
	Объект.Цвет_Информация = "#FFFFFF";
	Объект.Цвет_Прошлое    = "#F5F5F5";
	Объект.Цвет_Настоящее  = "#C0DCC0";
	Объект.Цвет_Будущее    = "#AFEEEE";
	Объект.Цвет_Запрет     = "#FFB6C1";
	Объект.ВыделятьПредельныеСрокиПлатежа = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокФормы(Форма)

	Объект = Форма.Объект;

	ЗаголовокОтчета = СтрШаблон(НСтр("ru='Рабочее место казначея %1';en='Workplace treasurer %1'"),
		БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Объект.НачалоПериода, Объект.КонецПериода));

	Если ЗначениеЗаполнено(Форма.ТекущаяНастройка) Тогда
		ЗаголовокОтчета = СтрШаблон("%1 (%2)", ЗаголовокОтчета, Форма.ТекущаяНастройка);
	КонецЕсли; 	
	
	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры 
 
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
 	Элементы.ГруппаОтборы.Видимость              = Форма.ПанельНастройкиВидимость;
	Элементы.ГруппаТекущийДокумент.Видимость     = Форма.ПанельТекущийДокументВидимость;
	Элементы.ГруппаАналитическаяПанель.Видимость = Форма.ПанельАналитическаяВидимость;
	
	Элементы.ФормаКомандаВидимостьПанелиНастроек.Пометка = Форма.ПанельНастройкиВидимость;
	Элементы.ФормаКомандаПанельТекущийДокумент.Пометка   = Форма.ПанельТекущийДокументВидимость;
	Элементы.ФормаКомандаАналитическаяПанель.Пометка     = Форма.ПанельАналитическаяВидимость;

	Показать = Форма.ПанельТекущийДокументВидимость ИЛИ Форма.ПанельАналитическаяВидимость;
	Элементы.ГруппаИнформация.Видимость = Показать;
 
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОЗавершенииФормированияДокументов()
	
	Перем Оповещение, Текст, ТекстСообщения;
	
	Текст = НСтр("ru='Формирование документов';en='Documents Generation'");
	Если ДобавленоДокументов <> 0 Тогда		
		ТекстСообщения = НСтр("ru='Список сформированных документов.';en='List generated documents.'");
		Оповещение = Новый ОписаниеОповещения("ПоказатьСформированныеДокументы", ЭтотОбъект); 		
		ПоказатьОповещениеПользователя(Текст, Оповещение, ТекстСообщения, БиблиотекаКартинок.Информация32);
		
		НачатьОтложенноеОбновлениеДереваСчетов();
	Иначе
		ТекстСообщения = НСтр("ru='Создано 0 документов.';en='0 created documents.'");
		ПоказатьОповещениеПользователя(Текст,,ТекстСообщения, БиблиотекаКартинок.бит_Предупреждение32);
	КонецЕсли;

	УстановитьВидимостьДекорацияПерейтиКСформированнымДокументам(ЭтотОбъект);
	ОбновитьСтатистику();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДекорацияПерейтиКСформированнымДокументам(Форма)

	Показать = Форма.СписокДокументовДвиженияДС.Количество() <> 0
		   ИЛИ Форма.СписокРеестры.Количество() <> 0;
			
	Форма.Элементы.ДекорацияПерейтиКСформированнымДокументам.Видимость = Показать;	

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьДоступностьПриИзмененииНастроек(Форма, ДоступОграничен = Ложь)

	Форма.Элементы.ПредупреждениеОбОбновленииДерева.Видимость = ДоступОграничен;	
	Форма.Элементы.ДеревоСчета.ТолькоПросмотр = ДоступОграничен;
	Форма.Элементы.ДеревоСчета.КонтекстноеМеню.Доступность = НЕ ДоступОграничен;
	Форма.Элементы.ФормаГруппаОтметить.Доступность = НЕ ДоступОграничен;
	
КонецПроцедуры 

&НаСервере
Функция ИнициализироватьКомпоновщик(Компоновщик,ИмяМакета,УникальныйИдентификатор)

	СхемаКомпоновкиДанных = Обработки.бит_РабочееМестоКазначея.ПолучитьМакет(ИмяМакета);
	бит_МеханизмДопИзмерений.СформироватьЗаголовкиПолейДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, 
		СхемаКомпоновкиДанных.НаборыДанных[0].Имя, 
		бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
			
	АдресСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД);
	
    Компоновщик.Инициализировать(ИсточникНастроек);
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

	МаксКолвоДопАналитик = 0;
	НаборДанныхДвижения = СхемаКомпоновкиДанных.НаборыДанных.Найти("Движения");
	Если НаборДанныхДвижения <> Неопределено Тогда
		Для Сч = 1 По 12 Цикл
			Поле = НаборДанныхДвижения.Поля.Найти("Аналитика_" + Сч);
			Если Поле <> Неопределено И НЕ Поле.ОграничениеИспользования.Поле Тогда
				МаксКолвоДопАналитик = МаксКолвоДопАналитик + 1;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
	Возврат АдресСКД;
	
КонецФункции // ИнициализироватьКомпоновщик()

&НаСервере
Процедура УстановитьУсловноеОформление()

	Если НЕ ЗначениеЗаполнено(КолонкиПериодов) Тогда
		Возврат;
	КонецЕсли; 	
	
	УсловноеОформление.Элементы.Очистить();
		
	// Выделение группировки "Организация", "Банковский счет".
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоСчета");
	
	ГруппаУО = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор.Элементы, 
				"ДеревоСчетаШрифт", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаУО,
				"ДеревоСчета.ИмяГруппировки", ВидСравненияКомпоновкиДанных.Равно, "Организация");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаУО,
				"ДеревоСчета.ИмяГруппировки", ВидСравненияКомпоновкиДанных.Равно, "БанковскийСчет");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.бит_ШрифтТекстаОбычныйПолужирный);

	// Выделение шапки документа.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТекДокументШапка");
		
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
				"ТекДокументШапка.Жирный", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.бит_ШрифтТекстаОбычныйПолужирный);

	// Касса организации.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоСчетаИзмерение");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
				"ДеревоСчета.ИмяГруппировки", ВидСравненияКомпоновкиДанных.Равно, "БанковскийСчет");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
				"ДеревоСчета.БанковскийСчет", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<...>'"));
	
	// Ограниченидоступа к полю "ДеревоСчетаВыполнять".
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоСчетаВыполнять");
		
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
				"ДеревоСчета.ДоступностьФлажка", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЦветИнформация  = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Информация);
	ЦветПрошлый     = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Прошлое);
	ЦветОперативный = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Настоящее);
	ЦветБудущий     = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Будущее);
	ЦветЗапрет      = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Запрет);
	ЦветВыходной    = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Выходной);
	
	// Последний период - остаток на конец
	ПоследнийПериод 	   = КолонкиПериодов[КолонкиПериодов.Количество() - 1].Значение;
	ИмяПоляПоследнийПериод = "ДеревоСчета" + КолонкиПериодов[КолонкиПериодов.Количество() - 1].Представление;
	
	Для каждого Элемент Из КолонкиПериодов Цикл
		
		Значение  	  = Элемент.Значение;		
		Представление = Элемент.Представление; 
		ВидимостьПоля = Элемент.Пометка;
		ИмяПоля		  = "ДеревоСчета" + Представление;

		Если Объект.ВыделятьПредельныеСрокиПлатежа Тогда	
			Если Значение >= ТекущийДень И Значение < ПоследнийПериод Тогда
				ЭлементУО = УсловноеОформление.Элементы.Добавить();
				КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяПоля);

				ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
					"ДеревоСчета.ИмяДатаПлатежаКрайняя", ВидСравненияКомпоновкиДанных.Меньше, Представление);

				ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветЗапрет);
			КонецЕсли; 
		КонецЕсли;
		УпралениеВидимостьюКолонкиПериода(ИмяПоля, ВидимостьПоля, ЭтотОбъект);
	КонецЦикла;

	// Визуальное разделение периодов на "До опер. даты", "Опер. дата", "После опер. даты".
	ПредставлениеОформления = "ОформлениеПериодов";
	СтрУсловия = Новый Структура();
	СтрУсловия.Вставить("УсловиеЛевое", "флЛожь");	
	СтрУсловия.Вставить("УсловиеПравое", ЛОЖЬ);
	
	УстановитьУсловниеОформлениеПериодов();

	// Информационные строки.
	МассивПоля = Новый Массив;
	МассивПоля.Добавить(Элементы.ДеревоСчетаИзмерение.Имя);
	МассивПоля.Добавить(Элементы.ДеревоСчетаВалютаДенежныхСредств.Имя);
	МассивПоля.Добавить(Элементы.ДеревоСчетаПлатежнаяПозиция.Имя);
	МассивПоля.Добавить(Элементы.ДеревоСчетаСуммаФакт.Имя);
	МассивПоля.Добавить(Элементы.ДеревоСчетаСумма.Имя);
	МассивПоля.Добавить(ИмяПоляПоследнийПериод);

	СтрОформления = Новый Структура("ЦветФона", ЦветИнформация);
	СтруктураУО = Новый Структура("СтруктураОформления, СтруктураУсловия, МассивОформляемыхПолей",
	                              СтрОформления, СтрУсловия, МассивПоля);  	
	бит_РаботаСДиалогамиСервер.ДобавитьЭлементУсловногоОформления(УсловноеОформление, ПредставлениеОформления, СтруктураУО);

	// Прошлые периоды- строки по неоплаченным заявкам.
	МассивОформляемыхПолей = Новый Массив;
	МассивОформляемыхПолей.Добавить(Элементы.ДеревоСчетаИзмерение.Имя);
	МассивОформляемыхПолей.Добавить(Элементы.ДеревоСчетаПлатежнаяПозиция.Имя);
	МассивОформляемыхПолей.Добавить(Элементы.ДеревоСчетаВалютаДенежныхСредств.Имя);
	МассивОформляемыхПолей.Добавить(Элементы.ДеревоСчетаСуммаФакт.Имя);
	МассивОформляемыхПолей.Добавить(Элементы.ДеревоСчетаСумма.Имя);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = ПредставлениеОформления;
	ЭлементУО.Использование = Истина;			
    ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветПрошлый);
	
	ГруппаУсловиеУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаУсловиеУО.Использование = Истина;
	ГруппаУсловиеУО.ТипГруппы 	  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	УсловиеУО 				 = ГруппаУсловиеУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчета.ЭтоОстатокПоНеоплаченнойЗаявке");
	УсловиеУО.ПравоеЗначение = Истина;
	
	//УсловиеУО 				 = ГруппаУсловиеУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//УсловиеУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчета.ЕстьПлатежныйДокумент");
	//УсловиеУО.ПравоеЗначение = Ложь;
	
	УсловиеУО 				 = ГруппаУсловиеУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчета.ЭтоПрогноз");
	УсловиеУО.ПравоеЗначение = Ложь;
	
	Для каждого ОфПоле Из МассивОформляемыхПолей Цикл
		ОформляемоеПоле 	 = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ОфПоле);
	КонецЦикла;

КонецПроцедуры // УстановитьУсловноеОформление()

&НаСервере
Процедура УстановитьУсловниеОформлениеПериодов()
	
	ЦветПрошлый     = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Прошлое);
	ЦветОперативный = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Настоящее);
	ЦветБудущий     = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Будущее);
	ЦветЗапрет      = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Запрет);
	ЦветВыходной    = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Выходной);
	
	ВыходныеИПраздничныеДни = ВыходныеИПраздничныеДни();
	
	Для каждого ЭлементСписка Из КолонкиПериодов Цикл
		ОперативныйДень = ДатаСоСдвигом(Объект.ОперативныйДень, Объект.Периодичность);
		Если ЭлементСписка.Значение = ОперативныйДень Тогда 
			ЦветФона = ЦветОперативный;
		Иначе
			Если ВыходныеИПраздничныеДни.Найти(ЭлементСписка.Значение) <> Неопределено Тогда
				ЦветФона = ЦветВыходной; 
			ИначеЕсли ЭлементСписка.Значение < ОперативныйДень Тогда	
				ЦветФона = ЦветПрошлый;
			ИначеЕсли ЭлементСписка.Значение > ОперативныйДень Тогда
				ЦветФона = ЦветБудущий;
			КонецЕсли; 
		КонецЕсли;
		Элементы["ДеревоСчета" + ЭлементСписка.Представление].ЦветФона = ЦветФона;
	КонецЦикла; 		

КонецПроцедуры
  
&НаКлиентеНаСервереБезКонтекста
Процедура УпралениеВидимостьюКолонкиПериода(ИмяКолонки, Пометка, Форма)

	Элемент = Форма.Элементы.Найти(ИмяКолонки);
	Если Элемент <> Неопределено Тогда
		Элемент.Видимость = Пометка;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКонтекстногоМеню()

	ТекущиеДанные = Элементы.ДеревоСчета.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Видно = (ТекущиеДанные.ИмяГруппировки = "ДокументПланирования"
			И ЗначениеЗаполнено(ТекущиеДанные.ПлатежнаяПозиция));
			
	Элементы.ДеревоСчетаКонтекстноеМенюКомандаВОперДень.Видимость = Видно;
	Элементы.ДеревоСчетаКонтекстноеМенюКомандаПеренестиНаДату.Видимость = Видно;
	Элементы.ДеревоСчетаКонтекстноеМенюКомандаПеренестиНаБанкСчет.Видимость = Видно;
	Элементы.ДеревоСчетаКонтекстноеМенюКомандаРазбитьПлатеж.Видимость = Видно;
	Элементы.ДеревоСчетаКонтекстноеМенюКомандаИзменитьПлатеж.Видимость = Видно;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДействияУровней()

	ГруппировкиДереваСчетов = Новый Массив;
	ГруппировкиДереваСчетов.Добавить(НСтр("ru = 'Организация'; en = 'Organization'")); // Организация
	ГруппировкиДереваСчетов.Добавить(НСтр("ru = 'Вид денежных средств'; en = 'Type of funds'")); // ВидДенежныхСредств
	ГруппировкиДереваСчетов.Добавить(НСтр("ru = 'Место хранения'; en = 'Storage location'")); // БанковскийСчет
	ГруппировкиДереваСчетов.Добавить(НСтр("ru = 'Вид данных'; en = 'Type of data'")); // ВидДанных
	ГруппировкиДереваСчетов.Добавить(НСтр("ru = 'Документ планирования'; en = 'Planning document'")); // ДокументПланирования
	ГруппировкиДереваСчетов.Добавить(НСтр("ru = '<Детальные записи>'; en = '<Detailed records>'"));
	
	КоличествоГруппировок = ГруппировкиДереваСчетов.Количество();
	
	// Очищаем существующие кнопки подменю
	КоличествоЭлементов = Элементы.ДеревоСчетаУровни.ПодчиненныеЭлементы.Количество();
	Индекс = Элементы.ДеревоСчетаУровни.ПодчиненныеЭлементы.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Кнопка = Элементы.ДеревоСчетаУровни.ПодчиненныеЭлементы[Индекс];
		Элементы.Удалить(Кнопка);
		Индекс = Индекс - 1;	
	КонецЦикла;
	
	// Создадим команды и кнопки в подменю
	Для Номер = 1 По МаксУровеньДеревоСчета Цикл
		
		ИмяКоманды = "ДеревоСчетаУровень_"+Номер;
		
		КомандаУровня = Команды.Найти(ИмяКоманды);
		
		Если КомандаУровня = Неопределено Тогда
			КомандаУровня = Команды.Добавить(ИмяКоманды);
			КомандаУровня.Действие = "Подключаемый_ДействиеДеревоСчетаУровень";
		КонецЕсли; 
		
		Если Номер > КоличествоГруппировок Тогда
			ЗаголовокКнопки = НСтр("ru = 'Уровень %1'; en = 'Level %1'");
			ЗаголовокКнопки = СтрШаблон(ЗаголовокКнопки, Номер);	
		Иначе
			ЗаголовокКнопки = ГруппировкиДереваСчетов[Номер - 1];
		КонецЕсли;

		НоваяКнопка = Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"),Элементы.ДеревоСчетаУровни);
		НоваяКнопка.ИмяКоманды = ИмяКоманды;
		НоваяКнопка.Заголовок = ЗаголовокКнопки;
		Если Номер = Объект.УровеньРаскрытияСчетов Тогда		
			НоваяКнопка.Пометка = Истина;		
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция ПериодЗаполненПравильно(Форма)

	ЗаполненПравильно = Истина;
	
	Объект = Форма.Объект;
	Отказ  = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,
							НСтр("ru = 'Начало периода';en = 'Beginning of the period'")); 
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
		#КонецЕсли
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,
			НСтр("ru = 'Конец периода';en = 'End of period'")); 
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.КонецПериода",, Отказ);
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.КонецПериода",, Отказ);
		#КонецЕсли
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Если Объект.КонецПериода < Объект.НачалоПериода Тогда
			ТекстСообщения = НСтр("ru = 'Период указан неверно. Дата начала больше даты окончания.';
								  |en = 'The period is incorrect. The start date is greater than the end date.'");
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
			#Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли; 
	
	Если Отказ Тогда
		ЗаполненПравильно = Ложь;
	КонецЕсли;  
	
	Возврат ЗаполненПравильно; 

КонецФункции // ПериодЗаполненПравильно()

&НаСервере 
Функция НайтиПараметрДанных(Компоновщик,ИмяНастройки)

	РезНастройка = Неопределено;
	
	 Для каждого Элемент Из Компоновщик.Настройки.ПараметрыДанных.Элементы Цикл
		 Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			 Если Строка(Элемент.Параметр) = ИмяНастройки Тогда
				 РезНастройка = Элемент;
				 Прервать;
			 КонецЕсли; 
		 КонецЕсли; 
	 КонецЦикла; 

	Возврат РезНастройка;
	
КонецФункции

&НаСервере
Процедура ОбработкаИзмененияНастроек(СтрПар)

	ПрименитьНастройкиОбъекта(СтрПар);

	Если СтрПар.ИзмененРазмер Тогда
		Элементы.ГруппаТекущийДокумент.Высота = Объект.ВысотаПанелиТекущийДокумент;
	КонецЕсли; 

	Если ПанельАналитическаяВидимость Тогда
		ОбновитьАналитическуюПанель();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьНастройкиОбъекта(Настройки)
	
	НачалоПериода 	= Объект.НачалоПериода;
	КонецПериода  	= Объект.КонецПериода;
	ОперативныйДень = Объект.ОперативныйДень;
	
	// АПК:68-выкл Обратная совместимость (ошибка есть, но не может быть исправлена).
	ОбрОбъект = ДанныеФормыВЗначение(Настройки.ТекущийОбъект,Тип("ОбработкаОбъект.бит_РабочееМестоКазначея"));
	ЗначениеВДанныеФормы(ОбрОбъект,Объект);
	// АПК:68-вкл
	
    Объект.Компоновщик.ЗагрузитьПользовательскиеНастройки(Настройки.ТекущийОбъект.Компоновщик.ПользовательскиеНастройки);	
	Объект.КомпоновщикАнализ.ЗагрузитьПользовательскиеНастройки(Настройки.ТекущийОбъект.КомпоновщикАнализ.ПользовательскиеНастройки);
	
	Если НачалоПериода <> Объект.НачалоПериода ИЛИ КонецПериода <> Объект.КонецПериода Тогда
		ИзменитьДоступностьПриИзмененииНастроек(ЭтотОбъект, Истина);
	КонецЕсли; 
	
КонецПроцедуры // ПрименитьОбщиеНастройки()

&НаСервере 
Функция ИзменяемыйДокументЗаблокирован(ОбъектБлокировки)

	Отказ 		 = Ложь;
	Заблокирован = Истина;
	
	Попытка
		ОбъектБлокировки.Заблокировать();
	Исключение
		ТекстСообщения = НСтр("ru='Невозможно заблокировать документ ""%1"". Операция не выполнена.';
							  |en='Unable to lock the document ""%1"". The operation is not performed.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ОбъектБлокировки));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецПопытки;
	
	Если Отказ Тогда
		Заблокирован = Ложь;
	КонецЕсли; 
	
	Возврат Заблокирован;

КонецФункции

&НаСервере
Процедура ПрименитьИзмененияРеквизитовДокумента(НовыеПараметры, АктивизироватьСтроку)
	
	// бывш. ПрименитьИзмененияПеретаскивания
	ИзмененПериод 		  = НовыеПараметры.ПричинаИзменения.Период;
	ИзмененБанковскийСчет = НовыеПараметры.ПричинаИзменения.БанковскийСчет;
	Значение 			  = НовыеПараметры.Значение;
	
	Если НовыеПараметры.ИскатьСтроки Тогда
		ОтборСтрок = НовыйОтборСтрокДереваСчетов("ДокументПланирования", НовыеПараметры.ИмяПоляДокумент, 
						НовыеПараметры.ДокументПланирования);
		Идентификатор = -1;
		НайтиСтрокуДереваСчетов(ЭтотОбъект, ДеревоСчета.ПолучитьЭлементы(), ОтборСтрок, Идентификатор);
		ТекущаяСтрока = ДеревоСчета.НайтиПоИдентификатору(Идентификатор);
	Иначе
		ТекущаяСтрока = ДеревоСчета.НайтиПоИдентификатору(НовыеПараметры.ТекущаяСтрока);
	КонецЕсли; 
		
	ЗнакРасходПоступление = ?(ТекущаяСтрока.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Расход, -1, 1);
	
	Записывать = Истина;
	
	ДокОбъект = ТекущаяСтрока.ПлатежнаяПозиция.ПолучитьОбъект();
	Если ИзменяемыйДокументЗаблокирован(ДокОбъект) Тогда
		Если ИзмененПериод Тогда
			ДокОбъект.ДатаПлан = НовыеПараметры.Значение;
			
			Если СинхронизацияДатыПлатежа И ЗначениеЗаполнено(ДокОбъект.ДатаПланКрайняя) Тогда 
				ДокОбъект.ДатаПланКрайняя = ДокОбъект.ДатаПлан;
			КонецЕсли;
		КонецЕсли; 
		
		Если ИзмененБанковскийСчет Тогда
			Если ТипЗнч(НовыеПараметры.Значение) = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций") Тогда
				ДокОбъект.БанковскийСчет = НовыеПараметры.Значение;
			Иначе
				ДокОбъект.Касса = НовыеПараметры.Значение;
			КонецЕсли; 
		КонецЕсли;
	Иначе
		Записывать = Ложь;
	КонецЕсли;
	
	ДействиеВыполнено = Ложь;
	Если Записывать Тогда
		Попытка		
			Если ДокОбъект.Проведен Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Иначе
				РежимЗаписи = РежимЗаписиДокумента.Запись;			
			КонецЕсли; 
			ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьКонтрольПревышенияБюджета", ИзмененБанковскийСчет);
			ДокОбъект.Записать(РежимЗаписи);
			ДействиеВыполнено = Истина;
		Исключение
			ТекстСообщения = НСтр("ru='Ошибка при записи документа %1 по причине %2';
								  |en='Error writing instrument %1 because %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ДокОбъект), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокОбъект); 
		КонецПопытки; 
		
		ДокОбъект.Разблокировать();
	КонецЕсли; 	
			
	Если ДействиеВыполнено Тогда
		
		// приведем дерево в соответствие с изменением в платежной позиции
		ИмяОперДень = ИмяКолонкиПериод("П",Объект.ОперативныйДень);
		
		Если ИзмененПериод Тогда
			
			Сумма = ТекущаяСтрока[НовыеПараметры.ПолеОбъектаСтарыйПериод];
			
			// убираем сумму из верхних группировок исходной строки
			ИзменитьВерхниеСтроки(ТекущаяСтрока, НовыеПараметры.ПолеОбъектаСтарыйПериод, 
				Сумма,-1, ТекущаяСтрока.ЭтоПрогноз, ЗнакРасходПоступление);
			
			// добавляем сумму к группировкам с учетом сдвига периода
			ИзменитьВерхниеСтроки(ТекущаяСтрока, НовыеПараметры.ПолеОбъектаНовыйПериод,
				Сумма,1, ТекущаяСтрока.ЭтоПрогноз, ЗнакРасходПоступление);
				
		КонецЕсли; // Изменен период
		
		Если ИзмененБанковскийСчет Тогда
			
			ИзменитьСтрокиДерева = Истина;
			НайденаНоваяСтрока 	 = Ложь;
			
			Если НовыеПараметры.НоваяСтрока = -1 Тогда
				// На момент заполнения параметров р/счета еще не было в дереве, но,
				// возможно, дерево обновили на первой итерации. 
				Если НовыеПараметры.ИскатьСтроки Тогда
					ОтборСтрок = НовыйОтборСтрокДереваСчетов("БанковскийСчет", "БанковскийСчет", НовыеПараметры.Значение);
					НайтиСтрокуДереваСчетов(ЭтотОбъект, ДеревоСчета.ПолучитьЭлементы(), ОтборСтрок, НовыеПараметры.НоваяСтрока);
					Если НовыеПараметры.НоваяСтрока = -1 Тогда
						ОбновитьДеревоСчетов();
						ИзменитьСтрокиДерева = Ложь;
					Иначе
						НайденаНоваяСтрока = Истина;
					КонецЕсли;
				Иначе
					ОбновитьДеревоСчетов();
					ИзменитьСтрокиДерева = Ложь;
				КонецЕсли;
			КонецЕсли;

			Если ИзменитьСтрокиДерева Тогда
				
				Если НовыеПараметры.ИскатьСтроки И НЕ НайденаНоваяСтрока Тогда
					ОтборСтрок = НовыйОтборСтрокДереваСчетов("БанковскийСчет", "БанковскийСчет", НовыеПараметры.Значение);
					Идентификатор = -1;
					НайтиСтрокуДереваСчетов(ЭтотОбъект, ДеревоСчета.ПолучитьЭлементы(), ОтборСтрок, Идентификатор);
					НоваяСтрока = ДеревоСчета.НайтиПоИдентификатору(Идентификатор);
				Иначе
					НоваяСтрока =  ДеревоСчета.НайтиПоИдентификатору(НовыеПараметры.НоваяСтрока);
				КонецЕсли; 
				
				Если ТекущаяСтрока.ЭтоПрогноз Тогда
					РезультатПоиска = НайтиСтрокуПрогноз(НоваяСтрока, ТекущаяСтрока);
					ЭтоПрогноз = Истина;
				Иначе
					ЭтоПрогноз = Ложь;	
					//РезультатПоиска = НайтиСтрокуВидаДанных(НоваяСтрока, ТекущаяСтрока.ВидДанных);
					РезультатПоиска = НайтиСтрокуРасходПоступление(НоваяСтрока, ТекущаяСтрока.ВидДанных);
				КонецЕсли;
				
				Если НЕ РезультатПоиска = Неопределено Тогда
					
					// добавляем с группировку расход новую строку и переносим данные
					РасходПоступлениеКоллекция = РезультатПоиска.ПолучитьЭлементы();
					Если ВРег(ТекущаяСтрока.ПолучитьРодителя().ИмяГруппировки) = ВРег("ДокументПланирования") Тогда
						
						ГруппировкаКоллекции = Неопределено;
						Для каждого СтрокаКоллекции Из РасходПоступлениеКоллекция Цикл
							Если ТекущаяСтрока.ПолучитьРодителя().Измерение = СтрокаКоллекции.Измерение Тогда
								ГруппировкаКоллекции = СтрокаКоллекции.ПолучитьЭлементы();
								НоваяСтрокаДокумент = ГруппировкаКоллекции.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумент, ТекущаяСтрока);
								Прервать;
							КонецЕсли; 
						КонецЦикла; 
						
						Если ГруппировкаКоллекции = Неопределено Тогда
							НоваяСтрокаДокумент = РасходПоступлениеКоллекция.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумент, ТекущаяСтрока.ПолучитьРодителя());
							СтрокаПозиция = НоваяСтрокаДокумент.ПолучитьЭлементы().Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаПозиция,ТекущаяСтрока);
							НоваяСтрокаДокумент.Сумма 		= ТекущаяСтрока[НовыеПараметры.ПолеОбъектаСтарыйПериод];
							НоваяСтрокаДокумент.СуммаФакт 	= 0;
						КонецЕсли; 
					Иначе	
						НоваяСтрокаДокумент = РасходПоступлениеКоллекция.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумент, ТекущаяСтрока);
					КонецЕсли;
					
					Сумма = ТекущаяСтрока[НовыеПараметры.ПолеОбъектаСтарыйПериод];
					
					// чтобы не задвоить при последующих пересчетах в дереве
					НоваяСтрокаДокумент[НовыеПараметры.ПолеОбъектаСтарыйПериод] = 0;
					НоваяСтрокаДокумент.БанковскийСчет = РезультатПоиска.БанковскийСчет;
					
					// выполняем расчеты в верхних группировках
				    ИзменитьВерхниеСтроки(ТекущаяСтрока, НовыеПараметры.ПолеОбъектаСтарыйПериод, 
						Сумма, -1, ЭтоПрогноз, ЗнакРасходПоступление,, Истина);
					ИзменитьВерхниеСтроки(НоваяСтрокаДокумент,НовыеПараметры.ПолеОбъектаНовыйПериод,
						Сумма, 1, ЭтоПрогноз, ЗнакРасходПоступление, Истина, Истина);

					// удаляем исходную строку
					РодительИсходная  = ТекущаяСтрока.ПолучитьРодителя();
					КоллекцияИсходная = РодительИсходная.ПолучитьЭлементы();
					ИндексИсходная = КоллекцияИсходная.Индекс(ТекущаяСтрока);
					КоллекцияИсходная.Удалить(ИндексИсходная);
					Если ВРег(РодительИсходная.ИмяГруппировки) = ВРег("ДокументПланирования") 
						И КоллекцияИсходная.Количество() = 0 Тогда
					
						РодительПредыдущий = РодительИсходная.ПолучитьРодителя();
						КоллекцияПредыдущая = РодительПредыдущий.ПолучитьЭлементы();
						ИндексРодителя = КоллекцияПредыдущая.Индекс(РодительИсходная);
						КоллекцияПредыдущая.Удалить(ИндексРодителя);
					КонецЕсли; 
					Если АктивизироватьСтроку Тогда
							Элементы.ДеревоСчета.ТекущаяСтрока = НоваяСтрокаДокумент.ПолучитьИдентификатор();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ПанельАналитическаяВидимость Тогда
			ОбновитьАналитическуюПанель();
		КонецЕсли; 
	КонецЕсли; // Выполнена запись пл. позиции	

КонецПроцедуры

&НаСервере 
Процедура ИзменитьВерхниеСтроки(СтрокаИсходная, ПолеДанных, Сумма, Знак, ЭтоПрогноз = Ложь, ЗнакРасходПоступление = 1, ЭтоНовая = Ложь, ИзмененСчет = Ложь)

	ИмяОперДень = ИмяКолонкиПериод("П", ТекущийДень);
	
	ИзменитьЗначение(СтрокаИсходная, ПолеДанных, Сумма, Знак);
	
	Если ВРег(СтрокаИсходная.ПолучитьРодителя().ИмяГруппировки) = ВРег("ДокументПланирования") Тогда
		
		СтрИсходнаяРодитель = СтрокаИсходная.ПолучитьРодителя();
		ИзменитьЗначение(СтрИсходнаяРодитель,ПолеДанных,Сумма,Знак);
		Если ИзмененСчет Тогда
			ИзменитьЗначение(СтрИсходнаяРодитель,"Сумма",Сумма,Знак);
			Если ЭтоНовая Тогда
				ИзменитьЗначение(СтрИсходнаяРодитель,"СуммаФакт",0,Знак);
			КонецЕсли; 
		КонецЕсли; 
		
		СтрокаИсходнаяВидДанных = СтрокаИсходная.ПолучитьРодителя().ПолучитьРодителя();
	Иначе
		СтрокаИсходнаяВидДанных = СтрокаИсходная.ПолучитьРодителя();
	КонецЕсли; 
	
	//в строке расход/поступление суммы плюсуются, без учета знака расхода/поступления
	ИзменитьЗначение(СтрокаИсходнаяВидДанных,ПолеДанных,Сумма,Знак);
	
	Если ИзмененСчет Тогда
		ИзменитьЗначение(СтрокаИсходнаяВидДанных,"Сумма",Сумма,Знак);
	КонецЕсли; 
	
	СтрокаИсходнаяБанкСчет      = СтрокаИсходнаяВидДанных.ПолучитьРодителя();
	СтрокаИсходнаяДенежныйПоток = НайтиСтрокуВида(СтрокаИсходнаяБанкСчет,Перечисления.бит_ВидыДанныхРабочееМестоКазначея.ДенежныйПоток);
	ИзменитьЗначение(СтрокаИсходнаяДенежныйПоток,ПолеДанных,Сумма,Знак*ЗнакРасходПоступление);
	Если ИзмененСчет Тогда
	    ИзменитьЗначение(СтрокаИсходнаяДенежныйПоток,"Сумма",Сумма,Знак*ЗнакРасходПоступление);
	КонецЕсли; 
	
	Для каждого Элемент Из КолонкиПериодов Цикл
		ТекИмя	  = Элемент.Представление;
		Выполнять = (ПолеДанных >= ИмяОперДень);
		
		Если Выполнять И ТекИмя > ПолеДанных И ТекИмя > ИмяОперДень И ЗначениеЗаполнено(СтрокаИсходнаяБанкСчет.БанковскийСчет) Тогда
			ИзменитьЗначение(СтрокаИсходнаяБанкСчет, ТекИмя, Сумма, ЗнакРасходПоступление * Знак);
		КонецЕсли; 
	КонецЦикла; // по периодам
	
КонецПроцедуры // ИзменитьВерхниеСтроки()

&НаСервере 
Функция НайтиСтрокуПрогноз(ТекущаяСтрока, ИсходнаяСтрока=Неопределено)

	СтрокаПрогноз = Неопределено;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		Если ВРег(ТекущаяСтрока.ИмяГруппировки) = ВРег("БанковскийСчет") Тогда
			
			СтрокаРасход = НайтиСтрокуВида(ТекущаяСтрока,Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Расход);
			СтрокаПрогноз = НайтиСтрокуВида(СтрокаРасход,Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Прогноз);
			
		ИначеЕсли ВРег(ТекущаяСтрока.ИмяГруппировки) = ВРег("ВидДанных") Тогда	
			
			СтрокаБанкСчет = ТекущаяСтрока.ПолучитьРодителя();
			
			СтрокаРасход = НайтиСтрокуВида(СтрокаБанкСчет,Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Расход);
			СтрокаПрогноз = НайтиСтрокуВида(СтрокаРасход,Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Прогноз);
			
		ИначеЕсли ВРег(ТекущаяСтрока.ИмяГруппировки) = ВРег("ДокументПланирования") Тогда
			
			СтрокаВидДанных = ТекущаяСтрока.ПолучитьРодителя();
			
			Если НЕ СтрокаВидДанных = Неопределено Тогда
				
				Если СтрокаВидДанных.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Прогноз Тогда
					
					СтрокаПрогноз = СтрокаВидДанных;
					
				ИначеЕсли СтрокаВидДанных.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Расход Тогда
					
					СтрокаРасход = СтрокаВидДанных;
					СтрокаПрогноз = НайтиСтрокуВида(СтрокаРасход,Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Прогноз);
					
				Иначе
					
					СтрокаБанкСчет = СтрокаВидДанных.ПолучитьРодителя();
					СтрокаРасход = НайтиСтрокуВида(СтрокаБанкСчет,Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Расход);
					СтрокаПрогноз = НайтиСтрокуВида(СтрокаРасход,Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Прогноз);
					
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;  // Имя группировки		
	КонецЕсли; // Есть текущая строка 

	Возврат СтрокаПрогноз;
	
КонецФункции

&НаСервере
Функция НайтиСтрокуВида(СтрокаБанкСчет,ВидДанных)
// ++ NB Дублируется в модуле менеджера
	СтрокаВидДанных = Неопределено;
	ВидыДанных = СтрокаБанкСчет.ПолучитьЭлементы();
	Для каждого ТекСтрока  Из ВидыДанных Цикл		
		Если ТекСтрока.ВидДанных = ВидДанных Тогда
		
			СтрокаВидДанных = ТекСтрока;
			Прервать;
			
		КонецЕсли; 		
	КонецЦикла;	

	Возврат СтрокаВидДанных;
	
КонецФункции // НайтиСтрокуДенежныйПоток()

&НаСервере
Процедура ИзменитьЗначение(Контейнер,ИмяСвойства,ЗначениеСвойства,Знак)
	
	Если НЕ Контейнер = Неопределено Тогда
		
		 Контейнер[ИмяСвойства] = Контейнер[ИмяСвойства]+Знак*ЗначениеСвойства;
		
	КонецЕсли; 	
	
КонецПроцедуры // ИзменитьЗначение()
 
&НаСервере
Процедура ВыполнитьГрупповоеИзменениеРеквизитов(ПараметрыИзменения)
	
	// Поддерживается изменение Даты, БанковскогоСчета.
	Индекс = 0;
	Для каждого ТекущиеПараметры Из ПараметрыИзменения Цикл		
		ПрименитьИзмененияРеквизитовДокумента(ТекущиеПараметры, Индекс = ПараметрыИзменения.ВГраница());	
		Индекс = Индекс + 1;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Функция ОтборСпискаДляПереносаНаСчет(ТекстСообщения, Отказ)

	Организации = Новый Массив(); 
	Валюты 	    = Новый Массив(); 
	ВидыДС 	    = Новый Массив(); 
	
    ВыделенныеСтроки = Элементы.ДеревоСчета.ВыделенныеСтроки;	
	Для каждого ИдСтроки Из ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = ДеревоСчета.НайтиПоИдентификатору(ИдСтроки);
		Если НЕ ТекущаяСтрока = Неопределено И ТекущаяСтрока.ИмяГруппировки = "ДокументПланирования" Тогда
			Если Организации.Найти(ТекущаяСтрока.Организация) = Неопределено Тогда
				Организации.Добавить(ТекущаяСтрока.Организация);
			КонецЕсли;
			Если Валюты.Найти(ТекущаяСтрока.ВалютаДенежныхСредств) = Неопределено Тогда
				Валюты.Добавить(ТекущаяСтрока.ВалютаДенежныхСредств);
			КонецЕсли; 			
			Если ВидыДС.Найти(ТекущаяСтрока.ВидДенежныхСредств) = Неопределено Тогда
				ВидыДС.Добавить(ТекущаяСтрока.ВидДенежныхСредств);
			КонецЕсли; 			
		КонецЕсли; 
	
	КонецЦикла; 
	
	Ошибки = Новый Массив; 
	// Диагностика ошибок.
	Если Организации.Количество() > 1 Тогда
		Ошибки.Добавить(НСтр("ru='Изменение организации не поддерживается.';en='Changing the organization is not supported.'"));
	КонецЕсли; 
	
	Если Валюты.Количество() > 1 Тогда
		Ошибки.Добавить(НСтр("ru='Изменение валюты не поддерживается.';en='Change Currency is not supported.'")); 
	КонецЕсли; 
	
	Если ВидыДС.Количество() > 1 Тогда
		Ошибки.Добавить(НСтр("ru='Изменение вида денежных средств (нал/безнал) не поддерживается.';
							 |en='Changing the type of funds (cash / non-cash payment) is not supported.'")); 
	КонецЕсли;
	
	Если Организации.Количество() = 0 ИЛИ Валюты.Количество() = 0 Тогда
		Ошибки.Добавить(НСтр("ru='Для текущей строки операция не поддерживается.';en='For the current line is not supported.'")); 
	КонецЕсли; 
	
	Если ВидыДС.Количество() > 0
	   И ВидыДС[0] = ПредопределенноеЗначение("Перечисление.бит_ВидыДенежныхСредств.Наличные") Тогда
		Ошибки.Добавить(НСтр("ru='Для ""наличных"" операция не поддерживается.';en='For ""cash"" is not supported.'")); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Отказ 		   = Истина;	
		ТекстСообщения = СтрСоединить(Ошибки, Символы.ПС);
	КонецЕсли;

	Отбор = Новый Структура(); 
	Если НЕ Отказ Тогда
		Отбор.Вставить("Владелец", Организации[0]);
		Отбор.Вставить("ВалютаДенежныхСредств", Валюты[0]);
	КонецЕсли; 
	
	Возврат Отбор;
	
КонецФункции

&НаСервере
Процедура ОчиститьИнформационныеПоля()
	
	ТекДокументШапка.ПолучитьЭлементы().Очистить();
	ТекДокументТаблица.Очистить();
	ПолеТабДокументаИнформация.Очистить();
	ПолеТабДокументаАнализ.Очистить();
	
КонецПроцедуры // ОчиститьИнформационныеПоля()

&НаСервере
Процедура ДействияПриАктивизацииСтроки()

	ОчиститьИнформационныеПоля();
	
	// Выведем информацию о текущем документе.
	Если ЗначениеЗаполнено(ТекущийДокумент) И ПанельТекущийДокументВидимость  Тогда
		ОбновитьТекущийДокумент();
	КонецЕсли; 

	// Выводим отчет в аналитическую панель.
	Если ПанельАналитическаяВидимость Тогда
		ОбновитьАналитическуюПанель();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекущийДокумент()
	
	МассивДокументов = Новый Массив;
	
	// Если ТекущийДокумент число, значит это групповое поле заявки/поступления.
	Если ТипЗнч(ТекущийДокумент) = Тип("Число") Тогда
		ТекЭл = ДеревоСчета.НайтиПоИдентификатору(ТекущийДокумент);
		ТекущийДокумент = ТекЭл.Измерение;
		Для каждого ЭлДерева Из ТекЭл.ПолучитьЭлементы() Цикл
			МассивДокументов.Добавить(ЭлДерева.ПлатежнаяПозиция);
		КонецЦикла; 
	Иначе	
		МассивДокументов.Добавить(ТекущийДокумент);
	КонецЕсли; 
	
	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция")
		ИЛИ ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивДокументов",МассивДокументов);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Позиция.ЦФО КАК ЦФО,
		|	Позиция.СтатьяОборотов КАК СтатьяОборотов,
		|	Позиция.Контрагент КАК Контрагент,
		|	Позиция.ОбъектРасчетов КАК ДоговорКонтрагента,
		|	Позиция.Аналитика_1 КАК Аналитика_1,
		|	Позиция.Аналитика_2 КАК Аналитика_2,
		|	Позиция.Аналитика_3 КАК Аналитика_3,
		|	Позиция.Аналитика_4 КАК Аналитика_4,
		|	Позиция.Аналитика_5 КАК Аналитика_5,
		|	Позиция.Аналитика_6 КАК Аналитика_6,
		|	Позиция.Аналитика_7 КАК Аналитика_7,
		|	Позиция.Аналитика_8 КАК Аналитика_8,
		|	Позиция.Аналитика_9 КАК Аналитика_9,
		|	Позиция.Аналитика_10 КАК Аналитика_10,
		|	Позиция.Аналитика_11 КАК Аналитика_11,
		|	Позиция.Аналитика_12 КАК Аналитика_12,
		|	Позиция.Ссылка КАК Позиция,
		|	Позиция.Важность КАК Важность,
		|	Позиция.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	Позиция.Сценарий КАК Сценарий,
		|	Позиция.ДатаПлан КАК ДатаПлан,
		|	Позиция.НазначениеПлатежа КАК НазначениеПлатежа,
		|	Позиция.СверхБюджета КАК СверхБюджета,
		|	Позиция.ДатаПланКрайняя КАК ДатаПланКрайняя,
		|	Позиция.ТипПлатежа КАК ТипПлатежа
		|ИЗ
		|	Документ.бит_кзн_ПлатежнаяПозиция КАК Позиция
		|ГДЕ
		|	Позиция.Ссылка В(&МассивДокументов)";
		
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.бит_кзн_ПозицияПоступления")
		ИЛИ ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивДокументов",МассивДокументов);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Позиция.ЦФО КАК ЦФО,
		|	Позиция.СтатьяОборотов КАК СтатьяОборотов,
		|	Позиция.Контрагент КАК Контрагент,
		|	Позиция.Аналитика_1 КАК Аналитика_1,
		|	Позиция.Аналитика_2 КАК Аналитика_2,
		|	Позиция.Аналитика_3 КАК Аналитика_3,
		|	Позиция.Аналитика_4 КАК Аналитика_4,
		|	Позиция.Аналитика_5 КАК Аналитика_5,
		|	Позиция.Аналитика_6 КАК Аналитика_6,
		|	Позиция.Аналитика_7 КАК Аналитика_7,
		|	Позиция.Аналитика_8 КАК Аналитика_8,
		|	Позиция.Аналитика_9 КАК Аналитика_9,
		|	Позиция.Аналитика_10 КАК Аналитика_10,
		|	Позиция.Аналитика_11 КАК Аналитика_11,
		|	Позиция.Аналитика_12 КАК Аналитика_12,
		|	Позиция.Ссылка КАК Позиция,
		|	Позиция.Важность КАК Важность,
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	Позиция.ДатаПлан КАК ДатаПлан,
		|	Позиция.НазначениеПлатежа КАК НазначениеПлатежа,
		|	Позиция.Номер КАК Номер,
		|	Позиция.Дата КАК Дата,
		|	Позиция.ДатаПланКрайняя КАК ДатаПланКрайняя,
		|	Позиция.ТипПлатежа КАК ТипПлатежа
		|ИЗ
		|	Документ.бит_кзн_ПозицияПоступления КАК Позиция
		|ГДЕ
		|	Позиция.Ссылка В(&МассивДокументов)";
					   
					   
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	ТабАналитика     = Результат.Выгрузить();
	КолонкиАналитика = ТабАналитика.Колонки;
	
	СтрокаШапка = ТабАналитика[0];
	
	КоличествоСтрок = ТабАналитика.Количество();
	
	КоллекцияВерх = ТекДокументШапка.ПолучитьЭлементы();
	КоллекцияВерх.Очистить();
	
	НастройкаОтображения = ПодготовитьНастройкиОтображенияШапка();
	
	Для каждого КиЗ Из НастройкаОтображения Цикл
		
		Если КоличествоСтрок > 1 И КиЗ.Ключ = "Аналитика" Тогда
			Продолжить;
		КонецЕсли; 
		
		ЭлементВерх = КоллекцияВерх.Добавить();
		ЭлементВерх.ИмяПараметра           = КиЗ.Ключ;
		ЭлементВерх.ПредставлениеПараметра = КиЗ.Ключ;
		ЭлементВерх.Жирный                 = Истина;
		
		КоллекцияГруппа = ЭлементВерх.ПолучитьЭлементы();
		
		Для каждого НастройкаПоля Из КиЗ.Значение Цикл
			
			ТекЗначение   = Неопределено;
			флЕстьКолонка = Ложь;
			Если НЕ ТабАналитика.Колонки.Найти(НастройкаПоля.Имя) = Неопределено Тогда
				
				ТекЗначение = СтрокаШапка[НастройкаПоля.Имя];
				флЕстьКолонка = Истина;
				
			КонецЕсли; 
			
			флВыводить = Истина;
			Если Найти(НастройкаПоля.УсловиеВывода,"Заполнено")>0 Тогда
				
				флВыводить = ЗначениеЗаполнено(ТекЗначение);
				
			КонецЕсли;
			
			Если Найти(НастройкаПоля.УсловиеВывода,"Шапка")>0 Тогда	 
				
				флВыводить = ФлВыводить И ?(КоличествоСтрок<=1,Истина,Ложь);
				
			КонецЕсли; 
			
			Если НЕ НастройкаПоля.ТипОбъекта = Неопределено Тогда
				
				флВыводить = флВыводить И (НастройкаПоля.ТипОбъекта = ТипЗнч(ТекущийДокумент));
				
			КонецЕсли; 
			
			Если флВыводить Тогда
				
				Элемент = КоллекцияГруппа.Добавить();
				Элемент.ИмяПараметра      = НастройкаПоля.Имя;
				Элемент.ПредставлениеПараметра = ?(ПустаяСтрока(НастройкаПоля.Синоним),НастройкаПоля.Имя,НастройкаПоля.Синоним);
				Элемент.ЗначениеПараметра = ТекЗначение;
				
				
			КонецЕсли; 
			
		КонецЦикла; // По настройкам группы.
		
	КонецЦикла;// По ключам групп настройки отображения. 
	
	// Выведем табличную часть, если это нужно.
	Если КоличествоСтрок>1 Тогда
		
		Элементы.ГруппаТекущийДокументТабЧасть.Видимость = Истина;
		
		ТекДокументТаблица.Очистить();
		
		Для каждого СтрокаАналитика Из ТабАналитика Цикл
			
			НоваяСтрока = ТекДокументТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаАналитика);
			
		КонецЦикла; 
		
		
	Иначе	
		
		Элементы.ГруппаТекущийДокументТабЧасть.Видимость = Ложь;
		
	КонецЕсли; 
	
	// Выведем дополнительную информацию
	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
		
		Элементы.ГруппаТекущийДокументИнформация.Видимость = Истина;
		ОбработкаОбъект = Обработки.бит_ИнформационнаяПанель.Создать();
		ОбработкаОбъект.Объект = ТекущийДокумент.ДокументПланирования;
		ОбработкаОбъект.ОбновитьИнформацию(ЭтотОбъект.ПолеТабДокументаИнформация);
		
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
		
		Элементы.ГруппаТекущийДокументИнформация.Видимость = Истина;
		ОбработкаОбъект = Обработки.бит_ИнформационнаяПанель.Создать();
		ОбработкаОбъект.Объект = ТекущийДокумент;
		ОбработкаОбъект.ОбновитьИнформацию(ЭтотОбъект.ПолеТабДокументаИнформация);
	
	Иначе
		
		Элементы.ГруппаТекущийДокументИнформация.Видимость = Ложь;
		
	КонецЕсли; 
	

КонецПроцедуры // ОбновитьТекущийДокумент()

&НаСервере
Функция НастройкаПоляКонструктор(Имя,Синоним="",УсловиеВывода="",ТипОбъекта = Неопределено)
	
	НастройкаПоля = Новый Структура("Имя,Синоним,УсловиеВывода,ТипОбъекта");
	НастройкаПоля.Имя           = Имя;
	НастройкаПоля.Синоним       = Синоним;
	НастройкаПоля.УсловиеВывода = УсловиеВывода;
	НастройкаПоля.ТипОбъекта    = ТипОбъекта;
	
	Возврат НастройкаПоля;
	
КонецФункции // НастройкаПоляКонструктор()

&НаСервере
Функция ПодготовитьНастройкиОтображенияШапка()

	НастройкаОтображения = Новый Структура;
	
	// Группа аналитика.
	НастройкаГруппы = Новый Массив;
	НастройкаГруппы.Добавить(НастройкаПоляКонструктор("ЦФО",,"Заполнено/Шапка"));
	НастройкаГруппы.Добавить(НастройкаПоляКонструктор("СтатьяОборотов","Статья оборотов","Заполнено/Шапка"));
	НастройкаГруппы.Добавить(НастройкаПоляКонструктор("Контрагент",,"Заполнено/Шапка"));
	НастройкаГруппы.Добавить(НастройкаПоляКонструктор("ДоговорКонтрагента","Договор контрагента","Заполнено/Шапка"));
	
	// Настройки произвольных аналитик.
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	СовпадающиеАналитики = Документы.бит_кзн_ПлатежнаяПозиция.НайтиАналитикиСовпадающиеСРеквизитами(ТекущийДокумент.Метаданные());
	
	Для каждого КиЗ Из НастройкиИзмерений Цикл
		
		Если СовпадающиеАналитики.Получить(КиЗ.Ключ) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		ИмяПоля =	КиЗ.Ключ;
		Синоним = КиЗ.Значение.Синоним;
		НастройкаГруппы.Добавить(НастройкаПоляКонструктор(ИмяПоля,Синоним,"Заполнено/Шапка"));
	
	КонецЦикла; 
	
	НастройкаОтображения.Вставить("Аналитика",НастройкаГруппы);
	
	// Группа реквизиты.
	НастройкаГруппы = Новый Массив;
	НастройкаГруппы.Добавить(НастройкаПоляКонструктор("Важность",,"Заполнено"));
	НастройкаГруппы.Добавить(НастройкаПоляКонструктор("ДатаПлан","Дата платежа","Заполнено"));
	НастройкаГруппы.Добавить(НастройкаПоляКонструктор("ХозяйственнаяОперация","Хозяйственная операция","Заполнено"));
	НастройкаГруппы.Добавить(НастройкаПоляКонструктор("ТипПлатежа","Тип платежа","Заполнено"));
	НастройкаГруппы.Добавить(НастройкаПоляКонструктор("СверхБюджета","Сверх бюджета",,Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция")));
	//НастройкаГруппы.Добавить(НастройкаПоляКонструктор("ДатаПланКрайняя","не позднее","Заполнено"));
	
	НастройкаОтображения.Вставить("Реквизиты",НастройкаГруппы);
	

	// Группа прочее.
	НастройкаГруппы = Новый Массив;
	НастройкаГруппы.Добавить(НастройкаПоляКонструктор("НазначениеПлатежа","Назначение платежа"));
	
	НастройкаОтображения.Вставить("Прочее",НастройкаГруппы);
	
	Возврат НастройкаОтображения;
	
КонецФункции // ПодготовитьНастройкиОтображенияШапка()

&НаСервере
Процедура ОбновитьАналитическуюПанель()
	
	Если ТипЗнч(ТекущиеПараметры) = Тип("Структура") 
		И ТекущиеПараметры.Свойство("ИмяГруппировки")
		И (ТекущиеПараметры.ИмяГруппировки = "Организация" 
		ИЛИ ТекущиеПараметры.ИмяГруппировки = "ВидДенежныхСредств") Тогда 
		
		ПолеТабДокументаАнализ.Очистить();
		Возврат; 
		
	КонецЕсли;
	
	СКД = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанныхАнализ);
		
	ПараметрНачалоПериода = НайтиПараметрДанных(Объект.КомпоновщикАнализ,"НачалоПериода");
	ПараметрКонецПериода  = НайтиПараметрДанных(Объект.КомпоновщикАнализ,"КонецПериода");
	
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = Объект.НачалоПериода;
	КонецЕсли; 
	
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецДня(Объект.КонецПериода);
	КонецЕсли; 
	
	// Устанавливаем отборы исходя из текущего положения в дереве.
	ОтборБанковскийСчет     = Неопределено;
	ОтборВалюта             = Неопределено;
	ОтборВидДенежныхСредств = Неопределено;
	Для каждого ЭлементОтбора Из Объект.КомпоновщикАнализ.Настройки.Отбор.Элементы Цикл
		
		Если Строка(ЭлементОтбора.ЛевоеЗначение) = "БанковскийСчет" Тогда
			ОтборБанковскийСчет = ЭлементОтбора;
		ИначеЕсли Строка(ЭлементОтбора.ЛевоеЗначение) = "Валюта" Тогда
			ОтборВалюта = ЭлементОтбора;
		ИначеЕсли Строка(ЭлементОтбора.ЛевоеЗначение) = "ВидДенежныхСредств" Тогда
			ОтборВидДенежныхСредств = ЭлементОтбора;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если НЕ ОтборБанковскийСчет = Неопределено Тогда
		
		ОтборБанковскийСчет.Использование = Истина;
		ОтборБанковскийСчет.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		Если ТипЗнч(ТекущиеПараметры) = Тип("Структура") 
			  И ТекущиеПараметры.Свойство("БанковскийСчет") 
			  И ТипЗнч(ТекущиеПараметры.БанковскийСчет) = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций") Тогда
			  
			ОтборБанковскийСчет.ПравоеЗначение= ТекущиеПараметры.БанковскийСчет;
		Иначе	
		    ОтборБанковскийСчет.Использование = Ложь;			
			ОтборБанковскийСчет.ПравоеЗначение= Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ОтборВалюта = Неопределено Тогда
		
		ОтборВалюта.Использование  = Истина;
		ОтборВалюта.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		Если ТипЗнч(ТекущиеПараметры) = Тип("Структура") 
			 И ТекущиеПараметры.Свойство("ВалютаДенежныхСредств") Тогда
			         
		  ОтборВалюта.ПравоеЗначение = ТекущиеПараметры.ВалютаДенежныхСредств;     
		  
	    Иначе	
		  ОтборВалюта.ПравоеЗначение = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ОтборВидДенежныхСредств = Неопределено Тогда
		
		Если ТипЗнч(ТекущиеПараметры) = Тип("Структура") 
			И ТекущиеПараметры.Свойство("БанковскийСчет") 
			И ТипЗнч(ТекущиеПараметры.БанковскийСчет) = Тип("Строка") Тогда	
			
			ОтборВидДенежныхСредств.Использование = Истина;
			ОтборВидДенежныхСредств.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
			ОтборВидДенежныхСредств.ПравоеЗначение= Перечисления.бит_ВидыДенежныхСредств.Наличные;		
			
		Иначе
			ОтборВидДенежныхСредств.Использование = Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	// Из схемы возьмем настройки по умолчанию
	Настройки = Объект.КомпоновщикАнализ.ПолучитьНастройки();		
	
	// Проконтролируем параметры которые пользователь может менять самостоятельно.
	
	// Отключить использование периодичности нельзя.
	ПараметрПериодичность = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Периодичность"));
	
	Если НЕ ПараметрПериодичность = Неопределено
		И НЕ ПараметрПериодичность.Использование Тогда
		
		ПараметрПериодичность.Использование = Истина;
		ПараметрПериодичность.Значение = 6;
		
	КонецЕсли;
	
	// Помещаем в переменную данные о расшифровке данных.
	ДанныеРасшифровки1 = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	// Формируем макет, с помощью компоновщика макета.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	// Передаем в макет компоновки схему, настройки и данные расшифровки.
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки1);
	
	// Выполним компоновку с помощью процессора компоновки.
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки1);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ПолеТабДокументаАнализ);
	
	АдресДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки1, УникальныйИдентификатор);
	
	ПолеТабДокументаАнализ.Очистить();
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры // ОбновитьАналитическуюПанель()

&НаСервере
Функция РазбитьПлатеж(ИдСтроки,СуммаНачальная,СуммаНовая)

	ДействиеВыполнено = Ложь;
	
	ТекущаяСтрока = ДеревоСчета.НайтиПоИдентификатору(ИдСтроки);
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ДатаПлатежа  = ТекущаяДатаСеанса();
		ТипДокумента = ТипЗнч(ТекущаяСтрока.ПлатежнаяПозиция);
		Если ТипДокумента = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
			ДействиеВыполнено = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.РазбитьПозицию(ТекущаяСтрока.ПлатежнаяПозиция,
									СуммаНачальная, СуммаНовая, ДатаПлатежа);
		Иначе
			ДействиеВыполнено = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.РазбитьПозицию(ТекущаяСтрока.ПлатежнаяПозиция,
									СуммаНачальная, СуммаНовая, ДатаПлатежа);
		КонецЕсли;
	КонецЕсли; 
	
	Возврат ДействиеВыполнено;

КонецФункции

&НаСервере
Функция ИзменитьПлатеж(ИдСтроки, СуммаНачальная, СуммаНовая)
	
	ДействиеВыполнено = Ложь;
	
	ТекущаяСтрока = ДеревоСчета.НайтиПоИдентификатору(ИдСтроки);
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		ДокОбъект = ТекущаяСтрока.ПлатежнаяПозиция.ПолучитьОбъект();
		
		ДокОбъект.СуммаДокумента = СуммаНовая;
		ЗначениеСтавки     = бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(ДокОбъект.СтавкаНДС);	
		ДокОбъект.СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(ДокОбъект.СуммаДокумента
																		  	,Истина
																			,Истина
																			,ЗначениеСтавки);
																		
		ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьКонтрольПревышенияБюджета", Истина);
		ДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокОбъект,РежимЗаписиДокумента.Проведение,,"Ошибки");
	КонецЕсли; 
	
	Возврат ДействиеВыполнено;
	
КонецФункции

&НаКлиенте
Процедура ОтметитьТекущие()
	
	КоллекцияОрганизации = ДеревоСчета.ПолучитьЭлементы();
	
	Для каждого ТекЭлемент Из КоллекцияОрганизации Цикл
		ТекЭлемент.Выполнять = 0;
		ОтметитьТекущиеФлажки(ТекЭлемент);
	КонецЦикла; 
 
КонецПроцедуры // ОтметитьТекущие()

&НаКлиенте
Процедура ОтметитьТекущиеФлажки(ЭлементВерх)
	
	Коллекция = ЭлементВерх.ПолучитьЭлементы();
	
	Для каждого ТекЭлемент Из Коллекция Цикл
		
		// Отмечаем платежные позиция в оперативном дне.
		
		Если ТекЭлемент.ДоступностьФлажка Тогда
			
			Если ТекЭлемент.ИмяГруппировки = "ДокументПланирования"
				И ЗначениеЗаполнено(ТекЭлемент.ПлатежнаяПозиция)
				И ТекЭлемент.ДатаПлан = Объект.ОперативныйДень Тогда
				
				ТекЭлемент.Выполнять = 1;
				ПересчитатьЗначенияВыделенныхДокументов(ТекЭлемент.Выполнять, ТекЭлемент.Сумма, ТекЭлемент.ПлатежнаяПозиция);
			Иначе
				ТекЭлемент.Выполнять = 0;
			КонецЕсли; 
			
			ПереопределитьФлагРодителя(ТекЭлемент);
			
		КонецЕсли; 
		
		ОтметитьТекущиеФлажки(ТекЭлемент);
	КонецЦикла; 
	
 КонецПроцедуры // ИзменитьФлажки()

&НаСервере
Функция ПолучитьНастройкуКонтроляДатыПлатежаКрайней(текОрганизация)

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", текОрганизация);
	
	КонтрольКрайнейДатыПлатежа = бит_НастройкиПрограммы.КонтролироватьКрайнююДатуПлатежа(СтруктураПараметров, НачалоДня(ТекущаяДатаСеанса()));
	СинхронизацияДатыПлатежа   = Истина;
	
	Возврат ?(КонтрольКрайнейДатыПлатежа = Перечисления.бит_ВидыКонтроляДатыПлатежа.Предупреждать, Истина, Ложь);
	
КонецФункции // ПолучитьНастройкуКонтроляДатыПлатежаКрайней()

&НаКлиенте 
Процедура ПереопределитьФлагРодителя(ЭлементВерх)
	
	Если ЭлементВерх.ИмяГруппировки = "ДокументПланирования" 	
		И ЗначениеЗаполнено(ЭлементВерх.ПлатежнаяПозиция)
		И (ТипЗнч(ЭлементВерх.Измерение) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция")
		ИЛИ ТипЗнч(ЭлементВерх.Измерение) = Тип("ДокументСсылка.бит_кзн_ПозицияПоступления")) Тогда
		
		Родитель = ЭлементВерх.ПолучитьРодителя();
		
		Если Родитель.ИмяГруппировки = "ДокументПланирования" 	
			И ЗначениеЗаполнено(Родитель.Измерение)Тогда
			
			Коллекция = Родитель.ПолучитьЭлементы();
			КолВоПлатежей = Коллекция.Количество();
			КВыполнению = 0;
			Для каждого ТекЭлемент Из Коллекция Цикл
				КВыполнению = КВыполнению + ТекЭлемент.Выполнять;
			КонецЦикла; 
			
			Если КВыполнению = 0 Тогда
				Родитель.Выполнять = 0;
			ИначеЕсли КолВоПлатежей = КВыполнению Тогда
				Родитель.Выполнять = 1
			Иначе
				Родитель.Выполнять = 2;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьМассивОплаты(ЭлементВерх,МассивОплата, Команда)

	Коллекция = ЭлементВерх.ПолучитьЭлементы();

	Для каждого ТекЭлемент Из Коллекция Цикл
		
		Если ТекЭлемент.Выполнять > 0	
		  И ТекЭлемент.ИмяГруппировки = "ДокументПланирования" 
		  И НЕ ТекЭлемент.Оплачено Тогда
		  
			Если ЗначениеЗаполнено(ТекЭлемент.ПлатежнаяПозиция) Тогда
			 	МассивОплата.Добавить(ТекЭлемент.ПолучитьИдентификатор());
			Иначе 
			 	МассивОплата.Добавить(ТекЭлемент.ПолучитьИдентификатор());
				Продолжить;
			КонецЕсли;   
		КонецЕсли; 
	 
		СформироватьМассивОплаты(ТекЭлемент, МассивОплата, Команда);
	 
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция СоздатьСтруктуруЗаполнения(Прогноз, ИД)

 	ЭлементДерева = ДеревоСчета.НайтиПоИдентификатору(ИД);
	
	СтруктураЗаполнения = Новый Структура;
	
	СтруктураЗаполнения.Вставить("Организация", ЭлементДерева.Организация);
	СтруктураЗаполнения.Вставить("ВалютаДокумента", ЭлементДерева.ВалютаДенежныхСредств);
	СтруктураЗаполнения.Вставить("ФормаОплаты", ЭлементДерева.ВидДенежныхСредств);
	
	Если Прогноз Тогда
	
		СтруктураЗаполнения.Вставить("ВидПлана", ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.Прогноз"));
	
	Иначе 
		СтруктураЗаполнения.Вставить("ВидПлана", ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.План"));
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ЭлементДерева.ВидДенежныхСредств) 
		И ЭлементДерева.ВидДенежныхСредств = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
	
		СтруктураЗаполнения.Вставить("БанковскийСчет", ЭлементДерева.БанковскийСчет);
		СтруктураЗаполнения.Вставить("Касса", Справочники.Кассы.ПустаяСсылка());
	
	ИначеЕсли ЗначениеЗаполнено(ЭлементДерева.ВидДенежныхСредств) 
		И ЭлементДерева.ВидДенежныхСредств = Перечисления.бит_ВидыДенежныхСредств.Наличные Тогда	
		
		СтруктураЗаполнения.Вставить("Касса", ЭлементДерева.БанковскийСчет);
		СтруктураЗаполнения.Вставить("БанковскийСчет", Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка());
		
	Иначе

		СтруктураЗаполнения.Вставить("Касса", Справочники.Кассы.ПустаяСсылка());
		СтруктураЗаполнения.Вставить("БанковскийСчет", Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка());
		
	КонецЕсли; 
	
	Возврат СтруктураЗаполнения;
	
КонецФункции // СоздатьСтруктуруЗаполнения()

&НаКлиентеНаСервереБезКонтекста
Процедура ДополнитьСписокЗначений(Приемник, Источник)

	Для каждого Элемент Из Источник Цикл
		ЗаполнитьЗначенияСвойств(Приемник.Добавить(), Элемент);	
	КонецЦикла; 
	
КонецПроцедуры 

&НаСервере
Функция ВыходныеИПраздничныеДни()
	
	ВыходныеИПраздничныеДни = Новый Массив; 
	
	Если НЕ Объект.ВыделятьВыходныеДни ИЛИ НЕ ЗначениеЗаполнено(КолонкиПериодов) Тогда
		Возврат ВыходныеИПраздничныеДни; 	
	КонецЕсли;
		
	НачалоПериода = КолонкиПериодов[0].Значение;
	КонецПериода  = КолонкиПериодов[КолонкиПериодов.Количество() - 1].Значение;

	Календарь = бит_НастройкиПрограммы.Календарь(Неопределено, НачалоПериода);
	
	Если НЕ ЗначениеЗаполнено(Календарь) Тогда
		Возврат ВыходныеИПраздничныеДни;
	КонецЕсли;
	
	ВидыДней = Новый Массив;
	ВидыДней.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота);
	ВидыДней.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье);
	ВидыДней.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Календарь", 	   Календарь);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	Запрос.УстановитьПараметр("ВидыДней",      ВидыДней);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабКалендарь.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ТабКалендарь
	|ГДЕ
	|	ТабКалендарь.ПроизводственныйКалендарь = &Календарь
	|	И ТабКалендарь.ВидДня В(&ВидыДней)
	|	И ТабКалендарь.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВыходныеИПраздничныеДни.Добавить(Выборка.Дата);
	КонецЦикла; 

	Возврат ВыходныеИПраздничныеДни;
	
КонецФункции

&НаСервере
Функция НайтиСтрокуРасходПоступление(ТекущаяСтрока, ВидПеречисления)

	СтрокаРасходПоступление = Неопределено;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		Если ВРег(ТекущаяСтрока.ИмяГруппировки) = ВРег("БанковскийСчет") Тогда
			
			СтрокаРасходПоступление = НайтиСтрокуВида(ТекущаяСтрока,ВидПеречисления);
			
		ИначеЕсли ВРег(ТекущаяСтрока.ИмяГруппировки) = ВРег("ВидДанных") Тогда	
			
			СтрокаБанкСчет = ТекущаяСтрока.ПолучитьРодителя();
			СтрокаРасходПоступление = НайтиСтрокуВида(СтрокаБанкСчет,ВидПеречисления);
			
		ИначеЕсли ВРег(ТекущаяСтрока.ИмяГруппировки) = ВРег("ДокументПланирования") Тогда
			
			Если ВРег(ТекущаяСтрока.ПолучитьРодителя().ПолучитьРодителя().ИмяГруппировки) = ВРег("ВидДанных") Тогда 
			
				СтрокаВидДанных = ТекущаяСтрока.ПолучитьРодителя().ПолучитьРодителя();
			
			ИначеЕсли ВРег(ТекущаяСтрока.ПолучитьРодителя().ПолучитьРодителя().ПолучитьРодителя().ИмяГруппировки) = ВРег("ВидДанных") Тогда
				
				СтрокаВидДанных = ТекущаяСтрока.ПолучитьРодителя().ПолучитьРодителя().ПолучитьРодителя();
				
			Иначе
				
				СтрокаВидДанных = ТекущаяСтрока.ПолучитьРодителя();
				
			КонецЕсли; 
			
			Если НЕ СтрокаВидДанных = Неопределено Тогда
				
				Если СтрокаВидДанных.ВидДанных = ВидПеречисления Тогда
					
					СтрокаРасходПоступление = СтрокаВидДанных;
					
				// начало добавления 15.02.2012
				ИначеЕсли СтрокаВидДанных.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Прогноз Тогда
					СтрокаРасходПоступление = СтрокаВидДанных.ПолучитьРодителя();
				// конец добавления 15.02.2012
				
				Иначе
					
					СтрокаБанкСчет = СтрокаВидДанных.ПолучитьРодителя();
					СтрокаРасходПоступление = НайтиСтрокуВида(СтрокаБанкСчет,ВидПеречисления);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;  // имя группировки
		
	КонецЕсли; // Есть текущая строка 

	Возврат СтрокаРасходПоступление;
	
КонецФункции // НайтиСтрокуРасход()

&НаСервере
Процедура СформироватьПлатежныеДокументы(ВыделенныеСтроки)
	 	
	// Хранятся заявки на перемещения для которых создались платежные документы.
	ЗаявкиНаПеремещение = Новый Массив;
	
	РезультатРаботы = Новый Массив; 
	
	Для каждого Элемент Из ВыделенныеСтроки Цикл

		ЭлементДерева = ДеревоСчета.НайтиПоИдентификатору(Элемент);
		Если ЭлементДерева = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
	
		Если ЭлементДерева.ПолучитьЭлементы().Количество() > 1 Тогда
			
			ПлатежныеПозиции = Новый Массив;
			Для каждого СтрокаТаблицы Из ЭлементДерева.ПолучитьЭлементы() Цикл
				Если СтрокаТаблицы.Выполнять > 0 Тогда
					СуммаВзаиморасчетов = СтрокаТаблицы.Сумма;
					Если СтрокаТаблицы.ПлатежнаяПозиция.ВалютаДокумента <> СтрокаТаблицы.ВалютаДенежныхСредств Тогда
						СуммаВзаиморасчетов = СтрокаТаблицы.ПлатежнаяПозиция.СуммаДокумента;										
					КонецЕсли;

					АтрибутыПозиции = Новый Структура("Позиция, Сумма", 
												СтрокаТаблицы.ПлатежнаяПозиция, СуммаВзаиморасчетов);
					ПлатежныеПозиции.Добавить(АтрибутыПозиции);
				КонецЕсли; 
			КонецЦикла;
			
			Если ЭлементДерева.ВидДенежныхСредств = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
				РежимЗаписи = Объект.РежимЗаписиРасчетыЧерезБанк;
			Иначе	
				РежимЗаписи = Объект.РежимЗаписиРасчетыЧерезКассу;
			КонецЕсли;
					
			Если ТипЗнч(ЭлементДерева.Измерение) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
				ДанныеЗаполнения = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.НовыеПараметрыДокументаСоздатьПлатежныеДокументы(); 
				ДанныеЗаполнения.Дата		 				  = ДатаОплаты;
				ДанныеЗаполнения.РежимЗаписи 				  = РежимЗаписи;
				
				Для каждого АтрибутыПозиции Из ПлатежныеПозиции Цикл
					ЗаполнитьЗначенияСвойств(ДанныеЗаполнения.Позиции.Добавить(), АтрибутыПозиции);
				КонецЦикла;
				Результат = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.СоздатьДокументыНаОсновеВыделенных(
								ЭлементДерева.Измерение, ДанныеЗаполнения);
				ДокументОплаты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат.ВыгрузитьКолонку("ДокументОплаты"));			
				РезультатРаботы.Добавить(ДокументОплаты);				
			Иначе 
				
				ДанныеЗаполнения = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.НовыеПараметрыДокументаСоздатьПлатежныеДокументы(); 
				ДанныеЗаполнения.Дата		 = ДатаОплаты;
				ДанныеЗаполнения.РежимЗаписи = РежимЗаписи;
				
				Для каждого АтрибутыПозиции Из ПлатежныеПозиции Цикл
					ЗаполнитьЗначенияСвойств(ДанныеЗаполнения.Позиции.Добавить(), АтрибутыПозиции);
				КонецЦикла;
				Результат = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.СоздатьДокументыНаОсновеВыделенных(
								ЭлементДерева.Измерение, ДанныеЗаполнения);
				ДокументОплаты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат.ВыгрузитьКолонку("ДокументОплаты"));			
				РезультатРаботы.Добавить(ДокументОплаты);				
			КонецЕсли; 
				
		ИначеЕсли ТипЗнч(ЭлементДерева.Измерение) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") Тогда  
			
			Если ЗаявкиНаПеремещение.Найти(ЭлементДерева.Измерение) = Неопределено Тогда
				Если ЭлементДерева.ВидДенежныхСредств = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
					РежимЗаписи = Объект.РежимЗаписиРасчетыЧерезБанк;
				Иначе	
					РежимЗаписи = Объект.РежимЗаписиРасчетыЧерезКассу;
				КонецЕсли;
				
				ПараметрыДокумента = бит_Казначейство.НовыеПараметрыСозданияПлатежногоДокумента();
				ПараметрыДокумента.ВызовИзРеестра	 = Ложь;
				ПараметрыДокумента.ДокументОснование = ЭлементДерева.Измерение;
				ПараметрыДокумента.СуммаКОплате      = ЭлементДерева.Сумма;
				ПараметрыДокумента.РежимЗаписи       = РежимЗаписи;

				Результат = Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.СоздатьПлатежныйДокументНаОсновании(ПараметрыДокумента);
					
				ЗаявкиНаПеремещение.Добавить(ЭлементДерева.Измерение);
				РезультатРаботы.Добавить(Результат);
			КонецЕсли; 
			
		ИначеЕсли ТипЗнч(ЭлементДерева.Измерение) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию") Тогда  
			
			Если ЗаявкиНаПеремещение.Найти(ЭлементДерева.Измерение) = Неопределено Тогда
				Если ЭлементДерева.ВидДенежныхСредств = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
					РежимЗаписи = Объект.РежимЗаписиРасчетыЧерезБанк;
				Иначе	
					РежимЗаписи = Объект.РежимЗаписиРасчетыЧерезКассу;
				КонецЕсли;

				ПараметрыДокумента = бит_Казначейство.НовыеПараметрыСозданияПлатежногоДокумента();
				ПараметрыДокумента.ВызовИзРеестра	 = Истина;
				ПараметрыДокумента.ДокументОснование = ЭлементДерева.Измерение;
				ПараметрыДокумента.СуммаКОплате      = ЭлементДерева.Сумма;
				ПараметрыДокумента.РежимЗаписи       = РежимЗаписи;
				ЗначениеРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементДерева.Измерение,
																				"СтавкаНДС, СуммаНДС");
				ПараметрыДокумента.СтавкаНДС         = ЗначениеРеквизитов.СтавкаНДС;
				ПараметрыДокумента.СуммаНДС          = ЗначениеРеквизитов.СуммаНДС;
				
				Результат = Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.СоздатьПлатежныйДокументНаОсновании(
								ПараметрыДокумента);
				ЗаявкиНаПеремещение.Добавить(ЭлементДерева.Измерение);
				РезультатРаботы.Добавить(Результат);
			КонецЕсли; 
			
		Иначе 
						
			Если ЗначениеЗаполнено(ЭлементДерева.ПлатежнаяПозиция) Тогда
				ПлатежнаяПозиция = ЭлементДерева.ПлатежнаяПозиция;
			Иначе
				ПодчиненыеСтроки = ЭлементДерева.ПолучитьЭлементы();
				ПлатежнаяПозиция = ПодчиненыеСтроки[0].ПлатежнаяПозиция;
			КонецЕсли;
			
			Если ЭлементДерева.Измерение.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда					
				БанковскийСчетКасса = ПлатежнаяПозиция.БанковскийСчет;					
			ИначеЕсли ЭлементДерева.Измерение.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Наличные Тогда	
				БанковскийСчетКасса = ПлатежнаяПозиция.Касса;					
			КонецЕсли;
			
			КурсыВалют = Новый Структура("ВалютаДокумента, ВалютаПлатежа", 
							ПлатежнаяПозиция.ВалютаДокумента, ЭлементДерева.ВалютаДенежныхСредств);
							
			СуммаВзаиморасчетов = ЭлементДерева.Сумма;
			
			Если ПлатежнаяПозиция.ВалютаДокумента <> ЭлементДерева.ВалютаДенежныхСредств Тогда
				СуммаВзаиморасчетов = ПлатежнаяПозиция.СуммаДокумента;										
			КонецЕсли;
			
			АтрибутыПозиции  = Новый Структура("Позиция, Сумма", ПлатежнаяПозиция, СуммаВзаиморасчетов);
			ПлатежныеПозиции = Новый Массив;
			ПлатежныеПозиции.Добавить(АтрибутыПозиции);
			
			ПараметрыФормирования = Новый Структура;
			ПараметрыФормирования.Вставить("Дата", 				  ДатаОплаты);
			ПараметрыФормирования.Вставить("БанковскийСчетКасса", БанковскийСчетКасса);
			ПараметрыФормирования.Вставить("Позиции",			  ПлатежныеПозиции);
			
			ПараметрыДокументов = Новый Массив;
			ПараметрыДокументов.Добавить(ПараметрыФормирования);
			
			Если ЭлементДерева.ВидДенежныхСредств = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
				РежимЗаписи = Объект.РежимЗаписиРасчетыЧерезБанк;
			Иначе	
				РежимЗаписи = Объект.РежимЗаписиРасчетыЧерезКассу;
			КонецЕсли;
			
			ПараметрыОплаты = Новый Структура;
			ПараметрыОплаты.Вставить("Позиция", ПлатежнаяПозиция);
			ПараметрыОплаты.Вставить("Сумма", СуммаВзаиморасчетов);
			
			ПараметрыДокументов = Новый Массив;
			ПараметрыДокументов.Добавить(ПараметрыОплаты);

			Если ТипЗнч(ЭлементДерева.Измерение) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств")
				ИЛИ ТипЗнч(ЭлементДерева.Измерение) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
				
				ДанныеЗаполнения = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.НовыеПараметрыДокументаСоздатьПлатежныеДокументы(); 
				ДанныеЗаполнения.Дата		 = ДатаОплаты;
				ДанныеЗаполнения.РежимЗаписи = РежимЗаписи;

				НоваяСтрока = ДанныеЗаполнения.Позиции.Добавить();
				НоваяСтрока.Позиция = ПлатежнаяПозиция;
				НоваяСтрока.Сумма 	= СуммаВзаиморасчетов;
				
				Результат = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.СоздатьДокументыНаОсновеВыделенных(
								ЭлементДерева.Измерение, ДанныеЗаполнения);
				РезультатРаботы.Добавить(Результат.ВыгрузитьКолонку("ДокументОплаты"));				
			Иначе
				
				ДанныеЗаполнения = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.НовыеПараметрыДокументаСоздатьПлатежныеДокументы(); 
				ДанныеЗаполнения.Дата		 = ДатаОплаты;
				ДанныеЗаполнения.РежимЗаписи = РежимЗаписи;
				
				НоваяСтрока = ДанныеЗаполнения.Позиции.Добавить();
				НоваяСтрока.Позиция = ПлатежнаяПозиция;
				НоваяСтрока.Сумма 	= СуммаВзаиморасчетов;
				
				Результат = Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.СоздатьДокументыНаОсновеВыделенных(
								ЭлементДерева.Измерение, ДанныеЗаполнения);
				РезультатРаботы.Добавить(Результат.ВыгрузитьКолонку("ДокументОплаты"));				
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 

	Для каждого Элемент Из РезультатРаботы Цикл
		НовыеДокументы = Новый Массив; 
		Если ТипЗнч(Элемент) = Тип("Массив") Тогда
			НовыеДокументы = Элемент; 	
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элемент, "МассивДокументов") Тогда 	
			НовыеДокументы = Элемент.МассивДокументов;
		КонецЕсли;
		Для каждого НовыйДокумент Из НовыеДокументы Цикл
			СписокДокументовДвиженияДС.Добавить(НовыйДокумент.Ссылка);
		КонецЦикла; 
	КонецЦикла; 
	
	ОбновитьДеревоСчетов();	 
	 
 КонецПроцедуры

&НаСервере
Функция ИзменитьЗаявку(ИдСтроки, СуммаНовая, Разбить)
	
	ДействиеВыполнено = Ложь;
	ОсталосьЗаплатить = 0;
	
	ТекущаяСтрока = ДеревоСчета.НайтиПоИдентификатору(ИдСтроки);
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат ДействиеВыполнено;	
	КонецЕсли; 
	
	Заявка		   = ТекущаяСтрока.Измерение;
	БанковскийСчет = ТекущаяСтрока.ПолучитьРодителя().БанковскийСчет;
	ФормаОплаты    = ТекущаяСтрока.ПолучитьРодителя().ВидДенежныхСредств;
	
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Заявка", Заявка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланируемыйРасходДенежныхСредств.Позиция КАК Позиция,
		|	ПланируемыйРасходДенежныхСредств.СуммаОстаток КАК СуммаДокумента
		|ИЗ
		|	РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств.Остатки(, ДокументПланирования = &Заявка) 
		|		КАК ПланируемыйРасходДенежныхСредств";
		РезультатЗапроса = Запрос.Выполнить();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.бит_кзн_ПлатежнаяПозиция");
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка","Позиция");
		Блокировка.Заблокировать();
		
		ПлатежныеПозиции = РезультатЗапроса.Выгрузить();
		
		Если Разбить Тогда
			ОсталосьЗаплатить = ПлатежныеПозиции.Итог("СуммаДокумента") - СуммаНовая;
		КонецЕсли;
		
		Отказ 		 = Ложь;
		Коэффициенты = ПлатежныеПозиции.ВыгрузитьКолонку("СуммаДокумента");
		Суммы 		 = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СуммаНовая, 
							Коэффициенты, 2);
		ПлатежныеПозиции.ЗагрузитьКолонку(Суммы, "СуммаДокумента");	
		
		ПлатежнаяПозиция = Неопределено;
		
		Для каждого СтрокаТаблицы Из ПлатежныеПозиции Цикл
			
			ПлатежнаяПозиция = СтрокаТаблицы.Позиция;
			ДокОбъект        = ПлатежнаяПозиция.ПолучитьОбъект();
			
			ДокОбъект.СуммаДокумента = СтрокаТаблицы.СуммаДокумента;
			ЗначениеСтавки     = бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(ДокОбъект.СтавкаНДС);	
			ДокОбъект.СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(ДокОбъект.СуммаДокумента,
									Истина, Истина, ЗначениеСтавки);
									
			Если ДокОбъект.ВалютаДокумента = ДокОбъект.ВалютаВзаиморасчетов Тогда
				ДокОбъект.СуммаВзаиморасчетов = ДокОбъект.СуммаДокумента;
			Иначе
				Данные = Новый Структура;
				Данные.Вставить("Сумма", 						 ДокОбъект.СуммаДокумента);
				Данные.Вставить("КурсЧислительВзаиморасчетов",	 ДокОбъект.КурсЧислительВзаиморасчетов);
				Данные.Вставить("КурсЗнаменательВзаиморасчетов", ДокОбъект.КурсЗнаменательВзаиморасчетов);
				Данные.Вставить("СуммаВзаиморасчетов",			 ДокОбъект.СуммаВзаиморасчетов);
				
				ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
					Данные, ДокОбъект.ВалютаДокумента, Константы.ВалютаРегламентированногоУчета.Получить());
				
				ДокОбъект.СуммаВзаиморасчетов = Данные.СуммаВзаиморасчетов; 		
			КонецЕсли;
		
			ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьКонтрольПревышенияБюджета", Истина);
			ДокОбъект.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
			
			Успех = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокОбъект,РежимЗаписиДокумента.Проведение,,"Ошибки");
			Если НЕ Успех Тогда
				ТекстСообщения = НСтр("ru='Не удалось изменить документ %1.';en='Failed to change document %1.'"); 
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.Позиция);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СтрокаТаблицы.Позиция,,,Отказ);
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		
		Если НЕ Отказ Тогда
			Если ОсталосьЗаплатить > 0 Тогда
				Если ПлатежнаяПозиция <> Неопределено Тогда
					ДокОбъект = ПлатежнаяПозиция.Скопировать();
				Иначе
					ВызватьИсключение НСтр("ru = 'Не определен документ-позиция'"); // ++ NB  
					ДокОбъект = Документы.бит_кзн_ПлатежнаяПозиция.СоздатьДокумент();
				КонецЕсли;
				ДанныеЗаполнения = Новый Структура;
				ДанныеЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());
				ДанныеЗаполнения.Вставить("ДатаПлан", ТекущаяДатаСеанса());
				ДанныеЗаполнения.Вставить("ДокументПланирования", Заявка);
				ДанныеЗаполнения.Вставить("СуммаДокумента", ОсталосьЗаплатить);
				
				Если ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Наличные Тогда
					ДанныеЗаполнения.Вставить("Касса", БанковскийСчет);
				Иначе	
					ДанныеЗаполнения.Вставить("БанковскийСчет", БанковскийСчет);
				КонецЕсли;
				
				ДокОбъект.Заполнить(ДанныеЗаполнения);
				ДокОбъект.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
				
				Если ДокОбъект.ВалютаДокумента = ДокОбъект.ВалютаВзаиморасчетов Тогда
					ДокОбъект.СуммаВзаиморасчетов = ДокОбъект.СуммаДокумента;
				Иначе
					Данные = Новый Структура;
					Данные.Вставить("Сумма", 						 ДокОбъект.СуммаДокумента);
					Данные.Вставить("КурсЧислительВзаиморасчетов",	 ДокОбъект.КурсЧислительВзаиморасчетов);
					Данные.Вставить("КурсЗнаменательВзаиморасчетов", ДокОбъект.КурсЗнаменательВзаиморасчетов);
					Данные.Вставить("СуммаВзаиморасчетов",			 ДокОбъект.СуммаВзаиморасчетов);
					
					ДенежныеСредстваКлиентСервер.РассчитатьСуммуВзаиморасчетовВСтрокеРасшифровки(
						Данные, ДокОбъект.ВалютаДокумента, Константы.ВалютаРегламентированногоУчета.Получить());
					
					ДокОбъект.СуммаВзаиморасчетов = Данные.СуммаВзаиморасчетов; 		
				КонецЕсли;

				Успех = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокОбъект,РежимЗаписиДокумента.Проведение,,"Ошибки");
				Если НЕ Успех Тогда
					ТекстСообщения = НСтр("ru='Не удалось записать новый документ.';en='Failed to write a new document.'"); 
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Отказ Тогда
			ОтменитьТранзакцию();
		Иначе	
			ЗафиксироватьТранзакцию();
		КонецЕсли; 
		ДействиеВыполнено = НЕ Отказ;
		
	Исключение
		ОтменитьТранзакцию();

		ТекстСообщения = НСтр("ru = 'Не удалось заблокировать документ для изменения.'; 
							  |en = 'The document could not be blocked for editing.'"); 
		ВызватьИсключение ТекстСообщения;
	КонецПопытки; 
	
	Возврат ДействиеВыполнено;
	
КонецФункции

 &НаСервереБезКонтекста 
 Функция ЗначениеРеквизитаОбъектаСервер(Ссылка, ИмяРеквизита);
 	
 	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);	
 	
 КонецФункции

 &НаСервере
Функция СформироватьСтруктуруПозиций(МассивОплата)

	СтрПозиций = Новый Массив;
	МассивЗаявокНаПеремещение = Новый Массив;
	Для каждого Элемент Из МассивОплата Цикл
	 
	 	ЭлементДерева = ДеревоСчета.НайтиПоИдентификатору(Элемент);
		
		Если НЕ ЭлементДерева = Неопределено Тогда

			Если ТипЗнч(ЭлементДерева.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств")
				ИЛИ ТипЗнч(ЭлементДерева.ДокументПланирования) = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
			
				Продолжить;
			ИначеЕсли ЗначениеЗаполнено(ЭлементДерева.ПлатежнаяПозиция) И ЭлементДерева.Выполнять > 0 Тогда 
				Разрешено = ПроверитьВозможностьГрупповойОплаты(ЭлементДерева.ПлатежнаяПозиция);
				Если Разрешено Тогда
					
					СуммаВзаиморасчетов = ЭлементДерева.Сумма;
					Если ЭлементДерева.ПлатежнаяПозиция.ВалютаДокумента <> ЭлементДерева.ВалютаДенежныхСредств Тогда
						СуммаВзаиморасчетов = ЭлементДерева.ПлатежнаяПозиция.СуммаДокумента;										
					КонецЕсли;

					Структура = Новый Структура;
					Структура.Вставить("ПлатежнаяПозиция", ЭлементДерева.ПлатежнаяПозиция);
					Структура.Вставить("СуммаКОплате"	 , СуммаВзаиморасчетов);
					СтрПозиций.Добавить(Структура);
				КонецЕсли; 
			Иначе 
				
				Для каждого Эл Из ЭлементДерева.ПолучитьЭлементы() Цикл
					Если Эл.Выполнять > 0 Тогда
						Разрешено = ПроверитьВозможностьГрупповойОплаты(Эл.ПлатежнаяПозиция);
						Если Разрешено Тогда
							СуммаВзаиморасчетов = Эл.Сумма;
							Если Эл.ПлатежнаяПозиция.ВалютаДокумента <> Эл.ВалютаДенежныхСредств Тогда
								СуммаВзаиморасчетов = Эл.ПлатежнаяПозиция.СуммаДокумента;										
							КонецЕсли;
							Структура = Новый Структура;
							Структура.Вставить("ПлатежнаяПозиция", Эл.ПлатежнаяПозиция);
							Структура.Вставить("СуммаКОплате"	 , СуммаВзаиморасчетов);
							СтрПозиций.Добавить(Структура);
						КонецЕсли; 
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрПозиций;
	
КонецФункции // СформироватьСтруктуруПозиций()

&НаСервере
Функция ПроверитьВозможностьГрупповойОплаты(ПлатежнаяПозиция)

	ПарамВидимости = бит_Казначейство.ПодготовитьПараметрыВидимости(ПлатежнаяПозиция.ХозяйственнаяОперация);
	
	Разрешено = Ложь;
	Если ПарамВидимости.ЕстьКонтрагент Тогда
		Если ЗначениеЗаполнено(ПлатежнаяПозиция.Контрагент) Тогда
			Разрешено = Истина;
		Иначе	
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", "Заполнение", 
								НСтр("ru = 'Получатель'; en = 'Recipient'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ПлатежнаяПозиция, "Контрагент");				
		КонецЕсли;
	КонецЕсли;
	
	Возврат Разрешено;
	
КонецФункции // ПроверитьВозможностьГрупповойОплаты()

&НаСервере
Функция СохраняемыеНастройки()

	МетаОбъект       = Метаданные.Обработки.бит_РабочееМестоКазначея;
	Исключения = Новый Массив;
	Исключения.Добавить("Компоновщик");
	Исключения.Добавить("КомпоновщикАнализ");	
	Исключения.Добавить("ОперативныйДень");
	
	СохраняемыеНастройки = Справочники.бит_СохраненныеНастройки.УпаковатьРеквизиты(Объект, МетаОбъект, Исключения);
	СохраняемыеНастройки.Вставить("НастройкиКомпоновщика"      ,Объект.Компоновщик.ПользовательскиеНастройки);
	СохраняемыеНастройки.Вставить("НастройкиКомпоновщикаАнализ",Объект.КомпоновщикАнализ.ПользовательскиеНастройки);
	
	Возврат СохраняемыеНастройки;
	
КонецФункции

&НаСервере
Процедура ПрименитьНастройки(ВыбНастройка)
	
	Если ЗначениеЗаполнено(ВыбНастройка) Тогда
		СтруктураНастроек = ВыбНастройка.ХранилищеНастроек.Получить();
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			МетаОбъект       = Метаданные.Обработки.бит_РабочееМестоКазначея;
			МассивИсключений = Новый Массив;
			МассивИсключений.Добавить("Компоновщик");
			МассивИсключений.Добавить("КомпоновщикАнализ");			
			МассивИсключений.Добавить("ОперативныйДень");
			
			Справочники.бит_СохраненныеНастройки.РаспаковатьРеквизиты(Объект,МетаОбъект,СтруктураНастроек,МассивИсключений);
			Если СтруктураНастроек.Свойство("НастройкиКомпоновщика") Тогда
				Объект.Компоновщик.ЗагрузитьПользовательскиеНастройки(СтруктураНастроек.НастройкиКомпоновщика);
			КонецЕсли; 
			
			Если СтруктураНастроек.Свойство("НастройкиКомпоновщикаАнализ") Тогда
				Объект.КомпоновщикАнализ.ЗагрузитьПользовательскиеНастройки(СтруктураНастроек.НастройкиКомпоновщикаАнализ);
			КонецЕсли; 
		КонецЕсли; // Сохранена структура.
	КонецЕсли; // Настройка заполнена.
	
	ТекущаяНастройка = ВыбНастройка;

	Объект.РежимОстатков = Константы.бит_кзн_РежимОтображенияОстатковДС.Получить();

	УстановитьЗаголовокФормы(ЭтотОбъект);
	
КонецПроцедуры // ПрименитьНастройки()

&НаСервере
Функция ПолучитьНастройкиПриСозданииНаСервере()
	
	// Получим настройку по умолчанию.
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(КэшЗначений.НастраиваемыйОбъект);
	
	Возврат НастройкаПоУмолчанию;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДатаСоСдвигом(Дата, Периодичность, НачалоПериода = Истина)
	
	Если Периодичность = ПредопределенноеЗначение("Перечисление.бит_кзн_ПериодичностьРМК.Неделя") Тогда
		Если НачалоПериода Тогда
			НоваяДата = НачалоНедели(Дата);
		Иначе	
			НоваяДата = КонецНедели(Дата);
		КонецЕсли;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.бит_кзн_ПериодичностьРМК.Месяц") Тогда
		Если НачалоПериода Тогда
			НоваяДата = НачалоМесяца(Дата);
		Иначе	
			НоваяДата = КонецМесяца(Дата);
		КонецЕсли;
	Иначе
		НоваяДата = Дата;
	КонецЕсли; 

	Возврат НоваяДата;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСформированныеДокументы(Результат) Экспорт

	СпискиДокументов = Новый Структура; 
	СпискиДокументов.Вставить("СписокДокументовДвижения", СписокДокументовДвиженияДС.ВыгрузитьЗначения());
	СпискиДокументов.Вставить("СписокРеестры",        	  СписокРеестры.ВыгрузитьЗначения());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СпискиДокументов", СпискиДокументов);
	
	ОткрытьФорму("Обработка.бит_РабочееМестоКазначея.Форма.СформированныеДокументы", ПараметрыФормы,,
		ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиДокументовОплаты(СозданоРанее, ВсегоСоздано)

	УстановитьВидимостьДекорацияПерейтиКСформированнымДокументам(ЭтотОбъект);	
	
	НовыхДокументов = ВсегоСоздано - СозданоРанее;
	ТекстСообщения  = НСтр("ru = 'Записано документов: %1.'; en = 'Recorded documents: %1.'"); 
	ТекстСообщения  = СтрШаблон(ТекстСообщения, Формат(НовыхДокументов, "ЧДЦ=0"));
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	
	Если Элементы.ДекорацияПерейтиКСформированнымДокументам.Видимость И НовыхДокументов > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Записаны платежные документы.'; en = 'Payment documents recorded.'");
		Подсказка	   = НСтр("ru = 'Перейти к документам ...'; en = 'Go to documents ...'"); 
		ПоказатьОповещениеПользователя(ТекстСообщения, 
			Новый ОписаниеОповещения("ПослеЗаписиДокументовОплатыЗавершение", ЭтотОбъект), Подсказка);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиДокументовОплатыЗавершение(Результат) Экспорт 

	ДекорацияПерейтиКДокументамОплатыНажатие(Неопределено);

КонецПроцедуры
 
#КонецОбласти
