#Область ПрограммныйИнтерфейс

// Возвращает строку ДокументСсылка.<Имя>, СправочникСсылка.<Имя>
//
// Параметры:
//   ИмяОбъектаКоллекции - Строка - Имя объект коллекции
//   ИмяОбъекта - Строка - Имя объекта
//   Язык - Строка - Код языка
//
// Возвращаемое значение:
//   Строка - Строка ссылочного типа метаданных
//
Функция ПолноеИмяТипаСсылка(ИмяОбъектаКоллекции, ИмяОбъекта = "", Язык = Неопределено) Экспорт

	СсылочныеКоллекции = ИТК_МетаданныеКлиентСерверПовтИсп.СсылочныеОбъектыМетаданных();
	Если СсылочныеКоллекции.Найти(ИмяОбъектаКоллекции) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПостфиксТипаСсылка = ИТК_ОбщийКлиентСервер.ПостфиксТипаСсылка();
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		
		Результат = СтрШаблон("%1%2.%3", ИмяОбъектаКоллекции, ПостфиксТипаСсылка, ИмяОбъекта);
		
	Иначе
		
		Результат = СтрШаблон("%1%2", ИмяОбъектаКоллекции, ПостфиксТипаСсылка);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоТипКлючЗаписиРегистраСведений(Тип) Экспорт
	
	Возврат СтрНачинаетсяС(Тип, "Регистр сведений ключ записи:");
	
КонецФункции

Функция ОбъектКлючЗаписиРегистра(Объект) Экспорт
	
	Тип = ТипЗнч(Объект);
	Возврат СтрНачинаетсяС(Тип, "Регистр сведений ключ записи:")
				ИЛИ СтрНачинаетсяС(Тип, "Регистр накопления ключ записи:")
				ИЛИ СтрНачинаетсяС(Тип, "Регистр расчета ключ записи:")
				ИЛИ СтрНачинаетсяС(Тип, "Регистр бухгалтерии ключ записи:");
	
КонецФункции

Функция ПредставлениеОбъектаИсточникаПодписки(Событие, ИмяКоллекции, Имя) Экспорт
	
	Дополнение = ИТК_МетаданныеКлиентСерверПовтИсп.ДополнениеКоллекцииИсточникаПодписки(Событие, ИмяКоллекции);
	Возврат СтрШаблон("%1 (%2)", Имя, Дополнение);
	
КонецФункции

Функция ЭтоПолноеИмяОбъекта(Имя) Экспорт
	
	Возврат Булево(СтрНайти(Имя, "."));
	
КонецФункции

Функция ОсновнойДополнительныйОбъектПоПолномуИмени(ПолноеИмя) Экспорт
	
	ЧастиПолногоИмени = СтрРазделить(ПолноеИмя, ".");
	
	Если ЧастиПолногоИмени.Количество() > 1 Тогда
		
		ЧастиОсновнойОбъект = Новый Массив;
		ЧастиОсновнойОбъект.Добавить(ЧастиПолногоИмени[0]);
		ЧастиОсновнойОбъект.Добавить(ЧастиПолногоИмени[1]);
		
		Индекс = 2;
		Пока Индекс <= ЧастиПолногоИмени.ВГраница() Цикл 
			
			ВозможноОбъектКоллекции = ЧастиПолногоИмени[Индекс];
			Если ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоПодсистема(ВозможноОбъектКоллекции) Тогда
				ЧастиОсновнойОбъект.Добавить(ВозможноОбъектКоллекции);
				ЧастиОсновнойОбъект.Добавить(ЧастиПолногоИмени[Индекс + 1]);
			Иначе
				
				Прервать;
				
			КонецЕсли;
			
			Индекс = Индекс + 2;
			
		КонецЦикла;
		ОсновнойОбъект = СтрСоединить(ЧастиОсновнойОбъект, ".");
		
		ЧастиДополнение = Новый Массив;
		Для Индекс = Индекс По ЧастиПолногоИмени.ВГраница() Цикл 
			ЧастиДополнение.Добавить(ЧастиПолногоИмени[Индекс]);
		КонецЦикла;
		Дополнение = СтрСоединить(ЧастиДополнение, ".");
		
	Иначе
		
		ОсновнойОбъект = ПолноеИмя;
		Дополнение = Неопределено;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ОсновнойОбъект", ОсновнойОбъект);
	Результат.Вставить("Дополнение", Дополнение);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеПраваДоступа(Имя) Экспорт
	
	ОписаниеПравДоступа = ИТК_МетаданныеКлиентСерверПовтИсп.СоответствиеОписаниеПравДоступа();
	Возврат ОписаниеПравДоступа.Получить(Имя);
	
КонецФункции

#КонецОбласти
