Процедура ПередЗаписью(Отказ)
	
	// бит_Финанс изменения кода. Начало.
	бит_ПередЗаписью(Отказ);
	// бит_Финанс изменения кода. Конец.
	
КонецПроцедуры

#Область БИТ_Финанс

Процедура бит_ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДополнительныеСвойства.Свойство("бит_ПропуститьПроверку") 
	 ИЛИ ДополнительныеСвойства.Свойство("КонвертацияФайлов") Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ бит_РазрешитьРедактироватьФайл(Отказ) Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

// Функция разрешает/запрещает редактировать файлы
//  в зависимости от статуса документа.
//
// Возвращаемое значение:
//  Результат – булево.
//
Функция бит_РазрешитьРедактироватьФайл(Отказ) 

	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(ВладелецФайла)
		ИЛИ НЕ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ВладелецФайла)) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	МетаданныеВладельца = ВладелецФайла.Метаданные();
	
	Если НЕ бит_ОбщегоНазначенияКлиентСервер.ЭтоОбъектБИТ(МетаданныеВладельца.Имя) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Если бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(Пользователи.ТекущийПользователь(), 
		ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноРедактироватьВложенияЗаблокированныхДокументов) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос        = Новый Запрос;
	Запрос.Текст  =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Статусы.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.бит_СтатусыОбъектов КАК Статусы
	|ГДЕ
	|	Статусы.Объект = &Ссылка
	|	И Статусы.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус)
	|	И Статусы.Статус.ЗапретИзмененияВложений";
	Запрос.УстановитьПараметр("Ссылка", ВладелецФайла);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекстСообщения = НСтр("ru='Изменение присоединенных файлов запрещено, документ находится в статусе %1.';
								|en='Changing attachments is forbidden, the document has the status %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Статус);
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения,,,Отказ);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
