#Область ПрограммныйИнтерфейс

Процедура ОбработатьКоманду(Форма, Имя, Поле = Неопределено) Экспорт
	
	Элементы = Форма.Элементы;
	Реквизит = ИТК_Строки.РазборПрочитатьДоСимвола(Имя, "_");
	Элемент = Элементы[Реквизит];
	
	Ссылка = ПроверяемоеЗначение(Форма, Элемент, Реквизит, Поле);
	
	Если СтрНайти(Имя, "УниверсальнаяФормаВыбора") Тогда
		
		ИТК_ФормаКлиент.ОткрытьДинамическийСписок(Ссылка, Элемент, Истина, Истина);
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Имя, "ОткрытьСсылку") Тогда
		
		ПоказатьЗначение(, Ссылка);
		
	ИначеЕсли СтрНайти(Имя, "ПоискСсылокНаОбъект") Тогда
		
		ИТК_ТуллкитКлиент.ОткрытьИнструмент(ИТК_Перечисления.ИнструментПоискСсылокНаОбъект(), Ссылка);
		
	ИначеЕсли СтрНайти(Имя, "РедакторОбъекта") Тогда
		
		ИТК_ТуллкитКлиент.ОткрытьИнструмент(ИТК_Перечисления.ИнструментРедакторОбъекта(), Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьЭлементы(Форма, Элемент, Поле = Неопределено) Экспорт
	
	Элементы = Форма.Элементы;
	Реквизит = Элемент.Имя;
	
	Ссылка = ПроверяемоеЗначение(Форма, Элемент, Реквизит, Поле);
	Если Ссылка = Неопределено Тогда
		
		ДоступностьОткрытьСсылку = Ложь;
		ДоступностьПоискСсылокНаОбъект = Ложь;
		ДоступностьРедактораОбъекта = Ложь;
		ДоступностьУниверсальнойФормыВыбора = Ложь;
		
	Иначе
		
		ЭтоСсылка = ИТК_ОбщийКлиентСервер.ЭтоСсылка(Ссылка, Истина) И ЗначениеЗаполнено(Ссылка);
		ЭтоРедактируемыйОбъект = ЭтоСсылка И НЕ ИТК_МетаданныеКлиентСервер.ЭтоТипКлючЗаписиРегистраСведений(ТипЗнч(Ссылка));
		
		ДоступностьОткрытьСсылку = ЭтоСсылка;
		ДоступностьПоискСсылокНаОбъект = ЭтоРедактируемыйОбъект;
		ДоступностьРедактораОбъекта = ЭтоРедактируемыйОбъект;
		ДоступностьУниверсальнойФормыВыбора = Истина;
		
	КонецЕсли;
	
	УстановитьДоступностьЭлемента(Элементы, ИТК_ПодключаемыеКомандыКлиентСервер.ОткрытьСсылкуИмяЭлемента(Реквизит), ДоступностьОткрытьСсылку);
	УстановитьДоступностьЭлемента(Элементы, ИТК_ПодключаемыеКомандыКлиентСервер.ПоискСсылокНаОбъектИмяЭлемента(Реквизит), ДоступностьПоискСсылокНаОбъект);
	УстановитьДоступностьЭлемента(Элементы, ИТК_ПодключаемыеКомандыКлиентСервер.РедакторОбъектаИмяЭлемента(Реквизит), ДоступностьРедактораОбъекта);
	УстановитьДоступностьЭлемента(Элементы, ИТК_ПодключаемыеКомандыКлиентСервер.УниверсальнаяФормаВыбораИмяЭлемента(Реквизит), ДоступностьУниверсальнойФормыВыбора);
	
КонецПроцедуры

Процедура ОбработатьКомандуРаботыСТаблицейЗначений(Форма, Имя, РеквизитОбъекта = Ложь) Экспорт
	
	// Инициализация вспомогателных данных
	Элементы = Форма.Элементы;
	ИмяКоллекции = ИТК_Строки.РазборПрочитатьДоСимвола(Имя, "_");
	Элемент = Элементы[ИмяКоллекции];
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если РеквизитОбъекта Тогда
		Коллекция = Форма.Объект[ИмяКоллекции];
	Иначе
		Коллекция = Форма[ИмяКоллекции];
	КонецЕсли;
	
	// Действие по команде
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ДополнительныеПараметры.Вставить("Коллекция", Коллекция);
		
	Если СтрНайти(Имя, ИТК_ПодключаемыеКомандыКлиентСервер.ИмяКомандыЗаполнитьКолонку()) Тогда
		
		Если ТекущиеДанные = Неопределено
				ИЛИ НЕ ЗначениеЗаполнено(Элемент.ВыделенныеСтроки) Тогда
			Возврат;
		КонецЕсли;
		
		ЭлементКолонка = Элемент.ТекущийЭлемент;
		ИмяКолонки = Сред(ЭлементКолонка.Имя, СтрДлина(Элемент.Имя) + 1);
		Значение = ТекущиеДанные[ИмяКолонки];
		
		ДопустимыеТипы = ЭлементКолонка.ДоступныеТипы;
		ДополнительныеПараметры.Вставить("ДопустимыеТипы", ДопустимыеТипы);
		
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗаполнениеКолонкиЗавершено", ЭтотОбъект, ДополнительныеПараметры);
		
		ИТК_ФормаКлиент.ОткрытьЗаполнениеКолонкиТаблицыЗначений(Форма, Значение, ИмяКолонки, ДопустимыеТипы, ОписаниеОповещенияОЗакрытии);
		
	ИначеЕсли СтрНайти(Имя, ИТК_ПодключаемыеКомандыКлиентСервер.ИмяКомандыПерейтиКСтрокеПоНомеру()) Тогда 
		
		Если НЕ ЗначениеЗаполнено(Коллекция) Тогда
			Возврат;
		КонецЕсли;

		КоличествоСтрок = Коллекция.Количество();
		НомерТекущейСтроки = Макс(0, Коллекция.Индекс(ТекущиеДанные)) + 1;
		
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВводНомераСтрокиЗавершен", ЭтотОбъект, ДополнительныеПараметры);
		ИТК_ФормаКлиент.ОткрытьВводНомераСтроки(Форма, КоличествоСтрок, НомерТекущейСтроки, ОписаниеОповещенияОЗакрытии);
		
	ИначеЕсли СтрНайти(Имя, ИТК_ПодключаемыеКомандыКлиентСервер.ИмяКомандыНайтиКолонку()) Тогда 
		
		Колонки = Новый СписокЗначений;
		Для Каждого ЭлементКолонка Из Элемент.ПодчиненныеЭлементы Цикл 
			
			ИмяКолонки = ИмяКолонкиКоллекцииТаблицы(Элемент, ЭлементКолонка);
			Если ИмяКолонки = "НомерСтроки" Тогда
				Продолжить;
			КонецЕсли;
			
			Колонки.Добавить(ИмяКолонки, ЭлементКолонка.Заголовок, , ЭлементКолонка.КартинкаШапки);

		КонецЦикла;
		
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПоискКолонкиЗавершен", ЭтотОбъект, ДополнительныеПараметры);
		ИмяТекущейКолонки = ИмяКолонкиКоллекцииТаблицы(Элемент, Элемент.ТекущийЭлемент);
		
		ИТК_ФормаКлиент.ОткрытьПоискКолонкиТаблицыЗначений(Форма, Колонки, ИмяТекущейКолонки, ОписаниеОповещенияОЗакрытии);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнениеКолонкиЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	Элемент = ДополнительныеПараметры.Элемент;
	Коллекция = ДополнительныеПараметры.Коллекция;
	
	Если Результат.Свойство("ЗаполнятьВсе") Тогда
		
		Для Каждого СтрокаТаблицы Из Коллекция Цикл 
			
			СтрокаТаблицы[Результат.Имя] = Результат.Значение;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого ИдентификаторСтроки Из Элемент.ВыделенныеСтроки Цикл 
			
			СтрокаТаблицы = Коллекция.НайтиПоИдентификатору(ИдентификаторСтроки);
			СтрокаТаблицы[Результат.Имя] = Результат.Значение;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Оповестить(ИТК_ПодключаемыеКомандыКлиентСервер.ИмяОповещенияЗаполненаКолонкаТаблицыЗначений(), Элемент);
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

Процедура ВводНомераСтрокиЗавершен(НомерСтроки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(НомерСтроки) <> Тип("Число") Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = ДополнительныеПараметры.Элемент;
	Коллекция = ДополнительныеПараметры.Коллекция;
	
	Элемент.ТекущаяСтрока = Коллекция[НомерСтроки - 1].ПолучитьИдентификатор();
	
КонецПроцедуры

Процедура ПоискКолонкиЗавершен(ИмяКолонки, ДополнительныеПараметры) Экспорт
	
	Если ИмяКолонки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	Элемент = ДополнительныеПараметры.Элемент;
	
	Элемент.ТекущийЭлемент = Форма.Элементы[ДополнительныеПараметры.Элемент.Имя + ИмяКолонки];
	
КонецПроцедуры

Процедура УстановитьДоступностьТаблицыЗначений(Форма, Имя, Доступность) Экспорт
	
	Элементы = Форма.Элементы;
	
	ИмяЭлемента = Имя + ИТК_ПодключаемыеКомандыКлиентСервер.ИмяКомандыЗаполнитьКолонку();
	
	Элементы[ИмяЭлемента + "КонтекстноеМеню"].Доступность = Доступность;
	Элементы[ИмяЭлемента + "КоманднаяПанель"].Доступность = Доступность;
	
	ИмяЭлемента = Имя + ИТК_ПодключаемыеКомандыКлиентСервер.ИмяКомандыПерейтиКСтрокеПоНомеру();
	
	Элементы[ИмяЭлемента + "КонтекстноеМеню"].Доступность = Доступность;
	Элементы[ИмяЭлемента + "КоманднаяПанель"].Доступность = Доступность;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверяемоеЗначение(Форма, Элемент, Реквизит, Знач Поле = Неопределено)
	
	Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
		
		Результат = Форма[Реквизит];
		
	ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаФормы") Тогда
		
		ТекущийЭлемент = Элемент.ТекущийЭлемент;
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущийЭлемент = Неопределено
				ИЛИ ТекущиеДанные = Неопределено Тогда
			
			Результат = Неопределено;
			
		Иначе	
			
			Если Поле = Неопределено Тогда
				Поле = Сред(ТекущийЭлемент.Имя, СтрДлина(Элемент.Имя) + 1);
			КонецЕсли;
				
			Результат = ТекущиеДанные[Поле];
			
		КонецЕсли;

	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьДоступностьЭлемента(Элементы, Имя, Доступность)
	
	Если Элементы.Найти(Имя) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы[Имя].Доступность = Доступность;
	
КонецПроцедуры

Функция ИмяКолонкиКоллекцииТаблицы(ЭлементКоллекция, ЭлементКолонка)
	
	Результат =	ИТК_Строки.УдалитьПрефикс(ЭлементКолонка.Имя, ЭлементКоллекция.Имя);
	Возврат Результат;
	
КонецФункции

#КонецОбласти