#Область ПрограммныйИнтерфейс

Процедура Открыть(ПараметрыВыполненияКоманды = Неопределено)  Экспорт
	
	Если ПараметрыВыполненияКоманды = Неопределено Тогда
		
		Источник = Неопределено;
		Уникальность = Неопределено;
		Окно = Неопределено;
		НавигационнаяСсылка = Неопределено;
		
	Иначе
		
		Источник = ПараметрыВыполненияКоманды.Источник;
		Уникальность = ПараметрыВыполненияКоманды.Уникальность;
		Окно = ПараметрыВыполненияКоманды.Окно;
		НавигационнаяСсылка = ПараметрыВыполненияКоманды.НавигационнаяСсылка;
		
	КонецЕсли;
	
	Параметры = Новый Структура;
	
	АктивноеОкно = АктивноеОкно();
	ЗаполнитьПараметры(АктивноеОкно, Параметры);
	
	ОткрытьФорму("Обработка.ИТК_ГлобальноеМеню.Форма", Параметры, Источник, Уникальность, Окно, НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПараметры(АктивноеОкно, Параметры)
	
	Если АктивноеОкно = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НавигационнаяСсылка = АктивноеОкно.ПолучитьНавигационнуюСсылку();
	ПоляОбъекта = Новый Массив;
	
	// Анализ полей объекта
	Для Каждого ОкноКлиентскогоПриложения Из АктивноеОкно.Содержимое Цикл 
		
		ТекущийЭлемент = ОкноКлиентскогоПриложения.ТекущийЭлемент;
		
		// Шаблон отчета на СКД в БСП
		Если ОкноКлиентскогоПриложения.ИмяФормы = ИТК_БСПКлиентСерверПовтИсп.ПолноеИмяФормыШаблонаОтчетаНаСКД()
				И ЗначениеЗаполнено(НавигационнаяСсылка) Тогда
			
			ДанныеФормыОтчетаНаСКД = ИТК_БСП.ДанныеФормыШаблонаОтчетаНаСКД(НавигационнаяСсылка);
			
			НавигационнаяСсылка = ДанныеФормыОтчетаНаСКД.НавигационнаяСсылка;
			ДобавитьПолеОбъекта(ПоляОбъекта, ДанныеФормыОтчетаНаСКД.ВариантОтчета);
			
		КонецЕсли;
		
		Если ТипЗнч(ТекущийЭлемент) = Тип("ПолеФормы") Тогда
			
			ВидПоля = ТекущийЭлемент.Вид;
			Если ВидПоля = ВидПоляФормы.ПолеВвода
					ИЛИ ВидПоля = ВидПоляФормы.ПолеНадписи Тогда
					
				ИмяРеквизитаОбъект = ИТК_ОбщийКлиентСервер.ИмяРеквизитаФормыОбъект();
				ДобавленоПолеОбъекта = ДобавитьПолеКоллекцииОбъектаСПопыткой(ПоляОбъекта, ОкноКлиентскогоПриложения, ТекущийЭлемент.Имя, ИмяРеквизитаОбъект);
				Если НЕ ДобавленоПолеОбъекта Тогда
					ДобавитьПолеКоллекцииОбъектаСПопыткой(ПоляОбъекта, ОкноКлиентскогоПриложения, ТекущийЭлемент.Имя);
				КонецЕсли;
				
			ИначеЕсли ВидПоля = ВидПоляФормы.ПолеТабличногоДокумента Тогда // Ячейки табличного документа

				Попытка
					ТабличныйДокумент = ОкноКлиентскогоПриложения[ТекущийЭлемент.Имя];
				Исключение
					Продолжить;
				КонецПопытки;

				ЗначенияРасшифровки = ИТК_ТабличныйДокументКлиент.ЗначенияРасшифровокВыделенныхОбластей(ТабличныйДокумент, ТекущийЭлемент);
				Попытка
					
					АдресДанныхРасшифровки = ОкноКлиентскогоПриложения["ОтчетДанныеРасшифровки"]; 
					ЗначенияРасшифровки = ИТК_ТабличныйДокумент.ЗначенияРасшифровокСЗаполнениеРасшифровокСКД(ЗначенияРасшифровки, АдресДанныхРасшифровки);
					
				Исключение
				КонецПопытки;
				
				// Выделенные области
				Если ЗначенияРасшифровки.Количество() = 1 Тогда
					
					ПервоеЗначение = ЗначенияРасшифровки[0];
					ДобавитьПолеОбъекта(ПоляОбъекта, ПервоеЗначение);
					
				Иначе	
					ДобавитьПолеОбъекта(ПоляОбъекта, ЗначенияРасшифровки);
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
			
			ТекущаяСтрока = ТекущийЭлемент.ТекущаяСтрока;
			Если ТекущаяСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущаяКолонка = ТекущийЭлемент.ТекущийЭлемент;
			ИмяКоллекцииТекущиеДанные =  "ТекущиеДанные";
			Если ИТК_ОбщийКлиентСерверПовтИсп.ВариантВстроенногоЯзыкаАнглийский() Тогда
				ИмяКоллекцииТекущиеДанные =  "CurrentData";
			КонецЕсли;
			
			Если ТипЗнч(ТекущаяСтрока) = Тип("Число") Тогда
				
				Родитель = ИТК_ФормаКлиент.КоллекцияРодитель(ТекущаяКолонка);
				ИмяРодителя = Родитель.Имя;
				
				ИмяПоля = ТекущаяКолонка.Имя;
				Если СтрНачинаетсяС(ИмяПоля, ИмяРодителя) Тогда
					ИмяПоля = Сред(ИмяПоля, СтрДлина(ИмяРодителя) + 1);
				КонецЕсли;
				
				ДобавитьПолеКоллекцииОбъектаСПопыткой(ПоляОбъекта, ТекущийЭлемент, ИмяПоля, ИмяКоллекцииТекущиеДанные);
				
			Иначе
				
				// Динамический список
				ВыделенныеСтроки = ТекущийЭлемент.ВыделенныеСтроки;
				ВыделеноНесколькоСтрок = (ВыделенныеСтроки.Количество() > 1);
				Если ВыделеноНесколькоСтрок Тогда
					ПолеОбъекта = ВыделенныеСтроки;
				Иначе
					
					ПолеОбъекта = ТекущаяСтрока;
					Если ТипЗнч(ПолеОбъекта) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
						ПолеОбъекта = ПолеОбъекта.Ключ;
					КонецЕсли;
					
				КонецЕсли;
				
				Если НЕ ИТК_МетаданныеКлиентСервер.ОбъектКлючЗаписиРегистра(ПолеОбъекта) Тогда
					ПоляОбъекта.Добавить(ПолеОбъекта);
				КонецЕсли;
				
				Если ВыделеноНесколькоСтрок Тогда
					Прервать;
				КонецЕсли;
				
				ДобавитьПолеКоллекцииОбъектаСПопыткой(ПоляОбъекта, ТекущийЭлемент, ТекущаяКолонка.Имя, ИмяКоллекцииТекущиеДанные);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
	Параметры.Вставить("НавигационнаяСсылка", НавигационнаяСсылка);
	Параметры.Вставить("ПоляОбъекта", ПоляОбъекта);
	
КонецПроцедуры

Функция ДобавитьПолеКоллекцииОбъектаСПопыткой(ПоляОбъекта, Владелец, Имя, ИмяКоллекцииОбъекта = Неопределено)
	
	Попытка
		
		Если ИмяКоллекцииОбъекта = Неопределено Тогда
			
			Поле = Владелец[Имя];
			
		Иначе
			
			Попытка
				Поле = Владелец[ИмяКоллекцииОбъекта][Имя];
			Исключение
				
				ДругоеИмя = ИТК_Строки.УдалитьПрефикс(Имя, Владелец.Имя);
				Поле = Владелец[ИмяКоллекцииОбъекта][ДругоеИмя];
				
			КонецПопытки;
			
		КонецЕсли;
		
		Результат = Истина;
		
	Исключение
		
		Поле = Неопределено;
		Результат = Ложь;
		
	КонецПопытки;
	
	ДобавитьПолеОбъекта(ПоляОбъекта, Поле);
	
	Возврат Результат;

КонецФункции

Процедура ДобавитьПолеОбъекта(ПоляОбъекта, Поле)
	
	Если НЕ (ИТК_ТипыКлиентСервер.ЭтоСсылочный(ТипЗнч(Поле))
				ИЛИ ТипЗнч(Поле) = Тип("Массив")) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка 
		ЗначениеЗаполнено = ЗначениеЗаполнено(Поле);
	Исключение
		ЗначениеЗаполнено = Ложь;
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПоляОбъекта.Найти(Поле) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоляОбъекта.Добавить(Поле);

КонецПроцедуры

#КонецОбласти
