
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если фОтказ Тогда
		Возврат;
	КонецЕсли;
	
	// Автоматические REST сервисы доступны только начиная с версии 8.3.5.1.
	ТекВерсияПлатформы = бит_ОбщегоНазначения.ВерсияПлатформы();
	КонтрольнаяВерсия = "8.3.5.1";
	
	фВерсияСтарше835 = бит_ОбщегоНазначения.ВерсияОбновленияСтарше(КонтрольнаяВерсия, ТекВерсияПлатформы);
	Элементы.Вид.Видимость = фВерсияСтарше835;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

