
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.2] [ASHolyavko@1cbit.ru] [16.06.2025] +        
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Вариант", Тип("ПолеФормы"), ЭтаФорма.Элементы.Список, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.Ссылка.бит_Вариант";
	НовыйЭлемент.Заголовок = "(бит) Вариант"; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.2] [ASHolyavko@1cbit.ru] [16.06.2025] -
	
КонецПроцедуры
