#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Процедура меняет предыдущие координаты на текущие.
//
Процедура АктуализироватьПредыдущиеКоординаты() Экспорт
	
	ВерхПред = Верх;
	ЛевоПред = Лево;
	ВыводитьЗаголовкиКолонокПред = ВыводитьЗаголовкиКолонок;
	ВыводитьЗаголовкиСтрокПред   = ВыводитьЗаголовкиСтрок;

КонецПроцедуры // АктуализироватьПредыдущиеКоординаты()
	
#КонецОбласти 
	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда			
		Возврат;			
	КонецЕсли; 
	
	Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда 	
		Возврат; 	
	КонецЕсли; 
	
	// Проверка возможности обновления таблиц в макете.
	МассивОписаний = Справочники.бит_мпд_ТаблицыПроизвольныхОтчетов.ПолучитьТаблицыОтчета(Владелец);
	
	// Скорректируем описание текущей таблицы с учетом внесенных изменений.
	Сч = 0;
	Для каждого ОписаниеТаблицы Из МассивОписаний Цикл	
		 Если ОписаниеТаблицы.ТаблицаОтчета = Ссылка Тогда		 
		 	  ОписаниеТекТаблицы = Справочники.бит_мпд_ТаблицыПроизвольныхОтчетов.ПодготовитьОписаниеТаблицы(ЭтотОбъект, ОписаниеТаблицы.Ширина, ОписаниеТаблицы.Высота);
			  МассивОписаний[Сч] = ОписаниеТекТаблицы;
			  Прервать;		 
		 КонецЕсли;		 
		 Сч = Сч + 1;
	КонецЦикла; 
	
	// Ситуация добавления новой таблицы
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда		
		ОписаниеТекТаблицы = Справочники.бит_мпд_ТаблицыПроизвольныхОтчетов.ПодготовитьОписаниеТаблицы(ЭтотОбъект, 0, 0);
		МассивОписаний.Добавить(ОписаниеТекТаблицы);		
	КонецЕсли; 
	
	Если Справочники.бит_мпд_ТаблицыПроизвольныхОтчетов.ПроверитьПересечения(МассивОписаний, Истина) Тогда		
		ТекстСообщения = НСтр("ru='Запись изменений невозможна из-за пересечения таблиц.';
							  |en='Record of changes is possible due to the intersection table.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);		
	КонецЕсли; 

	// Проверка выхода за границу таблицы
	флВыход = Ложь;
	ЧислоВыводитьЗаголовкиКолонок = ?(ВыводитьЗаголовкиКолонок, 1, 0);
	ЧислоВыводитьЗаголовкиСтрок   = ?(ВыводитьЗаголовкиСтрок, 1, 0);
	
	Если Верх - ЧислоВыводитьЗаголовкиКолонок < 0  Тогда 	
		флВыход = Истина; 	
	КонецЕсли; 
	Если Лево - ЧислоВыводитьЗаголовкиСтрок < 0 Тогда  	
		флВыход = Истина; 	
	КонецЕсли; 
	
	Если флВыход Тогда	
		ТекстСообщения = НСтр("ru='Запись изменений невозможна. Таблица выходит за границы макета.';
							  |en='You can not record the changes. Table layout beyond the border.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);            	
	КонецЕсли;  	
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда			
		Возврат;			
	КонецЕсли; 
		
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	Если НЕ ЭтоГруппа Тогда
		
		Лево = 2;
		Верх = 2;
		
		ВыводитьЗаголовкиКолонок = Истина;
		ВыводитьЗаголовкиСтрок = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры  	
		
#КонецОбласти
	
#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли