
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [20.08.2024] +        
	
	Если НЕ РольДоступна("бит_ПравоРедактированияКомментария") Тогда
		
		Если ЗначениеЗаполнено(Объект.Распоряжение)
			И ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ЭтапПроизводства2_2")
			И ЗначениеЗаполнено(Объект.Распоряжение.Распоряжение) 
			И ЗначениеЗаполнено(Объект.Распоряжение.Распоряжение.ДокументОснование)Тогда
			
			Если Объект.Распоряжение.Распоряжение.ДокументОснование.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда	
				
				Элементы.Комментарий.ТолькоПросмотр = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ12] [ASHolyavko@1cbit.ru] [20.08.2024] +        
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Толеранс", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Толеранс";
	НовыйЭлемент.Заголовок = "(бит) Толеранс";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ12] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:02:31] +        
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_АтрибутыТары");
	НоваяКоманда.Заголовок = "Атрибуты тары";
	НоваяКоманда.Действие = "бит_АтрибутыТары";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_АтрибутыТары", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель);
	НовыйЭлемент.Заголовок = "Атрибуты тары";
	НовыйЭлемент.ИмяКоманды = "бит_АтрибутыТары";
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:02:31] - 
	
	
	// {{ПервыйБИТ ЛистТребований [5.14]  [VUVaynula@1cbit.ru] [17.06.2025 18:23:31] +        
	
	
	НовыйРеквизит = Новый РеквизитФормы("бит_ТипАдреса", Новый ОписаниеТипов("Число"), , "Тид адреса для печати Извещения");
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
   
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НовыйЭлемент = Элементы.Добавить("бит_ТипАдреса", Тип("ПолеФормы"), Элементы.ГруппаОсновное);
	НовыйЭлемент.ПутьКДанным="бит_ТипАдреса";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеПереключателя;
	НовыйЭлемент.КоличествоКолонок=3;
	НовыйЭлемент.СписокВыбора.добавить(0,"Произвольный");
	НовыйЭлемент.СписокВыбора.добавить(1,"Юр. адрес");
	НовыйЭлемент.СписокВыбора.добавить(2,"Факт. адрес");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ТипАдресаПриИзменении");
	ЭтаФорма.бит_ТипАдреса = Объект.бит_ТипАдреса;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Адрес", Тип("ПолеФормы"), Элементы.ГруппаОсновное);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Адрес"; 
	НовыйЭлемент.МногострочныйРежим = Истина; 
	НовыйЭлемент.РастягиватьПоВертикали = Ложь;    
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	//НовыйЭлемент.РастягиватьПоГоризонтали = Истина; 
	НовыйЭлемент.АвтоМаксимальнаяВысота = Истина;   
	НовыйЭлемент.АвтоМаксимальнаяШирина = Истина;
	// }}ПервыйБИТ ЛистТребований [5.14]  [VUVaynula@1cbit.ru] [17.06.2025 18:23:31] -
КонецПроцедуры

&НаКлиенте
Процедура бит_АтрибутыТары(Команда)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:05:37] +        
	ИмяТЧ = "Товары";
	ИмяТЧСерии = "Серии";
	
	ТД = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ПФ = Неопределено;
		Если ЗначениеЗаполнено(ТД.Серия) Тогда
			ПФ = Новый Структура("Ключ, Документ, Номенклатура, Упаковка, Количество, КоличествоУпаковок, Назначение, НомерСтроки",
								ТД.Серия,
								Объект.Ссылка, 
								ТД.Номенклатура,
								ТД.Упаковка,
								ТД.Количество,
								ТД.КоличествоУпаковок,
								ТД.Назначение,
								ТД.НомерСтроки);	
		Иначе
			СписокСерий = Объект[ИмяТЧСерии].НайтиСтроки(Новый Структура("Номенклатура,Характеристика", ТД.Номенклатура, ТД.Характеристика));
			Если СписокСерий.Количество() = 1 Тогда 
				ПФ = Новый Структура("Ключ, Документ, Номенклатура, Упаковка, Количество, КоличествоУпаковок, Назначение, НомерСтроки",
								СписокСерий[0].Серия,
								Объект.Ссылка, 
								ТД.Номенклатура,
								ТД.Упаковка,
								ТД.Количество,
								ТД.КоличествоУпаковок,
								ТД.Назначение,
								ТД.НомерСтроки);
			Иначе
				ОткрытьПодборСерий();
			КонецЕсли;
		КонецЕсли;   
	КонецЕсли;
	Если ПФ <> Неопределено Тогда
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.бит_ФормаАтрибутыТары", ПФ, ЭтаФорма, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:05:37] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ТипАдресаПриИзменении(Элемент)
// {{ПервыйБИТ ЛистТребований [5.14]  [VUVaynula@1cbit.ru] [17.06.2025 18:34:07] +        
	бит_ТипАдресаПриИзмененииНаСервере(); 
// }}ПервыйБИТ ЛистТребований [5.14]  [VUVaynula@1cbit.ru] [17.06.2025 18:34:07] -	
КонецПроцедуры

&НаСервере
Процедура бит_ТипАдресаПриИзмененииНаСервере()
	// {{ПервыйБИТ ЛистТребований [5.14]  [VUVaynula@1cbit.ru] [17.06.2025 18:35:36] +        
	Если Объект.Товары.Количество() = 0 Тогда   
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В табличной части не введено ни одной строки");  
		ПустойБитАдрес();
		Возврат;
	КонецЕсли;
	
	ЗаказНазначения = Неопределено;
	Для каждого стр из Объект.Товары Цикл
		Если ЗначениеЗаполнено(стр.Назначение) 
			И ЗначениеЗаполнено(стр.Назначение.Заказ) 
			И ТипЗнч(стр.Назначение.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ЗаказНазначения = стр.Назначение.Заказ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЗаказНазначения = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В назначениях табличной части найден заказ клиента");  
		ПустойБитАдрес();
		Возврат;
	КонецЕсли;
	Контрагент = ЗаказНазначения.Контрагент;
	Грузополучатель = Контрагент.НаименованиеПолное;
	Адрес = "";
	Если ЭтаФорма.бит_ТипАдреса = 0 Тогда
		ТипАдреса = Неопределено;
	ИначеЕсли ЭтаФорма.бит_ТипАдреса = 1 Тогда 
		ТипАдреса = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	Иначе                                                 
		ТипАдреса = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	КонецЕсли;    
	
	Если ТипАдреса <> Неопределено Тогда
		ДатаДок = ?(Объект.Дата = Дата("00010101"), ТекущаяДатаСеанса(), ОБъект.Дата);
		Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, ТипАдреса, ДатаДок, Истина);
	КонецЕсли;
	Объект.бит_Адрес = Грузополучатель + " " + Адрес;  
	Объект.бит_ТипАдреса = ЭтаФорма.бит_ТипАдреса;
	// }}ПервыйБИТ ЛистТребований [5.14]  [VUVaynula@1cbit.ru] [17.06.2025 18:35:36] -
КонецПроцедуры 

&НаСервере
Процедура ПустойБитАдрес()
	
	ЭтаФорма.бит_ТипАдреса = 0; 
	Объект.бит_ТипАдреса = 0;
	Объект.бит_Адрес = "";	 
	
КонецПроцедуры