  &Перед("ПриСозданииНаСервере") 
&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	Если Элементы.Найти("бит_НомерЗаказа") = Неопределено Тогда
		бит_СоздатьЭлементыБит(); 
	КонецЕсли;
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -  
	
КонецПроцедуры 

&НаСервере
Процедура бит_СоздатьЭлементыБит()

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	
	КвалификаторЧисла10_0 = Новый КвалификаторыЧисла(10,0);
	ОписаниеЧисло10_0 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла10_0);
	КвалификаторЧисла9_3 = Новый КвалификаторыЧисла(9,3);
	ОписаниеЧисло9_3 = Новый ОписаниеТипов("Число", , , КвалификаторЧисла9_3);
	КвалификаторыСтроки200 = Новый КвалификаторыСтроки(200);
	ОписаниеСтроки = Новый ОписаниеТипов("Строка", , , КвалификаторыСтроки200);
	Описаниебит_ДополнительныеПризнакиНоменклатуры = Новый ОписаниеТипов("СправочникСсылка.бит_ДополнительныеПризнакиНоменклатуры");
		
	ДобавляемыеРеквизитыОстаткиСерий =  Новый Массив; 
	
	бит_НомерЗавесаОстатки = Новый РеквизитФормы("бит_НомерЗавеса", ОписаниеЧисло10_0, "ОстаткиСерий", "(бит) № завеса");
	бит_НомерЗаказаОстатки = Новый РеквизитФормы("бит_НомерЗаказа", ОписаниеЧисло10_0, "ОстаткиСерий", "(бит) № заказа");
	бит_БруттоОстатки = Новый РеквизитФормы("бит_Брутто", ОписаниеЧисло9_3, "ОстаткиСерий", "(бит) Брутто, кг");
	бит_ТипТарыОстатки = Новый РеквизитФормы("бит_ТипТары", Описаниебит_ДополнительныеПризнакиНоменклатуры, "ОстаткиСерий", "(бит) Тип тары");
	бит_ШтрихкодОстатки = Новый РеквизитФормы("бит_Штрихкод", ОписаниеСтроки, "ОстаткиСерий", "(бит) Штрихкод");
	
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_НомерЗавесаОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_НомерЗаказаОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_БруттоОстатки);
    ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ТипТарыОстатки);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ШтрихкодОстатки);
	
	бит_НомерЗавеса = Новый РеквизитФормы("бит_НомерЗавеса", ОписаниеЧисло10_0, , "(бит) № завеса");
	бит_НомерЗаказа = Новый РеквизитФормы("бит_НомерЗаказа", ОписаниеЧисло10_0, , "(бит) № заказа");
	бит_Брутто = Новый РеквизитФормы("бит_Брутто", ОписаниеЧисло9_3, , "(бит) Брутто, кг");
	бит_ТипТары = Новый РеквизитФормы("бит_ТипТары", Описаниебит_ДополнительныеПризнакиНоменклатуры, , "(бит) Тип тары");
	бит_Штрихкод = Новый РеквизитФормы("бит_Штрихкод", ОписаниеСтроки, , "(бит) Штрихкод");
    	
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_НомерЗавеса);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_НомерЗаказа);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_Брутто);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_ТипТары);
	ДобавляемыеРеквизитыОстаткиСерий.Добавить(бит_Штрихкод);
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизитыОстаткиСерий);
	
	//(бит) Намотки
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_НомерЗавеса", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_НомерЗавеса";
	
	//(бит) № заказа
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_НомерЗаказа", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_НомерЗаказа";
		
	//(бит) Брутто, кг
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Брутто", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_Брутто";
	
	//(бит) Тип тары
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_ТипТары", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_ТипТары";
	
	//(бит) Штрихкод
	НовыйЭлемент = Элементы.Вставить("ОстаткиСерийбит_Штрихкод", Тип("ПолеФормы"), Элементы.ОстаткиСерий, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОстаткиСерий.бит_Штрихкод";
		
	НоваяГруппа  = Элементы.Вставить("бит_ГруппаДополнительныеРеквизиты",Тип("ГруппаФормы"), Элементы.СтраницаВводСерии, Элементы.ГруппаДополнительныеРеквизиты);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Истина; 
	НоваяГруппа.Заголовок = "(бит) Дополнтельно";  
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;  
	
	//(бит)  № завеса
	НовыйЭлемент = Элементы.Вставить("бит_НомерЗавеса", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_НомерЗавеса";
	
	//(бит) № заказа
	НовыйЭлемент = Элементы.Вставить("бит_НомерЗаказа", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_НомерЗаказа";
	
	//(бит) Брутто, кг
	НовыйЭлемент = Элементы.Вставить("бит_Брутто", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Брутто";
	
	//(бит) Тип тары
	НовыйЭлемент = Элементы.Вставить("бит_ТипТары", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_ТипТары";
	
	//(бит) Штрихкод
	НовыйЭлемент = Элементы.Вставить("бит_Штрихкод", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Штрихкод"; 
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 - 
	
КонецПроцедуры