
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АвтоТест", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.РежимЗаполнения) Тогда
		ТекстСообщения = НСтр("ru='Непосредственное открытие этой формы не предусмотрено.';
							  |en='The immediate opening of this form is not provided.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	// Установка списка выбора для вида сравнения таблицы отборов.
	ВидыСравнения = бит_МеханизмПолученияДанных.СформироватьСписокВыбораДляОтборовВОтчете("Массив");
	Элементы.ОтборВОтчетеВидСравнения.СписокВыбора.ЗагрузитьЗначения(ВидыСравнения);
	
	// Список типов для быстрого выбора составного.
	ТипыИсточников = Метаданные.Обработки.бит_ПолучениеДанныхБюджета.Реквизиты.ИсточникДанных.Тип.Типы();
	ТипыИсточниковДанных = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(ТипыИсточников);
	
	ОписаниеПроизвольногоТипа = бит_ОбщегоНазначения.ОписаниеПроизвольногоТипа();
	
	// Устанавливаем режим копирования.
	Параметры.Свойство("РежимЗаполнения", Объект.РежимЗаполнения);	
	Режимы = Обработки.бит_ПолучениеДанныхБюджета.РежимыПолученияДанных(Объект.РежимЗаполнения);
	ЭтоПланированиеДДС = Режимы.ЭтоПланированиеДДС;
	
	// Инициализация компоновщика.
	Если Режимы.ЭтоКопированиеБюджета ИЛИ Режимы.ЭтоПланированиеДДС Тогда
		АдресСКД = Обработки.бит_ПолучениеДанныхБюджета.ИнициализироватьКомпоновщик("СКД_Копирование", 
			Компоновщик, УникальныйИдентификатор);
	ИначеЕсли Режимы.ЭтоГрафикДоговоров Тогда	
		АдресСКД = Обработки.бит_ПолучениеДанныхБюджета.ИнициализироватьКомпоновщик("СКД_ГрафикДоговоров", 
			Компоновщик, УникальныйИдентификатор);
	КонецЕсли; 
	
	// Восстановление настройки по-умолчанию.
	УстановитьЗначенияПоУмолчанию();
	
	Если ЗначениеЗаполнено(Параметры.ДокументЗаполнения) Тогда
		
		Объект.ДокументЗаполнения = Параметры.ДокументЗаполнения;
		
		Если Параметры.ДанныеДокументаЗаполнения = Неопределено Тогда
			Если Режимы.ЭтоПроизвольныеПараметры Тогда
				ДанныеДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументЗаполнения, "Дата, Параметр");
				ДатаЗаполнения = ДанныеДок.Дата;
				ЗаполнитьЗначенияСвойств(Объект, Параметры.ПараметрыЗаполнения, 
					"ВалютаДокумента, КурсДокумента, КратностьДокумента, Сценарий, ЕдиницаИзмеренияСуммДокумента");
				НастроитьКолонкиПроизовльногоПараметра(ДанныеДок.Параметр);
			Иначе
				ДанныеДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументЗаполнения, 
				"Дата, ВалютаДокумента, КурсДокумента, КратностьДокумента, Сценарий, ЕдиницаИзмеренияСумм");
				ЗаполнитьЗначенияСвойств(Объект, ДанныеДок);
				ДатаЗаполнения = ДанныеДок.Дата;
			КонецЕсли;
		Иначе
			ДанныеДокументаЗаполнения = Параметры.ДанныеДокументаЗаполнения;
			ДатаЗаполнения            = ДанныеДокументаЗаполнения.Дата;
			Если Режимы.ЭтоПроизвольныеПараметры Тогда
				ЗаполнитьЗначенияСвойств(Объект, Параметры.ПараметрыЗаполнения, 
					"ВалютаДокумента, КурсДокумента, КратностьДокумента, Сценарий, ЕдиницаИзмеренияСуммДокумента");
				НастроитьКолонкиПроизовльногоПараметра(ДанныеДокументаЗаполнения.Параметр);
			Иначе
				ЗаполнитьЗначенияСвойств(Объект, ДанныеДокументаЗаполнения);
			КонецЕсли;
		КонецЕсли;
		
		ДанныеСценария = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Сценарий, "бит_Периодичность, Валюта");
		Объект.ПериодичностьСдвигаДат  = ДанныеСценария.бит_Периодичность;
		Объект.ВалютаОбработки         = ДанныеСценария.Валюта;
		
		ИзменениеВалюты();
		
	ИначеЕсли Режимы.ЭтоПланированиеДДС Тогда
		
		ПараметрыЗаполнения = Параметры.ПараметрыЗаполнения;		
		ПараметрыЗаполнения.Свойство("ВалютаДокумента", 			  Объект.ВалютаДокумента);
		ПараметрыЗаполнения.Свойство("КурсДокумента", 				  Объект.КурсДокумента);
		ПараметрыЗаполнения.Свойство("КратностьДокумента", 			  Объект.КратностьДокумента);
		ПараметрыЗаполнения.Свойство("ВалютаОбработки", 			  Объект.ВалютаОбработки);
		ПараметрыЗаполнения.Свойство("КурсОбработки", 				  Объект.КурсОбработки);
		ПараметрыЗаполнения.Свойство("КратностьОбработки", 			  Объект.КратностьОбработки);
		ПараметрыЗаполнения.Свойство("ПериодичностьСдвигаДат", 		  Объект.ПериодичностьСдвигаДат);
		ПараметрыЗаполнения.Свойство("Период", 			  			  Объект.Период);
		ПараметрыЗаполнения.Свойство("ЕдиницаИзмеренияСуммДокумента", Объект.ЕдиницаИзмеренияСуммДокумента);
		
		// Установим отбора компоновщика.
		СтруктураОтбора = Неопределено;
		Параметры.Свойство("СтруктураОтбора", СтруктураОтбора);
		
		Если СтруктураОтбора <> Неопределено Тогда
			ПараметрыСКД = Компоновщик.Настройки.ПараметрыДанных;
			Для Каждого ЭлементОтбора Из СтруктураОтбора.Параметры Цикл
				ЗначениеПараметра = ПараметрыСКД.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ЭлементОтбора.Ключ));
				Если ЗначениеПараметра <> Неопределено Тогда
					ЗначениеПараметра.Значение = ЭлементОтбора.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ИзменениеВалюты();
		
	ИначеЕсли Параметры.Свойство("ПараметрыЗаполнения")	Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ПараметрыЗаполнения);
	Иначе
		Объект.ВалютаДокумента = Константы.бит_ВалютаУправленческогоУчета.Получить();
		СтрКурса                  = бит_КурсыВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, ТекущаяДатаСеанса());
		Объект.КурсДокумента      = СтрКурса.Курс;
		Объект.КратностьДокумента = СтрКурса.Кратность;
		Объект.ЕдиницаИзмеренияСуммДокумента = Перечисления.бит_ЕдиницыИзмеренияСумм.Единицы;
	КонецЕсли;
	
	ЭтоФормаВвода = ТипЗнч(Объект.ДокументЗаполнения) = Тип("ДокументСсылка.бит_ФормаВводаБюджета");
	Элементы.ИспользоватьЗначенияПоУмолчанию.Видимость = ЭтоФормаВвода;
	
	Объект.ЕдиницаИзмеренияСуммОбработки = Перечисления.бит_ЕдиницыИзмеренияСумм.Единицы;
	Если Не ЗначениеЗаполнено(Объект.ПериодичностьСдвигаДат) Тогда
		Объект.ПериодичностьСдвигаДат = Перечисления.бит_ПериодичностьПланирования.Месяц;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Если ЗначениеЗаполнено(ДатаЗаполнения) Тогда
			Объект.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
			Объект.Период.ДатаНачала    = НачалоМесяца(ДатаЗаполнения);
			Объект.Период.ДатаОкончания = КонецМесяца(ДатаЗаполнения);
		Иначе	
			Объект.Период.Вариант = ВариантСтандартногоПериода.ЭтотГод;
		КонецЕсли; 
	КонецЕсли; 
	
	ЗакрыватьПриВыборе = Ложь;
	ЗакрыватьПриЗакрытииВладельца = Истина;
	
	Объект.РежимСообщений = "Все";
	
	Если НЕ Режимы.ЭтоПроизвольныеПараметры Тогда
		// Отображение дополнительных измерений в табличных полях.
		ИзмеренияДоп = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним");	
		НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
		бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, "ОборотыПоБюджетам",
			ИзмеренияДоп, НастройкиИзмерений);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаОбработки) Тогда
		Объект.ВалютаОбработки = Константы.ВалютаРегламентированногоУчета.Получить();
		Объект.КурсОбработки 	  = 1;
		Объект.КратностьОбработки = 1;	
	КонецЕсли;
	
	УстановитьВидимость();
	
	// Установка заголовка формы.
	УстановитьЗаголовокФормы(Заголовок, Режимы, ТекущаяНастройка);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеПериода" И УникальныйИдентификатор = Параметр Тогда
	
		ПриИзмененииПериода();
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект, Элемент, Объект, "ИсточникДанных",
		ТипыИсточниковДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ИсточникДанных.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	
	ИсточникДанныхИзменение();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОбработкиПриИзменении(Элемент)
		
	ИзмененыНастройки = Истина;
		
	ИзменениеВалюты();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтклоненияПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
		
	ВидОтклоненияИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтклоненияКоличестваПриИзменении(Элемент)
	
	ВидОтклоненияКоличествоИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьСдвигаДатПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
		
	ПериодичностьСдвигаИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОтклоненияПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
		
	ЗначениеОтклоненияИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОтклоненияКоличестваПриИзменении(Элемент)
	
	ЗначениеОтклоненияКоличествоИзменение();	
	
КонецПроцедуры

&НаКлиенте
Процедура СдвигДатПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
	СдвигДатИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
	ИзменениеПрофиля();
		
КонецПроцедуры

&НаКлиенте
Процедура РежимВыбораСуммыПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПулаПодключенийПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсОбработкиПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОборотыПоБюджетам

&НаКлиенте
Процедура ОборотыПоБюджетамСуммаСценарийДляЗаполненияПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОборотыПоБюджетам.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		// Получим структуру курсов валют.
		СтруктураКурсыВалют = КурсыВалютДанныхБюджета();
		// Получим размерность единицы измерения сумм документа.
		РазмерностьЕдиницы = ПолучитьРазмерностьЕдиницыИзмеренияСумм();
		РассчитатьСуммуВВалютеДокументаВСтроке(ТекДанные, СтруктураКурсыВалют, РазмерностьЕдиницы)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборВОтчете

&НаКлиенте
Процедура ОтборВОтчетеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.ОтборВОтчете.ТекущиеДанные;	
	Если ТекущаяСтрока.Значение = Неопределено Тогда
		Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;
	Иначе	
		Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ОтборВОтчетеВидСравненияПриИзмененииСервер(ТекущиеДанные.ПолучитьИдентификатор());	

КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ОтборВОтчетеЗначениеПриИзмененииСервер(ТекущиеДанные.ПолучитьИдентификатор());
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПараметры

&НаКлиенте
Процедура ТаблицаПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;	 	
	Если НоваяСтрока И НЕ Копирование Тогда  		
		ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Значение");   			
	КонецЕсли; 
	ПредыдущийВидПараметра = ТекущиеДанные.ВидПараметра;
	ОграничитьОписаниеТиповПараметра();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыВидПараметраПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;	
	Если ТекущиеДанные <> Неопределено Тогда
		ИД = Элементы.ТаблицаПараметры.ТекущиеДанные.ПолучитьИдентификатор();
		ИзменитьВидПараметра(ИД);
		ПредыдущийВидПараметра = ТекущиеДанные.ВидПараметра;
		ОграничитьОписаниеТиповПараметра();
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыЗначениеПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;		
	Если ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Выражение") Тогда  		
		СтандартнаяОбработка = Ложь;			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметрыЗначениеПараметраОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;	
	Если ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Значение") Тогда		
		Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область РаботаСНастройками

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	ПараметрыФормы.Вставить("СтруктураНастройки", СохраняемыеНастройки());
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		ПараметрыФормы.Вставить("СохраненнаяНастройка", ТекущаяНастройка);
	КонецЕсли; 
		
	ОповещениеЗакрытиеФормы = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", 
		ПараметрыФормы, ЭтотОбъект,,,, ОповещениеЗакрытиеФормы, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	
	ОповещениеЗакрытиеФормы = Новый ОписаниеОповещения("ВыбратьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", 
		ПараметрыФормы, ЭтотОбъект,,,, ОповещениеЗакрытиеФормы, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура НастроитьПериод(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОткрытьДиалогСтандартногоПериода(Объект, "Период",, УникальныйИдентификатор);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	Если ПодтверждениеОчисткиДанных() Тогда
		НачатьОтложенноеОбновлениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагиУстановитьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ОборотыПоБюджетам, "Выполнять", 1,
		Элементы.ОборотыПоБюджетам);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагиСнятьВсе(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ОборотыПоБюджетам, "Выполнять", 0,
		Элементы.ОборотыПоБюджетам);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагиИнвертировать(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ОборотыПоБюджетам, "Выполнять", 2,
		Элементы.ОборотыПоБюджетам);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиДобавить(Команда)
	
	ОповеститьОВыбореДанных("Добавить");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЗаполнить(Команда)
	
	ОповеститьОВыбореДанных("Заполнить");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЗаменить(Команда)
	
	ОповеститьОВыбореДанных("Заменить");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИЗаполнить(Команда)
	
	НачатьОтложенноеОбновлениеДанных("Заполнить");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИДобавить(Команда)
	
	НачатьОтложенноеОбновлениеДанных("Добавить");
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция НастраиваемыйОбъект()

	Возврат "Обработка.бит_ПолучениеДанныхБюджета";

КонецФункции

// Функция формирует заголовок суммовой колонки с учетом единицы измерения сумм и валюты.
// 
// Параметры:
//   НазваниеКолонки - Строка.
//   ЕдиницаИзмерения - ПеречислениеСсылка.бит_ЕдиницыИзмеренияСумм.
//   Валюта - СправочникСсылка.Валюты.
// 
// Возвращаемое значение:
//  СтрЗаголовок - Строка.
// 
&НаСервере
Функция ЗаголовокКолонкиСумм(НазваниеКолонки, ЕдиницаИзмерения, Валюта)
	
	ШаблонЗаголовка = "%1 ( %2 %3 )";
	Если ЕдиницаИзмерения = Перечисления.бит_ЕдиницыИзмеренияСумм.Тысячи Тогда
		СтрЕдиница = НСтр("ru='тыс.';en='thousand'");
	ИначеЕсли ЕдиницаИзмерения = Перечисления.бит_ЕдиницыИзмеренияСумм.Миллионы Тогда
		СтрЕдиница = НСтр("ru='млн.';en='mln.'");
	Иначе	
		СтрЕдиница = "";
	КонецЕсли; 
	СтрЗаголовок = СтрШаблон(ШаблонЗаголовка, НазваниеКолонки, СтрЕдиница, Валюта);
	Возврат СтрЗаголовок;
	
КонецФункции

// Процедура управляет видимостью/доступностью элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ГруппаОтбор.Видимость                         = Режимы.ЭтоПолучениеБюджета ИЛИ Режимы.ЭтоПроизвольныеПараметры;
	Элементы.ГруппаПараметры.Видимость                     = Режимы.ЭтоПолучениеБюджета ИЛИ Режимы.ЭтоПроизвольныеПараметры;
	Элементы.ИсточникДанных.Видимость                      = Режимы.ЭтоПолучениеБюджета ИЛИ Режимы.ЭтоПроизвольныеПараметры;
	Элементы.НастройкаПулаПодключений.Видимость            = Режимы.ЭтоПолучениеБюджета ИЛИ Режимы.ЭтоПроизвольныеПараметры;
	Элементы.ГруппаНастройкиОтборКомпоновщика.Видимость    = НЕ Режимы.ЭтоПолучениеБюджета И НЕ Режимы.ЭтоПроизвольныеПараметры;
	Элементы.ЗаполнятьКомментарийКСтрокамБюджета.Видимость = Режимы.ЭтоКопированиеБюджета;
	
	Если Режимы.ЭтоПланированиеДДС Тогда
		Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаНастройки;
	КонецЕсли;	
	Элементы.РежимСообщений.Видимость				   = НЕ Режимы.ЭтоПланированиеДДС;
	Элементы.ВидОтклонения.Видимость				   = НЕ Режимы.ЭтоПланированиеДДС;
	Элементы.ЗначениеОтклонения.Видимость			   = НЕ Режимы.ЭтоПланированиеДДС;
	Элементы.ВидОтклоненияКоличества.Видимость		   = НЕ (Режимы.ЭтоПланированиеДДС ИЛИ Режимы.ЭтоПроизвольныеПараметры);
	Элементы.ЗначениеОтклоненияКоличества.Видимость	   = НЕ (Режимы.ЭтоПланированиеДДС ИЛИ Режимы.ЭтоПроизвольныеПараметры);
	Элементы.ПериодичностьСдвигаДат.Видимость		   = НЕ (Режимы.ЭтоПланированиеДДС ИЛИ Режимы.ЭтоПроизвольныеПараметры);
	Элементы.СдвигДат.Видимость						   = НЕ (Режимы.ЭтоПланированиеДДС ИЛИ Режимы.ЭтоПроизвольныеПараметры);
	Элементы.Профиль.Видимость						   = НЕ (Режимы.ЭтоПланированиеДДС ИЛИ Режимы.ЭтоПроизвольныеПараметры);
	Элементы.ИспользоватьЗначенияПоУмолчанию.Видимость = НЕ (Режимы.ЭтоПланированиеДДС ИЛИ Режимы.ЭтоПроизвольныеПараметры);
	Элементы.ГруппаДанные.Видимость					   = НЕ Режимы.ЭтоПланированиеДДС;
	Элементы.ЗакрытьНастройки.Видимость  			   = НЕ Режимы.ЭтоПланированиеДДС;
	Элементы.ФормаГруппаОбновитьПеренести.Видимость	   = Режимы.ЭтоПланированиеДДС;
	Элементы.ПрименитьНастройки.Видимость	   		   = НЕ Режимы.ЭтоПланированиеДДС;
	Элементы.РежимВыбораСуммы.Видимость				   = Режимы.ЭтоГрафикДоговоров;
	
	Элементы.ЗначениеОтклонения.Доступность           = ЗначениеЗаполнено(Объект.ВидОтклонения);
	Элементы.ЗначениеОтклоненияКоличества.Доступность = ЗначениеЗаполнено(Объект.ВидОтклоненияКоличества);
	
	Элементы.ОборотыПоБюджетамСуммаСценарийДляЗаполнения.Заголовок = ЗаголовокКолонкиСумм(
		НСтр("ru='Сумма';en='Amount'"), Объект.ЕдиницаИзмеренияСуммОбработки, Объект.ВалютаОбработки);
																							  
	Элементы.ОборотыПоБюджетамСуммаСценарийВВалютеДокумента.Заголовок = ЗаголовокКолонкиСумм(
		НСтр("ru='Сумма документа';en='Document total amount'"), Объект.ЕдиницаИзмеренияСуммДокумента,
		Объект.ВалютаДокумента);	
																								 
	ЭтоРаспределение = ЗначениеЗаполнено(Объект.Профиль);
	Элементы.ОборотыПоБюджетамПроцентРаспределения.Видимость = ЭтоРаспределение;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокФормы(Заголовок, Режимы, ТекущаяНастройка)
	
	Если Режимы.ЭтоКопированиеБюджета Тогда
		СтрЗаголовок = НСтр("ru='Копирование данных бюджета';en='Budget Data Copying'");
	ИначеЕсли Режимы.ЭтоГрафикДоговоров Тогда	
		СтрЗаголовок = НСтр("ru='Копирование данных графиков договоров';en='Copy of Contract Schedule Data'");
	ИначеЕсли Режимы.ЭтоПроизвольныеПараметры Тогда
		СтрЗаголовок = НСтр("ru='Заполнение значений произвольного параметра';en='Заполнение значений произвольного параметра'");
	Иначе	
		СтрЗаголовок = НСтр("ru='Получение данных бюджета';en='Budget Data Reception'");
	КонецЕсли; 

	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		СтрЗаголовок = СтрЗаголовок + "(%1)";
		СтрЗаголовок = СтрШаблон(СтрЗаголовок, ТекущаяНастройка);
	КонецЕсли; 
		
	Заголовок = СтрЗаголовок;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКолонкиПроизовльногоПараметра(ПроизвольныйПараметр)
	
	ИзбыточныеЭлементы = Новый Массив;
	ИзбыточныеЭлементы.Добавить(Элементы.ОборотыПоБюджетамПериод);
	ИзбыточныеЭлементы.Добавить(Элементы.ОборотыПоБюджетамПериодДляЗаполнения);
	ИзбыточныеЭлементы.Добавить(Элементы.ОборотыПоБюджетамСценарий);
	ИзбыточныеЭлементы.Добавить(Элементы.ОборотыПоБюджетамЦФО);
	ИзбыточныеЭлементы.Добавить(Элементы.ОборотыПоБюджетамСтатьяОборотов);
	ИзбыточныеЭлементы.Добавить(Элементы.ОборотыПоБюджетамАналитика_5);
	ИзбыточныеЭлементы.Добавить(Элементы.ОборотыПоБюджетамАналитика_6);
	ИзбыточныеЭлементы.Добавить(Элементы.ОборотыПоБюджетамАналитика_7);
	Если бит_ОбщегоНазначенияПовтИсп.ЭтоСемействоБП() Тогда
		ИзбыточныеЭлементы.Добавить(Элементы["ОборотыПоБюджетамКонтрагент"]);
		ИзбыточныеЭлементы.Добавить(Элементы["ОборотыПоБюджетамДоговорКонтрагента"]);
		ИзбыточныеЭлементы.Добавить(Элементы["ОборотыПоБюджетамПроект"]);
		ИзбыточныеЭлементы.Добавить(Элементы["ОборотыПоБюджетамНоменклатурнаяГруппа"]);
		ИзбыточныеЭлементы.Добавить(Элементы["ОборотыПоБюджетамБанковскийСчет"]);
	ИначеЕсли бит_ОбщегоНазначенияПовтИсп.ЭтоСемействоERP() Тогда
		ИзбыточныеЭлементы.Добавить(Элементы["ОборотыПоБюджетамАналитика_8"]);
		ИзбыточныеЭлементы.Добавить(Элементы["ОборотыПоБюджетамАналитика_9"]);
		ИзбыточныеЭлементы.Добавить(Элементы["ОборотыПоБюджетамАналитика_10"]);
		ИзбыточныеЭлементы.Добавить(Элементы["ОборотыПоБюджетамАналитика_11"]);
		ИзбыточныеЭлементы.Добавить(Элементы["ОборотыПоБюджетамАналитика_12"]);
	КонецЕсли;
	ИзбыточныеЭлементы.Добавить(Элементы.ОборотыПоБюджетамКоличество);
	ИзбыточныеЭлементы.Добавить(Элементы.ОборотыПоБюджетамКоличествоДляЗаполнения);
	
	ИзбыточныеЭлементы.Добавить(Элементы.ОборотыПоБюджетамПеренестиИОбновитьРесурсы);
	
	Для каждого ЭлементМассива Из ИзбыточныеЭлементы Цикл
		ЭлементМассива.Видимость = Ложь;
	КонецЦикла;
	
	ЭлементыКолонокАналитики = Новый Массив;
	ЭлементыКолонокАналитики.Добавить(Элементы.ОборотыПоБюджетамАналитика_1);
	ЭлементыКолонокАналитики.Добавить(Элементы.ОборотыПоБюджетамАналитика_2);
	ЭлементыКолонокАналитики.Добавить(Элементы.ОборотыПоБюджетамАналитика_3);
	ЭлементыКолонокАналитики.Добавить(Элементы.ОборотыПоБюджетамАналитика_4);
	
	ВсегоАналитикДокумента = ЭлементыКолонокАналитики.Количество();
	ВыборкаАналитик        = Документы.бит_УстановкаЗначенийПроизвольныхПараметров.АтрибутыПроизвольногоПараметра(ПроизвольныйПараметр, ВсегоАналитикДокумента);
	КоличествоАналитик     = ВыборкаАналитик.Количество();
	Пока ВыборкаАналитик.Следующий() Цикл
		
		ЭлементКолонкаАналитики = ЭлементыКолонокАналитики.Получить(ВыборкаАналитик.НомерСтроки - 1);
		
		НаименованиеЭлементаАналитики = ЭлементКолонкаАналитики.Имя;
		ЗаголовокЭлемента = СтрЗаменить(НаименованиеЭлементаАналитики, "ОборотыПоБюджетам", "");
		ЗаголовокЭлемента = СтрШаблон("%1 (%2)", ЗаголовокЭлемента, ВыборкаАналитик.НаименованиеАналитики);
		
		ЭлементКолонкаАналитики.Видимость       = Истина;
		ЭлементКолонкаАналитики.Заголовок       = ЗаголовокЭлемента;
		ЭлементКолонкаАналитики.ВыбиратьТип     = Ложь;
		ЭлементКолонкаАналитики.ОграничениеТипа = ВыборкаАналитик.ТипЗначенияАналитики;
	КонецЦикла;
	
	Если КоличествоАналитик < ВсегоАналитикДокумента Тогда
		Для Сч = (КоличествоАналитик + 1) По ВсегоАналитикДокумента Цикл
			ЭлементКолонкаАналитики = ЭлементыКолонокАналитики.Получить(Сч - 1);
			ЭлементКолонкаАналитики.Видимость = Ложь;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСНастройками

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеНастроек(Форма)

	Форма.Элементы.ДекорацияИзмененыНастройки.Видимость = Форма.ИзмененыНастройки;
	Форма.Элементы.ОборотыПоБюджетам.Доступность 		= НЕ Форма.ИзмененыНастройки;
				
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница	  = Элементы.СтраницаНастройки;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;	

КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка;
	Элементы.ОбновитьДанные.КнопкаПоУмолчанию = Истина;

	Если ИзмененыНастройки Тогда
		ОбработатьИзменениеНастроек(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыХраненияНастроек()

	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("ТипНастройки", ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыХранения.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());

	Возврат ПараметрыХранения;
	
КонецФункции

// Процедура - обработчик оповещения о закрытии формы сохранения настроек. 
// 
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(СохрНастройка, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(СохрНастройка) Тогда
		ТекущаяНастройка = СохрНастройка;
		УстановитьЗаголовокФормы(Заголовок, Режимы, ТекущаяНастройка);
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик оповещения о закрытии формы применения настроек. 
// 
&НаКлиенте 
Процедура ВыбратьНастройкиЗавершение(ВыбНастройка, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(ВыбНастройка) Тогда        
		ТекущаяНастройка = ВыбНастройка;
		ПрименитьНастройки(ТекущаяНастройка, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СохраняемыеНастройки()

	СтруктураНастройки = Новый Структура;	
	СтруктураНастройки.Вставить("ИсточникДанных", 					   Объект.ИсточникДанных);
	СтруктураНастройки.Вставить("Период", 				   			   Объект.Период);
	СтруктураНастройки.Вставить("РежимСообщений", 					   Объект.РежимСообщений);
	СтруктураНастройки.Вставить("ВидОтклонения", 					   Объект.ВидОтклонения);
	СтруктураНастройки.Вставить("ЗначениеОтклонения", 				   Объект.ЗначениеОтклонения);
	СтруктураНастройки.Вставить("ВидОтклоненияКоличества", 			   Объект.ВидОтклоненияКоличества);
	СтруктураНастройки.Вставить("ЗначениеОтклоненияКоличества", 	   Объект.ЗначениеОтклоненияКоличества);
	СтруктураНастройки.Вставить("ПериодичностьСдвигаДат", 			   Объект.ПериодичностьСдвигаДат);
	СтруктураНастройки.Вставить("СдвигДат", 						   Объект.СдвигДат);
	СтруктураНастройки.Вставить("РежимЗаполнения", 					   Объект.РежимЗаполнения);
	СтруктураНастройки.Вставить("Профиль", 							   Объект.Профиль);
	СтруктураНастройки.Вставить("РежимВыбораСуммы", 				   Объект.РежимВыбораСуммы);
	СтруктураНастройки.Вставить("ЗаполнятьКомментарийКСтрокамБюджета", Объект.ЗаполнятьКомментарийКСтрокамБюджета);
	
	ТабОтбор = РеквизитФормыВЗначение("ОтборВОтчете");
	СтруктураНастройки.Вставить("ОтборВОтчете", бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТабОтбор));
	
	ТабПараметры = РеквизитФормыВЗначение("ТаблицаПараметры");
	СтруктураНастройки.Вставить("ТаблицаПараметры", бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТабПараметры));
	СтруктураНастройки.Вставить("ПользовательскиеНастройки", Новый ХранилищеЗначения(Компоновщик.ПользовательскиеНастройки));
	
	Возврат СтруктураНастройки;
	
КонецФункции

// Процедура применяет сохраненные настройки.
// 
// Параметры:
//  ВыбНастройка  - СправочникСсылка.бит_СохраненныеНастройки.
//  ОткрытиеФормы - Булево.
// 
&НаСервере
Процедура ПрименитьНастройки(ВыбНастройка, ОткрытиеФормы)

	ДанныеНастройки = Обработки.бит_ПолучениеДанныхБюджета.ИзвлечьНастройки(ВыбНастройка, Объект);	
	Если ДанныеНастройки.Выполнено Тогда
			
		ЗначениеВДанныеФормы(ДанныеНастройки.Таблица_ОтборВОтчете, ОтборВОтчете);
		ЗначениеВДанныеФормы(ДанныеНастройки.Таблица_Параметры   , ТаблицаПараметры);
		
		Режимы = Обработки.бит_ПолучениеДанныхБюджета.РежимыПолученияДанных(Объект.РежимЗаполнения);
		
		Если Не Режимы.ЭтоПолучениеБюджета И ДанныеНастройки.Свойство("ПользовательскиеНастройки") Тогда
			Если ТипЗнч(ДанныеНастройки.ПользовательскиеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
				Компоновщик.ЗагрузитьПользовательскиеНастройки(ДанныеНастройки.ПользовательскиеНастройки);
			КонецЕсли; // Это пользовательские настройки.
		КонецЕсли; // Не Режимы.ЭтоПолучениеДанных.
		ТекущаяНастройка = ВыбНастройка;
		УстановитьЗаголовокФормы(Заголовок, Режимы, ТекущаяНастройка);
				
	Иначе	
		Если ДанныеНастройки.КодВозврата = -1 И НЕ ОткрытиеФормы Тогда
			ОбщегоНазначения.СообщитьПользователю(ДанныеНастройки.СодержаниеОшибки);
		КонецЕсли; 
	КонецЕсли; 
	
	УстановитьВидимость();
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	 
КонецПроцедуры

// Процедура устанавливает настройку либо из последних использованных, либо из настройки по умолчанию.
// 
&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	// Получим настройку по - умолчанию и последнюю использованную.
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект());
	
	Если ЗначениеЗаполнено(НастройкаПоУмолчанию) Тогда		
		ПрименитьНастройки(НастройкаПоУмолчанию, Истина);		
	Иначе
		ОбработатьИзменениеНастроек(ЭтотОбъект);	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.РежимСообщений) Тогда 	
		Объект.РежимСообщений = "Ошибки";   	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЭлементамиФормыОбщие

// Функция получает структуру курсов валют.
//
// Возвращаемое значение:
//  СтруктураКурсовВалют - Структура.
//
&НаКлиенте
Функция КурсыВалютДанныхБюджета()
	
	// Получим структуру курсов валют.
	СтруктураКурсыВалют = Новый Структура;
	
	// Сформируем структуру курсов валюты документа.
	СтруктураКурса = Новый Структура;
	СтруктураКурса.Вставить("Курс",		Объект.КурсДокумента);
	СтруктураКурса.Вставить("Кратность",Объект.КратностьДокумента);
	СтруктураКурса.Вставить("Валюта",	Объект.ВалютаДокумента);
	
	СтруктураКурсыВалют.Вставить("Документ", СтруктураКурса);
	
	// Сформируем структуру курсов валюты обработки.
	СтруктураКурса = Новый Структура;
	СтруктураКурса.Вставить("Курс",		Объект.КурсОбработки);
	СтруктураКурса.Вставить("Кратность",Объект.КратностьОбработки);
	СтруктураКурса.Вставить("Валюта",	Объект.ВалютаОбработки);
	
	СтруктураКурсыВалют.Вставить("Обработка", СтруктураКурса);
	
	Возврат СтруктураКурсыВалют;
	
КонецФункции

// Функция получает размерность единицы измерения сумм.
// 
// Параметры:
//  ЕдиницаИзмеренияСумм - ПеречислениеСсылка.бит_ЕдиницыИзмеренияСумм.
// 
// Возвращаемое значение:
//  Коэффициент - Число.
// 
&НаКлиенте
Функция ПолучитьРазмерностьЕдиницыИзмеренияСумм()

	СоответствиеКоэффициентов = Новый Соответствие;
	СоответствиеКоэффициентов.Вставить(ПредопределенноеЗначение("Перечисление.бит_ЕдиницыИзмеренияСумм.Единицы"),	1);
	СоответствиеКоэффициентов.Вставить(ПредопределенноеЗначение("Перечисление.бит_ЕдиницыИзмеренияСумм.Тысячи"),	1000);
	СоответствиеКоэффициентов.Вставить(ПредопределенноеЗначение("Перечисление.бит_ЕдиницыИзмеренияСумм.Миллионы"),	1000000);
	
	Коэффициент = СоответствиеКоэффициентов.Получить(Объект.ЕдиницаИзмеренияСуммДокумента);
    Коэффициент = ?(Коэффициент = Неопределено, 1, Коэффициент);
	
	Возврат Коэффициент;
	
КонецФункции

// Процедура рассчитывает сумму в валюте документа в строке.
//
// Параметры:
//  ТекущаяСтрока 	    - СтрокаТабличнойЧасти.ОборотыПоБюджетам.
//  СтруктураКурсыВалют - Структура.
//  РазмерностьЕдиницы  - Число, размерность единицы измерения сумм.
//
&НаКлиенте 
Процедура РассчитатьСуммуВВалютеДокументаВСтроке(ТекущаяСтрока, СтруктураКурсыВалют, РазмерностьЕдиницы)
	
	СтруктураКурсовОбработки 	   = СтруктураКурсыВалют.Обработка;
	СтруктураКурсовВалютыДокумента = СтруктураКурсыВалют.Документ;
	
	// Расчитаем сумму в указанных единицах измерения сумм документа.
	Знаменатель = ?(РазмерностьЕдиницы = 0, 1, РазмерностьЕдиницы);	
	СуммаВЕдиницеДокумента = ТекущаяСтрока.СуммаСценарийДляЗаполнения / Знаменатель;
		
	// Рассчитаем сумму в валюте документа.
	СуммаВВалютеДокумента = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СуммаВЕдиницеДокумента,
		СтруктураКурсовОбработки.Валюта, СтруктураКурсовВалютыДокумента.Валюта, СтруктураКурсовОбработки.Курс,
		СтруктураКурсовВалютыДокумента.Курс, СтруктураКурсовОбработки.Кратность, СтруктураКурсовВалютыДокумента.Кратность);
	
	ТекущаяСтрока.СуммаСценарийВВалютеДокумента = СуммаВВалютеДокумента;
	
КонецПроцедуры

// Процедура обрабатывает изменение валюты обработки.
// 
&НаСервере
Процедура ИзменениеВалюты()
	
	СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(Объект.ВалютаОбработки, ДатаЗаполнения);
	Объект.КурсОбработки = СтруктураКурса.Курс;
	Объект.КратностьОбработки = СтруктураКурса.Кратность;
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЭлементамиШапкиФормы

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИсточникДанныхИзменение()
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	ЗаполнитьТаблицуОтборов();
	ОбновитьТаблицуПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ВидОтклоненияИзменение()
	
	Если Объект.ВидОтклонения = Перечисления.бит_ВидыОтклоненийКонтрольныхЗначений.Абсолютное Тогда
		
		КвалификаторыЧисла = Новый КвалификаторыЧисла(15,2, ДопустимыйЗнак.Любой);
		Элементы.ЗначениеОтклонения.ОграничениеТипа = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
		
		ЗначениеОтклонения = Элементы.ЗначениеОтклонения.ОграничениеТипа.ПривестиЗначение(ЗначениеОтклонения);
		
	ИначеЕсли Объект.ВидОтклонения = Перечисления.бит_ВидыОтклоненийКонтрольныхЗначений.Процент Тогда
		
		КвалификаторыЧисла = Новый КвалификаторыЧисла(15,2, ДопустимыйЗнак.Любой);
		Элементы.ЗначениеОтклонения.ОграничениеТипа = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
		
		ЗначениеОтклонения = Элементы.ЗначениеОтклонения.ОграничениеТипа.ПривестиЗначение(ЗначениеОтклонения);
		
		Если ЗначениеОтклонения > 100 Тогда
			ЗначениеОтклонения = 100;
		ИначеЕсли ЗначениеОтклонения < -100 Тогда
			ЗначениеОтклонения = -100;
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ВидОтклонения) Тогда
		ЗначениеОтклонения = 0;
	КонецЕсли;
	
	// Установить видимость и доступность реквизитов.
	УстановитьВидимость();
	
	СтруктураКурсыВалют = Обработки.бит_ПолучениеДанныхБюджета.КурсыВалютДанныхБюджета(Объект);
	Обработки.бит_ПолучениеДанныхБюджета.РассчитатьСуммыДляЗаполненияВОборотахПоБюджету(Объект.ОборотыПоБюджетам,
		СтруктураКурсыВалют, Объект.ЕдиницаИзмеренияСуммДокумента, Объект.ВидОтклонения, Объект.ЗначениеОтклонения);	

КонецПроцедуры

&НаСервере
Процедура ЗначениеОтклоненияИзменение()
	
	СтруктураКурсыВалют = Обработки.бит_ПолучениеДанныхБюджета.КурсыВалютДанныхБюджета(Объект);
	Обработки.бит_ПолучениеДанныхБюджета.РассчитатьСуммыДляЗаполненияВОборотахПоБюджету(Объект.ОборотыПоБюджетам,
		СтруктураКурсыВалют, Объект.ЕдиницаИзмеренияСуммДокумента, Объект.ВидОтклонения, Объект.ЗначениеОтклонения);	
	
КонецПроцедуры

&НаСервере
Процедура ВидОтклоненияКоличествоИзменение()
	
	ИзмененыНастройки = Истина;
	
	Если Объект.ВидОтклоненияКоличества = Перечисления.бит_ВидыОтклоненийКонтрольныхЗначений.Абсолютное Тогда
		
		КвалификаторыЧисла = Новый КвалификаторыЧисла(15,3, ДопустимыйЗнак.Любой);
		Элементы.ЗначениеОтклоненияКоличества.ОграничениеТипа = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
		
		Объект.ЗначениеОтклоненияКоличества = Элементы.ЗначениеОтклоненияКоличества.ОграничениеТипа.ПривестиЗначение(Объект.ЗначениеОтклоненияКоличества);
		
	ИначеЕсли Объект.ВидОтклоненияКоличества = Перечисления.бит_ВидыОтклоненийКонтрольныхЗначений.Процент Тогда
		
		КвалификаторыЧисла = Новый КвалификаторыЧисла(15,2, ДопустимыйЗнак.Любой);
		Элементы.ЗначениеОтклоненияКоличества.ОграничениеТипа = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
		
		Объект.ЗначениеОтклоненияКоличества = Элементы.ЗначениеОтклоненияКоличества.ОграничениеТипа.ПривестиЗначение(Объект.ЗначениеОтклоненияКоличества);
		
		Если Объект.ЗначениеОтклоненияКоличества > 100 Тогда
			Объект.ЗначениеОтклоненияКоличества = 100;
		ИначеЕсли Объект.ЗначениеОтклоненияКоличества < -100 Тогда
			Объект.ЗначениеОтклоненияКоличества = -100;
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ВидОтклоненияКоличества) Тогда
		
		Объект.ЗначениеОтклоненияКоличества = 0;
		
	КонецЕсли;
	
	// Установить видимость и доступность реквизитов.
	УстановитьВидимость();
	
	// Выполним расчет количества для заполнения.
	Обработки.бит_ПолучениеДанныхБюджета.РассчитатьКоличествоДляЗаполненияВОборотахПоБюджету(Объект.ОборотыПоБюджетам,
		Объект.ВидОтклоненияКоличества, Объект.ЗначениеОтклоненияКоличества);
	
КонецПроцедуры

&НаСервере
Процедура ЗначениеОтклоненияКоличествоИзменение()
	
	ИзмененыНастройки = Истина;
	
	// Выполним расчет количества для заполнения.
	Обработки.бит_ПолучениеДанныхБюджета.РассчитатьКоличествоДляЗаполненияВОборотахПоБюджету(Объект.ОборотыПоБюджетам,
		Объект.ВидОтклоненияКоличества, Объект.ЗначениеОтклоненияКоличества);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСдвигДатДанныхБюджета()
		
	// Выполним получение даты заполнения с учетом сдвига дат.
	Для Каждого ТекСтрока Из Объект.ОборотыПоБюджетам Цикл
		ТекСтрока.ПериодДляЗаполнения = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ТекСтрока.Период, Объект.СдвигДат,
			Объект.ПериодичностьСдвигаДат);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПериодичностьСдвигаИзменение()
	
	Если ЗначениеЗаполнено(Объект.Профиль) Тогда
		// Сдвиг и распределение.
		ВыполнитьПреобразованиеДанных();
	Иначе	
		// Только сдвиг.
		ВыполнитьСдвигДатДанныхБюджета();	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СдвигДатИзменение()
	
	ВыполнитьСдвигДатДанныхБюджета();	
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеПрофиля()
	
	ВыполнитьПреобразованиеДанных();
	
	УстановитьВидимость();
	
КонецПроцедуры

// Процедура заполняет таблицу отборов. 
// 
&НаСервере
Процедура ЗаполнитьТаблицуОтборов()

	ТаблицаОтборов = РеквизитФормыВЗначение("ОтборВОтчете");
	бит_МеханизмПолученияДанных.ЗаполнитьОтборВОтчете(Объект.ИсточникДанных, ТаблицаОтборов);
	ЗначениеВДанныеФормы(ТаблицаОтборов, ОтборВОтчете);	

КонецПроцедуры

// Процедура выполняет обновление таблицы параметров.
// 
&НаСервере
Процедура ОбновитьТаблицуПараметров()
	
	бит_МеханизмПолученияДанных.ОбновитьТаблицуПараметров(Объект.ИсточникДанных, ТаблицаПараметры, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСТаблицейФормыТаблицаПараметры

// Процедура ограничивает описание типов в строке таблица параметров.
// 
&НаКлиенте
Процедура ОграничитьОписаниеТиповПараметра()

	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;
	
	Если ТекущиеДанные.ВидПараметра = ПредопределенноеЗначение("Перечисление.бит_ВидыПараметровЗапроса.Выражение") Тогда
		ОписаниеОграничение = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(500));
	Иначе
		
		Если ТекущиеДанные.ЗначениеПараметра = Неопределено Тогда  		
			Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Истина; 		
		Иначе	                                                        		
			Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Ложь;  		
		КонецЕсли; 
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СписокЗначений"));
		Если ЗначениеЗаполнено(ТекущиеДанные.ДоступныеТипы) Тогда
			ОписаниеОграничение = Новый ОписаниеТипов(ТекущиеДанные.ДоступныеТипы, МассивТипов);
		Иначе		
			ОписаниеОграничение = Новый ОписаниеТипов(ОписаниеПроизвольногоТипа, МассивТипов);
		КонецЕсли;
		
	КонецЕсли;	
	
	// Ограничим тип значения.
	Элементы.ТаблицаПараметрыЗначениеПараметра.ОграничениеТипа = ОписаниеОграничение;  

КонецПроцедуры

&НаСервере
Процедура ИзменитьВидПараметра(ИД)

	ТекущиеДанные = ТаблицаПараметры.НайтиПоИдентификатору(ИД);
	бит_МеханизмПолученияДанных.ИзменениеВидаПараметра(ТекущиеДанные, ПредыдущийВидПараметра);

КонецПроцедуры

#КонецОбласти

#Область РаботаСТаблицейФормыОтборВОтчете

// Процедура - обработчик события "ПриИзменении" поля ввода "ВидСравнения" табличного поля "ОтборВОтчете"
// табличного поля "ОтборВОтчете".
// 
&НаСервере
Процедура ОтборВОтчетеВидСравненияПриИзмененииСервер(Ид)
		
	ТекущиеДанные = ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ИзменениеВидаСравнения(ТекущиеДанные);	

КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Значение" табличного поля "ОтборВОтчете".
// 
&НаСервере
Процедура ОтборВОтчетеЗначениеПриИзмененииСервер(Ид)
	
	ТекущиеДанные = ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ОтборВОтчетеЗначениеПриИзменении(ТекущиеДанные);
		
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеТаблицыДанных

// Функция запрашивает у пользователя подтверждение на очистку данных.
// 
// Параметры:
//  вхТекст - Строка.
// 
// Возвращаемое значение:
//  Булево - очищать.
// 
&НаКлиенте
Функция ПодтверждениеОчисткиДанных(вхТекст = "")
	
	Очищать = Истина;
	
	Если Объект.ОборотыПоБюджетам.Количество() > 0  Тогда
		Очищать = Ложь;
		Если ПустаяСтрока(вхТекст) Тогда
			ТекстВопроса = НСтр("ru='Данные будут очищены. Продолжить?';en='Data will be cleared. Continue?'");
		Иначе	
			ТекстВопроса = вхТекст;
		КонецЕсли; 
		Оповещение = Новый ОписаниеОповещения("КомандаОбновитьВопросЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
	КонецЕсли; 
	
	Возврат Очищать;
	
КонецФункции

// Процедура обработчик оповещения "КомандаОбновитьВопросЗавершение".
// 
// Параметры:
// Ответ 			    - КодВозвратаДиалога.
// ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура КомандаОбновитьВопросЗавершение(Ответ, ДополнительныеДанные) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
	     // Выполнение по запросу от пользователя.
		 НачатьОтложенноеОбновлениеДанных();
	КонецЕсли; 
	
КонецПроцедуры

// Процедура выполняет преобразование полученных данных 
// (сдвиг периода, отклонение суммы и количества, распределение по профилю) 
// согласно указанных в обработке настроек.
// 
&НаСервере
Процедура ВыполнитьПреобразованиеДанных()

	ОбрОбъект = РеквизитФормыВЗначение("Объект");
	ОбрОбъект.ВыполнитьПреобразованиеДанных();
	ЗначениеВДанныеФормы(ОбрОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтложенноеОбновлениеДанных(ДопДействие = Неопределено)
	
	Отказ = НЕ ПроверитьЗаполнение();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененыНастройки = Ложь;	
	Если НЕ ЭтоПланированиеДДС Тогда	
		СкрытьНастройки();
		ОбработатьИзменениеНастроек(ЭтотОбъект);	
	КонецЕсли;
		
	Объект.ОборотыПоБюджетам.Очистить();
	Объект.ТаблицаРезультат.Очистить();
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДопДействие", ДопДействие);
	
	ДлительнаяОперация    = НачатьОтложенноеОбновлениеДанныхНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОтложенноеОбновлениеДанныхЗавершение", ЭтотОбъект, ДопПараметры);
	ПараметрыОжидания     = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьОтложенноеОбновлениеДанныхНаСервере()
			
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
	Режимы = Обработки.бит_ПолучениеДанныхБюджета.РежимыПолученияДанных(Объект.РежимЗаполнения);	
	Если НЕ Режимы.ЭтоПолучениеБюджета И НЕ Режимы.ЭтоПроизвольныеПараметры Тогда
				
		СхемаКомпоновки 	= ПолучитьИзВременногоХранилища(АдресСКД);	
		НастройкиКомпоновки = Компоновщик.ПолучитьНастройки();
		
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "НачалоПериода", Объект.Период.ДатаНачала);
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "КонецПериода",  Объект.Период.ДатаОкончания);
		Если Режимы.ЭтоГрафикДоговоров Тогда
			бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "РежимВыбораСуммы", Объект.РежимВыбораСуммы);
		КонецЕсли;
	
		ВыполняемыйМетод = "Обработки.бит_ПолучениеДанныхБюджета.ПолучитьДанныеСКД";
		Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
			СхемаКомпоновки, НастройкиКомпоновки, Объект.ЗаполнятьКомментарийКСтрокамБюджета);
		
	Иначе	
						
		ДанныеОбъекта = Новый Структура("ИсточникДанных, Период, НастройкаПулаПодключений");
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
		
		ДанныеФормы = Новый Структура;
		ДанныеФормы.Вставить("ОтборВОтчете", 	 РеквизитФормыВЗначение("ОтборВОтчете"));
		ДанныеФормы.Вставить("ТаблицаПараметры", РеквизитФормыВЗначение("ТаблицаПараметры"));
	
		ВыполняемыйМетод    = "Обработки.бит_ПолучениеДанныхБюджета.ПолучитьДанные";
		Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
			ДанныеОбъекта, ДанныеФормы);		
		
	КонецЕсли;
		
КонецФункции
			
&НаКлиенте
Процедура ОтложенноеОбновлениеДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении, по причине: %1'"); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе	
		ОбновлениеДанныхЗавершениеНаСервере(Результат.АдресРезультата);
	КонецЕсли;
	
	Если ДополнительныеПараметры.ДопДействие <> Неопределено Тогда
		ОповеститьОВыбореДанных(ДополнительныеПараметры.ДопДействие);
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Процедура ОбновлениеДанныхЗавершениеНаСервере(АдресРезультата)
	
	ТаблицаРезультат = ПолучитьИзВременногоХранилища(АдресРезультата);		
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если Не ЗначениеЗаполнено(ТаблицаРезультат) Тогда		
		ТекстСообщения = НСтр("ru='Нет данных, удовлетворяющих отбору';en='No data satisfying the selection'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
		Возврат;		
	КонецЕсли;
	
	Режимы = Обработки.бит_ПолучениеДанныхБюджета.РежимыПолученияДанных(Объект.РежимЗаполнения);
	Если Режимы.ЭтоПолучениеБюджета ИЛИ Режимы.ЭтоПроизвольныеПараметры Тогда
		Если Режимы.ЭтоПроизвольныеПараметры Тогда
			КолонкиТаблицыИсточника = ТаблицаРезультат.Колонки;
			Если КолонкиТаблицыИсточника.Найти("СуммаСценарий") = Неопределено
				И КолонкиТаблицыИсточника.Найти("Сумма") <> Неопределено Тогда
				КолонкиТаблицыИсточника.Сумма.Имя = "СуммаСценарий";
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Объект.ТаблицаРезультат.Загрузить(ТаблицаРезультат);
	
	Если Режимы.ЭтоПроизвольныеПараметры Тогда
		СоответствиеОграничений = Новый Соответствие;
		Для каждого КолонкаТаблицы Из ТаблицаРезультат.Колонки Цикл
			ИмяКолонки        = КолонкаТаблицы.Имя;
			ЭлементУправления = Элементы.Найти("ОборотыПоБюджетам" + ИмяКолонки);
			Если ЭлементУправления = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СоответствиеОграничений.Вставить(ИмяКолонки, ЭлементУправления.ОграничениеТипа);
		КонецЦикла;
		Для каждого СтрокаРезультата Из Объект.ТаблицаРезультат Цикл
			Для каждого ЭлементОграничения Из СоответствиеОграничений Цикл
				СтрокаРезультата[ЭлементОграничения.Ключ] = ЭлементОграничения.Значение.ПривестиЗначение(СтрокаРезультата[ЭлементОграничения.Ключ]);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ВыполнитьПреобразованиеДанных();

КонецПроцедуры

#КонецОбласти

#Область ПереносОбъектовИзОбработки

// Функция формирует структуру результата.
// 
// Параметры:
//  Режим - Строка.
//  
// Возвращаемое значение:
//  Струкутура.
// 
&НаСервере
Функция СформироватьСтруктуруРезультата(Режим, ИдентификаторВладельца)

	РезСтруктура = Новый Структура;
	РезСтруктура.Вставить("Режим", 							 Режим);
	РезСтруктура.Вставить("ИспользоватьЗначенияПоУмолчанию", Объект.ИспользоватьЗначенияПоУмолчанию);
	РезСтруктура.Вставить("Валюта", 					     Объект.ВалютаОбработки);
	РезСтруктура.Вставить("Курс", 							 Объект.КурсОбработки);
	РезСтруктура.Вставить("Кратность", 						 Объект.КратностьОбработки);
	
	Если ЭтоПланированиеДДС Тогда
		ТаблицаБюджета = Объект.ОборотыПоБюджетам.Выгрузить();
	Иначе	
		Отбор          = Новый Структура("Выполнять", Истина);
		ТаблицаБюджета = Объект.ОборотыПоБюджетам.Выгрузить(Отбор);
	КонецЕсли;
	
	РезСтруктура.Вставить("КоличествоСтрок", ТаблицаБюджета.Количество());
	
	АдресОборотовПоБюджетамВХранилище = ПоместитьВоВременноеХранилище(ТаблицаБюджета, ИдентификаторВладельца);
	РезСтруктура.Вставить("АдресОборотовПоБюджетам", АдресОборотовПоБюджетамВХранилище);
	
	Возврат РезСтруктура;
	
КонецФункции

// Процедура опововещает форму-владельца о выборе данных.
// 
// Параметры:
//  Режим - Строка.
// 
&НаКлиенте
Процедура ОповеститьОВыбореДанных(Режим)

	РезСтруктура = СформироватьСтруктуруРезультата(Режим, ВладелецФормы.УникальныйИдентификатор);
	
	Если РезСтруктура.КоличествоСтрок > 0 Тогда
		Оповестить("ПолучениеДанныхБюджета", РезСтруктура, ВладелецФормы.УникальныйИдентификатор);
	Иначе
		ТекстСообщения = НСтр("ru='Не выбраны строки для переноса в документ.';
							  |en='Line to be transfered to the document are not selected.'");
		ПоказатьПредупреждение(, ТекстСообщения,, НСтр("ru='Перенос в документ';en='Transfer to paper'"));
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#КонецОбласти
