
#Область СерверныеПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область СерверныеПроцедурыИФункцииОбщегоНазначения

// Процедура управляет аидимость и доступностью элементов формы.
// 
&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	ВерсионированиеВключено = Ложь;
	
	Элементы.ГруппаВерсионированиеОтключено.Видимость = Не ВерсионированиеВключено;
	
КонецПроцедуры // УстановитьВидимостьДоступность()

#КонецОбласти

