
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыполнитьПодготовкуОбмена(Команда)
	
	Состояние(НСтр("ru='Выполняется подготовка обмена...';
				   |en='You prepare the exchange ...'"));
	КомандаВыполнитьПодготовкуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура КомандаВыполнитьПодготовкуНаСервере()
	
	бит_мдм.ВыполнитьПодготовкуОбмена();
	
КонецПроцедуры

#КонецОбласти