
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьНастройкиПоУмолчанию(Команда)
	
	ДобавитьНастройкиПоУмолчаниюСервер();
			
КонецПроцедуры // ДобавитьНастройкиПоУмолчанию()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - добавляет настройки по умолчанию.
// 
&НаСервере
Процедура ДобавитьНастройкиПоУмолчаниюСервер()
	
	РегистрыСведений.бит_вго_НастройкиПроведенияСверкиВГО.ДобавитьНастройкиВГОПоУмолчанию();
	Элементы.Список.Обновить();
	
КонецПроцедуры // ДобавитьНастройкиПоУмолчаниюСервер()

#КонецОбласти


