#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
		      	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли; 

	Если Найти(Код, ".") <> 0 Тогда
		Код = СтрЗаменить(Код, ".", "");
	КонецЕсли;
	
	Если Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда 	
		Возврат;  	
	КонецЕсли; 
	
	Имена = Справочники.бит_ВидыСоответствийАналитик.ЗарезервированныеИмена();
	
	Если НЕ Имена.НайтиПоЗначению(Код) = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Имя ""%1"" зарезервировано для поставляемых соответствий.';
							  |en='The name ""%1"" is reserved for delivered correspondence.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Код);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Код", ,Отказ);
	КонецЕсли; 
	
	Если Соотношение = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКоМногим Тогда
		Пояснение = НСтр("ru = 'Соотношение Многие ко многим не поддерживается.'"); 
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", 
							"Корректность", НСтр("ru = 'Соотношение'"),,, Пояснение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Соотношение", "Объект", Отказ); 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли