//{{********************************}}//
//{{  			БИТ ЛТ5.37 			}}//
//{{********************************}}//
Процедура ПроверитьКоличествоВСтрокеИСерии(Источник, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	Если Не ТранзакцияАктивна() ТОгда
		НачатьТранзакцию();
	КонецЕсли;
	
	Попытка
			
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ДвижениеПродукцииИМатериалов") Тогда
			ИмяТЧ = "Товары";
			ИмяТЧСерий = "Серии";
		Иначе                    
			ИмяТЧ = "ВыходныеИзделия";
			ИмяТЧСерий = "ВыходныеИзделияСерии";
		КонецЕсли;
		мПроверяемыхВидовНоменклатуры = Справочники.бит_ЗначенияПоУмолчанию.ВидыНоменклатурыСПроверкойКоличества.Значения.Выгрузить().ВыгрузитьКОлонку("Значение");
		Если мПроверяемыхВидовНоменклатуры.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		Для каждого стр из Источник[ИмяТЧ] Цикл
			Если ЗначениеЗаполнено(стр.Серия) и мПроверяемыхВидовНоменклатуры.Найти(стр.Номенклатура.ВидНоменклатуры) <> Неопределено Тогда
				ПроверитьКоличествоДлинВСерии(стр.Номенклатура, стр.Серия, стр.Количество, Отказ);
			КонецЕсли;
		КонецЦикла;
		Для каждого стр из Источник[ИмяТЧСерий] Цикл
			Если ЗначениеЗаполнено(стр.Серия) и мПроверяемыхВидовНоменклатуры.Найти(стр.Номенклатура.ВидНоменклатуры) <> Неопределено Тогда
				ПроверитьКоличествоДлинВСерии(стр.Номенклатура, стр.Серия, стр.Количество, Отказ);
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();       
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При проверке длин в серии возникли ошибки." 
															+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Отказ = Истина;
	КонецПопытки;

КонецПроцедуры  

Процедура ПроверитьКоличествоДлинВСерии(Номенклатура, Серия, Количество, Отказ) 
	
	Если Серия.бит_ПереченьДлинНаБарабане.Количество() = 0 Тогда
		СерияОбъект = Серия.ПолучитьОбъект();
		нов = СерияОбъект.бит_ПереченьДлинНаБарабане.Добавить();
		нов.Длина = Количество;
		СерияОбъект.Записать();
	Иначе
		ОбщаяДлинаВСерии = Серия.бит_ПереченьДлинНаБарабане.Итог("Длина");
		Если ОбщаяДлинаВСерии <> Количество Тогда
			Отказ = Истина;                                                
			ТекстСообщения =СтрШаблон("Сумма длин (%1) в серии %2 для номенклатуры %3 не соответствует количеству (%4) в строке", ОбщаяДлинаВСерии, Серия, Номенклатура, Количество);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Серия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
