&После("ПриСозданииНаСервере")
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//Первыйбит ЛТ1 ЛапшовГ "GVLapshov@1cbit.ru" 31.01.2025 +
	НовыйЭлемент = Элементы.Добавить("бит_ГруппаДополнительныеРеквизиты", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "(бит) Дополнительно"; 

	НовыйЭлемент = Элементы.Добавить("бит_НаименованиеСФормойСобственности", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НаименованиеСФормойСобственности"; 
	
	НовыйЭлемент = Элементы.Добавить("бит_ФормаСобственности", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ФормаСобственности";
	
	НовыйЭлемент = Элементы.Добавить("бит_Зона", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Зона";
	
	НовыйЭлемент = Элементы.Добавить("бит_ИДКлиента", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ИДКлиента";
	//Первыйбит ЛТ1 ЛапшовГ "GVLapshov@1cbit.ru" 31.01.2025 -
			
КонецПроцедуры