
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Режим", Режим);	
	Если Параметры.Свойство("Переменные") Тогда		
		Для каждого Имя Из Параметры.Переменные Цикл			
			Переменные.Добавить(Имя);			
		КонецЦикла; 		
	КонецЕсли; 
	
	ОписаниеСправочники = Справочники.ТипВсеСсылки();
	ОписаниеДокументы   = Документы.ТипВсеСсылки();
	
	ОбновитьДерево();	
	
	Если Поля.ПолучитьЭлементы().Количество() = 0 Тогда		
		ТекстСообщения = НСтр("ru='Нет полей для выбора.';en='No fields to select.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоля

&НаКлиенте
Процедура ПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	РезСтруктура = СформироватьРезСтруктуру(Элементы.Поля.ТекущаяСтрока);
	Если ТипЗнч(РезСтруктура) = Тип("Структура") Тогда		
		Закрыть(РезСтруктура);		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляПередРазворачиванием(Элемент, Строка, Отказ)
	
	Если Отказ Тогда	
		Возврат;	
	КонецЕсли; 
	
	Если Строка = Неопределено Тогда	
		Возврат;	
	КонецЕсли; 
	
	РазвернутьПодчиненные(Строка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ТекущаяСтрока = Элементы.Поля.ТекущаяСтрока;
	РезСтруктура = СформироватьРезСтруктуру(ТекущаяСтрока);
	Закрыть(РезСтруктура);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьДерево();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура обновляет дерево полей.
// 
&НаСервере
Процедура ОбновитьДерево()
	
	ДанныеДерева = Поля.ПолучитьЭлементы();
	ДанныеДерева.Очистить();
	
	Если Режим = "ФункцияЗависимыхОборотов" Тогда
		
		// Поля регистра настройки зависимых оборотов.
		ЭлементВерх = ДанныеДерева.Добавить();
		ПараметрыЭлемента = ПараметрыЭлементаДерева();
		ПараметрыЭлемента.Картинка = БиблиотекаКартинок.бит_Реквизиты;
		ЗаполнитьЭлементДерева(ЭлементВерх, "НастройкаРасчета", ПараметрыЭлемента);
		Коллекция = ЭлементВерх.ПолучитьЭлементы();		
		
		МетаРесурсы = Метаданные.РегистрыСведений.бит_ЗависимыеОбороты.Ресурсы;
		
		Для каждого мета Из МетаРесурсы Цикл		
			Имя = мета.Имя;
			Элемент = Коллекция.Добавить();
			ПараметрыЭлемента = ПараметрыЭлементаДерева();
			ПараметрыЭлемента.Доступно = Истина;
			ЗаполнитьЭлементДерева(Элемент, Имя, ПараметрыЭлемента);		
		КонецЦикла; 
		
		// Реквизиты строк бюджета.
		ЭлементСтрокаИсточник = ДанныеДерева.Добавить();
		ПараметрыЭлемента = ПараметрыЭлементаДерева();
		ПараметрыЭлемента.Картинка = БиблиотекаКартинок.бит_Реквизиты;
		ЗаполнитьЭлементДерева(ЭлементСтрокаИсточник, "СтрокаИсточник", ПараметрыЭлемента);
		КоллекцияСтрокаИсточник = ЭлементСтрокаИсточник.ПолучитьЭлементы();
		
		ЭлементСтрокаПриемник = ДанныеДерева.Добавить();
		ПараметрыЭлемента = ПараметрыЭлементаДерева();
		ПараметрыЭлемента.Картинка = БиблиотекаКартинок.бит_Реквизиты;
		ЗаполнитьЭлементДерева(ЭлементСтрокаПриемник, "СтрокаПриемник", ПараметрыЭлемента);
		КоллекцияСтрокаПриемник = ЭлементСтрокаПриемник.ПолучитьЭлементы();
		
		
		Исключения = Новый Массив;
		Исключения.Добавить("КомментарийРасчета");
		
		МетаРеквизиты = Метаданные.Документы.бит_БюджетнаяОперация.ТабличныеЧасти.ЗависимыеОбороты.Реквизиты;
		
		Для каждого метаРеквизит Из МетаРеквизиты Цикл
			
			ИмяРеквизита = метаРеквизит.Имя;
			Если Исключения.Найти(ИмяРеквизита) <> Неопределено Тогда				
				Продолжить;				
			КонецЕсли; 
			
			Элемент = КоллекцияСтрокаИсточник.Добавить();
			ПараметрыЭлемента = ПараметрыЭлементаДерева();
			ПараметрыЭлемента.Тип 	   = метаРеквизит.Тип;
			ПараметрыЭлемента.Доступно = Истина;
			ЗаполнитьЭлементДерева(Элемент, ИмяРеквизита, ПараметрыЭлемента, Истина);
			Элемент = КоллекцияСтрокаПриемник.Добавить();
			ПараметрыЭлемента = ПараметрыЭлементаДерева();
			ПараметрыЭлемента.Тип 	   = метаРеквизит.Тип;
			ПараметрыЭлемента.Доступно = Истина;
			ЗаполнитьЭлементДерева(Элемент, ИмяРеквизита, ПараметрыЭлемента, Истина);			
			
		КонецЦикла; 
		
		ЭлементСценарий = ДанныеДерева.Добавить();
		ПараметрыЭлемента = ПараметрыЭлементаДерева();
		ПараметрыЭлемента.Картинка = БиблиотекаКартинок.бит_Реквизиты;
		ЗаполнитьЭлементДерева(ЭлементСценарий, "Сценарий", ПараметрыЭлемента);
		ЭлементСценарий.Доступно = Истина;
				
	ИначеЕсли Режим = "ФункцияФинансовыхДоговоров" Тогда
		
		СтруктураКолонок = Обработки.бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.ПараметрыПериодаРасчета(Ложь);
		
		// Добавим ветку ПараметрыПлатежа.
		ЭлементВерх = ДанныеДерева.Добавить();
		ПараметрыЭлемента = ПараметрыЭлементаДерева();
		ПараметрыЭлемента.Картинка = БиблиотекаКартинок.бит_Реквизиты;
		ЗаполнитьЭлементДерева(ЭлементВерх, "ПараметрыПлатежа", ПараметрыЭлемента);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_ВидыПараметровФинансовыхДоговоров.Код
		|ИЗ
		|	ПланВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров КАК бит_ВидыПараметровФинансовыхДоговоров";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Коллекция = ЭлементВерх.ПолучитьЭлементы();
		
		Пока Выборка.Следующий() Цикл
			Элемент = Коллекция.Добавить();			
			Имя = Выборка.Код;
			ПараметрыЭлемента = ПараметрыЭлементаДерева();
			ПараметрыЭлемента.Доступно = Истина;
			ЗаполнитьЭлементДерева(Элемент, Имя, ПараметрыЭлемента);
		КонецЦикла;
		
		// Добавим ветку ДанныеПериодаРасчета.
		ЭлементВерх = ДанныеДерева.Добавить();
		ПараметрыЭлемента = ПараметрыЭлементаДерева();
		ПараметрыЭлемента.Картинка = БиблиотекаКартинок.бит_Реквизиты;
		ЗаполнитьЭлементДерева(ЭлементВерх, "ДанныеПериодаРасчета", ПараметрыЭлемента);
		
		Коллекция = ЭлементВерх.ПолучитьЭлементы();
		
		Для Каждого ТекущаяКолонка Из СтруктураКолонок Цикл
		
			Имя = ТекущаяКолонка.Ключ;
			Элемент = Коллекция.Добавить();
			ПараметрыЭлемента = ПараметрыЭлементаДерева();
			ПараметрыЭлемента.Тип 	   = ТекущаяКолонка.Значение;
			ПараметрыЭлемента.Доступно = Истина;
			ЗаполнитьЭлементДерева(Элемент, Имя, ПараметрыЭлемента, Истина);
		
		КонецЦикла;
		
	КонецЕсли; 
	
	// Коллекция переменных.
	Если Переменные.Количество() > 0 Тогда
		
		ЭлементВерх = ДанныеДерева.Добавить();
		ПараметрыЭлемента = ПараметрыЭлементаДерева();
		ПараметрыЭлемента.Картинка = БиблиотекаКартинок.бит_Реквизиты;
		ЗаполнитьЭлементДерева(ЭлементВерх, "Переменные", ПараметрыЭлемента);
		
		Коллекция = ЭлементВерх.ПолучитьЭлементы();
		
		Для каждого элСписка Из Переменные Цикл		
			Элемент = Коллекция.Добавить();
			ПараметрыЭлемента = ПараметрыЭлементаДерева();
			ПараметрыЭлемента.Доступно = Истина;
			ЗаполнитьЭлементДерева(Элемент, элСписка.Значение, ПараметрыЭлемента, Истина);		
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры // ОбновитьДерево()

&НаСервере
Функция ПараметрыЭлементаДерева()

	ПараметрыЭлементаДерева = Новый Структура;
	ПараметрыЭлементаДерева.Вставить("Синоним" 	, "");
	ПараметрыЭлементаДерева.Вставить("Тип"	   	, Новый ОписаниеТипов("Строка"));
	ПараметрыЭлементаДерева.Вставить("Доступно" , Ложь);
	ПараметрыЭлементаДерева.Вставить("Картинка" , БиблиотекаКартинок.бит_Реквизит);
	
	Возврат ПараметрыЭлементаДерева;

КонецФункции

// Процедура заполняет строку дерева полей.
// 
// Параметры:
//  ЭлементДерева 			- Строка.
//  Имя 		  			- Строка.
//  ПараметрыЭлементаДерева - Структура.
//  ДобавлятьПодчиненные    - Булево (По умолчанию = Ложь).
// 
&НаСервере
Процедура ЗаполнитьЭлементДерева(ЭлементДерева, Имя, ПараметрыЭлементаДерева = Неопределено, ДобавлятьПодчиненные = Ложь)
	
	Если ПараметрыЭлементаДерева = Неопределено Тогда
		ПараметрыЭлементаДерева = ПараметрыЭлементаДерева();
	КонецЕсли;
	Если ПустаяСтрока(ПараметрыЭлементаДерева.Синоним) Тогда
		ПараметрыЭлементаДерева.Синоним = Имя;
	КонецЕсли;
			
	ЭлементДерева.Имя = Имя;
	ЗаполнитьЗначенияСвойств(ЭлементДерева, ПараметрыЭлементаДерева);
		
	Если ДобавлятьПодчиненные Тогда
	
		МассивТипов = ЭлементДерева.Тип.Типы();		
		Для каждого Тип Из МассивТипов Цикл
		
			Если ОписаниеСправочники.СодержитТип(Тип) ИЛИ ОписаниеДокументы.СодержитТип(Тип) Тогда				
				Коллекция   = ЭлементДерева.ПолучитьЭлементы();
				ЭлементПодч = Коллекция.Добавить();
				ЗаполнитьЭлементДерева(ЭлементПодч, "СлужебнаяДляРазворота");
				Прервать;			
			КонецЕсли; 
		
		КонецЦикла; 
	
	КонецЕсли; 
	
КонецПроцедуры

// Функция формирует строку имен с разделителями точка по подчиненным строкам дерева. 
// Рекурсия.
// 
// Параметры:
// 	СтрокаСтарт        	 - СтрокаДереваЗначений.
//
// Возвращаемое значение:
// 	РезСтрока        	 - Строка.
// 
&НаСервере
Функция СобратьИмена(СтрокаСтарт)

	РезСтрока  = "";
	Если СтрокаСтарт <> Неопределено Тогда
		
		РезСтрока = СтрокаСтарт.Имя;
		
		СтрокаРодитель = СтрокаСтарт.ПолучитьРодителя();		
		Если СтрокаРодитель <> Неопределено Тогда			
			РезСтрока = СобратьИмена(СтрокаРодитель) + "." + РезСтрока;			
		КонецЕсли;
		
	КонецЕсли; 

	Возврат РезСтрока;
	
КонецФункции

// Функция формирует результирующую структуру для возврата.
// 
// Параметры:
//  ИдСтроки - Число.
// 
// Возвращаемое значение:
//  Структура.
// 
&НаСервере
Функция СформироватьРезСтруктуру(Знач ИдСтроки)
	
	РезСтруктура = Неопределено;
	
	Если ТипЗнч(ИдСтроки) = Тип("Число") Тогда
		
		ТекущаяСтрока = Поля.НайтиПоИдентификатору(ИдСтроки);		
		Если ТекущаяСтрока <> Неопределено И ТекущаяСтрока.Доступно Тогда			
			РезСтруктура = Новый Структура("Имя");
			РезСтруктура.Имя = СобратьИмена(ТекущаяСтрока);			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат РезСтруктура;
	
КонецФункции

// Процедура добавляет в дерево подчиненные реквизиты.
// 
// Параметры:
//  ИД  - Число
// 
&НаСервере
Процедура РазвернутьПодчиненные(Знач ИД)

	СтрокаДерева = Поля.НайтиПоИдентификатору(ИД);
	Если СтрокаДерева = Неопределено Тогда	
		Возврат;	
	КонецЕсли; 
	
	ДобавитьОписаниеРеквизитов(СтрокаДерева,"Справочники", ОписаниеСправочники , "СправочникСсылка");
	ДобавитьОписаниеРеквизитов(СтрокаДерева,"Документы",   ОписаниеДокументы,     "ДокументСсылка");

КонецПроцедуры

// Процедура добавляет в дерево строки с описанием реквизитов объекта.
// 
// Параметры:
// 	СтрокаДерева       	 -	ДанныеФормыЭлементДерева.
// 	ИмяКоллекции       	 -	Строка.
// 	ОписаниеКоллекции  	 -	ОписаниеТипов.
// 	НачалоИмениТипа    	 -	Строка.
// 
&НаСервере
Процедура ДобавитьОписаниеРеквизитов(СтрокаДерева, ИмяКоллекции, ОписаниеКоллекции, НачалоИмениТипа)

	Если ТипЗнч(СтрокаДерева) <> Тип("ДанныеФормыЭлементДерева") Тогда	
		Возврат;	
	КонецЕсли; 
	
	Для каждого Тип Из СтрокаДерева.Тип.Типы() Цикл
		
		Если ОписаниеКоллекции.СодержитТип(Тип) Тогда
			
			РезСтруктура = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоОписаниюТипов(СтрокаДерева.Тип,ИмяКоллекции,НачалоИмениТипа);
			Если РезСтруктура <> Неопределено Тогда
				
				Коллекция = СтрокаДерева.ПолучитьЭлементы();

				// Убедимся, что разворачивается служебная строка.
				Если Коллекция.Количество() <> 1 Тогда			   
					Продолжить;			   
				КонецЕсли; 
			   
				ПерваяСтрока = Коллекция[0];				
				Если ПерваяСтрока.Имя = "СлужебнаяДляРазворота" Тогда				   
					Коллекция.Очистить();				   
				Иначе				   
					Продолжить;				   
				КонецЕсли; 
			   
				// Стандартные реквизиты
				Если ИмяКоллекции = "Справочники" Тогда

					ЭлементПодч = Коллекция.Добавить();
					ЗаполнитьЭлементДерева(ЭлементПодч, "Код");

					ЭлементПодч = Коллекция.Добавить();
					ЗаполнитьЭлементДерева(ЭлементПодч, "Наименование");

				ИначеЕсли ИмяКоллекции = "Документы" Тогда	

					ЭлементПодч = Коллекция.Добавить();
					ЗаполнитьЭлементДерева(ЭлементПодч, "Дата");

					ЭлементПодч = Коллекция.Добавить();
					ЗаполнитьЭлементДерева(ЭлементПодч, "Номер");

					ЭлементПодч = Коллекция.Добавить();
					ЗаполнитьЭлементДерева(ЭлементПодч, "Проведен");

				КонецЕсли; 
				
				// Реквизиты объекта
				Для каждого Мета Из Метаданные[ИмяКоллекции][РезСтруктура.Имя].Реквизиты Цикл
					
				    ЭлементПодч = Коллекция.Добавить();
					ПараметрыЭлемента = ПараметрыЭлементаДерева();
					ПараметрыЭлемента.Синоним  = Мета.Синоним;
					ПараметрыЭлемента.Тип 	   = Мета.Тип;
					ПараметрыЭлемента.Доступно = Истина;
					ЗаполнитьЭлементДерева(ЭлементПодч, Мета.Имя, ПараметрыЭлемента, Истина);
					
				КонецЦикла;
				
				Прервать;
				
			КонецЕсли; 
			
		КонецЕсли; // Есть тип
		
	КонецЦикла; // По массиву типов

КонецПроцедуры // ДобавитьОписаниеРеквизитов()

#КонецОбласти
