#Область ОписаниеПеременных

&НаКлиенте
Перем ИдетПоискПоСтруктуреХранения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИменаВБазеДанныхВТерминах = "1С";
	
	Состояние = НСтр("ru = 'Идет поиск по структуре хранения...';
					|en = 'Storage structure search in progress...'");
	ИТК_ФормаКлиентСервер.ОтображениеСостоянияТабличногоДокумента(Элементы.ИдетПоискПоСтруктуреХраненияТабличныйДокумент, Состояние);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИТК_ОбщийКлиент.ОбработчикПриОткрытии(Отказ);
	
	ИдетПоискПоСтруктуреХранения = Ложь;

	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПоискПриИзменении(Элемент)
	
	ОбновитьРезультатПоискаПоСтруктуреХранения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатыПоиска

&НаКлиенте
Процедура РезультатыПоискаВыбор(Элемент, ИдентификаторВыбраннойСтроки, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ВыбраннаяСтрока = РезультатыПоиска.НайтиПоИдентификатору(ИдентификаторВыбраннойСтроки);
	ПолноеИмяМетаданных = ВыбраннаяСтрока.Метаданные;
	
	Если ЗначениеЗаполнено(ПолноеИмяМетаданных) Тогда
		ИТК_ТуллкитКлиент.ОткрытьИнструмент(ИТК_Перечисления.ИнструментСтруктураХранения(), ПолноеИмяМетаданных);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.РезультатыПоиска.Видимость = НЕ ИдетПоискПоСтруктуреХранения;
	Элементы.ИдетПоискПоСтруктуреХраненияТабличныйДокумент.Видимость = ИдетПоискПоСтруктуреХранения;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРезультатПоискаПоСтруктуреХранения()
	
	ИдетПоискПоСтруктуреХранения = Истина;
	
	ДлительнаяОперация = ОбновитьРезультатПоискаПоСтруктуреХраненияНаСервере(УникальныйИдентификатор, Поиск, ИменаВБазеДанныхВТерминах);
	
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеРезультатаПоискаПоСтруктуреХранения", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьРезультатПоискаПоСтруктуреХраненияНаСервере(УникальныйИдентификатор, Поиск, ИменаВБазеДанныхВТерминах)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Поиск", Поиск);
	ПараметрыПроцедуры.Вставить("ИменаВБазеДанныхВТерминах", ИменаВБазеДанныхВТерминах);
	
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_ПоискПоСтруктуреХранения.РезультатПоиска", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноОбновлениеРезультатаПоискаПоСтруктуреХранения(Результат, ДополнительныеПараметры) Экспорт
	
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбновитьРезультатПоискаПоСтруктуреХраненияНаФорме(Результат.АдресРезультата);
	КонецЕсли;

	ИдетПоискПоСтруктуреХранения = Ложь;
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ОбновитьРезультатПоискаПоСтруктуреХраненияНаФорме(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	КоличествоСтрок = Результат.Строки.Количество();
	МаксимумОтображаемыхСтрок = ИТК_ПоискПоСтруктуреХранения.МаксимумОтображаемыхСтрок();
	
	ВРезультатеПоискаОтображенаТолькоЧасть = (КоличествоСтрок > МаксимумОтображаемыхСтрок);
	Элементы.ГруппаПояснениеВРезультатеПоискаОтображенаТолькоЧасть.Видимость = ВРезультатеПоискаОтображенаТолькоЧасть;
	
	ЗначениеВРеквизитФормы(Результат, "РезультатыПоиска");
	
	// Удаление лишних строк
	УдаляемыеСтроки = Новый Массив;
	Для ИндексСтроки = МаксимумОтображаемыхСтрок По КоличествоСтрок - 1 Цикл 
		
		Строка = РезультатыПоиска.ПолучитьЭлементы()[ИндексСтроки];
		УдаляемыеСтроки.Добавить(Строка);
		
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл 
		РезультатыПоиска.ПолучитьЭлементы().Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	// Установка фокуса на результат
	ЭлементРезультат = Элементы.РезультатыПоиска;
	
	Если ЗначениеЗаполнено(РезультатыПоиска.ПолучитьЭлементы()) Тогда
		
		ПерваяСтрока = РезультатыПоиска.ПолучитьЭлементы()[0];
		ЭлементРезультат.ТекущаяСтрока = ПерваяСтрока.ПолучитьИдентификатор();
		
	КонецЕсли;
	
	ТекущийЭлемент = ЭлементРезультат;
	
КонецПроцедуры

#КонецОбласти