
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура бит_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда

		ЗаполнитьПоПоступлениюТоваровУслуг(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровНаСклад") Тогда

		ЗаполнитьПоПоступлениюТоваров(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") Тогда

		ЗаполнитьПоПриемкеТоваровНаХранение(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда

		ЗаполнитьПоЗаказуПоставщику(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПорчаТоваров") Тогда

		ЗаполнитьПоПорчеТоваров(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СборкаТоваров") Тогда

		ЗаполнитьПоСборкеТоваров(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПрочееОприходованиеТоваров") Тогда

		ЗаполнитьПоПрочемуОприходованиюТоваров(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИзменениеАссортимента") Тогда

		ЗаполнитьПоИзменениюАссортимента(
		ДанныеЗаполнения,
		ДанныеЗаполнения);
		//++ НЕ УТКА
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПлановаяКалькуляция2_2") Тогда
		Документы.ПлановаяКалькуляция2_2.ЗаполнитьДокументУстановкаЦенНоменклатуры(ЭтотОбъект, ДанныеЗаполнения);
		//-- НЕ УТКА

		//++ НЕ УТ
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов") Тогда

		ЗаполнитьПоДвижениюПродукцииИМатериалов(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

		//-- НЕ УТ
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВводОстатков") Тогда

		ЗаполнитьПоВводуОстатков(
		ДанныеЗаполнения,
		ДанныеЗаполнения);
		
	#Вставка //ЛТ0.1 Переопределим типовой механизм, т.к. через него не загружается цена    
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ЗагрузкаИзПлановойКалькуляции")Тогда
		
		Если ДанныеЗаполнения.Свойство("ТаблицаНоменклатуры") Тогда

			бит_ЗаполнитьПоТаблицеНоменклатуры(
			ДанныеЗаполнения);

		КонецЕсли;
		
	#КонецВставки //ЛТ0.1
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		Если ДанныеЗаполнения.Свойство("ТаблицаНоменклатуры") Тогда

			ЗаполнитьПоТаблицеНоменклатуры(
			ДанныеЗаполнения);

		КонецЕсли;

	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);

КонецПроцедуры    

Процедура бит_ЗаполнитьПоТаблицеНоменклатуры(ДанныеЗаполнения)
	
	ТаблицаНоменклатуры = ПолучитьИзВременногоХранилища(ДанныеЗаполнения.ТаблицаНоменклатуры); // ТаблицаЗначений
	
	Товары2_5.Загрузить(ТаблицаНоменклатуры);
	
	ТаблицаНоменклатуры.Свернуть("ВидЦены");
	
	ВидыЦен.Загрузить(ТаблицаНоменклатуры);
	
	Дата = ДанныеЗаполнения.Дата;
		
КонецПроцедуры
