
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеКоманды

&НаКлиенте
Процедура ДоступныеКомандыПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеКомандыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для каждого КомандаТелеграм Из ВыбранноеЗначение Цикл
		
		СтрОтбор = Новый Структура("КомандаТелеграм", КомандаТелеграм);
		МассивКоманд = Объект.ДоступныеКоманды.НайтиСтроки(СтрОтбор);
		
		Если МассивКоманд.Количество() < 1 Тогда

			НоваяСтрока = Объект.ДоступныеКоманды.Добавить();
			НоваяСтрока.КомандаТелеграм = КомандаТелеграм;
		
		КонецЕсли; 
	КонецЦикла;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеКомандыКомандаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоступныеКоманды.ТекущиеДанные;
	ДанныеКоманды = ДанныеКомандыТелеграм(ТекущиеДанные.КомандаТелеграм);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборКоманд(Команда)
	
	ПараметрыПередачи = Новый Структура("МножественныйВыбор, РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина, Ложь); 
	ОткрытьФорму("Справочник.бит_КомандыБотуТелеграм.ФормаВыбора", ПараметрыПередачи,Элементы.ДоступныеКоманды,ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбязательноЗаполнениеПользователя()
	
	ТаблицаКоманд = Объект.ДоступныеКоманды.Выгрузить(, "КомандаТелеграм");
	КомандыЧата   = ТаблицаКоманд.ВыгрузитьКолонку("КомандаТелеграм");
	Возврат Справочники.бит_ЧатыTelegram.ОбязательноЗаполнениеПользователя(КомандыЧата);
	
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗаполнитьАтрибутыКомандТелеграм();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАтрибутыКомандТелеграм()
	
	Если Объект.ДоступныеКоманды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КомандыТелеграм = Объект.ДоступныеКоманды.Выгрузить(, "КомандаТелеграм").ВыгрузитьКолонку("КомандаТелеграм");
	ДанныеКоманд    = ДанныеКомандТелеграм(КомандыТелеграм);
	
	Для каждого СтрокаКоманды Из Объект.ДоступныеКоманды Цикл
		КомандаТелеграм = СтрокаКоманды.КомандаТелеграм;
		ДанныеКоманды   = ДанныеКоманд.Получить(КомандаТелеграм);
		Если ДанныеКоманды = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаКоманды, ДанныеКоманды);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.Пользователь.АвтоОтметкаНезаполненного = ОбязательноЗаполнениеПользователя();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовоеОписаниеДанныхКоманды()
	
	ДанныеКоманды = Новый Структура;
	ДанныеКоманды.Вставить("Определение", "");
	ДанныеКоманды.Вставить("ТекстКлавиатуры", "");
	Возврат ДанныеКоманды;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеКомандыТелеграм(Знач КомандаТелеграм)
	
	ДанныеКоманды = НовоеОписаниеДанныхКоманды();
	
	Если НЕ ЗначениеЗаполнено(КомандаТелеграм) Тогда
		Возврат ДанныеКоманды;
	КонецЕсли;
	
	ДанныеТекущейКоманды = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КомандаТелеграм, "Определение, ТекстКлавиатуры");
	ЗаполнитьЗначенияСвойств(ДанныеКоманды, ДанныеТекущейКоманды);
	
	Возврат ДанныеКоманды;
	
КонецФункции

&НаСервере
Функция ДанныеКомандТелеграм(КомандыТелеграм)
	
	ДанныеКоманд = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КомандыТелеграм.Ссылка КАК КомандаТелеграм,
	|	КомандыТелеграм.Определение КАК Определение,
	|	КомандыТелеграм.ТекстКлавиатуры КАК ТекстКлавиатуры
	|ИЗ
	|	Справочник.бит_КомандыБотуТелеграм КАК КомандыТелеграм
	|ГДЕ
	|	КомандыТелеграм.Ссылка В(&КомандыТелеграм)";
	Запрос.УстановитьПараметр("КомандыТелеграм", КомандыТелеграм);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеКоманды = НовоеОписаниеДанныхКоманды();
		ЗаполнитьЗначенияСвойств(ДанныеКоманды, Выборка);
		ДанныеКоманд.Вставить(Выборка.КомандаТелеграм, ДанныеКоманды);
	КонецЦикла;
	
	Возврат ДанныеКоманд;
	
КонецФункции

#КонецОбласти
