#Область ПрограммныйИнтерфейс

// Инициализируем форму
//
// Параметры:
//  Форма - Форма - Форма
//
Процедура Инициализировать(Форма) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ИТК_Форма.ДобавитьРеквизит(ДобавляемыеРеквизиты, "Ошибки", "ФорматированнаяСтрока");
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ПолеОшибки = ЭлементыФормы.Добавить("Ошибки", Тип("ПолеФормы"));
	ПолеОшибки.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеОшибки.ПутьКДанным = "Ошибки";
	ПолеОшибки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеОшибки.Заголовок = НСтр("ru = 'Ошибки';
								|en = 'Errors'");
	ПолеОшибки.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_ОшибкиОбработкаНавигационнойСсылки");
	ПолеОшибки.АвтоМаксимальнаяШирина = Ложь;
	
КонецПроцедуры

#КонецОбласти
