
&После("ОбработкаПроведения")
Процедура бит_ОбработкаПроведения(Отказ, РежимПроведения)
	// {{ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [03.09.2025 15:53:19] +        
	Если Не Отказ Тогда
		НаборЗаписей = РегистрыСведений.бит_БракВозвратСрезкаПродукции.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);    
		Для каждого Запись Из ЭтотОбъект.бит_Виновники Цикл
			Если Не ЗначениеЗаполнено(Запись.ФИО) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Регистратор = ЭтотОбъект.Ссылка;
			НоваяЗапись.Период = ЭтотОбъект.Дата;
		    НоваяЗапись.Документ = ЭтотОбъект.Ссылка;
			НоваяЗапись.Номенклатура = Запись.Номенклатура;
			
			НоваяЗапись.Статус 		 = ЭтотОбъект.бит_ПризнаниеРекламации;
			НоваяЗапись.ВиновноеЛицо = Запись.ФИО;
			НоваяЗапись.КоличествоИсправимогоБракаПоВинеРаботника 	 = Запись.БракПоВинеРаботникаКг;
			НоваяЗапись.СтоимостьИсправимогоБракаПоВинеРаботника 	 = Запись.СтоимостьИсправимогоБракаПоВинеРаботника;
			НоваяЗапись.КоличествоОкончательногоБракаПоВинеРаботника = Запись.СдалиВОтходыПоВинеРаботникаКг;
			НоваяЗапись.СтоимостьОкончательногоБракаПоВинеРаботника  = Запись.СтоимостьОкончательногоБракаПоВинеРаботника;
		КонецЦикла;          
		НаборЗаписей.Записать();
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ9.10]  [VUVaynula@1cbit.ru] [03.09.2025 15:53:19] -
КонецПроцедуры
