
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	ЗаполнитьВидКласса();
	
	УправлениеЭлементамиФормы();
	
	фКэшРеквизитов = Новый Структура;
	фКэшРеквизитов.Вставить("МодельУчета");
	
	ЗаполнитьКэшРеквизитовФормы();
	
	ЗаполнитьКэшЗначений(фКэшЗначений);
	
	Если НЕ Параметры.Ключ.Пустой() И бит_му_ВНА.ЕстьОбъектыКласса(Запись.Класс,Запись.Организация) Тогда		
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Класс.ТолькоПросмотр       = Истина;		
	КонецЕсли;
	
	УстановитьПараметрыВыбораДляСчетов();
    
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мТекущаяМодельУчета = Запись.МодельУчета;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлассПриИзменении(Элемент)
	
	ЗаполнитьВидКласса();
	
КонецПроцедуры

&НаКлиенте
Процедура МодельУчетаПриИзменении(Элемент)
	
	ПриИзмененииМоделиУчета();
		
КонецПроцедуры

&НаКлиенте
Процедура МодельУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мТекущаяМодельУчета = Запись.МодельУчета;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанвливает параметры выбора для элементов формы. 
// 
// Параметры:
//  МассивЭлементов - Массив.
// 
&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.СчетУчета);
	МассивЭлементов.Добавить(Элементы.СчетНачисленияАмортизации);
	МассивЭлементов.Добавить(Элементы.СчетРезерваПереоценки);
	МассивЭлементов.Добавить(Элементы.СчетСниженияСтоимости);
    МассивЭлементов.Добавить(Элементы.СчетРасходовОтОбесценения);
	МассивЭлементов.Добавить(Элементы.СчетДоходовОтОбесценения);

	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры // УстановитьПараметрыВыбораДляСчетов() 

// Процедура заполняет кэш значений необходимый для работы на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	КэшПеречисления = Новый Структура;
	
	КэшПеречисления.Вставить("бит_му_МоделиУчетаВНА", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_му_МоделиУчетаВНА));
	
	КэшированныеЗначения.Вставить("Перечисления", КэшПеречисления);
	
КонецПроцедуры

// Формирует кэш значений реквизитов формы.
// 
&НаСервере
Процедура ЗаполнитьКэшРеквизитовФормы()
	
	Для Каждого КэшРеквизита Из фКэшРеквизитов Цикл
		
		фКэшРеквизитов[КэшРеквизита.Ключ] = Запись[КэшРеквизита.Ключ];
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура управляет видимостью/доступностью элементов формы.
// 
&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Если ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность 
		ИЛИ Запись.МодельУчета = Перечисления.бит_му_МоделиУчетаВНА.ПоПервоначальнойСтоимости Тогда		
		Элементы.СчетРезерваПереоценки.ТолькоПросмотр = Истина;
	Иначе
		Элементы.СчетРезерваПереоценки.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	
	Если ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность 
		И Запись.МодельУчета = Перечисления.бит_му_МоделиУчетаВНА.ПоПереоцененнойСтоимости Тогда		
		Элементы.СчетНачисленияАмортизации.ТолькоПросмотр = Истина;
	Иначе
		Элементы.СчетНачисленияАмортизации.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет вид класса ВНА.
// 
&НаСервере
Процедура ЗаполнитьВидКласса()
	
	Если ТипЗнч(Запись.Класс) = Тип("СправочникСсылка.бит_му_КлассыОсновныхСредств") Тогда
		ВидКласса = Запись.Класс.ВидКласса;
	ИначеЕсли ТипЗнч(Запись.Класс) = Тип("СправочникСсылка.бит_му_КлассыНМА") Тогда
		ВидКласса = НСтр("ru='Нематериальные активы'; en = 'Нематериальные активы'");
	Иначе	
		ВидКласса = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииМоделиУчета()
	
	Если Запись.МодельУчета = Перечисления.бит_му_МоделиУчетаВНА.ПоПервоначальнойСтоимости 
		И фКэшРеквизитов.МодельУчета = Перечисления.бит_му_МоделиУчетаВНА.ПоПереоцененнойСтоимости Тогда
		
		Если бит_му_ВНА.ЕстьОбъектыКласса(Запись.Класс,Запись.Организация) Тогда
			
			Если ЗначениеЗаполнено(Запись.Организация) Тогда
				ТекстСообщения = НСтр("ru='Для организации ""%1"" в системе зарегистрированы объекты класса ""%2"". Изменение модели учета ""по переоцененной стоимости"" запрещено.';
									  |en='For the entity ""%1"" in system-class facilities account ""%2"". Changing the accounting model ""at a revalued amount"" is prohibited.'");			
			Иначе
				ТекстСообщения = НСтр("ru='В системе зарегистрированы объекты класса ""%2"". Изменение модели учета ""по переоцененной стоимости"" запрещено.';
									  |en='In system-class facilities account ""%2"". Changing the accounting model ""at a revalued amount"" is prohibited.'");
			КонецЕсли;
			ТекстСообщения = СтрШаблон(ТекстСообщения, Запись.Организация, Запись.Класс);			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			Запись.МодельУчета = фКэшРеквизитов.МодельУчета;
			
		 КонецЕсли; 
	
	КонецЕсли; 
	
	Если ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность 
		ИЛИ Запись.МодельУчета = Перечисления.бит_му_МоделиУчетаВНА.ПоПервоначальнойСтоимости Тогда		
		Запись.СчетРезерваПереоценки = Неопределено;
	КонецЕсли;
	
	Если ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность 
		И Запись.МодельУчета = Перечисления.бит_му_МоделиУчетаВНА.ПоПереоцененнойСтоимости Тогда		
		Запись.СчетНачисленияАмортизации = Неопределено;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти
