
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	Параметры.Свойство("ВидПлана", ВидПлана);
	
	Если ЗначениеЗаполнено(ВидПлана) Тогда
		
		 // Отбор прогнозов или заявок.
		 Список.Отбор.Элементы.Очистить();
		 ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 ЭлементОтбора.Использование  = Истина;
		 ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидПлана");
		 ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		 ЭлементОтбора.ПравоеЗначение = ВидПлана;
		 
	КонецЕсли; 
		
	// Aормирование заголовка списка в зависимости от вида плана.
	Если ВидПлана = Перечисления.бит_кзн_ВидыПланов.Прогноз Тогда		
		ЭтотОбъект.Заголовок = НСтр("ru='Прогнозы поступлений денежных средств';en='Cash flow projections'");		
	ИначеЕсли ВидПлана = Перечисления.бит_кзн_ВидыПланов.План Тогда		
		ЭтотОбъект.Заголовок = НСтр("ru='Планируемые поступления денежных средств';en='Planned cash receipts'");		
	Иначе		
		ЭтотОбъект.Заголовок = НСтр("ru='Документы планирования поступлений ДС';en='Documents planning DS receipts'");		
	КонецЕсли; 

	Если ЗначениеЗаполнено(ВидПлана) Тогда	
		ЭтоПрогноз = ВидПлана = Перечисления.бит_кзн_ВидыПланов.Прогноз;		
		Элементы.ФормаДокументбит_кзн_ПланируемоеПоступлениеДенежныхСредствВвестиПланируемоеПоступленияДС.Видимость = ЭтоПрогноз;	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование И НЕ ЗначениеЗаполнено(ВидПлана) Тогда
		ПоказатьСписокВыбораПланов(Отказ);
	Иначе
		ОбработатьСписокПередНачаломДобавления(Копирование, Отказ);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьСписокВыбораПланов(Отказ)
	
	СписокВидовПлана = Новый СписокЗначений;
	СписокВидовПлана.Добавить(ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.Прогноз"),  
								НСтр("ru='Прогноз платежа';en='Payment Forecast'"));
	СписокВидовПлана.Добавить(ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.План"), 
								НСтр("ru='Заявка на расходование ДС';en='Request for Disbursement'"));
	
	ЗаголовокДиалога = НСтр("ru='Выберите вид документа';en='Select the type of document'");
	Дополнительно 	 = Новый Структура("Отказ", Отказ);
	Оповещение 		 = Новый ОписаниеОповещения("ПоказатьСписокВыбораПлановЗавершение", ЭтотОбъект, Дополнительно);
	
	СписокВидовПлана.ПоказатьВыборЭлемента(Оповещение, ЗаголовокДиалога);						  	
	
КонецПроцедуры

// Обработчик завершения открытия формы списка значений.
//  См. Синтакс-помощник: ПоказатьВыборЭлемента().
//
&НаКлиенте
Процедура ПоказатьСписокВыбораПлановЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
	
	ВидПлана = Результат.Значение;

	ОбработатьСписокПередНачаломДобавления(Ложь, Дополнительно.Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСписокПередНачаломДобавления(Копирование, Отказ)
	
	Если НЕ Копирование Тогда
		Отказ			   = Истина;
		ЗначенияЗаполнения = Новый Структура("ВидПлана", ВидПлана);
				
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.бит_кзн_ПозицияПоступления.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	Иначе	
		ПараметрыФормыПозиции = ПараметрыФормыПриКопировании(Элементы.Список.ТекущаяСтрока);
		Если ПараметрыФормыПозиции.КоличествоПозиций = 1 Тогда
			Отказ = Истина;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыФормыПозиции.ЗначенияЗаполнения);
			ОткрытьФорму("Документ.бит_кзн_ПозицияПоступления.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ПараметрыФормыПриКопировании(ДокументПланирования)

	Возврат Документы.бит_кзн_ПозицияПоступления.ПараметрыФормыПриКопировании(ДокументПланирования);
	
КонецФункции

#КонецОбласти