
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Результат = СоздатьПлатежныеДокументы(ПараметрКоманды);
	
	Если Результат.Ошибка Тогда
		ПоказатьПредупреждение(, Результат.ТекстСообщения);
	Иначе	
		Если ЗначениеЗаполнено(Результат.НовыеДокументы) Тогда
			Для каждого ДокументОплаты Из Результат.НовыеДокументы Цикл
				ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ДокументОплаты));
			КонецЦикла;				
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СоздатьПлатежныеДокументы(Заявки)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗаявок", Заявки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрСтатусыОбъектов.Статус КАК Статус,
	|	ЗаявкиНаРасходованиеСредств.Ссылка КАК Заявка,
	|	СправочникСтатусыОбъектов.ТипСтатуса КАК ТипСтатуса,
	|	ЗаявкиНаРасходованиеСредств.НеОбъединятьПозицииПриОплате КАК НеОбъединятьПозицииПриОплате
	|ПОМЕСТИТЬ УтвержденныеЗаявки
	|ИЗ
	|	Документ.бит_кзн_ЗаявкаНаРасходованиеСредств КАК ЗаявкиНаРасходованиеСредств
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК РегистрСтатусыОбъектов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_СтатусыОбъектов КАК СправочникСтатусыОбъектов
	|			ПО РегистрСтатусыОбъектов.Статус = СправочникСтатусыОбъектов.Ссылка
	|				И (РегистрСтатусыОбъектов.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус))
	|				И (СправочникСтатусыОбъектов.ТипСтатуса В (ЗНАЧЕНИЕ(Перечисление.бит_ТипыСтатусовОбъектов.Утвержден), ЗНАЧЕНИЕ(Перечисление.бит_ТипыСтатусовОбъектов.ЧастичноИсполнен), ЗНАЧЕНИЕ(Перечисление.бит_ТипыСтатусовОбъектов.ВРеестре)))
	|		ПО (ЗаявкиНаРасходованиеСредств.Ссылка В (&МассивЗаявок))
	|			И ЗаявкиНаРасходованиеСредств.Ссылка = РегистрСтатусыОбъектов.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УтвержденныеЗаявки.Заявка КАК Заявка,
	|	ПлатежныеПозиции.Ссылка КАК Позиция,
	|	УтвержденныеЗаявки.НеОбъединятьПозицииПриОплате КАК НеОбъединятьПозицииПриОплате
	|ИЗ
	|	УтвержденныеЗаявки КАК УтвержденныеЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежныеПозиции
	|		ПО УтвержденныеЗаявки.Заявка = ПлатежныеПозиции.ДокументПланирования
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заявка,
	|	Позиция";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура("НовыеДокументы, Ошибка, ТекстСообщения", Новый Массив, Ложь, "");

	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'Ввод платежных документов поддерживается для утвержденных или частично оплаченных документов.'; 
								|en = 'The entry of payment documents is supported for approved or partially paid documents.'");	
		
		Результат.Ошибка		 = Истина;
		Результат.ТекстСообщения = ТекстСообщения;
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Заявка") Цикл
		Если Выборка.НеОбъединятьПозицииПриОплате Тогда
			
			Пока Выборка.СледующийПоЗначениюПоля("Позиция") Цикл
				ДанныеЗаполнения	  = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.НовыеПараметрыДокументаСоздатьПлатежныеДокументы(); 
				ДанныеЗаполнения.Дата = ТекущаяДатаСеанса();

				ЗаполнитьЗначенияСвойств(ДанныеЗаполнения.Позиции.Добавить(), Выборка);
			
				НовыеДокументы = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.СоздатьДокументыНаОсновеВыделенных(
									Выборка.Заявка, ДанныеЗаполнения); 
				Для каждого СтрокаТаблицы Из НовыеДокументы Цикл
					Результат.НовыеДокументы.Добавить(СтрокаТаблицы.ДокументОплаты);
				КонецЦикла;
			КонецЦикла;
		Иначе	
			ДанныеЗаполнения	  = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.НовыеПараметрыДокументаСоздатьПлатежныеДокументы(); 
			ДанныеЗаполнения.Дата = ТекущаяДатаСеанса();
			
			Пока Выборка.СледующийПоЗначениюПоля("Позиция") Цикл
				ЗаполнитьЗначенияСвойств(ДанныеЗаполнения.Позиции.Добавить(), Выборка);
			КонецЦикла;

			НовыеДокументы = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.СоздатьДокументыНаОсновеВыделенных(
								Выборка.Заявка, ДанныеЗаполнения); 
			Для каждого СтрокаТаблицы Из НовыеДокументы Цикл
				Результат.НовыеДокументы.Добавить(СтрокаТаблицы.ДокументОплаты);
			КонецЦикла;					
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;
	
КонецФункции
