
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыПравилЗаполнения = Параметры.ПараметрыПравилЗаполнения;
	Если ТипЗнч(ПараметрыПравилЗаполнения) <> Тип("Структура") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыПравилЗаполнения);
	ОбработатьИзменениеРеквизитаПриемника();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПриемникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбора = НовыеПараметрыВыбораПоля();
	ПараметрыВыбора.ОбъектСистемы   = ОбъектПриемник;
	ПараметрыВыбора.ТекущийРеквизит = РеквизитПриемника;
	ОткрытьФорму("Справочник.бит_ШаблоныВводаНаОсновании.Форма.ВыборРеквизитаОбъекта",
					ПараметрыВыбора,
					Элемент,
					,
					,
					,
					,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитИсточникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбора = НовыеПараметрыВыбораПоля();
	ПараметрыВыбора.ОбъектСистемы   = ОбъектОснование;
	ПараметрыВыбора.ТекущийРеквизит = РеквизитИсточника;
	ОткрытьФорму("Справочник.бит_ШаблоныВводаНаОсновании.Форма.ВыборРеквизитаОбъекта",
					ПараметрыВыбора,
					Элемент,
					,
					,
					,
					,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РеквизитПриемникаПриИзменении(Элемент)
	
	ОбработатьИзменениеРеквизитаПриемника();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗаполненияПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПрименить(Команда)
	
	ПараметрыПравилЗаполнения = ПараметрыПравилЗаполнения();
	ОповеститьОВыборе(ПараметрыПравилЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.РеквизитИсточника.Видимость =
		(СпособЗаполнения = Перечисления.бит_СпособыЗаполненияРеквизитовПоШаблону.ИзДанныхОснования);
	Элементы.ФиксированноеЗначение.Видимость =
		(СпособЗаполнения = Перечисления.бит_СпособыЗаполненияРеквизитовПоШаблону.ФиксированноеЗначение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыеПараметрыВыбораПоля()
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ЗакрыватьПриВыборе",            Истина);
	ПараметрыВыбора.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыВыбора.Вставить("ОбъектСистемы");
	ПараметрыВыбора.Вставить("ТекущийРеквизит");
	Возврат ПараметрыВыбора;
	
КонецФункции

&НаСервере
Процедура ОбработатьИзменениеРеквизитаПриемника()
	
	Если ОбъектПриемник.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТипРеквизита = Неопределено;
	Если ТипЗнч(РеквизитПриемника) = Тип("Строка") Тогда
		Если ПустаяСтрока(РеквизитПриемника) Тогда
			Возврат;
		КонецЕсли;
		
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ОбъектПриемник.ИмяОбъектаПолное);
		РеквизитОбъекта = МетаданныеОбъекта.Реквизиты.Найти(РеквизитПриемника);
		Если РеквизитОбъекта = Неопределено Тогда
			Для каждого СтандартныйРеквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
				Если СтандартныйРеквизит.Имя = РеквизитПриемника Тогда
					РеквизитОбъекта = СтандартныйРеквизит;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		Если РеквизитОбъекта = Неопределено Тогда
			ТекстСообщения = НСтр("ru='Реквизит с именем %1 не найден.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, РеквизитПриемника);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Элементы.РеквизитПриемника.Имя);
			Возврат;
		КонецЕсли;
		
		ТипРеквизита = РеквизитОбъекта.Тип;
	ИначеЕсли ТипЗнч(РеквизитПриемника) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
		Если НЕ ЗначениеЗаполнено(РеквизитПриемника) Тогда
			Возврат;
		КонецЕсли;
		
		ТипРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитПриемника, "ТипЗначения");
	Иначе
		Возврат;
	КонецЕсли;
	
	Элементы.ФиксированноеЗначение.ОграничениеТипа = ТипРеквизита;
	ФиксированноеЗначение = ТипРеквизита.ПривестиЗначение(ФиксированноеЗначение);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПравилЗаполнения()
	
	ПараметрыПравилЗаполнения = Справочники.бит_ШаблоныВводаНаОсновании.НовыеПараметрыПравилЗаполнения();
	ЗаполнитьЗначенияСвойств(ПараметрыПравилЗаполнения, ЭтотОбъект);
	Возврат ПараметрыПравилЗаполнения;
	
КонецФункции

#КонецОбласти