
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИменаОбъектовВизирования = Новый Массив;
	
	ТипыОбъектовВизирования = Метаданные.ОпределяемыеТипы.бит_ОбъектыВизирования.Тип.Типы();
	Для каждого ТипОбъекта Из ТипыОбъектовВизирования Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипОбъекта);
		ИменаОбъектовВизирования.Добавить(МетаданныеОбъекта.ПолноеИмя());
	КонецЦикла;
	
	Список.Параметры.УстановитьЗначениеПараметра("ИменаОбъектовВизирования", ИменаОбъектовВизирования);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	
	ТекущиеДанные  = Элементы.Список.ТекущиеДанные;
	ОбъектыСистемы = Новый Массив;
	ОбъектыСистемы.Добавить(ТекущиеДанные.ОбъектСистемы);
	ОтключитьВизирование = ТекущиеДанные.ИспользоватьВизирование;
	
	ПереключитьИспользованиеВизированияОбъектов(ОбъектыСистемы, ОтключитьВизирование);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВключитьВизирование(Команда)
	
	ОтключитьВизирование = Ложь;
	ОбъектыСистемы       = Новый Массив;
	
	Для каждого ИдентификаторСтроки Из Элементы.Список.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ИдентификаторСтроки);
		
		Если ДанныеСтроки.ИспользоватьВизирование <> ОтключитьВизирование Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектыСистемы.Добавить(ДанныеСтроки.ОбъектСистемы);
	КонецЦикла;
	
	ПереключитьИспользованиеВизированияОбъектов(ОбъектыСистемы, ОтключитьВизирование);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтключитьВизирование(Команда)
	
	ОтключитьВизирование = Истина;
	ОбъектыСистемы       = Новый Массив;
	
	Для каждого ИдентификаторСтроки Из Элементы.Список.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ИдентификаторСтроки);
		
		Если ДанныеСтроки.ИспользоватьВизирование <> ОтключитьВизирование Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектыСистемы.Добавить(ДанныеСтроки.ОбъектСистемы);
	КонецЦикла;
	
	ПереключитьИспользованиеВизированияОбъектов(ОбъектыСистемы, ОтключитьВизирование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПереключитьИспользованиеВизированияОбъектов(ОбъектыСистемы, ОтключитьВизирование)
	
	КоличествоОбъектов = ОбъектыСистемы.Количество();
	
	Если КоличествоОбъектов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтключитьВизирование Тогда
		
		ТекстВопроса = НСтр("ru = 'Отключить визирование для %1?';
			|en = 'Turn off visas for %1?'");
		
		Если НазначеныАлгоритмыВизирования(ОбъектыСистемы) Тогда
			ТекстВопроса = ТекстВопроса + " "
							+ НСтр("ru = 'В том числе будут отключены все назначенные пользовательские алгоритмы визирования.';
								|en = 'This includes disabling all assigned custom visas algorithms.'");
		КонецЕсли;
		
	Иначе
		ТекстВопроса = НСтр("ru = 'Включить визирование для %1?';
			|en = 'Turn on visas for %1?'");
	КонецЕсли;
	
	Если КоличествоОбъектов = 1 Тогда
		ТекстВопроса = СтрШаблон(ТекстВопроса, ОбъектыСистемы[0]);
	Иначе
		ТекстУточнение = НСтр("ru='%1 объектов';en='%1 objects'");
		ТекстУточнение = СтрШаблон(ТекстУточнение, КоличествоОбъектов);
		ТекстВопроса   = СтрШаблон(ТекстВопроса, ТекстУточнение); 
	КонецЕсли;
	
	ПараметрыУстановкиНастроек = Новый Структура;
	ПараметрыУстановкиНастроек.Вставить("ОбъектыСистемы"      , ОбъектыСистемы);
	ПараметрыУстановкиНастроек.Вставить("ОтключитьВизирование", ОтключитьВизирование);
	ПараметрыУстановкиНастроек.Вставить("ТекущаяСтрока"       , Элементы.Список.ТекущаяСтрока);
	Оповещение = Новый ОписаниеОповещения("ВопросИзменениеНастроекВизирования", ЭтотОбъект, ПараметрыУстановкиНастроек);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

// Процедура окончание процедуры "СписокВыбор". 
//
// Параметры:
//  Ответ - КодВозвратаДиалога.
//  ДополнительныеПараметры - Структура.
//
&НаКлиенте
Процедура ВопросИзменениеНастроекВизирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ИзменитьНастройкуИспользованияВизирования(ДополнительныеПараметры.ОбъектыСистемы,
													ДополнительныеПараметры.ОтключитьВизирование);
		Если ДополнительныеПараметры.ОтключитьВизирование Тогда
			КлючЗаписи = КлючЗаписиНазначенияАлгоритомов(ДополнительныеПараметры.ОбъектыСистемы);
			ОповеститьОбИзменении(КлючЗаписи);
		Иначе
			ЗначенияЗаполнения = ОтборНазначенияАлгоритмов(ДополнительныеПараметры.ОбъектыСистемы);
			ПараметрыФормы     = Новый Структура;
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	 		ОткрытьФорму("РегистрСведений.бит_НазначениеАлгоритмов.ФормаЗаписи", ПараметрыФормы);
		КонецЕсли;
		Элементы.Список.ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьНастройкуИспользованияВизирования(ОбъектыСистемы, ОтключитьВизирование)
	
	Для каждого ОбъектСистемы Из ОбъектыСистемы Цикл
		Менеджер = РегистрыСведений.бит_УдалитьОбъектыБезСогласования.СоздатьМенеджерЗаписи();
		Менеджер.ОбъектСистемы = ОбъектСистемы;
		Если ОтключитьВизирование Тогда
			Менеджер.Записать();
			
			НазначенияАлгоритмов = РегистрыСведений.бит_НазначениеАлгоритмов.СоздатьНаборЗаписей();
			НазначенияАлгоритмов.Отбор.ОбъектСистемы.Установить(ОбъектСистемы);
			НазначенияАлгоритмов.Отбор.ВидАлгоритма.Установить(Перечисления.бит_ВидыАлгоритмов.Визирование);
			НазначенияАлгоритмов.Записать();
		Иначе
			Менеджер.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
	// Проверка использования визирования по объектам выполняется через модуль повторно используемых значений.
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтборНазначенияАлгоритмов(ОбъектыСистемы)
	
	Если ОбъектыСистемы.Количество() = 1 Тогда
		ОбъектСистемы = ОбъектыСистемы[0];
	Иначе
		ОбъектСистемы = Справочники.бит_ОбъектыСистемы.ПустаяСсылка();
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектСистемы", ОбъектСистемы);
	Отбор.Вставить("ВидАлгоритма", Перечисления.бит_ВидыАлгоритмов.Визирование);
	Отбор.Вставить("ПользовательскоеУсловие", Справочники.бит_ПользовательскиеУсловия.ПустаяСсылка());
	Отбор.Вставить("Период", ТекущаяДатаСеанса());
	
	Возврат Отбор;
	
КонецФункции

&НаСервере
Функция КлючЗаписиНазначенияАлгоритомов(ОбъектыСистемы)
	
	Отбор = ОтборНазначенияАлгоритмов(ОбъектыСистемы);
	КлючЗаписи = РегистрыСведений.бит_НазначениеАлгоритмов.СоздатьКлючЗаписи(Отбор);
	
	Возврат КлючЗаписи;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Список");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Список.ИспользоватьВизирование", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НазначеныАлгоритмыВизирования(ОбъектыСистемы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НазначенныеАлгоритмы.ОбъектСистемы КАК ОбъектСистемы
	|ИЗ
	|	РегистрСведений.бит_НазначениеАлгоритмов КАК НазначенныеАлгоритмы
	|ГДЕ
	|	НазначенныеАлгоритмы.ОбъектСистемы В(&ОбъектыСистемы)
	|	И НазначенныеАлгоритмы.ВидАлгоритма = ЗНАЧЕНИЕ(Перечисление.бит_ВидыАлгоритмов.Визирование)";
	Запрос.УстановитьПараметр("ОбъектыСистемы", ОбъектыСистемы);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти
