
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	ПодготовитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаЗаявкиНаРасходВыбор(Элемент)
	
	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	Если СтрСравнить(ИмяЭлемента, "ПрогнозПлатежа") = 0 Тогда
		ПараметрыФормы = Новый Структура("ВидПлана", ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.Прогноз"));
		ОткрытьФорму("Документ.бит_кзн_ЗаявкаНаРасходованиеСредств.ФормаСписка", ПараметрыФормы, ЭтотОбъект, "ПрогнозПлатежа");
	ИначеЕсли СтрСравнить(ИмяЭлемента, "ЗаявкаНаРасходованиеСредств") = 0 Тогда
		ПараметрыФормы = Новый Структура("ВидПлана", ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.План"));
		ОткрытьФорму("Документ.бит_кзн_ЗаявкаНаРасходованиеСредств.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	Иначе
		ОбработатьВыбор(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаПлатежныйКалендарьВыбор(Элемент)

	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	Если СтрСравнить(ИмяЭлемента, "ПрогнозПлатежа") = 0 Тогда
		ПараметрыФормы = Новый Структура("ВидПлана", ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.Прогноз"));
		ОткрытьФорму("Документ.бит_кзн_ЗаявкаНаРасходованиеСредств.ФормаСписка", ПараметрыФормы, ЭтотОбъект, "ПрогнозПлатежа");
	ИначеЕсли СтрСравнить(ИмяЭлемента, "ЗаявкаНаРасходованиеСредств") = 0 Тогда
		ПараметрыФормы = Новый Структура("ВидПлана", ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.План"));
		ОткрытьФорму("Документ.бит_кзн_ЗаявкаНаРасходованиеСредств.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	ИначеЕсли СтрСравнить(ИмяЭлемента, "ПрогнозПоступлений") = 0 Тогда
		ПараметрыФормы = Новый Структура("ВидПлана", ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.Прогноз"));
		ОткрытьФорму("Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ФормаСписка", ПараметрыФормы, ЭтотОбъект, "ПрогнозПоступлений");
	ИначеЕсли СтрСравнить(ИмяЭлемента, "ПланируемоеПоступление") = 0 Тогда
		ПараметрыФормы = Новый Структура("ВидПлана", ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.План"));
		ОткрытьФорму("Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	Иначе
		ОбработатьВыбор(Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПланФактныйАнализЗаявокНаРасходованиеДенежныхСредств(Команда)

	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "ПланФактныйАнализ");
	
	Попытка
		ОткрытьФорму("Отчет.бит_ПланФактныйАнализЗаявокНаРасходованиеДенежныхСредств.ФормаОбъекта", ПараметрыПередачи);	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура ПланФактныйАнализПоступленийДенежныхСредств(Команда)

	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "ПланФактныйАнализ");
	
	Попытка
		ОткрытьФорму("Отчет.бит_ПланФактныйАнализПоступленийДенежныхСредств.ФормаОбъекта", ПараметрыПередачи);	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура КонтрольныеЗначенияБюджета(Команда)

	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("КлючВарианта", "КонтрольныеЗначенияБюджета");
	
	Попытка
		ОткрытьФорму("Отчет.бит_КонтрольныеЗначенияБюджета.ФормаОбъекта", ПараметрыПередачи);	
	Исключение
		ТекстСообщения = НСтр("ru = 'Неправильное имя отчета. Обратитесь в группу разработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
	КонецПопытки; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыбор(Элемент)
	
	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	НавигационнаяСсылкаБлока = Неопределено;
	Если НавигационныеСсылки.Свойство(ИмяЭлемента, НавигационнаяСсылкаБлока) 
		И ЗначениеЗаполнено(НавигационнаяСсылкаБлока) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаБлока);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФорму()

	// Готовим структуру из метаданных, чтобы проверка конфигурации реагировала на изменения.
	ОбъектыПодсистемы = Новый Структура;
	
	// Документы.
	ОбъектыПодсистемы.Вставить("ПрогнозПлатежа",							Метаданные.Документы.бит_кзн_ЗаявкаНаРасходованиеСредств);
	ОбъектыПодсистемы.Вставить("ЗаявкаНаРасходованиеСредств",				Метаданные.Документы.бит_кзн_ЗаявкаНаРасходованиеСредств);
	ОбъектыПодсистемы.Вставить("ПрогнозПоступлений",						Метаданные.Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств);
	ОбъектыПодсистемы.Вставить("ПланируемоеПоступление",					Метаданные.Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств);
	ОбъектыПодсистемы.Вставить("ЗакрытиеДокументовПланирования",			Метаданные.Документы.бит_кзн_ЗакрытиеДокументовПланирования);
	ОбъектыПодсистемы.Вставить("ЗаявкаНаПеремещениеДенежныхСредств",		Метаданные.Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств);
	ОбъектыПодсистемы.Вставить("ЗаявкаНаПереводСредствВДругуюОрганизацию",	Метаданные.Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию);
	ОбъектыПодсистемы.Вставить("ФормаВводаБюджета",							Метаданные.Документы.бит_ФормаВводаБюджета);
	ОбъектыПодсистемы.Вставить("БюджетнаяОперация",							Метаданные.Документы.бит_БюджетнаяОперация);
	ОбъектыПодсистемы.Вставить("УстановкаКонтрольныхЗначений",				Метаданные.Документы.бит_УстановкаКонтрольныхЗначений);
	ОбъектыПодсистемы.Вставить("КорректировкаКонтрольныхЗначений",			Метаданные.Документы.бит_КорректировкаКонтрольныхЗначений);
	ОбъектыПодсистемы.Вставить("СведенияОбОстаткахДенежныхСредств",			Метаданные.Документы.бит_СведенияОбОстаткахДенежныхСредств);
	ОбъектыПодсистемы.Вставить("УстановкаНеснижаемыхОстатков",				Метаданные.Документы.бит_УстановкаНеснижаемыхОстатков);
	ОбъектыПодсистемы.Вставить("РеестрПлатежей",							Метаданные.Документы.бит_кзн_РеестрПлатежей);
	ОбъектыПодсистемы.Вставить("СписаниеБезналичныхДенежныхСредств",		Метаданные.Документы.СписаниеБезналичныхДенежныхСредств);
	ОбъектыПодсистемы.Вставить("РасходныйКассовыйОрдер",					Метаданные.Документы.РасходныйКассовыйОрдер);
	
	// Обработки.
  	ОбъектыПодсистемы.Вставить("СозданиеПланируемыхПоступлений",			Метаданные.Обработки.бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам);
	ОбъектыПодсистемы.Вставить("РабочееМестоКазначея",						Метаданные.Обработки.бит_РабочееМестоКазначея);
	
	// Отчеты.
  	ОбъектыПодсистемы.Вставить("ПлатежныйКалендарь",						Метаданные.Отчеты.бит_кзн_ПлатежныйКалендарь);
	
	// Формирование навигационных ссылок и проверка доступа по функциональным опциям.
	НедоступныеОбъекты = Новый Массив; 
	Для Каждого ОбъектПодсистемы Из ОбъектыПодсистемы Цикл
		НавигационнаяСсылкаБлока = ""; 
		ОбъектДоступен = ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОбъектПодсистемы.Значение);
		Если ОбъектДоступен Тогда
			НавигационнаяСсылкаБлока = ПолучитьНавигационнуюСсылку(ОбъектПодсистемы.Значение);
		Иначе
			НедоступныеОбъекты.Добавить(ОбъектПодсистемы.Ключ);	
		КонецЕсли;
		ОбъектыПодсистемы[ОбъектПодсистемы.Ключ] = НавигационнаяСсылкаБлока;
	КонецЦикла;
	НавигационныеСсылки = Новый ФиксированнаяСтруктура(ОбъектыПодсистемы);
	
	СхемаЗаявкиНаРасход = Обработки.бит_ПанельФункций_КазначействоУП.ПолучитьМакет("СхемаЗаявкиНаРасход");
	СхемаПлатежныйКалендарь = Обработки.бит_ПанельФункций_КазначействоУП.ПолучитьМакет("СхемаПлатежныйКалендарь");
	
	// Ссылка может быть одновременно на разных схемах.
	Для Каждого НедоступныйОбъект Из НедоступныеОбъекты Цикл
		ЭлементыСхемы = СхемаЗаявкиНаРасход.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
		ЭлементыСхемы = СхемаПлатежныйКалендарь.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект)
	
	ЭлементСхемы = ЭлементыСхемы[НедоступныйОбъект];
	ЭлементСхемы.ЦветФона = ЦветаСтиля.бит_ЦветНедоступногоПоля;
	
КонецПроцедуры

#КонецОбласти