
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем СписокДокументовДвижения;
	Перем СписокРеестры;
		
	Если НЕ Параметры.Свойство("СпискиДокументов") Тогда
		ТекстСообщения = НСтр("ru='Непосредственное открытие этой формы не предусмотрено.';
							  |en='The immediate opening of this form is not provided.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ЭтоБазовая = ПолучитьФункциональнуюОпцию("БазоваяВерсия");
	
	ОбновитьСписокДоступныхТиповДокументов();
	
	УстановитьВидимостьЭлементов();
	УстановитьДоступностьКоманд(ЭтотОбъект);
	
	Параметры.СпискиДокументов.Свойство("СписокДокументовДвижения", СписокДокументовДвижения);
	Параметры.СпискиДокументов.Свойство("СписокРеестры", 		    СписокРеестры);
	
	УстановитьАктивнуюСтраницу(СписокДокументовДвижения, СписокРеестры);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ДокументыДвиженияДенежныхСредств, "Ссылка", СписокДокументовДвижения, ВидСравненияКомпоновкиДанных.ВСписке,,Истина, 
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			РеестрПлатежей, "Ссылка", СписокРеестры, ВидСравненияКомпоновкиДанных.ВСписке,,Истина, 
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
								
КонецПроцедуры
		
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаОтметкиЭлементов" Тогда
		ВыполнитьПослеЗакрытияСпискаВыбора(ВыбранноеЗначение);
		УстановитьДоступностьКоманд(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыСписанияДенежныхСредств

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтборПоТипуДокумента(Команда)
	
	ОтборТипДокументаНачалоВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборПоТипу(Команда)
	
	ОтборТипДокументаОчистка();
	УстановитьДоступностьКоманд(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьАктивнуюСтраницу(СписокДокументовДвижения, СписокРеестры)

	ТекущаяСтраница = Элементы.СтраницаДокументыДвиженияДенежныхСредств;
	
	КоличествоДокументовДвижения = СписокДокументовДвижения.Количество();
	КоличествоРеестрПлатежей 	 = СписокРеестры.Количество();
		
	Если КоличествоДокументовДвижения = 0 И КоличествоРеестрПлатежей <> 0 Тогда	
		ТекущаяСтраница = Элементы.СтраницаРеестрыПлатежей;
	КонецЕсли; 
	
	Элементы.Страницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокДоступныхТиповДокументов()
	
	СписокДоступныхМетаданных = Новый СписокЗначений();
	Для Каждого ОписаниеМетаданныхДокумента Из Метаданные.ЖурналыДокументов.бит_ОтраженияФактаДДС.РегистрируемыеДокументы Цикл
		Если ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОписаниеМетаданныхДокумента) Тогда
			СписокДоступныхМетаданных.Добавить(Тип("ДокументСсылка." + ОписаниеМетаданныхДокумента.Имя), ОписаниеМетаданныхДокумента.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	МассивЭлементовКУдалению = Новый Массив();
	Для каждого Элемент Из ТипыДокументов Цикл
		Если СписокДоступныхМетаданных.НайтиПоЗначению(Элемент.Значение) = Неопределено Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла; 
	
	Для каждого Элемент Из МассивЭлементовКУдалению Цикл
		ТипыДокументов.Удалить(Элемент);
	КонецЦикла; 
	
	Для каждого Элемент Из СписокДоступныхМетаданных Цикл
		Если ТипыДокументов.НайтиПоЗначению(Элемент.Значение) = Неопределено Тогда
			ТипыДокументов.Добавить(Элемент.Значение, Элемент.Представление, Элемент.Пометка);
		КонецЕсли;
	КонецЦикла; 
	
	ТипыДокументов.СортироватьПоЗначению();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()

	Элементы.ДокументыДвиженияДенежныхСредствОрганизация.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Элементы.РеестрПлатежейОрганизация.Видимость 				   = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Элементы.ДокументыДвиженияДенежныхСредствВалюта.Видимость 	   = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют");

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКоманд(Форма)

	Массив = Новый Массив();
	Для каждого ТекСтрока Из Форма.ТипыДокументов Цикл
		Если ТекСтрока.Пометка Тогда
			Массив.Добавить(ТекСтрока);
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	Форма.Элементы.ДокументыДвиженияДенежныхСредствОчиститьОтборПоТипу.Доступность = Массив.Количество() > 0;

КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаОчистка()
	
	ТипыДокументов.ЗаполнитьПометки(Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ДокументыДвиженияДенежныхСредств,
		"Тип",
		ТипыДокументов,
		ВидСравненияКомпоновкиДанных.ВСписке,,
		Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаНачалоВыбора()
	
	ОткрытьФорму("ОбщаяФорма.ФормаОтметкиЭлементов",Новый Структура("СписокЗначений, Адрес", ТипыДокументов, Адрес),ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПослеЗакрытияСпискаВыбора(СписокВыбора) 

	СписокТипов = Новый СписокЗначений();
	
	Если СписокВыбора <> Неопределено Тогда
		Для каждого ЭлементСписка Из СписокВыбора Цикл
			НайденноеЗначение = ТипыДокументов.НайтиПоЗначению(ЭлементСписка.Значение);
			ЗаполнитьЗначенияСвойств(НайденноеЗначение,ЭлементСписка);
		КонецЦикла; 
	КонецЕсли;
	
	Для каждого Элемент Из ТипыДокументов Цикл
		Если Элемент.Пометка Тогда
			СписокТипов.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;  
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ДокументыДвиженияДенежныхСредств,
		"Тип",
		СписокТипов,
		ВидСравненияКомпоновкиДанных.ВСписке,,
		СписокТипов.Количество() > 0);

	КонецПроцедуры
	
#КонецОбласти