#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Процедура ЗарегистрироватьУчетныеМеханизмы(Параметры) Экспорт
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновениеИБ

Процедура ЗаполнитьТаблицуПриПереходеНаНовуюВерсию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначениеСоответствияАналитик.Ссылка КАК Ссылка,
	|	Список.Ссылка КАК Ссылка1,
	|	НазначениеСоответствияАналитик.Проведен КАК Проведен
	|ИЗ
	|	Документ.бит_НазначениеСоответствияАналитик КАК НазначениеСоответствияАналитик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_НазначениеСоответствияАналитик.СписокАналитик КАК Список
	|		ПО (Список.Ссылка = НазначениеСоответствияАналитик.Ссылка)
	|			И (Список.НомерСтроки = 1)
	|ГДЕ
	|	Список.Ссылка ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.бит_НазначениеСоответствияАналитик");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если ДокументОбъект = Неопределено Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ДокументОбъект.ДатаНачала = '2001-01-01';
			ЗаполнитьЗначенияСвойств(ДокументОбъект.СписокАналитик.Добавить(), ДокументОбъект);
			
			ДокументОбъект.ЛеваяАналитика_1 = Неопределено;
			ДокументОбъект.ЛеваяАналитика_2 = Неопределено;
			ДокументОбъект.ЛеваяАналитика_3 = Неопределено;
			
			ДокументОбъект.ПраваяАналитика_1 = Неопределено;
			ДокументОбъект.ПраваяАналитика_2 = Неопределено;
			ДокументОбъект.ПраваяАналитика_3 = Неопределено;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			Если Выборка.Проведен Тогда
				Отказ = Ложь;
				ПараметрыПроведения = ПодготовитьПараметрыПроведения(Выборка.Ссылка, Отказ);
				
				НаборЗаписей = РегистрыСведений.бит_СоответствияАналитик.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Ссылка);
				
				Движения = Новый Структура("бит_СоответствияАналитик", НаборЗаписей); 
				
				СформироватьДвиженияСоответствиеАналитик(
					ПараметрыПроведения.ТаблицаСоответствияАналитик,
					ПараметрыПроведения.ТаблицаРеквизиты, Движения, Отказ);
				
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ШаблонСообщения = НСтр("ru = 'Не удалось обработать документ: %1
				|%2'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.Ссылка, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.бит_НазначениеСоответствияАналитик,
				Выборка.Ссылка,
				ТекстСообщения);			
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

// Функция подготавливает параметры проведения.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.бит_НазначениеСоответствияАналитик - ссылка на документ.
//  Отказ          - Булево - признак обнаружения ошибки и отказа от дальнейших действий.
//
// Возвращаемое значение:
//  Структура - структура параметров проведения.
//
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидСоответствия КАК ВидСоответствия,
	|	Реквизиты.ВидСоответствия.Соотношение КАК ВидСоответствияСоотношение,
	|	Реквизиты.ДатаНачала КАК Период,
	|	Реквизиты.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.бит_НазначениеСоответствияАналитик КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Результат    	 = Запрос.Выполнить();
	ТаблицаРеквизиты = Результат.Выгрузить();
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
	
	ПараметрыПроведения = Новый Структура("ТаблицаРеквизиты", ТаблицаРеквизиты);
	НомераТаблиц        = Новый Структура(); 
					 
	Запрос = Новый Запрос(); 
	Запрос.УстановитьПараметр("Ссылка", 	   ДокументСсылка);
	Запрос.УстановитьПараметр("Период", 	   Реквизиты.Период);
	Запрос.УстановитьПараметр("ДатаОкончания", Реквизиты.ДатаОкончания);
	
	Запрос.Текст = ТекстЗапросаТаблицыДокумента(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла; 	

	Возврат ПараметрыПроведения;
	
КонецФункции 

// Процедура формирует движения по регистру сведений бит_СоответствияАналитик.
// 
// Параметры:
//  ТаблицаДокумента - ТаблицаЗначений - таблица документа.
//  Движения         - КоллекцияДвижений - движения документа.
//  Отказ            - Булево - признак ошибки и отказа.
//
Процедура СформироватьДвиженияСоответствиеАналитик(ТаблицаДокумента, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТаблицаДокумента) ИЛИ НЕ ЗначениеЗаполнено(ТаблицаРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	Для каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
		Движение = Движения.бит_СоответствияАналитик.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Реквизиты);
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);
	КонецЦикла;
	
	Движения.бит_СоответствияАналитик.Записывать = Истина;
	
КонецПроцедуры

// Процедура проверяет уникальность записей.
// 
// Параметры:
//  ТаблицаДокумента - ТаблицаЗначений - таблица документов.
//  ТаблицаРеквизиты - ТаблицаЗначений - таблица реквизитов.
//  Отказ            - Булево - признак обнаружения ошибки и отказа от дальнейших действий.
//
Процедура ПроверитьУникальностьЗаписей(ТаблицаДокумента, ТаблицаРеквизиты, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТаблицаДокумента)
		ИЛИ НЕ ЗначениеЗаполнено(ТаблицаРеквизиты) Тогда
		Возврат;
	КонецЕсли;	
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	Если Реквизиты.ВидСоответствияСоотношение <> Перечисления.бит_ВидыСоотношенийАналитик.ОдинКОдному Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаДокумента", ТаблицаДокумента);
	Запрос.УстановитьПараметр("ВидСоответствия",  Реквизиты.ВидСоответствия);
	
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	&ВидСоответствия КАК ВидСоответствия,
	|	Таблица.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	Таблица.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	Таблица.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	Таблица.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	Таблица.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	Таблица.ПраваяАналитика_3 КАК ПраваяАналитика_3,
	|	Таблица.Период КАК Период,
	|	Таблица.ДатаОкончания КАК ДатаОкончания,
	|	Таблица.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствияАналитик.Период КАК Период,
	|	СоответствияАналитик.ВидСоответствия КАК ВидСоответствия,
	|	СоответствияАналитик.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	СоответствияАналитик.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	СоответствияАналитик.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	СоответствияАналитик.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	СоответствияАналитик.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	СоответствияАналитик.ПраваяАналитика_3 КАК ПраваяАналитика_3,
	|	СоответствияАналитик.Используется КАК Используется
	|ПОМЕСТИТЬ ВТ_Аналитики
	|ИЗ
	|	РегистрСведений.бит_СоответствияАналитик КАК СоответствияАналитик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ПО СоответствияАналитик.ВидСоответствия = ВТ_ТаблицаДокумента.ВидСоответствия
	|			И СоответствияАналитик.ЛеваяАналитика_1 = ВТ_ТаблицаДокумента.ЛеваяАналитика_1
	|			И СоответствияАналитик.ЛеваяАналитика_2 = ВТ_ТаблицаДокумента.ЛеваяАналитика_2
	|			И СоответствияАналитик.ЛеваяАналитика_3 = ВТ_ТаблицаДокумента.ЛеваяАналитика_3
	|			И СоответствияАналитик.ПраваяАналитика_1 = ВТ_ТаблицаДокумента.ПраваяАналитика_1
	|			И СоответствияАналитик.ПраваяАналитика_2 = ВТ_ТаблицаДокумента.ПраваяАналитика_2
	|			И СоответствияАналитик.ПраваяАналитика_3 = ВТ_ТаблицаДокумента.ПраваяАналитика_3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АналитикиНачалоПериода.ВидСоответствия КАК ВидСоответствия,
	|	ВТ_АналитикиНачалоПериода.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	ВТ_АналитикиНачалоПериода.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	ВТ_АналитикиНачалоПериода.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	ВТ_АналитикиНачалоПериода.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	ВТ_АналитикиНачалоПериода.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	ВТ_АналитикиНачалоПериода.ПраваяАналитика_3 КАК ПраваяАналитика_3,
	|	ВТ_АналитикиНачалоПериода.Период КАК Период,
	|	ЕСТЬNULL(ВТ_АналитикиКонецПериода.Период, ДАТАВРЕМЯ(2036, 12, 31)) КАК ДатаОкончания,
	|	0 КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ДанныеРегистра
	|ИЗ
	|	ВТ_Аналитики КАК ВТ_АналитикиНачалоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Аналитики КАК ВТ_АналитикиКонецПериода
	|		ПО ВТ_АналитикиНачалоПериода.ЛеваяАналитика_1 = ВТ_АналитикиКонецПериода.ЛеваяАналитика_1
	|			И ВТ_АналитикиНачалоПериода.ЛеваяАналитика_2 = ВТ_АналитикиКонецПериода.ЛеваяАналитика_2
	|			И ВТ_АналитикиНачалоПериода.ЛеваяАналитика_3 = ВТ_АналитикиКонецПериода.ЛеваяАналитика_3
	|			И ВТ_АналитикиНачалоПериода.ПраваяАналитика_1 = ВТ_АналитикиКонецПериода.ПраваяАналитика_1
	|			И ВТ_АналитикиНачалоПериода.ПраваяАналитика_2 = ВТ_АналитикиКонецПериода.ПраваяАналитика_2
	|			И ВТ_АналитикиНачалоПериода.ПраваяАналитика_3 = ВТ_АналитикиКонецПериода.ПраваяАналитика_3
	|			И ВТ_АналитикиНачалоПериода.Период < ВТ_АналитикиКонецПериода.Период
	|ГДЕ
	|	ВТ_АналитикиНачалоПериода.Используется
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОдинКОдному.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ОдинКОдному
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	|		ПО ВТ_ОдинКОдному.ЛеваяАналитика_1 = ВТ_ДанныеРегистра.ЛеваяАналитика_1
	|			И ВТ_ОдинКОдному.ЛеваяАналитика_2 = ВТ_ДанныеРегистра.ЛеваяАналитика_2
	|			И ВТ_ОдинКОдному.ЛеваяАналитика_3 = ВТ_ДанныеРегистра.ЛеваяАналитика_3
	|			И ВТ_ОдинКОдному.ПраваяАналитика_1 = ВТ_ДанныеРегистра.ПраваяАналитика_1
	|			И ВТ_ОдинКОдному.ПраваяАналитика_2 = ВТ_ДанныеРегистра.ПраваяАналитика_2
	|			И ВТ_ОдинКОдному.ПраваяАналитика_3 = ВТ_ДанныеРегистра.ПраваяАналитика_3
	|			И (ВТ_ОдинКОдному.Период > ВТ_ДанныеРегистра.Период
	|					И ВТ_ОдинКОдному.Период <= ВТ_ДанныеРегистра.ДатаОкончания
	|				ИЛИ ВТ_ОдинКОдному.ДатаОкончания >= ВТ_ДанныеРегистра.Период
	|					И ВТ_ОдинКОдному.ДатаОкончания < ВТ_ДанныеРегистра.ДатаОкончания
	|				ИЛИ ВТ_ДанныеРегистра.Период > ВТ_ОдинКОдному.Период
	|					И ВТ_ДанныеРегистра.Период <= ВТ_ОдинКОдному.ДатаОкончания
	|				ИЛИ ВТ_ДанныеРегистра.ДатаОкончания >= ВТ_ОдинКОдному.Период
	|					И ВТ_ДанныеРегистра.ДатаОкончания < ВТ_ОдинКОдному.ДатаОкончания)";
					
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Пояснение = НСтр("ru='Запись не соответствует соотношению ""%1"".';
						|en='Record does not match the ratio of ""%1"".'"); 
		Пояснение = Символы.ПС + СтрШаблон(Пояснение, Реквизиты.ВидСоответствияСоотношение);
		
		Поле = "СписокАналитик[%1].НомерСтроки";
		Поле = СтрШаблон(Поле, Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ="));
		
		ТекстСообщения = НСтр("ru = 'Некорректно заполнена строка ""%1"" списка ""%2"". Такая запись с пересекающимся периодом уже существует в программе.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.НомерСтроки, НСтр("ru = 'Соответствия'"));
		ТекстСообщения = ТекстСообщения + Пояснение;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			Реквизиты.Регистратор, Поле, "Объект", Отказ);
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаСоответствияАналитик", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаКонтрольУникальностиЗаписей", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокАналитик.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	СписокАналитик.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	СписокАналитик.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	СписокАналитик.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	СписокАналитик.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	СписокАналитик.ПраваяАналитика_3 КАК ПраваяАналитика_3,
	|	ВЫБОР
	|		КОГДА СписокАналитик.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Период
	|		ИНАЧЕ СписокАналитик.ДатаНачала
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА СписокАналитик.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &ДатаОкончания
	|		ИНАЧЕ СписокАналитик.ДатаОкончания
	|	КОНЕЦ КАК ДатаОкончания,
	|	СписокАналитик.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_СписокАналитик
	|ИЗ
	|	Документ.бит_НазначениеСоответствияАналитик.СписокАналитик КАК СписокАналитик
	|ГДЕ
	|	СписокАналитик.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокАналитик.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	ВТ_СписокАналитик.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	ВТ_СписокАналитик.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	ВТ_СписокАналитик.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	ВТ_СписокАналитик.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	ВТ_СписокАналитик.ПраваяАналитика_3 КАК ПраваяАналитика_3,
	|	ВТ_СписокАналитик.Период КАК Период,
	|	ИСТИНА КАК Используется
	|ИЗ
	|	ВТ_СписокАналитик КАК ВТ_СписокАналитик
	|ГДЕ
	|	ВТ_СписокАналитик.Период <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СписокАналитик.ЛеваяАналитика_1,
	|	ВТ_СписокАналитик.ЛеваяАналитика_2,
	|	ВТ_СписокАналитик.ЛеваяАналитика_3,
	|	ВТ_СписокАналитик.ПраваяАналитика_1,
	|	ВТ_СписокАналитик.ПраваяАналитика_2,
	|	ВТ_СписокАналитик.ПраваяАналитика_3,
	|	ВЫБОР
	|		КОГДА ВТ_СписокАналитик.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КОНЕЦПЕРИОДА(ВТ_СписокАналитик.ДатаОкончания, ДЕНЬ)
	|		ИНАЧЕ ВТ_СписокАналитик.ДатаОкончания
	|	КОНЕЦ,
	|	ЛОЖЬ
	|ИЗ
	|	ВТ_СписокАналитик КАК ВТ_СписокАналитик
	|ГДЕ
	|	ВТ_СписокАналитик.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокАналитик.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	ВТ_СписокАналитик.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	ВТ_СписокАналитик.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	ВТ_СписокАналитик.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	ВТ_СписокАналитик.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	ВТ_СписокАналитик.ПраваяАналитика_3 КАК ПраваяАналитика_3,
	|	ВТ_СписокАналитик.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ВТ_СписокАналитик.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(2036, 12, 31)
	|	КОНЕЦ КАК ДатаОкончания,
	|	ВТ_СписокАналитик.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_СписокАналитик КАК ВТ_СписокАналитик
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

КонецФункции // ТекстЗапросаСоответствияАналитик()

#КонецОбласти
 
#КонецЕсли
