
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСвойстваСтатьи(Знач Статья) Экспорт
	
	Разрезы = Новый Массив();
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		Разрезы.Добавить("Контрагент");
		Разрезы.Добавить("ДоговорКонтрагента");
		Разрезы.Добавить("Проект");
		Разрезы.Добавить("НоменклатурнаяГруппа");
		Разрезы.Добавить("БанковскийСчет");
		
		Для Индекс = 1 По 7 Цикл
			Разрезы.Добавить("Аналитика_" + Индекс);
		КонецЦикла; 
	Иначе	
		Для Индекс = 1 По 12 Цикл
			Разрезы.Добавить("Аналитика_" + Индекс);
		КонецЦикла; 
	КонецЕсли; 
	
	СвойстваСтатьи = Новый Структура; 
	СвойстваСтатьи.Вставить("Родитель",					  Справочники.бит_СтатьиОборотов.ПустаяСсылка());
	СвойстваСтатьи.Вставить("Код",						  "");
	СвойстваСтатьи.Вставить("Наименование",				  "");
	СвойстваСтатьи.Вставить("Кодификатор",				  "");
	СвойстваСтатьи.Вставить("ВидСтатьи",				  Справочники.бит_ВидыСтатейОборотов.ПустаяСсылка());
	СвойстваСтатьи.Вставить("РасходДоход",				  Перечисления.бит_РасходДоход.ПустаяСсылка());
	СвойстваСтатьи.Вставить("ЕдиницаИзмерения",			  Метаданные.Справочники.бит_СтатьиОборотов.Реквизиты.ЕдиницаИзмерения.Тип.ПривестиЗначение());
	СвойстваСтатьи.Вставить("СтавкаНДС",				  бит_СтавкиНДС.СтавкаНДСПустая());
	СвойстваСтатьи.Вставить("ЭтоКоэффициент",			  Ложь);
	СвойстваСтатьи.Вставить("НеКонтролировать_Сумма",	  Истина);
	СвойстваСтатьи.Вставить("НеКонтролировать_Количество",Истина);
	СвойстваСтатьи.Вставить("НеКонтролировать_Заявки",	  Истина);
	СвойстваСтатьи.Вставить("НеКонтролировать_Бюджеты",	  Истина);
	СвойстваСтатьи.Вставить("НеКонтролировать_Графики",	  Истина);
	
	СвойстваСтатьи.Вставить("Суммовой",		  Ложь);
	СвойстваСтатьи.Вставить("Количественный", Ложь);
	
	Для каждого Разрез Из Разрезы Цикл
		СвойстваСтатьи.Вставить(Разрез, Ложь);
		СвойстваСтатьи.Вставить(Разрез + "ПроверятьЗаполнение", Ложь);
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(Статья) Тогда
		Возврат СвойстваСтатьи;
	КонецЕсли; 

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиОборотов.Ссылка КАК Ссылка,
	|	СтатьиОборотов.Родитель КАК Родитель,
	|	СтатьиОборотов.Код КАК Код,
	|	СтатьиОборотов.Наименование КАК Наименование,
	|	СтатьиОборотов.НаименованиеПолное КАК НаименованиеПолное,
	|	СтатьиОборотов.Кодификатор КАК Кодификатор,
	|	СтатьиОборотов.ВидСтатьи КАК ВидСтатьи,
	|	СтатьиОборотов.РасходДоход КАК РасходДоход,
	|	СтатьиОборотов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СтатьиОборотов.СтавкаНДС КАК СтавкаНДС,
	|	СтатьиОборотов.ЭтоКоэффициент КАК ЭтоКоэффициент,
	|	СтатьиОборотов.НеКонтролировать_Сумма КАК НеКонтролировать_Сумма,
	|	СтатьиОборотов.НеКонтролировать_Количество КАК НеКонтролировать_Количество,
	|	СтатьиОборотов.НеКонтролировать_Заявки КАК НеКонтролировать_Заявки,
	|	СтатьиОборотов.НеКонтролировать_Бюджеты КАК НеКонтролировать_Бюджеты,
	|	СтатьиОборотов.НеКонтролировать_Графики КАК НеКонтролировать_Графики,
	|	&ПоляРазрезов КАК ПоляРазрезов,
	|	СтатьиОборотов.Учет_Количество КАК Учет_Количество,
	|	СтатьиОборотов.Учет_Сумма КАК Учет_Сумма
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|ГДЕ
	|	СтатьиОборотов.Ссылка = &Статья";
	
	ПоляРазрезов = Новый Массив(); 
	ШаблонУчет 		   = "	СтатьиОборотов.Учет_%1 КАК Учет_%1,";
	ШаблонОбязательный = "	СтатьиОборотов.Обязательный_%1 КАК Обязательный_%1,";
	
	Для каждого Разрез Из Разрезы Цикл
		ПоляРазрезов.Добавить(СтрШаблон(ШаблонУчет, Разрез));
		ПоляРазрезов.Добавить(СтрШаблон(ШаблонОбязательный, Разрез));
	КонецЦикла; 
	ПоляРазрезовСтр = СтрСоединить(ПоляРазрезов, Символы.ПС);
	ТекстЗапроса  	= СтрЗаменить(ТекстЗапроса, "&ПоляРазрезов КАК ПоляРазрезов,", ПоляРазрезовСтр);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Статья", Статья);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСтатья = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаСтатья.Следующий() Цикл
		СвойстваСтатьи = Новый Структура; 
		ЗаполнитьЗначенияСвойств(СвойстваСтатьи, ВыборкаСтатья);
		СвойстваСтатьи.Вставить("Суммовой",ВыборкаСтатья.Учет_Сумма);
		СвойстваСтатьи.Вставить("Количественный", ВыборкаСтатья.Учет_Количество);
		
		Для каждого Разрез Из Разрезы Цикл
			СвойстваСтатьи.Вставить(Разрез,ВыборкаСтатья["Учет_" + Разрез]);
			СвойстваСтатьи.Вставить(Разрез + "ПроверятьЗаполнение", ВыборкаСтатья["Обязательный_" + Разрез]);
		КонецЦикла; 
	КонецЦикла;
	
	Возврат СвойстваСтатьи;
	
КонецФункции

// Возвращает описание измерений регистра "Обороты по бюджету". 
//
// Параметры:
//  ИменаИсключений	 - Строка - перечень измерений регистра, разделенных запятой, которые не нужно описывать.
// 
// Возвращаемое значение:
//  ИзмеренияБюджетирования - фиксированная структура.
//
Функция ИзмеренияБюджетирования(ИменаИсключений = "") Экспорт

	Если ПустаяСтрока(ИменаИсключений) Тогда
		Исключения = Новый Массив();
	Иначе
		Исключения = СтрРазделить(ИменаИсключений,",");
	КонецЕсли; 	

	Исключения.Добавить("Валюта");
	НастройкиИзмерений = НастройкиДополнительныхИзмерений();
	ИзмеренияРегистра = Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам.Измерения;
	
	ДанныеРегистра = Новый Структура; 
	ДанныеРегистра.Вставить("КоличествоИзмерений", 0);
	Для Индекс = 1 По ИзмеренияРегистра.Количество() Цикл
		ДанныеРегистра.Вставить("Измерение" + Индекс, 			   	  	   Неопределено);
		ДанныеРегистра.Вставить("Измерение" + Индекс + "Представление",    Неопределено);
		ДанныеРегистра.Вставить("Измерение" + Индекс + "ТипЗначения",      Неопределено);
		ДанныеРегистра.Вставить("Измерение" + Индекс + "Предопределенное", Ложь);
	КонецЦикла; 
	
	Индекс = 0;
	Для каждого Измерение Из ИзмеренияРегистра Цикл

		Если Исключения.Найти(Измерение.Имя) <> Неопределено Тогда
			Продолжить;		
		КонецЕсли; 
		
		Если СтрНачинаетсяС(Измерение.Имя, "Аналитика_") Тогда
			Настройка = НастройкиИзмерений.Получить(Измерение.Имя); 
			Если Настройка = Неопределено Тогда
				Продолжить;
			Иначе	
				Представление 	 = Настройка.Синоним;
				Предопределенное = Ложь;
				ТипЗначения 	 = Настройка.ТипЗначения;
			КонецЕсли; 
		Иначе	
			Представление 	 = Измерение.Представление();
			Предопределенное = Истина;
			ТипЗначения      = Измерение.Тип;
		КонецЕсли; 
		
		Индекс = Индекс + 1;
		ДанныеРегистра.Вставить("Измерение" + Индекс, 			   		   Измерение.Имя);
		ДанныеРегистра.Вставить("Измерение" + Индекс + "Представление",    Представление);
		ДанныеРегистра.Вставить("Измерение" + Индекс + "ТипЗначения",      ТипЗначения);
		ДанныеРегистра.Вставить("Измерение" + Индекс + "Предопределенное", Предопределенное);
	КонецЦикла;
	
	ДанныеРегистра.Вставить("КоличествоИзмерений", Индекс);
	Возврат Новый ФиксированнаяСтруктура(ДанныеРегистра);
	
КонецФункции

Функция НастройкиДополнительныхИзмерений() Экспорт

	Возврат бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений();

КонецФункции

#КонецОбласти
