
	
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НазначениеОбработки = Параметры.НазначениеОбработки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	ДиалогВыбораФайла    = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Обработки (*.epf)|*.epf'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОписаниеОповещения, ДиалогВыбораФайла);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборФайлаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = Результат[0];
	
	АдресДанныхОбработки = ДвоичныеДанныеОбработки();
	Если НЕ ЭтоАдресВременногоХранилища(АдресДанныхОбработки) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохраненияФайлаЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.СохранитьФайл(ОписаниеОповещения, АдресДанныхОбработки, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СохраненияФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    
	Состояние(НСтр("ru = 'Сохранение файлов завершено.'"));
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив")
		И ВыбранныеФайлы.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='Обработка записана в файл %1.';
						 	|en='The processing is recorded in %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ВыбранныеФайлы[0].ПолноеИмя);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстПредупреждения = НСтр("ru='Не удалось записать файл.';
							  	|en='The file could not be written.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ДвоичныеДанныеОбработки()
	
	Если НазначениеОбработки = "ТочкаОбработки" Тогда
		ДвоичныеДанныеОбработки = Справочники.бит_АлгоритмыПроцессов.ПолучитьМакет("ВнешняяОбработкаТочкиОбработки");
	ИначеЕсли НазначениеОбработки = "ТочкаУсловия" Тогда
		ДвоичныеДанныеОбработки = Справочники.бит_АлгоритмыПроцессов.ПолучитьМакет("ВнешняяОбработкаТочкиУсловия");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	АдресДанныхОбработки =  ПоместитьВоВременноеХранилище(ДвоичныеДанныеОбработки, Новый УникальныйИдентификатор);
	
	Возврат АдресДанныхОбработки;
	
КонецФункции

#КонецОбласти
