#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
Функция ИнициализироватьКомпоновщик(Компоновщик) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьМакет("СКД");
	
	мНастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	бит_МеханизмДопИзмерений.СформироватьЗаголовкиПолейДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "НаборДанных1",
																					мНастройкиИзмерений);
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	Компоновщик.Инициализировать(ИсточникНастроек);
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	Возврат АдресСхемыКомпоновкиДанных;

КонецФункции

Функция ПолучитьТаблицуДокументов(АдресСхемыКомпоновкиДанных, Компоновщик, СтруктураПараметров) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);

	ПараметрыСКД = Компоновщик.Настройки.ПараметрыДанных;
	ПараметрыСКД.УстановитьЗначениеПараметра("Регистратор", СтруктураПараметров.Регистратор);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиСКД = Компоновщик.ПолучитьНастройки(); 	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
						НастройкиСКД,
						,
						,
						Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаОборотов = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаОборотов);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Возврат ТаблицаОборотов;
	
КонецФункции

Процедура СоздатьДокументыПланирования(МассивДокументов, МассивЗаявок, МассивПоступлений) Экспорт
	
	СоставАналитик = ОпределитьСоставАналитик();
	Для Каждого СтрокаДокумент Из МассивДокументов Цикл
		// Подготовка структуры заполнения.
		ВидПлана = Перечисления.бит_кзн_ВидыПланов.План;
		ПараметрыЗаполненияДокумента = ПодготовитьПараметрыЗаполненияДокумента(ВидПлана, СоставАналитик, СтрокаДокумент);
		СоздатьДокументы(ПараметрыЗаполненияДокумента, МассивЗаявок, МассивПоступлений);
	КонецЦикла;

КонецПроцедуры

Процедура СоздатьДокументыПрогнозирования(МассивДокументов, МассивЗаявок, МассивПоступлений) Экспорт
	
	СоставАналитик = ОпределитьСоставАналитик();
	Для Каждого СтрокаДокумент Из МассивДокументов Цикл
		// Подготовка структуры заполнения.
		ВидПлана = Перечисления.бит_кзн_ВидыПланов.Прогноз;
		ПараметрыЗаполненияДокумента = ПодготовитьПараметрыЗаполненияДокумента(ВидПлана, СоставАналитик, СтрокаДокумент);
		СоздатьДокументы(ПараметрыЗаполненияДокумента, МассивЗаявок, МассивПоступлений);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьДокументы(ПараметрыЗаполненияДокумента, МассивЗаявок, МассивПоступлений) 
	
	// Если направление - "Расходование", тогда.
	Если ПараметрыЗаполненияДокумента.РасходДоход = Перечисления.бит_РасходДоход.Расходование Тогда
		ВидыОпераций = бит_КазначействоКлиентСервер.ВидыОперацийЗаявкиНаРасходованиеСредств(); 
		Если ВидыОпераций.Найти(ПараметрыЗаполненияДокумента.ХозяйственнаяОперация) <> Неопределено Тогда
			СоздатьДокументыНаРасходованиеСредств(ПараметрыЗаполненияДокумента, МассивЗаявок);
		ИначеЕсли ПараметрыЗаполненияДокумента.ВидПлана = Перечисления.бит_кзн_ВидыПланов.План Тогда
			СоздатьДокументыПланированияРасходования(ПараметрыЗаполненияДокумента, МассивЗаявок);
		КонецЕсли;
	Иначе
		СоздатьДокументыПланированияПоступления(ПараметрыЗаполненияДокумента, МассивПоступлений);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьДокументыНаРасходованиеСредств(ПараметрыЗаполненияДокумента, МассивЗаявок)
	
	ДанныеЗаполнения = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(ПараметрыЗаполненияДокумента);
		
	ПараметрыХозОперации = бит_Казначейство.ПодготовитьПараметрыВидимости(ДанныеЗаполнения.ХозяйственнаяОперация);			
	Если НЕ ПараметрыХозОперации.ЕстьКонтрагент Тогда
		ДанныеЗаполнения.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли; 
	
	Если НЕ ПараметрыХозОперации.ЕстьОбъектРасчетов Тогда
		ДанныеЗаполнения.ОбъектРасчетов = Неопределено;
	КонецЕсли;
	
	Если НЕ (ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты
		ИЛИ ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоКредитам
		ИЛИ ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты   
		ИЛИ ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаЗаймов) Тогда  
		
		ДанныеЗаполнения.ДоговорКредитаДепозита = Справочники.ДоговорыКредитовИДепозитов.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаАрендодателю Тогда
		// ++ НЕ УТ
		ДанныеЗаполнения.ДоговорАренды = Справочники.ДоговорыАренды.ПустаяСсылка();
		// -- НЕ УТ
	КонецЕсли;
	
	СтруктураБанковскийСчет = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.БанковскийСчет, "Владелец, ВалютаДенежныхСредств");
	Если ДанныеЗаполнения.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.БанковскийСчет) 
			И Не СтруктураБанковскийСчет.Владелец = ДанныеЗаполнения.Организация Тогда
			ДанныеЗаполнения.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
		КонецЕсли;
	Иначе
		ДанныеЗаполнения.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
	КонецЕсли;
	
	ДанныеЗаполнения.ДатаПлан  = ?(ПараметрыЗаполненияДокумента.Период > ТекущаяДатаСеанса(),
											ПараметрыЗаполненияДокумента.Период, ТекущаяДатаСеанса());
	ДанныеЗаполнения.СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗаполненияДокумента.СтатьяОборотов, "СтавкаНДС");
	ДанныеЗаполнения.СуммаНДС  = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(ДанныеЗаполнения.СуммаДокумента, 
												Истина, Истина, бит_СтавкиНДС.ЗначениеСтавкиНДС(ДанныеЗаполнения.СтавкаНДС));

	ПлатежнаяПозиция = Документы.бит_кзн_ПлатежнаяПозиция.СоздатьДокумент();
	ПлатежнаяПозиция.Заполнить(ДанныеЗаполнения);
	
	бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ПлатежнаяПозиция, РежимЗаписиДокумента.Запись,,"Ошибки");
	ДокументПланирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежнаяПозиция.Ссылка, "ДокументПланирования");
	
	МассивЗаявок.Добавить(ДокументПланирования);

КонецПроцедуры

Процедура СоздатьДокументыПланированияРасходования(ПараметрыЗаполненияДокумента, Заявки)
	
	ВидыОпераций = бит_КазначействоКлиентСервер.ВидыОперацийЗаявкаНаПеремещение(); 
	Если ВидыОпераций.Найти(ПараметрыЗаполненияДокумента.ХозяйственнаяОперация) <> Неопределено Тогда
		ДокументПланирования = Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.СоздатьДокумент();
	Иначе
		ДокументПланирования = Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.СоздатьДокумент();
		ПараметрыЗаполненияДокумента.Удалить("ОбъектРасчетов");
	КонецЕсли;
	
	// Заполним шапку документа.
	ЗаполнитьЗначенияСвойств(ДокументПланирования, ПараметрыЗаполненияДокумента);
	ДокументПланирования.Дата = ТекущаяДатаСеанса();
	ДокументПланирования.Ответственный = Пользователи.ТекущийПользователь();
	
	КурсВалютыДокумента = бит_КурсыВалют.ПолучитьКурсВалюты(ДокументПланирования.ВалютаДокумента, ДокументПланирования.Дата);
	ДокументПланирования.КурсДокумента      = КурсВалютыДокумента.Курс;
	ДокументПланирования.КратностьДокумента = КурсВалютыДокумента.Кратность;
	
	бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументПланирования, РежимЗаписиДокумента.Запись,,"Ошибки");
	
	// Платежная позиция.
	ПлатежнаяПозиция = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(ДокументПланирования.Ссылка).Позиция;
	ДокументОбъект 	 = ПлатежнаяПозиция.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ПараметрыЗаполненияДокумента);
	
	ПараметрыХозОперации = бит_Казначейство.ПодготовитьПараметрыВидимости(ДокументОбъект.ХозяйственнаяОперация);			
	Если НЕ ПараметрыХозОперации.ЕстьКонтрагент Тогда
		ДокументОбъект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли; 
	
	Если НЕ ПараметрыХозОперации.ЕстьОбъектРасчетов Тогда
		ДокументОбъект.ОбъектРасчетов = Неопределено;
	КонецЕсли;
	
	ВидОперации = ДокументОбъект.ХозяйственнаяОперация;
	Если НЕ (ВидОперации = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийКазначейства.ОплатаПоКредитам
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты   
		ИЛИ ВидОперации = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаЗаймов) Тогда  
		
		ДокументОбъект.ДоговорКредитаДепозита = Справочники.ДоговорыКредитовИДепозитов.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ВидОперации = Перечисления.бит_ВидыОперацийКазначейства.ОплатаАрендодателю Тогда
		// ++ НЕ УТ
		ДокументОбъект.ДоговорАренды = Справочники.ДоговорыАренды.ПустаяСсылка();
		// -- НЕ УТ
	КонецЕсли;
	
	Если НЕ ВидОперации = Перечисления.бит_ВидыОперацийКазначейства.ВозвратОплатыНаПлатежнуюКарту Тогда
		ДокументОбъект.ДоговорЭквайринга = Справочники.ДоговорыЭквайринга.ПустаяСсылка();
	КонецЕсли;
	
	БанковскийСчетРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.БанковскийСчет, "Владелец, ВалютаДенежныхСредств");
	Если ДокументОбъект.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
		Если ЗначениеЗаполнено(ДокументОбъект.БанковскийСчет) 
			И НЕ БанковскийСчетРеквизиты.Владелец = ДокументОбъект.Организация Тогда
			ДокументОбъект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
		КонецЕсли;
	Иначе
		ДокументОбъект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
	КонецЕсли;
	
	ДокументОбъект.ДатаПлан = ?(ПараметрыЗаполненияДокумента.Период > ТекущаяДатаСеанса(),
										ПараметрыЗаполненияДокумента.Период, ТекущаяДатаСеанса());
	
	бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументОбъект, РежимЗаписиДокумента.Запись,,"Ошибки");
	
	// Позиция поступления.
	ПозицияПоступления = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(ДокументПланирования.Ссылка).Позиция;
	ДокументОбъект = ПозицияПоступления.ПолучитьОбъект();
	ДокументОбъект.ДатаПлан = ПараметрыЗаполненияДокумента.Период;
	бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументОбъект, РежимЗаписиДокумента.Запись,,"Ошибки");
	
	Заявки.Добавить(ДокументПланирования.Ссылка);

КонецПроцедуры

Процедура СоздатьДокументыПланированияПоступления(ПараметрыЗаполненияДокумента, МассивПоступлений)
		
	ДанныеЗаполнения = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(ПараметрыЗаполненияДокумента);
	
	ДанныеЗаполнения.ДатаПлан  = ?(ПараметрыЗаполненияДокумента.Период > ТекущаяДатаСеанса(),
												ПараметрыЗаполненияДокумента.Период, ТекущаяДатаСеанса());
	ДанныеЗаполнения.СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗаполненияДокумента.СтатьяОборотов, "СтавкаНДС");
	ДанныеЗаполнения.СуммаНДС  = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(ДанныеЗаполнения.СуммаДокумента,
												Истина, Истина, бит_СтавкиНДС.ЗначениеСтавкиНДС(ДанныеЗаполнения.СтавкаНДС));
												
	ПозицияПоступления = Документы.бит_кзн_ПозицияПоступления.СоздатьДокумент();											
	ПозицияПоступления.Заполнить(ДанныеЗаполнения);
	
	// Запишем созданный документ.
	бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ПозицияПоступления, РежимЗаписиДокумента.Запись,,"Ошибки");
	ДокументПланирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияПоступления.Ссылка, "ДокументПланирования");
	
	МассивПоступлений.Добавить(ДокументПланирования.Ссылка);

КонецПроцедуры

// Определяет, по типу значения, возможное положение ключевых реквизитов среди аналитик.
//  Ключевыми ре являются: "Банковский счет", "Организация", "Контрагент", "Договор контрагента",
//  "Договор кредита и депозита", "Договор лизинга".
// 
// Возвращаемое значение:
//  Структура - Ключ - имя ключевого реквизита, значение - имя колонки аналитики.
//
Функция ОпределитьСоставАналитик()
	
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	ВГраница = бит_МеханизмДопИзмерений.ПолучитьМаксимальноеКоличествоДополнительныхИзмерений();
	СтруктураАналитик = Новый Структура;
	
	Для Индекс = 1 По ВГраница Цикл
		ИмяАналитики = "Аналитика_" + Индекс; 
		ТекАналитика = НастройкиИзмерений[ИмяАналитики];
		Если ТекАналитика = Неопределено Тогда
			Продолжить;
		ИначеЕсли НЕ СтруктураАналитик.Свойство("БанковскийСчет")
			И ТекАналитика.ТипЗначения.СодержитТип(Тип("СправочникСсылка.БанковскиеСчетаОрганизаций")) Тогда
			СтруктураАналитик.Вставить("БанковскийСчет", ИмяАналитики);
		ИначеЕсли НЕ СтруктураАналитик.Свойство("Организация")
			И ТекАналитика.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Организации")) Тогда
			СтруктураАналитик.Вставить("Организация", ИмяАналитики);
		ИначеЕсли НЕ СтруктураАналитик.Свойство("Контрагент")
			И ТекАналитика.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
			СтруктураАналитик.Вставить("Контрагент", ИмяАналитики);
		ИначеЕсли НЕ СтруктураАналитик.Свойство("ОбъектРасчетов")
			И ТекАналитика.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
			СтруктураАналитик.Вставить("ОбъектРасчетов", ИмяАналитики);
		ИначеЕсли НЕ СтруктураАналитик.Свойство("ДоговорКредитаДепозита")
			И ТекАналитика.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКредитовИДепозитов")) Тогда
			СтруктураАналитик.Вставить("ДоговорКредитаДепозита", ИмяАналитики);
		ИначеЕсли НЕ СтруктураАналитик.Свойство("ДоговорАренды")
			И (бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды()
			И ТекАналитика.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыАренды"))) Тогда
			СтруктураАналитик.Вставить("ДоговорАренды", ИмяАналитики);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураАналитик;
	
КонецФункции

Функция НовыеПараметрыЗаполненияДокумента()
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Период",					'0001-01-01');
	ПараметрыЗаполнения.Вставить("ДатаПлан",				ТекущаяДатаСеанса());
	ПараметрыЗаполнения.Вставить("ВидПлана",				Перечисления.бит_кзн_ВидыПланов.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Сценарий",				Справочники.СценарииПланирования.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ЦФО",						Справочники.Подразделения.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ВалютаДокумента",			Справочники.Валюты.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("СтатьяОборотов",			Справочники.бит_СтатьиОборотов.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ХозяйственнаяОперация",	Перечисления.бит_ВидыОперацийКазначейства.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ФормаОплаты",				Перечисления.бит_ВидыДенежныхСредств.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("РасходДоход",				Перечисления.бит_РасходДоход.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Регистратор",				Неопределено);
	ПараметрыЗаполнения.Вставить("СуммаДокумента",			0);
	ПараметрыЗаполнения.Вставить("СтавкаНДС",				Неопределено);
	ПараметрыЗаполнения.Вставить("СуммаНДС",				0);
	ПараметрыЗаполнения.Вставить("ОрганизацияЦФО",			Справочники.Организации.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Аналитика_1",				Неопределено);
	ПараметрыЗаполнения.Вставить("Аналитика_2",				Неопределено);
	ПараметрыЗаполнения.Вставить("Аналитика_3",				Неопределено);
	ПараметрыЗаполнения.Вставить("Аналитика_4",				Неопределено);
	ПараметрыЗаполнения.Вставить("Аналитика_5",				Неопределено);
	ПараметрыЗаполнения.Вставить("Аналитика_6",				Неопределено);
	ПараметрыЗаполнения.Вставить("Аналитика_7",				Неопределено);
	ПараметрыЗаполнения.Вставить("Аналитика_8",				Неопределено);
	ПараметрыЗаполнения.Вставить("Аналитика_9",				Неопределено);
	ПараметрыЗаполнения.Вставить("Аналитика_10",			Неопределено);
	ПараметрыЗаполнения.Вставить("Аналитика_11",			Неопределено);
	ПараметрыЗаполнения.Вставить("Аналитика_12",			Неопределено);
	ПараметрыЗаполнения.Вставить("БанковскийСчет",			Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Организация",				Справочники.Организации.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Контрагент",				Справочники.Контрагенты.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ОбъектРасчетов",			Неопределено);
	ПараметрыЗаполнения.Вставить("ДоговорКредитаДепозита",	Справочники.ДоговорыКредитовИДепозитов.ПустаяСсылка());
	// ++ НЕ УТ
	ПараметрыЗаполнения.Вставить("ДоговорАренды",			Справочники.ДоговорыАренды.ПустаяСсылка());
	// -- НЕ УТ
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Процедура ДополнитьПараметрыЗаполнения(ПараметрыЗаполнения, СоставАналитик)

	Для каждого Аналитика Из СоставАналитик Цикл
		ПараметрыЗаполнения[Аналитика.Ключ] = ПараметрыЗаполнения[Аналитика.Значение];
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.Организация) Тогда
		ПараметрыЗаполнения.Организация = ПараметрыЗаполнения.ОрганизацияЦФО;
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьПараметрыЗаполненияДокумента(ВидПлана, СоставАналитик, СтрокаДокумент)
	
	ПараметрыЗаполненияДокумента = НовыеПараметрыЗаполненияДокумента();
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполненияДокумента, СтрокаДокумент);
	ДополнитьПараметрыЗаполнения(ПараметрыЗаполненияДокумента, СоставАналитик);
	ПараметрыЗаполненияДокумента.ВидПлана = ВидПлана;
	
	Возврат ПараметрыЗаполненияДокумента;

КонецФункции

#КонецОбласти

#КонецЕсли