
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	фКэшЗначений = Новый Структура;
	фКэшЗначений.Вставить("ВалютаУпрлУчета", Константы.бит_ВалютаУправленческогоУчета.Получить());
	УстановитьВидимостьДоступность();
		
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры // НастройкаПриИзменении()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость и доступность элементов формы.
// 
&НаСервере
Процедура УстановитьВидимостьДоступность()

	Если Запись.Настройка = ПланыВидовХарактеристик.бит_вго_ВидыНастроекСверкиВГО.ДопустимоеРасхождение Тогда
	
		Элементы.ДекорацияДоп.Видимость = Истина;
		Элементы.ДекорацияДоп.Заголовок = фКэшЗначений.ВалютаУпрлУчета;
		
	Иначе
		
		Элементы.ДекорацияДоп.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры // УстановитьВидимостьДоступность()

#КонецОбласти

