#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти = Неопределено) Экспорт
	
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КомиссияЗаВыдачу";
	Элемент.Наименование              = НСтр("ru='Комиссия за выдачу';en='Issue fee'", КодОсновногоЯзыка);
	Элемент.ТипПлатежаПоФинДоговору   = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.Комиссия;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КомиссияЗаНеиспользованныйЛимит";
	Элемент.Наименование              = НСтр("ru='Комиссия за неиспользованный лимит';en='Fee for unused limit'", КодОсновногоЯзыка);
	Элемент.ТипПлатежаПоФинДоговору   = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.КомиссияЗаНеиспользованныйЛимит;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПогашениеОсновногоДолга";
	Элемент.Наименование              = НСтр("ru='Погашение основного долга';en='Repayment of principal'", КодОсновногоЯзыка);
	Элемент.ТипПлатежаПоФинДоговору   = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.ОсновнойДолг;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Проценты";
	Элемент.Наименование              = НСтр("ru='Проценты';en='Percent'", КодОсновногоЯзыка);
	Элемент.ТипПлатежаПоФинДоговору   = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.Проценты;
		
КонецПроцедуры

// См. бит_ОбновлениеИнформационнойБазыБФ.ПередОбновлениемИнформационнойБазы().
//
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли