
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [05.11.2025] +        
	
	Если Объект.ВидДокумента = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ШаблонДокументаОсновныеНачисленияПоНарядам, ЭтотОбъект, Истина) Тогда
		//Кнопка
		Команда = ЭтаФорма.Команды.Добавить("бит_ЗаполнитьДаннымиНарядов");
		Команда.Действие = "бит_ЗаполнитьДаннымиНарядов";
		Команда.Заголовок = "(бит) Заполнить данными нарядов";
		
		//Добавляем новую кнопку
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ЗаполнитьДаннымиНарядов", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.Заголовок = "(бит) Заполнить данными нарядов";
		НовыйЭлемент.ИмяКоманды = "бит_ЗаполнитьДаннымиНарядов"; 
		
	КонецЕсли;

	// }}ПервыйБИТ ЛистТребований [ЛТ6.2] [ASHolyavko@1cbit.ru] [05.11.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ЗаполнитьДаннымиНарядов(Команда)
	
	ЗаполнитьПоказателиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиНаСервере();   
	
	ДанныеСводно.Очистить();
	
	Начисление_002 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_002, ЭтотОбъект, Истина);
	Начисление_004 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_004, ЭтотОбъект, Истина);
    Начисление_005 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_005, ЭтотОбъект, Истина);
    Начисление_014 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_014, ЭтотОбъект, Истина);
	Начисление_021 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_021, ЭтотОбъект, Истина);
	Начисление_028 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_028, ЭтотОбъект, Истина);
	Начисление_037 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_037, ЭтотОбъект, Истина);
	Начисление_105 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_105, ЭтотОбъект, Истина);
	Начисление_107 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_107, ЭтотОбъект, Истина);
	Начисление_128 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_128, ЭтотОбъект, Истина);
	Начисление_073 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_073, ЭтотОбъект, Истина);	
	
	МассивНачислений = Новый Массив;
	МассивНачислений.Добавить(Начисление_002);
	МассивНачислений.Добавить(Начисление_004);
	МассивНачислений.Добавить(Начисление_005);
	МассивНачислений.Добавить(Начисление_014);
	МассивНачислений.Добавить(Начисление_021);
	МассивНачислений.Добавить(Начисление_028);
	МассивНачислений.Добавить(Начисление_037);
	МассивНачислений.Добавить(Начисление_105);
	МассивНачислений.Добавить(Начисление_107);
	МассивНачислений.Добавить(Начисление_128);
	МассивНачислений.Добавить(Начисление_073);
	
	Показатель_002 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаСдельнойОплаты, ЭтотОбъект, Истина);
	Показатель_004 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаПовременнойОплаты, ЭтотОбъект, Истина);
    Показатель_005 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаОплатыПоНормоЗаданиям, ЭтотОбъект, Истина);
    Показатель_014 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаДоплатыЗаИсполнениеОбязанностейВременноОтсутствующегоРаботника, ЭтотОбъект, Истина);
	Показатель_021 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаОплатыЗаРаботуВСверхурочноеВремя, ЭтотОбъект, Истина);
	Показатель_028 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаОплатыВремениПростоя, ЭтотОбъект, Истина);
	Показатель_037 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаОплатыРаботыВВыходнойПраздничныйДеньПоПриказу, ЭтотОбъект, Истина);
	Показатель_105 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаОплатыПовременнойПроизвРаботы, ЭтотОбъект, Истина);
	Показатель_107 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаОплатыПроизводственныхРаботВВыходнойДень, ЭтотОбъект, Истина);
	Показатель_128 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаОплатыВремениПростояВВыходнойДень, ЭтотОбъект, Истина);
	Показатель_073 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаДоплатыЗаПроцентПеревыполнения, ЭтотОбъект, Истина);
	
	СоотвтетствиеНачсленийИПоказателей = Новый Соответствие;
	СоотвтетствиеНачсленийИПоказателей.Вставить(Начисление_002, Показатель_002);
	СоотвтетствиеНачсленийИПоказателей.Вставить(Начисление_004, Показатель_004);
	СоотвтетствиеНачсленийИПоказателей.Вставить(Начисление_005, Показатель_005);
	СоотвтетствиеНачсленийИПоказателей.Вставить(Начисление_014, Показатель_014);
	СоотвтетствиеНачсленийИПоказателей.Вставить(Начисление_021, Показатель_021);
	СоотвтетствиеНачсленийИПоказателей.Вставить(Начисление_028, Показатель_028);
	СоотвтетствиеНачсленийИПоказателей.Вставить(Начисление_037, Показатель_037);
	СоотвтетствиеНачсленийИПоказателей.Вставить(Начисление_105, Показатель_105);
	СоотвтетствиеНачсленийИПоказателей.Вставить(Начисление_107, Показатель_107);
	СоотвтетствиеНачсленийИПоказателей.Вставить(Начисление_128, Показатель_128); 
	СоотвтетствиеНачсленийИПоказателей.Вставить(Начисление_073, Показатель_073);

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ДанныеДляРасчетаПоНарядамОбороты.Сотрудник КАК Сотрудник,
		|	бит_ДанныеДляРасчетаПоНарядамОбороты.Начисление КАК Начисление,
		|	СУММА(бит_ДанныеДляРасчетаПоНарядамОбороты.СуммаОборот) КАК Сумма,
		|	бит_ДанныеДляРасчетаПоНарядамОбороты.Подразделение КАК Подразделение,
		|	СУММА(0) КАК СуммаНачисленоВсего
		|ПОМЕСТИТЬ вт_СуммыНачислений
		|ИЗ
		|	РегистрНакопления.бит_ДанныеДляРасчетаПоНарядам.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Подразделение = &Подразделение) КАК бит_ДанныеДляРасчетаПоНарядамОбороты
		|ГДЕ
		|	бит_ДанныеДляРасчетаПоНарядамОбороты.Начисление В(&МассивНачислений)
		|	И бит_ДанныеДляРасчетаПоНарядамОбороты.Регистратор <> &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ДанныеДляРасчетаПоНарядамОбороты.Сотрудник,
		|	бит_ДанныеДляРасчетаПоНарядамОбороты.Начисление,
		|	бит_ДанныеДляРасчетаПоНарядамОбороты.Подразделение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_ВыплатыПоНарядамОбороты.Сотрудник,
		|	бит_ВыплатыПоНарядамОбороты.Начисление,
		|	СУММА(0),
		|	бит_ВыплатыПоНарядамОбороты.Подразделение,
		|	СУММА(0)
		|ИЗ
		|	РегистрНакопления.бит_ВыплатыПоНарядам.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Подразделение = &Подразделение) КАК бит_ВыплатыПоНарядамОбороты
		|ГДЕ
		|	бит_ВыплатыПоНарядамОбороты.Начисление В(&МассивНачислений)
		|	И бит_ВыплатыПоНарядамОбороты.Регистратор <> &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ВыплатыПоНарядамОбороты.Сотрудник,
		|	бит_ВыплатыПоНарядамОбороты.Начисление,
		|	бит_ВыплатыПоНарядамОбороты.Подразделение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_ВыплатыПоНарядамОбороты.Сотрудник,
		|	бит_ВыплатыПоНарядамОбороты.Начисление,
		|	СУММА(0),
		|	бит_ВыплатыПоНарядамОбороты.Подразделение,
		|	СУММА(бит_ВыплатыПоНарядамОбороты.СуммаОборот)
		|ИЗ
		|	РегистрНакопления.бит_ВыплатыПоНарядам.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Подразделение = &Подразделение) КАК бит_ВыплатыПоНарядамОбороты
		|ГДЕ
		|	бит_ВыплатыПоНарядамОбороты.Начисление В(&МассивНачислений)
		|	И бит_ВыплатыПоНарядамОбороты.Регистратор <> &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ВыплатыПоНарядамОбороты.Сотрудник,
		|	бит_ВыплатыПоНарядамОбороты.Начисление,
		|	бит_ВыплатыПоНарядамОбороты.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Итоговая.Сотрудник КАК Сотрудник,
		|	вт_Итоговая.Начисление КАК Начисление,
		|	СУММА(вт_Итоговая.Сумма) КАК Сумма,
		|	вт_Итоговая.Подразделение КАК Подразделение,
		|	СУММА(вт_Итоговая.СуммаНачисленоВсего) КАК СуммаНачисленоВсего
		|ПОМЕСТИТЬ вт_Итоговая
		|ИЗ
		|	вт_СуммыНачислений КАК вт_Итоговая
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_Итоговая.Сотрудник,
		|	вт_Итоговая.Начисление,
		|	вт_Итоговая.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Итоговая.Сотрудник КАК Сотрудник,
		|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
		|	вт_Итоговая.Начисление КАК Начисление,
		|	вт_Итоговая.Сумма КАК Сумма,
		|	ЕСТЬNULL(вт_Итоговая.СуммаНачисленоВсего, 0) КАК СуммаНачисленоВсего
		|ИЗ
		|	вт_Итоговая КАК вт_Итоговая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаОкончания, ) КАК КадроваяИсторияСотрудниковСрезПоследних
		|		ПО вт_Итоговая.Сотрудник = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
		|			И вт_Итоговая.Подразделение = КадроваяИсторияСотрудниковСрезПоследних.Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт_Итоговая.Сотрудник.Наименование
		|ИТОГИ
		|	МАКСИМУМ(Должность),
		|	СУММА(Сумма),
		|	СУММА(СуммаНачисленоВсего)
		|ПО
		|	Сотрудник";
	
	Запрос.УстановитьПараметр("МассивНачислений", МассивНачислений);
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Период));
	//Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.Период));
	//Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(?(Объект.ИспользоватьПриРасчетеПервойПоловиныМесяца, НачалоМесяца(Объект.Период) + 21600 , КонецМесяца(Объект.Период))));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСотрудник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//С включенным флагом «Использовать при расчете первой половины месяца», где срабатывают установленные ограничения по сумме зарплаты за первую половину месяца по реквизиту "(бит) Категория должности" (позиция ШР, на которую трудоустроен сотрудник):
	//Основные рабочие - ограничение max 40 000 рублей;
	//Вспомогательные рабочие - ограничений нет;
	//Ученики основных рабочих и Ученики вспомогательных рабочих - ограничение max 5 000 рублей.
	
	КатегорииВспомогательныеРабочие = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.КатегорииВспомогательныеРабочие, ЭтотОбъект);
	КатегорииОсновныеРабочие = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.КатегорииОсновныеРабочие, ЭтотОбъект);
	КатегорииУченикиОсновныхРабочихИУченикиВспомогательныхРабочих = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.КатегорииУченикиОсновныхРабочихИУченикиВспомогательныхРабочих, ЭтотОбъект);
	
	СуммаВспомогательныхРабочих = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаВспомогательныхРабочих, ЭтотОбъект, Истина);
	СуммаОсновныхРабочих = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаОсновныхРабочих, ЭтотОбъект, Истина);
	СуммаУчеников = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.СуммаУчеников, ЭтотОбъект, Истина);
	
	Пока ВыборкаСотрудник.Следующий() Цикл
		
		Если Объект.ИспользоватьПриРасчетеПервойПоловиныМесяца И ВыборкаСотрудник.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДанныеСводно.Добавить();
		НоваяСтрока.Объект = ВыборкаСотрудник.Сотрудник;
		
		ОбщаяСуммаНачислений = ВыборкаСотрудник.Сумма;
		СуммаОграничения = 0;
		СуммаКВыплатеНачислено = 0;
		
		Если Объект.ИспользоватьПриРасчетеПервойПоловиныМесяца Тогда
			
			Если КатегорииВспомогательныеРабочие.Найти(ВыборкаСотрудник.Должность.бит_КатегорияДолжности) <> Неопределено Тогда
				СуммаОграничения = СуммаВспомогательныхРабочих;
			ИначеЕсли КатегорииОсновныеРабочие.Найти(ВыборкаСотрудник.Должность.бит_КатегорияДолжности) <> Неопределено Тогда
				СуммаОграничения = СуммаОсновныхРабочих;
			ИначеЕсли КатегорииУченикиОсновныхРабочихИУченикиВспомогательныхРабочих.Найти(ВыборкаСотрудник.Должность.бит_КатегорияДолжности) <> Неопределено Тогда
				СуммаОграничения = СуммаУчеников;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СуммаОграничения) Тогда
				
				СуммаКВыплате = СуммаОграничения - ВыборкаСотрудник.СуммаНачисленоВсего;
				
				Если СуммаКВыплате <= 0 Тогда
					
					Сообщить("Сотрудник: " + ВыборкаСотрудник.Сотрудник + 
							" категория должности: " + ВыборкаСотрудник.Должность.бит_КатегорияДолжности +
							" достигнуто ограничение по начислениям в размере: " + СуммаОграничения);
					Прервать;
					
				КонецЕсли;
				
			Иначе
				
				СуммаКВыплате = ВыборкаСотрудник.Сумма;
				
			КонецЕсли;
			
		Иначе
			
			СуммаКВыплате = ВыборкаСотрудник.Сумма;
			
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Отбор = Новый Структура("Показатель", СоотвтетствиеНачсленийИПоказателей.Получить(ВыборкаДетальныеЗаписи.Начисление));
			СтрокаПоказателя = ПоказателиРасчетаЗарплаты.НайтиСтроки(Отбор);
			
			Если СтрокаПоказателя.Количество() <> 0 Тогда
				
				Если Объект.ИспользоватьПриРасчетеПервойПоловиныМесяца Тогда
					
					МожноСписать = Мин(ВыборкаДетальныеЗаписи.Сумма, СуммаКВыплате);	
					
					НоваяСтрока[СтрокаПоказателя[0].ИмяРеквизита] = МожноСписать;
					
					СуммаКВыплате = СуммаКВыплате - МожноСписать;
					
					Если СуммаКВыплате = 0 Тогда
						
						//Если Объект.ИспользоватьПриРасчетеПервойПоловиныМесяца Тогда
							Сообщить("Сотрудник: " + ВыборкаДетальныеЗаписи.Сотрудник + 
							" категория должности: " + ВыборкаДетальныеЗаписи.Должность.бит_КатегорияДолжности +
							" достигнуто ограничение по начислениям в размере: " + СуммаОграничения);	
						//КонецЕсли;
						
						Прервать;
						
					КонецЕсли;
					
				Иначе
					
					Если ВыборкаДетальныеЗаписи.Сумма < 0  Тогда
						
						НоваяСтрока[СтрокаПоказателя[0].ИмяРеквизита] = ВыборкаДетальныеЗаписи.Сумма;
						
					Иначе
						
						НоваяСтрока[СтрокаПоказателя[0].ИмяРеквизита] = ВыборкаДетальныеЗаписи.Сумма - ВыборкаДетальныеЗаписи.СуммаНачисленоВсего;
						
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;
		
	Модифицированность = Истина;
	
КонецПроцедуры