#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИТК_ИсследованиеЗначенийСервер.УстановитьУсловноеОформление(ЭтотОбъект, "ДеревоЗначений");

	Имя = Параметры.Имя;
	Контекст = Параметры.Контекст;
	
	Если Контекст = ИТК_КонсольКодаКлиентСервер.КонтекстКлиент() Тогда
		
		ПереданноеЗначение = Параметры.Значение;
		АдресЗначения = ПоместитьВоВременноеХранилище(ПереданноеЗначение, УникальныйИдентификатор);
		ЗначениеЗаполнения = ПереданноеЗначение;
		
	Иначе
		
		ПереданноеЗначение = ПолучитьИзВременногоХранилища(Параметры.Значение);
		АдресЗначения = ПоместитьВоВременноеХранилище(ПереданноеЗначение, УникальныйИдентификатор);
		
		ЗначениеЗаполнения = ИТК_ИсследованиеЗначенийСервер.ИзвлечениеПереданногоЗначения(ПереданноеЗначение);
		
	КонецЕсли;
	
	// Первоначальное заполнение
	ИТК_ИсследованиеЗначенийКлиентСервер.РазвернутьСтрокуВФорме(ПереданноеЗначение, ДеревоЗначений, ЗначениеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЗначений

&НаКлиенте
Процедура ДеревоЗначенийВыбор(Элемент, ИдентификаторСтроки, Поле, СтандартнаяОбработка)
	
	ИТК_ИсследованиеЗначенийКлиент.РезультатПеременныеВыбор(ЭтотОбъект, Элемент, ИдентификаторСтроки, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийПередРазворачиванием(Элемент, ИдентификаторСтроки, Отказ)
	
	ИТК_ИсследованиеЗначенийКлиент.ДеревоЗначенийПередРазворачиванием(ЭтотОбъект, Элемент, ИдентификаторСтроки, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВызовСервераВКонтекстеФормы(ПолноеИмяМетода, Параметры = Неопределено) Экспорт
	
	ИТК_Общий.ВызовСервераВКонтекстеФормы(ЭтотОбъект, ПолноеИмяМетода, Параметры);
	
КонецПроцедуры

&НаСервере
Функция ВызовФункцииСервераВКонтекстеФормы(ПолноеИмяМетода, Параметры = Неопределено) Экспорт
	
	Возврат ИТК_Общий.ВызовФункцииСервераВКонтекстеФормы(ЭтотОбъект, ПолноеИмяМетода, Параметры);
	
КонецФункции

&НаКлиенте
Функция ИТК_ИсследованиеЗначений_Контекст() Экспорт
	
	Возврат Контекст;
	
КонецФункции

&НаСервере
Функция ИТК_ИсследованиеЗначенийОсновноеЗначение(Строка = Неопределено) Экспорт
	
	Возврат ИТК_ИсследованиеЗначенийСервер.ИзвлечениеПереданногоЗначения(ПолучитьИзВременногоХранилища(АдресЗначения));
	
КонецФункции

&НаКлиенте
Функция ИТК_ИсследованиеЗначенийОсновноеЗначениеКлиент(Строка = Неопределено) Экспорт
	
	Возврат ПолучитьИзВременногоХранилища(АдресЗначения);
	
КонецФункции

#КонецОбласти

