#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда		
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ПроверитьСовпадениеПриемникаИсточника(Запись, "Приемник", Отказ);
		ПроверитьСовпадениеПриемникаИсточника(Запись, "Источник", Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    
    Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект[0], ДанныеЗаполнения);
    КонецЕсли; 
    
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
	
// Процедура проверяет совпадение приемника и источника.
// 
// Параметры:
//  Запись       - РегистрСведений.бит_НазначениеПравилТрансляции.Запись.
//  ИмяРеквизита - Строка.
//  Отказ        - Булево.
// 
Процедура ПроверитьСовпадениеПриемникаИсточника(Запись, ИмяРеквизита, Отказ)
	
	Если Запись.ПравилоЗаполнения[ИмяРеквизита] <> Запись[ИмяРеквизита] Тогда
		
		ТекстСообщения = НСтр("ru='Не совпадает %1 правила заполнения и %2 в регистре.';
							  |en='It does not match the rules %1 and %2 filling in the register.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяРеквизита, ИмяРеквизита);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		
	КонецЕсли; 
	
КонецПроцедуры // ПроверитьСовпадениеПриемникаИсточника()
	
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли