 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
#Область ДляВызоваИзДругихПодсистем
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт  
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	КомандаОтчет = Отчеты.бит_КонтрольВнеплановойОтгрузки.ДобавитьКомандуОтчета(КомандыОтчетов, Параметры);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.ВидимостьВФормах = "ФормаДокумента,ФормаСписка";; 
		КомандаОтчет.Порядок = 1;
	КонецЕсли;
   // Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры
#КонецОбласти 
#КонецОбласти
#КонецЕсли 