#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    // Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Если  РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПланОтгрузок.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.бит_ПланОтгрузок КАК бит_ПланОтгрузок
		|ГДЕ
		|	бит_ПланОтгрузок.бит_НачалоПериода >= &НачалоПериода
		|	И бит_ПланОтгрузок.бит_КонецПериода <= &КонецПериода
		|	И бит_ПланОтгрузок.ПометкаУдаления = ЛОЖЬ
		|	И бит_ПланОтгрузок.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("КонецПериода", бит_КонецПериода);
		Запрос.УстановитьПараметр("НачалоПериода", бит_НачалоПериода);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Ссылка) Тогда
				Если Выборка.Ссылка <> Ссылка Тогда
					Отказ = Истина;
					ТекстСообщения = "За указанный период уже существует план отгрузок!";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);	
				КонецЕсли;
			Иначе
				Отказ = Истина;
				ТекстСообщения = "Документ за указанный период невозможно создать!";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
 КонецПроцедуры  
 
 Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 
	Движения.бит_ПланыОтгрузок.Записывать = Истина;
	Для Каждого ТекСтрокабит_Товары Из бит_Товары Цикл
		Движение = Движения.бит_ПланыОтгрузок.Добавить();
		Движение.Период = Дата;
		Движение.бит_Номенклатура = ТекСтрокабит_Товары.бит_Номенклатура;
		Движение.бит_Клиент = ТекСтрокабит_Товары.бит_Клиент;
		Движение.бит_ДатаОтгрузки = ТекСтрокабит_Товары.бит_ДатаОтгрузки;
		Движение.бит_СрокИзготовления = ТекСтрокабит_Товары.бит_СрокИзготовления; // исправление после сквозного
		Движение.бит_НомерЗаказаКлиента = ТекСтрокабит_Товары.бит_НомерЗаказаКлиента;
		Движение.бит_НомерЗаказаНаПроизводство = ТекСтрокабит_Товары.бит_НомерЗаказаНаПроизводство;
		Если ЗначениеЗаполнено(ТекСтрокабит_Товары.бит_МассаНетто) Тогда
			Движение.бит_МассаНетто = ТекСтрокабит_Товары.бит_МассаНетто;
		Иначе Движение.бит_МассаНетто = 0;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ТекСтрокабит_Товары.бит_ФактическиОтгружено) Тогда
			Движение.бит_ФактОтгрузки = ТекСтрокабит_Товары.бит_ФактическиОтгружено;
		Иначе Движение.бит_ФактОтгрузки = 0;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрокабит_Товары.бит_Перегрузка) Тогда
			Движение.бит_Перегруз = ТекСтрокабит_Товары.бит_Перегрузка;
		Иначе Движение.бит_Перегруз = 0;
		КонецЕсли;
        Если ЗначениеЗаполнено(ТекСтрокабит_Товары.бит_Недогрузка) Тогда
			Движение.бит_Недогруз = ТекСтрокабит_Товары.бит_Недогрузка;
		Иначе Движение.бит_Недогруз = 0;
		КонецЕсли;
        Движение.бит_ОсновнойМенеджер = ТекСтрокабит_Товары.бит_ОсновнойМенеджер;
		Движение.бит_Комментарий = ТекСтрокабит_Товары.бит_Комментарий;  
		Движение.бит_КодСтроки = ТекСтрокабит_Товары.бит_КодСтроки;
	КонецЦикла;

КонецПроцедуры  
#КонецОбласти



