#Область ПрограммныйИнтерфейс

// Функция осуществляет загрузку документов из облака Эвотор
//
// Параметры:
//   Параметры - Структура
//   РезультатЗагрузки - Структура
//
Процедура НачатьЗагрузкуДокументов(Параметры, РезультатЗагрузки) Экспорт
	
	Если НЕ Параметры.ПериодИзмененВручную Тогда
		ОфлайнОборудование1СЭвоторСервер.ПолучитьДатуПоследнейЗагрузки(Параметры);
	КонецЕсли;
	
	МодульОФД = ОбщегоНазначенияБПО.ОбщийМодуль("ОФД");
	РезультатЗагрузки = МодульОФД.ПродажиЗаПериод(Параметры.Идентификатор, Параметры.ДатаНачала, Параметры.ДатаОкончания);
	
КонецПроцедуры

// Функция осуществляет загрузку документов из облака Эвотор
//
// Параметры:
//   Параметры - Структура
//   РезультатЗагрузки - Структура
//
Процедура НачатьЗагрузкуОборотовКассовойСмены(Параметры, РезультатЗагрузки) Экспорт
	
	МодульОФД = ОбщегоНазначенияБПО.ОбщийМодуль("ОФД");
	РезультатЗагрузки = МодульОФД.ОборотыКассовойСмены(Параметры.Идентификатор, Параметры.НомерСмены);
	
КонецПроцедуры

// Функция осуществляет загрузку документов из облака Эвотор
//
// Параметры:
//   Параметры - Структура
//   РезультатЗагрузки - Структура
//
Процедура НачатьЗагрузкуЧековКассовойСмены(Параметры, РезультатЗагрузки) Экспорт
	
	МодульОФД = ОбщегоНазначенияБПО.ОбщийМодуль("ОФД");
	РезультатЗагрузки = МодульОФД.ЧекиКассовойСмены(Параметры.Идентификатор, Параметры.НомерСмены);
	
КонецПроцедуры

#КонецОбласти