
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ссылка"	    , ПараметрКоманды);
	ПараметрыФормы.Вставить("Отбор"		    , Новый Структура("Объект", ПараметрКоманды));
	ПараметрыФормы.Вставить("ТолькоПросмотр", ПараметрыВыполненияКоманды.Источник.Модифицированность);

	ОткрытьФорму("Обработка.бит_РедактированиеДополнительныхАналитик.Форма", ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, ПараметрКоманды, 
		ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти

