
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Режим) Тогда
		ТекстСообщения = НСтр("ru='Непосредственное открытие этой формы не предусмотрено.';
							  |en='The immediate opening of this form is not provided.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Режим 					  = Параметры.Режим;
	ВыборВыражения 			  = Параметры.ВыборВыражения;
	ОбъектСистемы 			  = Параметры.ОбъектСистемы;
	ОбъектСистемыПриемник 	  = Параметры.Приемник;
	ОбъектыСистемы            = Параметры.ОбъектыСистемы;
	КонтекстВыполненияУсловия = Параметры.КонтекстВыполненияУсловия;
	УчитыватьКорреспонденцию  = Параметры.УчитыватьКорреспонденцию;
	Счет 					  = Параметры.Счет;
	СчетКор 				  = Параметры.СчетКор;
	ТекУсловие 				  = Параметры.Условие;
	ВидСравнения 			  = Параметры.ВидСравнения;
	ОбъединениеСПоследующим	  = Параметры.ОбъединениеСПоследующим;
	ЗначениеФильтра 		  = Параметры.ЗначениеФильтра;
	ТипЗначения 			  = Параметры.ТипЗначения;
	Алгоритм 				  = Параметры.Алгоритм;
			
	// Установка текущей строки
	ПодготовитьФормуНаСервере(ТекУсловие);
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПроверкаЗаполненияПриИзменении(Элемент)
	
	ДеревоУсловияПриАктивизацииСтроки(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияПриИзменении(Элемент)
	
	ВыборГрупп = Ложь;
	Если (ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВГруппе")
	 		ИЛИ ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.НЕВГруппе")
			ИЛИ ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВГруппеИзСписка")
			ИЛИ ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.НеВГруппеИзСписка"))
		И (ЭтоПравилаТрансляцииВыборВыражения ИЛИ НЕ ЭтоОписаниеПользователя(Элементы.ЗначениеФильтра.ОграничениеТипа)) Тогда
		ВыборГрупп = Истина;
	КонецЕсли;
	
	Если ЭтоОписаниеПользователя(Элементы.ЗначениеФильтра.ОграничениеТипа) Тогда
		Если ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВГруппе")
		 	ИЛИ ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.НЕВГруппе") Тогда
			НовоеОграничение = Новый ОписаниеТипов("СправочникСсылка.ГруппыПользователей");
		Иначе
			НовоеОграничение = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		КонецЕсли;
		
		Если НовоеОграничение <> Элементы.ЗначениеФильтра.ОграничениеТипа Тогда
			Элементы.ЗначениеФильтра.ОграничениеТипа = НовоеОграничение;
			ЗначениеФильтра = НовоеОграничение.ПривестиЗначение(ЗначениеФильтра);
		КонецЕсли;
	КонецЕсли;
	
	ПривестиЗначениеФильтра(Ложь);
	
	Если ВыборГрупп Тогда
		НовыеПараметрыВыбора = Новый Массив; 
		НовыеПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ЭтоГруппа", Истина));
		НовыеПараметрыВыбора.Добавить(Новый ПараметрВыбора("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Группы));
	Иначе
		НовыеПараметрыВыбора = Новый Массив;
	КонецЕсли;
	
	Элементы.ЗначениеФильтра.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметрыВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоУсловия

&НаКлиенте
Процедура ДеревоУсловияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДействиеОК();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУсловияПередРазворачиванием(Элемент, Строка, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	РазвернутьПодчиненные(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоУсловияПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоУсловия.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ЭтоПравилаТрансляцииВыборВыражения Тогда
		// "раскручиваем" по иерархии дерева путь к данным.
		СтрПуть = ТекущаяСтрока.Имя;
		ТекРодитель = ТекущаяСтрока;
		Пока НЕ ТекРодитель = Неопределено Цикл
			ТекРодитель = ТекРодитель.ПолучитьРодителя();
			Если НЕ ТекРодитель = Неопределено Тогда
				СтрПуть = ТекРодитель.Имя+"."+СтрПуть;
			КонецЕсли; 
		КонецЦикла; 
		
		// Формируем выражение для правил трансляции.
		Если СтрПуть = "ФиксированноеЗначение" Тогда
			
		Иначе	
			СтрВыражение = "";
			МассивСтрок = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(СтрПуть, ".");
			Если МассивСтрок.Количество() > 1 Тогда
				
				Если МассивСтрок[0] = "ДополнительныеАналитики" Тогда
					
					СтрВыражение = "#А";
					Для Сй = 1 По МассивСтрок.Количество() - 1 Цикл
						
						СтрВыражение = СтрВыражение+?(ПустаяСтрока(СтрВыражение), "", ".")+МассивСтрок[Сй];
						
					КонецЦикла; 
					
				ИначеЕсли МассивСтрок[0] = "Регистратор" Тогда
					
					СтрВыражение = "#Р";
					Для Сй = 1 По МассивСтрок.Количество() - 1 Цикл
						
						Если Сй >= 1 Тогда
							
							СтрВыражение = СтрВыражение+?(ПустаяСтрока(СтрВыражение), "", ".")+МассивСтрок[Сй];
							
						КонецЕсли; 
						
					КонецЦикла; 
					
				ИначеЕсли МассивСтрок[0] = "Прочее" Тогда
					
					Если МассивСтрок[1] = "Соответствие" Тогда
						
						СтрВыражение = "#С";						
						СтрВыражение = СтрВыражение+?(ПустаяСтрока(СтрВыражение), "", ".")+МассивСтрок[2];
						
					КонецЕсли; 
					
				ИначеЕсли МассивСтрок[0] = "Субконто" ИЛИ МассивСтрок[0] = "СубконтоКор" Тогда	
					
					СтрВыражение = СтрПуть;
					
				Иначе	
					
					СтрВыражение = СтрПуть;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			Если Найти(СтрВыражение, ".") = 0 Тогда
				
				СтрВыражение = "";
				
			КонецЕсли; 
			
			ЗначениеФильтра = СтрВыражение;
			
		КонецЕсли; 
		
		
	Иначе
		
		ПривестиЗначениеФильтра(Истина);
		
		// Установка отбора по видуАналитики для аналитик типа ДополнительныеЗначенияАналитик.
		Если ТипЗнч(ЗначениеФильтра) = Тип("СправочникСсылка.бит_ДополнительныеЗначенияАналитик") Тогда
			
			Эл = Неопределено;
			Для каждого ТекЭл Из ТекущаяСтрока.ДополнительныеПараметры Цикл
				
				Если ТекЭл.Представление = "Аналитика" Тогда
				
					Эл = ТекЭл;
					Прервать;
				
				КонецЕсли; 
			
			КонецЦикла; 
			
			Если НЕ Эл = Неопределено Тогда
				
				СтрОтбор = Новый Структура("Владелец", Эл.Значение);
				бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элементы.ЗначениеФильтра, СтрОтбор);
				
				ПроверитьЗначениеВыбраннойАналитики(ЗначениеФильтра, Эл.Значение);
				
			КонецЕсли; 
			
		Иначе
			
			Элементы.ЗначениеФильтра.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ДействиеОК();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует строку имен с разделителями точка по подчиненным строкам дерева. 
// Рекурсия.
// 
// Параметры:
// 	СтрокаСтарт        	 - СтрокаДереваЗначений.
//
// Возвращаемое значение:
// 	РезСтрока        	 - Строка.
// 
&НаКлиенте
Функция СобратьИмена(СтрокаСтарт)

	РезСтрока  = "";
	Если СтрокаСтарт <> Неопределено Тогда
		
		РезСтрока = СтрокаСтарт.Имя;
		
		Родитель = СтрокаСтарт.ПолучитьРодителя();
		Если Родитель <> Неопределено Тогда
			
			РезСтрока = СобратьИмена(Родитель)+"."+РезСтрока;
			
		КонецЕсли; 
	КонецЕсли; 

	Возврат РезСтрока;
	
КонецФункции

// Процедура обрабатывает выбор пользователя и закрывает форму. 
// 
&НаКлиенте
Процедура ДействиеОК()

	ТекущиеДанные = Элементы.ДеревоУсловия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	Если ТекущиеДанные.ПропускатьПриВыборе Тогда
		Возврат;	
	КонецЕсли; 
	
	РезСтруктура = Новый Структура("Условие,ВидСравнения,Значение,ОбъединениеСПоследующим,ДополнительныеПараметры");
	
	СтрУсловие = СобратьИмена(ТекущиеДанные);
	Если РежимПроверкиЗаполнения Тогда
		СтрУсловие = "ЗначениеЗаполнено("+СтрУсловие+")";
	КонецЕсли; 
	СтрУсловие = СтрЗаменить(СтрУсловие,"ДополнительныеАналитики.","#А.");
	
	РезСтруктура.Условие = СтрУсловие;
	РезСтруктура.ВидСравнения = ВидСравнения;
	РезСтруктура.Значение     = ЗначениеФильтра;
	РезСтруктура.ОбъединениеСПоследующим = ОбъединениеСПоследующим;
	РезСтруктура.ДополнительныеПараметры = ДополнительныеПараметрыВИерархии(ТекущиеДанные);
	
	Закрыть(РезСтруктура);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораВидаСравнения(ОписаниеТипов)

	ПараметрыВыбора = Новый Массив();
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ОписаниеТипов", ОписаниеТипов));
	
	НовыеПараметры = Новый ФиксированныйМассив(ПараметрыВыбора);
	Элементы.ВидСравнения.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(ТекУсловие)
	
	ЭтоПравилаТрансляции 				  = СтрСравнить(Режим, "ПравилаТрансляции") = 0;
	ЭтоПользовательскоеУсловие 			  = СтрНайти(Режим, "ПользовательскоеУсловие") > 0;
	ЭтоПользовательскоеУсловиеДляПроцесса = СтрСравнить(Режим, "ПользовательскоеУсловие_Процесс") = 0;
	
	// "ЭтоПравилаТрансляцииВыборЗначения" - это расширение "ЭтоПравилаТрансляции".
	Если ЭтоПравилаТрансляции И ВыборВыражения Тогда
		ЭтоПравилаТрансляцииВыборВыражения = Истина;
	КонецЕсли;
	
	Если ЭтоПравилаТрансляцииВыборВыражения Тогда
		ЭтотОбъект.Заголовок =  НСтр("ru='Выбор значения';en='Value Selection'");
	КонецЕсли; 
	
	Если СтрНайти(ТекУсловие, "ЗначениеЗаполнено(") > 0 Тогда
		РежимПроверкиЗаполнения = Истина;
	КонецЕсли; 
	
	СчетДт = ?(УчитыватьКорреспонденцию, Счет, 	  Неопределено);
	СчетКт = ?(УчитыватьКорреспонденцию, СчетКор, Неопределено);

	СформироватьДеревоРеквизитов();	
	
	УстановитьТекущуюСтрокуПриОткрытии(ТекУсловие);
	
	Если НЕ ЗначениеЗаполнено(ВидСравнения) Тогда
		ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.Равно;
	КонецЕсли;
	
	Если ЭтоПравилаТрансляции Тогда
		ДоступныеЗначения = Новый СписокЗначений;
		Для каждого ЗначениеПеречисления Из Метаданные.Перечисления.бит_ВидыСравненияТрансляции.ЗначенияПеречисления Цикл
			ИмяЗначенияПеречисления = ЗначениеПеречисления.Имя;
			Если СтрНайти(ИмяЗначенияПеречисления, "Списк") > 0 Тогда
				Продолжить;
			КонецЕсли;
			Элементы.ВидСравнения.СписокВыбора.ДоступныеЗначения = ДоступныеЗначения;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтрокуПриОткрытии(ТекУсловие)
	
	Если ЭтоПравилаТрансляцииВыборВыражения Тогда
		
		Элементы.ЗначениеФильтра.ОграничениеТипа = ТипЗначения;
		
		Коллекция = ДеревоУсловия.ПолучитьЭлементы();
		РезСтрока = Неопределено;
		
		Если ТипЗнч(ЗначениеФильтра) = Тип("Строка") 
			И ( Найти(ЗначениеФильтра,"#А.") > 0      
			ИЛИ Найти(ЗначениеФильтра,"#Р.") > 0 
			ИЛИ Найти(ЗначениеФильтра,"#С.") > 0
			ИЛИ Найти(ЗначениеФильтра,"Субконто.")>0
			ИЛИ Найти(ЗначениеФильтра,"СубконтоКор.")>0)Тогда
			
			РезМассив = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(ЗначениеФильтра, ".");
			Если РезМассив.Количество() > 0 Тогда
				
				РезМассив[0] = СтрЗаменить(РезМассив[0], "#А", "ДополнительныеАналитики"); // Лат
				РезМассив[0] = СтрЗаменить(РезМассив[0], "#Р", "Регистратор");
				Если РезМассив[0] = "#С" Тогда
					
					РезМассив[0] = "Прочее";
					РезМассив[1] = "Соответствие."+РезМассив[1];
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			РезСтрока = НайтиСтрокуДерева(Коллекция, РезМассив);
			
		Иначе
			
			// Это фиксированное значение
			СтрОтбор  = Новый Структура("Имя", "ФиксированноеЗначение");			
			РезСтрока = бит_РаботаСКоллекциямиКлиентСервер.НайтиЭлементДерева(Коллекция, СтрОтбор);
			
		КонецЕсли; 
		
		Если РезСтрока <> Неопределено Тогда
			Элементы.ДеревоУсловия.ТекущаяСтрока = РезСтрока.ПолучитьИдентификатор();
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекУсловие) Тогда
		
		ТекУсловие = СтрЗаменить(ТекУсловие, "#А", "ДополнительныеАналитики");
		
		Если СтрНайти(ТекУсловие, "ЗначениеЗаполнено(") > 0 Тогда
			ТекУсловие = СтрЗаменить(ТекУсловие, "ЗначениеЗаполнено(", "");
			ТекУсловие = Лев(ТекУсловие, СтрДлина(ТекУсловие) - 1); // Последняя скобка.
		КонецЕсли; 
		
		РезМассив = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(ТекУсловие,".");
		
		Коллекция = ДеревоУсловия.ПолучитьЭлементы();
		РезСтрока = НайтиСтрокуДерева(Коллекция, РезМассив);
		
		Если РезСтрока <> Неопределено Тогда
			Элементы.ДеревоУсловия.ТекущаяСтрока = РезСтрока.ПолучитьИдентификатор();
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

// Выполняет поиск строки дерева по массиву имен. 
// 
// Параметры:
//  Коллекция  - КоллекцияЭлементовДерева.
//  МассивИмен - Массив.
// 
// ВозвращаемоеЗначение:
// РезСтрока - ЭлементДерева.
// 
&НаСервере
Функция НайтиСтрокуДерева(Коллекция, МассивИмен)
	
	РезСтрока = Неопределено;
	
	ТекущаяСтрокаДерева = Коллекция[0];	
	Для каждого Имя Из МассивИмен Цикл
		
		СтрОтбор  = Новый Структура("Имя", Имя);
		РезСтрока = бит_РаботаСКоллекциямиКлиентСервер.НайтиЭлементДерева(Коллекция, СтрОтбор);
		Если РезСтрока = Неопределено Тогда
			
			РазвернутьПодчиненные(ТекущаяСтрокаДерева);
			Коллекция = ТекущаяСтрокаДерева.ПолучитьЭлементы();
			
			РезСтрока = бит_РаботаСКоллекциямиКлиентСервер.НайтиЭлементДерева(Коллекция, СтрОтбор);
			
			Если РезСтрока = Неопределено Тогда
				Продолжить;
			Иначе
				ТекущаяСтрокаДерева = РезСтрока;
			КонецЕсли; 
			
		Иначе
			
			ТекущаяСтрокаДерева = РезСтрока;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат РезСтрока;
	
КонецФункции // НайтиСтрокуДерева()

// Процедура заполняет дерево реквизитов.
// 
&НаСервере
Процедура СформироватьДеревоРеквизитов()
	
	ДеревоУсловия.ПолучитьЭлементы().Очистить();
	Функциональность = РеквизитФормыВЗначение("ДеревоУсловия");
	
	Если ЭтоПользовательскоеУсловиеДляПроцесса Тогда
		СформироватьДеревоДляПроцесса(Функциональность);
	ИначеЕсли ЭтоПользовательскоеУсловие Тогда
		СформироватьДеревоПользовательскиеУсловия(Функциональность);
	ИначеЕсли ЭтоПравилаТрансляции Тогда
		СформироватьДеревоПравилаТрансляции(Функциональность);
		Если ЭтоПравилаТрансляцииВыборВыражения Тогда
			СформироватьДеревоПравилаТрансляцииВыборЗначения(Функциональность);
		КонецЕсли; 
	КонецЕсли; 
	
	ЗначениеВРеквизитФормы(Функциональность, "ДеревоУсловия");
	
КонецПроцедуры

// Процедура формирует дерево в случае контекста Процесс.
// 
&НаСервере
Процедура СформироватьДеревоДляПроцесса(Функциональность)
	
	ОписаниеПроцесса = Новый ОписаниеТипов("БизнесПроцессСсылка.бит_Процесс");
	
	НоваяСтрокаТекущегоОбъекта(Функциональность, ОписаниеПроцесса);
	СформироватьДеревоПроцессаПараметрыАлгоритма(Функциональность);
	СформироватьДеревоПроцессаЗадача(Функциональность);
	СформироватьДеревоПроцессаПрочее(Функциональность);
	
КонецПроцедуры

// Процедура формирует дерево для заполнения условий в справочнике ПользовательскиеУсловия.
// 
&НаСервере
Процедура СформироватьДеревоПользовательскиеУсловия(Функциональность)
	
	ВычисляемыеПараметры = ВычисляемыеПараметрыПользовательскихУсловий();
	
	ДобавитьСтрокуПользовательскиеУсловияТекущийОбъект(Функциональность);
	ДобавитьСтрокуПользовательскиеУсловияРеквизитыПозиций(Функциональность, ВычисляемыеПараметры);
	ДобавитьСтрокуПользовательскиеУсловияСтатус(Функциональность);
	ДобавитьСтрокуПользовательскиеУсловияТекущаяВиза(Функциональность);
	ДобавитьСтрокуПользовательскиеУсловияУстановленныеВизы(Функциональность);
	ДобавитьСтрокуПользовательскиеУсловияОплаты(Функциональность, ВычисляемыеПараметры);
	ДобавитьСтрокуПользовательскиеУсловияПланируемыеЗатраты(Функциональность, ВычисляемыеПараметры);
	ДобавитьСтрокуПользовательскиеУсловияПрочее(Функциональность, ВычисляемыеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПриемника(ДеревоРеквизиты)
	
	Если ОбъектСистемыПриемник.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии Тогда
		МетаданныеРегистра = Метаданные.РегистрыБухгалтерии[ОбъектСистемыПриемник.ИмяОбъекта];
		ТаблицаРеквизитов = бит_МеханизмТрансляции.ПолучитьРеквизитыРегистраБухгалтерии(ОбъектСистемыПриемник.ИмяОбъекта,Ложь,Ложь);
	ИначеЕсли ОбъектСистемыПриемник.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрНакопления Тогда
		МетаданныеРегистра = Метаданные.РегистрыНакопления[ОбъектСистемыПриемник.ИмяОбъекта];
		ТаблицаРеквизитов = бит_МеханизмТрансляции.ПолучитьРеквизитыРегистраНакопления(ОбъектСистемыПриемник.ИмяОбъекта);
	Иначе
		Возврат;
	КонецЕсли; 
	
	ТекстСиноним = НСтр("ru = 'Запись приемника'; en = 'The recipient''s record'");
	СтрокаВерх = ДобавитьСтрокуДерева(ДеревоРеквизиты, "ЗаписьПриемник", ТекстСиноним,,, Истина);
	Для каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
		Если СтрокаТаблицы.Использование И НЕ СтрокаТаблицы.ЭтоСубконто Тогда
			Если СтрокаТаблицы.Балансовый Тогда
				ДобавитьСтрокуДерева(СтрокаВерх, СтрокаТаблицы.ИмяРеквизита, СтрокаТаблицы.Синоним, СтрокаТаблицы.Тип, Истина);
			Иначе	
				ДобавитьСтрокуДерева(СтрокаВерх,СтрокаТаблицы.ИмяРеквизита + "Дт", СтрокаТаблицы.Синоним + " Дт", СтрокаТаблицы.Тип, Истина);
				ДобавитьСтрокуДерева(СтрокаВерх,СтрокаТаблицы.ИмяРеквизита + "Кт", СтрокаТаблицы.Синоним + " Кт", СтрокаТаблицы.Тип, Истина);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	// Виды субконто приемника.
	Если ОбъектСистемыПриемник.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии Тогда
		// Субконто
		СтрокаВерхСубконто = ДобавитьСтрокуДерева(СтрокаВерх, "СубконтоДт", "Субконто Дт",,, Истина);
		ДобавитьСубконто(СтрокаВерхСубконто, МетаданныеРегистра, Неопределено);		
		// Кор субконто
		СтрокаВерхСубконтоКор = ДобавитьСтрокуДерева(СтрокаВерх, "СубконтоКт", "Субконто Кт",,, Истина);
		ДобавитьСубконто(СтрокаВерхСубконтоКор, МетаданныеРегистра, Неопределено);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыИсточника(МетаданныеРегистра, ТаблицаРеквизитов, Функциональность)
	
	// Реквизиты источника
	ТекстСиноним = НСтр("ru = 'Запись источника'; en = 'Source record'");
	СтрокаВерх = ДобавитьСтрокуДерева(Функциональность, "ЗаписьИсточник", ТекстСиноним,,, Истина);
	Если ЭтоПравилаТрансляции Тогда
		Для каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
			Если СтрокаТаблицы.Использование И НЕ СтрокаТаблицы.ЭтоСубконто Тогда				
				СтрДтКт = ?(СтрокаТаблицы.Балансовый ИЛИ УчитыватьКорреспонденцию, "", "[ДтКт]");
				ДобавитьСтрокуДерева(СтрокаВерх, СтрокаТаблицы.ИмяРеквизита + СтрДтКт, 
				СтрокаТаблицы.Синоним + СтрДтКт, СтрокаТаблицы.Тип,Истина);				
				Если НЕ СтрокаТаблицы.Балансовый И НЕ УчитыватьКорреспонденцию Тогда					
					СтрДтКт = "[Кор]";
					ТекстИмя = СтрШаблон("%1%2", СтрокаТаблицы.ИмяРеквизита, СтрДтКт);
					ТекстСиноним = СтрШаблон("%1%2", СтрокаТаблицы.Синоним, СтрДтКт);
					ДобавитьСтрокуДерева(СтрокаВерх, ТекстИмя, ТекстСиноним, СтрокаТаблицы.Тип, Истина)
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	// Виды субконто источника.
	Если ОбъектСистемы.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии Тогда
		Если УчитыватьКорреспонденцию Тогда
			// Субконто
			ТекстСиноним = НСтр("ru = 'Субконто Дт'; en = 'Субконто Дт'");
			СтрокаВерхСубконто = ДобавитьСтрокуДерева(СтрокаВерх, "СубконтоДт", ТекстСиноним,,, Истина);
			ДобавитьСубконто(СтрокаВерхСубконто, МетаданныеРегистра, Счет);			
			// Кор субконто
			ТекстСиноним = НСтр("ru = 'Субконто Кт'; en = 'Субконто Кт'");
			СтрокаВерхСубконтоКор = ДобавитьСтрокуДерева(СтрокаВерх, "СубконтоКт", ТекстСиноним,,, Истина);
			ДобавитьСубконто(СтрокаВерхСубконтоКор,МетаданныеРегистра, СчетКор);
		Иначе	
			// Субконто
			ТекстСиноним = НСтр("ru = 'Субконто'; en = 'Субконто'");
			СтрокаВерхСубконто = ДобавитьСтрокуДерева(СтрокаВерх, "Субконто", ТекстСиноним,,, Истина);
			ДобавитьСубконто(СтрокаВерхСубконто, МетаданныеРегистра, Счет);			
			// Кор субконто
			ТекстСиноним = НСтр("ru = 'Субконто Кор.'; en = 'Субконто Кор.'");
			СтрокаВерхСубконтоКор = ДобавитьСтрокуДерева(СтрокаВерх, "СубконтоКор", ТекстСиноним,,, Истина);
			ДобавитьСубконто(СтрокаВерхСубконтоКор,МетаданныеРегистра, СчетКор);
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

// Процедура формирует дерево для заполнения условий в правилах трансляции.
// 
&НаСервере
Процедура СформироватьДеревоПравилаТрансляции(Функциональность)
	
	Если ОбъектСистемы.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии Тогда
		МетаданныеРегистра = Метаданные.РегистрыБухгалтерии[ОбъектСистемы.ИмяОбъекта];
		ТаблицаРеквизитов = бит_МеханизмТрансляции.ПолучитьРеквизитыРегистраБухгалтерии(ОбъектСистемы.ИмяОбъекта,УчитыватьКорреспонденцию,Ложь);
	ИначеЕсли ОбъектСистемы.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрНакопления Тогда
		МетаданныеРегистра = Метаданные.РегистрыНакопления[ОбъектСистемы.ИмяОбъекта];
		ТаблицаРеквизитов = бит_МеханизмТрансляции.ПолучитьРеквизитыРегистраНакопления(ОбъектСистемы.ИмяОбъекта);
	Иначе	
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьРеквизитыИсточника(МетаданныеРегистра, ТаблицаРеквизитов, Функциональность);
	
	// Реквизиты приемника
	Если ЗначениеЗаполнено(ОбъектСистемыПриемник) Тогда
		ЗаполнитьРеквизитыПриемника(Функциональность);
	КонецЕсли;
	
	// Регистраторы
	ТекОписание = Новый ОписаниеТипов("СправочникСсылка.бит_ОбъектыСистемы");
	СтрокаРегистраторы = ДобавитьСтрокуДерева(Функциональность,"Регистратор","Регистратор",ТекОписание);
	
	Для Каждого МетаДок Из Метаданные.Документы Цикл
		Если МетаДок.Движения.Содержит(МетаданныеРегистра) Тогда
			ТекОписание = Новый ОписаниеТипов("ДокументСсылка."+МетаДок.Имя);
			ДобавитьСтрокуДерева(СтрокаРегистраторы,МетаДок.Имя,МетаДок.Синоним,ТекОписание,Истина)
		КонецЕсли; 
	КонецЦикла;		
	
	// ДополнительныеАналитики
	ТекстСиноним = НСтр("ru = 'Дополнительные аналитики'; en = 'Additional Analytics'");
	СтрокаАналитики = ДобавитьСтрокуДерева(Функциональность, "ДополнительныеАналитики", ТекстСиноним,,, Истина);	
	
	ВыборкаПВХ = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Выбрать();
	
	Пока ВыборкаПВХ.Следующий() Цикл
		ИмяАналитики = бит_МеханизмТрансляции.СформироватьИмяАналитики(ВыборкаПВХ.Ссылка);
		СтрокаДерева = ДобавитьСтрокуДерева(СтрокаАналитики, ИмяАналитики, ВыборкаПВХ.Ссылка, ВыборкаПВХ.ТипЗначения, Истина);
		ДопПараметры = Новый СписокЗначений;
		ДопПараметры.Добавить(ВыборкаПВХ.Ссылка, "Аналитика");
		СтрокаДерева.ДополнительныеПараметры = ДопПараметры;
	КонецЦикла; 	
	
КонецПроцедуры

// Процедура формирует дерево для заполнения условий в правилах трансляции.
// 
&НаСервере
Процедура СформироватьДеревоПравилаТрансляцииВыборЗначения(Функциональность)
	
	// Прочее.
	СтрокаПрочее = ДобавитьСтрокуДерева(Функциональность, "Прочее", "Прочее");
	
	// Фиксированные соответствия.	
	ТипСтатья = Тип("СправочникСсылка.бит_СтатьиОборотов");
	ТипЦФО = Тип(бит_ОбщегоНазначения.ПолучитьИмяТипаЦФО());
	Если ТипЗначения.СодержитТип(ТипЦФО) ИЛИ ТипЗначения.СодержитТип(ТипСтатья) Тогда
		Если ТипЗначения.СодержитТип(ТипСтатья) Тогда
			Если Метаданные.РегистрыСведений.Найти("бит_СтатьиОборотов_СтатьиРегл") <> Неопределено Тогда
				ТекстИмя 	 = "Соответствие.Статьи_СтатьиРегл";
				ТекстСиноним = НСтр("ru='Соответствие:Статьи регл.-->Статьи об.';en='Compliance: Articles Regul. -> Articles on.'");
				ДобавитьСтрокуДерева(СтрокаПрочее, ТекстИмя, ТекстСиноним, Новый ОписаниеТипов("Строка"), Истина);
			КонецЕсли; 			
			Если Метаданные.РегистрыСведений.Найти("бит_СтатьиОборотов_НоменклатурныеГруппы") <> Неопределено Тогда
				ТекстИмя 	 = "Соответствие.Статьи_НоменклатурныеГруппы";
				ТекстСиноним = НСтр("ru='Соответствие:Ном. группы-->Статьи об.';en='Compliance: Nom. Groups -> Articles on.'");
				ДобавитьСтрокуДерева(СтрокаПрочее, ТекстИмя, ТекстСиноним, Новый ОписаниеТипов("Строка"), Истина);
			КонецЕсли;
		КонецЕсли; 		
		Если ПолучитьФункциональнуюОпцию("бит_СинхронизироватьПодразделенияРеглЦФО") И ТипЗначения.СодержитТип(ТипЦФО) Тогда
			ТекстИмя 	 = "Соответствие.СинхронизацияПодразделенийЦФО";
			ТекстСиноним = НСтр("ru='Синхронизация:Подразделения-->ЦФО';en='Synchronization: Divisions -> CFD'");
			ДобавитьСтрокуДерева(СтрокаПрочее, ТекстИмя, ТекстСиноним, Новый ОписаниеТипов("Строка"), Истина);	
		КонецЕсли; 		
		Если Метаданные.РегистрыСведений.Найти("бит_ЦФО_Подразделения") <> Неопределено И ТипЗначения.СодержитТип(ТипЦФО) Тогда
			ТекстИмя 	 = "Соответствие.ЦФО_Подразделения";
			ТекстСиноним = НСтр("ru='Соответствие:Подразделения-->ЦФО';en='Compliance: Units -> CFA'");
			ДобавитьСтрокуДерева(СтрокаПрочее, ТекстИмя, ТекстСиноним, Новый ОписаниеТипов("Строка"), Истина);	
		КонецЕсли; 
	КонецЕсли; 
	
	// Универсальные соответствия.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ВидыСоответствийАналитик.Код,
	|	бит_ВидыСоответствийАналитик.Наименование,
	|	бит_ВидыСоответствийАналитик.ЛеваяАналитика_1,
	|	бит_ВидыСоответствийАналитик.ЛеваяАналитика_2,
	|	бит_ВидыСоответствийАналитик.ЛеваяАналитика_3,
	|	бит_ВидыСоответствийАналитик.ПраваяАналитика_1,
	|	бит_ВидыСоответствийАналитик.ПраваяАналитика_2,
	|	бит_ВидыСоответствийАналитик.ПраваяАналитика_3
	|ИЗ
	|	Справочник.бит_ВидыСоответствийАналитик КАК бит_ВидыСоответствийАналитик
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ВидыСоответствийАналитик.Приоритет
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	КоличествоАналитикСоответствия = Справочники.бит_ВидыСоответствийАналитик.МаксКоличествоАналитик();
	
	Пока Выборка.Следующий() Цикл
		// Проверка на необходимость отображения данного соответствия.
		МассивТиповПроверки = Новый Массив;
		
		Для Сч = 1 По КоличествоАналитикСоответствия Цикл
			Если ЗначениеЗаполнено(Выборка["ПраваяАналитика_" + Сч]) Тогда
				 МассивВрем = Выборка["ПраваяАналитика_" + Сч].ТипЗначения.Типы();
				 Для каждого Эл Из МассивВрем Цикл
				 	МассивТиповПроверки.Добавить(Эл);
				 КонецЦикла; 
			КонецЕсли; 
		КонецЦикла; 
		
		флЕстьТип = Ложь;
		
		Для каждого ТекТип Из МассивТиповПроверки Цикл
			Если ТипЗначения.СодержитТип(ТекТип) Тогда
				флЕстьТип = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		
		// Добавление соответсвия в ветку Прочее.
		Если флЕстьТип Тогда
			ТекстСиноним = НСтр("ru='Соответствие: %1';en='Match: %1'");
			ТекстСиноним = СтрШаблон(ТекстСиноним, Выборка.Наименование);
			ДобавитьСтрокуДерева(СтрокаПрочее, "Соответствие." + Выборка.Код, ТекстСиноним, Новый ОписаниеТипов("Строка"), Истина);	
		КонецЕсли; 
	КонецЦикла; 
	
	// Фиксированное значение.
	ТекстСиноним = НСтр("ru = 'Фиксированное значение'; en = 'Fixed value'");
	СтрокаАналитики = ДобавитьСтрокуДерева(Функциональность, "ФиксированноеЗначение", ТекстСиноним);		
	
КонецПроцедуры

// Процедура добавляет перечень субконто для данного регистра. 
// Производится фильтрация по наличию субконто на счете.
// 
// Параметры: 
// 	СтрокаВерх         	 -	СтрокаДереваЗначений.
// 	МетаданныеРегистра 	 -	ОбъектМетаданных.
// 	СчетКонтроля       	 -	ПланСчетовСсылка.
// 
&НаСервере
Процедура ДобавитьСубконто(СтрокаВерх, МетаданныеРегистра, СчетКонтроля)

	ИмяПВХ = МетаданныеРегистра.ПланСчетов.ВидыСубконто.Имя;
	Если ЗначениеЗаполнено(СчетКонтроля) Тогда
		СвойстваСчета = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетКонтроля);
		Для Индекс = 1 По СвойстваСчета.КоличествоСубконто Цикл
			СтрокаСубконто = ДобавитьСтрокуДерева(СтрокаВерх, 
				бит_МеханизмТрансляции.ПолучитьИмяСубконто(ИмяПВХ, СвойстваСчета["ВидСубконто" + Индекс]),
				СвойстваСчета["ВидСубконто" + Индекс + "Наименование"], 
				СвойстваСчета["ВидСубконто" + Индекс + "ТипЗначения"], Истина);
		КонецЦикла; 
	Иначе	
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВидыСубконто.Ссылка КАК Ссылка,
		|	ВидыСубконто.Наименование КАК Наименование,
		|	ВидыСубконто.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	#Таблица КАК ВидыСубконто
		|ГДЕ
		|	НЕ ВидыСубконто.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		ЧтоЗаменить   = "#Таблица";
		НаЧтоЗАменить = "ПланВидовХарактеристик." + ИмяПВХ;
		ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗАменить);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Результат 	 = Запрос.Выполнить();
		Выборка 	 = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтрокаСубконто = ДобавитьСтрокуДерева(СтрокаВерх, 
				бит_МеханизмТрансляции.ПолучитьИмяСубконто(ИмяПВХ, Выборка.Ссылка),
				Выборка.Наименование, Выборка.ТипЗначения, Истина);
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

// Процедура добавляет в дерево подчиненные реквизиты.
// 
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений.
// 
&НаСервере
Процедура РазвернутьПодчиненные(Знач СтрокаИлиИндекс)

	Если ТипЗнч(СтрокаИлиИндекс) = Тип("Число") Тогда
		ЭлементДерева = ДеревоУсловия.НайтиПоИдентификатору(СтрокаИлиИндекс);
	Иначе	
		ЭлементДерева = СтрокаИлиИндекс;
	КонецЕсли; 
	
	Если ЭлементДерева = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ДобавитьОписаниеРеквизитов(ЭлементДерева, "Справочники"   ,Справочники.ТипВсеСсылки()    ,"СправочникСсылка");
	ДобавитьОписаниеДопРеквизитов(ЭлементДерева);
	
КонецПроцедуры

// Процедура добавляет описание дополнительных реквизитов. 
//
&НаСервере
Процедура ДобавитьОписаниеДопРеквизитов(СтрокаДерева)
	
	Если НЕ ТипЗнч(СтрокаДерева) = Тип("СтрокаДереваЗначений") 
		И НЕ ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоСтрокаРеквизитовПозиции(СтрокаДерева) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		Возврат;
	КонецЕсли; 	
	
	ЭтоЭлементДерева = ?(ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева"), Истина, Ложь);
	Если ЭтоЭлементДерева Тогда
		Коллекция = СтрокаДерева.ПолучитьЭлементы();
	Иначе	
		Коллекция = СтрокаДерева.Строки;
	КонецЕсли; 
	
	// Удалим доп реквизиты и доп. свойства, если они уже есть.
	Индекс = Коллекция.Количество() - 1;
	Пока Индекс >= 0 Цикл
		
		ТекЭлемент = Коллекция[Индекс];
		
		Если СтрНайти(ТекЭлемент.Имя, "ДополнительныйРеквизит_") > 0 
			ИЛИ СтрНайти(ТекЭлемент.Имя, "ДополнительноеСвойство_") > 0 Тогда
			
			Коллекция.Удалить(Индекс);
		КонецЕсли; 
		Индекс = Индекс - 1;
	КонецЦикла; 
	
	Для каждого Тип Из СтрокаДерева.Типы.Типы() Цикл
		
		МетаОбъект = Метаданные.НайтиПоТипу(Тип);
		Если МетаОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ОбщегоНазначения.ЭтоПеречисление(МетаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектМетаданых = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаОбъект);
		Если ЗначениеЗаполнено(ОбъектМетаданых) Тогда
			ИмяНабора = СтрЗаменить(ОбъектМетаданых.ПолноеИмя, ".", "_");
		Иначе
			ИмяНабора = "";
		КонецЕсли; 
		
		НаборСсылка = УправлениеСвойствами.НаборСвойствПоИмени(ИмяНабора);
		Если НаборСсылка = Неопределено Тогда
			Попытка
				НаборСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений[ИмяНабора];
			Исключение
				НаборСсылка = Неопределено;
			КонецПопытки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НаборСсылка) Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("НаборСсылка", НаборСсылка);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТабДопРеквизиты.Свойство КАК Свойство,
			|	ТабДопРеквизиты.Свойство.Наименование КАК Наименование,
			|	ТабДопРеквизиты.Свойство.ТипЗначения КАК ТипЗначения,
			|	""ДополнительныйРеквизит"" КАК ВидПоля,
			|	ТабДопРеквизиты.Свойство.Имя КАК СвойствоИмя
			|ИЗ
			|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ТабДопРеквизиты
			|ГДЕ
			|	ТабДопРеквизиты.Ссылка = &НаборСсылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТабДопСведения.Свойство,
			|	ТабДопСведения.Свойство.Наименование,
			|	ТабДопСведения.Свойство.ТипЗначения,
			|	""ДополнительноеСвойство"",
			|	ТабДопСведения.Свойство.Имя
			|ИЗ
			|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК ТабДопСведения
			|ГДЕ
			|	ТабДопСведения.Ссылка = &НаборСсылка";
			
			Результат = Запрос.Выполнить();
			Выборка   = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Имя = Выборка.ВидПоля+"_"+Выборка.Наименование; 
				ДобавитьСтрокуДерева(СтрокаДерева, Имя, Имя, Выборка.ТипЗначения, Истина);
				
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

// Процедура добавляет в дерево строки с описанием реквизитов объекта.
// 
// Параметры:
// 	СтрокаДерева       	 -	СтрокаДереваЗначений.
// 	ИмяКоллекции       	 -	Строка.
// 	ОписаниеКоллекции  	 -	ОписаниеТипов.
// 	НачалоИмениТипа    	 -	Строка.
// 
&НаСервере
Процедура ДобавитьОписаниеРеквизитов(СтрокаДерева,ИмяКоллекции,ОписаниеКоллекции,НачалоИмениТипа)

	Если НЕ ТипЗнч(СтрокаДерева) = Тип("СтрокаДереваЗначений") 
	   И НЕ ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
		Возврат;
	КонецЕсли; 
	
	флЭтоЭлементДерева = ?(ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева"), Истина, Ложь);
	Если флЭтоЭлементДерева Тогда
		Коллекция = СтрокаДерева.ПолучитьЭлементы();
	Иначе	
		Коллекция = СтрокаДерева.Строки;
	КонецЕсли; 
	
	Если ЕстьСтрокаКоллекции(Коллекция, "Имя", "СлужебнаяДляРазворота") Тогда
		Коллекция.Очистить();
	КонецЕсли; 
	
	Если Коллекция.Количество()>0 Тогда
		Возврат;
	КонецЕсли; 
	
	ТипСтрока = Новый ОписаниеТипов("Строка", ,
					Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));
	ОбщиеРеквизиты = Новый ТаблицаЗначений(); 
	ОбщиеРеквизиты.Колонки.Добавить("Имя",     ТипСтрока);
	ОбщиеРеквизиты.Колонки.Добавить("Синоним", ТипСтрока);
	ОбщиеРеквизиты.Колонки.Добавить("Типы",    Новый ОписаниеТипов("ОписаниеТипов"));
	
	СписокОбщихРеквизитов   = Новый СписокЗначений;
	ЭтоПервыйЭлемент        = Истина;
	
	Для каждого Тип Из СтрокаДерева.Типы.Типы() Цикл
		
		СписокТекущихРеквизитов = Новый СписокЗначений;
		
		Если ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
			
			МетаданныеСтроки = Метаданные.НайтиПоТипу(Тип);
			Для каждого Реквизит Из МетаданныеСтроки.СтандартныеРеквизиты Цикл
				Если Реквизит.Имя = "Ссылка" Тогда
					Продолжить;				
				КонецЕсли;
				ДобавитьОписаниеРеквизита(Реквизит, ОбщиеРеквизиты, СписокТекущихРеквизитов);
			КонецЦикла;
			
			Если ОбщегоНазначения.ЭтоПеречисление(МетаданныеСтроки) Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого Реквизит Из МетаданныеСтроки.Реквизиты Цикл
				ДобавитьОписаниеРеквизита(Реквизит, ОбщиеРеквизиты, СписокТекущихРеквизитов);
			КонецЦикла;
			
			Если ОбщегоНазначения.ЭтоЗадача(МетаданныеСтроки) Тогда
				Реквизит = МетаданныеСтроки.РеквизитыАдресации.Найти("Исполнитель");
				Если Реквизит <> Неопределено Тогда
					ДобавитьОписаниеРеквизита(Реквизит, ОбщиеРеквизиты, СписокТекущихРеквизитов);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоПервыйЭлемент Тогда
			СписокОбщихРеквизитов = СписокТекущихРеквизитов;
		Иначе
			Для Индекс = 1 - СписокОбщихРеквизитов.Количество() По 0 Цикл
			    ЭлементОбъединенногоСписка  = СписокОбщихРеквизитов.Получить(-Индекс);
				РеквизитОбъединенногоСписка = ЭлементОбъединенногоСписка.Значение;
			    Если СписокТекущихРеквизитов.НайтиПоЗначению(РеквизитОбъединенногоСписка) = Неопределено Тогда
			        СписокОбщихРеквизитов.Удалить(ЭлементОбъединенногоСписка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ЭтоПервыйЭлемент = Ложь;
	КонецЦикла; // По массиву типов
	
	ДобавитьСтрокиРеквизитов(СтрокаДерева, ОбщиеРеквизиты, СписокОбщихРеквизитов);
		
	Если НЕ флЭтоЭлементДерева Тогда
		СтрокаДерева.Строки.Сортировать("Синоним");
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ДобавитьОписаниеРеквизита(Реквизит, ОбщиеРеквизиты, СписокТекущихРеквизитов)
	
	ИмяРеквизита = Реквизит.Имя;
	НоваяСтрока  = ОбщиеРеквизиты.Добавить();
	НоваяСтрока.Имя     = ИмяРеквизита;
	НоваяСтрока.Синоним = Реквизит.Представление();
	НоваяСтрока.Типы    = Реквизит.Тип;
	
	СписокТекущихРеквизитов.Добавить(ИмяРеквизита);
	
КонецПроцедуры

// Функция определяет наличие строки в коллекции с заданным значением поля.
// 
// Параметры:
//  Коллекция      - СтрокиДереваЗначений, ДанныеФормыКоллекцияЭлементовДерева. 
//  ИмяПоля        - Строка.
//  ЗначениеПоиска - Значение.
// 
// Возвращаемое значение:
//  флЕсть - Булево.
// 
&НаСервере
Функция ЕстьСтрокаКоллекции(Коллекция, ИмяПоля, ЗначениеПоиска)
	
	флЕсть = Ложь;
	
	Если ТипЗнч(Коллекция) = Тип("ДанныеФормыКоллекцияЭлементовДерева") Тогда
		Для каждого Эл Из Коллекция Цикл
			Если Эл[ИмяПоля] = ЗначениеПоиска Тогда
				флЕсть = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		
	Иначе	
		
		// Коллекция строк обычного дерева
		Если НЕ Коллекция.Найти(ЗначениеПоиска, ИмяПоля) = Неопределено  Тогда
			флЕсть = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат флЕсть;
	
КонецФункции // ЕстьСтрокаКоллекции()

// Функция определяет картинку текущий строки дерева.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаДереваЗначений.
// 
// Возвращаемое значение:
//  ТекКартинка - Картинка.
// 
&НаСервере
Функция ОпределитьКартинкуСтроки(ТекущаяСтрока)

	Родитель = СтрокаРодитель(ТекущаяСтрока);
	
	Если ТекущаяСтрока.Имя = "ЗаписьИсточник"
		ИЛИ ТекущаяСтрока.Имя = "ЗаписьПриемник" 		
		ИЛИ ТекущаяСтрока.Имя = "ТекущийОбъект" 
		ИЛИ ТекущаяСтрока.Имя = "ТекущаяВиза" 
		ИЛИ ТекущаяСтрока.Имя = "УстановленныеВизы"
		ИЛИ ТекущаяСтрока.Имя = "Прочее" 
		ИЛИ ТекущаяСтрока.Имя = "ОплатаЗаявки"
		ИЛИ ТекущаяСтрока.Имя = "РеквизитыПозиции"
		ИЛИ ТекущаяСтрока.Имя = "ПланируемыеЗатраты"
		ИЛИ ТекущаяСтрока.Имя = "ПараметрыПроцесса"
		ИЛИ ТекущаяСтрока.Имя = "ТекущаяЗадача" Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_Реквизиты;
		
	ИначеЕсли ТекущаяСтрока.Имя = "Субконто" ИЛИ ТекущаяСтрока.Имя = "СубконтоКор" Тогда
		
		ТекКартинка = БиблиотекаКартинок.ПланВидовХарактеристик;
		
	ИначеЕсли ТекущаяСтрока.Имя = "Регистратор" Тогда
		
		ТекКартинка = БиблиотекаКартинок.ДокументОбъект;
		
	ИначеЕсли НЕ Родитель = Неопределено И Родитель.Имя = "Регистратор" Тогда			
		
		ТекКартинка = БиблиотекаКартинок.ДокументОбъект;
		
	ИначеЕсли НЕ Родитель = Неопределено И Родитель.Имя = "УстановленныеВизы" Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_казна_ПользовательскиеФункции;
		
	ИначеЕсли ТекущаяСтрока.Имя = "ТабЧастьСодержитЗначение" Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_казна_ПользовательскиеФункции;
		
    ИначеЕсли СтрНайти(ТекущаяСтрока.Имя, "ПозицияСодержитЗначение")>0 Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_казна_ПользовательскиеФункции;
		
	ИначеЕсли ТекущаяСтрока.Имя = "СуммаПозиций" Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_казна_ПользовательскиеФункции;
		
	ИначеЕсли ТекущаяСтрока.Имя = "ДоступнаРольИсполнителя" Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_казна_ПользовательскиеФункции;
		
	ИначеЕсли ТекущаяСтрока.Имя = "НазначеныИсполнители" Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_казна_ПользовательскиеФункции;
		
	ИначеЕсли ТекущаяСтрока.Имя = "СостояниеЗадачи" Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_казна_ПользовательскиеФункции;
		
	ИначеЕсли ТекущаяСтрока.Имя = "ЕстьКорректировкаКонтрольныхЗначений" Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_казна_ПользовательскиеФункции;
		
	ИначеЕсли ТекущаяСтрока.Имя = "ВключенаВРеестр"
		ИЛИ ТекущаяСтрока.Имя = "РеестрОплачен"
		ИЛИ ТекущаяСтрока.Имя = "РеестрЧастичноОплачен" Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_казна_ПользовательскиеФункции;
		
	ИначеЕсли ТекущаяСтрока.Имя = "ДополнительныеАналитики" Тогда
		
		ТекКартинка = БиблиотекаКартинок.РегистрСведенийЗапись;
		
	ИначеЕсли ТекущаяСтрока.Имя = "ФиксированноеЗначение" Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_мхо_ФиксированноеЗначение;
		
	ИначеЕсли ТекущаяСтрока.Имя = "ПодключаемыйАлгоритм" Тогда
		
		ТекКартинка = БиблиотекаКартинок.бит_ПолучениеДанных;
		
	Иначе
		
		ТекКартинка = БиблиотекаКартинок.бит_Реквизит;
		
	КонецЕсли; 

	Возврат ТекКартинка;
	
КонецФункции

// Функция добавляет строку в дерево значений.
// 
// Параметры:
// 	СтрокаРодитель     	 -	СтрокаДереваЗначений.
// 	Имя                	 -	Строка.
// 	Синоним            	 -	Строка.
// 	ОписаниеТипов      	 -	ОписаниеТипов.
// 	ДобавитьПодчиненную	 -	Булево. 
// 
// Возвращаемое значение:
// 	СтрокаДерева      	 -	СтрокаДереваЗначений.
// 
&НаСервере
Функция ДобавитьСтрокуДерева(СтрокаРодитель, Имя, Синоним, ОписаниеТипов = Неопределено, 
			ДобавитьПодчиненную = Ложь, ПропускатьПриВыборе = Ложь)

	флЭтоЭлементДерева = ?(ТипЗнч(СтрокаРодитель) = Тип("ДанныеФормыЭлементДерева"), Истина, Ложь);
	Если флЭтоЭлементДерева Тогда
		Коллекция = СтрокаРодитель.ПолучитьЭлементы();
	Иначе	
		Коллекция = СтрокаРодитель.Строки;
	КонецЕсли; 
	
	СтрокаДерева = Коллекция.Добавить();
	СтрокаДерева.ИД       = Строка(Новый УникальныйИдентификатор());
	СтрокаДерева.Имя      = Имя;
	СтрокаДерева.Синоним  = Синоним;
	ТекОписаниеТипов      = ?(ОписаниеТипов = Неопределено,Новый ОписаниеТипов("Строка"),ОписаниеТипов);
	СтрокаДерева.Типы     = ТекОписаниеТипов;
    СтрокаДерева.Картинка = ОпределитьКартинкуСтроки(СтрокаДерева);
	СтрокаДерева.ПропускатьПриВыборе = ПропускатьПриВыборе;
	
	Если ДобавитьПодчиненную Тогда
		Для каждого Тип Из ТекОписаниеТипов.Типы() Цикл
			Если ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
				Если ОбщегоНазначения.ЭтоПеречисление(Метаданные.НайтиПоТипу(Тип)) Тогда
					Продолжить;
				КонецЕсли; 
				Если флЭтоЭлементДерева Тогда
					НоваяСтрока = СтрокаДерева.ПолучитьЭлементы().Добавить();
				Иначе	
					НоваяСтрока = СтрокаДерева.Строки.Добавить();
				КонецЕсли;  
				
				НоваяСтрока.Имя = "СлужебнаяДляРазворота";
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	Возврат СтрокаДерева;
	
КонецФункции

// Процедура устанавливает видимость/доступность элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()

	ЭтоВыражениеПользовательскогоУсловия = ?(Режим = "ПользовательскоеУсловие_Выражение",Истина,Ложь);
	ДоступностьПолейСравнения = НЕ ЭтоВыражениеПользовательскогоУсловия И НЕ ВыборВыражения; 
	
	Элементы.ВидСравнения.Доступность           = ДоступностьПолейСравнения;
	Элементы.ЗначениеФильтра.Доступность        = ДоступностьПолейСравнения ИЛИ ЭтоПравилаТрансляцииВыборВыражения;
	Элементы.ОбъединениеСПредыдущим.Доступность = ДоступностьПолейСравнения;
	
	Элементы.ПроверкаЗаполнения.Видимость     = НЕ ЭтоПравилаТрансляцииВыборВыражения;	
	Элементы.ВидСравнения.Видимость           = НЕ ЭтоПравилаТрансляцииВыборВыражения;
	Элементы.ОбъединениеСПредыдущим.Видимость = НЕ ЭтоПравилаТрансляцииВыборВыражения;
	
КонецПроцедуры // УстановитьВидимость()

// Процедура проверяет по владельцу корректность выбранной дополнительной аналитики. 
// 
&НаСервереБезКонтекста
Процедура ПроверитьЗначениеВыбраннойАналитики(Знач ЗначениеФильтра, Знач Аналитика)
	
	Если ЗначениеЗаполнено(ЗначениеФильтра) И ЗначениеФильтра.Владелец <> Аналитика Тогда
		
		ЗначениеФильтра = ПредопределенноеЗначение("Справочник.бит_ДополнительныеЗначенияАналитик.ПустаяСсылка");
		
	КонецЕсли; 
	
КонецПроцедуры // ПроверитьЗначениеВыбраннойАналитики()

&НаСервереБезКонтекста
Функция ВсеЭлементыИсточникаВключеныВЭталонный(КонтейнерИсточник, КонтейнерЭталон)
	
	Если КонтейнерИсточник.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоПроверкаСписка = (ТипЗнч(КонтейнерЭталон) = Тип("СписокЗначений"));
	
	Для каждого ЭлементИсточника Из КонтейнерИсточник Цикл
		ПроверяемоеЗначение = ЭлементИсточника.Значение;
		Если ЭтоПроверкаСписка Тогда 
			Если КонтейнерЭталон.НайтиПоЗначению(ПроверяемоеЗначение) = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Если КонтейнерЭталон <> ПроверяемоеЗначение Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоОписаниеПользователя(ОписаниеЗначения)
	
	Возврат ОписаниеЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидСравненияОбсуживаетСписок(ВидСравнения)
	
	Если ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВСписке") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.НеВСписке") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВГруппеИзСписка") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.НеВГруппеИзСписка") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПривестиЗначениеФильтра(АктуализироватьПараметрыВыбораВидаСравнения)
	
	Если ЭтоПравилаТрансляцииВыборВыражения Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ДеревоУсловия.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимПроверкиЗаполнения Тогда
		ТекОписание = Новый ОписаниеТипов("Булево");
	Иначе	
		ТекОписание = ТекущаяСтрока.Типы;
		Если ЭтоОписаниеПользователя(ТекОписание)
			И (ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.ВГруппе")
			ИЛИ ВидСравнения = ПредопределенноеЗначение("Перечисление.бит_ВидыСравненияТрансляции.НЕВГруппе")) Тогда
			ТекОписание = Новый ОписаниеТипов("СправочникСсылка.ГруппыПользователей");
		КонецЕсли;
	КонецЕсли; 
	
	Если ВидСравненияОбсуживаетСписок(ВидСравнения) Тогда
		ОписаниеСписка  = Новый ОписаниеТипов("СписокЗначений");
		ЗначениеФильтра = ОписаниеСписка.ПривестиЗначение(ЗначениеФильтра);
	Иначе
		ЗначениеФильтра = ТекОписание.ПривестиЗначение(ЗначениеФильтра);
		Элементы.ЗначениеФильтра.ОграничениеТипа = ТекОписание;	
	КонецЕсли;
	
	Если АктуализироватьПараметрыВыбораВидаСравнения Тогда
		УстановитьПараметрыВыбораВидаСравнения(ТекОписание);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СтрокаРодитель(ТекущаяСтрока)
	
	Если ТипЗнч(ТекущаяСтрока) = Тип("ДанныеФормыЭлементДерева") Тогда
		Возврат ТекущаяСтрока.ПолучитьРодителя();
	КонецЕсли;
	
	Возврат ТекущаяСтрока.Родитель;
	
КонецФункции

&НаКлиенте
Функция ДополнительныеПараметрыВИерархии(ТекущаяСтрока)
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДополнительныеПараметры) Тогда
		Возврат ТекущаяСтрока.ДополнительныеПараметры;
	КонецЕсли;
	
	Родитель = ТекущаяСтрока.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		Возврат ТекущаяСтрока.ДополнительныеПараметры;
	КонецЕсли;
	Возврат ДополнительныеПараметрыВИерархии(Родитель);
	
КонецФункции

&НаСервере
Функция НоваяСтрокаТекущегоОбъекта(СтрокаРодитель, ОписаниеТипа)
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "ТекущийОбъект";
	ПараметрыСтроки.ОписаниеТипов       = ОписаниеТипа;
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ПараметрыСтроки.ПропускатьПриВыборе = Истина;
	
	Возврат ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецФункции

&НаСервере
Функция НоваяСтрокаПрочее(СтрокаРодитель)
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "Прочее";
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ПараметрыСтроки.ПропускатьПриВыборе = Истина;
	СтрокаПрочее = ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаПрочее;
	ПараметрыСтроки.Имя            = "ТекущийПользователь";
	ПараметрыСтроки.ОписаниеТипов  = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаПрочее;
	ПараметрыСтроки.Имя            = "ПодключаемыйАлгоритм";
	ПараметрыСтроки.Синоним        = НСтр("ru='Подключаемый алгоритм';en='Plug-in algorithm'");
	ПараметрыСтроки.ОписаниеТипов  = Новый ОписаниеТипов("СправочникСсылка.ДополнительныеОтчетыИОбработки");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	Возврат СтрокаПрочее;
	
КонецФункции

&НаСервере
Процедура СформироватьДеревоПроцессаПараметрыАлгоритма(СтрокаРодитель)
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "ПараметрыПроцесса";
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ПараметрыСтроки.ПропускатьПриВыборе = Истина;
	СтрокаПараметровАлгоритма = ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	Для каждого СтрокаТаблицы Из Алгоритм.ПараметрыАлгоритма Цикл
		ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
		ПараметрыСтроки.СтрокаРодитель      = СтрокаПараметровАлгоритма;
		ПараметрыСтроки.Имя                 = СтрокаТаблицы.Имя;
		ПараметрыСтроки.Синоним             = СтрокаТаблицы.Имя;
		ПараметрыСтроки.ОписаниеТипов = бит_ОбщегоНазначенияКлиентСервер.ПолучитьОписаниеИзСтроки(СтрокаТаблицы.СтрТип);
		ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	    ДобавитьСтрокуУсловия(ПараметрыСтроки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоПроцессаЗадача(СтрокаРодитель)
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "ТекущаяЗадача";
	ПараметрыСтроки.ОписаниеТипов       = Новый ОписаниеТипов("ЗадачаСсылка.бит_Задача");
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ПараметрыСтроки.ПропускатьПриВыборе = Истина;
	ПараметрыСтроки.ДополнительныеПараметры.Добавить(Справочники.бит_ТочкиАлгоритмов.ПустаяСсылка(), "Точка");
	
	СтрокаЗадачи = ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоПроцессаПрочее(СтрокаРодитель)
	
	СтрокаПрочее = НоваяСтрокаПрочее(СтрокаРодитель);
	СформироватьДеревоПроцессаПрочееСостояниеЗадачи(СтрокаПрочее);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоПроцессаПрочееСостояниеЗадачи(СтрокаРодитель)
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаРодитель;
	ПараметрыСтроки.Имя = "СостояниеЗадачи";
	ПараметрыСтроки.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.бит_СтатусыОбъектов");
	ПараметрыСтроки.ДополнительныеПараметры.Добавить(Справочники.бит_ТочкиАлгоритмов.ПустаяСсылка(), "Точка");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Функция ВычисляемыеПараметрыПользовательскихУсловий()
	
	ВычисляемыеПараметры = Новый Структура;
	
	ИменаОбъектовСистемы    = ИменаОбъектовСистемы();
	ИмяЗаявкиНаРасходование = СтрШаблон("Документ.%1",
								бит_ОбщегоНазначенияПереопределяемый.ИмяЗаявкиНаРасходованиеСредств());
								
	ВычисляемыеПараметры.Вставить("ИменаОбъектовСистемы",    ИменаОбъектовСистемы);
	ВычисляемыеПараметры.Вставить("ИмяЗаявкиНаРасходование", ИмяЗаявкиНаРасходование);
	ВычисляемыеПараметры.Вставить("ПроверятьОплаты",  ПроверятьОплаты(ИменаОбъектовСистемы, ИмяЗаявкиНаРасходование));
	ВычисляемыеПараметры.Вставить("ПроверятьПозиции", ПроверятьПозиции(ИменаОбъектовСистемы));
	
	Возврат ВычисляемыеПараметры;
	
КонецФункции

&НаСервере
Функция ИменаОбъектовСистемы()
	
	ИменаОбъектовСистемы = Новый СписокЗначений;
	
	Если ОбъектыСистемы.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбъектыСистемы.ИмяОбъектаПолное КАК ИмяОбъектаПолное
		|ИЗ
		|	Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
		|ГДЕ
		|	ОбъектыСистемы.Ссылка В(&ОбъектыСистемы)";
		Запрос.УстановитьПараметр("ОбъектыСистемы", ОбъектыСистемы);
		ТабилцаИменОбъектовСистемы = Запрос.Выполнить().Выгрузить();
		ИменаОбъектовСистемы.ЗагрузитьЗначения(ТабилцаИменОбъектовСистемы.ВыгрузитьКолонку("ИмяОбъектаПолное"));
	Иначе
		ПолноеИмяОбъектаСистемы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСистемы, "ИмяОбъектаПолное");
		ИменаОбъектовСистемы.Добавить(ПолноеИмяОбъектаСистемы);
	КонецЕсли;
	
	Возврат ИменаОбъектовСистемы;
	
КонецФункции

&НаСервере
Функция ПроверятьОплаты(ИменаОбъектовСистемы, ИмяЗаявкиНаРасходование)
	
	СписокОбъектовПроверкиОплаты = Новый СписокЗначений;
	СписокОбъектовПроверкиОплаты.Добавить(ИмяЗаявкиНаРасходование);
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		СписокОбъектовПроверкиОплаты.Добавить("Документ.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств");
		СписокОбъектовПроверкиОплаты.Добавить("Документ.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию");
		СписокОбъектовПроверкиОплаты.Добавить("Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств");
	КонецЕсли;
	Если ВсеЭлементыИсточникаВключеныВЭталонный(ИменаОбъектовСистемы,
												СписокОбъектовПроверкиОплаты) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПроверятьПозиции(ИменаОбъектовСистемы)
	
	Если НЕ бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СписокОбъектовПроверкиПозиции = Новый СписокЗначений;
	СписокОбъектовПроверкиПозиции.Добавить("Документ.бит_кзн_ЗаявкаНаРасходованиеСредств");
	СписокОбъектовПроверкиПозиции.Добавить("Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств");
	СписокОбъектовПроверкиПозиции.Добавить("Документ.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств");
	Возврат ВсеЭлементыИсточникаВключеныВЭталонный(ИменаОбъектовСистемы, СписокОбъектовПроверкиПозиции);
	
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияТекущийОбъект(СтрокаРодитель)
	
	Если ОбъектыСистемы.Количество() > 0 Тогда
		МассивИменТипов = Новый Массив;
		Для каждого ЭлементСписка Из ОбъектыСистемы Цикл
			ТекущийОбъект = ЭлементСписка.Значение;
			ИмяТипа       = бит_УправлениеОбъектамиСистемы.ПолучитьИмяТипаОбъекта(ТекущийОбъект.ИмяОбъекта,
																					ТекущийОбъект.ВидОбъекта);
			МассивИменТипов.Добавить(ИмяТипа);
		КонецЦикла;
		ИменаТиповСтрокой = СтрСоединить(МассивИменТипов, ", ");
		Описание = Новый ОписаниеТипов(ИменаТиповСтрокой);
	Иначе
		ИмяТипа = бит_УправлениеОбъектамиСистемы.ПолучитьИмяТипаОбъекта(ОбъектСистемы.ИмяОбъекта,ОбъектСистемы.ВидОбъекта);
		Описание = Новый ОписаниеТипов(ИмяТипа);
	КонецЕсли;
	СтрокаТекущегоОбъекта = НоваяСтрокаТекущегоОбъекта(СтрокаРодитель, Описание);
	РазвернутьПодчиненные(СтрокаТекущегоОбъекта);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияРеквизитыПозиций(СтрокаРодитель, ВычисляемыеПараметры)
	
	Если НЕ ВычисляемыеПараметры.ПроверятьПозиции Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "РеквизитыПозиции";
	ПараметрыСтроки.ОписаниеТипов       =
		Новый ОписаниеТипов("ДокументСсылка.бит_кзн_ПозицияПоступления,ДокументСсылка.бит_кзн_ПлатежнаяПозиция");
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	СтрокаРеквизитовПозиции = ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	РазвернутьПодчиненные(СтрокаРеквизитовПозиции);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияСтатус(СтрокаРодитель)
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "Статус";
	ПараметрыСтроки.ОписаниеТипов       = Новый ОписаниеТипов("СправочникСсылка.бит_СтатусыОбъектов");
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияТекущаяВиза(СтрокаРодитель)
	
	Если КонтекстВыполненияУсловия <>
		Перечисления.бит_КонтекстыВыполненияПользовательскихУсловий.ТекущийОбъект_ТекущаяВиза Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "ТекущаяВиза";
	ПараметрыСтроки.ОписаниеТипов       = Новый ОписаниеТипов("СправочникСсылка.бит_Визы");
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияУстановленныеВизы(СтрокаРодитель)
	
	Если КонтекстВыполненияУсловия <>
		Перечисления.бит_КонтекстыВыполненияПользовательскихУсловий.ТекущийОбъект_УстановленныеВизы Тогда
		Возврат;
	КонецЕсли;
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "УстановленныеВизы";
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ПараметрыСтроки.ПропускатьПриВыборе = Истина;
	СтрокаУстановленныеВизы = ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаУстановленныеВизы;
	ПараметрыСтроки.Имя            = "ВсеВизыПолучены";
	ПараметрыСтроки.ОписаниеТипов  = ТипБулево;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаУстановленныеВизы;
	ПараметрыСтроки.Имя            = "ПринятоРешение";
	ПараметрыСтроки.ОписаниеТипов  = ТипБулево;
	ПараметрыСтроки.ДополнительныеПараметры.Добавить(Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка(), "Решение");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаУстановленныеВизы;
	ПараметрыСтроки.Имя = "ПринятоРешениеПоВизе";
	ПараметрыСтроки.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.бит_ВидыРешенийСогласования");
	ПараметрыСтроки.ДополнительныеПараметры.Добавить(Справочники.бит_Визы.ПустаяСсылка(), "Виза");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаУстановленныеВизы;
	ПараметрыСтроки.Имя = "ПринятыРешенияПоВышестоящимВизам";
	ПараметрыСтроки.ОписаниеТипов = ТипБулево;
	ПараметрыСтроки.ДополнительныеПараметры.Добавить(Справочники.бит_Визы.ПустаяСсылка(), "Виза");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаУстановленныеВизы;
	ПараметрыСтроки.Имя = "ПринятоРешениеПоВышестоящимВизам";
	ПараметрыСтроки.ОписаниеТипов = ТипБулево;
	ПараметрыСтроки.ДополнительныеПараметры.Добавить(Справочники.бит_Визы.ПустаяСсылка(), "Виза");
	ПараметрыСтроки.ДополнительныеПараметры.Добавить(Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка(), "Решение");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияОплаты(СтрокаРодитель, ВычисляемыеПараметры)
	
	Если НЕ ВычисляемыеПараметры.ПроверятьОплаты Тогда
		Возврат;
	КонецЕсли;
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Если ВсеЭлементыИсточникаВключеныВЭталонный(ВычисляемыеПараметры.ИменаОбъектовСистемы,
			"Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
		ИмяВетки = "ОплатаПоступления";
	Иначе
		ИмяВетки = "ОплатаЗаявки";
	КонецЕсли;
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = ИмяВетки;
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ПараметрыСтроки.ПропускатьПриВыборе = Истина;
	СтрокаУсловияОплат = ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаУсловияОплат;
	ПараметрыСтроки.Имя            = "СуммаПлан";
	ПараметрыСтроки.ОписаниеТипов  = ТипЧисло;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаУсловияОплат;
	ПараметрыСтроки.Имя            = "СуммаОплата";
	ПараметрыСтроки.ОписаниеТипов  = ТипЧисло;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаУсловияОплат;
	ПараметрыСтроки.Имя            = "Разность";
	ПараметрыСтроки.ОписаниеТипов  = ТипЧисло;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияПланируемыеЗатраты(СтрокаРодитель, ВычисляемыеПараметры)
	
	Если НЕ бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ВсеЭлементыИсточникаВключеныВЭталонный(ВычисляемыеПараметры.ИменаОбъектовСистемы,
				"Документ.бит_пз_ЗаявкаНаЗатраты") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаРодитель;
	ПараметрыСтроки.Имя = "ПланируемыеЗатраты";
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ПараметрыСтроки.ПропускатьПриВыборе = Истина;
	СтрокаЗатраты = ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ОписаниеЧисло = Новый ОписаниеТипов("Число");
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаЗатраты;
	ПараметрыСтроки.Имя            = "КоличествоПлан";
	ПараметрыСтроки.ОписаниеТипов  = ОписаниеЧисло;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаЗатраты;
	ПараметрыСтроки.Имя            = "КоличествоФакт";
	ПараметрыСтроки.ОписаниеТипов  = ОписаниеЧисло;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаЗатраты;
	ПараметрыСтроки.Имя            = "КоличествоОстаток";
	ПараметрыСтроки.ОписаниеТипов  = ОписаниеЧисло;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияПрочее(СтрокаРодитель, ВычисляемыеПараметры)
	
	СтрокаПрочее = НоваяСтрокаПрочее(СтрокаРодитель);
	ДобавитьСтрокуПользовательскиеУсловияПрочееСуммаПозиций(СтрокаПрочее, ВычисляемыеПараметры);
	ДобавитьСтрокуПользовательскиеУсловияПрочееТабЧастьСодержитЗначение(СтрокаПрочее);
	ДобавитьСтрокуПользовательскиеУсловияПрочееДоступнаРольИсполнителя(СтрокаПрочее);
	ДобавитьСтрокуПользовательскиеУсловияПрочееНазначеныИсполнители(СтрокаПрочее);
	ДобавитьСтрокуПользовательскиеУсловияПрочееЕстьКорректировкаКонтрольныхЗначений(СтрокаПрочее, ВычисляемыеПараметры);
	ДобавитьСтрокуПользовательскиеУсловияПрочееВключенаВРеестр(СтрокаПрочее, ВычисляемыеПараметры);
	ДобавитьСтрокуПользовательскиеУсловияПрочееОплатаРеестра(СтрокаПрочее, ВычисляемыеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияПрочееСуммаПозиций(СтрокаРодитель, ВычисляемыеПараметры)
	
	Если НЕ ВычисляемыеПараметры.ПроверятьПозиции Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "СуммаПозиций";
	ПараметрыСтроки.ОписаниеТипов       = Новый ОписаниеТипов("Число");
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияПрочееТабЧастьСодержитЗначение(СтрокаРодитель)
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "ТабЧастьСодержитЗначение";
	ПараметрыСтроки.Синоним             = "Табличная часть содержит значение";
	ПараметрыСтроки.ОписаниеТипов       = Новый ОписаниеТипов("Булево");
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ПараметрыСтроки.ДополнительныеПараметры.Добавить("", "ИмяТабЧасти");
	ПараметрыСтроки.ДополнительныеПараметры.Добавить("", "ИмяРеквизита");
	ПараметрыСтроки.ДополнительныеПараметры.Добавить(Неопределено, "Значение");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияПрочееДоступнаРольИсполнителя(СтрокаРодитель)
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "ДоступнаРольИсполнителя";
	ПараметрыСтроки.ОписаниеТипов       = Новый ОписаниеТипов("Булево");
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ПараметрыСтроки.ДополнительныеПараметры.Добавить(Справочники.бит_РолиИсполнителей.ПустаяСсылка(), "Роль");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияПрочееНазначеныИсполнители(СтрокаРодитель)
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель      = СтрокаРодитель;
	ПараметрыСтроки.Имя                 = "НазначеныИсполнители";
	ПараметрыСтроки.Синоним             = НСтр("ru = 'Назначены исполнители';en = 'Performers appointed'");
	ПараметрыСтроки.ОписаниеТипов       = Новый ОписаниеТипов("Булево");
	ПараметрыСтроки.ДобавитьПодчиненную = Истина;
	ПараметрыСтроки.ДополнительныеПараметры.Добавить(Справочники.бит_РолиИсполнителей.ПустаяСсылка(), "Роль");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияПрочееЕстьКорректировкаКонтрольныхЗначений(СтрокаРодитель, ВычисляемыеПараметры)
	
	СписокОбъектовПроверкиКорректировки = Новый СписокЗначений;
	СписокОбъектовПроверкиКорректировки.Добавить(ВычисляемыеПараметры.ИмяЗаявкиНаРасходование);
	Если Метаданные.Документы.Найти("бит_ЗаявкаНаЗатраты") <> Неопределено Тогда
		СписокОбъектовПроверкиКорректировки.Добавить("Документ.бит_ЗаявкаНаЗатраты");
	КонецЕсли;
	Если НЕ ВсеЭлементыИсточникаВключеныВЭталонный(ВычисляемыеПараметры.ИменаОбъектовСистемы, СписокОбъектовПроверкиКорректировки) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаРодитель;
	ПараметрыСтроки.Имя = "ЕстьКорректировкаКонтрольныхЗначений";
	ПараметрыСтроки.ОписаниеТипов = Новый ОписаниеТипов("Булево");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияПрочееВключенаВРеестр(СтрокаРодитель, ВычисляемыеПараметры)
	
	Если НЕ ВычисляемыеПараметры.ПроверятьОплаты Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаРодитель;
	ПараметрыСтроки.Имя            = "ВключенаВРеестр";
	ПараметрыСтроки.Синоним        = НСтр("ru = 'Включена в реестр платежей?';en = 'Include in registries of amounts?'");
	ПараметрыСтроки.ОписаниеТипов = Новый ОписаниеТипов("Булево");
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПользовательскиеУсловияПрочееОплатаРеестра(СтрокаРодитель, ВычисляемыеПараметры)
	
	ДокументРеестрПлатежей = "Документ." + бит_ОбщегоНазначения.ИмяРеестраПлатежей();
	Если НЕ ВсеЭлементыИсточникаВключеныВЭталонный(ВычисляемыеПараметры.ИменаОбъектовСистемы, ДокументРеестрПлатежей) Тогда
		Возврат;
	КонецЕсли;
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаРодитель;
	ПараметрыСтроки.Имя            = "РеестрОплачен";
	ПараметрыСтроки.Синоним        = НСтр("ru = 'Все заявки оплачены?'");
	ПараметрыСтроки.ОписаниеТипов  = ТипБулево;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
	ПараметрыСтроки = НовыеПараметрыДобавленияСтрокиУсловия();
	ПараметрыСтроки.СтрокаРодитель = СтрокаРодитель;
	ПараметрыСтроки.Имя            = "РеестрЧастичноОплачен";
	ПараметрыСтроки.Синоним        = НСтр("ru = 'Частичная оплата по заявкам?'");
	ПараметрыСтроки.ОписаниеТипов  = ТипБулево;
	ДобавитьСтрокуУсловия(ПараметрыСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиРеквизитов(Родитель, КоллекцияРеквизитов, СписокОбщихРеквизитов)
	
	Если КоллекцияРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	КоллекцияРеквизитов.Сортировать("Имя, Синоним");
	
	ТолькоОбщиеРеквизиты = ЭтоПользовательскоеУсловие И (Родитель.Имя = "ТекущийОбъект");
	
	ПараметрыРеквизита   = Неопределено;
	Для каждого ОписаниеРеквизита Из КоллекцияРеквизитов Цикл
		Если ТолькоОбщиеРеквизиты
			И СписокОбщихРеквизитов.НайтиПоЗначению(ОписаниеРеквизита.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыРеквизита = Неопределено Тогда
			ПараметрыРеквизита = НовыеПараметрыРеквизита(ОписаниеРеквизита);
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыРеквизита.Имя = ОписаниеРеквизита.Имя
			И ПараметрыРеквизита.Синоним = ОписаниеРеквизита.Синоним Тогда
			Для каждого Тип Из ОписаниеРеквизита.Типы.Типы() Цикл 
				ПараметрыРеквизита.ТипыРеквизита.Добавить(Тип);
			КонецЦикла;
		Иначе
			ДобавитьСтрокуДерева(Родитель, ПараметрыРеквизита.Имя, ПараметрыРеквизита.Синоним,
									Новый ОписаниеТипов(ПараметрыРеквизита.ТипыРеквизита), Истина);
			ПараметрыРеквизита = НовыеПараметрыРеквизита(ОписаниеРеквизита);
		КонецЕсли;
	КонецЦикла;
	ДобавитьСтрокуДерева(Родитель, ПараметрыРеквизита.Имя, ПараметрыРеквизита.Синоним,
							Новый ОписаниеТипов(ПараметрыРеквизита.ТипыРеквизита), Истина);
	
КонецПроцедуры
						
&НаСервере
Функция НовыеПараметрыРеквизита(ОписаниеРеквизита)
	
	ПараметрыРеквизита = Новый Структура;
	ПараметрыРеквизита.Вставить("Имя",     ОписаниеРеквизита.Имя);
	ПараметрыРеквизита.Вставить("Синоним", ОписаниеРеквизита.Синоним);
	
	ТипыРеквизита = Новый Массив;
	Для каждого Тип Из ОписаниеРеквизита.Типы.Типы() Цикл 
		ТипыРеквизита.Добавить(Тип);
	КонецЦикла;
	ПараметрыРеквизита.Вставить("ТипыРеквизита", ТипыРеквизита);
	Возврат ПараметрыРеквизита;
	
КонецФункции						

&НаСервере
Функция НовыеПараметрыДобавленияСтрокиУсловия()
	
	ПараметрыДобавления = Новый Структура;
	ПараметрыДобавления.Вставить("СтрокаРодитель");
	ПараметрыДобавления.Вставить("Имя");
	ПараметрыДобавления.Вставить("Синоним",                 "");
	ПараметрыДобавления.Вставить("ОписаниеТипов",           Новый ОписаниеТипов("Строка"));
	ПараметрыДобавления.Вставить("ДобавитьПодчиненную",     Ложь);
	ПараметрыДобавления.Вставить("ПропускатьПриВыборе",     Ложь);
	ПараметрыДобавления.Вставить("ДополнительныеПараметры", Новый СписокЗначений);
	
	Возврат ПараметрыДобавления;
	
КонецФункции

// Добавляет строку в дерево условий.
// 
// Параметры:
// 	ПараметрыСтроки - Структура - см. НовыеПараметрыДобавленияСтрокиУсловия().
// 
// Возвращаемое значение:
// 	СтрокаДерева      	 -	СтрокаДереваЗначений.
//
&НаСервере
Функция ДобавитьСтрокуУсловия(ПараметрыСтроки)

	СтрокаРодитель = ПараметрыСтроки.СтрокаРодитель;
	Имя            = ПараметрыСтроки.Имя;
	Синоним        = ПараметрыСтроки.Синоним;
	Если ПустаяСтрока(Синоним) Тогда
		Синоним = бит_ОбщегоНазначенияКлиентСервер.РазбитьНаОтдельныеСлова(Имя);
	КонецЕсли;
	
	флЭтоЭлементДерева = ?(ТипЗнч(СтрокаРодитель) = Тип("ДанныеФормыЭлементДерева"), Истина, Ложь);
	Если флЭтоЭлементДерева Тогда
		Коллекция = СтрокаРодитель.ПолучитьЭлементы();
	Иначе	
		Коллекция = СтрокаРодитель.Строки;
	КонецЕсли; 
	
	СтрокаДерева = Коллекция.Добавить();
	СтрокаДерева.ИД                  = Строка(Новый УникальныйИдентификатор());
	СтрокаДерева.Имя                 = Имя;
	СтрокаДерева.Синоним             = Синоним;
	ТекОписаниеТипов                 = ПараметрыСтроки.ОписаниеТипов;
	СтрокаДерева.Типы                = ТекОписаниеТипов;
    СтрокаДерева.Картинка            = ОпределитьКартинкуСтроки(СтрокаДерева);
	СтрокаДерева.ПропускатьПриВыборе = ПараметрыСтроки.ПропускатьПриВыборе;
	
	Если ПараметрыСтроки.ДобавитьПодчиненную Тогда
		Для каждого Тип Из ТекОписаниеТипов.Типы() Цикл
			Если ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
				Если ОбщегоНазначения.ЭтоПеречисление(Метаданные.НайтиПоТипу(Тип)) Тогда
					Продолжить;
				КонецЕсли; 
				Если флЭтоЭлементДерева Тогда
					НоваяСтрока = СтрокаДерева.ПолучитьЭлементы().Добавить();
				Иначе	
					НоваяСтрока = СтрокаДерева.Строки.Добавить();
				КонецЕсли;  
				
				НоваяСтрока.Имя = "СлужебнаяДляРазворота";
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	СтрокаДерева.ДополнительныеПараметры = ПараметрыСтроки.ДополнительныеПараметры;
	
	Возврат СтрокаДерева;
	
КонецФункции

&НаСервере
Функция ЭтоСтрокаРеквизитовПозиции(СтрокаДерева)
	
	Если бит_ОбщегоНазначения.ЭтоБП() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрокаДерева = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли СтрокаДерева.Имя = "РеквизитыПозиции" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаДерева) = Тип("СтрокаДереваЗначений") Тогда
		СтрокаРодителя = СтрокаДерева.Родитель;
	Иначе
		СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
	КонецЕсли;
	
	Возврат ЭтоСтрокаРеквизитовПозиции(СтрокаРодителя);
	
КонецФункции

#КонецОбласти
