
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущийОбъект") Тогда
		// АПК:68-выкл
		ОбработкаОбъект = ДанныеФормыВЗначение(Параметры.ТекущийОбъект, Тип("ОбработкаОбъект.бит_РабочееМестоКазначея"));
		// АПК:68-вкл
		ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
	КонецЕсли; 
	
	ЗаполнитьСписокРежимовОстатков(); 
	
	Цвет_Информация = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Информация);
	Цвет_Прошлое    = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Прошлое);
	Цвет_Настоящее  = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Настоящее);
	Цвет_Будущее    = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Будущее);
	Цвет_Запрет     = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Запрет);
	Цвет_Выходной   = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет_Выходной);
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
	ИспользоватьПрогнозы = ПолучитьФункциональнуюОпцию("бит_кзн_ИспользоватьПрогнозыПлатежейИПоступлений");
	
	Если НЕ ИспользоватьПрогнозы Тогда
		Элементы.ВыводитьПрогнозыПлатежей.Видимость = Ложь;
		Объект.ВыводитьПрогнозыПлатежей 			= Ложь;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОстатковПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОстатковОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Информация".
// 
&НаКлиенте
Процедура Цвет_ИнформацияПриИзменении(Элемент)
	
	ИзменениеЦвета("Цвет_Информация");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Прошлое".
// 
&НаКлиенте
Процедура Цвет_ПрошлоеПриИзменении(Элемент)
	
	ИзменениеЦвета("Цвет_Прошлое");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Настоящее".
// 
&НаКлиенте
Процедура Цвет_НастоящееПриИзменении(Элемент)
	
	ИзменениеЦвета("Цвет_Настоящее");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Будущее".
// 
&НаКлиенте
Процедура Цвет_БудущееПриИзменении(Элемент)
	
	ИзменениеЦвета("Цвет_Будущее");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Запрет".
// 
&НаКлиенте
Процедура Цвет_ЗапретПриИзменении(Элемент)
	
	ИзменениеЦвета("Цвет_Запрет");
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Выходной".
//
&НаКлиенте
Процедура Цвет_ВыходнойПриИзменении(Элемент)
	
	ИзменениеЦвета("Цвет_Выходной");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "ВысотаПанелиТекущийДокумент".
// 
&НаКлиенте
Процедура ВысотаПанелиТекущийДокументПриИзменении(Элемент)
	
	ИзмененРазмер = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - действие команды "Готово".
// 
&НаКлиенте
Процедура Готово(Команда)
	
	Отказ = НЕ ПериодЗаполненПравильно(ЭтотОбъект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Команда"      ,"ОК");
	СтруктураПараметров.Вставить("ТекущийОбъект",Объект);
	СтруктураПараметров.Вставить("ИзмененЦвет"  ,ИзмененЦвет);
	СтруктураПараметров.Вставить("ИзмененРазмер",ИзмененРазмер);
	
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Объект.НачалоПериода, Объект.КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

// Описание оповещения процедуры "ВыбратьПериод".
//
// Параметры:
//  РезультатВыбора	 - 	 - 
//  ДопПараметры	 - Произвольный - дополнительные параметры.
//
&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Объект, РезультатВыбора, "НачалоПериода,КонецПериода");
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокФормы(Форма)

	Объект = Форма.Объект;

	ЗаголовокОтчета = СтрШаблон(НСтр("ru='Рабочее место казначения %1';en='Workplace kaznacheniya %1'"),
		БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Объект.НачалоПериода, Объект.КонецПериода));
	
	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры

// Процедура заполняет список режимов остатков.
// 
// Параметры:
//  Нет
// 
&НаСервере
Процедура ЗаполнитьСписокРежимовОстатков()

КонецПроцедуры // ЗаполнитьСписокРежимовОстатков()

// Процедура обрабатывает изменение цвета. 
// Выполняется преобразование в HEX и установка полученного значения в реквизит объекта.
// 
// Параметры:
//  ИмяРеквизитаЦвет  - Строка
// 
&НаСервере
Процедура ИзменениеЦвета(ИмяРеквизитаЦвет)

	ЦветШестн = Обработки.бит_ПреобразованияЦветов.ПрообразоватьЦвет(ЭтотОбъект[ИмяРеквизитаЦвет]);
	
	Если НЕ ЗначениеЗаполнено(ЦветШестн) Тогда
	
		ЦветШестн = "#FFFFFF";
	
	КонецЕсли; 

	Объект[ИмяРеквизитаЦвет] = ЦветШестн;
	
	ИзмененЦвет = Истина;
	
КонецПроцедуры // ИзменениеЦвета()

&НаКлиентеНаСервереБезКонтекста 
Функция ПериодЗаполненПравильно(Форма)

	ЗаполненПравильно = Истина;
	
	Объект = Форма.Объект;
	Отказ  = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Начало периода';en='Start of the period'")); 
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
		#КонецЕсли
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Конец периода';en='End of period'")); 
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.КонецПериода",, Отказ);
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.КонецПериода",, Отказ);
		#КонецЕсли
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Если Объект.КонецПериода < Объект.НачалоПериода Тогда
			ТекстСообщения = НСтр("ru='Период указан неверно. Дата начала больше даты окончания.';
								  |en='The period is incorrect. The start date is greater than the end date.'");
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
			#Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли; 
	
	Если Отказ Тогда
		ЗаполненПравильно = Ложь;
	КонецЕсли;  
	
	Возврат ЗаполненПравильно; 

КонецФункции // ПериодЗаполненПравильно()

#КонецОбласти