////////////////////////////////////////////////////////////////////////////////
// Модуль содержит методы работы с универсальными коллекциями значений.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСМассивами

// Функция определяет входит ли в массив переданное значение или нет.
// 
// Параметры:
//  ТекущийМассив  - Массив.
//  ЗначениеПоиска - Произвольный.
// 
// Возвращаемое значение:
//   Булево.
// 
Функция МассивСодержит(ТекущийМассив, ЗначениеПоиска)  Экспорт

	флМассивСодержит = ТекущийМассив.Найти(ЗначениеПоиска) <> Неопределено;
		
	Возврат флМассивСодержит;
	
КонецФункции // МассивСодержит()

// Удаляет повторяющиеся элементы массива.
// 
// Параметры:
//  ИсходныйМассив 		- Массив.
//  УдалитьНеопределено - Булево (По умолчанию = Ложь).
// 
// Возвращаемое значение:
//  Массив.
// 
Функция УдалитьПовторяющиесяЭлементыМассива(ИсходныйМассив, УдалитьНеопределено = Ложь) Экспорт
	
	НовыйМассив = Новый Массив;
	
	Для каждого ЭлементМассива Из ИсходныйМассив Цикл
		
		Если Не МассивСодержит(НовыйМассив, ЭлементМассива) 
			И Не (ЭлементМассива = Неопределено И УдалитьНеопределено) Тогда 		
			
			НовыйМассив.Добавить(ЭлементМассива);  		
			
		КонецЕсли;	
		
	КонецЦикла;   
	
	Возврат НовыйМассив;
	
КонецФункции // УдалитьПовторяющиесяЭлементыМассива()

#КонецОбласти

#Область РаботаСДеревьями

// Функция выполняет поиск элемента дерева в коллекции.
// 
// Параметры:
//  Коллекция - ДанныеФормыКоллекцияЭлементовДерева. 
//  Отбор  - Структура.
// 
// Возвращаемое значение:
//  ТекЭлемент - ДанныеФормыЭлементДерева.
// 
Функция НайтиЭлементДерева(Коллекция, Отбор) Экспорт
	
	РезультатПоиска = Неопределено;
	
	Для каждого ЭлементКоллекции Из Коллекция Цикл
		УдовлетворяетОтбору = Истина;
		Для каждого ЭлементОтбора Из Отбор Цикл
			Если ЭлементКоллекции[ЭлементОтбора.Ключ] <> ЭлементОтбора.Значение Тогда
				УдовлетворяетОтбору = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если УдовлетворяетОтбору Тогда
			РезультатПоиска = ЭлементКоллекции;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат РезультатПоиска;
	
КонецФункции

// Осуществляет поиск строк из коллекции строк данных формы дерева значений, соответствующих заданному условию поиска.
// 
// Параметры:
//  ДанныеФормыКоллекция - ДанныеФормыКоллекцияЭлементовДерева. 
//  Отбор - Структура - Задает условия поиска: ключ структуры определяет имя колонки, по которой будет осуществляться поиск, а значение структуры - искомое значение.
//  ВключаяПодчиненные - Булево - Определяет, будут ли производиться поиск также в подчиненных коллекциях (если таковые имеются).
// 
// Возвращаемое значение:
//  Массив.
//
Функция НайтиСтрокиДанныхФормыДерева(ДанныеФормыКоллекция, Отбор, ВключатьПодчиненные = Ложь) Экспорт
	
	НайденныеСтроки = Новый Массив;
	
	НайтиСтрокиДанныхФормыДереваРекурсивно(НайденныеСтроки, ДанныеФормыКоллекция, Отбор, ВключатьПодчиненные);
	
	Возврат НайденныеСтроки;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НайтиСтрокиДанныхФормыДереваРекурсивно(НайденныеСтроки, ДанныеФормыКоллекция, Отбор, ВключатьПодчиненные)
	
	Для каждого ЭлементКоллекции Из ДанныеФормыКоллекция Цикл
		
		УдовлетворяетОтбору = Истина;
		Для каждого ЭлементОтбора Из Отбор Цикл
			Если ЭлементКоллекции[ЭлементОтбора.Ключ] <> ЭлементОтбора.Значение Тогда
				УдовлетворяетОтбору = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если УдовлетворяетОтбору Тогда
			НайденныеСтроки.Добавить(ЭлементКоллекции);
		КонецЕсли;
		
		Если ВключатьПодчиненные Тогда
			ПодчиненныеСтроки = ЭлементКоллекции.ПолучитьЭлементы();
			НайтиСтрокиДанныхФормыДереваРекурсивно(НайденныеСтроки, ПодчиненныеСтроки, Отбор, ВключатьПодчиненные);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

