#Область ПрограммныйИнтерфейс

Процедура Данные(Параметры, АдресРезультата) Экспорт

	Результат = Новый ТаблицаЗначений;
	
	Колонки = Результат.Колонки;
	Колонки.Добавить("Идентификатор", ИТК_ТипыКлиентСервер.ОписаниеУникальныйИдентификатор());
	Колонки.Добавить("Использование", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Колонки.Добавить("Представление", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	
	Колонки.Добавить("Избранное", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Колонки.Добавить("ИзбранноеКартинка", ИТК_ТипыКлиентСервер.ОписаниеКартинка());

	Колонки.Добавить("Состояние", ИТК_ТипыКлиентСервер.ОписаниеСтрока(50));
	Колонки.Добавить("Расписание", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	
	Колонки.Добавить("ДатаНачала", ИТК_ТипыКлиентСервер.ОписаниеДата());
	Колонки.Добавить("ДатаОкончания", ИТК_ТипыКлиентСервер.ОписаниеДата());
	Колонки.Добавить("Длительность", ИТК_ТипыКлиентСервер.ОписаниеСтрока(20));

	Колонки.Добавить("Предопределенное", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Колонки.Добавить("Параметризуемое", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Колонки.Добавить("Ключ", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Колонки.Добавить("ИмяПользователя", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	
	Колонки.Добавить("РаботаетСВнешнимиРесурсами", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Колонки.Добавить("ФункциональнаяОпция", ИТК_ТипыКлиентСервер.ОписаниеИмяМетаданных());

	НастройкиИнструмента = ИТК_Настройки.Загрузить(ИТК_Перечисления.ИнструментРегламентныеИФоновыеЗадания());
	ИзбранныеРегламентныеЗадания = НастройкиИнструмента["ИзбранныеРегламентныеЗадания"];
	КартинкаИзбранное = БиблиотекаКартинок.ИТК_Избранное;
	
	ВсеРегламентныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	Для Каждого РегламентноеЗадание Из ВсеРегламентныеЗадания Цикл 
		
		ОбъектМетаданных = РегламентноеЗадание.Метаданные;
		
		ДополнительнаяИнформацияБСП = ИТК_БСП.ДополнительнаяИнформацияПоРегламентномуЗаданию(ОбъектМетаданных);
		
		СкрываемоеРегламентноеЗадание = Не ДополнительнаяИнформацияБСП.ДоступноПоФункциональнымОпциям ИЛИ ДополнительнаяИнформацияБСП.ЗаданиеВМоделиСервиса;
		Если СкрываемоеРегламентноеЗадание Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РегламентноеЗадание);
		
		НоваяСтрока.Идентификатор = РегламентноеЗадание.УникальныйИдентификатор;
		НоваяСтрока.Представление = Представление(РегламентноеЗадание);
		
		ПоследнееФоновоеЗадание = ИТК_ФоновыеЗадания.Последнее(РегламентноеЗадание);	
		Если ПоследнееФоновоеЗадание = Неопределено Тогда
			
			Состояние = ИТК_Строки.ТекстНеопределено();
			ДатаНачала = Неопределено;
			ДатаОкончания = Неопределено;
			Длительность = ИТК_Строки.ТекстНеопределено();
			
		Иначе
			
			Состояние = ПоследнееФоновоеЗадание.Состояние;
			ДатаНачала = ПоследнееФоновоеЗадание.Начало;
			ДатаОкончания = ПоследнееФоновоеЗадание.Конец;
			
			Если ДатаОкончания = Неопределено Тогда
				
				Длительность = ИТК_Строки.ТекстНеопределено();
				
			Иначе
				
				ДлительностьСекунд = ДатаОкончания - ДатаНачала;
				Длительность = Формат(ИТК_ОбщийКлиентСервер.ПустаяДата() + ДлительностьСекунд, "ДЛФ=T; ДП=");
				
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока.Состояние = Состояние;
		
		НоваяСтрока.ДатаНачала = ДатаНачала;
		НоваяСтрока.ДатаОкончания = ДатаОкончания;
		НоваяСтрока.Длительность = Длительность;
		
		// БСП
		НоваяСтрока.РаботаетСВнешнимиРесурсами = ДополнительнаяИнформацияБСП.РаботаетСВнешнимиРесурсами;
		НоваяСтрока.ФункциональнаяОпция = ДополнительнаяИнформацияБСП.ФункциональнаяОпция;
		
		// Избранное
		Избранное = (ИзбранныеРегламентныеЗадания.Найти(ОбъектМетаданных.Имя) <> Неопределено);
		НоваяСтрока.Избранное = Избранное;
		Если Избранное Тогда
			ИзбранноеКартинка = КартинкаИзбранное;
		Иначе
			ИзбранноеКартинка = Новый Картинка;
		КонецЕсли;
		НоваяСтрока.ИзбранноеКартинка = ИзбранноеКартинка;
		
	КонецЦикла;
	
	Результат.Сортировать("Представление");
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

// Возвращает РегламентноеЗадание из информационной базы.
// Не предназначена для использования в модели сервиса.
//
// Параметры:
//  РегламентноеЗадание - ОбъектМетаданных - объект метаданных регламентного задания для поиска
//  		                предопределенного регламентного задания.
//      		          - УникальныйИдентификатор - идентификатор регламентного задания.
//          		      - Строка - строка уникального идентификатора регламентного задания.
//              		  - РегламентноеЗадание - регламентное задание из которого нужно получить
//                  		уникальный идентификатор для получения свежей копии регламентного задания.
// 
// Возвращаемое значение:
//  РегламентноеЗадание - прочитано из базы данных.
//
Функция Получить(Знач Задание) Экспорт
	
	Если ТипЗнч(Задание) = Тип("РегламентноеЗадание") Тогда
		
		Идентификатор = Задание.УникальныйИдентификатор;
		
	ИначеЕсли ТипЗнч(Задание) = Тип("Строка") Тогда
		
		Идентификатор = Новый УникальныйИдентификатор(Задание);
		
	Иначе
		
		Идентификатор = Задание;
		
	КонецЕсли;
	
	
	Если ТипЗнч(Задание) = Тип("ОбъектМетаданных") Тогда
		
		Результат = РегламентныеЗадания.НайтиПредопределенное(Идентификатор);
		
	Иначе
		
		Результат = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
		
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		ВызватьИсключение(НСтр("ru = 'Регламентное задание не найдено.
		                              |Возможно, оно удалено другим пользователем.'") );
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Представление(Задание) Экспорт
	
	Если Задание = Неопределено Тогда 
		Возврат ИТК_Строки.ТекстНеопределено();
	КонецЕсли;
	
	Если ТипЗнч(Задание) = Тип("ОбъектМетаданных") Тогда
		
		Результат = Задание.Представление();
		
	Иначе
		
		Результат = Задание.Наименование;
		Если Не ЗначениеЗаполнено(Результат) Тогда
			
			Результат = Представление(Задание.Метаданные);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьВручную(Знач РегламентноеЗадание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = Получить(РегламентноеЗадание);
	ФоновоеЗадание = Задание.ПоследнееЗадание;
	
	ЗапускВыполнен = Ложь;
	УжеВыполняется = Ложь;
	Если ФоновоеЗадание <> Неопределено
	   		И ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		
		УжеВыполняется = Истина;
		
	Иначе
		
		НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = 'Запуск вручную: %1'"), Представление(Задание));
		КлючФоновогоЗадания = Строка(Задание.УникальныйИдентификатор);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить(Задание.Метаданные.ИмяМетода, Задание.Параметры, КлючФоновогоЗадания, НаименованиеФоновогоЗадания);
		ЗапускВыполнен = Истина;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапускВыполнен", ЗапускВыполнен);
	Результат.Вставить("МоментЗапуска", ФоновоеЗадание.Начало);
	Результат.Вставить("УжеВыполняется", УжеВыполняется);
	
	Если ЗначениеЗаполнено(ФоновоеЗадание.Наименование) Тогда
		ПредставлениеФоновогоЗадания = ФоновоеЗадание.Наименование;
	Иначе
		ПредставлениеФоновогоЗадания = Представление(Задание);
	КонецЕсли;
	Результат.Вставить("ПредставлениеФоновогоЗадания", ПредставлениеФоновогоЗадания);
	
	Возврат Результат;
	
КонецФункции

Функция Расписание(Идентификатор) Экспорт
	
	Задание = Получить(Идентификатор);
	Возврат Задание.Расписание;
	
КонецФункции 

Функция Имя(Идентификатор) Экспорт
	
	Задание = Получить(Идентификатор);
	Возврат Задание.Метаданные.Имя;
	
КонецФункции 

Процедура Удалить(Идентификатор) Экспорт
	
	Задание = Получить(Идентификатор);
	Задание.Удалить();
	
КонецПроцедуры

Функция СообщенияИОписанияОшибок(РегламентноеЗадание) Экспорт

	ПоследнееЗадание = ИТК_ФоновыеЗадания.Последнее(РегламентноеЗадание);	
	Возврат ИТК_ФоновыеЗадания.СообщенияИОписанияОшибок(ПоследнееЗадание);
	
КонецФункции

Процедура Записать(Свойства) Экспорт
	
	Идентификатор = ИТК_ОбщийКлиентСервер.Свойство(Свойства, "Идентификатор");
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		РегламентноеЗадание = Получить(Идентификатор);
	Иначе
		РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Свойства.Метаданные);
	КонецЕсли;
	
	Если Свойства.Свойство("Избранное") Тогда
		ОбновитьСвойствоИзбранное(РегламентноеЗадание, Свойства.Избранное);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РегламентноеЗадание, Свойства);
	РегламентноеЗадание.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбора(Список) Экспорт
	
	Список.Очистить();
	
	ВсеРегламентныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	Для Каждого РегламентноеЗадание Из ВсеРегламентныеЗадания Цикл 
		
		Идентификатор = Строка(РегламентноеЗадание.УникальныйИдентификатор);
		Список.Добавить(Идентификатор, Представление(РегламентноеЗадание));
		
	КонецЦикла;
	
	Список.СортироватьПоПредставлению();
	
КонецПроцедуры

Функция Избранное(РегламентноеЗадание) Экспорт
	
	Если ТипЗнч(РегламентноеЗадание) = Тип("РегламентноеЗадание") Тогда
		ИмяРегламентногоЗадания = РегламентноеЗадание.Метаданные.Имя;
	Иначе
		ИмяРегламентногоЗадания = РегламентноеЗадание;
	КонецЕсли;

	Настройки = ИТК_Настройки.Загрузить(ИТК_Перечисления.ИнструментРегламентныеИФоновыеЗадания());
	ИзбранныеРегламентныеЗадания = Настройки["ИзбранныеРегламентныеЗадания"];
	
	Результат = (ИзбранныеРегламентныеЗадания.Найти(ИмяРегламентногоЗадания) <> Неопределено);
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСвойствоИзбранное(РегламентноеЗадание, Избранное)
	
	ВидИнструмента = ИТК_Перечисления.ИнструментРегламентныеИФоновыеЗадания();
	
	Настройки = ИТК_Настройки.Загрузить(ВидИнструмента);
	ИзбранныеРегламентныеЗадания = Настройки["ИзбранныеРегламентныеЗадания"];
	ИмяРегламентногоЗадания = РегламентноеЗадание.Метаданные.Имя;
	
	НайденныйЭлемент = ИзбранныеРегламентныеЗадания.Найти(ИмяРегламентногоЗадания);
	
	Если Избранное Тогда
		
		Если НайденныйЭлемент = Неопределено Тогда
			ИзбранныеРегламентныеЗадания.Добавить(ИмяРегламентногоЗадания);
		КонецЕсли;
		
	Иначе
		
		Если НайденныйЭлемент <> Неопределено Тогда
			ИзбранныеРегламентныеЗадания.Удалить(НайденныйЭлемент);
		КонецЕсли;
		
	КонецЕсли;
	
	ИТК_Настройки.Сохранить(Настройки, ВидИнструмента);
	
КонецПроцедуры

#КонецОбласти