
#Область ОбработчикиСобытийФормы	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЗначениеСт  = Параметры.ЗначениеСт;
    СписокТипов = Параметры.СписокТипов;
    
    СтрОтборПоВладельцу = Параметры.СтрОтборПоВладельцу;
    Если СтрОтборПоВладельцу <> Неопределено Тогда
        бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элементы.ЗначениеСт, СтрОтборПоВладельцу);
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗначениеСтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект, 
		Элементы.ЗначениеСт, ЭтотОбъект, "ЗначениеСт", СписокТипов, СтандартнаяОбработка);
                                                       
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы	

&НаКлиенте
Процедура ОК(Команда)
    
    Закрыть(ЗначениеСт);
    
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
   
    Закрыть();
    
КонецПроцедуры

#КонецОбласти

