&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [27.08.2024] +
	
	ПараметрыФормы = Новый Структура("НачалоПериода, КонецПериода", НачалоПериода, КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("бит_ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыФормы, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
	// }}ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [27.08.2024] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	// {{ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [27.08.2024] +
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачалоПериода    = РезультатВыбора.НачалоПериода;
	КонецПериода = РезультатВыбора.КонецПериода;
	
	УстановитьПараметрыДинамическогоСписка();
	
	Элементы.Список.Обновить();
	
	// }}ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [27.08.2024] -
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическогоСписка()
	
	// {{ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [27.08.2024] +
	
	Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода", НачалоПериода);
	Список.Параметры.УстановитьЗначениеПараметра("КонецПериода", КонецПериода);
	
	// }}ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [27.08.2024] -
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [27.08.2024] +        
	
	УстановитьПараметрыДинамическогоСписка();

	Элементы.Список.Обновить();
	
	// }}ПервыйБИТ ЛистТребований [ЛТ17] [ASHolyavko@1cbit.ru] [27.08.2024] - 
	
КонецПроцедуры


