
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
  	// Стандартные действия при создании на сервере.
 	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры // СписокПередНачаломДобавления()

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура Провести(Команда)
	
	ЗаписатьНаКлиенте(РежимЗаписиДокумента.Проведение)
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведение(Команда)
	
	ЗаписатьНаКлиенте(РежимЗаписиДокумента.ОтменаПроведения)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиенте(ПарамерыЗаписи)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Попытка
		ЗаписатьНаСервере(ПарамерыЗаписи);
	Исключение
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()); 
	КонецПопытки;
	
	ОповеститьОбИзменении(Элементы.Список.ТекущаяСтрока);
	ПараметрыПередачи = Новый Структура("Объект", Элементы.Список.ТекущаяСтрока); 
	Оповестить("ЗаписанаВерсияОтчета", ПараметрыПередачи);

КонецПроцедуры
 
&НаСервере
Процедура ЗаписатьНаСервере(Знач ПарамерыЗаписи)

	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	ТекущийОбъект = ТекущаяСтрока.ПолучитьОбъект();
	
	Попытка
		ТекущийОбъект.Заблокировать();
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось заблокировать документ: %1. Объект уже заблокирован.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущаяСтрока);
		ВызватьИсключение ТекстСообщения; 
	КонецПопытки; 
	
	Попытка
		ТекущийОбъект.Записать(ПарамерыЗаписи);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось записать документ: %1. По причине: 
								|%2.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущаяСтрока, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения; 
	КонецПопытки;
	
КонецПроцедуры
 
#КонецОбласти