
&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("РежимЗаписи", РежимЗаписи);
	СтруктураПараметров.Вставить("РежимСообщений", РежимСообщений);
	СтруктураПараметров.Вставить("ОтображатьПараметрыГрафикаНачислений", ОтображатьПараметрыГрафикаНачислений);
	СтруктураПараметров.Вставить("ОтображатьПараметрыГрафикаПлатежей", ОтображатьПараметрыГрафикаПлатежей);
	
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("РежимЗаписи", РежимЗаписи);
	Параметры.Свойство("РежимСообщений", РежимСообщений);
	Параметры.Свойство("ОтображатьПараметрыГрафикаНачислений", ОтображатьПараметрыГрафикаНачислений);
	Параметры.Свойство("ОтображатьПараметрыГрафикаПлатежей", ОтображатьПараметрыГрафикаПлатежей);
	
КонецПроцедуры
