#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ДобавитьКомандыОтчетов")
Процедура бит_ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ1.3.4.2] [ASHolyavko@1cbit.ru] [22.04.2025] +        
	
	Отчеты.бит_СпецификацияИтоговойПрименяемости.ДобавитьКомандыОтчетов(КомандыОтчетов); 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ1.3.4.2] [ASHolyavko@1cbit.ru] [22.04.2025] -
	
	// {{ПервыйБИТ ЛистТребовани [ЛТ 07] [AVZhelansky@1cbit.ru] [21.05.2025 17:54:12] +
	
	Отчеты.бит_РасчетСпецификацииИтоговойПрименяемости.ДобавитьКомандыОтчетов(КомандыОтчетов);
	
	// }}ПервыйБИТ ЛистТребовани [ЛТ 07] [AVZhelansky@1cbit.ru] [21.05.2025 17:54:14] -
	
КонецПроцедуры
	
&ИзменениеИКонтроль("ДанныеСпецификации")
Функция бит_ДанныеСпецификации(СписокСтруктураДанных, ПараметрыВыборки)

	ПереченьДанных = Неопределено;
	Если НЕ ПараметрыВыборки.Свойство("ПереченьДанных", ПереченьДанных) ИЛИ НЕ ЗначениеЗаполнено(ПереченьДанных) Тогда
		ПереченьДанных = ПереченьДанныхСпецификации();
	КонецЕсли;

	ИсточникиПараметризацииРесурсов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
	СтрРазделить("ВыходныеИзделия,МатериалыИУслуги",","), ПереченьДанных);
	Если ИсточникиПараметризацииРесурсов.ВГраница() <> -1 Тогда
		ПереченьДанных = ОбщегоНазначения.СкопироватьРекурсивно(ПереченьДанных, Ложь);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПереченьДанных, ИсточникиПараметризацииРесурсов);
	КонецЕсли;

	МенеджерВременныхТаблиц = Неопределено;
	Если НЕ ПараметрыВыборки.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц)
		ИЛИ МенеджерВременныхТаблиц = Неопределено
		Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустойКлючСвязи",  Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));

	СписокТаблицДляУдаления = Новый Массив;

	РазделительЗапросовВПакете = ОбщегоНазначения.РазделительПакетаЗапросов();

	ТекстыЗапроса = Новый СписокЗначений;

	#Область ВтДанныеПоНоменклатуре

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Т.Идентификатор             КАК Идентификатор,
	|	Т.Спецификация              КАК Спецификация,
	|	Т.Номенклатура              КАК Номенклатура,
	|	Т.Характеристика            КАК Характеристика,
	|	Т.Количество                КАК Количество,
	|	Т.ПодразделениеДиспетчер    КАК ПодразделениеДиспетчер,
	|	Т.ПодразделениеИсполнитель  КАК ПодразделениеИсполнитель,
	|	Т.НаправлениеДеятельности   КАК НаправлениеДеятельности,
	|	Т.Распоряжение              КАК Распоряжение,
	|	Т.Назначение                КАК Назначение,
	|	Т.НачалоПроизводства        КАК НачалоПроизводства
	|
	|ПОМЕСТИТЬ ВтДанныеПоНоменклатуре
	|ИЗ
	|	&НаборДанныхПоНоменклатуре КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Спецификация, Идентификатор
	|
	|";

	Если ТипЗнч(СписокСтруктураДанных) = Тип("ТаблицаЗначений") Тогда
		НаборДанныхПоНоменклатуре = СписокСтруктураДанных;
	Иначе
		НаборДанныхПоНоменклатуре = СписокНоменклатуры();
		ЗаполнитьЗначенияСвойств(НаборДанныхПоНоменклатуре.Добавить(), СписокСтруктураДанных);
	КонецЕсли;

	Если НаборДанныхПоНоменклатуре.Количество() = 1 Тогда
		ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Справочник.РесурсныеСпецификации.МодульМенеджера.ДанныеСпецификации_1");
		ВесЗамера = 1;
	Иначе
		ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Справочник.РесурсныеСпецификации.МодульМенеджера.ДанныеСпецификации");
		ВесЗамера = НаборДанныхПоНоменклатуре.Количество() / 10;
	КонецЕсли;

	Запрос.УстановитьПараметр("НаборДанныхПоНоменклатуре", НаборДанныхПоНоменклатуре);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Идентификатор",            0);
	ДополнительныеПараметры.Вставить("ПодразделениеДиспетчер",   Справочники.СтруктураПредприятия.ПустаяСсылка());
	ДополнительныеПараметры.Вставить("ПодразделениеИсполнитель", Справочники.СтруктураПредприятия.ПустаяСсылка());
	ДополнительныеПараметры.Вставить("НаправлениеДеятельности",  Справочники.НаправленияДеятельности.ПустаяСсылка());
	ДополнительныеПараметры.Вставить("Распоряжение",             Справочники.РесурсныеСпецификации.ПустаяСсылка());
	ДополнительныеПараметры.Вставить("Назначение",               Справочники.Назначения.ПустаяСсылка());
	ДополнительныеПараметры.Вставить("НачалоПроизводства",       Дата(1,1,1));

	Для каждого КлючИЗначение Из ДополнительныеПараметры Цикл
		ИмяПараметра = КлючИЗначение.Ключ;
		Если НаборДанныхПоНоменклатуре.Колонки.Найти(ИмяПараметра) = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Т."+ИмяПараметра, "&"+ИмяПараметра);
			Запрос.УстановитьПараметр(ИмяПараметра, КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;

	ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете);

	СписокТаблицДляУдаления.Добавить("ВтДанныеПоНоменклатуре");

	#КонецОбласти

	#Область ВтИзделия

	ТекстЗапроса = "
	|ВЫБРАТЬ
	// 0 - Выходное, 1 - Входное, 2 - Побочное
	|	0                                                   КАК ВидИзделия,
	|	ВтДанныеПоНоменклатуре.Идентификатор                КАК Идентификатор,
	|	ВтДанныеПоНоменклатуре.Спецификация                 КАК Спецификация,
	|	ВтДанныеПоНоменклатуре.ПодразделениеДиспетчер       КАК ПодразделениеДиспетчер,
	|	ВтДанныеПоНоменклатуре.ПодразделениеИсполнитель     КАК ПодразделениеИсполнитель,
	|	ВтДанныеПоНоменклатуре.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|	ВтДанныеПоНоменклатуре.Распоряжение                 КАК Распоряжение,
	|	ВтДанныеПоНоменклатуре.Назначение                   КАК Назначение,
	|	ВтДанныеПоНоменклатуре.НачалоПроизводства           КАК НачалоПроизводства,
	|
	|	ВыходныеИзделия.НомерСтроки                         КАК НомерСтроки,
	|
	|	ВыходныеИзделия.ВидНоменклатуры                     КАК ВидНоменклатуры,
	|	&ВыходныеИзделияИсточникНоменклатуры                КАК Номенклатура,
	|	&ВыходныеИзделияИсточникХарактеристики              КАК Характеристика,
	|	
	|	&ВыходныеИзделияИсточникХарактеристикиЦО            КАК ХарактеристикаЦО,
	|	&ВыходныеИзделияИсточникСерииЦО                     КАК СерияЦО,
	|	&ВыходныеИзделияИсточникУпаковкиЦО                  КАК УпаковкаЦО,
	|	
	|	ВыходныеИзделия.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ЛюбаяХарактеристика,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.Обеспечивать)                   КАК СпособПолученияМатериала,
	|	ЛОЖЬ                                                                                          КАК Обособленно,
	|
	|	ВыходныеИзделия.Этап                                КАК Этап,
	|	ВыходныеИзделия.Операция                            КАК Операция,
	|
	|	ВЫРАЗИТЬ(ВыходныеИзделия.КоличествоУпаковок * ЕСТЬNULL(&ВыходныеИзделияКоэффициентУпаковки, 1) КАК ЧИСЛО(15,3)) КАК Количество,
	|	ВыходныеИзделия.КоличествоУпаковок                                                                              КАК КоличествоУпаковок,
	|
	|	ВыходныеИзделия.Упаковка                            КАК Упаковка,
	|	ЕСТЬNULL(&ВыходныеИзделияКоэффициентУпаковки, 1)    КАК КоэффициентУпаковки,
	|
	|	ВыходныеИзделия.ПроцентБрака                        КАК ПроцентБрака,
	|
	|	ВыходныеИзделия.ДоляСтоимости                       КАК ДоляСтоимости,
	|	НЕОПРЕДЕЛЕНО                                        КАК СтатьяКалькуляции,
	|	ВыходныеИзделия.Ссылка.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|	ВыходныеИзделия.ОбработатьПоСпецификации            КАК ОбработатьПоСпецификации,
	|	ВыходныеИзделия.Спецификация                        КАК ОбработатьПоСпецификацииСпецификация,
	|	ВыходныеИзделия.СпособАвтовыбораНоменклатуры        КАК СпособАвтовыбораНоменклатуры,
	|	ВыходныеИзделия.СпособАвтовыбораХарактеристики      КАК СпособАвтовыбораХарактеристики,
	|	ВыходныеИзделия.СвойствоСодержащееНоменклатуру      КАК СвойствоСодержащееНоменклатуру,
	|	ВыходныеИзделия.АлгоритмАвтовыбораХарактеристики    КАК АлгоритмАвтовыбораХарактеристики,
	|	ВыходныеИзделия.АлгоритмРасчетаКоличества           КАК АлгоритмРасчетаКоличества,
	|	ВыходныеИзделия.ОписаниеИзделия                     КАК ОписаниеИзделия,
	|	ВыходныеИзделия.КлючСвязи                           КАК КлючСвязи,
	|
	|	ВЫБОР КОГДА ВыходныеИзделия.Ссылка.ТипПроизводственногоПроцесса В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Сборка),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Ремонт))
	|		И (ВыходныеИзделия.НомерСтроки = 1)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                               КАК ЭтоОсновноеИзделие,
	|
	|	ВЫБОР КОГДА ВыходныеИзделия.Ссылка.ТипПроизводственногоПроцесса В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Сборка),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Ремонт))
	|		И (ВыходныеИзделия.Номенклатура = ВтДанныеПоНоменклатуре.Номенклатура
	|			ИЛИ ВтДанныеПоНоменклатуре.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И ВыходныеИзделия.НомерСтроки = 1
	|			ИЛИ ВыходныеИзделия.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И ВыходныеИзделия.ВидНоменклатуры = ВтДанныеПоНоменклатуре.Номенклатура.ВидНоменклатуры
	|				И ВыходныеИзделия.НомерСтроки = 1)
	|		И (ВтДанныеПоНоменклатуре.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				И ВыходныеИзделия.НомерСтроки = 1
	|			ИЛИ ВыходныеИзделия.Характеристика = ВтДанныеПоНоменклатуре.Характеристика
	|			ИЛИ ВыходныеИзделия.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                               КАК СоответствуетДаннымПоНоменклатуре,
	|
	|	ВыходныеИзделия.Ссылка.ВариантПромежуточногоВыпуска КАК ВариантПромежуточногоВыпуска
	|
	|ПОМЕСТИТЬ ВтИзделия
	|ИЗ
	|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК ВыходныеИзделия
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
	|		ПО ВыходныеИзделия.Ссылка = ВтДанныеПоНоменклатуре.Спецификация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1                                               КАК ВидИзделия,
	|	ВтДанныеПоНоменклатуре.Идентификатор            КАК Идентификатор,
	|	ВтДанныеПоНоменклатуре.Спецификация             КАК Спецификация,
	|	ВтДанныеПоНоменклатуре.ПодразделениеДиспетчер   КАК ПодразделениеДиспетчер,
	|	ВтДанныеПоНоменклатуре.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
	|	ВтДанныеПоНоменклатуре.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	ВтДанныеПоНоменклатуре.Распоряжение             КАК Распоряжение,
	|	ВтДанныеПоНоменклатуре.Назначение               КАК Назначение,
	|	ВтДанныеПоНоменклатуре.НачалоПроизводства       КАК НачалоПроизводства,
	|
	|	0                                               КАК НомерСтроки,
	|
	|	ВходныеИзделия.ОсновноеИзделиеВидНоменклатуры   КАК ВидНоменклатуры,
	|	&ВходныеИзделияИсточникНоменклатуры             КАК Номенклатура,
	|	&ВходныеИзделияИсточникХарактеристики           КАК Характеристика,
	|
	|	НЕОПРЕДЕЛЕНО                                    КАК ХарактеристикаЦО,
	|	НЕОПРЕДЕЛЕНО                                    КАК СерияЦО,
	|	НЕОПРЕДЕЛЕНО                                    КАК УпаковкаЦО,
	|	
	|	ВходныеИзделия.ОсновноеИзделиеХарактеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ЛюбаяХарактеристика,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.Обеспечивать)                                 КАК СпособПолученияМатериала,
	|	ЛОЖЬ                                                                                                        КАК Обособленно,
	|
	|	ВходныеИзделия.ОсновноеИзделиеЭтап КАК Этап,
	|	НЕОПРЕДЕЛЕНО                       КАК Операция,
	|
	|	ВЫРАЗИТЬ(ВходныеИзделия.ОсновноеИзделиеКоличествоУпаковок * ЕСТЬNULL(&ВходныеИзделияКоэффициентУпаковки, 1) КАК ЧИСЛО(15,3)) КАК Количество,
	|	ВходныеИзделия.ОсновноеИзделиеКоличествоУпаковок                                                                             КАК КоличествоУпаковок,
	|
	|	ВходныеИзделия.ОсновноеИзделиеУпаковка          КАК Упаковка,
	|	ЕСТЬNULL(&ВходныеИзделияКоэффициентУпаковки, 1) КАК КоэффициентУпаковки,
	|
	|	0                                               КАК ПроцентБрака,
	|
	|	1                                               КАК ДоляСтоимости,
	|	НЕОПРЕДЕЛЕНО                                    КАК СтатьяКалькуляции,
	|	ВходныеИзделия.ТипПроизводственногоПроцесса     КАК ТипПроизводственногоПроцесса,
	|	ЛОЖЬ                                            КАК ОбработатьПоСпецификации,
	|	НЕОПРЕДЕЛЕНО                                    КАК ОбработатьПоСпецификацииСпецификация,
	|	НЕОПРЕДЕЛЕНО                                    КАК СпособАвтовыбораНоменклатуры,
	|	НЕОПРЕДЕЛЕНО                                    КАК СпособАвтовыбораХарактеристики,
	|	НЕОПРЕДЕЛЕНО                                    КАК СвойствоСодержащееНоменклатуру,
	|	""""                                            КАК АлгоритмАвтовыбораХарактеристики,
	|	""""                                            КАК АлгоритмРасчетаКоличества,
	|	""""                                            КАК ОписаниеИзделия,
	|	&ПустойКлючСвязи                                КАК КлючСвязи,
	|
	|	ВходныеИзделия.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка) КАК ЭтоОсновноеИзделие,
	|
	|	ВЫБОР КОГДА ВходныеИзделия.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
	|			И (ВходныеИзделия.ОсновноеИзделиеНоменклатура = ВтДанныеПоНоменклатуре.Номенклатура
	|				ИЛИ ВтДанныеПоНоменклатуре.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ ВходныеИзделия.ОсновноеИзделиеНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					И ВходныеИзделия.ОсновноеИзделиеВидНоменклатуры = ВтДанныеПоНоменклатуре.Номенклатура.ВидНоменклатуры)
	|			И (ВтДанныеПоНоменклатуре.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ИЛИ ВходныеИзделия.ОсновноеИзделиеХарактеристика = ВтДанныеПоНоменклатуре.Характеристика
	|				ИЛИ ВходныеИзделия.ОсновноеИзделиеХарактеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                           КАК СоответствуетДаннымПоНоменклатуре,
	|
	|	ВходныеИзделия.ВариантПромежуточногоВыпуска     КАК ВариантПромежуточногоВыпуска
	|
	|ИЗ
	|	Справочник.РесурсныеСпецификации КАК ВходныеИзделия
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
	|		ПО ВходныеИзделия.Ссылка = ВтДанныеПоНоменклатуре.Спецификация
	|			И ВходныеИзделия.ТипПроизводственногоПроцесса В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Ремонт),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2                                                   КАК ВидИзделия,
	|	ВтДанныеПоНоменклатуре.Идентификатор                КАК Идентификатор,
	|	ВтДанныеПоНоменклатуре.Спецификация                 КАК Спецификация,
	|	ВтДанныеПоНоменклатуре.ПодразделениеДиспетчер       КАК ПодразделениеДиспетчер,
	|	ВтДанныеПоНоменклатуре.ПодразделениеИсполнитель     КАК ПодразделениеИсполнитель,
	|	ВтДанныеПоНоменклатуре.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|	ВтДанныеПоНоменклатуре.Распоряжение                 КАК Распоряжение,
	|	ВтДанныеПоНоменклатуре.Назначение                   КАК Назначение,
	|	ВтДанныеПоНоменклатуре.НачалоПроизводства           КАК НачалоПроизводства,
	|
	|	ВозвратныеОтходы.НомерСтроки                        КАК НомерСтроки,
	|
	|	ВозвратныеОтходы.Номенклатура.ВидНоменклатуры       КАК ВидНоменклатуры,
	|	ВозвратныеОтходы.Номенклатура                       КАК Номенклатура,
	|	ВозвратныеОтходы.Характеристика                     КАК Характеристика,
	|	
	|	НЕОПРЕДЕЛЕНО                                        КАК ХарактеристикаЦО,
	|	НЕОПРЕДЕЛЕНО                                        КАК СерияЦО,
	|	НЕОПРЕДЕЛЕНО                                        КАК УпаковкаЦО,
	|	
	|	ВозвратныеОтходы.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ЛюбаяХарактеристика,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.Обеспечивать)                    КАК СпособПолученияМатериала,
	|	ЛОЖЬ                                                                                           КАК Обособленно,
	|
	|	ВозвратныеОтходы.Этап                               КАК Этап,
	|	ВозвратныеОтходы.Операция                           КАК Операция,
	|
	|	ВЫРАЗИТЬ(ВозвратныеОтходы.КоличествоУпаковок * ЕСТЬNULL(&ВозвратныеОтходыКоэффициентУпаковки, 1) КАК ЧИСЛО(15,3)) КАК Количество,
	|	ВозвратныеОтходы.КоличествоУпаковок                                                                               КАК КоличествоУпаковок,
	|
	|	ВозвратныеОтходы.Упаковка                            КАК Упаковка,
	|	ЕСТЬNULL(&ВозвратныеОтходыКоэффициентУпаковки, 1)    КАК КоэффициентУпаковки,
	|
	|	0                                                    КАК ПроцентБрака,
	|
	|	1                                                    КАК ДоляСтоимости,
	|	ВозвратныеОтходы.СтатьяКалькуляции                   КАК СтатьяКалькуляции,
	|	ВозвратныеОтходы.Ссылка.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
	|	ВозвратныеОтходы.ОбработатьПоСпецификации            КАК ОбработатьПоСпецификации,
	|	ВозвратныеОтходы.Спецификация                        КАК ОбработатьПоСпецификацииСпецификация,
	|	ВозвратныеОтходы.СпособАвтовыбораНоменклатуры        КАК СпособАвтовыбораНоменклатуры,
	|	ВозвратныеОтходы.СпособАвтовыбораХарактеристики      КАК СпособАвтовыбораХарактеристики,
	|	ВозвратныеОтходы.СвойствоСодержащееНоменклатуру      КАК СвойствоСодержащееНоменклатуру,
	|	ВозвратныеОтходы.АлгоритмАвтовыбораХарактеристики    КАК АлгоритмАвтовыбораХарактеристики,
	|	ВозвратныеОтходы.АлгоритмРасчетаКоличества           КАК АлгоритмРасчетаКоличества,
	|	ВозвратныеОтходы.ОписаниеИзделия                     КАК ОписаниеИзделия,
	|	ВозвратныеОтходы.КлючСвязи                           КАК КлючСвязи,
	|
	|	ЛОЖЬ                                                 КАК ЭтоОсновноеИзделие,
	|
	|	ВЫБОР КОГДА ВозвратныеОтходы.Номенклатура = ВтДанныеПоНоменклатуре.Номенклатура
	|				И ВозвратныеОтходы.Характеристика = ВтДанныеПоНоменклатуре.Характеристика
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                КАК СоответствуетДаннымПоНоменклатуре,
	|
	|	ВозвратныеОтходы.Ссылка.ВариантПромежуточногоВыпуска КАК ВариантПромежуточногоВыпуска
	|
	|ИЗ
	|	Справочник.РесурсныеСпецификации.ВозвратныеОтходы КАК ВозвратныеОтходы
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
	|		ПО ВозвратныеОтходы.Ссылка = ВтДанныеПоНоменклатуре.Спецификация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Спецификация, ЭтоОсновноеИзделие
	|
	|";

	ТекстЗапросаКоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ВыходныеИзделия.Упаковка",
	"ВЫРАЗИТЬ(&ВыходныеИзделияИсточникНоменклатуры КАК Справочник.Номенклатура)");

	ТекстЗапроса = СтрЗаменить(
	ТекстЗапроса,
	"&ВыходныеИзделияКоэффициентУпаковки",
	ТекстЗапросаКоэффициентУпаковки);

	ПараметрыПодстановкиВыходныеИзделия = ПараметрыПодстановкиНоменклатураХарактеристикаОсновногоИзделия(
	"ВыходныеИзделия",
	"ВидНоменклатуры",
	"Номенклатура",
	"Характеристика");

	ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25();

	Если ИспользуетсяЦенообразование25 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыходныеИзделияИсточникХарактеристикиЦО", 
		ТекстПоляВыражениеХарактеристикаЦООсновногоИзделия("ВыходныеИзделия"));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыходныеИзделияИсточникСерииЦО",
		"ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыходныеИзделияИсточникУпаковкиЦО",
		ТекстПоляВыражениеУпаковкаЦООсновногоИзделия("ВыходныеИзделия"));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыходныеИзделияИсточникХарактеристикиЦО", "НЕОПРЕДЕЛЕНО");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыходныеИзделияИсточникСерииЦО",          "НЕОПРЕДЕЛЕНО");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыходныеИзделияИсточникУпаковкиЦО",       "НЕОПРЕДЕЛЕНО");
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыходныеИзделияИсточникНоменклатуры",   ПараметрыПодстановкиВыходныеИзделия.ИсточникНоменклатура);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыходныеИзделияИсточникХарактеристики", ПараметрыПодстановкиВыходныеИзделия.ИсточникХарактеристика);

	ТекстЗапросаКоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ВходныеИзделия.ОсновноеИзделиеУпаковка",
	"ВЫРАЗИТЬ(&ВходныеИзделияИсточникНоменклатуры КАК Справочник.Номенклатура)");

	ТекстЗапроса = СтрЗаменить(
	ТекстЗапроса,
	"&ВходныеИзделияКоэффициентУпаковки",
	ТекстЗапросаКоэффициентУпаковки);

	ПараметрыПодстановкиВходныеИзделия  = ПараметрыПодстановкиНоменклатураХарактеристикаОсновногоИзделия(
	"ВходныеИзделия",
	"ОсновноеИзделиеВидНоменклатуры",
	"ОсновноеИзделиеНоменклатура",
	"ОсновноеИзделиеХарактеристика");

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВходныеИзделияИсточникНоменклатуры",   ПараметрыПодстановкиВходныеИзделия.ИсточникНоменклатура);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВходныеИзделияИсточникХарактеристики", ПараметрыПодстановкиВходныеИзделия.ИсточникХарактеристика);

	ТекстЗапросаКоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ВозвратныеОтходы.Упаковка",
	"ВЫРАЗИТЬ(ВозвратныеОтходы.Номенклатура КАК Справочник.Номенклатура)");

	ТекстЗапроса = СтрЗаменить(
	ТекстЗапроса,
	"&ВозвратныеОтходыКоэффициентУпаковки",
	ТекстЗапросаКоэффициентУпаковки);

	ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете);

	СписокТаблицДляУдаления.Добавить("ВтИзделия");

	#КонецОбласти

	//++ НЕ УТКА

	#Область ПромежуточныйВыпуск

	Если ПараметрыВыборки.ПолучитьПромежуточныйВыпуск Тогда

		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьПромежуточныйВыпуск
		|ИЗ
		|	ВТИзделия КАК Изделия
		|ГДЕ
		|	Изделия.ВариантПромежуточногоВыпуска В (
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыПромежуточногоВыпуска.ТоварДругогоКачества),
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыПромежуточногоВыпуска.НастраиваетсяВручную))";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ПромежуточныйВыпуск");

	КонецЕсли;

	#КонецОбласти

	//-- НЕ УТКА

	УстановитьПривилегированныйРежим(Истина);
	Таблицы = ОбщегоНазначенияУТ.ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса, , Ложь, Истина);
	УстановитьПривилегированныйРежим(Ложь);

	ТекстыЗапроса = Новый СписокЗначений;

	//++ НЕ УТКА

	#Область ВтПромежуточныйВыпуск

	ЕстьПромежуточныйВыпуск = Ложь;

	Если ПараметрыВыборки.ПолучитьПромежуточныйВыпуск Тогда
		ЕстьПромежуточныйВыпуск = Таблицы.ПромежуточныйВыпуск.Количество() > 0;
	КонецЕсли;

	Если ЕстьПромежуточныйВыпуск Тогда

		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Изделия.Номенклатура                            КАК Номенклатура,
		|	Изделия.Номенклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
		|	Изделия.Номенклатура.ЕдиницаИзмерения           КАК ЕдиницаИзмерения,
		|	Изделия.Номенклатура.ИспользоватьУпаковки       КАК ИспользоватьУпаковки,
		|	Изделия.ВидНоменклатуры                         КАК ВидНоменклатуры,
		|	Изделия.Характеристика                          КАК Характеристика,
		|	Изделия.Характеристика.Наименование             КАК ХарактеристикаНаименование
		|ПОМЕСТИТЬ ВтИзделияКПодборуПромежуточногоВыпуска
		|ИЗ
		|	ВтИзделия КАК Изделия
		|ГДЕ
		|	Изделия.ЭтоОсновноеИзделие
		|	И (Изделия.ВариантПромежуточногоВыпуска = ЗНАЧЕНИЕ(Перечисление.ВариантыПромежуточногоВыпуска.ТоварДругогоКачества)
		|		ИЛИ ИСТИНА В (
		|			ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Справочник.РесурсныеСпецификации.ПромежуточныйВыпуск КАК Т
		|			ГДЕ
		|				Т.Ссылка = Изделия.Спецификация
		|				И Т.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ВидНоменклатуры,
		|	ИспользованиеХарактеристик,
		|	ЕдиницаИзмерения,
		|	ИспользоватьУпаковки";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВтИзделияКПодборуПромежуточногоВыпуска");

		//

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТоварыДругогоКачества.Номенклатура                                КАК Номенклатура,
		|	ТоварыДругогоКачества.НоменклатураБрак                            КАК НоменклатураБрак,
		|	ТоварыДругогоКачества.НоменклатураБрак.ВидНоменклатуры            КАК НоменклатураБракВидНоменклатуры,
		|	ТоварыДругогоКачества.НоменклатураБрак.ИспользованиеХарактеристик КАК НоменклатураБракИспользованиеХарактеристик,
		|	ТоварыДругогоКачества.НоменклатураБрак.ЕдиницаИзмерения           КАК НоменклатураБракЕдиницаИзмерения,
		|	ТоварыДругогоКачества.НоменклатураБрак.ИспользоватьУпаковки       КАК НоменклатураБракИспользоватьУпаковки
		|ПОМЕСТИТЬ ВТТоварыДругогоКачества
		|ИЗ
		|	РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
		|ГДЕ
		|	ТоварыДругогоКачества.Номенклатура В (
		|		ВЫБРАТЬ
		|			Т.Номенклатура
		|		ИЗ
		|			ВтИзделияКПодборуПромежуточногоВыпуска КАК Т)
		|	И ТоварыДругогоКачества.ГрадацияКачества = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.ОграниченноГоден)
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	НоменклатураБракВидНоменклатуры,
		|	НоменклатураБракИспользованиеХарактеристик,
		|	НоменклатураБракЕдиницаИзмерения,
		|	НоменклатураБракИспользоватьУпаковки";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВтТоварыДругогоКачества");

		//

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Изделия.Номенклатура                   КАК Номенклатура,
		|	Изделия.Характеристика                 КАК Характеристика,
		|	ТоварыДругогоКачества.НоменклатураБрак КАК НоменклатураПромежуточногоВыпуска,
		|	ВЫБОР
		|		КОГДА Изделия.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА Изделия.Характеристика
		|		КОГДА Изделия.ИспользованиеХарактеристик В (
		|				ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
		|				ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры))
		|			ТОГДА Изделия.Характеристика
		|		КОГДА ХарактеристикиТоваровДругогоКачества.Ссылка ЕСТЬ НЕ NULL
		|			ТОГДА ХарактеристикиТоваровДругогоКачества.Ссылка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ                                  КАК ХарактеристикаПромежуточногоВыпуска,
		|	АВТОНОМЕРЗАПИСИ()                      КАК Порядок
		|ПОМЕСТИТЬ ВтПодборПромежуточногоВыпуска
		|ИЗ
		|	ВтИзделияКПодборуПромежуточногоВыпуска КАК Изделия
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварыДругогоКачества КАК ТоварыДругогоКачества
		|	ПО Изделия.Номенклатура = ТоварыДругогоКачества.Номенклатура
		|		И Изделия.ВидНоменклатуры = ТоварыДругогоКачества.НоменклатураБракВидНоменклатуры
		|		И Изделия.ИспользованиеХарактеристик = ТоварыДругогоКачества.НоменклатураБракИспользованиеХарактеристик
		|		И Изделия.ЕдиницаИзмерения = ТоварыДругогоКачества.НоменклатураБракЕдиницаИзмерения
		|		И Изделия.ИспользоватьУпаковки = ТоварыДругогоКачества.НоменклатураБракИспользоватьУпаковки
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиТоваровДругогоКачества
		|	ПО Изделия.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		И Изделия.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
		|		И ТоварыДругогоКачества.НоменклатураБрак = ХарактеристикиТоваровДругогоКачества.Владелец
		|		И Изделия.ХарактеристикаНаименование = ХарактеристикиТоваровДругогоКачества.Наименование
		|		И НЕ ХарактеристикиТоваровДругогоКачества.ПометкаУдаления
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВтПодборПромежуточногоВыпуска");

		//

		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПромежуточныйВыпуск.Номенклатура                        КАК Номенклатура,
		|	ПромежуточныйВыпуск.Характеристика                      КАК Характеристика,
		|	ПромежуточныйВыпуск.НоменклатураПромежуточногоВыпуска   КАК НоменклатураПромежуточногоВыпуска,
		|	ПромежуточныйВыпуск.ХарактеристикаПромежуточногоВыпуска КАК ХарактеристикаПромежуточногоВыпуска
		|ПОМЕСТИТЬ ВтНоменклатураПромежуточногоВыпускаПодобранная
		|ИЗ
		|	ВтПодборПромежуточногоВыпуска КАК ПромежуточныйВыпуск
		|ГДЕ
		|	ПромежуточныйВыпуск.Порядок В (
		|		ВЫБРАТЬ
		|			МИНИМУМ(Т.Порядок) КАК Порядок
		|		ИЗ
		|			ВтПодборПромежуточногоВыпуска КАК Т
		|		ГДЕ
		|			Т.Номенклатура = ПромежуточныйВыпуск.Номенклатура
		|			И Т.Характеристика = ПромежуточныйВыпуск.Характеристика)
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете);
		СписокТаблицДляУдаления.Добавить("ВтНоменклатураПромежуточногоВыпускаПодобранная");

		//

		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Изделия.Номенклатура                                КАК Номенклатура,
		|	Изделия.Характеристика                              КАК Характеристика,
		|	ЕСТЬNULL(ПодобраннаяНоменклатура.НоменклатураПромежуточногоВыпуска,
		|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК НоменклатураПромежуточногоВыпуска,
		|	ЕСТЬNULL(ПодобраннаяНоменклатура.ХарактеристикаПромежуточногоВыпуска,
		|		Изделия.Характеристика)                         КАК ХарактеристикаПромежуточногоВыпуска,
		|	Изделия.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		И Изделия.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
		|		И ЕСТЬNULL(ПодобраннаяНоменклатура.ХарактеристикаПромежуточногоВыпуска, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК СоздатьХарактеристику
		|ИЗ
		|	ВтИзделияКПодборуПромежуточногоВыпуска КАК Изделия
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтНоменклатураПромежуточногоВыпускаПодобранная КАК ПодобраннаяНоменклатура
		|	ПО Изделия.Номенклатура = ПодобраннаяНоменклатура.Номенклатура
		|		И Изделия.Характеристика = ПодобраннаяНоменклатура.Характеристика
		|ГДЕ
		|	ПодобраннаяНоменклатура.НоменклатураПромежуточногоВыпуска ЕСТЬ NULL
		|	ИЛИ Изделия.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		И Изделия.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
		|		И ЕСТЬNULL(ПодобраннаяНоменклатура.ХарактеристикаПромежуточногоВыпуска, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете);

		УстановитьПривилегированныйРежим(Истина);
		РезультатыЗапроса = ОбщегоНазначенияУТ.ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса, Ложь, Истина);
		УстановитьПривилегированныйРежим(Ложь);

		КэшСсылокПромежуточногоВыпуска = Новый Соответствие;
		НоменклатураПромежуточногоВыпускаНовая = РезультатыЗапроса[ТекстыЗапроса.Количество() - 1].Выгрузить();
		Для каждого Строка Из НоменклатураПромежуточногоВыпускаНовая Цикл
			СоздатьПромежуточнуюНоменклатуруХарактеристику(Строка, КэшСсылокПромежуточногоВыпуска);
		КонецЦикла;

		ТекстыЗапроса = Новый СписокЗначений;

		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПромежуточныйВыпуск.Номенклатура                        КАК Номенклатура,
		|	ПромежуточныйВыпуск.Характеристика                      КАК Характеристика,
		|	ПромежуточныйВыпуск.НоменклатураПромежуточногоВыпуска   КАК НоменклатураПромежуточногоВыпуска,
		|	ПромежуточныйВыпуск.ХарактеристикаПромежуточногоВыпуска КАК ХарактеристикаПромежуточногоВыпуска
		|ПОМЕСТИТЬ ВтНоменклатураПромежуточногоВыпускаНовая
		|ИЗ
		|	&НоменклатураПромежуточногоВыпускаНовая КАК ПромежуточныйВыпуск
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВтНоменклатураПромежуточногоВыпускаНовая");
		Запрос.УстановитьПараметр("НоменклатураПромежуточногоВыпускаНовая", НоменклатураПромежуточногоВыпускаНовая);

		//

		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПромежуточныйВыпуск.Ссылка              КАК Ссылка,
		|	ПромежуточныйВыпуск.НомерСтроки         КАК НомерСтроки,
		|	ПромежуточныйВыпуск.ЭтапОтправитель     КАК ЭтапОтправитель,
		|	ПромежуточныйВыпуск.ОперацияОтправитель КАК ОперацияОтправитель,
		|	ПромежуточныйВыпуск.ЭтапПолучатель      КАК ЭтапПолучатель,
		|	ПромежуточныйВыпуск.ОперацияПолучатель  КАК ОперацияПолучатель,
		|	ПромежуточныйВыпуск.Номенклатура        КАК Номенклатура,
		|	ПромежуточныйВыпуск.Характеристика      КАК Характеристика,
		|	ПромежуточныйВыпуск.КлючСвязи           КАК КлючСвязи
		|ПОМЕСТИТЬ ВтПромежуточныйВыпуск
		|ИЗ
		|	Справочник.РесурсныеСпецификации.ПромежуточныйВыпуск КАК ПромежуточныйВыпуск
		|ГДЕ
		|	ПромежуточныйВыпуск.Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Спецификация ИЗ ВтДанныеПоНоменклатуре КАК Т)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РесурсныеСпецификации.Ссылка                                 КАК Ссылка,
		|	0                                                            КАК НомерСтроки,
		|	ЭтапОтправитель.Ссылка                                       КАК ЭтапОтправитель,
		|	ЕСТЬNULL(ОперацияОтправитель.Ссылка, ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка)) КАК ОперацияОтправитель,
		|	ЭтапПолучатель.Ссылка                                        КАК ЭтапПолучатель,
		|	ЕСТЬNULL(ОперацияПолучатель.Ссылка, ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка))  КАК ОперацияПолучатель,
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)               КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЭтапОтправитель.Ссылка)              КАК КлючСвязи
		|ИЗ
		|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапОтправитель
		|	ПО РесурсныеСпецификации.Ссылка = ЭтапОтправитель.Владелец
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапПолучатель
		|	ПО РесурсныеСпецификации.Ссылка = ЭтапПолучатель.Владелец
		|		И ЭтапОтправитель.НомерСледующегоЭтапа = ЭтапПолучатель.НомерЭтапа
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ОперацияОтправитель
		|	ПО ЭтапОтправитель.Ссылка = ОперацияОтправитель.Владелец
		|		И ОперацияОтправитель.НомерСледующейОперации = 0
		|		И НЕ ОперацияОтправитель.ПометкаУдаления
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ОперацияПолучатель
		|	ПО ЭтапПолучатель.Ссылка = ОперацияПолучатель.Владелец
		|		И ОперацияПолучатель.НомерОперации = 1
		|		И НЕ ОперацияПолучатель.ПометкаУдаления
		|ГДЕ
		|	РесурсныеСпецификации.Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Спецификация ИЗ ВтДанныеПоНоменклатуре КАК Т)
		|	И РесурсныеСпецификации.ВариантПромежуточногоВыпуска = ЗНАЧЕНИЕ(Перечисление.ВариантыПромежуточногоВыпуска.ТоварДругогоКачества)
		|	И НЕ ЭтапОтправитель.ПометкаУдаления
		|	И НЕ ЭтапПолучатель.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВтПромежуточныйВыпуск");

	КонецЕсли;

	#КонецОбласти

	//-- НЕ УТКА

	#Область ВтСпособыПолученияМатериалов

	Если МенеджерВременныхТаблиц.Таблицы.Найти("ВтСпособыПолученияМатериалов") = Неопределено Тогда

		ТекстыЗапроса.Добавить(ОбеспечениеПроизводства.ТекстЗапросаВТСпособыПолученияМатериаловПустая());
		СписокТаблицДляУдаления.Добавить("ВтСпособыПолученияМатериалов");

	КонецЕсли;

	#КонецОбласти

	#Область ВтФорматыСкладов

	Если МенеджерВременныхТаблиц.Таблицы.Найти("ВтФорматыСкладов") = Неопределено Тогда

		ТекстыЗапроса.Добавить(Справочники.ФорматыМагазинов.ТекстЗапросаВтФорматыСкладов(Ложь));
		СписокТаблицДляУдаления.Добавить("ВтФорматыСкладов");

	КонецЕсли;

	#КонецОбласти

	//++ НЕ УТКА

	#Область ВтВремяРаботыВидовРабочихЦентров

	Если ПереченьДанных.Найти("ВидыРабочихЦентров") <> Неопределено
		ИЛИ ПереченьДанных.Найти("АльтернативныеВидыРабочихЦентров") <> Неопределено Тогда

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТабличнаяЧасть.Ссылка КАК Этап,
		|	ТабличнаяЧасть.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ТабличнаяЧасть.КлючСвязи КАК КлючСвязи,
		|	ВЫБОР
		|		КОГДА ВидыРЦ.ИспользуютсяВариантыНаладки
		|			ТОГДА ВариантыНаладки.ВремяРаботы
		|		ИНАЧЕ ВидыРЦ.ВремяРаботы
		|	КОНЕЦ КАК ВремяРаботы,
		|	ВЫБОР
		|		КОГДА ВидыРЦ.ИспользуютсяВариантыНаладки
		|			ТОГДА ВариантыНаладки.ЕдиницаИзмерения
		|		ИНАЧЕ ВидыРЦ.ЕдиницаИзмерения
		|	КОНЕЦ КАК ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА ВидыРЦ.ИспользуютсяВариантыНаладки
		|			ТОГДА ВЫБОР ВариантыНаладки.ЕдиницаИзмерения
		|					КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Минута)
		|						ТОГДА ВариантыНаладки.ВремяРаботы * 60
		|					КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Час)
		|						ТОГДА ВариантыНаладки.ВремяРаботы * 3600
		|					КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Сутки)
		|						ТОГДА ВариантыНаладки.ВремяРаботы * 86400
		|					ИНАЧЕ ВариантыНаладки.ВремяРаботы
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР ВидыРЦ.ЕдиницаИзмерения
		|				КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Минута)
		|					ТОГДА ВидыРЦ.ВремяРаботы * 60
		|				КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Час)
		|					ТОГДА ВидыРЦ.ВремяРаботы * 3600
		|				КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Сутки)
		|					ТОГДА ВидыРЦ.ВремяРаботы * 86400
		|				ИНАЧЕ ВидыРЦ.ВремяРаботы
		|			КОНЕЦ
		|	КОНЕЦ КАК ВремяРаботыВСекундах,
		|	ЭтапыПроизводства.ПорядокРаботыВидовРабочихЦентров = ЗНАЧЕНИЕ(Перечисление.ПорядокРаботыВидовРабочихЦентров.Одновременно) КАК ОдновременнаяРабота
		|
		|ПОМЕСТИТЬ ВТСинхроннаяРабота
		|ИЗ
		|	Справочник.ЭтапыПроизводства.ВидыРабочихЦентров КАК ТабличнаяЧасть
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ПО ТабличнаяЧасть.Ссылка = ЭтапыПроизводства.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРабочихЦентров КАК ВидыРЦ
		|		ПО ТабличнаяЧасть.ВидРабочегоЦентра = ВидыРЦ.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыНаладки КАК ВариантыНаладки
		|		ПО ТабличнаяЧасть.ВариантНаладки = ВариантыНаладки.Ссылка
		|ГДЕ
		|	ЭтапыПроизводства.Владелец В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Спецификация ИЗ ВтДанныеПоНоменклатуре КАК Т)
		|	И НЕ ЭтапыПроизводства.ПометкаУдаления
		|	И ВидыРЦ.ПараллельнаяЗагрузка
		|	И ВидыРЦ.ВариантЗагрузки = ЗНАЧЕНИЕ(Перечисление.ВариантыЗагрузкиРабочихЦентров.Синхронный)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧасть.Ссылка КАК Этап,
		|	ТабличнаяЧасть.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ТабличнаяЧасть.КлючСвязи КАК КлючСвязи,
		|	ВЫБОР
		|		КОГДА ВидыРЦ.ИспользуютсяВариантыНаладки
		|			ТОГДА ВариантыНаладки.ВремяРаботы
		|		ИНАЧЕ ВидыРЦ.ВремяРаботы
		|	КОНЕЦ КАК ВремяРаботы,
		|	ВЫБОР
		|		КОГДА ВидыРЦ.ИспользуютсяВариантыНаладки
		|			ТОГДА ВариантыНаладки.ЕдиницаИзмерения
		|		ИНАЧЕ ВидыРЦ.ЕдиницаИзмерения
		|	КОНЕЦ КАК ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА ВидыРЦ.ИспользуютсяВариантыНаладки
		|			ТОГДА ВЫБОР ВариантыНаладки.ЕдиницаИзмерения
		|					КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Минута)
		|						ТОГДА ВариантыНаладки.ВремяРаботы * 60
		|					КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Час)
		|						ТОГДА ВариантыНаладки.ВремяРаботы * 3600
		|					КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Сутки)
		|						ТОГДА ВариантыНаладки.ВремяРаботы * 86400
		|					ИНАЧЕ ВариантыНаладки.ВремяРаботы
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР ВидыРЦ.ЕдиницаИзмерения
		|				КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Минута)
		|					ТОГДА ВидыРЦ.ВремяРаботы * 60
		|				КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Час)
		|					ТОГДА ВидыРЦ.ВремяРаботы * 3600
		|				КОГДА ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Сутки)
		|					ТОГДА ВидыРЦ.ВремяРаботы * 86400
		|				ИНАЧЕ ВидыРЦ.ВремяРаботы
		|			КОНЕЦ
		|	КОНЕЦ КАК ВремяРаботыВСекундах,
		|	ЭтапыПроизводства.ПорядокРаботыВидовРабочихЦентров = ЗНАЧЕНИЕ(Перечисление.ПорядокРаботыВидовРабочихЦентров.Одновременно) КАК ОдновременнаяРабота
		|
		|ИЗ
		|	Справочник.ЭтапыПроизводства.АльтернативныеВидыРабочихЦентров КАК ТабличнаяЧасть
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ПО ТабличнаяЧасть.Ссылка = ЭтапыПроизводства.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРабочихЦентров КАК ВидыРЦ
		|		ПО ТабличнаяЧасть.ВидРабочегоЦентра = ВидыРЦ.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыНаладки КАК ВариантыНаладки
		|		ПО ТабличнаяЧасть.ВариантНаладки = ВариантыНаладки.Ссылка
		|ГДЕ
		|	ЭтапыПроизводства.Владелец В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Спецификация ИЗ ВтДанныеПоНоменклатуре КАК Т)
		|	И НЕ ЭтапыПроизводства.ПометкаУдаления
		|	И ВидыРЦ.ПараллельнаяЗагрузка
		|	И ВидыРЦ.ВариантЗагрузки = ЗНАЧЕНИЕ(Перечисление.ВариантыЗагрузкиРабочихЦентров.Синхронный)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Этап,
		|	ВидРабочегоЦентра";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВТСинхроннаяРабота");

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВТСинхроннаяРабота.Этап КАК Этап,
		|	МАКСИМУМ(ВТСинхроннаяРабота.ВремяРаботыВСекундах) КАК ВремяРаботыВСекундах
		|ПОМЕСТИТЬ ВТМаксВремяРаботы
		|ИЗ
		|	ВТСинхроннаяРабота КАК ВТСинхроннаяРабота
		|ГДЕ
		|	ВТСинхроннаяРабота.ОдновременнаяРабота
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСинхроннаяРабота.Этап
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Этап,
		|	ВремяРаботыВСекундах";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВТМаксВремяРаботы");

		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТСинхроннаяРабота.Этап КАК Этап,
		|	МАКСИМУМ(ВТСинхроннаяРабота.ВидРабочегоЦентра) КАК ВидРабочегоЦентра
		|ПОМЕСТИТЬ ВТВидыРЦ
		|ИЗ
		|	ВТСинхроннаяРабота КАК ВТСинхроннаяРабота
		|ГДЕ
		|	ВТСинхроннаяРабота.ОдновременнаяРабота
		|	И (ВТСинхроннаяРабота.Этап, ВТСинхроннаяРабота.ВремяРаботыВСекундах) В
		|			(ВЫБРАТЬ
		|				ВТМаксВремяРаботы.Этап КАК Этап,
		|				ВТМаксВремяРаботы.ВремяРаботыВСекундах КАК ВремяРаботыВСекундах
		|			ИЗ
		|				ВТМаксВремяРаботы КАК ВТМаксВремяРаботы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСинхроннаяРабота.Этап";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВТВидыРЦ");

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВТСинхроннаяРабота.Этап КАК Этап,
		|	ВТСинхроннаяРабота.ВремяРаботы КАК ВремяРаботы,
		|	ВТСинхроннаяРабота.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТСинхроннаяОдновременнаяРабота
		|ИЗ
		|	ВТСинхроннаяРабота КАК ВТСинхроннаяРабота
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВидыРЦ КАК ВТВидыРЦ
		|		ПО ВТСинхроннаяРабота.Этап = ВТВидыРЦ.Этап
		|			И ВТСинхроннаяРабота.ВидРабочегоЦентра = ВТВидыРЦ.ВидРабочегоЦентра
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Этап";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВТСинхроннаяОдновременнаяРабота");

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТабличнаяЧасть.Ссылка КАК Этап,
		|	ТабличнаяЧасть.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ТабличнаяЧасть.КлючСвязи КАК КлючСвязи,
		|	ВЫБОР
		|		КОГДА ВТСинхроннаяРабота.Этап ЕСТЬ НЕ NULL 
		|			ТОГДА ВТСинхроннаяРабота.ВремяРаботы
		|		КОГДА ВТСинхроннаяОдновременнаяРабота.Этап ЕСТЬ НЕ NULL 
		|			ТОГДА ВТСинхроннаяОдновременнаяРабота.ВремяРаботы
		|		ИНАЧЕ ТабличнаяЧасть.ВремяРаботы
		|	КОНЕЦ КАК ВремяРаботы,
		|	ВЫБОР
		|		КОГДА ВТСинхроннаяРабота.Этап ЕСТЬ НЕ NULL 
		|			ТОГДА ВТСинхроннаяРабота.ЕдиницаИзмерения
		|		КОГДА ВТСинхроннаяОдновременнаяРабота.Этап ЕСТЬ НЕ NULL 
		|			ТОГДА ВТСинхроннаяОдновременнаяРабота.ЕдиницаИзмерения
		|		ИНАЧЕ ТабличнаяЧасть.ЕдиницаИзмерения
		|	КОНЕЦ КАК ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА ВидыРЦ.ПараллельнаяЗагрузка
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК РассчитатьЗанятость
		|ПОМЕСТИТЬ ВТВремяРаботыВидовРабочихЦентров
		|ИЗ
		|	Справочник.ЭтапыПроизводства.ВидыРабочихЦентров КАК ТабличнаяЧасть
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ПО ТабличнаяЧасть.Ссылка = ЭтапыПроизводства.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРабочихЦентров КАК ВидыРЦ
		|		ПО ТабличнаяЧасть.ВидРабочегоЦентра = ВидыРЦ.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСинхроннаяОдновременнаяРабота КАК ВТСинхроннаяОдновременнаяРабота
		|		ПО ТабличнаяЧасть.Ссылка = ВТСинхроннаяОдновременнаяРабота.Этап
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСинхроннаяРабота КАК ВТСинхроннаяРабота
		|		ПО ТабличнаяЧасть.Ссылка = ВТСинхроннаяРабота.Этап
		|			И ТабличнаяЧасть.ВидРабочегоЦентра = ВТСинхроннаяРабота.ВидРабочегоЦентра
		|			И ТабличнаяЧасть.КлючСвязи = ВТСинхроннаяРабота.КлючСвязи
		|ГДЕ
		|	ЭтапыПроизводства.Владелец В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Спецификация ИЗ ВтДанныеПоНоменклатуре КАК Т)
		|	И НЕ ЭтапыПроизводства.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧасть.Ссылка КАК Этап,
		|	ТабличнаяЧасть.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ТабличнаяЧасть.КлючСвязи КАК КлючСвязи,
		|	ВЫБОР
		|		КОГДА ВТСинхроннаяРабота.Этап ЕСТЬ НЕ NULL 
		|			ТОГДА ВТСинхроннаяРабота.ВремяРаботы
		|		КОГДА ВТСинхроннаяОдновременнаяРабота.Этап ЕСТЬ НЕ NULL 
		|			ТОГДА ВТСинхроннаяОдновременнаяРабота.ВремяРаботы
		|		ИНАЧЕ ТабличнаяЧасть.ВремяРаботы
		|	КОНЕЦ КАК ВремяРаботы,
		|	ВЫБОР
		|		КОГДА ВТСинхроннаяРабота.Этап ЕСТЬ НЕ NULL 
		|			ТОГДА ВТСинхроннаяРабота.ЕдиницаИзмерения
		|		КОГДА ВТСинхроннаяОдновременнаяРабота.Этап ЕСТЬ НЕ NULL 
		|			ТОГДА ВТСинхроннаяОдновременнаяРабота.ЕдиницаИзмерения
		|		ИНАЧЕ ТабличнаяЧасть.ЕдиницаИзмерения
		|	КОНЕЦ КАК ЕдиницаИзмерения,
		|	ЛОЖЬ КАК РассчитатьЗанятость
		|ИЗ
		|	Справочник.ЭтапыПроизводства.АльтернативныеВидыРабочихЦентров КАК ТабличнаяЧасть
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ПО ТабличнаяЧасть.Ссылка = ЭтапыПроизводства.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСинхроннаяОдновременнаяРабота КАК ВТСинхроннаяОдновременнаяРабота
		|		ПО ТабличнаяЧасть.Ссылка = ВТСинхроннаяОдновременнаяРабота.Этап
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСинхроннаяРабота КАК ВТСинхроннаяРабота
		|		ПО ТабличнаяЧасть.Ссылка = ВТСинхроннаяРабота.Этап
		|			И ТабличнаяЧасть.ВидРабочегоЦентра = ВТСинхроннаяРабота.ВидРабочегоЦентра
		|			И ТабличнаяЧасть.КлючСвязи = ВТСинхроннаяРабота.КлючСвязи
		|
		|ГДЕ
		|	ЭтапыПроизводства.Владелец В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Спецификация ИЗ ВтДанныеПоНоменклатуре КАК Т)
		|	И НЕ ЭтапыПроизводства.ПометкаУдаления";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВТВремяРаботыВидовРабочихЦентров");

	КонецЕсли;

	#КонецОбласти

	#Область ВтТехнологическиеПроцессы

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВтДанныеПоНоменклатуре.Идентификатор                                    КАК Идентификатор,
	|
	|	Операции.Спецификация                                                   КАК Спецификация,
	|	ВЫРАЗИТЬ(Операции.Владелец КАК Справочник.ЭтапыПроизводства)            КАК Этап,
	|	Операции.Ссылка                                                         КАК Операция,
	|	Операции.ТехнологическийПроцесс                                         КАК ТехнологическийПроцесс,
	|	Операции.ТехнологическийПроцесс.ЕстьПараметризацияРесурсов              КАК ЕстьПараметризацияРесурсов,
	|	Операции.КоэффициентТехнологическогоПроцесса                            КАК Коэффициент,
	|
	|	ВЫРАЗИТЬ(Операции.Владелец КАК Справочник.ЭтапыПроизводства).НомерЭтапа           КАК НомерЭтапа,
	|	ВЫРАЗИТЬ(Операции.Владелец КАК Справочник.ЭтапыПроизводства).НомерСледующегоЭтапа КАК НомерСледующегоЭтапа,
	|	Операции.НомерОперации                                                            КАК НомерОперации
	|
	|ПОМЕСТИТЬ ВтТехнологическиеПроцессы
	|ИЗ
	|	Справочник.ТехнологическиеОперации КАК Операции
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
	|		ПО Операции.Спецификация = ВтДанныеПоНоменклатуре.Спецификация
	|
	|ГДЕ
	|	&ИспользоватьТехнологическиеПроцессы
	|	И Операции.СодержитТехнологическийПроцесс
	|	И НЕ Операции.ПометкаУдаления 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Идентификатор
	|
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВтТехнологическиеПроцессы");

	#КонецОбласти

	#Область ВтОтборПоСвойствам

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВтДанныеПоНоменклатуре.Идентификатор            КАК Идентификатор,
	|
	|	РесурсныеСпецификацииОтборПоСвойствам.КлючСвязи КАК КлючСвязи,
	|	РесурсныеСпецификацииОтборПоСвойствам.Свойство  КАК Свойство,
	|	РесурсныеСпецификацииОтборПоСвойствам.Условие   КАК Условие,
	|	РесурсныеСпецификацииОтборПоСвойствам.Значение  КАК ЗначениеОтбор,
	|
	|	ВЫБОР
	|		КОГДА НЕ СвойстваХарактеристики.Значение ЕСТЬ NULL
	|			ТОГДА СвойстваХарактеристики.Значение
	|		КОГДА НЕ СвойстваНоменклатуры.Значение ЕСТЬ NULL
	|			ТОГДА СвойстваНоменклатуры.Значение
	|		КОГДА НЕ СвойстваНаправленияДеятельности.Значение ЕСТЬ NULL
	|			ТОГДА СвойстваНаправленияДеятельности.Значение
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(РесурсныеСпецификацииОтборПоСвойствам.Значение) = ТИП(БУЛЕВО)
	|					ТОГДА ЛОЖЬ
	|				КОГДА ТИПЗНАЧЕНИЯ(РесурсныеСпецификацииОтборПоСвойствам.Значение) = ТИП(ЧИСЛО)
	|					ТОГДА 0
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ                                           КАК ЗначениеСвойства
	|
	|ПОМЕСТИТЬ ВТОтборПоСвойствамНастройки
	|ИЗ
	|	Справочник.РесурсныеСпецификации.ОтборПоСвойствам КАК РесурсныеСпецификацииОтборПоСвойствам
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
	|		ПО РесурсныеСпецификацииОтборПоСвойствам.Ссылка = ВтДанныеПоНоменклатуре.Спецификация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК СвойстваНоменклатуры
	|		ПО РесурсныеСпецификацииОтборПоСвойствам.Свойство = СвойстваНоменклатуры.Свойство
	|			И (СвойстваНоменклатуры.Ссылка = ВтДанныеПоНоменклатуре.Номенклатура)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК СвойстваХарактеристики
	|		ПО РесурсныеСпецификацииОтборПоСвойствам.Свойство = СвойстваХарактеристики.Свойство
	|			И (СвойстваХарактеристики.Ссылка = ВтДанныеПоНоменклатуре.Характеристика)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаправленияДеятельности.ДополнительныеРеквизиты КАК СвойстваНаправленияДеятельности
	|		ПО РесурсныеСпецификацииОтборПоСвойствам.Свойство = СвойстваНаправленияДеятельности.Свойство
	|			И (СвойстваНаправленияДеятельности.Ссылка = ВтДанныеПоНоменклатуре.НаправлениеДеятельности)
	|
	|ГДЕ
	|	&ИспользоватьПараметризацию
	|	И НЕ РесурсныеСпецификацииОтборПоСвойствам.КлючСвязи В (&КлючСвязиНоменклатура, &КлючСвязиХарактеристика)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтДанныеПоНоменклатуре.Идентификатор        КАК Идентификатор,
	|
	|	ЭтапыПроизводстваОтборПоСвойствам.КлючСвязи КАК КлючСвязи,
	|	ЭтапыПроизводстваОтборПоСвойствам.Свойство  КАК Свойство,
	|	ЭтапыПроизводстваОтборПоСвойствам.Условие   КАК Условие,
	|	ЭтапыПроизводстваОтборПоСвойствам.Значение  КАК ЗначениеОтбор,
	|
	|	ВЫБОР
	|		КОГДА НЕ СвойстваХарактеристики.Значение ЕСТЬ NULL
	|			ТОГДА СвойстваХарактеристики.Значение
	|		КОГДА НЕ СвойстваНоменклатуры.Значение ЕСТЬ NULL
	|			ТОГДА СвойстваНоменклатуры.Значение
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ЭтапыПроизводстваОтборПоСвойствам.Значение) = ТИП(БУЛЕВО)
	|					ТОГДА ЛОЖЬ
	|				КОГДА ТИПЗНАЧЕНИЯ(ЭтапыПроизводстваОтборПоСвойствам.Значение) = ТИП(ЧИСЛО)
	|					ТОГДА 0
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ                                       КАК ЗначениеСвойства
	|
	|ИЗ
	|	Справочник.ЭтапыПроизводства.ОтборПоСвойствам КАК ЭтапыПроизводстваОтборПоСвойствам
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	|		ПО ЭтапыПроизводстваОтборПоСвойствам.Ссылка = ЭтапыПроизводства.Ссылка
	|			И (НЕ ЭтапыПроизводства.ПометкаУдаления)
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
	|		ПО (ЭтапыПроизводства.Владелец = ВтДанныеПоНоменклатуре.Спецификация)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК СвойстваНоменклатуры
	|		ПО ЭтапыПроизводстваОтборПоСвойствам.Свойство = СвойстваНоменклатуры.Свойство
	|			И (СвойстваНоменклатуры.Ссылка = ВтДанныеПоНоменклатуре.Номенклатура)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК СвойстваХарактеристики
	|		ПО ЭтапыПроизводстваОтборПоСвойствам.Свойство = СвойстваХарактеристики.Свойство
	|			И (СвойстваХарактеристики.Ссылка = ВтДанныеПоНоменклатуре.Характеристика)
	|
	|ГДЕ
	|	&ИспользоватьПараметризацию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтДанныеПоНоменклатуре.Идентификатор                 КАК Идентификатор,
	|
	|	ТехнологическиеПроцессыОтборПоСвойствам.КлючСвязи    КАК КлючСвязи,
	|	ТехнологическиеПроцессыОтборПоСвойствам.Свойство     КАК Свойство,
	|	ТехнологическиеПроцессыОтборПоСвойствам.Условие      КАК Условие,
	|	ТехнологическиеПроцессыОтборПоСвойствам.Значение     КАК ЗначениеОтбор,
	|
	|	ВЫБОР
	|		КОГДА НЕ СвойстваХарактеристики.Значение ЕСТЬ NULL
	|			ТОГДА СвойстваХарактеристики.Значение
	|		КОГДА НЕ СвойстваНоменклатуры.Значение ЕСТЬ NULL
	|			ТОГДА СвойстваНоменклатуры.Значение
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ТехнологическиеПроцессыОтборПоСвойствам.Значение) = ТИП(БУЛЕВО)
	|					ТОГДА ЛОЖЬ
	|				КОГДА ТИПЗНАЧЕНИЯ(ТехнологическиеПроцессыОтборПоСвойствам.Значение) = ТИП(ЧИСЛО)
	|					ТОГДА 0
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ                                                КАК ЗначениеСвойства
	|
	|ИЗ
	|	ВтТехнологическиеПроцессы КАК ВтТехнологическиеПроцессы
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеПроцессы.ОтборПоСвойствам КАК ТехнологическиеПроцессыОтборПоСвойствам
	|		ПО ТехнологическиеПроцессыОтборПоСвойствам.Ссылка = ВтТехнологическиеПроцессы.ТехнологическийПроцесс
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
	|		ПО ВтТехнологическиеПроцессы.Идентификатор = ВтДанныеПоНоменклатуре.Идентификатор
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК СвойстваНоменклатуры
	|		ПО ТехнологическиеПроцессыОтборПоСвойствам.Свойство = СвойстваНоменклатуры.Свойство
	|			И (СвойстваНоменклатуры.Ссылка = ВтДанныеПоНоменклатуре.Номенклатура)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК СвойстваХарактеристики
	|		ПО ТехнологическиеПроцессыОтборПоСвойствам.Свойство = СвойстваХарактеристики.Свойство
	|			И (СвойстваХарактеристики.Ссылка = ВтДанныеПоНоменклатуре.Характеристика)
	|
	|ГДЕ
	|	&ИспользоватьПараметризацию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючСвязи,
	|	Свойство
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВТОтборПоСвойствамНастройки");

	ТекстЗапроса = УправлениеДаннымиОбИзделиях.ТекстЗапросаОтборНоменклатурыПоСвойствам("ВТОтборПоСвойствамНастройки");
	ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВТОтборПоСвойствам");

	#КонецОбласти

	//-- НЕ УТКА

	#Область ДанныеПоНоменклатуре

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеПоНоменклатуре.Идентификатор             КАК Идентификатор,
	|	ДанныеПоНоменклатуре.Спецификация              КАК Спецификация,
	|	ДанныеПоНоменклатуре.Номенклатура              КАК Номенклатура,
	|	ДанныеПоНоменклатуре.Характеристика            КАК Характеристика,
	|	ДанныеПоНоменклатуре.Количество                КАК Количество,
	|	ДанныеПоНоменклатуре.ПодразделениеДиспетчер    КАК ПодразделениеДиспетчер,
	|	ДанныеПоНоменклатуре.НаправлениеДеятельности   КАК НаправлениеДеятельности,
	|	ДанныеПоНоменклатуре.Распоряжение              КАК Распоряжение,
	|	ДанныеПоНоменклатуре.Назначение                КАК Назначение,
	|	ДанныеПоНоменклатуре.НачалоПроизводства        КАК НачалоПроизводства
	|ИЗ
	|	ВтДанныеПоНоменклатуре КАК ДанныеПоНоменклатуре
	|УПОРЯДОЧИТЬ ПО
	|	Идентификатор";
	ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ДанныеПоНоменклатуре");

	#КонецОбласти

	//++ НЕ УТКА

	#Область Автовыбор

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВтДанныеПоНоменклатуре.Номенклатура                         КАК Номенклатура,
	|	ВтДанныеПоНоменклатуре.Характеристика                       КАК Характеристика,
	|	НоменклатураДополнительныеРеквизиты.Свойство                КАК Свойство,
	|	&ВыражениеИдентификатораСвойствНоменклатураДопРеквизиты     КАК СвойствоИдентификатор,
	|	ПРЕДСТАВЛЕНИЕ(НоменклатураДополнительныеРеквизиты.Свойство) КАК СвойствоПредставление,
	|	НоменклатураДополнительныеРеквизиты.Значение                КАК Значение
	|ИЗ
	|	ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ВтДанныеПоНоменклатуре.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|ГДЕ
	|	&ИспользоватьПараметризацию
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВтДанныеПоНоменклатуре.Номенклатура,
	|	ВтДанныеПоНоменклатуре.Характеристика,
	|	ХарактеристикаДополнительныеРеквизиты.Свойство,
	|	&ВыражениеИдентификатораСвойствХарактеристикиДопРеквизиты,
	|	ПРЕДСТАВЛЕНИЕ(ХарактеристикаДополнительныеРеквизиты.Свойство),
	|	ХарактеристикаДополнительныеРеквизиты.Значение
	|ИЗ
	|	ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикаДополнительныеРеквизиты
	|		ПО ВтДанныеПоНоменклатуре.Характеристика = ХарактеристикаДополнительныеРеквизиты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ВтДанныеПоНоменклатуре.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|			И ХарактеристикаДополнительныеРеквизиты.Свойство = НоменклатураДополнительныеРеквизиты.Свойство
	|ГДЕ
	|	&ИспользоватьПараметризацию
	|	И НоменклатураДополнительныеРеквизиты.Свойство ЕСТЬ NULL";

	ПолеИдентификатораДляФормул = РаботаСФормулами.ПолеИдентификатораДополнительныхРеквизитовИСведений();
	ВыражениеИдентификатораСвойствНоменклатураДопРеквизиты = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"НоменклатураДополнительныеРеквизиты.Свойство.%1",
	ПолеИдентификатораДляФормул);
	ВыражениеИдентификатораСвойствХарактеристикиДопРеквизиты = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"ХарактеристикаДополнительныеРеквизиты.Свойство.%1",
	ПолеИдентификатораДляФормул);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыражениеИдентификатораСвойствНоменклатураДопРеквизиты", ВыражениеИдентификатораСвойствНоменклатураДопРеквизиты);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыражениеИдентификатораСвойствХарактеристикиДопРеквизиты", ВыражениеИдентификатораСвойствХарактеристикиДопРеквизиты);

	ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ЗначенияСвойствИзделий");

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СоответствиеСвойств.Ссылка                           КАК Спецификация,
	|	СоответствиеСвойств.КлючСвязи                        КАК КлючСвязи,
	|	СоответствиеСвойств.СпособПодбораЗначения            КАК СпособПодбораЗначения,
	|	СоответствиеСвойств.СвойствоМатериала                КАК СвойствоМатериала,
	|	&ВыражениеИдентификатораСвойстваМатериала            КАК СвойствоИдентификатор,
	|	ПРЕДСТАВЛЕНИЕ(СоответствиеСвойств.СвойствоМатериала) КАК СвойствоПредставление,
	|	СоответствиеСвойств.СвойствоПродукции                КАК СвойствоПродукции,
	|	СоответствиеСвойств.ЗначениеСвойства                 КАК Значение,
	|	СоответствиеСвойств.АлгоритмРасчетаЗначения          КАК АлгоритмРасчетаЗначения
	|ИЗ
	|	Справочник.РесурсныеСпецификации.СоответствиеСвойств КАК СоответствиеСвойств
	|		
	|ГДЕ
	|	&ИспользоватьПараметризацию
	|	И СоответствиеСвойств.Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Спецификация ИЗ ВтДанныеПоНоменклатуре КАК Т)
	|	И СоответствиеСвойств.СпособПодбораЗначения <> ЗНАЧЕНИЕ(Перечисление.СпособыПодбораЗначенияСвойстваНоменклатуры.ЛюбоеЗначение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоответствиеСвойств.Ссылка                           КАК Спецификация,
	|	СоответствиеСвойств.КлючСвязи                        КАК КлючСвязи,
	|	СоответствиеСвойств.СпособПодбораЗначения            КАК СпособПодбораЗначения,
	|	СоответствиеСвойств.СвойствоМатериала                КАК СвойствоМатериала,
	|	&ВыражениеИдентификатораСвойстваМатериала            КАК СвойствоИдентификатор,
	|	ПРЕДСТАВЛЕНИЕ(СоответствиеСвойств.СвойствоМатериала) КАК СвойствоПредставление,
	|	СоответствиеСвойств.СвойствоПродукции                КАК СвойствоПродукции,
	|	СоответствиеСвойств.ЗначениеСвойства                 КАК Значение,
	|	СоответствиеСвойств.АлгоритмРасчетаЗначения          КАК АлгоритмРасчетаЗначения
	|ИЗ
	|	Справочник.ТехнологическиеПроцессы.СоответствиеСвойств КАК СоответствиеСвойств
	|		
	|ГДЕ
	|	&ИспользоватьПараметризацию
	|	И СоответствиеСвойств.Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.ТехнологическийПроцесс ИЗ ВтТехнологическиеПроцессы КАК Т)
	|	И СоответствиеСвойств.СпособПодбораЗначения <> ЗНАЧЕНИЕ(Перечисление.СпособыПодбораЗначенияСвойстваНоменклатуры.ЛюбоеЗначение)
	|
	|";

	ИмяПоляИдентификатора = РаботаСФормулами.ПолеИдентификатораДополнительныхРеквизитовИСведений();
	ВыражениеИдентификатораСвойстваМатериала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"СоответствиеСвойств.СвойствоМатериала.%1",
	ИмяПоляИдентификатора);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыражениеИдентификатораСвойстваМатериала", ВыражениеИдентификатораСвойстваМатериала);

	ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "СоответствиеСвойств");

	#КонецОбласти

	//-- НЕ УТКА

	#Область РеквизитыСпецификации

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВтДанныеПоНоменклатуре.Идентификатор КАК Идентификатор,
	|
	|	РесурсныеСпецификации.Ссылка        КАК Спецификация,
	|	РесурсныеСпецификации.Представление КАК СпецификацияПредставление,
	|
	|	РесурсныеСпецификации.Код КАК Код,
	|	РесурсныеСпецификации.ИдентификаторВерсииДанных КАК ИдентификаторВерсииДанных,
	|
	|	РесурсныеСпецификации.СпособРаспределенияЗатратНаВыходныеИзделия КАК СпособРаспределенияЗатратНаВыходныеИзделия,
	|
	|	РесурсныеСпецификации.ТипПроизводственногоПроцесса         КАК ТипПроизводственногоПроцесса,
	|	РесурсныеСпецификации.ВариантНазначения                    КАК ВариантНазначения,
	|	РесурсныеСпецификации.МногоэтапныйПроизводственныйПроцесс  КАК МногоэтапныйПроизводственныйПроцесс,
	|
	|	ВЫБОР
	|		КОГДА &ПереопределятьНастройкуПартииВыпуска
	|			ТОГДА &ВыпускПроизвольнымиПорциями
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ДоступноОписаниеПартииВыпуска
	|					ТОГДА РесурсныеСпецификации.ВыпускПроизвольнымиПорциями
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ                                                         КАК ВыпускПроизвольнымиПорциями,
	|	ВЫБОР
	|		КОГДА &ПереопределятьНастройкуПартииВыпуска
	|			ТОГДА 0
	|		ИНАЧЕ РесурсныеСпецификации.ОптимальнаяПартияВыпуска
	|	КОНЕЦ                                                         КАК ОптимальнаяПартияВыпуска,
	|	ВЫБОР
	|		КОГДА &ПереопределятьНастройкуПартииВыпуска
	|			ТОГДА 0
	|		ИНАЧЕ РесурсныеСпецификации.ДопустимоеПревышениеОптимальнойПартииВыпуска
	|	КОНЕЦ                                                         КАК ДопустимоеПревышениеОптимальнойПартииВыпуска,
	|	ВЫБОР
	|		КОГДА &ПереопределятьНастройкуПартииВыпуска
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ДоступноОписаниеПартииВыпуска
	|					ТОГДА РесурсныеСпецификации.МинимальнаяПартияВыпуска
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ                                                         КАК МинимальнаяПартияВыпуска,
	|	
	|	РесурсныеСпецификации.ОграниченСрокПролеживанияВыходныхИзделий    КАК ОграниченСрокПролеживания,
	|	РесурсныеСпецификации.МаксимальныйСрокПролеживанияВыходныхИзделий КАК МаксимальныйСрокПролеживанияВДнях,
	|	РесурсныеСпецификации.ОптимальноеКоличествоПередачиМеждуЭтапами   КАК ОптимальноеКоличествоПередачиМеждуЭтапами,
	|	
	|	РесурсныеСпецификации.ЕстьУточняемоеОсновноеИзделие                                  КАК ЕстьУточняемоеОсновноеИзделие,
	|	РесурсныеСпецификации.ЕстьВложенныеСпецификации                                      КАК ЕстьВложенныеСпецификации,
	|	РесурсныеСпецификации.ЕстьРасчетВероятности                                          КАК ЕстьРасчетВероятности,
	|	РесурсныеСпецификации.ЕстьНекратныеНормативыВРЦ                                      КАК ЕстьНекратныеНормативыВРЦ,
	|	РесурсныеСпецификации.ЕстьПараметризацияРесурсов ИЛИ &ЕстьПараметризацияТехпроцессов КАК ЕстьПараметризацияРесурсов,
	|	
	|	РесурсныеСпецификации.ОтветственноеПодразделение КАК ОтветственноеПодразделение
	|	
	|ИЗ
	|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
	|		ПО РесурсныеСпецификации.Ссылка = ВтДанныеПоНоменклатуре.Спецификация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Идентификатор";

	ТекстПоляЕстьПараметризацияТехпроцессов = "ЛОЖЬ";
	//++ НЕ УТКА
	ТекстПоляЕстьПараметризацияТехпроцессов = "ИСТИНА В (
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	ВтТехнологическиеПроцессы КАК Т
	|ГДЕ
	|	Т.Спецификация = РесурсныеСпецификации.Ссылка
	|	И Т.ЕстьПараметризацияРесурсов
	|)";
	//-- НЕ УТКА
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЕстьПараметризацияТехпроцессов", ТекстПоляЕстьПараметризацияТехпроцессов);

	ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "РеквизитыСпецификации");

	#КонецОбласти

	#Область ОсновноеИзделие

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВтИзделия.Идентификатор                            КАК Идентификатор,
	|
	|	ВтИзделия.ВидНоменклатуры                          КАК ВидНоменклатуры,
	|	ВтИзделия.Номенклатура                             КАК Номенклатура,
	|	ВтИзделия.Характеристика                           КАК Характеристика,
	|	
	|	0                                                  КАК Количество,
	|	ВтИзделия.КоличествоУпаковок                       КАК КоличествоУпаковок,
	|	ВтИзделия.КоличествоУпаковок                       КАК КоличествоУпаковокНаЕдиницуПартииВыпуска,
	|	ВтИзделия.Номенклатура.ЕдиницаИзмерения            КАК ЕдиницаИзмерения,
	|	ВтИзделия.Упаковка                                 КАК Упаковка,
	|	НЕОПРЕДЕЛЕНО                                       КАК ДанныеУпаковки,
	|
	|	ВтИзделия.Номенклатура.ТипНоменклатуры             КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВтИзделия.Номенклатура.ИспользованиеХарактеристик В (
	|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
	|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры),
	|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                              КАК ХарактеристикиИспользуются,
	|
	|	ВтИзделия.ЛюбаяХарактеристика                      КАК ЛюбаяХарактеристика,
	|	ВтИзделия.Спецификация                             КАК Спецификация,
	|	ВтИзделия.Спецификация.ВариантНазначения           КАК ВариантНазначения,
	|	ВЫБОР
	|		КОГДА &УчитыватьВероятностьБрака
	|			ТОГДА ВтИзделия.ПроцентБрака / 100
	|		ИНАЧЕ 0
	|	КОНЕЦ                                              КАК КоэффициентБрака,
	|	ВтИзделия.ЭтоОсновноеИзделие                       КАК ЭтоОсновноеИзделие,
	|	
	|	ЕСТЬNULL(ВтИзделияОсновноеИзделие.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))         КАК ОсновноеИзделиеНоменклатура,
	|	ЕСТЬNULL(ВтИзделияОсновноеИзделие.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ОсновноеИзделиеУпаковка,
	|	ЕСТЬNULL(ВтИзделияОсновноеИзделие.КоличествоУпаковок, 0)                                                КАК ОсновноеИзделиеКоличествоУпаковокНаЕдиницуПартииВыпуска,
	|
	|	ЕСТЬNULL(ВтИзделия.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук), ЛОЖЬ) КАК ЕдиницаИзмеренияШтучная,
	|	ЕСТЬNULL(&ТекстЗапросаТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук), ЛОЖЬ) КАК УпаковкаШтучная,
	|	ЕСТЬNULL(ВтИзделия.Номенклатура.ГруппаАналитическогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)) КАК ГруппаАналитическогоУчета
	|
	|ИЗ ВтИзделия КАК ВтИзделия
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтИзделия КАК ВтИзделияОсновноеИзделие
	|		ПО ВтИзделия.Идентификатор = ВтИзделияОсновноеИзделие.Идентификатор
	|			И НЕ ВтИзделия.ЭтоОсновноеИзделие
	|			И ВтИзделияОсновноеИзделие.ЭтоОсновноеИзделие
	|
	|ГДЕ
	|	ВтИзделия.СоответствуетДаннымПоНоменклатуре
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВтИзделия.Идентификатор,
	|	ВтИзделия.ВидИзделия
	|";

	ТекстПоляТипИзмеряемойВеличины = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
	"ТипИзмеряемойВеличины",
	"ВтИзделия.Упаковка",
	"ВтИзделия.Номенклатура");

	ТекстЗапроса = СтрЗаменить(
	ТекстЗапроса, 
	"&ТекстЗапросаТипИзмеряемойВеличины",
	ТекстПоляТипИзмеряемойВеличины);

	ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ОсновноеИзделие");

	#КонецОбласти

	#Область Этапы

	Если ПереченьДанных.Найти("Этапы") <> Неопределено Тогда

		//++ НЕ УТКА
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЭтапыПроизводства.Ссылка                                             КАК Этап,
		|	ВтДанныеПоНоменклатуре.Идентификатор                                 КАК Идентификатор,
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокРаботыВидовРабочихЦентров.ПустаяСсылка) КАК ПорядокРаботыВидовРабочихЦентров
		|ПОМЕСТИТЬ ВтПереопределениеПорядкаРаботыВидовРабочихЦентров
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства.ВидыРабочихЦентров КАК ТабличнаяЧасть
		|		ПО ТабличнаяЧасть.Ссылка = ЭтапыПроизводства.Ссылка
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
		|		ПО ЭтапыПроизводства.Владелец = ВтДанныеПоНоменклатуре.Спецификация
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборПоСвойствам КАК ВТОтборПоСвойствам
		|		ПО ТабличнаяЧасть.КлючСвязи = ВТОтборПоСвойствам.КлючСвязи
		|			И ВтДанныеПоНоменклатуре.Идентификатор = ВТОтборПоСвойствам.Идентификатор
		|
		|ГДЕ
		|	НЕ ЭтапыПроизводства.ПометкаУдаления
		|	И ЕСТЬNULL(ВТОтборПоСвойствам.Используется, ИСТИНА)
		|	И ИСТИНА В (
		|		ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			ВТОтборПоСвойствам КАК Отбор
		|		ГДЕ
		|			Отбор.Идентификатор = ВтДанныеПоНоменклатуре.Идентификатор)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭтапыПроизводства.Ссылка,
		|	ВтДанныеПоНоменклатуре.Идентификатор
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ТабличнаяЧасть.ВидРабочегоЦентра) <= 1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Этап, Идентификатор";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВтПереопределениеПорядкаРаботыВидовРабочихЦентров");
		//-- НЕ УТКА

		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&ЭтапыПроизводства_Представления,
		|	ОсновноеВыходноеИзделие.Идентификатор                                    КАК Идентификатор,
		|	ЭтапыПроизводства.Ссылка                                                 КАК Этап,
		|	ЭтапыПроизводства.Владелец                                               КАК Спецификация,
		|	ЭтапыПроизводства.Представление                                          КАК ЭтапПредставление,
		|	ЭтапыПроизводства.НомерЭтапа                                             КАК НомерЭтапа,
		|	ЭтапыПроизводства.НомерСледующегоЭтапа                                   КАК НомерСледующегоЭтапа,
		|	ЭтапыПроизводства.Подразделение                                          КАК Подразделение,
		|	1                                                                        КАК Количество,
		|	1                                                                        КАК КоличествоНаЕдиницуПартииВыпуска,
		|	ОсновноеВыходноеИзделие.Количество                                       КАК КоличествоИзделие,
		|
		|	ЭтапыПроизводства.ПланироватьРаботуВидовРабочихЦентров                   КАК ПланироватьРаботуВидовРабочихЦентров,
		|	ЭтапыПроизводства.Непрерывный                                            КАК Непрерывный,
		|	ЭтапыПроизводства.ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий  КАК ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий,
		|	ЭтапыПроизводства.ДлительностьЭтапа                                      КАК ДлительностьЭтапа,
		|	ЭтапыПроизводства.ЕдиницаИзмеренияДлительностиЭтапа                      КАК ЕдиницаИзмеренияДлительностиЭтапа,
		|	ЭтапыПроизводства.ПредварительныйБуфер                                   КАК ПредварительныйБуфер,
		|	ЭтапыПроизводства.ЗавершающийБуфер                                       КАК ЗавершающийБуфер,
		|	ЭтапыПроизводства.ЕдиницаИзмеренияПредварительногоБуфера                 КАК ЕдиницаИзмеренияПредварительногоБуфера,
		|	ЭтапыПроизводства.ЕдиницаИзмеренияЗавершающегоБуфера                     КАК ЕдиницаИзмеренияЗавершающегоБуфера,
		|	ЭтапыПроизводства.Описание                                               КАК Описание,
		|	ЭтапыПроизводства.ПроизводствоНаСтороне                                  КАК ПроизводствоНаСтороне,
		|	ЭтапыПроизводства.Партнер                                                КАК Партнер,
		|	ЭтапыПроизводства.ГрафикРаботыПартнера                                   КАК ГрафикРаботыПартнера,
		|	ЭтапыПроизводства.УслугиПереработчика.(
		|		НомерСтроки       КАК НомерСтроки,
		|		Номенклатура      КАК Номенклатура,
		|		Характеристика    КАК Характеристика,
		|		Количество        КАК Количество,
		|		Количество        КАК КоличествоНаЕдиницуПартииВыпуска,
		|		СтатьяКалькуляции КАК СтатьяКалькуляции)                             КАК УслугиПереработчика,
		|
		|	&ТекстПоляМаршрутнойКарты,
		|
		//++ НЕ УТКА
		|	ЕСТЬNULL(ПереопределениеПорядкаРаботы.ПорядокРаботыВидовРабочихЦентров,
		|				ЭтапыПроизводства.ПорядокРаботыВидовРабочихЦентров)          КАК ПорядокРаботыВидовРабочихЦентров,
		|	ЭтапыПроизводства.ЕстьПараметризацияРесурсов                             КАК ЕстьПараметризацияРесурсов,
		//-- НЕ УТКА
		|
		|	ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьВДнях, 0)             КАК ДлительностьЭтапаВДнях,
		|	ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьВСекундах, 0)         КАК ДлительностьЭтапаВСекундах,
		|
		|	ВЫБОР РесурсныеСпецификации.ТипПроизводственногоПроцесса
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейОтНачала, 0)
		|		ИНАЧЕ - ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейДоОкончания, 0)
		|	КОНЕЦ                                                                    КАК ДнейОтПотребности,
		|
		|	ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска, 0)         КАК ДлительностьДоВыпуска
		|
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИзделия КАК ОсновноеВыходноеИзделие
		|		ПО ЭтапыПроизводства.Владелец = ОсновноеВыходноеИзделие.Спецификация
		|			И ОсновноеВыходноеИзделие.ЭтоОсновноеИзделие
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|		ПО ЭтапыПроизводства.Владелец = РесурсныеСпецификации.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативнаяДлительностьЭтаповПроизводства КАК НормативнаяДлительностьЭтапов
		|		ПО НормативнаяДлительностьЭтапов.Этап = ЭтапыПроизводства.Ссылка
		|
		//++ НЕ УТКА
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПереопределениеПорядкаРаботыВидовРабочихЦентров КАК ПереопределениеПорядкаРаботы
		|		ПО ПереопределениеПорядкаРаботы.Этап = ЭтапыПроизводства.Ссылка
		|			И ПереопределениеПорядкаРаботы.Идентификатор = ОсновноеВыходноеИзделие.Идентификатор
		//-- НЕ УТКА
		|
		|ГДЕ
		|	НЕ ЭтапыПроизводства.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор, НомерЭтапа";

		Если ПолучитьФункциональнуюОпцию("ХранитьОперацииВРесурсныхСпецификациях") Тогда
			ТекстПоляМаршрутнойКарты = "
			|	""""                                                КАК МаршрутнаяКарта,";
			//++ НЕ УТКА
			ТекстПоляМаршрутнойКарты = "
			|	ЗНАЧЕНИЕ(Справочник.МаршрутныеКарты.ПустаяСсылка)   КАК МаршрутнаяКарта,";
			//-- НЕ УТКА
			ТекстПоляМаршрутнойКарты = ТекстПоляМаршрутнойКарты + "
			|	0                                                   КАК КоэффициентМаршрутнойКарты,
			|	0                                                   КАК КоэффициентМаршрутнойКартыНаЕдиницуПартииВыпуска";
		Иначе
			ТекстПоляМаршрутнойКарты = "
			|	ЭтапыПроизводства.МаршрутнаяКарта                   КАК МаршрутнаяКарта,
			|	ЭтапыПроизводства.КоэффициентМаршрутнойКарты        КАК КоэффициентМаршрутнойКарты,
			|	ЭтапыПроизводства.КоэффициентМаршрутнойКарты        КАК КоэффициентМаршрутнойКартыНаЕдиницуПартииВыпуска";
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстПоляМаршрутнойКарты", ТекстПоляМаршрутнойКарты);

		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "Этапы");

	КонецЕсли;

	#КонецОбласти

	#Область ВыходныеИзделия

	Если ПереченьДанных.Найти("ВыходныеИзделия") <> Неопределено Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ВыходныеИзделия_Представления,
		|	ВтИзделия.Идентификатор                         КАК Идентификатор,
		|	ВтИзделия.НомерСтроки                           КАК НомерСтроки,
		|	ВтИзделия.ВидНоменклатуры                       КАК ВидНоменклатуры,
		|	ВтИзделия.Номенклатура                          КАК Номенклатура,
		|	ВтИзделия.Характеристика                        КАК Характеристика,
		|	ВтИзделия.ЛюбаяХарактеристика                   КАК ЛюбаяХарактеристика,
		|
		|	ВтИзделия.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК ЕдиницаИзмеренияШтучная,
		|	ЕСТЬNULL(&ТекстЗапросаТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук), ЛОЖЬ)            КАК УпаковкаШтучная,
		|
		|	0                                               КАК Количество,
		|	ВтИзделия.КоличествоУпаковок                    КАК КоличествоУпаковок,
		|	ВтИзделия.КоличествоУпаковок                    КАК КоличествоУпаковокНаЕдиницуПартииВыпуска,
		|	ВтИзделия.Номенклатура.ЕдиницаИзмерения         КАК ЕдиницаИзмерения,
		|	ВтИзделия.Упаковка                              КАК Упаковка,
		|	НЕОПРЕДЕЛЕНО                                    КАК ДанныеУпаковки,
		|
		|	ОсновноеВыходноеИзделие.Количество              КАК КоличествоИзделие,
		|
		|	&ДоляСтоимости                                  КАК ДоляСтоимости,
		|	&ДоляСтоимостиНаЕдиницу                         КАК ДоляСтоимостиНаЕдиницу,
		|
		|	ВтИзделия.Этап                                  КАК Этап,
		|	ВтИзделия.Этап.Подразделение                    КАК ПодразделениеЭтапа,
		|	ВтИзделия.Операция                              КАК Операция,
		|
		|	&ТекстПолеСклад                                 КАК Склад,
		|	ЕСТЬNULL(СпрСклады.ЦеховаяКладовая, ЛОЖЬ)       КАК ЭтоЦеховаяКладовая,
		|	ВтИзделия.Номенклатура.ТипНоменклатуры          КАК ТипНоменклатуры,
		|	ВЫБОР
		|		КОГДА ВтИзделия.Номенклатура.ИспользованиеХарактеристик В (
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                           КАК ХарактеристикиИспользуются,
		|	ВтИзделия.ОбработатьПоСпецификации              КАК ОбработатьПоСпецификации,
		|	ВтИзделия.ОбработатьПоСпецификацииСпецификация  КАК Спецификация,
		|
		|	ВЫБОР
		|		КОГДА &УчитыватьВероятностьБрака
		|			ТОГДА ВтИзделия.ПроцентБрака / 100
		|		ИНАЧЕ 0
		|	КОНЕЦ                                           КАК КоэффициентБрака,
		|
		|	ВЫБОР 
		|		КОГДА (ВтИзделия.СпособАвтовыбораНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ)
		|				ИЛИ ВтИзделия.СпособАвтовыбораХарактеристики <> ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ))
		|				И &ИспользоватьПараметризацию
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                           КАК ИспользуетсяАвтовыбор,
		|	ПРЕДСТАВЛЕНИЕ("""")                             КАК СведенияАвтовыбора,
		|	ВтИзделия.СпособАвтовыбораНоменклатуры          КАК СпособАвтовыбораНоменклатуры,
		|	ВтИзделия.СпособАвтовыбораХарактеристики        КАК СпособАвтовыбораХарактеристики,
		|	ВтИзделия.СвойствоСодержащееНоменклатуру        КАК СвойствоСодержащееНоменклатуру,
		|	ВтИзделия.АлгоритмАвтовыбораХарактеристики      КАК АлгоритмАвтовыбораХарактеристики,
		|	ВтИзделия.ОписаниеИзделия                       КАК ОписаниеИзделия,
		|
		// расчет по формуле:
		|	ВЫБОР
		|		КОГДА &ИспользоватьПараметризацию
		|			ТОГДА ВтИзделия.АлгоритмРасчетаКоличества
		|		ИНАЧЕ """" 
		|	КОНЕЦ                                           КАК АлгоритмРасчетаКоличества,
		|	ПРЕДСТАВЛЕНИЕ("""")                             КАК Формула,
		|	ПРЕДСТАВЛЕНИЕ("""")                             КАК ФормулаОшибкаРасчета,
		|
		// округление:
		|	ЕСТЬNULL(&ОкруглятьКоличествоШтучныхТоваров
		|		И ВтИзделия.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
		|		И ВтИзделия.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|		И &ТекстЗапросаТипИзмеряемойВеличины В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)), ЛОЖЬ)    КАК Округлить,
		|
		|	ВЫБОР ВтИзделия.ТипПроизводственногоПроцесса
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейОтНачала, 0) + ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьВДнях, 0)
		|		ИНАЧЕ - ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейДоОкончания, 0) + ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьВДнях, 0)
		|	КОНЕЦ                                             КАК ДнейОтПотребности,
		|
		|	ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска, 0) КАК ДлительностьДоВыпуска,
		|
		|	ВтИзделия.КлючСвязи                             КАК КлючСвязи
		|
		|ИЗ
		|	ВтИзделия КАК ВтИзделия
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтИзделия КАК ОсновноеВыходноеИзделие
		|		ПО ВтИзделия.Идентификатор = ОсновноеВыходноеИзделие.Идентификатор
		|			И ОсновноеВыходноеИзделие.ЭтоОсновноеИзделие
		|
		//++ НЕ УТКА
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборПоСвойствам КАК ВТОтборПоСвойствам
		|		ПО ВтИзделия.КлючСвязи = ВТОтборПоСвойствам.КлючСвязи
		|			И ВтИзделия.Идентификатор = ВТОтборПоСвойствам.Идентификатор
		//-- НЕ УТКА
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативнаяДлительностьЭтаповПроизводства КАК НормативнаяДлительностьЭтапов
		|		ПО НормативнаяДлительностьЭтапов.Этап = ВтИзделия.Этап
		|
		|		,ТекстСоединенияНастройкиПередачиМатериалов
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
		|		ПО &ТекстПолеСклад = СпрСклады.Ссылка
		|
		|		,СоединениеДоляСтоимости
		|
		|ГДЕ
		|	ВтИзделия.ВидИзделия = 0
		//++ НЕ УТКА
		|		И ЕСТЬNULL(ВТОтборПоСвойствам.Используется, ИСТИНА)
		//-- НЕ УТКА
		|
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор, НомерСтроки";

		// Для совместимости с 2.1, получение склада по основному выходному изделию
		ИмяТаблицыТовары =
		?(ПараметрыВыборки.ВариантЗаполненияОбеспечения = Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.ПоСхемамОбеспечения,
		"ВтИзделия",
		"ОсновноеВыходноеИзделие");

		ТекстЗапросаДляПолученияСклада = ОбеспечениеПроизводства.ТекстЗапросаНастройкиПередачиМатериалов(
		ИмяТаблицыТовары,
		"Этап.Подразделение",
		ПараметрыВыборки.ВариантЗаполненияОбеспечения);

		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		",ТекстСоединенияНастройкиПередачиМатериалов",
		ТекстЗапросаДляПолученияСклада.ТекстСоединения);

		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстПолеСклад",
		ТекстЗапросаДляПолученияСклада.ТекстПолеСклад);

		ТекстПоляТипИзмеряемойВеличины = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
		"ТипИзмеряемойВеличины",
		"ВтИзделия.Упаковка",
		"ВтИзделия.Номенклатура");
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстЗапросаТипИзмеряемойВеличины",
		ТекстПоляТипИзмеряемойВеличины);

		Если ПараметрыВыборки.РассчитыватьДолиСтоимостиВыходныхИзделий Тогда

			Если ИспользуетсяЦенообразование25 Тогда
				ПараметрыПодстановки = ПроизводствоСервер.ПараметрыПодстановкиАлгоритмаРасчетаДолейСтоимости(
				"ВтИзделия",
				"ВтИзделия.Спецификация.СпособРаспределенияЗатратНаВыходныеИзделия",
				"(Номенклатура, ХарактеристикаЦО, СерияЦО, УпаковкаЦО) В (
				|	Выбрать
				|		Т.Номенклатура,
				|		Т.ХарактеристикаЦО,
				|		Т.СерияЦО,
				|		Т.УпаковкаЦО
				|	ИЗ
				|		ВтИзделия КАК Т
				|	ГДЕ
				|		Т.ВидИзделия = 0
				|		И Т.Спецификация.СпособРаспределенияЗатратНаВыходныеИзделия =
				|			ЗНАЧЕНИЕ(Перечисление.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоПлановойСтоимости))",
				ИспользуетсяЦенообразование25);
			Иначе
				ПараметрыПодстановки = ПроизводствоСервер.ПараметрыПодстановкиАлгоритмаРасчетаДолейСтоимости(
				"ВтИзделия",
				"ВтИзделия.Спецификация.СпособРаспределенияЗатратНаВыходныеИзделия",
				"(Номенклатура, Характеристика) В (
				|	Выбрать
				|		Т.Номенклатура,
				|		Т.Характеристика
				|	ИЗ
				|		ВтИзделия КАК Т
				|	ГДЕ
				|		Т.ВидИзделия = 0
				|		И Т.Спецификация.СпособРаспределенияЗатратНаВыходныеИзделия =
				|			ЗНАЧЕНИЕ(Перечисление.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоПлановойСтоимости))");
			КонецЕсли;

			ПроизводствоСервер.ВыполнитьПодстановкуАлгоритмаРасчетаДолейСтоимости(ТекстЗапроса, ПараметрыПодстановки, ИспользуетсяЦенообразование25);

		Иначе

			ПараметрыПодстановки = ПроизводствоСервер.ПараметрыПодстановкиАлгоритмаРасчетаДолейСтоимости("ВтИзделия");

			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПараметрыПодстановки.СоединениеДоляСтоимости, "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПараметрыПодстановки.ДоляСтоимостиНаЕдиницу, "0");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПараметрыПодстановки.ДоляСтоимости, ПараметрыПодстановки.ИсточникДоляСтоимости);

		КонецЕсли;

		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВыходныеИзделия");

	КонецЕсли;

	#КонецОбласти

	#Область ВозвратныеОтходы

	Если ПереченьДанных.Найти("ВозвратныеОтходы") <> Неопределено Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ВозвратныеОтходы_Представления,
		|	ВтИзделия.Идентификатор                            КАК Идентификатор,
		|	ВтИзделия.НомерСтроки                              КАК НомерСтроки,
		|	ВтИзделия.ВидНоменклатуры                          КАК ВидНоменклатуры,
		|	ВтИзделия.Номенклатура                             КАК Номенклатура,
		|	ВтИзделия.Характеристика                           КАК Характеристика,
		|	ВтИзделия.ЛюбаяХарактеристика                      КАК ЛюбаяХарактеристика,
		|
		|	ВтИзделия.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК ЕдиницаИзмеренияШтучная,
		|	ЕСТЬNULL(&ТекстЗапросаТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук), ЛОЖЬ)            КАК УпаковкаШтучная,
		|
		|	0                                                  КАК Количество,
		|	ВтИзделия.КоличествоУпаковок                       КАК КоличествоУпаковок,
		|	ВтИзделия.КоличествоУпаковок                       КАК КоличествоУпаковокНаЕдиницуПартииВыпуска,
		|	ВтИзделия.Номенклатура.ЕдиницаИзмерения            КАК ЕдиницаИзмерения,
		|	ВтИзделия.Упаковка                                 КАК Упаковка,
		|	НЕОПРЕДЕЛЕНО                                       КАК ДанныеУпаковки,
		|
		|	ЕСТЬNULL(ОсновноеВыходноеИзделие.Количество, 0)    КАК КоличествоИзделие,
		|
		|	ВтИзделия.Этап                                     КАК Этап,
		|	ВтИзделия.Этап.Подразделение                       КАК ПодразделениеЭтапа,
		|	ВтИзделия.Этап.НомерЭтапа                          КАК НомерЭтапа,
		|	ВтИзделия.Этап.НомерСледующегоЭтапа                КАК НомерСледующегоЭтапа,
		|	ВтИзделия.Операция                                 КАК Операция,
		|
		|	&ТекстПолеСклад                                    КАК Склад,
		|	ЕСТЬNULL(СпрСклады.ЦеховаяКладовая, ЛОЖЬ)          КАК ЭтоЦеховаяКладовая,
		|	ВтИзделия.Номенклатура.ТипНоменклатуры             КАК ТипНоменклатуры,
		|	ВЫБОР
		|		КОГДА ВтИзделия.Номенклатура.ИспользованиеХарактеристик В (
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                              КАК ХарактеристикиИспользуются,
		|	ВтИзделия.ОбработатьПоСпецификации                 КАК ОбработатьПоСпецификации,
		|	ВтИзделия.ОбработатьПоСпецификацииСпецификация     КАК Спецификация,
		|
		|	ВтИзделия.СтатьяКалькуляции                        КАК СтатьяКалькуляции,
		|
		|	ВЫБОР 
		|		КОГДА (ВтИзделия.СпособАвтовыбораНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ)
		|				ИЛИ ВтИзделия.СпособАвтовыбораХарактеристики <> ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ))
		|				И &ИспользоватьПараметризацию
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                              КАК ИспользуетсяАвтовыбор,
		|	ПРЕДСТАВЛЕНИЕ("""")                                КАК СведенияАвтовыбора,
		|	ВтИзделия.СпособАвтовыбораНоменклатуры             КАК СпособАвтовыбораНоменклатуры,
		|	ВтИзделия.СпособАвтовыбораХарактеристики           КАК СпособАвтовыбораХарактеристики,
		|	ВтИзделия.СвойствоСодержащееНоменклатуру           КАК СвойствоСодержащееНоменклатуру,
		|	ВтИзделия.АлгоритмАвтовыбораХарактеристики         КАК АлгоритмАвтовыбораХарактеристики,
		|	ВтИзделия.ОписаниеИзделия                          КАК ОписаниеИзделия,
		|
		// расчет по формуле:
		|	ВЫБОР
		|		КОГДА &ИспользоватьПараметризацию
		|			ТОГДА ВтИзделия.АлгоритмРасчетаКоличества
		|		ИНАЧЕ """" 
		|	КОНЕЦ                                              КАК АлгоритмРасчетаКоличества,
		|	ПРЕДСТАВЛЕНИЕ("""")                                КАК Формула,
		|	ПРЕДСТАВЛЕНИЕ("""")                                КАК ФормулаОшибкаРасчета,
		|
		// округление:
		|	ЕСТЬNULL(&ОкруглятьКоличествоШтучныхТоваров
		|		И ВтИзделия.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
		|		И ВтИзделия.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|		И &ТекстЗапросаТипИзмеряемойВеличины В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)), ЛОЖЬ)      КАК Округлить,
		|
		|	ВЫБОР ВтИзделия.ТипПроизводственногоПроцесса
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейОтНачала, 0) + ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьВДнях, 0)
		|		ИНАЧЕ - ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейДоОкончания, 0) + ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьВДнях, 0)
		|	КОНЕЦ                                             КАК ДнейОтПотребности,
		|
		|	ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска, 0) КАК ДлительностьДоВыпуска,
		|
		|	&ТипСтрокиПобочныйВыход                     КАК ТипСтроки,
		|
		|	ВтИзделия.КлючСвязи                         КАК КлючСвязи
		|
		|ИЗ
		|	ВтИзделия КАК ВтИзделия
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтИзделия КАК ОсновноеВыходноеИзделие
		|		ПО ВтИзделия.Идентификатор = ОсновноеВыходноеИзделие.Идентификатор
		|			И ОсновноеВыходноеИзделие.ЭтоОсновноеИзделие
		|
		//++ НЕ УТКА
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборПоСвойствам КАК ВТОтборПоСвойствам
		|		ПО ВтИзделия.КлючСвязи = ВТОтборПоСвойствам.КлючСвязи
		|			И ВтИзделия.Идентификатор = ВТОтборПоСвойствам.Идентификатор
		//-- НЕ УТКА
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативнаяДлительностьЭтаповПроизводства КАК НормативнаяДлительностьЭтапов
		|		ПО НормативнаяДлительностьЭтапов.Этап = ВтИзделия.Этап
		|
		|		,ТекстСоединенияНастройкиПередачиМатериалов
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
		|		ПО &ТекстПолеСклад = СпрСклады.Ссылка
		|
		|ГДЕ
		|	ВтИзделия.ВидИзделия = 2
		//++ НЕ УТКА
		|	И ЕСТЬNULL(ВТОтборПоСвойствам.Используется, ИСТИНА)
		//-- НЕ УТКА
		|";

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"&ТекстЗапросаТипИзмеряемойВеличины",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
		"ТипИзмеряемойВеличины",
		"ВтИзделия.Упаковка",
		"ВтИзделия.Номенклатура"));

		// Для совместимости с 2.1, получение склада по основному выходному изделию
		ИмяТаблицыТовары =
		?(ПараметрыВыборки.ВариантЗаполненияОбеспечения = Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.ПоСхемамОбеспечения,
		"ВтИзделия",
		"ОсновноеВыходноеИзделие");

		ТекстЗапросаДляПолученияСклада = ОбеспечениеПроизводства.ТекстЗапросаНастройкиПередачиМатериалов(
		ИмяТаблицыТовары,
		"Этап.Подразделение",
		ПараметрыВыборки.ВариантЗаполненияОбеспечения);

		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		",ТекстСоединенияНастройкиПередачиМатериалов",
		ТекстЗапросаДляПолученияСклада.ТекстСоединения);

		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстПолеСклад",
		ТекстЗапросаДляПолученияСклада.ТекстПолеСклад);

		//++ НЕ УТКА
		Если ЕстьПромежуточныйВыпуск Тогда

			ТекстЗапросаДанныеПВ = "
			|ВЫБРАТЬ
			|	&ПромежуточныйВыпуск_Представления,
			|	ОсновноеВыходноеИзделие.Идентификатор                             КАК Идентификатор,
			|	ВЫРАЗИТЬ(ПромежуточныйВыпуск.НомерСтроки КАК ЧИСЛО(10,0)) + 10000 КАК НомерСтроки,
			|	ВЫБОР
			|		КОГДА ПромежуточныйВыпуск.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА ПромежуточныйВыпуск.Номенклатура.ВидНоменклатуры
			|		ИНАЧЕ ОсновноеВыходноеИзделие.ВидНоменклатуры
			|	КОНЕЦ КАК ВидНоменклатуры,
			|	ВЫБОР
			|		КОГДА ПромежуточныйВыпуск.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА ПромежуточныйВыпуск.Номенклатура
			|		КОГДА НоменклатураНовая.НоменклатураПромежуточногоВыпуска ЕСТЬ НЕ NULL
			|			ТОГДА НоменклатураНовая.НоменклатураПромежуточногоВыпуска
			|		ИНАЧЕ ЕСТЬNULL(НоменклатураПодобранная.НоменклатураПромежуточногоВыпуска, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
			|	КОНЕЦ КАК Номенклатура,
			|	ВЫБОР
			|		КОГДА ПромежуточныйВыпуск.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА ПромежуточныйВыпуск.Характеристика
			|		КОГДА НоменклатураНовая.НоменклатураПромежуточногоВыпуска ЕСТЬ НЕ NULL
			|			ТОГДА НоменклатураНовая.ХарактеристикаПромежуточногоВыпуска
			|		ИНАЧЕ ЕСТЬNULL(НоменклатураПодобранная.ХарактеристикаПромежуточногоВыпуска, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
			|	КОНЕЦ КАК Характеристика,
			|	ВЫБОР
			|		КОГДА ПромежуточныйВыпуск.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЛюбаяХарактеристика,
			|	
			|	ВЫБОР
			|		КОГДА ПромежуточныйВыпуск.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА ПромежуточныйВыпуск.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
			|		ИНАЧЕ ОсновноеВыходноеИзделие.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
			|	КОНЕЦ КАК ЕдиницаИзмеренияШтучная,
			|	ЛОЖЬ КАК УпаковкаШтучная,
			|
			|	ОсновноеВыходноеИзделие.Количество                КАК Количество,
			|	ОсновноеВыходноеИзделие.Количество                КАК КоличествоУпаковок,
			|	ОсновноеВыходноеИзделие.Количество                КАК КоличествоУпаковокНаЕдиницуПартииВыпуска,
			|	ВЫБОР
			|		КОГДА ПромежуточныйВыпуск.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА ПромежуточныйВыпуск.Номенклатура.ЕдиницаИзмерения
			|		ИНАЧЕ ОсновноеВыходноеИзделие.Номенклатура.ЕдиницаИзмерения
			|	КОНЕЦ КАК ЕдиницаИзмерения,
			|
			|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
			|	НЕОПРЕДЕЛЕНО КАК ДанныеУпаковки,
			|
			|	ОсновноеВыходноеИзделие.Количество КАК КоличествоИзделие,
			|
			|	ПромежуточныйВыпуск.ЭтапОтправитель                      КАК Этап,
			|	ПромежуточныйВыпуск.ЭтапОтправитель.Подразделение        КАК ПодразделениеЭтапа,
			|	ПромежуточныйВыпуск.ЭтапОтправитель.НомерЭтапа           КАК НомерЭтапа,
			|	ПромежуточныйВыпуск.ЭтапОтправитель.НомерСледующегоЭтапа КАК НомерСледующегоЭтапа,
			|	ПромежуточныйВыпуск.ОперацияОтправитель                  КАК Операция,
			|
			|	&ТекстПолеСклад                           КАК Склад,
			|	ЕСТЬNULL(СпрСклады.ЦеховаяКладовая, ЛОЖЬ) КАК ЭтоЦеховаяКладовая,
			|
			|	ВЫБОР
			|		КОГДА ПромежуточныйВыпуск.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА ПромежуточныйВыпуск.Номенклатура.ТипНоменклатуры
			|		ИНАЧЕ ОсновноеВыходноеИзделие.Номенклатура.ТипНоменклатуры
			|	КОНЕЦ КАК ТипНоменклатуры,
			|	ВЫБОР
			|		КОГДА ПромежуточныйВыпуск.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА ПромежуточныйВыпуск.Номенклатура.ИспользованиеХарактеристик В (
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры),
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
			|		ИНАЧЕ ОсновноеВыходноеИзделие.Номенклатура.ИспользованиеХарактеристик В (
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры),
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
			|	КОНЕЦ КАК ХарактеристикиИспользуются,
			|
			|	ЛОЖЬ КАК ОбработатьПоСпецификации,
			|	ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка) КАК Спецификация,
			|
			|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПолуфабрикатыПроизводимыеВПроцессе) КАК СтатьяКалькуляции,
			|
			|	ЛОЖЬ                КАК ИспользуетсяАвтовыбор,
			|	ПРЕДСТАВЛЕНИЕ("""") КАК СведенияАвтовыбора,
			|	НЕОПРЕДЕЛЕНО        КАК СпособАвтовыбораНоменклатуры,
			|	НЕОПРЕДЕЛЕНО        КАК СпособАвтовыбораХарактеристики,
			|	НЕОПРЕДЕЛЕНО        КАК СвойствоСодержащееНоменклатуру,
			|	""""                КАК АлгоритмАвтовыбораХарактеристики,
			|	""""                КАК ОписаниеИзделия,
			|
			// расчет по формуле:
			|	""""                КАК АлгоритмРасчетаКоличества,
			|	ПРЕДСТАВЛЕНИЕ("""") КАК Формула,
			|	ПРЕДСТАВЛЕНИЕ("""") КАК ФормулаОшибкаРасчета,
			|
			// округление:
			|	ЛОЖЬ КАК Округлить,
			|
			|	ВЫБОР ОсновноеВыходноеИзделие.ТипПроизводственногоПроцесса
			|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
			|			ТОГДА ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейОтНачала, 0) + ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьВДнях, 0)
			|		ИНАЧЕ - ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейДоОкончания, 0) + ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьВДнях, 0)
			|	КОНЕЦ КАК ДнейОтПотребности,
			|
			|	ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска, 0) КАК ДлительностьДоВыпуска,
			|
			|	&ТипСтрокиПромежуточныйПолуфабрикат КАК ТипСтроки,
			|
			|	ПромежуточныйВыпуск.КлючСвязи КАК КлючСвязи
			|ИЗ
			|	ВтПромежуточныйВыпуск КАК ПромежуточныйВыпуск
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИзделия КАК ОсновноеВыходноеИзделие
			|		ПО ПромежуточныйВыпуск.Ссылка = ОсновноеВыходноеИзделие.Спецификация
			|			И ОсновноеВыходноеИзделие.ЭтоОсновноеИзделие
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНоменклатураПромежуточногоВыпускаНовая КАК НоменклатураНовая
			|		ПО ОсновноеВыходноеИзделие.Номенклатура = НоменклатураНовая.Номенклатура
			|			И ОсновноеВыходноеИзделие.Характеристика = НоменклатураНовая.Характеристика
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНоменклатураПромежуточногоВыпускаПодобранная КАК НоменклатураПодобранная
			|		ПО ОсновноеВыходноеИзделие.Номенклатура = НоменклатураПодобранная.Номенклатура
			|			И ОсновноеВыходноеИзделие.Характеристика = НоменклатураПодобранная.Характеристика
			|
			// Сюда подставляется запрос для получения склада
			|		,ТекстСоединенияНастройкиПередачиМатериалов
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативнаяДлительностьЭтаповПроизводства КАК НормативнаяДлительностьЭтапов
			|		ПО НормативнаяДлительностьЭтапов.Этап = ПромежуточныйВыпуск.ЭтапОтправитель
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
			|		ПО &ТекстПолеСклад = СпрСклады.Ссылка
			|";

			ТекстЗапросаДляПолученияСклада = ОбеспечениеПроизводства.ТекстЗапросаНастройкиПередачиМатериалов(
			"ОсновноеВыходноеИзделие",
			"&Подразделение",
			ПараметрыВыборки.ВариантЗаполненияОбеспечения);
			ТекстЗапросаДанныеПВ = СтрЗаменить(
			ТекстЗапросаДанныеПВ, 
			",ТекстСоединенияНастройкиПередачиМатериалов",
			ТекстЗапросаДляПолученияСклада.ТекстСоединения);
			ТекстЗапросаДанныеПВ = СтрЗаменить(
			ТекстЗапросаДанныеПВ, 
			"&ТекстПолеСклад",
			ТекстЗапросаДляПолученияСклада.ТекстПолеСклад);
			ТекстЗапросаДанныеПВ = СтрЗаменить(
			ТекстЗапросаДанныеПВ, 
			"&Подразделение",
			"ПромежуточныйВыпуск.ЭтапОтправитель.Подразделение");

			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|" + ТекстЗапросаДанныеПВ;

		КонецЕсли;
		//-- НЕ УТКА

		ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор, НомерСтроки";

		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВозвратныеОтходы");

	КонецЕсли;

	#КонецОбласти

	//++ НЕ УТКА

	#Область ВходящиеИзделия

	Если ПереченьДанных.Найти("ВходящиеИзделия") <> Неопределено ИЛИ ПараметрыВыборки.ОбъединитьМатериалыИВходящиеИзделия Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВтИзделия.Идентификатор                         КАК Идентификатор,
		|	ВтИзделия.Спецификация                          КАК Ссылка,
		|	1                                               КАК НомерСтроки,
		|
		|	ВтИзделия.Номенклатура                          КАК Номенклатура,
		|	ВтИзделия.Характеристика                        КАК Характеристика,
		|
		|	ВтИзделия.Номенклатура.ТипНоменклатуры          КАК ТипНоменклатуры,
		|	ВЫБОР
		|		КОГДА ВтИзделия.Номенклатура.ИспользованиеХарактеристик В (
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                           КАК ХарактеристикиИспользуются,
		|
		|	ВтИзделия.ЛюбаяХарактеристика                   КАК ЛюбаяХарактеристика,
		|
		|	0                                               КАК Количество,
		|	ВтИзделия.КоличествоУпаковок                    КАК КоличествоУпаковок,
		|	ВтИзделия.КоличествоУпаковок                    КАК КоличествоУпаковокНаЕдиницуПартииВыпуска,
		|	ВтИзделия.Номенклатура.ЕдиницаИзмерения         КАК ЕдиницаИзмерения,
		|	ВтИзделия.Упаковка                              КАК Упаковка,
		|	НЕОПРЕДЕЛЕНО                                    КАК ДанныеУпаковки,
		|
		|	ОсновноеВыходноеИзделие.Количество              КАК КоличествоИзделие,
		|
		|	ЛОЖЬ                                            КАК Производится,
		|
		|	&ТекстПолеСклад                                 КАК Склад,
		|	ЕСТЬNULL(СпрСклады.ЦеховаяКладовая, ЛОЖЬ)       КАК ЭтоЦеховаяКладовая,
		|	&ТекстПолеВариантОбеспечения                    КАК ВариантОбеспечения,
		|	&ТекстПолеОбособленно                           КАК Обособленно,
		|	ВтИзделия.СпособПолученияМатериала              КАК СпособПолученияМатериала,
		|	ВЫБОР
		|		КОГДА ВтИзделия.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Ремонт)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.РемонтируемыеИзделия)
		|		КОГДА ВтИзделия.ТипПроизводственногоПроцесса = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.РазбираемыеИзделия)
		|	КОНЕЦ                                           КАК СтатьяКалькуляции,
		|
		|	ВтИзделия.Этап                                  КАК Этап,
		|	ВтИзделия.Этап                                  КАК ЭтапРедактирование,
		|
		|	ВтИзделия.Этап.Подразделение                    КАК ПодразделениеЭтапа,
		|
		|	ВтИзделия.Операция                              КАК Операция,
		|
		|	ВЫБОР ВтИзделия.ТипПроизводственногоПроцесса
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейОтНачала, 0)
		|		ИНАЧЕ - ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейДоОкончания, 0)
		|	КОНЕЦ КАК ДнейОтПотребности,
		|
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА НормативнаяДлительностьЭтапов.ДлительностьВСекундах = 0 ТОГДА
		|				НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска + 0.0001
		|			ИНАЧЕ 
		|				НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска + НормативнаяДлительностьЭтапов.ДлительностьВСекундах
		|		КОНЕЦ, 0) КАК ДлительностьДоВыпуска,
		|
		|	1                                               КАК КоэффициентВероятности,
		|	ВтИзделия.НачалоПроизводства                    КАК НачалоПроизводства,
		|
		// округление:
		|	ЕСТЬNULL(&ОкруглятьКоличествоШтучныхТоваров
		|		И ВтИзделия.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
		|		И ВтИзделия.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|		И &ТекстЗапросаТипИзмеряемойВеличины В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)), ЛОЖЬ)      КАК Округлить,
		|
		|	&ТипСтрокиВходящееИзделие                        КАК ТипСтроки,
		|
		|	&ПустойКлючСвязи                                 КАК КлючСвязи
		|
		|ИЗ
		|	ВтИзделия КАК ВтИзделия
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИзделия КАК ОсновноеВыходноеИзделие
		|		ПО ВтИзделия.Идентификатор = ОсновноеВыходноеИзделие.Идентификатор
		|			И ОсновноеВыходноеИзделие.ЭтоОсновноеИзделие
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативнаяДлительностьЭтаповПроизводства КАК НормативнаяДлительностьЭтапов
		|		ПО ВтИзделия.Этап = НормативнаяДлительностьЭтапов.Этап
		|
		// Сюда подставляется запрос для получения склада, варианта обеспечения
		|		,ТекстСоединенияПараметрыОбеспечения
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
		|		ПО &ТекстПолеСклад = СпрСклады.Ссылка
		|
		|ГДЕ
		|	ВтИзделия.ВидИзделия = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор";

		ТекстПоляТипИзмеряемойВеличины = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
		"ТипИзмеряемойВеличины",
		"ВтИзделия.Упаковка",
		"ВтИзделия.Номенклатура");
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстЗапросаТипИзмеряемойВеличины",
		ТекстПоляТипИзмеряемойВеличины);

		ОбеспечениеПроизводства.ВыполнитьПодстановкуПараметровОбеспеченияМатериалов(ТекстЗапроса,
		"ВтИзделия",
		"СпособПолученияМатериала",
		"Этап.Подразделение",
		Перечисления.ВариантыЗаполненияОбеспеченияПроизводства.ПоСхемамОбеспечения);

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Распоряжение", "ВтИзделия.Распоряжение");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Назначение"  , "ВтИзделия.Назначение");

		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВходящиеИзделия");

	КонецЕсли;

	#КонецОбласти

	//-- НЕ УТКА

	#Область МатериалыИУслуги

	Если ПереченьДанных.Найти("МатериалыИУслуги") <> Неопределено Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&МатериалыИУслуги_Представления,
		|	ОсновноеВыходноеИзделие.Идентификатор                  КАК Идентификатор,
		|	ВЫРАЗИТЬ(МатериалыИУслуги.НомерСтроки КАК ЧИСЛО(10,0)) КАК НомерСтроки,
		|	МатериалыИУслуги.Номенклатура                          КАК Номенклатура,
		|	МатериалыИУслуги.Характеристика                        КАК Характеристика,
		|	МатериалыИУслуги.Номенклатура.ТипНоменклатуры          КАК ТипНоменклатуры,
		|	ВЫБОР 
		|		КОГДА МатериалыИУслуги.Номенклатура.ИспользованиеХарактеристик В (
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                             КАК ХарактеристикиИспользуются,
		|	ВЫБОР
		|		КОГДА МатериалыИУслуги.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                             КАК ЛюбаяХарактеристика,
		|
		|	0                                                 КАК Количество,
		#Вставка
		|	МатериалыИУслуги.бит_КоэффициентУкрутки			  КАК бит_КоэффициентУкрутки,
		|	МатериалыИУслуги.бит_КоличествоПозиции          КАК бит_КоличествоПозиции,
		#КонецВставки
		#Вставка
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
		|	МатериалыИУслуги.бит_АгрегирующийКоэффициент	  КАК бит_АгрегирующийКоэффициент,
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
		#КонецВставки
		|	МатериалыИУслуги.КоличествоУпаковок               КАК КоличествоУпаковок,
		|	МатериалыИУслуги.КоличествоУпаковок               КАК КоличествоУпаковокНаЕдиницуПартииВыпуска,
		|	МатериалыИУслуги.Номенклатура.ЕдиницаИзмерения    КАК ЕдиницаИзмерения,
		|	МатериалыИУслуги.Упаковка                         КАК Упаковка,
		|	НЕОПРЕДЕЛЕНО                                      КАК ДанныеУпаковки,
		|
		|	МатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК ЕдиницаИзмеренияШтучная,
		|	ЕСТЬNULL(&ТекстЗапросаТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук), ЛОЖЬ)                   КАК УпаковкаШтучная,
		|
		|	ОсновноеВыходноеИзделие.Количество                КАК КоличествоИзделие,
		|
		|	МатериалыИУслуги.Этап                             КАК Этап,
		|	МатериалыИУслуги.Операция                         КАК Операция,
		|
		|	&ТекстПолеСклад                                   КАК Склад,
		|	&ТекстПолеВариантОбеспечения                      КАК ВариантОбеспечения,
		|	&ТекстПолеОбособленно                             КАК Обособленно,
		|	МатериалыИУслуги.Этап.Подразделение               КАК ПодразделениеЭтапа,
		|	МатериалыИУслуги.Этап.ПроизводствоНаСтороне       КАК ПроизводствоНаСтороне,
		|	МатериалыИУслуги.Этап.НомерЭтапа                  КАК НомерЭтапа,
		|	МатериалыИУслуги.Этап.НомерСледующегоЭтапа        КАК НомерСледующегоЭтапа,
		|	ЕСТЬNULL(СпрСклады.ЦеховаяКладовая, ЛОЖЬ)         КАК ЭтоЦеховаяКладовая,
		|
		|	&ТекстПолеЗаказатьНаСклад                         КАК ЗаказатьНаСклад,
		|
		|	&ТекстПолеЗапланировать                           КАК Запланировать,
		|
		|	МатериалыИУслуги.СтатьяКалькуляции                КАК СтатьяКалькуляции,
		|
		|	ВЫБОР 
		|		КОГДА (МатериалыИУслуги.СпособАвтовыбораНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ)
		|				ИЛИ МатериалыИУслуги.СпособАвтовыбораХарактеристики <> ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ))
		|				И &ИспользоватьПараметризацию
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                              КАК ИспользуетсяАвтовыбор,
		|	ПРЕДСТАВЛЕНИЕ("""")                                КАК СведенияАвтовыбора,
		|	МатериалыИУслуги.СпособАвтовыбораНоменклатуры      КАК СпособАвтовыбораНоменклатуры,
		|	МатериалыИУслуги.СпособАвтовыбораХарактеристики    КАК СпособАвтовыбораХарактеристики,
		|	МатериалыИУслуги.СвойствоСодержащееНоменклатуру    КАК СвойствоСодержащееНоменклатуру,
		|	МатериалыИУслуги.АлгоритмАвтовыбораХарактеристики  КАК АлгоритмАвтовыбораХарактеристики,
		|
		// расчет по формуле:
		|	ВЫБОР
		|		КОГДА &ИспользоватьПараметризацию
		|			ТОГДА МатериалыИУслуги.АлгоритмРасчетаКоличества
		|		ИНАЧЕ """" 
		|	КОНЕЦ                                              КАК АлгоритмРасчетаКоличества,
		|	ПРЕДСТАВЛЕНИЕ("""")                                КАК Формула,
		|	ПРЕДСТАВЛЕНИЕ("""")                                КАК ФормулаОшибкаРасчета,
		|
		// округление:
		|	ЕСТЬNULL(&ОкруглятьКоличествоШтучныхТоваров
		|		И МатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
		|		И МатериалыИУслуги.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|		И &ТекстЗапросаТипИзмеряемойВеличины В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)) , ЛОЖЬ) КАК Округлить,
		|	
		|	МатериалыИУслуги.ПроизводитсяВПроцессе КАК Производится,
		|	МатериалыИУслуги.ПроизводитсяВПроцессе КАК ПроизводитсяВПроцессе,
		|	МатериалыИУслуги.СпособПолученияМатериала КАК СпособПолученияМатериала,
		|	МатериалыИУслуги.ИсточникПолученияПолуфабриката КАК ИсточникПолученияПолуфабриката,
		|
		//++ Устарело_Производство21
		|	ВЫБОР
		|		КОГДА МатериалыИУслуги.ПроизводитсяВПроцессе
		|				И МатериалыИУслуги.ИсточникПолученияПолуфабриката ССЫЛКА Справочник.РесурсныеСпецификации
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПолучениеМатериаловЭтапаПроизводства.ПроизвестиПоСпецификации)
		|		КОГДА МатериалыИУслуги.ПроизводитсяВПроцессе
		|				И МатериалыИУслуги.ИсточникПолученияПолуфабриката ССЫЛКА Справочник.ЭтапыПроизводства
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПолучениеМатериаловЭтапаПроизводства.ПроизвестиНаЭтапе)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыПолучениеМатериаловЭтапаПроизводства.ПустаяСсылка)
		|	КОНЕЦ КАК СпособПолученияПолуфабриката,
		//-- Устарело_Производство21
		|
		|	ВЫБОР
		|		КОГДА МатериалыИУслуги.СпецификацияРемонта <> ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
		|			ТОГДА МатериалыИУслуги.СпецификацияРемонта
		|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(МатериалыИУслуги.ИсточникПолученияПолуфабриката КАК Справочник.РесурсныеСпецификации), ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка))
		|	КОНЕЦ КАК Спецификация,
		|
		|	МатериалыИУслуги.ПланироватьНеРанее  КАК ПланироватьНеРанее,
		|	МатериалыИУслуги.СпецификацияРемонта КАК СпецификацияРемонта,
		|
		|	ВЫБОР МатериалыИУслуги.Ссылка.ТипПроизводственногоПроцесса
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейОтНачала, 0)
		|		ИНАЧЕ - ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейДоОкончания, 0)
		|	КОНЕЦ КАК ДнейОтПотребности,
		|
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА НормативнаяДлительностьЭтапов.ДлительностьВСекундах = 0 ТОГДА
		|				НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска + 0.0001
		|			ИНАЧЕ 
		|				НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска + НормативнаяДлительностьЭтапов.ДлительностьВСекундах
		|		КОНЕЦ, 0) КАК ДлительностьДоВыпуска,
		|
		|	МатериалыИУслуги.ПрименениеМатериала КАК ПрименениеМатериала,
		|	МатериалыИУслуги.Альтернативный      КАК Альтернативный,
		|
		|	МатериалыИУслуги.Вероятность         КАК Вероятность,
		|	ВЫБОР
		|		КОГДА (МатериалыИУслуги.Альтернативный ИЛИ &СпособРасчетаМатериалов = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаМатериалов.ВероятноеПотребление))
		|				И МатериалыИУслуги.Вероятность > 0
		|			ТОГДА МатериалыИУслуги.Вероятность / 100
		|		ИНАЧЕ 1
		|	КОНЕЦ                                                     КАК КоэффициентВероятности,
		|
		|	ЛОЖЬ                                                      КАК ВходящееИзделие,
		|
		|	ОсновноеВыходноеИзделие.НачалоПроизводства                КАК НачалоПроизводства,
		|	ОсновноеВыходноеИзделие.ПодразделениеДиспетчер            КАК ПодразделениеДиспетчер,
		|
		|	ЛОЖЬ                                                      КАК Вспомогательный,
		//++ НЕ УТКА
		|	0                                                         КАК Порядок,
		|	ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка) КАК ОперацияРодитель,
		//-- НЕ УТКА
		|	ВЫБОР
		|		КОГДА МатериалыИУслуги.ПроизводитсяВПроцессе
		|			ТОГДА &ТипСтрокиПолуфабрикат
		|		ИНАЧЕ &ТипСтрокиМатериал
		|	КОНЕЦ                                                     КАК ТипСтроки,
		|
		//++ Локализация
		|	МатериалыИУслуги.Номенклатура.ПрослеживаемыйТовар         КАК ПрослеживаемыйТовар,
		//-- Локализация
		|
		|	&ПустойКлючСвязи                                          КАК КлючСвязиНабор,
		|
		|	МатериалыИУслуги.КлючСвязи                                КАК КлючСвязи
		|ИЗ
		|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК МатериалыИУслуги
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИзделия КАК ОсновноеВыходноеИзделие
		|		ПО МатериалыИУслуги.Ссылка = ОсновноеВыходноеИзделие.Спецификация
		|			И ОсновноеВыходноеИзделие.ЭтоОсновноеИзделие
		|
		|		,ТекстСоединенияЗаказатьНаСклад
		|
		// Сюда подставляется запрос для получения склада, варианта обеспечения
		|		,ТекстСоединенияПараметрыОбеспечения
		|
		//++ НЕ УТКА
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборПоСвойствам КАК ВТОтборПоСвойствам
		|		ПО МатериалыИУслуги.КлючСвязи = ВТОтборПоСвойствам.КлючСвязи
		|			И ОсновноеВыходноеИзделие.Идентификатор = ВТОтборПоСвойствам.Идентификатор
		//-- НЕ УТКА
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативнаяДлительностьЭтаповПроизводства КАК НормативнаяДлительностьЭтапов
		|		ПО НормативнаяДлительностьЭтапов.Этап = МатериалыИУслуги.Этап
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
		|		ПО &ТекстПолеСклад = СпрСклады.Ссылка
		|
		|		,ТекстСоединенияСпособыОбеспечения
		|
		|ГДЕ
		|	(НЕ МатериалыИУслуги.Альтернативный ИЛИ &СпособРасчетаМатериалов В (
		|													ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаМатериалов.ВероятноеПотребление),
		|													ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаМатериалов.МаксимальноеПотребление)))
		//++ НЕ УТКА
		|	И ЕСТЬNULL(ВТОтборПоСвойствам.Используется, ИСТИНА)
		//-- НЕ УТКА
		|
		|";

		ПолеЗаказатьНаСклад = ПараметрыПодстановкиПоляЗаказатьНаСклад("МатериалыИУслуги",, ПараметрыВыборки.ВариантЗаполненияОбеспечения);

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстПолеЗаказатьНаСклад"      , ПолеЗаказатьНаСклад.ТекстПоля);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ",ТекстСоединенияЗаказатьНаСклад", ПолеЗаказатьНаСклад.ТекстСоединения);

		ОбеспечениеПроизводства.ВыполнитьПодстановкуПараметровОбеспеченияМатериалов(ТекстЗапроса,
		"МатериалыИУслуги",
		"СпособПолученияМатериала",
		"&Подразделение",
		ПараметрыВыборки.ВариантЗаполненияОбеспечения);

		ТекстПоляПодразделение = "
		|	(ВЫБОР
		|		КОГДА ОсновноеВыходноеИзделие.ПодразделениеИсполнитель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			ТОГДА МатериалыИУслуги.Этап.Подразделение
		|		ИНАЧЕ ОсновноеВыходноеИзделие.ПодразделениеИсполнитель
		|	КОНЕЦ)
		|";

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Подразделение", ТекстПоляПодразделение);

		ТекстПолеЗапланировать = "ЛОЖЬ";
		ТекстСоединенияСпособыОбеспечения = "";
		Если ПараметрыВыборки.РассчитыватьПризнакЗапланироватьПроизводство Тогда
			ТекстПолеЗапланировать = ТекстПодстановкиПоляЗапланировать("ОсновноеВыходноеИзделие.ПодразделениеДиспетчер");
			ТекстСоединенияСпособыОбеспечения = РегистрыСведений.СхемыОбеспечения.ПодставитьСоединениеДляПолученияСпособаОбеспечения(
			"ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособОбеспечения
			|	ПО &ПодстановкаОсновногоСпособаОбеспечения",
			"ПодстановкаОсновногоСпособаОбеспечения",
			"МатериалыИУслуги.Номенклатура, МатериалыИУслуги.Характеристика, СпрСклады.Ссылка");
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстПолеЗапланировать"           , ТекстПолеЗапланировать);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ",ТекстСоединенияСпособыОбеспечения", ТекстСоединенияСпособыОбеспечения);

		//++ НЕ УТКА

		ТекстЗапросаДанныеТП = "
		|ВЫБРАТЬ
		|	&МатериалыИУслугиТП_Представления,
		|	ВтТехнологическиеПроцессы.Идентификатор                КАК Идентификатор,
		|	ВЫРАЗИТЬ(МатериалыИУслуги.НомерСтроки КАК ЧИСЛО(10,0)) КАК НомерСтроки,
		|	МатериалыИУслуги.Номенклатура                          КАК Номенклатура,
		|	МатериалыИУслуги.Характеристика                        КАК Характеристика,
		|	МатериалыИУслуги.Номенклатура.ТипНоменклатуры          КАК ТипНоменклатуры,
		|	ВЫБОР 
		|		КОГДА МатериалыИУслуги.Номенклатура.ИспользованиеХарактеристик В (
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                             КАК ХарактеристикиИспользуются,
		|	ВЫБОР
		|		КОГДА МатериалыИУслуги.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                             КАК ЛюбаяХарактеристика,
		|
		|	0                                                                           КАК Количество,
		#Вставка
		|	0			  КАК бит_КоэффициентУкрутки,
		|	0          КАК бит_КоличествоПозиции,
		#КонецВставки
		#Вставка
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
		|	0	  КАК бит_АгрегирующийКоэффициент,
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
		#КонецВставки
		|	МатериалыИУслуги.КоличествоУпаковок * ВтТехнологическиеПроцессы.Коэффициент КАК КоличествоУпаковок,
		|	МатериалыИУслуги.КоличествоУпаковок * ВтТехнологическиеПроцессы.Коэффициент КАК КоличествоУпаковокНаЕдиницуПартииВыпуска,
		|	МатериалыИУслуги.Номенклатура.ЕдиницаИзмерения                              КАК ЕдиницаИзмерения,
		|	МатериалыИУслуги.Упаковка                                                   КАК Упаковка,
		|	НЕОПРЕДЕЛЕНО                                                                КАК ДанныеУпаковки,
		|
		|	МатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК ЕдиницаИзмеренияШтучная,
		|	ЕСТЬNULL(&ТекстЗапросаТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук), ЛОЖЬ)                   КАК УпаковкаШтучная,
		|
		|	ОсновноеВыходноеИзделие.Количество                КАК КоличествоИзделие,
		|
		|	ВтТехнологическиеПроцессы.Этап                    КАК Этап,
		|	МатериалыИУслуги.Операция                         КАК Операция,
		|
		|	&ТекстПолеСклад                                   КАК Склад,
		|	&ТекстПолеВариантОбеспечения                      КАК ВариантОбеспечения,
		|	&ТекстПолеОбособленно                             КАК Обособленно,
		|	ВтТехнологическиеПроцессы.Этап.Подразделение      КАК ПодразделениеЭтапа,
		|	ЛОЖЬ                                              КАК ПроизводствоНаСтороне,
		|	ВтТехнологическиеПроцессы.НомерЭтапа              КАК НомерЭтапа,
		|	ВтТехнологическиеПроцессы.НомерСледующегоЭтапа    КАК НомерСледующегоЭтапа,
		|	ЕСТЬNULL(СпрСклады.ЦеховаяКладовая, ЛОЖЬ)         КАК ЭтоЦеховаяКладовая,
		|
		|	ЛОЖЬ                                              КАК ЗаказатьНаСклад,
		|
		|	&ТекстПолеЗапланировать                           КАК Запланировать,
		|
		|	МатериалыИУслуги.СтатьяКалькуляции                КАК СтатьяКалькуляции,
		|
		|	ВЫБОР 
		|		КОГДА (МатериалыИУслуги.СпособАвтовыбораНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ)
		|				ИЛИ МатериалыИУслуги.СпособАвтовыбораХарактеристики <> ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ))
		|				И &ИспользоватьПараметризацию
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ                                              КАК ИспользуетсяАвтовыбор,
		|	ПРЕДСТАВЛЕНИЕ("""")                                КАК СведенияАвтовыбора,
		|	МатериалыИУслуги.СпособАвтовыбораНоменклатуры      КАК СпособАвтовыбораНоменклатуры,
		|	МатериалыИУслуги.СпособАвтовыбораХарактеристики    КАК СпособАвтовыбораХарактеристики,
		|	МатериалыИУслуги.СвойствоСодержащееНоменклатуру    КАК СвойствоСодержащееНоменклатуру,
		|	МатериалыИУслуги.АлгоритмАвтовыбораХарактеристики  КАК АлгоритмАвтовыбораХарактеристики,
		|
		// расчет по формуле:
		|	ВЫБОР
		|		КОГДА &ИспользоватьПараметризацию
		|			ТОГДА МатериалыИУслуги.АлгоритмРасчетаКоличества
		|		ИНАЧЕ """" 
		|	КОНЕЦ                                              КАК АлгоритмРасчетаКоличества,
		|	ПРЕДСТАВЛЕНИЕ("""")                                КАК Формула,
		|	ПРЕДСТАВЛЕНИЕ("""")                                КАК ФормулаОшибкаРасчета,
		|
		// округление:
		|	ЕСТЬNULL(&ОкруглятьКоличествоШтучныхТоваров
		|		И МатериалыИУслуги.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
		|		И МатериалыИУслуги.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|		И &ТекстЗапросаТипИзмеряемойВеличины В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)), ЛОЖЬ)     КАК Округлить,
		|
		|	ЛОЖЬ                                                                         КАК Производится,
		|	ЛОЖЬ                                                                         КАК ПроизводитсяВПроцессе,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.Обеспечивать)  КАК СпособПолученияМатериала,
		|	ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)                      КАК ИсточникПолученияПолуфабриката,
		//++ Устарело_Производство21
		|	ЗНАЧЕНИЕ(Перечисление.СпособыПолучениеМатериаловЭтапаПроизводства.ПустаяСсылка) КАК СпособПолученияПолуфабриката,
		//-- Устарело_Производство21
		|	ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)                      КАК Спецификация,
		|	
		|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)                          КАК ПланироватьНеРанее,
		|	ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)                      КАК СпецификацияРемонта,
		|
		|	ВЫБОР ВтТехнологическиеПроцессы.Спецификация.ТипПроизводственногоПроцесса
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейОтНачала, 0)
		|		ИНАЧЕ - ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейДоОкончания, 0)
		|	КОНЕЦ КАК ДнейОтПотребности,
		|
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА НормативнаяДлительностьЭтапов.ДлительностьВСекундах = 0 ТОГДА
		|				НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска + 0.0001
		|			ИНАЧЕ 
		|				НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска + НормативнаяДлительностьЭтапов.ДлительностьВСекундах
		|		КОНЕЦ, 0) КАК ДлительностьДоВыпуска,
		|
		|	МатериалыИУслуги.ПрименениеМатериала           КАК ПрименениеМатериала,
		|	ЛОЖЬ                                           КАК Альтернативный,
		|
		|	0                                              КАК Вероятность,
		|	1                                              КАК КоэффициентВероятности,
		|	ЛОЖЬ                                           КАК ВходящееИзделие,
		|
		|	ОсновноеВыходноеИзделие.НачалоПроизводства     КАК НачалоПроизводства,
		|	ОсновноеВыходноеИзделие.ПодразделениеДиспетчер КАК ПодразделениеДиспетчер,
		|
		|	ИСТИНА                                                                                   КАК Вспомогательный,
		|	100000 * ВтТехнологическиеПроцессы.НомерЭтапа + ВтТехнологическиеПроцессы.НомерОперации  КАК Порядок,
		|	ВтТехнологическиеПроцессы.Операция                                                       КАК ОперацияРодитель,
		|	&ТипСтрокиМатериал                                                                       КАК ТипСтроки,
		//++ Локализация
		|	МатериалыИУслуги.Номенклатура.ПрослеживаемыйТовар                                        КАК ПрослеживаемыйТовар,
		//-- Локализация
		|
		|	&ПустойКлючСвязи                                                                         КАК КлючСвязиНабор,
		|
		|	МатериалыИУслуги.КлючСвязи                     КАК КлючСвязи
		|
		|ИЗ
		|	ВтТехнологическиеПроцессы КАК ВтТехнологическиеПроцессы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеПроцессы.МатериалыИУслуги КАК МатериалыИУслуги
		|		ПО МатериалыИУслуги.Ссылка = ВтТехнологическиеПроцессы.ТехнологическийПроцесс
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИзделия КАК ОсновноеВыходноеИзделие
		|		ПО ВтТехнологическиеПроцессы.Идентификатор = ОсновноеВыходноеИзделие.Идентификатор
		|			И ВтТехнологическиеПроцессы.Спецификация = ОсновноеВыходноеИзделие.Спецификация
		|			И ОсновноеВыходноеИзделие.ЭтоОсновноеИзделие
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборПоСвойствам КАК ВТОтборПоСвойствам
		|		ПО МатериалыИУслуги.КлючСвязи = ВТОтборПоСвойствам.КлючСвязи
		|			И ВтТехнологическиеПроцессы.Идентификатор = ВТОтборПоСвойствам.Идентификатор
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативнаяДлительностьЭтаповПроизводства КАК НормативнаяДлительностьЭтапов
		|		ПО НормативнаяДлительностьЭтапов.Этап = ВтТехнологическиеПроцессы.Этап
		|
		// Сюда подставляется запрос для получения склада, варианта обеспечения
		|		,ТекстСоединенияПараметрыОбеспечения
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
		|		ПО &ТекстПолеСклад = СпрСклады.Ссылка
		|
		|		,ТекстСоединенияСпособыОбеспечения
		|
		|ГДЕ
		|	ЕСТЬNULL(ВТОтборПоСвойствам.Используется, ИСТИНА)
		|
		|";

		ОбеспечениеПроизводства.ВыполнитьПодстановкуПараметровОбеспеченияМатериалов(ТекстЗапросаДанныеТП,
		"МатериалыИУслуги",
		,
		"&Подразделение",
		ПараметрыВыборки.ВариантЗаполненияОбеспечения);

		ТекстПоляПодразделение = "
		|	(ВЫБОР
		|		КОГДА ОсновноеВыходноеИзделие.ПодразделениеИсполнитель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			ТОГДА ВтТехнологическиеПроцессы.Этап.Подразделение
		|		ИНАЧЕ ОсновноеВыходноеИзделие.ПодразделениеИсполнитель
		|	КОНЕЦ)
		|";

		ТекстЗапросаДанныеТП = СтрЗаменить(ТекстЗапросаДанныеТП, "&Подразделение", ТекстПоляПодразделение);
		ТекстЗапросаДанныеТП = СтрЗаменить(ТекстЗапросаДанныеТП, "МатериалыИУслуги.СпособПолученияМатериала", "ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.Обеспечивать)");
		ТекстЗапросаДанныеТП = СтрЗаменить(ТекстЗапросаДанныеТП, "МатериалыИУслуги.Обособленно", "ЛОЖЬ");

		ТекстПолеЗапланировать = "ЛОЖЬ";
		ТекстСоединенияСпособыОбеспечения = "";
		Если ПараметрыВыборки.РассчитыватьПризнакЗапланироватьПроизводство Тогда
			ТекстПолеЗапланировать = ТекстПодстановкиПоляЗапланировать(
			"ОсновноеВыходноеИзделие.ПодразделениеДиспетчер",,
			"ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)");
			ТекстСоединенияСпособыОбеспечения = РегистрыСведений.СхемыОбеспечения.ПодставитьСоединениеДляПолученияСпособаОбеспечения(
			"ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособОбеспечения
			|	ПО &ПодстановкаОсновногоСпособаОбеспечения",
			"ПодстановкаОсновногоСпособаОбеспечения",
			"МатериалыИУслуги.Номенклатура, МатериалыИУслуги.Характеристика, СпрСклады.Ссылка");
		КонецЕсли;
		ТекстЗапросаДанныеТП = СтрЗаменить(ТекстЗапросаДанныеТП, "&ТекстПолеЗапланировать"           , ТекстПолеЗапланировать);
		ТекстЗапросаДанныеТП = СтрЗаменить(ТекстЗапросаДанныеТП, ",ТекстСоединенияСпособыОбеспечения", ТекстСоединенияСпособыОбеспечения);

		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|" + ТекстЗапросаДанныеТП;

		Если ЕстьПромежуточныйВыпуск Тогда

			ТекстЗапросаДанныеПВ = "
			|ВЫБРАТЬ
			|	&МатериалыПВ_Представления,
			|	ОсновноеВыходноеИзделие.Идентификатор КАК Идентификатор,
			|	ВЫРАЗИТЬ(Материалы.НомерСтроки КАК ЧИСЛО(10,0)) + 10000 КАК НомерСтроки,
			|	ВЫБОР
			|		КОГДА Материалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА Материалы.Номенклатура
			|		КОГДА НоменклатураНовая.НоменклатураПромежуточногоВыпуска ЕСТЬ НЕ NULL
			|			ТОГДА НоменклатураНовая.НоменклатураПромежуточногоВыпуска
			|		ИНАЧЕ ЕСТЬNULL(НоменклатураПодобранная.НоменклатураПромежуточногоВыпуска, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
			|	КОНЕЦ КАК Номенклатура,
			|	ВЫБОР
			|		КОГДА Материалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА Материалы.Характеристика
			|		КОГДА НоменклатураНовая.НоменклатураПромежуточногоВыпуска ЕСТЬ НЕ NULL
			|			ТОГДА НоменклатураНовая.ХарактеристикаПромежуточногоВыпуска
			|		ИНАЧЕ ЕСТЬNULL(НоменклатураПодобранная.ХарактеристикаПромежуточногоВыпуска, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
			|	КОНЕЦ КАК Характеристика,
			|
			|	ВЫБОР
			|		КОГДА Материалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА Материалы.Номенклатура.ТипНоменклатуры
			|		ИНАЧЕ ОсновноеВыходноеИзделие.Номенклатура.ТипНоменклатуры
			|	КОНЕЦ КАК ТипНоменклатуры,
			|	ВЫБОР
			|		КОГДА Материалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА Материалы.Номенклатура.ИспользованиеХарактеристик В (
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры),
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
			|		ИНАЧЕ ОсновноеВыходноеИзделие.Номенклатура.ИспользованиеХарактеристик В (
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры),
			|					ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
			|	КОНЕЦ КАК ХарактеристикиИспользуются,
			|	ВЫБОР
			|		КОГДА Материалы.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЛюбаяХарактеристика,
			|
			|	ОсновноеВыходноеИзделие.Количество      КАК Количество,
			|	ОсновноеВыходноеИзделие.Количество      КАК КоличествоУпаковок,
			|	ОсновноеВыходноеИзделие.Количество      КАК КоличествоУпаковокНаЕдиницуПартииВыпуска,
			|	ВЫБОР
			|		КОГДА Материалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА Материалы.Номенклатура.ЕдиницаИзмерения
			|		ИНАЧЕ ОсновноеВыходноеИзделие.Номенклатура.ЕдиницаИзмерения
			|	КОНЕЦ КАК ЕдиницаИзмерения,
			|
			|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
			|	НЕОПРЕДЕЛЕНО КАК ДанныеУпаковки,
			|
			|	ВЫБОР
			|		КОГДА Материалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА Материалы.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
			|		ИНАЧЕ ОсновноеВыходноеИзделие.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
			|	КОНЕЦ КАК ЕдиницаИзмеренияШтучная,
			|	ЛОЖЬ КАК УпаковкаШтучная,
			|
			|	ОсновноеВыходноеИзделие.Количество КАК КоличествоИзделие,
			|
			|	Материалы.ЭтапПолучатель     КАК Этап,
			|	Материалы.ОперацияПолучатель КАК Операция,
			|
			|	&ТекстПолеСклад                                         КАК Склад,
			|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению) КАК ВариантОбеспечения,
			|	ИСТИНА                                                  КАК Обособленно,
			|
			|	Материалы.ЭтапПолучатель.Подразделение         КАК ПодразделениеЭтапа,
			|	Материалы.ЭтапПолучатель.ПроизводствоНаСтороне КАК ПроизводствоНаСтороне,
			|	Материалы.ЭтапПолучатель.НомерЭтапа            КАК НомерЭтапа,
			|	Материалы.ЭтапПолучатель.НомерСледующегоЭтапа  КАК НомерСледующегоЭтапа,
			|	ЕСТЬNULL(СпрСклады.ЦеховаяКладовая, ЛОЖЬ)  КАК ЭтоЦеховаяКладовая,
			|
			|	ЛОЖЬ КАК ЗаказатьНаСклад,
			|
			|	ЛОЖЬ КАК Запланировать,
			|
			|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПолуфабрикатыПроизводимыеВПроцессе) КАК СтатьяКалькуляции,
			|
			|	ЛОЖЬ                КАК ИспользуетсяАвтовыбор,
			|	ПРЕДСТАВЛЕНИЕ("""") КАК СведенияАвтовыбора,
			|	НЕОПРЕДЕЛЕНО        КАК СпособАвтовыбораНоменклатуры,
			|	НЕОПРЕДЕЛЕНО        КАК СпособАвтовыбораХарактеристики,
			|	НЕОПРЕДЕЛЕНО        КАК СвойствоСодержащееНоменклатуру,
			|	""""                КАК АлгоритмАвтовыбораХарактеристики,
			|
			// расчет по формуле:
			|	""""                КАК АлгоритмРасчетаКоличества,
			|	ПРЕДСТАВЛЕНИЕ("""") КАК Формула,
			|	ПРЕДСТАВЛЕНИЕ("""") КАК ФормулаОшибкаРасчета,
			|
			// округление:
			|	ЛОЖЬ КАК Округлить,
			|
			|	ИСТИНА КАК Производится,
			|	ИСТИНА КАК ПроизводитсяВПроцессе,
			|	ЗНАЧЕНИЕ(Перечисление.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе) КАК СпособПолученияМатериала,
			|	Материалы.ЭтапОтправитель КАК ИсточникПолученияПолуфабриката,
			|
			//++ Устарело_Производство21
			|	ЗНАЧЕНИЕ(Перечисление.СпособыПолучениеМатериаловЭтапаПроизводства.ПустаяСсылка) КАК СпособПолученияПолуфабриката,
			//-- Устарело_Производство21
			|	ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка) КАК Спецификация,
			|	
			|	ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)     КАК ПланироватьНеРанее,
			|	ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка) КАК СпецификацияРемонта,
			|
			|	ВЫБОР ОсновноеВыходноеИзделие.ТипПроизводственногоПроцесса
			|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
			|			ТОГДА ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейОтНачала, 0)
			|		ИНАЧЕ - ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейДоОкончания, 0)
			|	КОНЕЦ КАК ДнейОтПотребности,
			|
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА НормативнаяДлительностьЭтапов.ДлительностьВСекундах = 0 ТОГДА
			|				НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска + 0.0001
			|			ИНАЧЕ 
			|				НормативнаяДлительностьЭтапов.ДлительностьДоВыпуска + НормативнаяДлительностьЭтапов.ДлительностьВСекундах
			|		КОНЕЦ, 0) КАК ДлительностьДоВыпуска,
			|	
			|	""""                                           КАК ПрименениеМатериала,
			|	ЛОЖЬ                                           КАК Альтернативный,
			|
			|	0                                              КАК Вероятность,
			|	1                                              КАК КоэффициентВероятности,
			|	ЛОЖЬ                                           КАК ВходящееИзделие,
			|
			|	ОсновноеВыходноеИзделие.НачалоПроизводства     КАК НачалоПроизводства,
			|	ОсновноеВыходноеИзделие.ПодразделениеДиспетчер КАК ПодразделениеДиспетчер,
			|
			|	ЛОЖЬ                                                      КАК Вспомогательный,
			|	0                                                         КАК Порядок,
			|	ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка) КАК ОперацияРодитель,
			|	&ТипСтрокиПромежуточныйПолуфабрикат                       КАК ТипСтроки,
			//++ Локализация
			|	ВЫБОР
			|		КОГДА Материалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|			ТОГДА Материалы.Номенклатура.ПрослеживаемыйТовар
			|		ИНАЧЕ ОсновноеВыходноеИзделие.Номенклатура.ПрослеживаемыйТовар
			|	КОНЕЦ                                                     КАК ПрослеживаемыйТовар,
			//-- Локализация
			|
			|	&ПустойКлючСвязи                                          КАК КлючСвязиНабор,
			|	Материалы.КлючСвязи                                       КАК КлючСвязи
			|ИЗ
			|	ВтПромежуточныйВыпуск КАК Материалы
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИзделия КАК ОсновноеВыходноеИзделие
			|		ПО Материалы.Ссылка = ОсновноеВыходноеИзделие.Спецификация
			|			И ОсновноеВыходноеИзделие.ЭтоОсновноеИзделие
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНоменклатураПромежуточногоВыпускаНовая КАК НоменклатураНовая
			|		ПО ОсновноеВыходноеИзделие.Номенклатура = НоменклатураНовая.Номенклатура
			|			И ОсновноеВыходноеИзделие.Характеристика = НоменклатураНовая.Характеристика
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНоменклатураПромежуточногоВыпускаПодобранная КАК НоменклатураПодобранная
			|		ПО ОсновноеВыходноеИзделие.Номенклатура = НоменклатураПодобранная.Номенклатура
			|			И ОсновноеВыходноеИзделие.Характеристика = НоменклатураПодобранная.Характеристика
			|
			// Сюда подставляется запрос для получения склада
			|		,ТекстСоединенияПараметрыОбеспечения
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативнаяДлительностьЭтаповПроизводства КАК НормативнаяДлительностьЭтапов
			|		ПО НормативнаяДлительностьЭтапов.Этап = Материалы.ЭтапПолучатель
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
			|		ПО &ТекстПолеСклад = СпрСклады.Ссылка
			|";

			ОбеспечениеПроизводства.ВыполнитьПодстановкуПараметровОбеспеченияМатериалов(ТекстЗапросаДанныеПВ,
			"ОсновноеВыходноеИзделие",
			,
			"&Подразделение",
			ПараметрыВыборки.ВариантЗаполненияОбеспечения);
			ТекстПоляПодразделение = "
			|	(ВЫБОР
			|		КОГДА ОсновноеВыходноеИзделие.ПодразделениеИсполнитель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
			|			ТОГДА Материалы.ЭтапПолучатель.Подразделение
			|		ИНАЧЕ ОсновноеВыходноеИзделие.ПодразделениеИсполнитель
			|	КОНЕЦ)
			|";
			ТекстЗапросаДанныеПВ = СтрЗаменить(ТекстЗапросаДанныеПВ, "&Подразделение", ТекстПоляПодразделение);

			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|" + ТекстЗапросаДанныеПВ;

		КонецЕсли;
		//-- НЕ УТКА

		ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор,
		//++ НЕ УТКА
		|	Порядок,
		//-- НЕ УТКА
		|	НомерСтроки";

		ТекстПоляТипИзмеряемойВеличины = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
		"ТипИзмеряемойВеличины",
		"МатериалыИУслуги.Упаковка",
		"МатериалыИУслуги.Номенклатура");
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстЗапросаТипИзмеряемойВеличины",
		ТекстПоляТипИзмеряемойВеличины);

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Распоряжение", "ОсновноеВыходноеИзделие.Распоряжение");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Назначение",   "ОсновноеВыходноеИзделие.Назначение"); 

		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "МатериалыИУслуги");

	КонецЕсли;

	#КонецОбласти

	#Область Трудозатраты

	Если ПереченьДанных.Найти("Трудозатраты") <> Неопределено Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ОсновноеВыходноеИзделие.Идентификатор           КАК Идентификатор,
		|	Трудозатраты.НомерСтроки                        КАК НомерСтроки,
		|	Трудозатраты.ВидРабот                           КАК ВидРабот,
		#Вставка
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
		|	Трудозатраты.ВидРабот.бит_ПроцентВыполненияОперации КАК бит_ПроцентВыполненияОперации,
        // Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
		#КонецВставки
		|	Трудозатраты.ВидРабот.ЕдиницаИзмерения          КАК ЕдиницаИзмерения,
		|	ОсновноеВыходноеИзделие.Количество              КАК КоличествоИзделие,
		|	Трудозатраты.СтатьяКалькуляции                  КАК СтатьяКалькуляции,
		|	Трудозатраты.НазначениеРабот                    КАК НазначениеРабот,
		|
		|	Трудозатраты.Количество КАК Количество,
		|	Трудозатраты.Количество КАК КоличествоНаЕдиницуПартииВыпуска,
		|
		|	ВЫБОР Трудозатраты.Ссылка.ТипПроизводственногоПроцесса
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейОтНачала, 0)
		|		ИНАЧЕ - ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейДоОкончания, 0)
		|	КОНЕЦ КАК ДнейОтПотребности,
		|
		|	Трудозатраты.Этап                                            КАК Этап,
		|	Трудозатраты.Операция                                        КАК Операция,
		|
		|	ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьВДнях, 0) КАК ДлительностьЭтапаВДнях,
		|
		|	Трудозатраты.Этап.ДлительностьЭтапа                          КАК ДлительностьЭтапа,
		|	Трудозатраты.Этап.Подразделение                              КАК ПодразделениеЭтапа,
		|
		// расчет по формуле:
		|	ВЫБОР
		|		КОГДА &ИспользоватьПараметризацию
		|			ТОГДА Трудозатраты.АлгоритмРасчетаКоличества
		|		ИНАЧЕ """" 
		|	КОНЕЦ                                                        КАК АлгоритмРасчетаКоличества,
		|	ПРЕДСТАВЛЕНИЕ("""")                                          КАК Формула,
		|	ПРЕДСТАВЛЕНИЕ("""")                                          КАК ФормулаОшибкаРасчета,
		|
		|	Трудозатраты.КлючСвязи КАК КлючСвязи,
		//++ НЕ УТКА
		|	0                                                            КАК Порядок,
		|	ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка)    КАК ОперацияРодитель,
		//-- НЕ УТКА
		|	ЛОЖЬ                                                         КАК Вспомогательный
		|
		|ИЗ
		|	Справочник.РесурсныеСпецификации.Трудозатраты КАК Трудозатраты
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИзделия КАК ОсновноеВыходноеИзделие
		|		ПО Трудозатраты.Ссылка = ОсновноеВыходноеИзделие.Спецификация
		|			И ОсновноеВыходноеИзделие.ЭтоОсновноеИзделие
		|
		//++ НЕ УТКА
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборПоСвойствам КАК ВТОтборПоСвойствам
		|		ПО Трудозатраты.КлючСвязи = ВТОтборПоСвойствам.КлючСвязи
		|			И ОсновноеВыходноеИзделие.Идентификатор = ВТОтборПоСвойствам.Идентификатор
		//-- НЕ УТКА
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативнаяДлительностьЭтаповПроизводства КАК НормативнаяДлительностьЭтапов
		|		ПО НормативнаяДлительностьЭтапов.Этап = Трудозатраты.Этап
		|
		//++ НЕ УТКА
		|ГДЕ
		|	ЕСТЬNULL(ВТОтборПоСвойствам.Используется, ИСТИНА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВтТехнологическиеПроцессы.Идентификатор         КАК Идентификатор,
		|	Трудозатраты.НомерСтроки                        КАК НомерСтроки,
		|	Трудозатраты.ВидРабот                           КАК ВидРабот,
		#Вставка
		// Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 +
		|	Трудозатраты.ВидРабот.бит_ПроцентВыполненияОперации КАК бит_ПроцентВыполненияОперации,
        // Первыйбит ЛТ5.44 ЛапшовГ "GVLapshov@1cbit.ru" 21.08.2025 -
		#КонецВставки
		|	Трудозатраты.ВидРабот.ЕдиницаИзмерения          КАК ЕдиницаИзмерения,
		|	ОсновноеВыходноеИзделие.Количество              КАК КоличествоИзделие,
		|	Трудозатраты.СтатьяКалькуляции                  КАК СтатьяКалькуляции,
		|	Трудозатраты.НазначениеРабот                    КАК НазначениеРабот,
		|
		|	Трудозатраты.Количество * ВтТехнологическиеПроцессы.Коэффициент КАК Количество,
		|	Трудозатраты.Количество * ВтТехнологическиеПроцессы.Коэффициент КАК КоличествоНаЕдиницуПартииВыпуска,
		|
		|	ВЫБОР ВтТехнологическиеПроцессы.Спецификация.ТипПроизводственногоПроцесса
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейОтНачала, 0)
		|		ИНАЧЕ - ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейДоОкончания, 0)
		|	КОНЕЦ КАК ДнейОтПотребности,
		|
		|	ВтТехнологическиеПроцессы.Этап                               КАК Этап,
		|	Трудозатраты.Операция                                        КАК Операция,
		|
		|	ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьВДнях, 0) КАК ДлительностьЭтапаВДнях,
		|
		|	ВтТехнологическиеПроцессы.Этап.ДлительностьЭтапа             КАК ДлительностьЭтапа,
		|	ВтТехнологическиеПроцессы.Этап.Подразделение                 КАК ПодразделениеЭтапа,
		|
		|	// расчет по формуле:
		|	ВЫБОР
		|		КОГДА &ИспользоватьПараметризацию
		|			ТОГДА Трудозатраты.АлгоритмРасчетаКоличества
		|		ИНАЧЕ """" 
		|	КОНЕЦ                                                        КАК АлгоритмРасчетаКоличества,
		|	ПРЕДСТАВЛЕНИЕ("""")                                          КАК Формула,
		|	ПРЕДСТАВЛЕНИЕ("""")                                          КАК ФормулаОшибкаРасчета,
		|
		|	Трудозатраты.КлючСвязи КАК КлючСвязи,
		|
		|	100000 * ВтТехнологическиеПроцессы.НомерЭтапа + ВтТехнологическиеПроцессы.НомерОперации  КАК Порядок,
		|	ВтТехнологическиеПроцессы.Операция                                                       КАК ОперацияРодитель,
		|
		|	ИСТИНА                                                       КАК Вспомогательный
		|
		|ИЗ
		|	ВтТехнологическиеПроцессы КАК ВтТехнологическиеПроцессы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеПроцессы.Трудозатраты КАК Трудозатраты
		|		ПО Трудозатраты.Ссылка = ВтТехнологическиеПроцессы.ТехнологическийПроцесс
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИзделия КАК ОсновноеВыходноеИзделие
		|		ПО ВтТехнологическиеПроцессы.Идентификатор = ОсновноеВыходноеИзделие.Идентификатор
		|			И ВтТехнологическиеПроцессы.Спецификация = ОсновноеВыходноеИзделие.Спецификация
		|			И ОсновноеВыходноеИзделие.ЭтоОсновноеИзделие
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборПоСвойствам КАК ВТОтборПоСвойствам
		|		ПО Трудозатраты.КлючСвязи = ВТОтборПоСвойствам.КлючСвязи
		|			И ВтТехнологическиеПроцессы.Идентификатор = ВТОтборПоСвойствам.Идентификатор
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативнаяДлительностьЭтаповПроизводства КАК НормативнаяДлительностьЭтапов
		|		ПО НормативнаяДлительностьЭтапов.Этап = ВтТехнологическиеПроцессы.Этап
		|
		|ГДЕ
		|	ЕСТЬNULL(ВТОтборПоСвойствам.Используется, ИСТИНА)
		|
		//-- НЕ УТКА
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор,
		//++ НЕ УТКА
		|	Порядок,
		//-- НЕ УТКА
		|	НомерСтроки
		|";

		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "Трудозатраты");

	КонецЕсли;

	#КонецОбласти

	//++ НЕ УТКА

	#Область ВидыРабочихЦентров

	Если ПереченьДанных.Найти("ВидыРабочихЦентров") <> Неопределено Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ВидыРабочихЦентров_Представления,
		|	ОсновноеВыходноеИзделие.Идентификатор           КАК Идентификатор,
		|	ТабличнаяЧасть.ВидРабочегоЦентра                КАК ВидРабочегоЦентра,
		|	ТабличнаяЧасть.КлючСвязи                        КАК КлючСвязи,
		|	ОсновноеВыходноеИзделие.Количество              КАК КоличествоИзделие,
		|
		|	ВТВремяРаботы.ВремяРаботы                       КАК ВремяРаботы,
		|	ВТВремяРаботы.ВремяРаботы                       КАК ВремяРаботыНаЕдиницуПартииВыпуска,
		|	ВТВремяРаботы.ЕдиницаИзмерения                  КАК ЕдиницаИзмерения,
		|	ВТВремяРаботы.РассчитатьЗанятость               КАК РассчитатьЗанятость,
		|	0                                               КАК Занятость,
		|	0                                               КАК ЗанятостьНаЕдиницуПартииВыпуска,
		|
		|	ТабличнаяЧасть.ВариантНаладки                   КАК ВариантНаладки,
		|	ТабличнаяЧасть.Загрузка                         КАК Загрузка,
		|	ТабличнаяЧасть.Загрузка                         КАК ЗагрузкаНаЕдиницуПартииВыпуска,
		|	ЭтапыПроизводства.ДлительностьЭтапа             КАК ДлительностьЭтапа,
		|
		|	ТабличнаяЧасть.ВидРабочегоЦентра.ПараллельнаяЗагрузка КАК ПараллельнаяЗагрузка,
		|	ТабличнаяЧасть.ВидРабочегоЦентра.МаксимальнаяЗагрузка КАК МаксимальнаяЗагрузка,
		|
		|	ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДлительностьВДнях, 0) КАК ДлительностьЭтапаВДнях,
		|
		|	ВЫБОР РесурсныеСпецификации.ТипПроизводственногоПроцесса
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПроизводственныхПроцессов.Разборка)
		|			ТОГДА ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейОтНачала, 0)
		|		ИНАЧЕ - ЕСТЬNULL(НормативнаяДлительностьЭтапов.ДнейДоОкончания, 0)
		|	КОНЕЦ                                                        КАК ДнейОтПотребности,
		|
		// расчет по формуле:
		|	ВЫБОР
		|		КОГДА &ИспользоватьПараметризацию
		|			ТОГДА ТабличнаяЧасть.АлгоритмРасчетаКоличества
		|		ИНАЧЕ """" 
		|	КОНЕЦ                                                                   КАК АлгоритмРасчетаКоличества,
		|	ПРЕДСТАВЛЕНИЕ("""")                                                     КАК Формула,
		|	ПРЕДСТАВЛЕНИЕ("""")                                                     КАК ФормулаОшибкаРасчета,
		|
		|	ЭтапыПроизводства.Ссылка                                                КАК Этап,
		|	ЭтапыПроизводства.Подразделение                                         КАК ПодразделениеЭтапа,
		|	ЭтапыПроизводства.ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий КАК ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства.ВидыРабочихЦентров КАК ТабличнаяЧасть
		|		ПО ТабличнаяЧасть.Ссылка = ЭтапыПроизводства.Ссылка
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИзделия КАК ОсновноеВыходноеИзделие
		|		ПО ЭтапыПроизводства.Владелец = ОсновноеВыходноеИзделие.Спецификация
		|			И ОсновноеВыходноеИзделие.ЭтоОсновноеИзделие
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВремяРаботыВидовРабочихЦентров КАК ВТВремяРаботы
		|		ПО ТабличнаяЧасть.Ссылка = ВТВремяРаботы.Этап
		|			И ТабличнаяЧасть.ВидРабочегоЦентра = ВТВремяРаботы.ВидРабочегоЦентра
		|			И ТабличнаяЧасть.КлючСвязи = ВТВремяРаботы.КлючСвязи
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|		ПО РесурсныеСпецификации.Ссылка = ЭтапыПроизводства.Владелец
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборПоСвойствам КАК ВТОтборПоСвойствам
		|		ПО ТабличнаяЧасть.КлючСвязи = ВТОтборПоСвойствам.КлючСвязи
		|			И ОсновноеВыходноеИзделие.Идентификатор = ВТОтборПоСвойствам.Идентификатор
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативнаяДлительностьЭтаповПроизводства КАК НормативнаяДлительностьЭтапов
		|		ПО НормативнаяДлительностьЭтапов.Этап = ЭтапыПроизводства.Ссылка
		|
		|ГДЕ
		|	НЕ ЭтапыПроизводства.ПометкаУдаления
		|	И ЕСТЬNULL(ВТОтборПоСвойствам.Используется, ИСТИНА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор, ТабличнаяЧасть.НомерСтроки";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВидыРабочихЦентров");

	КонецЕсли;

	#КонецОбласти

	#Область АльтернативныеВидыРабочихЦентров

	Если ПереченьДанных.Найти("АльтернативныеВидыРабочихЦентров") <> Неопределено Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВтДанныеПоНоменклатуре.Идентификатор                     КАК Идентификатор,
		|	ТабличнаяЧастьАльтернативные.ВидРабочегоЦентра           КАК ВидРабочегоЦентра,
		|	ТабличнаяЧастьАльтернативные.КлючСвязиВидыРабочихЦентров КАК КлючСвязиВидыРабочихЦентров,
		|
		|	ВТВремяРаботы.ВремяРаботы                                КАК ВремяРаботы,
		|	ВТВремяРаботы.ВремяРаботы                                КАК ВремяРаботыНаЕдиницуПартииВыпуска,
		|	ВТВремяРаботы.ЕдиницаИзмерения                           КАК ЕдиницаИзмерения,
		|
		|	ТабличнаяЧастьАльтернативные.ВариантНаладки              КАК ВариантНаладки,
		|	ТабличнаяЧастьАльтернативные.Загрузка                    КАК Загрузка,
		|	ТабличнаяЧастьАльтернативные.Загрузка                    КАК ЗагрузкаНаЕдиницуПартииВыпуска,
		|	ТабличнаяЧасть.ВидРабочегоЦентра                         КАК ОсновнойВидРабочегоЦентра,
		|
		|	ТабличнаяЧастьАльтернативные.ВидРабочегоЦентра.ПараллельнаяЗагрузка КАК ПараллельнаяЗагрузка,
		|	ТабличнаяЧастьАльтернативные.ВидРабочегоЦентра.МаксимальнаяЗагрузка КАК МаксимальнаяЗагрузка,
		|
		// расчет по формуле:
		|	ВЫБОР
		|		КОГДА &ИспользоватьПараметризацию
		|			ТОГДА ТабличнаяЧастьАльтернативные.АлгоритмРасчетаКоличества
		|		ИНАЧЕ """" 
		|	КОНЕЦ                                                                   КАК АлгоритмРасчетаКоличества,
		|	ПРЕДСТАВЛЕНИЕ("""")                                                     КАК Формула,
		|	ПРЕДСТАВЛЕНИЕ("""")                                                     КАК ФормулаОшибкаРасчета,
		|
		|	ЭтапыПроизводства.Ссылка                                                КАК Этап,
		|	ЭтапыПроизводства.Подразделение                                         КАК ПодразделениеЭтапа,
		|	ЭтапыПроизводства.ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий КАК ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий
		|ИЗ
		|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства.ВидыРабочихЦентров КАК ТабличнаяЧасть
		|		ПО ЭтапыПроизводства.Ссылка = ТабличнаяЧасть.Ссылка
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства.АльтернативныеВидыРабочихЦентров КАК ТабличнаяЧастьАльтернативные
		|		ПО ТабличнаяЧасть.Ссылка = ТабличнаяЧастьАльтернативные.Ссылка
		|			И ТабличнаяЧасть.КлючСвязи = ТабличнаяЧастьАльтернативные.КлючСвязиВидыРабочихЦентров
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
		|		ПО ЭтапыПроизводства.Владелец = ВтДанныеПоНоменклатуре.Спецификация
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВремяРаботыВидовРабочихЦентров КАК ВТВремяРаботы
		|		ПО ТабличнаяЧастьАльтернативные.Ссылка = ВТВремяРаботы.Этап
		|			И ТабличнаяЧастьАльтернативные.ВидРабочегоЦентра = ВТВремяРаботы.ВидРабочегоЦентра
		|			И ТабличнаяЧастьАльтернативные.КлючСвязи = ВТВремяРаботы.КлючСвязи
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборПоСвойствам КАК ВТОтборПоСвойствам
		|		ПО ТабличнаяЧасть.КлючСвязи = ВТОтборПоСвойствам.КлючСвязи
		|			И ВтДанныеПоНоменклатуре.Идентификатор = ВТОтборПоСвойствам.Идентификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборПоСвойствам КАК ВТОтборПоСвойствамАльтернативные
		|		ПО ТабличнаяЧастьАльтернативные.КлючСвязи = ВТОтборПоСвойствамАльтернативные.КлючСвязи
		|			И ВтДанныеПоНоменклатуре.Идентификатор = ВТОтборПоСвойствамАльтернативные.Идентификатор
		|
		|ГДЕ
		|	НЕ ЭтапыПроизводства.ПометкаУдаления
		|	И ЕСТЬNULL(ВТОтборПоСвойствам.Используется, ИСТИНА)
		|	И ЕСТЬNULL(ВТОтборПоСвойствамАльтернативные.Используется, ИСТИНА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор, ТабличнаяЧасть.НомерСтроки";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "АльтернативныеВидыРабочихЦентров");

	КонецЕсли;

	#КонецОбласти

	#Область ТехнологическиеОперации

	Если ПереченьДанных.Найти("Операции") <> Неопределено Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВтДанныеПоНоменклатуре.Идентификатор          КАК Идентификатор,
		|
		|	Операции.Ссылка                 КАК Операция,
		|	Операции.Представление          КАК ОперацияПредставление,
		|	Операции.Идентификатор          КАК ОперацияИдентификатор,
		|	Операции.ВидОперации            КАК ВидОперации,
		|	Операции.ЕдиницаИзмерения       КАК ЕдиницаИзмерения,
		|	Операции.Загрузка               КАК Загрузка,
		|	Операции.Непрерывная            КАК Непрерывная,
		|	Операции.МожноПовторить         КАК МожноПовторить,
		|	Операции.МожноПропустить        КАК МожноПропустить,
		|	Операции.Контроль               КАК Контроль,
		|
		|	Операции.РабочийЦентр      КАК РабочийЦентр,
		|	Операции.ВариантНаладки    КАК ВариантНаладки,
		|	Операции.ВремяШтучное      КАК ВремяШтучное,
		|	Операции.ВремяШтучноеЕдИзм КАК ВремяШтучноеЕдИзм,
		|	Операции.ВремяПЗ           КАК ВремяПЗ,
		|	Операции.ВремяПЗЕдИзм      КАК ВремяПЗЕдИзм,
		|
		|	Операции.НомерОперации                  КАК ИсходныйНомерОперации,
		|	Операции.НомерСледующейОперации         КАК ИсходныйНомерСледующейОперации,
		|
		|	Операции.Количество                     КАК Количество,
		|
		|	Операции.ТехнологическийПроцесс         КАК ТехнологическийПроцесс,
		|	1                                       КАК КоэффициентТехнологическогоПроцесса,
		|	Операции.СодержитТехнологическийПроцесс КАК СодержитТехнологическийПроцесс,
		|	Операции.СодержитТехнологическийПроцесс КАК СодержитВложенныйМаршрут,
		|
		|	ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка)               КАК ОперацияРодитель,
		|	0                                                                       КАК ОперацияРодительИдентификатор,
		|	ВЫРАЗИТЬ(Операции.Владелец КАК Справочник.ЭтапыПроизводства)            КАК Этап,
		|	ВЫРАЗИТЬ(Операции.Владелец КАК Справочник.ЭтапыПроизводства).НомерЭтапа КАК НомерЭтапа
		|
		|ПОМЕСТИТЬ ВтОперации
		|
		|ИЗ
		|	Справочник.ТехнологическиеОперации КАК Операции
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
		|		ПО Операции.Спецификация = ВтДанныеПоНоменклатуре.Спецификация
		|			И НЕ Операции.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВтДанныеПоНоменклатуре.Идентификатор          КАК Идентификатор,
		|
		|	ОперацииТП.Ссылка                 КАК Операция,
		|	ОперацииТП.Представление          КАК ОперацияПредставление,
		|	ОперацииТП.Идентификатор          КАК ОперацияИдентификатор,
		|	ОперацииТП.ВидОперации            КАК ВидОперации,
		|	ОперацииТП.ЕдиницаИзмерения       КАК ЕдиницаИзмерения,
		|	ОперацииТП.Загрузка               КАК Загрузка,
		|	ОперацииТП.Непрерывная            КАК Непрерывная,
		|	ОперацииТП.МожноПовторить         КАК МожноПовторить,
		|	ОперацииТП.МожноПропустить        КАК МожноПропустить,
		|	ОперацииТП.Контроль               КАК Контроль,
		|
		|	ОперацииТП.РабочийЦентр      КАК РабочийЦентр,
		|	ОперацииТП.ВариантНаладки    КАК ВариантНаладки,
		|	ОперацииТП.ВремяШтучное      КАК ВремяШтучное,
		|	ОперацииТП.ВремяШтучноеЕдИзм КАК ВремяШтучноеЕдИзм,
		|	ОперацииТП.ВремяПЗ           КАК ВремяПЗ,
		|	ОперацииТП.ВремяПЗЕдИзм      КАК ВремяПЗЕдИзм,
		|
		|	ОперацииТП.НомерОперации          КАК ИсходныйНомерОперации,
		|	ОперацииТП.НомерСледующейОперации КАК ИсходныйНомерСледующейОперации,
		|
		|	ОперацииТП.Количество             КАК Количество,
		|
		|	Операции.ТехнологическийПроцесс              КАК ТехнологическийПроцесс,
		|	Операции.КоэффициентТехнологическогоПроцесса КАК КоэффициентТехнологическогоПроцесса,
		|	ЛОЖЬ                                         КАК СодержитТехнологическийПроцесс,
		|	ЛОЖЬ                                         КАК СодержитВложенныйМаршрут,
		|
		|	Операции.Ссылка                                                         КАК ОперацияРодитель,
		|	Операции.Идентификатор                                                  КАК ОперацияРодительИдентификатор,
		|	ВЫРАЗИТЬ(Операции.Владелец КАК Справочник.ЭтапыПроизводства)            КАК Этап,
		|	ВЫРАЗИТЬ(Операции.Владелец КАК Справочник.ЭтапыПроизводства).НомерЭтапа КАК НомерЭтапа
		|
		|ИЗ
		|	Справочник.ТехнологическиеОперации КАК Операции
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
		|		ПО Операции.Спецификация = ВтДанныеПоНоменклатуре.Спецификация
		|			И НЕ Операции.ПометкаУдаления
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ОперацииТП
		|		ПО Операции.СодержитТехнологическийПроцесс
		|			И Операции.ТехнологическийПроцесс = ОперацииТП.Владелец
		|			И НЕ ОперацииТП.ПометкаУдаления
		|
		|";
		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ВтОперации");

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Операции.Идентификатор          КАК Идентификатор,
		|
		|	Операции.Операция               КАК Операция,
		|	Операции.Операция.Представление КАК ОперацияПредставление,
		|	Операции.ОперацияИдентификатор  КАК ОперацияИдентификатор,
		|	Операции.ВидОперации            КАК ВидОперации,
		|	Операции.ЕдиницаИзмерения       КАК ЕдиницаИзмерения,
		|	Операции.Загрузка               КАК Загрузка,
		|	Операции.Непрерывная            КАК Непрерывная,
		|	Операции.МожноПовторить         КАК МожноПовторить,
		|	Операции.МожноПропустить        КАК МожноПропустить,
		|	Операции.Контроль               КАК Контроль,
		|
		|	Операции.ИсходныйНомерОперации          КАК ИсходныйНомерОперации,
		|	Операции.ИсходныйНомерСледующейОперации КАК ИсходныйНомерСледующейОперации,
		|
		|	Операции.Количество                     КАК Количество,
		|
		|	Операции.ТехнологическийПроцесс              КАК ТехнологическийПроцесс,
		|	Операции.КоэффициентТехнологическогоПроцесса КАК КоэффициентТехнологическогоПроцесса,
		|	Операции.СодержитТехнологическийПроцесс      КАК СодержитТехнологическийПроцесс,
		|	Операции.СодержитВложенныйМаршрут            КАК СодержитВложенныйМаршрут,
		|
		|	Операции.ОперацияРодитель              КАК ОперацияРодитель,
		|	Операции.ОперацияРодительИдентификатор КАК ОперацияРодительИдентификатор,
		|	Операции.Этап                          КАК Этап,
		|	Операции.НомерЭтапа                    КАК НомерЭтапа,
		|
		|	0                                   КАК ИдентификаторОперации,
		|	0                                   КАК НомерОперации,
		|	0                                   КАК НомерСледующейОперации,
		|	Операции.ВариантНаладки             КАК ВариантНаладки,
		|	&ПустойКлючСвязи                    КАК КлючСвязи,
		|	&ПустойКлючСвязи                    КАК КлючСвязиРодитель,
		|
		|	&ТекстРеквизитыИсполнителяОперации,
		|	&ТекстРеквизитыРасчетаВремениВыполненияОперации
		|
		|ИЗ
		|	ВтОперации КАК Операции
		|
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор,
		|	НомерЭтапа,
		|	ОперацияРодитель <> ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка),
		|	ИсходныйНомерОперации
		|";

		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстРеквизитыИсполнителяОперации",
		Справочники.ТехнологическиеОперации.ТекстЗапросаРеквизитыИсполнителяОперации("Операции"));

		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстРеквизитыРасчетаВремениВыполненияОперации",
		Справочники.ТехнологическиеОперации.ТекстЗапросаРеквизитыРасчетаВремениВыполненияОперации("Операции"));

		ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "Операции");

	КонецЕсли;

	#КонецОбласти

	//-- НЕ УТКА

	#Область ДанныеУпаковок

	ОписаниеТаблиц = Новый Массив;
	ОписаниеТаблиц.Добавить("ВтИзделия");
	Если ПереченьДанных.Найти("МатериалыИУслуги") <> Неопределено Тогда
		ОписаниеТаблицы = УправлениеДаннымиОбИзделиях.ОписаниеТаблицыТекстаЗапросаДанныеУпаковок();
		ОписаниеТаблицы.ИмяТаблицы = "Справочник.РесурсныеСпецификации.МатериалыИУслуги";
		ОписаниеТаблицы.ТекстСоединения = "
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеПоНоменклатуре КАК ВтДанныеПоНоменклатуре
		|		ПО Т.Ссылка = ВтДанныеПоНоменклатуре.Спецификация";
		ОписаниеТаблиц.Добавить(ОписаниеТаблицы);
		//++ НЕ УТКА
		ОписаниеТаблицы = УправлениеДаннымиОбИзделиях.ОписаниеТаблицыТекстаЗапросаДанныеУпаковок();
		ОписаниеТаблицы.ИмяТаблицы = "Справочник.ТехнологическиеПроцессы.МатериалыИУслуги";
		ОписаниеТаблицы.ТекстСоединения = "
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТехнологическиеПроцессы КАК ВтТехнологическиеПроцессы
		|		ПО Т.Ссылка = ВтТехнологическиеПроцессы.ТехнологическийПроцесс";
		ОписаниеТаблиц.Добавить(ОписаниеТаблицы);
		//-- НЕ УТКА
	КонецЕсли;

	ТекстЗапроса = УправлениеДаннымиОбИзделиях.ТекстЗапросаДанныеУпаковок(ОписаниеТаблиц);

	ТекстыЗапроса.Добавить(ТекстЗапроса + РазделительЗапросовВПакете, "ДанныеУпаковок");

	#КонецОбласти

	Для каждого Элемент Из ТекстыЗапроса Цикл
		ДобавитьПредставленияВЗапрос(Элемент.Значение, ПараметрыВыборки.ПолучитьПредставления);
		Если ПараметрыВыборки.СпособРасчетаМатериалов <> Перечисления.СпособыРасчетаМатериалов.МинимальноеПотребление Тогда
			Элемент.Значение = СтрЗаменить(Элемент.Значение,
			"НормативнаяДлительностьЭтапов.ДнейОтНачала",
			"НормативнаяДлительностьЭтапов.ДнейОтНачалаМакс");
			Элемент.Значение = СтрЗаменить(Элемент.Значение,
			"НормативнаяДлительностьЭтапов.ДнейДоОкончания",
			"НормативнаяДлительностьЭтапов.ДнейДоОкончанияМакс");
		КонецЕсли;
	КонецЦикла;

	Запрос.УстановитьПараметр("УчитыватьВероятностьБрака",  ПараметрыВыборки.УчитыватьВероятностьБрака);
	Запрос.УстановитьПараметр("СпособРасчетаМатериалов", ПараметрыВыборки.СпособРасчетаМатериалов);
	Запрос.УстановитьПараметр("ОкруглятьКоличествоШтучныхТоваров", ПараметрыВыборки.ОкруглятьКоличествоШтучныхТоваров);

	Запрос.УстановитьПараметр("СкладПоУмолчанию", Справочники.Склады.СкладПоУмолчанию());

	ИспользоватьПараметризацию = ПолучитьФункциональнуюОпцию("ИспользоватьПараметризациюРесурсныхСпецификаций");
	ОтключитьРасчетПараметрическихФормул = Ложь;
	Если ПараметрыВыборки.Свойство("ОтключитьРасчетПараметрическихФормул", ОтключитьРасчетПараметрическихФормул)
		И ОтключитьРасчетПараметрическихФормул Тогда
		ИспользоватьПараметризацию = Ложь;
	КонецЕсли;
	Запрос.УстановитьПараметр("ИспользоватьПараметризацию", ИспользоватьПараметризацию);

	//++ НЕ УТКА
	Запрос.УстановитьПараметр("ИспользоватьТехнологическиеПроцессы", ПолучитьФункциональнуюОпцию("ИспользоватьТехнологическиеПроцессы"));
	//-- НЕ УТКА

	Если ПараметрыВыборки.Свойство("ПереопределениеНастройкиПартииВыпуска")
		И ПараметрыВыборки.ПереопределениеНастройкиПартииВыпуска.Использовать Тогда
		Запрос.УстановитьПараметр("ПереопределятьНастройкуПартииВыпуска", Истина);
		Запрос.УстановитьПараметр("ВыпускПроизвольнымиПорциями", ПараметрыВыборки.ПереопределениеНастройкиПартииВыпуска.ВыпускПроизвольнымиПорциями);
	Иначе
		Запрос.УстановитьПараметр("ПереопределятьНастройкуПартииВыпуска", Ложь);
		Запрос.УстановитьПараметр("ВыпускПроизвольнымиПорциями", Ложь);
	КонецЕсли;

	Запрос.УстановитьПараметр("ДоступноОписаниеПартииВыпуска", УправлениеДаннымиОбИзделиях.ДоступноОписаниеПартииВыпуска());
	Запрос.УстановитьПараметр("ВидЦены", ПроизводствоСерверПовтИсп.ВидЦеныПлановойСтоимости());
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Валюта", ПроизводствоСерверПовтИсп.ВалютаПлановойСебестоимостиПродукции());
	Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());
	Запрос.УстановитьПараметр("ТипСтрокиМатериал", ТипСтрокиМатериал());
	Запрос.УстановитьПараметр("ТипСтрокиПолуфабрикат", ТипСтрокиПолуфабрикат());
	Запрос.УстановитьПараметр("ТипСтрокиПромежуточныйПолуфабрикат", ТипСтрокиПромежуточныйПолуфабрикат());
	Запрос.УстановитьПараметр("ТипСтрокиВходящееИзделие", ТипСтрокиВходящееИзделие());
	Запрос.УстановитьПараметр("ТипСтрокиПобочныйВыход", ТипСтрокиПобочныйВыход());
	//++ НЕ УТКА
	Запрос.УстановитьПараметр("КлючСвязиНоменклатура", УправлениеДаннымиОбИзделияхКлиентСервер.ОтборПоСвойствамКлючСвязиПредопределенный("Номенклатура"));
	Запрос.УстановитьПараметр("КлючСвязиХарактеристика", УправлениеДаннымиОбИзделияхКлиентСервер.ОтборПоСвойствамКлючСвязиПредопределенный("Характеристика"));
	Запрос.УстановитьПараметр("ДинамическаяСтруктураЗаказовНаПроизводство",  ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство"));
	//-- НЕ УТКА

	УстановитьПривилегированныйРежим(Истина);
	Таблицы = ОбщегоНазначенияУТ.ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса, , Ложь, Истина);
	УстановитьПривилегированныйРежим(Ложь);

	Результат = Новый Соответствие;

	Для каждого ИмяНабораДанных Из СтрРазделить("ОсновноеИзделие,РеквизитыСпецификации", ",") Цикл
		Таблица = Таблицы[ИмяНабораДанных]; // ТаблицаЗначений
		Таблица.Индексы.Добавить("Идентификатор");
	КонецЦикла;
	Для каждого ИмяНабораДанных Из ПереченьДанных Цикл
		Таблица = Таблицы[ИмяНабораДанных]; // ТаблицаЗначений
		Таблица.Индексы.Добавить("Идентификатор");
	КонецЦикла;

	//++ НЕ УТКА
	ОбработатьНастройкиАвтовыбора(Таблицы, МенеджерВременныхТаблиц, ПараметрыВыборки);
	//-- НЕ УТКА

	ЗаполнитьПараметрыОбеспеченияМатериалов(Запрос, Таблицы, ПараметрыВыборки);

	ЗаполнитьПараметрыОбеспеченияВыходныхИзделий(Запрос, Таблицы, ПараметрыВыборки);

	//++ НЕ УТКА
	#Область ДанныеДляРасчетаПоФормулам

	ОписаниеИсточниковДанныхОперандов = Неопределено;
	ИсточникиЗначенийПараметров       = Неопределено;

	#КонецОбласти
	//-- НЕ УТКА

	УправлениеДаннымиОбИзделиях.ЗаполнитьДанныеУпаковокВНабореДанных(
	Таблицы.ОсновноеИзделие,
	Таблицы.ДанныеУпаковок);

	ОсновноеИзделиеСпецификации  = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковокНаЕдиницуПартииВыпуска,ДанныеУпаковки");
	СтруктураОтбораИдентификатор = Новый Структура("Идентификатор");
	СтруктураУпаковкиПоУмолчанию = УправлениеДаннымиОбИзделияхПовтИсп.СтруктураДанныхУпаковки();

	//++ НЕ УТКА
	ПромежуточныйВыпускКэш = Новый Соответствие;
	//-- НЕ УТКА

	ТаблицаДанныеПоНоменклатуре = Таблицы.ДанныеПоНоменклатуре; // см. СписокНоменклатуры
	Для каждого Строка Из ТаблицаДанныеПоНоменклатуре Цикл

		Идентификатор = Строка.Идентификатор;
		СтруктураОтбораИдентификатор.Идентификатор = Идентификатор;

		СтруктураДанных = ДанныеСпецификацииКонструктор();

		ДанныеШапки = Таблицы.РеквизитыСпецификации.Найти(Идентификатор, "Идентификатор");
		Если ДанныеШапки <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанных, ДанныеШапки);
		КонецЕсли;

		СтрокаНабораДанных = Таблицы.ОсновноеИзделие.Найти(Идентификатор, "Идентификатор");
		Если СтрокаНабораДанных <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанных.ОсновноеИзделие, СтрокаНабораДанных);
			Если НЕ СтруктураДанных.ОсновноеИзделие.ЭтоОсновноеИзделие Тогда
				ОсновноеИзделиеСпецификации.Номенклатура   = СтрокаНабораДанных.ОсновноеИзделиеНоменклатура;
				ОсновноеИзделиеСпецификации.Упаковка       = СтрокаНабораДанных.ОсновноеИзделиеУпаковка;
				ОсновноеИзделиеСпецификации.ДанныеУпаковки = СтруктураУпаковкиПоУмолчанию;
				ОсновноеИзделиеСпецификации.КоличествоУпаковокНаЕдиницуПартииВыпуска =
				СтрокаНабораДанных.ОсновноеИзделиеКоличествоУпаковокНаЕдиницуПартииВыпуска;
				Если ЗначениеЗаполнено(ОсновноеИзделиеСпецификации.Упаковка) Тогда
					УправлениеДаннымиОбИзделиях.ЗаполнитьДанныеУпаковокВСтрокеНабораДанных(
					ОсновноеИзделиеСпецификации, Таблицы.ДанныеУпаковок);
				КонецЕсли;
				УправлениеДаннымиОбИзделиях.ЗаполнитьКоэффициентПересчетаВОсновноеИзделие(
				СтруктураДанных.ОсновноеИзделие, ОсновноеИзделиеСпецификации);
			КонецЕсли;
		КонецЕсли;

		Для каждого ИмяНабораДанных Из ПереченьДанных Цикл

			НаборДанных = Таблицы[ИмяНабораДанных].Скопировать(СтруктураОтбораИдентификатор);

			Если ИмяНабораДанных = "МатериалыИУслуги" Тогда
				УправлениеДаннымиОбИзделиях.ЗаполнитьДанныеУпаковокВНабореДанных(
				НаборДанных,
				Таблицы.ДанныеУпаковок);
				ПрименитьОтборПоПараметрамВыбораДанных(
				НаборДанных,
				ПараметрыВыборки);
				ЗаполнитьИнформациюПоПрименениюМатериала(
				НаборДанных,
				ПараметрыВыборки);
				ВключитьДанныеНаборовВСтруктуруДанныхСпецификации(
				СтруктураДанных,
				Таблицы,
				ПараметрыВыборки,
				СтруктураОтбораИдентификатор);
			ИначеЕсли ИмяНабораДанных = "ВходящиеИзделия" Тогда
				УправлениеДаннымиОбИзделиях.ЗаполнитьДанныеУпаковокВНабореДанных(
				НаборДанных,
				Таблицы.ДанныеУпаковок);
			ИначеЕсли ИмяНабораДанных = "ВыходныеИзделия" Тогда
				УправлениеДаннымиОбИзделиях.ЗаполнитьДанныеУпаковокВНабореДанных(
				НаборДанных,
				Таблицы.ДанныеУпаковок);
			ИначеЕсли ИмяНабораДанных = "ВозвратныеОтходы" Тогда
				УправлениеДаннымиОбИзделиях.ЗаполнитьДанныеУпаковокВНабореДанных(
				НаборДанных,
				Таблицы.ДанныеУпаковок);
				//++ НЕ УТКА
			ИначеЕсли ИмяНабораДанных = "Операции" Тогда
				ПодготовитьТаблицуОпераций(НаборДанных);
				//-- НЕ УТКА
			КонецЕсли;

			СтруктураДанных.Вставить(ИмяНабораДанных, НаборДанных);

		КонецЦикла;

		//++ НЕ УТКА
		ОбработатьДанныеТехнологическихПроцессов(СтруктураДанных);

		ПодготовитьПараметрыДляРасчетаПоФормулам(
		Строка,
		СтруктураДанных,
		Таблицы,
		ОписаниеИсточниковДанныхОперандов,
		ПереченьДанных,
		ИсточникиЗначенийПараметров);
		//-- НЕ УТКА

		Результат.Вставить(Идентификатор, СтруктураДанных);

	КонецЦикла;

	//++ НЕ УТКА
	УправлениеДаннымиОбИзделиях.ЗаполнитьЗначенияПараметровДляРасчетаПоФормулам(ИсточникиЗначенийПараметров);
	//-- НЕ УТКА

	Если СписокТаблицДляУдаления.Количество() > 0 Тогда
		ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц, СтрСоединить(СписокТаблицДляУдаления,","));
	КонецЕсли;

	//++ НЕ УТКА
	Если ПараметрыВыборки.ОбъединитьМатериалыИВходящиеИзделия И Таблицы.Свойство("МатериалыИУслуги") Тогда
		ОбъединитьМатериалыИВходящиеИзделия(Результат, Таблицы);
	КонецЕсли;
	//-- НЕ УТКА

	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ВесЗамера);

	Возврат Результат;

КонецФункции

#КонецЕсли
