
&После("ПередЗаписью")
Процедура бит_ПередЗаписью(Отказ)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.2] [ASHolyavko@1cbit.ru] [11.06.2025] +        
	
	Если (ЭтоНовый() или ЭтотОбъект.бит_Вариант = 0) и НЕ ЭтоГруппа Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РесурсныеСпецификации.бит_Вариант КАК бит_Вариант
		|ИЗ
		|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|ГДЕ
		|	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура = &ОсновноеИзделиеНоменклатура
		|	И РесурсныеСпецификации.Ссылка <> &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_Вариант УБЫВ";
		
		Запрос.УстановитьПараметр("ОсновноеИзделиеНоменклатура", ЭтотОбъект.ОсновноеИзделиеНоменклатура);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			ЭтотОбъект.бит_Вариант = 1;
			
		Иначе
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.бит_Вариант = 9999 Тогда
					Отказ = Истина;
					СообщениеПользователю = Новый СообщениеПользователю;
					СообщениеПользователю.Текст = "Достигнуто максимальное значение вариантов 9999!";
					СообщениеПользователю.Сообщить();
				Иначе	
					ЭтотОбъект.бит_Вариант = ВыборкаДетальныеЗаписи.бит_Вариант + 1;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.2] [ASHolyavko@1cbit.ru] [11.06.2025] -
	
КонецПроцедуры
