
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'Команда не может быть выполнена для указанного объекта.';
									|en = 'Cannot execute the command for the object.'"));
		
		Возврат;
	КонецЕсли;	
		
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("НастройкиСервиса", ТекущиеДанные.Ссылка);

	ОбменССервисомBankFeedsКлиент.ПроверитьПодключениеСервиса(ПараметрыЗаполнения, ЭтотОбъект);	
	
КонецПроцедуры

#КонецОбласти
