
#Область ОписаниеПеременных

&НаКлиенте
Перем мКэшРеквизитовФормы; // Хранит текущие значения реквизитов формы.

#КонецОбласти  

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	 	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		
		СтруктураЗаполнения = Параметры.ЗначенияЗаполнения; 
		Если ЗначениеЗаполнено(СтруктураЗаполнения) И СтруктураЗаполнения.Свойство("РегистрБухгалтерии") Тогда
			// Установка регистра бухгалтерии.
			Объект.РегистрБухгалтерии = СтруктураЗаполнения.РегистрБухгалтерии;
		КонецЕсли;
		
	КонецЕсли;
	
	фКоличествоСубконтоБУ = 4;
		
	ИзменениеРегистраБухгалтерииСервер(Истина);
	
	Если Параметры.Ключ.Пустая() Тогда
		УстановитьСостояниеДокумента("НезаписанныйДокумент");
	КонецЕсли; 
	ЗаполнитьКэшЗначений();
	ЭтоСемействоБП = бит_ОбщегоНазначения.ЭтоСемействоБП();
	
	УстановитьУсловноеОформление();
	УстановитьВидимостьДоступность();
	
	// Заполнение валюты международного учета.
	ПолучитьВалютуМСФО(Объект.Организация, фИмяРегистраБухгалтерии);
	 		
	// Установка текущей строки движения.	
	бит_БухгалтерскиеОтчетыСервер.УстановитьТекущуюСтрокуТаблицыДвиженийДокумента(Элементы, Параметры);
	
	ЗаголовокПроводкиДоп2 = НСтр("ru = 'Проводки (Журнал проводок (дополнительный 2))';
								 |en = 'Entries (Entries journal(additional 2))'");
	Если бит_ОбщегоНазначения.ЕстьОбъектыМСФО() Тогда
		ЗаголовокПроводкиДоп2 = НСтр("ru = 'Проводки (Журнал проводок (международный))';
									 |en = 'Entries (Entries journal(international))'");
	КонецЕсли;
	Элементы.СтраницаДополнительный_2.Заголовок = ЗаголовокПроводкиДоп2;
	
	УстановитьПараметрыВыбораДляСчетов();
    	
	// Получим дату открытого периода.
	ПолучитьДатуОткрытогоПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	мКэшРеквизитовФормы.Вставить("Дата");
	мКэшРеквизитовФормы.Вставить("РегистрБухгалтерии");
	мКэшРеквизитовФормы.Вставить("Организация");
	мКэшРеквизитовФормы.Вставить("ДатаСторно");
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();	                               
	
	// Если в форме списка есть отбор по регистру бухгалтерии
	// , то нужно закрыть для редактирования соответствующий элемент текущей формы.
	Попытка
		ЕстьОтборПоРегиструБухгалтерии = ЗначениеЗаполнено(ЭтотОбъект.ВладелецФормы.Родитель.РегистрБухгалтерииОтбор);	
	Исключение
	    ЕстьОтборПоРегиструБухгалтерии = Ложь;
	КонецПопытки;
	Если ЕстьОтборПоРегиструБухгалтерии Тогда	
		Элементы.РегистрБухгалтерии.ТолькоПросмотр = Истина;	
	КонецЕсли;
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(ВыбранноеЗначение, "РезультатПолученияДанных") Тогда
		
		Если ВыбранноеЗначение.Режим = "Заполнить" 
			И Объект.Движения[фИмяРегистраБухгалтерии].Количество() > 0 Тогда 
			
			// В режиме заполнения существующие данные следует очистить.
			
            ДопПараметры = Новый Структура;
            ДопПараметры.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
			бит_РаботаСДиалогамиКлиент.ЗапросПодтвержденияОчисткиДанных(ЭтотОбъект, ДопПараметры);
            
        Иначе
            
            ЗаполнитьДвиженияПоВыбраннымДанным(ВыбранноеЗначение, Ложь);
            
		КонецЕсли; // Режим заполнения.	
				
	КонецЕсли;
	       	
КонецПроцедуры
            
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "бит_ПереносОстатков" И Источник = ЭтотОбъект Тогда
		
		ОбработкаПереносОстатков(Параметр);	
		
	КонецЕсли;	
	
	Если ИмяСобытия = "ИзмененСтатус" И Источник = УникальныйИдентификатор Тогда
		ОбработкаОповещенияИзмененияСтатуса();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СсылкаДатаСторно = ТекущийОбъект.ДатаСторно;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодготовитьФормуНаСервере();
	
	Если ЗначениеЗаполнено(Объект.РегистрБухгалтерии) Тогда
		ИмяРегистраБухгалтерии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РегистрБухгалтерии ,"ИмяОбъекта");
		АктивностьДвижений = Истина;
		Если ЗначениеЗаполнено(ИмяРегистраБухгалтерии)
			И Объект.Движения[ИмяРегистраБухгалтерии].Количество() > 0 Тогда
			АктивностьДвижений = Объект.Движения[ИмяРегистраБухгалтерии][0].Активность;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СсылкаДатаСторно = ТекущийОбъект.ДатаСторно;
	
	бит_ВизированиеСервер.ЗаполнитьРеквизитыСтатусаВФорме(ЭтотОбъект, ТекущийОбъект);
	
	АктивностьДвижений = Истина;
	Если ЗначениеЗаполнено(фИмяРегистраБухгалтерии)
		И Объект.Движения[фИмяРегистраБухгалтерии].Количество() > 0 Тогда
		АктивностьДвижений = Объект.Движения[фИмяРегистраБухгалтерии][0].Активность;
	КонецЕсли;
	
	УстановитьСостояниеДокумента();
	УстановитьВидимостьДоступность();
	УстановитьУсловноеОформление();
	
КонецПроцедуры
    
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Объект.ДатаСторно) И Объект.ДатаСторно < фДатаОткрытогоПериода Тогда
		ТекстСообщения = НСтр("ru = 'Дата сторно не может быть меньше даты открытого периода.';
							  |en = 'Date of cancellation can not be less than the date of the open period.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДатаСторно", "Объект.ДатаСторно", Отказ);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_ОперацияУправленческий";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	Открытьформу("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.ДатаСторно) И Объект.Дата > Объект.ДатаСторно Тогда
		ТекстСообщения = НСтр("ru = 'Дата документа не может быть больше даты сторно.';
							  |en = 'Document date can not be later than Reversal date.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Дата", "Объект.Дата");
		Объект.Дата = мКэшРеквизитовФормы.Дата;
	Иначе
		Если ЗначениеЗаполнено(Объект.РегистрБухгалтерии) Тогда
			Для каждого СтрокаТЧ Из Объект.Движения[фИмяРегистраБухгалтерии] Цикл
				Если Не ЗначениеЗаполнено(СтрокаТЧ.ВидПроводки) И СтрокаТЧ.Период <> Объект.ДатаСторно Тогда
					СтрокаТЧ.Период = Объект.Дата;
				КонецЕсли; 
			КонецЦикла;			
			ИзменениеДатыСервер();
			ДобавитьВКэш("Дата");
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ТипПроводокПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаСторно) Тогда
		ТипПроводок = ?(ЗначениеЗаполнено(Объект.ТипПроводок), 
					Объект.ТипПроводок, 
					ПредопределенноеЗначение("Справочник.бит_ТипыПроводок.ПараллельныйУчет"));
		Для каждого СтрокаТЧ Из Объект.Движения[фИмяРегистраБухгалтерии] Цикл
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ВидПроводки) Тогда
				СтрокаТЧ.ТипПроводки = ТипПроводок;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрБухгалтерииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(фКэшЗначений.ВидОбъектаРегистрБухгалтерии);	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов"           , СписокВидовОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы"   , Объект.РегистрБухгалтерии);
	ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", фКэшЗначений.СписокДоступныхРегистров);
	
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);	
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрБухгалтерииПриИзменении(Элемент)
	
	ИзмененРегистрБухгалтерии = Истина;
	СтарыйРегистрБухгалтерии = мКэшРеквизитовФормы.РегистрБухгалтерии;
	
	Если Объект.РегистрБухгалтерии <> СтарыйРегистрБухгалтерии Тогда
		
		Если фИмяРегистраБухгалтерии <> "" И Объект.Движения[фИмяРегистраБухгалтерии].Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Текущие движения документа будут очищены. Продолжить?';
								|en = 'Current document movements will be cleared. Continue?'");
			ОповещениВопрос = Новый ОписаниеОповещения("ВопросРегистрБухгалтерииПриИзменении", ЭтотОбъект, ИзмененРегистрБухгалтерии);			
			ПоказатьВопрос(ОповещениВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);			
		Иначе			
			Если ИзмененРегистрБухгалтерии Тогда					
				ИзменениеРегистраБухгалтерииСервер();
				ДобавитьВКэш("РегистрБухгалтерии");											
			Иначе				
				ИзвлечьИзКэша("РегистрБухгалтерии");				
			КонецЕсли;
		КонецЕсли;
				
	КонецЕсли;	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ВопросРегистрБухгалтерииПриИзменении(Ответ, ИзмененРегистрБухгалтерии) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ИзмененРегистрБухгалтерии = Ложь;
   	КонецЕсли;

	Если ИзмененРегистрБухгалтерии Тогда
					
		ИзменениеРегистраБухгалтерииСервер();
		ДобавитьВКэш("РегистрБухгалтерии");
							
	Иначе
		
		ИзвлечьИзКэша("РегистрБухгалтерии");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РегистрБухгалтерииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура РегистрБухгалтерииОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СтараяОрганизация = мКэшРеквизитовФормы.Организация;
	СтараяВалютаМСФО  = фКэшЗначений.ВалютаМСФО;

	НоваяОрганизация = Объект.Организация;
	НоваяВалютаМСФО  = ПолучитьВалютуМСФО(НоваяОрганизация, фИмяРегистраБухгалтерии);
	                   		
	ИзменитьОрганизацию = Истина;
	ПересчитыватьСуммы 	= Ложь;
	
	Если НоваяОрганизация = СтараяОрганизация Тогда
		Возврат;
	КонецЕсли;
			
	Если ЗначениеЗаполнено(фИмяРегистраБухгалтерии) 
		И Объект.Движения[фИмяРегистраБухгалтерии].Количество() > 0 Тогда
		
		Если фКэшЗначений.ЕстьОбъектыМСФО И фИмяРегистраБухгалтерии = "бит_Дополнительный_2" Тогда
			НоваяВалютаМСФО = ПолучитьВалютуМСФО(НоваяОрганизация, фИмяРегистраБухгалтерии);
			Если НоваяВалютаМСФО <> фКэшЗначений.ВалютаМСФО Тогда
				ПересчитыватьСуммы = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИзменитьОрганизацию", ИзменитьОрганизацию);
		ДопПараметры.Вставить("СтараяВалютаМСФО"   , СтараяВалютаМСФО);
        ДопПараметры.Вставить("НоваяВалютаМСФО"    , НоваяВалютаМСФО);
        ДопПараметры.Вставить("ПересчитыватьСуммы" , ПересчитыватьСуммы);

		ТекстВопроса = НСтр("ru = 'Будут изменены данные табличной части. Продолжить?';
							|en = 'Table data will be changed. Continue?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросОрганизацияПриИзменении", ЭтотОбъект, ДопПараметры);		
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
		
	Иначе
		
		Если ИзменитьОрганизацию Тогда 			
			ДобавитьВКэш("Организация");
			фКэшЗначений.ВалютаМСФО = НоваяВалютаМСФО;
			ИзменениеОрганизацииСервер(ПересчитыватьСуммы, СтараяВалютаМСФО);
		Иначе	
			ИзвлечьИзКэша("Организация");
		КонецЕсли;

	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ВопросОрганизацияПриИзменении(Ответ, ДопПараметры) Экспорт

	ИзменитьОрганизацию = ДопПараметры.ИзменитьОрганизацию;
	СтараяВалютаМСФО    = ДопПараметры.СтараяВалютаМСФО;
    НоваяВалютаМСФО     = ДопПараметры.НоваяВалютаМСФО;
    ПересчитыватьСуммы  = ДопПараметры.ПересчитыватьСуммы;

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ИзменитьОрганизацию = Ложь;			  
	КонецЕсли;

	Если ИзменитьОрганизацию Тогда 			
		ДобавитьВКэш("Организация");
		фКэшЗначений.ВалютаМСФО = НоваяВалютаМСФО;
		ИзменениеОрганизацииСервер(ПересчитыватьСуммы, СтараяВалютаМСФО);
	Иначе	
		ИзвлечьИзКэша("Организация");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДвижения

&НаКлиенте
Процедура ДополнительныйПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТипПроводок = ?(ЗначениеЗаполнено(Объект.ТипПроводок), 
					Объект.ТипПроводок, 
					ПредопределенноеЗначение("Справочник.бит_ТипыПроводок.ПараллельныйУчет"));
					
	ТекущиеДанные = Элементы[Сред(фИмяРегистраБухгалтерии, 5)].ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Период) Тогда
		ТекущиеДанные.Период  = Объект.Дата;
	КонецЕсли; 
	ТекущиеДанные.Организация = Объект.Организация;
    ТекущиеДанные.ТипПроводки = ТипПроводок;
	
	Если Копирование Тогда
		// Для корректной работы механизма закрытого периода.
		ТекущиеДанные.ВидПроводки = Неопределено;
		ТекущиеДанные.ДатаФормирования = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Дополнительный_1ПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Дополнительный_1.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПроводкуНаСторно(ТекущиеДанные, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Дополнительный_2ПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Дополнительный_2.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПроводкуНаСторно(ТекущиеДанные, Отказ);
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ВидПроводки) И Не РазрешеноИзменениеПроводокЗакрытогоПериода(Объект.Ссылка) Тогда
		Отказ=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазрешеноИзменениеПроводокЗакрытогоПериода(ОбъектСсылка)
	Возврат бит_МеханизмДопИзмерений.ПолучитьЗначениеДопАналитики(ОбъектСсылка,
		                                   	ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ОтразитьВЗакрытомПериоде, Ложь);
КонецФункции 

											
&НаКлиенте
Процедура Дополнительный_3ПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Дополнительный_3.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПроводкуНаСторно(ТекущиеДанные, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Дополнительный_4ПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Дополнительный_4.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПроводкуНаСторно(ТекущиеДанные, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Дополнительный_5ПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Дополнительный_5.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПроводкуНаСторно(ТекущиеДанные, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияСчетПриИзменении(Элемент)

	ТекущиеДанные = Элементы[Сред(фИмяРегистраБухгалтерии, 5)].ТекущиеДанные;  	
	
	ИзменениеСчетаТекущейЗаписи(ТекущиеДанные.ПолучитьИдентификатор(), Прав(Элемент.Имя, 2));
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияСубконтоПриИзменении(Элемент)

	ТекущиеДанные = Элементы[Сред(фИмяРегистраБухгалтерии, 5)].ТекущиеДанные;
	
	ИмяСубконто = Прав(Элемент.Имя, 11);
	ЗначениеСубконто  = ТекущиеДанные[ИмяСубконто];
	
	ИзменениеСубконтоБУ(ТекущиеДанные, ЗначениеСубконто, ИмяСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекущиеДанные = Элементы[Сред(фИмяРегистраБухгалтерии, 5)].ТекущиеДанные;
	
	ИмяСубконто       = Прав(Элемент.Имя, 11);	
	ЗначениеСубконто  = ТекущиеДанные[ИмяСубконто];	
	
	НачалоВыбораСубконтоБУ(Элемент, СтандартнаяОбработка, ТекущиеДанные, ЗначениеСубконто, ИмяСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияСубконтоАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	СубконтоБУАвтоПодбор(Элемент, Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияВалютаДтПриИзменении(Элемент)

	ТекущиеДанные = Элементы[Сред(фИмяРегистраБухгалтерии, 5)].ТекущиеДанные;	
		
	ИзменениеВалютыТекущейЗаписи(ТекущиеДанные.ПолучитьИдентификатор(), "Дт");
		
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияВалютаКтПриИзменении(Элемент)

	ТекущиеДанные = Элементы[Сред(фИмяРегистраБухгалтерии, 5)].ТекущиеДанные;
		
	ИзменениеВалютыТекущейЗаписи(ТекущиеДанные.ПолучитьИдентификатор(), "Кт");

КонецПроцедуры

&НаКлиенте
Процедура ДвиженияСуммаМуПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы[Сред(фИмяРегистраБухгалтерии, 5)].ТекущиеДанные;
		
	ИзменениеСуммыТекущейЗаписи(ТекущиеДанные.ПолучитьИдентификатор(), "ИзменениеМУСуммы");
	
КонецПроцедуры
    
&НаКлиенте
Процедура ДвиженияСуммаУпрПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы[Сред(фИмяРегистраБухгалтерии, 5)].ТекущиеДанные;
		
	ИзменениеСуммыТекущейЗаписи(ТекущиеДанные.ПолучитьИдентификатор(), "ИзменениеУпрСуммы");
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияСуммаРеглПриИзменении(Элемент)

	ТекущиеДанные = Элементы[Сред(фИмяРегистраБухгалтерии, 5)].ТекущиеДанные;
		
	ИзменениеСуммыТекущейЗаписи(ТекущиеДанные.ПолучитьИдентификатор(), "ИзменениеРеглСуммы");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура КомандаСохранитьШаблон(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоЗаполнениеИзДокументаОперации", Истина);
	СтруктураПараметров.Вставить("РегистрБухгалтерии"			   , Объект.РегистрБухгалтерии);
	СтруктураПараметров.Вставить("ИмяРегистра"			           , фИмяРегистраБухгалтерии);
	СтруктураПараметров.Вставить("Организация"    				   , Объект.Организация);
	СтруктураПараметров.Вставить("ДатаДок"      			       , Объект.Дата);
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru='Для продолжения необходимо записать документ. Записать?';
							|en='To continue, you must write the document. Record?'");		
		ОповещениеВопрос = Новый ОписаниеОповещения("СохранитьШаблонПродолжение", ЭтотОбъект, СтруктураПараметров);		
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30);		
	Иначе		
		СоздатьШаблонПроводокКлиент(СтруктураПараметров);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьШаблонНовый(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоЗаполнениеИзДокументаОперации", Истина);
	СтруктураПараметров.Вставить("РегистрБухгалтерии"			   , Объект.РегистрБухгалтерии);
	СтруктураПараметров.Вставить("ИмяРегистра"			           , фИмяРегистраБухгалтерии);
	СтруктураПараметров.Вставить("ВидДокумента"                    , ОпределитьРегистрБухгалтерииВидДокумента("ВидДокумента"));
	СтруктураПараметров.Вставить("Организация"    				   , Объект.Организация);
	СтруктураПараметров.Вставить("ДатаДок"      			       , Объект.Дата);
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru='Для продолжения необходимо записать документ. Записать?';
							|en='To continue, you must write the document. Record?'");		
		ОповещениеВопрос = Новый ОписаниеОповещения("СохранитьШаблонНовыйПродолжение", ЭтотОбъект, СтруктураПараметров);		
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30);		
	Иначе		
		СоздатьШаблонПроводокНовыйКлиент(СтруктураПараметров);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоШаблонуДобавить(Команда)
	
	КомандаЗаполнитьПоШаблонуКлиент("Добавить");
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоШаблонуЗагрузить(Команда)
	
	КомандаЗаполнитьПоШаблонуКлиент("Загрузить");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПереключитьАктивность(Команда)
	
	ОчиститьСообщения();
	ПереключитьАктивностьПроводок();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Кнопка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭтоЗаполнениеИзДокументаОперации", Истина);
	ПараметрыФормы.Вставить("ОбъектСистемы"				      , Объект.РегистрБухгалтерии);
	ПараметрыФормы.Вставить("Организация"    				  , Объект.Организация);
	ПараметрыФормы.Вставить("ДатаДок"      			          , Объект.Дата);
	ПараметрыФормы.Вставить("Режим"        				 	  , "Одиночный");
	
	ОткрытьФорму("Обработка.бит_ПолучениеДанныхРегистровБухгалтерии.Форма", ПараметрыФормы, ЭтотОбъект);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьОстатки(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда	
		ТекстСообщения = НСтр("ru='Для заполнения остатков выберете Организацию.';
							  |en='To fill the remnants choose Organization.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);			 
		Возврат;		
	КонецЕсли; 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РегистрПриемник", Объект.РегистрБухгалтерии);
	СтруктураПараметров.Вставить("Организация"	  , Объект.Организация);
	СтруктураПараметров.Вставить("Дата"			  , Объект.Дата);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураПараметров", СтруктураПараметров);
	ПараметрыФормы.Вставить("ЗаполняемыйДокумент", Объект.Ссылка);
	
	ОткрытьФорму("Обработка.бит_ПолучениеОстатковРегистровБухгалтерии.Форма.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСторноПоПравиламТрансляции(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли; 
	
	СтандартныйПериод = Новый СтандартныйПериод(НачалоМесяца(Объект.Дата), КонецМесяца(Объект.Дата));
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = СтандартныйПериод;
	Диалог.Показать(Новый ОписаниеОповещения("ЗаполнитьСторноПоПравиламТрансляцииЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСторноПоПравиламТрансляцииЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		ЗаполнитьСторноПоПравиламТрансляцииНаСервере(Период);
		Модифицированность = Истина;
	КонецЕсли; 	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеСлужебныеПроцедурыИФункции

// Процедура устанвливает параметры выбора для элементов формы. 
// 
// Параметры:
//  МассивЭлементов - Массив.
// 
&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.Дополнительный_1СчетДт);
	МассивЭлементов.Добавить(Элементы.Дополнительный_1СчетКт);
	МассивЭлементов.Добавить(Элементы.Дополнительный_2СчетДт);
	МассивЭлементов.Добавить(Элементы.Дополнительный_2СчетКт);
	МассивЭлементов.Добавить(Элементы.Дополнительный_3СчетДт);
	МассивЭлементов.Добавить(Элементы.Дополнительный_3СчетКт);
	МассивЭлементов.Добавить(Элементы.Дополнительный_4СчетДт);
	МассивЭлементов.Добавить(Элементы.Дополнительный_4СчетКт);
	МассивЭлементов.Добавить(Элементы.Дополнительный_5СчетДт);
	МассивЭлементов.Добавить(Элементы.Дополнительный_5СчетКт);
	
	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	фКэшЗначений = Новый Структура;
	
	фКэшЗначений.Вставить("ЕстьОбъектыМСФО", бит_ОбщегоНазначения.ЕстьОбъектыМСФО());
	
	// Запишем параметр для формирования заголовка.
	фКэшЗначений.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	фКэшЗначений.Вставить("ВалютаРеглУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	фКэшЗначений.Вставить("ВалютаУпрУчета" , Константы.бит_ВалютаУправленческогоУчета.Получить());
	фКэшЗначений.Вставить("ВалютаМСФО"     , ПолучитьВалютуМСФО(Объект.Организация, фИмяРегистраБухгалтерии));
	    
	КоличествоСубконто = ?(фИмяРегистраБухгалтерии = "", 0, Метаданные.РегистрыБухгалтерии[фИмяРегистраБухгалтерии].ПланСчетов.МаксКоличествоСубконто);
	фКэшЗначений.Вставить("КоличествоСубконто", КоличествоСубконто);
	
	фКэшЗначений.Вставить("ВидОбъектаРегистрБухгалтерии", Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии);
	фКэшЗначений.Вставить("СписокДоступныхРегистров"    , бит_БухгалтерскиеОтчетыСервер.СформироватьСписокДоступныхРегистровБухгалтерииДляУправленческихОтчетов());

КонецПроцедуры

// Процедура устанавливает видимость, доступность элементам формы.
// 
&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	ДвиженияДоступны = ЗначениеЗаполнено(Объект.РегистрБухгалтерии) 
						И ЗначениеЗаполнено(Объект.Организация);
						
	ЭтоУпр  = фИмяРегистраБухгалтерии = "бит_Дополнительный_1";
	ЭтоДоп2 = фИмяРегистраБухгалтерии = "бит_Дополнительный_2";
	ЭтоДоп3 = фИмяРегистраБухгалтерии = "бит_Дополнительный_3";
	ЭтоДоп4 = фИмяРегистраБухгалтерии = "бит_Дополнительный_4";
	ЭтоДоп5 = фИмяРегистраБухгалтерии = "бит_Дополнительный_5";
	
	Если Не бит_ОбщегоНазначения.ЕстьОбъектыМСФО() Тогда
		Элементы.СуммаОперацииМУ.Видимость  		 		   = Ложь;	
		Элементы.СуммаОперацииМУ1.Видимость 		 		   = Ложь;
		Элементы.Дополнительный_2СуммаМУ.Видимость = Ложь;
	КонецЕсли;

	Элементы.СтраницаДополнительный_1.Видимость = ЭтоУпр;
	Элементы.СтраницаДополнительный_2.Видимость = ЭтоДоп2;
	Элементы.СтраницаДополнительный_3.Видимость = ЭтоДоп3;
	Элементы.СтраницаДополнительный_4.Видимость = ЭтоДоп4;
	Элементы.СтраницаДополнительный_5.Видимость = ЭтоДоп5;	
	
	Элементы.Дополнительный_1.Доступность = ДвиженияДоступны;
	Элементы.Дополнительный_2.Доступность = ДвиженияДоступны;
	Элементы.Дополнительный_3.Доступность = ДвиженияДоступны;
	Элементы.Дополнительный_4.Доступность = ДвиженияДоступны;
	Элементы.Дополнительный_5.Доступность = ДвиженияДоступны;
	
	Элементы.ГруппаСуммыОперации1.Видимость = Ложь;// ЭтоУпр;
	Элементы.ГруппаСуммыОперации2.Видимость = Ложь;// ЭтоДоп2;
	Элементы.ГруппаСуммыОперации3.Видимость = Ложь;// ЭтоДоп3;
	Элементы.ГруппаСуммыОперации4.Видимость = Ложь;// ЭтоДоп4;
	Элементы.ГруппаСуммыОперации5.Видимость = Ложь;// ЭтоДоп5;
	
	Элементы.Дополнительный_1ГруппаШаблоны.Доступность = ДвиженияДоступны;
	Элементы.Дополнительный_2ГруппаШаблоны.Доступность = ДвиженияДоступны;
    Элементы.Дополнительный_3ГруппаШаблоны.Доступность = ДвиженияДоступны;
    Элементы.Дополнительный_4ГруппаШаблоны.Доступность = ДвиженияДоступны;
    Элементы.Дополнительный_5ГруппаШаблоны.Доступность = ДвиженияДоступны;
	
	Элементы.Дополнительный_1ГруппаЗаполнитьПоШаблону.Доступность = ДвиженияДоступны;
	Элементы.Дополнительный_2ГруппаЗаполнитьПоШаблону.Доступность = ДвиженияДоступны;
    Элементы.Дополнительный_3ГруппаЗаполнитьПоШаблону.Доступность = ДвиженияДоступны;
    Элементы.Дополнительный_4ГруппаЗаполнитьПоШаблону.Доступность = ДвиженияДоступны;
    Элементы.Дополнительный_5ГруппаЗаполнитьПоШаблону.Доступность = ДвиженияДоступны;

КонецПроцедуры

// Функция получает и записывает валюту международного учета в кэш значений.
// 
// Параметры:
//  Организация 		   - СправочникСсылка.Организации.
//  ИмяРегистраБухгалтерии - Строка.
// 
// Возвращаемое значение:
//   СправочникСсылка.Валюты.
// 
&НаСервереБезКонтекста 
Функция ПолучитьВалютуМСФО(Организация, ИмяРегистраБухгалтерии)
	
	// Получим валюту международного учета.
	ВыводитьОшибки = бит_му_ОбщегоНазначения.ЭтоМеждународныйПланСчетовИлиРегистр(ИмяРегистраБухгалтерии);
	ВалютаМСФО     = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация, , ВыводитьОшибки);
	
	Возврат ВалютаМСФО;
	
КонецФункции

// Процедура выполняет пересчет сумм в текущей строке.
// 
// Параметры:
//  ТекущиеДанные      - ДанныеФормыЭлементКоллекции.
//  ВалютаДляПересчета - СправочникСсылка.Валюты.
//  СуммаДляПересчета  - Число.
//  Действие 		   - Строка.
// 
&НаСервере
Процедура ВыполнитьРасчетСуммВТекущейСтроке(ТекущиеДанные, ВалютаДляПересчета, СуммаДляПересчета, Действие = "")

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ВыполнитьРасчетСуммВТекущейСтроке(ТекущиеДанные, ВалютаДляПересчета, СуммаДляПересчета, Действие, фЕстьРесурсСуммаМУ, фКэшЗначений.ВалютаМСФО);
	
КонецПроцедуры

// Процедура выполняет пересчет сумм в текущей строке.
// 
// Параметры:
//  СтараяВалютаМСФО - СправочникСсылка.Валюты.
// 
&НаСервере
Процедура ПересчитатьСуммыПоСуммеМСФО(СтараяВалютаМСФО)

	НоваяВалютаМСФО = фКэшЗначений.ВалютаМСФО;
	
	КурсКратностьСтаройВалютыМСФО = бит_КурсыВалют.ПолучитьКурсВалюты(СтараяВалютаМСФО, Объект.Дата);
	КурсКратностьНовойВалютыМСФО  = бит_КурсыВалют.ПолучитьКурсВалюты(НоваяВалютаМСФО, Объект.Дата);
	
	Для каждого ТекущиеДанные Из Объект.Движения[фИмяРегистраБухгалтерии] Цикл
		
		ТекущиеДанные.СуммаМУ = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(ТекущиеДанные.СуммаМУ 
												 , СтараяВалютаМСФО
												 , НоваяВалютаМСФО
												 , КурсКратностьСтаройВалютыМСФО.Курс
												 , КурсКратностьНовойВалютыМСФО.Курс
												 , КурсКратностьСтаройВалютыМСФО.Кратность
												 , КурсКратностьНовойВалютыМСФО.Кратность);
												 
		ВыполнитьРасчетСуммВТекущейСтроке(ТекущиеДанные, НоваяВалютаМСФО, ТекущиеДанные.СуммаМУ, "ИзменениеМУСуммы");
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет действия, необходимые при изменении даты.
// 
&НаСервере
Процедура ИзменениеДатыСервер()

	УстановитьВидимостьДоступность();	

КонецПроцедуры

// Процедура выполняет действия, необходимые при изменении регистра бухгалтерии.
// 
// Параметры:
//  ВызовПриСозданииФормы - Булево (По умолчанию = Ложь).
// 
&НаСервере
Процедура ИзменениеРегистраБухгалтерииСервер(ВызовПриСозданииФормы = Ложь)
	
	Если ЗначениеЗаполнено(Объект.РегистрБухгалтерии) Тогда
		фИмяРегистраБухгалтерии = Объект.РегистрБухгалтерии.ИмяОбъекта;
		фСтрокаВидаОперации     = Объект.РегистрБухгалтерии.Наименование;
		фЕстьРесурсСуммаМУ = бит_ОбщегоНазначения.ЕстьРесурсСуммаМУРегистраБухгалтерии(фИмяРегистраБухгалтерии);		
	Иначе
		фИмяРегистраБухгалтерии = "";
		фСтрокаВидаОперации     = "";
		фЕстьРесурсСуммаМУ = Ложь;
	КонецЕсли;
	
	Если Не ВызовПриСозданииФормы Тогда
		
		Объект.Движения.бит_Дополнительный_1.Очистить();
		Объект.Движения.бит_Дополнительный_2.Очистить();
		Объект.Движения.бит_Дополнительный_3.Очистить();
		Объект.Движения.бит_Дополнительный_4.Очистить();
		Объект.Движения.бит_Дополнительный_5.Очистить();
		
		УстановитьВидимостьДоступность();
		
		КоличествоСубконто = ?(фИмяРегистраБухгалтерии = "", 0, Метаданные.РегистрыБухгалтерии[фИмяРегистраБухгалтерии].ПланСчетов.МаксКоличествоСубконто);
		фКэшЗначений.Вставить("КоличествоСубконто", КоличествоСубконто);
	
	КонецЕсли;
	
	ПолучитьДатуОткрытогоПериода();
		
КонецПроцедуры
                  
// Процедура выполняет действия, необходимые при изменении организации.
// 
// Параметры:
//  ПересчитыватьСуммы - Булево.
//  СтараяВалютаМСФО   - СправочникСсылка.Валюты.
// 
&НаСервере
Процедура ИзменениеОрганизацииСервер(ПересчитыватьСуммы, СтараяВалютаМСФО)
	
	ПолучитьВалютуМСФО(Объект.Организация, фИмяРегистраБухгалтерии);
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ВыполнитьДействияПриИзмененииОрганизации(фИмяРегистраБухгалтерии);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Если ПересчитыватьСуммы Тогда
		ПересчитатьСуммыПоСуммеМСФО(СтараяВалютаМСФО);		
	КонецЕсли;	
	
    ПолучитьДатуОткрытогоПериода();
	
	УстановитьВидимостьДоступность();
		
КонецПроцедуры


// Процедура обрабатывает изменение счета текущей записи.
// 
// Параметры:
//  ТекИд - Число.
//  ДтКт  - Строка ("Дт" или "Кт").
// 
&НаСервере
Процедура ИзменениеСчетаТекущейЗаписи(ТекИд, ДтКт)

	ТекущиеДанные = Объект.Движения[фИмяРегистраБухгалтерии].НайтиПоИдентификатору(ТекИд);
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные["Счет" + ДтКт]);
	Если Не СвСч.Валютный Тогда
		Возврат;
	КонецЕсли;
 	
	// Выполним расчет сумм в текущей строке.
	ВыполнитьРасчетСуммВТекущейСтроке(ТекущиеДанные, ТекущиеДанные["Валюта" + ДтКт], ТекущиеДанные["ВалютнаяСумма" + ДтКт]);
		
КонецПроцедуры

// Процедура обрабатывает изменение валюты в строке.
// 
// Параметры:
//  ТекИд - Число.
//  ДтКт  - Строка.
// 
&НаСервере
Процедура ИзменениеВалютыТекущейЗаписи(ТекИд, ДтКт)

	ТекущиеДанные = Объект.Движения[фИмяРегистраБухгалтерии].НайтиПоИдентификатору(ТекИд);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
    
    СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные.СчетДт);
	Если ДтКт = "Дт" ИЛИ Не СвСч.Валютный Тогда
		// Выполним расчет сумм в текущей строке.
		ВыполнитьРасчетСуммВТекущейСтроке(ТекущиеДанные, ТекущиеДанные["Валюта" + ДтКт], ТекущиеДанные["ВалютнаяСумма" + ДтКт]);
	КонецЕсли;	

КонецПроцедуры

// Процедура обрабатывает изменение суммы текущей записи.
// 
// Параметры:
//  ТекИд    - Число.
//  Действие - Строка.
// 
&НаСервере
Процедура ИзменениеСуммыТекущейЗаписи(ТекИд, Действие = "")

	ТекущиеДанные = Объект.Движения[фИмяРегистраБухгалтерии].НайтиПоИдентификатору(ТекИд);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;	
	
	Если Действие = "ИзменениеМУСуммы" Тогда
		ВалютаПересчета = фКэшЗначений.ВалютаМСФО;
		СуммаПересчета  = ТекущиеДанные.СуммаМУ;
	ИначеЕсли Действие = "ИзменениеРеглСуммы" Тогда
	    ВалютаПересчета = фКэшЗначений.ВалютаРеглУчета;
		СуммаПересчета  = ТекущиеДанные.СуммаРегл;
	ИначеЕсли Действие = "ИзменениеУпрСуммы" Тогда	
		ВалютаПересчета = фКэшЗначений.ВалютаУпрУчета;
		СуммаПересчета  = ТекущиеДанные.СуммаУпр;
	Иначе
		Возврат;
	КонецЕсли;	
	
	// Выполним расчет сумм в текущей строке.
	ВыполнитьРасчетСуммВТекущейСтроке(ТекущиеДанные, ВалютаПересчета, СуммаПересчета, Действие);
	
	ПересчитатьСуммуОперации();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуОперации()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ПересчитатьСуммуОперации();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

// Процедура заполняет движения.
// 
// Параметры:
//  ВыбранноеЗначение - Структура.
//  ОчищатьДанные     - Булево.
// 
&НаСервере
Процедура ЗаполнитьДвиженияПоВыбраннымДанным(ВыбранноеЗначение, ОчищатьДанные)

	Если ОчищатьДанные Тогда					
		Объект.Движения[фИмяРегистраБухгалтерии].Очистить();					
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Обработки.бит_ПолучениеДанныхРегистровБухгалтерии.ЗаполнитьДвижения(ВыбранноеЗначение.ХранилищеДанные,
		ДокументОбъект.Движения[фИмяРегистраБухгалтерии], фКэшЗначений.КоличествоСубконто, фИмяРегистраБухгалтерии);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
                         
КонецПроцедуры

// Процедура переключает активность проводок.
// 
&НаСервере
Процедура ПереключитьАктивностьПроводок()

	Если НЕ ПереключениеПроводокДоступно() Тогда
		Возврат;
	КонецЕсли; 

	Для каждого СтрокаЗапись Из Объект.Движения[фИмяРегистраБухгалтерии] Цикл
		СтрокаЗапись.Активность = Не СтрокаЗапись.Активность;
	КонецЦикла;
	
	АктивностьДвижений = НЕ АктивностьДвижений;
	УстановитьСостояниеДокумента();

КонецПроцедуры
 
// Процедура получает дату открытого периода для данного объекта. 
// 
&НаСервере
Процедура ПолучитьДатуОткрытогоПериода()

	// Получим дату открытого периода.
	РезДаты = бит_КонтрольЗакрытогоПериода.ПолучитьДатыОткрытогоПериода(Объект.Организация, Объект.РегистрБухгалтерии);
	фДатаОткрытогоПериода = РезДаты[Объект.РегистрБухгалтерии];

КонецПроцедуры

// Процедура обрабатывает перенос остатков
//  из обработки бит_ПолучениеОстатковРегистровБухгалтерии. 
//
// Параметры:
//  СтрЗаполнения - Структура.
//
&НаСервере
Процедура ОбработкаПереносОстатков(СтрЗаполнения)

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьДвиженияИзТаблицы(СтрЗаполнения, фИмяРегистраБухгалтерии, фЕстьРесурсСуммаМУ,
		фКэшЗначений.ВалютаМСФО);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дополнительный_1");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Движения.бит_Дополнительный_1.ВидПроводки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дополнительный_2");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Движения.бит_Дополнительный_2.ВидПроводки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дополнительный_3");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Движения.бит_Дополнительный_3.ВидПроводки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дополнительный_4");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Движения.бит_Дополнительный_4.ВидПроводки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дополнительный_5");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Движения.бит_Дополнительный_5.ВидПроводки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дополнительный_1");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Движения.бит_Дополнительный_1.Период", ВидСравненияКомпоновкиДанных.Равно, СсылкаДатаСторно);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СсылкаДатаСторно", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дополнительный_2");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Движения.бит_Дополнительный_2.Период", ВидСравненияКомпоновкиДанных.Равно, СсылкаДатаСторно);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СсылкаДатаСторно", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дополнительный_3");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Движения.бит_Дополнительный_3.Период", ВидСравненияКомпоновкиДанных.Равно, СсылкаДатаСторно);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СсылкаДатаСторно", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дополнительный_4");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Движения.бит_Дополнительный_4.Период", ВидСравненияКомпоновкиДанных.Равно, СсылкаДатаСторно);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СсылкаДатаСторно", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дополнительный_5");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Движения.бит_Дополнительный_5.Период", ВидСравненияКомпоновкиДанных.Равно, СсылкаДатаСторно);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СсылкаДатаСторно", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВизы()
	
	СтруктураПараметров = Новый Структура;
	
	бит_ВизированиеСервер.ОбновитьПереченьВиз(Объект.Ссылка, Объект.Дата, СтруктураПараметров);
	
КонецПроцедуры

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
// 
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры

// Процедура добавляет в кэш реквизитов текущее значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	мКэшРеквизитовФормы[ИмяРеквизита] = Объект[ИмяРеквизита];	
	
КонецПроцедуры

// Процедура извлекает из кэша и присваивает объекту значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ИзвлечьИзКэша(ИмяРеквизита)
	
	Объект[ИмяРеквизита] = мКэшРеквизитовФормы[ИмяРеквизита];
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения
     
// Процедура обрабатывает начало выбора субконто.
// 
// Параметры:
//  Элемент              - ЭлементУправления.
//  СтандартнаяОбработка - Булево.
//  Контейнер            - Произвольный.
//  ЗначениеСубконто     - Произвольный.
//  ИмяСубконто  		 - Строка.
// 
&НаКлиенте
Процедура НачалоВыбораСубконтоБУ(Элемент, СтандартнаяОбработка, Контейнер, ЗначениеСубконто, ИмяСубконто)
	
	Если ЭтоСемействоБП И ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		бит_РаботаСДиалогамиКлиент.ВыбратьБанковскийСчетБезВладельца(Контейнер, СтандартнаяОбработка, ИмяСубконто);
		
	Иначе
		
		НачалоИмениСубконто = Лев(ИмяСубконто, 10);
		
		СтруктураПараметров = бит_БухгалтерияКлиент.ПодготовитьПараметрыВыбораСубконто(Контейнер, 
			НачалоИмениСубконто, ЗначениеСубконто, фКоличествоСубконтоБУ, Объект);	
	
		// Установим параметры выбора субконто.
		бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураПараметров);
	
	КонецЕсли;
	
КонецПроцедуры

// Процедура обрабатывает изменение субконто.
// 
// Параметры:
//  Контейнер         - Произвольный.
//  ЗначениеСубконто  - Произвольный - Текущее значение субконто.
//  ИмяСубконто  	  - Строка.
// 
&НаКлиенте
Процедура ИзменениеСубконтоБУ(Контейнер, ЗначениеСубконто, ИмяСубконто)

	НачалоИмениСубконто = Лев(ИмяСубконто, 10);
	
	СтруктураСубконто = бит_БухгалтерияКлиент.ПодготовитьСтруктуруСубконто(Контейнер, НачалоИмениСубконто, фКоличествоСубконтоБУ);	  
	бит_БухгалтерияВызовСервера.ОбработатьИзменениеСубконто(СтруктураСубконто, НачалоИмениСубконто, ЗначениеСубконто, фКоличествоСубконтоБУ);	  
	бит_БухгалтерияКлиент.ЗаполнитьСубконтоПоСтруктуре(СтруктураСубконто, Контейнер, НачалоИмениСубконто, "", фКоличествоСубконтоБУ);																   

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПроводкуНаСторно(ТекущиеДанные, Отказ)
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Период) И ЗначениеЗаполнено(СсылкаДатаСторно) Тогда
		Если ТекущиеДанные.Период = СсылкаДатаСторно Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура обрабатывает авто-подбор субконто. Устанавливаются фильтры при авто-подборе.
// 
// Параметры:
//  Элемент   - ПолеФормы.
//  Параметры - Структура.
// 
&НаКлиенте
Процедура СубконтоБУАвтоПодбор(Элемент, Параметры)

	ТекущиеДанные = Элементы[Сред(фИмяРегистраБухгалтерии, 5)].ТекущиеДанные;	
	
	ИмяСубконто      = Прав(Элемент.Имя, 11);	
	ЗначениеСубконто = ТекущиеДанные[ИмяСубконто];	
	
	НачалоИмениСубконто = Лев(ИмяСубконто, 10);
	
	СтруктураПараметров = бит_БухгалтерияКлиент.ПодготовитьПараметрыВыбораСубконто(ТекущиеДанные, 
		НачалоИмениСубконто, ЗначениеСубконто, фКоличествоСубконтоБУ, Объект);	

	// Установим параметры выбора субконто.
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураПараметров);

	Для каждого КиЗ Из СтруктураПараметров Цикл	
		Параметры.Отбор.Вставить(КиЗ.Ключ, КиЗ.Значение);	
	КонецЦикла; 
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаСторноПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(фДатаОткрытогоПериода) И ЗначениеЗаполнено(Объект.ДатаСторно) Тогда
	 	Если Объект.ДатаСторно < фДатаОткрытогоПериода Тогда
		 	 ТекстСообщения = НСтр("ru = 'Дата сторно не может быть в закрытом периоде.';
			   					   |en = 'The reversal date cannot be in a closed period.'");
			 ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			 ИзвлечьИзКэша("ДатаСторно");
			 Возврат;
		КонецЕсли; 
	КонецЕсли; 
	ДобавитьВКэш("ДатаСторно");
	 
КонецПроцедуры

// Процедура - Переключение проводок доступно определяет допустимость действия "переключение проводок".
//
&НаСервере
Функция ПереключениеПроводокДоступно()
	
	Возврат бит_КонтрольЗакрытогоПериода.ПереключениеПроводокДоступно(Объект.Ссылка, 
				Объект.Организация, Объект.Дата, фИмяРегистраБухгалтерии);
	
КонецФункции
 
#КонецОбласти

#Область РазделРаботыСШаблонами

// Обработка оповещения. 
//
// Параметры:
//  Ответ               - КодВозвратаДиалога.
//  СтруктураПараметров - Структура.
//
&НаКлиенте
Процедура СохранитьШаблонНовыйПродолжение(Ответ, СтруктураПараметров) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если Записать() Тогда			
			СоздатьШаблонПроводокНовыйКлиент(СтруктураПараметров);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура создает шаблон проводок. 
//
// Параметры:
//  СтруктураПараметров - Структура.
//
&НаКлиенте
Процедура СоздатьШаблонПроводокНовыйКлиент(СтруктураПараметров)

	СоздатьШаблонПроводокНовыйСервер(СтруктураПараметров);
	ШаблонДвижения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметров, "ШаблонСсылка");
	Если ЗначениеЗаполнено(ШаблонДвижения)
		И ТипЗнч(ШаблонДвижения) = Тип("СправочникСсылка.бит_ШаблоныДвижений") Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", ШаблонДвижения);
		Форма = ПолучитьФорму("Справочник.бит_ШаблоныДвижений.ФормаОбъекта", ПараметрыФормы);
		Форма.Записать();
		Форма.Открыть();
	КонецЕсли;

КонецПроцедуры

// Процедура создает шаблон проводок на сервере. 
//
// Параметры:
//  СтруктураПараметров - Структура.
//
&НаСервере
Процедура СоздатьШаблонПроводокНовыйСервер(СтруктураПараметров)

	Если бит_РаботаСМетаданными.ЕстьРегистрБухгалтерии(фИмяРегистраБухгалтерии) Тогда
		СтруктураПараметров.Вставить("ТаблицаПроводок", Объект.Движения[фИмяРегистраБухгалтерии].Выгрузить());
		ШаблонСсылка = Неопределено;
		бит_МеханизмХозяйственныхОперацийСервер.СоздатьОбновитьШаблонПроводокОперация(СтруктураПараметров, ШаблонСсылка, Истина);	
		СтруктураПараметров.Очистить();
		СтруктураПараметров.Вставить("ШаблонСсылка", ШаблонСсылка);
	КонецЕсли;

КонецПроцедуры

// Процедура выполнения команды ЗаполнитьПоШаблону
//
// Параметры:
//  ДобавитьЗагрузить - Строка.
//
&НаКлиенте
Процедура КомандаЗаполнитьПоШаблонуКлиент(ДобавитьЗагрузить)

	ТекстВопроса = НСтр("ru='Для продолжения необходимо записать документ. Записать?';
						|en='To continue, you must write the document. Record?'");
	ОповещениеВопрос = Новый ОписаниеОповещения("КомандаЗаполнитьПоШаблонуПродолжение", ЭтотОбъект, ДобавитьЗагрузить);

	Если Модифицированность ИЛИ Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30);	
		
	Иначе
		
		ТекстВопроса = НСтр("ru = 'Текущие движения будут очищены, продолжить?';
							|en = 'Current traffic will be cleared to continue?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("КомандаЗаполнитьПоШаблонуЗавершение", ЭтотОбъект, ДобавитьЗагрузить);		
		Если ДобавитьЗагрузить = "Загрузить" И Объект.Движения[фИмяРегистраБухгалтерии].Количество() > 0 Тогда			
			ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30);			
		Иначе			
			ВыполнитьОбработкуОповещения(ОповещениеВопрос, КодВозвратаДиалога.Да);			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка оповещения вопроса пользователю. 
//
// Параметры:
//  Ответ             - КодВозвратаДиалога.
//  ДобавитьЗагрузить - Строка.
//
&НаКлиенте
Процедура КомандаЗаполнитьПоШаблонуПродолжение(Ответ, ДобавитьЗагрузить) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Если Записать() Тогда			
			ТекстВопроса = НСтр("ru = 'Текущие движения будут очищены, продолжить?';
								|en = 'Current traffic will be cleared to continue?'");
			ОповещениеВопрос = Новый ОписаниеОповещения("КомандаЗаполнитьПоШаблонуЗавершение", ЭтотОбъект, ДобавитьЗагрузить);			
			Если ДобавитьЗагрузить = "Загрузить" И Объект.Движения[фИмяРегистраБухгалтерии].Количество() > 0 Тогда
				ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30);	
			Иначе
				ВыполнитьОбработкуОповещения(ОповещениеВопрос, КодВозвратаДиалога.Да);
			КонецЕсли;			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Обработка оповещения вопроса пользователю. 
//
// Параметры:
//  Ответ             - КодВозвратаДиалога.
//  ДобавитьЗагрузить - Строка.
//
&НаКлиенте
Процедура КомандаЗаполнитьПоШаблонуЗавершение(Ответ, ДобавитьЗагрузить) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		РегистрБухгалтерии = ОпределитьРегистрБухгалтерииВидДокумента("РегистрБухгалтерии");
		ВидДокумента       = ОпределитьРегистрБухгалтерииВидДокумента("ВидДокумента");

		ПараметрыФормы = Новый Структура;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Регистр", РегистрБухгалтерии);
	    Отбор.Вставить("ВидДокумента", ВидДокумента);
		
		ПараметрыФормы.Вставить("Отбор", Отбор);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеФормыВыбораШаблона", ЭтотОбъект, ДобавитьЗагрузить);
		
		ОткрытьФорму("Справочник.бит_ШаблоныДвижений.ФормаВыбора", ПараметрыФормы,,,,, ОповещениеОЗакрытии);

	КонецЕсли;

КонецПроцедуры

// Обработка оповещения закрытия формы выбора шаблона. 
//
// Параметры:
//  Результат.
//  ДобавитьЗагрузить - Строка.
//
&НаКлиенте
Процедура ЗакрытиеФормыВыбораШаблона(Результат, ДобавитьЗагрузить) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		
		ЗаполнитьТаблицуДвиженийНаСервере(Результат, ДобавитьЗагрузить);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполянет проводки по выбранному щаблону. 
//
// Параметры:
//  ШаблонСсылка      - СправочникСсылка.
//  ДобавитьЗагрузить - Строка.
//
&НаСервере
Процедура ЗаполнитьТаблицуДвиженийНаСервере(ШаблонСсылка, ДобавитьЗагрузить)

	бит_МеханизмХозяйственныхОперацийСервер.ЗаписатьДвиженияОперацияУпр(Объект.Ссылка, ШаблонСсылка, фИмяРегистраБухгалтерии, ДобавитьЗагрузить);
	
	ЭтотОбъект.Прочитать();
	
КонецПроцедуры

// Функция возвращает ссылку на объект.
//
// Параметры:
//  ИскомыйОбъект.
//
// Возвращаемое значение:
//  Строка.
//
&НаСервере
Функция ОпределитьРегистрБухгалтерииВидДокумента(ИскомыйОбъект)

	Результат = Неопределено;
	
	Если ИскомыйОбъект = "РегистрБухгалтерии" Тогда

		Результат = Справочники.бит_ВидыРеквизитовДвижений.НайтиПоРеквизиту("ИмяРегистра", фИмяРегистраБухгалтерии);
		
	ИначеЕсли  ИскомыйОбъект = "ВидДокумента" Тогда
	
	    Результат = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени("Документ.бит_ОперацияУправленческий");

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработка оповещения. 
//
// Параметры:
//  Ответ               - КодВозвратаДиалога.
//  СтруктураПараметров - Структура.
//
&НаКлиенте
Процедура СохранитьШаблонПродолжение(Ответ, СтруктураПараметров) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Если Записать() Тогда			
			СоздатьШаблонПроводокКлиент(СтруктураПараметров);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура создает шаблон проводок. 
//
// Параметры:
//  СтруктураПараметров - Структура.
//
&НаКлиенте
Процедура СоздатьШаблонПроводокКлиент(СтруктураПараметров)

	РегистрБухгалтерии = ОпределитьРегистрБухгалтерииВидДокумента("РегистрБухгалтерии");
	ВидДокумента       = ОпределитьРегистрБухгалтерииВидДокумента("ВидДокумента");

	ПараметрыФормы = Новый Структура;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Регистр", РегистрБухгалтерии);
    Отбор.Вставить("ВидДокумента", ВидДокумента);
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеФормыВыбораШаблонаСохранение", ЭтотОбъект, СтруктураПараметров);
	
	ОткрытьФорму("Справочник.бит_ШаблоныДвижений.ФормаВыбора", ПараметрыФормы,,,,, ОповещениеОЗакрытии);

КонецПроцедуры

// Обработка оповещения закрыти формы выбора шаблона. 
//
// Параметры:
//  ШаблонСсылка        - СправочникСсылка.
//  СтруктураПараметров - Структура.
//
&НаКлиенте
Процедура ЗакрытиеФормыВыбораШаблонаСохранение(ШаблонСсылка, СтруктураПараметров) Экспорт

	СоздатьШаблонПроводокСервер(ШаблонСсылка, СтруктураПараметров);
	Если ЗначениеЗаполнено(ШаблонСсылка) И ТипЗнч(ШаблонСсылка) = Тип("СправочникСсылка.бит_ШаблоныДвижений") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ШаблонСсылка);
		Форма = ПолучитьФорму("Справочник.бит_ШаблоныДвижений.ФормаОбъекта", ПараметрыФормы);
		Форма.Записать();
		Форма.Открыть();
	КонецЕсли;

КонецПроцедуры

// Процедура создает шаблон проводок на сервере. 
//
// Параметры:
//  ШаблонСсылка.
//  СтруктураПараметров - Структура.
//
&НаСервере
Процедура СоздатьШаблонПроводокСервер(ШаблонСсылка, СтруктураПараметров)

	Если бит_РаботаСМетаданными.ЕстьРегистрБухгалтерии(фИмяРегистраБухгалтерии) И ЗначениеЗаполнено(ШаблонСсылка) Тогда
		СтруктураПараметров.Вставить("ТаблицаПроводок", Объект.Движения[фИмяРегистраБухгалтерии].Выгрузить());
		бит_МеханизмХозяйственныхОперацийСервер.СоздатьОбновитьШаблонПроводокОперация(СтруктураПараметров, ШаблонСсылка);	
		СтруктураПараметров.ТаблицаПроводок = "";
	КонецЕсли;

КонецПроцедуры

// Оповещение на вопрос о подтверждение очистки.
//
// Параметры:
//  Результат    - КодВозвратаДиалога.
//  ДопПараметры - Структура.
//
&НаКлиенте
Процедура ОтветНаПотверждениеОчистки(РезультатОтвет, ДопПараметры) Экспорт
	
	ОчищатьДанные = РезультатОтвет = КодВозвратаДиалога.Да;
    
    Если ОчищатьДанные Тогда
        ЗаполнитьДвиженияПоВыбраннымДанным(ДопПараметры.ВыбранноеЗначение, ОчищатьДанные);
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти   

&НаСервере
Процедура ЗаполнитьСторноПоПравиламТрансляцииНаСервере(Период)

	Объект.Движения.бит_Дополнительный_2.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		НачалоПериода = "0001-01-01";
	Иначе
		НачалоПериода = Период.ДатаНачала;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		КонецПериода = '2030-12-31 23-59-59';
	Иначе	
		КонецПериода = Период.ДатаОкончания;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвиженияССубконто.Период КАК Период,
	|	ДвиженияССубконто.СчетДт КАК СчетДт,
	|	ДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	|	ДвиженияССубконто.ВидСубконтоДт1 КАК ВидСубконтоДт1,
	|	ДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	|	ДвиженияССубконто.ВидСубконтоДт2 КАК ВидСубконтоДт2,
	|	ДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	|	ДвиженияССубконто.ВидСубконтоДт3 КАК ВидСубконтоДт3,
	|	ДвиженияССубконто.СубконтоДт4 КАК СубконтоДт4,
	|	ДвиженияССубконто.ВидСубконтоДт4 КАК ВидСубконтоДт4,
	|	ДвиженияССубконто.СчетКт КАК СчетКт,
	|	ДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	|	ДвиженияССубконто.ВидСубконтоКт1 КАК ВидСубконтоКт1,
	|	ДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	|	ДвиженияССубконто.ВидСубконтоКт2 КАК ВидСубконтоКт2,
	|	ДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	|	ДвиженияССубконто.ВидСубконтоКт3 КАК ВидСубконтоКт3,
	|	ДвиженияССубконто.СубконтоКт4 КАК СубконтоКт4,
	|	ДвиженияССубконто.ВидСубконтоКт4 КАК ВидСубконтоКт4,
	|	ДвиженияССубконто.Организация КАК Организация,
	|	ДвиженияССубконто.ВалютаДт КАК ВалютаДт,
	|	ДвиженияССубконто.ВалютаКт КАК ВалютаКт,
	|	-ДвиженияССубконто.СуммаРегл КАК СуммаРегл,
	|	-ДвиженияССубконто.СуммаУпр КАК СуммаУпр,
	|	-ДвиженияССубконто.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
	|	-ДвиженияССубконто.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
	|	-ДвиженияССубконто.КоличествоДт КАК КоличествоДт,
	|	-ДвиженияССубконто.КоличествоКт КАК КоличествоКт,
	|	-ДвиженияССубконто.СуммаМУ КАК СуммаМУ,
	|	ДвиженияССубконто.Содержание КАК Содержание,
	|	ДвиженияССубконто.НомерЖурнала КАК НомерЖурнала,
	|	ДвиженияССубконто.ВидПроводки КАК ВидПроводки,
	|	ДвиженияССубконто.ДатаФормирования КАК ДатаФормирования,
	|	ДвиженияССубконто.ТипПроводки КАК ТипПроводки
	|ИЗ
	|	РегистрБухгалтерии.бит_Дополнительный_2.ДвиженияССубконто(&НачалоПериода, &КонецПериода, Организация = &Организация, Период, ) КАК ДвиженияССубконто
	|ГДЕ
	|	ДвиженияССубконто.СторнируемаяПроводка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Проводки = ТекущийОбъект.Движения.бит_Дополнительный_2; 
	Пока Выборка.Следующий() Цикл
		
		Проводка = Проводки.Добавить();
		Проводка.Активность = Истина;
		Проводка.Период = Объект.Дата;
		ЗаполнитьЗначенияСвойств(Проводка, Выборка,,"Период");
		
		Если ЗначениеЗаполнено(Выборка.СчетДт) Тогда
			Для Индекс = 1 По 4 Цикл
				бит_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, Индекс, Выборка["СубконтоДт" + Индекс]); 
			КонецЦикла; 
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Выборка.СчетКт) Тогда
			Для Индекс = 1 По 4 Цикл
				бит_БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, Индекс, Выборка["СубконтоКт" + Индекс]); 
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;

	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента(СтрокаУказаниеСтатуса = Неопределено)
	
	Если СтрокаУказаниеСтатуса = "НезаписанныйДокумент" Тогда
		СостояниеДокумента = 0;	
	ИначеЕсли Объект.ПометкаУдаления Тогда
		СостояниеДокумента = 2;
	ИначеЕсли НЕ АктивностьДвижений Тогда
		СостояниеДокумента = 11;
	Иначе
		СостояниеДокумента = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	бит_ВизированиеСервер.ЗаполнитьРеквизитыСтатусаВФорме(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	бит_ВизированиеСервер.ЗаполнитьРеквизитыСтатусаВФорме(ЭтотОбъект, Объект);
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти 