
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СчетДтПриИзменении(Элемент)
	
	ПривестиЗначениеСчета("СчетКт", Запись.СчетДт);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетКтПриИзменении(Элемент)
	
	ПривестиЗначениеСчета("СчетДт", Запись.СчетКт);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПривестиЗначениеСчета(ИмяПараметра, Значение)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Типы         = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(Значение));
	ОписаниеТипа = Новый ОписаниеТипов(Типы);
	Запись[ИмяПараметра] = ОписаниеТипа.ПривестиЗначение(Запись[ИмяПараметра]);
	
КонецПроцедуры

#КонецОбласти