
#Область СлужебныйПрограммныйИнтерфейс

// Генерирует наименование для шаблона движений.
// 
// Параметры:
//  ШаблонОбъект - СправочникОбъект.бит_ШаблоныДвижений.
// 
Процедура ПолучитьНаименованиеШаблонаДвижений(ШаблонОбъект) Экспорт

	ШаблонНаименование = "" + Строка(ШаблонОбъект.Регистр) + " --> " + Строка(ШаблонОбъект.ВидДокумента) + " --> " + ШаблонОбъект.Код;
	
	Если Найти(ШаблонОбъект.Наименование, " --> ") > 0 ИЛИ СокрЛП(ШаблонОбъект.Наименование) = "" Тогда
		ШаблонОбъект.Наименование = ШаблонНаименование;
	КонецЕсли;
	
КонецПроцедуры // ПолучитьНаименованиеШаблонаДвижений()

// Добавляет шаблон в выбранный интерактивно комплект.
// 
// Параметры:
//  ШаблонОбъект - СправочникОбъект.бит_ШаблоныДвижений.
//                 
Процедура ВключитьШаблонВКомплектИнтерактивно(ШаблонСсылка, ВидДокумента) Экспорт

	// Откроем модально форму выбора комплектов движений
	// с отбором по виду документа. Если вид документа - не заполнен
	// выведем сообщение об ошибке.
	
	Если НЕ ЗначениеЗаполнено(ВидДокумента) Тогда		
		ТекстСообщения = НСтр("ru='Не выбран вид документа.';en='Do not select the document type.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);		
		Возврат;		
	КонецЕсли;
	
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("ВидДокумента", ВидДокумента);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", УсловияОтбора);
	ФормаВыбора = ПолучитьФорму("Справочник.бит_КомплектыДвижений.ФормаВыбора", ПараметрыФормы);
	
	ДопПараметры = Новый Структура("ШаблонСсылка", ШаблонСсылка);
	ОбработчикВК = Новый ОписаниеОповещения("ВключитьШаблонВКомплектЗавершение", бит_МеханизмХозяйственныхОперацийКлиент.ЭтотОбъект, ДопПараметры);
	ОткрытьФорму(ФормаВыбора.ИмяФормы,,,,,, ОбработчикВК, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	
КонецПроцедуры // ВключитьШаблонВКомплектИнтерактивно()

// Процедура включает шаблон в комплект.
// 
Процедура ВключитьШаблонВКомплектЗавершение(ВыбранныйКомплект, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(ВыбранныйКомплект) Тогда
		бит_МеханизмХозяйственныхОперацийВызовСервера.ВключитьШаблонВКомплект(ДопПараметры.ШаблонСсылка, ВыбранныйКомплект);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьКомплектПоШаблонуДвижения(ШаблонДвижения, ВидДокумента) Экспорт

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ВидДокумента", ВидДокумента);
	ДанныеЗаполнения.Вставить("ШаблонДвижения", ШаблонДвижения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	
	ОткрытьФорму("Справочник.бит_КомплектыДвижений.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
