
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	ПодготовитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаМеханизмТрансляцииВыбор(Элемент)
	
	ОбработатьВыбор(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаМХОВыбор(Элемент)
	
	ОбработатьВыбор(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаПроформыВыбор(Элемент)
	
	ОбработатьВыбор(Элемент);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыбор(Элемент)
	
	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	НавигационнаяСсылкаБлока = Неопределено;
	Если НавигационныеСсылки.Свойство(ИмяЭлемента, НавигационнаяСсылкаБлока) 
		И ЗначениеЗаполнено(НавигационнаяСсылкаБлока) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаБлока);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФорму()
	
	// Готовим структуру из метаданных, чтобы проверка конфигурации реагировала на изменения.
	ОбъектыПодсистемы = Новый Структура;
	
	// Справочники.
	ОбъектыПодсистемы.Вставить("ПравилаЗаполненияПолейПриТрансляции",	Метаданные.Справочники.бит_ПравилаЗаполненияПолейПриТрансляции);
	ОбъектыПодсистемы.Вставить("ПравилаТрансляции",						Метаданные.Справочники.бит_ПравилаТрансляции);
	ОбъектыПодсистемы.Вставить("ШаблоныДвижений",						Метаданные.Справочники.бит_ШаблоныДвижений);
	ОбъектыПодсистемы.Вставить("КомплектыДвижений",						Метаданные.Справочники.бит_КомплектыДвижений);
	ОбъектыПодсистемы.Вставить("ВидыПроизвольныхФорм",					Метаданные.Справочники.бит_ВидыПроизвольныхФорм);
	ОбъектыПодсистемы.Вставить("СтруктураКонструктораДвижений",			Метаданные.Справочники.бит_СтруктураКонструктораДвижений);
	
	// Документы.
	ОбъектыПодсистемы.Вставить("НазначениеПравилТрансляции",			Метаданные.Документы.бит_НазначениеПравилТрансляции);
	ОбъектыПодсистемы.Вставить("УстановкаАктивныхКомплектовДвижений",	Метаданные.Документы.бит_УстановкаАктивныхКомплектовДвижений);
	ОбъектыПодсистемы.Вставить("ПроизвольнаяФорма",						Метаданные.Документы.бит_ПроизвольнаяФорма);
	
	// Регистры сведений.
	ОбъектыПодсистемы.Вставить("НазначениеПравилЗаполненияПриТрансляции",	Метаданные.РегистрыСведений.бит_НазначениеПравилЗаполненияПриТрансляции);
	ОбъектыПодсистемы.Вставить("НастройкиРежимовТрансляции",				Метаданные.РегистрыСведений.бит_НастройкиРежимовТрансляции);
	
	// Отчеты.
	ОбъектыПодсистемы.Вставить("СоответствиеЗаписейТрансляции",	Метаданные.Отчеты.бит_СоответствиеЗаписейТрансляции);
	Если НЕ бит_ОбщегоНазначения.ЭтоУТ() Тогда
		ОбъектыПодсистемы.Вставить("ОСВПоЗаписямТрансляции", Метаданные.Отчеты.бит_ОСВПоЗаписямТрансляции);
	КонецЕсли;
	
	// Формирование навигационных ссылок и проверка доступа по функциональным опциям.
	НедоступныеОбъекты = Новый Массив;
	Для Каждого ОбъектПодсистемы Из ОбъектыПодсистемы Цикл
		НавигационнаяСсылкаБлока = ""; 
		ОбъектДоступен = ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОбъектПодсистемы.Значение);
		Если ОбъектДоступен Тогда
			НавигационнаяСсылкаБлока = ПолучитьНавигационнуюСсылку(ОбъектПодсистемы.Значение);
		Иначе
			НедоступныеОбъекты.Добавить(ОбъектПодсистемы.Ключ);	
		КонецЕсли;
		ОбъектыПодсистемы[ОбъектПодсистемы.Ключ] = НавигационнаяСсылкаБлока;
	КонецЦикла;
	
	НавигационныеСсылки = Новый ФиксированнаяСтруктура(ОбъектыПодсистемы);
	
	СхемаМеханизмТрансляции	= Обработки.бит_ПанельФункций_ПреобразованиеДанных.ПолучитьМакет("СхемаМеханизмТрансляции");
	СхемаМХО				= Обработки.бит_ПанельФункций_ПреобразованиеДанных.ПолучитьМакет("СхемаМХО");
	СхемаПроформы			= Обработки.бит_ПанельФункций_ПреобразованиеДанных.ПолучитьМакет("СхемаПроформы");
	
	// Ссылка может быть одновременно на разных схемах.
	Для Каждого НедоступныйОбъект Из НедоступныеОбъекты Цикл
		ЭлементыСхемы = СхемаМеханизмТрансляции.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
		ЭлементыСхемы = СхемаМХО.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
		ЭлементыСхемы = СхемаПроформы.ЭлементыГрафическойСхемы; 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыСхемы, НедоступныйОбъект) Тогда
			ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьНедоступныйЭлемент(ЭлементыСхемы, НедоступныйОбъект)
	
	ЭлементСхемы = ЭлементыСхемы[НедоступныйОбъект];
	ЭлементСхемы.ЦветФона = ЦветаСтиля.бит_ЦветНедоступногоПоля;
	
КонецПроцедуры

#КонецОбласти
