////////////////////////////////////////////////////////////////////////////////
//
// Учитывает особенности реализации в конфигурации-носителе.
// При обновлении библиотеки переносить только состав процедур и функций без содержимого.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяет настройки подсистемы.
//
// Параметры:
//  Настройки - Структура:
//   * ИспользоватьПодписиИПечати - Булево - при установке значения Ложь отключается возможность установки подписей 
//                                           и печатей в печатных формах.
//   * СкрыватьПодписиИПечатиДляРедактирования - Булево - удалять рисунки подписей и печатей табличных документов при
//                                           снятии флажка "Подписи и печати" в форме "Печать документов", для того,
//                                           чтобы они не мешали редактировать текст, находящийся под ними.
//   * ПроверкаПроведенияПередПечатью    - Булево - признак необходимости проверки проведенности
//                                        документов перед печатью, является значением по умолчанию для команды печати
//                                        см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//                                        Для непроведенных документов команда печати не выполняется.
//                                        Если параметр не указан, то проверка проведенности не выполняется.
//   * ОбъектыПечати - Массив - менеджеры объектов с процедурой ПриОпределенииНастроекПечати.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	// Справочники.
	Если Константы.бит_ИспользоватьДелопроизводство.Получить() Тогда
		Настройки.ОбъектыПечати.Добавить(Справочники.бит_ВнутренниеДокументы); // Есть команды.
	КонецЕсли;
	
	Настройки.ОбъектыПечати.Добавить(Документы.бит_АктуализацияБюджета);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_БюджетнаяОперация);
	// ++ НЕ УТ
	Настройки.ОбъектыПечати.Добавить(Документы.бит_вго_АктСверкиВГО);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_вго_ПодтверждениеСверкиВГО);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_вго_ПротоколРасхождений);
	// -- НЕ УТ
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ВерсияОтчета);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ДополнительныеУсловияПоДоговору);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ЗакрытиеСчетов);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ИсковоеТребование);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_кзн_ЗакрытиеДокументовПланирования); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_кзн_ЗаявкаНаРасходованиеСредств); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_кзн_ПлатежнаяПозиция); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_кзн_ПозицияПоступления);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_кзн_РеестрПлатежей); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_КорректировкаБюджета);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_КорректировкаКонтрольныхЗначений);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_мдм_ЗаявкаНаИзменение);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_мдм_ЗаявкаНаУдаление);
	// ++ НЕ УТ
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ВыбытиеНМА);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ВыбытиеОС);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ВыработкаВНА);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ЗачетАвансовПоЛизингу);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ИзменениеПараметровУчетаНМА);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ИзменениеПараметровУчетаОС); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_КонсолидационныеКорректировки); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_КонсолидационныеКорректировкиНовый); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_КорректировкаГрафиковФинансовыхНачислений); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_КорректировкаСтоимостиМПЗ);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_МодернизацияОС);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_НачислениеАмортизацииНМА);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_НачислениеАмортизацииОС);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_НачислениеПроцентовПоФинИнструментам);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_НачислениеРезерваПоМПЗ);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_НачислениеФинансовыхПроцентовПоАрендеОС);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ОбесценениеДебиторскойЗадолженности);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ОбесценениеНМА); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ОбесценениеОС); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ПереводОСВСоставИнвестиционнойСобственности);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ПеремещениеОС);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ПереоценкаНМА);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ПереоценкаОС);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ПересчетВВалютуПредставления);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ПоступлениеМПЗ);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ПрекращениеАрендыОС);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ПризнаниеФинИнструментов); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ПринятиеКУчетуНМА);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_ПринятиеКУчетуОС); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_РазнесениеСальдоНаОтчетнуюДату);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_РаспределениеПлатежейПоКредитамЗаймам);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_РасчетОтложенныхНалогов); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_РеализацияМПЗ);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_РеклассификацияЗадолженности);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_РеклассификацияЗадолженностиПоФинансовойАрендеОС); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_СторноЭлиминационныхНачислений);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_му_Элиминация);
	// -- НЕ УТ
	Настройки.ОбъектыПечати.Добавить(Документы.бит_НазначениеПравилТрансляции);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ОперацияБюджетирование); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ОперацияУправленческий); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ОтражениеФактаДДС);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ПереоценкаВалютныхДенежныхСтатей);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_пз_ЗаявкаНаЗатраты);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_пз_ОтражениеФактаЗатрат);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_пз_СводнаяЗаявкаНаЗатраты);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_Претензия);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ПроизвольнаяФорма);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ПротоколРасхожденийБюджета); // Есть команды
	Настройки.ОбъектыПечати.Добавить(Документы.бит_Проформы);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_РаспределениеБюджета);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_СведенияОбОстаткахДенежныхСредств);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_СобытиеДоговора);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_УстановкаАктивныхКомплектовДвижений);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_УстановкаЗависимыхОборотов);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_УстановкаЗначенийПроизвольныхПараметров);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_УстановкаКонтрольныхЗначений);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_УстановкаНеснижаемыхОстатков);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ФормаВводаБюджета);
	Настройки.ОбъектыПечати.Добавить(Документы.бит_ФормаСбораДанных);
		
КонецПроцедуры

// См. УправлениеПечатью.КомандыПечатиОбъекта.
Процедура ПриПолученииКомандПечати(КомандыПечати, ИмяОбъекта) Экспорт
	
	Если ИмяОбъекта = "Справочник.бит_ВнутренниеДокументы" Тогда
		Справочники.бит_ВнутренниеДокументы.ПриПолученииКомандПечати(КомандыПечати, ИмяОбъекта);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
