
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +

	ЗаполнитьНоменклатуруИВидРабочегоЦентра();

	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

Процедура ЗаполнитьНоменклатуруИВидРабочегоЦентра()
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +

	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.ПустаяСсылка();
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	РесурсныеСпецификацииВыходныеИзделия.Ссылка КАК Ссылка,
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ вт_СпецификацияНоменклатура
		|ИЗ
		|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СправочникТехнологическиеОперации.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА СправочникТехнологическиеОперации.РабочийЦентр ССЫЛКА Справочник.РабочиеЦентры
		|			ТОГДА ВЫРАЗИТЬ(СправочникТехнологическиеОперации.РабочийЦентр КАК Справочник.РабочиеЦентры).ВидРабочегоЦентра
		|		ИНАЧЕ СправочникТехнологическиеОперации.РабочийЦентр
		|	КОНЕЦ КАК ВидРабочегоЦентра,
		|	вт_СпецификацияНоменклатура.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.ТехнологическиеОперации КАК СправочникТехнологическиеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СпецификацияНоменклатура КАК вт_СпецификацияНоменклатура
		|		ПО (СправочникТехнологическиеОперации.Спецификация = вт_СпецификацияНоменклатура.Ссылка)
		|ГДЕ
		|	СправочникТехнологическиеОперации.Ссылка = &Ссылка");

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Номенклатура = Выборка.Номенклатура;
		ВидРабочегоЦентра = Выборка.ВидРабочегоЦентра;
		
	КонецЦикла; 
	
	бит_Номенклатура = Номенклатура;
	бит_ВидРабочегоЦентра = ВидРабочегоЦентра;	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаКлиенте
Процедура бит_НормаВыработкиПриИзменении(Элемент)
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_НормаВыработкиПриИзмененииНаСервере(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаКлиенте
Процедура бит_КоличествоХодовПриИзменении(Элемент)
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаКлиенте
Процедура бит_НормаВремениПриИзменении(Элемент)
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_НормаВремениПриИзмененииНаСервере(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаКлиенте
Процедура бит_ТехнологическаяСкоростьПриИзменении(Элемент)
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_РасчетнаяМассаПроводаПриИзменении(Элемент)
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаКлиенте
Процедура бит_КоэффициентИспользованияОборудованияПриИзменении(Элемент) 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаСервере
Процедура бит_ПересчитатьВыработкуПроводаСоВсейМашины()
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	Объект.бит_ВыработкаПроводаСоВсейМашины = ((Объект.бит_ТехнологическаяСкорость * 6 / 100) 
												* Объект.бит_РасчетнаяМассаПровода 
												* Объект.бит_КоличествоХодов 
												* Объект.бит_КоэффициентИспользованияОборудования);	
																		
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -
	
КонецПроцедуры

&НаСервере
Процедура бит_НормаВыработкиПриИзмененииНаСервере() 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	Если Объект.бит_НормаВыработки = 0 Тогда
		Объект.бит_НормаВремени = 0;
		Объект.ВремяШтучное = 0;
	Иначе		
		Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута;
		Объект.бит_НормаВремени = 1 / Объект.бит_НормаВыработки;
		Объект.ВремяШтучное = Объект.бит_НормаВремени * 60; 
	КонецЕсли;	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -
	
КонецПроцедуры  

&НаСервере
Процедура бит_НормаВремениПриИзмененииНаСервере() 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	Если Объект.бит_НормаВремени = 0 Тогда
		Объект.бит_НормаВыработки = 0;
		Объект.ВремяШтучное = 0;
	Иначе		
		Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута;
		Объект.бит_НормаВыработки = 1 / Объект.бит_НормаВремени;
		Объект.ВремяШтучное = Объект.бит_НормаВремени * 60; 
	КонецЕсли;	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -
	
КонецПроцедуры



