
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаВыбораПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Родитель = ПредопределенноеЗначение("Справочник.бит_СтатусыОбъектов.СостоянияЗадач") 
		ИЛИ Родитель = ПредопределенноеЗначение("Справочник.бит_СтатусыОбъектов.СостоянияПроцессов") Тогда		
		// Состояния задач и процессов фиксированы
		ТекстСообщения = НСтр("ru='Изменение состава группы ""%1"" запрещено.';
							  |en='Changing the composition of the ""%1"" group banned'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Родитель);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);		 
		Отказ = Истина;
		ВызватьИсключение ТекстСообщения;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти