////////////////////////////////////////////////////////////////////////////////
// Выгрузка данных в файлы Excel и загрузка данных из файлов Excel.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСExcel

#Область ОбъектExcel

Функция СоздатьПриложениеExcelСохранивНастройки(Отказ = Ложь) Экспорт
	
	СтруктураРез = Неопределено;
	#Если Не МобильныйКлиент Тогда
	Попытка
		
		// Создание объекта Microsoft Excel.
		ExcelApplication = Новый COMОбъект("Excel.Application");
		СохрНастройкиExcel = СохранитьНастройкиОбъектаExcel(ExcelApplication);
		
		ExcelApplication.Visible = Ложь;
		ExcelApplication.AskToUpdateLinks   = Ложь;
		ExcelApplication.DisplayAlerts      = Ложь;
		ExcelApplication.AutomationSecurity = 3;
		
		СтруктураРез = Новый Структура;
		СтруктураРез.Вставить("ExcelApplication"  , ExcelApplication);
		СтруктураРез.Вставить("СохрНастройкиExcel", СохрНастройкиExcel);
		
	Исключение
		
		ТекстСообщения = НСтр("ru='Не удалось создать объект Excel.';en='Failed to create an Excel object.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Отказ = Истина;
	КонецПопытки;
	#КонецЕсли
	
	Возврат СтруктураРез;
	
КонецФункции // СоздатьПриложениеExcelСохранивНастройки()

Функция ЗакрытьПриложениеExcelССохраненнымиНастройками(ExcelApplication, СохрНастройкиExcel, ЗакрытьКниги = Ложь, СохранитьИзменения = Ложь) Экспорт
	
	Попытка
		
		Если ЗакрытьКниги Тогда
			
			Для каждого Workbook Из ExcelApplication.Workbooks Цикл
				Workbook.Close(СохранитьИзменения);
			EndDo;
			
		КонецЕсли;
		
		ExcelApplication.AskToUpdateLinks	= СохрНастройкиExcel.AskToUpdateLinks;
		ExcelApplication.DisplayAlerts		= СохрНастройкиExcel.DisplayAlerts;
		ExcelApplication.AutomationSecurity = СохрНастройкиExcel.AutomationSecurity;
		
		ExcelApplication.Quit();			
			
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ЗакрытьПриложениеExcelССохраненнымиНастройками()

// Функция создает объект Эксель.
// 
// Возвращаемое значение:
//  Excel - ComObject.
// 
Function InitExcel(DisplayAlerts = False, Fail = False) Export
	
	Excel = Undefined;
	
	#Если Не МобильныйКлиент Тогда
	Try
		
		// Создание объекта Microsoft Excel.
		Excel = New COMОбъект("Excel.Application");
		Excel.DisplayAlerts = DisplayAlerts;
	
	Except
		
		Fail = True;
		
		ТекстСообщения = НСтр("ru='Не удалось создать объект Excel по причине: %1.';
							  |en='Unable to create Excel object because of: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		
	EndTry;
	#КонецЕсли
	
	Return Excel;
	
EndFunction // InitExcel()

// Процедура закрывает Эксель.
// 
// Параметры:
//  ExcelApp - ComObject.
// 
Procedure QuitExcel(ExcelApp) Export
	
	If NOT ExcelApp = Undefined Then
		
		ExcelApp.Quit();
		ExcelApp = Undefined;
		
	EndIf;
	
EndProcedure  // QuitExcel() 

#КонецОбласти

#Область ФайлExcel

// Функция возврашает фильтр для выбора файлов Excel.
// 
// Возвращаемое значение:
//  Строка.
// 
Функция ФильтрВыбораФайлаExcelПолный() Экспорт
	
	ТекстВсеФайлы = НСтр("ru='Все файлы Excel (*.xls, *.xlsx)|*.xls; *.xlsx';
						 |en='All files Excel (*.xls, *.xlsx)|*.xls; *.xlsx'");
	
	ТекстФайлыНовые= НСтр("ru='Файлы Excel (*.xlsx)|*.xlsx';
						  |en='Fails Excel (*.xlsx)|*.xlsx'");
	
	ТекстФайлыСтарые = НСтр("ru='Файлы Excel 97-2003 (*.xls)|*.xls';
						 	|en='Fails Excel 97-2003 (*.xls)|*.xls'");
	
	ТекстФильтра = СтрШаблон("%1|%2|%3", ТекстВсеФайлы, ТекстФайлыНовые, ТекстФайлыСтарые);
		
	Возврат ТекстФильтра;
	
КонецФункции

// Функция открывает Excel файл.
// 
// Параметры:
//  ExcelApplication - ComObject("Excel.Application").
//  Path  			 - Строка, полный путь где лежит файл.
//  Fail  			 - Булево, по умолчанию Ложь.
// 
// Возвращаемое значение:
//  ComObject, в случае неудачи Неопределено.
//
Function OpenExcelFile(ExcelApplication, Path, Fail = False) Export
	
	ExcelFile = Undefined;		
	
	If ExcelApplication <> Undefined Then
		
		Try			
			ExcelFile = ExcelApplication.WorkBooks.Open(Path);
			Состояние(НСтр("ru='Открытие файла Microsoft Excel...'; en='Opening a Microsoft Excel file...'"));
		Except			
			ТекстСообщения = НСтр("ru='Не удалось открыть Excel файл.';en='Unable to open Excel file.'");			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Fail);			
		EndTry;
		
	EndIf;
	
	Return ExcelFile;
	
EndFunction

// Процедура закрывает книгу эксель.
// 
// Параметры:
//  ExcelWorkbook - ComObject.
//  SaveChanges   - Булево (По умолчанию Ложь).
// 
Procedure CloseExcelFile(ExcelWorkbook, SaveChanges = Ложь) Export
	
	If ExcelWorkbook <> Undefined Then
		
		Попытка
			ExcelWorkbook.Close(SaveChanges);
			ExcelWorkbook = Undefined;		
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось закрыть файл Excel.';en='Unable to close the Excel file.'");
        	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
	EndIf;
	
EndProcedure

#КонецОбласти 

// Функция возвращает список листов в файле Excel.
// 
// Параметры:
//  ExcelФайл - ComObject.
//  Отказ 	  - Булево, по умолчанию Ложь.
// 
//  СообщатьОбОшибке - Булево, по умолчанию Истина.
//  ДопСообщение     - Строка, текст дополнительного сообщения для вывода в случае неудачи,
// 					   по умолчанию "".
// 
// Возвращаемое значение:
//   МассивЛистов - Массив, в случае неудачи Неопределено.
// 
Функция ЛистыExcel(ExcelФайл, СообщатьОбОшибке = Истина, ДопСообщение = "") Экспорт
							 
	Попытка
        
        // Открытие листа файла Microsoft Excel.
        Состояние(НСтр("ru='Получение списка листов файла Microsoft Excel...'; 
					   |en='Getting a list of sheets in a Microsoft Excel file...'"));
        
        МассивЛистов = Новый Массив();
        Для Каждого ТекЛист Из ExcelФайл.Sheets Цикл
			МассивЛистов.Добавить(ТекЛист.Name);
        КонецЦикла;
        
	Исключение
		
		Если СообщатьОбОшибке Тогда            
            ТекстСообщения = НСтр("ru='Ошибка получения списка листов книги Microsoft Excel.';
								  |en='Failed to get the list of Microsoft Excel workbook sheets.'");
            Если НЕ ПустаяСтрока(ДопСообщение) Тогда
                ТекстСообщения = ТекстСообщения + "	" + ДопСообщение;
            КонецЕсли;
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения); 
		КонецЕсли;
		
        МассивЛистов = Неопределено;
        
    КонецПопытки;
	
	Возврат МассивЛистов;
	
КонецФункции

// Функция получает лист Excel.
// 
// Параметры:
//  ExcelWorkbook - ComObject.
//  SheetName     - Имя листа.
//  Fail 	      - Булево, по умолчанию Ложь.
// 
// Возвращаемое значение:
//   ComObject, в случае неудачи Неопределено.
// 
Function GetExcelSheet(ExcelWorkbook, SheetName, Fail = False) Export
	
	ExcelSheet = бит_ОбменДаннымиКлиентСервер.GetExcelSheet(ExcelWorkbook, SheetName, Fail);
	
	Return ExcelSheet;
	
EndFunction	// GetExcelSheet()

// Функция получает массив имен листов Excel.
// 
// Параметры:
//  ExcelWorkbook - ComObject.
//  Fail 	   - Булево, по умолчанию Ложь.
// 
// Возвращаемое значение:
//   SheetsNameArray - Массив.
// 
Function GetExcelSheetsList(ExcelWorkbook, Fail = False) Export
	
	SheetsNameArray = New Array;
	
	If NOT ExcelWorkbook = Undefined Then
		
		Try
			
			For each sheet In ExcelWorkbook.Sheets Do
				
				SheetsNameArray.Add(sheet.Name);
				
			EndDo;
			
		Except
			
			Fail = True;
			
			ТекстСообщения = НСтр("ru='Не удалось получить список листов Excel по причине: %1';
								  |en='Unable to retrieve a list of Excel sheets because: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
			
		EndTry;
		
	EndIf;
	
	Return SheetsNameArray;
	
EndFunction	

// Функция инициализирует некоторые перечисления, необходимые для работы с Эксель.
// 
// Возвращаемое значение:
//  Insert - Структура.
// 
Function InitExcelEnums() Export
	
	// Общие константы
	xlConsts = New Structure;
	xlConsts.Insert("xlCenter" ,-4108);
	xlConsts.Insert("xlNone"   ,-4142);
	xlConsts.Insert("xlContext",-5002);
	xlConsts.Insert("xlGeneral",1);
	
	// Направления
	XlDirection = New Structure;
	XlDirection.Insert("xlDown",-4121);
	XlDirection.Insert("xlToLeft",-4159);
	XlDirection.Insert("xlToRight",-4161);
	XlDirection.Insert("xlUp",-4162);
	
	// Виды границ
	XlBordersIndex = New Structure;
	XlBordersIndex.Insert("xlDiagonalDown",5);
	XlBordersIndex.Insert("xlDiagonalUp",6);
	XlBordersIndex.Insert("xlInsideHorizontal",11);
	XlBordersIndex.Insert("xlInsideVertical",12);
	
	// Данные значения указаны в MSDN, однако при установке из 1С устанавливаются не те границы.
	// Нормальной работы удалось добится со значениями, которые приведены ниже.
	
	// XlBordersIndex.Insert("xlEdgeBottom",7);
	// XlBordersIndex.Insert("xlEdgeLeft",8);
	// XlBordersIndex.Insert("xlEdgeRight",9);
	// XlBordersIndex.Insert("xlEdgeTop",10);
	
	XlBordersIndex.Insert("xlEdgeLeft",1);		
	XlBordersIndex.Insert("xlEdgeRight",2);		
	XlBordersIndex.Insert("xlEdgeTop",3);		
	XlBordersIndex.Insert("xlEdgeBottom",4);			
	
	// Стили линий
	XlLineStyle = New Structure;
	XlLineStyle.Insert("xlContinuous",1);
	
	// Толщина линий
	XlBorderWeight = New Structure;
	XlBorderWeight.Insert("xlHairline",1);
	XlBorderWeight.Insert("xlMedium",-4138);
	XlBorderWeight.Insert("xlThick",4);
	XlBorderWeight.Insert("xlThin",2);
	
	// Перечисления, используемые при установки проверки данных.
	
	XlDVAlertStyle = New Structure;
    XlDVAlertStyle.Insert("xlValidAlertStop",1);	
    XlDVAlertStyle.Insert("xlValidAlertWarning",2);	
    XlDVAlertStyle.Insert("xlValidAlertInformation",3);	
	
	XlDVType = New Structure;
	XlDVType.Insert("xlValidateCustom",7);
	XlDVType.Insert("xlValidateDate",4);
	XlDVType.Insert("xlValidateDecimal",2);
	XlDVType.Insert("xlValidateInputOnly",0);
	XlDVType.Insert("xlValidateList",3);
	XlDVType.Insert("xlValidateTextLength",6);
	XlDVType.Insert("xlValidateTime",5);
	XlDVType.Insert("xlValidateWholeNumber",1);
	
    XlFormatConditionOperator = New Structure;	
	XlFormatConditionOperator.Insert("xlBetween",1);
	XlFormatConditionOperator.Insert("xlEqual",3);
	XlFormatConditionOperator.Insert("xlGreater",5);
	XlFormatConditionOperator.Insert("xlGreaterEqual",7);
	XlFormatConditionOperator.Insert("xlLess",6);
	XlFormatConditionOperator.Insert("xlLessEqual",8);
	XlFormatConditionOperator.Insert("xlNotBetween",2);
	XlFormatConditionOperator.Insert("xlNotEqual",4);
	
	// Интернациональные настройки
	XlApplicationInternational = New Structure;
	XlApplicationInternational.Insert("xlDecimalSeparator",3);
	
	// Коллекция перечислений
	XlEnums = New Structure;
	XlEnums.Insert("xlConsts",xlConsts);
	XlEnums.Insert("XlBordersIndex",XlBordersIndex);
	XlEnums.Insert("XlLineStyle",XlLineStyle);
	XlEnums.Insert("XlBorderWeight",XlBorderWeight);
	XlEnums.Insert("XlDVAlertStyle",XlDVAlertStyle);
	XlEnums.Insert("XlDVType",XlDVType);
	XlEnums.Insert("XlFormatConditionOperator",XlFormatConditionOperator);
	XlEnums.Insert("XlDirection",XlDirection);
    XlEnums.Insert("XlApplicationInternational",XlApplicationInternational);	
	
	Return XlEnums;
	
EndFunction // InitExcelEnums()

// Процедура устанавливает список выбора для области.
// 
// Параметры:
//  Selection - ComObject
//  ListName - Строка
// 
Procedure SetList(Selection, ListName, XlEnums) Export
	
	Selection.Validation.Add(XlEnums.XlDVType.xlValidateList
								,XlEnums.XlDVAlertStyle.xlValidAlertStop
								,XlEnums.XlFormatConditionOperator.xlBetween
								,"="+ListName);
	
EndProcedure	

// Процедура устанавливает границы ячеек для указанной области. 
// 
// Параметры:
//  Sheet       - ComObject
//  XlEnums    - Структура
//  PositionStart - Структура
//  PositionEnd   - Структура
// 
Procedure SetBorderLines(Sheet, XlEnums, PositionStart, PositionEnd) Export
	
	Selection = Sheet.Range(Sheet.Cells(PositionStart.Row, PositionStart.Column),Sheet.Cells(PositionEnd.Row, PositionEnd.Column));
	
	XlBordersIndex = XlEnums.XlBordersIndex;
	XlLineStyle    = XlEnums.XlLineStyle;
	XlBorderWeight = XlEnums.XlBorderWeight;
	
	For each kvp In XlBordersIndex Do
		
		Border = Selection.Borders(kvp.value);
		
		If Find(kvp.key,"Edge") > 0 Then
			
			Border.LineStyle = XlLineStyle.xlContinuous;
			Border.Weight = XlBorderWeight.xlThin;
			
		EndIf;	
		
	EndDo;	
	
EndProcedure // SetBorderLines 	

// Процедура группирует строки листа Excel.
// 
// Параметры:
//  Excel 	   - ComObject("Excel.Application").
//  GroupBegin - Число, номер строки начала группировки.
//  GroupEnd   - Число, номер строки окончания группировки.
// 
Procedure GroupRows(Excel, GroupBegin, GroupEnd) Export
	
	Try
		Excel.Rows("" + GroupBegin + ":" + GroupEnd).Select();
		Excel.Selection.Rows.Group();
	Except
	EndTry;
	
EndProcedure

// Процедура устанавливает ширину колонок для текущего листа Excel.
// 
// Параметры:
//  ExcelЛист 	  - ComObject.
//  ШиринаКолонок - Число.
// 
Процедура УстановитьШиринуКолонокДляЛиста(ExcelЛист, ШиринаКолонок) Экспорт
	
	// Устанавливаем ширину колонок.
	ExcelЛист.StandardWidth = ШиринаКолонок;
	
КонецПроцедуры

// Процедура устанавливает границы для ячейки.
// 
// Параметры:
//  ExcelЯчейка - ComObject, Ячейка страницы Excel.
// 
Процедура УстановитьВсеГраницыДляЯчейки(ExcelЯчейка) Экспорт
	
	// Левая граница.
	ExcelЯчейка.Borders(7).LineStyle  = 1.5;
	
	// Правая граница.
	ExcelЯчейка.Borders(10).LineStyle = 1.5;
	
	// Нижняя граница.
	ExcelЯчейка.Borders(9).LineStyle  = 1.5;
	
	// Верхняя граница.
	ExcelЯчейка.Borders(8).LineStyle  = 1.5;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаВыгрузкаExcel

// --------------------------------------------------
// Загрузка

// Процедура осуществляет работу с файлом Excel по загрузке данных табличной части.
// 
// Параметры:
//  ПолноеИмяФайла   - Строка.
//  СтруктураОбъекта - Структура.
//  АдресДанных      - Адрес во временном хранилище.
//  СтруктураПолей   - Структура.
//  Отказ            - Булево.
//
Процедура ЗагрузитьДанныеТчИзExcelКлиент(ПолноеИмяФайла, СтруктураОбъекта, АдресДанных, СтруктураПолей, Отказ) Экспорт

	ExcelФайл = InitExcel(Ложь, Отказ); 		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ExcelКнига = OpenExcelFile(ExcelФайл, ПолноеИмяФайла, Отказ); 		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ExcelЛист = GetExcelSheet(ExcelКнига, 1, Отказ);  		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 		
			
	КоличествоСтолбцов = СтруктураПолей.Количество();
	
	ИмяЛистаИсточник = бит_ПроформыКлиентСервер.ListSourceSheetName();
	Попытка
		ЛистИсточникСписков = ExcelФайл.Sheets(ИмяЛистаИсточник);
		// Списки есть.
		// Чтение источников выпадающих списков.
		СпискиИсточники = бит_ПроформыКлиентСервер.ПрочитатьСпискиИсточники(ExcelКнига);
	Исключение
		// Списков нет.
		СпискиИсточники = Новый Соответствие;
	КонецПопытки;
	
	// (ExcelЛист, Данные, Номер1Колонки, Номер1Строки, МассивНеРазрешимыхСимволов, БыстроеСчитываниеДанных, НомерКонечнойСтроки).
	СтруктураДанных = бит_ОбменДаннымиКлиентСервер.ДанныеИзФайлаExcel(ExcelЛист, Неопределено, 1, 1, Новый Массив, Ложь, 0);
	 		
	МассивСтрокExcel = СтруктураДанных.ТаблицаДанных;
	
	// Загрузка данных из Excel
	бит_ОбменДаннымиВызовСервера.ЗагрузитьДанныеТчИзExcelСервер(СтруктураОбъекта, АдресДанных, МассивСтрокExcel, СтруктураПолей, СтруктураДанных, СпискиИсточники);
		  		
	// Закрытие Excel
	CloseExcelFile(ExcelКнига, Ложь);
	QuitExcel(ExcelФайл);
	 
КонецПроцедуры

// --------------------------------------------------
// Выгрузка

// Процедура осуществляет работу с файлом Excel по выгрузке шаблона и данных.
// 
// Параметры:
//  ВыгружатьДанные - Булево.
//  СтруктураПолей  - Структура.
//  ИсточникДанных  - ДанныеФормыКоллекция, ДанныеФормыДерево.
// 
&НаКлиенте
Процедура ВыгрузитьВExcelКлиент(ВыгружатьДанные, СтруктураПолей, ИсточникДанных) Экспорт
	
	ТекстСостояния =  НСтр("ru='Выгрузка шаблона Excel...';en='Uploading Excel template...'");
	Состояние(ТекстСостояния);
	
	Отказ = Ложь;
	
	ExcelФайл = InitExcel(Истина, Отказ);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	XlEnums = InitExcelEnums(); 	
	
	СтруктураНастроекКолонок = Новый Структура("СтруктураПолей", СтруктураПолей);
	ДанныеДляВыгрузки = бит_ОбменДаннымиВызовСервера.ПодготовитьДанныеДляВыгрузкиШаблона(СтруктураНастроекКолонок);		
	// Загрузка данных для выпадающих списков.
	ExcelКнига = ExcelФайл.Application.WorkBooks.Add(1);
	// Лист "Источники данных".
	LoadedLists = бит_ПроформыКлиент.UnloadLists(ExcelКнига, XlEnums, ДанныеДляВыгрузки);
	
	// Определим разделитель согласно региональным настройкам и подготовим форматы.
	Разделитель = ExcelФайл.International(XlEnums.XlApplicationInternational.xlDecimalSeparator);
	ФорматСумма = "# ##0" + Разделитель + "00";
	ФорматКоличество = "# ##0" + Разделитель + "000";
	
	// Лист для данных табличной части
	ExcelЛист = ExcelКнига.Worksheets.Add(ExcelКнига.Worksheets(ExcelКнига.Worksheets.Count));
	ExcelЛист.Name =  НСтр("ru='Данные';en='Data'");
	ExcelЛист.StandardWidth = 15;
	ExcelЛист.Cells.NumberFormat = "@";
    ExcelЛист.Cells.Font.Size    = 8;
    ExcelЛист.Cells.WrapText     = True;
		              	
	ЦветШапки = 12971252; // Цвет шапки обычный.
	ЦветЧисло = 16760510; // Число.
    ЦветСостн = 11389944; // Составной тип.
    ЦветОбзтн = 15519231; // Обязательный реквизит.
    
    ЦветШрифтЧисло = 6299648; // Число.
	ЦветШрифтСостн = 801923;  // Составной тип.
	
	НомерКолонки = 1;
	НомерПервойСтрокиСДанными = 2;
	
	// Вывод шапки.
    SelectionШапка = ExcelЛист.Range(ExcelЛист.Cells(1, НомерКолонки), ExcelЛист.Cells(1, СтруктураПолей.Количество()));
    SelectionШапка.Font.Bold      = Истина;    // Жирный шрифт.
    SelectionШапка.Interior.Color = ЦветШапки; // Цвет фона.
	Для каждого КлЗнчПоля Из СтруктураПолей Цикл
		
		ИмяПоля = КлЗнчПоля.Ключ;		
				
		СтруктураПоля = КлЗнчПоля.Значение;
		Синоним 	  = СтруктураПоля.Синоним;
		
		Cell = ExcelЛист.Cells(1, НомерКолонки);				
		
		PosStart = бит_ОбменДаннымиКлиентСервер.CellPosition(НомерПервойСтрокиСДанными, НомерКолонки);
		Selection = ExcelЛист.Range(ExcelЛист.Cells(PosStart.Row, PosStart.Column)
										, ExcelЛист.Cells(PosStart.Row, PosStart.Column).End(XlEnums.XlDirection.xlDown));
										
		// Установка формата полей и цвета шапки
		Если СтруктураПоля.ПримитивныйТип Тогда
											
			Если Найти(СтруктураПоля.СтрТип, "Дата") <> 0 Тогда
				  				
				// Принудительно ставим формат даты.
			 	Selection.NumberFormat = "ДД.ММ.ГГГГ";
				
			ИначеЕсли Найти(СтруктураПоля.СтрТип, "Число") <> 0 Тогда
				
				// Принудительно ставим формат числовой.
				ЧисловойФормат = "0" + ?(СтруктураПоля.Точность > 0, ",", "");
            	Для щ = 1 По СтруктураПоля.Точность Цикл
                	ЧисловойФормат = ЧисловойФормат + "0";
				КонецЦикла;
				Selection.NumberFormat = ЧисловойФормат;
				// Цвет фона
                Cell.Interior.Color = ЦветЧисло; // цвет фона
                ExcelЛист.Columns(НомерКолонки).Font.Color = ЦветШрифтЧисло; // цвет шрифта
				
			КонецЕсли;
			
		ИначеЕсли СтруктураПоля.СоставнойТип Тогда
			
			// Цвет фона для полей составного типа
            Cell.Interior.Color = ЦветСостн; // цвет фона
            ExcelЛист.Columns(НомерКолонки).Font.Color = ЦветШрифтСостн; // цвет шрифта	
			
        КонецЕсли;
        
        Если СтруктураПоля.Обязательный Тогда
            ExcelЛист.Columns(НомерКолонки).Interior.Color = ЦветОбзтн; // цвет фона
        КонецЕсли;
		                   		
		// Изменение кода. Начало. 20.12.2016{{ BF-369
		Cell.Value = Синоним;
		Cell.Name  = "CellName." + ИмяПоля;
		// Изменение кода. Конец. 20.12.2016}}
		
		// Установка списков
		ListName = бит_ПроформыКлиент.FindList(LoadedLists, СтруктураПоля, ДанныеДляВыгрузки.ВидыПредставлений);		
		If NOT ListName = Undefined Then  		
			PosStart = бит_ОбменДаннымиКлиентСервер.CellPosition(НомерПервойСтрокиСДанными, НомерКолонки);				
			SetList(Selection, ListName, XlEnums); 			
		EndIf;
		
		НомерКолонки = НомерКолонки + 1;
		
	КонецЦикла; 
	
	// Закрепим шапку.
	Selection = ExcelЛист.Range(ExcelЛист.Cells(2, 1), ExcelЛист.Cells(2, 1)).Select();
	ExcelФайл.Application.ActiveWindow.FreezePanes = True;
	
	// Выгрузка данных в Excel
	Если ВыгружатьДанные Тогда
		
		Если ТипЗнч(ИсточникДанных) = Тип("ДанныеФормыКоллекция") ИЛИ ТипЗнч(ИсточникДанных) = Тип("Массив") Тогда
		
			ВыгрузитьПлоскиеДанныеВExcel(ИсточникДанных, СтруктураПолей, ExcelЛист);		
		
		ИначеЕсли ТипЗнч(ИсточникДанных) = Тип("ДанныеФормыДерево") Тогда
			
			ВыгрузитьДанныеДереваВExcel(ИсточникДанных, СтруктураПолей, ExcelЛист);
			
        КонецЕсли;
			
	КонецЕсли;
			
	// Установка сетки.
	НомПервойСтроки = 1;
	КолСтрок        = 1;
	КолКолонок      = СтруктураПолей.Количество();
	posStart = бит_ОбменДаннымиКлиентСервер.CellPosition(НомПервойСтроки, 1);
	PosEnd   = бит_ОбменДаннымиКлиентСервер.CellPosition(КолСтрок, КолКолонок);
	SetBorderLines(ExcelЛист, XlEnums, posStart, PosEnd); 
	
	ExcelФайл.Visible = Истина;
	
	// Лист "по-умолчанию" удаляем.
	ExcelКнига.Worksheets(1).Delete();		
	
	ТекстСостояния =  НСтр("ru='Выгрузка шаблона Excel завершена.';en='Excel template Upload complete.'");
	Состояние(ТекстСостояния);
	
КонецПроцедуры // ВыгрузитьВExcelКлиент()

// Процедура осуществляет работу с файлом Excel по выгрузке шаблона и данных.
// 
// Параметры:
//  ВыгружатьДанные 		 - Булево.
//  СтруктураНастроекКолонок - Структура.
//  ВыгружатьОформление  	 - Булево.
// 
&НаКлиенте
Процедура ВыгрузитьСохранитьШаблонВExcelКлиент(ПутьКФайлу, СтруктураНастроекКолонок, ВыгружатьОформление = Истина) Экспорт
	
	СтруктураПолей = СтруктураНастроекКолонок.СтруктураПолей;
	
	ТекстСостояния =  НСтр("ru='Выгрузка в Excel...';en='Unloading in Excel ...'");
	Состояние(ТекстСостояния);
	
	Отказ = Ложь;
	
	ExcelФайл = InitExcel(Ложь, Отказ);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	XlEnums = InitExcelEnums(); 	
	
	// Данные списков для выгрузки.
	ДанныеДляВыгрузки = бит_ОбменДаннымиВызовСервера.ПодготовитьДанныеДляВыгрузкиШаблона(СтруктураНастроекКолонок, Истина);
	
	Попытка
		// Загрузка данных для выпадающих списков.
	    ExcelКнига = ExcelФайл.WorkBooks.Open(ПутьКФайлу);
		// Лист "Источники данных".
		LoadedLists = ВыгрузитьСписки(ExcelКнига, XlEnums, ДанныеДляВыгрузки);
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось выгрузить списки.';en='Failed to unload lists.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		QuitExcel(ExcelФайл);
		Возврат;
	КонецПопытки;	
	
	// Определим разделитель согласно региональным настройкам и подготовим форматы.
	Разделитель = ExcelФайл.International(XlEnums.XlApplicationInternational.xlDecimalSeparator);
	ФорматСумма = "# ##0" + Разделитель + "00";
	ФорматКоличество = "# ##0" + Разделитель + "000";
    
    // Скрытие листа "Источники списков". 
	// Нужно, чтобы отработало закрепление шапки "Selection = ExcelЛист.Range(".
	ExcelЛистСписков = ExcelКнига.WorkSheets(2);
	ExcelЛистСписков.Visible = 0;
    
    // Лист для данных табличной части
    ExcelЛист = ExcelКнига.WorkSheets(1);    
    ExcelЛист.Name =  НСтр("ru='Данные';en='Data'");
    ExcelЛист.StandardWidth = 15;
    ExcelЛист.Cells.NumberFormat = "@";
    ExcelЛист.Cells.Font.Size    = 8;
    ExcelЛист.Cells.WrapText     = True;
    	              	
    ЦветШапки = 12971252; // Цвет шапки обычный.
    ЦветЧисло = 16760510; // Число.
    ЦветСостн = 11389944; // Составной тип.
    ЦветОбзтн = 15519231; // Обязательный реквизит.
    
    ЦветШрифтЧисло = 6299648; // Число.
    ЦветШрифтСостн = 801923;  // Составной тип.
    
    НомерКолонки = 1;
    НомерПервойСтрокиСДанными = 2;
    
    // Вывод шапки.
	КолКолонок = СтруктураПолей.Количество();
	SelectionШапка = ExcelЛист.Range(ExcelЛист.Cells(1, НомерКолонки), ExcelЛист.Cells(1, КолКолонок));
    Если ВыгружатьОформление Тогда    
        SelectionШапка.Font.Bold      = Истина;    // Жирный шрифт.
        SelectionШапка.Interior.Color = ЦветШапки; // Цвет фона.   
    КонецЕсли;
    
    Для каждого КлЗнчПоля Из СтруктураПолей Цикл
    	
    	ИмяПоля = КлЗнчПоля.Ключ;		
				
    	СтруктураПоля = КлЗнчПоля.Значение;
    	Синоним 	  = СтруктураПоля.Синоним;
    	
    	Cell = ExcelЛист.Cells(1, НомерКолонки);				
    	
    	PosStart = бит_ОбменДаннымиКлиентСервер.CellPosition(НомерПервойСтрокиСДанными, НомерКолонки);
		Selection = ExcelЛист.Range(ExcelЛист.Cells(PosStart.Row, PosStart.Column),
									ExcelЛист.Cells(1048576, PosStart.Column));
    									
    	// Установка формата полей и цвета шапки
    	Если СтруктураПоля.ПримитивныйТип Тогда
    										
    		Если Найти(СтруктураПоля.СтрТип, "Дата") <> 0 Тогда
    			  				
    			// Принудительно ставим формат даты.
    		 	Selection.NumberFormat = "ДД.ММ.ГГГГ";
    			
    		ИначеЕсли Найти(СтруктураПоля.СтрТип, "Число") <> 0 Тогда
    			
    			// Принудительно ставим формат числовой.
    			ЧисловойФормат = "0" + ?(СтруктураПоля.Точность > 0, ",", "");
            	Для щ = 1 По СтруктураПоля.Точность Цикл
                	ЧисловойФормат = ЧисловойФормат + "0";
    			КонецЦикла;
    			Selection.NumberFormat = ЧисловойФормат;
                Если ВыгружатьОформление Тогда  
        			// Цвет фона
                    Cell.Interior.Color = ЦветЧисло; // цвет фона
                    ExcelЛист.Columns(НомерКолонки).Font.Color = ЦветШрифтЧисло; // цвет шрифта
                КонецЕсли;
            
    		КонецЕсли;
    		
        ИначеЕсли СтруктураПоля.СоставнойТип Тогда
            
            Если ВыгружатьОформление Тогда
                // Цвет фона для полей составного типа
                Cell.Interior.Color = ЦветСостн; // цвет фона
                ExcelЛист.Columns(НомерКолонки).Font.Color = ЦветШрифтСостн; // цвет шрифта	
            КонецЕсли;
        
        КонецЕсли;
        
        Если ВыгружатьОформление Тогда
            Если СтруктураПоля.Обязательный Тогда
                ExcelЛист.Columns(НомерКолонки).Interior.Color = ЦветОбзтн; // цвет фона
            КонецЕсли;
        КонецЕсли;
        
    	Cell.Value = Синоним;
    	Cell.Name  = "CellName." + ИмяПоля;
    	    	
        // Установка списков
        ListName = бит_ПроформыКлиент.FindList(LoadedLists, СтруктураПоля, ДанныеДляВыгрузки.ВидыПредставлений);		
        If NOT ListName = Undefined Then  		
        	PosStart = бит_ОбменДаннымиКлиентСервер.CellPosition(НомерПервойСтрокиСДанными, НомерКолонки);				
        	SetList(Selection, ListName, XlEnums); 			
        EndIf;
    	
    	НомерКолонки = НомерКолонки + 1;
    	
    КонецЦикла; 
    
	// Закрепим шапку.
	Selection = ExcelЛист.Range(ExcelЛист.Cells(2, 1), ExcelЛист.Cells(2, 1)).Select();
	ExcelФайл.Application.ActiveWindow.FreezePanes = True;
    		
    // Установка сетки.
    НомПервойСтроки = 1;
    КолСтрок        = 1;
	posStart = бит_ОбменДаннымиКлиентСервер.CellPosition(НомПервойСтроки, 1);
    PosEnd   = бит_ОбменДаннымиКлиентСервер.CellPosition(КолСтрок, КолКолонок);
    SetBorderLines(ExcelЛист, XlEnums, posStart, PosEnd); 

	// Возврат видимости листа "Источники списков".
	ExcelЛистСписков = ExcelКнига.WorkSheets(2);
	ExcelЛистСписков.Visible = -1;
	
    Расширение = ".xlsx";
    Если Прав(ПутьКФайлу, 5) = Расширение Тогда
        ПутьКФайлуСРасширением = ПутьКФайлу;
    Иначе	
        ПутьКФайлуСРасширением = ПутьКФайлу + Расширение;
	КонецЕсли;
	
	ExcelКнига.SaveAs(ПутьКФайлуСРасширением);
    QuitExcel(ExcelФайл);
	    
	ТекстСостояния =  НСтр("ru='Выгрузка в Excel завершена.';en='Unloading completed in Excel.'");
	Состояние(ТекстСостояния);
	
КонецПроцедуры // ВыгрузитьСохранитьШаблонВExcelКлиент()

#КонецОбласти

#Область Выгрузка

// Процедура - завершение обработчика выбора файла для выгрузки шаблона в документе "Форма ввода бюджета".
//
Процедура ФайлСохранитьШаблонЗавершение(ВыбранныеФайлы, ДопПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
	
		ТекстСообщения = НСтр("ru = 'Обработка файла ...';
						  	  |en = 'File processing ...'");
		Состояние(ТекстСообщения);
		
		ВыбранныйФайл = Новый Файл(ВыбранныеФайлы[0]);
        ПутьКФайлу = ВыбранныйФайл.Путь + ВыбранныйФайл.ИмяБезРасширения;
            	        
        ФВБ_ВыгрузитьШаблонЭксель(ДопПараметры.ТабДокДанные, ДопПараметры.ДокСсылка, ДопПараметры.фДеревоВрем, ДопПараметры.КоличествоРазворачивать, 
								  ПутьКФайлу, ВыбранныйФайл.Расширение, Истина);  
	
	КонецЕсли;
		
КонецПроцедуры // ФайлСохранитьШаблонЗавершение

// Осуществляет выгрузку шаблона формы ввода в Excel. 
// 
Процедура ФВБ_ВыгрузитьШаблонЭксель(ТабДокДанные, ДокСсылка, фДеревоВрем, КоличествоРазворачивать, ПутьКФайлу = Неопределено, Расширение = ".xlsx", ОткрытьФайл = Ложь) Экспорт
	
	Если ПутьКФайлу = Неопределено Тогда
		ДопПараметры = Новый Структура();
		ДопПараметры.Вставить("ТабДокДанные" 		   , ТабДокДанные);
		ДопПараметры.Вставить("ДокСсылка"	 		   , ДокСсылка);
		ДопПараметры.Вставить("фДеревоВрем" 		   , фДеревоВрем);
		ДопПараметры.Вставить("КоличествоРазворачивать", КоличествоРазворачивать);
		ФайлExcelСохранитьШаблон(ДопПараметры);
		Возврат;
    КонецЕсли; 
		
	ТекстСостояния =  НСтр("ru='Выгрузка шаблона Excel...';en='Uploading Excel template...'");
	Состояние(ТекстСостояния);
		
	Отказ = Ложь;
	Excel = InitExcel(Истина, Отказ);	
	Если Отказ Тогда	
		Возврат; 	
	КонецЕсли; 
	
	XlEnums = InitExcelEnums();
	
	// Определим разделитель согласно региональным настройкам и подготовим форматы.
	Разделитель = Excel.International(XlEnums.XlApplicationInternational.xlDecimalSeparator);
	ФорматСумма = "# ##0"+Разделитель+"00";
	ФорматКоличество = "# ##0"+Разделитель+"000";
	
	Wb = Excel.Application.WorkBooks.Add(1);		
    
	// Вывод ячеек.
	КолСтрок   = ТабДокДанные.ВысотаТаблицы;
	КолКолонок = ТабДокДанные.ШиринаТаблицы;
	НомПервойСтроки = 3;
    
	// Лист для данных бюджета.
	ExcelSheet = Wb.Worksheets.Add(Wb.Worksheets(Wb.Worksheets.Count));
	ExcelSheet.Name =  НСтр("ru='Данные бюджета';en='Budget Data'");
	ExcelSheet.StandardWidth = 15;
	// Группировки внизу.
	ExcelSheet.Outline.SummaryRow = 0;
    
    // Общие свойства ячеек.
    ExcelSheet.Cells.NumberFormat = "@";
    ExcelSheet.Cells.Font.Size    = 8;
    ExcelSheet.Cells.WrapText     = True;
    ExcelSelect = ExcelSheet.Range(ExcelSheet.Cells(НомПервойСтроки+1, 1), ExcelSheet.Cells(НомПервойСтроки+КолСтрок, КолКолонок));//.Select;
    АвтоЦвет = Новый Цвет();
    СтандартныйЦвет = бит_ОбменДаннымиВызовСервера.ЦветПодсказкиДляЯчейки();
    ExcelSelect.Interior.Color = ПолучитьЦветExcel(СтандартныйЦвет);
    
	// Информационная строка.
	ИнфСтр = бит_ОбменДаннымиВызовСервера.ИнформационнаяСтрокаВыгрузки(ДокСсылка);
	ExcelSheet.Cells(2,1).Value = ИнфСтр;
    ExcelSheet.Cells(2,1).Font.Bold = True;
    	
	// Используем временное дерево для анализа группировок.
	ТекКоллекция = фДеревоВрем.ПолучитьЭлементы();
	ТекКоллекция.Очистить();
	УровниДерева = Новый Соответствие();	
	
	// Создание структуры сопоставления имен в документе и в файле для формул.
	ИменаЯчеек = Новый Структура;
	Для нс = 1 По КолСтрок Цикл		
		сим = нс+НомПервойСтроки;		
		Для кол = 1 По КолКолонок Цикл			
			// Ячейка табличного документа.
			Обл = ТабДокДанные.Область(нс, кол, нс, кол);
			ИмяВДокументе = Обл.Имя;
			ИмяВФормуле   = СтрШаблон("R%1C%2", сим, кол);
			ИменаЯчеек.Вставить(ИмяВДокументе, ИмяВФормуле);
		КонецЦикла; // По колонкам.		
	КонецЦикла; // По строкам.
	
	Для нс = 1 По КолСтрок Цикл
		
		сим = нс+НомПервойСтроки;
		
		Для кол = 1 По КолКолонок Цикл
			
			// Ячейка табличного документа.
			Обл = ТабДокДанные.Область(нс, кол, нс, кол);
			Имя = Обл.Имя;
			// BF-7321. Формирование имени ячейки.
			ЭтоСумма      = Лев(Имя,2)="СП";
			ЭтоКоличество = Лев(Имя,2)="КП";
			Если ЭтоСумма Тогда
				ИмяЯчейкиВФайле = СтрШаблон("СП_R%1C%2", сим, кол);	
			ИначеЕсли ЭтоКоличество Тогда
				ИмяЯчейкиВФайле = СтрШаблон("КП_R%1C%2", сим, кол);
			ИначеЕсли ТипЗнч(Обл.Расшифровка) = Тип("Структура") И Обл.Расшифровка.Свойство("Имя") Тогда
				ИмяЯчейкиВФайле = Обл.Расшифровка.Имя;
			Иначе
				ИмяЯчейкиВФайле = Имя;
			КонецЕсли;
			ИмяЯчейкиВФайле = СтрЗаменить(ИмяЯчейкиВФайле, Символы.НПП, "");
									
			Если нс > 1 И кол = 1  Тогда
				// Заполняем данные об уровне выводимых строк в дерево для последующего анализа.
				Если ТипЗнч(Обл.Расшифровка) = Тип("Структура") И Обл.Расшифровка.Свойство("Уровень") Тогда
                    Если ТекКоллекция.Количество() = 0 Тогда
                        ТекущаяСтрока = ТекКоллекция.Добавить();
                        ТекущаяСтрока.Уровень = Обл.Расшифровка.Уровень;
                        ТекущаяСтрока.НомерСтроки = нс;
						УровниДерева.Вставить(ТекущаяСтрока.Уровень, ТекКоллекция); 
                    Иначе
                        Если Обл.Расшифровка.Уровень = ТекущаяСтрока.Уровень Тогда
                            ТекущаяСтрока = ТекКоллекция.Добавить();
                            ТекущаяСтрока.Уровень = Обл.Расшифровка.Уровень;
                            ТекущаяСтрока.НомерСтроки = нс;
							УровниДерева.Вставить(ТекущаяСтрока.Уровень, ТекКоллекция); 
                        ИначеЕсли Обл.Расшифровка.Уровень > ТекущаяСтрока.Уровень Тогда
                            ТекКоллекция  = ТекущаяСтрока.ПолучитьЭлементы();
                            ТекущаяСтрока = ТекКоллекция.Добавить();
                            ТекущаяСтрока.Уровень = Обл.Расшифровка.Уровень;
                            ТекущаяСтрока.НомерСтроки = нс;
							УровниДерева.Вставить(ТекущаяСтрока.Уровень, ТекКоллекция); 
                        ИначеЕсли Обл.Расшифровка.Уровень < ТекущаяСтрока.Уровень Тогда	
                            ТекКоллекция = УровниДерева[Обл.Расшифровка.Уровень];
                            Если ТекКоллекция <> Неопределено Тогда
                                ТекущаяСтрока = ТекКоллекция.Добавить();
                                ТекущаяСтрока.Уровень = Обл.Расшифровка.Уровень;
                                ТекущаяСтрока.НомерСтроки = нс;
                            КонецЕсли; 
                        КонецЕсли; 
					КонецЕсли; 
			    КонецЕсли; 
			КонецЕсли; // Анализируем иерархию.
			
			// Ячейка excel.
			Cell = ExcelSheet.Cells(сим,кол);
            Если нс = 1 Тогда				
				Cell.Font.Bold = True;				
			КонецЕсли; 
            Если Обл.ЦветФона <> АвтоЦвет И Обл.ЦветФона <> СтандартныйЦвет Тогда
                Cell.Interior.Color = ПолучитьЦветExcel(Обл.ЦветФона);
            КонецЕсли;            
			
			// Установка форматов и значений.
			Если Обл.СодержитЗначение Тогда				
				Зн = Обл.Значение;
				Если ЭтоСумма Тогда  					
					Cell.NumberFormat = ФорматСумма; 					
				КонецЕсли;   				
				Если ЭтоКоличество Тогда  					
					Cell.NumberFormat = ФорматКоличество;  					
				КонецЕсли; 				
			Иначе					
                Зн = Обл.Текст;				
            КонецЕсли;
            Если ЗначениеЗаполнено(Зн) Тогда
                Cell.Value = Зн;           
            КонецЕсли;
						
			
			Если бит_ОбщегоНазначенияКлиентСервер.ПроверитьИмяКласса(Обл.Расшифровка,"РасшифровкаЯчейкиФормыВвода") Тогда
				
				рас = Обл.Расшифровка;
				Если рас.Вид = "Значение" Тогда					
					Если ПустаяСтрока(рас.Формула) Тогда			
						// Ручной ввод значений.
                        Cell.Locked = 0;
					КонецЕсли;					
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(рас.Формула) Тогда
					
					// Установка формул.
					СтрФормула = рас.Формула; 
                    
                    ПреобразоватьЛогическуюФормулу(СтрФормула, ТабДокДанные, НомПервойСтроки);                    
                    
					Для каждого ИмяПараметра Из ИменаЯчеек Цикл
						// Замена в формуле имен ячеек на формат "R*C*".
						КлючПоиска    = СтрШаблон("[%1]", ИмяПараметра.Ключ);
						НовоеЗначение = СтрШаблон("[%1]", ИмяПараметра.Значение);
						СтрФормула = СтрЗаменить(СтрФормула, КлючПоиска, НовоеЗначение);					
					КонецЦикла;
                    
                    // Удаление квадратных скобок.
					СтрФормула = СтрЗаменить(СтрФормула, "[","");
					СтрФормула = СтрЗаменить(СтрФормула, "]","");
					СтрФормула = СтрЗаменить(СтрФормула, Символы.НПП, "");
					
                    // Равно вперед.
					СтрФормула = "="+СокрЛП(СтрФормула);					 
										
					Если ФормулаСоответствуетТребованиям(СтрФормула) Тогда
						Попытка
                            Cell.FormulaR1C1  = СтрФормула;
						Исключение
							ТекстСообщения = НСтр("ru='Не удалось установить формулу %1 для ячейки %2. Описание ошибки: %3.';
												  |en='Unable to establish a formula for %1 %2 of the cell. Description of error: %3.'");
							ТекстСообщения = СтрШаблон(ТекстСообщения, СтрФормула, ИмяЯчейкиВФайле,
														КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
							ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
						КонецПопытки;
					Иначе
					КонецЕсли; 
                КонецЕсли;
                
				Попытка 					
					Cell.Name = ИмяЯчейкиВФайле;
				Исключение
					ТекстСообщения = НСтр("ru='Не удалось установить имя ячейки.';
										  |en='Unable to set name for cell.'");
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				КонецПопытки;
				
			КонецЕсли; 			
			
		КонецЦикла; // По колонкам.
		
	КонецЦикла; // По строкам. 
	
	// Фиксация шапки и левых колонок с измерениями.
	ФиксКолонка = КоличествоРазворачивать + 2;
	PosStart  = бит_ОбменДаннымиКлиентСервер.CellPosition(2 + НомПервойСтроки, ФиксКолонка);
	PosEnd    = бит_ОбменДаннымиКлиентСервер.CellPosition(2 + НомПервойСтроки, ФиксКолонка);			
	Selection = ExcelSheet.Range(ExcelSheet.Cells(PosStart.Row, PosStart.Column), ExcelSheet.Cells(PosEnd.Row, PosEnd.Column));
	Selection.Select();
	Excel.ActiveWindow.FreezePanes = True;
	
	// Установка сетки.
	posStart  = бит_ОбменДаннымиКлиентСервер.CellPosition(1 + НомПервойСтроки, 1);
	PosEnd    = бит_ОбменДаннымиКлиентСервер.CellPosition(КолСтрок + НомПервойСтроки, КолКолонок);
	SetBorderLines(ExcelSheet, XlEnums, posStart, PosEnd); 
	
	// Группировка строк.
	ГруппировкиИнфо = Новый Соответствие;
	ОбойтиДеревоВрем(фДеревоВрем, ГруппировкиИнфо);
	
	Для каждого КиЗ Из ГруппировкиИнфо Цикл
		ТекГруппировка = КиЗ.Значение;
		Если ТекГруппировка.Начало <> ТекГруппировка.Конец Тогда 		
			 GroupRows(Excel, ТекГруппировка.Начало + 1 + НомПервойСтроки, ТекГруппировка.Конец + НомПервойСтроки);		
		КонецЕсли; 
	КонецЦикла; 
	          
    Если ПутьКФайлу = Неопределено Тогда
		ExcelSheet.Protect();
        // Открыть файл для просмотра.
        Excel.Visible = Истина;        
    Иначе
        Cell = ExcelSheet.Cells(1, 1);
        Попытка 
            УИ_Док = "УИ_" + Строка(ДокСсылка.УникальныйИдентификатор());
            УИ_Док = СтрЗаменить(УИ_Док, "-", "_");
            Cell.Name = УИ_Док;	
		Исключение
			ТекстСообщения = НСтр("ru='Не получить идентификатор документа.';
								  |en='Cant get id for document.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения + Символы.ПС
														+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
        КонецПопытки;
        ExcelSheet.Protect();
        
        // Сохранить и закрыть файл.
        ДлинаРасширения = СтрДлина(Расширение);
        ПутьКФайлу = Лев(ПутьКФайлу, 217-ДлинаРасширения);
		Попытка
			Wb.Saveas(ПутьКФайлу + Расширение);
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось записать файл %1. Возможно файл открыт в другой программе.';
								  |en='Failed to write file %1. Perhaps the file is open in another program.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПутьКФайлу);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
        QuitExcel(Excel);
        Если ОткрытьФайл Тогда		
			ФайловаяСистемаКлиент.ОткрытьФайл(ПутьКФайлу + Расширение);
		КонецЕсли;
		
    КонецЕсли;  	
	
    фДеревоВрем.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область Загрузка

// Функция опоставляет файлы Excel документам в базе
//
// Параметры:
//  МассивФайлов - Массив
//  
// Возвращаемое значение:
//   Соответствие
//
Функция СопоставитьФайлыДляЗагрузкиИдДок(МассивФайлов) Экспорт

	Результат = Новый Соответствие;
    
    Отказ = Ложь;
    
    // Открытие эксель  
    Эксель = InitExcel(Ложь, Отказ);		
    Если Отказ Тогда		
        Возврат Результат;		
    КонецЕсли;
        
    Для Каждого ИмяФайла Из МассивФайлов Цикл
        
        ЭксельКнига = OpenExcelFile(Эксель, ИмяФайла, Отказ);		
        Если Отказ Тогда 		
            Возврат Результат; 		
        КонецЕсли;
        
        Лист = GetExcelSheet(ЭксельКнига, 1, Отказ); 		
        Если Отказ Тогда 		
            Возврат Результат;  		
        КонецЕсли;
        
        Попытка
            УИ_Док = Лист.Cells(1, 1).Name.Name;
            Если ЗначениеЗаполнено(УИ_Док) Тогда
                УИ_Док = СтрЗаменить(УИ_Док, "УИ_", "");
                УИ_Док = СтрЗаменить(УИ_Док, "_", "-");
                Результат.Вставить(ИмяФайла, УИ_Док);
            Иначе
                ТекстСообщения = НСтр("ru='Не удалось найти идентификатор документа в файле %1.';
									  |en='Unable to find the document ID in the file %1.'");
                ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяФайла);
                ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
            КонецЕсли;              
        Исключение
            ТекстСообщения = НСтр("ru='Не удалось найти идентификатор документа в файле %1. Файл не предназначен для загрузки данных формы ввода бюджета через обработку.';
								  |en='Unable to find the document ID in the file %1. The file is not suitable for downloading data entry forms through the budget process.'");
            ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяФайла);
            ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);          
        КонецПопытки;                
        
         // Закрытие Excel
        CloseExcelFile(ЭксельКнига, Ложь); 
    
    КонецЦикла;
    
    QuitExcel(Эксель);
   
	Возврат Результат;
	
КонецФункции // СопоставитьФайлыДляЗагрузкиИдДок()

// Выполняет загрузку данных по шаблону Excel.
// 
// Параметры:
//  ПутьКФайлу - Строка
//
Функция ФВБ_ЗагрузитьДанныеПоШаблону(ПутьКФайлу, ВыводитьСообщения = Ложь) Экспорт

    ДанныеЭксель = Неопределено;
    				
    ТекстСостояние = НСтр("ru='Загрузка данных...';en='Loading data ...'");
    Состояние(ТекстСостояние);
                           
    Отказ = Ложь;		
    
    // Открытие эксель  
    Эксель = InitExcel(Ложь, Отказ);		
    Если Отказ Тогда		
        Возврат ДанныеЭксель;		
    КонецЕсли; 
    
    ЭксельКнига = OpenExcelFile(Эксель, ПутьКФайлу, Отказ);		
    Если Отказ Тогда 		
        Возврат ДанныеЭксель; 		
    КонецЕсли;
    
    Лист = GetExcelSheet(ЭксельКнига, 1, Отказ); 		
    Если Отказ Тогда 		
        Возврат ДанныеЭксель;  		
    КонецЕсли;
    
    // Чтение данных по именам
    ДанныеЭксель = Новый Массив;
    Для каждого ИмяОбъект Из ЭксельКнига.Names Цикл
        
        ИмяЭксель = ИмяОбъект.Name;
		ЗначениеПолучено = Истина;
		Попытка 
            ЗнчСтр = Лист.Range(ИмяЭксель).Value;
		Исключение
			Если ВыводитьСообщения Тогда	
				ТекстСообщения = НСтр("ru='Не удалось загрузить значение из файла. Name = ""%1"". Ячейка = ""%2"".';
									  |en='Failed to load value from file. Name = ""%1"". Cell = ""%2"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяЭксель, ИмяОбъект.RefersToLocal);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецПопытки;
		
		Если ЗначениеПолучено Тогда
		
			Попытка 
	            Зн = Число(ЗнчСтр);
	        Исключение 
	            Зн = 0;
	        КонецПопытки;
	        Если Зн <> 0 Тогда 
	            эд = Новый Структура("Имя,Значение", ИмяЭксель, зн);
	            ДанныеЭксель.Добавить(эд);    
	        КонецЕсли;	
		
		КонецЕсли;         
       
    КонецЦикла; 
    
    // Закрытие Excel
    CloseExcelFile(ЭксельКнига, Ложь);
    QuitExcel(Эксель);		
    
    ТекстСостояние = НСтр("ru='Преобразование данных...';en='Data conversion ...'");
    Состояние(ТекстСостояние);
		
    Возврат ДанныеЭксель;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СохранитьНастройкиОбъектаExcel(ExcelApplication)

    СохрНастройкиExcel = Новый Структура;
    СохрНастройкиExcel.Вставить("AskToUpdateLinks",   ExcelApplication.AskToUpdateLinks);
    СохрНастройкиExcel.Вставить("DisplayAlerts",      ExcelApplication.DisplayAlerts);
    СохрНастройкиExcel.Вставить("AutomationSecurity", ExcelApplication.AutomationSecurity);	

    Возврат СохрНастройкиExcel;
    
КонецФункции // СохранитьНастройкиОбъектаExcel()

// Функция определяет максимальный номер строки, присутствующий в данной группировке.
// 
// Параметры:
//  ТекСтрока - СтрокаДерева.
// 
// Возвращаемое значение:
//  МаксНомер - Число.
// 
Функция НайтиМаксНомерГруппировки(ТекСтрока)
	
	МаксНомер = ТекСтрока.НомерСтроки;
	
	ТекКоллекция = ТекСтрока.ПолучитьЭлементы();
	КолЭлем = ТекКоллекция.Количество();
	Если КолЭлем > 0 Тогда
	
		ПоследняяСтрока = ТекКоллекция[КолЭлем-1];
		МаксНомер = НайтиМаксНомерГруппировки(ПоследняяСтрока);
	
	КонецЕсли; 
	
	Возврат МаксНомер;
	
КонецФункции // НайтиМаксНомерГруппировки()

// Процедура выполняет обход временного дерева, 
// для определения размера группировок. 
// 
// Параметры:
//  СтрокаВерх - СтрокаДерева.
//  ГруппировкиИнфо - Соответствие.
// 
Процедура ОбойтиДеревоВрем(СтрокаВерх, ГруппировкиИнфо)

    ТекКоллекция = СтрокаВерх.ПолучитьЭлементы();
	Если ТекКоллекция.Количество() > 0 И Не ТипЗнч(СтрокаВерх) = Тип("ДанныеФормыДерево") Тогда
	
		ТекГр = ГруппировкиИнфо[СтрокаВерх.НомерСтроки];
		Если ТекГр = Неопределено Тогда
		
			 ТекГр = Новый Структура("Начало, Конец", СтрокаВерх.НомерСтроки, СтрокаВерх.НомерСтроки);
			 ТекГр.Конец = НайтиМаксНомерГруппировки(СтрокаВерх);
			 
			 ГруппировкиИнфо.Вставить(СтрокаВерх.НомерСтроки, ТекГр);
		
		КонецЕсли; 
	
	КонецЕсли; 
	
	Для каждого ТекСтрока Из ТекКоллекция Цикл
		
		ОбойтиДеревоВрем(ТекСтрока, ГруппировкиИнфо);
	
	КонецЦикла; 
	
КонецПроцедуры // ОбойтиДеревоВрем()

// Преобразует логическую формулу в строку, распознаваемую в Excel (BF-816).
//
// Параметры:
//  СтрФормула      - Строка.
//  ТабДокДанные    - ТабличныйДокумент.
//  НомПервойСтроки - Число.
//
Процедура ПреобразоватьЛогическуюФормулу(СтрФормула, ТабДокДанные, НомПервойСтроки)

    ИсхФормула = СтрФормула;
    
    Если Найти(СтрФормула, "?") = 0 
        И Найти(СтрФормула, "Цел") = 0 
        И Найти(СтрФормула, "Окр") = 0 
        И Найти(СтрФормула, "Sqrt") = 0 
        И Найти(СтрФормула, "%") = 0
        И Найти(СтрФормула, "Мин") = 0
        И Найти(СтрФормула, "Макс") = 0 Тогда
        
        // Не найдена логическая формула.
        Возврат;	
    
    КонецЕсли;
    
    Попытка       
        
        // Удаление пробелов
        СтрФормула = СтрЗаменить(СтрФормула, " ", "");
        
        // Условие ? = ЕСЛИ = IF
        СтрФормула = СтрЗаменить(СтрФормула, "?", "IF");
        
        // Цел = ЦЕЛОЕ = INT
        СтрФормула = СтрЗаменить(СтрФормула, "Цел", "INT");
        
        // Мин = МИН = MIN
        СтрФормула = СтрЗаменить(СтрФормула, "Мин", "MIN");
        
        // Макс = МАКС = MAX
        СтрФормула = СтрЗаменить(СтрФормула, "Макс", "MAX");        
                              
        // ОКРУГЛЕНИЕ
        // Окр([R2C4], 3, 1)=ОКРУГЛ(C2;3) = ROUND
        МассивРаздел = Новый Массив;
        МассивРаздел.Добавить("(");
        МассивРаздел.Добавить(")");
        Пока Найти(СтрФормула, "Окр") > 0 Цикл
            нПоз = Найти(СтрФормула, "Окр");
            ОтрСтр = Сред(СтрФормула, нПоз, СтрДлина(СтрФормула)-нПоз+1);
            масЧастей = бит_СтрокиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОтрСтр);
            Окрчисл = масЧастей[0];
            Окрточн = СтрЗаменить(масЧастей[1], ")", "");
            масЧастей = бит_СтрокиКлиентСервер.РазобратьСтрокуСМассивомРазделителей(ОтрСтр, МассивРаздел);
            стрОкрИсх  = "Окр(" + масЧастей[1] + ")";
            стрОкрЭкс  = СтрЗаменить(Окрчисл, "Окр", "ROUND") + "," + Окрточн + ")";
            СтрФормула = СтрЗаменить(СтрФормула, стрОкрИсх, стрОкрЭкс);
        КонецЦикла;
        
        // Sqrt = КОРЕНЬ = SQRT
        СтрФормула = СтрЗаменить(СтрФормула, "Sqrt","SQRT");
        
        // ОСТАТОК ОТ ДЕЛЕНИЯ
        // ([R2C4] % [R2C5]) = ОСТАТ(G2;G3) = MOD
        МассивРаздел = Новый Массив;
        МассивРаздел.Добавить("[");
        МассивРаздел.Добавить("]");
        Пока Найти(СтрФормула, "%") > 0 Цикл                        
            масЧастей = бит_СтрокиКлиентСервер.РазобратьСтрокуСМассивомРазделителей(СтрФормула, МассивРаздел);
            инд = масЧастей.Найти("%");
            стрДелИсх = "[" + масЧастей[инд-1] + "]" + масЧастей[инд] + "[" + масЧастей[инд+1] + "]";
            стрДелЭкс = "MOD(" + масЧастей[инд-1] + "," + масЧастей[инд+1] + ")";
            СтрФормула = СтрЗаменить(СтрФормула, стрДелИсх, стрДелЭкс);                    
        КонецЦикла;
        
    Исключение
        
        ТекстСообщения = НСтр("ru='Не удалось преобразовать формулу %1.';en='Failed to convert the formula %1.'");
        ТекстСообщения = СтрШаблон(ТекстСообщения, ИсхФормула);
        ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
        Возврат;

    КонецПопытки;
    
КонецПроцедуры // ПреобразоватьЛогическуюФормулу()

// Процедура открывает диалог выбора файла для выгрузки шаблона в документе "Форма ввода бюджета".
//
// Параметры:
//  ДопПараметры - Структура.
//
Процедура ФайлExcelСохранитьШаблон(ДопПараметры)
		
	ОповещениеФСЗ = Новый ОписаниеОповещения("ФайлСохранитьШаблонЗавершение", ЭтотОбъект, ДопПараметры);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Сохранить данные в файл Microsoft Excel';
						  	  		   |en = 'Save spreadsheet document to Microsoft Excel file'");
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Файл Microsoft Excel (*.xlsx)|*.xlsx|Файл Microsoft Excel (*.xls)|*.xls|';
						  	  	  	|en = 'Fail Microsoft Excel (*.xlsx)|*.xlsx|Fail Microsoft Excel (*.xls)|*.xls|'");
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;	
	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОповещениеФСЗ, ДиалогВыбораФайла);
	    
КонецПроцедуры // ФайлExcelСохранитьШаблон()

// Функция переводит цвет из формата 1С в формат Excel.
//
// Параметры:
//  Цвет1С - Цвет.
//
// Возвращаемое значение:
//  Число.
//
Функция ПолучитьЦветExcel(Цвет1С)
    
    Если Цвет1С.Вид = ВидЦвета.Абсолютный Тогда    
    	ЦветExcel = Цвет1С.Красный*(Pow(256,0)) + Цвет1С.Зеленый*(Pow(256,1)) + Цвет1С.Синий*(Pow(256,2));
    Иначе        
        ЦветExcel = 13499135;
    КонецЕсли;    
     
    Возврат ЦветExcel;
    
КонецФункции

// Функция выгружает на отдельный лист данные для установки выпадающих списков. 
// 
// Параметры:
//  Wb                - ComObject.
//  XlEnums           - Структура.
//  ДанныеДляВыгрузки - Структура.
// 
Функция ВыгрузитьСписки(Wb, XlEnums, ДанныеДляВыгрузки)
	
	LoadedLists = New Map;	
	
	// Создание и установка параметров для листа, являющегося источником выпадающих списков.
	ExcelSheet = Wb.Worksheets.Add(, Wb.Worksheets(Wb.Worksheets.Count));
	ExcelSheet.Name = бит_ПроформыКлиентСервер.ListSourceSheetName();
	ExcelSheet.StandardWidth           = 25;
	ExcelSheet.Cells.WrapText          = Истина;
	ExcelSheet.Cells.VerticalAlignment = XlEnums.xlConsts.xlCenter;
	ExcelSheet.Cells.NumberFormat      = "@";
	
	StartRow    = 2;
	StartColumn = 1;
    
	Сч = 0;
	For each kvp In ДанныеДляВыгрузки.СпискиВыгрузки Do
		
		CurColumn = StartColumn+Сч;			
		
		TypeStr = kvp.key;
        
		// Заголовок списка.
		Cell       = ExcelSheet.Cells(StartRow - 1, CurColumn);
		Cell.Value = TypeStr;
		
		// Выгрузка списка, со смещением на одну колонку выводятся ссылки на объекты в БД.
		List = kvp.Value;
		Cr = 0;
		For each item In List Do
			
			CurRow = StartRow+Cr;
			Cell = ExcelSheet.Cells(CurRow, CurColumn);
			Cell.Value = item.Presentation;
						
			Cr = Cr + 1;
            
		EndDo;	
		
		// Установка имени для области содержащей значения списка выбора для текущего типа.
		ListName = "List." + СтрЗаменить(TypeStr, "/", "_");
		
		PosStart  = бит_ОбменДаннымиКлиентСервер.CellPosition(StartRow, CurColumn);
		PosEnd    = бит_ОбменДаннымиКлиентСервер.CellPosition(CurRow, CurColumn);			
		Selection = ExcelSheet.Range(ExcelSheet.Cells(PosStart.Row, PosStart.Column),ExcelSheet.Cells(PosEnd.Row, PosEnd.Column));
		
		Selection.Name = ListName;
		
		LoadedLists.Insert(kvp.Key, ListName);
		
		Сч = Сч + 1;
		
	EndDo; 
	
	Возврат LoadedLists;
	
КонецФункции // ВыгрузитьСписки()

// Процедура выгружает данные дерева на форме в Excel.
// 
// Параметры:
//  ИсточникДанных - ДанныеФормыДерево.
//  СтруктураПолей - Структура.
//  ExcelЛист      - COMОбъект.
//  НомерСтроки    - Число.
//  НомерУровня    - Число (По умолчанию = 1).
// 
Процедура ВыгрузитьДанныеСтрокиВExcel(СтрДанных, СтруктураПолей, ExcelЛист, Нс, НомерУровня = 1)
              	
	Нк = 1;

	Для каждого КлЗнчПоля Из СтруктураПолей Цикл
		       		
		ИмяПоля = КлЗнчПоля.Ключ;		
		
		Если ИмяПоля = бит_ОбменДаннымиКлиентСервер.ПолучитьИмяДопПоля_Уровень() Тогда
		
			// Информация об уровне в дереве
            Cell = ExcelЛист.Cells(Нс, Нк);
		    Cell.Value = НомерУровня;
			
		Иначе			          
			
            Если СтрДанных.Свойство(ИмяПоля) Тогда
                
                // Значение их источника даннных
                ЗначениеПоля = СтрДанных[ИмяПоля];
    			Если ЗначениеЗаполнено(ЗначениеПоля) Тогда 				 
                    // NumberFormat съедает много времени.
                    Cell = ExcelЛист.Cells(Нс, Нк);
                    Если ТипЗнч(ЗначениеПоля) = Тип("Дата") ИЛИ ТипЗнч(ЗначениеПоля) = Тип("Число") Тогда
                        Cell.Value = ЗначениеПоля;
                    Иначе	
                        Cell.Value = СокрЛП(Строка(ЗначениеПоля));
                    КонецЕсли;
    			КонецЕсли;      	
            
            КонецЕсли;			  
			
		КонецЕсли; 				
				
		Нк = Нк + 1;
		
	КонецЦикла;
	
КонецПроцедуры // ВыгрузитьДанныеСтрокиВExcel()

// Процедура выгружает данные таблицы на форме в Excel.
// 
// Параметры:
//  ИсточникДанных - ДанныеФормыКоллекция.
//  СтруктураПолей - Структура.
//  ExcelЛист      - COMОбъект.
// 
Процедура ВыгрузитьПлоскиеДанныеВExcel(ИсточникДанных, СтруктураПолей, ExcelЛист)

	НомерСтроки = 2;
		
	Для каждого СтрДанных Из ИсточникДанных Цикл  	 	                            	
		
		ВыгрузитьДанныеСтрокиВExcel(СтрДанных, СтруктураПолей, ExcelЛист, НомерСтроки);
				
		НомерСтроки = НомерСтроки + 1;   
		
	КонецЦикла;	

КонецПроцедуры

// Процедура выгружает данные дерева на форме в Excel.
// 
// Параметры:
//  ИсточникДанных - ДанныеФормыДерево.
//  СтруктураПолей - Структура.
//  ExcelЛист      - COMОбъект.
//  НомерСтроки    - Число (По умолчанию = 2).
//  НомерУровня    - Число (По умолчанию = 1).
// 
Процедура ВыгрузитьДанныеДереваВExcel(ИсточникДанных, СтруктураПолей, ExcelЛист, НомерСтроки = 2, НомерУровня = 1)

	КореньДерева = ИсточникДанных.ПолучитьЭлементы();
	
	Для каждого СтрДанных Из КореньДерева Цикл  	 	                            	
		
		ВыгрузитьДанныеСтрокиВExcel(СтрДанных, СтруктураПолей, ExcelЛист, НомерСтроки, НомерУровня);
		
		НомерСтроки = НомерСтроки + 1;
		
		// Обход строк дерева по иерархии.
		НомерУровня = НомерУровня + 1;
		ВыгрузитьДанныеДереваВExcel(СтрДанных, СтруктураПолей, ExcelЛист, НомерСтроки, НомерУровня);
		НомерУровня = НомерУровня - 1;

	КонецЦикла;
	
КонецПроцедуры 

// Функция проверяет формулу на соответствие требованиям эксель.
// 
// Параметры:
//  СтрФормула - Строка
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ФормулаСоответствуетТребованиям(СтрФормула)

	МаксДлинаФормулыЭксель = 8192;
	ФормулаСоответствует = ?(СтрДлина(СтрФормула)> МаксДлинаФормулыЭксель, Ложь, Истина);	

	Возврат ФормулаСоответствует;
	
КонецФункции

#КонецОбласти 
