
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция проверяет наличие необработанных виз.
//
// Параметры:
//  Ответственный - СправочникСсылка.Пользователи - Пользователь, для которого собирается информация
//                                                  о необработанных визах. Если значение не заполнено,
//		                                            определяется для текущего пользователя.
// Возвращаемое значение:
//  Булево - Наличие необработанных виз.
//
Функция ЕстьНеобработанныеВизы(Ответственный = Неопределено) Экспорт
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор); 
	
	ПараметрыПолучения = НовыеПараметрыЗаполненияТаблицыВизирования();
	ПараметрыПолучения.Ответственный            = Ответственный;
	ПараметрыПолучения.МатрицаДоступа           = МатрицаДоступа(Ответственный);
	ПараметрыПолучения.ВыводитьВТаблицуЗначений = Истина;
	
	ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);	
	Результат = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ТаблицаДокументов = Результат.РезультатТаблицаЗначений;
	Возврат (ТаблицаДокументов.Количество() > 0);
	
КонецФункции

// Возвращает описание нового элемента для внешнего отбора.
//
// Возвращаемое значение:
//  Структура.
//
Функция НовыйЭлементВнешнегоОтбора() Экспорт
	
	ЭлементОтбора = Новый Структура;
	ЭлементОтбора.Вставить("ЛевоеЗначение");
	ЭлементОтбора.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
	ЭлементОтбора.Вставить("ПравоеЗначение");
	ЭлементОтбора.Вставить("Представление");
	
	Возврат ЭлементОтбора;
	
КонецФункции

// Процедура проверяет наличие необработанных виз для пользователя.
//
// Параметры:
//  ПараметрыПолучения - Структура.
//  АдресВХранилище	   - Строка - Адрес временного хранилища результата проверки.
// 
Процедура ПроверитьНаличиеНеобработанныхВиз(ПараметрыПолучения, АдресВХранилище = "") Экспорт
	
	РезультатПроверки = ЕстьНеобработанныеВизы(ПараметрыПолучения.Ответственный);
	ПоместитьВоВременноеХранилище(РезультатПроверки, АдресВХранилище);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция выполняет установку решения по визе.
//
// Параметры:
//  ПараметрыПринятияРешения - Структура - см. НовыеПараметрыПринятияРешения().
//	СообщенияПользователю - Массив - Для вывода сообщений пользователю при выполнении в фоновом режиме.
//
// Возвращаемое значение:
//  Булево - Истина: решение установлено, Ложи: в противном случае.
//
Функция УстановитьРешениеПоВизе(ПараметрыПринятияРешения, СообщенияПользователю = Неопределено) Экспорт
	
	ОбъектВизирования = ПараметрыПринятияРешения.ОбъектВизирования;
	
	Если НЕ ЗначениеЗаполнено(ОбъектВизирования) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		Блокировка        = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.бит_УстановленныеВизы");
		ЭлементБлокировки.УстановитьЗначение("Объект", ОбъектВизирования);
		Блокировка.Заблокировать();
		
		ТекНаборВизы = РегистрыСведений.бит_УстановленныеВизы.СоздатьНаборЗаписей();
		ТекНаборВизы.Отбор.Объект.Установить(ОбъектВизирования);
		ТекНаборВизы.Прочитать();
		
		Алгоритм          = бит_ВизированиеСервер.ПолучитьАлгоритмПоНаборуВиз(ТекНаборВизы);
		ВыполнятьПоэтапно = бит_УправлениеПроцессами.ВыполнятьАлгоритмПоэтапно(Алгоритм);
		ПараметрыКонтекста = Новый Структура;
		ПараметрыКонтекста.Вставить("ТекущийОбъект", ОбъектВизирования);
		ПараметрыКонтекста.Вставить("Алгоритм",      Алгоритм);
		ПараметрыКонтекста.Вставить("НаборВизы",     ТекНаборВизы);
		
		ТочкиОбработок      = Новый Массив;
		
		ПринятоеРешение     = ПараметрыПринятияРешения.Решение;
		РежимОчисткиРешения = НЕ ЗначениеЗаполнено(ПринятоеРешение); 
		
		НаборМодифицирован  = Ложь;
		Для каждого ЗаписьНабора Из ТекНаборВизы Цикл
			Если ЗаписьНабора.ИД <> ПараметрыПринятияРешения.ИДВизы Тогда
				Продолжить;
			КонецЕсли;
			
			Если РежимОчисткиРешения Тогда
				// Отмена принятого решения.
				ЗаписьНабора.Решение       = Неопределено;
				ЗаписьНабора.Пользователь  = Неопределено;
				ЗаписьНабора.ДатаУстановки = Неопределено;
				ЗаписьНабора.Комментарий   = Неопределено;
			Иначе
				ЗаписьНабора.Решение       = ПринятоеРешение;
				ЗаписьНабора.Пользователь  = ПараметрыПринятияРешения.ТекущийПользователь;
				ЗаписьНабора.ДатаУстановки = ПараметрыПринятияРешения.ДатаУстановкиРешения;
				ЗаписьНабора.Комментарий   = ПараметрыПринятияРешения.Комментарий;
			КонецЕсли;
			
			ПараметрыПоследующихТочек = бит_УправлениеПроцессами.ТочкиДействияПослеТекущей(ЗаписьНабора.ТочкаАлгоритма,
																								ПараметрыКонтекста);
			Если НЕ РежимОчисткиРешения Тогда
				Для каждого ТочкаОбработки Из ПараметрыПоследующихТочек.ТочкиОбработок Цикл
					ТочкиОбработок.Добавить(ТочкаОбработки);
				КонецЦикла;
			КонецЕсли;
			
			Если ВыполнятьПоэтапно Тогда
				// Для цикличных алгоритмов необходима очистка решений на которые возвращается выполнение.
				ТочкиДействия = ПараметрыПоследующихТочек.ТочкиДействия;
				Для каждого ТочкаДействия Из ТочкиДействия Цикл
					Для каждого ЗаписьДляОчисткиРешения Из ТекНаборВизы Цикл	
						Если ЗаписьДляОчисткиРешения.ТочкаАлгоритма = ТочкаДействия
							И ЗначениеЗаполнено(ЗаписьДляОчисткиРешения.Решение) Тогда
							ЗаписьДляОчисткиРешения.Решение       = Неопределено;
							ЗаписьДляОчисткиРешения.Пользователь  = Неопределено;
							ЗаписьДляОчисткиРешения.ДатаУстановки = Неопределено;
							ЗаписьДляОчисткиРешения.Комментарий   = Неопределено;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			
			НаборМодифицирован = Истина;
			Прервать;
		КонецЦикла;
		
		бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(ТочкиОбработок);
		Справочники.бит_ПользовательскиеДействия.ВыполнитьТочкиОбработки(ТочкиОбработок, ПараметрыКонтекста);
		
		УспешноеВыполнение = Ложь;
		
		Если НаборМодифицирован Тогда
			
			Если СообщенияПользователю <> Неопределено Тогда
				ТекНаборВизы.ДополнительныеСвойства.Вставить("СообщенияПользователю", СообщенияПользователю);
			КонецЕсли;
			
			Если ТекНаборВизы.ПроверитьЗаполнение() Тогда
				ТекНаборВизы.ДополнительныеСвойства.Вставить("ОтключитьРегистрациюОповещений", Истина);
				ТекНаборВизы.Записать();
				ТекНаборВизы.ДополнительныеСвойства.Удалить("ОтключитьРегистрациюОповещений");
			КонецЕсли;
			
			ДокОбъект  = ОбъектВизирования.ПолучитьОбъект();
			МетаОбъект = ДокОбъект.Метаданные();
			Если РежимОчисткиРешения Тогда
				ДокОбъект.ДополнительныеСвойства.Вставить("РежимОчисткиРешения", Истина);
			КонецЕсли;
			
			бит_ВизированиеСервер.ДовыполнитьАлгоритмВизирования(ДокОбъект, ТекНаборВизы, Ложь);
			бит_ВизированиеСервер.УстановитьКрайниеДатыВизирования(ОбъектВизирования, ТекНаборВизы, Ложь);
			
			Если ТекНаборВизы.ПроверитьЗаполнение() Тогда
				
				ТекНаборВизы.Записать();
				
				МодульВизирование = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
				бит_ВизированиеСервер.УстановитьСтатус(ДокОбъект);
				бит_ВизированиеСервер.ПровестиВСтатусеУтверждено(ДокОбъект, МетаОбъект, ПараметрыПринятияРешения.ПроводитьПослеУтверждения, "Ошибки");
				МодульВизирование.СоздатьДоговорВСтатусеУтвержден(ДокОбъект);
				УспешноеВыполнение = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если УспешноеВыполнение Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Ошибка при установке решения. %1';
								|en = 'Errors during setting desition. %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Если СообщенияПользователю = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе
			СообщенияПользователю.Добавить(ТекстСообщения);
		КонецЕсли;
	КонецПопытки;
	
	Возврат УспешноеВыполнение;
	
КонецФункции

// Функция собирает данные текущего пользователя о доступных визах и пользовательских условиях
//
// Параметры:
//  Ответственный - СправочникСсылка.Пользователи (необязательный). Пользователь,
//		для которого собирается информация о доступных визах. Если значение не заполнено,
//		определяется доступность для текущего пользователя.
// Возвращаемое значение:
//  ТаблицаЗначений.
// 
Функция МатрицаДоступа(Ответственный = Неопределено) Экспорт
	
	Если Ответственный = Неопределено Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если бит_ОбщегоНазначения.ПользовательНеактивен(Ответственный) Тогда
		ПустаяМатрица = Новый ТаблицаЗначений;
		ПустаяМатрица.Колонки.Добавить("Виза", Новый ОписаниеТипов("СправочникСсылка.бит_Визы"));
		ПустаяМатрица.Колонки.Добавить("ПолныйДоступ", Новый ОписаниеТипов("Булево"));
		ПустаяМатрица.Колонки.Добавить("УсловиеДоступа", Новый ОписаниеТипов("СправочникСсылка.бит_ПользовательскиеУсловия"));
		ПустаяМатрица.Колонки.Добавить("ОбъектДоступа", Новый ОписаниеТипов("СправочникСсылка.бит_ОбъектыСистемы"));
		Возврат ПустаяМатрица; 
	КонецЕсли;
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГруппыПользователейПользователиГруппы.Ссылка КАК ПользовательГруппа
	|ПОМЕСТИТЬ ПользователиИГруппы
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейПользователиГруппы
	|ГДЕ
	|	ГруппыПользователейПользователиГруппы.Пользователь = &Ответственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПользователиИГруппы.ПользовательГруппа КАК ПользовательГруппа,
	|	бит_ПраваУстановкиВиз.Виза КАК ВизаГруппа,
	|	бит_ПраваУстановкиВиз.ПользовательскоеУсловие КАК ПользовательскоеУсловие
	|ПОМЕСТИТЬ ПраваДоступаПоГруппам
	|ИЗ
	|	ПользователиИГруппы КАК ПользователиИГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПраваУстановкиВиз КАК бит_ПраваУстановкиВиз
	|		ПО ПользователиИГруппы.ПользовательГруппа = бит_ПраваУстановкиВиз.Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ПраваДоступаПоГруппам.ВизаГруппа КАК Справочник.бит_Визы) КАК Виза,
	|	ПраваДоступаПоГруппам.ПользовательскоеУсловие КАК ПользовательскоеУсловие
	|ПОМЕСТИТЬ МатицаДоступаКВизам
	|ИЗ
	|	ПраваДоступаПоГруппам КАК ПраваДоступаПоГруппам
	|ГДЕ
	|	ПраваДоступаПоГруппам.ВизаГруппа ССЫЛКА Справочник.бит_Визы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_ГруппыВизВизыГруппы.Виза,
	|	ПраваДоступаПоГруппам.ПользовательскоеУсловие
	|ИЗ
	|	ПраваДоступаПоГруппам КАК ПраваДоступаПоГруппам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ГруппыВиз.ВизыГруппы КАК бит_ГруппыВизВизыГруппы
	|		ПО ПраваДоступаПоГруппам.ВизаГруппа = бит_ГруппыВизВизыГруппы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_Визы.Ссылка,
	|	ПраваДоступаПоГруппам.ПользовательскоеУсловие
	|ИЗ
	|	ПраваДоступаПоГруппам КАК ПраваДоступаПоГруппам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_Визы КАК бит_Визы
	|		ПО (ПраваДоступаПоГруппам.ВизаГруппа = ЗНАЧЕНИЕ(Справочник.бит_ГруппыВиз.ВсеВизы))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатицаДоступаКВизам.Виза КАК Виза
	|ПОМЕСТИТЬ ВизыБезусловногоДоступа
	|ИЗ
	|	МатицаДоступаКВизам КАК МатицаДоступаКВизам
	|ГДЕ
	|	МатицаДоступаКВизам.ПользовательскоеУсловие = ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеУсловия.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВизыБезусловногоДоступа.Виза КАК Виза,
	|	ИСТИНА КАК ПолныйДоступ,
	|	ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеУсловия.ПустаяСсылка) КАК УсловиеДоступа,
	|	НЕОПРЕДЕЛЕНО КАК ОбъектДоступа
	|ИЗ
	|	ВизыБезусловногоДоступа КАК ВизыБезусловногоДоступа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МатицаДоступаКВизам.Виза,
	|	ЛОЖЬ,
	|	МатицаДоступаКВизам.ПользовательскоеУсловие,
	|	ОбъектыСистемыУсловия.ОбъектСистемы
	|ИЗ
	|	МатицаДоступаКВизам КАК МатицаДоступаКВизам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВизыБезусловногоДоступа КАК ВизыБезусловногоДоступа
	|		ПО МатицаДоступаКВизам.Виза = ВизыБезусловногоДоступа.Виза
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ПользовательскиеУсловия.ОбъектыСистемы КАК ОбъектыСистемыУсловия
	|		ПО МатицаДоступаКВизам.ПользовательскоеУсловие = ОбъектыСистемыУсловия.Ссылка
	|ГДЕ
	|	ВизыБезусловногоДоступа.Виза ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	ТаблицаДоступа = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДоступа;	
	
КонецФункции

// Процедура получает при помощи СКД таблицу документов для визирования.
//
// Параметры:
//  ПараметрыПолучения	 - Структура - см. НовыеПараметрыЗаполненияТаблицыВизирования().
//  АдресВХранилище		 - Строка	 - Адрес временного хранилища результатов заполнения таблицы.
//
Процедура ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище = "") Экспорт
	
	Ответственный = ПараметрыПолучения.Ответственный;
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда	
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Настройки	            = ПараметрыПолучения.НастройкиКомпоновщика;
	СхемаКомпоновкиДанных   = ПараметрыПолучения.СхемаКомпоновкиДанных;
	
	ДанныеТабличногоДокумента = ПараметрыПолучения.ДанныеТабличногоДокумента;
	ВыводВТабличныйДокумент   = ПараметрыПолучения.ВыводитьВТабличныйДокумент;
	ВыводВТаблицуЗначений     = ПараметрыПолучения.ВыводитьВТаблицуЗначений;
	
	ДанныеТабличногоДокумента.Очистить();
	СоответствиеОбъектовСистемы = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = ТекстЗапросаПравДоступа();
	ТаблицаДоступа = ПараметрыПолучения.МатрицаДоступа;
	Запрос.УстановитьПараметр("ТаблицаДоступа", ТаблицаДоступа);
	Запрос.УстановитьПараметр("ФильтрВизы"    , ПараметрыПолучения.Отбор.Виза);
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаНачальнаяВыборкаАктивныхВиз(ПараметрыПолучения);
	Запрос.УстановитьПараметр("ОтборОбъектВизирования", ПараметрыПолучения.Отбор.ОбъектВизирования);
	Запрос.УстановитьПараметр("ТипыОбъектовВизирования", ПараметрыПолучения.Отбор.ТипОбъекта);
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	РезультатЗапросаТипыОбъектов = Запрос.Выполнить();
	ТипыОбъектовВизирования = РезультатЗапросаТипыОбъектов.Выгрузить().ВыгрузитьКолонку("ТипОбъектаВизирования");
	Если ТипыОбъектовВизирования.Количество() = 0 Тогда
		// Визы отсутствуют, создадим шаблон полей для первого документа из типа.
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Метаданные.ОпределяемыеТипы.бит_ОбъектыВизирования.Тип.Типы()[0]);
		ОписаниеТиповОбъектов = Новый ОписаниеТипов(МассивТипов);
	Иначе
		ОписаниеТиповОбъектов = Новый ОписаниеТипов(ТипыОбъектовВизирования);
	КонецЕсли;
	Запрос.Текст = ТекстЗапросаВыбратьВизы(ОписаниеТиповОбъектов);
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаСмешанныеПоляШапкиТЧ(ОписаниеТиповОбъектов);
	ТаблицаСмешанныхПолей = Запрос.Выполнить().Выгрузить();
	
	ТаблицаВизы                 = ОписаниеТаблицыИсточникаСКД(ОписаниеТиповОбъектов);
	
	ЕстьФильтрыРолевойАдресации = НаложитьОтборыРолевойАдресации(Запрос, ПараметрыПолучения);
	
	Запрос.Текст = ТекстЗапросаДетальныеЗаписиВиз(ПараметрыПолучения, ОписаниеТиповОбъектов, ЕстьФильтрыРолевойАдресации);
	ВыборкаОбъектовВизирования = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОбъектовВизирования.Следующий() Цикл
		ОбъектВизирования = ВыборкаОбъектовВизирования.ОбъектВизирования;
		ВыборкаВиз = ВыборкаОбъектовВизирования.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВиз.Следующий() Цикл
			ВыборкаУсловийДоступа = ВыборкаВиз.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ВизаДоступна = Ложь;
			Если ВыборкаВиз.ПолныйДоступ
				ИЛИ ВыборкаВиз.ДоступРолевойАдресации = 2 Тогда // Разрешен доступ по ролевой адресации пользовательского условия.
				ВизаДоступна = Истина;
				ВыборкаУсловийДоступа.Следующий();
			Иначе
				Пока ВыборкаУсловийДоступа.Следующий() Цикл
					Если ВыборкаУсловийДоступа.ДоступРолевойАдресации = 1 Тогда
						// Запрещен доступ по ролевой адресации пользовательского условия.
						Продолжить;
					КонецЕсли;
					Если ВыполняетсяПользовательскоеУсловие(ОбъектВизирования
															,ВыборкаУсловийДоступа.УсловиеДоступа
															,Ответственный) Тогда
						ВизаДоступна = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Если ВизаДоступна Тогда
				ВыборкаДетальныхЗаписей = ВыборкаУсловийДоступа.Выбрать();
				Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
					НоваяЗаписьВизы = ТаблицаВизы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗаписьВизы, ВыборкаДетальныхЗаписей);
					НоваяЗаписьВизы.ОбъектСистемы = ОбъектСистемыДокумент(СоответствиеОбъектовСистемы, ВыборкаДетальныхЗаписей.ТипОбъектаВизирования);
					Если ВыборкаДетальныхЗаписей.ПересчитатьСумму Тогда
						СуммаИВалюта = СуммаИВалютаДокумента(ВыборкаДетальныхЗаписей.ОбъектВизирования, ВыборкаДетальныхЗаписей.Дата);
						ЗаполнитьЗначенияСвойств(НоваяЗаписьВизы, СуммаИВалюта);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаПолейСоединенияСтрок = ОписаниеТаблицыПолейСоединенияСтрок(ОписаниеТиповОбъектов);
	Запрос.Текст = ТекстЗапросаПолейСоединения(ОписаниеТиповОбъектов);
	ВыборкаПолейСоединения = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПолейСоединения.Следующий() Цикл
		НоваяСтрока = ТаблицаПолейСоединенияСтрок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПолейСоединения);
		Для каждого Колонка Из ТаблицаПолейСоединенияСтрок.Колонки Цикл
			Если НЕ ЗначениеЗаполнено(НоваяСтрока[Колонка.Имя]) Тогда
				НоваяСтрока[Колонка.Имя] = NULL;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если СхемаКомпоновкиДанных <> Неопределено Тогда
		Схема = СхемаКомпоновкиДанных;
	Иначе
		Схема = Обработки.бит_КонсольОперативногоВизирования.ПолучитьМакет("СхемаКомпоновкиДанных");
	КонецЕсли;
	
	// Временное сохранение расшифровки данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	ЭтоМобильноеПриложение = ПараметрыПолучения.ЭтоМобильноеПриложение;
	Если ЭтоМобильноеПриложение Тогда	
		ВариантНастроек = Схема.ВариантыНастроек.Найти("МобильноеПриложение");
		Настройки = ВариантНастроек.Настройки;
	ИначеЕсли ПараметрыПолучения.ЭтоОповещения Тогда	
		ВариантНастроек = Схема.ВариантыНастроек.Найти("Оповещения");
		// АПК:277-выкл вызов механизмов типовой конфигурации.
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(ВариантНастроек.Настройки.Отбор, Настройки.Отбор);
		// АПК:277-вкл
		Настройки = ВариантНастроек.Настройки;
	ИначеЕсли ПараметрыПолучения.ПолучатьНастройкиКомпоновщика = Ложь Тогда
		Настройки = Схема.НастройкиПоУмолчанию; 	
	КонецЕсли;
	
	УстановитьПараметрыДанных(Настройки, ПараметрыПолучения);
	УстановитьПараметрыВывода(Настройки, ПараметрыПолучения);
	
	// Настройка группировки отчета.
	Если НЕ ЭтоМобильноеПриложение
		И НЕ ПараметрыПолучения.ЭтоОповещения Тогда
		НастроитьГруппировкиОтчета(Настройки, ПараметрыПолучения.ГруппировкаОтчета);
	КонецЕсли;
	
	// Ограничение типов: если в составе типа будут содержаться документы, недоступные пользователю, то вложенные поля
	//  не будут выводиться в отчет, даже если чтение будет производиться исключительно из доступных объектов.
	
	Для каждого КолонкаАналитики Из ТаблицаПолейСоединенияСтрок.Колонки Цикл
		ИмяКолонки = КолонкаАналитики.Имя;
		Если СтрНайти(ИмяКолонки, "Аналитика_") = 0
			И НЕ (бит_ОбщегоНазначения.ЭтоСемействоERP()
				И (ИмяКолонки = "ДатаПлан"
					ИЛИ ИмяКолонки = "ДатаПланКрайняя")) Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеАналитикиСКД = Схема.НаборыДанных.ТаблицаПолейСоединенияСтрок.Поля.Найти(ИмяКолонки);
		Если НЕ ПустаяСтрока(КолонкаАналитики.Заголовок) Тогда
			ПолеАналитикиСКД.Заголовок = КолонкаАналитики.Заголовок;
			Если СтрНайти(ИмяКолонки, "Аналитика_") <> 0 Тогда
				ПолеАналитикиСКД.Заголовок = ПолеАналитикиСКД.Заголовок + " (Аналитика)";
			КонецЕсли;
		КонецЕсли;
		УстановитьОграниченияИспользованияПоляСКД(Схема, "ТаблицаПолейСоединенияСтрок", ИмяКолонки, Ложь);
		ПолеАналитикиСКД.ТипЗначения = КолонкаАналитики.ТипЗначения;
	КонецЦикла;
	
	УстановитьОграниченияИспользованияПоляСКД(Схема,
											"ТаблицаВизы",
											"ИД",
											НЕ ЭтоМобильноеПриложение);
	УстановитьОграниченияИспользованияПоляСКД(Схема,
											"ТаблицаСмешанныхПолей",
											"СтатьяОборотовСмешанная",
											НЕ ЭтоМобильноеПриложение);
	УстановитьОграниченияИспользованияПоляСКД(Схема,
											"ТаблицаСмешанныхПолей",
											"ВизаСмешанная",
											НЕ ЭтоМобильноеПриложение);
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		УстановитьОграниченияИспользованияПоляСКД(Схема,
											"ТаблицаПолейСоединенияСтрок",
											"ОбъектРасчетов");
		УстановитьОграниченияИспользованияПоляСКД(Схема,
											"ТаблицаПолейСоединенияСтрок",
											"Договор");
	Иначе
		ПолеНабора = Схема.НаборыДанных.ТаблицаПолейСоединенияСтрок.Поля.Найти("ОбъектРасчетов");
		ПолеНабора.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов");
		
		ПолеНабора = Схема.НаборыДанных.ТаблицаПолейСоединенияСтрок.Поля.Найти("Договор");
		ПолеНабора.ТипЗначения =
			Новый ОписаниеТипов("СправочникСсылка.ДоговорыМеждуОрганизациями, СправочникСсылка.ДоговорыКонтрагентов");
	КонецЕсли;
	
	ПолеКрайнейДаты     = Схема.НаборыДанных.ТаблицаВизы.Поля.Найти("ДатаКрайняя");
	Если ПараметрыПолучения.РежимАрхива Тогда
		ПолеКрайнейДаты.Заголовок = НСтр("ru = 'Дата установки';
										|en = 'Set date'");
	Иначе
		ПолеКрайнейДаты.Заголовок = НСтр("ru = 'Установить не позднее';
										|en = 'Set no later than'");
	КонецЕсли;
	
	ПолеКомпоновкиЭлементУправления = Новый ПолеКомпоновкиДанных("ЭлементУправления");
	НомерКолонкиЭлементУправления = ПозицияВыбранногоПоля(Настройки, ПолеКомпоновкиЭлементУправления); 
	Если ВыводВТабличныйДокумент И НомерКолонкиЭлементУправления = 0 Тогда
		ВызватьИсключение НСтр("ru = 'В выбранных полях должно обязательно присутствовать поле ""Элемент управления"".';
						  	   |en = 'Selected fields must have ""Control"" column.'");
	КонецЕсли;
	
	ПолеКомпоновкиЕстьФайлыКартинка = Новый ПолеКомпоновкиДанных("ЕстьФайлыКартинка");
	НомерКолонкиКартинкаЕстьФайл = ПозицияВыбранногоПоля(Настройки, ПолеКомпоновкиЕстьФайлыКартинка); 
	
	СлужебныеПоля = Новый СписокЗначений;
	СлужебныеПоля.Добавить(ПолеКомпоновкиЭлементУправления);
	СлужебныеПоля.Добавить(ПолеКомпоновкиЕстьФайлыКартинка);
	СлужебныеПоля.Добавить(Новый ПолеКомпоновкиДанных("СрокВыполнения"));
	СлужебныеПоля.Добавить(Новый ПолеКомпоновкиДанных("ИД"));
	ПорядокИЗаголовкиПолей = ПорядокИЗаголовкиПолейСхемы(ПараметрыПолучения, Схема, Настройки, СлужебныеПоля);
	УстановитьВнешниеОтборы(ПараметрыПолучения, Настройки);
	
	// Внешние наборы данных.
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаВизы"          , ТаблицаВизы);
	ВнешниеНаборыДанных.Вставить("ТаблицаСмешанныхПолей", ТаблицаСмешанныхПолей);
	ВнешниеНаборыДанных.Вставить("ТаблицаПолейСоединенияСтрок", ТаблицаПолейСоединенияСтрок);
	
	РезультатТабличныйДокумент = Новый ТабличныйДокумент;
	Если ВыводВТабличныйДокумент Тогда
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки   = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.ОтображатьПроцентВывода = Истина;
		ПроцессорВывода.УстановитьДокумент(РезультатТабличныйДокумент); 	
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		КолСтрокТаблицы   = РезультатТабличныйДокумент.ВысотаТаблицы; // Количество строк в отчете.
		
		ПорядковыйНомер = 1;
		
		ТипыРешений = Новый Соответствие;
		// Обходим все строки отчета.
		Для НомСтр = 1 По КолСтрокТаблицы Цикл
			ТекОбласть = РезультатТабличныйДокумент.Область(НомСтр, НомерКолонкиЭлементУправления);  
			Если ЭтоУправляющаяОбласть(ТекОбласть.Текст) Тогда
				ТекОбласть.Текст    = "";
				ТекОбласть.Картинка = КартинкаБиблиотеки("ФлагВыбораЛожь");
				
				Если ТекОбласть.Расшифровка <> Неопределено Тогда
					ЗначенияПолейРасшифровки = ДанныеРасшифровки.Элементы[ТекОбласть.Расшифровка].ПолучитьПоля();
					
					НоваяСтрока = ДанныеТабличногоДокумента.Добавить();
					НоваяСтрока.Обрабатывать = Ложь;
					Для каждого ЗначениеРасшифровки Из ЗначенияПолейРасшифровки Цикл
						НоваяСтрока[ЗначениеРасшифровки.Поле] = ЗначениеРасшифровки.Значение;
					КонецЦикла;
					НоваяСтрока.НомерПП = ПорядковыйНомер;
					ПорядковыйНомер = ПорядковыйНомер + 1;
					
					ТекОбласть.Имя = ИдентификаторЭлементаУправленияКартинки() + НоваяСтрока.ИД;
					
					ПараметрыСтроки = Новый Структура;
					ПараметрыСтроки.Вставить("ПринятоеРешение", НоваяСтрока.ПринятоеРешение);
					ПараметрыСтроки.Вставить("Обрабатывать", Ложь);
					ПараметрыОформленияЭУ = ПараметрыОформленияЭлементаУправления(ПараметрыСтроки, ТипыРешений);
					ТекОбласть.Картинка   = ПараметрыОформленияЭУ.Картинка;
				КонецЕсли;
			// АПК:1297-выкл Строковые параметры.
			// АПК:1392-выкл Строковые параметры.
			ИначеЕсли ТекОбласть.Текст = "Элемент управления"
				ИЛИ ТекОбласть.Текст = "Control" Тогда
			// АПК:1392-вкл
			// АПК:1297-вкл
				ТекОбласть.Текст = ""; // Заголовок.
			КонецЕсли;
			
			Если НомерКолонкиКартинкаЕстьФайл <> 0 Тогда
				ТекОбласть = РезультатТабличныйДокумент.Область(НомСтр, НомерКолонкиКартинкаЕстьФайл);  
				Если ТекстСодержитИдентификаторКартинки(ТекОбласть.Текст) Тогда
					ПараметрыИзвлеченияКартинки = ПараметрыИзвлеченияКартинки(ТекОбласть.Текст);
					ТекОбласть.Текст    = ПараметрыИзвлеченияКартинки.Текст;
					ТекОбласть.Картинка = ПараметрыИзвлеченияКартинки.Картинка;
				// АПК:1297-выкл Строковые параметры.
				// АПК:1392-выкл Строковые параметры.
				ИначеЕсли ТекОбласть.Текст = "Есть файлы"
					ИЛИ ТекОбласть.Текст = "There are files (picture)" Тогда
				// АПК:1392-вкл
				// АПК:1297-вкл
					ТекОбласть.Текст = ""; // Заголовок.
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатТаблицаЗначений = Новый ТаблицаЗначений;
	Если ВыводВТаблицуЗначений Тогда
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
		МакетКомпоновки   = КомпоновщикМакета.Выполнить(Схема,
														Настройки,
														,
														,
														Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,, Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(РезультатТаблицаЗначений); 	
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	КонецЕсли;
	
	// Возвращаем результаты.
	СтруктураРезультатаОбновления = Новый Структура;
	СтруктураРезультатаОбновления.Вставить("СхемаКомпоновкиДанных", Схема);
	СтруктураРезультатаОбновления.Вставить("РезультатТабличныйДокумент", РезультатТабличныйДокумент);
	СтруктураРезультатаОбновления.Вставить("РезультатТаблицаЗначений", РезультатТаблицаЗначений);
	СтруктураРезультатаОбновления.Вставить("ДанныеРасшифровки", ДанныеРасшифровки);
	СтруктураРезультатаОбновления.Вставить("ДанныеТабличногоДокумента", ДанныеТабличногоДокумента);
	СтруктураРезультатаОбновления.Вставить("НомерКолонкиЭлементУправления", НомерКолонкиЭлементУправления);
	СтруктураРезультатаОбновления.Вставить("ПорядокИЗаголовкиПолей", ПорядокИЗаголовкиПолей);
	
	Если ПараметрыПолучения.ВозвращатьТаблицуВиз Тогда
		СтруктураРезультатаОбновления.Вставить("ТаблицаВизы", ТаблицаВизы);
	Иначе
		СтруктураРезультатаОбновления.Вставить("ТаблицаВизы", Новый ТаблицаЗначений);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(СтруктураРезультатаОбновления, АдресВХранилище);
		
КонецПроцедуры

// Функция - Конструктор параметра функции ЗаполнитьТаблицуВизирования.
// 
// Возвращаемое значение:
//  Структура - параметры получения табличных документов:
//   * Ответственный - СправочникСсылка.Пользователи
//   * НастройкиКомпоновщика  - НастройкиКомпоновкиДанных  - настройки компоновщика данных для СКД
//   * СхемаКомпоновкиДанных - Строка - адрес хранения СКД
//   * ДанныеТабличногоДокумента - ТаблицаЗначений - обрабатываемые данные, связанные с выведенным табличным документом
//   * МатрицаДоступа - ТаблицаЗначений - данные по доступным видам виз с учетом ролевой адресации
//   * ВариантОтбораВиз - Число - тип установленного фильтра по видам виз
//   * ПолучатьНастройкиКомпоновщика - Булево - признак необходимости получения настроек из пользовательских настроек компоновщика
//   * ВыводитьВТабличныйДокумент - Булево - признак необходимости получения результата в виде табличного документа
//   * ВыводитьВТаблицуЗначений - Булево - признак необходимости получения результата в виде таблицы значений
//   * ЭтоМобильноеПриложение - Булево
//   * ЭтоОповещения - Булево
//   * РежимАрхива - Булево
//   * РежимПолученияРеквизитов - Булево
//   * РежимПроверкиОповещений - Булево
//   * ВозвращатьПорядокИЗаголовкиПолей - Булево - признак необходимости определения порядка и заголовков полей
//   * ВозвращатьТаблицуВиз - Булево
//   * ГруппировкаОтчета - Число - вариант группировки для результирующего табличного документа
//   * Отбор - Структура - предопределенные отборы для получения данных:
//		• ОбъектВизирования - Ссылка, СписокЗначений - список объектов визирования
//		• ТипОбъекта - СписокЗначений - список типов объектов визирования
//		• Виза - СписокЗначений - список согласуемых виз.
//
Функция НовыеПараметрыЗаполненияТаблицыВизирования() Экспорт
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("Ответственный",				    Неопределено);
	ПараметрыПолучения.Вставить("НастройкиКомпоновщика",		    Новый НастройкиКомпоновкиДанных);
	ПараметрыПолучения.Вставить("СхемаКомпоновкиДанных",		    Неопределено);
	ПараметрыПолучения.Вставить("ДанныеТабличногоДокумента",	    Новый ТаблицаЗначений);
	ПараметрыПолучения.Вставить("МатрицаДоступа",				    Новый ТаблицаЗначений);
	ПараметрыПолучения.Вставить("ВариантОтбораВиз",				    0);
	ПараметрыПолучения.Вставить("ПолучатьНастройкиКомпоновщика",    Ложь);
	ПараметрыПолучения.Вставить("ВыводитьВТабличныйДокумент",	    Ложь);
	ПараметрыПолучения.Вставить("ВыводитьВТаблицуЗначений", 	    Ложь);
	ПараметрыПолучения.Вставить("ЭтоМобильноеПриложение",		    Ложь);
	ПараметрыПолучения.Вставить("ЭтоОповещения",				    Ложь);
	ПараметрыПолучения.Вставить("РежимАрхива",		                Ложь);
	ПараметрыПолучения.Вставить("РежимПолученияРеквизитов",			Ложь);
	ПараметрыПолучения.Вставить("РежимПроверкиОповещений",          Ложь);
	ПараметрыПолучения.Вставить("ВозвращатьПорядокИЗаголовкиПолей", Ложь);
	ПараметрыПолучения.Вставить("ВозвращатьТаблицуВиз",             Ложь);
	ПараметрыПолучения.Вставить("ГруппировкаОтчета",                0);
	ПараметрыПолучения.Вставить("АвтопозицияРесурсов",              Ложь);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектВизирования", Неопределено);
	Отбор.Вставить("ТипОбъекта",        Новый СписокЗначений);
	Отбор.Вставить("Виза",              Новый СписокЗначений); // При установке отбора по визам необходимо указать параметр ВариантОтбораВиз = 3.
	Отбор.Вставить("ВнешниеОтборы",     Новый Структура); // Устанавливается при получении виз из внешнего интерфейса (например Telegram).
	ПараметрыПолучения.Вставить("Отбор", Отбор);
	
	Возврат ПараметрыПолучения;
	
КонецФункции

Функция ИдентификаторЭлементаУправленияКартинки() Экспорт
	
	Возврат "ЭлементУправленияПолеФлага_";
	
КонецФункции

Функция ЭтоУправляющаяОбласть(ИмяОбласти) Экспорт
	
	ПризнакУправляющейОбласти = ИдентификаторЭлементаУправленияКартинки();
	Если СтрНайти(ИмяОбласти, ПризнакУправляющейОбласти) > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПараметрыОформленияЭлементаУправления(ПараметрыСтроки, ТипыРешений) Экспорт
	
	Полужирный = Ложь;
	Наклонный  = Ложь;
	
	РешениеПринято = ЗначениеЗаполнено(ПараметрыСтроки.ПринятоеРешение);
	Если РешениеПринято Тогда
		ТипРешения = Справочники.бит_ВидыРешенийСогласования.ТипРешенияСогласования(ПараметрыСтроки.ПринятоеРешение,
																					ТипыРешений);
		Если ТипРешения = Перечисления.бит_ТипыРешений.Отклоняющее Тогда
			Картинка  = КартинкаБиблиотеки("Отклонено");
		Иначе	
			Картинка  = КартинкаБиблиотеки("Согласовано");
		КонецЕсли;
		Наклонный = Истина;
	ИначеЕсли ПараметрыСтроки.Обрабатывать Тогда
		Картинка   = КартинкаБиблиотеки("ФлагВыбораИстина");
		Полужирный = Истина;
	Иначе
		Картинка = КартинкаБиблиотеки("ФлагВыбораЛожь");
	КонецЕсли;
	
	ПараметрыОформления = Новый Структура;
	ПараметрыОформления.Вставить("Картинка", Картинка);
	ПараметрыОформления.Вставить("Полужирный", Полужирный);
	ПараметрыОформления.Вставить("Наклонный",  Наклонный);
	
	Возврат ПараметрыОформления;
	
КонецФункции

// Функция получает настройку консоли пользователя по-умолчанию.
//
// Параметры:
//  Ответственный - СправочникСсылка.Пользователи (необязательный). Пользователь,
//		для которого собирается информация о доступных визах. Если значение не заполнено,
//		определяется доступность для текущего пользователя.
// Возвращаемое значение:
//  ВыбраннаяНастройка  - СправочникСсылка.бит_СохраненныеНастройки.
//
Функция НастройкаПоУмолчанию(Ответственный = Неопределено) Экспорт
	
	Если Ответственный = Неопределено Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
		
	// Получим настройку по - умолчанию.
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НаименованиеОбъектаСохраняемыхНастроек(),,, Ответственный);
	
	Если ЗначениеЗаполнено(НастройкаПоУмолчанию) Тогда
		Возврат НастройкаПоУмолчанию;
	КонецЕсли;
	
	// Если настройки по умолчанию нет, попробуем определить последнюю использованную пользователем настройку.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОбъектСистемы", Метаданные.Обработки.бит_КонсольОперативногоВизирования);
	СтруктураПараметров.Вставить("КлючЗначения", "ПоследниеЗначения");
	
	ПоследниеЗначения = РегистрыСведений.бит_СохраненныеЗначения.ПолучитьЗнч(Ответственный, СтруктураПараметров);
	Если ТипЗнч(ПоследниеЗначения) = Тип("Структура") И ПоследниеЗначения.Свойство("Настройка") Тогда
		Возврат ПоследниеЗначения.Настройка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция НаименованиеОбъектаСохраняемыхНастроек() Экспорт
	
	Возврат Метаданные.Обработки.бит_КонсольОперативногоВизирования.ПолноеИмя();
	
КонецФункции

Функция НовыеПараметрыПринятияРешения() Экспорт
	
	ПараметрыРешения = Новый Структура;
	ПараметрыРешения.Вставить("ОбъектВизирования");
	ПараметрыРешения.Вставить("ИДВизы");
	ПараметрыРешения.Вставить("Решение");
	ПараметрыРешения.Вставить("Комментарий", "");
	ПараметрыРешения.Вставить("ДатаУстановкиРешения");
	ПараметрыРешения.Вставить("ПроводитьПослеУтверждения");
	ПараметрыРешения.Вставить("ТекущийПользователь");
	
	ПараметрыРешения.ПроводитьПослеУтверждения = Ложь;
	ПараметрыРешения.ТекущийПользователь       = Пользователи.ТекущийПользователь();
	
	Возврат ПараметрыРешения;
	
КонецФункции

// Процедура устанавливает решение в строке.
//
// Параметры:
//  ПараметрыПолучения	 - Структура - см. НовыеПараметрыУстановкиРешенияВСтроке().
//  АдресВХранилище		 - Строка	 - Адрес временного хранилища результата установки решения.
//
Процедура УстановитьРешениеВСтроке(ПараметрыПолучения, АдресВХранилище = "") Экспорт
	
	ПараметрыОтметкиРешения = НовыеПараметрыПринятияРешения();
	ПараметрыОтметкиРешения.Решение     = ПараметрыПолучения.Решение;
	ПараметрыОтметкиРешения.Комментарий = ПараметрыПолучения.Комментарий;
	ПараметрыОтметкиРешения.ДатаУстановкиРешения = ТекущаяДатаСеанса();
	ПараметрыОтметкиРешения.ТекущийПользователь  = ПараметрыПолучения.ТекущийПользователь;
	
	СообщенияПользователю = Новый Массив;
	
	СтрокаРезультата = ПараметрыПолучения.ПараметрыСтроки;
	СтрокаРезультата.Обрабатывать = Истина; // В случае выбора статуса в строке, обрабатываем всегда.
	УстановитьРешениеПоСтроке(СтрокаРезультата, ПараметрыОтметкиРешения, СообщенияПользователю);
	
	// Возвращаем результаты.
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыСтроки",       СтрокаРезультата);
	Результат.Вставить("СообщенияПользователю", СообщенияПользователю);
	
	ПоместитьВоВременноеХранилище(Результат, АдресВХранилище);
	
КонецПроцедуры

// Функция - Конструктор параметра функции УстановитьРешениеВСтроке.
// 
// Возвращаемое значение:
//  Структура - параметры получения табличных документов:
//   * Решение              - СправочникСсылка.бит_ВидыРешенийСогласования
//   * Комментарий          - Строка
//   * ПараметрыСтроки      - Структура
//   * ТекущийПользователь  - СправочникСсылка.Пользователи
//
Функция НовыеПараметрыУстановкиРешенияВСтроке() Экспорт
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("Решение",              Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка());
	ПараметрыПолучения.Вставить("Комментарий",		    "");
	ПараметрыПолучения.Вставить("ПараметрыСтроки",      Новый Структура);
	ПараметрыПолучения.Вставить("ТекущийПользователь",  Справочники.Пользователи.ПустаяСсылка());
	
	Возврат ПараметрыПолучения;
	
КонецФункции

// Процедура устанавливает решение в отмеченных строках.
//
// Параметры:
//  ПараметрыПолучения	 - Структура - см. НовыеПараметрыПакетнойУстановкиРешения().
//  АдресВХранилище		 - Строка	 - Адрес временного хранилища результата установки решения.
//
Процедура ПакетнаяУстановкаРешения(ПараметрыПолучения, АдресВХранилище = "") Экспорт
	
	ПараметрыОтметкиРешения = НовыеПараметрыПринятияРешения();
	ПараметрыОтметкиРешения.Решение     = ПараметрыПолучения.Решение;
	ПараметрыОтметкиРешения.Комментарий = ПараметрыПолучения.Комментарий;
	ПараметрыОтметкиРешения.ДатаУстановкиРешения = ТекущаяДатаСеанса();
	ПараметрыОтметкиРешения.ТекущийПользователь  = ПараметрыПолучения.ТекущийПользователь;
	
	СообщенияПользователю = Новый Массив;
	
	ДанныеТабличногоДокумента = ПараметрыПолучения.ДанныеТабличногоДокумента;
	Для каждого СтрокаРезультата Из ДанныеТабличногоДокумента Цикл
		УстановитьРешениеПоСтроке(СтрокаРезультата, ПараметрыОтметкиРешения, СообщенияПользователю);
	КонецЦикла;
	
	// Возвращаем результаты.
	Результат = Новый Структура;
	Результат.Вставить("ДанныеТабличногоДокумента", ДанныеТабличногоДокумента);
	Результат.Вставить("СообщенияПользователю",     СообщенияПользователю);
	
	ПоместитьВоВременноеХранилище(Результат, АдресВХранилище);
	
КонецПроцедуры

// Функция - Конструктор параметра функции УстановитьРешениеВСтроке.
// 
// Возвращаемое значение:
//  Структура - параметры получения табличных документов:
//   * Решение              - СправочникСсылка.бит_ВидыРешенийСогласования
//   * Комментарий          - Строка
//   * ПараметрыСтроки      - Структура
//   * ТекущийПользователь  - СправочникСсылка.Пользователи
//
Функция НовыеПараметрыПакетнойУстановкиРешения() Экспорт
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("Решение",                   Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка());
	ПараметрыПолучения.Вставить("Комментарий",		         "");
	ПараметрыПолучения.Вставить("ДанныеТабличногоДокумента", Новый ТаблицаЗначений);
	ПараметрыПолучения.Вставить("ТекущийПользователь",       Справочники.Пользователи.ПустаяСсылка());
	
	Возврат ПараметрыПолучения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеТаблицыВизирования

Функция ТекстЗапросаПравДоступа()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДоступа.Виза КАК Виза,
	|	ТаблицаДоступа.ПолныйДоступ КАК ПолныйДоступ,
	|	ТаблицаДоступа.УсловиеДоступа КАК УсловиеДоступа
	|ПОМЕСТИТЬ ТаблицаДоступа
	|ИЗ
	|	&ТаблицаДоступа КАК ТаблицаДоступа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Виза";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаНачальнаяВыборкаАктивныхВиз(ПараметрыПолучения)
	
	Если ПараметрыПолучения.РежимПолученияРеквизитов Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_УстановленныеВизы.Объект КАК Объект,
		|	бит_УстановленныеВизы.Виза КАК Виза,
		|	бит_УстановленныеВизы.ИД КАК ИД,
		|	бит_УстановленныеВизы.ДатаУстановки КАК ДатаКрайняя,
		|	бит_УстановленныеВизы.Решение КАК ПринятоеРешение
		|ПОМЕСТИТЬ АктивныеВизы
		|ИЗ
		|	РегистрСведений.бит_УстановленныеВизы КАК бит_УстановленныеВизы
		|ГДЕ
		|	&УсловиеПоОбъекту
		|	И &УсловиеПоТипуОбъекта
		|	И &УсловиеПоВизам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ //РАЗРЕШЕННЫЕ
		|	АктивныеВизы.Объект КАК ОбъектВизирования,
		|	АктивныеВизы.Виза КАК Виза,
		|	АктивныеВизы.ИД КАК ИД,
		|	АктивныеВизы.ДатаКрайняя КАК ДатаКрайняя,
		|	АктивныеВизы.ПринятоеРешение КАК ПринятоеРешение,
		|	ИСТИНА КАК ПолныйДоступ,
		|	ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеУсловия.ПустаяСсылка) КАК УсловиеДоступа,
		|	ТИПЗНАЧЕНИЯ(АктивныеВизы.Объект) КАК ТипОбъектаВизирования
		|ПОМЕСТИТЬ НачальнаяВыборкаАктивныхВиз
		|ИЗ
		|	АктивныеВизы КАК АктивныеВизы
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектВизирования";
	ИначеЕсли ПараметрыПолучения.РежимАрхива Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_УстановленныеВизы.Объект КАК Объект,
		|	бит_УстановленныеВизы.Виза КАК Виза,
		|	бит_УстановленныеВизы.ИД КАК ИД,
		|	бит_УстановленныеВизы.ДатаУстановки КАК ДатаКрайняя,
		|	бит_УстановленныеВизы.Решение КАК ПринятоеРешение
		|ПОМЕСТИТЬ АктивныеВизы
		|ИЗ
		|	РегистрСведений.бит_УстановленныеВизы КАК бит_УстановленныеВизы
		|ГДЕ
		|	НЕ бит_УстановленныеВизы.АктивнаяВиза
		|	И бит_УстановленныеВизы.Пользователь = &Ответственный
		|	И &УсловиеПоОбъекту
		|	И &УсловиеПоТипуОбъекта
		|	И &УсловиеПоВизам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ //РАЗРЕШЕННЫЕ
		|	АктивныеВизы.Объект КАК ОбъектВизирования,
		|	АктивныеВизы.Виза КАК Виза,
		|	АктивныеВизы.ИД КАК ИД,
		|	АктивныеВизы.ДатаКрайняя КАК ДатаКрайняя,
		|	АктивныеВизы.ПринятоеРешение КАК ПринятоеРешение,
		|	ИСТИНА КАК ПолныйДоступ,
		|	ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеУсловия.ПустаяСсылка) КАК УсловиеДоступа,
		|	ТИПЗНАЧЕНИЯ(АктивныеВизы.Объект) КАК ТипОбъектаВизирования
		|ПОМЕСТИТЬ НачальнаяВыборкаАктивныхВиз
		|ИЗ
		|	АктивныеВизы КАК АктивныеВизы
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектВизирования";
	ИначеЕсли ПараметрыПолучения.РежимПроверкиОповещений Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_УстановленныеВизы.Объект КАК Объект,
		|	бит_УстановленныеВизы.Виза КАК Виза,
		|	бит_УстановленныеВизы.ИД КАК ИД,
		|	бит_УстановленныеВизы.ДатаКрайняя КАК ДатаКрайняя
		|ПОМЕСТИТЬ АктивныеВизы
		|ИЗ
		|	РегистрСведений.бит_УстановленныеВизы КАК бит_УстановленныеВизы
		|ГДЕ
		|	бит_УстановленныеВизы.АктивнаяВиза
		|	И &УсловиеПоОбъекту
		|	И &УсловиеПоТипуОбъекта
		|	И &УсловиеПоВизам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РегистрацияСобытийОповещений.Объект КАК Объект
		|ПОМЕСТИТЬ Оповещения
		|ИЗ
		|	РегистрСведений.бит_фн_РегистрацияСобытийОповещений КАК РегистрацияСобытийОповещений
		|ГДЕ
		|	РегистрацияСобытийОповещений.Оповещение.НеРегистрироватьПовторно
		|	И РегистрацияСобытийОповещений.Оповещение.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования)
		|	И РегистрацияСобытийОповещений.Пользователь = &Ответственный
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ //РАЗРЕШЕННЫЕ
		|	АктивныеВизы.Объект КАК ОбъектВизирования,
		|	АктивныеВизы.Виза КАК Виза,
		|	АктивныеВизы.ИД КАК ИД,
		|	АктивныеВизы.ДатаКрайняя КАК ДатаКрайняя,
		|	ЗНАЧЕНИЕ(Справочник.бит_ВидыРешенийСогласования.ПустаяСсылка) КАК ПринятоеРешение,
		|	ТаблицаДоступа.ПолныйДоступ КАК ПолныйДоступ,
		|	ТаблицаДоступа.УсловиеДоступа КАК УсловиеДоступа,
		|	ТИПЗНАЧЕНИЯ(АктивныеВизы.Объект) КАК ТипОбъектаВизирования
		|ПОМЕСТИТЬ НачальнаяВыборкаАктивныхВиз
		|ИЗ
		|	АктивныеВизы КАК АктивныеВизы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДоступа КАК ТаблицаДоступа
		|		ПО АктивныеВизы.Виза = ТаблицаДоступа.Виза
		|		ЛЕВОЕ СОЕДИНЕНИЕ Оповещения КАК Оповещения
		|		ПО АктивныеВизы.Объект = Оповещения.Объект
		|ГДЕ
		|	Оповещения.Объект ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектВизирования";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_УстановленныеВизы.Объект КАК Объект,
		|	бит_УстановленныеВизы.Виза КАК Виза,
		|	бит_УстановленныеВизы.ИД КАК ИД,
		|	бит_УстановленныеВизы.ДатаКрайняя КАК ДатаКрайняя
		|ПОМЕСТИТЬ АктивныеВизы
		|ИЗ
		|	РегистрСведений.бит_УстановленныеВизы КАК бит_УстановленныеВизы
		|ГДЕ
		|	бит_УстановленныеВизы.АктивнаяВиза
		|	И &УсловиеПоОбъекту
		|	И &УсловиеПоТипуОбъекта
		|	И &УсловиеПоВизам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ //РАЗРЕШЕННЫЕ
		|	АктивныеВизы.Объект КАК ОбъектВизирования,
		|	АктивныеВизы.Виза КАК Виза,
		|	АктивныеВизы.ИД КАК ИД,
		|	АктивныеВизы.ДатаКрайняя КАК ДатаКрайняя,
		|	ЗНАЧЕНИЕ(Справочник.бит_ВидыРешенийСогласования.ПустаяСсылка) КАК ПринятоеРешение,
		|	ТаблицаДоступа.ПолныйДоступ КАК ПолныйДоступ,
		|	ТаблицаДоступа.УсловиеДоступа КАК УсловиеДоступа,
		|	ТИПЗНАЧЕНИЯ(АктивныеВизы.Объект) КАК ТипОбъектаВизирования
		|ПОМЕСТИТЬ НачальнаяВыборкаАктивныхВиз
		|ИЗ
		|	АктивныеВизы КАК АктивныеВизы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДоступа КАК ТаблицаДоступа
		|		ПО АктивныеВизы.Виза = ТаблицаДоступа.Виза
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектВизирования";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачальнаяВыборкаАктивныхВиз.ТипОбъектаВизирования КАК ТипОбъектаВизирования
	|ИЗ
	|	НачальнаяВыборкаАктивныхВиз КАК НачальнаяВыборкаАктивныхВиз";
	
	ОтборОбъектВизирования = ПараметрыПолучения.Отбор.ОбъектВизирования;
	ТекстЗапроса           = СтрЗаменить(ТекстЗапроса, "&УсловиеПоОбъекту",
								ТекстФильтраОбъектВизирования(ОтборОбъектВизирования));
								
	ТипыОбъектовВизирования = ПараметрыПолучения.Отбор.ТипОбъекта;
	ТекстЗапроса            = СтрЗаменить(ТекстЗапроса, "&УсловиеПоТипуОбъекта",
								ТекстФильтраТипыОбъектов(ТипыОбъектовВизирования));
	
	ВариантОтбораВиз = ПараметрыПолучения.ВариантОтбораВиз;
	ТекстЗапроса     = СтрЗаменить(ТекстЗапроса, "&УсловиеПоВизам",
						ТекстФильтраВизы(ВариантОтбораВиз));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВыбратьВизы(ОписаниеТиповВиз)
	
	МассивПредрасчетныхРеквизитов = ПредрасчетныеРеквизиты();
	ДобавитьПредрасчетныйРеквизит(МассивПредрасчетныхРеквизитов, "Организация");
	
	ТипыВиз   = ОписаниеТиповВиз.Типы();
	ПервыйТип = Истина;	
	
	ТекстЗапроса = "УНИЧТОЖИТЬ АктивныеВизы";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Для каждого ТипВизы Из ТипыВиз Цикл
		
		МетаданныеОбъектаВизирования = ПустоеЗначениеТипа(ТипВизы).Метаданные();
		ПолноеИмяМетаданного         = МетаданныеОбъектаВизирования.ПолноеИмя();
		
		Если ПервыйТип Тогда
			ШаблонВыборки =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	АктивныеВизы.ОбъектВизирования КАК ОбъектВизирования,
			|	АктивныеВизы.Виза КАК Виза,
			|	АктивныеВизы.ИД КАК ИД,
			|	АктивныеВизы.ДатаКрайняя КАК ДатаКрайняя,
			|	АктивныеВизы.ПринятоеРешение КАК ПринятоеРешение,
			|	АктивныеВизы.ПолныйДоступ КАК ПолныйДоступ,
			|	АктивныеВизы.УсловиеДоступа КАК УсловиеДоступа,
			|	АктивныеВизы.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
			|	&МассивПредрасчетныхРеквизитов КАК МассивПредрасчетныхРеквизитов
			|ПОМЕСТИТЬ ОтборныеВизы
			|ИЗ
			|	НачальнаяВыборкаАктивныхВиз КАК АктивныеВизы
			|ГДЕ
			|	АктивныеВизы.ОбъектВизирования ССЫЛКА Документ.бит_ФормаВводаБюджета
			|	И ВЫРАЗИТЬ(АктивныеВизы.ОбъектВизирования КАК Документ.бит_ФормаВводаБюджета).Ссылка ЕСТЬ НЕ NULL";
		Иначе
			ШаблонВыборки = "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	АктивныеВизы.ОбъектВизирования КАК ОбъектВизирования,
			|	АктивныеВизы.Виза КАК Виза,
			|	АктивныеВизы.ИД КАК ИД,
			|	АктивныеВизы.ДатаКрайняя КАК ДатаКрайняя,
			|	АктивныеВизы.ПринятоеРешение КАК ПринятоеРешение,
			|	АктивныеВизы.ПолныйДоступ КАК ПолныйДоступ,
			|	АктивныеВизы.УсловиеДоступа КАК УсловиеДоступа,
			|	АктивныеВизы.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
			|	&МассивПредрасчетныхРеквизитов КАК МассивПредрасчетныхРеквизитов
			|ИЗ
			|	НачальнаяВыборкаАктивныхВиз КАК АктивныеВизы
			|ГДЕ
			|	АктивныеВизы.ОбъектВизирования ССЫЛКА Документ.бит_ФормаВводаБюджета
			|	И ВЫРАЗИТЬ(АктивныеВизы.ОбъектВизирования КАК Документ.бит_ФормаВводаБюджета).Ссылка ЕСТЬ НЕ NULL";
		КонецЕсли;
		
		ТекстПолученияРеквизитов      = "";
		Для каждого Реквизит Из МассивПредрасчетныхРеквизитов Цикл
			Если НЕ ПустаяСтрока(ТекстПолученияРеквизитов) Тогда
				ТекстПолученияРеквизитов = ТекстПолученияРеквизитов + ",
				|	";
			КонецЕсли;
			
			ИмяРеквизита     = Реквизит.Имя;
			ИмяПоляРезультат = Реквизит.ИмяПоляРезультат;
			Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизита, МетаданныеОбъектаВизирования)
				И НЕ ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъектаВизирования.СтандартныеРеквизиты,
																ИмяРеквизита) Тогда
				ТекстЗапросаРеквизита = "NULL КАК %1";
				ТекстЗапросаРеквизита = СтрШаблон(ТекстЗапросаРеквизита, ИмяПоляРезультат);
			ИначеЕсли Реквизит.ОграничениеДлины > 0 Тогда
				ТекстЗапросаРеквизита = "ВЫРАЗИТЬ(ВЫРАЗИТЬ(АктивныеВизы.ОбъектВизирования КАК %1).%2 КАК СТРОКА(%3)) КАК %4";
				ТекстЗапросаРеквизита = СтрШаблон(ТекстЗапросаРеквизита, ПолноеИмяМетаданного, ИмяРеквизита,
													Реквизит.ОграничениеДлины, ИмяПоляРезультат);
			Иначе
				ТекстЗапросаРеквизита = "ВЫРАЗИТЬ(АктивныеВизы.ОбъектВизирования КАК %1).%2 КАК %3";
				ТекстЗапросаРеквизита = СтрШаблон(ТекстЗапросаРеквизита, ПолноеИмяМетаданного, ИмяРеквизита,
													ИмяПоляРезультат);
			КонецЕсли;
			
			ТекстПолученияРеквизитов = ТекстПолученияРеквизитов + ТекстЗапросаРеквизита;
		КонецЦикла;
		ШаблонВыборки = СтрЗаменить(ШаблонВыборки, "&МассивПредрасчетныхРеквизитов КАК МассивПредрасчетныхРеквизитов",
							ТекстПолученияРеквизитов);
		ШаблонВыборки = СтрЗаменить(ШаблонВыборки, "Документ.бит_ФормаВводаБюджета", ПолноеИмяМетаданного);
		ТекстЗапроса  = ТекстЗапроса + ШаблонВыборки;
		
		ПервыйТип     = Ложь;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектВизирования";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	ТекстЗапроса = ТекстЗапроса + "УНИЧТОЖИТЬ НачальнаяВыборкаАктивныхВиз";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстФильтраОбъектВизирования(ОтборОбъектВизирования)
	
	Если НЕ ЗначениеЗаполнено(ОтборОбъектВизирования) Тогда
		ТекстФильтра = "ИСТИНА";
	ИначеЕсли ТипЗнч(ОтборОбъектВизирования) = Тип("СписокЗначений") Тогда
		ТекстФильтра = "бит_УстановленныеВизы.Объект В (&ОтборОбъектВизирования)";
	Иначе
		ТекстФильтра = "бит_УстановленныеВизы.Объект = &ОтборОбъектВизирования";
	КонецЕсли;
	
	Возврат ТекстФильтра;
	
КонецФункции

Функция ТекстФильтраТипыОбъектов(ТипыОбъектовВизирования)
	
	Если ТипыОбъектовВизирования.Количество() = 0 Тогда
		ТекстФильтра = "ИСТИНА";
	Иначе
		ТекстФильтра = "ТИПЗНАЧЕНИЯ(бит_УстановленныеВизы.Объект) В (&ТипыОбъектовВизирования)";
	КонецЕсли;
	
	Возврат ТекстФильтра;
	
КонецФункции

Функция ТекстФильтраВизы(ВариантОтбораВиз)
	
	ТекстФильтра = "ИСТИНА";
	
	Если ВариантОтбораВиз = 1 ИЛИ ВариантОтбораВиз = 2 Тогда
		ТекстФильтра = "бит_УстановленныеВизы.Виза.Вид = ЗНАЧЕНИЕ(Перечисление.бит_ВидыВиз.%1)";
		ТекстФильтра = СтрШаблон(ТекстФильтра, ?(ВариантОтбораВиз = 1, "Согласующая", "Утверждающая"));
	ИначеЕсли ВариантОтбораВиз = 3 Тогда
		ТекстФильтра = "бит_УстановленныеВизы.Виза В ИЕРАРХИИ (&ФильтрВизы)";
	КонецЕсли;
	
	Возврат ТекстФильтра;
	
КонецФункции

Функция ТекстЗапросаСмешанныеПоляШапкиТЧ(ОписаниеТиповВиз)
	
	ТекстЗапросаСмешанныхПолей = "";
	НужноОбъединение           = Ложь;
	ВключеныПлатежныеПозиции   = Ложь;
	ТипыВиз                    = ОписаниеТиповВиз.Типы();
	
	Для каждого ТипВизы Из ТипыВиз Цикл
		
		МетаданныеОбъектаВизирования = ПустоеЗначениеТипа(ТипВизы).Метаданные();
		Если Не ПравоДоступа("Чтение", МетаданныеОбъектаВизирования) Тогда
			Продолжить;
		КонецЕсли;
		
		ПолноеИмяМетаданного = МетаданныеОбъектаВизирования.ПолноеИмя();
		
		Если МетаданныеОбъектаВизирования.ТабличныеЧасти.Найти("Распределение") <> Неопределено
			И МетаданныеОбъектаВизирования.ТабличныеЧасти.Распределение.Реквизиты.Найти("СтатьяОборотов") <> Неопределено
			И МетаданныеОбъектаВизирования.ТабличныеЧасти.Распределение.Реквизиты.Найти("ЦФО") <> Неопределено Тогда
			
			Если НужноОбъединение Тогда
				ТекстЗапросаСмешанныхПолей = ТекстЗапросаСмешанныхПолей + ОбъединитьВсе();
			КонецЕсли;
			
			ТекстЗапросаСмешанныхПолей = ТекстЗапросаСмешанныхПолей +
			"ВЫБРАТЬ
			|	ТЧВизы.Ссылка КАК ОбъектВизирования,
			|	ТЧВизы.СтатьяОборотов КАК СтатьяОборотовСмешанная,
			|	ТЧВизы.ЦФО КАК ЦФОСмешанная,
			|	ОтборныеВизы.Виза КАК ВизаСмешанная 
			|ИЗ
			|	ОтборныеВизы КАК ОтборныеВизы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ПолноеИмяМетаданного + ".Распределение КАК ТЧВизы
			|		ПО ОтборныеВизы.ОбъектВизирования = ТЧВизы.Ссылка";
			
		ИначеЕсли ПолноеИмяМетаданного = "Документ.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию"
			ИЛИ ПолноеИмяМетаданного = "Документ.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств"
			ИЛИ ПолноеИмяМетаданного = "Документ.бит_кзн_ЗаявкаНаРасходованиеСредств" Тогда
			
			Если ВключеныПлатежныеПозиции Тогда
				Продолжить;
			КонецЕсли;
			
			Если НужноОбъединение Тогда
				ТекстЗапросаСмешанныхПолей = ТекстЗапросаСмешанныхПолей + ОбъединитьВсе();
			КонецЕсли;
			
			ТекстЗапросаСмешанныхПолей = ТекстЗапросаСмешанныхПолей +
			"ВЫБРАТЬ
			|	ОтборныеВизы.ОбъектВизирования КАК ОбъектВизирования,
			|	ПлатежнаяПозиция.СтатьяОборотов КАК СтатьяОборотовСмешанная,
			|	ПлатежнаяПозиция.ЦФО КАК ЦФОСмешанная,
			|	ОтборныеВизы.Виза КАК ВизаСмешанная 
			|ИЗ
			|	ОтборныеВизы КАК ОтборныеВизы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежнаяПозиция
			|		ПО ОтборныеВизы.ОбъектВизирования = ПлатежнаяПозиция.ДокументПланирования
			|			И (НЕ ПлатежнаяПозиция.ПометкаУдаления)";
			
			ВключеныПлатежныеПозиции = Истина;
			
		ИначеЕсли ПолноеИмяМетаданного = "Документ.бит_мто_ЗаявкаНаЗакупку"
			ИЛИ ПолноеИмяМетаданного = "Документ.бит_мто_ЗаявкаНаПотребность" Тогда
			
			Если НужноОбъединение Тогда
				ТекстЗапросаСмешанныхПолей = ТекстЗапросаСмешанныхПолей + ОбъединитьВсе();
			КонецЕсли;
			
			ТекстЗапросаСмешанныхПолей = ТекстЗапросаСмешанныхПолей +
			"ВЫБРАТЬ
			|	ТЧТовары.Ссылка КАК ОбъектВизирования,
			|	ТЧТовары.СтатьяОборотов КАК СтатьяОборотовСмешанная,
			|	ТЧТовары.ЦФО КАК ЦФОСмешанная,
			|	ОтборныеВизы.Виза КАК ВизаСмешанная 
			|ИЗ
			|	ОтборныеВизы КАК ОтборныеВизы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ПолноеИмяМетаданного + ".Товары КАК ТЧТовары
			|		ПО ОтборныеВизы.ОбъектВизирования = ТЧТовары.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТЧУслуги.Ссылка КАК ОбъектВизирования,
			|	ТЧУслуги.СтатьяОборотов КАК СтатьяОборотовСмешанная,
			|	ТЧУслуги.ЦФО КАК ЦФОСмешанная,
			|	ОтборныеВизы.Виза КАК ВизаСмешанная 
			|ИЗ
			|	ОтборныеВизы КАК ОтборныеВизы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ПолноеИмяМетаданного + ".Услуги КАК ТЧУслуги
			|		ПО ОтборныеВизы.ОбъектВизирования = ТЧУслуги.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТЧОборудование.Ссылка КАК ОбъектВизирования,
			|	ТЧОборудование.СтатьяОборотов КАК СтатьяОборотовСмешанная,
			|	ТЧОборудование.ЦФО КАК ЦФОСмешанная,
			|	ОтборныеВизы.Виза КАК ВизаСмешанная 
			|ИЗ
			|	ОтборныеВизы КАК ОтборныеВизы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ПолноеИмяМетаданного + ".Оборудование КАК ТЧОборудование
			|		ПО ОтборныеВизы.ОбъектВизирования = ТЧОборудование.Ссылка";
			
		Иначе
			
			Если НужноОбъединение Тогда
				ТекстЗапросаСмешанныхПолей = ТекстЗапросаСмешанныхПолей + ОбъединитьВсе();
			КонецЕсли;
			
			ЕстьСтатья = МетаданныеОбъектаВизирования.Реквизиты.Найти("СтатьяОборотов") <> Неопределено;
			ЕстьЦФО    = МетаданныеОбъектаВизирования.Реквизиты.Найти("ЦФО") <> Неопределено;
			
			ТекстШаблонаЗапросаСмешанныхПолей =
			"ВЫБРАТЬ
			|	&ОбъектВизирования КАК ОбъектВизирования,
			|	&СтатьяОборотов КАК СтатьяОборотовСмешанная,
			|	&ЦФО КАК ЦФОСмешанная,
			|	ОтборныеВизы.Виза КАК ВизаСмешанная
			|ИЗ
			|	ОтборныеВизы КАК ОтборныеВизы
			|ГДЕ
			|	ОтборныеВизы.ОбъектВизирования ССЫЛКА &ВидОбъекта";
			
			ТекстПриведенияТипа = "ВЫРАЗИТЬ(ОтборныеВизы.ОбъектВизирования КАК %1)";
			ТекстПриведенияТипа = СтрШаблон(ТекстПриведенияТипа, ПолноеИмяМетаданного);
			
			ТекстШаблонаЗапросаСмешанныхПолей = СтрЗаменить(ТекстШаблонаЗапросаСмешанныхПолей, "&ОбъектВизирования", ТекстПриведенияТипа);
															
			ТекстПодстановки = "НЕОПРЕДЕЛЕНО";
			Если ЕстьСтатья Тогда
				ТекстПодстановки = ТекстПриведенияТипа + ".СтатьяОборотов";
			КонецЕсли;
			ТекстШаблонаЗапросаСмешанныхПолей = СтрЗаменить(ТекстШаблонаЗапросаСмешанныхПолей, "&СтатьяОборотов", ТекстПодстановки);
			
			ТекстПодстановки = "НЕОПРЕДЕЛЕНО";
			Если ЕстьЦФО Тогда
				ТекстПодстановки = ТекстПриведенияТипа + ".ЦФО";
			КонецЕсли;
			ТекстШаблонаЗапросаСмешанныхПолей = СтрЗаменить(ТекстШаблонаЗапросаСмешанныхПолей, "&ЦФО", ТекстПодстановки);
			
			ТекстШаблонаЗапросаСмешанныхПолей = СтрЗаменить(ТекстШаблонаЗапросаСмешанныхПолей, "&ВидОбъекта", ПолноеИмяМетаданного);
			
			ТекстЗапросаСмешанныхПолей = ТекстЗапросаСмешанныхПолей + ТекстШаблонаЗапросаСмешанныхПолей;
			
		КонецЕсли;
		
		НужноОбъединение = Истина;
		
	КонецЦикла;
	
	Если ПустаяСтрока(ТекстЗапросаСмешанныхПолей) Тогда
		ТекстЗапросаСмешанныхПолей =
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК ОбъектВизирования,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяОборотовСмешанная,
		|	НЕОПРЕДЕЛЕНО КАК ЦФОСмешанная,
		|	НЕОПРЕДЕЛЕНО КАК ВизаСмешанная";
	КонецЕсли;
	
	ТекстЗапросаСмешанныхПолей = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(ТекстЗапросаСмешанныхПолей, 8);
	
	Возврат ТекстЗапросаСмешанныхПолей;
	
КонецФункции

Функция ОбъединитьВсе()
	
	Возврат "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|";
	
КонецФункции

Функция НаложитьОтборыРолевойАдресации(Запрос, ПараметрыПолучения)
	
	Если ПараметрыПолучения.РежимАрхива ИЛИ ПараметрыПолучения.РежимПолученияРеквизитов Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОтборныеВизы.ОбъектВизирования КАК ОбъектВизирования,
	|	ОтборныеВизы.Виза КАК Виза
	|ПОМЕСТИТЬ ОграниченныеВизы
	|ИЗ
	|	ОтборныеВизы КАК ОтборныеВизы
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтборныеВизы.ОбъектВизирования,
	|	ОтборныеВизы.Виза
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ОтборныеВизы.ПолныйДоступ) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтборныеВизы.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
	|	ОтборныеВизы.УсловиеДоступа КАК УсловиеДоступа,
	|	ОтборныеВизы.ОбъектВизирования КАК ОбъектВизирования,
	|	ОтборныеВизы.Виза КАК Виза
	|ПОМЕСТИТЬ УсловияРолевыхОграничений
	|ИЗ
	|	ОтборныеВизы КАК ОтборныеВизы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОграниченныеВизы КАК ОграниченныеВизы
	|		ПО ОтборныеВизы.ОбъектВизирования = ОграниченныеВизы.ОбъектВизирования
	|			И ОтборныеВизы.Виза = ОграниченныеВизы.Виза
	|			И (ОтборныеВизы.УсловиеДоступа.ВидПользовательскогоУсловия = ЗНАЧЕНИЕ(Перечисление.бит_ВидыПользовательскихУсловий.РолеваяАдресация))
	|			И (&УсловиеОсобыеОбъектыПроверки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОграниченныеВизы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя,
	|	ИсполнителиЗадач.ОбъектАдресации_1 КАК ОбъектАдресации_1,
	|	ИсполнителиЗадач.ОбъектАдресации_2 КАК ОбъектАдресации_2,
	|	ИсполнителиЗадач.ОбъектАдресации_3 КАК ОбъектАдресации_3,
	|	АВТОНОМЕРЗАПИСИ() КАК КлючЗаписи
	|ПОМЕСТИТЬ ИсполнителиЗадач
	|ИЗ
	|	РегистрСведений.бит_ИсполнителиЗадач КАК ИсполнителиЗадач
	|ГДЕ
	|	ИсполнителиЗадач.Исполнитель = &Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УсловияРолевыхОграничений.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
	|	УсловияРолевыхОграничений.УсловиеДоступа КАК УсловиеДоступа,
	|	РолеваяАдресацияУсловий.РольИсполнителя КАК РольИсполнителя,
	|	УсловияРолевыхОграничений.ОбъектВизирования КАК ОбъектВизирования,
	|	ИсполнителиЗадач.ОбъектАдресации_1 КАК ОбъектАдресации_1,
	|	ИсполнителиЗадач.ОбъектАдресации_2 КАК ОбъектАдресации_2,
	|	ИсполнителиЗадач.ОбъектАдресации_3 КАК ОбъектАдресации_3,
	|	ИсполнителиЗадач.КлючЗаписи КАК КлючЗаписиАдресации
	|ПОМЕСТИТЬ МатрицаОбъектовАдресации
	|ИЗ
	|	УсловияРолевыхОграничений КАК УсловияРолевыхОграничений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ПользовательскиеУсловия.РолеваяАдресация КАК РолеваяАдресацияУсловий
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсполнителиЗадач КАК ИсполнителиЗадач
	|			ПО РолеваяАдресацияУсловий.РольИсполнителя = ИсполнителиЗадач.РольИсполнителя
	|		ПО УсловияРолевыхОграничений.УсловиеДоступа = РолеваяАдресацияУсловий.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РольИсполнителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИсполнителиЗадач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатрицаОбъектовАдресации.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
	|	МатрицаОбъектовАдресации.УсловиеДоступа КАК УсловиеДоступа,
	|	МатрицаОбъектовАдресации.РольИсполнителя КАК РольИсполнителя,
	|	МАКСИМУМ(АдресацииРоли.Ссылка ЕСТЬ NULL) КАК БезАдресации,
	|	МАКСИМУМ(МатрицаОбъектовАдресации.ОбъектАдресации_1) КАК ОбъектАдресации_1,
	|	МАКСИМУМ(МатрицаОбъектовАдресации.ОбъектАдресации_2) КАК ОбъектАдресации_2,
	|	МАКСИМУМ(МатрицаОбъектовАдресации.ОбъектАдресации_3) КАК ОбъектАдресации_3,
	|	МАКСИМУМ(АдресацииРоли.Имя) КАК ПолеРеквизитаАдресации,
	|	АдресацииРоли.Вид КАК ВидОбъектаАдресации,
	|	АдресацииРоли.Вид.Код КАК ИмяВидаАдресации,
	|	АдресацииРоли.Вид.СпособПроверкиПринадлежности КАК СпособПроверкиАдресации
	|ИЗ
	|	МатрицаОбъектовАдресации КАК МатрицаОбъектовАдресации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_РолиИсполнителей.ОбъектыАдресации КАК АдресацииРоли
	|		ПО МатрицаОбъектовАдресации.РольИсполнителя = АдресацииРоли.Ссылка
	|			И (АдресацииРоли.Имя = ""ОбъектАдресации_1""
	|				ИЛИ АдресацииРоли.Имя = ""ОбъектАдресации_2""
	|				ИЛИ АдресацииРоли.Имя = ""ОбъектАдресации_3"")
	|
	|СГРУППИРОВАТЬ ПО
	|	МатрицаОбъектовАдресации.ТипОбъектаВизирования,
	|	МатрицаОбъектовАдресации.УсловиеДоступа,
	|	МатрицаОбъектовАдресации.РольИсполнителя,
	|	АдресацииРоли.Вид,
	|	АдресацииРоли.Вид.Код,
	|	АдресацииРоли.Вид.СпособПроверкиПринадлежности
	|ИТОГИ ПО
	|	ТипОбъектаВизирования,
	|	УсловиеДоступа,
	|	РольИсполнителя";
	
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		ТекстУсловиеОсобыеОбъектыПроверки = "ОтборныеВизы.ТипОбъектаВизирования <> ТИП(Документ.бит_кзн_ЗаявкаНаРасходованиеСредств)
											|	И ОтборныеВизы.ТипОбъектаВизирования <> ТИП(Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств)
											|	И ОтборныеВизы.ТипОбъектаВизирования <> ТИП(Документ.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств)";
	Иначе
		ТекстУсловиеОсобыеОбъектыПроверки = "ИСТИНА";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОсобыеОбъектыПроверки", ТекстУсловиеОсобыеОбъектыПроверки);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ответственный", ПараметрыПолучения.Ответственный);
	
	ВыборкаТипов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КоличествоРезультатовПроверок = 0;
	Пока ВыборкаТипов.Следующий() Цикл
		
		ПустаяСсылкаНаОбъект          = ПустоеЗначениеТипа(ВыборкаТипов.ТипОбъектаВизирования);
		МетаданныеОбъектаВизирования  = ПустаяСсылкаНаОбъект.Метаданные();
		ПолноеИмяМетаданного          = МетаданныеОбъектаВизирования.ПолноеИмя();
		ВыборкаУсловий                = ВыборкаТипов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУсловий.Следующий() Цикл
			ВыборкаРолей = ВыборкаУсловий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			КоличествоУсловийДоступа = 0;
			Пока ВыборкаРолей.Следующий() Цикл
				
				КоличествоРезультатовПроверок = КоличествоРезультатовПроверок + 1;
				КоличествоУсловийДоступа      = КоличествоУсловийДоступа + 1;
				
				ПодзапросПроверкаАдресации = Новый Запрос;
				ПодзапросПроверкаАдресации.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
				ТекстЗапросаПроверкиАдресации =
				"ВЫБРАТЬ
				|	МатрицаОбъектовАдресации.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
				|	МатрицаОбъектовАдресации.УсловиеДоступа КАК УсловиеДоступа,
				|	&ПолеОбъектВизирования КАК ОбъектВизирования,
				|	МатрицаОбъектовАдресации.РольИсполнителя КАК РольИсполнителя,
				|	МатрицаОбъектовАдресации.ОбъектАдресации_1 КАК ОбъектАдресации_1,
				|	МатрицаОбъектовАдресации.ОбъектАдресации_2 КАК ОбъектАдресации_2,
				|	МатрицаОбъектовАдресации.ОбъектАдресации_3 КАК ОбъектАдресации_3,
				|	МатрицаОбъектовАдресации.КлючЗаписиАдресации КАК КлючЗаписиАдресации
				|ПОМЕСТИТЬ ОбъектыПроверки
				|ИЗ
				|	МатрицаОбъектовАдресации КАК МатрицаОбъектовАдресации
				|ГДЕ
				|	МатрицаОбъектовАдресации.ТипОбъектаВизирования = &ТипОбъектаВизирования
				|	И МатрицаОбъектовАдресации.РольИсполнителя     = &РольИсполнителя
				|	И МатрицаОбъектовАдресации.УсловиеДоступа      = &УсловиеДоступа";
				ТекстЗапросаПроверкиАдресации = СтрЗаменить(ТекстЗапросаПроверкиАдресации
															, "&ПолеОбъектВизирования"
															, "ВЫРАЗИТЬ(МатрицаОбъектовАдресации.ОбъектВизирования КАК "
															+ ПолноеИмяМетаданного + ")");
				ПодзапросПроверкаАдресации.УстановитьПараметр("ТипОбъектаВизирования", ВыборкаРолей.ТипОбъектаВизирования);
				ПодзапросПроверкаАдресации.УстановитьПараметр("РольИсполнителя"      , ВыборкаРолей.РольИсполнителя);
				ПодзапросПроверкаАдресации.УстановитьПараметр("УсловиеДоступа"       , ВыборкаРолей.УсловиеДоступа);
				ТекстЗапросаПроверкиАдресации = ТекстЗапросаПроверкиАдресации + ОбщегоНазначения.РазделительПакетаЗапросов();
				
				// Роль исполнителя может содержать до 3х измерений адресации,
				//  для доступа должно выполняться сопоставление объектов визирования по всем измерениям.
				ВыборкаВидовАдресации = ВыборкаРолей.Выбрать();
				
				КоличествоВидовАдресации = 0;
				Пока ВыборкаВидовАдресации.Следующий() Цикл
					
					КоличествоВидовАдресации = КоличествоВидовАдресации + 1;
					
					ИмяПоляПроверки = ВыборкаВидовАдресации.ИмяВидаАдресации;
					СпособПроверки  = ВыборкаВидовАдресации.СпособПроверкиАдресации;
					
					ПроверятьШапку    = ?(СпособПроверки = Перечисления.бит_СпособыПроверкиПринадлежностиОбъектаАдресации.Шапка
											ИЛИ СпособПроверки = Перечисления.бит_СпособыПроверкиПринадлежностиОбъектаАдресации.ШапкаТабличныеЧасти
											, Истина, Ложь);
					ПроверятьТабЧасть = ?(СпособПроверки = Перечисления.бит_СпособыПроверкиПринадлежностиОбъектаАдресации.ТабличныеЧасти
											ИЛИ СпособПроверки = Перечисления.бит_СпособыПроверкиПринадлежностиОбъектаАдресации.ШапкаТабличныеЧасти
											, Истина, Ложь);
					// В рамках проверки поля адресации значение может присутствовать в шапке или строке одной из табличных частей,
					//  в соответствии со способом проверки.
					
					КоличествоОбластейПоиска = 0;
					ТекстПроверкиРеквизита   = "";
					Если ПроверятьШапку Тогда
						Если бит_РаботаСМетаданными.ЕстьРеквизит(ИмяПоляПроверки, МетаданныеОбъектаВизирования) Тогда
							КоличествоОбластейПоиска = КоличествоОбластейПоиска + 1;
							ТекстПроверкиРеквизита   = ТекстПроверкиРеквизита +
							"ВЫБРАТЬ
							|	ОбъектыПроверки.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
							|	ОбъектыПроверки.УсловиеДоступа КАК УсловиеДоступа,
							|	ОбъектыПроверки.ОбъектВизирования КАК ОбъектВизирования,
							|	ОбъектыПроверки.РольИсполнителя КАК РольИсполнителя,
							|	ОбъектыПроверки.КлючЗаписиАдресации КАК КлючЗаписиАдресации
							|ПОМЕСТИТЬ БлокПроверкиВидаАдресации
							|ИЗ
							|	ОбъектыПроверки КАК ОбъектыПроверки
							|ГДЕ
							|	&ПолеПроверкиРеквизита = &ПолеРеквизитаАдресации";
							ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита
																, "&ПолеПроверкиРеквизита"
																, "ОбъектыПроверки.ОбъектВизирования." + ИмяПоляПроверки);
							ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита
																, "&ПолеРеквизитаАдресации"
																, "ОбъектыПроверки." + ВыборкаВидовАдресации.ПолеРеквизитаАдресации);
						Иначе
							Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПустаяСсылкаНаОбъект) Тогда
								КоличествоОбластейПоиска = КоличествоОбластейПоиска + 1;
								ТекстПроверкиРеквизита   = ТекстПроверкиРеквизита +
								"ВЫБРАТЬ
								|	ОбъектыПроверки.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
								|	ОбъектыПроверки.УсловиеДоступа КАК УсловиеДоступа,
								|	ОбъектыПроверки.ОбъектВизирования КАК ОбъектВизирования,
								|	ОбъектыПроверки.РольИсполнителя КАК РольИсполнителя,
								|	ОбъектыПроверки.КлючЗаписиАдресации КАК КлючЗаписиАдресации
								|ПОМЕСТИТЬ БлокПроверкиВидаАдресации
								|ИЗ
								|	&ДополнительныеРеквизиты КАК ТЧДополнительныеРеквизиты
								|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
								|		ПО ТЧДополнительныеРеквизиты.Свойство = ДополнительныеРеквизитыИСведения.Ссылка
								|			И (ДополнительныеРеквизитыИСведения.Имя = ""&ИмяРеквизита"")
								|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыПроверки КАК ОбъектыПроверки
								|		ПО ТЧДополнительныеРеквизиты.Ссылка = ОбъектыПроверки.ОбъектВизирования
								|ГДЕ
								|	ТЧДополнительныеРеквизиты.Значение = &ПолеРеквизитаАдресации";
	                            ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита
																	, "&ДополнительныеРеквизиты"
																	, ПолноеИмяМетаданного + ".ДополнительныеРеквизиты");
								ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита
																	, "&ИмяРеквизита"
																	, ИмяПоляПроверки);
								ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита
																	, "&ПолеРеквизитаАдресации"
																	, "ОбъектыПроверки." + ВыборкаВидовАдресации.ПолеРеквизитаАдресации);
							КонецЕсли;
							Если УправлениеСвойствами.ИспользоватьДопСведения(ПустаяСсылкаНаОбъект) Тогда
								КоличествоОбластейПоиска = КоличествоОбластейПоиска + 1;
								Если КоличествоОбластейПоиска > 1 Тогда
									ТекстПроверкиРеквизита = ТекстПроверкиРеквизита +
									"
									|
									|ОБЪЕДИНИТЬ
									|
									|";
								КонецЕсли;
								ТекстПроверкиРеквизита   = ТекстПроверкиРеквизита +
								"ВЫБРАТЬ
								|	ОбъектыПроверки.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
								|	ОбъектыПроверки.УсловиеДоступа КАК УсловиеДоступа,
								|	ОбъектыПроверки.ОбъектВизирования КАК ОбъектВизирования,
								|	ОбъектыПроверки.РольИсполнителя КАК РольИсполнителя,
								|	ОбъектыПроверки.КлючЗаписиАдресации КАК КлючЗаписиАдресации";
								Если КоличествоОбластейПоиска = 1 Тогда
									ТекстПроверкиРеквизита = ТекстПроверкиРеквизита +
									"
									|ПОМЕСТИТЬ БлокПроверкиВидаАдресации";
								КонецЕсли;
								ТекстПроверкиРеквизита = ТекстПроверкиРеквизита +
								"
								|ИЗ
								|	РегистрСведений.ДополнительныеСведения КАК ТаблицаСвойств
								|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
								|		ПО ТаблицаСвойств.Свойство = ДополнительныеРеквизитыИСведения.Ссылка
								|			И (ДополнительныеРеквизитыИСведения.Имя = ""&ИмяРеквизита"")
								|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыПроверки КАК ОбъектыПроверки
								|		ПО ТаблицаСвойств.Объект = ОбъектыПроверки.ОбъектВизирования
								|ГДЕ
								|	ТаблицаСвойств.Значение = &ПолеРеквизитаАдресации";
	                            ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита
																	, "&ИмяРеквизита"
																	, ИмяПоляПроверки);
								ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита
																	, "&ПолеРеквизитаАдресации"
																	, "ОбъектыПроверки." + ВыборкаВидовАдресации.ПолеРеквизитаАдресации);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					Если ПроверятьТабЧасть Тогда
						Для каждого ТабЧастьОбъекта Из МетаданныеОбъектаВизирования.ТабличныеЧасти Цикл
							Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти(ИмяПоляПроверки
																			, МетаданныеОбъектаВизирования
																			, ТабЧастьОбъекта.Имя) Тогда
								КоличествоОбластейПоиска = КоличествоОбластейПоиска + 1;
								Если КоличествоОбластейПоиска > 1 Тогда
									ТекстПроверкиРеквизита = ТекстПроверкиРеквизита +
									"
									|
									|ОБЪЕДИНИТЬ
									|
									|";
								КонецЕсли;
								
								ТекстПроверкиРеквизита = ТекстПроверкиРеквизита +
								"ВЫБРАТЬ
								|	ОбъектыПроверки.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
								|	ОбъектыПроверки.УсловиеДоступа КАК УсловиеДоступа,
								|	ОбъектыПроверки.ОбъектВизирования КАК ОбъектВизирования,
								|	ОбъектыПроверки.РольИсполнителя КАК РольИсполнителя,
								|	ОбъектыПроверки.КлючЗаписиАдресации КАК КлючЗаписиАдресации";
								Если КоличествоОбластейПоиска = 1 Тогда
									ТекстПроверкиРеквизита = ТекстПроверкиРеквизита +
									"
									|ПОМЕСТИТЬ БлокПроверкиВидаАдресации";
								КонецЕсли;
								ТекстПроверкиРеквизита = ТекстПроверкиРеквизита +
								"
								|ИЗ
								|	ОбъектыПроверки КАК ОбъектыПроверки
								|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПутьКТабличнойЧасти КАК ТабличнаяЧастьОбъекта
								|		ПО ОбъектыПроверки.ОбъектВизирования = ТабличнаяЧастьОбъекта.Ссылка
								|			И (&ПолеПроверкиРеквизита = &ПолеРеквизитаАдресации)";
								ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита
																	, "ПутьКТабличнойЧасти"
																	, ПолноеИмяМетаданного + "." + ТабЧастьОбъекта.Имя);
								ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита
																	, "&ПолеПроверкиРеквизита"
																	, "ТабличнаяЧастьОбъекта." + ИмяПоляПроверки);
								ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита
																	, "&ПолеРеквизитаАдресации"
																	, "ОбъектыПроверки." + ВыборкаВидовАдресации.ПолеРеквизитаАдресации);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					Если ВыборкаВидовАдресации.БезАдресации Тогда
						// Справочник бит_РолиИсполнителей не содержит ролей адресации.
						ТекстПроверкиРеквизита =
						"ВЫБРАТЬ
						|	ОбъектыПроверки.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
						|	ОбъектыПроверки.УсловиеДоступа КАК УсловиеДоступа,
						|	ОбъектыПроверки.ОбъектВизирования КАК ОбъектВизирования,
						|	ОбъектыПроверки.РольИсполнителя КАК РольИсполнителя,
						|	ОбъектыПроверки.КлючЗаписиАдресации КАК КлючЗаписиАдресации
						|ПОМЕСТИТЬ БлокПроверкиВидаАдресации
						|ИЗ
						|	ОбъектыПроверки КАК ОбъектыПроверки";
					ИначеЕсли ПустаяСтрока(ТекстПроверкиРеквизита) Тогда
						// Ни реквизиты шапки, ни реквизиты ТЧ не содержат атрибутов адресации.
						ТекстПроверкиРеквизита =
						"ВЫБРАТЬ
						|	ОбъектыПроверки.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
						|	ОбъектыПроверки.УсловиеДоступа КАК УсловиеДоступа,
						|	ОбъектыПроверки.ОбъектВизирования КАК ОбъектВизирования,
						|	ОбъектыПроверки.РольИсполнителя КАК РольИсполнителя,
						|	ОбъектыПроверки.КлючЗаписиАдресации КАК КлючЗаписиАдресации
						|ПОМЕСТИТЬ БлокПроверкиВидаАдресации
						|ИЗ
						|	ОбъектыПроверки КАК ОбъектыПроверки
						|ГДЕ
						|	ЛОЖЬ";
					КонецЕсли;
					
					ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита
														, "БлокПроверкиВидаАдресации"
														, "БлокПроверкиВидаАдресации" + КоличествоВидовАдресации);
					Если КоличествоОбластейПоиска = 1 Тогда
						ТекстПроверкиРеквизита = СтрЗаменить(ТекстПроверкиРеквизита, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗЛИЧНЫЕ");
					КонецЕсли;
					
					ТекстЗапросаПроверкиАдресации = ТекстЗапросаПроверкиАдресации + ТекстПроверкиРеквизита;
					ТекстЗапросаПроверкиАдресации = ТекстЗапросаПроверкиАдресации + ОбщегоНазначения.РазделительПакетаЗапросов();
					
				КонецЦикла;
				
				ТекстЗапросаПроверкиАдресации = ТекстЗапросаПроверкиАдресации +
				"ВЫБРАТЬ
				|	ОбъектыПроверки.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
				|	ОбъектыПроверки.УсловиеДоступа КАК УсловиеДоступа,
				|	ОбъектыПроверки.ОбъектВизирования КАК ОбъектВизирования,
				|	ОбъектыПроверки.РольИсполнителя КАК РольИсполнителя
				|ПОМЕСТИТЬ РезультатПроверки" + Формат(КоличествоРезультатовПроверок, "ЧГ=") + "
				|ИЗ
				|	ОбъектыПроверки КАК ОбъектыПроверки";
				Для Сч = 1 По КоличествоВидовАдресации Цикл
					ПодстрокаФильтрации = "
					|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ БлокПроверкиВидаАдресации КАК БлокПроверкиВидаАдресации
					|	ПО ОбъектыПроверки.ТипОбъектаВизирования = БлокПроверкиВидаАдресации.ТипОбъектаВизирования
					|		И ОбъектыПроверки.УсловиеДоступа = БлокПроверкиВидаАдресации.УсловиеДоступа
					|		И ОбъектыПроверки.ОбъектВизирования = БлокПроверкиВидаАдресации.ОбъектВизирования
					|		И ОбъектыПроверки.РольИсполнителя = БлокПроверкиВидаАдресации.РольИсполнителя
					|		И ОбъектыПроверки.КлючЗаписиАдресации = БлокПроверкиВидаАдресации.КлючЗаписиАдресации";
					ПодстрокаФильтрации = СтрЗаменить(ПодстрокаФильтрации
														, "БлокПроверкиВидаАдресации"
														, "БлокПроверкиВидаАдресации" + Формат(Сч, "ЧГ="));
					ТекстЗапросаПроверкиАдресации = ТекстЗапросаПроверкиАдресации + ПодстрокаФильтрации;
				КонецЦикла;
				ТекстЗапросаПроверкиАдресации = ТекстЗапросаПроверкиАдресации + ОбщегоНазначения.РазделительПакетаЗапросов();
				ТекстЗапросаПроверкиАдресации = ТекстЗапросаПроверкиАдресации + "УНИЧТОЖИТЬ ОбъектыПроверки";
				Для Сч = 1 По КоличествоВидовАдресации Цикл
					ТекстЗапросаПроверкиАдресации = ТекстЗапросаПроверкиАдресации + ОбщегоНазначения.РазделительПакетаЗапросов();
					ТекстЗапросаПроверкиАдресации = ТекстЗапросаПроверкиАдресации + "УНИЧТОЖИТЬ БлокПроверкиВидаАдресации" + Формат(Сч, "ЧГ=");
				КонецЦикла;
				
				ПодзапросПроверкаАдресации.Текст = ТекстЗапросаПроверкиАдресации;
				ПодзапросПроверкаАдресации.Выполнить();
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если КоличествоРезультатовПроверок = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстРезультатаПроверки = "";
	ТекстСтрокаДеструктора  = "";
	Для НомерРезультата = 1 По КоличествоРезультатовПроверок Цикл
		НомерРезультатаСтрокой = Формат(НомерРезультата, "ЧГ=");
		
		Если НомерРезультата > 1 Тогда
			ТекстРезультатаПроверки = ТекстРезультатаПроверки +
			"
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
			
		ТекстРезультатаПроверки = ТекстРезультатаПроверки +
		"ВЫБРАТЬ
		|	РезультатПроверки.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
		|	РезультатПроверки.УсловиеДоступа КАК УсловиеДоступа,
		|	РезультатПроверки.ОбъектВизирования КАК ОбъектВизирования,
		|	РезультатПроверки.РольИсполнителя КАК РольИсполнителя";
		Если НомерРезультата = 1 Тогда
			ТекстРезультатаПроверки = ТекстРезультатаПроверки +
			"
			|ПОМЕСТИТЬ РезультатПроверки";
		КонецЕсли;
		ТекстРезультатаПроверки = ТекстРезультатаПроверки +
		"
		|ИЗ
		|	РезультатПроверки" + НомерРезультатаСтрокой + " КАК РезультатПроверки";
		
		ТекстСтрокаДеструктора =  ОбщегоНазначения.РазделительПакетаЗапросов() +
		"УНИЧТОЖИТЬ РезультатПроверки" + НомерРезультатаСтрокой;
	КонецЦикла;
	
	ТекстРезультатаПроверки = ТекстРезультатаПроверки + ОбщегоНазначения.РазделительПакетаЗапросов();
	ТекстРезультатаПроверки = ТекстРезультатаПроверки +
	"ВЫБРАТЬ
	|	УсловияРолевыхОграничений.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
	|	УсловияРолевыхОграничений.УсловиеДоступа КАК УсловиеДоступа,
	|	УсловияРолевыхОграничений.ОбъектВизирования КАК ОбъектВизирования,
	|	УсловияРолевыхОграничений.Виза КАК Виза,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РезультатПроверки.ОбъектВизирования ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ДоступРолевойАдресации
	|ПОМЕСТИТЬ РезультатПроверкиРолевойАдресации
	|ИЗ
	|	УсловияРолевыхОграничений КАК УсловияРолевыхОграничений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезультатПроверки КАК РезультатПроверки
	|		ПО УсловияРолевыхОграничений.ТипОбъектаВизирования = РезультатПроверки.ТипОбъектаВизирования
	|			И УсловияРолевыхОграничений.УсловиеДоступа = РезультатПроверки.УсловиеДоступа
	|			И УсловияРолевыхОграничений.ОбъектВизирования = РезультатПроверки.ОбъектВизирования
	|
	|СГРУППИРОВАТЬ ПО
	|	УсловияРолевыхОграничений.ТипОбъектаВизирования,
	|	УсловияРолевыхОграничений.УсловиеДоступа,
	|	УсловияРолевыхОграничений.ОбъектВизирования,
	|	УсловияРолевыхОграничений.Виза
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектВизирования";
	ТекстРезультатаПроверки = ТекстРезультатаПроверки + ТекстСтрокаДеструктора;
	ТекстРезультатаПроверки = ТекстРезультатаПроверки + ОбщегоНазначения.РазделительПакетаЗапросов();
	ТекстРезультатаПроверки = ТекстРезультатаПроверки + "УНИЧТОЖИТЬ УсловияРолевыхОграничений";
	
	Запрос.Текст = ТекстРезультатаПроверки;
	Запрос.Выполнить();
	
	Возврат Истина;
	
КонецФункции

// Предназначена для получения пустого значения заданного типа:
//	примитивного, или ссылочного. Используется
//
// Параметры:
//	ЗаданныйТип - Тип - Тип, пустое значение которого нужно получить.
//
Функция ПустоеЗначениеТипа(ЗаданныйТип) Экспорт

	Если ЗаданныйТип = Тип("Число") Тогда
		Возврат 0;

	ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
		Возврат "";

	ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
		Возврат '00010101000000';

	ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
		Возврат Ложь;

	Иначе
		Возврат Новый (ЗаданныйТип);

	КонецЕсли;

КонецФункции

Функция ТекстЗапросаДетальныеЗаписиВиз(ПараметрыПолучения, ОписаниеТиповВиз, ЕстьФильтрыРолевойАдресации)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтборныеВизы.ОбъектВизирования КАК ОбъектВизирования
	|ПОМЕСТИТЬ РазличныеОбъектыВизирования
	|ИЗ
	|	ОтборныеВизы КАК ОтборныеВизы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НЕОПРЕДЕЛЕНО КАК ОбъектВизирования,
	|	0 КАК СуммаДокумента,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК ВидПлана
	|ПОМЕСТИТЬ ДанныеДокументов";
	
	ТипыВиз = ОписаниеТиповВиз.Типы();
	Для каждого ТипВизы Из ТипыВиз Цикл
		МетаданныеВизы = ПустоеЗначениеТипа(ТипВизы).Метаданные();
		
		ТекстЗапросаПоОбъекту = ТекстЗапросаРеквизитовПоДокументуВизирования(МетаданныеВизы);
		Если ТекстЗапросаПоОбъекту = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаПоОбъекту;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Если ЕстьФильтрыРолевойАдресации Тогда
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	ОтборныеВизы.ОбъектВизирования КАК ОбъектВизирования,
		|	ОтборныеВизы.Виза КАК Виза,
		|	ОтборныеВизы.ИД КАК ИД,
		|	ОтборныеВизы.ДатаКрайняя КАК ДатаКрайняя,
		|	ОтборныеВизы.ПринятоеРешение КАК ПринятоеРешение,
		|	ОтборныеВизы.ПолныйДоступ КАК ПолныйДоступ,
		|	ОтборныеВизы.УсловиеДоступа КАК УсловиеДоступа,
		|	ОтборныеВизы.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
		|	ЕСТЬNULL(СтатусыОбъектов.Статус, ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.ПустаяСсылка)) КАК Статус,
		|	ЕСТЬNULL(НаличиеФайлов.ЕстьФайлы, ЛОЖЬ) КАК ЕстьФайлы,
		|	ОтборныеВизы.Организация КАК Организация,
		|	ДанныеДокументов.СуммаДокумента КАК СуммаДокумента,
		|	ДанныеДокументов.ВалютаДокумента КАК ВалютаДокумента,
		|	ДанныеДокументов.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА ДанныеДокументов.ВалютаДокумента ЕСТЬ NULL
		|			И &УсловиеОбъектРеестрПлатежей ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|	КОНЕЦ КАК ПересчитатьСумму,
		|	ВЫБОР
		|		КОГДА РезультатПроверкиРолевойАдресации.ОбъектВизирования ЕСТЬ NULL
		|			ТОГДА 0 //Не ролевое пользовательское условие
		|		КОГДА РезультатПроверкиРолевойАдресации.ДоступРолевойАдресации = ЛОЖЬ
		|			ТОГДА 1 //Не доступа по ролям
		|		КОГДА РезультатПроверкиРолевойАдресации.ДоступРолевойАдресации = ИСТИНА
		|			ТОГДА 2 //Доступен по роли
		|	КОНЕЦ КАК ДоступРолевойАдресации,
		|	&МассивПредрасчетныхРеквизитов КАК МассивПредрасчетныхРеквизитов
		|ИЗ
		|	ОтборныеВизы КАК ОтборныеВизы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК СтатусыОбъектов
		|		ПО ОтборныеВизы.ОбъектВизирования = СтатусыОбъектов.Объект
		|			И (СтатусыОбъектов.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
		|		ПО ОтборныеВизы.ОбъектВизирования = НаличиеФайлов.ОбъектСФайлами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументов КАК ДанныеДокументов
		|		ПО ОтборныеВизы.ОбъектВизирования = ДанныеДокументов.ОбъектВизирования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РезультатПроверкиРолевойАдресации КАК РезультатПроверкиРолевойАдресации
		|		ПО ОтборныеВизы.ОбъектВизирования = РезультатПроверкиРолевойАдресации.ОбъектВизирования
		|			И ОтборныеВизы.УсловиеДоступа = РезультатПроверкиРолевойАдресации.УсловиеДоступа
		|			И ОтборныеВизы.Виза = РезультатПроверкиРолевойАдресации.Виза
		|ИТОГИ
		|	МАКСИМУМ(ПолныйДоступ),
		|	МАКСИМУМ(ДоступРолевойАдресации)
		|ПО
		|	ОтборныеВизы.ОбъектВизирования,
		|	ОтборныеВизы.Виза,
		|	ОтборныеВизы.УсловиеДоступа";
	Иначе
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	ОтборныеВизы.ОбъектВизирования КАК ОбъектВизирования,
		|	ОтборныеВизы.Виза КАК Виза,
		|	ОтборныеВизы.ИД КАК ИД,
		|	ОтборныеВизы.ДатаКрайняя КАК ДатаКрайняя,
		|	ОтборныеВизы.ПринятоеРешение КАК ПринятоеРешение,
		|	ОтборныеВизы.ПолныйДоступ КАК ПолныйДоступ,
		|	ОтборныеВизы.УсловиеДоступа КАК УсловиеДоступа,
		|	ОтборныеВизы.ТипОбъектаВизирования КАК ТипОбъектаВизирования,
		|	ЕСТЬNULL(СтатусыОбъектов.Статус, ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.ПустаяСсылка)) КАК Статус,
		|	ЕСТЬNULL(НаличиеФайлов.ЕстьФайлы, ЛОЖЬ) КАК ЕстьФайлы,
		|	ОтборныеВизы.Организация КАК Организация,
		|	ДанныеДокументов.СуммаДокумента КАК СуммаДокумента,
		|	ДанныеДокументов.ВалютаДокумента КАК ВалютаДокумента,
		|	ДанныеДокументов.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА ДанныеДокументов.ВалютаДокумента ЕСТЬ NULL
		|			И &УсловиеОбъектРеестрПлатежей ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|	КОНЕЦ КАК ПересчитатьСумму,
		|	0 КАК ДоступРолевойАдресации,
		|	&МассивПредрасчетныхРеквизитов КАК МассивПредрасчетныхРеквизитов
		|ИЗ
		|	ОтборныеВизы КАК ОтборныеВизы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК СтатусыОбъектов
		|		ПО ОтборныеВизы.ОбъектВизирования = СтатусыОбъектов.Объект
		|			И (СтатусыОбъектов.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
		|		ПО ОтборныеВизы.ОбъектВизирования = НаличиеФайлов.ОбъектСФайлами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументов КАК ДанныеДокументов
		|		ПО ОтборныеВизы.ОбъектВизирования = ДанныеДокументов.ОбъектВизирования
		|ИТОГИ
		|	МАКСИМУМ(ПолныйДоступ),
		|	МАКСИМУМ(ДоступРолевойАдресации)
		|ПО
		|	ОбъектВизирования,
		|	Виза,
		|	УсловиеДоступа";
	КонецЕсли;
	
	НаименованиеРеестра = бит_ОбщегоНазначения.ИмяРеестраПлатежей();
	ТекстЗапроса        = СтрЗаменить(ТекстЗапроса, "&УсловиеОбъектРеестрПлатежей",
						"ОтборныеВизы.ОбъектВизирования ССЫЛКА Документ." + НаименованиеРеестра);
	
	МассивПредрасчетныхРеквизитов = ПредрасчетныеРеквизиты();
	ТекстПолученияРеквизитов      = "";
	Для каждого Реквизит Из МассивПредрасчетныхРеквизитов Цикл
		Если НЕ ПустаяСтрока(ТекстПолученияРеквизитов) Тогда
			ТекстПолученияРеквизитов = ТекстПолученияРеквизитов + ",
			|	";
		КонецЕсли;
		
		ИмяРеквизита = Реквизит.ИмяПоляРезультат;
		ТекстПолученияРеквизитов = ТекстПолученияРеквизитов + "ОтборныеВизы." + ИмяРеквизита + " КАК " + ИмяРеквизита;
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&МассивПредрасчетныхРеквизитов КАК МассивПредрасчетныхРеквизитов",
					ТекстПолученияРеквизитов);
					
	ОбработатьПредставлениеПереопределяемыхОбъектов(ТекстЗапроса, ОписаниеТиповВиз);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПолейСоединения(ОписаниеТиповВиз)
	
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтборныеВизы.ОбъектВизирования КАК ОбъектВизирования,
		|	ОтборныеВизы.ОбъектВизирования КАК ИсточникПолейСоединения
		|ПОМЕСТИТЬ ОбъектыИсточникиПолейСоединения
		|ИЗ
		|	ОтборныеВизы КАК ОтборныеВизы";
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтборныеВизы.ОбъектВизирования КАК ОбъектВизирования,
		|	ОтборныеВизы.ОбъектВизирования КАК ИсточникПолейСоединения
		|ПОМЕСТИТЬ ОбъектыИсточникиПолейСоединения
		|ИЗ
		|	ОтборныеВизы КАК ОтборныеВизы
		|ГДЕ
		|	НЕ ОтборныеВизы.ОбъектВизирования ССЫЛКА Документ.бит_кзн_ЗаявкаНаРасходованиеСредств
		|	И НЕ ОтборныеВизы.ОбъектВизирования ССЫЛКА Документ.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств
		|	И НЕ ОтборныеВизы.ОбъектВизирования ССЫЛКА Документ.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ОтборныеВизы.ОбъектВизирования,
		|	ПлатежнаяПозиция.Ссылка
		|ИЗ
		|	ОтборныеВизы КАК ОтборныеВизы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежнаяПозиция
		|		ПО ОтборныеВизы.ОбъектВизирования = ПлатежнаяПозиция.ДокументПланирования
		|			И (НЕ ПлатежнаяПозиция.ПометкаУдаления)";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	МассивПолейАналитики = ПоляАналитики();
	
	ТипыВиз   = ОписаниеТиповВиз.Типы();
	ПервыйТип = Истина;	
	
	Для каждого ТипВизы Из ТипыВиз Цикл
		
		МетаданныеОбъектаВизирования = ПустоеЗначениеТипа(ТипВизы).Метаданные();
		ПолноеИмяМетаданного         = МетаданныеОбъектаВизирования.ПолноеИмя();
		
		Если бит_ОбщегоНазначения.ЭтоСемействоERP()
			И (ПолноеИмяМетаданного = "Документ.бит_кзн_ЗаявкаНаРасходованиеСредств"
				ИЛИ ПолноеИмяМетаданного = "Документ.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств"
				ИЛИ ПолноеИмяМетаданного = "Документ.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию") Тогда
			ИмяИсточника        = "бит_кзн_ПлатежнаяПозиция";
			МетаданныеИсточника = Метаданные.Документы[ИмяИсточника];
			ПолноеИмяИсточника  = "Документ." + ИмяИсточника;
		Иначе
			МетаданныеИсточника = МетаданныеОбъектаВизирования;
			ПолноеИмяИсточника  = ПолноеИмяМетаданного;
		КонецЕсли;
		
		Если ПервыйТип Тогда
			ШаблонВыборки =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОбъектыИсточникиПолейСоединения.ОбъектВизирования КАК ОбъектВизирования,
			|	ОбъектыИсточникиПолейСоединения.ИсточникПолейСоединения КАК ИсточникПолейСоединения,
			|	&ОтборныеВизыАналитики КАК ОтборныеВизыАналитики
			|ИЗ
			|	ОбъектыИсточникиПолейСоединения КАК ОбъектыИсточникиПолейСоединения
			|ГДЕ
			|	ОбъектыИсточникиПолейСоединения.ОбъектВизирования ССЫЛКА Документ.бит_ФормаВводаБюджета";
		Иначе
			ШаблонВыборки = "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОбъектыИсточникиПолейСоединения.ОбъектВизирования КАК ОбъектВизирования,
			|	ОбъектыИсточникиПолейСоединения.ИсточникПолейСоединения КАК ИсточникПолейСоединения,
			|	&ОтборныеВизыАналитики КАК ОтборныеВизыАналитики
			|ИЗ
			|	ОбъектыИсточникиПолейСоединения КАК ОбъектыИсточникиПолейСоединения
			|ГДЕ
			|	ОбъектыИсточникиПолейСоединения.ОбъектВизирования ССЫЛКА Документ.бит_ФормаВводаБюджета";
		КонецЕсли;
		
		ТекстПолученияАналитик      = "";
		Для каждого Аналитика Из МассивПолейАналитики Цикл
			Если НЕ ПустаяСтрока(ТекстПолученияАналитик) Тогда
				ТекстПолученияАналитик = ТекстПолученияАналитик + ",
				|	";
			КонецЕсли;
			
			ИмяАналитики     = Аналитика.Имя;
			СинонимАналитики = Аналитика.Синоним;
			Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяАналитики, МетаданныеИсточника)
				И НЕ ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеИсточника.СтандартныеРеквизиты,
																ИмяАналитики) Тогда
				ТекстЗапросаАналитики = "NULL КАК %1";
				ТекстЗапросаАналитики = СтрШаблон(ТекстЗапросаАналитики, СинонимАналитики);
			Иначе
				ТекстЗапросаАналитики = "ВЫРАЗИТЬ(ОбъектыИсточникиПолейСоединения.ИсточникПолейСоединения КАК %1).%2 КАК %3";
				ТекстЗапросаАналитики = СтрШаблон(ТекстЗапросаАналитики, ПолноеИмяИсточника, ИмяАналитики,
													СинонимАналитики);
			КонецЕсли;
			
			ТекстПолученияАналитик = ТекстПолученияАналитик + ТекстЗапросаАналитики;
		КонецЦикла;
		ШаблонВыборки = СтрЗаменить(ШаблонВыборки, "&ОтборныеВизыАналитики КАК ОтборныеВизыАналитики",
							ТекстПолученияАналитик);
		ШаблонВыборки = СтрЗаменить(ШаблонВыборки, "Документ.бит_ФормаВводаБюджета", ПолноеИмяМетаданного);
		ТекстЗапроса  = ТекстЗапроса + ШаблонВыборки;
		
		ПервыйТип     = Ложь;
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПоляАналитики()
	
	ПоляАналитики = Новый Массив;
	
	Для Сч = 1 По 7 Цикл
		ИмяПоляАналитики = "Аналитика_" + Сч;
		ДобавитьПолеАналитики(ПоляАналитики, ИмяПоляАналитики);
	КонецЦикла;
	
	Если бит_ОбщегоНазначенияПовтИсп.ЭтоСемействоБП() Тогда
		ДобавитьПолеАналитики(ПоляАналитики, "СтатьяОборотов",       "Аналитика_8");
		ДобавитьПолеАналитики(ПоляАналитики, "ЦФО",                  "Аналитика_9");
		ДобавитьПолеАналитики(ПоляАналитики, "Контрагент",           "Аналитика_10");
		ДобавитьПолеАналитики(ПоляАналитики, "ДоговорКонтрагента",   "Аналитика_11");
		ДобавитьПолеАналитики(ПоляАналитики, "Сценарий",             "Аналитика_12");
		ДобавитьПолеАналитики(ПоляАналитики, "НоменклатурнаяГруппа", "Аналитика_13");
		ДобавитьПолеАналитики(ПоляАналитики, "Проект",               "Аналитика_14");
	ИначеЕсли бит_ОбщегоНазначенияПовтИсп.ЭтоСемействоERP() Тогда
		Для Сч = 8 По 12 Цикл
			ИмяПоляАналитики = "Аналитика_" + Сч;
			ДобавитьПолеАналитики(ПоляАналитики, ИмяПоляАналитики);
		КонецЦикла;
		
		ДобавитьПолеАналитики(ПоляАналитики, "ДатаПлан");
		ДобавитьПолеАналитики(ПоляАналитики, "ДатаПланКрайняя");
		ДобавитьПолеАналитики(ПоляАналитики, "ОбъектРасчетов");
		ДобавитьПолеАналитики(ПоляАналитики, "Договор");
	КонецЕсли;
	
	ДобавитьПолеАналитики(ПоляАналитики, "СтатьяОборотов");
	
	Возврат ПоляАналитики;
	
КонецФункции

Процедура ДобавитьПолеАналитики(ПоляАналитики, ИмяАналитики, СинонимАналитики = Неопределено)
	
	Если СинонимАналитики = Неопределено Тогда
		СинонимАналитики = ИмяАналитики;
	КонецЕсли;
	
	СтруктураАналитики = Новый Структура;
	СтруктураАналитики.Вставить("Имя",     ИмяАналитики);
	СтруктураАналитики.Вставить("Синоним", СинонимАналитики);
	
	ПоляАналитики.Добавить(СтруктураАналитики);
	
КонецПроцедуры

Функция ТекстЗапросаРеквизитовПоДокументуВизирования(МетаданныеВизы)
	
	Если Не ПравоДоступа("Чтение", МетаданныеВизы) Тогда
		Возврат "";
	КонецЕсли;
	
	ПолноеИмяМетаданных = МетаданныеВизы.ПолноеИмя();
	
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		Если ПолноеИмяМетаданных = "Документ.бит_РеестрПлатежей" Тогда
			Возврат ТекстЗапросаРеквизитов_бит_РеестрПлатежей();
		КонецЕсли;
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		Если ПолноеИмяМетаданных = "Документ.бит_кзн_ЗаявкаНаРасходованиеСредств" Тогда
			Возврат ТекстЗапросаРеквизитов_бит_кзн_ЗаявкаНаРасходованиеСредств();
		ИначеЕсли ПолноеИмяМетаданных = "Документ.бит_кзн_РеестрПлатежей" Тогда
			Возврат ТекстЗапросаРеквизитов_бит_кзн_РеестрПлатежей();
		ИначеЕсли ПолноеИмяМетаданных = "Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств" Тогда
			Возврат ТекстЗапросаРеквизитов_бит_кзн_ПланируемоеПоступлениеДенежныхСредств();
		КонецЕсли;
	КонецЕсли;
	
	// Варианты возможных реквизитов значений документов отображаются в порядке убывания приоритета их поиска.
	ВариантыРеквизитовСуммы = Новый Массив;
	ВариантыРеквизитовСуммы.Добавить("СуммаДокумента");
	ВариантыРеквизитовСуммы.Добавить("Сумма");
	ВариантыРеквизитовСуммы.Добавить("СуммаВзаиморасчеты");
	ВариантыРеквизитовВалюты = Новый Массив;
	ВариантыРеквизитовВалюты.Добавить("ВалютаДокумента");
	ВариантыРеквизитовВалюты.Добавить("Валюта");
	ВариантыРеквизитовВалюты.Добавить("ВалютаВзаиморасчетов");
	ВариантыРеквизитовДоговора = Новый Массив;
	ВариантыРеквизитовДоговора.Добавить("ДоговорКонтрагента");
	ВариантыРеквизитовДоговора.Добавить("Договор");
	
	ПолеСуммы    = ПутьВыборкиРеквизитаДокументаВизирования(МетаданныеВизы, ВариантыРеквизитовСуммы, "0");
	ПолеВалюты   = ПутьВыборкиРеквизитаДокументаВизирования(МетаданныеВизы, ВариантыРеквизитовВалюты,
						"ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)");
	ПолеДоговора = ПутьВыборкиРеквизитаДокументаВизирования(МетаданныеВизы, ВариантыРеквизитовДоговора, "НЕОПРЕДЕЛЕНО");
	
	ТекстЗапросаПоОбъекту = "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	МетаОбъектВизирования.Ссылка КАК ОбъектВизирования,
	|	&СуммаДокумента КАК СуммаДокумента,
	|	&ВалютаДокумента КАК ВалютаДокумента,
	|	&ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК ВидПлана
	|ИЗ
	|	РазличныеОбъектыВизирования КАК РазличныеОбъектыВизирования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсточникОбъектВизирования КАК МетаОбъектВизирования
	|		ПО РазличныеОбъектыВизирования.ОбъектВизирования = МетаОбъектВизирования.Ссылка";
	
	ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "ИсточникОбъектВизирования", МетаданныеВизы.ПолноеИмя());
	ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "&СуммаДокумента", ПолеСуммы);
	ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "&ВалютаДокумента", ПолеВалюты);
	ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "&ДоговорКонтрагента", ПолеДоговора);
	
	Возврат ТекстЗапросаПоОбъекту;
	
КонецФункции

Функция ПутьВыборкиРеквизитаДокументаВизирования(МетаданныеВизы, ВариантыИменРеквизита, ЗначениеПоУмолчанию)
	
	РеквизитыВизируемогоДокумента = МетаданныеВизы.Реквизиты;
	ШаблонПоляПоРеквизиту         = "МетаОбъектВизирования.%1";
	
	Для каждого ВариантРеквизита Из ВариантыИменРеквизита Цикл
		Если РеквизитыВизируемогоДокумента.Найти(ВариантРеквизита) <> Неопределено Тогда
			Возврат СтрШаблон(ШаблонПоляПоРеквизиту, ВариантРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

Функция ТекстЗапросаРеквизитов_бит_РеестрПлатежей()
	
	// По реестру выводим суммы только в том случае, если все заявки ТЧ указаны в одной валюте.
	
	ТекстЗапросаПоОбъекту = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧРеестра.Ссылка КАК ОбъектВизирования,
	|	СУММА(ТЧРеестра.Сумма) КАК СуммаДокумента,
	|	МАКСИМУМ(ТЧРеестра.ВалютаДокумента) КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК ВидПлана
	|ИЗ
	|	РазличныеОбъектыВизирования КАК РазличныеОбъектыВизирования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_РеестрПлатежей.Заявки КАК ТЧРеестра
	|		ПО РазличныеОбъектыВизирования.ОбъектВизирования = ТЧРеестра.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧРеестра.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЧРеестра.ВалютаДокумента) = 1";
	
	Возврат ТекстЗапросаПоОбъекту;
	
КонецФункции

Функция ТекстЗапросаРеквизитов_бит_кзн_ЗаявкаНаРасходованиеСредств()
	
	ТекстЗапросаПоОбъекту = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеСредств.Ссылка КАК ОбъектВизирования,
	|	СУММА(ПлатежныеПозиции.СуммаДокумента) КАК СуммаДокумента,
	|	МАКСИМУМ(ПлатежныеПозиции.ВалютаДокумента) КАК ВалютаДокумента,
	|	МАКСИМУМ(ПлатежныеПозиции.Договор) КАК ДоговорКонтрагента,
	|	ЗаявкаНаРасходованиеСредств.ВидПлана КАК ВидПлана
	|ИЗ
	|	РазличныеОбъектыВизирования КАК РазличныеОбъектыВизирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежныеПозиции
	|		ПО (РазличныеОбъектыВизирования.ОбъектВизирования ССЫЛКА Документ.бит_кзн_ЗаявкаНаРасходованиеСредств)
	|			И РазличныеОбъектыВизирования.ОбъектВизирования = ПлатежныеПозиции.ДокументПланирования
	|			И (НЕ ПлатежныеПозиции.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ЗаявкаНаРасходованиеСредств КАК ЗаявкаНаРасходованиеСредств
	|		ПО РазличныеОбъектыВизирования.ОбъектВизирования = ЗаявкаНаРасходованиеСредств.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаРасходованиеСредств.Ссылка,
	|	ЗаявкаНаРасходованиеСредств.ВидПлана
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПлатежныеПозиции.ВалютаДокумента) < 2";
	
	Возврат ТекстЗапросаПоОбъекту;
	
КонецФункции

Функция ТекстЗапросаРеквизитов_бит_кзн_РеестрПлатежей()
	
	ТекстЗапросаПоОбъекту = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧРеестра.Ссылка КАК ОбъектВизирования,
	|	СУММА(ТЧРеестра.СуммаДокумента) КАК СуммаДокумента,
	|	МАКСИМУМ(ТЧРеестра.ВалютаПлатежа) КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК ВидПлана
	|ИЗ
	|	РазличныеОбъектыВизирования КАК РазличныеОбъектыВизирования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_РеестрПлатежей.ТаблицаПлатежи КАК ТЧРеестра
	|		ПО РазличныеОбъектыВизирования.ОбъектВизирования = ТЧРеестра.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧРеестра.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЧРеестра.ВалютаПлатежа) = 1";
	
	Возврат ТекстЗапросаПоОбъекту;
	
КонецФункции

Функция ТекстЗапросаРеквизитов_бит_кзн_ПланируемоеПоступлениеДенежныхСредств()
	
	ТекстЗапросаПоОбъекту = "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПланируемоеПоступление.Ссылка КАК ОбъектВизирования,
	|	0 КАК СуммаДокумента,
	|	ПланируемоеПоступление.ВалютаДокумента КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКонтрагента,
	|	ПланируемоеПоступление.ВидПлана КАК ВидПлана
	|ИЗ
	|	РазличныеОбъектыВизирования КАК РазличныеОбъектыВизирования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств КАК ПланируемоеПоступление
	|		ПО РазличныеОбъектыВизирования.ОбъектВизирования = ПланируемоеПоступление.Ссылка";
	
	Возврат ТекстЗапросаПоОбъекту;
	
КонецФункции

Процедура ОбработатьПредставлениеПереопределяемыхОбъектов(ТекстЗапроса, ОписаниеТиповВиз)
	
	Если НЕ бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонТипаДокумента = "ДокументСсылка.%1";
	ТипЗаявкаНаРасходование   = Тип(СтрШаблон(ШаблонТипаДокумента,
								бит_ОбщегоНазначенияПереопределяемый.ИмяЗаявкиНаРасходованиеСредств()));
	ТипПланируемоеПоступление = Тип(СтрШаблон(ШаблонТипаДокумента,
								бит_ОбщегоНазначенияПереопределяемый.ИмяПланируемогоПоступленияДенежныхСредств()));
	Если НЕ ОписаниеТиповВиз.СодержитТип(ТипЗаявкаНаРасходование)
		И НЕ ОписаниеТиповВиз.СодержитТип(ТипПланируемоеПоступление) Тогда
		Возврат;
	КонецЕсли;
	
	ПодстрокаПоиска = "ОтборныеВизы.ТипОбъектаВизирования КАК ТипОбъектаВизирования";
	ПодстрокаЗамены =
	"ВЫБОР
	|	КОГДА ОтборныеВизы.ОбъектВизирования ССЫЛКА Документ.бит_кзн_ЗаявкаНаРасходованиеСредств
	|		И ДанныеДокументов.ВидПлана = ЗНАЧЕНИЕ(Перечисление.бит_кзн_ВидыПланов.Прогноз) ТОГДА
	|		""%1""
	|	КОГДА ОтборныеВизы.ОбъектВизирования ССЫЛКА Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств
	|		И ДанныеДокументов.ВидПлана = ЗНАЧЕНИЕ(Перечисление.бит_кзн_ВидыПланов.Прогноз) ТОГДА
	|		""%2""
	|   ИНАЧЕ
	|		ОтборныеВизы.ТипОбъектаВизирования
	|КОНЕЦ КАК ТипОбъектаВизирования";
	ПодстрокаЗамены = СтрШаблон(ПодстрокаЗамены, НСтр("ru='Прогноз платежа';en='Prediction payment'"),
						НСтр("ru='Прогноз поступления ДС';en='Prediction DS incoming'"));
	ТекстЗапроса    = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
КонецПроцедуры

Функция ОписаниеТаблицыИсточникаСКД(ОписаниеТиповОбъектов)
	
	ТипДата                 = Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ТипДатаВремя            = Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ТипСтрока36             = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(36, ДопустимаяДлина.Переменная));
	ТипСтрокаНеограниченная = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
	ТипОрганизация          = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ТаблицаИсточник         = Новый ТаблицаЗначений;
	
	ТаблицаИсточник.Колонки.Добавить("ОбъектВизирования",		ОписаниеТиповОбъектов);
	ТаблицаИсточник.Колонки.Добавить("ДатаКрайняя",				ТипДатаВремя);
	ТаблицаИсточник.Колонки.Добавить("ПринятоеРешение",			Новый ОписаниеТипов("СправочникСсылка.бит_ВидыРешенийСогласования"));
	ТаблицаИсточник.Колонки.Добавить("Виза",					Новый ОписаниеТипов("СправочникСсылка.бит_Визы"));
	ТаблицаИсточник.Колонки.Добавить("ТипОбъектаВизирования",	ТипСтрокаНеограниченная);
	ТаблицаИсточник.Колонки.Добавить("ИД",						ТипСтрока36);
	ТаблицаИсточник.Колонки.Добавить("ОбъектСистемы",			Новый ОписаниеТипов("СправочникСсылка.бит_ОбъектыСистемы"));
	ТаблицаИсточник.Колонки.Добавить("Статус",					Новый ОписаниеТипов("СправочникСсылка.бит_СтатусыОбъектов"));
	ТаблицаИсточник.Колонки.Добавить("ЕстьФайлы",				Новый ОписаниеТипов("Булево"));
	ТаблицаИсточник.Колонки.Добавить("Организация",				ТипОрганизация);
	ТаблицаИсточник.Колонки.Добавить("СуммаДокумента",			Новый ОписаниеТипов("Число",
															  	Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаИсточник.Колонки.Добавить("ВалютаДокумента",			Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаИсточник.Колонки.Добавить("Дата",					ТипДатаВремя);
	ТаблицаИсточник.Колонки.Добавить("Номер",					Новый ОписаниеТипов("Строка", ,
															  	Новый КвалификаторыСтроки(12, ДопустимаяДлина.Переменная)));
	ТаблицаИсточник.Колонки.Добавить("Контрагент",				Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаИсточник.Колонки.Добавить("СверхБюджета",			Новый ОписаниеТипов("Булево, Null"));
	ТаблицаИсточник.Колонки.Добавить("НазначениеПлатежаУпр",	Новый ОписаниеТипов("Строка", ,
																Новый КвалификаторыСтроки(210, ДопустимаяДлина.Переменная)));
	ТаблицаИсточник.Колонки.Добавить("Ответственный",			Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаИсточник.Колонки.Добавить("Сценарий",				Новый ОписаниеТипов("СправочникСсылка.СценарииПланирования"));
	ТаблицаИсточник.Колонки.Добавить("Исполнитель",				Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаИсточник.Колонки.Добавить("Инициатор",				Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаИсточник.Колонки.Добавить("Проект",					Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	ТаблицаИсточник.Колонки.Добавить("ДатаРасхода",				ТипДата);
	ТаблицаИсточник.Колонки.Добавить("ДоговорКонтрагента",		Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаИсточник.Колонки.Добавить("Комментарий",				Новый ОписаниеТипов("Строка", ,
																Новый КвалификаторыСтроки(120, ДопустимаяДлина.Переменная)));
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ТаблицаИсточник.Колонки.Добавить("ОснованиеПланирования", Документы.ТипВсеСсылки());
	Иначе
		ТаблицаИсточник.Колонки.Добавить("ОснованиеПланирования", Новый ОписаниеТипов("ПеречислениеСсылка.бит_кзн_ВидыПланов"));
	КонецЕсли;

	Возврат ТаблицаИсточник;
	
КонецФункции

Функция ОписаниеТаблицыПолейСоединенияСтрок(ОписаниеТиповОбъектов)
	
	ТаблицаИсточник = Новый ТаблицаЗначений;
	ТипОрганизация  = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ТипДатаNULL     = Новый ОписаниеТипов("Дата, NULL", , ,Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаИсточник.Колонки.Добавить("ОбъектВизирования", ОписаниеТиповОбъектов);
	ТаблицаИсточник.Колонки.Добавить("ДатаПлан",          ТипДатаNULL, "");
	ТаблицаИсточник.Колонки.Добавить("ДатаПланКрайняя",   ТипДатаNULL, "");
	ТаблицаИсточник.Колонки.Добавить("СтатьяОборотов",    Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиОборотов, NULL"));
	
	НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	Для каждого ЭлементНастройки Из НастройкиИзмерений Цикл
		Если ЭлементНастройки.Значение.ТипЗначения = ТипОрганизация Тогда
			Продолжить; // Организация выводится из реквизита шапки
		КонецЕсли;
		ТаблицаИсточник.Колонки.Добавить(ЭлементНастройки.Ключ,
											Новый ОписаниеТипов(ЭлементНастройки.Значение.ТипЗначения, "NULL"),
											ЭлементНастройки.Значение.Синоним);
	КонецЦикла;
	
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		ТаблицаИсточник.Колонки.Добавить("ОбъектРасчетов", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
		ТаблицаИсточник.Колонки.Добавить("Договор",
			Новый ОписаниеТипов("СправочникСсылка.ДоговорыМеждуОрганизациями, СправочникСсылка.ДоговорыКонтрагентов"));
	КонецЕсли;
	
	Возврат ТаблицаИсточник;
	
КонецФункции

Процедура НастроитьГруппировкиОтчета(Настройки, ВариантГруппировки)
	
	СтруктураНастройки = Настройки.Структура;
	СтруктураНастройки.Очистить();
	
	РасположениеИтогов = Настройки.ПараметрыВывода.Элементы.Найти("РасположениеИтогов");
	РасположениеИтогов.Использование = Ложь;
	
	СтрокаГруппировки = Неопределено;
	Если ВариантГруппировки = 0 Тогда
		// Группировка по сроку выполнения.
		СтрокаГруппировки    = СтруктураНастройки.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		
		ПоляГруппировки      = СтрокаГруппировки.ПоляГруппировки.Элементы;
		НовоеПолеГруппировки = ПоляГруппировки.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		НовоеПолеГруппировки.Поле          = Новый ПолеКомпоновкиДанных("СрокВыполнения");
		НовоеПолеГруппировки.Использование = Истина;
		НовоеПолеГруппировки = ПоляГруппировки.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		НовоеПолеГруппировки.Поле          = Новый ПолеКомпоновкиДанных("ПорядокСортировкиСрока");
		НовоеПолеГруппировки.Использование = Истина;
		
		ВыбранныеПоля   = СтрокаГруппировки.Выбор.Элементы;
		НовоеПолеВыбора = ВыбранныеПоля.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПолеВыбора.Поле          = Новый ПолеКомпоновкиДанных("СрокВыполнения");
		НовоеПолеВыбора.Использование = Истина;
		
		ПоляПорядка      = СтрокаГруппировки.Порядок.Элементы;
		НовоеПолеПорядка = ПоляПорядка.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		НовоеПолеПорядка.Использование = Истина;
		
		СтрокаГруппировки.Использование = Истина;
	ИначеЕсли ВариантГруппировки = 1 Тогда
		// Группировка по видам документов.
		СтрокаГруппировки    = СтруктураНастройки.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		
		ПоляГруппировки      = СтрокаГруппировки.ПоляГруппировки.Элементы;
		НовоеПолеГруппировки = ПоляГруппировки.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		НовоеПолеГруппировки.Поле          = Новый ПолеКомпоновкиДанных("ВидДокумента");
		НовоеПолеГруппировки.Использование = Истина;
		
		ВыбранныеПоля   = СтрокаГруппировки.Выбор.Элементы;
		НовоеПолеВыбора = ВыбранныеПоля.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПолеВыбора.Поле          = Новый ПолеКомпоновкиДанных("ВидДокумента");
		НовоеПолеВыбора.Использование = Истина;
		
		ПоляПорядка      = СтрокаГруппировки.Порядок.Элементы;
		НовоеПолеПорядка = ПоляПорядка.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		НовоеПолеПорядка.Использование = Истина;
		
		СтрокаГруппировки.Использование = Истина;
	Иначе
		// Без группировок.
		РасположениеИтогов.Значение      = РасположениеИтоговКомпоновкиДанных.Нет;
		РасположениеИтогов.Использование = Истина;
	КонецЕсли;
	
	Если СтрокаГруппировки = Неопределено Тогда 
		СтрокаДетальныхЗаписей = СтруктураНастройки.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Иначе
		СтрокаДетальныхЗаписей = СтрокаГруппировки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	КонецЕсли;
	ВыбранныеПоля   = СтрокаДетальныхЗаписей.Выбор.Элементы;
	НовоеПолеВыбора = ВыбранныеПоля.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	НовоеПолеВыбора.Использование = Истина;
	СтрокаДетальныхЗаписей.Использование = Истина;
	
	ПоляПорядка      = СтрокаДетальныхЗаписей.Порядок.Элементы;
	НовоеПолеПорядка = ПоляПорядка.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	НовоеПолеПорядка.Использование = Истина;
	
КонецПроцедуры

Функция ПозицияВыбранногоПоля(КоллекцияЭлементовСтруктуры, ПолеКомпоновки)
	
	СчетчикПолей = 1;
	Для каждого ВыбранноеПоле Из КоллекцияЭлементовСтруктуры.Выбор.Элементы Цикл
		Если ТипЗнч(ВыбранноеПоле) = Тип("АвтоВыбранноеПолеКомпоновкиДанных")
			ИЛИ НЕ ВыбранноеПоле.Использование Тогда
			Продолжить;
		КонецЕсли;
		Если ВыбранноеПоле.Поле = ПолеКомпоновки Тогда
			Возврат СчетчикПолей;
		КонецЕсли;
		СчетчикПолей = СчетчикПолей + 1;
	КонецЦикла;
	
	Для каждого НастройкиГруппировки Из КоллекцияЭлементовСтруктуры.Структура Цикл
		НомерПозиции = ПозицияВыбранногоПоля(НастройкиГруппировки, ПолеКомпоновки);
		Если НомерПозиции <> 0 Тогда
			Возврат НомерПозиции;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

// Возвращает ссылку на элемент справочника "Объекты системы", соответствующий переданному типу
//
// Параметры:
//  ТипОбъекта - Тип.
// 
// Возвращаемое значение:
//  СправочникСсылка.бит_ОбъектыСистемы.
//
Функция ОбъектСистемыДокумент(СоответствиеОбъектовСистемы, ТипОбъекта)
	
	Если НЕ ЗначениеЗаполнено(ТипОбъекта)
		ИЛИ ТипЗнч(ТипОбъекта) <> Тип("Тип") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СоответствиеОбъектовСистемы = Неопределено Тогда
		СоответствиеОбъектовСистемы = Новый Соответствие;
	КонецЕсли;
	
	ОбъектСистемы = СоответствиеОбъектовСистемы.Получить(ТипОбъекта);
	Если ОбъектСистемы = Неопределено Тогда
		ОбъектСистемы =  бит_УправлениеОбъектамиСистемы.НайтиОбъектДоступаПоТипу(ТипОбъекта,
							Перечисления.бит_ВидыОбъектовСистемы.Документ);
		СоответствиеОбъектовСистемы.Вставить(ТипОбъекта, ОбъектСистемы);
	КонецЕсли;
	
	Возврат ОбъектСистемы;
	
КонецФункции

Функция ВыполняетсяПользовательскоеУсловие(ОбъектВизирования, ПользовательскоеУсловие, Ответственный)
	
	ПараметрыУсловия = Новый Структура;
	ПараметрыУсловия.Вставить("ТекущийОбъект",       ОбъектВизирования);
	ПараметрыУсловия.Вставить("ТекущийПользователь", Ответственный);
	Возврат бит_УправлениеПроцессами.ПроверитьПользовательскоеУсловие(ПользовательскоеУсловие,
							ПараметрыУсловия,,,"Ошибки");
	
КонецФункции

Процедура УстановитьОграниченияИспользованияПоляСКД(СКД, ИмяНабора, ИмяПоля, Ограничение = Истина)
	
	ПолеАналитикиСКД = СКД.НаборыДанных[ИмяНабора].Поля.Найти(ИмяПоля);
	Если ПолеАналитикиСКД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеАналитикиСКД.ОграничениеИспользования.Группировка = Ограничение;
	ПолеАналитикиСКД.ОграничениеИспользования.Поле        = Ограничение;
	ПолеАналитикиСКД.ОграничениеИспользования.Порядок     = Ограничение;
	ПолеАналитикиСКД.ОграничениеИспользования.Условие     = Ограничение;	
	
КонецПроцедуры

Функция СуммаИВалютаДокумента(ДокументВизирования, ДатаПересчета)
	
	СуммаИВалюта = Новый Структура;
	СуммаИВалюта.Вставить("СуммаДокумента",  0);
	СуммаИВалюта.Вставить("ВалютаДокумента", Справочники.Валюты.ПустаяСсылка());
	
	Если ЭтоСсылкаНаРеестр(ДокументВизирования) Тогда
		ВалютаРегл = бит_ОбщегоНазначенияПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета");
		
		Запрос  = Новый Запрос;
		Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	РеестрПлатежей.ВалютаДокумента КАК ВалютаДокумента,
			|	РеестрПлатежей.Сумма КАК Сумма
			|ПОМЕСТИТЬ ТабличнаяЧастьРеестра
			|ИЗ
			|	Документ.бит_РеестрПлатежей.Заявки КАК РеестрПлатежей
			|ГДЕ
			|	РеестрПлатежей.Ссылка = &Ссылка";
		Иначе
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	РеестрПлатежей.ВалютаДокумента КАК ВалютаДокумента,
			|	РеестрПлатежей.СуммаДокумента КАК Сумма
			|ПОМЕСТИТЬ ТабличнаяЧастьРеестра
			|ИЗ
			|	Документ.бит_кзн_РеестрПлатежей.ТаблицаПлатежи КАК РеестрПлатежей
			|ГДЕ
			|	РеестрПлатежей.Ссылка = &Ссылка";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ТабличнаяЧастьРеестра.ВалютаДокумента = &ВалютаРегл
		|				ТОГДА ТабличнаяЧастьРеестра.Сумма
		|			ИНАЧЕ ТабличнаяЧастьРеестра.Сумма * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
		|		КОНЕЦ) КАК Сумма
		|ИЗ
		|	ТабличнаяЧастьРеестра КАК ТабличнаяЧастьРеестра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПересчета, ) КАК КурсыВалютСрезПоследних
		|		ПО ТабличнаяЧастьРеестра.ВалютаДокумента = КурсыВалютСрезПоследних.Валюта";
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка",        ДокументВизирования);
		Запрос.УстановитьПараметр("ДатаПересчета", ДатаПересчета);
		Запрос.УстановитьПараметр("ВалютаРегл",    ВалютаРегл);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Сумма) Тогда
			СуммаИВалюта.ВалютаДокумента = ВалютаРегл;
			СуммаИВалюта.СуммаДокумента  = Выборка.Сумма;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СуммаИВалюта;
	
КонецФункции

Процедура УстановитьПараметрыДанных(Настройки, ПараметрыПолучения)
	
	ПараметрРежимАрхива = Настройки.ПараметрыДанных.Элементы.Найти("РежимАрхива");
	Если ПараметрРежимАрхива <> Неопределено Тогда
		ПараметрРежимАрхива.Использование = Истина;
		ПараметрРежимАрхива.Значение      = ПараметрыПолучения.РежимАрхива;
	КонецЕсли;
	
	ПараметрТекущаяДата = Настройки.ПараметрыДанных.Элементы.Найти("ТекущаяДата");
	Если ПараметрТекущаяДата <> Неопределено Тогда
		ПараметрТекущаяДата.Использование = Истина;
		ПараметрТекущаяДата.Значение      = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПараметрыВывода(Настройки, ПараметрыПолучения)
	
	ПараметрАвтопозицияРесурсов = Настройки.ПараметрыВывода.Элементы.Найти("АвтопозицияРесурсов");
	Если ПараметрАвтопозицияРесурсов <> Неопределено Тогда
		АвтопозицияРесурсов = ПараметрыПолучения.АвтопозицияРесурсов;
		Если АвтопозицияРесурсов = Истина Тогда
			ПараметрАвтопозицияРесурсов.Использование = Ложь;
		Иначе
			ПараметрАвтопозицияРесурсов.Использование = Истина;
			ПараметрАвтопозицияРесурсов.Значение      = АвтоПозицияРесурсовКомпоновкиДанных.НеИспользовать;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ПорядокИЗаголовкиПолейСхемы(ПараметрыПолучения, Схема, Настройки, ИсключаемыеПоля)
	
	ПорядокИЗаголовкиПолей = Новый Массив;
	
	Если НЕ ПараметрыПолучения.ВозвращатьПорядокИЗаголовкиПолей Тогда
		Возврат ПорядокИЗаголовкиПолей;
	КонецЕсли;
	
	ДобавитьОпределениеПолей(ПорядокИЗаголовкиПолей, Настройки.Выбор.Элементы, Схема, ИсключаемыеПоля);
	Если Настройки.Структура.Количество() = 1 Тогда
		ДобавитьОпределениеПолей(ПорядокИЗаголовкиПолей, Настройки.Структура[0].ПоляГруппировки.Элементы,
									Схема, ИсключаемыеПоля);
	КонецЕсли;
		
	Возврат ПорядокИЗаголовкиПолей;
	
КонецФункции

Процедура ДобавитьОпределениеПолей(ПорядокИЗаголовкиПолей, КоллекцияЭлементовИсточник, Схема, ИсключаемыеПоля)
	
	Для каждого ЭлементКоллекцииПолей Из КоллекцияЭлементовИсточник Цикл
		Если НЕ ЭлементКоллекцииПолей.Использование Тогда
			Продолжить;
		КонецЕсли;
		ВыбранноеПоле = ЭлементКоллекцииПолей.Поле;
		Если ИсключаемыеПоля.НайтиПоЗначению(ВыбранноеПоле) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеСтрокой   = Строка(ВыбранноеПоле);
		
		СтруктураПоля = Новый Структура("Имя, Заголовок");
		СтруктураПоля.Имя        = СтрЗаменить(ПолеСтрокой, ".", "");
		СтруктураПоля.Заголовок  = ПолеСтрокой;
		НайденоОпределение = Ложь;
		Для каждого НаборДанных Из Схема.НаборыДанных Цикл
			Для каждого ПолеНабора Из НаборДанных.Поля Цикл
				Если ПолеСтрокой = ПолеНабора.Поле Тогда
					СтруктураПоля.Заголовок = ПолеНабора.Заголовок;
					НайденоОпределение      = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НайденоОпределение Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ПорядокИЗаголовкиПолей.Добавить(СтруктураПоля);
		ИсключаемыеПоля.Добавить(ВыбранноеПоле);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьВнешниеОтборы(ПараметрыПолучения, Настройки)
	
	Отборы = ПараметрыПолучения.Отбор.ВнешниеОтборы;
	Если Отборы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтборыНастройки = Настройки.Отбор.Элементы;
	
	ПризнакСтандартногоВарианта = "/StandardPeriodVariant:";
	
	Для каждого ЭлементОтбора Из Отборы Цикл
		ЗначениеОтбора = ЭлементОтбора.Значение;
		
		ЗначениеФильтра = ЗначениеОтбора.ПравоеЗначение;
		Если ТипЗнч(ЗначениеФильтра) = Тип("Строка")
			И СтрНачинаетсяС(ЗначениеФильтра, ПризнакСтандартногоВарианта) Тогда
			
			ОписаниеВарианта = СтрЗаменить(ЗначениеФильтра, ПризнакСтандартногоВарианта, "");
			ОписаниеВарианта = ЗначениеИзСтрокиВнутр(ОписаниеВарианта);
			ФильтрПериод     = Новый СтандартныйПериод(ОписаниеВарианта);
			
			НовыйЭлементОтбора = ОтборыНастройки.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ЗначениеОтбора.ЛевоеЗначение);
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			НовыйЭлементОтбора.ПравоеЗначение = ФильтрПериод.ДатаНачала;
			НовыйЭлементОтбора.Использование  = Истина;
			
			НовыйЭлементОтбора = ОтборыНастройки.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ЗначениеОтбора.ЛевоеЗначение);
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			НовыйЭлементОтбора.ПравоеЗначение = ФильтрПериод.ДатаОкончания;
			НовыйЭлементОтбора.Использование  = Истина;
		Иначе
			НовыйЭлементОтбора = ОтборыНастройки.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ЗначениеОтбора.ЛевоеЗначение);
			НовыйЭлементОтбора.ВидСравнения   = ЗначениеОтбора.ВидСравнения;
			НовыйЭлементОтбора.ПравоеЗначение = ЗначениеОтбора.ПравоеЗначение;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция КартинкаБиблиотеки(Назначение)
	
	Если Назначение = "ФлагВыбораЛожь" Тогда
		Возврат БиблиотекаКартинок.бит_ЗвездаПустая;
	ИначеЕсли Назначение = "ФлагВыбораИстина" Тогда
		Возврат БиблиотекаКартинок.бит_ЗвездаСтрелочка;
	ИначеЕсли Назначение = "Согласовано" Тогда
		Возврат БиблиотекаКартинок.бит_ГалочкаКруглая;
	ИначеЕсли Назначение = "Отклонено" Тогда
		Возврат БиблиотекаКартинок.УдалитьНепосредственно;
	КонецЕсли;
	
КонецФункции

Функция ПараметрыИзвлеченияКартинки(ИсходныйТекст)
	
	// #Картинка#НаименованиеИзображения#[Произвольный текст после извлечения]
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Текст");
	СтруктураПараметров.Вставить("Картинка");
	
	Если ТекстСодержитИдентификаторКартинки(ИсходныйТекст) Тогда
		НачалоОписанияКартинки = СтрНайти(ИсходныйТекст, "#",,, 2);
		ОкончаниеОписанияКартинки = СтрНайти(ИсходныйТекст, "#",,, 3);
	КонецЕсли;
	
	НаименованиеКартинки = Сред(ИсходныйТекст, НачалоОписанияКартинки + 1, ОкончаниеОписанияКартинки - НачалоОписанияКартинки - 1);
	СтруктураПараметров.Текст    = СтрЗаменить(ИсходныйТекст, ИдентификаторПодстановкиКартинки() + НаименованиеКартинки + "#", "");
	СтруктураПараметров.Картинка = БиблиотекаКартинок[НаименованиеКартинки];
		
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ИдентификаторПодстановкиКартинки()
	
	Возврат "#Картинка#";
	
КонецФункции

Функция ТекстСодержитИдентификаторКартинки(ИсходныйТекст)
	
	ПодстановкаКартинки = ИдентификаторПодстановкиКартинки();
	Если СтрНайти(ИсходныйТекст, ПодстановкаКартинки) > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПредрасчетныеРеквизиты()
	
	ПредрасчетныеРеквизиты = Новый Массив;
	ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "Дата");
	ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "Комментарий", 250);
	ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "Контрагент");
	ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "НазначениеПлатежаУпр");
	ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "Номер");
	ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "Ответственный");
	ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "СверхБюджета");
	ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "Сценарий");
	
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "ДатаРасхода");
		ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "Исполнитель");
		ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "Проект");
		ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "ДокументОснование",, "ОснованиеПланирования");
	Иначе
		ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "Инициатор");
		ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, "ВидПлана",, "ОснованиеПланирования");
	КонецЕсли;
	
	Возврат ПредрасчетныеРеквизиты;
	
КонецФункции

Процедура ДобавитьПредрасчетныйРеквизит(ПредрасчетныеРеквизиты, ИмяРеквизита, ОграничениеДлины = 0, ИмяПоляРезультат = "")
	
	СтруктураРеквизита = Новый Структура;
	СтруктураРеквизита.Вставить("Имя", ИмяРеквизита);
	СтруктураРеквизита.Вставить("ОграничениеДлины", ОграничениеДлины);
	СтруктураРеквизита.Вставить("ИмяПоляРезультат", ?(ПустаяСтрока(ИмяПоляРезультат), ИмяРеквизита, ИмяПоляРезультат));
	
	ПредрасчетныеРеквизиты.Добавить(СтруктураРеквизита);
	
КонецПроцедуры

Функция ЭтоСсылкаНаРеестр(ДокументСсылка)
	
	НаименованиеРеестра = бит_ОбщегоНазначения.ИмяРеестраПлатежей();
	ТипРеестра   = Тип("ДокументСсылка." + НаименованиеРеестра);
	ТипДокумента = ТипЗнч(ДокументСсылка);
	
	Возврат ТипДокумента = ТипРеестра;
	
КонецФункции

Процедура УстановитьРешениеПоСтроке(СтрокаДанных, ПараметрыОтметкиРешения, СообщенияПользователю)
	
	Если НЕ СтрокаДанных.Обрабатывать Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектВизирования = СтрокаДанных.ОбъектВизирования;
	
	Если НЕ СогласованиеПоВизеДоступно(ОбъектВизирования,
										СтрокаДанных.ИД,
										ПараметрыОтметкиРешения.ТекущийПользователь) Тогда 
		ТекстСообщения = НСтр("ru='Визы были изменены другим пользователем, согласование невозможно.';
							  |en='Visas have been changed by another user, can`t set desition.'");
		СообщенияПользователю.Добавить(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыОтметкиРешения.ПроводитьПослеУтверждения = бит_ВизированиеСервер.ПриниматьКУчетуПослеУтверждения(ОбъектВизирования);
	ПараметрыОтметкиРешения.ОбъектВизирования         = ОбъектВизирования;
	ПараметрыОтметкиРешения.ИДВизы                    = СтрокаДанных.ИД;

	Если УстановитьРешениеПоВизе(ПараметрыОтметкиРешения, СообщенияПользователю) Тогда
		СтрокаДанных.Обрабатывать    = Ложь;
		СтрокаДанных.ПринятоеРешение = ПараметрыОтметкиРешения.Решение;	
	КонецЕсли;
	
КонецПроцедуры

Функция СогласованиеПоВизеДоступно(ОбъектВизирования, ИДВизы, Пользователь)
	
	НаборВиз = РегистрыСведений.бит_УстановленныеВизы.СоздатьНаборЗаписей();
	НаборВиз.Отбор.Объект.Установить(ОбъектВизирования);
	НаборВиз.Прочитать();
	ТаблицаВизы = НаборВиз.Выгрузить();
	ТаблицаВизы.Колонки.Добавить("ДоступностьВизы", Новый ОписаниеТипов("Булево"));
	
	ВизыПользователя  = бит_ВизированиеСервер.ВизыПользователя(Пользователь, ОбъектВизирования);
	ЕстьПараНаВсеВизы = (ВизыПользователя.НайтиПоЗначению(Справочники.бит_ГруппыВиз.ВсеВизы) <> Неопределено);
	
	Для каждого СтрокаВизы Из ТаблицаВизы Цикл
		СтрокаВизы.ДоступностьВизы = ЕстьПараНаВсеВизы
										ИЛИ (ВизыПользователя.НайтиПоЗначению(СтрокаВизы.Виза) <> Неопределено);
	КонецЦикла;
		
	Алгоритм = Справочники.бит_АлгоритмыПроцессов.ПустаяСсылка();
	Для каждого СтрокаВизы Из ТаблицаВизы Цикл
		Если ЗначениеЗаполнено(СтрокаВизы.Алгоритм) Тогда
			Алгоритм = СтрокаВизы.Алгоритм;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	ВыполнятьПоэтапно = бит_УправлениеПроцессами.ВыполнятьАлгоритмПоэтапно(Алгоритм);	
	
	ТаблицаТочек      = бит_УправлениеПроцессами.ОписаниеТочекАлгоритма(Алгоритм, ТаблицаВизы);
	
	// Определяем, какие точки алгоритма доступны.
	ДопПараметрыПроверкиУсловий = бит_ВизированиеСервер.НовыеПараметрыПроверкиУсловия();
	ДопПараметрыПроверкиУсловий.ТекущийОбъект = ОбъектВизирования;
	ДопПараметрыПроверкиУсловий.Визы          = ТаблицаВизы;
	ДопПараметрыПроверкиУсловий.Алгоритм      = Алгоритм;

	бит_УправлениеПроцессами.ОпределитьДоступностьТочек(ТаблицаТочек, ВыполнятьПоэтапно, ДопПараметрыПроверкиУсловий);
	
	СтрокаВизы = ТаблицаТочек.Найти(ИДВизы, "ИД");
	Если СтрокаВизы = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат СтрокаВизы.Доступность;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли