
#Область ПрограммныйИнтерфейс
 
// Процедура добавляет в список вид договора с указанным именем, при условии,
//  что в структуре ВидыДоговоров существет значение с заданным именем. Данная проверка актуальна,
//  т.к. в УПП/КА и БП состав значений перечисления ВидыДоговоров различный.
//
// Параметры:
//  СписокВидыДоговоров	 - Массив - Список видов договоров.
//  ВидыДоговоров		 - Структура - Виды договоров.
//  ИмяВидаДоговора		 - Строка - Имя вида договора.
//
Процедура ДобавитьВидДоговора(СписокВидыДоговоров, ВидыДоговоров, ИмяВидаДоговора) Экспорт

	Если ВидыДоговоров.Свойство(ИмяВидаДоговора) Тогда
	
		 СписокВидыДоговоров.Добавить(ВидыДоговоров[ИмяВидаДоговора]);
	
	КонецЕсли; 

КонецПроцедуры // ДобавитьВидДоговора()

// Выполняется проверка принадлежности вида договора к определенному значению.
// 
// Параметры:
// 	ВидДоговора - ПеречислениеСсылка.ВидыДоговоровКонтрагентов - текущее значение, которое требуется проверить
// 	ВидыДоговоров - Структура - закэшированные значения перечисления ВидыДоговоровКонтрагентов
// 	ИмяВидаДоговора - Строка - значение, на равенство которому надо проверить.
// 
// Возвращаемое значение:
// 	Результат - булево.
// 
Функция ПроверитьВидДоговора(ВидДоговора, ВидыДоговоров, ИмяВидаДоговора) Экспорт
	
	Если ВидыДоговоров.Свойство(ИмяВидаДоговора) Тогда
		Результат = ?(ВидДоговора = ВидыДоговоров[ИмяВидаДоговора], Истина, Ложь);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция вычисляет дату от периода действия договора.
//
// Параметры:
//  Договор	 - СправочникСсылка	 - договор контрагента.
//  ВидДаты	 - Строка	 - вид даты.
// 
// Возвращаемое значение:
//  Дата.
//
Функция ПериодДействияПроектаДоговора(Договор, ВидДаты) Экспорт

	ДатаДоговора = Дата(1,1,1);
	
	// ++ЕРП
	Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") 
		ИЛИ (бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды()
			 И ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыАренды")) Тогда
	
		Если ВидДаты = "ДатаОт" Тогда
			ДатаДоговора = Формат(Договор.ДатаНачалаДействия, "ДЛФ=D");
		ИначеЕсли ВидДаты = "ДатаДо" Тогда
			ДатаДоговора = Формат(Договор.ДатаОкончанияДействия, "ДЛФ=D");
		КонецЕсли;
	
	ИначеЕсли ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда

		Если ВидДаты = "ДатаОт" Тогда
			ДатаДоговора = Формат(Договор.ДатаПервогоТранша, "ДЛФ=D");
		ИначеЕсли ВидДаты = "ДатаДо" Тогда
			ДатаДоговора = Формат(Договор.ДатаПоследнегоПлатежа, "ДЛФ=D");
		КонецЕсли;
		
	КонецЕсли;
	// --ЕРП
	
	Возврат ДатаДоговора;
	
КонецФункции

#КонецОбласти
