
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	 
	 Если ПараметрКоманды = Неопределено Тогда
		 Возврат;
	 КонецЕсли;
	 
	 СтруктураОтбор = Новый Структура;
	 СтруктураОтбор.Вставить("Объект", ПараметрКоманды);	 
	 
	 ПараметрыФормы = Новый Структура();
	 ПараметрыФормы.Вставить("Отбор"		    , СтруктураОтбор);
	 ПараметрыФормы.Вставить("ОбъектВизирования", ПараметрКоманды);
	 
	 ОткрытьФорму("Обработка.бит_УстановкаВиз.Форма",
	              ПараметрыФормы,
				  ПараметрыВыполненияКоманды.Источник,
				  ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор,
				  ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

#КонецОбласти