////////////////////////////////////////////////////////////////////////////////
// Выгрузка данных в файлы и загрузка данных из файлов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗагрузкаВыгрузкаExcel

// --------------------------------------------------
// Общие процедуры

// Функция определяет имя дополнительного поля для сохранения информации об уровне строки в дереве.
// 
// Возвращаемое значение::
//  Строка
//
Функция ПолучитьИмяДопПоля_Уровень() Экспорт

	Возврат "Доп_Уровень";	

КонецФункции // ПолучитьИмяДопПоля_Уровень()

#КонецОбласти

#Область РаботаСExcel

// Функция получает лист Excel.
// 
// Параметры:
//  ExcelWorkbook - ComObject.
//  SheetName     - Имя листа.
//  Fail 	      - Булево, по умолчанию Ложь.
// 
// Возвращаемое значение:
//   ComObject, в случае неудачи Неопределено.
// 
Function GetExcelSheet(ExcelWorkbook, SheetName, Fail = False) Export
	
	ExcelSheet = Undefined;
    
    ИмяSheet = ?(ТипЗнч(SheetName) = Тип("Строка"), СокрЛП(SheetName), SheetName);
	
	If NOT ExcelWorkbook = Undefined Then
		
		Try
			
			ExcelSheet = ExcelWorkbook.Sheets(ИмяSheet);
			
		Except
			
			Fail = True;
			
			ТекстСообщения = НСтр("ru='Не удалось открыть лист Excel ""%1"".';en='Unable to open the Excel sheet ""%1"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяSheet);
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		EndTry;
		
	EndIf;
	
	Return ExcelSheet;
	
EndFunction	// GetExcelSheet()

// Функция инициализирует структуру, описывающую положение ячейки.
// 
// Возвращаемое значение:
//  StructPos - Структура.
// 
Function CellPosition(Row, Column) Export
	
	StructPos = New Structure;
	StructPos.Insert("Row",Row);
	StructPos.Insert("Column",Column);
	
	Return StructPos;
	
EndFunction // CellPosition

#КонецОбласти

#Область ПроцедурыИФункцииДляРаботыПодсистемыБит_ИмпортИзExcel

// Функция получает соответствие представлений видов объектов.
// 
// Параметры:
//  Нет.
// 
// Возвращаемое значение:
//  СоотвПредстОбъектов - Массив.
// 
Функция ПредставленияВидовОбъектов() Экспорт
	
	// Формируем соответствие представлений для видов объектов.
	СоотвПредстОбъектов = Новый Соответствие;
	СоотвПредстОбъектов.Вставить(ВРег("Справочник")     , НСтр("ru='справочника';en='handbook’s'"));
	СоотвПредстОбъектов.Вставить(ВРег("Документ")       , НСтр("ru='документа';en='document’s'"));
	СоотвПредстОбъектов.Вставить(ВРег("РегистрСведений"), НСтр("ru='регистра сведений';en='register of information'"));
	
	Возврат СоотвПредстОбъектов;
	
КонецФункции // ПредставленияВидовОбъектов()

// Функция получает массив неразрешимых символов в именах.
// 
// Параметры:
//  Нет.
// 
// Возвращаемое значение:
//  МассивНеРазрешимыхСимволов - Массив.
// 
Функция СимволыНеразрешенныеДляИмен() Экспорт
	
	// Формируем массив неразрешимых символов.
	МассивНеРазрешимыхСимволов = Новый Массив;
	МассивНеРазрешимыхСимволов.Добавить(",");
	МассивНеРазрешимыхСимволов.Добавить(".");
	МассивНеРазрешимыхСимволов.Добавить("-");
	МассивНеРазрешимыхСимволов.Добавить(":");
	МассивНеРазрешимыхСимволов.Добавить(" ");
	МассивНеРазрешимыхСимволов.Добавить("\");
	МассивНеРазрешимыхСимволов.Добавить("/");
	
	Возврат МассивНеРазрешимыхСимволов;
	
КонецФункции // СимволыНеразрешенныеДляИмен()

// Процедура чтения данных из EXCEL файла через COMSafeArray,
// потерпели не удачу - построчно.
// 
// Параметры:
//  ExcelЛист - ComObject.
//  Данные 	  - Структура, Неопределено - Неопределено, если чтение выполняется на клиенте.
// 
// Возвращаемое значение:
//  ТаблицаДанных - ТаблицаЗначений.
// 
Функция ДанныеИзФайлаExcel(ExcelЛист, Данные, НомерНачальнойКолонки, НомерНачальнойСтроки, 
							  МассивНеРазрешимыхСимволов, БыстроеСчитываниеДанных, НомерКонечнойСтроки) Экспорт

	#Если Сервер Тогда
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("НомерСтрокиВФайле", Новый ОписаниеТипов("Число"));
		ТаблицаДанных.Колонки.Добавить("СтрокаОбработана" , Новый ОписаниеТипов("Булево"));
		// Добавим служебные колонки.
		ТаблицаДанных.Колонки.Добавить("Загружено",      Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(3)));
    	ТаблицаДанных.Колонки.Добавить("ОписаниеОшибки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки()));
	#Иначе
		ТаблицаДанных = Новый Массив;
		// Для клиента добавление обязательных колонок происходит в процедуре ЗагрузитьДанныеИзExcelВТаблицыДанных.
	#КонецЕсли
	
	// Загрузим данные.
	СтруктураДоп = ЗагрузитьДанныеИзExcelВТаблицыДанных(ExcelЛист, ТаблицаДанных, НомерНачальнойКолонки, НомерНачальнойСтроки, 
										 МассивНеРазрешимыхСимволов, БыстроеСчитываниеДанных, НомерКонечнойСтроки);	
										 
	СтруктураДоп.Вставить("ТаблицаДанных", ТаблицаДанных);
	
	Возврат СтруктураДоп;
	
КонецФункции // ДанныеИзФайлаExcel()

// Процедура удаляет из строки массив указанных символов.
// 
// Параметры:
//  ИсходнаяСтрока - Строка.
//  МассивСимволов - Массив.
// 
Процедура УдалитьИзСтрокиМассивСимволов(ИсходнаяСтрока, МассивСимволов) Экспорт
	
	// Удалим неразрешимые символы.
	Для Каждого ТекСимвол Из МассивСимволов Цикл
		ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока, ТекСимвол, "");
	КонецЦикла;
	
КонецПроцедуры // УдалитьИзСтрокиМассивСимволов()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// функция добавляет колонку в таблицу данных.
// 
// Параметры
//  ТаблицаДанных - ТаблицаЗначений, в которую необходимо добавить колонку.
//  ИмяКолонки    - Строка.
// 
//  МассивНеРазрешимыхСимволов - Массив.
// 
// Возвращаемое значение:
//  КолонкаДобавлена - Булево.
// 
Функция ДобавитьКолонкуВТаблицуДанных(ТаблицаДанных, ИмяКолонки, МассивНеРазрешимыхСимволов = Неопределено)
	
	Если МассивНеРазрешимыхСимволов = Неопределено Тогда
		МассивНеРазрешимыхСимволов = СимволыНеразрешенныеДляИмен();
	КонецЕсли;
	
    КолонкаДобавлена = Ложь;
	
	// Удалим неразрешимые символы из имени колонки.
	УдалитьИзСтрокиМассивСимволов(ИмяКолонки, МассивНеРазрешимыхСимволов);
	
    ИмяКолонки = ВРег(ИмяКолонки);
    
    // Если имя колонки не заполнено, тогда
    Если НЕ ЗначениеЗаполнено(ИмяКолонки)  Тогда
        Возврат КолонкаДобавлена;
    КонецЕсли;
    
    Попытка
		
		#Если Сервер Тогда
			Если ТаблицаДанных.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
				ТаблицаДанных.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Строка"));
			КонецЕсли;
		#Иначе
			Если ТаблицаДанных.Количество() = 0 Тогда
				СтрПроверка = Новый Структура(ИмяКолонки);
			Иначе	
				СтруктураСтроки = ТаблицаДанных[0];
				ЕстьКолонка = СтруктураСтроки.Свойство(ИмяКолонки);
				Если ЕстьКолонка Тогда
					ТекстСообщения = НСтр("ru='Не удалось добавить колонку %1. Дублирование имени колонки. Загрузка может произойти некорректно.';
										  |en='Unable to add a column of %1. Duplication of the column name. Loading can occur correctly.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяКолонки);
					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
				КонецЕсли;
			КонецЕсли;
			
		#КонецЕсли
		
    Исключение
		ТекстСообщения = НСтр("ru='Не удалось добавить колонку %1';en='Failed to add column %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяКолонки);		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
        Возврат КолонкаДобавлена;
    КонецПопытки;
    
    КолонкаДобавлена = Истина;
    
    Возврат КолонкаДобавлена;
    
КонецФункции // ДобавитьКолонкуВТаблицуДанных()

// Процедура выполняет загрузку данных из Excel в таблицу данных.
// 
// Параметры:
//  ExcelЛист	  - ComObject.
//  ТаблицаДанных - ТаблицаЗначений.
// 
Функция ЗагрузитьДанныеИзExcelВТаблицыДанных(ExcelЛист, ТаблицаДанных, НомерНачальнойКолонки, НомерНачальнойСтроки, 
											   МассивНеРазрешимыхСимволов, БыстроеСчитываниеДанных, НомерКонечнойСтроки)
	
	// Получим количество колонок.
    КоличествоКолонок = ExcelЛист.Cells(1,1).SpecialCells(11).Column;
    
    // Получим количество колонок с учетом номера стартовой колонки.
    КоличествоКолонок = КоличествоКолонок - НомерНачальнойКолонки + 1;
	
	// Получим количество строк.
	Если НомерКонечнойСтроки = 0 Тогда
		КоличествоСтрок = ExcelЛист.Cells(1,1).SpecialCells(11).Row;
	Иначе
		КоличествоСтрок = НомерКонечнойСтроки;
	КонецЕсли;
    
    // Получим количество строк с учетом номера стартовой строки.
    КоличествоСтрок = КоличествоСтрок - НомерНачальнойСтроки;
    
    // Получаем позицию для старта чтения.
    НомерСтрокиДляСтарта  = ?(НомерНачальнойСтроки = 0, 1, НомерНачальнойСтроки);
    НомерКолонкиДляСтарта = НомерНачальнойКолонки;
    
    // Заполним номера строк в файле.
	Для НомСтр = 1 По КоличествоСтрок Цикл
		#Если Сервер Тогда
			НоваяСтрока = ТаблицаДанных.Добавить();
			НоваяСтрока.НомерСтрокиВФайле = НомерСтрокиДляСтарта + НомСтр;
		#Иначе
		    СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("НомерСтрокиВФайле", НомерСтрокиДляСтарта + НомСтр);
			СтруктураСтроки.Вставить("СтрокаОбработана" , Ложь);
			СтруктураСтроки.Вставить("Загружено"		, Ложь);
			СтруктураСтроки.Вставить("ОписаниеОшибки"	, Ложь);
			
			ТаблицаДанных.Добавить(СтруктураСтроки);
		#КонецЕсли
	КонецЦикла;
	
	НастройкиТаблицы = НастройкиТаблицыВФайле();
	НастройкиТаблицы.НомерНачальнойКолонки = НомерНачальнойКолонки;
	НастройкиТаблицы.НомерНачальнойСтроки  = НомерНачальнойСтроки;
	НастройкиТаблицы.КоличествоКолонок 	   = КоличествоКолонок;
	НастройкиТаблицы.КоличествоСтрок 	   = КоличествоСтрок;
	СтруктураДоп = ПолучитьДанныеПереборомСтрок(ExcelЛист, ТаблицаДанных, НастройкиТаблицы, НомерСтрокиДляСтарта, 
		МассивНеРазрешимыхСимволов);
	
	Возврат СтруктураДоп;
	
КонецФункции // ЗагрузитьДанныеИзExcelВТаблицыДанных()

// Процедура получает данные методом перебора строк Excel.
// 
// Возвращаемое значение:
//  Структура - настройки строк и колонок таблицы Excel:
//  		НомерНачальнойКолонки - Число.
//  		НомерНачальнойСтроки  - Число.
//  		КоличествоКолонок     - Число.
//  		КоличествоСтрок 	  - Число.
// 
Функция НастройкиТаблицыВФайле()

	НастройкиТаблицыВФайле = Новый Структура;
	
	НастройкиТаблицыВФайле.Вставить("НомерНачальнойКолонки", 0);
	НастройкиТаблицыВФайле.Вставить("НомерНачальнойСтроки" , 0);
	НастройкиТаблицыВФайле.Вставить("КоличествоКолонок"	   , 0);	
	НастройкиТаблицыВФайле.Вставить("КоличествоСтрок"	   , 0);
		
	Возврат НастройкиТаблицыВФайле;
	
КонецФункции // НастройкиТаблицыВФайле()

// Процедура получает данные методом перебора строк Excel.
// 
// Параметры:
//  ExcelЛист	  		  - ComObject.
//  ТаблицаДанных 		  - ТаблицаЗначений.
//  НастройкиТаблицы 	  - Структура:
//  		НомерНачальнойКолонки - Число.
//  		НомерНачальнойСтроки  - Число.
//  		КоличествоКолонок     - Число.
//  		КоличествоСтрок 	  - Число.
//  НомерСтрокиДляСтарта  	   - Число. 
//  МассивНеРазрешимыхСимволов - Массив.
// 
Функция ПолучитьДанныеПереборомСтрок(ExcelЛист, ТаблицаДанных, НастройкиТаблицы, НомерСтрокиДляСтарта, МассивНеРазрешимыхСимволов)
	
	НомерНачальнойКолонки = НастройкиТаблицы.НомерНачальнойКолонки;
	НомерНачальнойСтроки  = НастройкиТаблицы.НомерНачальнойСтроки;
	КоличествоКолонок 	  = НастройкиТаблицы.КоличествоКолонок;
	КоличествоСтрок 	  = НастройкиТаблицы.КоличествоСтрок;
	
	// Любая дополнительная информация считанная из Excel.
	СтруктураДоп = Новый Структура;
	
	// Информация по колонкам
	НастройкиКолонок = Новый Структура;
	
	// Перебираем колонки таблицы Excel.
	Для НомКолонки = НомерНачальнойКолонки По КоличествоКолонок + 1 Цикл
		
		НастройкаКолонки = Новый Структура;
		
		// Получаем имя колонки.
		Ячейка = ExcelЛист.Cells(НомерНачальнойСтроки, НомКолонки);
		Попытка
			ИмяЯчейки = Ячейка.Name.Name;
		Исключение
			ИмяЯчейки = "";
		КонецПопытки;
		
		Если Найти(ИмяЯчейки, "CellName.") = 0 Тогда
			// В старом формате файлов шаблонов имя колонки хранилось как значение ячейки.
			ИмяКолонки = СокрЛП(Ячейка.Value);
		Иначе
			// В новом формате файлов шаблонов в ячейках указывается синоним реквизита, и его имя помещаем в имя ячейки.
			ИмяКолонки = СтрЗаменить(ИмяЯчейки, "CellName.", "");
		КонецЕсли;
		
		ПредставлениеКолонки = ИмяКолонки;
		
		// Добавим колонку в таблицу данных.
		КолонкаДобавлена = ДобавитьКолонкуВТаблицуДанных(ТаблицаДанных, ИмяКолонки, МассивНеРазрешимыхСимволов);
		Если Не КолонкаДобавлена Тогда
			// Колонку не удалось добавить.
			Продолжить;
		КонецЕсли;
		
		// Создаем массив, для записи данных текущей колонки.
		МассивДанных = Новый Массив;
		
		// Перебираем строки таблицы Excel.
		Для НомСтроки = 1 По КоличествоСтрок Цикл			
			// Записываем текущее значение.
			МассивДанных.Добавить(СокрЛП(ExcelЛист.Cells(НомерСтрокиДляСтарта + НомСтроки, НомКолонки).Value));						
		КонецЦикла;
		
		// Если данных есть, тогда
		Если МассивДанных.Количество() <> 0 Тогда
			// Загружаем значения текущей колонки.
			#Если Сервер Тогда
				ТаблицаДанных.ЗагрузитьКолонку(МассивДанных, ИмяКолонки);
			#Иначе
				КолСтрок = Мин(ТаблицаДанных.Количество(), МассивДанных.Количество());
				Для Ном = 0 По КолСтрок-1 Цикл
					ТаблицаДанных[Ном].Вставить(ИмяКолонки, МассивДанных[Ном]);
				КонецЦикла;
			#КонецЕсли
		КонецЕсли;
		
		Попытка
			ИмяСписка = ExcelЛист.Cells(НомерСтрокиДляСтарта+1, НомКолонки).Validation.Formula1;
			ИмяСписка = СтрЗаменить(ИмяСписка, "=List.", "");
		Исключение
			ИмяСписка = "";
		КонецПопытки;
		
		НастройкаКолонки.Вставить("ИмяСписка", ИмяСписка);
		
		НастройкиКолонок.Вставить(ИмяКолонки, НастройкаКолонки);
		
	КонецЦикла; // Для НомКолонки = НомерКолонкиДляСтарта По КоличествоКолонок Цикл.
	
	СтруктураДоп.Вставить("НастройкиКолонок", НастройкиКолонок);
	
	Возврат СтруктураДоп;
	
КонецФункции // ПолучитьДанныеПереборомСтрок()

#КонецОбласти
